<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>Bo&icirc;te de dialogue Ajouter un domaine</title>
</head>
<body style="background-color: rgb(255, 255, 255);">
<h1>Bo&icirc;te de dialogue Ajouter un domaine</h1>
<p>Utilisez la bo&icirc;te de dialogue Ajouter un domaine pour s&eacute;lectionner le nom du domaine et les mots de passe des certificats source et cible.
</p>
<ol type="1" start="1">
  <a name="step1"> </a>
  <li>Cliquez sur le menu d&eacute;roulant Domaine source pour s&eacute;lectionner le domaine qui contient les certificats de s&eacute;curit&eacute; &agrave; migrer.</li>
  <a name="step2"> </a>
  <li>Dans le panneau Mots de passe, saisissez les mots de passe demand&eacute;s par le syst&egrave;me. Selon le type d'installation source et cible, deux ou trois mots de passe peuvent &ecirc;tre n&eacute;cessaires&nbsp;:
    <ul>
      <li>Saisissez les mots de passe pour les fichiers du certificat NSS, utilis&eacute;s pour les bases de donn&eacute;es de confiance NSS, dans les champs NSS source et/ou NSS cible.</li>
      <li>Saisissez le mot de passe de la base de donn&eacute;es de cl&eacute;s utilisateur, utilis&eacute;e pour le fichier JSSE <tt>keystore.jks</tt> qui contient les certificats de paire de cl&eacute;s utilisateur, dans le champ Bases de donn&eacute;es de cl&eacute;s utilisateur.</li>
      <li>Saisissez le mot de passe pour la base de donn&eacute;es de l'autorit&eacute; de certification, utilis&eacute;e pour le fichier JSSE <tt>cacerts.jks</tt> qui contient les certificats de l'autorit&eacute; de certification, dans le champ Base de donn&eacute;es d'autorit&eacute; de certification. </li>
    </ul>
  </li>
  <a name="step3"> </a>
  <li>Appuyez ensuite sur OK. L'<a
 href="./xferCertificates.html">&eacute;cran Transf&eacute;rer les certificats de s&eacute;curit&eacute;</a> s'affiche, indiquant le domaine ajout&eacute; au panneau Domaines contenant des certificats &agrave; transf&eacute;rer.</li>
</ol>
<hr>
<a href="copyright.html" target="main">Notices l&eacute;gales</a>
</body>
</html>
