<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <link rel="stylesheet" href="adminhelp.css" type="text/css">
  <title>Copyright</title>
</head>
<body>
<!-- help content --><a name="wp1022127"> </a>
<h2 class="pHeading2">Copyright
</h2>
<a name="wp1022131"> </a>
<p class="pParagraph">Sun Microsystems, Inc.<br>
4150 Network Circle<br>
Santa Clara, CA 95054 &Eacute;tats-Unis.
</p>
<a name="wp1022132"> </a>
<p class="pParagraph">&nbsp;
</p>
<a name="wp1022134"> </a>
<p class="pParagraph">Copyright &copy; 2006 Sun Microsystems, Inc. Tous droits r&eacute;serv&eacute;s.
</p>
<a name="wp1022135"> </a>
<p class="pParagraph">Sun Microsystems, Inc. d&eacute;tient les droits de propri&eacute;t&eacute; intellectuelle de la technologie utilis&eacute;e par le produit d&eacute;crit dans le pr&eacute;sent document. En particulier, et sans limitation, ces droits de propri&eacute;t&eacute; intellectuelle peuvent inclure des brevets am&eacute;ricains r&eacute;pertori&eacute;s &agrave; l'adresse http://www.sun.com/patents et des brevets suppl&eacute;mentaires ou d&eacute;p&ocirc;ts de brevets en cours d'homologation aux &Eacute;tats-Unis et dans d'autres pays. </p>
<a name="wp1022136"> </a>
<p class="pParagraph">Non-publi&eacute; - droits r&eacute;serv&eacute;s selon les lois de copyright des &Eacute;tats-Unis. </p>
<a name="wp1022137"> </a>
<p class="pParagraph">CE PRODUIT CONTIENT DES INFORMATIONS CONFIDENTIELLES ET DES SECRETS COMMERCIAUX DE SUN MICROSYSTEMS, INC. L'UTILISATION, LA DIVULGATION OU LA REPRODUCTION SONT INTERDITES SANS L'AUTORISATION &Eacute;CRITE EXPRESSE PR&Eacute;ALABLE DE SUN MICROSYSTEMS, INC. </p>
<a name="wp1022138"> </a>
<p class="pParagraph">Droits du gouvernement am&eacute;ricain - Usage commercial. Les utilisateurs gouvernementaux sont soumis au contrat de licence standard de Sun Microsystems, Inc., ainsi qu'aux dispositions FAR (Federal Acquisition Regulation) en vigueur et leurs suppl&eacute;ments. </p>
<a name="wp1022139"> </a>
<p class="pParagraph">Utilisation soumise aux termes de la licence. </p>
<a name="wp1022140"> </a>
<p class="pParagraph">La distribution peut comporter des &eacute;l&eacute;ments d&eacute;velopp&eacute;s par des tiers. </p>
<a name="wp1022141"> </a>
<p class="pParagraph">Sun, Sun Microsystems, le logo Sun, Java, Jini et le logo Java Coffee Cup sont des marques commerciales ou des marques d&eacute;pos&eacute;es de Sun Microsystems, Inc. aux &Eacute;tats-Unis et dans d'autres pays. </p>
<a name="wp1022142"> </a>
<p class="pParagraph">UNIX est une marque d&eacute;pos&eacute;e aux &Eacute;tats-Unis et dans d'autres pays, exclusivement conc&eacute;d&eacute;e en licence par X/Open Company, Ltd.
</p>
<a name="wp1022143"> </a>
<p class="pParagraph">Ce produit est couvert par et soumis &agrave; la l&eacute;gislation am&eacute;ricaine relative au contr&ocirc;le sur les exportations et, le cas &eacute;ch&eacute;ant, aux lois sur les importations ou exportations dans d'autres pays. Il est strictement interdit d'employer ce produit conjointement &agrave; des missiles ou armes biologiques, chimiques, nucl&eacute;aires ou de marine nucl&eacute;aire, directement ou indirectement. Il est strictement interdit d'effectuer des exportations et r&eacute;exportations vers des pays soumis &agrave; l'embargo am&eacute;ricain ou vers des entit&eacute;s identifi&eacute;es sur les listes noires des exportations am&eacute;ricaines, notamment les individus non autoris&eacute;s et les listes nationales d&eacute;sign&eacute;es.
</p>
<a name="wp1022144"> </a>
<p class="pParagraph">_____________________________________
</p>
<a name="wp1022145"> </a>
<p class="pParagraph">Copyright &copy; 2006 Sun Microsystems, Inc., 4150 Network Circle, Santa Clara, California 95054, &Eacute;tats-Unis. Tous droits r&eacute;serv&eacute;s.
</p>
<a name="wp1022146"> </a>
<p class="pParagraph">Sun Microsystems, Inc. d&eacute;tient les droits de propri&eacute;t&eacute; intellectuels relatifs &agrave; la technologie incorpor&eacute;e dans le produit qui est d&eacute;crit dans ce document. En particulier, et ce sans limitation, ces droits de propri&eacute;t&eacute; intellectuelle peuvent inclure un ou plus des brevets am&eacute;ricains list&eacute;s &agrave; l&rsquo;adresse http://www.sun.com/patents et un ou les brevets suppl&eacute;mentaires ou les applications de brevet en attente aux &Eacute;tats - Unis et dans les autres pays. </p>
<a name="wp1022147"> </a>
<p class="pParagraph">Non publi&eacute; - droits r&eacute;serv&eacute;s selon la l&eacute;gislation des &Eacute;tats-Unis sur le droit d'auteur.
</p>
<a name="wp1022148"> </a>
<p class="pParagraph">CE PRODUIT CONTIENT DES INFORMATIONS CONFIDENTIELLES ET DES SECRETS COMMERCIAUX DE SUN MICROSYSTEMS, INC. SON UTILISATION, SA DIVULGATION ET SA REPRODUCTION SONT INTERDITES SANS L&rsquo;AUTORISATION EXPRESSE, ECRITE ET PREALABLE DE SUN MICROSYSTEMS, INC. </p>
<a name="wp1022149"> </a>
<p class="pParagraph">L&rsquo;utilisation est soumise aux termes de la Licence. </p>
<a name="wp1022150"> </a>
<p class="pParagraph">Cette distribution peut comprendre des composants d&eacute;velopp&eacute;s par des tierces parties. </p>
<a name="wp1022151"> </a>
<p class="pParagraph">Sun, Sun Microsystems, le logo Sun, Java, Jini et le logo Java Coffee Cup sont des marques commerciales ou des marques d&eacute;pos&eacute;es de Sun Microsystems, Inc. aux &Eacute;tats-Unis et dans d&rsquo;autres pays.
</p>
<a name="wp1022152"> </a>
<p class="pParagraph">UNIX est une marque d&eacute;pos&eacute;e aux &Eacute;tats-Unis et dans d&rsquo;autres pays et licenci&eacute;e exclusivement par X/Open Company, Ltd.
</p>
<a name="wp1022153"> </a>
<p class="pParagraph">Ce produit est soumis &agrave; la l&eacute;gislation am&eacute;ricaine en mati&egrave;re de contr&ocirc;le des exportations et peut &ecirc;tre soumis &agrave; la r&egrave;glementation en vigueur dans d&rsquo;autres pays dans le domaine des exportations et importations. Les utilisations, ou utilisateurs finaux, pour des armes nucl&eacute;aires, des missiles, des armes biologiques et chimiques ou du nucl&eacute;aire maritime, directement ou indirectement, sont strictement interdites. Les exportations ou r&eacute;exportations vers les pays sous embargo am&eacute;ricain, ou vers des entit&eacute;s figurant sur les listes d&rsquo;exclusion d&rsquo;exportation am&eacute;ricaines, y compris, mais de mani&egrave;re non exhaustive, la liste de personnes qui font objet d&rsquo;un ordre de ne pas participer, d&rsquo;une fa&ccedil;on directe ou indirecte, aux exportations des produits ou des services qui sont r&eacute;gis par la l&eacute;gislation am&eacute;ricaine en mati&egrave;re de contr&ocirc;le des exportations et la liste de ressortissants sp&eacute;cifiquement d&eacute;sign&eacute;s, sont rigoureusement interdites.
</p>
<a name="wp1022129"> </a>
<p class="pParagraph"></p>
<a name="wp1022128"> </a>
<p class="pParagraph"></p>
<!-- end help content -->
<hr><a href="copyright.html" target="main">Notices l&eacute;gales</a>
</body>
</html>
