<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <title>Outil de mise &agrave; niveau&nbsp;: pr&eacute;sentation</title>
</head>
<body style="background-color: rgb(255, 255, 255);">
<h1>Outil de mise &agrave; niveau&nbsp;: pr&eacute;sentation</h1>
<p>Utilisez l'outil de mise &agrave; niveau pour transf&eacute;rer les informations de configuration &agrave; partir d'une installation de serveur d'application 8.x ou 9 vers une installation de serveur d'application&nbsp;9.1. Les informations transf&eacute;r&eacute;es incluent des donn&eacute;es sur les applications d&eacute;ploy&eacute;es, le domaine du fichier, les certificats de s&eacute;curit&eacute; et d'autres ressources et param&egrave;tres de configuration du serveur.</p>
<p>Le tableau suivant pr&eacute;sente les mises &agrave; niveau du serveur d'application prises en charge, o&ugrave; PE signifie Platform Edition et EE signifie Enterprise Edition.</p>
<table style="text-align: left; width: 435px; height: 662px;"
 summary="Table showing supported
 Application Server upgrades"
 border="1" cellpadding="2" cellspacing="2">
  <tbody>
    <tr>
      <td style="vertical-align: top;">Installation source<br>
      </td>
      <td style="vertical-align: top; text-align: center;">Installation cible (9.1)<br>
      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">7.0 PE<br>
      </td>
      <td style="vertical-align: top; text-align: center;">Non pris en charge<br>
      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">7.1 SE<br>
      </td>
      <td style="vertical-align: top; text-align: center;">Non pris en charge </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">7.1 EE<br>
      </td>
      <td style="vertical-align: top; text-align: center;">Non pris en charge</td>
    </tr>
    <tr>
      <td style="vertical-align: top;">8.0 PE<br>
      </td>
      <td style="vertical-align: top; text-align: center;">Pris en charge (la mise &agrave; niveau du domaine 8.0 PE vers le domaine d&eacute;veloppeur 9.1 est prise en charge)<br>
      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">8.1 PE<br>
      </td>
      <td style="vertical-align: top; text-align: center;">Pris en charge (la mise &agrave; niveau du domaine 8.1 PE vers le domaine d&eacute;veloppeur 9.1 est prise en charge)<br>
      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">8.1 EE<br>
      </td>
      <td style="vertical-align: top; text-align: center;">Pris en charge (la mise &agrave; niveau du domaine 8.1 EE vers le domaine 9.1 Enterprise)<br>
      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">8.2 PE<br>
      </td>
      <td style="vertical-align: top;">Pris en charge (la mise &agrave; niveau du domaine 8.2 PE vers le domaine d&eacute;veloppeur 9.1 est prise en charge)<br>
      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">8.2 EE<br>
      </td>
      <td style="vertical-align: top;">Pris en charge (la mise &agrave; niveau du domaine 8.2 EE vers le domaine 9.1 Enterprise est prise en charge) </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">9.0 PE<br>
      </td>
      <td style="vertical-align: top;">Pris en charge (la mise &agrave; niveau du domaine 9.0 PE vers le domaine d&eacute;veloppeur 9.1 est prise en charge)<br>
      </td>
    </tr>
  </tbody>
</table>
<p>L'outil d&eacute;tecte automatiquement la version de l'installation de serveur source sp&eacute;cifi&eacute;e.</p>
<blockquote>
  <p><b>Remarque&nbsp;: </b><em>avant de lancer le processus de mise &agrave; niveau, assurez-vous que le serveur source (le serveur &agrave; partir duquel vous effectuez la mise &agrave; niveau) et le serveur cible (le serveur auquel vous effectuez la mise &agrave; niveau) sont arr&ecirc;t&eacute;s.</em></p>
</blockquote>
<p>
</p>
<h2 class="sol">Terminologie de mise &agrave; niveau</h2>
<p>Vous trouverez ci-dessous une liste des termes importants associ&eacute;s au processus de mise &agrave; niveau :</p>
<ul>
  <li>
    <p>Serveur source&nbsp;: l'installation &agrave; partir de laquelle vous effectuez la mise &agrave; niveau vers la nouvelle version.</p>
  </li>
  <li>
    <p>Serveur cible&nbsp;: l'installation vers laquelle vous effectuez la mise &agrave; niveau.</p>
  </li>
  <li>
    <p>Racine de domaines&nbsp;: r&eacute;pertoire o&ugrave; les domaines sont cr&eacute;&eacute;s. Ce r&eacute;pertoire est, par d&eacute;faut, l'emplacement sp&eacute;cifi&eacute; comme <tt>AS_DEF_DOMAINS_PATH</tt>
dans le r&eacute;pertoire de domaine <tt>asenv.conf</tt></p>
  </li>
  <li>ou <var>domain-dir</var>&nbsp;: r&eacute;pertoire (dans la racine de domaines) correspondant &agrave; un domaine sp&eacute;cifique. Toutes les donn&eacute;es de configuration et autres relatives au domaine sont contenues dans ce r&eacute;pertoire.</li>
  <li>
    <p>Racine de l'installation&nbsp;: r&eacute;pertoire vers lequel le serveur d'application est install&eacute;.</p>
  </li>
</ul>
<p>
Si la case Mettre &agrave; niveau a &eacute;t&eacute; coch&eacute;e lors du processus d'installation du serveur d'application, l'<a href="./upgradeWizard.html">&eacute;cran Assistant de mise &agrave; niveau</a> s'affiche automatiquement une fois l'installation termin&eacute;e. Le <a href="upgradeWizard.html">processus de mise &agrave; niveau</a> d&eacute;marre.</p>
<a href="copyright.html" target="main">Notices l&eacute;gales</a>
</body>
</html>
