<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-ejbgeneral" name="task-ejbgeneral"></a></p>

<h4><a id="sthref2" name="sthref2"></a><a id="sthref3" name="sthref3"></a>&#37197;&#32622; EJB &#35774;&#32622;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#23548;&#33322;&#26641;&#20013;&#65292;&#36873;&#25321;&ldquo;&#37197;&#32622;&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#36873;&#25321;&ldquo;EJB &#23481;&#22120;&rdquo;&#33410;&#28857;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;Enterprise JavaBeans (EJB)&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#20250;&#35805;&#23384;&#20648;&#20301;&#32622;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#20250;&#35805;&#23384;&#20648;&#20301;&#32622;&#30340;&#26032;&#20540;&#12290;</p>
<p>&#27492;&#23383;&#27573;&#25351;&#23450;&#22312;&#25991;&#20214;&#31995;&#32479;&#19978;&#23384;&#20648;&#38045;&#21270;&#26377;&#29366;&#24577;&#20250;&#35805; Bean &#21644;&#25345;&#20037;&#24615; SFSB &#26816;&#26597;&#28857;&#29366;&#24577;&#30340;&#30446;&#24405;&#12290;&#40664;&#35748;&#20540;&#20026; <code>${com.sun.aas.instanceRoot}/session-store</code>&#12290;</p>
<p>&#38045;&#21270; Bean &#26159;&#24050;&#23558;&#20854;&#29366;&#24577;&#20889;&#20837;&#25991;&#20214;&#31995;&#32479;&#19978;&#30340;&#25991;&#20214;&#20013;&#30340;&#26377;&#29366;&#24577;&#20250;&#35805; Bean&#12290;&#38045;&#21270; Bean &#36890;&#24120;&#24050;&#31354;&#38386;&#19968;&#27573;&#26102;&#38388;&#65292;&#23458;&#25143;&#26426;&#24403;&#21069;&#20063;&#26410;&#23545;&#20854;&#36827;&#34892;&#35775;&#38382;&#12290;&#21516;&#26679;&#65292;&#25345;&#20037;&#24615; SFSB &#26816;&#26597;&#28857;&#29366;&#24577;&#26159;&#24050;&#23558;&#20854;&#29366;&#24577;&#20889;&#20837;&#25991;&#20214;&#31995;&#32479;&#19978;&#30340;&#25991;&#20214;&#20013;&#30340;&#21508;&#20010; SFSB&#12290;</p>
<p>&#20165;&#24403;&#31105;&#29992; EJB &#23481;&#22120;&#21487;&#29992;&#24615;&#26102;&#65292;&#27492;&#35774;&#32622;&#25165;&#36866;&#29992;&#20110; SFSB &#26816;&#26597;&#28857;&#29366;&#24577;&#12290;&#35201;&#31105;&#29992;&#21487;&#29992;&#24615;&#65292;&#35831;&#21442;&#38405;<a href="../../../ejb/en/help/task-ejbcontaineravailability.html">&#20026; EJB &#23481;&#22120;&#37197;&#32622;&#21487;&#29992;&#24615;&#35774;&#32622;</a>&#12290;</p>
</li>
<li>
<p>&#36873;&#25321;&ldquo;&#36873;&#39033; B&rdquo;&#25110;&ldquo;&#36873;&#39033; C&rdquo;&#21333;&#36873;&#25353;&#38062;&#20197;&#35774;&#32622;&ldquo;&#25552;&#20132;&#36873;&#39033;&rdquo;&#12290;</p>
<p>&ldquo;&#25552;&#20132;&#36873;&#39033;&rdquo;&#25351;&#23450;&#23481;&#22120;&#39640;&#36895;&#32531;&#23384;&#20107;&#21153;&#22788;&#29702;&#20043;&#38388;&#30340;&#38045;&#21270; Bean &#23454;&#20363;&#30340;&#26041;&#24335;&#12290;</p>
<ul>
<li>
<p>&#22914;&#26524;&#36873;&#25321;&ldquo;&#36873;&#39033; B&rdquo;(&#40664;&#35748;&#36873;&#39033;)&#65292;&#21017;&#23481;&#22120;&#23558;&#39640;&#36895;&#32531;&#23384;&#20107;&#21153;&#22788;&#29702;&#20043;&#38388;&#30340;&#23601;&#32490;&#23454;&#20363;&#12290;</p>
</li>
<li>
<p>&#22914;&#26524;&#36873;&#25321;&ldquo;&#36873;&#39033; C&rdquo;&#65292;&#21017;&#23481;&#22120;&#19981;&#20250;&#39640;&#36895;&#32531;&#23384;&#20107;&#21153;&#22788;&#29702;&#20043;&#38388;&#30340;&#23601;&#32490;&#23454;&#20363;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#22312;&ldquo;&#21021;&#22987;&#21644;&#26368;&#23567;&#27744;&#22823;&#23567;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#35201;&#22312;&#27744;&#20013;&#32500;&#25252;&#30340; Bean &#30340;&#26368;&#23567;&#25968;&#37327;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 0&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26368;&#22823;&#27744;&#22823;&#23567;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#23481;&#22120;&#21487;&#20197;&#21516;&#26102;&#22312;&#27744;&#20013;&#32500;&#25252;&#30340; Bean &#30340;&#26368;&#22823;&#25968;&#37327;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 32&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#27744;&#35843;&#25972;&#22823;&#23567;&#25968;&#37327;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#24403; Bean &#22788;&#20110;&#31354;&#38386;&#29366;&#24577;&#30340;&#26102;&#38388;&#36229;&#36807;&ldquo;&#27744;&#31354;&#38386;&#36229;&#26102;&rdquo;&#23383;&#27573;&#20013;&#25351;&#23450;&#30340;&#26102;&#38388;&#26102;&#65292;&#35201;&#20174;&#27744;&#20013;&#21024;&#38500;&#30340; Bean &#30340;&#25968;&#37327;&#12290;</p>
<p>&#35813;&#20540;&#24517;&#39035;&#33267;&#23569;&#20026; 0&#65292;&#24182;&#23567;&#20110;&ldquo;&#26368;&#22823;&#27744;&#22823;&#23567;&rdquo;&#20540;&#12290;&#40664;&#35748;&#20540;&#20026; 8&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#27744;&#31354;&#38386;&#36229;&#26102;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#22312;&#23558;&#27744;&#20013;&#30340; Bean &#20174;&#27744;&#20013;&#21024;&#38500;&#20043;&#21069;&#65292;Bean &#21487;&#20197;&#20445;&#25345;&#31354;&#38386;&#29366;&#24577;&#30340;&#26102;&#38388; (&#31186;)&#12290;</p>
<p>&#36229;&#36807;&#27492;&#26102;&#38388;&#21518;&#65292;Bean &#23558;&#34987;&#38144;&#27585;&#12290;&#22914;&#26524;&#20540;&#20026; 0&#65292;&#21017;&#34920;&#31034; Bean &#21487;&#20197;&#26080;&#38480;&#26399;&#20445;&#25345;&#31354;&#38386;&#29366;&#24577;&#12290;&#40664;&#35748;&#20540;&#20026; 600&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26368;&#22823;&#39640;&#36895;&#32531;&#23384;&#22823;&#23567;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#35201;&#20445;&#30041;&#22312;&#39640;&#36895;&#32531;&#23384;&#20013;&#30340; Bean &#30340;&#26368;&#22823;&#25968;&#37327;&#12290;</p>
<p>&#22686;&#21152;&#35201;&#39640;&#36895;&#32531;&#23384;&#30340; Bean &#30340;&#26368;&#22823;&#25968;&#37327;&#21487;&#20197;&#20813;&#38500;&#21019;&#24314;&#21644;&#21024;&#38500; Bean &#30340;&#31995;&#32479;&#24320;&#38144;&#12290;&#20294;&#26159;&#65292;&#22914;&#26524;&#22686;&#22823;&#39640;&#36895;&#32531;&#23384;&#65292;&#26381;&#21153;&#22120;&#23558;&#28040;&#32791;&#26356;&#22810;&#20869;&#23384;&#21644;&#36164;&#28304;&#12290;&#35831;&#30830;&#20445;&#25805;&#20316;&#29615;&#22659;&#36275;&#22815;&#29992;&#20110;&#39640;&#36895;&#32531;&#23384;&#35774;&#32622;&#12290;&#22914;&#26524;&#20540;&#20026; 0&#65292;&#21017;&#34920;&#31034;&#39640;&#36895;&#32531;&#23384;&#26080;&#30028;&#38480;&#12290;&#40664;&#35748;&#20540;&#20026; 512&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#39640;&#36895;&#32531;&#23384;&#22823;&#23567;&#35843;&#25972;&#25968;&#37327;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#24403;&#39640;&#36895;&#32531;&#23384;&#24050;&#28385;&#26102;&#65292;&#35201;&#38045;&#21270;&#30340; Bean &#30340;&#25968;&#37327;&#12290;</p>
<p>&#36798;&#21040;&#39640;&#36895;&#32531;&#23384;&#30340; Bean &#30340;&#26368;&#22823;&#25968;&#37327;&#20043;&#21518;&#65292;&#23481;&#22120;&#23558;&#20174;&#22791;&#20221;&#23384;&#20648;&#20013;&#21024;&#38500;&#19968;&#20123;&#38045;&#21270; Bean&#12290;&#35813;&#20540;&#36824;&#25351;&#23450;&#24403;&#27744;&#20013;&#27809;&#26377;&#21487;&#29992;&#30340; Bean &#26102;&#65292;&#22914;&#26524;&#25910;&#21040;&#35831;&#27714;&#23558;&#35201;&#21019;&#24314;&#30340; Bean &#30340;&#25968;&#37327;&#12290;&#35813;&#20540;&#24517;&#39035;&#22823;&#20110; 1&#65292;&#24182;&#23567;&#20110;&ldquo;&#26368;&#22823;&#39640;&#36895;&#32531;&#23384;&#22823;&#23567;&rdquo;&#20540;&#12290;&#40664;&#35748;&#20540;&#20026; 32&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#21024;&#38500;&#36229;&#26102;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#23558;&#38045;&#21270; Bean &#20174;&#20250;&#35805;&#23384;&#20648;&#20013;&#21024;&#38500;&#20043;&#21069;&#32463;&#36807;&#30340;&#31186;&#25968;&#12290;</p>
<p>&#22914;&#26524;&#20540;&#20026; 0&#65292;&#21017;&#25351;&#23450;&#23481;&#22120;&#19981;&#33258;&#21160;&#21024;&#38500;&#38750;&#27963;&#21160; Bean&#12290;&#22914;&#26524;&ldquo;&#21024;&#38500;&#36229;&#26102;&rdquo;&#20540;&#23567;&#20110;&#25110;&#31561;&#20110;&ldquo;&#39640;&#36895;&#32531;&#23384;&#31354;&#38386;&#36229;&#26102;&rdquo;&#20540;&#65292;&#21017; Bean &#23558;&#22312;&#19981;&#38045;&#21270;&#30340;&#24773;&#20917;&#19979;&#31435;&#21363;&#21024;&#38500;&#12290;&#40664;&#35748;&#20540;&#20026; 5400&#12290;</p>
</li>
<li>
<p>&#20174;&ldquo;&#21024;&#38500;&#36873;&#25321;&#31574;&#30053;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&#23481;&#22120;&#29992;&#20110;&#23558;&#26377;&#29366;&#24577;&#20250;&#35805; Bean &#20174;&#39640;&#36895;&#32531;&#23384;&#20013;&#21024;&#38500;&#30340;&#31574;&#30053;&#12290;</p>
<p>&#36873;&#39033;&#22914;&#19979;&#65306;</p>
<dl>
<dt>&#26368;&#36817;&#19981;&#20351;&#29992; (NRU)</dt>
<dd>
<p>(&#40664;&#35748;&#36873;&#39033;) &#21024;&#38500;&#26368;&#36817;&#19981;&#20351;&#29992;&#30340; Bean&#12290;</p>
</dd>
<dt>&#20808;&#36827;&#20808;&#20986; (FIFO)</dt>
<dd>
<p>&#21024;&#38500;&#39640;&#36895;&#32531;&#23384;&#20013;&#26368;&#26087;&#30340; Bean&#12290;</p>
</dd>
<dt>&#26368;&#36817;&#26368;&#23569;&#20351;&#29992; (LRU)</dt>
<dd>
<p>&#21024;&#38500;&#26368;&#36817;&#26368;&#23569;&#35775;&#38382;&#30340; Bean&#12290;</p>
</dd>
</dl>
</li>
<li>
<p>&#22312;&ldquo;&#39640;&#36895;&#32531;&#23384;&#31354;&#38386;&#36229;&#26102;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837; Bean &#21487;&#20197;&#22312;&#39640;&#36895;&#32531;&#23384;&#20013;&#20445;&#25345;&#31354;&#38386;&#29366;&#24577;&#30340;&#26368;&#22823;&#31186;&#25968;&#12290;</p>
<p>&#36229;&#36807;&#27492;&#26102;&#38388;&#21518;&#65292;&#23481;&#22120;&#21487;&#20197;&#38045;&#21270;&#27492; Bean&#12290;&#22914;&#26524;&#20540;&#20026; 0&#65292;&#21017;&#25351;&#23450; Bean &#27704;&#19981;&#25104;&#20026;&#38045;&#21270;&#30340;&#20505;&#36873;&#12290;&#40664;&#35748;&#20540;&#20026; 600&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#20854;&#20182;&#23646;&#24615;&rdquo;&#37096;&#20998;&#20013;&#65292;&#25351;&#23450;&#20854;&#20182;&#23646;&#24615;&#12290;</p>
<p>&#26377;&#20851;&#21487;&#29992;&#23646;&#24615;&#30340;&#35828;&#26126;&#65292;&#35831;&#21442;&#38405;<a href="ref-ejbgeneralproperties.html">&#29305;&#23450;&#20110; EJB &#23481;&#22120;&#30340;&#23646;&#24615;</a>&#12290;</p>
<ul>
<li>
<p>&#35201;&#28155;&#21152;&#23646;&#24615;&#65292;&#35831;&#21333;&#20987;&ldquo;&#28155;&#21152;&#23646;&#24615;&rdquo;&#25353;&#38062;&#12290;&#22312;&#26174;&#31034;&#30340;&#31354;&#30333;&#34892;&#20013;&#65292;&#22312;&ldquo;&#21517;&#31216;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#23646;&#24615;&#21517;&#31216;&#65292;&#22312;&ldquo;&#20540;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#23646;&#24615;&#20540;&#12290;</p>
</li>
<li>
<p>&#35201;&#20462;&#25913;&#23646;&#24615;&#65292;&#35831;&#32534;&#36753;&#35813;&#23646;&#24615;&#30340;&ldquo;&#20540;&rdquo;&#23383;&#27573;&#12290;</p>
</li>
<li>
<p>&#35201;&#21024;&#38500;&#23646;&#24615;&#65292;&#35831;&#36873;&#20013;&#20301;&#20110;&#24744;&#35201;&#21024;&#38500;&#23646;&#24615;&#30340;&ldquo;&#21517;&#31216;&rdquo;&#23383;&#27573;&#24038;&#36793;&#30340;&#22797;&#36873;&#26694;&#65292;&#28982;&#21518;&#21333;&#20987;&ldquo;&#21024;&#38500;&#23646;&#24615;&rdquo;&#25353;&#38062;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#21333;&#20987;&ldquo;&#20445;&#23384;&rdquo;&#12290;</p>

<hr>
<p><b>&#25552;&#31034;:</b></p>
&#35201;&#36820;&#22238;&#21040;&#40664;&#35748;&#35774;&#32622;&#65292;&#35831;&#21333;&#20987;&ldquo;&#21152;&#36733;&#40664;&#35748;&#20540;&rdquo;&#25353;&#38062;&#65292;&#28982;&#21518;&#21333;&#20987;&ldquo;&#20445;&#23384;&rdquo;&#12290;<br />
<hr>

</li>
<li>
<p>&#37325;&#26032;&#21551;&#21160; GlassFish Server&#12290;</p>
</li>
</ol>
<a id="sthref4" name="sthref4"></a>
<h5>&#21478;&#35831;&#21442;&#38405;</h5>
<ul>
<li>
<p><a href="../../../ejb/en/help/task-ejbmdbpoolsettings.html">&#37197;&#32622; MDB &#27744;&#35774;&#32622;</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbtimerservice.html">&#37197;&#32622; EJB &#35745;&#26102;&#22120;&#26381;&#21153;</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbcontaineravailability.html">&#20026; EJB &#23481;&#22120;&#37197;&#32622;&#21487;&#29992;&#24615;&#35774;&#32622;</a></p>
</li>
</ul>




<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
