<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-executorservicenew" name="ref-executorservicenew"></a></p>

<h4>Nuovo servizio esecutore gestito<a id="sthref24" name="sthref24"></a></h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilizzare la pagina Nuovo servizio esecutore gestito per configurare una risorsa di servizio esecutore gestito.</p>
<p>La pagina Nuovo servizio esecutore gestito contiene le opzioni riportate di seguito.</p>
<dl>
<dt>Nome JNDI</dt>
<dd>
<p>Il nome JNDI univoco che identifica la risorsa. Per convenzione, il nome inizia con un indicatore del tipo di risorsa e una barra, ad esempio concurrent/, jdbc/ o jms/.</p>
</dd>
<dt>Informazioni contesto</dt>
<dd>
<p>I contesti da propagare ai thread: Classloader, JNDI, Security o WorkArea. La propagazione del contesto pu&ograve; essere abilitata o disabilitata. Se &egrave; abilitata, i contesti selezionati vengono propagati. Se &egrave; disabilitata, nessuno dei contesti viene propagato, anche se sono selezionati. Il valore predefinito &egrave; Abilitato, con tutti i quattro contesti selezionati.</p>
</dd>
<dt>Stato</dt>
<dd>
<p>Lo stato della risorsa. La risorsa pu&ograve; essere abilitata o disabilitata. Lo stato predefinito &egrave; Abilitato.</p>
</dd>
<dt>Priorit&agrave; thread</dt>
<dd>
<p>La priorit&agrave; da assegnare ai thread creati. Il valore predefinito &egrave; 5.</p>
</dd>
<dt>Task con tempi di esecuzione lunghi</dt>
<dd>
<p>Indica se la risorsa deve essere utilizzata per i task con tempi di esecuzione lunghi. Se &egrave; abilitata, i task con tempi di esecuzione lunghi non vengono segnalati come bloccati. Questa opzione &egrave; disabilitata per impostazione predefinita.</p>
</dd>
<dt>Sospendi dopo</dt>
<dd>
<p>Il numero di secondi in cui i task possono essere eseguiti prima di essere considerati senza risposta. Il valore predefinito &egrave; 0.</p>
</dd>
<dt>Descrizione</dt>
<dd>
<p>La descrizione di questa risorsa.</p>
</dd>
<dt>Dimensione di base</dt>
<dd>
<p>Il numero di thread da gestire in un pool di thread. Il valore predefinito &egrave; 0.</p>
</dd>
<dt>Dimensione massima pool</dt>
<dd>
<p>Il numero massimo di thread che un pool di thread pu&ograve; contenere. Il valore predefinito &egrave; 2147483647.</p>
</dd>
<dt>Controllo attivit&agrave;</dt>
<dd>
<p>Il numero di secondi in cui i thread possono rimanere inattivi quando il numero di thread &egrave; maggiore della dimensione di base. Il valore predefinito &egrave; 60.</p>
</dd>
<dt>Durata thread</dt>
<dd>
<p>Il numero di secondi in cui i thread possono rimane in un pool di thread prima di essere rimossi, indipendentemente dal fatto che il numero di thread sia maggiore della dimensione di base o che i thread siano inattivi. Il valore predefinito &egrave; 0.</p>
</dd>
<dt>Capacit&agrave; coda di task</dt>
<dd>
<p>Il numero di task inviati che &egrave; possibile memorizzare nella coda di task in attesa di esecuzione. Il valore predefinito &egrave; 2147483647.</p>
</dd>
<dt>Propriet&agrave; aggiuntive</dt>
<dd>
<p>Propriet&agrave; aggiuntive per la risorsa. GlassFish Server non definisce alcuna propriet&agrave; aggiuntiva per questo tipo di risorsa. Inoltre, questo tipo di risorsa non utilizza attualmente alcuna propriet&agrave; aggiuntiva.</p>
</dd>
<dt>Destinazioni</dt>
<dd>
<p>Questa opzione viene visualizzata se nel dominio sono stati creati cluster o istanze standalone.</p>
<p>I cluster e le istanze standalone per la risorsa. Per spostare le destinazioni desiderate nella colonna Destinazioni selezionate, utilizzare i pulsanti Aggiungi e Aggiungi tutto. Per spostare le destinazioni non necessarie nella colonna Destinazioni disponibili, utilizzare i pulsanti Rimuovi e Rimuovi tutto.</p>
</dd>
</dl>
<a id="sthref25" name="sthref25"></a>
<h5>Task correlati</h5>
<ul>
<li>
<p><a href="task-managedexecutorservicecreate.html">Per creare un servizio esecutore gestito</a></p>
</li>
<li>
<p><a href="task-managedexecutorserviceedit.html">Per modificare un servizio esecutore gestito</a></p>
</li>
<li>
<p><a href="task-managedexecutorservicedelete.html">Per eliminare un servizio esecutore gestito</a></p>
</li>
</ul>
<a id="GHCON142" name="GHCON142"></a>
<h5>Comandi asadmin correlati</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM840"><code>create-managed-executor-service</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM871"><code>list-managed-executor-services</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM848"><code>delete-managed-executor-service</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
