<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <link rel="stylesheet" href="adminhelp.css" type="text/css">
  <title>Copyright</title>
</head>
<body>
<!-- help content --><a name="wp1022127"> </a>
<h2 class="pHeading2">Copyright
</h2>
<a name="wp1022131"> </a>
<p class="pParagraph">Sun Microsystems, Inc.<br>
4150 Network Circle<br>
Santa Clara, CA 95054 U.S.A.
</p>
<a name="wp1022132"> </a>
<p class="pParagraph">&nbsp;
</p>
<a name="wp1022134"> </a>
<p class="pParagraph">Copyright &copy; 2006 Sun Microsystems, Inc. Todos os direitos reservados.
</p>
<a name="wp1022135"> </a>
<p class="pParagraph">A Sun Microsystems, Inc. possui os direitos de propriedade intelectual relacionados &agrave; tecnologia incorporada ao produto descrito neste documento.  Em particular, e sem restri&ccedil;&otilde;es, estes direitos de propriedade intelectual podem incluir uma ou mais patentes dos EUA listadas em http://www.sun.com/patents e uma ou mais patentes adicionais ou aplica&ccedil;&otilde;es pendentes de patentes nos EUA e em outros pa&iacute;ses. </p>
<a name="wp1022136"> </a>
<p class="pParagraph">N&atilde;o publicado - direitos reservados segundo as Leis de Copyright dos Estados Unidos. </p>
<a name="wp1022137"> </a>
<p class="pParagraph">ESTE PRODUTO CONT&Eacute;M INFORMA&Ccedil;&Otilde;ES CONFIDENCIAIS E SEGREDOS COMERCIAIS DA SUN MICROSYSTEMS, INC. &Eacute; PROIBIDO O USO, REVELA&Ccedil;&Atilde;O OU REPRODU&Ccedil;&Atilde;O SEM A PERMISS&Atilde;O PR&Eacute;VIA EXPRESSA POR ESCRITO DA SUN MICROSYSTEMS, INC. </p>
<a name="wp1022138"> </a>
<p class="pParagraph">Direitos governamentais dos EUA - Software comercial. Os usu&aacute;rios governamentais est&atilde;o sujeitos ao contrato de licen&ccedil;a padr&atilde;o da Sun Microsystems, Inc. e &agrave;s cl&aacute;usulas aplic&aacute;veis do FAR e seus suplementos. </p>
<a name="wp1022139"> </a>
<p class="pParagraph">O uso est&aacute; sujeito aos termos da licen&ccedil;a. </p>
<a name="wp1022140"> </a>
<p class="pParagraph">Esta distribui&ccedil;&atilde;o pode incluir materiais desenvolvidos por terceiros. </p>
<a name="wp1022141"> </a>
<p class="pParagraph">Sun, Sun Microsystems, o logotipo da Sun, Java, Jini e o logotipo Java Coffee Cup s&atilde;o marcas comerciais ou marcas registradas da Sun Microsystems, Inc. nos EUA e em outros pa&iacute;ses. </p>
<a name="wp1022142"> </a>
<p class="pParagraph">UNIX &eacute; marca registrada nos Estados Unidos e outros pa&iacute;ses, exclusivamente licenciada pela X/Open Company, Ltd.
</p>
<a name="wp1022143"> </a>
<p class="pParagraph">Este produto est&aacute; protegido e &eacute; controlado pelas leis de Controle de exporta&ccedil;&atilde;o dos EUA e pode estar sujeito &agrave;s leis de exporta&ccedil;&atilde;o ou importa&ccedil;&atilde;o de outros pa&iacute;ses. S&atilde;o estritamente proibidos para usu&aacute;rios finais ou usos espec&iacute;ficos, diretos ou indiretos, em armas nucleares, mar&iacute;timo nucleares, qu&iacute;micas, biol&oacute;gicas ou m&iacute;sseis. &Eacute; estritamente proibida a exporta&ccedil;&atilde;o ou reexporta&ccedil;&atilde;o para pa&iacute;ses sujeitos a embargos dos Estados Unidos ou para entidades identificadas nas listas norte-americanas de exclus&atilde;o &agrave; exporta&ccedil;&atilde;o, incluindo, mas n&atilde;o se limitando &agrave;s listas nacionais de pessoas recusadas e especialmente designadas.
</p>
<a name="wp1022144"> </a>
<p class="pParagraph">_____________________________________
</p>
<a name="wp1022145"> </a>
<p class="pParagraph">Copyright &copy; 2006 Sun Microsystems, Inc., 4150 Network Circle, Santa Clara, California 95054, Etats-Unis. Tous droits r&eacute;serv&eacute;s.
</p>
<a name="wp1022146"> </a>
<p class="pParagraph">Sun Microsystems, Inc. d&eacute;tient les droits de propri&eacute;t&eacute; intellectuels relatifs &agrave; la technologie incorpor&eacute;e dans le produit qui est d&eacute;crit dans ce document. En particulier, et ce sans limitation, ces droits de propri&eacute;t&eacute; intellectuelle peuvent inclure un ou plus des brevets am&eacute;ricains list&eacute;s &agrave; l&rsquo;adresse http://www.sun.com/patents et un ou les brevets suppl&eacute;mentaires ou les applications de brevet en attente aux Etats - Unis et dans les autres pays. </p>
<a name="wp1022147"> </a>
<p class="pParagraph">Non publie - droits r&eacute;serv&eacute;s selon la l&eacute;gislation des Etats-Unis sur le droit d&rsquo;auteur.
</p>
<a name="wp1022148"> </a>
<p class="pParagraph">CE PRODUIT CONTIENT DES INFORMATIONS CONFIDENTIELLES ET DES SECRETS COMMERCIAUX DE SUN MICROSYSTEMS, INC. SON UTILISATION, SA DIVULGATION ET SA REPRODUCTION SONT INTERDITES SANS L&rsquo;AUTORISATION EXPRESSE, ECRITE ET PREALABLE DE SUN MICROSYSTEMS, INC. </p>
<a name="wp1022149"> </a>
<p class="pParagraph">L&rsquo;utilisation est soumise aux termes de la Licence. </p>
<a name="wp1022150"> </a>
<p class="pParagraph">Cette distribution peut comprendre des composants d&eacute;velopp&eacute;s par des tierces parties. </p>
<a name="wp1022151"> </a>
<p class="pParagraph">Sun, Sun Microsystems, le logo Sun, Java, Jini et le logo Java Coffee Cup sont des marques de fabrique ou des marques d&eacute;pos&eacute;es de Sun Microsystems, Inc. aux Etats-Unis et dans d&rsquo;autres pays.
</p>
<a name="wp1022152"> </a>
<p class="pParagraph">UNIX est une marque d&eacute;pos&eacute;e aux Etats-Unis et dans d&rsquo;autres pays et licenci&eacute;e exlusivement par X/Open Company, Ltd.
</p>
<a name="wp1022153"> </a>
<p class="pParagraph">Ce produit est soumis &agrave; la l&eacute;gislation am&eacute;ricaine en mati&egrave;re de contr&ocirc;le des exportations et peut &ecirc;tre soumis &agrave; la r&egrave;glementation en vigueur dans d&rsquo;autres pays dans le domaine des exportations et importations. Les utilisations, ou utilisateurs finaux, pour des armes nucl&eacute;aires, des missiles, des armes biologiques et chimiques ou du nucl&eacute;aire maritime, directement ou indirectement, sont strictement interdites. Les exportations ou r&eacute;exportations vers les pays sous embargo am&eacute;ricain, ou vers des entit&eacute;s figurant sur les listes d&rsquo;exclusion d&rsquo;exportation am&eacute;ricaines, y compris, mais de mani&egrave;re non exhaustive, la liste de personnes qui font objet d&rsquo;un ordre de ne pas participer, d&rsquo;une fa&ccedil;on directe ou indirecte, aux exportations des produits ou des services qui sont r&eacute;gis par la l&eacute;gislation am&eacute;ricaine en mati&egrave;re de contr&ocirc;le des exportations et la liste de ressortissants sp&eacute;cifiquement d&eacute;sign&eacute;s, sont rigoureusement interdites.
</p>
<a name="wp1022129"> </a>
<p class="pParagraph"></p>
<a name="wp1022128"> </a>
<p class="pParagraph"></p>
<!-- end help content -->
<hr><a href="copyright.html" target="main">Avisos legais</a>
</body>
</html>
