<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <title>Upgrade Tool: vis&atilde;o geral</title>
</head>
<body style="background-color: rgb(255, 255, 255);">
<h1>Upgrade Tool: vis&atilde;o geral</h1>
<p>Use a Upgrade Tool para transferir as informa&ccedil;&otilde;es de configura&ccedil;&atilde;o de uma instala&ccedil;&atilde;o do Application Server 8.x ou Application Server 9 para uma instala&ccedil;&atilde;o do Application Server 9.1. As informa&ccedil;&otilde;es transferidas constam de dados sobre aplicativos implantados, o reino do aplicativo, certificados de seguran&ccedil;a e outras configura&ccedil;&otilde;es de recursos e servidores.</p>
<p>A tabela a seguir mostra as atualiza&ccedil;&otilde;es suportadas do Application Server, na qual PE indica Platform Edition (edi&ccedil;&atilde;o da plataforma) e EE indica Enterprise Edition (edi&ccedil;&atilde;o corporativa).</p>
<table style="text-align: left; width: 435px; height: 662px;"
 summary="Table showing supported 
 Application Server upgrades"
 border="1" cellpadding="2" cellspacing="2">
  <tbody>
    <tr>
      <td style="vertical-align: top;">Instala&ccedil;&atilde;o de origem<br>
      </td>
      <td style="vertical-align: top; text-align: center;">Instala&ccedil;&atilde;o de destino (9.1)<br>
      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">7.0 PE<br>
      </td>
      <td style="vertical-align: top; text-align: center;">N&atilde;o suportado<br>
      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">7.1 SE<br>
      </td>
      <td style="vertical-align: top; text-align: center;">N&atilde;o suportado </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">7.1 EE<br>
      </td>
      <td style="vertical-align: top; text-align: center;">N&atilde;o suportado</td>
    </tr>
    <tr>
      <td style="vertical-align: top;">8.0 PE<br>
      </td>
      <td style="vertical-align: top; text-align: center;">Suportado (&Eacute; suportada a atualiza&ccedil;&atilde;o do dom&iacute;nio 8.0 PE para o dom&iacute;nio de desenvolvedor 9.1)<br>
      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">8.1 PE<br>
      </td>
      <td style="vertical-align: top; text-align: center;">Suportado (&Eacute; suportada a atualiza&ccedil;&atilde;o do dom&iacute;nio 8.1 PE para o dom&iacute;nio de desenvolvedor 9.1)<br>
      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">8.1 EE<br>
      </td>
      <td style="vertical-align: top; text-align: center;">Suportado&nbsp; (&Eacute; suportada a atualiza&ccedil;&atilde;o do dom&iacute;nio 8.1 EE para o dom&iacute;nio corporativo 9.1)<br>
      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">8.2 PE<br>
      </td>
      <td style="vertical-align: top;">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Suportado (&Eacute; suportada a atualiza&ccedil;&atilde;o do dom&iacute;nio 8.2 PE para o dom&iacute;nio de desenvolvedor 9.1)<br>
      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">8.2 EE<br>
      </td>
      <td style="vertical-align: top;">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Suportado (&Eacute; suportada a atualiza&ccedil;&atilde;o do dom&iacute;nio 8.2 EE para o dom&iacute;nio corporativo 9.1) </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">9.0 PE<br>
      </td>
      <td style="vertical-align: top;">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Suportado (&Eacute; suportada a atualiza&ccedil;&atilde;o do dom&iacute;nio 9.0 PE para o dom&iacute;nio de desenvolvedor 9.1)<br>
      </td>
    </tr>
  </tbody>
</table>
<p>A ferramenta detecta automaticamente a vers&atilde;o da instala&ccedil;&atilde;o especificada do servidor de origem.</p>
<blockquote>
  <p><b>Observa&ccedil;&atilde;o: </b><em>antes de iniciar o processo de atualiza&ccedil;&atilde;o, certifique-se de que o servidor de origem (o servidor a partir do qual est&aacute; realizando a atualiza&ccedil;&atilde;o) e o servidor de destino (o servidor ao qual est&aacute; realizando a atualiza&ccedil;&atilde;o) estejam interrompidos.</em></p>
</blockquote>
<p>
</p>
<h2 class="sol">Terminologia do processo de atualiza&ccedil;&atilde;o</h2>
<p>A seguir se encontram termos importantes relacionados ao processo de atualiza&ccedil;&atilde;o:</p>
<ul>
  <li>
    <p>Servidor de origem: instala&ccedil;&atilde;o a partir da qual voc&ecirc; est&aacute; atualizando para a nova vers&atilde;o.</p>
  </li>
  <li>
    <p>Servidor de destino: instala&ccedil;&atilde;o para a qual voc&ecirc; est&aacute; atualizando.</p>
  </li>
  <li>
    <p>Raiz de dom&iacute;nios: diret&oacute;rio no qual os dom&iacute;nios s&atilde;o criados. Por padr&atilde;o, este diret&oacute;rio corresponde ao local especificado como <tt>AS_DEF_DOMAINS_PATH</tt>
em <tt>asenv.conf</tt></p>
  </li>
  <li>Diret&oacute;rio do dom&iacute;nio ou <var>domain-dir</var>: diret&oacute;rio (dentro da raiz de dom&iacute;nios) correspondente a um determinado dom&iacute;nio. Toda a configura&ccedil;&atilde;o e outros dados pertencentes ao dom&iacute;nio est&atilde;o neste diret&oacute;rio.</li>
  <li>
    <p>Raiz de instala&ccedil;&atilde;o: diret&oacute;rio no qual o Application Server est&aacute; instalado.</p>
  </li>
</ul>
<p>
Se a caixa de verifica&ccedil;&atilde;o Upgrade tiver sido marcada durante o processo de instala&ccedil;&atilde;o do Application Server, a <a href="./upgradeWizard.html">tela Upgrade Wizard</a> ser&aacute; exibida automaticamente ap&oacute;s a conclus&atilde;o da instala&ccedil;&atilde;o. O <a href="upgradeWizard.html">processo de atualiza&ccedil;&atilde;o</a> se inicia.</p>
<a href="copyright.html" target="main">Avisos legais</a>
</body>
</html>
