<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-serverinstappsconfig" name="ref-serverinstappsconfig"></a></p>

<h4><a id="sthref215" name="sthref215"></a><a id="sthref216" name="sthref216"></a><a id="sthref217" name="sthref217"></a><a id="sthref218" name="sthref218"></a><a id="sthref219" name="sthref219"></a>Configuraci&oacute;n de aplicaciones</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Configuraci&oacute;n de Aplicaciones para definir las propiedades que ayudan a garantizar que se detecten los cambios en aplicaciones desplegadas y que se vuelvan a cargar las clases modificadas.</p>
<p>La p&aacute;gina Configuraci&oacute;n de Aplicaciones contiene las siguientes opciones.</p>
<dl>
<dt>Cargar Valores por Defecto</dt>
<dd>
<p>Bot&oacute;n para restaurar configuraci&oacute;n que tiene valores por defecto a sus valores por defecto. Las configuraciones que no tienen valores por defecto no se modifican.</p>
</dd>
<dt>Volver a Cargar</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; activada, las clases modificadas se vuelven a cargar de forma din&aacute;mica. El servidor comprueba peri&oacute;dicamente los cambios realizados en el directorio de despliegue y vuelve a desplegar la aplicaci&oacute;n de forma autom&aacute;tica y din&aacute;mica con los cambios. Esto es &uacute;til en un entorno de desarrollo ya que permite poner a prueba los cambios realizados en el c&oacute;digo de forma r&aacute;pida. En cambio, en un entorno de producci&oacute;n, la nueva carga din&aacute;mica puede hacer que disminuya el rendimiento. Adem&aacute;s, cuando ha finalizado la nueva carga, las sesiones del per&iacute;odo de tr&aacute;nsito pierden su validez. El cliente debe reiniciar la sesi&oacute;n. Esta opci&oacute;n se encuentra activada por defecto.</p>
</dd>
<dt>Intervalo de Sondeo de Nueva Carga</dt>
<dd>
<p>Identifica la frecuencia con que el servidor debe comprobar los cambios de c&oacute;digo en las aplicaciones y m&oacute;dulos desplegados. El valor por defecto es 2.</p>
</dd>
<dt>Timeout de Sesi&oacute;n de Administrador</dt>
<dd>
<p>Identifica el n&uacute;mero de minutos de inactividad antes de que la Consola de administraci&oacute;n sufra un timeout y se deba conectar de nuevo. El valor por defecto es 60.</p>
</dd>
<dt>Despliegue Autom&aacute;tico</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; activada, las aplicaciones del directorio de despliegue autom&aacute;tico se despliegan autom&aacute;ticamente. Esta opci&oacute;n se encuentra activada por defecto.</p>
</dd>
<dt>Intervalo de Sondeo de Despliegue Autom&aacute;tico</dt>
<dd>
<p>Especifica la frecuencia con que el servidor debe comprobar el directorio de despliegue autom&aacute;tico para saber si hay cambios del m&oacute;dulo o de la aplicaci&oacute;n. Si cambia el intervalo de sondeo no se ver&aacute; afectado el tiempo que se tarda en desplegar una aplicaci&oacute;n o un m&oacute;dulo. El valor por defecto es 2.</p>
</dd>
<dt>Timeout para el Reintento de Despliegue Autom&aacute;tico</dt>
<dd>
<p>Especifica el n&uacute;mero de segundos que el tama&ntilde;o de un archivo copiado parcialmente puede permanecer sin cambios antes de que se produzca un error. El valor por defecto es 4.</p>
<p>Si se copia un archivo lentamente en el directorio de despliegue autom&aacute;tico, &eacute;ste puede aparecer antes de que se copie el archivo completo. Como resultado, se produce un error al intentar desplegar la aplicaci&oacute;n de forma autom&aacute;tica. Si se produce un error al intentar desplegar una aplicaci&oacute;n de forma autom&aacute;tica por este motivo, GlassFish Server intentar&aacute; desplegar de nuevo la aplicaci&oacute;n. Si el tama&ntilde;o del archivo copiado parcialmente permanece sin cambios durante el per&iacute;odo de tiempo especificado, se producir&aacute; un error.</p>
</dd>
<dt>Directorio de Despliegue Autom&aacute;tico</dt>
<dd>
<p>Identifica el directorio para supervisar el despliegue autom&aacute;tico de las aplicaciones. El valor por defecto es domain-dir<code>/autodeploy</code>.</p>
</dd>
<dt>Validaci&oacute;n de XML</dt>
<dd>
<p>Especifica el tipo de validaci&oacute;n de XML que se llevar&aacute; a cabo en los descriptores de despliegue est&aacute;ndar y de GlassFish Server. El tipo puede ser cualquiera de los siguientes:</p>
<dl>
<dt>Completo</dt>
<dd>
<p>Si se produce un fallo en la validaci&oacute;n de XML, no se realizar&aacute; el despliegue. &Eacute;ste es el valor por defecto.</p>
</dd>
<dt>An&aacute;lisis</dt>
<dd>
<p>Se informa acerca de errores en la validaci&oacute;n de XML, pero se realiza el despliegue.</p>
</dd>
<dt>Ninguno</dt>
<dd>
<p>No se realiza ninguna validaci&oacute;n de XML.</p>
</dd>
</dl>
</dd>
<dt>Verificador</dt>
<dd>
<p>Si se activa esta opci&oacute;n, el verificador se ejecuta antes del despliegue autom&aacute;tico. Si se produce un fallo en la verificaci&oacute;n, no se realiza el despliegue. El verificador examinar&aacute; la estructura y contenido del archivo. La verificaci&oacute;n de aplicaciones de gran tama&ntilde;o tiende a llevar mucho tiempo. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Precompilar</dt>
<dd>
<p>Si est&aacute; activada esta opci&oacute;n, los archivos JavaServer Pages (JSP) se precompilar&aacute;n. Si est&aacute; desactivada esta opci&oacute;n, los archivos JSP se compilar&aacute;n en tiempo de ejecuci&oacute;n cuando se acceda a los mismos por primera vez. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Propiedades Adicionales</dt>
<dd>
<p>Propiedades adicionales para las aplicaciones. GlassFish Server no define ninguna propiedad adicional para las aplicaciones.</p>
</dd>
</dl>
<a id="sthref220" name="sthref220"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-setadvanceappconfig.html">Definir la configuraci&oacute;n de aplicaciones</a></p>
</li>
<li>
<p><a href="task-setadvancedomainattributes.html">Definir los atributos de dominio</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
