<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jaccproviders" name="ref-jaccproviders"></a></p>

<h4><a id="sthref392" name="sthref392"></a>Proveedores JACC</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Proveedores JACC para configurar los proveedores de Java Authorization Contract for Containers (JACC) para la instancia o cluster de GlassFish Server seleccionado.</p>
<p>Los proveedores JACC los pueden utilizar m&oacute;dulos de autorizaci&oacute;n de terceros para aplicaciones que se ejecuten en GlassFish Server. La instalaci&oacute;n por defecto de GlassFish Server incluye dos proveedores JACC denominados <code>default</code> y <code>simple</code>. Estos proveedores por defecto implantan un motor de autorizaci&oacute;n simple, basado en archivos, que cumple la especificaci&oacute;n JACC. Tambi&eacute;n puede crear sus propios proveedores JACC personalizados. Consulte <a href="task-jaccprovidernew.html">Crear un proveedor JACC</a>.</p>
<p>Para obtener m&aacute;s informaci&oacute;n sobre c&oacute;mo escribir clases de implantaci&oacute;n para un proveedor JACC, consulte la especificaci&oacute;n JACC en <code><a href="http://jcp.org/en/jsr/detail?id=115">http://jcp.org/en/jsr/detail?id=115</a></code>.</p>
<p>Se proporciona la siguiente informaci&oacute;n para cada proveedor JACC.</p>
<dl>
<dt>Nombre</dt>
<dd>
<p>Nombre del proveedor JACC. Este nombre se utiliza para hacer referencia al elemento <code>jacc-provider</code> en <code>domain.xml</code>.</p>
</dd>
<dt>Configuraci&oacute;n de pol&iacute;ticas</dt>
<dd>
<p>Nombre de clase totalmente cualificado de <code>javax.security.jacc.PolicyConfigurationFactory.provider</code> que implanta el <code>javax.security.jacc.PolicyConfigurationFactory</code> espec&iacute;fico del proveedor.</p>
</dd>
<dt>Proveedor de pol&iacute;tica</dt>
<dd>
<p>Nombre de clase totalmente cualificado de <code>javax.security.jacc.policy.provider</code> que implanta <code>java.security.Policy</code>.</p>
</dd>
</dl>
<p>Los proveedores JACC por defecto tambi&eacute;n soportan la siguiente propiedad.</p>
<dl>
<dt>repository</dt>
<dd>
<p>Directorio que contiene el archivo de pol&iacute;tica JACC. Para el proveedor JACC de GlassFish Server <code>default</code>, el directorio por defecto es <code>${com.sun.aas.instanceRoot}/generated/policy</code>. Esta propiedad no est&aacute; definida por defecto para el proveedor JACC de GlassFish Server <code>simple</code>.</p>
</dd>
</dl>
<p>La tabla Proveedores JACC tambi&eacute;n contiene las siguientes opciones.</p>
<dl>
<dt>Nuevo</dt>
<dd>
<p>Bot&oacute;n para crear un nuevo proveedor JACC.</p>
</dd>
<dt>Suprimir</dt>
<dd>
<p>Bot&oacute;n para suprimir uno o m&aacute;s proveedores JACC seleccionados.</p>
</dd>
</dl>
<a id="sthref393" name="sthref393"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-jaccprovidernew.html">Crear un proveedor JACC</a></p>
</li>
<li>
<p><a href="task-jaccprovideredit.html">Editar un proveedor JACC</a></p>
</li>
<li>
<p><a href="task-jaccproviderdelete.html">Suprimir un proveedor JACC</a></p>
</li>
</ul>
<a id="sthref394" name="sthref394"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00034"><code>create-jacc-provider</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00086"><code>delete-jacc-provider</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00171"><code>list-jacc-providers</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
