<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-uc-installed" name="ref-uc-installed"></a><a id="GHCOM00136" name="GHCOM00136"></a></p>

<h4><a id="sthref458" name="sthref458"></a>Componentes instalados</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La p&aacute;gina Componentes instalados ofrece informaci&oacute;n sobre los componentes de la imagen de instalaci&oacute;n que est&aacute;n instalados.</p>
<p>Para desinstalar los componentes instalados en primer lugar pare el dominio de GlassFish Server. A continuaci&oacute;n, utilice uno de estos comandos:</p>
<ul>
<li>
<p><code>glassfish3/bin/updatetool</code>, que inicia la utilidad gr&aacute;fica Herramienta de actualizaci&oacute;n</p>
</li>
<li>
<p><code>glassfish3/bin/pkg</code>, una versi&oacute;n de l&iacute;nea de comandos de la herramienta de actualizaci&oacute;n</p>
</li>
</ul>
<p>Para obtener m&aacute;s informaci&oacute;n sobre el uso del comando <code>pkg</code>, consulte el <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSADG00014">Cap&iacute;tulo 11, sobre <i>ampliaci&oacute;n y actualizaci&oacute;n de GlassFish Server</i>, en <i>Oracle GlassFish Server Administration Guide</i></a>. La utilidad Herramienta de Actualizaci&oacute;n tiene su propia ayuda en pantalla.</p>
<p>Reinicie el servidor despu&eacute;s de desinstalar los componentes.</p>
<p>La p&aacute;gina Componentes instalados contiene las opciones siguientes.</p>
<dl>
<dt>Ruta de instalaci&oacute;n</dt>
<dd>
<p>Ruta de acceso del sistema de archivos del directorio ra&iacute;z o nivel superior de la imagen de instalaci&oacute;n.</p>
</dd>
<dt>Componentes instalados</dt>
<dd>
<p>Para cada componente instalado, esta tabla proporciona la siguiente informaci&oacute;n.</p>
<dl>
<dt>Componente</dt>
<dd>
<p>Nombre del componente.</p>
</dd>
<dt>Categor&iacute;a</dt>
<dd>
<p>Categor&iacute;a del software al que se asocia el componente, por ejemplo, servidores de aplicaciones, herramientas del sistema y bases de datos. El autor del componente le asigna la categor&iacute;a al mismo cuando se crea el componente.</p>
</dd>
<dt>Versi&oacute;n</dt>
<dd>
<p>N&uacute;mero de versi&oacute;n del paquete en el que se proporciona el componente.</p>
</dd>
<dt>Tama&ntilde;o instalado</dt>
<dd>
<p>Cantidad de espacio en disco que consume la instalaci&oacute;n del componente.</p>
</dd>
<dt>Origen</dt>
<dd>
<p>Nombre del <a href="ref-uc-concepts.html#ref-uc-about-repository">Repositorio de red</a> desde el que se ha obtenido el componente.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref459" name="sthref459"></a>
<h5>Tareas relacionadas</h5>
<p><a href="task-uc-installed-remove.html">Ver componentes instalados</a></p>
<a id="sthref460" name="sthref460"></a>
<h5>Comandos asadmin Relacionados</h5>
<p>Ninguno.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
