<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-lifecyclemodulenew" name="ref-lifecyclemodulenew"></a></p>

<h4><a id="sthref315" name="sthref315"></a>Nuevo m&oacute;dulo de ciclo de vida</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Consulte la p&aacute;gina Nuevo M&oacute;dulo de Ciclo de Vida para definir un nuevo m&oacute;dulo de ciclo de vida.</p>
<p>La p&aacute;gina Nuevo M&oacute;dulo de Ciclo de Vida contiene las siguientes opciones.</p>
<dl>
<dt>Nombre</dt>
<dd>
<p>Nombre del m&oacute;dulo de ciclo de vida.</p>
</dd>
<dt>Nombre de clase</dt>
<dd>
<p>Nombre completo del archivo de clase del m&oacute;dulo de ciclo de vida. La clase debe implantar la interfaz <code>com.sun.appserv.server.LifecycleListener</code>.</p>
</dd>
<dt>Classpath</dt>
<dd>
<p>Classpath para el m&oacute;dulo de ciclo de vida. La classpath especifica la ubicaci&oacute;n del m&oacute;dulo de ciclo de vida. El valor por defecto es domain-dir<code>/applications</code>. Si el m&oacute;dulo ya se encuentra en este directorio (es decir, en la classpath del servidor), este campo puede dejarse en blanco.</p>
</dd>
<dt>Orden de Carga</dt>
<dd>
<p>Orden en el que este m&oacute;dulo de ciclo de vida se cargar&aacute; al inicio. Los m&oacute;dulos con valores de orden de carga de enteros inferiores se cargar&aacute;n antes. El valor puede estar entre 101 y el <code>MAXINT</code> del sistema operativo. Los valores de 1 a 100 est&aacute;n reservados.</p>
</dd>
<dt>Descripci&oacute;n</dt>
<dd>
<p>Descripci&oacute;n del m&oacute;dulo de ciclo de vida.</p>
</dd>
<dt>Estado</dt>
<dd>
<p>Si se selecciona esta opci&oacute;n, el m&oacute;dulo de ciclo de vida estar&aacute; activado. Esta opci&oacute;n se encuentra activada por defecto.</p>
</dd>
<dt>Ante Fallo de Carga</dt>
<dd>
<p>Si se selecciona esta opci&oacute;n, el servidor se apagar&aacute; si se produce un fallo en la carga del m&oacute;dulo de ciclo de vida. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Destinos</dt>
<dd>
<p>Clusters e instancias independientes para el m&oacute;dulo de ciclo de vida. Mueva los destinos seleccionados a la columna Destinos Seleccionados mediante los botones Agregar y Agregar Todos. Mueva los destinos que no necesite a la columna Destinos Disponibles mediante los botones Eliminar y Eliminar Todos.</p>
<p>Esta opci&oacute;n s&oacute;lo se muestra si en el dominio se han creado clusters o instancias independientes.</p>
</dd>
</dl>
<a id="sthref316" name="sthref316"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-lifecyclemodulenew.html">Crear un m&oacute;dulo de ciclo de vida</a></p>
</li>
<li>
<p><a href="task-lifecyclemoduleedit.html">Editar un m&oacute;dulo de ciclo de vida</a></p>
</li>
<li>
<p><a href="task-lifecyclemoduledelete.html">Suprimir un m&oacute;dulo de ciclo de vida</a></p>
</li>
</ul>
<a id="sthref317" name="sthref317"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00043"><code>create-lifecycle-module</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00181"><code>list-lifecycle-modules</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00095"><code>delete-lifecycle-module</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
