<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-monitoringservice" name="ref-monitoringservice"></a><a id="GHCOM00129" name="GHCOM00129"></a></p>

<h4><a id="sthref433" name="sthref433"></a>Servicio de supervisi&oacute;n</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Servicio de supervisi&oacute;n para configurar opciones de supervisi&oacute;n de servicios o componentes del servidor individual.</p>
<p>Debe desplegar una aplicaci&oacute;n, componente o servicio antes de configurar su supervisi&oacute;n.</p>
<p>La p&aacute;gina Servicio de supervisi&oacute;n contiene las siguientes opciones.</p>
<dl>
<dt>Nombre de Configuraci&oacute;n</dt>
<dd>
<p>Nombre de la configuraci&oacute;n a la que se aplican los valores de esta p&aacute;gina. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>Servicio de supervisi&oacute;n</dt>
<dd>
<p>Si la casilla de control de activaci&oacute;n de servicio de supervisi&oacute;n est&aacute; activada, se activar&aacute; la supervisi&oacute;n para GlassFish Server. Esta opci&oacute;n se encuentra activada por defecto.</p>
</dd>
<dt>MBeans de supervisi&oacute;n</dt>
<dd>
<p>Si la casilla de control de activaci&oacute;n de MBeans de supervisi&oacute;n est&aacute; activada, todos los MBeans necesarios para la supervisi&oacute;n se desplegar&aacute;n en GlassFish Server. Esta opci&oacute;n se encuentra activada por defecto.</p>
<p>Si la casilla de control no est&aacute; activada, no podr&aacute; ver los datos de supervisi&oacute;n en la Consola de administraci&oacute;n incluso si la casilla de control Servicio de supervisi&oacute;n s&iacute; est&aacute; activada. En su lugar, debe utilizar la l&iacute;nea de comandos para ver los datos de supervisi&oacute;n. Si desactiva la casilla de control, la huella de memoria de GlassFish Server se reduce.</p>
</dd>
<dt>DTrace</dt>
<dd>
<p>Si la casilla de control DTrace activado est&aacute; activada y dispone de supervisi&oacute;n de Oracle Enterprise Manager DTrace, puede usar la utilidad Solaris DTrace. Esta opci&oacute;n se activada por defecto.</p>
</dd>
</dl>
<p>Para cada componente disponible, se proporciona la siguiente informaci&oacute;n.</p>
<dl>
<dt>Componente</dt>
<dd>
<p>Nombre del componente de GlassFish Server.</p>
</dd>
<dt>Nivel de supervisi&oacute;n</dt>
<dd>
<p>Nivel de supervisi&oacute;n determinado por el componente. Para cada componente est&aacute;n disponibles los niveles BAJO, ALTO Y DESACTIVADO. El nivel por defecto es DESACTIVADO. No existe diferencia alguna entre los niveles de supervisi&oacute;n que ofrecen las opciones BAJO y ALTO de esta versi&oacute;n.</p>
</dd>
</dl>
<p>La tabla Configuraci&oacute;n de nivel de componentes tambi&eacute;n contiene las siguientes opciones.</p>
<dl>
<dt>Cambiar Nivel</dt>
<dd>
<p>Bot&oacute;n para cambiar el nivel de supervisi&oacute;n de uno o m&aacute;s componentes seleccionados.</p>
</dd>
<dt>Nivel</dt>
<dd>
<p>Lista desplegable en la que puede seleccionar un nivel de supervisi&oacute;n para que se aplique a todos los componentes seleccionados.</p>
</dd>
</dl>
<a id="sthref434" name="sthref434"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-confmonitor.html">Configurar el Servicio de Supervisi&oacute;n</a></p>
</li>
<li>
<p><a href="task-appmonitoringdata.html">Ver datos de supervisi&oacute;n de aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-servermonitoringdata.html">Ver datos de supervisi&oacute;n de servidor</a></p>
</li>
<li>
<p><a href="task-resourcemonitoringdata.html">Ver datos de supervisi&oacute;n de recursos</a></p>
</li>
</ul>
<a id="sthref435" name="sthref435"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00128"><code>enable-monitoring</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00120"><code>disable-monitoring</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00212"><code>monitor</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
