<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-generaltab" name="ref-generaltab"></a><a id="GHCOM00058" name="GHCOM00058"></a></p>

<h4><a id="sthref235" name="sthref235"></a><a id="sthref236" name="sthref236"></a>Informaci&oacute;n General</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>GlassFish Server crea una instancia de servidor de aplicaciones denominada <code>server</code> durante la instalaci&oacute;n. Si lo prefiere, puede suprimir esta instancia de servidor y crear una nueva instancia con un nombre distinto.</p>
<p>Cada instancia de GlassFish Server tiene su propia configuraci&oacute;n Java, recursos Java, &aacute;reas de despliegue de aplicaciones y valores de configuraci&oacute;n del servidor. Los cambios en una instancia de servidor de aplicaciones no tienen efecto en otras instancias del mismo tipo. Puede tener una instancia de servidor de aplicaciones dentro de un dominio administrativo.</p>
<p>Para muchos usuarios, una instancia de servidor de aplicaciones es suficiente para sus necesidades. Sin embargo, seg&uacute;n su entorno, puede que le convenga crear una o m&aacute;s instancias adicionales de servidor de aplicaciones. Por ejemplo, en un entorno de desarrollo puede utilizar diferentes instancias de servidor de aplicaciones para probar distintas configuraciones de GlassFish Server o comparar y probar distintos despliegues de aplicaciones. Como puede agregar y suprimir con facilidad instancias de servidor de aplicaciones, puede utilizarlas para crear zonas "sandbox" temporales para experimentar durante los trabajos de desarrollo.</p>
<p>Adem&aacute;s, para cada instancia de servidor de aplicaciones se pueden crear servidores virtuales. Dentro de una sola instancia instalada de servidor de aplicaciones puede ofrecer, tanto a compa&ntilde;&iacute;as como individuos, nombres de dominio, direcciones IP y algunas funciones administrativas. Para los usuarios resulta similar a disponer de su propio servidor web sin la complejidad del mantenimiento b&aacute;sico del servidor y del hardware. Estos servidores virtuales no incluyen, a su vez, instancias de servidor de aplicaciones. Para obtener m&aacute;s informaci&oacute;n sobre servidores virtuales, consulte <a href="ref-serverinstjvmgeneral.html">Configuraci&oacute;n general de JVM</a>.</p>
<p>En los despliegues operativos, puede utilizar los servidores virtuales en lugar de varias instancias de servidor de aplicaciones para una amplia variedad de fines. No obstante, si los servidores virtuales no se ajustan a sus necesidades, tambi&eacute;n puede usar varias instancias de servidor de aplicaciones.</p>
<p>Una instancia de GlassFish Server no se inicia de forma autom&aacute;tica. Una vez que inicie la instancia, &eacute;sta se ejecutar&aacute; hasta que usted la pare. Al parar una instancia de servidor de aplicaciones, dejar&aacute; de aceptar nuevas conexiones y esperar&aacute; a que finalicen las conexiones pendientes. Si la m&aacute;quina se bloquea o se queda fuera de l&iacute;nea, el servidor se cierra y se pueden perder las solicitudes en curso.</p>
<p>Consulte la p&aacute;gina Informaci&oacute;n General para comprobar la configuraci&oacute;n de GlassFish Server y ver los datos de Java Virtual Machine.</p>
<p>La p&aacute;gina Informaci&oacute;n General contiene la siguiente informaci&oacute;n.</p>
<dl>
<dt>Bot&oacute;n Parar</dt>
<dd>
<p>Haga clic en Parar para parar GlassFish Server.</p>
</dd>
<dt>Bot&oacute;n Reiniciar</dt>
<dd>
<p>Haga clic en Reiniciar para reiniciar GlassFish Server.</p>
</dd>
<dt>Bot&oacute;n Ver Archivos Log</dt>
<dd>
<p>Haga clic en el bot&oacute;n Ver Archivos Log para ver los archivos log para una instancia o cluster de GlassFish Server.</p>
</dd>
<dt>Bot&oacute;n Rotar Log</dt>
<dd>
<p>Haga clic en el bot&oacute;n Rotar Log para rotar el archivo log para el servidor de administraci&oacute;n (llamado <code>server</code>).</p>
</dd>
<dt>Bot&oacute;n Recuperar Transacci&oacute;n</dt>
<dd>
<p>Haga clic en este bot&oacute;n para recuperar transacciones para el servidor de administraci&oacute;n (llamado <code>server</code>) en la p&aacute;gina <a href="ref-recovertransactions.html">Recuperar transacciones</a>.</p>
</dd>
<dt>Bot&oacute;n Administraci&oacute;n Segura</dt>
<dd>
<p>Haga clic en el bot&oacute;n Administraci&oacute;n Segura para activar o desactivar la administraci&oacute;n segura en la p&aacute;gina <a href="ref-securityadmin.html">Administraci&oacute;n Segura</a>.</p>
</dd>
<dt>Nombre</dt>
<dd>
<p>Nombre del servidor actual.</p>
</dd>
<dt>Estado</dt>
<dd>
<p>Estado actual de la instancia de servidor. El servidor puede estar parado, iniciado o en ejecuci&oacute;n.</p>
</dd>
<dt>Tiempo de Actividad</dt>
<dd>
<p>N&uacute;mero de horas y minutos que la instancia de servidor ha estado continuamente en ejecuci&oacute;n. Es de s&oacute;lo lectura.</p>
</dd>
<dt>Equilibrador de Carga de HTTP</dt>
<dd>
<p>Nombre del equilibrador de carga, si est&aacute; activado para la instancia del servidor.</p>
</dd>
<dt>JVM</dt>
<dd>
<p>Si hace clic en Informe de JVM, se abrir&aacute; una ventana independiente que muestra informes sobre Java Virtual Machine, incluyendo un informe resumido, un informe sobre gesti&oacute;n de la memoria y recolecci&oacute;n de basura, otro informe sobre carga de clase y un volcado de thread actual.</p>
</dd>
<dt>Directorio de Configuraci&oacute;n</dt>
<dd>
<p>Directorio de la m&aacute;quina host que contiene archivos de configuraci&oacute;n, como <code>domain.xml</code>.</p>
</dd>
<dt>Versi&oacute;n Instalada</dt>
<dd>
<p>Identificador de versi&oacute;n del producto.</p>
</dd>
<dt>Administraci&oacute;n Segura</dt>
<dd>
<p>Estado actual de la administraci&oacute;n segura. Los valores posibles son Activada y No Activada.</p>
</dd>
<dt>Depurar</dt>
<dd>
<p>Identifica si la depuraci&oacute;n est&aacute; activada. Si la depuraci&oacute;n est&aacute; activada, tambi&eacute;n aparecer&aacute; el n&uacute;mero de puerto.</p>
</dd>
<dt>Puerto(s) HTTP</dt>
<dd>
<p>Puertos configurados actualmente para solicitudes y respuestas HTTP.</p>
</dd>
<dt>Puerto(s) IIOP</dt>
<dd>
<p>Puertos configurados actualmente para solicitudes y respuestas IIOP.</p>
</dd>
</dl>
<a id="sthref237" name="sthref237"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-generaltab.html">Ver informaci&oacute;n general de DAS</a></p>
</li>
<li>
<p><a href="task-logviewer.html">Ver archivos log de DAS</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
