<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-managefilerealm" name="ref-managefilerealm"></a><a id="GHCOM00106" name="GHCOM00106"></a></p>

<h4><a id="sthref370" name="sthref370"></a>Usuarios de archivos</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Usuarios de archivos para gestionar los usuarios del dominio <code>file</code>. Los usuarios y grupos del dominio <code>file</code> aparecen en el archivo de claves, cuya ubicaci&oacute;n est&aacute; especificada por la propiedad <code>file</code>.</p>
<p>Los usuarios del dominio <code>file</code> pueden pertenecer a un <i>grupo Java</i>, categor&iacute;a de usuarios clasificados por rasgos en com&uacute;n. Por ejemplo, los clientes de una aplicaci&oacute;n de comercio electr&oacute;nico pueden pertenecer al grupo <code>CLIENTE</code>, pero los que m&aacute;s gastan pertenecer&iacute;an al grupo <code>PREFERENTE</code>. La clasificaci&oacute;n de usuarios en grupos simplifica el control del acceso de gran cantidad de usuarios.</p>
<p>Inicialmente, tras la instalaci&oacute;n de GlassFish Server, el &uacute;nico usuario es el administrador introducido durante la instalaci&oacute;n. Por defecto, este usuario pertenece al grupo <code>asadmin</code>, en el dominio <code>admin-realm</code>, lo que le da derecho a modificar GlassFish Server. Los usuarios asignados a este grupo tendr&aacute;n privilegios de administrador, es decir que podr&aacute;n acceder a la herramienta <code>asadmin</code> y a la Consola de administraci&oacute;n.</p>
<p>La p&aacute;gina Usuarios de archivos muestra una lista de usuarios del dominio seleccionado. Para cada recurso, se proporciona la siguiente informaci&oacute;n:</p>
<dl>
<dt>ID de Usuario</dt>
<dd>
<p>Nombre de usuario.</p>
</dd>
<dt>Lista de Grupos</dt>
<dd>
<p>Grupos a los que pertenece el usuario.</p>
</dd>
</dl>
<p>La tabla Usuarios de archivos tambi&eacute;n contiene las siguientes opciones.</p>
<dl>
<dt>Nuevo</dt>
<dd>
<p>Bot&oacute;n para crear un nuevo usuario.</p>
</dd>
<dt>Suprimir</dt>
<dd>
<p>Bot&oacute;n para suprimir uno o varios usuarios seleccionados.</p>
</dd>
</dl>
<a id="sthref371" name="sthref371"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-fileuserscreate.html">Agregar un usuario al dominio de archivo</a></p>
</li>
<li>
<p><a href="task-fileusersedit.html">Editar informaci&oacute;n de usuario de dominio de archivo</a></p>
</li>
<li>
<p><a href="task-fileusersdelete.html">Suprimir un usuario del dominio de archivo</a></p>
</li>
</ul>
<a id="sthref372" name="sthref372"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00165"><code>list-file-users</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00024"><code>create-file-user</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00254"><code>update-file-user</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00076"><code>delete-file-user</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
