<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-eelogging" name="ref-eelogging"></a><a id="GHCOM00094" name="GHCOM00094"></a></p>

<h4><a id="sthref338" name="sthref338"></a>Configuraci&oacute;n de Registrador</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Configuraci&oacute;n de Registrador para configurar el registro para la instancia o cluster de GlassFish Server seleccionado.</p>
<p>La p&aacute;gina Configuraci&oacute;n de Registrador contiene las siguientes opciones.</p>
<dl>
<dt>Nombre de Configuraci&oacute;n</dt>
<dd>
<p>Nombre de la configuraci&oacute;n a la que se aplican los valores de esta p&aacute;gina. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>Escribir en el log del sistema</dt>
<dd>
<p>Si est&aacute; activada, la salida de registro se env&iacute;a al recurso <code>syslog</code> adem&aacute;s de al log del servidor. Esta funci&oacute;n s&oacute;lo est&aacute; disponible en sistemas Solaris y Linux. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Incluir en log de consola</dt>
<dd>
<p>Si est&aacute; activada, el registro de salida se env&iacute;a a la consola del sistema.</p>
</dd>
<dt>Rotaci&oacute;n en cambio de fecha</dt>
<dd>
<p>Si est&aacute; activada, GlassFish Server rota los archivos log cada d&iacute;a a medianoche.</p>
</dd>
<dt>Modo de varias l&iacute;neas</dt>
<dd>
<p>Si est&aacute; activada, los mensajes de log se formatean de modo que se puedan que resulten m&aacute;s f&aacute;cil de leer. Al cuerpo del mensaje de log se aplica sangrado y comienza en una nueva l&iacute;nea.</p>
</dd>
<dt>Formato de registro de consola</dt>
<dd>
<p>Formato de registro en la consola. Las opciones disponibles son ULF (UniformLogFormatter) y ODL (Oracle Diagnostics Logging). El valor por defecto es ODL.</p>
</dd>
<dt>Formato de registro LogFile</dt>
<dd>
<p>Formato de registro para registrar el archivo log del servidor. Las opciones disponibles son ULF y ODL. El valor por defecto es ODL.</p>
</dd>
<dt>L&iacute;mite de Rotaci&oacute;n de Archivo</dt>
<dd>
<p>Tama&ntilde;o en bytes que el archivo log del servidor debe alcanzar antes de rotar. Cuando el log del servidor alcanza el tama&ntilde;o especificado, GlassFish Server crea un nuevo archivo vac&iacute;o llamado <code>server.log</code> y cambia el nombre del archivo antiguo <code>server.log_</code><i>date</i>, donde <i>date</i> es la fecha y hora en la que se produjo la rotaci&oacute;n del archivo. El valor por defecto es 2 megabytes. El valor m&iacute;nimo para el l&iacute;mite es 500 kilobytes; si se especifica un valor inferior, el archivo rota cuando alcanza el tama&ntilde;o de 500 KB. Para desactivar la rotaci&oacute;n del archivo log, defina el valor en 0.</p>
</dd>
<dt>L&iacute;mite Temporal de Rotaci&oacute;n de Archivo</dt>
<dd>
<p>Minutos que transcurren antes de que el log del servidor tenga que rotar. El valor por defecto es 0, lo que significa que el archivo rota cuando alcanza el tama&ntilde;o especificado en el campo L&iacute;mite de Rotaci&oacute;n de Archivo. Si especifica uno o m&aacute;s minutos, el l&iacute;mite de tiempo tiene prioridad sobre el l&iacute;mite de tama&ntilde;o especificado en el campo L&iacute;mite de Rotaci&oacute;n de Archivo.</p>
</dd>
<dt>Frecuencia de Vaciado</dt>
<dd>
<p>N&uacute;mero m&aacute;ximo de mensajes que se escribir&aacute;n desde la cola en el log del servidor a la vez. El valor por defecto es 1.</p>
</dd>
<dt>M&aacute;ximo de archivos de historial</dt>
<dd>
<p>N&uacute;mero m&aacute;ximo de archivos log que GlassFish Server mantiene antes de suprimir el archivo m&aacute;s antiguo. Si define este valor en cero (0), GlassFish Server no suprime ning&uacute;n archivo log antiguo.</p>
</dd>
<dt>Archivo Log</dt>
<dd>
<p>Nombre o ubicaci&oacute;n alternativa para el archivo log del servidor. La ubicaci&oacute;n por defecto es domain-dir<code>/logs/server.log</code>.</p>
</dd>
<dt>Manejador de Logs</dt>
<dd>
<p>Nombre de clase absoluto de un manejador de log personalizado. Un manejador de logs personalizado le permite enviar logs a un destino distinto a <code>server.log</code> o <code>syslog</code>. El manejador personalizado debe comprender la clase <code>java.util.logging.Handler</code> (API compatible con JSR 047). Indique tambi&eacute;n la clase de manejador en la classpath GlassFish Server para que el manejador se instale durante el inicio del servidor.</p>
</dd>
</dl>
<a id="sthref339" name="sthref339"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-eelogging.html">Configurar valores de registro generales</a></p>
</li>
<li>
<p><a href="task-eelogginglevels.html">Configurar niveles de log</a></p>
</li>
<li>
<p><a href="task-logviewer.html">Ver archivos log de DAS</a></p>
</li>
</ul>
<a id="sthref340" name="sthref340"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00007"><code>collect-log-files</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00183"><code>list-log-levels</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00224"><code>rotate-log</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00228"><code>set-log-levels</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
