<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-applications" name="ref-applications"></a></p>

<h4><a id="sthref158" name="sthref158"></a>Aplicaciones</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La p&aacute;gina Aplicaciones muestra una lista de aplicaciones que se despliegan en GlassFish Server. Puede ver y gestionar las aplicaciones que ya est&eacute;n desplegadas y desplegar otras nuevas.</p>
<p>Para cada aplicaci&oacute;n aparece la siguiente informaci&oacute;n.</p>
<dl>
<dt>Nombre</dt>
<dd>
<p>Nombre de la aplicaci&oacute;n.</p>
<p>El nombre puede incluir un identificador de versi&oacute;n opcional, que va a continuaci&oacute;n del nombre y est&aacute; separado de &eacute;l por dos puntos (<code>:</code>). Para obtener m&aacute;s informaci&oacute;n sobre las versiones de m&oacute;dulo y de aplicaci&oacute;n, consulte el apartado sobre <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>las versiones de m&oacute;dulo y de aplicaci&oacute;n</i> en <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt>Orden de despliegue</dt>
<dd>
<p>Orden de despliegue de la aplicaci&oacute;n.</p>
<p>Las aplicaciones con un n&uacute;mero inferior se cargan en primer lugar al iniciar el servidor. Una aplicaci&oacute;n con un orden de aplicaci&oacute;n de 102 se carga antes que una aplicaci&oacute;n con un orden de aplicaci&oacute;n de 110. Si no se especifica un orden de despliegue en el momento de desplegar la aplicaci&oacute;n, se asigna un orden de despliegue por defecto de 100. Si dos aplicaciones tienen el mismo orden de despliegue, se despliega en primer lugar la aplicaci&oacute;n que se haya cargado primero. Especificar un orden de despliegue es &uacute;til si la aplicaci&oacute;n tiene dependencias y se deben cargar en un orden determinado.</p>
</dd>
<dt>Activado o Estado</dt>
<dd>
<p>Una marca de control si la aplicaci&oacute;n est&aacute; activada o una X si est&aacute; desactivada, en el caso de que s&oacute;lo exista la instancia de servidor por defecto, <code>server</code>.</p>
<p>Si existen clusters u otras instancias de servidores independientes, seleccione Activado en todos los destinos para ver los destinos en los que est&aacute; desplegada la aplicaci&oacute;n.</p>
</dd>
<dt>Motores</dt>
<dd>
<p>Tipos de contenedores empleados por la aplicaci&oacute;n. Entre los tipos de contenedor se incluyen los siguientes:</p>
<ul>
<li>
<p><code>web</code></p>
</li>
<li>
<p><code>webservices</code></p>
</li>
<li>
<p><code>ejb</code></p>
</li>
<li>
<p><code>conector</code></p>
</li>
<li>
<p><code>appclient</code></p>
</li>
<li>
<p><code>weld</code> (contenedor para los contextos y la inyecci&oacute;n de dependencia para las aplicaciones de la plataforma Java EE)</p>
</li>
</ul>
</dd>
<dt>Acci&oacute;n</dt>
<dd>
<p>Enlaza con las acciones que se pueden realizar en el componente despu&eacute;s de desplegarlo: volver a desplegar y a cargar todos los componentes, iniciar aplicaciones web y clientes de aplicaciones, y descargar stubs de cliente para los clientes de aplicaciones.</p>
</dd>
</dl>
<p>La tabla Aplicaciones desplegadas tambi&eacute;n contiene las siguientes opciones.</p>
<dl>
<dt>Desplegar</dt>
<dd>
<p>Bot&oacute;n para desplegar una aplicaci&oacute;n.</p>
</dd>
<dt>Anular despliegue</dt>
<dd>
<p>Bot&oacute;n para anular el despliegue de una o m&aacute;s aplicaciones seleccionadas.</p>
</dd>
<dt>Activar</dt>
<dd>
<p>Bot&oacute;n para activar una o m&aacute;s aplicaciones seleccionadas, si s&oacute;lo existe la instancia de servidor por defecto, <code>server</code>.</p>
</dd>
<dt>Desactivar</dt>
<dd>
<p>Bot&oacute;n para desactivar una o m&aacute;s aplicaciones seleccionadas, si s&oacute;lo existe la instancia de servidor por defecto, <code>server</code>.</p>
</dd>
<dt>Filtro</dt>
<dd>
<p>Lista desplegable que filtra las aplicaciones por motor.</p>
</dd>
</dl>
<a id="GHCOM367" name="GHCOM367"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-applistdeployed.html">Ver una lista de aplicaciones desplegadas</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">Desplegar una aplicaci&oacute;n web</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">Desplegar una aplicaci&oacute;n de empresa</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">Desplegar un cliente de aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">Desplegar un m&oacute;dulo del conector</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">Desplegar un JAR EJB</a></p>
</li>
<li>
<p><a href="task-appedit.html">Editar una aplicaci&oacute;n desplegada</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">Ver los descriptores de una aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-appviewtargets.html">Ver los Destinos de Aplicaciones</a></p>
</li>
<li>
<p><a href="task-endpoint.html">Ver informaci&oacute;n de punto final para un servicio web</a></p>
</li>
<li>
<p><a href="task-applaunch.html">Iniciar una aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">Iniciar un cliente de aplicaciones</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">Descargar stubs de clientes de aplicaciones</a></p>
</li>
<li>
<p><a href="task-appredeploy.html">Volver a desplegar una aplicaci&oacute;n desplegada</a></p>
</li>
<li>
<p><a href="task-apprestart.html">Volver a cargar una aplicaci&oacute;n desplegada</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">Ver los Recursos de &Aacute;mbito de Aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">Modificar los Recursos de &Aacute;mbito de Aplicaci&oacute;n</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
