<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-uploaddev" name="ref-uploaddev"></a></p>

<h4><a id="sthref291" name="sthref291"></a><a id="sthref292" name="sthref292"></a><a id="sthref293" name="sthref293"></a><a id="sthref294" name="sthref294"></a><a id="sthref295" name="sthref295"></a><a id="sthref296" name="sthref296"></a><a id="sthref297" name="sthref297"></a><a id="sthref298" name="sthref298"></a><a id="sthref299" name="sthref299"></a><a id="sthref300" name="sthref300"></a><a id="sthref301" name="sthref301"></a><a id="sthref302" name="sthref302"></a>Desplegar aplicaciones o m&oacute;dulos</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Desplegar Aplicaciones o M&oacute;dulos para desplegar una aplicaci&oacute;n.</p>
<p>La p&aacute;gina Desplegar Aplicaciones o M&oacute;dulos contiene las opciones siguientes para todas las aplicaciones. S&oacute;lo aparecen m&aacute;s opciones en caso de que especifique el campo Ubicaci&oacute;n para la aplicaci&oacute;n.</p>
<dl>
<dt>Ubicaci&oacute;n</dt>
<dd>
<p>Ubicaci&oacute;n del archivo para la aplicaci&oacute;n que va a desplegar.</p>
<p>Las opciones siguientes especifican desde d&oacute;nde se puede acceder al archivo y si es un archivo o un directorio.</p>
<dl>
<dt>Archivo Empaquetado que Cargar en el Servidor</dt>
<dd>
<p>El archivo reside en la m&aacute;quina cliente o se puede acceder a &eacute;l desde la misma.</p>
<p>La m&aacute;quina cliente es el host en el que est&aacute; visualizando la Consola de administraci&oacute;n a trav&eacute;s de un explorador.</p>
</dd>
<dt>Archivo empaquetado local o directorio accesible desde GlassFish Server</dt>
<dd>
<p>El archivo reside en la m&aacute;quina del servidor o es una aplicaci&oacute;n desempaquetada en un directorio separado.</p>
<p>La m&aacute;quina del servidor es el host que est&aacute; ejecutando el servidor de administraci&oacute;n de dominio de GlassFish Server.</p>
</dd>
</dl>
</dd>
<dt>Tipo</dt>
<dd>
<p>Tipo de aplicaci&oacute;n. Las opciones disponibles son:</p>
<ul>
<li>
<p>Aplicaci&oacute;n Web</p>
</li>
<li>
<p>Aplicaci&oacute;n Empresarial</p>
</li>
<li>
<p>Cliente de Aplicaciones</p>
</li>
<li>
<p>M&oacute;dulo del Conector</p>
</li>
<li>
<p>JAR EJB</p>
</li>
<li>
<p>Otro</p>
</li>
</ul>
</dd>
<dt>Destinos</dt>
<dd>
<p>Clusters e instancias independientes en los que desplegar la aplicaci&oacute;n o m&oacute;dulo. Mueva los destinos seleccionados a la columna Destinos Seleccionados mediante los botones Agregar y Agregar Todos. Mueva los destinos que no necesite a la columna Destinos Disponibles mediante los botones Eliminar y Eliminar Todos.</p>
<p>Esta opci&oacute;n s&oacute;lo se muestra si en el dominio se han creado clusters o instancias independientes.</p>
</dd>
</dl>
<p>Las opciones adicionales para los distintos tipos de aplicaci&oacute;n se describen en las siguientes secciones.</p>
<ul>
<li>
<p><a href="#ref-webapp-options">Opciones Adicionales para una Aplicaci&oacute;n Web</a></p>
</li>
<li>
<p><a href="#ref-entapp-options">Opciones Adicionales para una Aplicaci&oacute;n Empresarial</a></p>
</li>
<li>
<p><a href="#ref-appclient-options">Opciones Adicionales para un Cliente de Aplicaciones</a></p>
</li>
<li>
<p><a href="#ref-connmodule-options">Opciones Adicionales para un M&oacute;dulo del Conector</a></p>
</li>
<li>
<p><a href="#ref-ejb-options">Opciones Adicionales para un JAR EJB</a></p>
</li>
</ul>
<a id="ref-webapp-options" name="ref-webapp-options"></a>
<h5>Opciones Adicionales para una Aplicaci&oacute;n Web</h5>
<p>Si el tipo de aplicaci&oacute;n corresponde a una aplicaci&oacute;n web, aparecen las siguientes opciones.</p>
<dl>
<dt>Ra&iacute;z de Contexto</dt>
<dd>
<p>Ruta de acceso a la aplicaci&oacute;n. En la URL de la aplicaci&oacute;n web, la ra&iacute;z de contexto sigue inmediatamente al n&uacute;mero de puerto (<code>http://</code><i>host</i><code>:</code><i>puertot</i><code>/</code><i>ra&iacute;z-contexto</i><code>/...</code>). La ra&iacute;z de contexto debe comenzar por una barra diagonal, por ejemplo, <code>/hello</code>.</p>
</dd>
<dt>Nombre de Aplicaci&oacute;n</dt>
<dd>
<p>Nombre de la aplicaci&oacute;n.</p>
<p>El nombre puede incluir un identificador de versi&oacute;n opcional, que va a continuaci&oacute;n del nombre y est&aacute; separado de &eacute;l por dos puntos (<code>:</code>). El identificador de versi&oacute;n debe comenzar por una letra o n&uacute;mero. Puede contener caracteres alfanum&eacute;ricos m&aacute;s los caracteres de gui&oacute;n bajo (<code>_</code>), gui&oacute;n (<code>-</code>) y punto (<code>.</code>). Para obtener m&aacute;s informaci&oacute;n sobre las versiones de m&oacute;dulo y de aplicaci&oacute;n, consulte el apartado sobre <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>las versiones de m&oacute;dulo y de aplicaci&oacute;n</i> en <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt>Servidores Virtuales</dt>
<dd>
<p>Servidores virtuales asociados a esta aplicaci&oacute;n.</p>
<p>La opci&oacute;n Servidores Virtuales aparece si s&oacute;lo existe la instancia de servidor por defecto, <code>server</code>. Si existen clusters u otras instancias de servidor independientes, puede seleccionar los servidores virtuales despu&eacute;s del despliegue. Vaya a la p&aacute;gina Editar Aplicaci&oacute;n, seleccione el separador Destino y seleccione Gestionar Servidores Virtuales para el destino que desee.</p>
</dd>
<dt>Estado</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, la aplicaci&oacute;n est&aacute; activada. Esta opci&oacute;n est&aacute; activada por defecto.</p>
</dd>
<dt>Disponibilidad</dt>
<dd>
<p>Si se activa la casilla de control Activado, se activa la alta disponibilidad para las sesiones web, la aplicaci&oacute;n de puntos de control de bean de sesi&oacute;n con estado (SFSB) y posiblemente para la desactivaci&oacute;n. Si se define en false (valor por defecto), se desactiva el almacenamiento de sesiones web y puntos de control de SFSB para la aplicaci&oacute;n, aplicaci&oacute;n web o m&oacute;dulo EJB especificado. Si se define en true, la aplicaci&oacute;n o m&oacute;dulo especificados se activa para alta disponibilidad. Defina esta opci&oacute;n como true s&oacute;lo si se ha configurado y activado la alta disponibilidad en niveles superiores, como, por ejemplo, los niveles de servidor y contenedor.</p>
<p>Esta opci&oacute;n aparece si existen clusters o instancias del servidor independientes aparte de la instancia de servidor por defecto (<code>server</code>).</p>
</dd>
<dt>Precompilar JSP</dt>
<dd>
<p>Si est&aacute; seleccionada esta opci&oacute;n, los archivos JavaServer Pages (JSP) se precompilar&aacute;n. Si est&aacute; desactivada esta opci&oacute;n, los archivos JSP se compilar&aacute;n en tiempo de ejecuci&oacute;n cuando se acceda a los mismos por primera vez. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Ejecutar Verificador</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, los descriptores de despliegue se verifican antes del despliegue. Si se produce un fallo en la verificaci&oacute;n, no se realiza el despliegue. El verificador examinar&aacute; la estructura y el contenido de los descriptores de despliegue. La verificaci&oacute;n de aplicaciones de gran tama&ntilde;o tiende a llevar mucho tiempo. Esta opci&oacute;n se activada por defecto.</p>
<p>Los paquetes de verificador se deben haber instalado desde la herramienta de actualizaci&oacute;n o se registrar&aacute; una advertencia y se ignorar&aacute; esta opci&oacute;n.</p>
</dd>
<dt>Forzar Nuevo Despliegue</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, se volver&aacute; a desplegar la aplicaci&oacute;n si est&aacute; ya desplegada. Si esta opci&oacute;n no est&aacute; seleccionada y se intenta desplegar una aplicaci&oacute;n que ya se haya desplegado, se producir&aacute; un error. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Mantener Estado</dt>
<dd>
<p>Esta opci&oacute;n controla si las sesiones web, instancias SFSB y temporizadores EJB creados de forma persistente se conservan entre los nuevos despliegues.</p>
<p>Esta opci&oacute;n se activada por defecto. Esta opci&oacute;n s&oacute;lo est&aacute; soportada en la instancia de servidor por defecto, denominada <code>server</code>. No se soporta para ning&uacute;n otro destino y se ignorar&aacute;.</p>
<p>Algunos cambios efectuados en una aplicaci&oacute;n entre nuevos despliegues impiden que esta opci&oacute;n funcione correctamente. Por ejemplo, no cambie el juego de variables de instancia en la clase de bean SFSB.</p>
<p>Para las aplicaciones web, esta funci&oacute;n s&oacute;lo es aplicable si, en el archivo <code>glassfish-web-app.xml</code>, el atributo <code>persistence-type</code> del elemento <code>session-manager</code> es <code>file</code>.</p>
<p>Para instancias de bean de sesi&oacute;n con estado, el tipo de persistencia sin alta disponibilidad se define en el servidor (con la opci&oacute;n Tipo de Persistencia SFSB) y se debe definir en <code>file</code>, que es el valor por defecto y recomendado.</p>
<p>Si una sesi&oacute;n web, instancia SFSB o temporizador EJB activo no se conserva o restablece, <i>ninguno</i> de ellos estar&aacute; disponible cuando se haya completado el nuevo despliegue. Sin embargo, el nuevo despliegue continuar&aacute; y se registrar&aacute; una advertencia.</p>
<p>Para conservar datos de estado activo, GlassFish Server serializa los datos y los guarda en la memoria. Para restaurar los datos, el cargador de clases de la aplicaci&oacute;n que se acaba de volver a desplegar deserializa los datos guardados anteriormente.</p>
</dd>
<dt>Conservar Recursos de &Aacute;mbito de Aplicaci&oacute;n</dt>
<dd>
<p>Si se activa, conserva todos los recursos de &aacute;mbito de aplicaci&oacute;n y los restaura durante el nuevo despliegue. Esta opci&oacute;n no est&aacute; activada por defecto.</p>
</dd>
<dt>Orden de despliegue</dt>
<dd>
<p>Orden de despliegue de la aplicaci&oacute;n.</p>
<p>Las aplicaciones con un n&uacute;mero inferior se cargan en primer lugar al iniciar el servidor. Una aplicaci&oacute;n con un orden de aplicaci&oacute;n de 102 se carga antes que una aplicaci&oacute;n con un orden de aplicaci&oacute;n de 110. Si no se especifica un orden de despliegue en el momento de desplegar la aplicaci&oacute;n, se asigna un orden de despliegue por defecto de 100. Si dos aplicaciones tienen el mismo orden de despliegue, se despliega en primer lugar la aplicaci&oacute;n que se haya cargado primero. Especificar un orden de despliegue es &uacute;til si la aplicaci&oacute;n tiene dependencias y se deben cargar en un orden determinado.</p>
</dd>
<dt>Bibliotecas</dt>
<dd>
<p>Lista de archivos JAR de la biblioteca separados por comas espec&iacute;ficos de este m&oacute;dulo o aplicaci&oacute;n. Las rutas de acceso pueden ser absolutas o relativas. Una ruta de acceso relativa es relativa con respecto a /lib/applibs</p>
</dd>
</dl>




<dl>
<dt>Descripci&oacute;n</dt>
</dl>
<p>Descripci&oacute;n de la aplicaci&oacute;n.</p>
<dl>
<dd><a id="ref-entapp-options" name="ref-entapp-options"></a></dd>
</dl>
<h5>Opciones Adicionales para una Aplicaci&oacute;n Empresarial</h5>
<p>Si el tipo de aplicaci&oacute;n corresponde a una aplicaci&oacute;n empresarial, aparecen las siguientes opciones.</p>
<dl>
<dt>Nombre de Aplicaci&oacute;n</dt>
<dd>
<p>Nombre de la aplicaci&oacute;n.</p>
<p>El nombre puede incluir un identificador de versi&oacute;n opcional, que va a continuaci&oacute;n del nombre y est&aacute; separado de &eacute;l por dos puntos (<code>:</code>). El identificador de versi&oacute;n debe comenzar por una letra o n&uacute;mero. Puede contener caracteres alfanum&eacute;ricos m&aacute;s los caracteres de gui&oacute;n bajo (<code>_</code>), gui&oacute;n (<code>-</code>) y punto (<code>.</code>). Para obtener m&aacute;s informaci&oacute;n sobre las versiones de m&oacute;dulo y de aplicaci&oacute;n, consulte el apartado sobre <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>las versiones de m&oacute;dulo y de aplicaci&oacute;n</i> en <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt>Servidores Virtuales</dt>
<dd>
<p>Servidores virtuales asociados a esta aplicaci&oacute;n.</p>
<p>La opci&oacute;n Servidores Virtuales aparece si s&oacute;lo existe la instancia de servidor por defecto, <code>server</code>. Si existen clusters u otras instancias de servidor independientes, puede seleccionar los servidores virtuales despu&eacute;s del despliegue. Vaya a la p&aacute;gina Editar Aplicaci&oacute;n, seleccione el separador Destino y seleccione Gestionar Servidores Virtuales para el destino que desee.</p>
</dd>
<dt>Estado</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, la aplicaci&oacute;n est&aacute; activada. Esta opci&oacute;n est&aacute; activada por defecto.</p>
</dd>
<dt>Disponibilidad</dt>
<dd>
<p>Si se activa la casilla de control Activado, se activa la alta disponibilidad para las sesiones web, la aplicaci&oacute;n de puntos de control de bean de sesi&oacute;n con estado (SFSB) y posiblemente para la desactivaci&oacute;n. Si se define en false (valor por defecto), se desactiva el almacenamiento de sesiones web y puntos de control de SFSB para la aplicaci&oacute;n, aplicaci&oacute;n web o m&oacute;dulo EJB especificado. Si se define en true, la aplicaci&oacute;n o m&oacute;dulo especificados se activa para alta disponibilidad. Defina esta opci&oacute;n como true s&oacute;lo si se ha configurado y activado la alta disponibilidad en niveles superiores, como, por ejemplo, los niveles de servidor y contenedor.</p>
<p>Esta opci&oacute;n aparece si existen clusters o instancias del servidor independientes aparte de la instancia de servidor por defecto (<code>server</code>).</p>
</dd>
<dt>Java Web Start</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, se permite el acceso a Java Web Start para un m&oacute;dulo de cliente de aplicaciones. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Precompilar JSP</dt>
<dd>
<p>Si est&aacute; seleccionada esta opci&oacute;n, los archivos JavaServer Pages (JSP) se precompilar&aacute;n. Si est&aacute; desactivada esta opci&oacute;n, los archivos JSP se compilar&aacute;n en tiempo de ejecuci&oacute;n cuando se acceda a los mismos por primera vez. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Ejecutar Verificador</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, los descriptores de despliegue se verifican antes del despliegue. Si se produce un fallo en la verificaci&oacute;n, no se realiza el despliegue. El verificador examinar&aacute; la estructura y el contenido de los descriptores de despliegue. La verificaci&oacute;n de aplicaciones de gran tama&ntilde;o tiende a llevar mucho tiempo. Esta opci&oacute;n se activada por defecto.</p>
<p>Los paquetes de verificador se deben haber instalado desde la herramienta de actualizaci&oacute;n o se registrar&aacute; una advertencia y se ignorar&aacute; esta opci&oacute;n.</p>
</dd>
<dt>Compatibilidad</dt>
<dd>
<p>Si la opci&oacute;n est&aacute; activada, utiliza los requisitos de visibilidad de JAR de GlassFish Server v2 para las aplicaciones, en lugar de los m&aacute;s estrictos requisitos de Java EE 6 implantados en las versiones v3 de GlassFish Server, incluida 4.0. Esta opci&oacute;n no est&aacute; activada por defecto.</p>
<p>La especificaci&oacute;n de la plataforma Java EE 6 impone requisitos m&aacute;s estrictos que Java EE 5 sobre qu&eacute; archivos JAR pueden ser visibles para varios m&oacute;dulos dentro de un archivo EAR. En concreto, los clientes de aplicaci&oacute;n no deben tener acceso a los archivos JAR EJB o a otros archivos JAR del archivo EAR a menos que las referencias utilicen los mecanismos Java SE est&aacute;ndar (extensiones, por ejemplo) o el mecanismo biblioteca-directorio de Java EE. Al activar esta casilla se eliminan estas restricciones de Java EE 6.</p>
</dd>
<dt>Forzar Nuevo Despliegue</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, se volver&aacute; a desplegar la aplicaci&oacute;n si est&aacute; ya desplegada. Si esta opci&oacute;n no est&aacute; seleccionada y se intenta desplegar una aplicaci&oacute;n que ya se haya desplegado, se producir&aacute; un error. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Mantener Estado</dt>
<dd>
<p>Esta opci&oacute;n controla si las sesiones web, instancias SFSB y temporizadores EJB creados de forma persistente se conservan entre los nuevos despliegues.</p>
<p>Esta opci&oacute;n se activada por defecto. Esta opci&oacute;n s&oacute;lo est&aacute; soportada en la instancia de servidor por defecto, denominada <code>server</code>. No se soporta para ning&uacute;n otro destino y se ignorar&aacute;.</p>
<p>Algunos cambios efectuados en una aplicaci&oacute;n entre nuevos despliegues impiden que esta opci&oacute;n funcione correctamente. Por ejemplo, no cambie el juego de variables de instancia en la clase de bean SFSB.</p>
<p>Para las aplicaciones web, esta funci&oacute;n s&oacute;lo es aplicable si, en el archivo <code>glassfish-web-app.xml</code>, el atributo <code>persistence-type</code> del elemento <code>session-manager</code> es <code>file</code>.</p>
<p>Para instancias de bean de sesi&oacute;n con estado, el tipo de persistencia sin alta disponibilidad se define en el servidor (con la opci&oacute;n Tipo de Persistencia SFSB) y se debe definir en <code>file</code>, que es el valor por defecto y recomendado.</p>
<p>Si una sesi&oacute;n web, instancia SFSB o temporizador EJB activo no se conserva o restablece, <i>ninguno</i> de ellos estar&aacute; disponible cuando se haya completado el nuevo despliegue. Sin embargo, el nuevo despliegue continuar&aacute; y se registrar&aacute; una advertencia.</p>
<p>Para conservar datos de estado activo, GlassFish Server serializa los datos y los guarda en la memoria. Para restaurar los datos, el cargador de clases de la aplicaci&oacute;n que se acaba de volver a desplegar deserializa los datos guardados anteriormente.</p>
</dd>
<dt>Conservar Recursos de &Aacute;mbito de Aplicaci&oacute;n</dt>
<dd>
<p>Si se activa, conserva todos los recursos de &aacute;mbito de aplicaci&oacute;n y los restaura durante el nuevo despliegue. Esta opci&oacute;n no est&aacute; activada por defecto.</p>
</dd>
<dt>Orden de despliegue</dt>
<dd>
<p>Orden de despliegue de la aplicaci&oacute;n.</p>
<p>Las aplicaciones con un n&uacute;mero inferior se cargan en primer lugar al iniciar el servidor. Una aplicaci&oacute;n con un orden de aplicaci&oacute;n de 102 se carga antes que una aplicaci&oacute;n con un orden de aplicaci&oacute;n de 110. Si no se especifica un orden de despliegue en el momento de desplegar la aplicaci&oacute;n, se asigna un orden de despliegue por defecto de 100. Si dos aplicaciones tienen el mismo orden de despliegue, se despliega en primer lugar la aplicaci&oacute;n que se haya cargado primero. Especificar un orden de despliegue es &uacute;til si la aplicaci&oacute;n tiene dependencias y se deben cargar en un orden determinado.</p>
</dd>
<dt>Bibliotecas</dt>
<dd>
<p>Lista de archivos JAR de la biblioteca separados por comas espec&iacute;ficos de esta aplicaci&oacute;n. Especifica una ruta de acceso absoluta o relativa. Una ruta de acceso relativa es relativa con respecto a domain-dir<code>/lib/applibs</code>. Si la ruta de acceso es absoluta, la ruta de acceso debe ser accesible para el servidor de administraci&oacute;n del dominio (DAS), lo que implica que debe estar en domain-dir. Las bibliotecas est&aacute;n disponibles para la aplicaci&oacute;n en el orden en que est&aacute;n especificadas.</p>
</dd>
<dt>Descripci&oacute;n</dt>
<dd>
<p>Descripci&oacute;n de la aplicaci&oacute;n.</p>
</dd>
</dl>
<p><a id="ref-appclient-options" name="ref-appclient-options"></a></p>
<h5>Opciones Adicionales para un Cliente de Aplicaciones</h5>
<p>Si el tipo de aplicaci&oacute;n corresponde a un cliente de aplicaciones, aparecen las siguientes opciones.</p>
<dl>
<dt>Nombre de Aplicaci&oacute;n</dt>
<dd>
<p>Nombre de la aplicaci&oacute;n.</p>
<p>El nombre puede incluir un identificador de versi&oacute;n opcional, que va a continuaci&oacute;n del nombre y est&aacute; separado de &eacute;l por dos puntos (<code>:</code>). El identificador de versi&oacute;n debe comenzar por una letra o n&uacute;mero. Puede contener caracteres alfanum&eacute;ricos m&aacute;s los caracteres de gui&oacute;n bajo (<code>_</code>), gui&oacute;n (<code>-</code>) y punto (<code>.</code>). Para obtener m&aacute;s informaci&oacute;n sobre las versiones de m&oacute;dulo y de aplicaci&oacute;n, consulte el apartado sobre <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>las versiones de m&oacute;dulo y de aplicaci&oacute;n</i> en <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt>Java Web Start</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, se permite el acceso a Java Web Start para un m&oacute;dulo de cliente de aplicaciones. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Ejecutar Verificador</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, los descriptores de despliegue se verifican antes del despliegue. Si se produce un fallo en la verificaci&oacute;n, no se realiza el despliegue. El verificador examinar&aacute; la estructura y el contenido de los descriptores de despliegue. La verificaci&oacute;n de aplicaciones de gran tama&ntilde;o tiende a llevar mucho tiempo. Esta opci&oacute;n se activada por defecto.</p>
<p>Los paquetes de verificador se deben haber instalado desde la herramienta de actualizaci&oacute;n o se registrar&aacute; una advertencia y se ignorar&aacute; esta opci&oacute;n.</p>
</dd>
<dt>Forzar Nuevo Despliegue</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, se volver&aacute; a desplegar la aplicaci&oacute;n si est&aacute; ya desplegada. Si esta opci&oacute;n no est&aacute; seleccionada y se intenta desplegar una aplicaci&oacute;n que ya se haya desplegado, se producir&aacute; un error. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Orden de despliegue</dt>
<dd>
<p>Orden de despliegue de la aplicaci&oacute;n.</p>
<p>Las aplicaciones con un n&uacute;mero inferior se cargan en primer lugar al iniciar el servidor. Una aplicaci&oacute;n con un orden de aplicaci&oacute;n de 102 se carga antes que una aplicaci&oacute;n con un orden de aplicaci&oacute;n de 110. Si no se especifica un orden de despliegue en el momento de desplegar la aplicaci&oacute;n, se asigna un orden de despliegue por defecto de 100. Si dos aplicaciones tienen el mismo orden de despliegue, se despliega en primer lugar la aplicaci&oacute;n que se haya cargado primero. Especificar un orden de despliegue es &uacute;til si la aplicaci&oacute;n tiene dependencias y se deben cargar en un orden determinado.</p>
</dd>
<dt>Descripci&oacute;n</dt>
<dd>
<p>Descripci&oacute;n de la aplicaci&oacute;n.</p>
</dd>
</dl>
<p><a id="ref-connmodule-options" name="ref-connmodule-options"></a></p>
<h5>Opciones Adicionales para un M&oacute;dulo del Conector</h5>
<p>Si el tipo de aplicaci&oacute;n corresponde a un m&oacute;dulo del conector, aparecen las siguientes opciones.</p>
<dl>
<dt>Nombre de Aplicaci&oacute;n</dt>
<dd>
<p>Nombre de la aplicaci&oacute;n.</p>
<p>El nombre puede incluir un identificador de versi&oacute;n opcional, que va a continuaci&oacute;n del nombre y est&aacute; separado de &eacute;l por dos puntos (<code>:</code>). El identificador de versi&oacute;n debe comenzar por una letra o n&uacute;mero. Puede contener caracteres alfanum&eacute;ricos m&aacute;s los caracteres de gui&oacute;n bajo (<code>_</code>), gui&oacute;n (<code>-</code>) y punto (<code>.</code>). Para obtener m&aacute;s informaci&oacute;n sobre las versiones de m&oacute;dulo y de aplicaci&oacute;n, consulte el apartado sobre <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>las versiones de m&oacute;dulo y de aplicaci&oacute;n</i> en <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt>Estado</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, la aplicaci&oacute;n est&aacute; activada. Esta opci&oacute;n est&aacute; activada por defecto.</p>
</dd>
<dt>Ejecutar Verificador</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, los descriptores de despliegue se verifican antes del despliegue. Si se produce un fallo en la verificaci&oacute;n, no se realiza el despliegue. El verificador examinar&aacute; la estructura y el contenido de los descriptores de despliegue. La verificaci&oacute;n de aplicaciones de gran tama&ntilde;o tiende a llevar mucho tiempo. Esta opci&oacute;n se activada por defecto.</p>
<p>Los paquetes de verificador se deben haber instalado desde la herramienta de actualizaci&oacute;n o se registrar&aacute; una advertencia y se ignorar&aacute; esta opci&oacute;n.</p>
</dd>
<dt>Forzar Nuevo Despliegue</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, se volver&aacute; a desplegar la aplicaci&oacute;n si est&aacute; ya desplegada. Si esta opci&oacute;n no est&aacute; seleccionada y se intenta desplegar una aplicaci&oacute;n que ya se haya desplegado, se producir&aacute; un error. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Conservar Recursos de &Aacute;mbito de Aplicaci&oacute;n</dt>
<dd>
<p>Si se activa, conserva todos los recursos de &aacute;mbito de aplicaci&oacute;n y los restaura durante el nuevo despliegue. Esta opci&oacute;n no est&aacute; activada por defecto.</p>
</dd>
<dt>Orden de despliegue</dt>
<dd>
<p>Orden de despliegue de la aplicaci&oacute;n.</p>
<p>Las aplicaciones con un n&uacute;mero inferior se cargan en primer lugar al iniciar el servidor. Una aplicaci&oacute;n con un orden de aplicaci&oacute;n de 102 se carga antes que una aplicaci&oacute;n con un orden de aplicaci&oacute;n de 110. Si no se especifica un orden de despliegue en el momento de desplegar la aplicaci&oacute;n, se asigna un orden de despliegue por defecto de 100. Si dos aplicaciones tienen el mismo orden de despliegue, se despliega en primer lugar la aplicaci&oacute;n que se haya cargado primero. Especificar un orden de despliegue es &uacute;til si la aplicaci&oacute;n tiene dependencias y se deben cargar en un orden determinado.</p>
</dd>
<dt>Descripci&oacute;n</dt>
<dd>
<p>Descripci&oacute;n de la aplicaci&oacute;n.</p>
</dd>
</dl>
<p><a id="ref-ejb-options" name="ref-ejb-options"></a></p>
<h5>Opciones Adicionales para un JAR EJB</h5>
<p>Si el tipo de aplicaci&oacute;n corresponde a un JAR EJB, aparecen las siguientes opciones.</p>
<dl>
<dt>Nombre de Aplicaci&oacute;n</dt>
<dd>
<p>Nombre de la aplicaci&oacute;n.</p>
<p>El nombre puede incluir un identificador de versi&oacute;n opcional, que va a continuaci&oacute;n del nombre y est&aacute; separado de &eacute;l por dos puntos (<code>:</code>). El identificador de versi&oacute;n debe comenzar por una letra o n&uacute;mero. Puede contener caracteres alfanum&eacute;ricos m&aacute;s los caracteres de gui&oacute;n bajo (<code>_</code>), gui&oacute;n (<code>-</code>) y punto (<code>.</code>). Para obtener m&aacute;s informaci&oacute;n sobre las versiones de m&oacute;dulo y de aplicaci&oacute;n, consulte el apartado sobre <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>las versiones de m&oacute;dulo y de aplicaci&oacute;n</i> en <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt>Estado</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, la aplicaci&oacute;n est&aacute; activada. Esta opci&oacute;n est&aacute; activada por defecto.</p>
</dd>
<dt>Disponibilidad</dt>
<dd>
<p>Si se activa la casilla de control Activado, se activa la alta disponibilidad para las sesiones web, la aplicaci&oacute;n de puntos de control de bean de sesi&oacute;n con estado (SFSB) y posiblemente para la desactivaci&oacute;n. Si se define en false (valor por defecto), se desactiva el almacenamiento de sesiones web y puntos de control de SFSB para la aplicaci&oacute;n, aplicaci&oacute;n web o m&oacute;dulo EJB especificado. Si se define en true, la aplicaci&oacute;n o m&oacute;dulo especificados se activa para alta disponibilidad. Defina esta opci&oacute;n como true s&oacute;lo si se ha configurado y activado la alta disponibilidad en niveles superiores, como, por ejemplo, los niveles de servidor y contenedor.</p>
<p>Esta opci&oacute;n aparece si existen clusters o instancias del servidor independientes aparte de la instancia de servidor por defecto (<code>server</code>).</p>
</dd>
<dt>Ejecutar Verificador</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, los descriptores de despliegue se verifican antes del despliegue. Si se produce un fallo en la verificaci&oacute;n, no se realiza el despliegue. El verificador examinar&aacute; la estructura y el contenido de los descriptores de despliegue. La verificaci&oacute;n de aplicaciones de gran tama&ntilde;o tiende a llevar mucho tiempo. Esta opci&oacute;n se activada por defecto.</p>
<p>Los paquetes de verificador se deben haber instalado desde la herramienta de actualizaci&oacute;n o se registrar&aacute; una advertencia y se ignorar&aacute; esta opci&oacute;n.</p>
</dd>
<dt>Compatibilidad</dt>
<dd>
<p>Si la opci&oacute;n est&aacute; activada, utiliza los requisitos de visibilidad de JAR de GlassFish Server v2 para las aplicaciones, en lugar de los m&aacute;s estrictos requisitos de Java EE 6 implantados en las versiones v3 de GlassFish Server, incluida 4.0. Esta opci&oacute;n no est&aacute; activada por defecto.</p>
<p>La especificaci&oacute;n de la plataforma Java EE 6 impone requisitos m&aacute;s estrictos que Java EE 5 sobre qu&eacute; archivos JAR pueden ser visibles para varios m&oacute;dulos dentro de un archivo EAR. En concreto, los clientes de aplicaci&oacute;n no deben tener acceso a los archivos JAR EJB o a otros archivos JAR del archivo EAR a menos que las referencias utilicen los mecanismos Java SE est&aacute;ndar (extensiones, por ejemplo) o el mecanismo biblioteca-directorio de Java EE. Al activar esta casilla se eliminan estas restricciones de Java EE 6.</p>
</dd>
<dt>Forzar Nuevo Despliegue</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, se volver&aacute; a desplegar la aplicaci&oacute;n si est&aacute; ya desplegada. Si esta opci&oacute;n no est&aacute; seleccionada y se intenta desplegar una aplicaci&oacute;n que ya se haya desplegado, se producir&aacute; un error. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Mantener Estado</dt>
<dd>
<p>Esta opci&oacute;n controla si las sesiones web, instancias SFSB y temporizadores EJB creados de forma persistente se conservan entre los nuevos despliegues.</p>
<p>Esta opci&oacute;n se activada por defecto. Esta opci&oacute;n s&oacute;lo est&aacute; soportada en la instancia de servidor por defecto, denominada <code>server</code>. No se soporta para ning&uacute;n otro destino y se ignorar&aacute;.</p>
<p>Algunos cambios efectuados en una aplicaci&oacute;n entre nuevos despliegues impiden que esta opci&oacute;n funcione correctamente. Por ejemplo, no cambie el juego de variables de instancia en la clase de bean SFSB.</p>
<p>Para las aplicaciones web, esta funci&oacute;n s&oacute;lo es aplicable si, en el archivo <code>glassfish-web-app.xml</code>, el atributo <code>persistence-type</code> del elemento <code>session-manager</code> es <code>file</code>.</p>
<p>Para instancias de bean de sesi&oacute;n con estado, el tipo de persistencia sin alta disponibilidad se define en el servidor (con la opci&oacute;n Tipo de Persistencia SFSB) y se debe definir en <code>file</code>, que es el valor por defecto y recomendado.</p>
<p>Si una sesi&oacute;n web, instancia SFSB o temporizador EJB activo no se conserva o restablece, <i>ninguno</i> de ellos estar&aacute; disponible cuando se haya completado el nuevo despliegue. Sin embargo, el nuevo despliegue continuar&aacute; y se registrar&aacute; una advertencia.</p>
<p>Para conservar datos de estado activo, GlassFish Server serializa los datos y los guarda en la memoria. Para restaurar los datos, el cargador de clases de la aplicaci&oacute;n que se acaba de volver a desplegar deserializa los datos guardados anteriormente.</p>
</dd>
<dt>Conservar Recursos de &Aacute;mbito de Aplicaci&oacute;n</dt>
<dd>
<p>Si se activa, conserva todos los recursos de &aacute;mbito de aplicaci&oacute;n y los restaura durante el nuevo despliegue. Esta opci&oacute;n no est&aacute; activada por defecto.</p>
</dd>
<dt>Orden de despliegue</dt>
<dd>
<p>Orden de despliegue de la aplicaci&oacute;n.</p>
<p>Las aplicaciones con un n&uacute;mero inferior se cargan en primer lugar al iniciar el servidor. Una aplicaci&oacute;n con un orden de aplicaci&oacute;n de 102 se carga antes que una aplicaci&oacute;n con un orden de aplicaci&oacute;n de 110. Si no se especifica un orden de despliegue en el momento de desplegar la aplicaci&oacute;n, se asigna un orden de despliegue por defecto de 100. Si dos aplicaciones tienen el mismo orden de despliegue, se despliega en primer lugar la aplicaci&oacute;n que se haya cargado primero. Especificar un orden de despliegue es &uacute;til si la aplicaci&oacute;n tiene dependencias y se deben cargar en un orden determinado.</p>
</dd>
<dt>Bibliotecas</dt>
<dd>
<p>Lista de archivos JAR de la biblioteca separados por comas espec&iacute;ficos de este m&oacute;dulo o aplicaci&oacute;n. Especifica una ruta de acceso absoluta o relativa. Una ruta de acceso relativa es relativa con respecto a domain-dir<code>/lib/applibs</code>. Si la ruta de acceso es absoluta, la ruta de acceso debe ser accesible para el servidor de administraci&oacute;n del dominio (DAS), lo que implica que debe estar en domain-dir. Las bibliotecas est&aacute;n disponibles para la aplicaci&oacute;n en el orden en que est&aacute;n especificadas.</p>
</dd>
<dt>Descripci&oacute;n</dt>
<dd>
<p>Descripci&oacute;n de la aplicaci&oacute;n.</p>
</dd>
</dl>
<p><a id="sthref303" name="sthref303"></a></p>
<h5>Opciones Adicionales para Aplicaciones de Tipo Otro</h5>
<p>Si el tipo de la aplicaci&oacute;n es Otro, aparecer&aacute;n las siguientes opciones.</p>
<dl>
<dt>Nombre de Aplicaci&oacute;n</dt>
<dd>
<p>Nombre de la aplicaci&oacute;n.</p>
<p>El nombre puede incluir un identificador de versi&oacute;n opcional, que va a continuaci&oacute;n del nombre y est&aacute; separado de &eacute;l por dos puntos (<code>:</code>). El identificador de versi&oacute;n debe comenzar por una letra o n&uacute;mero. Puede contener caracteres alfanum&eacute;ricos m&aacute;s los caracteres de gui&oacute;n bajo (<code>_</code>), gui&oacute;n (<code>-</code>) y punto (<code>.</code>). Para obtener m&aacute;s informaci&oacute;n sobre las versiones de m&oacute;dulo y de aplicaci&oacute;n, consulte el apartado sobre <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>las versiones de m&oacute;dulo y de aplicaci&oacute;n</i> en <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt>Servidores Virtuales</dt>
<dd>
<p>Servidores virtuales asociados a esta aplicaci&oacute;n.</p>
<p>La opci&oacute;n Servidores Virtuales aparece si s&oacute;lo existe la instancia de servidor por defecto, <code>server</code>. Si existen clusters u otras instancias de servidor independientes, puede seleccionar los servidores virtuales despu&eacute;s del despliegue. Vaya a la p&aacute;gina Editar Aplicaci&oacute;n, seleccione el separador Destino y seleccione Gestionar Servidores Virtuales para el destino que desee.</p>
</dd>
<dt>Estado</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, la aplicaci&oacute;n est&aacute; activada. Esta opci&oacute;n est&aacute; activada por defecto.</p>
</dd>
<dt>Disponibilidad</dt>
<dd>
<p>Si se activa la casilla de control Activado, se activa la alta disponibilidad para las sesiones web, la aplicaci&oacute;n de puntos de control de bean de sesi&oacute;n con estado (SFSB) y posiblemente para la desactivaci&oacute;n. Si se define en false (valor por defecto), se desactiva el almacenamiento de sesiones web y puntos de control de SFSB para la aplicaci&oacute;n, aplicaci&oacute;n web o m&oacute;dulo EJB especificado. Si se define en true, la aplicaci&oacute;n o m&oacute;dulo especificados se activa para alta disponibilidad. Defina esta opci&oacute;n como true s&oacute;lo si se ha configurado y activado la alta disponibilidad en niveles superiores, como, por ejemplo, los niveles de servidor y contenedor.</p>
<p>Esta opci&oacute;n aparece si existen clusters o instancias del servidor independientes aparte de la instancia de servidor por defecto (<code>server</code>).</p>
</dd>
<dt>Tipo OSGi</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, especifica un m&oacute;dulo h&iacute;brido OSGi/Java-EE. Esta opci&oacute;n s&oacute;lo aparece si el tipo seleccionado es Otro.</p>
</dd>
<dt>Precompilar JSP</dt>
<dd>
<p>Si est&aacute; seleccionada esta opci&oacute;n, los archivos JavaServer Pages (JSP) se precompilar&aacute;n. Si est&aacute; desactivada esta opci&oacute;n, los archivos JSP se compilar&aacute;n en tiempo de ejecuci&oacute;n cuando se acceda a los mismos por primera vez. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Ejecutar Verificador</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, los descriptores de despliegue se verifican antes del despliegue. Si se produce un fallo en la verificaci&oacute;n, no se realiza el despliegue. El verificador examinar&aacute; la estructura y el contenido de los descriptores de despliegue. La verificaci&oacute;n de aplicaciones de gran tama&ntilde;o tiende a llevar mucho tiempo. Esta opci&oacute;n se activada por defecto.</p>
<p>Los paquetes de verificador se deben haber instalado desde la herramienta de actualizaci&oacute;n o se registrar&aacute; una advertencia y se ignorar&aacute; esta opci&oacute;n.</p>
</dd>
<dt>Forzar Nuevo Despliegue</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, se volver&aacute; a desplegar la aplicaci&oacute;n si est&aacute; ya desplegada. Si esta opci&oacute;n no est&aacute; seleccionada y se intenta desplegar una aplicaci&oacute;n que ya se haya desplegado, se producir&aacute; un error. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Mantener Estado</dt>
<dd>
<p>Esta opci&oacute;n controla si las sesiones web, instancias SFSB y temporizadores EJB creados de forma persistente se conservan entre los nuevos despliegues.</p>
<p>Esta opci&oacute;n se activada por defecto. Esta opci&oacute;n s&oacute;lo est&aacute; soportada en la instancia de servidor por defecto, denominada <code>server</code>. No se soporta para ning&uacute;n otro destino y se ignorar&aacute;.</p>
<p>Algunos cambios efectuados en una aplicaci&oacute;n entre nuevos despliegues impiden que esta opci&oacute;n funcione correctamente. Por ejemplo, no cambie el juego de variables de instancia en la clase de bean SFSB.</p>
<p>Para las aplicaciones web, esta funci&oacute;n s&oacute;lo es aplicable si, en el archivo <code>glassfish-web-app.xml</code>, el atributo <code>persistence-type</code> del elemento <code>session-manager</code> es <code>file</code>.</p>
<p>Para instancias de bean de sesi&oacute;n con estado, el tipo de persistencia sin alta disponibilidad se define en el servidor (con la opci&oacute;n Tipo de Persistencia SFSB) y se debe definir en <code>file</code>, que es el valor por defecto y recomendado.</p>
<p>Si una sesi&oacute;n web, instancia SFSB o temporizador EJB activo no se conserva o restablece, <i>ninguno</i> de ellos estar&aacute; disponible cuando se haya completado el nuevo despliegue. Sin embargo, el nuevo despliegue continuar&aacute; y se registrar&aacute; una advertencia.</p>
<p>Para conservar datos de estado activo, GlassFish Server serializa los datos y los guarda en la memoria. Para restaurar los datos, el cargador de clases de la aplicaci&oacute;n que se acaba de volver a desplegar deserializa los datos guardados anteriormente.</p>
</dd>
<dt>Orden de despliegue</dt>
<dd>
<p>Orden de despliegue de la aplicaci&oacute;n.</p>
<p>Las aplicaciones con un n&uacute;mero inferior se cargan en primer lugar al iniciar el servidor. Una aplicaci&oacute;n con un orden de aplicaci&oacute;n de 102 se carga antes que una aplicaci&oacute;n con un orden de aplicaci&oacute;n de 110. Si no se especifica un orden de despliegue en el momento de desplegar la aplicaci&oacute;n, se asigna un orden de despliegue por defecto de 100. Si dos aplicaciones tienen el mismo orden de despliegue, se despliega en primer lugar la aplicaci&oacute;n que se haya cargado primero. Especificar un orden de despliegue es &uacute;til si la aplicaci&oacute;n tiene dependencias y se deben cargar en un orden determinado.</p>
</dd>
<dt>Bibliotecas</dt>
<dd>
<p>Lista de archivos JAR de la biblioteca separados por comas espec&iacute;ficos de este m&oacute;dulo o aplicaci&oacute;n. Especifica una ruta de acceso absoluta o relativa. Una ruta de acceso relativa es relativa con respecto a domain-dir<code>/lib/applibs</code>. Si la ruta de acceso es absoluta, la ruta de acceso debe ser accesible para el servidor de administraci&oacute;n del dominio (DAS), lo que implica que debe estar en domain-dir. Las bibliotecas est&aacute;n disponibles para la aplicaci&oacute;n en el orden en que est&aacute;n especificadas.</p>
</dd>
<dt>Descripci&oacute;n</dt>
<dd>
<p>Descripci&oacute;n de la aplicaci&oacute;n.</p>
</dd>
</dl>
<p><a id="sthref304" name="sthref304"></a></p>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-applistdeployed.html">Ver una lista de aplicaciones desplegadas</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">Desplegar una aplicaci&oacute;n web</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">Desplegar una aplicaci&oacute;n de empresa</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">Desplegar un cliente de aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">Desplegar un m&oacute;dulo del conector</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">Desplegar un JAR EJB</a></p>
</li>
<li>
<p><a href="task-appedit.html">Editar una aplicaci&oacute;n desplegada</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">Ver los descriptores de una aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-endpoint.html">Ver informaci&oacute;n de punto final para un servicio web</a></p>
</li>
<li>
<p><a href="task-applaunch.html">Iniciar una aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">Iniciar un cliente de aplicaciones</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">Descargar stubs de clientes de aplicaciones</a></p>
</li>
<li>
<p><a href="task-appredeploy.html">Volver a desplegar una aplicaci&oacute;n desplegada</a></p>
</li>
<li>
<p><a href="task-apprestart.html">Volver a cargar una aplicaci&oacute;n desplegada</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">Ver los Recursos de &Aacute;mbito de Aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">Modificar los Recursos de &Aacute;mbito de Aplicaci&oacute;n</a></p>
</li>
</ul>
<p><a id="sthref305" name="sthref305"></a></p>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00114"><code>deploy</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00217"><code>redeploy</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00148"><code>list-applications</code>(1)</a></p>
</li>
</ul>
<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
