<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-uc-config" name="ref-uc-config"></a></p>

<h4><a id="sthref464" name="sthref464"></a>Configuraci&oacute;n de Herramienta de Actualizaci&oacute;n</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La p&aacute;gina Configuraci&oacute;n ofrece informaci&oacute;n de configuraci&oacute;n sobre Herramienta de Actualizaci&oacute;n y permite cambiar el modo de conexi&oacute;n de Herramienta de Actualizaci&oacute;n a Internet. Para cambiar otros aspectos de la configuraci&oacute;n de Herramienta de Actualizaci&oacute;n, utilice la aplicaci&oacute;n independiente <code>updatetool</code>, que se encuentra en as-install-parent<code>/bin</code>.</p>
<p>La p&aacute;gina Configuraci&oacute;n de Herramienta de Actualizaci&oacute;n contiene las siguientes opciones.</p>
<dl>
<dt>Ruta de instalaci&oacute;n</dt>
<dd>
<p>Ruta de acceso del sistema de archivos del directorio ra&iacute;z o nivel superior de la imagen de instalaci&oacute;n.</p>
</dd>
<dt>Repositorio preferido</dt>
<dd>
<p>Nombre del repositorio de red preferido asociado a esta imagen de instalaci&oacute;n, por ejemplo, <code>glassfish.org</code>.</p>
</dd>
<dt>Conexi&oacute;n a Internet</dt>
<dd>
<p>C&oacute;mo conectar GlassFish Server a Internet:</p>
<dl>
<dt>Conexi&oacute;n directa</dt>
<dd>
<p>Esta opci&oacute;n especifica que GlassFish Server se conecta directamente a Internet.</p>
</dd>
<dt>Mediante un servidor proxy</dt>
<dd>
<p>Esta opci&oacute;n especifica que GlassFish Server se conecta a Internet mediante un servidor proxy. Cuando esta opci&oacute;n est&aacute; seleccionada, se incluir&aacute;n en esta p&aacute;gina el campo Host del proxy y el campo Puerto del proxy.</p>
</dd>
</dl>
</dd>
<dt>Host del proxy</dt>
<dd>
<p>Nombre de host del servidor proxy del equipo en el que se ejecuta GlassFish Server.</p>
<p>Este campo s&oacute;lo es aplicable si el equipo en el que se est&aacute; ejecutando GlassFish Server se conecta a Internet a trav&eacute;s de un servidor proxy.</p>
</dd>
<dt>Puerto del proxy</dt>
<dd>
<p>N&uacute;mero de puerto del servidor proxy del equipo en el que se ejecuta GlassFish Server.</p>
<p>Este campo s&oacute;lo es aplicable si el equipo en el que se est&aacute; ejecutando GlassFish Server se conecta a Internet a trav&eacute;s de un servidor proxy.</p>
</dd>
<dt>Repositorios</dt>
<dd>
<p>Esta tabla ofrece la siguiente informaci&oacute;n sobre todos los repositorios de red que est&aacute;n asociados a esta imagen de instalaci&oacute;n:</p>
<dl>
<dt>Repositorio</dt>
<dd>
<p>Nombre del repositorio, por ejemplo, <code>dev.glassfish.org</code>.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref465" name="sthref465"></a>
<h5>Tareas relacionadas</h5>
<p><a href="task-uc-set-proxy.html">Configurar valores de proxy de red para acceder a repositorios de red</a></p>
<a id="sthref466" name="sthref466"></a>
<h5>Comandos asadmin Relacionados</h5>
<p>Ninguno.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
