<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-domainattributestab" name="ref-domainattributestab"></a></p>

<h4><a id="sthref213" name="sthref213"></a>Atributos de dominio</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Atributos de Dominio para definir atributos de dominio avanzados de GlassFish Server.</p>
<p>La p&aacute;gina Atributos de Dominio contiene las siguientes opciones.</p>
<dl>
<dt>Cargar Consola despu&eacute;s del Inicio de DAS</dt>
<dd>
<p>Determina cu&aacute;ndo se debe cargar Consola de administraci&oacute;n:</p>
<dl>
<dt>Basado en Uso</dt>
<dd>
<p>Carga Consola de administraci&oacute;n despu&eacute;s del servidor de administraci&oacute;n de dominio (DAS) si la consola se ha utilizado en las &uacute;ltimas 24 horas o si las dem&aacute;s instancias del servidor existen de forma independiente al DAS. &Eacute;ste es el valor por defecto.</p>
</dd>
<dt>Siempre</dt>
<dd>
<p>Siempre carga Consola de administraci&oacute;n despu&eacute;s del DAS. La consola se cargar&aacute; despu&eacute;s de que haya finalizado la secuencia de inicio principal de GlassFish Server.</p>
</dd>
<dt>Nunca</dt>
<dd>
<p>No carga nunca Consola de administraci&oacute;n despu&eacute;s del DAS. La consola se carga cuando se solicita acceso a ella.</p>
</dd>
</dl>
</dd>
<dt>Ra&iacute;z de Aplicaci&oacute;n</dt>
<dd>
<p>Ruta de acceso completa del directorio donde residen las aplicaciones desplegadas. El valor por defecto es domain-dir<code>/applications</code>.</p>
</dd>
<dt>Ra&iacute;z de Log</dt>
<dd>
<p>Identifica el lugar en el que se guardan los archivos log del servidor. El valor por defecto es domain-dir<code>/logs</code>.</p>
</dd>
<dt>Configuraci&oacute;n Regional</dt>
<dd>
<p>Si se deja este campo en blanco, se utilizar&aacute; la configuraci&oacute;n regional por defecto del host.</p>
<p>La configuraci&oacute;n regional es un identificador que especifica una combinaci&oacute;n concreta de idioma y regi&oacute;n. Por ejemplo, la configuraci&oacute;n regional para ingl&eacute;s de Estados Unidos es <code>en_US</code> y para japon&eacute;s es <code>ja_JP</code>. Para utilizar una configuraci&oacute;n regional que no sea del idioma ingl&eacute;s, GlassFish Server tiene que estar localizado, un proceso que incluye traducir el ingl&eacute;s a otro idioma.</p>
</dd>
</dl>
<a id="sthref214" name="sthref214"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-setadvanceappconfig.html">Definir la configuraci&oacute;n de aplicaciones</a></p>
</li>
<li>
<p><a href="task-setadvancedomainattributes.html">Definir los atributos de dominio</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
