<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-appedit" name="ref-appedit"></a></p>

<h4><a id="sthref270" name="sthref270"></a>Editar aplicaci&oacute;n</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Editar Aplicaci&oacute;n para modificar una aplicaci&oacute;n existente.</p>
<p>La p&aacute;gina Editar Aplicaci&oacute;n contiene algunas o todas las opciones siguientes, en funci&oacute;n del tipo de aplicaci&oacute;n.</p>
<dl>
<dt>Nombre</dt>
<dd>
<p>Campo de s&oacute;lo lectura que muestra el nombre de la aplicaci&oacute;n que est&aacute; editando.</p>
<p>El nombre puede incluir un identificador de versi&oacute;n opcional, que va a continuaci&oacute;n del nombre y est&aacute; separado de &eacute;l por dos puntos (<code>:</code>). Para obtener m&aacute;s informaci&oacute;n sobre las versiones de m&oacute;dulo y de aplicaci&oacute;n, consulte el apartado sobre <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>las versiones de m&oacute;dulo y de aplicaci&oacute;n</i> en <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt>Estado</dt>
<dd>
<p>Si se activa la casilla de control Activado, se activa la aplicaci&oacute;n. Esta opci&oacute;n est&aacute; activada por defecto.</p>
</dd>
<dt>Ra&iacute;z de Contexto</dt>
<dd>
<p>Para una aplicaci&oacute;n web, especifica la ruta de acceso a la aplicaci&oacute;n. En la URL de la aplicaci&oacute;n web, la ra&iacute;z de contexto sigue inmediatamente al n&uacute;mero de puerto (<code>http://</code><i>host</i><code>:</code><i>puertot</i><code>/</code><i>ra&iacute;z-contexto</i><code>/...</code>). La ra&iacute;z de contexto debe comenzar por una barra diagonal, por ejemplo, <code>/hello</code>.</p>
</dd>
<dt>Disponibilidad</dt>
<dd>
<p>Si se activa la casilla de control Activado, se activa la alta disponibilidad para las sesiones web, la aplicaci&oacute;n de puntos de control de bean de sesi&oacute;n con estado (SFSB) y posiblemente para la desactivaci&oacute;n. Si se define en false (valor por defecto), se desactiva el almacenamiento de sesiones web y puntos de control de SFSB para la aplicaci&oacute;n, aplicaci&oacute;n web o m&oacute;dulo EJB especificado. Si se define en true, la aplicaci&oacute;n o m&oacute;dulo especificados se activa para alta disponibilidad. Defina esta opci&oacute;n como true s&oacute;lo si se ha configurado y activado la alta disponibilidad en niveles superiores, como, por ejemplo, los niveles de servidor y contenedor.</p>
<p>Esta opci&oacute;n aparece si existen clusters o instancias del servidor independientes aparte de la instancia de servidor por defecto (<code>server</code>).</p>
</dd>
<dt>Servidores Virtuales</dt>
<dd>
<p>Servidores virtuales asociados a esta aplicaci&oacute;n.</p>
<p>La opci&oacute;n Servidores Virtuales aparece si s&oacute;lo existe la instancia de servidor por defecto, <code>server</code>. Si existen clusters u otras instancias de servidor independientes, puede seleccionar los servidores virtuales despu&eacute;s del despliegue. Vaya a la p&aacute;gina Editar Aplicaci&oacute;n, seleccione el separador Destino y seleccione Gestionar Servidores Virtuales para el destino que desee.</p>
</dd>
<dt>Java Web Start</dt>
<dd>
<p>(Para algunos tipos de aplicaciones) Si se activa la casilla de control Activado, la aplicaci&oacute;n emplear&aacute; el software Java Web Start. Java Web Start proporciona una forma independiente de los exploradores de desplegar aplicaciones Java para que se ejecuten en una Java Virtual Machine dedicada.</p>
</dd>
<dt>Descripci&oacute;n</dt>
<dd>
<p>Breve descripci&oacute;n de la aplicaci&oacute;n.</p>
</dd>
<dt>Ubicaci&oacute;n</dt>
<dd>
<p>Ubicaci&oacute;n de la aplicaci&oacute;n desplegada. &Eacute;ste es un campo de s&oacute;lo lectura.</p>
</dd>
<dt>Orden de despliegue</dt>
<dd>
<p>Orden de despliegue de la aplicaci&oacute;n.</p>
<p>Las aplicaciones con un n&uacute;mero inferior se cargan en primer lugar al iniciar el servidor. Una aplicaci&oacute;n con un orden de aplicaci&oacute;n de 102 se carga antes que una aplicaci&oacute;n con un orden de aplicaci&oacute;n de 110. Si no se especifica un orden de despliegue en el momento de desplegar la aplicaci&oacute;n, se asigna un orden de despliegue por defecto de 100. Si dos aplicaciones tienen el mismo orden de despliegue, se despliega en primer lugar la aplicaci&oacute;n que se haya cargado primero. Especificar un orden de despliegue es &uacute;til si la aplicaci&oacute;n tiene dependencias y se deben cargar en un orden determinado.</p>
</dd>
<dt>Bibliotecas</dt>
<dd>
<p>Archivos JAR de biblioteca que necesitar&aacute; la aplicaci&oacute;n. &Eacute;ste es un campo de s&oacute;lo lectura.</p>
</dd>
<dt>M&oacute;dulos y Componentes</dt>
<dd>
<p>Tabla en la que figuran los nombres de los m&oacute;dulos de la aplicaci&oacute;n y sus motores. Para un punto final de servicio web, puede seleccionar Ver Punto Final para visualizar la p&aacute;gina Informaci&oacute;n de Punto Final de Servicio Web. Para un cliente de aplicaci&oacute;n puede seleccionar Iniciar para mostrar la p&aacute;gina de inicio del cliente de aplicaciones o Descargar Stubs de Cliente para descargar los stubs de cliente.</p>
</dd>
</dl>
<a id="sthref271" name="sthref271"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-appedit.html">Editar una aplicaci&oacute;n desplegada</a></p>
</li>
<li>
<p><a href="task-applistdeployed.html">Ver una lista de aplicaciones desplegadas</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">Desplegar una aplicaci&oacute;n web</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">Desplegar una aplicaci&oacute;n de empresa</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">Desplegar un cliente de aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">Desplegar un m&oacute;dulo del conector</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">Desplegar un JAR EJB</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">Ver los descriptores de una aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-appviewtargets.html">Ver los Destinos de Aplicaciones</a></p>
</li>
<li>
<p><a href="task-endpoint.html">Ver informaci&oacute;n de punto final para un servicio web</a></p>
</li>
<li>
<p><a href="task-applaunch.html">Iniciar una aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">Iniciar un cliente de aplicaciones</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">Descargar stubs de clientes de aplicaciones</a></p>
</li>
<li>
<p><a href="task-appredeploy.html">Volver a desplegar una aplicaci&oacute;n desplegada</a></p>
</li>
<li>
<p><a href="task-apprestart.html">Volver a cargar una aplicaci&oacute;n desplegada</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">Ver los Recursos de &Aacute;mbito de Aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">Modificar los Recursos de &Aacute;mbito de Aplicaci&oacute;n</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
