<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-redeploy" name="ref-redeploy"></a><a id="GHCOM00078" name="GHCOM00078"></a></p>

<h4><a id="sthref306" name="sthref306"></a><a id="sthref307" name="sthref307"></a>Volver a desplegar aplicaciones o m&oacute;dulos</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Volver a Desplegar Aplicaciones o M&oacute;dulos para volver a desplegar una aplicaci&oacute;n previamente desplegada.</p>
<p>La p&aacute;gina Volver a Desplegar Aplicaciones o M&oacute;dulos contiene las siguientes opciones.</p>
<dl>
<dt>Ubicaci&oacute;n</dt>
<dd>
<p>Ubicaci&oacute;n del nuevo archivo para la aplicaci&oacute;n que desea volver a desplegar.</p>
<p>Las opciones siguientes especifican desde d&oacute;nde se puede acceder al archivo y si es un archivo o un directorio.</p>
<dl>
<dt>Archivo Empaquetado que Cargar en el Servidor</dt>
<dd>
<p>El archivo reside en la m&aacute;quina cliente o se puede acceder a &eacute;l desde la misma.</p>
<p>La m&aacute;quina cliente es el host en el que est&aacute; visualizando la Consola de administraci&oacute;n a trav&eacute;s de un explorador.</p>
</dd>
<dt>Archivo empaquetado local o directorio accesible desde GlassFish Server</dt>
<dd>
<p>El archivo reside en la m&aacute;quina del servidor o es una aplicaci&oacute;n desempaquetada en un directorio separado.</p>
<p>La m&aacute;quina del servidor es el host que est&aacute; ejecutando el servidor de administraci&oacute;n de dominio de GlassFish Server.</p>
</dd>
</dl>
</dd>
<dt>Nombre de Aplicaci&oacute;n</dt>
<dd>
<p>Campo de s&oacute;lo lectura que muestra el nombre de la aplicaci&oacute;n que desea volver a desplegar.</p>
<p>El nombre puede incluir un identificador de versi&oacute;n opcional, que va a continuaci&oacute;n del nombre y est&aacute; separado de &eacute;l por dos puntos (<code>:</code>). Para obtener m&aacute;s informaci&oacute;n sobre las versiones de m&oacute;dulo y de aplicaci&oacute;n, consulte el apartado sobre <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>las versiones de m&oacute;dulo y de aplicaci&oacute;n</i> en <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt>Disponibilidad</dt>
<dd>
<p>Si se activa la casilla de control Activado, se activa la alta disponibilidad para las sesiones web, la aplicaci&oacute;n de puntos de control de bean de sesi&oacute;n con estado (SFSB) y posiblemente para la desactivaci&oacute;n. Si se define en false (valor por defecto), se desactiva el almacenamiento de sesiones web y puntos de control de SFSB para la aplicaci&oacute;n, aplicaci&oacute;n web o m&oacute;dulo EJB especificado. Si se define en true, la aplicaci&oacute;n o m&oacute;dulo especificados se activa para alta disponibilidad. Defina esta opci&oacute;n como true s&oacute;lo si se ha configurado y activado la alta disponibilidad en niveles superiores, como, por ejemplo, los niveles de servidor y contenedor.</p>
<p>Esta opci&oacute;n aparece si existen clusters o instancias del servidor independientes aparte de la instancia de servidor por defecto (<code>server</code>).</p>
</dd>
<dt>Precompilar JSP</dt>
<dd>
<p>Si est&aacute; seleccionada esta opci&oacute;n, los archivos JavaServer Pages (JSP) se precompilar&aacute;n. Si est&aacute; desactivada esta opci&oacute;n, los archivos JSP se compilar&aacute;n en tiempo de ejecuci&oacute;n cuando se acceda a los mismos por primera vez. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Ejecutar Verificador</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, los descriptores de despliegue se verifican antes del despliegue. Si se produce un fallo en la verificaci&oacute;n, no se realiza el despliegue. El verificador examinar&aacute; la estructura y el contenido de los descriptores de despliegue. La verificaci&oacute;n de aplicaciones de gran tama&ntilde;o tiende a llevar mucho tiempo. Esta opci&oacute;n se activada por defecto.</p>
<p>Los paquetes de verificador se deben haber instalado desde la herramienta de actualizaci&oacute;n o se registrar&aacute; una advertencia y se ignorar&aacute; esta opci&oacute;n.</p>
</dd>
<dt>Java Web Start</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, se permite el acceso a Java Web Start para un m&oacute;dulo de cliente de aplicaciones. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Mantener Estado</dt>
<dd>
<p>Esta opci&oacute;n controla si las sesiones web, instancias SFSB y temporizadores EJB creados de forma persistente se conservan entre los nuevos despliegues.</p>
<p>Esta opci&oacute;n se activada por defecto. Esta opci&oacute;n s&oacute;lo est&aacute; soportada en la instancia de servidor por defecto, denominada <code>server</code>. No se soporta para ning&uacute;n otro destino y se ignorar&aacute;.</p>
<p>Algunos cambios efectuados en una aplicaci&oacute;n entre nuevos despliegues impiden que esta opci&oacute;n funcione correctamente. Por ejemplo, no cambie el juego de variables de instancia en la clase de bean SFSB.</p>
<p>Para las aplicaciones web, esta funci&oacute;n s&oacute;lo es aplicable si, en el archivo <code>glassfish-web-app.xml</code>, el atributo <code>persistence-type</code> del elemento <code>session-manager</code> es <code>file</code>.</p>
<p>Para instancias de bean de sesi&oacute;n con estado, el tipo de persistencia sin alta disponibilidad se define en el servidor (con la opci&oacute;n Tipo de Persistencia SFSB) y se debe definir en <code>file</code>, que es el valor por defecto y recomendado.</p>
<p>Si una sesi&oacute;n web, instancia SFSB o temporizador EJB activo no se conserva o restablece, <i>ninguno</i> de ellos estar&aacute; disponible cuando se haya completado el nuevo despliegue. Sin embargo, el nuevo despliegue continuar&aacute; y se registrar&aacute; una advertencia.</p>
<p>Para conservar datos de estado activo, GlassFish Server serializa los datos y los guarda en la memoria. Para restaurar los datos, el cargador de clases de la aplicaci&oacute;n que se acaba de volver a desplegar deserializa los datos guardados anteriormente.</p>
</dd>
<dt>Conservar Recursos de &Aacute;mbito de Aplicaci&oacute;n</dt>
<dd>
<p>Si se activa, conserva todos los recursos de &aacute;mbito de aplicaci&oacute;n y los restaura durante el nuevo despliegue. Esta opci&oacute;n no est&aacute; activada por defecto.</p>
</dd>
</dl>
<a id="sthref308" name="sthref308"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-appredeploy.html">Volver a desplegar una aplicaci&oacute;n desplegada</a></p>
</li>
<li>
<p><a href="task-applistdeployed.html">Ver una lista de aplicaciones desplegadas</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">Desplegar una aplicaci&oacute;n web</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">Desplegar una aplicaci&oacute;n de empresa</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">Desplegar un cliente de aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">Desplegar un m&oacute;dulo del conector</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">Desplegar un JAR EJB</a></p>
</li>
<li>
<p><a href="task-appedit.html">Editar una aplicaci&oacute;n desplegada</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">Ver los descriptores de una aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-endpoint.html">Ver informaci&oacute;n de punto final para un servicio web</a></p>
</li>
<li>
<p><a href="task-applaunch.html">Iniciar una aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">Iniciar un cliente de aplicaciones</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">Descargar stubs de clientes de aplicaciones</a></p>
</li>
<li>
<p><a href="task-apprestart.html">Volver a cargar una aplicaci&oacute;n desplegada</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">Ver los Recursos de &Aacute;mbito de Aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">Modificar los Recursos de &Aacute;mbito de Aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbcontaineravailability.html">Configurar los valores de disponibilidad del contenedor EJB</a></p>
</li>
</ul>
<a id="sthref309" name="sthref309"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00114"><code>deploy</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00217"><code>redeploy</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00148"><code>list-applications</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00185"><code>list-modules</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
