<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-uc-concepts" name="ref-uc-concepts"></a></p>

<h4><a id="sthref253" name="sthref253"></a>Conceptos clave de Herramienta de Actualizaci&oacute;n</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Herramienta de Actualizaci&oacute;n gestiona la instalaci&oacute;n de componentes de software de GlassFish Server que se encuentran en un &uacute;nico directorio de sistema de archivos en su sistema.</p>
<p>La versi&oacute;n Consola de administraci&oacute;n de Herramienta de Actualizaci&oacute;n permite realizar las siguientes acciones:</p>
<ul>
<li>
<p>Instalar complementos</p>
</li>
<li>
<p>Ver actualizaciones para los componentes instalados</p>
</li>
<li>
<p>Ver los componentes instalados</p>
</li>
</ul>
<p>Para actualizar o eliminar los componentes instalados, debe parar el dominio de GlassFish Server y, a continuaci&oacute;n, utilizar uno de los siguientes comandos:</p>
<ul>
<li>
<p>as-install-parent<code>/bin/updatetool</code>, que inicia la utilidad gr&aacute;fica Herramienta de actualizaci&oacute;n.</p>
</li>
<li>
<p>as-install-parent<code>/bin/pkg</code>, versi&oacute;n de l&iacute;nea de comandos de la herramienta de actualizaci&oacute;n</p>
</li>
</ul>
<p>Los conceptos clave de Herramienta de Actualizaci&oacute;n se describen en las secciones que vienen a continuaci&oacute;n.</p>
<a id="ref-uc-about-component" name="ref-uc-about-component"></a><a id="GHCOM483" name="GHCOM483"></a>
<h5>Componente</h5>
<p>Un componente es la unidad instalable que gestiona Herramienta de Actualizaci&oacute;n. Un componente consta de varios archivos instalados como una unidad en el sistema dentro de una imagen de instalaci&oacute;n.</p>
<a id="ref-uc-about-image" name="ref-uc-about-image"></a><a id="GHCOM484" name="GHCOM484"></a>
<h5>Imagen de instalaci&oacute;n</h5>
<p>Una imagen de instalaci&oacute;n es el directorio que contiene los componentes del software, incluyendo el contenido del directorio. La imagen de instalaci&oacute;n se agrega a Herramienta de Actualizaci&oacute;n como resultado de la descarga e instalaci&oacute;n del software de GlassFish Server. Para activar la adici&oacute;n y actualizaci&oacute;n de componentes del software de GlassFish Server, cada imagen de instalaci&oacute;n contiene informaci&oacute;n sobre los componentes de instalaci&oacute;n.</p>
<a id="ref-uc-about-repository" name="ref-uc-about-repository"></a><a id="GHCOM485" name="GHCOM485"></a>
<h5>Repositorio de red</h5>
<p>Un repositorio de red contiene los elementos siguientes:</p>
<ul>
<li>
<p>Componentes que pueden agregarse a una imagen de instalaci&oacute;n</p>
</li>
<li>
<p>Actualizaciones disponibles para los componentes existentes en una imagen de instalaci&oacute;n</p>
</li>
</ul>
<p>Una imagen de instalaci&oacute;n se asocia a uno o m&aacute;s repositorios de red. Cada uno de ellos est&aacute; representado por un nombre y una URL asociada. Cada imagen de instalaci&oacute;n tiene un nombre de repositorio &uacute;nico que representa tanto a la organizaci&oacute;n o al proyecto que gestiona el repositorio, como a un &aacute;mbito de contenido bien definido. Para obtener m&aacute;s informaci&oacute;n sobre los repositorios de red preconfigurados para GlassFish Server, consulte la secci&oacute;n sobre <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSADG00569"><i>repositorios preconfigurados para GlassFish Server</i> en <i>Oracle GlassFish Server Administration Guide</i></a>.</p>
<a id="ref-uc-about-addon" name="ref-uc-about-addon"></a><a id="GHCOM486" name="GHCOM486"></a>
<h5>Componente de complementos</h5>
<p>Un componente de complementos es un componente de la imagen de instalaci&oacute;n que no se ha instalado todav&iacute;a.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
