<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-serverinstjvmgeneral" name="ref-serverinstjvmgeneral"></a><a id="GHCOM00090" name="GHCOM00090"></a></p>

<h4><a id="sthref326" name="sthref326"></a>Configuraci&oacute;n general de JVM</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Java Virtual Machine (JVM) permite la ejecuci&oacute;n de los c&oacute;digos de bytes de Java en una m&aacute;quina f&iacute;sica. Al ajustar la configuraci&oacute;n de JVM, mejora el rendimiento y se evitan errores de asignaci&oacute;n de memoria.</p>
<p>Java Virtual Machine se incluye en la plataforma Java, Standard Edition (plataforma Java SE), que necesita GlassFish Server. La introducci&oacute;n de una configuraci&oacute;n de JVM incorrecta har&aacute; que no funcione el servidor, por lo que tiene que ir con cuidado a la hora de cambiar esta configuraci&oacute;n.</p>

<hr>
<p><b>Nota:</b></p>
Los t&eacute;rminos "Java Virtual Machine" y "JVM" se refieren a una m&aacute;quina virtual para la plataforma Java.
<hr>

<p>La p&aacute;gina Configuraci&oacute;n General de JVM contiene las siguientes opciones.</p>
<dl>
<dt>Cargar Valores por Defecto</dt>
<dd>
<p>Bot&oacute;n para restaurar configuraci&oacute;n que tiene valores por defecto a sus valores por defecto. Las configuraciones que no tienen valores por defecto no se modifican.</p>
</dd>
<dt>Nombre de Configuraci&oacute;n</dt>
<dd>
<p>Nombre de la configuraci&oacute;n a la que se aplican los valores de esta p&aacute;gina. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>Directorio Ra&iacute;z de Java</dt>
<dd>
<p>Nombre del directorio de instalaci&oacute;n del software de Java SE, que necesita GlassFish Server para poder ejecutarse. Para comprobar que la versi&oacute;n del software de Java SE que ha especificado est&aacute; soportada en esta versi&oacute;n, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRLN"><i>Notas T&eacute;cnicas sobre la Versi&oacute;n de Oracle GlassFish Server</i></a>. Si introduce un nombre de directorio inexistente o un directorio para una versi&oacute;n no soportada del software de Java SE, GlassFish Server no se podr&aacute; iniciar.</p>
</dd>
<dt>Opciones de Javac</dt>
<dd>
<p>Opciones de l&iacute;nea de comandos para el compilador del lenguaje de programaci&oacute;n de Java. GlassFish Server ejecuta el compilador cuando se despliegan los componentes de Enterprise JavaBeans (EJB).</p>
</dd>
<dt>Depurar</dt>
<dd>
<p>Activa la depuraci&oacute;n con Java Platform Debugger Architecture (JPDA).</p>
<p>Los desarrolladores de aplicaciones utilizan JPDA. Para obtener m&aacute;s informaci&oacute;n, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDVG"><i>Oracle GlassFish Server Application Development Guide</i></a>.</p>
</dd>
<dt>Opciones de Depuraci&oacute;n</dt>
<dd>
<p>Especifica las opciones de JPDA enviadas a JVM al activar la depuraci&oacute;n.</p>
</dd>
<dt>Opciones de Compilaci&oacute;n RMI</dt>
<dd>
<p>Opciones de l&iacute;nea de comandos para el compilador <code>rmic</code>. GlassFish Server ejecuta el compilador <code>rmic</code> cuando se despliegan componentes EJB.</p>
</dd>
<dt>Preprocesador de C&oacute;digo de Byte</dt>
<dd>
<p>Nombres de clases para el preprocesamiento de c&oacute;digo de byte. Utilice comas para separar los nombres de clase. Cada clase debe implantar la interfaz com.sun.appserv.BytecodePreprocessor. Las clases se llaman en el orden especificado.</p>
</dd>
<dt>Propiedades Adicionales</dt>
<dd>
<p>Propiedades adicionales para JVM. GlassFish Server no define ninguna propiedad adicional para JVM.</p>
</dd>
</dl>
<a id="sthref327" name="sthref327"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-jvmsettings.html">Configurar los valores generales de JVM</a></p>
</li>
<li>
<p><a href="task-jvmpathsettings.html">Configurar los valores de ruta de acceso de JVM</a></p>
</li>
<li>
<p><a href="task-jvmoptions.html">Configurar opciones de JVM</a></p>
</li>
<li>
<p><a href="task-securitymanagerdisable.html">Desactivar el gestor de seguridad</a></p>
</li>
<li>
<p><a href="task-jvmprofilersettings.html">Configurar los valores del analizador de perfiles de JVM</a></p>
</li>
</ul>
<a id="sthref328" name="sthref328"></a>
<h5>Comandos asadmin Relacionados</h5>
<p>Ninguno.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
