<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-recovertransactions" name="ref-recovertransactions"></a><a id="GHCOM00061" name="GHCOM00061"></a></p>

<h4><a id="sthref243" name="sthref243"></a>Recuperar transacciones</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Recuperar transacciones para recuperar transacciones para una instancia de GlassFish Server.</p>
<p>Si la instancia se est&aacute; ejecutando, la p&aacute;gina Recuperar transacciones s&oacute;lo contiene el texto <b>La recuperaci&oacute;n la realiza el propio servidor en ejecuci&oacute;n</b> y el bot&oacute;n Aceptar.</p>
<p>Si la instancia no se est&aacute; ejecutando, la p&aacute;gina Recuperar transacciones contiene las siguientes opciones.</p>
<dl>
<dt>Nombre de instancia</dt>
<dd>
<p>Nombre que se asign&oacute; a la instancia en el momento de su creaci&oacute;n. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>Servidor de destino</dt>
<dd>
<p>Otra instancia que puede recuperar las transacciones en la instancia actual.</p>
</dd>
<dt>Directorio de log de transacciones</dt>
<dd>
<p>Directorio en el que se almacenan los logs de transacciones si los logs se almacenan en un sistema de archivos compartidos. Esta opci&oacute;n no es aplicable a los logs de transacciones almacenados en una base de datos. El valor por defecto es <code>/logs/tx</code> en el directorio de dominio.</p>
<p>Los logs de transacciones se guardan en el subdirectorio <code>tx</code> del directorio especificado por la configuraci&oacute;n de Ubicaci&oacute;n de log de transacciones del servicio de transacci&oacute;n para la configuraci&oacute;n del cluster. El valor por defecto de Ubicaci&oacute;n de log de transacciones es el directorio especificado en el campo Ra&iacute;z de log de la p&aacute;gina Atributos de dominio, que est&aacute; ubicada en el separador Avanzado del nodo GlassFish Server.</p>
</dd>
</dl>
<a id="sthref244" name="sthref244"></a>
<h5>Subcomandos asadmin equivalentes</h5>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00216"><code>recover-transactions</code>(1)</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
