<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-serverinstjvmpathsettings" name="ref-serverinstjvmpathsettings"></a></p>

<h4><a id="sthref329" name="sthref329"></a>Configuraci&oacute;n de ruta de acceso de JVM</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Configuraci&oacute;n de Ruta de Acceso de JVM para configurar la ruta de acceso de biblioteca nativa. La ruta de acceso de biblioteca nativa consiste en una concatenaci&oacute;n de las rutas de acceso siguientes:</p>
<ul>
<li>
<p>El prefijo de la ruta de acceso de biblioteca nativa</p>
</li>
<li>
<p>La ruta de acceso del servidor para sus bibliotecas nativas (es decir, as-install<code>/lib</code>)</p>
</li>
<li>
<p>Los directorios de biblioteca nativa de 64 bits, si procede</p>
</li>
<li>
<p>El valor de la variable <code>java.library.path</code> para la JVM utilizada para iniciar GlassFish Server (este valor es distinto en diferentes sistemas operativos)</p>
</li>
<li>
<p>Las rutas de acceso que se especifican en la p&aacute;gina <a href="ref-serverinstjvmprofiler.html">Configuraci&oacute;n de analizador de perfiles de JVM</a>, si el analizador est&aacute; activado</p>
</li>
<li>
<p>El sufijo de la ruta de acceso de biblioteca nativa</p>
</li>
</ul>
<p>Otros par&aacute;metros de configuraci&oacute;n se muestran como valores de s&oacute;lo lectura para los dominios que se han actualizado desde una versi&oacute;n anterior de GlassFish Server. No est&aacute;n soportados en la versi&oacute;n v3.</p>
<p>La p&aacute;gina Configuraci&oacute;n de Ruta de Acceso de JVM contiene las siguientes opciones.</p>
<dl>
<dt>Nombre de Configuraci&oacute;n</dt>
<dd>
<p>Nombre de la configuraci&oacute;n a la que se aplican los valores de esta p&aacute;gina. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>Classpath de Entorno</dt>
<dd>
<p>Si se activa la casilla de control Ignorar, se omitir&aacute; la variable de entorno <code>CLASSPATH</code>. La variable de entorno <code>CLASSPATH</code> resulta c&oacute;moda para tutoriales b&aacute;sicos de programaci&oacute;n, pero no se recomienda en entornos de empresa. &Eacute;ste es un campo de s&oacute;lo lectura.</p>
</dd>
<dt>Classpath del Sistema</dt>
<dd>
<p>Ruta de acceso a las clases del sistema. &Eacute;ste es un campo de s&oacute;lo lectura.</p>
</dd>
<dt>Prefijo de Classpath</dt>
<dd>
<p>Rutas de acceso completas a los archivos JAR que se van a anteponer a la classpath del servidor, una por l&iacute;nea. &Eacute;ste es un campo de s&oacute;lo lectura.</p>
</dd>
<dt>Sufijo de Classpath</dt>
<dd>
<p>Rutas de acceso completas a los archivos JAR que se van a agregar a la classpath del servidor, una por l&iacute;nea. &Eacute;ste es un campo de s&oacute;lo lectura.</p>
</dd>
<dt>Prefijo de Ruta de Acceso de Biblioteca Nativa</dt>
<dd>
<p>Rutas de acceso completas a los archivos JAR que se van a anteponer a la ruta de acceso de biblioteca nativa, una por l&iacute;nea.</p>
</dd>
<dt>Sufijo de Ruta de Acceso de Biblioteca Nativa</dt>
<dd>
<p>Rutas de acceso completas a los archivos JAR que se van a agregar a la ruta de acceso de biblioteca nativa, una por l&iacute;nea.</p>
</dd>
</dl>
<a id="sthref330" name="sthref330"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-jvmsettings.html">Configurar los valores generales de JVM</a></p>
</li>
<li>
<p><a href="task-jvmpathsettings.html">Configurar los valores de ruta de acceso de JVM</a></p>
</li>
<li>
<p><a href="task-jvmoptions.html">Configurar opciones de JVM</a></p>
</li>
<li>
<p><a href="task-securitymanagerdisable.html">Desactivar el gestor de seguridad</a></p>
</li>
<li>
<p><a href="task-jvmprofilersettings.html">Configurar los valores del analizador de perfiles de JVM</a></p>
</li>
</ul>
<a id="sthref331" name="sthref331"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00042"><code>create-jvm-options</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00094"><code>delete-jvm-options</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00180"><code>list-jvm-options</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00050"><code>create-profiler</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00102"><code>delete-profiler</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
