<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-securityadmin" name="ref-securityadmin"></a></p>

<h4>Administraci&oacute;n Segura</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Administraci&oacute;n Segura para activar o desactivar la administraci&oacute;n segura.</p>
<p>Cuando se activa la administraci&oacute;n segura:</p>
<ul>
<li>
<p>DAS y las instancias del dominio utilizan certificados SSL para cifrar los mensajes que se env&iacute;an mutuamente.</p>
</li>
<li>
<p>DAS acepta mensajes de administraci&oacute;n de los clientes del administrador remotos como la utilidad asadmin y los IDE.</p>
</li>
</ul>
<p>La p&aacute;gina Administraci&oacute;n Segura contiene la informaci&oacute;n siguiente.</p>
<dl>
<dt>Activar Administraci&oacute;n Segura</dt>
<dd>
<p>Bot&oacute;n para activar la administraci&oacute;n segura. Este bot&oacute;n s&oacute;lo aparece cuando la administraci&oacute;n segura no est&aacute; activada.</p>

<hr>
<p><b>Nota:</b></p>
Si alg&uacute;n usuario administrativo del dominio tiene una contrase&ntilde;a en blanco, los intentos de activar la administraci&oacute;n segura fallan.
<hr>

</dd>
<dt>Desactivar Administraci&oacute;n Segura</dt>
<dd>
<p>Bot&oacute;n para desactivar la administraci&oacute;n segura. Este bot&oacute;n s&oacute;lo aparece cuando la administraci&oacute;n segura est&aacute; activada.</p>
</dd>
<dt>Alias de Administraci&oacute;n</dt>
<dd>
<p>Alias que hace referencia al certificado SSL/TLS en el DAS. Este alias lo utiliza el DAS para identificarse ante las instancias. El valor por defecto es <code>s1as</code>. Esta opci&oacute;n s&oacute;lo aparece cuando la administraci&oacute;n segura no est&aacute; activada.</p>
</dd>
<dt>Alias de Instancia</dt>
<dd>
<p>Alias que hace referencia al certificado SSL/TLS en las instancias. Este alias lo utilizan las instancias para identificarse ante el DAS. El valor por defecto es <code>glassfish-instance</code>. Esta opci&oacute;n s&oacute;lo aparece cuando la administraci&oacute;n segura no est&aacute; activada.</p>
</dd>
</dl>
<a id="sthref245" name="sthref245"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-enable-secure-admin.html">Activar la Administraci&oacute;n Segura</a></p>
</li>
<li>
<p><a href="task-disable-secure-admin.html">Desactivar la Administraci&oacute;n Segura</a></p>
</li>
</ul>
<a id="sthref246" name="sthref246"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00129"><code>enable-secure-admin</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00121"><code>disable-secure-admin</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
