<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-configurationsystemproperties" name="ref-configurationsystemproperties"></a></p>

<h4><a id="sthref436" name="sthref436"></a><a id="sthref437" name="sthref437"></a>Propiedades del sistema</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La p&aacute;gina Propiedades del sistema muestra una lista de las propiedades del sistema Java definidas en la configuraci&oacute;n con nombre seleccionada. Las propiedades del sistema Java se transfieren al iniciador de aplicaciones Java mediante la opci&oacute;n <code>-D</code> del iniciador de aplicaciones Java al iniciar GlassFish Server.</p>
<p>Estas propiedades definen los valores por defecto de la configuraci&oacute;n de puerto para todas las instancias de GlassFish Server que hacen referencia a la configuraci&oacute;n.</p>
<p>Para obtener m&aacute;s informaci&oacute;n sobre la configuraci&oacute;n de puerto predefinida en una configuraci&oacute;n, consulte <a href="ref-predefinedconfigsysproperties.html">Propiedades del sistema predefinidas</a>.</p>
<p>Para cada propiedad se muestra la informaci&oacute;n siguiente:</p>
<dl>
<dt>Nombre de variable de instancia</dt>
<dd>
<p>Nombre de la propiedad del sistema.</p>
</dd>
<dt>Valor por defecto</dt>
<dd>
<p>Valor que se define para la propiedad en la configuraci&oacute;n especificada a la que hace referencia la instancia. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>Valores de instancia</dt>
<dd>
<p>Enlace a la p&aacute;gina <a href="ref-sysinstancevalues.html">Valores de instancia</a> de la propiedad.</p>
</dd>
</dl>
<p>La tabla Propiedades adicionales tambi&eacute;n contiene las opciones siguientes.</p>
<dl>
<dt>Agregar propiedad</dt>
<dd>
<p>Bot&oacute;n para agregar una propiedad. Al hacer clic en este bot&oacute;n se agrega una fila a la tabla Propiedades adicionales.</p>
</dd>
<dt>Suprimir propiedades</dt>
<dd>
<p>Bot&oacute;n para suprimir una o varias propiedades seleccionadas. Cualquier propiedad que se suprima vuelve a su valor por defecto o, si no se ha definido ning&uacute;n valor por defecto, se queda sin definir.</p>
</dd>
</dl>
<p>La p&aacute;gina Propiedades del sistema tambi&eacute;n contiene las opciones siguientes:</p>
<dl>
<dt>Nombre de Configuraci&oacute;n</dt>
<dd>
<p>Nombre de la configuraci&oacute;n a la que se aplican los valores de esta p&aacute;gina. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>Nueva configuraci&oacute;n din&aacute;mica</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; activada, los cambios realizados en la configuraci&oacute;n se aplican a las instancias que hacen referencia a la configuraci&oacute;n sin necesidad de reiniciar dichas instancias.</p>
</dd>
<dt>Clusters y/o instancias que utilizan esta configuraci&oacute;n</dt>
<dd>
<p>Lista de los clusters y las instancias que hacen referencia a la configuraci&oacute;n, con una indicaci&oacute;n de si cada cluster o instancia se est&aacute; ejecutando:</p>
<ul>
<li>
<p>Si el cluster o instancia se est&aacute; ejecutando, se muestra una marca de verificaci&oacute;n (&#10003;).</p>
</li>
<li>
<p>Si el cluster o la instancia est&aacute;n detenidos, se muestra un signo de exclamaci&oacute;n (<code>!</code>).</p>
</li>
</ul>
</dd>
</dl>
<a id="sthref438" name="sthref438"></a>
<h5>Tareas relacionadas</h5>
<p>Definir los valores por defecto de las propiedades de configuraci&oacute;n</p>
<a id="sthref439" name="sthref439"></a>
<h5>Subcomandos asadmin equivalentes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00059"><code>create-system-properties</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00110"><code>delete-system-property</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00203"><code>list-system-properties</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
