<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-logviewer" name="ref-logviewer"></a></p>

<h4><a id="sthref238" name="sthref238"></a><a id="sthref239" name="sthref239"></a><a id="sthref240" name="sthref240"></a>Visor de logs</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Visor de Logs para ver los archivos log para las instancias y clusters seleccionados de GlassFish Server y para personalizar la visualizaci&oacute;n de logs.</p>
<p>La p&aacute;gina Visor de Logs contiene cuatro &aacute;reas:</p>
<ul>
<li>
<p>Criterios de B&uacute;squeda</p>
</li>
<li>
<p>B&uacute;squeda Avanzada</p>
</li>
<li>
<p>Modificar B&uacute;squeda</p>
</li>
<li>
<p>Resultados de B&uacute;squeda</p>
</li>
</ul>
<p>El &aacute;rea Criterios de B&uacute;squeda contiene las siguientes opciones.</p>
<dl>
<dt>B&uacute;squeda Avanzada</dt>
<dd>
<p>Al hacer clic en este enlace aparecer&aacute; un &aacute;rea que le permitir&aacute; realizar acotaciones adicionales al visor de logs.</p>
</dd>
<dt>Registro de Hora</dt>
<dd>
<p>El bot&oacute;n de radio M&aacute;s Reciente muestra los mensajes m&aacute;s recientes. El bot&oacute;n de radio Rango Espec&iacute;fico activa los campos De y A que le permiten ver mensajes de un per&iacute;odo concreto.</p>
<p>Para el valor Hora, la sintaxis debe tener la forma siguiente (<i>SSS</i> significa milisegundos):</p>
<pre>
<i>hh</i>:<i>mm</i>:<i>ss</i>.<i>SSS</i>
</pre>
<p>Por ejemplo:</p>
<pre>
17:10:00.000
</pre>
<p>Si el valor introducido en el campo De es posterior al valor introducido en el campo A, aparece un mensaje de error.</p>
</dd>
<dt>Nivel de Log</dt>
<dd>
<p>Nivel de registro seleccionado para el filtrado. Por defecto, la pantalla incluye todos los mensajes que aparecen en el log del servidor en el nivel de log seleccionado y niveles m&aacute;s graves. Active la casilla de control "No incluir m&aacute;s mensajes graves" para mostrar mensajes s&oacute;lo en el nivel seleccionado.</p>
<p>Para garantizar que los mensajes que desea visualizar aparecen en el log del servidor, primero defina los niveles de log adecuados en la p&aacute;gina Niveles de log del m&oacute;dulo. Consulte <a href="task-eelogginglevels.html">Configurar niveles de log</a>.</p>
<p>Si decide filtrar mensajes de log seg&uacute;n el nivel de log, s&oacute;lo se muestran los mensajes que se ajustan a los criterios de filtro especificados. Sin embargo, este filtro no afecta a qu&eacute; mensajes se registran en el log del servidor.</p>
</dd>
</dl>
<p>El &aacute;rea B&uacute;squeda Avanzada contiene las siguientes opciones.</p>
<dl>
<dt>Registrador</dt>
<dd>
<p>Espacios de nombres del registrador para filtrar por m&oacute;dulos. Utilice la tecla May&uacute;s o la tecla Ctrl y haga clic para seleccionar varios espacios de nombres.</p>
<p>La selecci&oacute;n de un espacio de nombres en un nivel superior selecciona todos los espacios de nombres existentes por debajo. Por ejemplo, al seleccionar <code>javax.enterprise.system</code> tambi&eacute;n se seleccionan los registradores de todos los m&oacute;dulos existentes por debajo de ese espacio de nombres: <code>javax.enterprise.system.core</code>, <code>javax.enterprise.system.tools.admin</code>, etc.</p>
</dd>
<dt>Registrador Personalizado</dt>
<dd>
<p>Registradores espec&iacute;ficos de una aplicaci&oacute;n determinada, uno por l&iacute;nea.</p>
<p>Si la aplicaci&oacute;n tiene varios m&oacute;dulos, puede visualizar uno o todos ellos. Por ejemplo, suponga que la aplicaci&oacute;n tiene registradores con los nombres siguientes:</p>
<pre>
com.mycompany.myapp.module1
com.mycompany.myapp.module2
com.mycompany.myapp.module3
</pre>
<p>Para ver los mensajes de todos los m&oacute;dulos de la aplicaci&oacute;n, introduzca <code>com.mycompany.myapp</code>. Para ver los mensajes s&oacute;lo de <code>module2</code>, introduzca <code>com.mycompany.myapp.module2</code>.</p>
<p>Cuando especifica uno o varios registradores personalizados, los mensajes de los m&oacute;dulos de GlassFish Server aparecen s&oacute;lo si los indica expl&iacute;citamente en el &aacute;rea Registrador.</p>
</dd>
<dt>Mostrar</dt>
<dd>
<p>N&uacute;mero de mensajes que se ven a la vez. El n&uacute;mero por defecto de mensajes mostrados es 40. Tambi&eacute;n puede seleccionar 100, 250 y 1000.</p>
<p>Para ver rastreos de pila, desactive la casilla de control "Limitar mensajes demasiado largos". Por defecto, los seguimientos de pila no aparecen en el visor; para verlos, haga clic en el enlace <code>(details)</code> para un mensaje.</p>
</dd>
</dl>
<p>El &aacute;rea Modificar B&uacute;squeda permite especificar la instancia de servidor o el cluster y el nombre de un archivo log asociado para visualizar.</p>
<dl>
<dt>Instancia</dt>
<dd>
<p>La instancia de servidor o el cluster para el que se mostrar&aacute;n los registros de log. El valor por defecto es server. Otras opciones dependen de los clusters e instancias que se hayan definido o activado en el dominio.</p>
</dd>
<dt>Archivo Log</dt>
<dd>
<p>Nombre del archivo log que desea visualizar. El valor por defecto es <code>server.log</code>. Otras opciones dependen de la configuraci&oacute;n de log para el destino seleccionado.</p>
</dd>
</dl>
<p>La tabla Resultados del Visor de Logs muestra los mensajes de log del servidor. Utilice los botones Registros anteriores a y Registros posteriores a de la parte superior de la tabla para elegir el rango de registros que desee ver.</p>
<p>La tabla Resultados del Visor de Logs contiene la siguiente informaci&oacute;n para cada mensaje.</p>
<dl>
<dt>N&uacute;mero de Registro</dt>
<dd>
<p>N&uacute;mero del mensaje en el log del servidor.</p>
</dd>
<dt>Nivel de Log</dt>
<dd>
<p>Nivel de log del mensaje.</p>
</dd>
<dt>Mensaje</dt>
<dd>
<p>Breve texto del mensaje de log. Haga clic en el enlace <code>(details)</code> para ver una versi&oacute;n con formato de un mensaje.</p>
</dd>
<dt>Registrador</dt>
<dd>
<p>M&oacute;dulo de registrador que gener&oacute; el mensaje de log.</p>
</dd>
<dt>Registro de Hora</dt>
<dd>
<p>Fecha y hora en que se emiti&oacute; el mensaje de log.</p>
</dd>
<dt>Pares de Nombre/Valor</dt>
<dd>
<p>Nombre de thread e ID del mensaje de log.</p>
</dd>
</dl>
<a id="sthref241" name="sthref241"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-eelogging.html">Configurar valores de registro generales</a></p>
</li>
<li>
<p><a href="task-eelogginglevels.html">Configurar niveles de log</a></p>
</li>
<li>
<p><a href="task-logviewer.html">Ver archivos log de DAS</a></p>
</li>
</ul>
<a id="sthref242" name="sthref242"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><code>set-log-level</code></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00224"><code>rotate-log</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
