<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-setadvanceappconfig" name="task-setadvanceappconfig"></a></p>

<h4><a id="sthref6" name="sthref6"></a><a id="sthref7" name="sthref7"></a><a id="sthref8" name="sthref8"></a><a id="sthref9" name="sthref9"></a><a id="sthref10" name="sthref10"></a>Definir la configuraci&oacute;n de aplicaciones</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Configuraci&oacute;n de Aplicaciones para definir las propiedades que ayudan a garantizar que se detecten los cambios en aplicaciones desplegadas y que se vuelvan a cargar las clases modificadas.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, seleccione el nodo Dominio.</p>
<p>Se abrir&aacute; la p&aacute;gina Atributos de Dominio.</p>
</li>
<li>
<p>Seleccione el separador Configuraci&oacute;n de Aplicaciones.</p>
<p>Se abrir&aacute; la p&aacute;gina Configuraci&oacute;n de Aplicaciones.</p>
</li>
<li>
<p>Active la casilla de control Recarga Activada para activar la recarga din&aacute;mica de las aplicaciones.</p>
<p>Si se activa la recarga din&aacute;mica, no tiene que volver a desplegar una aplicaci&oacute;n o m&oacute;dulo cuando cambia su c&oacute;digo o descriptores de despliegue. Lo &uacute;nico que tiene que hacer es copiar los archivos JavaServer Pages (JSP) o de clase modificados en el directorio de despliegue de la aplicaci&oacute;n o m&oacute;dulo. El servidor comprueba peri&oacute;dicamente los cambios realizados en el directorio de despliegue y vuelve a desplegar la aplicaci&oacute;n de forma autom&aacute;tica y din&aacute;mica con los cambios. Esto es &uacute;til en un entorno de desarrollo ya que permite poner a prueba los cambios realizados en el c&oacute;digo de forma r&aacute;pida. En cambio, en un entorno de producci&oacute;n, la nueva carga din&aacute;mica puede hacer que disminuya el rendimiento. Adem&aacute;s, cuando ha finalizado la nueva carga, las sesiones del per&iacute;odo de tr&aacute;nsito pierden su validez. El cliente debe reiniciar la sesi&oacute;n.</p>
<p>Esta opci&oacute;n se encuentra activada por defecto.</p>
</li>
<li>
<p>En el campo Intervalo de Sondeo de Nueva Carga, introduzca la longitud, en segundos, del intervalo en el que se comprobar&aacute;n los cambios de c&oacute;digo de las aplicaciones y m&oacute;dulos y si se han recargado de forma din&aacute;mica.</p>
<p>El valor por defecto es 2.</p>
</li>
<li>
<p>En el campo Timeout de Sesi&oacute;n de Administrador, introduzca el n&uacute;mero de minutos de inactividad tras los que la sesi&oacute;n de Consola de administraci&oacute;n debe sufrir un timeout.</p>
<p>El valor por defecto es 60.</p>
</li>
<li>
<p>Active la casilla de control Despliegue Autom&aacute;tico Activado para activar el despliegue autom&aacute;tico de aplicaciones.</p>
<p>Si copia un archivo de aplicaci&oacute;n o m&oacute;dulo (JAR, WAR, RAR o EAR) en un directorio especial y, a continuaci&oacute;n, activa el despliegue autom&aacute;tico, GlassFish Server desplegar&aacute; autom&aacute;ticamente la aplicaci&oacute;n o el m&oacute;dulo. Esta opci&oacute;n se encuentra activada por defecto.</p>
</li>
<li>
<p>En el campo Intervalo de Sondeo de Despliegue Autom&aacute;tico, introduzca la longitud, en segundos, del intervalo en el que se comprobar&aacute;n los cambios de c&oacute;digo de las aplicaciones y m&oacute;dulos y si se han recargado de forma din&aacute;mica.</p>
<p>El valor por defecto es 2. Si cambia el intervalo de sondeo no se ver&aacute; afectado el tiempo que se tarda en desplegar una aplicaci&oacute;n o un m&oacute;dulo.</p>
</li>
<li>
<p>En el campo Timeout para el Reintento de Despliegue Autom&aacute;tico, introduzca el n&uacute;mero de segundos que un archivo copiado parcialmente puede permanecer sin cambios en el tama&ntilde;o antes de que se produzca un error.</p>
<p>El valor por defecto es 4.</p>
</li>
<li>
<p>En el campo Directorio de Despliegue Autom&aacute;tico, introduzca la ruta de acceso completa del directorio para supervisar el despliegue autom&aacute;tico de aplicaciones.</p>
<p>El valor por defecto es domain-dir<code>/autodeploy</code>.</p>
</li>
<li>
<p>En la lista desplegable Validaci&oacute;n de XML, seleccione el tipo de validaci&oacute;n de XML que se llevar&aacute; a cabo en los descriptores de despliegue est&aacute;ndar y de GlassFish Server.</p>
<p>El tipo puede ser cualquiera de los siguientes:</p>
<dl>
<dt><code>full</code></dt>
<dd>
<p>Si se produce un fallo en la validaci&oacute;n de XML, no se realizar&aacute; el despliegue. &Eacute;ste es el valor por defecto.</p>
</dd>
<dt><code>parsing</code></dt>
<dd>
<p>Se informa acerca de errores en la validaci&oacute;n de XML, pero se realiza el despliegue.</p>
</dd>
<dt><code>none</code></dt>
<dd>
<p>No se realiza ninguna validaci&oacute;n de XML.</p>
</dd>
</dl>
</li>
<li>
<p>Active la casilla de control Verificador Activado para verificar los archivos de descriptor de despliegue.</p>
<p>El verificador examinar&aacute; la estructura y contenido del archivo antes del despliegue autom&aacute;tico. Si se produce un fallo en la verificaci&oacute;n, no se realiza el despliegue. La verificaci&oacute;n de aplicaciones de gran tama&ntilde;o tiende a llevar mucho tiempo. Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>Active la casilla de control Precompilaci&oacute;n Activada para precompilar los archivos JSP.</p>
<p>Si est&aacute; desactivada esta opci&oacute;n, los archivos JSP se compilar&aacute;n en tiempo de ejecuci&oacute;n cuando se acceda a los mismos por primera vez. Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>En la secci&oacute;n Propiedades Adicionales, especifique las propiedades adicionales.</p>
<p>GlassFish Server no define ninguna propiedad adicional para las aplicaciones.</p>
<ul>
<li>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, introduzca el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
</li>
<li>
<p>Para modificar una propiedad, edite el campo Valor.</p>
</li>
<li>
<p>Para suprimir una propiedad, active la casilla de control a la izquierda del campo Nombre de la propiedad que est&aacute; suprimiendo y, a continuaci&oacute;n, haga clic en el bot&oacute;n Suprimir Propiedades.</p>
</li>
</ul>
</li>
<li>
<p>Haga clic en Guardar.</p>

<hr>
<p><b>Sugerencia:</b></p>
Para volver a la configuraci&oacute;n por defecto, haga clic en el bot&oacute;n Cargar Valores por Defecto y, a continuaci&oacute;n, en Guardar.
<hr>

</li>
<li>
<p>Reinicie el servidor.</p>
</li>
</ol>
<a id="GHCOM223" name="GHCOM223"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-generaltab.html">Ver informaci&oacute;n general de DAS</a></p>
</li>
<li>
<p><a href="task-logviewer.html">Ver archivos log de DAS</a></p>
</li>
<li>
<p><a href="task-filter-logs.html">Filtrar los Registros de Log Mostrados</a></p>
</li>
<li>
<p><a href="task-setadvancedomainattributes.html">Definir los atributos de dominio</a></p>
</li>
<li>
<p><a href="task-collectdomainlogs.html">Recopilar y descargar logs de dominio</a></p>
</li>
<li>
<p><a href="task-setadminpassword.html">Cambiar la contrase&ntilde;a de administrador</a></p>
</li>
<li>
<p><a href="task-systemproperties.html">Gestionar propiedades del sistema</a></p>
</li>
<li>
<p><a href="task-appmonitoringdata.html">Ver datos de supervisi&oacute;n de aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-servermonitoringdata.html">Ver datos de supervisi&oacute;n de servidor</a></p>
</li>
<li>
<p><a href="task-resourcemonitoringdata.html">Ver datos de supervisi&oacute;n de recursos</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
