<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-deployentapp" name="task-deployentapp"></a><a id="GHCOM00157" name="GHCOM00157"></a></p>

<h4><a id="sthref55" name="sthref55"></a><a id="sthref56" name="sthref56"></a><a id="sthref57" name="sthref57"></a>Desplegar una aplicaci&oacute;n de empresa</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, seleccione el nodo Aplicaciones.</p>
<p>Se abrir&aacute; la p&aacute;gina Aplicaciones.</p>
</li>
<li>
<p>En la tabla Aplicaciones Desplegadas, haga clic en el bot&oacute;n Desplegar.</p>
<p>Se abre la p&aacute;gina Desplegar Aplicaciones o M&oacute;dulos.</p>
</li>
<li>
<p>Especifique la ubicaci&oacute;n de la aplicaci&oacute;n que desea desplegar.</p>
<ul>
<li>
<p>Si la aplicaci&oacute;n es un archivo que reside en la m&aacute;quina cliente o al que se puede acceder desde la misma, seleccione la opci&oacute;n Archivo Empaquetado que Cargar en el Servidor.</p>
<p>La m&aacute;quina cliente es el host en el que est&aacute; visualizando la Consola de administraci&oacute;n a trav&eacute;s de un explorador.</p>
<p>Haga clic en Examinar para buscar el archivo o bien escriba la ruta de acceso completa hasta el archivo.</p>
</li>
<li>
<p>Si la aplicaci&oacute;n es un archivo que reside en la m&aacute;quina del servidor o es una aplicaci&oacute;n no empaquetada de un directorio separado, seleccione la opci&oacute;n Archivo empaquetado local o directorio accesible desde GlassFish Server.</p>
<p>La m&aacute;quina servidor es el host que est&aacute; ejecutando el servidor de administraci&oacute;n de dominio (DAS).</p>
<p>Haga clic en Examinar Archivos para buscar un archivo o en Examinar Carpetas para buscar un directorio. Como opci&oacute;n alternativa, escriba el nombre de la ruta de acceso completa al archivo o directorio. El despliegue desde un directorio separado es para desarrolladores avanzados y no se recomienda para entornos de producci&oacute;n.</p>
</li>
</ul>
</li>
<li>
<p>En la lista desplegable Tipo, seleccione Aplicaci&oacute;n Empresarial.</p>
<p>Si ha especificado un archivo empaquetado que cargar en el servidor o un archivo empaquetado local accesible desde GlassFish Server, el tipo de aplicaci&oacute;n se detectar&aacute; autom&aacute;ticamente. Si ha especificado un directorio accesible desde GlassFish Server, debe especificar el tipo de manera manual.</p>
</li>
<li>
<p>En el campo Nombre de Aplicaci&oacute;n, puede mantener el nombre por defecto, que es el nombre del directorio o el prefijo del nombre del archivo, o bien escribir un nombre distinto.</p>
<p>El nombre por defecto aparece si decide cargar un archivo. El nombre de la aplicaci&oacute;n debe ser &uacute;nico.</p>
<p>El nombre puede incluir un identificador de versi&oacute;n opcional, que va a continuaci&oacute;n del nombre y est&aacute; separado de &eacute;l por dos puntos (<code>:</code>). El identificador de versi&oacute;n debe comenzar por una letra o n&uacute;mero. Puede contener caracteres alfanum&eacute;ricos m&aacute;s los caracteres de gui&oacute;n bajo (<code>_</code>), gui&oacute;n (<code>-</code>) y punto (<code>.</code>). Para obtener m&aacute;s informaci&oacute;n sobre las versiones de m&oacute;dulo y de aplicaci&oacute;n, consulte el apartado sobre <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>las versiones de m&oacute;dulo y de aplicaci&oacute;n</i> en <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</li>
<li>
<p>En la lista desplegable Servidores Virtuales, seleccione el servidor virtual asociado a esta aplicaci&oacute;n.</p>
<p>La opci&oacute;n Servidores Virtuales aparece si s&oacute;lo existe la instancia de servidor por defecto, <code>server</code>. Si existen clusters u otras instancias de servidor independientes, puede seleccionar los servidores virtuales despu&eacute;s del despliegue. Vaya a la p&aacute;gina Editar Aplicaci&oacute;n, seleccione el separador Destino y seleccione Gestionar Servidores Virtuales para el destino que desee.</p>
</li>
<li>
<p>Active la casilla de control Estado Activado para activar la aplicaci&oacute;n.</p>
<p>Esta opci&oacute;n est&aacute; activada por defecto. Si esta opci&oacute;n est&aacute; desactivada, la aplicaci&oacute;n no estar&aacute; disponible.</p>
</li>
<li>
<p>Active la casilla de control Disponibilidad Activada para activar la persistencia de sesiones y los puntos de control de SFSB para la aplicaci&oacute;n.</p>
<p>Si se activa la casilla de control Activado, se activa la alta disponibilidad para las sesiones web, la aplicaci&oacute;n de puntos de control de bean de sesi&oacute;n con estado (SFSB) y posiblemente para la desactivaci&oacute;n. Si se define en false (valor por defecto), el guardado de sesiones web y los puntos de control de SFSB quedan desactivados para la aplicaci&oacute;n especificada. Si se define en true, la aplicaci&oacute;n especificada se activa para alta disponibilidad. Defina esta opci&oacute;n como true s&oacute;lo si se ha configurado y activado la alta disponibilidad en niveles superiores, como, por ejemplo, los niveles de servidor y contenedor.</p>
<p>Esta opci&oacute;n aparece si existen clusters o instancias del servidor independientes aparte de la instancia de servidor por defecto (<code>server</code>).</p>
</li>
<li>
<p>Active la casilla de control Java Web Start para activar el acceso a Java Web Start para un cliente de aplicaciones.</p>
<p>Esta opci&oacute;n se encuentra activada por defecto.</p>
</li>
<li>
<p>Active la casilla de control Precompilar JSP para precompilar los archivos de JavaServer Pages (JSP).</p>
<p>Si est&aacute; desactivada esta opci&oacute;n, los archivos JSP se compilar&aacute;n en tiempo de ejecuci&oacute;n cuando se acceda a los mismos por primera vez. Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>Active la casilla de control Ejecutar Verificador para verificar los descriptores de despliegue antes del despliegue.</p>
<p>Si esta opci&oacute;n est&aacute; activada y se produce un fallo en la verificaci&oacute;n, el despliegue no se llevar&aacute; a cabo. El verificador examinar&aacute; la estructura y el contenido de los descriptores de despliegue. La verificaci&oacute;n de aplicaciones de gran tama&ntilde;o tiende a llevar mucho tiempo. Esta opci&oacute;n se activada por defecto.</p>
<p>Los paquetes de verificador se deben haber instalado desde la herramienta de actualizaci&oacute;n o se registrar&aacute; una advertencia y se ignorar&aacute; esta opci&oacute;n.</p>
</li>
<li>
<p>Active la casilla de control Compatibilidad para utilizar los requisitos de visibilidad de JAR de GlassFish Server v2 para las aplicaciones, en lugar de los m&aacute;s estrictos requisitos de Java EE 6 implantados en las versiones v3 de GlassFish Server, incluida 4.0.</p>
<p>Esta opci&oacute;n se activada por defecto.</p>
<p>La especificaci&oacute;n de la plataforma Java EE 6 impone requisitos m&aacute;s estrictos que Java EE 5 sobre qu&eacute; archivos JAR pueden ser visibles para varios m&oacute;dulos dentro de un archivo EAR. En concreto, los clientes de aplicaci&oacute;n no deben tener acceso a los archivos JAR EJB o a otros archivos JAR del archivo EAR a menos que las referencias utilicen los mecanismos Java SE est&aacute;ndar (extensiones, por ejemplo) o el mecanismo biblioteca-directorio de Java EE. Al activar esta casilla se eliminan estas restricciones de Java EE 6.</p>
</li>
<li>
<p>Active la casilla de control Forzar Nuevo Despliegue para forzar el nuevo despliegue si ya se ha desplegado la aplicaci&oacute;n.</p>
<p>Si esta opci&oacute;n no est&aacute; seleccionada y se intenta desplegar una aplicaci&oacute;n que ya se haya desplegado, se producir&aacute; un error. Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>Active la casilla de control Mantener Estado para mantener sesiones web, instancias de SFSB y temporizadores EJB creados con persistencia entre nuevos despliegues.</p>
<p>Esta opci&oacute;n se activada por defecto. Esta opci&oacute;n s&oacute;lo est&aacute; soportada en la instancia de servidor por defecto, denominada <code>server</code>. No se soporta para ning&uacute;n otro destino y se ignorar&aacute;.</p>
<p>Algunos cambios efectuados en una aplicaci&oacute;n entre nuevos despliegues impiden que esta opci&oacute;n funcione correctamente. Por ejemplo, no cambie el juego de variables de instancia en la clase de bean SFSB.</p>
<p>Para las aplicaciones web, esta funci&oacute;n s&oacute;lo es aplicable si, en el archivo <code>glassfish-web-app.xml</code>, el atributo <code>persistence-type</code> del elemento <code>session-manager</code> es <code>file</code>.</p>
<p>Para instancias de bean de sesi&oacute;n con estado, el tipo de persistencia sin alta disponibilidad se define en el servidor (con la opci&oacute;n Tipo de Persistencia SFSB) y se debe definir en <code>file</code>, que es el valor por defecto y recomendado.</p>
<p>Si una sesi&oacute;n web, instancia SFSB o temporizador EJB activo no se conserva o restablece, <i>ninguno</i> de ellos estar&aacute; disponible cuando se haya completado el nuevo despliegue. Sin embargo, el nuevo despliegue continuar&aacute; y se registrar&aacute; una advertencia.</p>
<p>Para conservar datos de estado activo, GlassFish Server serializa los datos y los guarda en la memoria. Para restaurar los datos, el cargador de clases de la aplicaci&oacute;n que se acaba de volver a desplegar deserializa los datos guardados anteriormente.</p>
</li>
<li>
<p>En el campo Orden de despliegue, escriba un n&uacute;mero para especificar el orden de despliegue de la aplicaci&oacute;n.</p>
<p>Las aplicaciones con un n&uacute;mero inferior se cargan en primer lugar al iniciar el servidor. Una aplicaci&oacute;n con un orden de aplicaci&oacute;n de 102 se carga antes que una aplicaci&oacute;n con un orden de aplicaci&oacute;n de 110. Si no se especifica un orden de despliegue en el momento de desplegar la aplicaci&oacute;n, se asigna un orden de despliegue por defecto de 100. Si dos aplicaciones tienen el mismo orden de despliegue, se despliega en primer lugar la aplicaci&oacute;n que se haya cargado primero. Especificar un orden de despliegue es &uacute;til si la aplicaci&oacute;n tiene dependencias y se deben cargar en un orden determinado.</p>
</li>
<li>
<p>En el campo Bibliotecas, introduzca una lista separada por comas de archivos JAR de biblioteca espec&iacute;ficos de esta aplicaci&oacute;n.</p>
<p>Las rutas de acceso pueden ser absolutas o relativas. Una ruta de acceso relativa es relativa con respecto a domain-dir<code>/lib/applibs</code>. Si la ruta de acceso es absoluta, la ruta de acceso debe ser accesible para el servidor de administraci&oacute;n del dominio (DAS), lo que implica que debe estar en domain-dir. Las bibliotecas est&aacute;n disponibles para la aplicaci&oacute;n en el orden en que est&aacute;n especificadas.</p>
</li>
<li>
<p>En el campo Descripci&oacute;n, escriba una descripci&oacute;n de esta aplicaci&oacute;n.</p>
</li>
<li>
<p>Para agregar instancias de servidor y clusters de destino en los que desplegar el m&oacute;dulo o aplicaci&oacute;n, selecci&oacute;nelos en la lista Destinos Disponibles y utilice el bot&oacute;n Agregar para moverlos a la lista Destinos Seleccionados.</p>
<p>La opci&oacute;n Destino aparece si existen clusters o instancias de servidor independientes aparte de la instancia de servidor por defecto (<code>server</code>). Por defecto, el m&oacute;dulo o aplicaci&oacute;n se desplegar&aacute; en la instancia de servidor por defecto, denominada <code>server</code>. Utilice el bot&oacute;n Agregar Todos para desplegar en todos los destinos. Utilice los botones Eliminar y Eliminar Todos para eliminar destinos de la lista Destinos Seleccionados.</p>
</li>
<li>
<p>Haga clic en Aceptar.</p>
</li>
</ol>
<a id="sthref58" name="sthref58"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-applistdeployed.html">Ver una lista de aplicaciones desplegadas</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">Desplegar una aplicaci&oacute;n web</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">Desplegar un cliente de aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">Desplegar un m&oacute;dulo del conector</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">Desplegar un JAR EJB</a></p>
</li>
<li>
<p><a href="task-appedit.html">Editar una aplicaci&oacute;n desplegada</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">Ver los descriptores de una aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-endpoint.html">Ver informaci&oacute;n de punto final para un servicio web</a></p>
</li>
<li>
<p><a href="task-applaunch.html">Iniciar una aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">Iniciar un cliente de aplicaciones</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">Descargar stubs de clientes de aplicaciones</a></p>
</li>
<li>
<p><a href="task-appredeploy.html">Volver a desplegar una aplicaci&oacute;n desplegada</a></p>
</li>
<li>
<p><a href="task-apprestart.html">Volver a cargar una aplicaci&oacute;n desplegada</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">Ver los Recursos de &Aacute;mbito de Aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">Modificar los Recursos de &Aacute;mbito de Aplicaci&oacute;n</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
