<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-eelogginglevels" name="task-eelogginglevels"></a></p>

<h4><a id="sthref73" name="sthref73"></a><a id="sthref74" name="sthref74"></a>Configurar niveles de log</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Configuraciones.</p>
</li>
<li>
<p>En el nodo Configuraci&oacute;n, haga clic en la configuraci&oacute;n de instancia de servidor o cluster para el que desee definir la configuraci&oacute;n de registrador.</p>
<p>Se abrir&aacute; la p&aacute;gina Configuraci&oacute;n.</p>
</li>
<li>
<p>En la p&aacute;gina Configuraci&oacute;n, haga clic en Configuraci&oacute;n de Registrador.</p>
<p>Se abrir&aacute; la p&aacute;gina Configuraci&oacute;n de Registrador del destino de configuraci&oacute;n seleccionado.</p>
</li>
<li>
<p>En la p&aacute;gina Configuraci&oacute;n de Registrador, haga clic en el separador Niveles de Registro.</p>
<p>Se abrir&aacute; la p&aacute;gina Niveles de Log del M&oacute;dulo.</p>
</li>
<li>
<p>En la p&aacute;gina Niveles de Log del M&oacute;dulo, cambie los niveles de log para uno o m&aacute;s m&oacute;dulos de la siguiente manera.</p>
<ul>
<li>
<p>Para cambiar el nivel de log para un m&oacute;dulo individual, seleccione un nuevo valor de la lista desplegable frente al m&oacute;dulo cuyo nivel de log desea cambiar.</p>
</li>
<li>
<p>Para cambiar el nivel de log para un grupo de m&oacute;dulos:</p>
<ol type="a">
<li>
<p>Active las casillas de control junto a los nombres de los m&oacute;dulos cuyos niveles de log desea cambiar.</p>
</li>
<li>
<p>Seleccione un valor en la lista desplegable en la parte superior de la tabla.</p>
</li>
<li>
<p>Haga clic en el bot&oacute;n Cambiar Nivel.</p>
</li>
</ol>
</li>
</ul>
<p>Los mensajes en el nivel seleccionado o superior aparecen en el log. Seleccione alguno de los valores siguientes (listados de mayor a menor):</p>
<ul>
<li>
<p><code>EMERGENCY</code></p>
</li>
<li>
<p><code>ALERT</code></p>
</li>
<li>
<p><code>SEVERE</code></p>
</li>
<li>
<p><code>WARNING</code></p>
</li>
<li>
<p><code>INFO</code></p>
</li>
<li>
<p><code>CONFIG</code></p>
</li>
<li>
<p><code>FINE</code></p>
</li>
<li>
<p><code>FINER</code></p>
</li>
<li>
<p><code>FINEST</code></p>
</li>
<li>
<p><code>OFF</code></p>
</li>
</ul>
<p>Para obtener m&aacute;s informaci&oacute;n acerca del significado de los niveles de log, consulte <a href="ref-eelogginglevels.html">Niveles de Log del m&oacute;dulo</a>. El nivel por defecto es <code>INFO</code>, por tanto el log contendr&aacute; mensajes de niveles <code>INFO</code>, <code>WARNING</code> o <code>SEVERE</code>.</p>
</li>
<li>
<p>Haga clic en Guardar.</p>
<p>Los cambios en la configuraci&oacute;n del nivel de log surten efecto de forma inmediata. Asimismo, se guardan para su posterior uso cuando el servidor se reinicia.</p>
</li>
</ol>
<a id="GHCOM277" name="GHCOM277"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-eelogging.html">Configurar valores de registro generales</a></p>
</li>
<li>
<p><a href="task-logging-max-logfiles.html">Cambiar el l&iacute;mite del n&uacute;mero de archivos log rotados</a></p>
</li>
<li>
<p><a href="task-logviewer.html">Ver archivos log de DAS</a></p>
</li>
<li>
<p><a href="task-collectdomainlogs.html">Recopilar y descargar logs de dominio</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
