<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-confmonitor" name="task-confmonitor"></a></p>

<h4><a id="sthref114" name="sthref114"></a>Configurar el Servicio de Supervisi&oacute;n</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Para abrir la p&aacute;gina Servicio de Supervisi&oacute;n, haga una de estas acciones:</p>
<ul>
<li>
<p>Seleccione el nodo Datos de Supervisi&oacute;n y haga clic en el enlace Configurar Supervisi&oacute;n para la instancia de servidor para la que desee configurar la supervisi&oacute;n. Para configurar la supervisi&oacute;n para un cluster, elija cualquier instancia del cluster.</p>
</li>
</ul>
<ul>
<li>
<p>En el nodo Configuraciones, ampl&iacute;e la configuraci&oacute;n de la instancia de servidor o del cluster para la que desee configurar la supervisi&oacute;n y ampl&iacute;e el nodo Supervisi&oacute;n.</p>
</li>
</ul>
<p>Se abrir&aacute; la p&aacute;gina Servicio de Supervisi&oacute;n.</p>
</li>
<li>
<p>Active la casilla de control de activaci&oacute;n de servicio de supervisi&oacute;n activado para activar la supervisi&oacute;n para GlassFish Server o desactive la casilla de control para desactivar la supervisi&oacute;n.</p>
<p>Esta opci&oacute;n se encuentra activada por defecto.</p>
</li>
<li>
<p>Active la casilla de control de activaci&oacute;n de MBeans de supervisi&oacute;n para desplegar todos los MBean necesarios para la supervisi&oacute;n o desactive la casilla de control para anular el despliegue de estos MBeans.</p>
<p>Esta opci&oacute;n se encuentra activada por defecto.</p>
<p>Si la casilla de control no est&aacute; activada, no podr&aacute; ver los datos de supervisi&oacute;n en la Consola de administraci&oacute;n incluso si la casilla de control Servicio de supervisi&oacute;n s&iacute; est&aacute; activada. En su lugar, debe utilizar la l&iacute;nea de comandos para ver los datos de supervisi&oacute;n. Si desactiva la casilla de control, la huella de memoria de GlassFish Server se reduce.</p>
</li>
<li>
<p>Active la casilla de control DTrace Activado para activar el uso de la utilidad DTrace de Solaris.</p>
<p>Para poder utilizar la utilidad DTrace de Solaris tambi&eacute;n debe tener la supervisi&oacute;n DTrace Manager Enterprise de Oracle. Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>En la tabla, realice una de las siguientes acciones.</p>
<ul>
<li>
<p>En la columna Nivel de Supervisi&oacute;n, seleccione BAJO o ALTO en la lista desplegable para uno o m&aacute;s componentes de la columna Componente para activar la supervisi&oacute;n para esos componentes.</p>
</li>
<li>
<p>Active las casillas de control junto a uno o m&aacute;s componentes y, a continuaci&oacute;n, seleccione LOW o HIGH en la lista desplegable Nivel en la parte superior de la tabla y haga clic en el bot&oacute;n Cambiar Nivel para definir el nivel de supervisi&oacute;n en ese nivel para todos esos componentes.</p>
</li>
</ul>
<p>No existe diferencia alguna entre los niveles de supervisi&oacute;n que ofrecen las opciones BAJO y ALTO de esta versi&oacute;n. Para desactivar la supervisi&oacute;n de uno o m&aacute;s componentes, seleccione OFF. El valor por defecto es OFF.</p>
<p>Debe desplegar una aplicaci&oacute;n, componente o servicio antes de configurar su supervisi&oacute;n.</p>
</li>
<li>
<p>Haga clic en Guardar.</p>
</li>
</ol>
<a id="GHCOM324" name="GHCOM324"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-appmonitoringdata.html">Ver datos de supervisi&oacute;n de aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-servermonitoringdata.html">Ver datos de supervisi&oacute;n de servidor</a></p>
</li>
<li>
<p><a href="task-resourcemonitoringdata.html">Ver datos de supervisi&oacute;n de recursos</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
