<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-securitysettings" name="task-securitysettings"></a></p>

<h4><a id="sthref78" name="sthref78"></a><a id="sthref79" name="sthref79"></a>Configurar valores de seguridad</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La Consola de administraci&oacute;n permite definir varias configuraciones de seguridad en todo el sistema.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Configuraciones.</p>
</li>
<li>
<p>En el nodo Configuraciones, haga clic en la configuraci&oacute;n de instancia o cluster del servidor para el que desee configurar la seguridad.</p>
<p>Se abrir&aacute; la p&aacute;gina Configuraci&oacute;n.</p>
</li>
<li>
<p>En la p&aacute;gina Configuraci&oacute;n, haga clic en Seguridad.</p>
<p>Se abrir&aacute; la p&aacute;gina Configuraci&oacute;n de Seguridad del destino de configuraci&oacute;n seleccionado.</p>
</li>
<li>
<p>Active la casilla de control Gestor de Seguridad Activado para activar el gestor de seguridad.</p>
<p>Si se activa esta opci&oacute;n, se agregar&aacute; una opci&oacute;n de JVM, <code>-Djava.security.manager</code> , a la configuraci&oacute;n de JVM de GlassFish Server. Consulte <a href="task-jvmoptions.html">Configurar opciones de JVM</a>. Debe reiniciar el servidor para activar este cambio.</p>
<p>Aseg&uacute;rese de que ha otorgado los permisos correctos para todas las aplicaciones. Puede desactivar el gestor de seguridad para mejorar el rendimiento. Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>Active la casilla de control Registro de Auditor&iacute;a Activado para activar el registro de auditor&iacute;a.</p>
<p>Si esta opci&oacute;n est&aacute; activada, el servidor cargar&aacute; y ejecutar&aacute; todos los m&oacute;dulos de auditor&iacute;a seleccionados de la lista M&oacute;dulos de Auditor&iacute;a. Si esta opci&oacute;n est&aacute; desactivada, el servidor no acceder&aacute; a los m&oacute;dulos de auditor&iacute;a. Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>En la lista desplegable Dominio por Defecto, seleccione un dominio activo que el servidor utilizar&aacute; para la autenticaci&oacute;n.</p>
<p>Las aplicaciones utilizar&aacute;n este dominio siempre que el descriptor de despliegue no especifique un dominio diferente. Todos los dominios configurados aparecen en la lista. El valor por defecto es <code>file</code>.</p>
</li>
<li>
<p>Especifique la informaci&oacute;n del principal por defecto.</p>
<ol type="a">
<li>
<p>En el campo Principal por Defecto, introduzca el nombre de usuario por defecto.</p>
<p>El servidor utiliza este nombre de usuario cuando no se proporciona ning&uacute;n otro principal.</p>
</li>
<li>
<p>En el campo Contrase&ntilde;a Principal por Defecto, introduzca la contrase&ntilde;a del principal por defecto especificado en el campo Principal por Defecto.</p>
</li>
</ol>
<p>No se requiere un principal por defecto para el funcionamiento normal de un servidor.</p>
</li>
<li>
<p>En la lista desplegable JACC, seleccione el nombre de un proveedor JACC configurado.</p>
<p>Las opciones por defecto son <code>default</code> y <code>simple</code>. La opci&oacute;n por defecto es <code>default</code>. Para obtener informaci&oacute;n sobre c&oacute;mo crear nuevos proveedores JACC, consulte ***.</p>
</li>
<li>
<p>En la lista desplegable M&oacute;dulos de Auditor&iacute;a, seleccione los m&oacute;dulos del proveedor de auditor&iacute;a que utilizar&aacute; el subsistema de auditor&iacute;a si est&aacute; activado el registro de auditor&iacute;a.</p>
<p>Por defecto el servidor utiliza un m&oacute;dulo de auditor&iacute;a llamado <code>default</code>. Para obtener informaci&oacute;n sobre la creaci&oacute;n de nuevos m&oacute;dulos de auditor&iacute;a, consulte <a href="task-auditmodulenew.html">Crear un m&oacute;dulo de auditor&iacute;a</a>.</p>
</li>
<li>
<p>Active la casilla de control Asignaci&oacute;n de Principal por Defecto a Rol Activada para aplicar la asignaci&oacute;n de principal a rol por defecto a las aplicaciones que no tengan un sistema de asignaci&oacute;n espec&iacute;fico.</p>
</li>
<li>
<p>Si ha activado la asignaci&oacute;n de principal a rol por defecto, en el campo Clases Principal Asignada, introduzca el nombre de una clase de implantaci&oacute;n <code>java.security.Principal</code> personalizada que se utilizar&aacute; en la asignaci&oacute;n de principal a rol por defecto.</p>
</li>
<li>
<p>En la secci&oacute;n Propiedades Adicionales, especifique las propiedades adicionales.</p>
<p>Las propiedades v&aacute;lidas dependen del tipo de dominio seleccionado en el campo Dominio por Defecto. Consulte la entrada adecuada en la lista siguiente para el tipo de dominio que desea configurar.</p>
<ul>
<li>
<p><a href="ref-editfile-adminrealm.html">Propiedades espec&iacute;ficas de la clase <code>FileRealm</code></a></p>
</li>
<li>
<p><a href="ref-editcertrealm.html">Propiedades espec&iacute;ficas de la clase <code>CertificateRealm</code></a></p>
</li>
<li>
<p><a href="ref-editjdbcrealm.html">Propiedades espec&iacute;ficas de la clase <code>JDBCRealm</code></a></p>
</li>
<li>
<p><a href="ref-ldaprealmprop.html">Propiedades espec&iacute;ficas de la clase <code>LDAPRealm</code></a></p>
</li>
<li>
<p><a href="ref-solarisrealmprop.html">Propiedades espec&iacute;ficas de la clase <code>SolarisRealm</code></a></p>
</li>
<li>
<p><a href="ref-pamrealmprop.html">Propiedades espec&iacute;ficas de la clase <code>PamRealm</code></a></p>
</li>
</ul>
<ul>
<li>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, introduzca el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
</li>
<li>
<p>Para modificar una propiedad, edite el campo Valor.</p>
</li>
<li>
<p>Para suprimir una propiedad, active la casilla de control a la izquierda del campo Nombre de la propiedad que est&aacute; suprimiendo y, a continuaci&oacute;n, haga clic en el bot&oacute;n Suprimir Propiedades.</p>
</li>
</ul>
</li>
<li>
<p>Haga clic en Guardar.</p>
</li>
</ol>
<a id="GHCOM280" name="GHCOM280"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-accessadmintools.html">Otorgar acceso a herramientas de administraci&oacute;n</a></p>
</li>
<li>
<p><a href="task-changeadminpasswd.html">Cambiar la contrase&ntilde;a de un usuario en el dominio de administraci&oacute;n</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
