<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-uc-addon" name="task-uc-addon"></a></p>

<h4><a id="sthref198" name="sthref198"></a><a id="sthref199" name="sthref199"></a>Instalar componentes de complementos</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La instalaci&oacute;n de un componente de complementos incluye las operaciones siguientes:</p>
<ul>
<li>
<p>Transferir el contenido del componente y las dependencias del mismo desde un repositorio de red</p>
</li>
<li>
<p>Instalar el componente en la imagen de instalaci&oacute;n de GlassFish Server en su sistema</p>
</li>
</ul>
<p>Si el componente requiere otros componentes que no est&eacute;n instalados, estos componentes tambi&eacute;n se instalar&aacute;n.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, seleccione el nodo Herramienta de Actualizaci&oacute;n.</p>
<p>Se abrir&aacute; la p&aacute;gina Complementos Disponibles.</p>
</li>
<li>
<p>En la p&aacute;gina Complementos Disponibles, en la tabla que muestra los componentes disponibles, seleccione los que desee instalar.</p>
<p>Si no hay componentes de complementos disponibles, la tabla aparecer&aacute; vac&iacute;a.</p>
<ul>
<li>
<p>Para seleccionar un componente individual, active la casilla de control situada al lado del nombre del componente.</p>
</li>
<li>
<p>Para seleccionar todos los componentes, haga clic en el icono Seleccionar Todo situado en la cabecera de la tabla.</p>
</li>
<li>
<p>Para anular la selecci&oacute;n de todos los componentes, haga clic en el icono Anular Selecci&oacute;n de Todo situado en la cabecera de la tabla.</p>
</li>
</ul>
</li>
<li>
<p>Haga clic en Instalar.</p>
<p>Aparecer&aacute; un cuadro de di&aacute;logo para que confirme que los componentes seleccionados y los componentes requeridos por estos deben instalarse.</p>
</li>
<li>
<p>En el cuadro de di&aacute;logo, haga clic en Aceptar.</p>
<p>Tambi&eacute;n tendr&aacute; que confirmar que acepta los acuerdos de licencia de los componentes que va a instalar.</p>
</li>
<li>
<p>Acepte los acuerdos de licencia de los componentes que se van a instalar.</p>
<p>GlassFish Server confirma que la instalaci&oacute;n ha finalizado. Los componentes desaparecer&aacute;n de la tabla de componentes de complementos y se agregar&aacute;n a la tabla de componentes instalados de la p&aacute;gina Componentes Instalados.</p>
</li>
<li>
<p>Reinicie el servidor.</p>
<p>Para obtener instrucciones detalladas, consulte la documentaci&oacute;n siguiente:</p>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSADG00336"><i>Secci&oacute;n sobre c&oacute;mo detener un dominio</i> en <i>Oracle GlassFish Server Administration Guide</i></a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSADG00335"><i>Secci&oacute;n sobre c&oacute;mo iniciar un dominio</i> en <i>Oracle GlassFish Server Administration Guide</i></a></p>
</li>
</ul>
</li>
</ol>
<a id="sthref200" name="sthref200"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-uc-update.html">Ver actualizaciones disponibles para componentes</a></p>
</li>
<li>
<p><a href="task-uc-installed-remove.html">Ver componentes instalados</a></p>
</li>
<li>
<p><a href="task-uc-pkgdetails.html">Ver informaci&oacute;n detallada sobre un componente</a></p>
</li>
<li>
<p><a href="task-uc-set-proxy.html">Configurar valores de proxy de red para acceder a repositorios de red</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
