<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-messagesecurityconfigedit" name="task-messagesecurityconfigedit"></a></p>

<h4><a id="sthref104" name="sthref104"></a>Editar una configuraci&oacute;n de seguridad de mensajes</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Para activar la seguridad de los mensajes para puntos finales de servicios web desplegados en GlassFish Server, debe especificar un proveedor para usar por defecto en el servidor. Si activa un proveedor por defecto para la seguridad de los mensajes, tambi&eacute;n tendr&aacute; que activar proveedores que utilizar&aacute;n los clientes de los servicios web desplegados en GlassFish Server. Encontrar&aacute; informaci&oacute;n sobre la activaci&oacute;n de los proveedores usados por clientes en <a href="task-enablemesec4appclients.html">Activar la seguridad de mensajes para clientes de aplicaci&oacute;n</a>.</p>
<p>Para activar la seguridad de los mensajes para llamadas de servicios web que se originan en puntos finales desplegados, debe especificar un proveedor de cliente por defecto. Si ha activado un proveedor de cliente por defecto para GlassFish Server, debe asegurarse que los servicios llamados desde los puntos finales desplegados en GlassFish Server est&aacute;n configurados de forma compatible para la seguridad de la capa de mensajes.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Configuraci&oacute;n.</p>
</li>
<li>
<p>Ampl&iacute;e el nodo Seguridad.</p>
</li>
<li>
<p>Seleccione el nodo Seguridad de Mensajes.</p>
<p>Se abrir&aacute; la p&aacute;gina Configuraciones de Seguridad de Mensajes.</p>
</li>
<li>
<p>En la p&aacute;gina Configuraciones de Seguridad de Mensajes, haga clic en el nombre de la capa de autenticaci&oacute;n de la configuraci&oacute;n que est&aacute; editando.</p>
<p>Por defecto, la &uacute;nica configuraci&oacute;n de seguridad de mensajes configurada es SOAP.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar Configuraci&oacute;n de Seguridad de Mensajes.</p>
</li>
<li>
<p>En la p&aacute;gina Editar Configuraci&oacute;n de Seguridad de Mensajes, en la lista desplegable Proveedores por Defecto, seleccione un proveedor de servidor.</p>
<p>El proveedor de servidor por defecto, tambi&eacute;n llamado proveedor por defecto, identifica el proveedor de servidor llamado para una aplicaci&oacute;n que no identifica un proveedor de servidor espec&iacute;fico. Las opciones disponibles son <code>ServerProvider</code>, <code>XWS_ServerProvider</code> o ninguno. Por defecto no hay ning&uacute;n proveedor seleccionado, por tanto GlassFish Server no llamar&aacute; a un proveedor de seguridad de mensajes para el servidor. Generalmente, debe seleccionar <code>ServerProvider</code> como proveedor por defecto.</p>
</li>
<li>
<p>En la lista desplegable Proveedor de Cliente por Defecto, seleccione un proveedor de cliente.</p>
<p>El proveedor de cliente por defecto identifica el proveedor de cliente llamado para una aplicaci&oacute;n que no identifica un proveedor de cliente espec&iacute;fico. Las opciones disponibles son <code>ClientProvider</code>, <code>XWS_ClientProvider</code> o ninguno. Por defecto no hay ning&uacute;n proveedor seleccionado, por tanto GlassFish Server no llamar&aacute; a un proveedor de seguridad de mensajes para clientes. Generalmente, no debe seleccionar ninguno como proveedor de clientes por defecto. Seleccione <code>ClientProvider</code> para activar un proveedor por defecto y una pol&iacute;tica de protecci&oacute;n de mensajes para aplicar a las llamadas a servicios web que se originan en los puntos finales de servicios web desplegados en GlassFish Server.</p>
</li>
<li>
<p>Haga clic en Guardar.</p>
</li>
<li>
<p>Para obtener instrucciones sobre c&oacute;mo modificar las pol&iacute;ticas de protecci&oacute;n de mensajes de cliente activado o proveedores de servidores, consulte <a href="task-messagesecurityproviderconfigedit.html">Editar una configuraci&oacute;n de proveedor de seguridad de mensajes</a>.</p>
</li>
</ol>
<a id="GHCOM311" name="GHCOM311"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">Configurar utilidades de GlassFish Server para su uso por parte de proveedores de seguridad de mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">Crear una configuraci&oacute;n de seguridad de mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">Suprimir una configuraci&oacute;n de seguridad de mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">Crear una configuraci&oacute;n de proveedor de seguridad de mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">Editar una configuraci&oacute;n de proveedor de seguridad de mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">Suprimir una configuraci&oacute;n de proveedor de seguridad de mensajes</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">Activar la seguridad de mensajes para clientes de aplicaci&oacute;n</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
