<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-filter-logs" name="task-filter-logs"></a></p>

<h4>Filtrar los Registros de Log Mostrados</h4>
<a name="BEGIN" id="BEGIN"></a><a id="GHCOM230" name="GHCOM230"></a>
<h5>Antes de Empezar</h5>
<p>Compruebe que est&aacute; viendo archivos de registro para el servidor de administraci&oacute;n de dominio (DAS), una instancia en cluster de GlassFish Server o una instancia independiente. Para obtener m&aacute;s informaci&oacute;n, consulte los temas siguientes:</p>
<ul>
<li>
<p><a href="task-logviewer.html">Ver archivos log de DAS</a></p>
</li>
<li>
<p><a href="../../../cluster/en/help/task-view-logs-clustered-instance.html">Ver&nbsp;Archivos Log para&nbsp;una Instancia de GlassFish Server en Cluster</a></p>
</li>
<li>
<p><a href="../../../cluster/en/help/task-view-logs-standalone-instance.html">Ver&nbsp;Archivos Log para&nbsp;una Instancia de GlassFish Server Independiente</a></p>
</li>
</ul>
<ol>
<li>
<p>En el &aacute;rea Criterios de B&uacute;squeda, filtre los registros por contenido, per&iacute;odo de tiempo y nivel de registro.</p>
<ol type="a">
<li>
<p>Para mostrar s&oacute;lo los registros que contienen un texto espec&iacute;fico, escriba el texto en el campo B&uacute;squeda de texto.</p>
<p>La b&uacute;squeda es sensible a may&uacute;sculas y min&uacute;sculas.</p>
</li>
<li>
<p>Para seleccionar el per&iacute;odo de tiempo para el que se muestran los registros, utilice la opci&oacute;n Registro de Hora.</p>
<ul>
<li>
<p>Para ver los mensajes m&aacute;s recientes, seleccione M&aacute;s reciente (valor por defecto).</p>
</li>
<li>
<p>Para ver mensajes s&oacute;lo de un determinado per&iacute;odo de tiempo, seleccione Rango espec&iacute;fico e introduzca un valor de fecha y hora en los campos Desde y Hasta.</p>
<p>El valor Fecha debe tener el formato siguiente:</p>
<pre>
<i>MM</i>/<i>DD</i>/<i>YY</i>
</pre>
<p><code><i>MM</i></code> es un entero en el rango 1-12 para el n&uacute;mero de mes; por ejemplo, 1 para enero o 10 para octubre. <code><i>DD</i></code> es un entero en el rango 1-31 para el d&iacute;a del mes. <code><i>YY</i></code> son los &uacute;ltimos dos d&iacute;gitos del a&ntilde;o; por ejemplo, 11 para el a&ntilde;o 2011.</p>
<p>Por ejemplo, para especificar la fecha 1 de febrero de 2011, escriba <code>2/1/11</code> en el campo de fecha.</p>
<p>El valor Hora debe tener el formato siguiente:</p>
<pre>
<i>hh</i>:<i>mm</i>:<i>ss</i>.<i>SSS</i>
</pre>
<p><code><i>hh</i></code> es un entero en el rango 0-23 para representar la hora. Para las horas por la tarde, utilice n&uacute;meros enteros en el rango 12-23; por ejemplo, 14 para representar las 2 PM. <code><i>mm</i></code> es un entero en el rango 0-59 para el n&uacute;mero de minutos despu&eacute;s de la hora. <code><i>ss</i></code> es un entero en el rango 0-59 para el n&uacute;mero de segundos. <code><i>SSS</i></code> es un entero de tres d&iacute;gitos, con ceros iniciales si es necesario, en el rango 000-999 para el n&uacute;mero de milisegundos.</p>
<p>Por ejemplo, para especificar la hora 5:10 PM, escriba <code>17:10:00.000</code> en el campo Hora.</p>
<p>Si el valor introducido en el campo De es posterior al valor introducido en el campo A, aparece un mensaje de error.</p>
</li>
</ul>
</li>
<li>
<p>Filtre los mensajes por nivel de log.</p>
<p>Para garantizar que los mensajes que desea visualizar aparecen en el log del servidor, primero defina los niveles de log adecuados en la p&aacute;gina Niveles de log del m&oacute;dulo. Consulte <a href="task-eelogginglevels.html">Configurar niveles de log</a> para obtener instrucciones.</p>
<p>Si decide filtrar mensajes de log seg&uacute;n el nivel de log, s&oacute;lo se mostrar&aacute;n los mensajes que se ajusten a los criterios de filtro especificados. Sin embargo, este filtro no afecta a qu&eacute; mensajes se registran en el log del servidor.</p>
<ol>
<li>
<p>En la lista desplegable Nivel de Log, seleccione el nivel de log.</p>
</li>
<li>
<p>Para mostrar mensajes s&oacute;lo en el nivel seleccionado, seleccione la opci&oacute;n No incluir m&aacute;s mensajes graves.</p>
<p>Por defecto, se muestran todos los mensajes del log del servidor en el nivel de log seleccionado y niveles m&aacute;s graves.</p>
</li>
</ol>
</li>
</ol>
</li>
<li>
<p>En el &aacute;rea B&uacute;squeda Avanzada, filtre los registros por espacio de nombres del registrador y seleccione la cantidad de informaci&oacute;n que se debe mostrar.</p>
<ol type="a">
<li>
<p>Haga clic en el enlace B&uacute;squeda Avanzada.</p>
<p>El &aacute;rea B&uacute;squeda Avanzada se agrega a la ventana Visor de Logs.</p>
</li>
<li>
<p>Para filtrar por m&oacute;dulo, seleccione uno o m&aacute;s espacios de nombres en la lista desplegable Registrador.</p>
<p>Utilice May&uacute;s-clic o Ctrl-clic para seleccionar varios espacios de nombres.</p>
<p>La selecci&oacute;n de un espacio de nombres en un nivel superior selecciona todos los espacios de nombres existentes por debajo. Por ejemplo, al seleccionar <code>javax.enterprise.system</code> tambi&eacute;n se seleccionan los registradores de todos los m&oacute;dulos existentes por debajo de ese espacio de nombres, como <code>javax.enterprise.system.core</code>, <code>javax.enterprise.system.tools.admin</code>, etc.</p>
</li>
<li>
<p>Para ver mensajes de los registradores para una aplicaci&oacute;n en concreto, escriba el nombre de cada registrador en una l&iacute;nea separada en el campo Registrador Personalizado.</p>
<p>Si la aplicaci&oacute;n tiene varios m&oacute;dulos, puede visualizar uno o todos ellos. Por ejemplo, una aplicaci&oacute;n podr&iacute;a tener los siguientes registradores:</p>
<pre>
com.example.myapp.module1
com.example.myapp.module2
com.example.myapp.module3
</pre>
<p>Para ver los mensajes de todos los m&oacute;dulos de la aplicaci&oacute;n, introduzca <code>com.mycompany.myapp</code>. Para ver s&oacute;lo los mensajes de <code>module2</code>, escriba <code>com.example.myapp.module2</code>.</p>
<p>Cuando especifica uno o varios registradores personalizados, los mensajes de los m&oacute;dulos de GlassFish Server aparecen s&oacute;lo si los indica expl&iacute;citamente en el &aacute;rea Registrador.</p>
</li>
<li>
<p>En la lista desplegable Mostrar, seleccione el n&uacute;mero de mensajes que desea mostrar.</p>
<p>El n&uacute;mero por defecto de mensajes mostrados es 40. Tambi&eacute;n puede seleccionar 100, 250 y 1000.</p>
</li>
<li>
<p>Para ver rastreos de pila, desactive la casilla de control Limitar mensajes demasiado largos.</p>
<p>Por defecto, los rastreos de pila no aparecen en el visor. Para ver rastreos de pila, haga clic en el enlace (detalles) de un mensaje.</p>
</li>
<li>
<p>Para ocultar el &aacute;rea B&uacute;squeda Avanzada, haga clic en el enlace B&uacute;squeda B&aacute;sica.</p>
</li>
</ol>
</li>
<li>
<p>Para especificar la instancia y el archivo log asociado que desea ver, utilice el &aacute;rea Modificar B&uacute;squeda.</p>
<ul>
<li>
<p>En la lista desplegable Instancia, seleccione la instancia.</p>
<p>El valor por defecto es la instancia seleccionada inicialmente para ver sus archivos log. Si ha seleccionado ver los archivos log del servidor de administraci&oacute;n de dominio (DAS), el valor por defecto es server, lo que indica el DAS.</p>
</li>
<li>
<p>En la lista desplegable Archivo Log, seleccione el archivo log.</p>
<p>El valor por defecto es <code>server.log</code>. Otras opciones dependen de la configuraci&oacute;n de log para el destino seleccionado.</p>
</li>
</ul>
</li>
<li>
<p>En el &aacute;rea Resultados de B&uacute;squeda, personalice la visualizaci&oacute;n de mensajes de log.</p>
<p>El &aacute;rea Resultados de B&uacute;squeda muestra las &uacute;ltimas 40 entradas en el log del servidor, con la configuraci&oacute;n especificada en las p&aacute;ginas Configuraci&oacute;n de Registro y Niveles de Log.</p>
<ul>
<li>
<p>Para ordenar los mensajes de una forma distinta, haga clic en las flechas de las columnas.</p>
</li>
<li>
<p>Para ver una versi&oacute;n con formato de un mensaje, haga clic en el enlace (detalles) del mensaje.</p>
<p>Se abrir&aacute; la ventana Detalles de Entrada de Log, que contiene una versi&oacute;n con formato del mensaje.</p>
</li>
<li>
<p>Para ver entradas anteriores o posteriores del archivo log, haga clic en Registros anteriores a y Registros posteriores a, en la parte superior de la tabla.</p>
</li>
</ul>
</li>
</ol>
<a id="GHCOM231" name="GHCOM231"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-eelogging.html">Configurar valores de registro generales</a></p>
</li>
<li>
<p><a href="task-eelogginglevels.html">Configurar niveles de log</a></p>
</li>
<li>
<p><a href="task-logviewer.html">Ver archivos log de DAS</a></p>
</li>
<li>
<p><a href="../../../cluster/en/help/task-view-logs-clustered-instance.html">Ver&nbsp;Archivos Log para&nbsp;una Instancia de GlassFish Server en Cluster</a></p>
</li>
<li>
<p><a href="../../../cluster/en/help/task-view-logs-standalone-instance.html">Ver&nbsp;Archivos Log para&nbsp;una Instancia de GlassFish Server Independiente</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
