<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jaccprovideredit" name="task-jaccprovideredit"></a></p>

<h4><a id="sthref166" name="sthref166"></a>Editar un proveedor JACC</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el nodo Configuraciones del &aacute;rbol de navegaci&oacute;n, ampl&iacute;e la instancia o cluster de GlassFish Server para el que desee crear un proveedor JACC.</p>
<p>Para crear un proveedor que est&eacute; disponible para todas las instancias y clusters, elija el nodo <code>default-config</code>.</p>
</li>
<li>
<p>En el nodo de configuraci&oacute;n ampliado de la instancia o cluster, ampl&iacute;e el nodo Seguridad.</p>
</li>
<li>
<p>En el nodo Seguridad, seleccione el nodo Proveedores JACC.</p>
<p>Se abrir&aacute; la p&aacute;gina Proveedores JACC.</p>
</li>
<li>
<p>En la p&aacute;gina Proveedores JACC, haga clic en el nombre del proveedor JACC que est&aacute; editando.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar Proveedor JACC.</p>
</li>
<li>
<p>En la p&aacute;gina Editar Proveedor JACC, en el campo Configuraci&oacute;n de Pol&iacute;ticas, introduzca el nombre de la clase que implanta la f&aacute;brica de configuraci&oacute;n de pol&iacute;ticas.</p>
</li>
<li>
<p>En el campo Proveedor de Pol&iacute;tica, introduzca el nombre de la clase que implanta la f&aacute;brica de pol&iacute;ticas.</p>
</li>
<li>
<p>En la secci&oacute;n Propiedades Adicionales, especifique las propiedades adicionales.</p>
<p>Para obtener una descripci&oacute;n de propiedades adicionales disponibles para proveedores JACC, consulte <a href="ref-jaccproviderprop.html">Propiedades espec&iacute;ficas de proveedores JACC</a>.</p>
<ul>
<li>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, introduzca el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
</li>
<li>
<p>Para modificar una propiedad, edite el campo Valor.</p>
</li>
<li>
<p>Para suprimir una propiedad, active la casilla de control a la izquierda del campo Nombre de la propiedad que est&aacute; suprimiendo y, a continuaci&oacute;n, haga clic en el bot&oacute;n Suprimir Propiedades.</p>
</li>
</ul>
</li>
<li>
<p>Haga clic en Guardar.</p>
</li>
</ol>
<a id="sthref167" name="sthref167"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-jaccprovidernew.html">Crear un proveedor JACC</a></p>
</li>
<li>
<p><a href="task-jaccproviderdelete.html">Suprimir un proveedor JACC</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
