<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-endpoint" name="task-endpoint"></a></p>

<h4><a id="sthref76" name="sthref76"></a><a id="sthref77" name="sthref77"></a><a id="sthref78" name="sthref78"></a>Ver informaci&oacute;n de punto final para un servicio web</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, seleccione el nodo Aplicaciones.</p>
<p>Se abrir&aacute; la p&aacute;gina Aplicaciones.</p>
</li>
<li>
<p>En la p&aacute;gina Aplicaciones, haga clic en el nombre del servicio web cuya informaci&oacute;n de punto final desea ver.</p>
<p>El nombre puede incluir un identificador de versi&oacute;n opcional, que va a continuaci&oacute;n del nombre y est&aacute; separado de &eacute;l por dos puntos (<code>:</code>). Para obtener m&aacute;s informaci&oacute;n sobre las versiones de m&oacute;dulo y de aplicaci&oacute;n, consulte el apartado sobre <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>las versiones de m&oacute;dulo y de aplicaci&oacute;n</i> en <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar Aplicaci&oacute;n.</p>
</li>
<li>
<p>En la tabla M&oacute;dulos y Componentes, haga clic en el enlace Ver Punto Final para el subcomponente.</p>
<p>Se abrir&aacute; la p&aacute;gina Informaci&oacute;n de Punto Final de Servicio Web.</p>
</li>
<li>
<p>Si est&aacute; disponible el enlace Probador, haga clic en &eacute;l para ver una p&aacute;gina que permita proporcionar par&aacute;metros para probar los m&eacute;todos del servicio web.</p>
<p>El enlace Probador s&oacute;lo est&aacute; visible si el tipo de despliegue de la aplicaci&oacute;n es distinto de RI (por ejemplo, 109). La p&aacute;gina Probador se abrir&aacute; en una nueva ventana o separador del navegador.</p>
</li>
<li>
<p>Haga clic en el enlace WSDL para ver el archivo Web Services Definition Language (WSDL) para el punto final.</p>
<p>El archivo WSDL se abre en una nueva ventana o separador del explorador.</p>
<p>Tenga en cuenta que algunos exploradores tratan de interpretar el origen de WSDL al hacer clic en el enlace WSDL, de modo que muestran una p&aacute;gina en blanco. Para estos navegadores, utilice el comando Ver Origen del explorador en la p&aacute;gina en blanco para ver el origen de WSDL.</p>
</li>
<li>
<p>Haga clic en el enlace Nombre de Aplicaci&oacute;n o en el bot&oacute;n Atr&aacute;s para volver a la p&aacute;gina Editar Aplicaci&oacute;n.</p>
</li>
</ol>
<a id="sthref79" name="sthref79"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-applistdeployed.html">Ver una lista de aplicaciones desplegadas</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">Desplegar una aplicaci&oacute;n web</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">Desplegar una aplicaci&oacute;n de empresa</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">Desplegar un cliente de aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">Desplegar un m&oacute;dulo del conector</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">Desplegar un JAR EJB</a></p>
</li>
<li>
<p><a href="task-appedit.html">Editar una aplicaci&oacute;n desplegada</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">Ver los descriptores de una aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-applaunch.html">Iniciar una aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">Iniciar un cliente de aplicaciones</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">Descargar stubs de clientes de aplicaciones</a></p>
</li>
<li>
<p><a href="task-appredeploy.html">Volver a desplegar una aplicaci&oacute;n desplegada</a></p>
</li>
<li>
<p><a href="task-apprestart.html">Volver a cargar una aplicaci&oacute;n desplegada</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">Ver los Recursos de &Aacute;mbito de Aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">Modificar los Recursos de &Aacute;mbito de Aplicaci&oacute;n</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
