<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-usedefaultauditmod" name="task-usedefaultauditmod"></a></p>

<h4><a id="sthref163" name="sthref163"></a>Utilizar el m&oacute;dulo de auditor&iacute;a por defecto</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>El m&oacute;dulo de auditor&iacute;a <code>default</code> registra solicitudes de autenticaci&oacute;n y de autorizaci&oacute;n en el archivo log del servidor. Para obtener informaci&oacute;n sobre c&oacute;mo cambiar la ubicaci&oacute;n del archivo log, consulte <a href="task-eelogging.html">Configurar valores de registro generales</a>.</p>
<p>Las entradas de log de autenticaci&oacute;n incluyen la informaci&oacute;n siguiente:</p>
<ul>
<li>
<p>Nombres de usuarios que han intentado autenticarse</p>
</li>
<li>
<p>El dominio que ha procesado la solicitud de acceso</p>
</li>
<li>
<p>El URI del m&oacute;dulo web o componente EJB solicitado</p>
</li>
<li>
<p>&Eacute;xito o fallo de la solicitud</p>
</li>
</ul>
<p>Independientemente de si se activa el registro de auditor&iacute;a, GlassFish Server registra todos los eventos de autenticaci&oacute;n denegados.</p>
<p>Las entradas de log de autorizaci&oacute;n incluyen la informaci&oacute;n siguiente:</p>
<ul>
<li>
<p>Los nombres de los usuarios autenticados, si hay alguno</p>
</li>
<li>
<p>El URI web o componente EJB solicitado</p>
</li>
<li>
<p>Solicitudes correctas o con fallos</p>
</li>
</ul>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Configuraci&oacute;n.</p>
</li>
<li>
<p>Seleccione la instancia que va a configurar:</p>
<ul>
<li>
<p>Para configurar una instancia determinada, ampl&iacute;e el nodo de configuraci&oacute;n de la instancia. Por ejemplo, para la instancia por defecto <code>server</code>, ampl&iacute;e el nodo <code>server-config</code>.</p>
</li>
<li>
<p>Para configurar los valores por defecto para todas las instancias, ampl&iacute;e el nodo <code>default-config</code>.</p>
</li>
</ul>
</li>
<li>
<p>En el nodo Configuraci&oacute;n, seleccione el nodo Seguridad.</p>
<p>Se abrir&aacute; la p&aacute;gina Seguridad.</p>
</li>
<li>
<p>En la lista desplegable M&oacute;dulos de Auditor&iacute;a, seleccione el m&oacute;dulo de auditor&iacute;a llamado <code>default</code>.</p>
</li>
<li>
<p>Haga clic en Guardar.</p>
</li>
</ol>
<a id="sthref164" name="sthref164"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-auditmodulenew.html">Crear un m&oacute;dulo de auditor&iacute;a</a></p>
</li>
<li>
<p><a href="task-auditmoduleedit.html">Editar un m&oacute;dulo de auditor&iacute;a</a></p>
</li>
<li>
<p><a href="task-auditmoduledelete.html">Suprimir un m&oacute;dulo de auditor&iacute;a</a></p>
</li>
<li>
<p><a href="task-enabledisableauditmod.html">Activar o desactivar registro de auditor&iacute;a</a></p>
</li>
<li>
<p><a href="task-setactiveauditmod.html">Definir el m&oacute;dulo de auditor&iacute;a activo</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
