<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-accessadmintools" name="task-accessadmintools"></a><a id="GHCOM00182" name="GHCOM00182"></a></p>

<h4><a id="sthref129" name="sthref129"></a>Otorgar acceso a herramientas de administraci&oacute;n</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>S&oacute;lo los usuarios del grupo <code>asadmin</code> pueden acceder a la Consola de administraci&oacute;n y a la utilidad de l&iacute;nea de comandos <code>asadmin</code>. Para otorgar acceso a los usuarios a estas herramientas de administraci&oacute;n, agregue los usuarios al grupo <code>asadmin</code> de <code>admin-realm</code>.</p>
<ol>
<li>
<p>En el nodo Configuraciones, ampl&iacute;e la configuraci&oacute;n de instancia o cluster del servidor para el que desee configurar los privilegios de acceso de administraci&oacute;n.</p>
</li>
<li>
<p>Ampl&iacute;e el nodo Seguridad.</p>
</li>
<li>
<p>Ampl&iacute;e el nodo Dominios.</p>
</li>
<li>
<p>Seleccione el nodo <code>admin-realm</code>.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar Dominio.</p>
</li>
<li>
<p>En la p&aacute;gina Editar Dominio, haga clic en el bot&oacute;n Gestionar Usuarios.</p>
<p>Se abrir&aacute; la p&aacute;gina Usuarios administradores.</p>
<p>Inicialmente tras la instalaci&oacute;n, el nombre de usuario y la contrase&ntilde;a del administrador introducidos durante la instalaci&oacute;n aparecen en un archivo llamado <code>admin-keyfile</code>. Por defecto este usuario pertenece al grupo <code>asadmin</code>, que da derecho a modificar GlassFish Server. Asigne usuarios a este grupo &uacute;nicamente si les quiere otorgar privilegios de administrador para la instancia o cluster de GlassFish Server seleccionada.</p>
<p>Si agrega usuarios al dominio <code>admin-realm</code>, pero los asigna a un grupo diferente de <code>asadmin</code>, la informaci&oacute;n de los usuarios permanecer&aacute; escrita en el archivo <code>admin-keyfile</code>, pero el usuario no tendr&aacute; acceso a las herramientas administrativas ni a las aplicaciones del dominio <code>file</code>.</p>
</li>
<li>
<p>En la p&aacute;gina Usuarios administradores, haga clic en Nuevo para agregar un nuevo usuario al dominio <code>admin-realm</code>.</p>
<p>Se abrir&aacute; la p&aacute;gina Nuevo Usuario de Dominio de Archivo.</p>
</li>
<li>
<p>En el campo ID de Usuario, introduzca el nombre del nuevo usuario.</p>
</li>
<li>
<p>En el campo Lista de Grupos, introduzca los nombres de los grupos a los que pertenecer&aacute; el usuario.</p>
<p>Para autorizar a un usuario la realizaci&oacute;n de cambios a GlassFish Server, incluya el grupo <code>asadmin</code> en la lista de grupos.</p>
</li>
<li>
<p>En los campos Contrase&ntilde;a Nueva y Confirmar Contrase&ntilde;a Nueva, escriba la contrase&ntilde;a del nuevo usuario.</p>
</li>
<li>
<p>Haga clic en Aceptar para agregar este usuario al dominio <code>admin-realm</code> o haga clic en Cancelar para salir sin guardar.</p>
</li>
</ol>
<a id="sthref130" name="sthref130"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-securitysettings.html">Configurar valores de seguridad</a></p>
</li>
<li>
<p><a href="task-changeadminpasswd.html">Cambiar la contrase&ntilde;a de un usuario en el dominio de administraci&oacute;n</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
