<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-messagesecurityproviderconfigdelete" name="task-messagesecurityproviderconfigdelete"></a></p>

<h4><a id="sthref184" name="sthref184"></a>Suprimir una configuraci&oacute;n de proveedor de seguridad de mensajes</h4>
<a name="BEGIN" id="BEGIN"></a><a id="sthref185" name="sthref185"></a>
<h5>Antes de Empezar</h5>
<p>No es posible crear o suprimir proveedores de seguridad de mensajes para la configuraci&oacute;n por defecto <code>server-config</code>. Los &uacute;nicos proveedores de seguridad de mensajes soportados con la configuraci&oacute;n por defecto <code>server-config</code> son SOAP y HttpServlet. Dado que estos dos proveedores de mensajes se crean por defecto al instalar GlassFish Server, el bot&oacute;n Suprimir no aparece en la p&aacute;gina Configuraciones de Seguridad de Mensajes para la configuraci&oacute;n por defecto <code>server-config</code>.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Configuraci&oacute;n.</p>
</li>
<li>
<p>Ampl&iacute;e el nodo Seguridad.</p>
</li>
<li>
<p>Seleccione el nodo Seguridad de Mensajes.</p>
<p>Se abrir&aacute; la p&aacute;gina Configuraciones de Seguridad de Mensajes.</p>
</li>
<li>
<p>En la p&aacute;gina Configuraciones de Seguridad de Mensajes, seleccione SOAP.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar Configuraci&oacute;n de Seguridad de Mensajes.</p>
</li>
<li>
<p>En la p&aacute;gina Editar Configuraci&oacute;n de Seguridad de Mensajes, haga clic en el separador Proveedores.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar Configuraci&oacute;n de Proveedor.</p>
</li>
<li>
<p>En la p&aacute;gina Editar Configuraci&oacute;n de Proveedor, active la casilla de control que aparece a la izquierda de la configuraci&oacute;n de proveedor que est&aacute; suprimiendo.</p>
</li>
<li>
<p>Haga clic en Suprimir.</p>
</li>
</ol>
<a id="sthref186" name="sthref186"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">Configurar utilidades de GlassFish Server para su uso por parte de proveedores de seguridad de mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">Crear una configuraci&oacute;n de seguridad de mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">Editar una configuraci&oacute;n de seguridad de mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">Suprimir una configuraci&oacute;n de seguridad de mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">Crear una configuraci&oacute;n de proveedor de seguridad de mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">Editar una configuraci&oacute;n de proveedor de seguridad de mensajes</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">Activar la seguridad de mensajes para clientes de aplicaci&oacute;n</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
