<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jaccprovidernew" name="task-jaccprovidernew"></a></p>

<h4><a id="sthref99" name="sthref99"></a>Crear un proveedor JACC</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Consulte la p&aacute;gina Nuevo proveedor JACC para crear un nuevo proveedor JACC (Java Authorization Contract for Containers) que cumple la especificaci&oacute;n JSR-115/196 que pueden utilizar m&oacute;dulos de autorizaci&oacute;n de terceros para las aplicaciones que se ejecutan en GlassFish Server. El proveedor JACC se crea como un elemento <code>jacc-provider</code> dentro del elemento <code>security-service</code> en el archivo <code>domain.xml</code> del dominio.</p>
<p>La instalaci&oacute;n por defecto de GlassFish Server incluye dos proveedores JACC denominados <code>default</code> y <code>simple</code>. Los nuevos proveedores JACC que se creen se agregan a estos dos proveedores por defecto. Los proveedores JACC por defecto de GlassFish Server implantan un motor de autorizaci&oacute;n sencillo basado en archivos que cumple la especificaci&oacute;n JACC.</p>
<p>Para obtener m&aacute;s informaci&oacute;n sobre c&oacute;mo escribir clases de implantaci&oacute;n para un proveedor JACC, consulte la especificaci&oacute;n JACC en <code><a href="http://jcp.org/en/jsr/detail?id=115">http://jcp.org/en/jsr/detail?id=115</a></code>.</p>
<ol>
<li>
<p>En el nodo Configuraciones del &aacute;rbol de navegaci&oacute;n, ampl&iacute;e la instancia o cluster de GlassFish Server para el que desee crear un proveedor JACC.</p>
<p>Para crear un proveedor que est&eacute; disponible para todas las instancias y clusters, elija el nodo <code>default-config</code>.</p>
</li>
<li>
<p>En el nodo de configuraci&oacute;n ampliado de la instancia o cluster, ampl&iacute;e el nodo Seguridad.</p>
</li>
<li>
<p>En el nodo Seguridad, seleccione el nodo Proveedores JACC.</p>
<p>Se abrir&aacute; la p&aacute;gina Proveedores JACC.</p>
</li>
<li>
<p>En la p&aacute;gina Proveedores JACC haga clic en Nuevo.</p>
<p>Se abrir&aacute; la p&aacute;gina Nuevo Proveedor JACC.</p>
</li>
<li>
<p>En la p&aacute;gina Nuevo Proveedor JACC, en el campo Nombre, introduzca el nombre que identificar&aacute; a este proveedor.</p>
<p>Este nombre se utiliza para hacer referencia al elemento <code>jacc-provider</code> en <code>domain.xml</code>.</p>
</li>
<li>
<p>En el campo Configuraci&oacute;n de Pol&iacute;ticas, introduzca el nombre de la clase que implanta la f&aacute;brica de configuraci&oacute;n de pol&iacute;ticas.</p>
<p>El proveedor <code>default</code> utiliza <code>com.sun.enterprise.security.provider.PolicyConfigurationFactoryImpl</code> . El proveedor <code>simple</code> utiliza <code>com.sun.enterprise.security.jacc.provider.SimplePolicyConfigurationFactory</code>.</p>
</li>
<li>
<p>En el campo Proveedor de Pol&iacute;tica, introduzca el nombre de la clase que implanta la f&aacute;brica de pol&iacute;ticas.</p>
<p>El proveedor <code>default</code> utiliza <code>com.sun.enterprise.security.provider.PolicyWrapper</code>. El proveedor <code>simple</code> utiliza <code>com.sun.enterprise.security.jacc.provider.SimplePolicyProvider</code>.</p>
</li>
<li>
<p>En la secci&oacute;n Propiedades Adicionales, especifique las propiedades adicionales.</p>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, introduzca el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
<p>Para obtener una descripci&oacute;n de las propiedades adicionales disponibles para proveedores JACC, consulte<a href="ref-jaccproviderprop.html">Propiedades espec&iacute;ficas de proveedores JACC</a>.</p>
</li>
<li>
<p>Haga clic en Aceptar.</p>
</li>
</ol>
<a id="GHCOM304" name="GHCOM304"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-jaccprovideredit.html">Editar un proveedor JACC</a></p>
</li>
<li>
<p><a href="task-jaccproviderdelete.html">Suprimir un proveedor JACC</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
