<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-changeadminpasswd" name="task-changeadminpasswd"></a><a id="GHCOM00183" name="GHCOM00183"></a></p>

<h4><a id="sthref131" name="sthref131"></a>Cambiar la contrase&ntilde;a de un usuario en el dominio de administraci&oacute;n</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Para cambiar la contrase&ntilde;a de la cuenta de administrador actual, consulte <a href="task-setadminpassword.html">Cambiar la contrase&ntilde;a de administrador</a>. Si <code>admin-realm</code> tiene m&aacute;s de un usuario, puede cambiar tambi&eacute;n la contrase&ntilde;a de los dem&aacute;s usuarios.</p>
<p>El cifrado de la contrase&ntilde;a del administrador mejora la seguridad de su aplicaci&oacute;n. Consulte el <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSSCG00035">Cap&iacute;tulo 1, sobre la <i>administraci&oacute;n de la seguridad del sistema</i>, de <i>Oracle GlassFish Server Security Guide</i></a>, para obtener m&aacute;s informaci&oacute;n sobre procedimientos de seguridad.</p>
<ol>
<li>
<p>En el nodo Configuraciones, ampl&iacute;e la configuraci&oacute;n de instancia o cluster del servidor para el que desee modificar una contrase&ntilde;a de administraci&oacute;n.</p>
</li>
<li>
<p>Ampl&iacute;e el nodo Seguridad.</p>
</li>
<li>
<p>Ampl&iacute;e el nodo Dominios.</p>
</li>
<li>
<p>Seleccione el nodo <code>admin-realm</code>.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar Dominio.</p>
</li>
<li>
<p>En la p&aacute;gina Editar Dominio, haga clic en el bot&oacute;n Gestionar Usuarios.</p>
<p>Se abrir&aacute; la p&aacute;gina Usuarios administradores.</p>
</li>
<li>
<p>En la p&aacute;gina Usuarios administradores, haga clic en el usuario cuya contrase&ntilde;a desee agregar o cambiar.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar Usuario de Dominio de Archivo.</p>
</li>
<li>
<p>En los campos Contrase&ntilde;a Nueva y Confirmar Contrase&ntilde;a Nueva, escriba la nueva contrase&ntilde;a.</p>
</li>
<li>
<p>Haga clic en Guardar.</p>
</li>
</ol>
<a id="sthref132" name="sthref132"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-securitysettings.html">Configurar valores de seguridad</a></p>
</li>
<li>
<p><a href="task-accessadmintools.html">Otorgar acceso a herramientas de administraci&oacute;n</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
