<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-lifecyclemoduleedit" name="task-lifecyclemoduleedit"></a></p>

<h4><a id="sthref65" name="sthref65"></a>Editar un m&oacute;dulo de ciclo de vida</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, seleccione el nodo M&oacute;dulos de Ciclo de Vida.</p>
<p>Se abrir&aacute; la p&aacute;gina M&oacute;dulos de Ciclo de Vida.</p>
</li>
<li>
<p>En la p&aacute;gina M&oacute;dulos de ciclo de vida, haga clic en el nombre del m&oacute;dulo de ciclo de vida que desea editar.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar M&oacute;dulo de Ciclo de Vida.</p>
</li>
<li>
<p>En el campo Nombre de Clase, escriba el nombre completo del archivo de clase del m&oacute;dulo de ciclo de vida.</p>
<p>La clase debe implantar la interfaz <code>com.sun.appserv.server.LifecycleListener</code>.</p>
</li>
<li>
<p>En el campo Classpath, introduzca la classpath para el m&oacute;dulo de ciclo de vida.</p>
<p>La classpath especifica la ubicaci&oacute;n del m&oacute;dulo de ciclo de vida. El valor por defecto es domain-dir<code>/applications</code>. Si el m&oacute;dulo ya se encuentra en este directorio (es decir, en la classpath del servidor), este campo puede dejarse en blanco.</p>
</li>
<li>
<p>En el campo Orden de Carga, introduzca un valor que especifique el orden en que este m&oacute;dulo de ciclo de vida se cargar&aacute; al inicio.</p>
<p>Los m&oacute;dulos con valores de orden de carga de enteros inferiores se cargar&aacute;n antes. El valor puede estar entre 101 y el <code>MAXINT</code> del sistema operativo. Los valores de 1 a 100 est&aacute;n reservados.</p>
</li>
<li>
<p>En el campo Descripci&oacute;n, introduzca una descripci&oacute;n del m&oacute;dulo de ciclo de vida.</p>
</li>
<li>
<p>Active la casilla de control Estado Activado para activar el m&oacute;dulo de ciclo de vida.</p>
<p>Esta opci&oacute;n se encuentra activada por defecto.</p>
</li>
<li>
<p>Active la casilla de control Ante Fallo de Carga: Evitar Inicio de Instancia para especificar que el servidor debe apagarse si se produce un fallo en la carga del m&oacute;dulo de ciclo de vida.</p>
<p>Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>El separador Destinos aparece si existen clusters o instancias de servidor independientes aparte de la instancia de servidor por defecto (<code>server</code>). Seleccione el separador Destinos para ver los destinos en los que se ha activado el m&oacute;dulo de ciclo de vida. Consulte <a href="task-appviewtargets.html">Ver los Destinos de Aplicaciones</a> para obtener instrucciones sobre c&oacute;mo activar o desactivar un m&oacute;dulo de ciclo de vida en uno o varios destinos.</p>
</li>
<li>
<p>Haga clic en Guardar.</p>
</li>
</ol>
<a id="GHCOM267" name="GHCOM267"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-lifecyclemodulenew.html">Crear un m&oacute;dulo de ciclo de vida</a></p>
</li>
<li>
<p><a href="task-lifecyclemoduledelete.html">Suprimir un m&oacute;dulo de ciclo de vida</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
