<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-eelogging" name="task-eelogging"></a><a id="GHCOM00177" name="GHCOM00177"></a></p>

<h4><a id="sthref117" name="sthref117"></a>Configurar valores de registro generales</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Configuraciones.</p>
</li>
<li>
<p>En el nodo Configuraciones, haga clic en la configuraci&oacute;n de instancia de servidor o cluster para el que desee definir la configuraci&oacute;n de registrador.</p>
<p>Se abrir&aacute; la p&aacute;gina Configuraci&oacute;n.</p>
</li>
<li>
<p>En la p&aacute;gina Configuraci&oacute;n, haga clic en Configuraci&oacute;n de Registrador.</p>
<p>Se abrir&aacute; la p&aacute;gina Configuraci&oacute;n de Registrador del destino de configuraci&oacute;n seleccionado.</p>
</li>
<li>
<p>Active la casilla de control Escribir en el log del sistema activado para enviar la salida de registro a la utilidad <code>syslog</code> adem&aacute;s de al log del servidor.</p>
<p>Esta funci&oacute;n s&oacute;lo est&aacute; disponible en sistemas Solaris y Linux. Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>Active la casilla Registrar en consola activada para enviar la salida de registro a la consola del sistema.</p>
</li>
<li>
<p>Active la casilla de control Rotaci&oacute;n en cambio de fecha para rotar los archivos log del servidor cada d&iacute;a a medianoche.</p>
</li>
<li>
<p>Active la casilla de control Modo de varias l&iacute;neas para formatear los mensajes de log de forma que resulten m&aacute;s legibles. Al cuerpo del mensaje de log se aplica sangrado y comienza en una nueva l&iacute;nea.</p>
</li>
<li>
<p>En la lista desplegable Formato de Registro de Consola, seleccione el formato para el registro en la consola. La opci&oacute;n por defecto es ODL (Oracle Diagnostics logging). La otra opci&oacute;n es ULF (UniformLogFormatter).</p>
</li>
<li>
<p>En la lista desplegable Formato de Registro de Archivo Log, seleccione el formato para el registro en el archivo log del servidor. La opci&oacute;n por defecto es ODL.</p>
</li>
<li>
<p>En el campo L&iacute;mite de Rotaci&oacute;n de Archivo, introduzca el tama&ntilde;o en bytes que el archivo log del servidor debe alcanzar antes de rotar.</p>
<p>Cuando el log del servidor alcanza el tama&ntilde;o especificado, GlassFish Server crea un nuevo archivo vac&iacute;o llamado <code>server.log</code> y cambia el nombre del archivo antiguo <code>server.log_</code><i>date</i>, donde <i>date</i> es la fecha y hora en la que se produjo la rotaci&oacute;n del archivo. El valor por defecto es 2 megabytes. El valor m&iacute;nimo para el l&iacute;mite es 500 kilobytes; si se especifica un valor inferior, el archivo rota cuando alcanza el tama&ntilde;o de 500 KB. Para desactivar la rotaci&oacute;n del archivo log, defina el valor en 0.</p>
</li>
<li>
<p>En el campo L&iacute;mite Temporal de Rotaci&oacute;n de Archivo, introduzca los minutos que deben transcurrir antes de rotar el log del servidor.</p>
<p>El valor por defecto es 0, lo que significa que el archivo rota cuando alcanza el tama&ntilde;o especificado en el campo L&iacute;mite de Rotaci&oacute;n de Archivo.</p>

<hr>
<p><b>Nota:</b></p>
Si especifica uno o m&aacute;s minutos, el l&iacute;mite de tiempo tiene prioridad sobre el l&iacute;mite de tama&ntilde;o especificado en el campo L&iacute;mite de Rotaci&oacute;n de Archivo.
<hr>

</li>
<li>
<p>En el campo Frecuencia de Vaciado, escriba el n&uacute;mero m&aacute;ximo de mensajes que se deben escribir desde la cola en el log del servidor a la vez.</p>
<p>El valor por defecto es 1.</p>
</li>
<li>
<p>En el campo M&aacute;ximo de archivos de historial, escriba el n&uacute;mero m&aacute;ximo de archivos log que GlassFish Server debe conservar antes de suprimir el archivo m&aacute;s antiguo. Si define este valor en cero (0), GlassFish Server no suprime ning&uacute;n archivo log antiguo.</p>
</li>
<li>
<p>En el campo Archivo Log, introduzca un nombre o ubicaci&oacute;n alternativos para el archivo log del servidor.</p>
<p>La ubicaci&oacute;n por defecto es <code>${com.sun.aas.instanceRoot}/logs/server.log</code>.</p>
</li>
<li>
<p>En el campo Manejador de Logs, introduzca el nombre de clase absoluto de un manejador de logs personalizado.</p>
<p>Un manejador de logs personalizado le permite enviar logs a un destino distinto a <code>server.log</code> o <code>syslog</code>. El manejador personalizado debe comprender la clase <code>java.util.logging.ConsoleHandler</code> (API compatible con JSR 047). Indique tambi&eacute;n la clase de manejador en la classpath GlassFish Server para que el manejador se instale durante el inicio del servidor.</p>
</li>
<li>
<p>Haga clic en Guardar.</p>

<hr>
<p><b>Nota:</b></p>
Seg&uacute;n la configuraci&oacute;n para la que se activ&oacute; la funci&oacute;n de registro, puede ser necesario reiniciar el servidor.
<p>Tambi&eacute;n puede ser necesario reiniciar el servidor si se cambia el nombre del archivo log por otro que no sea el valor por defecto.&ccedil; Si es necesario reiniciar el servidor se mostrar&aacute; el mensaje <code>Es Necesario Reiniciar</code> en la esquina superior derecha de la Consola de administraci&oacute;n.</p>

<hr>

</li>
</ol>
<a id="sthref118" name="sthref118"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-eelogginglevels.html">Configurar niveles de log</a></p>
</li>
<li>
<p><a href="task-logging-max-logfiles.html">Cambiar el l&iacute;mite del n&uacute;mero de archivos log rotados</a></p>
</li>
<li>
<p><a href="task-logviewer.html">Ver archivos log de DAS</a></p>
</li>
<li>
<p><a href="task-collectdomainlogs.html">Recopilar y descargar logs de dominio</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
