<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-messagesecurityproviderconfignew" name="task-messagesecurityproviderconfignew"></a><a id="GHCOM00207" name="GHCOM00207"></a></p>

<h4><a id="sthref179" name="sthref179"></a>Crear una configuraci&oacute;n de proveedor de seguridad de mensajes</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Para crear una nueva configuraci&oacute;n del proveedor de seguridad de mensajes siga los pasos siguientes:</p>
<a id="sthref180" name="sthref180"></a>
<h5>Antes de Empezar</h5>
<p>No es posible crear o suprimir proveedores de seguridad de mensajes para la configuraci&oacute;n por defecto <code>server-config</code>. Los &uacute;nicos proveedores de seguridad de mensajes soportados con la configuraci&oacute;n por defecto <code>server-config</code> son SOAP y HttpServlet. Dado que estos dos proveedores de mensajes se crean por defecto al instalar GlassFish Server, el bot&oacute;n Nuevo est&aacute; atenuado en la p&aacute;gina Configuraciones de Seguridad de Mensajes para la configuraci&oacute;n por defecto <code>server-config</code>.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Configuraci&oacute;n.</p>
</li>
<li>
<p>Ampl&iacute;e el nodo Seguridad.</p>
</li>
<li>
<p>Seleccione el nodo Seguridad de Mensajes.</p>
<p>Se abrir&aacute; la p&aacute;gina Configuraciones de Seguridad de Mensajes.</p>
</li>
<li>
<p>En la p&aacute;gina Configuraciones de Seguridad de Mensajes, haga clic en el nombre de la capa de autenticaci&oacute;n de la configuraci&oacute;n que est&aacute; editando.</p>
<p>Por defecto, la &uacute;nica configuraci&oacute;n de seguridad de mensajes configurada es SOAP.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar Configuraci&oacute;n de Seguridad de Mensajes.</p>
</li>
<li>
<p>Haga clic en el separador Proveedores.</p>
<p>Se abrir&aacute; la p&aacute;gina Configuraciones de Proveedor.</p>
</li>
<li>
<p>En la p&aacute;gina Configuraciones de Proveedor, haga clic en Nuevo.</p>
<p>Aparecer&aacute; la p&aacute;gina Nueva Configuraci&oacute;n del Proveedor.</p>
</li>
<li>
<p>En la p&aacute;gina Nueva configuraci&oacute;n del proveedor, en el campo ID de proveedor, introduzca un nombre &uacute;nico para la configuraci&oacute;n del proveedor.</p>
</li>
<li>
<p>Active la casilla de control Proveedor por Defecto para convertir a este proveedor en el proveedor por defecto.</p>
<p>El proveedor por defecto se llamar&aacute; para cualquier aplicaci&oacute;n que no identifique un proveedor espec&iacute;fico. Si el proveedor es el proveedor de cliente por defecto, el proveedor de servidor por defecto o ambos viene determinado por el tipo de proveedor.</p>
</li>
<li>
<p>En la lista desplegable Tipo de Proveedor, seleccione el tipo de proveedor.</p>
<p>Las opciones disponibles son:</p>
<dl>
<dt><code>client</code></dt>
<dd>
<p>Especifica que el proveedor es el proveedor de autenticaci&oacute;n de clientes.</p>
</dd>
<dt><code>server</code></dt>
<dd>
<p>Especifica que el proveedor es el proveedor de autenticaci&oacute;n del servidor.</p>
</dd>
<dt><code>client-server</code></dt>
<dd>
<p>Especifica que el proveedor es tanto el proveedor de autenticaci&oacute;n del servidor como del cliente.</p>
</dd>
</dl>
</li>
<li>
<p>En el campo Nombre de Clase, introduzca el nombre de la clase de implantaci&oacute;n de Java del proveedor.</p>
<p>Los proveedores de autenticaci&oacute;n del cliente deben implantar la interfaz <code>com.sun.enterprise.security.jauth.ClientAuthModule</code>. Los proveedores del servidor deben implantar la interfaz <code>com.sun.enterprise.security.jauth.ServerAuthModule</code>. Los proveedores de servidor y cliente deben implantar ambas interfaces.</p>
</li>
<li>
<p>En el &aacute;rea Pol&iacute;tica de Solicitud, de la lista desplegable Autenticar Origen, seleccione el tipo de autenticaci&oacute;n necesaria para la pol&iacute;tica de solicitud.</p>
<p>La pol&iacute;tica de solicitud determina el procesamiento de solicitudes que realizar&aacute; el proveedor de autenticaci&oacute;n. Los campos de pol&iacute;tica de solicitud son opcionales, pero si no se especifica ning&uacute;n valor, el proveedor de autenticaci&oacute;n no autenticar&aacute; los mensajes de solicitud.</p>
<p>Seleccione <code>sender</code> para especificar una autenticaci&oacute;n de remitente de la capa de mensajes (por ejemplo, nombre de usuario y contrase&ntilde;a) de los mensajes de solicitud. Seleccione <code>content</code> para especificar la autenticaci&oacute;n de contenidos (por ejemplo, firma digital) de los mensajes de solicitud. Deje este campo vac&iacute;o para que no se autentique el origen de las solicitudes. Por defecto, no hay ning&uacute;n tipo de autenticaci&oacute;n seleccionado.</p>
<p>Para obtener una descripci&oacute;n de las acciones realizadas por los proveedores de seguridad de los mensajes de SOAP, consulte <a href="ref-configreq-respolicy.html">Configuraciones de pol&iacute;ticas de solicitud y respuesta</a>.</p>
</li>
<li>
<p>De la lista desplegable Autenticar Destinatario, seleccione si la autenticaci&oacute;n de destinatario se producir&aacute; antes o despu&eacute;s de la autenticaci&oacute;n del contenido en la pol&iacute;tica de solicitud.</p>
<p>Seleccione <code>before-content</code> o <code>after-content</code> para solicitar una autenticaci&oacute;n de la capa de mensajes del destinatario del mensaje de solicitud, que se enviar&aacute; al remitente (con cifrado XML). Si no se especifica ning&uacute;n valor, el valor por defecto ser&aacute; <code>after-content</code>. Las pol&iacute;ticas se expresan en el orden del remitente del mensaje, de forma que <code>after-content</code> significa que el destinatario descifra el mensaje antes de validar la firma.</p>
</li>
<li>
<p>En el &aacute;rea Pol&iacute;tica de Respuesta, de la lista desplegable Autenticar Origen, seleccione el tipo de autenticaci&oacute;n necesaria para la pol&iacute;tica de respuesta.</p>
<p>La pol&iacute;tica de respuesta determina el procesamiento de respuestas que realizar&aacute; el proveedor de autenticaci&oacute;n. Los campos de pol&iacute;tica de respuesta son opcionales, pero si no se especifica ning&uacute;n valor, no se aplica ninguna autenticaci&oacute;n a los mensajes de respuesta.</p>
<p>Seleccione <code>sender</code> para especificar una autenticaci&oacute;n de remitente de la capa de mensajes (por ejemplo, nombre de usuario y contrase&ntilde;a) de los mensajes de respuesta. Seleccione <code>content</code> para especificar la autenticaci&oacute;n de contenido (por ejemplo, firma digital) de los mensajes de respuesta. Deje el campo vac&iacute;o para que no se autentiquen los or&iacute;genes de respuesta. Por defecto, no hay ning&uacute;n tipo de autenticaci&oacute;n seleccionado.</p>
<p>Para obtener una descripci&oacute;n de las acciones realizadas por los proveedores de seguridad de los mensajes de SOAP, consulte <a href="ref-configreq-respolicy.html">Configuraciones de pol&iacute;ticas de solicitud y respuesta</a>.</p>
</li>
<li>
<p>En la lista desplegable Autenticar Destinatario, seleccione si la autentificaci&oacute;n de destinatarios se produce antes o despu&eacute;s de la autenticaci&oacute;n de contenido en la pol&iacute;tica de respuesta.</p>
<p>Seleccione <code>before-content</code> o <code>after-content</code> para solicitar una autenticaci&oacute;n de la capa de mensajes del destinatario del mensaje de respuesta, que se enviar&aacute; al remitente (con cifrado XML). Si no se especifica ning&uacute;n valor, el valor por defecto ser&aacute; <code>after-content</code>. Las pol&iacute;ticas se expresan en el orden del remitente del mensaje, de forma que <code>after-content</code> significa que el destinatario descifra el mensaje antes de validar la firma.</p>
</li>
<li>
<p>En la secci&oacute;n Propiedades Adicionales, especifique las propiedades adicionales.</p>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, introduzca el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
<p>Para ver una descripci&oacute;n de las propiedades adicionales disponibles para configuraciones del proveedor, consulte <a href="ref-messagesecurityproviderconfigprops.html">Propiedades espec&iacute;ficas de configuraciones de proveedores de seguridad de mensajes</a>.</p>
</li>
<li>
<p>Haga clic en Aceptar.</p>
</li>
</ol>
<a id="sthref181" name="sthref181"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">Configurar utilidades de GlassFish Server para su uso por parte de proveedores de seguridad de mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">Crear una configuraci&oacute;n de seguridad de mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">Editar una configuraci&oacute;n de seguridad de mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">Suprimir una configuraci&oacute;n de seguridad de mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">Editar una configuraci&oacute;n de proveedor de seguridad de mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">Suprimir una configuraci&oacute;n de proveedor de seguridad de mensajes</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">Activar la seguridad de mensajes para clientes de aplicaci&oacute;n</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
