<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-messagesecurityconfignew" name="task-messagesecurityconfignew"></a></p>

<h4><a id="sthref103" name="sthref103"></a>Crear una configuraci&oacute;n de seguridad de mensajes</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Normalmente no ser&aacute; necesario que cree una configuraci&oacute;n de seguridad de mensajes. GlassFish Server incluye una configuraci&oacute;n de seguridad de mensajes para la capa de autenticaci&oacute;n SOAP. Los proveedores para esta configuraci&oacute;n no est&aacute;n activados por defecto, pero puede activarlos editando la configuraci&oacute;n de seguridad de mensajes SOAP. No obstante, puede crear una configuraci&oacute;n para la capa de autenticaci&oacute;n HttpServlet y especificar una o m&aacute;s configuraciones del proveedor para ella.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Configuraci&oacute;n.</p>
</li>
<li>
<p>Ampl&iacute;e el nodo Seguridad.</p>
</li>
<li>
<p>Seleccione el nodo Seguridad de Mensajes.</p>
<p>Se abrir&aacute; la p&aacute;gina Configuraciones de Seguridad de Mensajes.</p>
</li>
<li>
<p>En la p&aacute;gina Configuraciones de Seguridad de Mensajes, haga clic en Nuevo.</p>
<p>Se abrir&aacute; la p&aacute;gina Nueva Configuraci&oacute;n de Seguridad de Mensajes.</p>

<hr>
<p><b>Nota:</b></p>
No es posible crear o suprimir proveedores de seguridad de mensajes para la configuraci&oacute;n por defecto <code>server-config</code>. Los &uacute;nicos proveedores de seguridad de mensajes soportados con la configuraci&oacute;n por defecto <code>server-config</code> son SOAP y HttpServlet. Dado que estos dos proveedores de mensajes se crean por defecto al instalar GlassFish Server, el bot&oacute;n Nuevo est&aacute; atenuado en la p&aacute;gina Configuraciones de Seguridad de Mensajes para la configuraci&oacute;n por defecto <code>server-config</code>.
<hr>

</li>
<li>
<p>En la p&aacute;gina Nueva Configuraci&oacute;n de Seguridad de Mensajes, en la lista desplegable Capa de Autenticaci&oacute;n, seleccione la capa de mensajes para la que est&aacute; creando la configuraci&oacute;n.</p>
<p>Debido a que por defecto hay una configuraci&oacute;n de SOAP disponible, la &uacute;nica opci&oacute;n es <code>HttpServlet</code>.</p>
</li>
<li>
<p>En el campo ID de proveedor, introduzca un identificador &uacute;nico de configuraci&oacute;n del proveedor para esta configuraci&oacute;n de seguridad de mensajes.</p>
</li>
<li>
<p>Active la casilla de control Proveedor por Defecto para especificar que esta configuraci&oacute;n de proveedor ser&aacute; el proveedor por defecto.</p>
</li>
<li>
<p>En la lista desplegable Tipo de Proveedor, seleccione el tipo de proveedor.</p>
<p>Las opciones disponibles son:</p>
<dl>
<dt><code>client</code></dt>
<dd>
<p>Especifica que el proveedor es el proveedor de autenticaci&oacute;n de clientes.</p>
</dd>
<dt><code>server</code></dt>
<dd>
<p>Especifica que el proveedor es el proveedor de autenticaci&oacute;n del servidor.</p>
</dd>
<dt><code>client-server</code></dt>
<dd>
<p>Especifica que el proveedor es tanto el proveedor de autenticaci&oacute;n del servidor como del cliente.</p>
</dd>
</dl>
</li>
<li>
<p>En el campo Nombre de Clase, introduzca el nombre de la clase de implantaci&oacute;n de Java del proveedor.</p>
<p>Los proveedores de autenticaci&oacute;n del cliente deben implantar la interfaz <code>com.sun.enterprise.security.jauth.ClientAuthModule</code>. Los proveedores del servidor deben implantar la interfaz <code>com.sun.enterprise.security.jauth.ServerAuthModule</code>. Los proveedores de servidor y cliente deben implantar ambas interfaces.</p>
</li>
<li>
<p>En la secci&oacute;n Propiedades Adicionales, especifique las propiedades adicionales.</p>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, introduzca el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
<p>GlassFish Server no define ninguna propiedad adicional para la configuraci&oacute;n de seguridad de mensajes.</p>
</li>
</ol>
<a id="GHCOM310" name="GHCOM310"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">Configurar utilidades de GlassFish Server para su uso por parte de proveedores de seguridad de mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">Editar una configuraci&oacute;n de seguridad de mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">Suprimir una configuraci&oacute;n de seguridad de mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">Crear una configuraci&oacute;n de proveedor de seguridad de mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">Editar una configuraci&oacute;n de proveedor de seguridad de mensajes</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">Suprimir una configuraci&oacute;n de proveedor de seguridad de mensajes</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">Activar la seguridad de mensajes para clientes de aplicaci&oacute;n</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
