<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-appredeploy" name="task-appredeploy"></a></p>

<h4><a id="sthref92" name="sthref92"></a><a id="sthref93" name="sthref93"></a>Volver a desplegar una aplicaci&oacute;n desplegada</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Al volver a desplegar una aplicaci&oacute;n, se despliega una versi&oacute;n nueva de la aplicaci&oacute;n y al mismo tiempo se mantiene la configuraci&oacute;n y otras opciones propias de la aplicaci&oacute;n cuando se despleg&oacute; inicialmente.</p>
<a id="sthref94" name="sthref94"></a>
<h5>Antes de Empezar</h5>
<p>Aseg&uacute;rese de que la aplicaci&oacute;n que est&aacute; volviendo a desplegar ya est&aacute; desplegada.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, seleccione el nodo Aplicaciones.</p>
<p>Se abrir&aacute; la p&aacute;gina Aplicaciones.</p>
</li>
<li>
<p>En la tabla Aplicaciones desplegadas, haga clic en Volver a desplegar en la fila de la aplicaci&oacute;n que desea volver a desplegar.</p>
<p>El nombre de la aplicaci&oacute;n puede incluir un identificador de versi&oacute;n opcional, que va a continuaci&oacute;n del nombre y est&aacute; separado de &eacute;l por dos puntos (<code>:</code>). Para obtener m&aacute;s informaci&oacute;n sobre las versiones de m&oacute;dulo y de aplicaci&oacute;n, consulte el apartado sobre <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>las versiones de m&oacute;dulo y de aplicaci&oacute;n</i> en <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
<p>Se abrir&aacute; la p&aacute;gina Volver a Desplegar Aplicaciones o M&oacute;dulos.</p>
</li>
<li>
<p>Especifique la ubicaci&oacute;n de la aplicaci&oacute;n que desea volver a desplegar.</p>
<ul>
<li>
<p>Si la aplicaci&oacute;n es un archivo que reside en la m&aacute;quina cliente o al que se puede acceder desde la misma, seleccione la opci&oacute;n Archivo Empaquetado que Cargar en el Servidor.</p>
<p>La m&aacute;quina cliente es el host en el que est&aacute; visualizando la Consola de administraci&oacute;n a trav&eacute;s de un explorador.</p>
<p>Haga clic en Examinar para buscar el archivo o bien escriba la ruta de acceso completa hasta el archivo.</p>
</li>
<li>
<p>Si la aplicaci&oacute;n es un archivo que reside en la m&aacute;quina del servidor o es una aplicaci&oacute;n no empaquetada de un directorio separado, seleccione la opci&oacute;n Archivo empaquetado local o directorio accesible desde GlassFish Server.</p>
<p>La m&aacute;quina servidor es el host que est&aacute; ejecutando el servidor de administraci&oacute;n de dominio (DAS).</p>
<p>Haga clic en Examinar Archivos para buscar un archivo o en Examinar Carpetas para buscar un directorio. Como opci&oacute;n alternativa, escriba el nombre de la ruta de acceso completa al archivo o directorio. El despliegue desde un directorio separado es para desarrolladores avanzados y no se recomienda para entornos de producci&oacute;n.</p>
</li>
</ul>
</li>
<li>
<p>Active la casilla de control Disponibilidad Activada para activar la persistencia de sesiones y los puntos de control de SFSB para la aplicaci&oacute;n.</p>
<p>Si se activa la casilla de control Activado, se activa la alta disponibilidad para las sesiones web, la aplicaci&oacute;n de puntos de control de bean de sesi&oacute;n con estado (SFSB) y posiblemente para la desactivaci&oacute;n. Si se define en false (valor por defecto), el guardado de sesiones web y los puntos de control de SFSB quedan desactivados para la aplicaci&oacute;n especificada. Si se define en true, la aplicaci&oacute;n especificada se activa para alta disponibilidad. Defina esta opci&oacute;n como true s&oacute;lo si se ha configurado y activado la alta disponibilidad en niveles superiores, como, por ejemplo, los niveles de servidor y contenedor.</p>
<p>Esta opci&oacute;n aparece si existen clusters o instancias del servidor independientes aparte de la instancia de servidor por defecto (<code>server</code>).</p>
</li>
<li>
<p>Active la casilla de control Precompilar JSP para precompilar los archivos de JavaServer Pages (JSP).</p>
<p>Si est&aacute; desactivada esta opci&oacute;n, los archivos JSP se compilar&aacute;n en tiempo de ejecuci&oacute;n cuando se acceda a los mismos por primera vez. Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>Active la casilla de control Ejecutar Verificador para verificar los descriptores de despliegue antes del nuevo despliegue.</p>
<p>Si esta opci&oacute;n est&aacute; activada y se produce un fallo en la verificaci&oacute;n, el nuevo despliegue no se llevar&aacute; a cabo. El verificador examinar&aacute; la estructura y el contenido de los descriptores de despliegue. La verificaci&oacute;n de aplicaciones de gran tama&ntilde;o tiende a llevar mucho tiempo. Esta opci&oacute;n se activada por defecto.</p>
<p>Los paquetes de verificador se deben haber instalado desde la herramienta de actualizaci&oacute;n o se registrar&aacute; una advertencia y se ignorar&aacute; esta opci&oacute;n.</p>
</li>
<li>
<p>Active la casilla de control Java Web Start para activar el acceso a Java Web Start para un m&oacute;dulo de cliente de aplicaciones.</p>
<p>Esta opci&oacute;n est&aacute; activada o desactivada por defecto en funci&oacute;n de su configuraci&oacute;n en el despliegue original.</p>
</li>
<li>
<p>Active la casilla de control Mantener Estado para mantener sesiones web, instancias de SFSB y temporizadores EJB creados con persistencia entre nuevos despliegues.</p>
<p>Esta opci&oacute;n se activada por defecto. Esta opci&oacute;n s&oacute;lo est&aacute; soportada en la instancia de servidor por defecto, denominada <code>server</code>. No se soporta para ning&uacute;n otro destino y se ignorar&aacute;.</p>
<p>Algunos cambios efectuados en una aplicaci&oacute;n entre nuevos despliegues impiden que esta opci&oacute;n funcione correctamente. Por ejemplo, no cambie el juego de variables de instancia en la clase de bean SFSB.</p>
<p>Para las aplicaciones web, esta funci&oacute;n s&oacute;lo es aplicable si, en el archivo <code>glassfish-web-app.xml</code>, el atributo <code>persistence-type</code> del elemento <code>session-manager</code> es <code>file</code>.</p>
<p>Para instancias de bean de sesi&oacute;n con estado, el tipo de persistencia sin alta disponibilidad se define en el servidor (con la opci&oacute;n Tipo de Persistencia SFSB) y se debe definir en <code>file</code>, que es el valor por defecto y recomendado.</p>
<p>Si una sesi&oacute;n web, instancia SFSB o temporizador EJB activo no se conserva o restablece, <i>ninguno</i> de ellos estar&aacute; disponible cuando se haya completado el nuevo despliegue. Sin embargo, el nuevo despliegue continuar&aacute; y se registrar&aacute; una advertencia.</p>
<p>Para conservar datos de estado activo, GlassFish Server serializa los datos y los guarda en la memoria. Para restaurar los datos, el cargador de clases de la aplicaci&oacute;n que se acaba de volver a desplegar deserializa los datos guardados anteriormente.</p>
</li>
<li>
<p>Active la casilla de control Conservar Recursos de &Aacute;mbito de Aplicaci&oacute;n para conservar recursos restringidos al &aacute;mbito de aplicaci&oacute;n y restaurarlos durante el nuevo despliegue.</p>
<p>Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>Haga clic en Aceptar.</p>
</li>
</ol>
<a id="sthref95" name="sthref95"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-applistdeployed.html">Ver una lista de aplicaciones desplegadas</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">Desplegar una aplicaci&oacute;n web</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">Desplegar una aplicaci&oacute;n de empresa</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">Desplegar un cliente de aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">Desplegar un m&oacute;dulo del conector</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">Desplegar un JAR EJB</a></p>
</li>
<li>
<p><a href="task-appedit.html">Editar una aplicaci&oacute;n desplegada</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">Ver los descriptores de una aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-appviewtargets.html">Ver los Destinos de Aplicaciones</a></p>
</li>
<li>
<p><a href="task-endpoint.html">Ver informaci&oacute;n de punto final para un servicio web</a></p>
</li>
<li>
<p><a href="task-applaunch.html">Iniciar una aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">Iniciar un cliente de aplicaciones</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">Descargar stubs de clientes de aplicaciones</a></p>
</li>
<li>
<p><a href="task-apprestart.html">Volver a cargar una aplicaci&oacute;n desplegada</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">Ver los Recursos de &Aacute;mbito de Aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">Modificar los Recursos de &Aacute;mbito de Aplicaci&oacute;n</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbcontaineravailability.html">Configurar los valores de disponibilidad del contenedor EJB</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
