<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmxconnectoredit" name="task-jmxconnectoredit"></a></p>

<h4><a id="sthref110" name="sthref110"></a>Editar el conector JMX</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice el servicio de administraci&oacute;n para configurar un conector JMX remoto compatible con JSR 160.</p>
<p>El conector JMX remoto compatible con JSR 160 maneja la comunicaci&oacute;n entre clientes JMX, como JConsole y el servicio JMX con fines de gesti&oacute;n del dominio.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Configuraci&oacute;n.</p>
</li>
<li>
<p>En el nodo Configuraci&oacute;n, seleccione el nodo Servicio de Administraci&oacute;n.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar Conector JMX.</p>
</li>
<li>
<p>Active la casilla de control Seguridad Activada para que la comunicaci&oacute;n JMX est&eacute; cifrada.</p>
<p>Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>En el campo Direcci&oacute;n, introduzca la direcci&oacute;n IP del servicio de asignaci&oacute;n de nombres donde se encuentra registrado el stub del servidor del conector JMX.</p>
<p>&Eacute;ste no es el puerto del socket del servidor que permite la comunicaci&oacute;n de JMX. &Eacute;sta es la direcci&oacute;n de la interfaz de red donde se ha iniciado el registro de RMI. Si el sistema dispone de varias interfaces de red, modifique este valor para que s&oacute;lo se seleccione una interfaz determinada. El valor por defecto es <code>0.0.0.0</code>.</p>
</li>
<li>
<p>En el campo Puerto, introduzca el n&uacute;mero de puerto en el que el servicio de asignaci&oacute;n de nombres (registro RMI) recibe las conexiones del cliente RMI.</p>
<p>La &uacute;nica funci&oacute;n de este servicio de nomenclatura es descargar los stubs de RMI. Si el puerto por defecto est&aacute; ocupado, se utilizar&aacute; otro puerto que est&eacute; libre. Los valores v&aacute;lidos se encuentran entre 1 y 65535. En sistemas UNIX, para la creaci&oacute;n de sockets de recepci&oacute;n para los puertos 1-1024 se necesitan privilegios de superusuario. El valor por defecto es 8686.</p>
</li>
<li>
<p>En el campo Nombre de Dominio, escriba el nombre que representa el dominio administrativo especial.</p>
<p>Este dominio maneja toda la autenticaci&oacute;n. El valor por defecto es <code>admin-realm</code>.</p>
</li>
<li>
<p>En la secci&oacute;n Propiedades Adicionales, especifique las propiedades adicionales.</p>
<p>GlassFish Server especifica varias propiedades por defecto.</p>
<ul>
<li>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, introduzca el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
</li>
<li>
<p>Para modificar una propiedad, edite el campo Valor.</p>
</li>
<li>
<p>Para suprimir una propiedad, active la casilla de control a la izquierda del campo Nombre de la propiedad que est&aacute; suprimiendo y, a continuaci&oacute;n, haga clic en el bot&oacute;n Suprimir Propiedades.</p>
</li>
</ul>
</li>
<li>
<p>Haga clic en Guardar.</p>
</li>
<li>
<p>Si activa la casilla de control Seguridad Activada, siga los pasos descritos en <a href="task-jmxconnectorssledit.html">Editar configuraci&oacute;n de SSL para el conector JMX</a>.</p>
</li>
</ol>
<a id="GHCOM320" name="GHCOM320"></a>
<h5>Consulte tambi&eacute;n</h5>
<p><a href="task-jmxconnectorssledit.html">Editar configuraci&oacute;n de SSL para el conector JMX</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
