<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-uc-update" name="task-uc-update"></a><a id="GHCOM00215" name="GHCOM00215"></a></p>

<h4><a id="sthref201" name="sthref201"></a>Ver actualizaciones disponibles para componentes</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La p&aacute;gina Actualizaciones disponibles ofrece informaci&oacute;n sobre las &uacute;ltimas versiones de los componentes de la imagen de instalaci&oacute;n que est&aacute;n instalados.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, seleccione el nodo Herramienta de Actualizaci&oacute;n.</p>
<p>Se abrir&aacute; la p&aacute;gina Complementos Disponibles.</p>
</li>
<li>
<p>En la p&aacute;gina Complementos Disponibles, haga clic en el separador Actualizaciones Disponibles.</p>
<p>Se abrir&aacute; la p&aacute;gina Actualizaciones Disponibles. Si no hay actualizaciones disponibles, la tabla aparecer&aacute; vac&iacute;a.</p>
</li>
</ol>
<a id="sthref202" name="sthref202"></a>
<h5>Pasos Siguientes</h5>
<p>Para instalar las actualizaciones disponibles, primero debe parar el dominio de GlassFish Server. A continuaci&oacute;n, utilice uno de estos comandos:</p>
<ul>
<li>
<p>as-install-parent<code>/bin/updatetool</code>, que inicia la utilidad gr&aacute;fica Herramienta de actualizaci&oacute;n.</p>
</li>
<li>
<p>as-install-parent<code>/bin/pkg</code>, versi&oacute;n de l&iacute;nea de comandos de la herramienta de actualizaci&oacute;n</p>
</li>
</ul>
<p>Para obtener m&aacute;s informaci&oacute;n sobre el uso del comando <code>pkg</code>, consulte el <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSADG00014">Cap&iacute;tulo 11, sobre <i>ampliaci&oacute;n y actualizaci&oacute;n de GlassFish Server</i>, en <i>Oracle GlassFish Server Administration Guide</i></a>. La utilidad Herramienta de Actualizaci&oacute;n tiene su propia ayuda en pantalla.</p>
<p>Reinicie el servidor despu&eacute;s de instalar las actualizaciones.</p>
<a id="sthref203" name="sthref203"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-uc-addon.html">Instalar componentes de complementos</a></p>
</li>
<li>
<p><a href="task-uc-installed-remove.html">Ver componentes instalados</a></p>
</li>
<li>
<p><a href="task-uc-pkgdetails.html">Ver informaci&oacute;n detallada sobre un componente</a></p>
</li>
<li>
<p><a href="task-uc-set-proxy.html">Configurar valores de proxy de red para acceder a repositorios de red</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
