<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-uc-set-proxy" name="task-uc-set-proxy"></a><a id="GHCOM00218" name="GHCOM00218"></a></p>

<h4><a id="sthref209" name="sthref209"></a><a id="sthref210" name="sthref210"></a><a id="sthref211" name="sthref211"></a>Configurar valores de proxy de red para acceder a repositorios de red</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La configuraci&oacute;n de proxy de red determina la manera en que GlassFish Server se conecta a Internet. Para activar Herramienta de Actualizaci&oacute;n para que acceda a los repositorios de red a trav&eacute;s de Internet, configure el proxy de red.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, seleccione el nodo Herramienta de Actualizaci&oacute;n.</p>
<p>Se abrir&aacute; la p&aacute;gina Complementos Disponibles.</p>
</li>
<li>
<p>En la p&aacute;gina Complementos Disponibles, haga clic en el separador Configuraci&oacute;n.</p>
<p>Se muestra la p&aacute;gina Configuraci&oacute;n de Herramienta de Actualizaci&oacute;n.</p>
</li>
<li>
<p>En la p&aacute;gina Configuraci&oacute;n de Herramienta de Actualizaci&oacute;n, especifique c&oacute;mo se conecta a Internet la m&aacute;quina en la que se est&aacute; ejecutando GlassFish Server.</p>
<ul>
<li>
<p>Si la m&aacute;quina se conecta a Internet directamente, seleccione la opci&oacute;n Conexi&oacute;n Directa.</p>
</li>
<li>
<p>Si la m&aacute;quina se conecta a Internet a trav&eacute;s de un proxy, seleccione la opci&oacute;n A trav&eacute;s de un Proxy.</p>
</li>
</ul>
</li>
<li>
<p>Si la m&aacute;quina en la que se est&aacute; ejecutando GlassFish Server se conecta a Internet a trav&eacute;s de un proxy, obtenga el nombre de host y el n&uacute;mero de puerto del proxy.</p>
<p>Si la m&aacute;quina en la que se est&aacute; ejecutando GlassFish Server se conecta directamente a Internet, omita este paso.</p>
<p>Un explorador web debe estar ejecut&aacute;ndose en la m&aacute;quina en la que se est&aacute; ejecutando GlassFish Server. En esta situaci&oacute;n, puede obtener el nombre de host y el n&uacute;mero de puerto del proxy del explorador web. De lo contrario, p&oacute;ngase en contacto con el administrador del sistema para obtener m&aacute;s informaci&oacute;n.</p>
</li>
<li>
<p>Haga clic en Guardar.</p>
</li>
</ol>
<a id="sthref212" name="sthref212"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-uc-update.html">Ver actualizaciones disponibles para componentes</a></p>
</li>
<li>
<p><a href="task-uc-addon.html">Instalar componentes de complementos</a></p>
</li>
<li>
<p><a href="task-uc-installed-remove.html">Ver componentes instalados</a></p>
</li>
<li>
<p><a href="task-uc-pkgdetails.html">Ver informaci&oacute;n detallada sobre un componente</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
