<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-ejbgeneral" name="ref-ejbgeneral"></a></p>

<h4><a id="sthref5" name="sthref5"></a><a id="sthref6" name="sthref6"></a>Enterprise Java Beans (EJB)</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Enterprise Java Beans (EJB) para configurar as defini&ccedil;&otilde;es para o cont&ecirc;iner EJB.</p>
<p>Al&eacute;m das defini&ccedil;&otilde;es gerais para enterprise beans, &eacute; poss&iacute;vel configurar as defini&ccedil;&otilde;es do pool e do cache.</p>
<ul>
<li>
<p>As defini&ccedil;&otilde;es do Pool somente se aplicam a beans de sess&atilde;o stateless. Por default, o cont&ecirc;iner mant&eacute;m um pool de enterprise beans, para poder responder &agrave;s solicita&ccedil;&otilde;es do cliente sem a diminui&ccedil;&atilde;o de desempenho que resulta da cria&ccedil;&atilde;o dos beans.</p>
<p>Caso tenha problemas de desempenho em uma aplica&ccedil;&atilde;o que usa enterprise beans implantados, voc&ecirc; poder&aacute; ajudar a aprimorar o desempenho da aplica&ccedil;&atilde;o ao criar um pool ou ao aumentar o n&uacute;mero de beans mantidos por um pool existente.</p>
</li>
<li>
<p>As defini&ccedil;&otilde;es do cache somente se aplicam a beans de sess&atilde;o stateful. O cont&ecirc;iner mant&eacute;m um cache de dados para os enterprise beans mais usados. Isso permite que o cont&ecirc;iner responda com maior rapidez as solicita&ccedil;&otilde;es de outros m&oacute;dulos da aplica&ccedil;&atilde;o por dados do enterprise bean.</p>
<p>Os enterprise beans armazenados no cache est&atilde;o em um de tr&ecirc;s estados: ativo, ocioso ou apassivado. Um enterprise bean ativo est&aacute; sendo acessado no momento por clientes. Os dados de um enterprise bean inativo est&atilde;o no cache no momento, mas nenhum cliente est&aacute; acessando o bean. Os dados de um bean passivo s&atilde;o armazenados temporariamente e s&atilde;o lidos para o cache se um cliente solicitar um bean.</p>
</li>
</ul>
<p>A p&aacute;gina Enterprise Java Beans (EJB) cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Carregar Defaults</dt>
<dd>
<p>Bot&atilde;o para restaurar defini&ccedil;&otilde;es para seus valores default. Defini&ccedil;&otilde;es que n&atilde;o tiveram seus valores default alterados.</p>
</dd>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Local de Armazenamento de Sess&atilde;o</dt>
<dd>
<p>O diret&oacute;rio onde os beans passivos de sess&atilde;o stateful e sess&otilde;es HTTP com persist&ecirc;ncia s&atilde;o armazenados no sistema de arquivos. O valor default &eacute; <code>${com.sun.aas.instanceRoot}/session-store</code>.</p>
<p>Os beans passivos s&atilde;o beans de sess&atilde;o stateful que tenham seus estados gravados em um arquivo no sistema de arquivos. Eles normalmente estavam ociosos por um determinado per&iacute;odo de tempo e n&atilde;o est&atilde;o no momento sendo acessados por clientes. Da mesma forma, as sess&otilde;es HTTP com persist&ecirc;ncia s&atilde;o sess&otilde;es individuais da Web cujos estados foram gravados em um arquivo no sistema de arquivos.</p>
</dd>
<dt>Op&ccedil;&atilde;o de Confirma&ccedil;&atilde;o</dt>
<dd>
<p>Especifica como o cont&ecirc;iner efetua o cache de inst&acirc;ncias de beans passivos entre transa&ccedil;&otilde;es. Se voc&ecirc; selecionar a Op&ccedil;&atilde;o B (a default), o cont&ecirc;iner efetuar&aacute; o cache de uma inst&acirc;ncia pronta entre transa&ccedil;&otilde;es. Se voc&ecirc; selecionar a Op&ccedil;&atilde;o C, o cont&ecirc;iner n&atilde;o efetuar&aacute; o cache de uma inst&acirc;ncia pronta entre transa&ccedil;&otilde;es.</p>
</dd>
<dt>Tamanho Inicial e M&iacute;nimo do Pool</dt>
<dd>
<p>O n&uacute;mero m&iacute;nimo de beans a serem mantidos no pool. O valor default &eacute; 0.</p>
</dd>
<dt>Tamanho M&aacute;ximo do Pool</dt>
<dd>
<p>O n&uacute;mero m&aacute;ximo de beans que o cont&ecirc;iner pode manter no pool ao mesmo tempo. O valor default &eacute; 32.</p>
</dd>
<dt>Quantidade de Redimensionamento do Pool</dt>
<dd>
<p>O n&uacute;mero de beans que s&atilde;o removidos do Pool, se estiverem ociosos por mais tempo do que o especificado no campo Time-out para Ociosidade do Pool. O valor precisa ser ao menos 0 e menor do que o valor de Tamanho M&aacute;ximo do Pool. O valor default &eacute; 8.</p>
</dd>
<dt>Time-out para Ociosidade do Pool</dt>
<dd>
<p>O tempo, em segundos, que um pool pode permanecer ocioso antes que seja removido do pool. Ap&oacute;s essa quantidade de tempo, o bean &eacute; destru&iacute;do. Um valor de 0 significa que um bean pode permanecer ocioso indefinidamente. O valor default &eacute; 600.</p>
</dd>
<dt>Tamanho M&aacute;ximo do Cache</dt>
<dd>
<p>O n&uacute;mero m&aacute;ximo de beans a serem mantidos no cache. Aumente o n&uacute;mero m&aacute;ximo de beans no cache para eliminar a sobrecarga na cria&ccedil;&atilde;o e destrui&ccedil;&atilde;o do bean. No entanto, se o cache &eacute; aumentado, o servidor consome mais mem&oacute;ria e recursos. Assegure-se de que seu ambiente operacional seja suficiente para suas defini&ccedil;&otilde;es do cache. Um valor de 0 indica um cache n&atilde;o vinculado. O valor default &eacute; 512.</p>
</dd>
<dt>Quantidade de Redimensionamento do Cache</dt>
<dd>
<p>O n&uacute;mero m&aacute;ximo de beans que ser&atilde;o passados para o estado passivo quando o cache estiver cheio. Quando o n&uacute;mero m&aacute;ximo de beans no cache for alcan&ccedil;ado, o cont&ecirc;iner remover&aacute; uma quantidade de beans passivos do armazenamento de backup. Esse valor tamb&eacute;m especifica o n&uacute;mero de beans a serem criados se uma solicita&ccedil;&atilde;o chega quando o pool n&atilde;o tem beans dispon&iacute;veis. O valor precisa ser maior do que 1 e menor do que o valor de Tamanho M&aacute;ximo do Cache. O valor default &eacute; 32.</p>
</dd>
<dt>Time-out para Remo&ccedil;&atilde;o</dt>
<dd>
<p>O n&uacute;mero de segundos ap&oacute;s o qual o bean passivo &eacute; removido do armazenamento da sess&atilde;o. O valor 0 especifica que o cont&ecirc;iner n&atilde;o remove automaticamente os beans inativos. Se o valor da Time-out para Remo&ccedil;&atilde;o for menor ou igual ao valor de Time-out para Ociosidade do Cache, os beans s&atilde;o imediatamente removidos sem passarem para o estado passivo. O valor default &eacute; 5.400.</p>
</dd>
<dt>Pol&iacute;tica de Sele&ccedil;&atilde;o de Remo&ccedil;&atilde;o</dt>
<dd>
<p>A pol&iacute;tica usada pelo cont&ecirc;iner para remover beans de sess&otilde;es stateful do cache. As escolhas s&atilde;o as seguintes:</p>
<dl>
<dt>N&atilde;o Usado Recentemente (NRU)</dt>
<dd>
<p>Remove um bean que n&atilde;o foi usado recentemente. Esse &eacute; o valor default.</p>
</dd>
<dt>Primeiro a Entrar, Primeiro a Sair (FIFO)</dt>
<dd>
<p>Remove o bean mais antigo no cache.</p>
</dd>
<dt>Menos Usado Recentemente (LRU)</dt>
<dd>
<p>Remove o bean menos acessado recentemente.</p>
</dd>
</dl>
</dd>
<dt>Time-out para Ociosidade do Cache</dt>
<dd>
<p>A n&uacute;mero m&aacute;ximo de segundos que um bean pode permanecer ocioso no cache. Ap&oacute;s esse tempo, o cont&ecirc;iner pode passar esse bean para o estado passivo. Um valor de 0 especifica que os beans nunca se tornam candidatos para passar para o estado passivo. O valor default &eacute; 600.</p>
</dd>
<dt>Propriedades Adicionais</dt>
<dd>
<p>Propriedades adicionais do cont&ecirc;iner EJB</p>
<p>Para obter uma descri&ccedil;&atilde;o das propriedades dispon&iacute;veis, <a href="ref-ejbgeneralproperties.html">Propriedades Espec&iacute;ficas do Cont&ecirc;iner EJB</a> consulte.</p>
</dd>
</dl>
<a id="sthref7" name="sthref7"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-ejbgeneral.html">Para Configurar as Defini&ccedil;&otilde;es de EJB</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbmdbpoolsettings.html">Para Configurar as Defini&ccedil;&otilde;es do Pool MDB</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbtimerservice.html">Para Configurar o Servi&ccedil;o de Timer EJB</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbcontaineravailability.html">Para Configurar as Defini&ccedil;&otilde;es de Disponibilidade do Cont&ecirc;iner EJB</a></p>
</li>
</ul>
<a id="sthref8" name="sthref8"></a>
<h5>Comandos asadmin Relacionados</h5>
<p>Nenhum.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
