<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-ejbgeneral" name="task-ejbgeneral"></a></p>

<h4><a id="sthref2" name="sthref2"></a><a id="sthref3" name="sthref3"></a>Para Configurar as Defini&ccedil;&otilde;es de EJB</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, selecione o n&oacute; Configura&ccedil;&atilde;o.</p>
</li>
<li>
<p>Selecione o n&oacute; Cont&ecirc;iner EJB.</p>
<p>A p&aacute;gina Enterprise Java Beans (EJB) &eacute; aberta.</p>
</li>
<li>
<p>No campo Local de Armazenamento de Sess&atilde;o, digite um novo valor para o local de armazenamento da sess&atilde;o.</p>
<p>Este campo especifica o diret&oacute;rio onde os beans passivos de sess&atilde;o stateful e os estados dos checkpoint SFSB com persist&ecirc;ncia s&atilde;o armazenados no sistema de arquivos. O valor default &eacute; <code>${com.sun.aas.instanceRoot}/session-store</code>.</p>
<p>Os beans passivos s&atilde;o beans de sess&atilde;o stateful que tenham seus estados gravados em um arquivo no sistema de arquivos. Eles normalmente estavam ociosos por um determinado per&iacute;odo de tempo e n&atilde;o est&atilde;o no momento sendo acessados por clientes. Da mesma forma, os estados do checkpoint SFSB com persist&ecirc;ncia s&atilde;o sess&otilde;es individuais da Web cujos estados foram gravados em um arquivo no sistema de arquivos.</p>
<p>Esta defini&ccedil;&atilde;o se aplica aos estados do checkpoint SFSB somente se a disponibilidade do cont&ecirc;iner EJB estiver desativada. Para desativar a disponibilidade, consulte <a href="../../../ejb/en/help/task-ejbcontaineravailability.html">Para Configurar as Defini&ccedil;&otilde;es de Disponibilidade do Cont&ecirc;iner EJB</a>.</p>
</li>
<li>
<p>Selecione o bot&atilde;o Op&ccedil;&atilde;o B ou Op&ccedil;&atilde;o C para definir a Op&ccedil;&atilde;o de Confirma&ccedil;&atilde;o.</p>
<p>A Op&ccedil;&atilde;o de Confirma&ccedil;&atilde;o especifica como o cont&ecirc;iner efetua o cache de inst&acirc;ncias de beans apassivados entre transa&ccedil;&otilde;es.</p>
<ul>
<li>
<p>Se voc&ecirc; selecionar a Op&ccedil;&atilde;o B (a default), o cont&ecirc;iner efetuar&aacute; o cache de uma inst&acirc;ncia pronta entre transa&ccedil;&otilde;es.</p>
</li>
<li>
<p>Se voc&ecirc; selecionar a Op&ccedil;&atilde;o C, o cont&ecirc;iner n&atilde;o efetuar&aacute; o cache de uma inst&acirc;ncia pronta entre transa&ccedil;&otilde;es.</p>
</li>
</ul>
</li>
<li>
<p>No campo Tamanho Inicial e M&iacute;nimo do Pool, digite o n&uacute;mero m&iacute;nimo de beans a serem mantidos no Pool.</p>
<p>O valor default &eacute; 0.</p>
</li>
<li>
<p>No campo Tamanho M&aacute;ximo do Pool, digite o n&uacute;mero m&aacute;ximo de beans que o cont&ecirc;iner pode manter no pool ao mesmo tempo.</p>
<p>O valor default &eacute; 32.</p>
</li>
<li>
<p>No campo Quantidade de Redimensionamento do Pool, digite o n&uacute;mero de beans que ser&atilde;o removidos do Pool, se estiverem ociosos por mais tempo do que o especificado no campo Time-out para Ociosidade do Pool.</p>
<p>O valor precisa ser ao menos 0 e menor do que o valor de Tamanho M&aacute;ximo do Pool. O valor default &eacute; 8.</p>
</li>
<li>
<p>No campo Time-out para Ociosidade do Pool, digite o tempo, em segundos, que um Pool pode permanecer ocioso antes que seja removido do Pool.</p>
<p>Ap&oacute;s essa quantidade de tempo, o bean &eacute; destru&iacute;do. Um valor de 0 significa que um bean pode permanecer ocioso indefinidamente. O valor default &eacute; 600.</p>
</li>
<li>
<p>No campo Tamanho M&aacute;ximo do Cache, digite a quantidade m&aacute;xima de beans a serem mantidos no cache.</p>
<p>Aumente o n&uacute;mero m&aacute;ximo de beans no cache para eliminar a sobrecarga na cria&ccedil;&atilde;o e destrui&ccedil;&atilde;o do bean. No entanto, se o cache &eacute; aumentado, o servidor consome mais mem&oacute;ria e recursos. Assegure-se de que seu ambiente operacional seja suficiente para suas defini&ccedil;&otilde;es do cache. Um valor de 0 indica um cache n&atilde;o vinculado. O valor default &eacute; 512.</p>
</li>
<li>
<p>No campo Quantidade de Redimensionamento do Cache, digite o n&uacute;mero m&aacute;ximo de beans que ser&atilde;o passados para o estado passivo quando o cache estiver cheio.</p>
<p>Quando o n&uacute;mero m&aacute;ximo de beans no cache for alcan&ccedil;ado, o cont&ecirc;iner remover&aacute; uma quantidade de beans passivos do armazenamento de backup. Esse valor tamb&eacute;m especifica o n&uacute;mero de beans a serem criados se uma solicita&ccedil;&atilde;o chega quando o pool n&atilde;o tem beans dispon&iacute;veis. O valor precisa ser maior do que 1 e menor do que o valor de Tamanho M&aacute;ximo do Cache. O valor default &eacute; 32.</p>
</li>
<li>
<p>No campo Time-out para Remo&ccedil;&atilde;o, digite o n&uacute;mero de segundos ap&oacute;s o qual o bean passivo &eacute; removido do armazenamento da sess&atilde;o.</p>
<p>O valor 0 especifica que o cont&ecirc;iner n&atilde;o remove automaticamente os beans inativos. Se o valor da Time-out para Remo&ccedil;&atilde;o for menor ou igual ao valor de Time-out para Ociosidade do Cache, os beans s&atilde;o imediatamente removidos sem passarem para o estado passivo. O valor default &eacute; 5.400.</p>
</li>
<li>
<p>Na lista drop-down Pol&iacute;tica de Sele&ccedil;&atilde;o de Remo&ccedil;&atilde;o, selecione a pol&iacute;tica usada pelo cont&ecirc;iner para remover beans de sess&otilde;es stateful do cache.</p>
<p>As escolhas s&atilde;o as seguintes:</p>
<dl>
<dt>N&atilde;o Usado Recentemente (NRU)</dt>
<dd>
<p>(Default) Remove um bean que n&atilde;o foi usado recentemente.</p>
</dd>
<dt>Primeiro a Entrar, Primeiro a Sair (FIFO)</dt>
<dd>
<p>Remove o bean mais antigo no cache.</p>
</dd>
<dt>Menos Usado Recentemente (LRU)</dt>
<dd>
<p>Remove o bean menos acessado recentemente.</p>
</dd>
</dl>
</li>
<li>
<p>No campo Time-out para Ociosidade do Cache, digite o n&uacute;mero m&aacute;ximo de segundos que um bean pode permanecer ocioso no cache.</p>
<p>Ap&oacute;s esse tempo, o cont&ecirc;iner pode passar esse bean para o estado passivo. Um valor de 0 especifica que os beans nunca se tornam candidatos para passar para o estado passivo. O valor default &eacute; 600.</p>
</li>
<li>
<p>Na se&ccedil;&atilde;o Propriedades Adicionais, especifique as propriedades adicionais.</p>
<p>Para obter uma descri&ccedil;&atilde;o das propriedades dispon&iacute;veis, <a href="ref-ejbgeneralproperties.html">Propriedades Espec&iacute;ficas do Cont&ecirc;iner EJB</a> consulte.</p>
<ul>
<li>
<p>Para adicionar uma propriedade, clique no bot&atilde;o Adicionar Propriedade. Na linha em branco que for exibida, digite o nome da propriedade no campo Nome e digite o valor da propriedade no campo Valor.</p>
</li>
<li>
<p>Para modificar uma propriedade, edite o campo Valor da propriedade.</p>
</li>
<li>
<p>Para deletar uma propriedade, marque a caixa de sele&ccedil;&atilde;o &agrave; esquerda do campo Nome da Propriedade a ser deletada. Clique no bot&atilde;o Deletar Propriedades.</p>
</li>
</ul>
</li>
<li>
<p>Clique em Salvar.</p>

<hr>
<p><b>Dica:</b></p>
Para voltar &agrave;s defini&ccedil;&otilde;es default, clique no bot&atilde;o Carregar Defaults e depois em Salvar.
<hr>

</li>
<li>
<p>Reinicie o GlassFish Server.</p>
</li>
</ol>
<a id="sthref4" name="sthref4"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="../../../ejb/en/help/task-ejbmdbpoolsettings.html">Para Configurar as Defini&ccedil;&otilde;es do Pool MDB</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbtimerservice.html">Para Configurar o Servi&ccedil;o de Timer EJB</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbcontaineravailability.html">Para Configurar as Defini&ccedil;&otilde;es de Disponibilidade do Cont&ecirc;iner EJB</a></p>
</li>
</ul>




<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
