<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <link rel="stylesheet" href="adminhelp.css" type="text/css">
  <title>版權</title>
</head>
<body>
<!-- help content --><a name="wp1022127"> </a>
<h2 class="pHeading2">版權
</h2>
<a name="wp1022131"> </a>
<p class="pParagraph">Sun Microsystems, Inc.<br>
4150 Network Circle<br>
Santa Clara, CA 95054 U.S.A.
</p>
<a name="wp1022132"> </a>
<p class="pParagraph">&nbsp;
</p>
<a name="wp1022134"> </a>
<p class="pParagraph">Copyright &copy; 2006 Sun Microsystems, Inc. 版權所有。
</p>
<a name="wp1022135"> </a>
<p class="pParagraph">Sun Microsystems, Inc. 對本文件所述產品所採用的技術擁有相關智慧財產權。特別是 (但不僅限於)，這些智慧財產權可能包含一項或多項美國專利 (列於 http://www.sun.com/patents)，以及美國及其他國家/地區的一項或多項其他專利或申請中專利。 </p>
<a name="wp1022136"> </a>
<p class="pParagraph">未發行 &mdash; 依美國版權法所保留的權利。 </p>
<a name="wp1022137"> </a>
<p class="pParagraph">本產品包含 SUN MICROSYSTEMS, INC. 的機密資訊和商業秘密。未經 SUN MICROSYSTEMS, INC. 事先書面同意，不得使用、揭露或複製。 </p>
<a name="wp1022138"> </a>
<p class="pParagraph">美國政府權利 &mdash; 商業軟體。政府使用者均應遵守 Sun Microsystems, Inc. 的標準授權合約和 FAR 及其增補文件中的適用條款。 </p>
<a name="wp1022139"> </a>
<p class="pParagraph">必須遵循授權條款使用之。 </p>
<a name="wp1022140"> </a>
<p class="pParagraph">本發行物可能包含由協力廠商開發的材料。 </p>
<a name="wp1022141"> </a>
<p class="pParagraph">Sun、Sun Microsystems、Sun 標誌、Java、Jini 和 Java 咖啡杯標誌均為 Sun Microsystems, Inc. 在美國及其他國家/地區的商標或註冊商標。 </p>
<a name="wp1022142"> </a>
<p class="pParagraph">UNIX 是在美國及其他國家/地區的註冊商標，已獲得 X/Open Company, Ltd. 專屬授權。
</p>
<a name="wp1022143"> </a>
<p class="pParagraph">本產品涵蓋於並受到美國出口控制法規的控制，並可能受到其他國家/地區進出口法規的管轄。嚴禁核武、導彈、生化武器或海上核武等最終用途或一般使用者直接或間接使用本產品。嚴禁向被美國禁運的國家/地區或美國出口除外清單 (包括但不僅限於被拒人清單和特別指定的國家/地區清單) 上標識的實體出口或再出口本產品。
</p>
<a name="wp1022144"> </a>
<p class="pParagraph">_____________________________________
</p>
<a name="wp1022145"> </a>
<p class="pParagraph">Copyright &copy; 2006 Sun Microsystems, Inc., 4150 Network Circle, Santa Clara, California 95054, Etats-Unis. Tous droits r&eacute;serv&eacute;s.
</p>
<a name="wp1022146"> </a>
<p class="pParagraph">Sun Microsystems, Inc. d&eacute;tient les droits de propri&eacute;t&eacute; intellectuels relatifs &agrave; la technologie incorpor&eacute;e dans le produit qui est d&eacute;crit dans ce document. En particulier, et ce sans limitation, ces droits de propri&eacute;t&eacute; intellectuelle peuvent inclure un ou plus des brevets am&eacute;ricains list&eacute;s &agrave; l&rsquo;adresse http://www.sun.com/patents et un ou les brevets suppl&eacute;mentaires ou les applications de brevet en attente aux Etats - Unis et dans les autres pays. </p>
<a name="wp1022147"> </a>
<p class="pParagraph">Non publie - droits r&eacute;serv&eacute;s selon la l&eacute;gislation des Etats-Unis sur le droit d&rsquo;auteur.
</p>
<a name="wp1022148"> </a>
<p class="pParagraph">CE PRODUIT CONTIENT DES INFORMATIONS CONFIDENTIELLES ET DES SECRETS COMMERCIAUX DE SUN MICROSYSTEMS, INC. SON UTILISATION, SA DIVULGATION ET SA REPRODUCTION SONT INTERDITES SANS L&rsquo;AUTORISATION EXPRESSE, ECRITE ET PREALABLE DE SUN MICROSYSTEMS, INC. </p>
<a name="wp1022149"> </a>
<p class="pParagraph">L&rsquo;utilisation est soumise aux termes de la Licence. </p>
<a name="wp1022150"> </a>
<p class="pParagraph">Cette distribution peut comprendre des composants d&eacute;velopp&eacute;s par des tierces parties. </p>
<a name="wp1022151"> </a>
<p class="pParagraph">Sun, Sun Microsystems, le logo Sun, Java, Jini et le logo Java Coffee Cup sont des marques de fabrique ou des marques d&eacute;pos&eacute;es de Sun Microsystems, Inc. aux Etats-Unis et dans d&rsquo;autres pays.
</p>
<a name="wp1022152"> </a>
<p class="pParagraph">UNIX est une marque d&eacute;pos&eacute;e aux Etats-Unis et dans d&rsquo;autres pays et licenci&eacute;e exlusivement par X/Open Company, Ltd.
</p>
<a name="wp1022153"> </a>
<p class="pParagraph">Ce produit est soumis &agrave; la l&eacute;gislation am&eacute;ricaine en mati&egrave;re de contr&ocirc;le des exportations et peut &ecirc;tre soumis &agrave; la r&egrave;glementation en vigueur dans d&rsquo;autres pays dans le domaine des exportations et importations. Les utilisations, ou utilisateurs finaux, pour des armes nucl&eacute;aires, des missiles, des armes biologiques et chimiques ou du nucl&eacute;aire maritime, directement ou indirectement, sont strictement interdites. Les exportations ou r&eacute;exportations vers les pays sous embargo am&eacute;ricain, ou vers des entit&eacute;s figurant sur les listes d&rsquo;exclusion d&rsquo;exportation am&eacute;ricaines, y compris, mais de mani&egrave;re non exhaustive, la liste de personnes qui font objet d&rsquo;un ordre de ne pas participer, d&rsquo;une fa&ccedil;on directe ou indirecte, aux exportations des produits ou des services qui sont r&eacute;gis par la l&eacute;gislation am&eacute;ricaine en mati&egrave;re de contr&ocirc;le des exportations et la liste de ressortissants sp&eacute;cifiquement d&eacute;sign&eacute;s, sont rigoureusement interdites.
</p>
<a name="wp1022129"> </a>
<p class="pParagraph"></p>
<a name="wp1022128"> </a>
<p class="pParagraph"></p>
<!-- end help content -->
<hr><a href="copyright.html" target="main">法律聲明</a>
</body>
</html>
