<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jdbcconnpooladvanceattrtab" name="ref-jdbcconnpooladvanceattrtab"></a></p>

<h4><a id="sthref48" name="sthref48"></a>Erweiterte Attribute des Connection-Pools bearbeiten</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Auf der Seite "Erweiterte Attribute des Connection-Pools bearbeiten" k&ouml;nnen Sie Attribute angeben, die bei der Diagnose von Verbindungslecks helfen und die Benutzerfreundlichkeit verbessern.</p>
<p>Die Seite "Erweiterte Attribute des Connection-Pools bearbeiten" enth&auml;lt die folgenden Optionen.</p>
<dl>
<dt>Standardeinstellungen laden</dt>
<dd>
<p>Schaltfl&auml;che zur Wiederherstellung der Standardwerte von Einstellungen, die Standardwerte haben. Einstellungen, die keine Standardwerte haben, werden nicht ge&auml;ndert.</p>
</dd>
<dt>Poolname</dt>
<dd>
<p>Der Name des Connection-Pools. Der Name ist ein schreibgesch&uuml;tztes Feld. Sie k&ouml;nnen den Connection-Poolnamen nur angeben, wenn Sie einen neuen JDBC-Connection-Pool erstellen.</p>
</dd>
<dt>Anweisungstimeout</dt>
<dd>
<p>Der Zeitraum in Sekunden, nach dessen Ablauf anormal lang ausgef&uuml;hrte Abfragen beendet werden. GlassFish Server legt f&uuml;r die erstellten Anweisungen <code>QueryTimeout</code> fest. Der Wert -1 bedeutet, dass die Option deaktiviert ist. Der Standardwert ist -1.</p>
</dd>
<dt>Gr&ouml;&szlig;e des Anweisungscache</dt>
<dd>
<p>Die Anzahl der Anweisungen, die mit dem LRU-Caching-Mechanismus (Least Recently Used, Zuletzt verwendet) gecacht werden sollen. Beim Wert 0 ist das Caching von Anweisungen deaktiviert. Der Standardwert ist 0.</p>
</dd>
<dt>Init SQL</dt>
<dd>
<p>Eine SQL-Zeichenfolge, die jedes Mal auszuf&uuml;hren ist, wenn eine Verbindung im Pool erstellt (nicht wiederverwendet) wird. Bei Ausf&uuml;hrung dieser Zeichenfolge wird der Status der Verbindung initialisiert.</p>
</dd>
<dt>SQL-Trace-Listener</dt>
<dd>
<p>Eine durch Komma getrennte Liste mit Namen von Listener-Implementierungsklassen, die angibt, dass von Anwendungen ausgef&uuml;hrte SQL-Anweisungen verfolgt werden. Die Listener-Klassen m&uuml;ssen die <code>org.glassfish.api.jdbc.SQLTraceListener</code>-Schnittstelle implementieren. Die Verwendung von Listenern erm&ouml;glicht die problemlose Filterung von Logmeldungen f&uuml;r die SQL-Anweisungen und unterst&uuml;tzt Administratoren bei der Analyse der Anweisungen.</p>
</dd>
<dt>JDBC-Objekte umbrechen</dt>
<dd>
<p>Wenn diese Option aktiviert ist, rufen Anwendungen umbrochene JDBC-Objekte f&uuml;r Statement, PreparedStatement, CallableStatement, ResultSet, DatabaseMetaData ab. . Diese Option ist standardm&auml;&szlig;ig aktiviert.</p>
</dd>
<dt>Pooling</dt>
<dd>
<p>Aktiviert das Connection Pooling f&uuml;r den Pool. Diese Option ist standardm&auml;&szlig;ig aktiviert.</p>
</dd>
<dt>H&ouml;chstens einmal validieren</dt>
<dd>
<p>Gibt das Zeitintervall (in Sekunden) zwischen aufeinander folgenden Anforderungen an, eine Verbindung maximal ein Mal zu validieren. Wenn Sie dieses Attribut auf einen angemessenen Wert setzen, wird die Anzahl der von einer Verbindung ausgegebenen Validierungsanforderungen minimiert. Der Standardwert ist 0, d.h. das Attribut ist nicht aktiviert.</p>
</dd>
<dt>Verbindungslecktimeout</dt>
<dd>
<p>Die Zeitspanne in Sekunden zur Verfolgung von Verbindungslecks in einem Connection-Pool. Mit diesem Feld k&ouml;nnen Sie potenzielle, durch die Anwendung verursachte Verbindungslecks ermitteln. Eine Verbindung, die von der Anwendung nicht innerhalb des angegebenen Zeitraums an den Pool zur&uuml;ckgegeben wird, wird als potenzielles Leck betrachtet, und ein Stacktrace des aufrufenden Programms wird protokolliert. Der Wert 0 bedeutet, dass die Verfolgung von Verbindungslecks deaktiviert ist. Der Standardwert ist 0.</p>
<p>Verwenden Sie dieses Feld in Kombination mit "Leck zur&uuml;ckfordern", um potenzielle, durch die Anwendung verursachte Verbindungslecks zu verhindern.</p>
</dd>
<dt>Verbindungsleck zur&uuml;ckfordern</dt>
<dd>
<p>Wenn diese Option aktiviert ist, werden Verbindungen mit Leck im Pool wiederhergestellt, nachdem das Tracing von Verbindungslecks abgeschlossen ist. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>Anweisungslecktimeout</dt>
<dd>
<p>Die Zeit in Sekunden f&uuml;r das Tracing von Anweisungslecks in einem Connection-Pool. Mit diesem Feld k&ouml;nnen Sie potenzielle, durch die Anwendung verursachte Anweisungslecks ermitteln. Eine Anweisung, die von der Anwendung nicht innerhalb des angegebenen Zeitraums an den Pool zur&uuml;ckgegeben wird, wird als potenzielles Leck betrachtet, und ein Stacktrace des aufrufenden Programms wird protokolliert. Der Wert 0 bedeutet, dass das Tracing von Anweisungslecks deaktiviert ist. Der Standardwert ist 0.</p>
<p>Verwenden Sie dieses Feld zusammen mit "Anweisungsleck zur&uuml;ckfordern", um potenzielle, durch die Anwendung verursachte Verbindungslecks zu verhindern.</p>
</dd>
<dt>Anweisungsleck zur&uuml;ckfordern</dt>
<dd>
<p>Wenn diese Option aktiviert ist, werden Leckanweisungen im Pool wiederhergestellt, nachdem das Tracing von Anweisungslecks abgeschlossen ist. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>Erstellungswiederholungsversuche</dt>
<dd>
<p>Die Anzahl der Neuversuche, wenn bei der Erstellung einer neuen Verbindung ein Fehler aufgetreten ist. Der Wert 0 bedeutet, dass keine Neuversuche zur Verbindungsherstellung unternommen werden. Der Standardwert ist 0.</p>
</dd>
<dt>Wiederholungsintervall</dt>
<dd>
<p>Das Intervall (in Sekunden) zwischen zwei Versuchen zur Erstellung einer Verbindung. Der Standardwert ist 10. Dieses Attribut wird nur verwendet, wenn der Wert von "Erstellungswiederholungsversuche" gr&ouml;&szlig;er als 0 ist.</p>
</dd>
<dt>Verz&ouml;gerte Verkn&uuml;pfung</dt>
<dd>
<p>Bei aktivierter Option wird eine physische Verbindung nur dann mit einer logischen Verbindung verkn&uuml;pft, wenn die Verbindung verwendet wird. Die Verkn&uuml;pfung wird wieder aufgehoben, wenn die Transaktion abgeschlossen ist und eine Komponentenmethode beendet wird. Auf diese Weise wird die Wiederverwendung der physischen Verbindungen gef&ouml;rdert. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>Eintragung verz&ouml;gerter Verbindungen</dt>
<dd>
<p>Bei aktivierter Option wird eine Ressource nur dann f&uuml;r die Transaktion eingetragen, wenn sie tats&auml;chlich in einer Methode verwendet wird. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>Mit Thread verkn&uuml;pfen</dt>
<dd>
<p>Bei aktivierter Option wird eine Verbindung mit einem Thread verkn&uuml;pft. Wenn derselbe Thread eine weitere Verbindung ben&ouml;tigt, kann er die bereits mit diesem Thread verkn&uuml;pfte Verbindung wiederverwenden, wodurch die zus&auml;tzliche Belastung durch das Abrufen einer weiteren Verbindung aus dem Pool vermieden wird. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>Verbindungen abgleichen</dt>
<dd>
<p>Bei aktivierter Option muss eine aus dem Pool ausgew&auml;hlte Verbindung mit den Verbindungen abgeglichen werden, die bestimmte Zugangsdaten aufweisen. Diese Option muss aktiviert werden, wenn der Connection-Pool von Anwendungen verwendet wird, die &uuml;ber mehrere Benutzerzugangsdaten verf&uuml;gen. Diese Option kann ohne Probleme deaktiviert werden, wenn der Administrator wei&szlig;, dass die Verbindungen im Pool immer homogen sind und eine aus dem Pool abgerufene Verbindung daher nicht vom Ressourcenadapter abgeglichen werden muss. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>Max. Verbindungsnutzung</dt>
<dd>
<p>Die Anzahl der Wiederverwendungen einer Verbindung durch den Pool. Nachdem eine Verbindung so h&auml;ufig wie angegeben wiederverwendet wurde, wird sie geschlossen. Indem Sie die Anzahl der Wiederverwendungen einer Verbindung beschr&auml;nken, k&ouml;nnen Sie Anweisungslecks vermeiden, falls eine Anwendung Anweisungen nicht schlie&szlig;t. Der Wert 0 bedeutet, dass die Option deaktiviert ist. Der Standardwert ist 0.</p>
</dd>
<dt>Verbindungsvalidierung</dt>
<dd>
<p>Bei aktivierter Option ist die Verbindungsvalidierung erforderlich, die dem Server bei einem Fehler einen erneuten Verbindungsaufbau erm&ouml;glicht.</p>
</dd>
<dt>Validierungsmethode</dt>
<dd>
<p>GlassFish Server kann Datenbankverbindungen auf folgende Weise validieren.</p>
<dl>
<dt><code>auto-commit</code> und <code>metadata</code></dt>
<dd>
<p>GlassFish Server validiert eine Verbindung durch Aufruf der Methode <code>con.getAutoCommit</code> oder <code>con.getMetaData</code>.</p>

<hr>
<p><b>Hinweis:</b></p>
Viele JDBC-Treiber cachen die Ergebnisse dieser Aufrufe. Folglich f&uuml;hren diese Aufrufe nicht immer zu verl&auml;sslichen Validierungen. Informieren Sie sich beim Treiberhersteller, ob diese Aufrufe gecacht werden oder nicht.
<hr>

</dd>
<dt><code>custom-validation</code></dt>
<dd>
<p>GlassFish Server verwendet einen benutzerdefinierten Validierungsmechanismus, der durch die benutzerdefinierte Implementierungsklasse im Feld Validierungsklassenname angegeben wird.</p>
</dd>
<dt><code>table</code></dt>
<dd>
<p>Die Anwendung fragt die angegebene Datenbanktabelle ab. Die Tabelle muss vorhanden und zug&auml;nglich sein, sie muss aber keine Zeilen enthalten. Sie sollten keine bereits vorhandene Tabelle mit einer gro&szlig;en Anzahl Zeilen oder eine Tabelle verwenden, auf die h&auml;ufig zugegriffen wird.</p>
</dd>
</dl>
</dd>
<dt>Tabellenname</dt>
<dd>
<p>Name der zu &uuml;berpr&uuml;fenden Datenbanktabelle. Dieses Feld ist nur verf&uuml;gbar, wenn die Validierungsmethode <code>table</code> festgelegt wurde. Sie k&ouml;nnen den Namen entweder aus der Dropdown-Liste w&auml;hlen oder ihn eingeben.</p>
</dd>
<dt>Validierungsklassenname</dt>
<dd>
<p>Der Name einer benutzerdefinierten Validierungsimplementierungsklasse. Dieses Feld ist nur verf&uuml;gbar, wenn die Validierungsmethode <code>custom-validation</code> festgelegt wurde. Der angegebene Klassenname muss f&uuml;r GlassFish Server zug&auml;nglich sein. Die angegebene Klasse muss die <code>org.glassfish.api.jdbc.ConnectionValidation</code>-Schnittstelle implementieren. Sie k&ouml;nnen den Namen entweder aus der Dropdown-Liste w&auml;hlen oder ihn eingeben.</p>
</dd>
<dt>Bei einem beliebigen Fehler</dt>
<dd>
<p>Bei aktivierter Option schlie&szlig;t GlassFish Server alle Verbindungen im Pool und stellt sie erneut her, wenn eine Verbindung nicht erfolgreich verl&auml;uft. Bei deaktivierter Option werden einzelne Verbindungen nur bei Verwendung wiederhergestellt. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>Aufrufe durch Nicht-Komponenten zulassen</dt>
<dd>
<p>Bei aktivierter Option kann der Pool durch Aufrufe von Nicht-Komponenten, wie z.B. Servlet-Filter und Persistance Manager von Drittprovidern, verwendet werden. Verbindungen, die durch Aufrufe von Nicht-Komponenten hergestellt werden, werden am Ende einer Transaktion nicht automatisch vom Container geschlossen. Sie m&uuml;ssen explizit vom aufrufenden Programm geschlossen werden. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
</dl>
<a id="sthref49" name="sthref49"></a>
<h5>Verwandte Aufgaben</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">So wird der Datenbankzugriff eingerichtet</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">So wird ein JDBC-Treiber integriert</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">So wird einen JDBC-Connection-Pool erstellt</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">So werden allgemeine Einstellungen des JDBC-Connection-Pools bearbeitet</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">So werden Connection-Pooleinstellungen gepr&uuml;ft</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">So werden erweiterte Attribute des JDBC-Connection-Pools bearbeitet</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">So werden Eigenschaften des JDBC-Connection-Pool bearbeitet</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">So wird ein JDBC-Connection-Pool gel&ouml;scht</a></p>
</li>
</ul>
<a id="sthref50" name="sthref50"></a>
<h5>Zugeh&ouml;rige asadmin-Befehle</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00001"><code>add-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00036"><code>create-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00088"><code>delete-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00135"><code>flush-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00173"><code>list-jdbc-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00214"><code>ping-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00234"><code>start-database</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00239"><code>stop-database</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
