<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jdbcconnectionpooledit" name="task-jdbcconnectionpooledit"></a></p>

<h4><a id="sthref15" name="sthref15"></a>So werden allgemeine Einstellungen des JDBC-Connection-Pools bearbeitet</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Blenden Sie in der Navigationsbaumstruktur den Knoten "Ressourcen" ein.</p>
</li>
<li>
<p>Blenden Sie unter dem Ressourcenknoten den JDBC-Knoten ein.</p>
</li>
<li>
<p>W&auml;hlen Sie unter dem JDBC-Knoten den Knoten "Connection-Pools".</p>
<p>Die Seite "Connection-Pools" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie auf den Namen des zu bearbeitenden Connection-Pools.</p>
<p>Die Seite "Connection-Pool bearbeiten" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>W&auml;hlen Sie aus der Dropdown-Liste "Ressourcentyp" einen Ressourcentyp.</p>
<p>Zur Auswahl stehen <code>javax.sql.DataSource</code> (nur lokale Transaktionen), <code>javax.sql.XADataSource</code> (globale Transaktionen) und <code>java.sql.ConnectionPoolDataSource</code> (lokale Transaktionen, m&ouml;gliche Performanceverbesserung).</p>
</li>
<li>
<p>Geben Sie im Feld "Klassenname der Datenquelle" den Namen der herstellerspezifischen Klasse ein, die die API <code>DataSource</code>, <code>ConnectionPoolDataSource</code> oder <code>XADataSource</code> implementiert.</p>
<p>Wenn Sie einen der Datenquellenressourcentypen ausw&auml;hlen, wird in dieses Feld normalerweise automatisch der Klassenname eingef&uuml;gt, der mit dem ausgew&auml;hlten Ressourcentyp und Datenbankhersteller verbunden ist. Bei Auswahl des Ressourcentyps <code>java.sql.Driver</code> ist dieses Feld deaktiviert.</p>
</li>
<li>
<p>Geben Sie im Feld "Klassenname der Datenquelle" den Namen der herstellerspezifischen Klasse ein, die die API <code>java.sql.Driver</code> implementiert.</p>
<p>Wenn Sie den Ressourcentyp <code>java.sql.Driver</code> ausgew&auml;hlt haben, wird in dieses Feld normalerweise automatisch der Klassenname eingef&uuml;gt, der mit dem ausgew&auml;hlten Treiber und Datenbankhersteller verbunden ist. Bei Auswahl eines der Datenquellenressourcentypen ist dieses Feld deaktiviert.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Ping", um bei der Erstellung oder Neukonfiguration eines Pools automatisch ein Ping-Signal an den Pool zu senden, um falsche Attributwerte zu ermitteln und eine diesbez&uuml;gliche Warnung auszugeben.</p>
<p>Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Geben Sie im Feld "Beschreibung" eine kurze Beschreibung f&uuml;r den Connection-Pool ein.</p>
</li>
<li>
<p>Geben Sie in das Feld "Urspr&uuml;ngliche und minimale Poolgr&ouml;&szlig;e" die minimale Anzahl der Verbindungen in diesem Pool ein.</p>
<p>Dieser Wert legt auch die Anzahl an Verbindungen fest, die im Pool platziert werden, wenn der Pool erstellt bzw. GlassFish Server gestartet wird. Der Standardwert ist 8.</p>
</li>
<li>
<p>Geben Sie in das Feld "Maximale Poolgr&ouml;&szlig;e" die maximale Anzahl der Verbindungen in diesem Pool ein.</p>
<p>Der Standardwert ist 32.</p>
</li>
<li>
<p>Geben Sie im Feld "Umfang der Gr&ouml;&szlig;en&auml;nderungen des Pools" die Anzahl der Verbindungen pro Gr&ouml;&szlig;en&auml;nderung des Pools ein.</p>
<p>Wenn die Poolgr&ouml;&szlig;e nach oben oder unten skaliert wird, erfolgt die Anpassung in Schritten. Dieser Wert legt die Anzahl Verbindungen im Batch fest. Wenn dieser Wert zu hoch eingestellt ist, entstehen Verz&ouml;gerungen beim Erstellen von Verbindungen und beim Verbindungswiederaufbau, ist der Wert zu niedrig eingestellt, wird die Effizienz beeintr&auml;chtigt. Der Standardwert ist 2.</p>
</li>
<li>
<p>Geben Sie im Feld "Leerlaufzeittimeout" die maximale Dauer (in Sekunden) an, die eine Verbindung im Leerlauf im Pool verbleiben kann.</p>
<p>Nach Ablauf dieser Zeitspanne wird die Verbindung aus dem Pool entfernt. Der Standardwert ist 300.</p>
</li>
<li>
<p>Geben Sie im Feld "Maximale Wartezeit" die maximale Wartezeit (in Millisekunden) an, w&auml;hrend der die eine Verbindung anfordernde Anwendung wartet, bevor sie wegen Verbindungstimeout abgebrochen wird.</p>
<p>Der Standardwert ist 60.000.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Nicht transaktionsbezogene Verbindungen", um nicht transaktionsbezogene Verbindungen zur&uuml;ckzugeben.</p>
<p>Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>W&auml;hlen Sie aus der Dropdown-Liste den Transaktionsisolationsgrad f&uuml;r den Connection-Pool.</p>
<p>Sofern nicht angegeben, verwendet der Pool den vom JDBC-Treiber festgelegten Standardisolationsgrad. Standardm&auml;&szlig;ig ist diese Option nicht aktiviert.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Isolationsgrad garantiert", um sicherzustellen, dass f&uuml;r alle Verbindungen aus dem Pool derselbe Isolationsgrad gilt.</p>
<p>Wenn beispielsweise der Isolationsgrad f&uuml;r die Verbindung nach der letzten Verwendung programmgesteuert (&uuml;ber <code>con.setTransactionIsolation</code>) ge&auml;ndert wird, wird der Status auf den angegebenen Isolationsgrad zur&uuml;ckgesetzt.</p>
<p>Diese Einstellung steht nur dann zur Verf&uuml;gung, wenn ein Transaktionsisolationsgrad angegeben wurde.</p>
</li>
<li>
<p>Klicken Sie auf die Schaltfl&auml;che "Ping", um die Datenbankverbindung zu &uuml;berpr&uuml;fen.</p>
<p>Die Administrationskonsole versucht, eine Verbindung zur Datenbank herzustellen. Wenn eine Fehlermeldung angezeigt wird, pr&uuml;fen Sie, ob der Datenbankserver neu gestartet wurde.</p>
</li>
<li>
<p>Klicken Sie auf die Schaltfl&auml;che "Leeren", um den Connection-Pool in seinen urspr&uuml;nglichen Zustand zur&uuml;ckzuversetzen.</p>
<p>Bestehende Liveverbindungen werden gel&ouml;scht, was bedeutet, dass die mit diesen Verbindungen verbundenen Transaktionen verloren gehen. Anschlie&szlig;end erstellt der Unterbefehl die anf&auml;nglichen Verbindungen f&uuml;r den Pool neu und stellt dann die konstante Gr&ouml;&szlig;e des Pools wieder her.</p>
</li>
<li>
<p>Klicken Sie auf "Speichern".</p>

<hr>
<p><b>Tipp:</b></p>
Um zu den Standardeinstellungen zur&uuml;ckzukehren, klicken Sie auf die Schaltfl&auml;che "Standardwerte laden" und anschlie&szlig;end auf "Speichern".
<hr>

</li>
</ol>
<a id="sthref16" name="sthref16"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">So wird der Datenbankzugriff eingerichtet</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">So wird ein JDBC-Treiber integriert</a></p>
</li>
<li>
<p><a href="task-jdbcresourcenew.html">So wird eine JDBC-Ressource erstellt</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesedit.html">So wird eine JDBC-Ressource bearbeitet</a></p>
</li>
<li>
<p><a href="task-jdbcresourcetargets.html">So werden Ziele f&uuml;r JDBC-Ressourcen bearbeitet</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesdelete.html">So wird eine JDBC-Ressource gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">So wird einen JDBC-Connection-Pool erstellt</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">So werden erweiterte Attribute des JDBC-Connection-Pools bearbeitet</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">So werden Connection-Pooleinstellungen gepr&uuml;ft</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">So werden Eigenschaften des JDBC-Connection-Pool bearbeitet</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">So wird ein JDBC-Connection-Pool gel&ouml;scht</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
