<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jdbcconnectionpooladvance" name="task-jdbcconnectionpooladvance"></a></p>

<h4><a id="sthref19" name="sthref19"></a>So werden erweiterte Attribute des JDBC-Connection-Pools bearbeitet</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Blenden Sie in der Navigationsbaumstruktur den Knoten "Ressourcen" ein.</p>
</li>
<li>
<p>W&auml;hlen Sie unter dem Ressourcenknoten den JDBC-Knoten.</p>
</li>
<li>
<p>W&auml;hlen Sie unter dem JDBC-Knoten den Knoten "Connection-Pools".</p>
<p>Die Seite "Connection-Pools" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie auf der Seite "Connection-Pools" auf den Namen des zu bearbeitenden Pools.</p>
<p>Die Seite "Connection-Pool bearbeiten" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie auf der Seite "Connection-Pool bearbeiten" auf die Registerkarte "Erweitert".</p>
<p>Die Seite "Erweiterte Attribute des Connection-Pools bearbeiten" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Geben Sie im Feld "Timeout bei Anweisung" die Dauer (in Sekunden) an, nach der anormal lang dauernde Abfragen beendet werden.</p>
<p>GlassFish Server legt f&uuml;r die erstellten Anweisungen <code>QueryTimeout</code> fest. Legen Sie den Wert auf -1 fest, um diese Option zu deaktivieren. Der Standardwert ist -1.</p>
</li>
<li>
<p>Geben Sie im Feld "Gr&ouml;&szlig;e des Anweisungscache" die Anzahl der Anweisungen ein, die mit dem LRU-Caching-Mechanismus (Least Recently Used, Zuletzt verwendet) gecacht werden sollen.</p>
<p>Zum Deaktivieren des Anweisungs-Cachings geben Sie den Wert 0 an. Der Standardwert ist 0.</p>
</li>
<li>
<p>Geben Sie im Feld "Init SQL" eine SQL-Zeichenfolge ein, die jedes Mal ausgef&uuml;hrt werden soll, wenn eine Verbindung im Pool erstellt (nicht wiederverwendet) wird.</p>
<p>Bei Ausf&uuml;hrung dieser Zeichenfolge wird der Status der Verbindung initialisiert.</p>
</li>
<li>
<p>Geben Sie im Feld "SQL-Trace-Listener" eine durch Komma getrennte Liste mit Namen von Listener-Implementierungsklassen ein, um anzugeben, dass von Anwendungen ausgef&uuml;hrte SQL-Anweisungen verfolgt werden.</p>
<p>Die Listener-Klassen m&uuml;ssen die <code>org.glassfish.api.jdbc.SQLTraceListener</code>-Schnittstelle implementieren. Die Verwendung von Listenern erm&ouml;glicht die problemlose Filterung von Logmeldungen f&uuml;r die SQL-Anweisungen und unterst&uuml;tzt Administratoren bei der Analyse der Anweisungen.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "JDBC-Objekte umbrechen", sodass die Anwendungen umbrochene JDBC-Objekte f&uuml;r <code>Statement</code>, <code>PreparedStatement</code>, <code>CallableStatement</code>, <code>ResultSet</code>, <code>DatabaseMetaData</code> erhalten.</p>
<p>Diese Option ist standardm&auml;&szlig;ig aktiviert.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Pooling", um das Connection Pooling f&uuml;r den Pool zu aktivieren.</p>
<p>Diese Option ist standardm&auml;&szlig;ig aktiviert.</p>
</li>
<li>
<p>Geben Sie in das Feld "H&ouml;chstens einmal &uuml;berpr&uuml;fen" die Dauer (in Sekunden) ein, nach der eine Verbindung h&ouml;chstens einmal &uuml;berpr&uuml;ft wird.</p>
<p>Wenn Sie dieses Attribut auf einen angemessenen Wert setzen, wird die Anzahl der von einer Verbindung ausgegebenen Validierungsanforderungen minimiert. Der Standardwert ist 0, d.h. das Attribut ist nicht aktiviert.</p>
</li>
<li>
<p>Geben Sie in das Feld "Verbindungslecktimeout" die Dauer (in Sekunden) ein, die zum Tracing von Verbindungslecks in einem Connection-Pool erforderlich ist.</p>
<p>Mit diesem Feld k&ouml;nnen Sie potenzielle, durch die Anwendung verursachte Verbindungslecks ermitteln. Eine Verbindung, die von der Anwendung nicht innerhalb des angegebenen Zeitraums an den Pool zur&uuml;ckgegeben wird, wird als potenzielles Leck betrachtet, und ein Stacktrace des aufrufenden Programms wird protokolliert. Setzen Sie den Wert auf 0, um das Tracing von Verbindungslecks zu deaktivieren. Der Standardwert ist 0.</p>
<p>Verwenden Sie dieses Feld zusammen mit "Verbindungsleck zur&uuml;ckfordern", um potenzielle, durch die Anwendung verursachte Verbindungslecks zu verhindern.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Verbindungsleck zur&uuml;ckfordern", um Verbindungen mit Lecks im Pool wiederherzustellen, wenn das Tracing von Verbindungslecks abgeschlossen ist.</p>
<p>Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Geben Sie in das Feld "Anweisungslecktimeout" die Dauer (in Sekunden) ein, die zum Tracing von Anweisungslecks in einem Connection-Pool erforderlich ist.</p>
<p>Mit diesem Feld k&ouml;nnen Sie potenzielle, durch die Anwendung verursachte Anweisungslecks ermitteln. Eine Anweisung, die von der Anwendung nicht innerhalb des angegebenen Zeitraums an den Pool zur&uuml;ckgegeben wird, wird als potenzielles Leck betrachtet, und ein Stacktrace des aufrufenden Programms wird protokolliert. Setzen Sie den Wert auf 0, um das Tracing von Anweisungslecks zu deaktivieren. Der Standardwert ist 0.</p>
<p>Verwenden Sie dieses Feld zusammen mit "Anweisungsleck zur&uuml;ckfordern", um potenzielle, durch die Anwendung verursachte Anweisungslecks zu verhindern.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Anweisungsleck zur&uuml;ckfordern", um Anweisungen mit Lecks im Pool wiederherzustellen, wenn das Tracing von Anweisungslecks abgeschlossen ist.</p>
<p>Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Geben Sie in das Feld "Erstellungswiederholungsversuche" die Anzahl der Versuche ein, die bei Fehlern zum Herstellen einer Verbindung unternommen werden.</p>
<p>Setzen Sie den Wert auf 0, wenn keine Versuche zur erneuten Herstellung der Verbindung unternommen werden sollen. Der Standardwert ist 0.</p>
</li>
<li>
<p>Geben Sie in das Feld "Wiederholungsintervall" das Intervall in Sekunden zwischen zwei Verbindungsversuchen ein.</p>
<p>Der Standardwert ist 10. Dieses Attribut wird nur verwendet, wenn der Wert von "Erstellungswiederholungsversuche" gr&ouml;&szlig;er als 0 ist.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Verz&ouml;gerte Verkn&uuml;pfung", um eine physische Verbindung nur dann mit einer logischen Verbindung zu verkn&uuml;pfen, wenn die Verbindung verwendet wird.</p>
<p>Die Verkn&uuml;pfung wird wieder aufgehoben, wenn die Transaktion abgeschlossen ist und eine Komponentenmethode beendet wird. Auf diese Weise wird die Wiederverwendung der physischen Verbindungen gef&ouml;rdert. Bei deaktivierter Option wird eine physische Verbindung auch vor ihrer Verwendung mit einer logischen Verbindung verkn&uuml;pft. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Eintragung verz&ouml;gerter Verbindungen aktiviert", um eine Ressource f&uuml;r die Transaktion nur dann einzutragen, wenn sie tats&auml;chlich in einer Methode verwendet wird.</p>
<p>Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Mit Thread verkn&uuml;pfen", um Verkn&uuml;pfungen zwischen Verbindungen und Threads zu erstellen.</p>
<p>Wenn derselbe Thread eine weitere Verbindung ben&ouml;tigt, kann er die bereits mit diesem Thread verkn&uuml;pfte Verbindung wiederverwenden, wodurch die zus&auml;tzliche Belastung durch das Abrufen einer weiteren Verbindung aus dem Pool vermieden wird. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Verbindungen abgleichen", um den Verbindungsabgleich f&uuml;r den Pool zu aktivieren.</p>
<p>Bei aktivierter Option muss eine aus dem Pool ausgew&auml;hlte Verbindung mit den Verbindungen abgeglichen werden, die bestimmte Zugangsdaten aufweisen. Diese Option muss aktiviert werden, wenn der Connection-Pool von Anwendungen verwendet wird, die &uuml;ber mehrere Benutzerzugangsdaten verf&uuml;gen. Diese Option kann deaktiviert werden, wenn der Administrator wei&szlig;, dass die Verbindungen im Pool immer homogen sind und eine aus dem Pool abgerufene Verbindung nicht mit dem Ressourcenadapter abgeglichen werden muss. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Geben Sie in das Feld "Maximale Verbindungsnutzung" einen Wert daf&uuml;r ein, wie oft eine Verbindung durch den Pool wiederverwendet werden soll.</p>
<p>Nachdem eine Verbindung so h&auml;ufig wie angegeben wiederverwendet wurde, wird sie geschlossen. Indem Sie die Anzahl der Wiederverwendungen einer Verbindung beschr&auml;nken, k&ouml;nnen Sie Anweisungslecks vermeiden, falls eine Anwendung Anweisungen nicht schlie&szlig;t. Setzen Sie den Wert auf 0, um dieses Attribut zu deaktivieren. Der Standardwert ist 0.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Verbindungs&uuml;berpr&uuml;fung erforderlich", um die Verbindungs&uuml;berpr&uuml;fung zu aktivieren.</p>
<p>Die Verbindungsvalidierung erm&ouml;glicht dem Server bei Ausfall einen erneuten Verbindungsaufbau.</p>
</li>
<li>
<p>W&auml;hlen Sie aus der Dropdown-Liste "Validierungsmethode" eine Validierungsmethode.</p>
<p>GlassFish Server kann Datenbankverbindungen auf folgende Weise validieren.</p>
<dl>
<dt><code>auto-commit</code> und <code>metadata</code></dt>
<dd>
<p>GlassFish Server validiert eine Verbindung durch Aufruf der Methoden <code>con.getAutoCommit</code> und <code>con.getMetaData</code>.</p>

<hr>
<p><b>Hinweis:</b></p>
Viele JDBC-Treiber cachen die Ergebnisse dieser Aufrufe. Folglich f&uuml;hren diese Aufrufe nicht immer zu verl&auml;sslichen Validierungen. Informieren Sie sich beim Treiberhersteller, ob diese Aufrufe gecacht werden oder nicht.
<hr>

</dd>
<dt><code>custom-validation</code></dt>
<dd>
<p>GlassFish Server verwendet einen benutzerdefinierten Validierungsmechanismus, der durch die benutzerdefinierte Implementierungsklasse im Feld "Validierungsklassenname" angegeben wird.</p>
</dd>
<dt><code>table</code></dt>
<dd>
<p>Die Anwendung fragt die angegebene Datenbanktabelle ab. Die Tabelle muss vorhanden und zug&auml;nglich sein, sie muss aber keine Zeilen enthalten. Sie sollten keine bereits vorhandene Tabelle mit einer gro&szlig;en Anzahl Zeilen oder eine Tabelle verwenden, auf die h&auml;ufig zugegriffen wird.</p>
</dd>
</dl>
</li>
<li>
<p>Wenn Sie in der Dropdown-Liste "Validierungsmethode" den Eintrag <code>table</code> ausgew&auml;hlt haben, geben Sie den Namen der Datenbanktabelle ein oder w&auml;hlen ihn aus der Dropdown-Liste "Tabellenname".</p>
</li>
<li>
<p>Wenn Sie in der Dropdown-Liste "Validierungsmethode" den Eintrag <code>custom-validation</code> ausgew&auml;hlt haben, geben Sie den Namen der benutzerdefinierten Validierungsimplementierungsklasse ein oder w&auml;hlen ihn aus der Dropdown-Liste "Validierungsklassenname".</p>
<p>Der angegebene Klassenname muss f&uuml;r GlassFish Server zug&auml;nglich sein. Die angegebene Klasse muss die <code>org.glassfish.api.jdbc.ConnectionValidation</code>-Schnittstelle implementieren.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Bei Fehlern s&auml;mtliche Verbindungen trennen", sodass der Server beim Ausfall einer einzelnen Verbindung alle Verbindungen im Pool schlie&szlig;t und wiederherstellt.</p>
<p>Bei deaktivierter Option werden einzelne Verbindungen nur bei Verwendung wiederhergestellt. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Nicht-Komponenten-Aufrufer zulassen", damit der Pool durch Aufrufe von Nicht-Komponenten, wie z B. Servlet-Filter und Persistence Manager von Drittprovidern, verwendet werden kann.</p>
<p>Verbindungen, die durch Aufrufe von Nicht-Komponenten hergestellt werden, werden am Ende einer Transaktion nicht automatisch vom Container geschlossen. Sie m&uuml;ssen explizit vom aufrufenden Programm geschlossen werden. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Klicken Sie auf der Registerkarte "Allgemein" auf die Schaltfl&auml;che "Leeren", um alle Verbindungen aus dem Pool zu l&ouml;schen.</p>
<p>Wenn Sie auf die Schaltfl&auml;che "Leeren" klicken, werden alle bestehenden Verbindungen gel&ouml;scht, f&uuml;r den Pool eingerichtete Verbindungen werden neu erstellt, und die anf&auml;ngliche, minimale Poolgr&ouml;&szlig;e wird wiederhergestellt.</p>
</li>
<li>
<p>Klicken Sie auf "Speichern".</p>

<hr>
<p><b>Tipp:</b></p>
Um zu den Standardeinstellungen zur&uuml;ckzukehren, klicken Sie auf die Schaltfl&auml;che "Standardwerte laden" und anschlie&szlig;end auf "Speichern".
<hr>

</li>
</ol>
<a id="sthref20" name="sthref20"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">So wird der Datenbankzugriff eingerichtet</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">So wird ein JDBC-Treiber integriert</a></p>
</li>
<li>
<p><a href="task-jdbcresourcenew.html">So wird eine JDBC-Ressource erstellt</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesedit.html">So wird eine JDBC-Ressource bearbeitet</a></p>
</li>
<li>
<p><a href="task-jdbcresourcetargets.html">So werden Ziele f&uuml;r JDBC-Ressourcen bearbeitet</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesdelete.html">So wird eine JDBC-Ressource gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">So wird einen JDBC-Connection-Pool erstellt</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">So werden allgemeine Einstellungen des JDBC-Connection-Pools bearbeitet</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">So werden Connection-Pooleinstellungen gepr&uuml;ft</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">So werden Eigenschaften des JDBC-Connection-Pool bearbeitet</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">So wird ein JDBC-Connection-Pool gel&ouml;scht</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
