<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-standaloneinstanceapplications" name="ref-standaloneinstanceapplications"></a><a id="GHCLU00021" name="GHCLU00021"></a></p>

<h4><a id="sthref334" name="sthref334"></a><a id="sthref335" name="sthref335"></a>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#49440;&#53469;&#54620; &#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54644; &#45796;&#51020; &#51089;&#50629;&#51012; &#49688;&#54665;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#51064;&#49828;&#53556;&#49828;&#50640; &#51060;&#48120; &#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#48372;&#44592; &#48143; &#44288;&#47532;</p>
</li>
<li>
<p>&#51064;&#49828;&#53556;&#49828;&#50640; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#52628;&#44032; &#48176;&#52824;</p>
</li>
</ul>
<p>[&#51064;&#49828;&#53556;&#49828; &#51060;&#47492;] &#54596;&#46300;&#45716; &#54788;&#51116; &#51064;&#49828;&#53556;&#49828;&#51032; &#51060;&#47492;&#51012; &#54364;&#49884;&#54616;&#45716; &#51069;&#44592; &#51204;&#50857; &#54596;&#46300;&#51077;&#45768;&#45796;.</p>
<p>[&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;] &#54168;&#51060;&#51648;&#50640;&#45716; &#49440;&#53469;&#54620; &#51064;&#49828;&#53556;&#49828;&#50640; &#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51032; &#47785;&#47197;&#51060; &#54364;&#49884;&#46121;&#45768;&#45796;. &#44033; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#45824;&#54644; &#51228;&#44277;&#46104;&#45716; &#51221;&#48372;&#45716; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#51060;&#47492;</dt>
<dd>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
<p>&#51060;&#47492;&#50640;&#45716; &#48260;&#51204; &#49885;&#48324;&#51088;(&#50741;&#49496;)&#44032; &#54252;&#54632;&#46112; &#49688; &#51080;&#51004;&#47728;, &#51060; &#49885;&#48324;&#51088;&#45716; &#51060;&#47492; &#45796;&#51020;&#50640; &#50724;&#44256; &#53084;&#47200;(<code>:</code>)&#51004;&#47196; &#51060;&#47492;&#44284; &#44396;&#48516;&#46121;&#45768;&#45796;. &#47784;&#46280; &#48143; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#48260;&#51204;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Oracle GlassFish Server Application Deployment Guide</i>&#51032; <i>Module and Application Versions</i></a>&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</dd>
<dt>&#49324;&#50857;</dt>
<dd>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50632;&#45716;&#51648; &#50668;&#48512;&#47484; &#45208;&#53440;&#45253;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#49440;&#53469; &#54364;&#49884; &#44592;&#54840;(&#10003;)&#44032; &#45208;&#53440;&#45225;&#45768;&#45796;.</p>
</li>
<li>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#49901;&#51088; &#44592;&#54840;(&#10007;)&#44032; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>
</li>
</ul>
</dd>
<dt>LB &#49324;&#50857;</dt>
<dd>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#47196;&#46300; &#44512;&#54805; &#51312;&#51221;&#50640; &#45824;&#54644; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50632;&#45716;&#51648; &#50668;&#48512;&#47484; &#45208;&#53440;&#45253;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#47196;&#46300; &#44512;&#54805; &#51312;&#51221;&#50640; &#45824;&#54644; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#49440;&#53469; &#54364;&#49884; &#44592;&#54840;(&#10003;)&#44032; &#45208;&#53440;&#45225;&#45768;&#45796;.</p>
</li>
<li>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#47196;&#46300; &#44512;&#54805; &#51312;&#51221;&#50640; &#45824;&#54644; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#49901;&#51088; &#44592;&#54840;(&#10007;)&#44032; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>
</li>
</ul>
</dd>
<dt>&#50644;&#51652;</dt>
<dd>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640;&#49436; &#49324;&#50857;&#54616;&#45716; &#52968;&#53580;&#51060;&#45320; &#50976;&#54805;&#51077;&#45768;&#45796;. &#52968;&#53580;&#51060;&#45320; &#50976;&#54805;&#51008; &#45796;&#51020;&#44284; &#44057;&#51008; &#50976;&#54805;&#51068; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<ul>
<li>
<p><code>web</code></p>
</li>
<li>
<p><code>webservices</code></p>
</li>
<li>
<p><code>ejb</code></p>
</li>
<li>
<p><code>connector</code></p>
</li>
<li>
<p><code>appclient</code></p>
</li>
<li>
<p><code>weld</code> &mdash; Java EE &#54540;&#47019;&#54268; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#45824;&#54620; Contexts and Dependency Injection &#52968;&#53580;&#51060;&#45320;</p>
</li>
</ul>
</dd>
</dl>
<p>&#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#53580;&#51060;&#48660;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#46020; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#48176;&#52824;</dt>
<dd>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#48176;&#52824;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#48176;&#52824; &#54644;&#51228;</dt>
<dd>
<p>&#49440;&#53469;&#54620; &#54616;&#45208; &#51060;&#49345;&#51032; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#48176;&#52824; &#54644;&#51228;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;.</p>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#48176;&#52824; &#54644;&#51228;&#54616;&#47732; &#47784;&#46304; &#45824;&#49345;&#44284; &#46020;&#47700;&#51064;&#50640;&#49436; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#51228;&#44144;&#46121;&#45768;&#45796;. &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#48176;&#52824; &#54644;&#51228;&#46104;&#47732; &#54644;&#45817; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51008; GlassFish Server&#50640; &#48176;&#52824;&#46104;&#45716; &#47784;&#46304; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#54364;&#49884;&#54616;&#45716; <a href="../../../common/en/help/ref-applications.html">&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;</a> &#54168;&#51060;&#51648;&#50640; &#45908; &#51060;&#49345; &#54364;&#49884;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
<p>&#54788;&#51116; &#45824;&#49345;&#50640;&#49436;&#47564; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#51228;&#44144;&#54616;&#47140;&#47732; &#51060; &#54168;&#51060;&#51648;&#50640; &#51080;&#45716; [&#51228;&#44144;] &#45800;&#52628;&#47484; &#49324;&#50857;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#51228;&#44144;</dt>
<dd>
<p>&#49440;&#53469;&#54620; &#54616;&#45208; &#51060;&#49345;&#51032; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#51228;&#44144;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;.</p>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#51228;&#44144;&#54616;&#47732; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#54788;&#51116; &#45824;&#49345;&#50640;&#49436;&#47564; &#51228;&#44144;&#46121;&#45768;&#45796;. &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#45824;&#49345;&#50640;&#49436; &#51228;&#44144;&#46104;&#47732; &#54644;&#45817; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51008; GlassFish Server&#50640; &#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#47784;&#46160; &#54364;&#49884;&#54616;&#45716; <a href="../../../common/en/help/ref-applications.html">&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;</a> &#54168;&#51060;&#51648;&#50640; &#44228;&#49549; &#54364;&#49884;&#46121;&#45768;&#45796;. &#46608;&#54620; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#48176;&#52824;&#46108; &#45796;&#47480; &#45824;&#49345;&#50640;&#45716; &#48176;&#52824;&#46108; &#49345;&#53468;&#47196; &#45224;&#50500; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#47784;&#46304; &#45824;&#49345; &#48143; &#46020;&#47700;&#51064;&#50640;&#49436; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#51228;&#44144;&#54616;&#47140;&#47732; &#51060; &#54168;&#51060;&#51648;&#50640; &#51080;&#45716; [&#48176;&#52824; &#54644;&#51228;] &#45800;&#52628;&#47484; &#49324;&#50857;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#52628;&#44032; &#51089;&#50629;</dt>
<dd>
<p>&#49440;&#53469;&#54620; &#54616;&#45208; &#51060;&#49345;&#51032; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#45824;&#54644; &#52628;&#44032; &#51089;&#50629;&#51012; &#49688;&#54665;&#54616;&#45716; &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#51077;&#45768;&#45796;.</p>
<dl>
<dt>&#49324;&#50857;</dt>
<dd>
<p>&#49440;&#53469;&#54620; &#54616;&#45208; &#51060;&#49345;&#51032; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#49324;&#50857; &#50504;&#54632;</dt>
<dd>
<p>&#49440;&#53469;&#54620; &#54616;&#45208; &#51060;&#49345;&#51032; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#47196;&#46300; &#48184;&#47088;&#49436; &#49324;&#50857;</dt>
<dd>
<p>&#49440;&#53469;&#54620; &#54616;&#45208; &#51060;&#49345;&#51032; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#47196;&#46300; &#44512;&#54805; &#51312;&#51221;&#50640; &#45824;&#54644; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#47196;&#46300; &#48184;&#47088;&#49436; &#49324;&#50857; &#50504;&#54632;</dt>
<dd>
<p>&#49440;&#53469;&#54620; &#54616;&#45208; &#51060;&#49345;&#51032; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#47196;&#46300; &#44512;&#54805; &#51312;&#51221;&#50640; &#45824;&#54644; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref336" name="sthref336"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-standalone-instance-app-deploy.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#48176;&#52824;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-list.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640; &#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#45208;&#50676;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-undeploy.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640;&#49436; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#48176;&#52824;&#47484; &#54644;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-remove.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640;&#49436; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#51228;&#44144;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-edit.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640; &#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-enable-disable.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640; &#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#49324;&#50857; &#46608;&#45716; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-lb-enable-disable.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640; &#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#45824;&#54620; &#47196;&#46300; &#44512;&#54805; &#51312;&#51221;&#51012; &#49324;&#50857; &#46608;&#45716; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref337" name="sthref337"></a>
<h5>&#46041;&#51068;&#54620; asadmin &#54616;&#50948; &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00114"><code>deploy</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00116"><code>disable</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00118"><code>disable-http-lb-application</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00124"><code>enable</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00126"><code>enable-http-lb-application</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00148"><code>list-applications</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
