<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-standaloneinstancenew" name="ref-standaloneinstancenew"></a><a id="GHCLU00019" name="GHCLU00019"></a></p>

<h4><a id="sthref324" name="sthref324"></a><a id="sthref325" name="sthref325"></a><a id="sthref326" name="sthref326"></a>&#49352; &#46021;&#47549;&#54805; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#49352; &#46021;&#47549;&#54805; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#47484; &#49373;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>[&#49352; &#46021;&#47549;&#54805; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#51064;&#49828;&#53556;&#49828; &#51060;&#47492;</dt>
<dd>
<p>&#49373;&#49457;&#54624; &#51064;&#49828;&#53556;&#49828;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
<p>&#51060;&#47492;&#51008; &#45796;&#51020; &#50836;&#44396; &#49324;&#54637;&#51012; &#52649;&#51313;&#54644;&#50556; &#54633;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#51060;&#47492;&#50640;&#45716; ASCII &#47928;&#51088;&#47564; &#54252;&#54632;&#46112; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>&#51060;&#47492;&#51008; &#47928;&#51088;, &#49707;&#51088; &#46608;&#45716; &#48145;&#51460;&#47196; &#49884;&#51089;&#54644;&#50556; &#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#51060;&#47492;&#50640;&#45716; &#45796;&#51020; &#47928;&#51088;&#47564; &#54252;&#54632;&#46112; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#49548;&#47928;&#51088;</p>
</li>
<li>
<p>&#45824;&#47928;&#51088;</p>
</li>
<li>
<p>&#49707;&#51088;</p>
</li>
<li>
<p>&#54616;&#51060;&#54536;</p>
</li>
<li>
<p>&#47560;&#52840;&#54364;</p>
</li>
<li>
<p>&#48145;&#51460;</p>
</li>
</ul>
</li>
<li>
<p>&#51060;&#47492;&#51008; &#46020;&#47700;&#51064;&#50640;&#49436; &#44256;&#50976;&#54644;&#50556; &#54616;&#47728; &#45796;&#47480; GlassFish Server &#51064;&#49828;&#53556;&#49828;, &#53364;&#47084;&#49828;&#53552;, &#47749;&#47749;&#46108; &#44396;&#49457; &#46608;&#45716; &#45432;&#46300;&#51032; &#51060;&#47492;&#51060;&#50612;&#49436;&#45716; &#50504;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>&#51060;&#47492;&#51008; <code>domain</code>, <code>server</code> &#46608;&#45716; GlassFish Server&#50640;&#49436; &#50696;&#50557;&#46108; &#45796;&#47480; &#53412;&#50892;&#46300;&#50668;&#49436;&#45716; &#50504;&#46121;&#45768;&#45796;.</p>
</li>
</ul>
</dd>
<dt>&#45432;&#46300;</dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#44032; &#51080;&#51012; &#49688; &#51080;&#45716; &#54840;&#49828;&#53944;&#47484; &#51221;&#51032;&#54616;&#45716; &#44592;&#51316; &#45432;&#46300;&#51032; &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#51077;&#45768;&#45796;. &#47785;&#47197;&#50640;&#49436; &#54616;&#45208;&#51032; &#45432;&#46300;&#47484; &#49440;&#53469;&#54644;&#50556; &#54633;&#45768;&#45796;. DAS(&#46020;&#47700;&#51064; &#44288;&#47532; &#49436;&#48260;)&#44032; &#49892;&#54665; &#51473;&#51064; &#54840;&#49828;&#53944;&#50640; &#51064;&#49828;&#53556;&#49828;&#47484; &#49373;&#49457;&#54624; &#44221;&#50864; &#48120;&#47532; &#51221;&#51032;&#46108; &#45432;&#46300; <code>localhost-</code><i>domain</i>&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#44396;&#49457;</dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#50640;&#49436; &#49324;&#50857;&#54624; &#49688; &#51080;&#45716; &#44592;&#51316;&#50640; &#47749;&#47749;&#46108; &#44396;&#49457;&#51032; &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#51077;&#45768;&#45796;. &#47785;&#47197;&#50640;&#49436; &#54616;&#45208;&#51032; &#44396;&#49457;&#51012; &#49440;&#53469;&#54644;&#50556; &#54633;&#45768;&#45796;. &#51064;&#49828;&#53556;&#49828;&#45716; &#51064;&#49828;&#53556;&#49828;&#47484; &#49373;&#49457;&#54624; &#46412; &#49440;&#53469;&#54620; &#44396;&#49457;&#51012; &#49324;&#50857;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#49440;&#53469;&#54620; &#44396;&#49457;&#51032; &#48373;&#49324;&#48376; &#47564;&#46308;&#44592;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54620; &#44221;&#50864; &#51064;&#49828;&#53556;&#49828;&#47484; &#49373;&#49457;&#54624; &#46412; &#49440;&#53469;&#54620; &#44396;&#49457;&#51060; &#48373;&#49324;&#46121;&#45768;&#45796;. &#44396;&#49457; &#48373;&#49324;&#48376;&#50640;&#45716; <i>instance-name</i><code>-config</code>&#46972;&#45716; &#51060;&#47492;&#51060; &#51648;&#51221;&#46121;&#45768;&#45796;. &#50668;&#44592;&#49436; <i>instance-name</i>&#51008; [&#51064;&#49828;&#53556;&#49828; &#51060;&#47492;] &#54596;&#46300;&#50640; &#51077;&#47141;&#54620; &#51064;&#49828;&#53556;&#49828;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
<p>&#44396;&#49457; &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; <code>default-config</code>&#47484; &#49440;&#53469;&#54620; &#44221;&#50864; &#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54644;&#50556; &#54633;&#45768;&#45796;. <code>default-config</code> &#44396;&#49457;&#51008; &#48373;&#49324;&#47564; &#54624; &#49688; &#51080;&#44256; &#52280;&#51312;&#54624; &#49688;&#45716; &#50630;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#49440;&#53469;&#54620; &#44396;&#49457; &#52280;&#51312;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54620; &#44221;&#50864; &#51064;&#49828;&#53556;&#49828;&#44032; &#51648;&#51221;&#46108; &#44592;&#51316; &#47749;&#47749;&#46108; &#44396;&#49457;&#51012; &#49324;&#50857;&#54633;&#45768;&#45796;.</p>
<p>&#44396;&#49457; &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; <code>default-config</code>&#47484; &#49440;&#53469;&#54620; &#44221;&#50864; &#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; <i>&#50504;&#46121;&#45768;&#45796;</i>. <code>default-config</code> &#44396;&#49457;&#51008; &#52280;&#51312;&#54624; &#49688;&#45716; &#50630;&#44256; &#48373;&#49324;&#47564; &#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref327" name="sthref327"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<p><a href="task-create-standalone-instance.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
<a id="sthref328" name="sthref328"></a>
<h5>&#46041;&#51068;&#54620; asadmin &#54616;&#50948; &#47749;&#47161;</h5>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00033"><code>create-instance</code>(1)</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
