<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-standaloneinstancegeneral" name="ref-standaloneinstancegeneral"></a></p>

<h4><a id="sthref329" name="sthref329"></a><a id="sthref330" name="sthref330"></a><a id="sthref331" name="sthref331"></a>&#51068;&#48152; &#51221;&#48372;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#51068;&#48152; &#51221;&#48372;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#49884;&#51089;</dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#47484; &#49884;&#51089;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#51064;&#49828;&#53556;&#49828;&#44032; &#49892;&#54665; &#51473;&#51064; &#44221;&#50864; &#51060; &#45800;&#52628;&#44032; &#48708;&#54876;&#49457;&#54868;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#51221;&#51648;</dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#47484; &#51221;&#51648;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#51064;&#49828;&#53556;&#49828;&#44032; &#51221;&#51648;&#46108; &#44221;&#50864; &#51060; &#45800;&#52628;&#44032; &#48708;&#54876;&#49457;&#54868;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#51116;&#49884;&#51089;</dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#47484; &#51116;&#49884;&#51089;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#51064;&#49828;&#53556;&#49828;&#44032; &#51221;&#51648;&#46108; &#44221;&#50864; &#51060; &#45800;&#52628;&#44032; &#48708;&#54876;&#49457;&#54868;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#47196;&#44536; &#54028;&#51068; &#48372;&#44592;</dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54620; &#47196;&#44536; &#54028;&#51068;&#51012; &#48372;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#47196;&#44536; &#44368;&#52404;</dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54620; &#47196;&#44536; &#54028;&#51068;&#51012; &#44368;&#52404;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#47196;&#44536; &#54028;&#51068;&#51060; &#44368;&#52404;&#46104;&#47732; &#54028;&#51068;&#51060; <code>server.log_</code><i>date-and-time</i> &#54805;&#49885;&#51032; &#49884;&#44036; &#44592;&#47197; &#51060;&#47492;&#51060; &#54252;&#54632;&#46108; &#51060;&#47492;&#51004;&#47196; &#48148;&#45068;&#44256; &#49352; &#47196;&#44536; &#47700;&#49884;&#51648;&#50640; &#45824;&#54620; &#48712; &#47196;&#44536; &#54028;&#51068;&#51060; &#49373;&#49457;&#46121;&#45768;&#45796;. &#48320;&#44221; &#49324;&#54637;&#51060; &#46041;&#51201;&#51004;&#47196; &#51201;&#50857;&#46121;&#45768;&#45796;. &#49436;&#48260;&#47484; &#51116;&#49884;&#51089;&#54624; &#54596;&#50836;&#45716; &#50630;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#53944;&#47004;&#51117;&#49496; &#48373;&#44396;</dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54620; &#53944;&#47004;&#51117;&#49496;&#51012; &#48373;&#44396;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51060;&#47492;</dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#44032; &#49373;&#49457;&#46112; &#46412; &#51064;&#49828;&#53556;&#49828;&#50640; &#51648;&#51221;&#46108; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>JVM</dt>
<dd>
<p>JVM &#48372;&#44256;&#49436;&#47484; &#45572;&#47476;&#47732; &#48324;&#46020;&#51032; &#52285;&#51060; &#50676;&#47532;&#44256; &#50836;&#50557; &#48372;&#44256;&#49436;, &#47700;&#47784;&#47532; &#44288;&#47532; &#48143; &#48520;&#54596;&#50836;&#54620; &#51221;&#48372; &#49688;&#51665; &#48372;&#44256;&#49436;, &#53364;&#47000;&#49828; &#47196;&#46377; &#48372;&#44256;&#49436; &#48143; &#54788;&#51116; &#49828;&#47112;&#46300; &#45924;&#54532;&#47484; &#54252;&#54632;&#54620; Java Virtual Machine&#50640; &#45824;&#54620; &#48372;&#44256;&#49436;&#44032; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#49345;&#53468;</dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#44032; &#49892;&#54665; &#51473;&#51064;&#51648; &#46608;&#45716; &#49892;&#54665; &#51473;&#51060;&#51648; &#50506;&#51008;&#51648; &#50668;&#48512;&#47484; &#45208;&#53440;&#45253;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#45432;&#46300;</dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#44032; &#51080;&#45716; &#45432;&#46300;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060;&#47492;&#51012; &#45572;&#47476;&#47732; &#54644;&#45817; &#45432;&#46300;&#50640; &#45824;&#54620; <a href="ref-nodeedit.html">&#45432;&#46300; &#54200;&#51665;</a> &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</dd>
<dt>&#44396;&#49457;</dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#44032; &#52280;&#51312;&#54616;&#45716; &#44396;&#49457;&#51077;&#45768;&#45796;. &#44396;&#49457;&#51012; &#45572;&#47476;&#47732; &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54620; <a href="../../../common/en/help/ref-configuration.html">&#44396;&#49457;</a> &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</dd>
<dt>&#46356;&#48260;&#44536;</dt>
<dd>
<p>JPDA(Java Platform Debugger Architecture)(<code><a href="http://java.sun.com/javase/technologies/core/toolsapis/jpda/">http://java.sun.com/javase/technologies/core/toolsapis/jpda/</a></code>) &#46356;&#48260;&#44613;&#51012; &#51064;&#49828;&#53556;&#49828;&#50640; &#49324;&#50857;&#54624; &#49688; &#51080;&#45716;&#51648; &#50668;&#48512;&#47484; &#45208;&#53440;&#45253;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
<p>&#51064;&#49828;&#53556;&#49828;&#47484; &#44288;&#47532; &#53080;&#49556;&#50640;&#49436; &#49884;&#51089;&#54620; &#44221;&#50864; &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54644; JPDA &#46356;&#48260;&#44613;&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;. JPDA &#46356;&#48260;&#44613;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54620; &#49345;&#53468;&#50640;&#49436; &#51064;&#49828;&#53556;&#49828;&#47484; &#49884;&#51089;&#54616;&#47140;&#47732; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00236"><code>start-instance</code>(1)</a> &#54616;&#50948; &#47749;&#47161;&#51012; &#49324;&#50857;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>HTTP &#54252;&#53944;</dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#44032; &#45796;&#51020; &#50836;&#52397; &#50976;&#54805;&#51012; &#49688;&#49888;&#54616;&#45716; &#54252;&#53944;&#51032; &#53092;&#47560;&#47196; &#44396;&#48516;&#46108; &#54252;&#53944; &#48264;&#54840; &#47785;&#47197;&#51077;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#44288;&#47532; &#50836;&#52397;</p>
</li>
<li>
<p>HTTP &#50836;&#52397;</p>
</li>
<li>
<p>HTTPS &#50836;&#52397;</p>
</li>
</ul>
<p>&#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>IIOP &#54252;&#53944;</dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#44032; &#45796;&#51020; &#51217;&#49549; &#50976;&#54805;&#51012; &#49324;&#50857;&#54616;&#45716; &#54252;&#53944;&#51032; &#53092;&#47560;&#47196; &#44396;&#48516;&#46108; &#54252;&#53944; &#48264;&#54840; &#47785;&#47197;&#51077;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#48372;&#50504; IIOP &#51217;&#49549;</p>
</li>
<li>
<p>&#48372;&#50504; IIOP &#51217;&#49549;(&#53364;&#46972;&#51060;&#50616;&#53944; &#51064;&#51613; &#54252;&#54632;)</p>
</li>
<li>
<p>IIOP &#51217;&#49549;</p>
</li>
</ul>
<p>&#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref332" name="sthref332"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-start-standalone-instances.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#47484; &#49884;&#51089;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-stop-standalone-instances.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#47484; &#51221;&#51648;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-view-logs-standalone-instance.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54620; &#47196;&#44536; &#54028;&#51068;&#51012; &#48372;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-recovertransactions-standalone-instance.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54620; &#53944;&#47004;&#51117;&#49496;&#51012; &#48373;&#44396;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref333" name="sthref333"></a>
<h5>&#46041;&#51068;&#54620; asadmin &#54616;&#50948; &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00138"><code>generate-jvm-report</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00236"><code>start-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00241"><code>stop-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00224"><code>rotate-log</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
