<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusternew" name="ref-clusternew"></a></p>

<h4><a id="sthref247" name="sthref247"></a><a id="sthref248" name="sthref248"></a>&#49352; &#53364;&#47084;&#49828;&#53552;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#49352; &#53364;&#47084;&#49828;&#53552;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#53364;&#47084;&#49828;&#53552;&#47484; &#49373;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>[&#49352; &#53364;&#47084;&#49828;&#53552;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#53364;&#47084;&#49828;&#53552; &#51060;&#47492;</dt>
<dd>
<p>&#53364;&#47084;&#49828;&#53552;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
<p>&#51060;&#47492;&#51008; &#45796;&#51020; &#50836;&#44396; &#49324;&#54637;&#51012; &#52649;&#51313;&#54644;&#50556; &#54633;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#51060;&#47492;&#50640;&#45716; ASCII &#47928;&#51088;&#47564; &#54252;&#54632;&#46112; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>&#51060;&#47492;&#51008; &#47928;&#51088;, &#49707;&#51088; &#46608;&#45716; &#48145;&#51460;&#47196; &#49884;&#51089;&#54644;&#50556; &#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#51060;&#47492;&#50640;&#45716; &#45796;&#51020; &#47928;&#51088;&#47564; &#54252;&#54632;&#46112; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#49548;&#47928;&#51088;</p>
</li>
<li>
<p>&#45824;&#47928;&#51088;</p>
</li>
<li>
<p>&#49707;&#51088;</p>
</li>
<li>
<p>&#54616;&#51060;&#54536;</p>
</li>
<li>
<p>&#47560;&#52840;&#54364;</p>
</li>
<li>
<p>&#48145;&#51460;</p>
</li>
</ul>
</li>
<li>
<p>&#51060;&#47492;&#51008; &#46020;&#47700;&#51064;&#50640;&#49436; &#44256;&#50976;&#54644;&#50556; &#54616;&#47728; &#45796;&#47480; &#53364;&#47084;&#49828;&#53552;, &#47749;&#47749;&#46108; &#44396;&#49457;, GlassFish Server &#51064;&#49828;&#53556;&#49828; &#46608;&#45716; &#45432;&#46300;&#51032; &#51060;&#47492;&#51060;&#50612;&#49436;&#45716; &#50504;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>&#51060;&#47492;&#51008; <code>domain</code>, <code>server</code> &#46608;&#45716; GlassFish Server&#50640;&#49436; &#50696;&#50557;&#46108; &#45796;&#47480; &#53412;&#50892;&#46300;&#50668;&#49436;&#45716; &#50504;&#46121;&#45768;&#45796;.</p>
</li>
</ul>
</dd>
<dt>&#44396;&#49457;</dt>
<dd>
<p>&#53364;&#47084;&#49828;&#53552;&#50640;&#49436; &#49324;&#50857;&#54624; &#49688; &#51080;&#45716; &#44592;&#51316;&#50640; &#47749;&#47749;&#46108; &#44396;&#49457;&#51032; &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#51077;&#45768;&#45796;. &#53364;&#47084;&#49828;&#53552;&#50640;&#45716; &#53364;&#47084;&#49828;&#53552;&#50640; &#52628;&#44032;&#46108; &#47784;&#46304; &#51064;&#49828;&#53556;&#49828;&#51032; &#44396;&#49457;&#51012; &#51221;&#51032;&#54616;&#45716; &#47749;&#47749;&#46108; &#44396;&#49457;&#51060; &#54596;&#50836;&#54633;&#45768;&#45796;. &#47785;&#47197;&#50640;&#49436; &#54616;&#45208;&#51032; &#44396;&#49457;&#51012; &#49440;&#53469;&#54644;&#50556; &#54633;&#45768;&#45796;. &#53364;&#47084;&#49828;&#53552;&#45716; &#53364;&#47084;&#49828;&#53552;&#47484; &#49373;&#49457;&#54624; &#46412; &#49440;&#53469;&#54620; &#44396;&#49457;&#51012; &#49324;&#50857;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#49440;&#53469;&#54620; &#44396;&#49457;&#51032; &#48373;&#49324;&#48376; &#47564;&#46308;&#44592;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54620; &#44221;&#50864; &#53364;&#47084;&#49828;&#53552;&#47484; &#49373;&#49457;&#54624; &#46412; &#49440;&#53469;&#54620; &#44396;&#49457;&#51060; &#48373;&#49324;&#46121;&#45768;&#45796;. &#44396;&#49457; &#48373;&#49324;&#48376;&#50640;&#45716; cluster-name<code>-config</code>&#46972;&#45716; &#51060;&#47492;&#51060; &#51648;&#51221;&#46121;&#45768;&#45796;. &#50668;&#44592;&#49436; <i>cluster-name</i>&#51008; [&#53364;&#47084;&#49828;&#53552; &#51060;&#47492;] &#54596;&#46300;&#50640; &#51077;&#47141;&#54620; &#53364;&#47084;&#49828;&#53552;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
<p>&#44396;&#49457; &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; <code>default-config</code>&#47484; &#49440;&#53469;&#54620; &#44221;&#50864; &#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54644;&#50556; &#54633;&#45768;&#45796;. <code>default-config</code> &#44396;&#49457;&#51008; &#48373;&#49324;&#47564; &#54624; &#49688; &#51080;&#44256; &#52280;&#51312;&#54624; &#49688;&#45716; &#50630;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#49440;&#53469;&#54620; &#44396;&#49457; &#52280;&#51312;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54620; &#44221;&#50864; &#53364;&#47084;&#49828;&#53552;&#44032; &#51648;&#51221;&#46108; &#44592;&#51316; &#47749;&#47749;&#46108; &#44396;&#49457;&#51012; &#49324;&#50857;&#54633;&#45768;&#45796;.</p>
<p>&#44396;&#49457; &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; <code>default-config</code>&#47484; &#49440;&#53469;&#54620; &#44221;&#50864; &#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; <i>&#50504;&#46121;&#45768;&#45796;</i>. <code>default-config</code> &#44396;&#49457;&#51008; &#52280;&#51312;&#54624; &#49688;&#45716; &#50630;&#44256; &#48373;&#49324;&#47564; &#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#47700;&#49884;&#51648; &#45824;&#44592;&#50676; &#53364;&#47084;&#49828;&#53552; &#44396;&#49457; &#50976;&#54805;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49324;&#50857;&#54616;&#50668; &#49352; GlassFish Server &#53364;&#47084;&#49828;&#53552;&#50640; &#49324;&#50857;&#54624; Message Queue &#51473;&#44060;&#51088; &#53364;&#47084;&#49828;&#53552;&#51032; &#50976;&#54805;&#51012; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; GlassFish Server&#50640;&#49436;&#45716; &#44592;&#48376; Message Queue &#51473;&#44060;&#51088; &#53364;&#47084;&#49828;&#53552;&#47484; GlassFish Server &#53364;&#47084;&#49828;&#53552;&#51032; &#44033; &#51064;&#49828;&#53556;&#49828;&#50640; &#54252;&#54632;&#46108; &#51473;&#44060;&#51088;&#51064; &#47560;&#49828;&#53552; &#51473;&#44060;&#51088;&#50752; &#54632;&#44760; &#49324;&#50857;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51012; [&#49324;&#50857;&#51088; &#51221;&#51032;]&#47196; &#49444;&#51221;&#54624; &#44221;&#50864; GlassFish Server &#53364;&#47084;&#49828;&#53552;&#50640; &#49324;&#50857;&#54624; Message Queue &#51473;&#44060;&#51088; &#53364;&#47084;&#49828;&#53552;&#47484; &#44396;&#49457;&#54624; &#49688; &#51080;&#45716; &#47751; &#44060;&#51032; &#52628;&#44032; &#50741;&#49496;&#51060; &#54364;&#49884;&#46121;&#45768;&#45796;. <a href="#CHDJFEJB">&#49324;&#50857;&#51088; &#51221;&#51032; Message Queue &#51473;&#44060;&#51088; &#53364;&#47084;&#49828;&#53552;&#50640; &#45824;&#54620; &#50741;&#49496;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</dd>
<dt>&#49373;&#49457;&#54624; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;</dt>
<dd>
<p>&#53364;&#47084;&#49828;&#53552;&#47484; &#49373;&#49457;&#54624; &#46412; &#49373;&#49457;&#54624; GlassFish Server &#51064;&#49828;&#53556;&#49828; &#47785;&#47197;&#51077;&#45768;&#45796;. &#44033; &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54644; &#51228;&#44277;&#46104;&#45716; &#51221;&#48372;&#45716; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#51064;&#49828;&#53556;&#49828; &#51060;&#47492;</dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#44032;&#51473;&#52824;</dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#51032; &#47196;&#46300; &#44512;&#54805; &#51312;&#51221; &#44032;&#51473;&#52824;&#47484; &#45208;&#53440;&#45236;&#45716; &#51221;&#49688;&#51077;&#45768;&#45796;.</p>
<p>&#47196;&#46300; &#44512;&#54805; &#51312;&#51221; &#44032;&#51473;&#52824;&#45716; &#51064;&#49828;&#53556;&#49828;&#44032; &#52376;&#47532;&#54644;&#50556; &#54616;&#45716; &#53364;&#47084;&#49828;&#53552;&#50640; &#45824;&#54620; &#47784;&#46304; &#50836;&#52397;&#51032; &#48708;&#50984;&#51012; &#44208;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#50696;&#47484; &#46308;&#50612; &#46160; &#44060;&#51032; &#51064;&#49828;&#53556;&#49828;&#47196; &#44396;&#49457;&#46108; &#53364;&#47084;&#49828;&#53552;&#50640;&#49436; &#54620; &#51064;&#49828;&#53556;&#49828;&#44032; &#45348; &#44060;&#51032; &#50836;&#52397; &#51473;&#50640;&#49436; &#54616;&#45208;&#47484; &#52376;&#47532;&#54616;&#44256; &#45796;&#47480; &#51064;&#49828;&#53556;&#49828;&#44032; &#45348; &#44060;&#51032; &#50836;&#52397; &#51473;&#50640;&#49436; &#49464; &#44060;&#47484; &#52376;&#47532;&#54644;&#50556; &#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#44221;&#50864; &#45348; &#44060;&#51032; &#50836;&#52397; &#51473;&#50640;&#49436; &#54616;&#45208;&#47484; &#52376;&#47532;&#54624; &#51064;&#49828;&#53556;&#49828;&#51032; &#44032;&#51473;&#52824;&#47484; 1&#47196; &#49444;&#51221;&#54616;&#44256; &#45796;&#47480; &#51064;&#49828;&#53556;&#49828;&#51032; &#44032;&#51473;&#52824;&#47484; 3&#51004;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;. &#48177;&#48516;&#50984;&#51012; &#49324;&#50857;&#54616;&#47140;&#45716; &#44221;&#50864; &#51064;&#49828;&#53556;&#49828;&#51032; &#44032;&#51473;&#52824;&#47484; &#44033;&#44033; 25&#50752; 75&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376; &#44032;&#51473;&#52824;&#45716; 100&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#45432;&#46300;</dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#44032; &#51080;&#51012; &#49688; &#51080;&#45716; &#44592;&#51316; &#45432;&#46300;&#51032; &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#51077;&#45768;&#45796;. &#47785;&#47197;&#50640;&#49436; &#54616;&#45208;&#51032; &#45432;&#46300;&#47484; &#49440;&#53469;&#54644;&#50556; &#54633;&#45768;&#45796;. &#53364;&#47084;&#49828;&#53552;&#47484; &#49373;&#49457;&#54624; &#46412; &#51064;&#49828;&#53556;&#49828;&#44032; &#49440;&#53469;&#54620; &#45432;&#46300;&#50640; &#51080;&#44172; &#46121;&#45768;&#45796;.</p>
</dd>
</dl>
<p>&#49373;&#49457;&#54624; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828; &#53580;&#51060;&#48660;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#46020; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#49352;&#47196; &#47564;&#46308;&#44592;</dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#47484; &#49373;&#49457;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#51060; &#45800;&#52628;&#47484; &#45572;&#47476;&#47732; [&#49373;&#49457;&#54624; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;] &#53580;&#51060;&#48660;&#50640; &#54665;&#51060; &#52628;&#44032;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#49325;&#51228;</dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#47484; &#49325;&#51228;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
</dd>
</dl>
<a id="CHDJFEJB" name="CHDJFEJB"></a>
<h5>&#49324;&#50857;&#51088; &#51221;&#51032; Message Queue &#51473;&#44060;&#51088; &#53364;&#47084;&#49828;&#53552;&#50640; &#45824;&#54620; &#50741;&#49496;</h5>
<p>[&#47700;&#49884;&#51648; &#45824;&#44592;&#50676; &#53364;&#47084;&#49828;&#53552; &#44396;&#49457; &#50976;&#54805;]&#51012; [&#49324;&#50857;&#51088; &#51221;&#51032;]&#47196; &#49444;&#51221;&#54624; &#44221;&#50864; GlassFish Server &#53364;&#47084;&#49828;&#53552;&#50640; &#49324;&#50857;&#54624; Message Queue &#51473;&#44060;&#51088; &#53364;&#47084;&#49828;&#53552;&#47484; &#44396;&#49457;&#54624; &#49688; &#51080;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>
<dl>
<dt>JMS &#49436;&#48708;&#49828; &#50976;&#54805;</dt>
<dd>
<p>&#51473;&#44060;&#51088; &#53364;&#47084;&#49828;&#53552;&#50640; &#49324;&#50857;&#54624; &#51473;&#44060;&#51088;(GlassFish Server&#51032; JMS &#54840;&#49828;&#53944;)&#51032; &#50976;&#54805;&#51077;&#45768;&#45796;. &#49440;&#53469;&#54620; &#50976;&#54805;&#50640; &#46384;&#46972; &#49324;&#50857; &#44032;&#45733;&#54620; &#51473;&#44060;&#51088; &#53364;&#47084;&#49828;&#53552;&#51032; &#50976;&#54805;&#51060; &#44208;&#51221;&#46121;&#45768;&#45796;. &#51473;&#44060;&#51088; &#50976;&#54805;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>Embedded</dt>
<dd>
<p>&#51473;&#44060;&#51088; &#44396;&#49457; &#48143; &#49688;&#47749; &#51452;&#44592;&#45716; GlassFish Server&#50640;&#49436; &#44288;&#47532;&#54633;&#45768;&#45796;. Each GlassFish &#53364;&#47084;&#49828;&#53552;&#46108; &#51064;&#49828;&#53556;&#49828;&#45716; &#51064;&#49828;&#53556;&#49828;&#50752; &#46041;&#51068;&#54620; JVM&#50640;&#49436; &#49892;&#54665;&#46104;&#45716; &#51473;&#44060;&#51088;&#50640;&#49436; &#51228;&#44277;&#54633;&#45768;&#45796;.</p>
<p>[JMS &#49436;&#48708;&#49828; &#50976;&#54805;] &#50741;&#49496;&#51060; [Embedded]&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#44592;&#48376; Message Queue &#51473;&#44060;&#51088; &#53364;&#47084;&#49828;&#53552;&#47564; &#51648;&#50896;&#46121;&#45768;&#45796;. &#44592;&#48376; &#53364;&#47084;&#49828;&#53552;&#47484; &#44396;&#49457;&#54616;&#45716; &#50741;&#49496;&#51060; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#47196;&#52972;</dt>
<dd>
<p>&#51473;&#44060;&#51088; &#44396;&#49457; &#48143; &#49688;&#47749; &#51452;&#44592;&#45716; GlassFish Server&#50640;&#49436; &#44288;&#47532;&#54633;&#45768;&#45796;. Each GlassFish &#53364;&#47084;&#49828;&#53552;&#46108; &#51064;&#49828;&#53556;&#49828;&#45716; &#51064;&#49828;&#53556;&#49828;&#50752; &#46041;&#51068;&#54620; &#54840;&#49828;&#53944;&#50640; &#51080;&#45716; &#48324;&#46020;&#51032; JVM&#50640;&#49436; &#49892;&#54665;&#46104;&#45716; &#51473;&#44060;&#51088;&#50640;&#49436; &#51228;&#44277;&#54633;&#45768;&#45796;.</p>
<p>[JMS &#49436;&#48708;&#49828; &#50976;&#54805;] &#50741;&#49496;&#51060; [&#47196;&#52972;]&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#44592;&#48376; &#48143; Enhanced(HA) Message Queue &#51473;&#44060;&#51088; &#53364;&#47084;&#49828;&#53552;&#44032; &#47784;&#46160; &#51648;&#50896;&#46121;&#45768;&#45796;. &#53364;&#47084;&#49828;&#53552; &#50976;&#54805;&#51012; &#49440;&#53469;&#54616;&#44256; &#53364;&#47084;&#49828;&#53552;&#47484; &#44396;&#49457;&#54616;&#45716; &#50741;&#49496;&#51060; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#50896;&#44201;</dt>
<dd>
<p>&#51473;&#44060;&#51088;/&#51473;&#44060;&#51088; &#53364;&#47084;&#49828;&#53552; &#44396;&#49457; &#48143; &#49688;&#47749; &#51452;&#44592;&#45716; Message Queue &#44288;&#47532; &#53812;&#51012; &#49324;&#50857;&#54616;&#50668; &#44288;&#47532;&#46121;&#45768;&#45796;.</p>
<p>[JMS &#49436;&#48708;&#49828; &#50976;&#54805;] &#50741;&#49496;&#51060; [&#50896;&#44201;]&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#45796;&#47480; &#50741;&#49496;&#51060; &#54364;&#49884;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
</dl>
</dd>
<dt>JMS &#53364;&#47084;&#49828;&#53552; &#50976;&#54805;</dt>
<dd>
<p>GlassFish Server &#53364;&#47084;&#49828;&#53552;&#50640; &#49324;&#50857;&#54624; Message Queue &#51473;&#44060;&#51088; &#53364;&#47084;&#49828;&#53552;&#51032; &#50976;&#54805;&#51077;&#45768;&#45796;.</p>
<p>[JMS &#53364;&#47084;&#49828;&#53552; &#50976;&#54805;] &#50741;&#49496;&#51060; [&#44592;&#48376;]&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#45796;&#51020; &#50741;&#49496;&#51060; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>
<dl>
<dt>JMS &#44396;&#49457; &#51200;&#51109;&#49548; &#50976;&#54805;</dt>
<dd>
<p>&#44592;&#48376; &#53364;&#47084;&#49828;&#53552; &#44396;&#49457; &#45936;&#51060;&#53552;&#50640; &#49324;&#50857;&#54624; &#45936;&#51060;&#53552; &#51200;&#51109;&#49548;&#51032; &#50976;&#54805;&#51077;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51060; [&#47560;&#49828;&#53552; &#51473;&#44060;&#51088;]&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#53364;&#47084;&#49828;&#53552; &#45236;&#51032; &#54620; &#51473;&#44060;&#51088;&#44032; &#47560;&#49828;&#53552; &#51473;&#44060;&#51088;&#47196; &#51648;&#51221;&#46104;&#44256; &#47560;&#49828;&#53552; &#51473;&#44060;&#51088;&#50640; &#51032;&#54644; &#44396;&#49457; &#45936;&#51060;&#53552;&#44032; &#51200;&#51109;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51060; [&#44277;&#50976; DB]&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#47784;&#46304; &#51473;&#44060;&#51088;&#50640;&#49436; &#50529;&#49464;&#49828;&#54624; &#49688; &#51080;&#45716; JDBC &#45936;&#51060;&#53552; &#51200;&#51109;&#49548;&#50640; &#44396;&#49457; &#45936;&#51060;&#53552;&#44032; &#51200;&#51109;&#46121;&#45768;&#45796;. &#51060; &#44221;&#50864; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#44288;&#47144; &#50741;&#49496;&#51060; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>JMS &#47700;&#49884;&#51648; &#51200;&#51109;&#49548; &#50976;&#54805;</dt>
<dd>
<p>&#44033; &#51473;&#44060;&#51088;&#51032; &#47700;&#49884;&#51648; &#45936;&#51060;&#53552;&#47484; &#51200;&#51109;&#54616;&#45716; &#45936; &#49324;&#50857;&#46104;&#45716; &#45936;&#51060;&#53552; &#51200;&#51109;&#49548;&#51032; &#50976;&#54805;&#51077;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51060; [&#54028;&#51068;]&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#44033; &#51473;&#44060;&#51088;&#51032; &#47700;&#49884;&#51648; &#45936;&#51060;&#53552;&#44032; &#54028;&#51068; &#44592;&#48152; &#45936;&#51060;&#53552; &#51200;&#51109;&#49548;&#50640; &#51200;&#51109;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51060; [JDBC]&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#44033; &#51473;&#44060;&#51088;&#51032; &#47700;&#49884;&#51648; &#45936;&#51060;&#53552;&#44032; JDBC &#45936;&#51060;&#53552; &#51200;&#51109;&#49548;&#50640; &#51200;&#51109;&#46121;&#45768;&#45796;.</p>
</dd>
</dl>
<p>[JMS &#53364;&#47084;&#49828;&#53552; &#50976;&#54805;] &#50741;&#49496;&#51060; [Enhanced(HA)]&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#44288;&#47144; &#50741;&#49496;&#51060; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#44277;&#44553;&#50629;&#52404;</dt>
<dt>&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; URL</dt>
<dt>&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#49324;&#50857;&#51088;</dt>
<dd>
<p>&#45796;&#51020; &#44221;&#50864;&#50640; &#49324;&#50857;&#54624; JDBC &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#51032; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#44277;&#44553;&#50629;&#52404;, &#50529;&#49464;&#49828; URL &#48143; JDBC &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#51032; &#49324;&#50857;&#51088;&#51077;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#44592;&#48376; &#53364;&#47084;&#49828;&#53552;&#51032; &#44396;&#49457; &#51200;&#51109;&#49548; &#50976;&#54805;&#51060; &#44277;&#50976; DB&#47196; &#49444;&#51221;&#46108; &#44221;&#50864;</p>
</li>
<li>
<p>&#44592;&#48376; &#53364;&#47084;&#49828;&#53552;&#51032; &#47700;&#49884;&#51648; &#51200;&#51109;&#49548; &#50976;&#54805;&#51060; JDBC&#47196; &#49444;&#51221;&#46108; &#44221;&#50864;</p>
</li>
<li>
<p>&#53364;&#47084;&#49828;&#53552; &#50976;&#54805;&#51060; Enhanced(HA)&#47196; &#49444;&#51221;&#46108; &#44221;&#50864;</p>
</li>
</ul>
<p>&#51648;&#50896;&#46104;&#45716; &#44277;&#44553;&#50629;&#52404; &#48143; &#44033; &#44277;&#44553;&#50629;&#52404;&#51032; &#50529;&#49464;&#49828; URL &#54805;&#49885;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <i>Oracle GlassFish Server Message Queue Administration Guide</i>&#51032; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GMADG00244">JDBC-Based Persistence</a>&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</dd>
<dt>&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#51064;&#51613;</dt>
<dt>&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#48708;&#48128;&#48264;&#54840;</dt>
<dt>&#48708;&#48128;&#48264;&#54840; &#48324;&#52845;</dt>
<dd>
<p>&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#49324;&#50857;&#51088;&#50640; &#51648;&#51221;&#46108; JDBC &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#49324;&#50857;&#51088;&#51032; &#48708;&#48128;&#48264;&#54840; &#51221;&#48372;&#51077;&#45768;&#45796;.</p>
<p>[&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#51064;&#51613;]&#51060; [&#48708;&#48128;&#48264;&#54840;]&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; [&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#48708;&#48128;&#48264;&#54840;] &#50741;&#49496;&#51060; &#54364;&#49884;&#46121;&#45768;&#45796;. [&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#51064;&#51613;]&#51060; [&#48708;&#48128;&#48264;&#54840; &#48324;&#52845;]&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; [&#48708;&#48128;&#48264;&#54840; &#48324;&#52845;] &#50741;&#49496;&#51060; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>JMS &#53364;&#47084;&#49828;&#53552; &#49549;&#49457;</dt>
<dd>
<p>&#51473;&#44060;&#51088;&#47484; &#44396;&#49457;&#54616;&#45716; &#54616;&#45208; &#51060;&#49345;&#51032; Message Queue &#51473;&#44060;&#51088; &#49549;&#49457; &#47785;&#47197;&#51077;&#45768;&#45796;. &#51060; &#47785;&#47197;&#51008; &#53084;&#47200;(<code>:</code>)&#51004;&#47196; &#44396;&#48516;&#46104;&#47728; &#45796;&#51020;&#44284; &#44057;&#51008; &#54805;&#49885;&#51004;&#47196; &#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<pre>
<i>prop1Name</i>=<i>prop1Value</i>:<i>prop2Name</i>=<i>prop2Value</i>:...
</pre>
<p>&#51473;&#44060;&#51088; &#49549;&#49457; &#51060;&#47492;&#50640; &#51216;&#51060; &#54252;&#54632;&#46108; &#44221;&#50864;, &#51216; &#50526;&#50640; &#46160; &#44060;&#51032; &#48177;&#49836;&#47000;&#49884;(<code>\\</code>)&#47484; &#52628;&#44032;&#54616;&#49901;&#49884;&#50724;. &#50696;&#47484; &#46308;&#50612; <code>imq.system.max_count</code> &#49549;&#49457;&#51012; &#54252;&#54632;&#49884;&#53412;&#47140;&#47732; &#47785;&#47197;&#50640; <code>imq\\.system\\.max_count</code>&#47484; &#51648;&#51221;&#54616;&#49901;&#49884;&#50724;.</p>
</dd>
</dl>
<a id="sthref249" name="sthref249"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<p><a href="task-create-cluster.html">&#53364;&#47084;&#49828;&#53552;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
<a id="sthref250" name="sthref250"></a>
<h5>&#46041;&#51068;&#54620; asadmin &#54616;&#50948; &#47749;&#47161;</h5>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00017"><code>create-cluster</code>(1)</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
