<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterinstances" name="ref-clusterinstances"></a></p>

<h4><a id="sthref266" name="sthref266"></a><a id="sthref267" name="sthref267"></a>&#53364;&#47084;&#49828;&#53552;&#46108; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#53364;&#47084;&#49828;&#53552;&#46108; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#54788;&#51116; &#53364;&#47084;&#49828;&#53552;&#51032; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#47484; &#49373;&#49457;&#54616;&#44256; &#44288;&#47532;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>[&#53364;&#47084;&#49828;&#53552; &#51060;&#47492;] &#54596;&#46300;&#45716; &#54788;&#51116; &#53364;&#47084;&#49828;&#53552;&#51032; &#51060;&#47492;&#51012; &#54364;&#49884;&#54616;&#45716; &#51069;&#44592; &#51204;&#50857; &#54596;&#46300;&#51077;&#45768;&#45796;.</p>
<p>[&#53364;&#47084;&#49828;&#53552;&#46108; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;] &#54168;&#51060;&#51648;&#50640;&#45716; &#54788;&#51116; &#53364;&#47084;&#49828;&#53552;&#51032; &#47716;&#48260;&#51064; &#51064;&#49828;&#53556;&#49828;&#51032; &#47785;&#47197;&#51060; &#54364;&#49884;&#46121;&#45768;&#45796;. &#44033; &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54644; &#51228;&#44277;&#46104;&#45716; &#51221;&#48372;&#45716; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#51060;&#47492;</dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#44032; &#49373;&#49457;&#46112; &#46412; &#51064;&#49828;&#53556;&#49828;&#50640; &#51648;&#51221;&#46108; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060;&#47492;&#51012; &#45572;&#47476;&#47732; &#54644;&#45817; &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54620; <a href="ref-clusterinstanceedit.html">&#51068;&#48152; &#51221;&#48372;</a> &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</dd>
<dt>LB &#44032;&#51473;&#52824;</dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#51032; &#47196;&#46300; &#44512;&#54805; &#51312;&#51221; &#44032;&#51473;&#52824;&#47484; &#45208;&#53440;&#45236;&#45716; &#51221;&#49688;&#51077;&#45768;&#45796;.</p>
<p>&#47196;&#46300; &#44512;&#54805; &#51312;&#51221; &#44032;&#51473;&#52824;&#45716; &#51064;&#49828;&#53556;&#49828;&#44032; &#52376;&#47532;&#54644;&#50556; &#54616;&#45716; &#53364;&#47084;&#49828;&#53552;&#50640; &#45824;&#54620; &#47784;&#46304; &#50836;&#52397;&#51032; &#48708;&#50984;&#51012; &#44208;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#50696;&#47484; &#46308;&#50612; &#46160; &#44060;&#51032; &#51064;&#49828;&#53556;&#49828;&#47196; &#44396;&#49457;&#46108; &#53364;&#47084;&#49828;&#53552;&#50640;&#49436; &#54620; &#51064;&#49828;&#53556;&#49828;&#44032; &#45348; &#44060;&#51032; &#50836;&#52397; &#51473;&#50640;&#49436; &#54616;&#45208;&#47484; &#52376;&#47532;&#54616;&#44256; &#45796;&#47480; &#51064;&#49828;&#53556;&#49828;&#44032; &#45348; &#44060;&#51032; &#50836;&#52397; &#51473;&#50640;&#49436; &#49464; &#44060;&#47484; &#52376;&#47532;&#54644;&#50556; &#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#44221;&#50864; &#45348; &#44060;&#51032; &#50836;&#52397; &#51473;&#50640;&#49436; &#54616;&#45208;&#47484; &#52376;&#47532;&#54624; &#51064;&#49828;&#53556;&#49828;&#51032; &#44032;&#51473;&#52824;&#47484; 1&#47196; &#49444;&#51221;&#54616;&#44256; &#45796;&#47480; &#51064;&#49828;&#53556;&#49828;&#51032; &#44032;&#51473;&#52824;&#47484; 3&#51004;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;. &#48177;&#48516;&#50984;&#51012; &#49324;&#50857;&#54616;&#47140;&#45716; &#44221;&#50864; &#51064;&#49828;&#53556;&#49828;&#51032; &#44032;&#51473;&#52824;&#47484; &#44033;&#44033; 25&#50752; 75&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376; &#44032;&#51473;&#52824;&#45716; 100&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#44396;&#49457;</dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#44032; &#52280;&#51312;&#54616;&#45716; &#44396;&#49457;&#51077;&#45768;&#45796;. &#44396;&#49457;&#51012; &#45572;&#47476;&#47732; &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54620; <a href="../../../common/en/help/ref-configuration.html">&#44396;&#49457;</a> &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</dd>
<dt>&#45432;&#46300;</dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#44032; &#51080;&#45716; &#45432;&#46300;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060;&#47492;&#51012; &#45572;&#47476;&#47732; &#54644;&#45817; &#45432;&#46300;&#50640; &#45824;&#54620; <a href="ref-nodeedit.html">&#45432;&#46300; &#54200;&#51665;</a> &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</dd>
<dt>&#49345;&#53468;</dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#44032; &#49892;&#54665; &#51473;&#51064;&#51648;, &#44396;&#49457; &#48320;&#44221; &#49324;&#54637;&#51004;&#47196; &#50629;&#45936;&#51060;&#53944;&#54616;&#44592; &#50948;&#54644; &#51116;&#49884;&#51089;&#54644;&#50556; &#54616;&#45716;&#51648; &#46608;&#45716; &#49892;&#54665; &#51473;&#51060;&#51648; &#50506;&#51008;&#51648; &#50668;&#48512;&#47484; &#45208;&#53440;&#45253;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
<p>&#49436;&#48260; &#51064;&#49828;&#53556;&#49828; &#53580;&#51060;&#48660;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#46020; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#49352;&#47196; &#47564;&#46308;&#44592;</dt>
<dd>
<p>&#53364;&#47084;&#49828;&#53552;&#50640; &#51064;&#49828;&#53556;&#49828;&#47484; &#52628;&#44032;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49325;&#51228;</dt>
<dd>
<p>&#53364;&#47084;&#49828;&#53552;&#50640;&#49436; &#49440;&#53469;&#54620; &#54616;&#45208; &#51060;&#49345;&#51032; &#51064;&#49828;&#53556;&#49828;&#47484; &#51228;&#44144;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;.</p>

<hr>
<p><b>&#51452;&#51032;:</b></p>
&#47560;&#49828;&#53552; &#51473;&#44060;&#51088;&#50640;&#49436; JMS(Java Message Service) &#53364;&#47084;&#49828;&#53552;&#47484; &#49324;&#50857;&#54616;&#45716; &#44221;&#50864;&#50640;&#45716; &#51060; &#47560;&#49828;&#53552; &#51473;&#44060;&#51088;&#50752; &#50672;&#44288;&#46108; &#51064;&#49828;&#53556;&#49828;&#47484; &#49325;&#51228;&#54616;&#51648; &#47560;&#49901;&#49884;&#50724;. &#51060; &#51064;&#49828;&#53556;&#49828;&#47484; &#49325;&#51228;&#54644;&#50556; &#54616;&#45716; &#44221;&#50864;&#50640;&#45716; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00005"><code>change-master-broker</code>(1)</a> &#54616;&#50948; &#47749;&#47161;&#51012; &#49324;&#50857;&#54616;&#50668; &#47560;&#49828;&#53552; &#51473;&#44060;&#51088;&#47484; &#45796;&#47480; &#51064;&#49828;&#53556;&#49828;&#50640; &#51648;&#51221;&#54616;&#49901;&#49884;&#50724;.
<hr>

</dd>
<dt>&#49884;&#51089;</dt>
<dd>
<p>&#53364;&#47084;&#49828;&#53552;&#51032; &#49440;&#53469;&#54620; &#54616;&#45208; &#51060;&#49345;&#51032; &#51064;&#49828;&#53556;&#49828;&#47484; &#49884;&#51089;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51221;&#51648;</dt>
<dd>
<p>&#53364;&#47084;&#49828;&#53552;&#51032; &#49440;&#53469;&#54620; &#54616;&#45208; &#51060;&#49345;&#51032; &#51064;&#49828;&#53556;&#49828;&#47484; &#51221;&#51648;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref268" name="sthref268"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-create-clustered-instance.html">&#53364;&#47084;&#49828;&#53552;&#50640; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#47484; &#52628;&#44032;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-delete-clustered-instances.html">&#53364;&#47084;&#49828;&#53552;&#46108; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#47484; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-start-clustered-instances.html">&#53364;&#47084;&#49828;&#53552;&#46108; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#47484; &#49884;&#51089;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-stop-clustered-instances.html">&#53364;&#47084;&#49828;&#53552;&#46108; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#47484; &#51221;&#51648;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref269" name="sthref269"></a>
<h5>&#46041;&#51068;&#54620; asadmin &#54616;&#50948; &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00033"><code>create-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00085"><code>delete-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00170"><code>list-instances</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00236"><code>start-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00241"><code>stop-instance</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
