<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-nodeedit" name="ref-nodeedit"></a></p>

<h4><a id="sthref313" name="sthref313"></a>&#45432;&#46300; &#54200;&#51665;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#45432;&#46300; &#54200;&#51665;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; GlassFish Server &#45432;&#46300;&#51032; &#44396;&#49457; &#45936;&#51060;&#53552;&#47484; &#50629;&#45936;&#51060;&#53944;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#45432;&#46300; &#50976;&#54805;&#51012; CONFIG&#50640;&#49436; DCOM &#46608;&#45716; SSH&#47196; &#48320;&#44221;&#54616;&#50668; &#45432;&#46300;&#50640; &#45824;&#54620; &#50896;&#44201; &#53685;&#49888;&#51060; &#44032;&#45733;&#54616;&#46020;&#47197; &#54624; &#49688;&#46020; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#45432;&#46300; &#50976;&#54805;&#51012; CONFIG&#50640;&#49436; DCOM&#51004;&#47196; &#48320;&#44221;&#54616;&#45716; &#44221;&#50864; &#45796;&#51020; &#54596;&#46300;&#47484; &#48708;&#50892; &#46160;&#47732; &#44592;&#48376;&#44050;&#51060; &#51201;&#50857;&#46121;&#45768;&#45796;.</p>
<ul>
<li>
<p>Windows &#46020;&#47700;&#51064;</p>
</li>
<li>
<p>Windows &#49324;&#50857;&#51088;</p>
</li>
</ul>
<p>&#45432;&#46300; &#50976;&#54805;&#51012; CONFIG&#50640;&#49436; SSH&#47196; &#48320;&#44221;&#54616;&#45716; &#44221;&#50864; &#45796;&#51020; &#54596;&#46300;&#47484; &#48708;&#50892; &#46160;&#47732; &#44592;&#48376;&#44050;&#51060; &#51201;&#50857;&#46121;&#45768;&#45796;.</p>
<ul>
<li>
<p>SSH &#54252;&#53944;</p>
</li>
<li>
<p>&#49324;&#50857;&#51088; &#51060;&#47492;</p>
</li>
<li>
<p>&#53412; &#54028;&#51068;</p>
</li>
</ul>
<p>[&#45432;&#46300; &#54200;&#51665;] &#54168;&#51060;&#51648;&#50640; &#54252;&#54632;&#46104;&#45716; &#50741;&#49496;&#51008; &#45432;&#46300; &#50976;&#54805;&#50640; &#46384;&#46972; &#45804;&#46972;&#51665;&#45768;&#45796;.</p>
<a id="sthref314" name="sthref314"></a>
<h5>&#47784;&#46304; &#45432;&#46300; &#50976;&#54805;&#50640; &#45824;&#54620; &#50741;&#49496;</h5>
<p>&#47784;&#46304; &#45432;&#46300; &#50976;&#54805;&#50640; &#49324;&#50857;&#54624; &#49688; &#51080;&#45716; &#50741;&#49496;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#51060;&#47492;</dt>
<dd>
<p>&#45432;&#46300;&#44032; &#49373;&#49457;&#46112; &#46412; &#45432;&#46300;&#50640; &#51648;&#51221;&#46108; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#50976;&#54805;</dt>
<dd>
<p>&#45796;&#51020; &#50976;&#54805; &#51473; &#54616;&#45208;&#51064; &#45432;&#46300; &#50976;&#54805;&#51012; &#51648;&#51221;&#54616;&#45716; &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#51077;&#45768;&#45796;.</p>
<dl>
<dt>CONFIG</dt>
<dd>
<p>&#45432;&#46300;&#44032; &#50896;&#44201; &#53685;&#49888;&#51012; &#51648;&#50896;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;. CONFIG&#47484; &#49440;&#53469;&#54616;&#47732; DCOM &#46608;&#45716; SSH &#44396;&#49457;&#50640; &#45824;&#54620; &#50741;&#49496;&#51060; &#54364;&#49884;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;. &#54788;&#51116; &#45432;&#46300; &#50976;&#54805;&#51060; SSH&#51064;&#45936; CONFIG&#47484; &#49440;&#53469;&#54616;&#45716; &#44221;&#50864; &#48320;&#44221; &#49324;&#54637;&#51012; &#51200;&#51109;&#54616;&#47732; &#45432;&#46300; &#44396;&#49457;&#50640;&#49436; DCOM &#46608;&#45716; SSH &#44396;&#49457; &#45936;&#51060;&#53552;&#44032; &#51228;&#44144;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>DCOM</dt>
<dd>
<p>&#45432;&#46300;&#44032; DCOM(Distributed Component Object Model) &#50896;&#44201; &#54532;&#47196;&#53664;&#53084;&#51012; &#53685;&#54620; &#53685;&#49888;&#51012; &#51648;&#50896;&#54633;&#45768;&#45796;. DCOM &#54532;&#47196;&#53664;&#53084;&#51008; Windows &#49884;&#49828;&#53596;&#50640;&#49436;&#47564; &#49324;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>SSH</dt>
<dd>
<p>&#45432;&#46300;&#44032; SSH(&#48372;&#50504; &#49528;)&#47484; &#53685;&#54620; &#53685;&#49888;&#51012; &#51648;&#50896;&#54633;&#45768;&#45796;.</p>
</dd>
</dl>
</dd>
<dt>&#45432;&#46300; &#54840;&#49828;&#53944;</dt>
<dd>
<p>&#45432;&#46300;&#44032; &#50629;&#45936;&#51060;&#53944;&#46108; &#54980; &#45432;&#46300;&#44032; &#45208;&#53440;&#45236;&#45716; &#54840;&#49828;&#53944;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#44032; &#54596;&#49688;&#51064;&#51648; &#50668;&#48512;&#45716; &#45432;&#46300; &#50976;&#54805;&#50640; &#46384;&#46972; &#44208;&#51221;&#46121;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#45432;&#46300; &#50976;&#54805;&#51060; CONFIG&#51060;&#47732; &#54840;&#49828;&#53944; &#51060;&#47492;&#51012; &#49373;&#47029;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#54840;&#49828;&#53944; &#51060;&#47492;&#51008; &#45432;&#46300;&#50640; &#51080;&#45716; &#51064;&#49828;&#53556;&#49828;&#47484; &#49373;&#49457;&#54624; &#46412; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>&#45432;&#46300; &#50976;&#54805;&#51060; DCOM &#46608;&#45716; SSH&#51064; &#44221;&#50864; &#54840;&#49828;&#53944; &#51060;&#47492;&#51012; &#51648;&#51221;&#54644;&#50556; &#54633;&#45768;&#45796;. &#44536;&#47111;&#51648; &#50506;&#51004;&#47732; &#50724;&#47448;&#44032; &#48156;&#49373;&#54633;&#45768;&#45796;.</p>
</li>
</ul>
</dd>
<dt>&#45432;&#46300; &#46356;&#47113;&#53664;&#47532;</dt>
<dd>
<p>&#45432;&#46300;&#50640; &#49373;&#49457;&#46108; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#47484; &#54252;&#54632;&#54624; &#46356;&#47113;&#53664;&#47532; &#44221;&#47196;&#51077;&#45768;&#45796;. &#49345;&#45824; &#44221;&#47196;&#47484; &#51648;&#51221;&#54620; &#44221;&#50864; &#44221;&#47196;&#44032; as-install &#46356;&#47113;&#53664;&#47532;&#47484; &#44592;&#51456;&#51004;&#47196; &#54633;&#45768;&#45796;. &#50668;&#44592;&#49436; as-install&#51008;(&#45716;) &#54840;&#49828;&#53944;&#51032; GlassFish Server &#49548;&#54532;&#53944;&#50920;&#50612;&#51032; &#44592;&#48376; &#49444;&#52824; &#46356;&#47113;&#53664;&#47532;&#51077;&#45768;&#45796;.</p>
<p>&#51060; &#54596;&#46300;&#44032; &#48708;&#50612; &#51080;&#51004;&#47732; &#45432;&#46300;&#51032; &#44396;&#49457;&#51060; &#45796;&#51020;&#44284; &#44057;&#51060; &#50629;&#45936;&#51060;&#53944;&#46121;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#45432;&#46300; &#50976;&#54805;&#51060; CONFIG&#51060;&#47732; DAS(&#46020;&#47700;&#51064; &#44288;&#47532; &#49436;&#48260;) &#44396;&#49457;&#50640; &#45432;&#46300;&#50640; &#45824;&#54620; &#51064;&#49828;&#53556;&#49828;&#51032; &#46356;&#47113;&#53664;&#47532;&#44032; &#51648;&#51221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;. &#45432;&#46300; &#46356;&#47113;&#53664;&#47532;&#45716; &#45432;&#46300;&#50640; &#51080;&#45716; &#51064;&#49828;&#53556;&#49828;&#47484; &#49373;&#49457;&#54624; &#46412; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>&#45432;&#46300; &#50976;&#54805;&#51060; DCOM&#51064; &#44221;&#50864;, &#44592;&#48376; &#46356;&#47113;&#53664;&#47532;&#45716; as-install<code>\nodes</code>&#51077;&#45768;&#45796;. &#50668;&#44592;&#49436; as-install&#51008;(&#45716;) &#54840;&#49828;&#53944;&#50640; &#51080;&#45716; GlassFish Server &#49548;&#54532;&#53944;&#50920;&#50612;&#51032; &#44592;&#48376; &#49444;&#52824; &#46356;&#47113;&#53664;&#47532;&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>&#45432;&#46300; &#50976;&#54805;&#51060; SSH&#51064; &#44221;&#50864;, &#45432;&#46300; &#46356;&#47113;&#53664;&#47532;&#45716; as-install<code>/nodes</code>&#51077;&#45768;&#45796;. &#50668;&#44592;&#49436; as-install&#51008;(&#45716;) &#54840;&#49828;&#53944;&#50640; &#51080;&#45716; GlassFish Server &#49548;&#54532;&#53944;&#50920;&#50612;&#51032; &#44592;&#48376; &#49444;&#52824; &#46356;&#47113;&#53664;&#47532;&#51077;&#45768;&#45796;.</p>
</li>
</ul>
</dd>
<dt>&#49444;&#52824; &#46356;&#47113;&#53664;&#47532;</dt>
<dd>
<p>&#54840;&#49828;&#53944;&#50640; &#51080;&#45716; GlassFish Server &#49548;&#54532;&#53944;&#50920;&#50612; &#44592;&#48376; &#49444;&#52824; &#46356;&#47113;&#53664;&#47532;&#51032; <i>&#49345;&#50948;</i> &#46356;&#47113;&#53664;&#47532;&#50640; &#45824;&#54620; &#51204;&#52404; &#44221;&#47196;&#51077;&#45768;&#45796;(&#50696;: <code>/export/glassfish3/</code>).</p>
<p>&#51060; &#54596;&#46300;&#44032; &#48708;&#50612; &#51080;&#51004;&#47732; &#45432;&#46300;&#51032; &#44396;&#49457;&#51060; &#45796;&#51020;&#44284; &#44057;&#51060; &#50629;&#45936;&#51060;&#53944;&#46121;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#45432;&#46300; &#50976;&#54805;&#51060; CONFIG&#51060;&#47732; DAS &#44396;&#49457;&#50640; &#45432;&#46300;&#50640; &#45824;&#54620; &#49444;&#52824; &#46356;&#47113;&#53664;&#47532;&#44032; &#51648;&#51221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;. &#49444;&#52824; &#46356;&#47113;&#53664;&#47532;&#45716; &#45432;&#46300;&#50640; &#51080;&#45716; &#51064;&#49828;&#53556;&#49828;&#47484; &#49373;&#49457;&#54624; &#46412; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>&#45432;&#46300; &#50976;&#54805;&#51060; DCOM &#46608;&#45716; SSH&#51064; &#44221;&#50864; &#49444;&#52824; &#46356;&#47113;&#53664;&#47532;&#45716; DAS&#50640; &#45824;&#54620; GlassFish Server &#49548;&#54532;&#53944;&#50920;&#50612;&#51032; &#49345;&#50948; &#44592;&#48376; &#49444;&#52824; &#46356;&#47113;&#53664;&#47532;&#51077;&#45768;&#45796;. &#51060; &#49444;&#51221;&#51008; GlassFish Server&#44032; &#47784;&#46304; &#54840;&#49828;&#53944;&#50640;&#49436; &#46041;&#51068;&#54620; &#50948;&#52824;&#50640; &#49444;&#52824;&#46104;&#50612; &#51080;&#45716; &#44221;&#50864;&#50640;&#47564; &#50976;&#50857;&#54633;&#45768;&#45796;.</p>
</li>
</ul>
</dd>
</dl>
<a id="sthref315" name="sthref315"></a>
<h5>DCOM &#45432;&#46300;&#50640; &#45824;&#54620; &#52628;&#44032; &#50741;&#49496;</h5>
<p>[&#50976;&#54805;] &#54596;&#46300;&#44032; DCOM&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864;&#50640;&#47564; &#49324;&#50857;&#54624; &#49688; &#51080;&#45716; &#50741;&#49496;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44053;&#51228; &#51201;&#50857;</dt>
<dd>
<p>[&#49324;&#50857;] &#50741;&#49496;&#51012; &#49440;&#53469;&#54620; &#44221;&#50864; &#45432;&#46300;&#51032; &#47588;&#44060;&#48320;&#49688; &#44160;&#51613;&#51060; &#49892;&#54056;&#54616;&#45908;&#46972;&#46020; &#45432;&#46300;&#44032; DAS &#44396;&#49457;&#50640; &#49373;&#49457;&#46121;&#45768;&#45796;. &#45432;&#46300; &#47588;&#44060;&#48320;&#49688;&#47484; &#44160;&#51613;&#54616;&#47140;&#47732; DAS&#44032; DCOM&#51012; &#53685;&#54644; &#45432;&#46300; &#54840;&#49828;&#53944;&#50640; &#50672;&#44208;&#54624; &#49688; &#51080;&#50612;&#50556; &#54633;&#45768;&#45796;.</p>
</dd>
<dt>DCOM &#44160;&#51613;</dt>
<dd>
<p>[&#49324;&#50857;] &#50741;&#49496;&#51012; &#49440;&#53469;&#54620; &#44221;&#50864; &#45432;&#46300;&#47484; &#50629;&#45936;&#51060;&#53944;&#54616;&#44592; &#51204;&#50640; GlassFish Server&#50640;&#49436; DCOM&#51012; &#53685;&#54620; &#45432;&#46300; &#54840;&#49828;&#53944; &#51217;&#49549;&#51012; &#53580;&#49828;&#53944;&#54633;&#45768;&#45796;. &#53580;&#49828;&#53944;&#51032; &#51068;&#48512;&#47196;, GlassFish Server&#50640;&#49436;&#45716; <code>delete_me.bat</code> &#49828;&#53356;&#47549;&#53944;&#47484; &#54840;&#49828;&#53944;&#47196; &#48373;&#49324;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; GlassFish Server&#50640;&#49436; &#49828;&#53356;&#47549;&#53944;&#47484; &#48373;&#49324;&#54624; &#45824;&#49345; &#46356;&#47113;&#53664;&#47532;&#47484; &#51077;&#47141;&#54624; &#49688; &#51080;&#46020;&#47197; [&#50896;&#44201; &#53580;&#49828;&#53944; &#46356;&#47113;&#53664;&#47532;] &#54596;&#46300;&#44032; &#54876;&#49457;&#54868;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#50896;&#44201; &#53580;&#49828;&#53944; &#46356;&#47113;&#53664;&#47532;</dt>
<dd>
<p>GlassFish Server&#50640;&#49436; <code>delete_me.bat</code> &#54028;&#51068;&#51012; &#49373;&#49457;&#54644;&#50556; &#54616;&#45716; &#50896;&#44201; &#54840;&#49828;&#53944;&#51032; &#54260;&#45908;&#51077;&#45768;&#45796;. [Windows &#49324;&#50857;&#51088; &#51060;&#47492;] &#50741;&#49496;&#50640; &#51648;&#51221;&#46108; &#49324;&#50857;&#51088;&#45716; &#51060; &#54260;&#45908;&#50640; &#45824;&#54620; &#50416;&#44592; &#50529;&#49464;&#49828; &#44428;&#54620;&#51060; &#51080;&#50612;&#50556; &#54633;&#45768;&#45796;. &#44536;&#47111;&#51648; &#50506;&#51004;&#47732; &#50724;&#47448;&#44032; &#48156;&#49373;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>C:\</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>Windows &#46020;&#47700;&#51064;</dt>
<dd>
<p>[Windows &#49324;&#50857;&#51088; &#51060;&#47492;] &#50741;&#49496;&#50640; &#51648;&#51221;&#46108; &#49324;&#50857;&#51088;&#47484; &#54252;&#54632;&#54616;&#45716; Windows &#46020;&#47700;&#51064;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; &#44288;&#47532; &#53080;&#49556;&#51060; &#49892;&#54665; &#51473;&#51064; &#54840;&#49828;&#53944;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>Windows &#49324;&#50857;&#51088; &#51060;&#47492;</dt>
<dd>
<p>DCOM&#51012; &#53685;&#54644; &#54840;&#49828;&#53944;&#50640; &#51217;&#49549;&#54616;&#44592; &#50948;&#54620; &#54532;&#47196;&#49464;&#49828;&#47484; &#49892;&#54665;&#54624; &#51060; &#45432;&#46300;&#51032; &#54840;&#49828;&#53944; &#49324;&#50857;&#51088;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; DAS &#54532;&#47196;&#49464;&#49828;&#47484; &#49892;&#54665; &#51473;&#51064; &#49324;&#50857;&#51088;&#51077;&#45768;&#45796;. &#45432;&#46300; &#54840;&#49828;&#53944; &#50741;&#49496;&#51060; <code>localhost-</code><i>domain</i>&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; Windows &#49324;&#50857;&#51088; &#51060;&#47492; &#50741;&#49496;&#51060; &#47924;&#49884;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>Windows &#49324;&#50857;&#51088; &#51064;&#51613;</dt>
<dd>
<p>&#51060; &#45432;&#46300; &#54840;&#49828;&#53944;&#50640; &#47196;&#44536;&#51064;&#54624; &#46412; Windows &#49324;&#50857;&#51088; &#51064;&#51613; &#48169;&#49885;&#51012; &#51648;&#51221;&#54616;&#45716; &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#51077;&#45768;&#45796;. &#44032;&#45733;&#54620; &#51064;&#51613; &#48169;&#48277;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#48708;&#48128;&#48264;&#54840;</dt>
<dd>
<p>Windows &#49324;&#50857;&#51088;&#44032; DAS &#44396;&#49457;&#50640; &#51200;&#51109;&#46108; &#48708;&#48128;&#48264;&#54840;&#47484; &#53685;&#54644; &#51064;&#51613;&#46121;&#45768;&#45796;.</p>

<hr>
<p><b>&#51452;&#51032;:</b></p>
&#51060; &#48708;&#48128;&#48264;&#54840;&#45716; DAS &#44396;&#49457;&#50640; &#51068;&#48152; &#53581;&#49828;&#53944;&#47196; &#51200;&#51109;&#46121;&#45768;&#45796;. &#48372;&#50504; &#54693;&#49345;&#51012; &#50948;&#54644; &#48708;&#48128;&#48264;&#54840; &#48324;&#52845;&#51012; &#49324;&#50857;&#54616;&#49901;&#49884;&#50724;.
<hr>

<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; &#48708;&#48128;&#48264;&#54840;&#47484; &#51077;&#47141;&#54624; &#49688; &#51080;&#46020;&#47197; [Windows &#49324;&#50857;&#51088; &#48708;&#48128;&#48264;&#54840;] &#54596;&#46300;&#44032; &#54876;&#49457;&#54868;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#48708;&#48128;&#48264;&#54840; &#48324;&#52845;</dt>
<dd>
<p>Windows &#49324;&#50857;&#51088;&#44032; &#48708;&#48128;&#48264;&#54840; &#48324;&#52845;&#51012; &#53685;&#54644; &#51064;&#51613;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54620; &#44221;&#50864;&#50640;&#45716; [&#48708;&#48128;&#48264;&#54840; &#48324;&#52845;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#48708;&#48128;&#48264;&#54840; &#48324;&#52845;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</dd>
</dl>
</dd>
<dt>Windows &#49324;&#50857;&#51088; &#48708;&#48128;&#48264;&#54840;</dt>
<dd>
<p>Windows &#49324;&#50857;&#51088;&#44032; &#51060; &#45432;&#46300; &#54840;&#49828;&#53944;&#50640; &#47196;&#44536;&#51064;&#54624; &#46412; &#49324;&#50857;&#54624; &#48708;&#48128;&#48264;&#54840;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#48708;&#48128;&#48264;&#54840; &#48324;&#52845;</dt>
<dd>
<p>&#51060; &#46020;&#47700;&#51064;&#50640; &#45824;&#54644; &#51221;&#51032;&#46108; &#48708;&#48128;&#48264;&#54840; &#48324;&#52845;&#51032; &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref316" name="sthref316"></a>
<h5>SSH &#45432;&#46300;&#50640; &#45824;&#54620; &#52628;&#44032; &#50741;&#49496;</h5>
<p>&#50976;&#54805; &#54596;&#46300;&#44032; SSH&#47196; &#49444;&#51221;&#46108; &#44221;&#50864;&#50640;&#47564; &#49324;&#50857;&#54624; &#49688; &#51080;&#45716; &#50741;&#49496;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44053;&#51228; &#51201;&#50857;</dt>
<dd>
<p>[&#49324;&#50857;] &#50741;&#49496;&#51012; &#49440;&#53469;&#54620; &#44221;&#50864; &#45432;&#46300;&#51032; &#47588;&#44060;&#48320;&#49688; &#44160;&#51613;&#51060; &#49892;&#54056;&#54616;&#45908;&#46972;&#46020; &#45432;&#46300;&#44032; DAS(&#46020;&#47700;&#51064; &#44288;&#47532; &#49436;&#48260;) &#44396;&#49457;&#50640;&#49436; &#50629;&#45936;&#51060;&#53944;&#46121;&#45768;&#45796;. &#45432;&#46300; &#47588;&#44060;&#48320;&#49688;&#47484; &#44160;&#51613;&#54616;&#47140;&#47732; DAS&#44032; SSH&#47484; &#53685;&#54644; &#45432;&#46300;&#51032; &#54840;&#49828;&#53944;&#50640; &#50672;&#44208;&#54624; &#49688; &#51080;&#50612;&#50556; &#54633;&#45768;&#45796;.</p>
</dd>
<dt>SSH &#54252;&#53944;</dt>
<dd>
<p>&#51060; &#45432;&#46300;&#51032; &#54840;&#49828;&#53944;&#50640; &#45824;&#54620; SSH &#51217;&#49549;&#50640; &#49324;&#50857;&#54624; &#54252;&#53944;&#51077;&#45768;&#45796;.</p>
<p>&#45432;&#46300; &#50976;&#54805;&#51012; CONFIG&#50640;&#49436; SSH&#47196; &#48320;&#44221;&#54616;&#44256; &#51060; &#54596;&#46300;&#47484; &#48708;&#50892; &#46160;&#47732; SSH &#54252;&#53944; &#50741;&#49496;&#51060; 22&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;.</p>
<p>&#45432;&#46300; &#54840;&#49828;&#53944; &#50741;&#49496;&#51060; <code>localhost-</code><i>domain</i>&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; SSH &#54252;&#53944; &#50741;&#49496;&#51060; &#47924;&#49884;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>SSH &#49324;&#50857;&#51088; &#51060;&#47492;</dt>
<dd>
<p>SSH&#47484; &#53685;&#54644; &#54840;&#49828;&#53944;&#50640; &#51217;&#49549;&#54616;&#44592; &#50948;&#54620; &#54532;&#47196;&#49464;&#49828;&#47484; &#49892;&#54665;&#54624; &#51060; &#45432;&#46300;&#51032; &#54840;&#49828;&#53944; &#49324;&#50857;&#51088;&#51077;&#45768;&#45796;.</p>
<p>&#45432;&#46300; &#50976;&#54805;&#51012; CONFIG&#50640;&#49436; SSH&#47196; &#48320;&#44221;&#54616;&#44256; &#51060; &#54596;&#46300;&#47484; &#48708;&#50892; &#46160;&#47732; &#49324;&#50857;&#51088; &#51060;&#47492; &#50741;&#49496;&#51060; DAS &#54532;&#47196;&#49464;&#49828;&#47484; &#49892;&#54665;&#54616;&#44256; &#51080;&#45716; &#49324;&#50857;&#51088;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;.</p>
<p>&#45432;&#46300; &#54840;&#49828;&#53944; &#50741;&#49496;&#51060; <code>localhost-</code><i>domain</i>&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; SSH &#49324;&#50857;&#51088; &#50741;&#49496;&#51060; &#47924;&#49884;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>SSH &#49324;&#50857;&#51088; &#51064;&#51613;</dt>
<dd>
<p>&#51060; &#45432;&#46300; &#54840;&#49828;&#53944;&#50640; &#47196;&#44536;&#51064;&#54624; &#46412; SSH &#49324;&#50857;&#51088; &#51064;&#51613; &#48169;&#49885;&#51012; &#51648;&#51221;&#54616;&#45716; &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#51077;&#45768;&#45796;. &#44032;&#45733;&#54620; &#51064;&#51613; &#48169;&#48277;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#53412; &#54028;&#51068;</dt>
<dd>
<p>SSH &#49324;&#50857;&#51088;&#44032; SSH &#51204;&#50857; &#53412; &#54028;&#51068;&#51012; &#53685;&#54644; &#51064;&#51613;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54620; &#44221;&#50864;&#50640;&#45716; [&#53412; &#54028;&#51068;] &#54596;&#46300;&#50640; &#54028;&#51068;&#51032; &#51208;&#45824; &#44221;&#47196;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#48708;&#48128;&#48264;&#54840;</dt>
<dd>
<p>SSH &#49324;&#50857;&#51088;&#44032; DAS &#44396;&#49457;&#50640; &#51200;&#51109;&#46108; &#48708;&#48128;&#48264;&#54840;&#47484; &#53685;&#54644; &#51064;&#51613;&#46121;&#45768;&#45796;.</p>

<hr>
<p><b>&#51452;&#51032;:</b></p>
&#51060; &#48708;&#48128;&#48264;&#54840;&#45716; DAS &#44396;&#49457;&#50640; &#51068;&#48152; &#53581;&#49828;&#53944;&#47196; &#51200;&#51109;&#46121;&#45768;&#45796;. &#48372;&#50504; &#54693;&#49345;&#51012; &#50948;&#54644; &#53412; &#54028;&#51068;&#51060;&#45208; &#48708;&#48128;&#48264;&#54840; &#48324;&#52845;&#51012; &#49324;&#50857;&#54616;&#49901;&#49884;&#50724;.
<hr>

<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; &#48708;&#48128;&#48264;&#54840;&#47484; &#51077;&#47141;&#54624; &#49688; &#51080;&#46020;&#47197; [SSH &#49324;&#50857;&#51088; &#48708;&#48128;&#48264;&#54840;] &#54596;&#46300;&#44032; &#54876;&#49457;&#54868;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#48708;&#48128;&#48264;&#54840; &#48324;&#52845;</dt>
<dd>
<p>SSH &#49324;&#50857;&#51088;&#44032; &#48708;&#48128;&#48264;&#54840; &#48324;&#52845;&#51012; &#53685;&#54644; &#51064;&#51613;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54620; &#44221;&#50864;&#50640;&#45716; [&#48708;&#48128;&#48264;&#54840; &#48324;&#52845;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#48708;&#48128;&#48264;&#54840; &#48324;&#52845;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</dd>
</dl>
</dd>
<dt>SSH &#49444;&#51221;</dt>
<dd>
<p>[&#49324;&#50857;] &#50741;&#49496;&#51012; &#49440;&#53469;&#54620; &#44221;&#50864; GlassFish Server&#50640;&#49436; &#45432;&#46300; &#54840;&#49828;&#53944;&#50640; SSH &#53412;&#47484; &#49444;&#51221;&#54633;&#45768;&#45796;.GlassFish Server&#50640;&#49436;&#45716; &#44592;&#51316; &#53412; &#54028;&#51068;&#51012; DAS &#54840;&#49828;&#53944;&#50640;&#49436; &#48373;&#49324;&#54616;&#44144;&#45208;, &#54596;&#50836;&#54620; &#44221;&#50864; &#54028;&#51068;&#51012; &#48373;&#49324;&#54616;&#44592; &#51204;&#50640; &#54028;&#51068;&#51012; &#49373;&#49457;&#54616;&#50668; SSH &#53412;&#47484; &#49373;&#49457;&#54633;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; [SSH &#49324;&#50857;&#51088; &#51064;&#51613;] &#50741;&#49496;&#51060; &#53412; &#54028;&#51068;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864;&#50640;&#47564; &#49324;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#53412; &#49373;&#49457;</dt>
<dd>
<p>[&#49324;&#50857;] &#50741;&#49496;&#51012; &#49440;&#53469;&#54620; &#44221;&#50864;, SSH &#53412; &#54028;&#51068;&#51060; &#50630;&#51004;&#47732; &#54028;&#51068;&#51012; &#45432;&#46300; &#54840;&#49828;&#53944;&#47196; &#48373;&#49324;&#54616;&#44592; &#51204;&#50640; GlassFish Server&#50640;&#49436; &#51060; &#54028;&#51068;&#51012; &#49373;&#49457;&#54633;&#45768;&#45796;. SSH &#53412; &#54028;&#51068;&#51060; &#51080;&#45716; &#44221;&#50864;&#50640;&#45716; [&#49324;&#50857;] &#50741;&#49496;&#51012; &#49440;&#53469;&#54644;&#46020; GlassFish Server&#50640;&#49436; &#51060; &#54028;&#51068;&#51012; &#49373;&#49457;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>

<hr>
<p><b>&#51452;:</b></p>
SSH &#53412; &#54028;&#51068;&#51060; &#50630;&#45716; &#44221;&#50864; [&#49324;&#50857;] &#50741;&#49496;&#51012; &#49440;&#53469;&#54644;&#50556; &#54633;&#45768;&#45796;. &#44536;&#47111;&#51648; &#50506;&#51012; &#44221;&#50864; &#48320;&#44221; &#49324;&#54637;&#51012; &#51200;&#51109;&#54616;&#47140;&#44256; &#54616;&#47732; &#50724;&#47448;&#44032; &#48156;&#49373;&#54633;&#45768;&#45796;.
<hr>

</dd>
<dt>SSH &#49324;&#50857;&#51088; &#48708;&#48128;&#48264;&#54840;</dt>
<dd>
<p>SSH &#49324;&#50857;&#51088;&#44032; &#51060; &#45432;&#46300; &#54840;&#49828;&#53944;&#50640; &#47196;&#44536;&#51064;&#54624; &#46412; &#49324;&#50857;&#54624; &#48708;&#48128;&#48264;&#54840;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#48708;&#48128;&#48264;&#54840; &#48324;&#52845;</dt>
<dd>
<p>&#51060; &#46020;&#47700;&#51064;&#50640; &#45824;&#54644; &#51221;&#51032;&#46108; &#48708;&#48128;&#48264;&#54840; &#48324;&#52845;&#51032; &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#44277;&#50857; &#53412; &#54028;&#51068;</dt>
<dd>
<p>SSH &#49324;&#50857;&#51088; &#51060;&#47492; &#50741;&#49496;&#50640; &#51648;&#51221;&#46108; &#49324;&#50857;&#51088;&#51032; SSH &#44277;&#50857; &#53412; &#54028;&#51068;&#50640; &#45824;&#54620; &#51208;&#45824; &#44221;&#47196;&#51077;&#45768;&#45796;. &#44277;&#50857; &#53412; &#54028;&#51068;&#51032; &#45236;&#50857;&#51060; &#45432;&#46300; &#54840;&#49828;&#53944;&#50640; &#51080;&#45716; &#49324;&#50857;&#51088;&#51032; <code>.ssh/authorized_keys</code> &#54028;&#51068;&#50640; &#52628;&#44032;&#46121;&#45768;&#45796;. &#54840;&#49828;&#53944;&#50640; <code>.ssh/authorized_keys</code> &#54028;&#51068;&#51060; &#50630;&#45716; &#44221;&#50864; GlassFish Server&#50640;&#49436; &#54644;&#45817; &#54028;&#51068;&#51012; &#49373;&#49457;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#53412; &#54028;&#51068;</dt>
<dd>
<p>&#49324;&#50857;&#51088; &#51060;&#47492; &#50741;&#49496;&#50640; &#51648;&#51221;&#46108; &#49324;&#50857;&#51088;&#51032; SSH &#51204;&#50857; &#53412; &#54028;&#51068;&#50640; &#45824;&#54620; &#51208;&#45824; &#44221;&#47196;&#51077;&#45768;&#45796;. &#51060; &#54028;&#51068;&#51008; &#45432;&#46300;&#51032; &#54840;&#49828;&#53944;&#50640;&#49436; <code>sshd</code> &#45936;&#47788;&#50640; &#45824;&#54620; &#51064;&#51613;&#50640; &#49324;&#50857;&#46121;&#45768;&#45796;.</p>

<hr>
<p><b>&#51452;:</b></p>
GlassFish Server&#50640;&#49436;&#45716; &#48708;&#48128;&#48264;&#54840; &#54028;&#51068;&#51032; <code>AS_ADMIN_SSHPASSWORD</code> &#54637;&#47785;&#51012; &#53685;&#54620; &#48708;&#48128;&#48264;&#54840; &#51064;&#51613;&#46020; &#51648;&#50896;&#54633;&#45768;&#45796;. &#48708;&#48128;&#48264;&#54840; &#54028;&#51068;&#51008; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00263"><code>asadmin</code>(1)</a> &#50976;&#54008;&#47532;&#54000;&#51032; <code>--paswordfile</code> &#50741;&#49496;&#50640; &#51648;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.
<hr>

<p>SSH &#51204;&#50857; &#53412; &#54028;&#51068;&#51060; &#47928;&#51109;&#50516;&#54840;&#47196; &#48372;&#54840;&#46104;&#45716; &#44221;&#50864; &#48708;&#48128;&#48264;&#54840; &#54028;&#51068;&#50640; <code>AS_ADMIN_SSHKEYPASSPHRASE</code> &#54637;&#47785;&#51060; &#54252;&#54632;&#46104;&#50612;&#50556; &#54633;&#45768;&#45796;.</p>
<p>&#53412; &#54028;&#51068; &#44221;&#47196;&#45716; DAS&#50640;&#49436; &#50529;&#49464;&#49828;&#54624; &#49688; &#51080;&#50612;&#50556; &#54616;&#47728; &#53412; &#54028;&#51068;&#51008; DAS&#50640;&#49436; &#51069;&#51012; &#49688; &#51080;&#50612;&#50556; &#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; &#45432;&#46300; &#50976;&#54805;&#51012; CONFIG&#50640;&#49436; SSH&#47196; &#48320;&#44221;&#54616;&#50668; &#45432;&#46300;&#50640; &#45824;&#54644; SSH &#53685;&#49888;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54624;&#51648;&#50640; &#46384;&#46972; &#45796;&#47493;&#45768;&#45796;.</p>
<p>&#45432;&#46300; &#50976;&#54805;&#51012; CONFIG&#50640;&#49436; SSH&#47196; &#48320;&#44221;&#54616;&#44256; &#51060; &#54596;&#46300;&#47484; &#48708;&#50892; &#46160;&#47732; &#53412; &#54028;&#51068; &#50741;&#49496;&#51060; &#49324;&#50857;&#51088;&#51032; <code>.ssh</code> &#46356;&#47113;&#53664;&#47532;&#50640; &#51080;&#45716; &#53412; &#54028;&#51068;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;. &#53412; &#54028;&#51068;&#51060; &#50668;&#47084; &#44060; &#51080;&#51012; &#44221;&#50864; GlassFish Server&#50640;&#49436;&#45716; &#45796;&#51020; &#50864;&#49440;&#49692;&#50948;&#47196; &#49324;&#50857;&#54633;&#45768;&#45796;.</p>
<ol>
<li>
<p><code>id_rsa</code></p>
</li>
<li>
<p><code>id_dsa</code></p>
</li>
<li>
<p><code>identity</code></p>
</li>
</ol>
</dd>
</dl>
<a id="sthref317" name="sthref317"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<p><a href="task-editnode.html">&#45432;&#46300;&#47484; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
<a id="sthref318" name="sthref318"></a>
<h5>&#46041;&#51068;&#54620; asadmin &#54616;&#50948; &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00255"><code>update-node-config</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM789"><code>update-node-dcom</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00256"><code>update-node-ssh</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
