<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterinstanceproperties" name="ref-clusterinstanceproperties"></a><a id="GHCLU00011" name="GHCLU00011"></a></p>

<h4><a id="sthref288" name="sthref288"></a><a id="sthref289" name="sthref289"></a><a id="sthref290" name="sthref290"></a>&#51064;&#49828;&#53556;&#49828; &#49549;&#49457;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#51064;&#49828;&#53556;&#49828; &#49549;&#49457;] &#54168;&#51060;&#51648;&#50640;&#45716; &#54788;&#51116; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54644; &#49444;&#51221;&#46108; &#49549;&#49457; &#47785;&#47197;&#51060; &#54364;&#49884;&#46121;&#45768;&#45796;. &#51060;&#47084;&#54620; &#49549;&#49457;&#51008; &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54620; &#49440;&#53469;&#51201; &#44396;&#49457; &#51221;&#48372;&#47484; &#52628;&#44032;&#54633;&#45768;&#45796;.</p>
<p>[&#51064;&#49828;&#53556;&#49828; &#51060;&#47492;] &#54596;&#46300;&#45716; &#54788;&#51116; &#51064;&#49828;&#53556;&#49828;&#51032; &#51060;&#47492;&#51012; &#54364;&#49884;&#54616;&#45716; &#51069;&#44592; &#51204;&#50857; &#54596;&#46300;&#51077;&#45768;&#45796;.</p>
<p>&#44033; &#49549;&#49457;&#50640; &#45824;&#54644; &#54364;&#49884;&#46104;&#45716; &#51221;&#48372;&#45716; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#51060;&#47492;</dt>
<dd>
<p>&#49549;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#44050;</dt>
<dd>
<p>&#49440;&#53469;&#46108; &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54644; &#49444;&#51221;&#46108; &#49549;&#49457;&#51032; &#44050;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49444;&#47749;</dt>
<dd>
<p>&#49549;&#49457;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#51221;&#48372;&#47484; &#51228;&#44277;&#54616;&#45716; &#53581;&#49828;&#53944; &#49444;&#47749;&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
<p>&#52628;&#44032; &#49549;&#49457; &#53580;&#51060;&#48660;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#46020; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#49549;&#49457; &#52628;&#44032;</dt>
<dd>
<p>&#49549;&#49457;&#51012; &#52628;&#44032;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#51060; &#45800;&#52628;&#47484; &#45572;&#47476;&#47732; &#52628;&#44032; &#49549;&#49457; &#53580;&#51060;&#48660;&#50640; &#54665;&#51060; &#52628;&#44032;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#49549;&#49457; &#49325;&#51228;</dt>
<dd>
<p>&#49440;&#53469;&#54620; &#49549;&#49457;&#51012; &#54616;&#45208; &#51060;&#49345; &#49325;&#51228;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#49325;&#51228;&#46108; &#49549;&#49457;&#51008; &#54644;&#45817; &#44592;&#48376;&#44050;&#51004;&#47196; &#46104;&#46028;&#47140;&#51648;&#44144;&#45208; &#44592;&#48376;&#44050;&#51060; &#49444;&#51221;&#46104;&#50612; &#51080;&#51648; &#50506;&#51008; &#44221;&#50864; &#51221;&#51032;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
</dl>
<p>GlassFish Server&#50640; &#51221;&#51032;&#46108; &#51064;&#49828;&#53556;&#49828; &#49549;&#49457;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt><code>rendezvousOccurred</code></dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#44032; DAS(&#46020;&#47700;&#51064; &#44288;&#47532; &#49436;&#48260;)&#50640; &#50529;&#49464;&#49828;&#54664;&#45716;&#51648; &#50668;&#48512;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;. &#44032;&#45733;&#54620; &#44050;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt><code>true</code></dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#44032; DAS&#50640; &#50529;&#49464;&#49828;&#54664;&#49845;&#45768;&#45796;.</p>
</dd>
<dt><code>false</code></dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#44032; DAS&#50640; &#50529;&#49464;&#49828;&#54616;&#51648; <i>&#50506;&#50520;&#49845;&#45768;&#45796;</i>.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref291" name="sthref291"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<p><a href="task-set-props-clustered-instance.html">&#53364;&#47084;&#49828;&#53552;&#46108; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54620; &#51064;&#49828;&#53556;&#49828; &#51204;&#50857; &#49549;&#49457;&#51012; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
<a id="sthref292" name="sthref292"></a>
<h5>&#46041;&#51068;&#54620; asadmin &#54616;&#50948; &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00139"><code>get</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00145"><code>list</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00226"><code>set</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
