<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterinstanceconfigproperties" name="ref-clusterinstanceconfigproperties"></a><a id="GHCLU00010" name="GHCLU00010"></a></p>

<h4><a id="sthref283" name="sthref283"></a><a id="sthref284" name="sthref284"></a><a id="sthref285" name="sthref285"></a>&#51064;&#49828;&#53556;&#49828; &#49884;&#49828;&#53596; &#49549;&#49457;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#51064;&#49828;&#53556;&#49828; &#49884;&#49828;&#53596; &#49549;&#49457;] &#54168;&#51060;&#51648;&#50640;&#45716; &#54788;&#51116; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54644; &#49444;&#51221;&#46108; Java &#49884;&#49828;&#53596; &#49549;&#49457; &#47785;&#47197;&#51060; &#54364;&#49884;&#46121;&#45768;&#45796;. Java &#49884;&#49828;&#53596; &#49549;&#49457;&#51008; GlassFish Server &#49884;&#51089; &#49884; Java &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#49892;&#54665;&#44592;&#51032; <code>-D</code> &#50741;&#49496;&#51012; &#53685;&#54644; Java &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#49892;&#54665;&#44592;&#47196; &#51204;&#45804;&#46121;&#45768;&#45796;.</p>
<p>&#51060;&#47084;&#54620; &#49549;&#49457;&#51008; &#51064;&#49828;&#53556;&#49828; &#44396;&#49457;&#51032; &#54252;&#53944; &#49444;&#51221;&#50640; &#45824;&#54620; &#49549;&#49457; &#51221;&#51032;&#47484; &#47924;&#49884;&#54633;&#45768;&#45796;. &#50696;&#47484; &#46308;&#50612; &#46160; &#44060;&#51032; &#53364;&#47084;&#49828;&#53552;&#46108; &#51064;&#49828;&#53556;&#49828;&#44032; &#46041;&#51068;&#54620; &#54840;&#49828;&#53944;&#50640; &#51080;&#45716; &#44221;&#50864; &#49324;&#51204; &#51221;&#51032;&#46108; &#54252;&#53944; &#49444;&#51221;&#51012; &#47924;&#49884;&#54644;&#50556; &#54633;&#45768;&#45796;. &#51060;&#47088; &#44221;&#50864; &#46160; &#51064;&#49828;&#53556;&#49828;&#50640;&#49436; &#46041;&#51068;&#54620; &#44396;&#49457;&#51012; &#44277;&#50976;&#54616;&#48064;&#47196; &#54620; &#51064;&#49828;&#53556;&#49828;&#51032; &#54252;&#53944; &#49444;&#51221;&#51012; &#47924;&#49884;&#54644;&#50556; &#54633;&#45768;&#45796;.</p>
<p>&#44396;&#49457;&#51032; &#49324;&#51204; &#51221;&#51032;&#46108; &#54252;&#53944; &#49444;&#51221;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="../../../common/en/help/ref-predefinedconfigsysproperties.html">&#48120;&#47532; &#51221;&#51032;&#46108; &#44396;&#49457; &#49884;&#49828;&#53596; &#49549;&#49457;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
<p>[&#51064;&#49828;&#53556;&#49828; &#51060;&#47492;] &#54596;&#46300;&#45716; &#54788;&#51116; &#51064;&#49828;&#53556;&#49828;&#51032; &#51060;&#47492;&#51012; &#54364;&#49884;&#54616;&#45716; &#51069;&#44592; &#51204;&#50857; &#54596;&#46300;&#51077;&#45768;&#45796;.</p>
<p>&#44033; &#49549;&#49457;&#50640; &#45824;&#54644; &#54364;&#49884;&#46104;&#45716; &#51221;&#48372;&#45716; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#51064;&#49828;&#53556;&#49828; &#48320;&#49688; &#51060;&#47492;</dt>
<dd>
<p>&#49884;&#49828;&#53596; &#49549;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#54788;&#51116; &#44050;</dt>
<dd>
<p>&#54788;&#51116; &#49549;&#49457;&#50640; &#45824;&#54644; &#49444;&#51221;&#46108; &#44050;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#45824;&#52404; &#44050;</dt>
<dd>
<p>&#48320;&#44221; &#49324;&#54637;&#51060; &#51200;&#51109;&#46104;&#47732; &#49549;&#49457;&#50640; &#49444;&#51221;&#46104;&#45716; &#44050;&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
<p>&#52628;&#44032; &#49549;&#49457; &#53580;&#51060;&#48660;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#46020; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#49549;&#49457; &#52628;&#44032;</dt>
<dd>
<p>&#49549;&#49457;&#51012; &#52628;&#44032;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#51060; &#45800;&#52628;&#47484; &#45572;&#47476;&#47732; &#52628;&#44032; &#49549;&#49457; &#53580;&#51060;&#48660;&#50640; &#54665;&#51060; &#52628;&#44032;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#49549;&#49457; &#49325;&#51228;</dt>
<dd>
<p>&#49440;&#53469;&#54620; &#49549;&#49457;&#51012; &#54616;&#45208; &#51060;&#49345; &#49325;&#51228;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#49325;&#51228;&#46108; &#49549;&#49457;&#51008; &#54644;&#45817; &#44592;&#48376;&#44050;&#51004;&#47196; &#46104;&#46028;&#47140;&#51648;&#44144;&#45208; &#44592;&#48376;&#44050;&#51060; &#49444;&#51221;&#46104;&#50612; &#51080;&#51648; &#50506;&#51008; &#44221;&#50864; &#51221;&#51032;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref286" name="sthref286"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-change-clustered-instance-ports.html">&#53364;&#47084;&#49828;&#53552;&#46108; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#51032; &#54252;&#53944; &#48264;&#54840;&#47484; &#49688;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-config-sys-properties-defaults.html">&#44396;&#49457; &#49884;&#49828;&#53596; &#49549;&#49457;&#51032; &#44592;&#48376;&#44050;&#51012; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref287" name="sthref287"></a>
<h5>&#46041;&#51068;&#54620; asadmin &#54616;&#50948; &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00059"><code>create-system-properties</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00110"><code>delete-system-property</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00203"><code>list-system-properties</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
