<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterproperties" name="ref-clusterproperties"></a></p>

<h4><a id="sthref300" name="sthref300"></a><a id="sthref301" name="sthref301"></a>&#53364;&#47084;&#49828;&#53552; &#49549;&#49457;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#53364;&#47084;&#49828;&#53552; &#49549;&#49457;] &#54168;&#51060;&#51648;&#50640;&#45716; &#49440;&#53469;&#46108; &#53364;&#47084;&#49828;&#53552;&#50640; &#45824;&#54644; &#49444;&#51221;&#46108; &#49549;&#49457; &#47785;&#47197;&#51060; &#54364;&#49884;&#46121;&#45768;&#45796;. &#51060;&#47084;&#54620; &#49549;&#49457;&#51008; &#53364;&#47084;&#49828;&#53552;&#50640; &#45824;&#54620; &#49440;&#53469;&#51201; &#44396;&#49457; &#51221;&#48372;&#47484; &#52628;&#44032;&#54633;&#45768;&#45796;.</p>
<p>[&#53364;&#47084;&#49828;&#53552; &#51060;&#47492;] &#54596;&#46300;&#45716; &#49440;&#53469;&#54620; &#53364;&#47084;&#49828;&#53552;&#51032; &#51060;&#47492;&#51012; &#54364;&#49884;&#54616;&#45716; &#51069;&#44592; &#51204;&#50857; &#54596;&#46300;&#51077;&#45768;&#45796;.</p>
<p>&#44033; &#49549;&#49457;&#50640; &#45824;&#54644; &#54364;&#49884;&#46104;&#45716; &#51221;&#48372;&#45716; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#51060;&#47492;</dt>
<dd>
<p>&#49549;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#44050;</dt>
<dd>
<p>&#49440;&#53469;&#46108; &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54644; &#49444;&#51221;&#46108; &#49549;&#49457;&#51032; &#44050;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49444;&#47749;</dt>
<dd>
<p>&#49549;&#49457;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#51221;&#48372;&#47484; &#51228;&#44277;&#54616;&#45716; &#53581;&#49828;&#53944; &#49444;&#47749;&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
<p>&#52628;&#44032; &#49549;&#49457; &#53580;&#51060;&#48660;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#46020; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#49549;&#49457; &#52628;&#44032;</dt>
<dd>
<p>&#49549;&#49457;&#51012; &#52628;&#44032;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#51060; &#45800;&#52628;&#47484; &#45572;&#47476;&#47732; &#52628;&#44032; &#49549;&#49457; &#53580;&#51060;&#48660;&#50640; &#54665;&#51060; &#52628;&#44032;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#49549;&#49457; &#49325;&#51228;</dt>
<dd>
<p>&#49440;&#53469;&#54620; &#49549;&#49457;&#51012; &#54616;&#45208; &#51060;&#49345; &#49325;&#51228;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#49325;&#51228;&#46108; &#49549;&#49457;&#51008; &#54644;&#45817; &#44592;&#48376;&#44050;&#51004;&#47196; &#46104;&#46028;&#47140;&#51648;&#44144;&#45208; &#44592;&#48376;&#44050;&#51060; &#49444;&#51221;&#46104;&#50612; &#51080;&#51648; &#50506;&#51008; &#44221;&#50864; &#51221;&#51032;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
</dl>
<p>GlassFish Server&#50640; &#51221;&#51032;&#46108; &#53364;&#47084;&#49828;&#53552; &#49549;&#49457;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt><code>GMS_DISCOVERY_URI_LIST</code></dt>
<dd>
<p>&#53364;&#47084;&#49828;&#53552; &#44160;&#49353;&#50640; &#49324;&#50857;&#54624; &#53364;&#47084;&#49828;&#53552; &#45236; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#51032; &#50948;&#52824;&#51077;&#45768;&#45796;. &#51060; &#49549;&#49457;&#51008; GMS(&#44536;&#47353; &#44288;&#47532; &#49436;&#48708;&#49828;)&#44032; &#47700;&#49884;&#51648; &#48652;&#47196;&#46300;&#52880;&#49828;&#54021;&#50640; &#47680;&#54000;&#52880;&#49828;&#53944;&#47484; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#44221;&#50864;&#50640;&#47564; &#54596;&#50836;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#49549;&#49457;&#51032; &#51201;&#54633;&#54620; &#44050;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#49788;&#54364;&#47196; &#44396;&#48516;&#46108; URI(Uniform Resource Identifier)&#51032; &#47785;&#47197;. &#44033; URI&#45716; GlassFish Server &#51064;&#49828;&#53556;&#49828; &#46608;&#45716; DAS&#47484; &#44032;&#47532;&#53020;&#50556; &#54633;&#45768;&#45796;. &#51060; &#54805;&#49885;&#51008; &#50668;&#47084; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#44032; &#46041;&#51068;&#54620; &#54840;&#49828;&#53944;&#50640;&#49436; &#49892;&#54665; &#51473;&#51064; &#44221;&#50864; &#54596;&#50836;&#54633;&#45768;&#45796;.</p>
<p>&#47785;&#47197;&#50640; &#51080;&#45716; &#44033; URI&#51032; &#54805;&#49885;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<p><i>scheme</i><code>://</code><i>host-name-or -IP-address</i><code>:</code><i>port</i></p>
<ul>
<li>
<p><i>scheme</i>&#51008; URI &#52404;&#44228;(<code>tcp</code>)&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p><i>host-name-or -IP-address</i>&#45716; &#51064;&#49828;&#53556;&#49828;&#44032; &#49892;&#54665; &#51473;&#51064; &#54840;&#49828;&#53944;&#51032; &#54840;&#49828;&#53944; &#51060;&#47492; &#46608;&#45716; IP &#51452;&#49548;&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p><i>port</i>&#45716; &#51064;&#49828;&#53556;&#49828;&#44032; GMS&#51032; &#47700;&#49884;&#51648;&#47484; &#49688;&#49888;&#54616;&#45716; &#54252;&#53944;&#51032; &#54252;&#53944; &#48264;&#54840;&#51077;&#45768;&#45796;. &#49884;&#49828;&#53596; &#49549;&#49457; <code>GMS_LISTENER_PORT-</code><i>clustername</i>&#51012; &#51064;&#49828;&#53556;&#49828;&#50640; &#49444;&#51221;&#54644;&#50556; &#54633;&#45768;&#45796;. &#51060; &#49884;&#49828;&#53596; &#49549;&#49457;&#51012; &#51064;&#49828;&#53556;&#49828;&#50640; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;&#51008; <i>Oracle GlassFish Server High Availability Administration Guide</i>&#51032; "<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSHAG00373">Discovering a Cluster When Multicast Transport Is Unavailable</a>"&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</li>
</ul>
</li>
<li>
<p>DAS &#46608;&#45716; &#51064;&#49828;&#53556;&#49828;&#44032; &#49892;&#54665; &#51473;&#51064; &#49788;&#54364;&#47196; &#44396;&#48516;&#46108; IP &#51452;&#49548; &#46608;&#45716; &#54840;&#49828;&#53944; &#51060;&#47492;&#51032; &#47785;&#47197;&#51077;&#45768;&#45796;. IP &#51452;&#49548;&#50752; &#54840;&#49828;&#53944; &#51060;&#47492;&#51032; &#54844;&#54633; &#47785;&#47197;&#51012; &#54252;&#54632;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#54805;&#49885;&#51008; &#54616;&#45208;&#51032; &#53364;&#47084;&#49828;&#53552;&#46108; &#51064;&#49828;&#53556;&#49828;&#44032; &#44033; &#54840;&#49828;&#53944;&#50640;&#49436; &#49892;&#54665; &#51473;&#51064; &#44221;&#50864;&#50640;&#47564; &#49324;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. <code>GMS_LISTENER_PORT</code> &#49549;&#49457;&#44050;&#51008; &#46020;&#47700;&#51064;&#51032; &#44033; &#53364;&#47084;&#49828;&#53552;&#50640; &#45824;&#54644; &#44256;&#50976;&#54644;&#50556; &#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#53412;&#50892;&#46300; <code>generate</code>. &#51060; &#54805;&#49885;&#51008; &#53364;&#47084;&#49828;&#53552;&#51032; &#54620; &#51064;&#49828;&#53556;&#49828;&#44032; &#44033; &#54840;&#49828;&#53944;&#50640;&#49436; &#49892;&#54665; &#51473;&#51060;&#44256; DAS&#44032; &#44060;&#48324; &#54840;&#49828;&#53944;&#50640;&#49436; &#49892;&#54665; &#51473;&#51064; &#44221;&#50864;&#50640;&#47564; &#49324;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#46041;&#51068;&#54620; &#54840;&#49828;&#53944;&#51032; &#48373;&#49688; &#51064;&#49828;&#53556;&#49828;&#44032; &#46041;&#51068;&#54620; &#53364;&#47084;&#49828;&#53552;&#51032; &#47716;&#48260;&#51068; &#49688; &#50630;&#49845;&#45768;&#45796;. <code>GMS_LISTENER_PORT</code> &#49549;&#49457;&#44050;&#51008; &#46020;&#47700;&#51064;&#51032; &#44033; &#53364;&#47084;&#49828;&#53552;&#50640; &#45824;&#54644; &#44256;&#50976;&#54644;&#50556; &#54633;&#45768;&#45796;.</p>
</li>
</ul>
</dd>
<dt><code>GMS_LISTENER_PORT</code></dt>
<dd>
<p>&#53364;&#47084;&#49828;&#53552;&#44032; GMS&#51032; &#47700;&#49884;&#51648;&#47484; &#49688;&#49888;&#54616;&#45716; &#54252;&#53944;&#51032; &#54252;&#53944; &#48264;&#54840;&#51077;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; <code>GMS_LISTENER_PORT-</code><i>cluster-name</i> &#49884;&#49828;&#53596; &#49549;&#49457;&#50640; &#45824;&#54620; &#52280;&#51312;&#51077;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; &#51060; &#49884;&#49828;&#53596; &#49549;&#49457;&#51008; &#49444;&#51221;&#46104;&#50612; &#51080;&#51648; &#50506;&#49845;&#45768;&#45796;. &#51060; &#44221;&#50864; GMS&#44032; <code>GMS_TCPSTARTPORT</code> &#48143; <code>GMS_TCPENDPORT</code> &#49549;&#49457;&#51004;&#47196; &#51221;&#51032;&#46108; &#48276;&#50948;&#50640;&#49436; &#49324;&#50857; &#44032;&#45733;&#54620; &#54252;&#53944;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; &#51060; &#48276;&#50948;&#45716; 9090-9200&#51077;&#45768;&#45796;. &#45824;&#48512;&#48516;&#51032; &#44221;&#50864; &#44592;&#48376; &#46041;&#51089;&#51004;&#47196;&#46020; &#52649;&#48516;&#54633;&#45768;&#45796;.</p>
<p>&#44536;&#47084;&#45208; GMS&#44032; &#47700;&#49884;&#51648; &#48652;&#47196;&#46300;&#52880;&#49828;&#54021;&#50640; &#47680;&#54000;&#52880;&#49828;&#53944;&#47484; &#49324;&#50857;&#54616;&#51648; <b>&#50506;&#45716;</b> &#44221;&#50864; &#51060; &#49549;&#49457;&#51060; &#53364;&#47084;&#49828;&#53552;&#51032; &#47784;&#46304; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640; &#51201;&#54633;&#54620; &#54252;&#53944; &#48264;&#54840;&#47484; &#51648;&#51221;&#54644;&#50556; &#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51004;&#47196; &#51060; &#50836;&#44396; &#49324;&#54637;&#51012; &#52649;&#51313;&#54616;&#47140;&#47732; &#44033; &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54620; &#54252;&#53944; &#48264;&#54840;&#47484; &#44060;&#48324;&#51201;&#51004;&#47196; &#49444;&#51221;&#54616;&#45716; &#49884;&#49828;&#53596; &#49549;&#49457;&#51012; &#49324;&#50857;&#54633;&#45768;&#45796;.</p>
<p>&#50696;&#47484; &#46308;&#50612; <a href="ref-clustersystemproperties.html">&#53364;&#47084;&#49828;&#53552; &#49884;&#49828;&#53596; &#49549;&#49457;</a> &#54168;&#51060;&#51648;&#50640;&#49436; DAS&#50640; &#45824;&#54620; &#49884;&#49828;&#53596; &#49549;&#49457; <code>GMS_LISTENER_PORT-</code><i>cluster-name</i>&#51012; &#49373;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#44536;&#47088; &#45796;&#51020;, &#53364;&#47084;&#49828;&#53552;&#51032; &#44033; &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54644; <code>GMS_LISTENER_PORT-</code><i>cluster-name</i> &#49884;&#49828;&#53596; &#49549;&#49457;&#51012; &#51064;&#49828;&#53556;&#49828;&#44032; GMS&#51032; &#47700;&#49884;&#51648;&#47484; &#49688;&#49888;&#54616;&#45716; &#54252;&#53944; &#48264;&#54840;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;. &#53364;&#47084;&#49828;&#53552;&#50640;&#49436; <code>GMS_LISTENER_PORT</code> &#49549;&#49457;&#51032; &#44592;&#48376;&#44050;&#51060; &#51060; &#49884;&#49828;&#53596; &#49549;&#49457;&#51012; &#52280;&#51312;&#54633;&#45768;&#45796;.</p>
</dd>
<dt><code>GMS_LOOPBACK</code></dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#44032; &#54644;&#45817; &#51064;&#49828;&#53556;&#49828;&#44032; &#53364;&#47084;&#49828;&#53552;&#50640; &#48652;&#47196;&#46300;&#52880;&#49828;&#53944;&#54616;&#45716; &#51088;&#52404; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#47112;&#48296; &#47700;&#49884;&#51648;&#47484; &#49688;&#49888;&#54624; &#49688; &#51080;&#45716;&#51648; &#50668;&#48512;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#44032;&#45733;&#54620; &#44050;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt><code>false</code></dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#44032; &#51088;&#52404; &#47700;&#49884;&#51648;&#47484; &#49688;&#49888;&#54624; &#49688; <i>&#50630;&#49845;&#45768;&#45796;</i>(&#44592;&#48376;&#44050;).</p>
</dd>
<dt><code>true</code></dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#44032; &#51088;&#52404; &#47700;&#49884;&#51648;&#47484; &#49688;&#49888;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51064;&#49828;&#53556;&#49828;&#44032; &#53364;&#47084;&#49828;&#53552;&#51032; &#50976;&#51068;&#54620; &#51064;&#49828;&#53556;&#49828;&#51068; &#44221;&#50864; &#51064;&#49828;&#53556;&#49828; &#53580;&#49828;&#53944;&#50640; &#51060; &#49444;&#51221;&#51012; &#49324;&#50857;&#54633;&#45768;&#45796;.</p>
</dd>
</dl>
</dd>
<dt><code>GMS_MULTICAST_TIME_TO_LIVE</code></dt>
<dd>
<p>&#47700;&#49884;&#51648;&#44032; &#47924;&#49884;&#46104;&#44592; &#51204;&#50640; &#45796;&#51020; &#51060;&#48292;&#53944; &#50976;&#54805;&#50640; &#45824;&#54620; &#47680;&#54000;&#52880;&#49828;&#53944; &#47700;&#49884;&#51648;&#50640; &#48156;&#49373;&#54624; &#49688; &#51080;&#45716; &#52572;&#45824; &#48152;&#48373; &#46608;&#45716; &#51204;&#49569; &#54943;&#49688;&#51077;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#44536;&#47353; &#44160;&#49353;</p>
</li>
<li>
<p>&#47716;&#48260; &#54616;&#53944;&#48708;&#53944;</p>
</li>
<li>
<p>&#47716;&#48260;&#49789; &#48320;&#44221;</p>
</li>
</ul>
<p>DAS &#48143; &#53364;&#47084;&#49828;&#53552;&#46108; &#51064;&#49828;&#53556;&#49828;&#44032; &#48176;&#52824;&#46108; &#45348;&#53944;&#50892;&#53356;&#51032; &#44396;&#49457;&#51012; &#51068;&#52824;&#49884;&#53412;&#47140;&#47732; &#51060; &#44050;&#51012; &#44032;&#45733;&#54620; &#54620; &#45230;&#44172; &#49444;&#51221;&#54633;&#45768;&#45796;. &#49884;&#49828;&#53596;&#51032; &#49324;&#50857; &#44032;&#45733;&#54620; &#52572;&#51200;&#44050;&#51012; &#54869;&#51064;&#54616;&#47140;&#47732; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00259"><code>validate-multicast</code>(1)</a> &#54616;&#50948; &#47749;&#47161;&#51012; &#49324;&#50857;&#54633;&#45768;&#45796;.</p>
<p>0 &#44050;&#51008; &#47680;&#54000;&#52880;&#49828;&#53944; &#47700;&#49884;&#51648;&#44032; &#54644;&#45817; &#47680;&#54000;&#52880;&#49828;&#53944; &#47700;&#49884;&#51648;&#44032; &#48652;&#47196;&#46300;&#52880;&#49828;&#53944;&#46104;&#45716; &#54840;&#49828;&#53944;&#47484; &#51208;&#45824; &#46496;&#45208;&#51648; &#50506;&#46020;&#47197; &#54633;&#45768;&#45796;.</p>
<p>1 &#44050;&#51008; &#49828;&#50948;&#52824; &#46608;&#45716; &#46972;&#50864;&#53552;&#47196; &#51217;&#49549;&#46108; &#46041;&#51068;&#54620; &#49436;&#48652;&#45367;&#50640; &#51080;&#45716; &#54840;&#49828;&#53944; &#44036;&#50640; &#47700;&#49884;&#51648;&#44032; &#48652;&#47196;&#46300;&#52880;&#49828;&#53944;&#46104;&#51648; &#50506;&#46020;&#47197; &#47561;&#51012; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050; 4&#45716; &#54840;&#49828;&#53944;&#44032; &#49828;&#50948;&#52824; &#46608;&#45716; &#46972;&#50864;&#53552;&#47196; &#51217;&#49549;&#46108; &#45348;&#53944;&#50892;&#53356;&#50640; &#51080;&#45716; &#47784;&#46304; &#53364;&#47084;&#49828;&#53552; &#47716;&#48260;&#50640; &#47700;&#49884;&#51648;&#44032; &#49457;&#44277;&#51201;&#51004;&#47196; &#48652;&#47196;&#46300;&#52880;&#49828;&#53944;&#46104;&#46020;&#47197; &#54633;&#45768;&#45796;.</p>
</dd>
<dt><code>GMS_TCPENDPORT</code></dt>
<dd>
<p><code>GMS_LISTENER_PORT-</code><i>cluster-name</i> &#49884;&#49828;&#53596; &#49549;&#49457;&#51060; &#49444;&#51221;&#46104;&#51648; &#50506;&#51008; &#44221;&#50864; GMS&#44032; &#49324;&#50857; &#44032;&#45733;&#54620; &#54252;&#53944;&#47484; &#49440;&#53469;&#54616;&#45716; &#48276;&#50948;&#50640;&#49436; &#44032;&#51109; &#45458;&#51008; &#54252;&#53944; &#48264;&#54840;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 9200&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>GMS_TCPSTARTPORT</code></dt>
<dd>
<p><code>GMS_LISTENER_PORT-</code><i>cluster-name</i> &#49884;&#49828;&#53596; &#49549;&#49457;&#51060; &#49444;&#51221;&#46104;&#51648; &#50506;&#51008; &#44221;&#50864; GMS&#44032; &#49324;&#50857; &#44032;&#45733;&#54620; &#54252;&#53944;&#47484; &#49440;&#53469;&#54616;&#45716; &#48276;&#50948;&#50640;&#49436; &#44032;&#51109; &#45230;&#51008; &#54252;&#53944; &#48264;&#54840;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 9090&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref302" name="sthref302"></a>
<h5>&#46041;&#51068;&#54620; asadmin &#54616;&#50948; &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00139"><code>get</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00145"><code>list</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00226"><code>set</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
