<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clustergeneral" name="ref-clustergeneral"></a><a id="GHCLU00003" name="GHCLU00003"></a></p>

<h4><a id="sthref251" name="sthref251"></a><a id="sthref252" name="sthref252"></a><a id="sthref253" name="sthref253"></a><a id="sthref254" name="sthref254"></a>&#51068;&#48152; &#51221;&#48372;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#51068;&#48152; &#51221;&#48372;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#53364;&#47084;&#49828;&#53552; &#49884;&#51089;</dt>
<dd>
<p>&#53364;&#47084;&#49828;&#53552;&#47484; &#49884;&#51089;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#53364;&#47084;&#49828;&#53552;&#50640; &#51080;&#45716; &#47784;&#46304; &#51064;&#49828;&#53556;&#49828;&#44032; &#49892;&#54665; &#51473;&#51064; &#44221;&#50864; &#51060; &#45800;&#52628;&#44032; &#48708;&#54876;&#49457;&#54868;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#53364;&#47084;&#49828;&#53552; &#51221;&#51648;</dt>
<dd>
<p>&#53364;&#47084;&#49828;&#53552;&#47484; &#51221;&#51648;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#53364;&#47084;&#49828;&#53552;&#50640; &#51080;&#45716; &#47784;&#46304; &#51064;&#49828;&#53556;&#49828;&#44032; &#51221;&#51648;&#46108; &#44221;&#50864; &#51060; &#45800;&#52628;&#44032; &#48708;&#54876;&#49457;&#54868;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>EJB &#53440;&#51060;&#47672; &#47560;&#51060;&#44536;&#47112;&#51060;&#49496;</dt>
<dd>
<p>&#51221;&#51648;&#46108; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640;&#49436; &#53364;&#47084;&#49828;&#53552;&#51032; &#49892;&#54665; &#51473;&#51064; &#51064;&#49828;&#53556;&#49828;&#47196; EJB(Enterprise JavaBeans) &#44592;&#49696; &#53440;&#51060;&#47672;&#47484; &#47560;&#51060;&#44536;&#47112;&#51060;&#49496;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#51060; &#45800;&#52628;&#47484; &#45572;&#47476;&#47732; <a href="ref-migrateejbtimers.html">EJB &#53440;&#51060;&#47672; &#47560;&#51060;&#44536;&#47112;&#51060;&#49496;</a> &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;. &#53364;&#47084;&#49828;&#53552;&#50640; &#51080;&#45716; &#47784;&#46304; &#51064;&#49828;&#53556;&#49828;&#44032; &#49892;&#54665; &#51473;&#51064; &#44221;&#50864; &#51060; &#45800;&#52628;&#44032; &#48708;&#54876;&#49457;&#54868;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#47196;&#44536; &#44368;&#52404;</dt>
<dd>
<p>&#53364;&#47084;&#49828;&#53552;&#50640; &#45824;&#54620; &#47196;&#44536; &#54028;&#51068;&#51012; &#44368;&#52404;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#47196;&#44536; &#54028;&#51068;&#51060; &#44368;&#52404;&#46104;&#47732; &#54028;&#51068;&#51060; <code>server.log_</code><i>date-and-time</i> &#54805;&#49885;&#51032; &#49884;&#44036; &#44592;&#47197; &#51060;&#47492;&#51060; &#54252;&#54632;&#46108; &#51060;&#47492;&#51004;&#47196; &#48148;&#45068;&#44256; &#49352; &#47196;&#44536; &#47700;&#49884;&#51648;&#50640; &#45824;&#54620; &#48712; &#47196;&#44536; &#54028;&#51068;&#51060; &#49373;&#49457;&#46121;&#45768;&#45796;. &#48320;&#44221; &#49324;&#54637;&#51060; &#46041;&#51201;&#51004;&#47196; &#51201;&#50857;&#46121;&#45768;&#45796;. &#49436;&#48260;&#47484; &#51116;&#49884;&#51089;&#54624; &#54596;&#50836;&#45716; &#50630;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#53364;&#47084;&#49828;&#53552; &#51060;&#47492;</dt>
<dd>
<p>&#53364;&#47084;&#49828;&#53552;&#44032; &#49373;&#49457;&#46112; &#46412; &#53364;&#47084;&#49828;&#53552;&#50640; &#51648;&#51221;&#46108; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>JVM</dt>
<dd>
<p>JVM &#48372;&#44256;&#49436;&#47484; &#45572;&#47476;&#47732; &#48324;&#46020;&#51032; &#52285;&#51060; &#50676;&#47532;&#44256; &#50836;&#50557; &#48372;&#44256;&#49436;, &#47700;&#47784;&#47532; &#44288;&#47532; &#48143; &#48520;&#54596;&#50836;&#54620; &#51221;&#48372; &#49688;&#51665; &#48372;&#44256;&#49436;, &#53364;&#47000;&#49828; &#47196;&#46377; &#48372;&#44256;&#49436; &#48143; &#54788;&#51116; &#49828;&#47112;&#46300; &#45924;&#54532;&#47484; &#54252;&#54632;&#54620; Java Virtual Machine&#50640; &#45824;&#54620; &#48372;&#44256;&#49436;&#44032; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#44396;&#49457;</dt>
<dd>
<p>&#53364;&#47084;&#49828;&#53552;&#44032; &#49373;&#49457;&#46112; &#46412; &#53364;&#47084;&#49828;&#53552;&#50640; &#45824;&#54644; &#49440;&#53469;&#46108; &#44396;&#49457;&#51077;&#45768;&#45796;. &#44396;&#49457;&#51012; &#45572;&#47476;&#47732; &#53364;&#47084;&#49828;&#53552;&#50640; &#45824;&#54620; <a href="../../../common/en/help/ref-configuration.html">&#44396;&#49457;</a> &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>GMS</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; GMS(&#44536;&#47353; &#44288;&#47532; &#49436;&#48708;&#49828;)&#44032; &#53364;&#47084;&#49828;&#53552; &#48143; DAS(&#46020;&#47700;&#51064; &#44288;&#47532; &#49436;&#48260;)&#50640; &#51080;&#45716; &#44033; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640;&#49436; &#49884;&#51089;&#46121;&#45768;&#45796;. GMS&#44032; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46108; &#44033; &#53364;&#47084;&#49828;&#53552;&#50640; DAS&#44032; &#52280;&#50668;&#54633;&#45768;&#45796;. GMS&#45716; &#53364;&#47084;&#49828;&#53552; &#47784;&#45768;&#53552;&#47553;, &#53364;&#47084;&#49828;&#53552; &#47716;&#48260;&#49789; &#48143; &#44536;&#47353; &#53685;&#49888; &#49436;&#48708;&#49828;&#47484; &#51228;&#44277;&#54633;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#47680;&#54000;&#52880;&#49828;&#53944; &#54252;&#53944;</dt>
<dd>
<p>GMS&#44032; &#44536;&#47353; &#51060;&#48292;&#53944;&#47484; &#49688;&#49888;&#54616;&#45716; &#53685;&#49888; &#54252;&#53944;&#51032; &#54252;&#53944; &#48264;&#54840;&#51077;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; 2048-49151 &#48276;&#50948;&#51032; &#51201;&#54633;&#54620; &#54252;&#53944; &#48264;&#54840;&#47484; &#51648;&#51221;&#54644;&#50556; &#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; &#51060; &#48276;&#50948;&#50640;&#49436; &#51088;&#46041;&#51004;&#47196; &#49373;&#49457;&#46108; &#44050;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#47680;&#54000;&#52880;&#49828;&#53944; &#51452;&#49548;</dt>
<dd>
<p>GMS&#44032; &#44536;&#47353; &#51060;&#48292;&#53944;&#47484; &#49688;&#49888;&#54616;&#45716; &#51452;&#49548;&#51077;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; 224.0.0.0 - 239.255.255.255 &#49324;&#51060;&#51032; &#48276;&#50948;&#50640;&#49436; &#47680;&#54000;&#52880;&#49828;&#53944; &#51452;&#49548;&#47484; &#51648;&#51221;&#54644;&#50556; &#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 228.9.<i>XX</i>.<i>YY</i>&#51077;&#45768;&#45796;. &#50668;&#44592;&#49436; <i>XX</i><i>YY</i>&#45716; 0&#50640;&#49436; 255 &#49324;&#51060;&#51032; &#51088;&#46041;&#51004;&#47196; &#49373;&#49457;&#46108; &#46021;&#47549; &#44050;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#48148;&#51064;&#46300; &#51064;&#53552;&#54168;&#51060;&#49828; &#51452;&#49548;</dt>
<dd>
<p>GMS&#44032; &#48148;&#51064;&#46377;&#46104;&#45716; &#45348;&#53944;&#50892;&#53356; &#51064;&#53552;&#54168;&#51060;&#49828;&#51032; IP(&#51064;&#53552;&#45367; &#54532;&#47196;&#53664;&#53084;) &#51452;&#49548;&#51077;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#47196;&#52972; &#45348;&#53944;&#50892;&#53356; &#51064;&#53552;&#54168;&#51060;&#49828;&#51032; IP &#51452;&#49548;&#47484; &#51648;&#51221;&#54644;&#50556; &#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; &#47784;&#46304; &#44277;&#50857; &#45348;&#53944;&#50892;&#53356; &#51064;&#53552;&#54168;&#51060;&#49828; &#51452;&#49548;&#51077;&#45768;&#45796;.</p>
<p>&#48373;&#49688; &#54856; &#49884;&#49828;&#53596;&#50640;&#49436; &#51060; &#50741;&#49496;&#51008; GMS&#50640; &#49324;&#50857;&#46104;&#45716; &#45348;&#53944;&#50892;&#53356; &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#44396;&#49457;&#54633;&#45768;&#45796;. &#48373;&#49688; &#54856; &#49884;&#49828;&#53596;&#51008; &#46168; &#51060;&#49345;&#51032; &#45348;&#53944;&#50892;&#53356; &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#44032;&#51665;&#45768;&#45796;.</p>
<p>&#53364;&#47084;&#49828;&#53552;&#51032; &#47784;&#46304; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54644; &#51201;&#54633;&#54620; &#51452;&#49548;&#47484; &#51648;&#51221;&#54616;&#47140;&#47732; &#44033; &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54620; &#51452;&#49548;&#47484; &#44060;&#48324;&#51201;&#51004;&#47196; &#49444;&#51221;&#54616;&#45716; &#49884;&#49828;&#53596; &#49549;&#49457;&#51012; &#49324;&#50857;&#54633;&#45768;&#45796;.</p>
<p>&#50696;&#47484; &#46308;&#50612; &#49884;&#49828;&#53596; &#49549;&#49457; <a href="ref-clustersystemproperties.html">&#53364;&#47084;&#49828;&#53552; &#49884;&#49828;&#53596; &#49549;&#49457;</a><code>GMS-BIND-INTERFACE-ADDRESS-</code>cluster-name<i>&#51012; &#49373;&#49457;&#54616;&#47140;&#47732;</i> &#54168;&#51060;&#51648;&#47484; &#49324;&#50857;&#54633;&#45768;&#45796;. &#44536;&#47088; &#45796;&#51020; &#51060; &#54168;&#51060;&#51648;&#51032; &#48148;&#51064;&#46300; &#51452;&#49548; &#50741;&#49496;&#51012; <code>${GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i><code>}</code>&#51004;&#47196; &#49444;&#51221;&#54616;&#50668; &#49884;&#49828;&#53596; &#49549;&#49457;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. &#47560;&#51648;&#47561;&#51004;&#47196;, &#53364;&#47084;&#49828;&#53552;&#51032; &#44033; &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54644; <code>GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i> &#49884;&#49828;&#53596; &#49549;&#49457;&#51012; &#51064;&#49828;&#53556;&#49828;&#51032; &#49884;&#49828;&#53596;&#50640; &#54596;&#50836;&#54620; &#45348;&#53944;&#50892;&#53356; &#51064;&#53552;&#54168;&#51060;&#49828; &#51452;&#49548;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#49345;&#53468;</dt>
<dd>
<p>&#49892;&#54665; &#51473;&#51064; &#51080;&#45716; &#53364;&#47084;&#49828;&#53552;&#51032; &#51064;&#49828;&#53556;&#49828; &#49688;&#50752; &#49892;&#54665; &#51473;&#51060;&#51648; &#50506;&#51008; &#53364;&#47084;&#49828;&#53552;&#51032; &#51064;&#49828;&#53556;&#49828; &#49688;&#47484; &#45208;&#53440;&#45253;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref255" name="sthref255"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-gmscluster.html">&#53364;&#47084;&#49828;&#53552;&#50640; &#45824;&#54620; &#44536;&#47353; &#44288;&#47532; &#49436;&#48708;&#49828; &#49444;&#51221;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-migrate-ejb-timers.html">EJB &#53440;&#51060;&#47672;&#47484; &#47560;&#51060;&#44536;&#47112;&#51060;&#49496;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref256" name="sthref256"></a>
<h5>&#46041;&#51068;&#54620; asadmin &#54616;&#50948; &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00138"><code>generate-jvm-report</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00211"><code>migrate-timers</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00224"><code>rotate-log</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
