<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-gms" name="ref-gms"></a></p>

<h4><a id="sthref354" name="sthref354"></a>&#44536;&#47353; &#44288;&#47532; &#49436;&#48708;&#49828; &#54200;&#51665;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#44536;&#47353; &#44288;&#47532; &#49436;&#48708;&#49828;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; GMS &#49444;&#51221;&#51012; &#48320;&#44221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>GMS(&#44536;&#47353; &#44288;&#47532; &#49436;&#48708;&#49828;)&#45716; &#53364;&#47084;&#49828;&#53552; &#47784;&#45768;&#53552;&#47553;, &#53364;&#47084;&#49828;&#53552; &#47716;&#48260;&#49789; &#48143; &#44536;&#47353; &#53685;&#49888; &#49436;&#48708;&#49828;&#47484; &#51228;&#44277;&#54616;&#45716; in-process &#49436;&#48708;&#49828;&#51077;&#45768;&#45796;. GMS&#45716; &#44536;&#47353; &#47716;&#48260;&#49789; &#44160;&#49353; &#48143; &#44148;&#51204;&#49457; &#47784;&#45768;&#53552;&#47553; &#54532;&#47196;&#53664;&#53084;&#51032; &#44396;&#49457; &#44032;&#45733;&#54620; &#49828;&#53469; &#50948;&#50640; &#44396;&#52629;&#46121;&#45768;&#45796;. GMS&#45716; &#45796;&#51020; &#44592;&#45733;&#51012; &#49688;&#54665;&#54633;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#54616;&#45208; &#51060;&#49345;&#51032; &#47716;&#48260; &#51064;&#49828;&#53556;&#49828;&#44032; &#53364;&#47084;&#49828;&#53552;&#50640; &#52628;&#44032;&#46104;&#44144;&#45208; &#53364;&#47084;&#49828;&#53552;&#50640;&#49436; &#51228;&#44144;&#46104;&#44144;&#45208; &#51109;&#50528;&#44032; &#48156;&#49373;&#54620; &#44163;&#51004;&#47196; &#51032;&#49900;&#46104;&#44144;&#45208; &#54869;&#51064;&#46104;&#47732; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#51032; &#46321;&#47197;&#46108; &#47784;&#46280;&#50640; &#50508;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>&#53364;&#47084;&#49828;&#53552; &#47716;&#48260; &#44036;&#50640; &#47700;&#49884;&#51648;&#47484; &#51452;&#44256; &#48155;&#51012; &#49688; &#51080;&#45716; &#44592;&#45733;&#51012; &#51228;&#44277;&#54633;&#45768;&#45796;.</p>
</li>
</ul>
<p>[&#44536;&#47353; &#44288;&#47532; &#49436;&#48708;&#49828;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44592;&#48376;&#44050; &#47196;&#46300;</dt>
<dd>
<p>&#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#45716; &#49444;&#51221;&#51012; &#44592;&#48376;&#44050;&#51004;&#47196; &#48373;&#50896;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#49444;&#51221;&#51008; &#48320;&#44221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#44396;&#49457; &#51060;&#47492;</dt>
<dd>
<p>&#51060; &#54168;&#51060;&#51648;&#51032; &#49444;&#51221;&#51060; &#51201;&#50857;&#46104;&#45716; &#44396;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#45572;&#46973;&#46108; &#52572;&#45824; &#54616;&#53944;&#48708;&#53944; &#49688;</dt>
<dd>
<p>&#47716;&#48260;&#51032; &#45572;&#46973;&#46108; &#54616;&#53944;&#48708;&#53944; &#49688;&#47196;, &#51060;&#54980;&#50640; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828; &#50724;&#47448;&#47196; &#51032;&#49900;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 3&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#54616;&#53944;&#48708;&#53944; &#48712;&#46020;</dt>
<dd>
<p>&#47716;&#48260;&#51032; &#45572;&#46973;&#46108; &#54616;&#53944;&#48708;&#53944; &#44036;&#44201;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 2000&#48128;&#47532;&#52488;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#44536;&#47353; &#44160;&#49353; &#49884;&#44036; &#52488;&#44284;</dt>
<dd>
<p>GMS&#44032; &#45796;&#47480; &#53364;&#47084;&#49828;&#53552; &#47716;&#48260;&#47484; &#44160;&#49353;&#54624; &#46412;&#44620;&#51648; &#45824;&#44592;&#54616;&#45716; &#49884;&#44036;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 5000&#48128;&#47532;&#52488;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51109;&#50528; &#48156;&#49373; &#54869;&#51064; &#45824;&#44592; &#49884;&#44036;</dt>
<dd>
<p>&#51109;&#50528;&#44032; &#48156;&#49373;&#54620; &#44163;&#51004;&#47196; &#51032;&#49900;&#46104;&#45716; &#47716;&#48260;&#47484; &#49892;&#54056;&#47196; &#48372;&#44256;&#54616;&#44592; &#51204;&#50640; &#45824;&#44592;&#54616;&#45716; &#49884;&#44036;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 1500&#48128;&#47532;&#52488;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52628;&#44032; &#49549;&#49457;</dt>
<dd>
<p>&#44536;&#47353; &#44288;&#47532; &#49436;&#48708;&#49828;&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457; &#53580;&#51060;&#48660;&#51077;&#45768;&#45796;.</p>
<p>GlassFish Server&#50640;&#49436;&#45716; &#52628;&#44032; GMS &#49549;&#49457;&#51012; &#51221;&#51032;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
<p>&#44033; &#49549;&#49457;&#50640; &#45824;&#54644; &#54364;&#49884;&#46104;&#45716; &#51221;&#48372;&#45716; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#51060;&#47492;</dt>
<dd>
<p>&#49549;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#44050;</dt>
<dd>
<p>&#49440;&#53469;&#46108; &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54644; &#49444;&#51221;&#46108; &#49549;&#49457;&#51032; &#44050;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49444;&#47749;</dt>
<dd>
<p>&#49549;&#49457;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#51221;&#48372;&#47484; &#51228;&#44277;&#54616;&#45716; &#53581;&#49828;&#53944; &#49444;&#47749;&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
<p>&#52628;&#44032; &#49549;&#49457; &#53580;&#51060;&#48660;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#46020; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#49549;&#49457; &#52628;&#44032;</dt>
<dd>
<p>&#49549;&#49457;&#51012; &#52628;&#44032;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#51060; &#45800;&#52628;&#47484; &#45572;&#47476;&#47732; &#52628;&#44032; &#49549;&#49457; &#53580;&#51060;&#48660;&#50640; &#54665;&#51060; &#52628;&#44032;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#49549;&#49457; &#49325;&#51228;</dt>
<dd>
<p>&#49440;&#53469;&#54620; &#49549;&#49457;&#51012; &#54616;&#45208; &#51060;&#49345; &#49325;&#51228;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#49325;&#51228;&#46108; &#49549;&#49457;&#51008; &#54644;&#45817; &#44592;&#48376;&#44050;&#51004;&#47196; &#46104;&#46028;&#47140;&#51648;&#44144;&#45208; &#44592;&#48376;&#44050;&#51060; &#49444;&#51221;&#46104;&#50612; &#51080;&#51648; &#50506;&#51008; &#44221;&#50864; &#51221;&#51032;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref355" name="sthref355"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-gmsenable.html">&#44536;&#47353; &#44288;&#47532; &#49436;&#48708;&#49828;&#47484; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-gms.html">&#44536;&#47353; &#44288;&#47532; &#49436;&#48708;&#49828;&#47484; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-gmscluster.html">&#53364;&#47084;&#49828;&#53552;&#50640; &#45824;&#54620; &#44536;&#47353; &#44288;&#47532; &#49436;&#48708;&#49828; &#49444;&#51221;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>





<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
