<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-editnode" name="task-editnode"></a></p>

<h4><a id="sthref236" name="sthref236"></a>&#45432;&#46300;&#47484; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#45432;&#46300;&#47484; &#54200;&#51665;&#54616;&#47732; GlassFish Server &#45432;&#46300;&#51032; &#44396;&#49457; &#45936;&#51060;&#53552;&#44032; &#50629;&#45936;&#51060;&#53944;&#46121;&#45768;&#45796;. &#45432;&#46300;&#47484; &#54200;&#51665;&#54616;&#47732; &#45432;&#46300; &#50976;&#54805;&#51012; CONFIG&#50640;&#49436; DCOM &#46608;&#45716; SSH&#47196; &#48320;&#44221;&#54616;&#50668; &#45432;&#46300;&#50640; &#45824;&#54620; &#50896;&#44201; &#53685;&#49888;&#51060; &#44032;&#45733;&#54616;&#46020;&#47197; &#54624; &#49688;&#46020; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#45432;&#46300; &#50976;&#54805;&#51012; CONFIG&#50640;&#49436; DCOM&#51004;&#47196; &#48320;&#44221;&#54616;&#45716; &#44221;&#50864; &#45796;&#51020; &#54596;&#46300;&#47484; &#48708;&#50892; &#46160;&#47732; &#44592;&#48376;&#44050;&#51060; &#51201;&#50857;&#46121;&#45768;&#45796;.</p>
<ul>
<li>
<p>Windows &#46020;&#47700;&#51064;</p>
</li>
<li>
<p>Windows &#49324;&#50857;&#51088;</p>
</li>
</ul>
<p>&#45432;&#46300; &#50976;&#54805;&#51012; CONFIG&#50640;&#49436; SSH&#47196; &#48320;&#44221;&#54616;&#45716; &#44221;&#50864; &#45796;&#51020; &#54596;&#46300;&#47484; &#48708;&#50892; &#46160;&#47732; &#44592;&#48376;&#44050;&#51060; &#51201;&#50857;&#46121;&#45768;&#45796;.</p>
<ul>
<li>
<p>SSH &#54252;&#53944;</p>
</li>
<li>
<p>SSH &#49324;&#50857;&#51088; &#51060;&#47492;</p>
</li>
<li>
<p>&#53412; &#54028;&#51068;</p>
</li>
</ul>
<ol>
<li>
<p>&#53456;&#49353; &#53944;&#47532;&#50640;&#49436; [&#45432;&#46300;] &#45432;&#46300;&#47484; &#54869;&#51109;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#45432;&#46300; &#47785;&#47197;&#50640;&#49436; &#54200;&#51665;&#54624; &#45432;&#46300;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>[&#45432;&#46300; &#54200;&#51665;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#50976;&#54805;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#50629;&#45936;&#51060;&#53944;&#46108; &#45432;&#46300; &#50976;&#54805;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#45432;&#46300;&#44032; DCOM(Distributed Component Object Model) &#50896;&#44201; &#54532;&#47196;&#53664;&#53084;&#51012; &#53685;&#54620; &#53685;&#49888;&#51012; &#51648;&#50896;&#54616;&#46020;&#47197; &#54616;&#47140;&#47732; DCOM&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#45432;&#46300;&#44032; SSH(&#48372;&#50504; &#49528;)&#47484; &#53685;&#54620; &#53685;&#49888;&#51012; &#51648;&#50896;&#54616;&#46020;&#47197; &#54616;&#47140;&#47732; SSH&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#45432;&#46300;&#50640;&#49436; &#50896;&#44201; &#44396;&#49457;&#50640; &#45824;&#54620; &#51648;&#50896;&#51012; &#51228;&#44144;&#54616;&#47140;&#47732; CONFIG&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>CONFIG&#47484; &#49440;&#53469;&#54616;&#47732; SSH &#44396;&#49457; &#46608;&#45716; DCOM &#44396;&#49457;&#50640; &#45824;&#54620; &#50741;&#49496;&#51060; &#54364;&#49884;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;. &#54788;&#51116; &#45432;&#46300; &#50976;&#54805;&#51060; DCOM &#46608;&#45716; SSH&#51064;&#45936; CONFIG&#47484; &#49440;&#53469;&#54616;&#45716; &#44221;&#50864; &#48320;&#44221; &#49324;&#54637;&#51012; &#51200;&#51109;&#54616;&#47732; &#45432;&#46300; &#44396;&#49457;&#50640;&#49436; SSH &#44396;&#49457; &#45936;&#51060;&#53552; &#46608;&#45716; DCOM &#44396;&#49457; &#45936;&#51060;&#53552;&#44032; &#51228;&#44144;&#46121;&#45768;&#45796;.</p>
</li>
</ul>
</li>
<li>
<p>[&#45432;&#46300; &#54840;&#49828;&#53944;] &#54596;&#46300;&#50640; &#50629;&#45936;&#51060;&#53944;&#46108; &#45432;&#46300;&#44032; &#45208;&#53440;&#45244; &#54840;&#49828;&#53944;&#51032; &#51060;&#47492;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#54596;&#46300;&#44032; &#54596;&#49688;&#51064;&#51648; &#50668;&#48512;&#45716; &#45432;&#46300; &#50976;&#54805;&#50640; &#46384;&#46972; &#44208;&#51221;&#46121;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#45432;&#46300; &#50976;&#54805;&#51060; CONFIG&#51060;&#47732; &#54840;&#49828;&#53944; &#51060;&#47492;&#51012; &#49373;&#47029;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#54840;&#49828;&#53944; &#51060;&#47492;&#51008; &#45432;&#46300;&#50640; &#51080;&#45716; &#51064;&#49828;&#53556;&#49828;&#47484; &#49373;&#49457;&#54624; &#46412; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>&#45432;&#46300; &#50976;&#54805;&#51060; DCOM &#46608;&#45716; SSH&#51064; &#44221;&#50864; &#54840;&#49828;&#53944; &#51060;&#47492;&#51012; &#51648;&#51221;&#54644;&#50556; &#54633;&#45768;&#45796;. &#44536;&#47111;&#51648; &#50506;&#51004;&#47732; &#50724;&#47448;&#44032; &#48156;&#49373;&#54633;&#45768;&#45796;.</p>
</li>
</ul>
</li>
<li>
<p>[&#45432;&#46300; &#46356;&#47113;&#53664;&#47532;] &#54596;&#46300;&#50640; &#45432;&#46300;&#50640; &#49373;&#49457;&#46108; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#47484; &#54252;&#54632;&#54624; &#46356;&#47113;&#53664;&#47532;&#51032; &#44221;&#47196;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#49345;&#45824; &#44221;&#47196;&#47484; &#51077;&#47141;&#54616;&#45716; &#44221;&#50864; &#44221;&#47196;&#45716; as-install &#46356;&#47113;&#53664;&#47532;&#50640; &#45824;&#54620; &#49345;&#45824; &#44221;&#47196;&#51077;&#45768;&#45796;. &#50668;&#44592;&#49436; as-install&#51008; &#54840;&#49828;&#53944;&#50640; &#51080;&#45716; GlassFish Server &#49548;&#54532;&#53944;&#50920;&#50612;&#51032; &#44592;&#48376; &#49444;&#52824; &#46356;&#47113;&#53664;&#47532;&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#49444;&#52824; &#46356;&#47113;&#53664;&#47532;] &#54596;&#46300;&#50640; &#54840;&#49828;&#53944;&#50640; &#51080;&#45716; GlassFish Server &#49548;&#54532;&#53944;&#50920;&#50612; &#44592;&#48376; &#49444;&#52824; &#46356;&#47113;&#53664;&#47532;&#51032; <i>&#49345;&#50948;</i> &#46356;&#47113;&#53664;&#47532;&#50640; &#45824;&#54620; &#51204;&#52404; &#44221;&#47196;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;(&#50696;: <code>/export/glassfish3</code>).</p>
</li>
<li>
<p>&#45432;&#46300; &#50976;&#54805;&#50640; &#46384;&#46972; &#45432;&#46300; &#50629;&#45936;&#51060;&#53944;&#47484; &#50756;&#47308;&#54633;&#45768;&#45796;.</p>
<ol type="a">
<li>
<p>&#45432;&#46300; &#50976;&#54805;&#51060; CONFIG&#51064; &#44221;&#50864; [&#51200;&#51109;]&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
</li>
<li>
<p>&#45432;&#46300; &#50976;&#54805;&#51060; DCOM&#51064; &#44221;&#50864; <a href="task-nodeupdatedcom.html">DCOM &#45432;&#46300; &#50629;&#45936;&#51060;&#53944;&#47484; &#50756;&#47308;&#54616;&#45716; &#48169;&#48277;</a>&#51032; &#51648;&#52840;&#51012; &#46384;&#47493;&#45768;&#45796;.</p>
</li>
<li>
<p>&#45432;&#46300; &#50976;&#54805;&#51060; SSH&#51064; &#44221;&#50864; <a href="task-nodeeditssh.html">SSH &#45432;&#46300; &#50629;&#45936;&#51060;&#53944;&#47484; &#50756;&#47308;&#54616;&#45716; &#48169;&#48277;</a>&#51032; &#51648;&#52840;&#51012; &#46384;&#47493;&#45768;&#45796;.</p>
</li>
</ol>
</li>
</ol>
<a id="sthref237" name="sthref237"></a>
<h5>&#44288;&#47144; &#54637;&#47785;</h5>
<ul>
<li>
<p><a href="task-nodeupdatedcom.html">DCOM &#45432;&#46300; &#50629;&#45936;&#51060;&#53944;&#47484; &#50756;&#47308;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-nodeeditssh.html">SSH &#45432;&#46300; &#50629;&#45936;&#51060;&#53944;&#47484; &#50756;&#47308;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-createnode.html">&#45432;&#46300;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-deletenode.html">&#45432;&#46300;&#47484; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-listnodes.html">&#54788;&#51116; &#46020;&#47700;&#51064;&#51032; &#47784;&#46304; &#45432;&#46300;&#47484; &#45208;&#50676;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-pingnode.html">&#50672;&#44208; &#44032;&#45733;&#54620; &#45432;&#46300;&#51064;&#51648; &#53580;&#49828;&#53944;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
