<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-create-cluster" name="task-create-cluster"></a></p>

<h4><a id="sthref2" name="sthref2"></a>&#53364;&#47084;&#49828;&#53552;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#53364;&#47084;&#49828;&#53552;&#45716; &#46041;&#51068;&#54620; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;, &#47532;&#49548;&#49828; &#48143; &#44396;&#49457; &#51221;&#48372;&#47484; &#44277;&#50976;&#54616;&#45716; &#47749;&#47749;&#46108; GlassFish Server &#51064;&#49828;&#53556;&#49828; &#47784;&#51020;&#51077;&#45768;&#45796;.</p>
<p>&#53364;&#47084;&#49828;&#53552;&#45716; &#54869;&#51109;&#49457;, &#47196;&#46300; &#44512;&#54805; &#51312;&#51221; &#48143; &#49892;&#54056; &#48372;&#54840;&#47484; &#53685;&#54644; &#44256;&#44032;&#50857;&#49457;&#51012; &#51228;&#44277;&#54633;&#45768;&#45796;. &#53364;&#47084;&#49828;&#53552;&#51032; &#51064;&#49828;&#53556;&#49828;&#45208; &#54840;&#49828;&#53944;&#50640; &#51109;&#50528;&#44032; &#48156;&#49373;&#54616;&#47732; GlassFish Server&#45716; &#51109;&#50528; &#48156;&#49373;&#51012; &#44048;&#51648;&#54616;&#44256;, &#51109;&#50528;&#44032; &#48156;&#49373;&#54620; &#51064;&#49828;&#53556;&#49828;&#50640;&#49436; &#53364;&#47084;&#49828;&#53552;&#51032; &#45796;&#47480; &#51064;&#49828;&#53556;&#49828;&#47196; &#50836;&#52397;&#51012; &#51116;&#51648;&#51221;&#54616;&#44256;, &#49324;&#50857;&#51088; &#49464;&#49496; &#49345;&#53468;&#47484; &#48373;&#44396;&#54633;&#45768;&#45796;. &#46041;&#51068;&#54620; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#48143; &#47532;&#49548;&#49828;&#44032; &#53364;&#47084;&#49828;&#53552;&#51032; &#47784;&#46304; &#51064;&#49828;&#53556;&#49828;&#50640; &#51080;&#51004;&#48064;&#47196; &#54620; &#51064;&#49828;&#53556;&#49828;&#50640;&#49436; &#53364;&#47084;&#49828;&#53552;&#51032; &#45796;&#47480; &#51064;&#49828;&#53556;&#49828;&#47196; &#48373;&#44396;&#44032; &#49688;&#54665;&#46112; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>GlassFish Server&#50640;&#49436;&#45716; &#51064;&#49828;&#53556;&#49828;&#44032; &#46041;&#51068;&#54620; &#54840;&#49828;&#53944;&#50640; &#51080;&#45716;&#51648; &#50500;&#45768;&#47732; &#45796;&#47480; &#54840;&#49828;&#53944;&#50640; &#51080;&#45716;&#51648;&#50640; &#44288;&#44228;&#50630;&#51060; &#53364;&#47084;&#49828;&#53552;&#51032; &#47784;&#46304; &#51064;&#49828;&#53556;&#49828;&#47484; &#45800;&#51068; &#54840;&#49828;&#53944;&#51032; &#45800;&#51068; &#45800;&#50948;&#47196; &#44288;&#47532;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<a id="sthref3" name="sthref3"></a>
<h5>&#49884;&#51089;&#54616;&#44592; &#51204;&#50640;</h5>
<p>&#49373;&#49457;&#54616;&#47140;&#45716; &#53364;&#47084;&#49828;&#53552;&#50640; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#47484; &#52628;&#44032;&#54616;&#47140;&#45716; &#44221;&#50864; &#51064;&#49828;&#53556;&#49828;&#44032; &#49345;&#51452;&#54616;&#44172; &#46112; &#45432;&#46300;&#44032; &#51060;&#48120; &#51080;&#45716;&#51648; &#54869;&#51064;&#54633;&#45768;&#45796;.</p>
<ol>
<li>
<p>&#53456;&#49353; &#53944;&#47532;&#50640;&#49436; [&#53364;&#47084;&#49828;&#53552;] &#45432;&#46300;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>[&#53364;&#47084;&#49828;&#53552;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#53364;&#47084;&#49828;&#53552;] &#54168;&#51060;&#51648;&#50640;&#49436; [&#49352;&#47196; &#47564;&#46308;&#44592;]&#47484; &#45572;&#47493;&#45768;&#45796;.</p>
<p>[&#49352; &#53364;&#47084;&#49828;&#53552;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#53364;&#47084;&#49828;&#53552; &#51060;&#47492;] &#54596;&#46300;&#50640; &#53364;&#47084;&#49828;&#53552; &#51060;&#47492;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#51060;&#47492;&#51008; &#45796;&#51020; &#50836;&#44396; &#49324;&#54637;&#51012; &#52649;&#51313;&#54644;&#50556; &#54633;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#51060;&#47492;&#50640;&#45716; ASCII &#47928;&#51088;&#47564; &#54252;&#54632;&#46112; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>&#51060;&#47492;&#51008; &#47928;&#51088;, &#49707;&#51088; &#46608;&#45716; &#48145;&#51460;&#47196; &#49884;&#51089;&#54644;&#50556; &#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#51060;&#47492;&#50640;&#45716; &#45796;&#51020; &#47928;&#51088;&#47564; &#54252;&#54632;&#46112; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#49548;&#47928;&#51088;</p>
</li>
<li>
<p>&#45824;&#47928;&#51088;</p>
</li>
<li>
<p>&#49707;&#51088;</p>
</li>
<li>
<p>&#54616;&#51060;&#54536;</p>
</li>
<li>
<p>&#47560;&#52840;&#54364;</p>
</li>
<li>
<p>&#48145;&#51460;</p>
</li>
</ul>
</li>
<li>
<p>&#51060;&#47492;&#51008; &#46020;&#47700;&#51064;&#50640;&#49436; &#44256;&#50976;&#54644;&#50556; &#54616;&#47728; &#45796;&#47480; &#53364;&#47084;&#49828;&#53552;, &#47749;&#47749;&#46108; &#44396;&#49457;, GlassFish Server &#51064;&#49828;&#53556;&#49828; &#46608;&#45716; &#45432;&#46300;&#51032; &#51060;&#47492;&#51060;&#50612;&#49436;&#45716; &#50504;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>&#51060;&#47492;&#51008; <code>domain</code>, <code>server</code> &#46608;&#45716; GlassFish Server&#50640;&#49436; &#50696;&#50557;&#46108; &#45796;&#47480; &#53412;&#50892;&#46300;&#50668;&#49436;&#45716; &#50504;&#46121;&#45768;&#45796;.</p>
</li>
</ul>
</li>
<li>
<p>[&#44396;&#49457;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#53364;&#47084;&#49828;&#53552;&#44032; &#49324;&#50857;&#54624; &#47749;&#47749;&#46108; &#44396;&#49457;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>

<hr>
<p><b>&#51452;:</b></p>
<code>default-config</code>&#47484; &#49440;&#53469;&#54616;&#45716; &#44221;&#50864; &#45796;&#51020; &#45800;&#44228;&#50640;&#49436; &#44396;&#49457;&#51060; &#44277;&#50976;&#46104;&#51648; <i>&#50506;&#46020;&#47197;</i> &#51648;&#51221;&#54644;&#50556; &#54633;&#45768;&#45796;. <code>default-config</code> &#44396;&#49457;&#51008; &#44277;&#50976;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
<hr>

</li>
<li>
<p>&#53364;&#47084;&#49828;&#53552;&#50640; &#49324;&#50857;&#46112; &#44396;&#49457;&#51060; &#44277;&#50976;&#46104;&#45716;&#51648; &#50668;&#48512;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#44396;&#49457;&#51060; &#44277;&#50976;&#46104;&#51648; &#50506;&#45716; &#44221;&#50864; [&#49440;&#53469;&#54620; &#44396;&#49457;&#51032; &#48373;&#49324;&#48376; &#47564;&#46308;&#44592;] &#50741;&#49496;&#51012; &#49440;&#53469;&#54620; &#52292;&#47196; &#46177;&#45768;&#45796;.</p>
<p>&#53364;&#47084;&#49828;&#53552;&#47484; &#49373;&#49457;&#54624; &#46412; &#49440;&#53469;&#54620; &#44396;&#49457;&#51060; &#48373;&#49324;&#46121;&#45768;&#45796;. &#44396;&#49457; &#48373;&#49324;&#48376;&#50640;&#45716; cluster-name<code>-config</code>&#46972;&#45716; &#51060;&#47492;&#51060; &#51648;&#51221;&#46121;&#45768;&#45796;. &#50668;&#44592;&#49436; <i>cluster-name</i>&#51008; &#49373;&#49457;&#54624; &#53364;&#47084;&#49828;&#53552;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>&#44396;&#49457;&#51060; &#44277;&#50976;&#46104;&#45716; &#44221;&#50864; [&#49440;&#53469;&#54620; &#44396;&#49457; &#52280;&#51312;] &#50741;&#49496;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#53364;&#47084;&#49828;&#53552;&#44032; &#51648;&#51221;&#46108; &#44592;&#51316; &#47749;&#47749;&#46108; &#44396;&#49457;&#51012; &#49324;&#50857;&#54633;&#45768;&#45796;.</p>
</li>
</ul>
</li>
<li>
<p><a id="sthref4" name="sthref4"></a>&#53364;&#47084;&#49828;&#53552;&#50640; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#47484; &#52628;&#44032;&#54633;&#45768;&#45796;.</p>

<hr>
<p><b>&#51452;:</b></p>
&#50896;&#44201; &#54840;&#49828;&#53944;&#47484; &#45208;&#53440;&#45236;&#45716; CONFIG &#50976;&#54805;&#51032; &#45432;&#46300;&#50640; &#51064;&#49828;&#53556;&#49828;&#47484; &#49373;&#49457;&#54616;&#47140;&#47732; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00044"><code>create-local-instance</code>(1)</a> &#54616;&#50948; &#47749;&#47161;&#51012; &#49324;&#50857;&#54644;&#50556; &#54633;&#45768;&#45796;. &#51060; &#50857;&#46020;&#47196;&#45716; &#44288;&#47532; &#53080;&#49556;&#51012; &#49324;&#50857;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
<hr>

<p><a href="task-create-clustered-instance.html">&#53364;&#47084;&#49828;&#53552;&#50640; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#47484; &#52628;&#44032;&#54616;&#45716; &#48169;&#48277;</a>&#50640; &#49444;&#47749;&#46108; &#48148;&#50752; &#44057;&#51060;, &#53364;&#47084;&#49828;&#53552;&#47484; &#49373;&#49457;&#54620; &#54980;&#50640; &#51064;&#49828;&#53556;&#49828;&#47484; &#52628;&#44032;&#54624; &#49688;&#46020; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#45796;&#51020;&#44284; &#44057;&#51060; &#44033; &#51064;&#49828;&#53556;&#49828;&#47484; &#52628;&#44032;&#54633;&#45768;&#45796;.</p>
<ol type="a">
<li>
<p>[&#49373;&#49457;&#54624; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;] &#50689;&#50669;&#50640;&#49436; [&#52628;&#44032;]&#47484; &#45572;&#47493;&#45768;&#45796;.</p>
<p>&#53364;&#47084;&#49828;&#53552;&#51032; &#51064;&#49828;&#53556;&#49828; &#53580;&#51060;&#48660;&#50640; &#54665;&#51060; &#52628;&#44032;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51064;&#49828;&#53556;&#49828; &#51060;&#47492;] &#54596;&#46300;&#50640; &#51064;&#49828;&#53556;&#49828; &#51060;&#47492;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#44032;&#51473;&#52824;] &#54596;&#46300;&#50640; &#51064;&#49828;&#53556;&#49828;&#51032; &#47196;&#46300; &#44512;&#54805; &#51312;&#51221; &#44032;&#51473;&#52824;&#47484; &#45208;&#53440;&#45236;&#45716; &#51221;&#49688;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#47196;&#46300; &#44512;&#54805; &#51312;&#51221; &#44032;&#51473;&#52824;&#45716; &#51064;&#49828;&#53556;&#49828;&#44032; &#52376;&#47532;&#54644;&#50556; &#54616;&#45716; &#53364;&#47084;&#49828;&#53552;&#50640; &#45824;&#54620; &#47784;&#46304; &#50836;&#52397;&#51032; &#48708;&#50984;&#51012; &#44208;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#50696;&#47484; &#46308;&#50612; &#46160; &#44060;&#51032; &#51064;&#49828;&#53556;&#49828;&#47196; &#44396;&#49457;&#46108; &#53364;&#47084;&#49828;&#53552;&#50640;&#49436; &#54620; &#51064;&#49828;&#53556;&#49828;&#44032; &#45348; &#44060;&#51032; &#50836;&#52397; &#51473;&#50640;&#49436; &#54616;&#45208;&#47484; &#52376;&#47532;&#54616;&#44256; &#45796;&#47480; &#51064;&#49828;&#53556;&#49828;&#44032; &#45348; &#44060;&#51032; &#50836;&#52397; &#51473;&#50640;&#49436; &#49464; &#44060;&#47484; &#52376;&#47532;&#54644;&#50556; &#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#44221;&#50864; &#45348; &#44060;&#51032; &#50836;&#52397; &#51473;&#50640;&#49436; &#54616;&#45208;&#47484; &#52376;&#47532;&#54624; &#51064;&#49828;&#53556;&#49828;&#51032; &#44032;&#51473;&#52824;&#47484; 1&#47196; &#49444;&#51221;&#54616;&#44256; &#45796;&#47480; &#51064;&#49828;&#53556;&#49828;&#51032; &#44032;&#51473;&#52824;&#47484; 3&#51004;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;. &#48177;&#48516;&#50984;&#51012; &#49324;&#50857;&#54616;&#47140;&#45716; &#44221;&#50864; &#51064;&#49828;&#53556;&#49828;&#51032; &#44032;&#51473;&#52824;&#47484; &#44033;&#44033; 25&#50752; 75&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376; &#44032;&#51473;&#52824;&#45716; 100&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#45432;&#46300;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#51064;&#49828;&#53556;&#49828;&#44032; &#49345;&#51452;&#54624; &#45432;&#46300;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</li>
</ol>
</li>
<li>
<p>[&#54869;&#51064;]&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
<p>[&#53364;&#47084;&#49828;&#53552;] &#54168;&#51060;&#51648;&#47196; &#46028;&#50500;&#44049;&#45768;&#45796;. &#54168;&#51060;&#51648;&#51032; &#53364;&#47084;&#49828;&#53552; &#53580;&#51060;&#48660;&#50640; &#53364;&#47084;&#49828;&#53552;&#44032; &#52628;&#44032;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
</ol>
<a id="sthref5" name="sthref5"></a>
<h5>&#44288;&#47144; &#54637;&#47785;</h5>
<ul>
<li>
<p><a href="task-delete-cluster.html">&#53364;&#47084;&#49828;&#53552;&#47484; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-availabilityservice.html">&#53364;&#47084;&#49828;&#53552; &#44032;&#50857;&#49457; &#49444;&#51221;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-start-cluster.html">&#53364;&#47084;&#49828;&#53552;&#47484; &#49884;&#51089;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-stop-cluster.html">&#53364;&#47084;&#49828;&#53552;&#47484; &#51221;&#51648;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-modify-cluster-config.html">&#53364;&#47084;&#49828;&#53552; &#44396;&#49457;&#51012; &#49688;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-cluster-app-deploy.html">&#53364;&#47084;&#49828;&#53552;&#50640; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#48176;&#52824;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-cluster-app-list.html">&#53364;&#47084;&#49828;&#53552;&#50640; &#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#45208;&#50676;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-cluster-app-undeploy.html">&#53364;&#47084;&#49828;&#53552;&#50640;&#49436; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#48176;&#52824;&#47484; &#54644;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-cluster-app-remove.html">&#53364;&#47084;&#49828;&#53552;&#50640;&#49436; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#51228;&#44144;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-cluster-app-edit.html">&#53364;&#47084;&#49828;&#53552;&#50640; &#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-cluster-app-enable-disable.html">&#53364;&#47084;&#49828;&#53552;&#50640; &#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#49324;&#50857; &#46608;&#45716; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-cluster-app-lb-enable-disable.html">&#53364;&#47084;&#49828;&#53552;&#50640; &#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#45824;&#54620; &#47196;&#46300; &#44512;&#54805; &#51312;&#51221;&#51012; &#49324;&#50857; &#46608;&#45716; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-create.html">&#53364;&#47084;&#49828;&#53552;&#50640; &#45824;&#54620; &#47532;&#49548;&#49828;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-display.html">&#53364;&#47084;&#49828;&#53552;&#50640; &#45824;&#54620; &#47532;&#49548;&#49828;&#47484; &#45208;&#50676;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-enable-disable.html">&#47532;&#49548;&#49828;&#47484; &#51204;&#50669;&#51201;&#51004;&#47196; &#49324;&#50857; &#46608;&#45716; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-edit.html">&#53364;&#47084;&#49828;&#53552;&#50640; &#45824;&#54620; &#47532;&#49548;&#49828;&#47484; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-upgrade-components.html">&#49436;&#48708;&#49828; &#49552;&#49892; &#50630;&#51060; &#44396;&#49457; &#50836;&#49548;&#47484; &#50629;&#44536;&#47112;&#51060;&#46300;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
