<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-view-logs-standalone-instance" name="task-view-logs-standalone-instance"></a><a id="GHCLU00060" name="GHCLU00060"></a></p>

<h4><a id="sthref140" name="sthref140"></a><a id="sthref141" name="sthref141"></a><a id="sthref142" name="sthref142"></a><a id="sthref143" name="sthref143"></a>&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54620; &#47196;&#44536; &#54028;&#51068;&#51012; &#48372;&#45716; &#48169;&#48277;</h4>
<a name="BEGIN" id="BEGIN"></a><a id="sthref144" name="sthref144"></a>
<h5>&#49884;&#51089;&#54616;&#44592; &#51204;&#50640;</h5>
<p>&#47196;&#44536; &#54028;&#51068;&#51012; &#48380; &#51064;&#49828;&#53556;&#49828;&#44032; &#49892;&#54665;&#46104;&#44256; &#51080;&#50612;&#50556; &#54633;&#45768;&#45796;.</p>
<ol>
<li>
<p>&#53456;&#49353; &#53944;&#47532;&#50640;&#49436; [&#46021;&#47549;&#54805; &#51064;&#49828;&#53556;&#49828;] &#45432;&#46300;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>[&#46021;&#47549;&#54805; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>&#47196;&#44536; &#54028;&#51068;&#51012; &#54364;&#49884;&#54624; &#51064;&#49828;&#53556;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54620; [&#51068;&#48152; &#51221;&#48372;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51068;&#48152; &#51221;&#48372;] &#54168;&#51060;&#51648;&#50640;&#49436; [&#47196;&#44536; &#54028;&#51068; &#48372;&#44592;]&#47484; &#45572;&#47493;&#45768;&#45796;.</p>
<p>[&#47196;&#44536; &#48624;&#50612;] &#52285;&#51060; &#50676;&#47549;&#45768;&#45796;.</p>

<hr>
<p><b>&#51452;:</b></p>
&#51064;&#49828;&#53556;&#49828;&#44032; &#51060;&#48120; &#49892;&#54665; &#51473;&#51060;&#50612;&#50556; &#54633;&#45768;&#45796;. &#51064;&#49828;&#53556;&#49828;&#44032; &#49892;&#54665;&#46104;&#44256; &#51080;&#51648; &#50506;&#51004;&#47732; [&#47196;&#44536; &#54028;&#51068; &#48372;&#44592;] &#45800;&#52628;&#44032; &#48708;&#54876;&#49457;&#54868;&#46121;&#45768;&#45796;.
<hr>

</li>
</ol>
<a id="sthref145" name="sthref145"></a>
<h5>&#44288;&#47144; &#54637;&#47785;</h5>
<ul>
<li>
<p><a href="../../../common/en/help/task-filter-logs.html">&#54364;&#49884;&#46108; &#47196;&#44536; &#47112;&#53076;&#46300;&#47484; &#54596;&#53552;&#47553;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-create-standalone-instance.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-delete-standalone-instances.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#47484; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-start-standalone-instances.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#47484; &#49884;&#51089;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-stop-standalone-instances.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#47484; &#51221;&#51648;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-recovertransactions-standalone-instance.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54620; &#53944;&#47004;&#51117;&#49496;&#51012; &#48373;&#44396;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-deploy.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#48176;&#52824;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-list.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640; &#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#45208;&#50676;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-undeploy.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640;&#49436; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#48176;&#52824;&#47484; &#54644;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-remove.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640;&#49436; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#51228;&#44144;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-edit.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640; &#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-enable-disable.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640; &#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#49324;&#50857; &#46608;&#45716; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-lb-enable-disable.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640; &#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#45824;&#54620; &#47196;&#46300; &#44512;&#54805; &#51312;&#51221;&#51012; &#49324;&#50857; &#46608;&#45716; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-create.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54620; &#47532;&#49548;&#49828;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-display.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54620; &#47532;&#49548;&#49828;&#47484; &#45208;&#50676;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-enable-disable.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54620; &#47532;&#49548;&#49828;&#47484; &#49324;&#50857; &#46608;&#45716; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-edit.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54620; &#47532;&#49548;&#49828;&#47484; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-change-standalone-instance-ports.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#51032; &#54252;&#53944; &#48264;&#54840;&#47484; &#49688;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-set-props-standalone-instance.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54620; &#51064;&#49828;&#53556;&#49828; &#51204;&#50857; &#49549;&#49457;&#51012; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-mon-app-standalone-instance.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54620; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#47784;&#45768;&#53552;&#47553; &#45936;&#51060;&#53552;&#47484; &#48372;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-mon-server-standalone-instance.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54620; &#44032;&#49345; &#49436;&#48260; &#47784;&#45768;&#53552;&#47553; &#45936;&#51060;&#53552;&#47484; &#48372;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-mon-resource-standalone-instance.html">&#46021;&#47549;&#54805; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54620; &#47532;&#49548;&#49828; &#47784;&#45768;&#53552;&#47553; &#45936;&#51060;&#53552;&#47484; &#48372;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
