<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-gmscluster" name="task-gmscluster"></a><a id="GHCLU00079" name="GHCLU00079"></a></p>

<h4><a id="sthref220" name="sthref220"></a>&#53364;&#47084;&#49828;&#53552;&#50640; &#45824;&#54620; &#44536;&#47353; &#44288;&#47532; &#49436;&#48708;&#49828; &#49444;&#51221;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>GMS(&#44536;&#47353; &#44288;&#47532; &#49436;&#48708;&#49828;)&#45716; &#53364;&#47084;&#49828;&#53552; &#47784;&#45768;&#53552;&#47553;, &#53364;&#47084;&#49828;&#53552; &#47716;&#48260;&#49789; &#48143; &#44536;&#47353; &#53685;&#49888; &#49436;&#48708;&#49828;&#47484; &#51228;&#44277;&#54616;&#45716; in-process &#49436;&#48708;&#49828;&#51077;&#45768;&#45796;. GMS&#45716; &#45796;&#51020; &#44592;&#45733;&#51012; &#49688;&#54665;&#54633;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#54616;&#45208; &#51060;&#49345;&#51032; &#47716;&#48260; &#51064;&#49828;&#53556;&#49828;&#44032; &#53364;&#47084;&#49828;&#53552;&#50640; &#52628;&#44032;&#46104;&#44144;&#45208; &#53364;&#47084;&#49828;&#53552;&#50640;&#49436; &#51228;&#44144;&#46104;&#44144;&#45208; &#51109;&#50528;&#44032; &#48156;&#49373;&#54620; &#44163;&#51004;&#47196; &#51032;&#49900;&#46104;&#44144;&#45208; &#54869;&#51064;&#46104;&#47732; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#51032; &#46321;&#47197;&#46108; &#47784;&#46280;&#50640; &#50508;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>&#53364;&#47084;&#49828;&#53552; &#47716;&#48260; &#44036;&#50640; &#47700;&#49884;&#51648;&#47484; &#51452;&#44256; &#48155;&#51012; &#49688; &#51080;&#45716; &#44592;&#45733;&#51012; &#51228;&#44277;&#54633;&#45768;&#45796;.</p>
</li>
</ul>
<ol>
<li>
<p>&#53456;&#49353; &#53944;&#47532;&#50640;&#49436; [&#53364;&#47084;&#49828;&#53552;] &#45432;&#46300;&#47484; &#54869;&#51109;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>GMS(&#44536;&#47353; &#44288;&#47532; &#49436;&#48708;&#49828;) &#49444;&#51221;&#51012; &#44396;&#49457;&#54624; &#53364;&#47084;&#49828;&#53552;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#53364;&#47084;&#49828;&#53552;&#50640; &#45824;&#54620; [&#51068;&#48152; &#51221;&#48372;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[GMS &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#50668; &#53364;&#47084;&#49828;&#53552;&#50640; &#45824;&#54644; GMS&#47484; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49440;&#53469;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;. &#53364;&#47084;&#49828;&#53552;&#50640; &#45824;&#54644; GMS&#47484; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54616;&#47140;&#47732; [GMS &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#50640;&#49436; &#49440;&#53469; &#54364;&#49884;&#47484; &#51228;&#44144;&#54633;&#45768;&#45796;.</p>
<p>&#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#44536;&#47353; &#44288;&#47532; &#49436;&#48708;&#49828;&#44032; &#53364;&#47084;&#49828;&#53552; &#48143; DAS(&#46020;&#47700;&#51064; &#44288;&#47532; &#49436;&#48260;)&#51032; &#44033; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#50640;&#49436; &#49884;&#51089;&#46121;&#45768;&#45796;. GMS&#44032; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46108; &#44033; &#53364;&#47084;&#49828;&#53552;&#50640; DAS&#44032; &#52280;&#50668;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#47680;&#54000;&#52880;&#49828;&#53944; &#54252;&#53944;] &#54596;&#46300;&#50640; &#44536;&#47353; &#44288;&#47532; &#49436;&#48708;&#49828;&#44032; &#44536;&#47353; &#51060;&#48292;&#53944;&#47484; &#49688;&#49888;&#54616;&#45716; &#45936; &#49324;&#50857;&#54624; &#54252;&#53944;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>2048-49151 &#48276;&#50948;&#51032; &#54364;&#51456; UDP &#54252;&#53944; &#48264;&#54840;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; &#51060; &#48276;&#50948;&#50640;&#49436; &#51088;&#46041;&#51004;&#47196; &#49373;&#49457;&#46108; &#44050;&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#47680;&#54000;&#52880;&#49828;&#53944; &#51452;&#49548;] &#54596;&#46300;&#50640; &#44536;&#47353; &#44288;&#47532; &#49436;&#48708;&#49828;&#44032; &#44536;&#47353; &#51060;&#48292;&#53944;&#47484; &#49688;&#49888;&#54616;&#45716; &#45936; &#49324;&#50857;&#54624; &#51452;&#49548;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#53364;&#47000;&#49828; D IP &#47680;&#54000;&#52880;&#49828;&#53944; &#51452;&#49548;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;. &#53364;&#47000;&#49828; D IP &#51452;&#49548;&#45716; <code>224.0.0.0</code> &#51060;&#49345; <code>239.255.255.255</code> &#51060;&#54616; &#48276;&#50948;&#50640; &#51080;&#49845;&#45768;&#45796;. &#51452;&#49548; <code>224.0.0.0</code>&#45716; &#50696;&#50557;&#46104;&#50612; &#51080;&#50612; &#49324;&#50857;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 228.9.<i>XX</i>.<i>YY</i>&#51077;&#45768;&#45796;. &#50668;&#44592;&#49436; <i>XX</i><i>YY</i>&#45716; 0&#50640;&#49436; 255 &#49324;&#51060;&#51032; &#51088;&#46041;&#51004;&#47196; &#49373;&#49457;&#46108; &#46021;&#47549; &#44050;&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>&#46168; &#51060;&#49345;&#51032; &#45348;&#53944;&#50892;&#53356; &#51064;&#53552;&#54168;&#51060;&#49828;&#44032; &#51080;&#45716; &#44221;&#50864; [&#48148;&#51064;&#46300; &#51064;&#53552;&#54168;&#51060;&#49828; &#51452;&#49548;] &#54596;&#46300;&#50640; &#44536;&#47353; &#44288;&#47532; &#49436;&#48708;&#49828;&#50640; &#45824;&#54620; &#45348;&#53944;&#50892;&#53356; &#51064;&#53552;&#54168;&#51060;&#49828; &#51452;&#49548;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#53364;&#47084;&#49828;&#53552;&#51032; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#47484; &#54840;&#49828;&#54021;&#54616;&#45716; &#49884;&#49828;&#53596;&#50640; &#46168; &#51060;&#49345;&#51032; &#45348;&#53944;&#50892;&#53356; &#51064;&#53552;&#54168;&#51060;&#49828;&#44032; &#51080;&#45716; &#44221;&#50864; &#51060; &#49444;&#51221;&#51012; &#53685;&#54644; GMS&#50640; &#49324;&#50857;&#54624; &#45348;&#53944;&#50892;&#53356; &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#44396;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#44050;&#51008; &#47196;&#52972; &#45348;&#53944;&#50892;&#53356; &#51064;&#53552;&#54168;&#51060;&#49828; IP &#51452;&#49548;&#50668;&#50556; &#54633;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; &#47784;&#46304; &#44277;&#50857; &#45348;&#53944;&#50892;&#53356; &#51064;&#53552;&#54168;&#51060;&#49828; &#51452;&#49548;&#44032; &#49324;&#50857;&#46121;&#45768;&#45796;.</p>
<p>&#53364;&#47084;&#49828;&#53552;&#51032; &#47784;&#46304; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54644; &#51201;&#54633;&#54620; &#51452;&#49548;&#47484; &#51648;&#51221;&#54616;&#47140;&#47732; &#44033; &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54620; &#51452;&#49548;&#47484; &#44060;&#48324;&#51201;&#51004;&#47196; &#49444;&#51221;&#54616;&#45716; &#49884;&#49828;&#53596; &#49549;&#49457;&#51012; &#49324;&#50857;&#54633;&#45768;&#45796;.</p>
<p>&#50696;&#47484; &#46308;&#50612; DAS&#50640; &#49884;&#49828;&#53596; &#49549;&#49457; <code>GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i>&#51012; &#49373;&#49457;&#54633;&#45768;&#45796;. &#44536;&#47088; &#45796;&#51020; &#51060; &#48148;&#51064;&#46300; &#51064;&#53552;&#54168;&#51060;&#49828; &#51452;&#49548; &#50741;&#49496;&#51012; <code>${GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i><code>}</code>&#51004;&#47196; &#49444;&#51221;&#54616;&#50668; &#49884;&#49828;&#53596; &#49549;&#49457;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. &#47560;&#51648;&#47561;&#51004;&#47196;, &#53364;&#47084;&#49828;&#53552;&#51032; &#44033; &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54644; <code>GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i> &#49884;&#49828;&#53596; &#49549;&#49457;&#51012; &#51064;&#49828;&#53556;&#49828;&#51032; &#49884;&#49828;&#53596;&#50640; &#54596;&#50836;&#54620; &#45348;&#53944;&#50892;&#53356; &#51064;&#53552;&#54168;&#51060;&#49828; &#51452;&#49548;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#52628;&#44032; &#49549;&#49457;&#51012; &#51648;&#51221;&#54616;&#47140;&#47732; [&#49549;&#49457;] &#53485;&#51012; &#49440;&#53469;&#54620; &#45796;&#51020; [&#53364;&#47084;&#49828;&#53552; &#49549;&#49457;] &#54616;&#50948; &#53485;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#49549;&#49457;&#51012; &#52628;&#44032;&#54616;&#47140;&#47732; [&#49549;&#49457; &#52628;&#44032;] &#45800;&#52628;&#47484; &#45572;&#47493;&#45768;&#45796;. &#48712; &#54665;&#51060; &#54364;&#49884;&#46104;&#47732; [&#51060;&#47492;] &#54596;&#46300;&#50640; &#49549;&#49457; &#51060;&#47492;&#51012; &#51077;&#47141;&#54616;&#44256; [&#44050;] &#54596;&#46300;&#50640; &#49549;&#49457;&#44050;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#49549;&#49457;&#51012; &#49688;&#51221;&#54616;&#47140;&#47732; &#49549;&#49457;&#51032; [&#44050;] &#54596;&#46300;&#47484; &#54200;&#51665;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#49549;&#49457;&#51012; &#49325;&#51228;&#54616;&#47140;&#47732; &#49325;&#51228;&#54624; &#49549;&#49457;&#51032; [&#51060;&#47492;] &#54596;&#46300; &#50812;&#51901;&#50640; &#51080;&#45716; &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54620; &#45796;&#51020; [&#49549;&#49457; &#49325;&#51228;] &#45800;&#52628;&#47484; &#45572;&#47493;&#45768;&#45796;.</p>
</li>
</ul>
</li>
<li>
<p>[&#51200;&#51109;]&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
</li>
</ol>
<a id="sthref221" name="sthref221"></a>
<h5>&#44288;&#47144; &#54637;&#47785;</h5>
<ul>
<li>
<p><a href="task-gmsenable.html">&#44536;&#47353; &#44288;&#47532; &#49436;&#48708;&#49828;&#47484; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-gms.html">&#44536;&#47353; &#44288;&#47532; &#49436;&#48708;&#49828;&#47484; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
