<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-upgrade-components" name="task-upgrade-components"></a></p>

<h4><a id="sthref62" name="sthref62"></a><a id="sthref63" name="sthref63"></a><a id="sthref64" name="sthref64"></a><a id="sthref65" name="sthref65"></a>&#49436;&#48708;&#49828; &#49552;&#49892; &#50630;&#51060; &#44396;&#49457; &#50836;&#49548;&#47484; &#50629;&#44536;&#47112;&#51060;&#46300;&#54616;&#45716; &#48169;&#48277;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#53364;&#47084;&#49828;&#53552;&#46108; &#54872;&#44221;&#50640;&#49436; &#47204;&#47553; &#50629;&#44536;&#47112;&#51060;&#46300;&#45716; &#49436;&#48708;&#49828; &#48143; &#49464;&#49496; &#49552;&#49892;&#51012; &#52572;&#49548;&#54868;&#54616;&#50668; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#51116;&#48176;&#52824;&#54633;&#45768;&#45796;. &#49464;&#49496;&#51008; &#48373;&#51228;&#54624; &#49688; &#51080;&#45716; &#50500;&#54000;&#54057;&#53944;&#51077;&#45768;&#45796;. &#50696;&#47484; &#46308;&#47732; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<ul>
<li>
<p><code>HttpSession</code></p>
</li>
<li>
<p><code>SingleSignOn</code></p>
</li>
<li>
<p><code>ServletTimer</code></p>
</li>
<li>
<p><code>DialogFragment</code></p>
</li>
<li>
<p>Stateful Session Bean</p>
</li>
</ul>
<p>&#47196;&#46300; &#48184;&#47088;&#49436; &#48143; &#50668;&#47084; &#53364;&#47084;&#49828;&#53552;&#47484; &#49324;&#50857;&#54616;&#50668; &#49436;&#48708;&#49828; &#49552;&#49892; &#50630;&#51060; GlassFish Server&#50640;&#49436; &#44396;&#49457; &#50836;&#49548;&#47484; &#50629;&#44536;&#47112;&#51060;&#46300;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#50696;&#47484; &#46308;&#50612; &#44396;&#49457; &#50836;&#49548;&#45716; JVM &#49884;&#49828;&#53596;, GlassFish Server &#49548;&#54532;&#53944;&#50920;&#50612; &#46608;&#45716; &#50937; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51068; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#47204;&#47553; &#50629;&#44536;&#47112;&#51060;&#46300;&#45716; &#47196;&#46300;&#44032; &#44032;&#48316;&#50868; &#44163;&#50640;&#49436; &#48372;&#53685;&#51064; &#49692;&#49436;&#47196; &#49688;&#54665;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#51208;&#52264;&#47484; &#49688;&#54665;&#54616;&#45716; &#45936;&#50640;&#45716; &#44033; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#45817; &#50557; 10-15&#48516;&#51060; &#44152;&#47549;&#45768;&#45796;.</p>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51008; &#50629;&#44536;&#47112;&#51060;&#46300; &#51204;&#52404;&#50640;&#49436; &#54840;&#54872;&#46104;&#50612;&#50556; &#54633;&#45768;&#45796;. &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51008; &#51068;&#48512; &#51064;&#49828;&#53556;&#49828;&#44032; &#51060;&#51204; &#48260;&#51204;&#51012; &#49892;&#54665;&#54616;&#44256; &#51080;&#44256; &#45796;&#47480; &#51064;&#49828;&#53556;&#49828;&#44032; &#49352; &#48260;&#51204;&#51012; &#49892;&#54665;&#54616;&#44256; &#51080;&#51012; &#46412; &#51204;&#54872;&#54616;&#45716; &#46041;&#50504; &#51228;&#45824;&#47196; &#51089;&#46041;&#54644;&#50556; &#54633;&#45768;&#45796;. &#51060;&#51204; &#48260;&#51204;&#44284; &#49352; &#48260;&#51204;&#50640;&#45716; &#49464;&#49496;(&#50696;: &#48708;&#44284;&#46020;&#51201; &#51064;&#49828;&#53556;&#49828; &#48320;&#49688;)&#50640; &#51200;&#51109;&#46104;&#50612; &#51080;&#45716; &#44061;&#52404; &#44536;&#47000;&#54532;&#47484; &#54805;&#49457;&#54616;&#45716; &#46041;&#51068;&#54620; &#54805;&#49345;&#51032; &#51068;&#47144;&#54868; &#44032;&#45733; &#53364;&#47000;&#49828;&#44032; &#51080;&#50612;&#50556; &#54633;&#45768;&#45796;. &#51060;&#47084;&#54620; &#53364;&#47000;&#49828;&#51032; &#54805;&#49345;&#51012; &#48320;&#44221;&#54644;&#50556; &#54616;&#45716; &#44221;&#50864; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#44060;&#48156;&#51088;&#45716; &#50732;&#48148;&#47480; &#50672;&#49549;&#46108; &#46041;&#51089;&#51060; &#48156;&#49373;&#54616;&#45716;&#51648; &#54869;&#51064;&#54644;&#50556; &#54633;&#45768;&#45796;. &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#50629;&#44536;&#47112;&#51060;&#46300; &#51204;&#52404;&#50640;&#49436; &#54840;&#54872;&#46104;&#51648; &#50506;&#45716; &#44221;&#50864; &#53364;&#47084;&#49828;&#53552;&#44032; &#51204;&#52404; &#51116;&#48176;&#52824;&#50640; &#45824;&#54644; &#51221;&#51648;&#46104;&#50612;&#50556; &#54633;&#45768;&#45796;.</p>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#50629;&#44536;&#47112;&#51060;&#46300;&#54616;&#45716; &#45936; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#49828;&#53412;&#47560;&#44032; &#48320;&#44221;&#46104;&#45716; &#44221;&#50864; &#51060; &#51217;&#44540; &#48169;&#49885;&#51060; &#48520;&#44032;&#45733;&#54633;&#45768;&#45796;.</p>

<hr>
<p><b>&#51452;&#51032;:</b></p>
&#49464;&#49496;&#51060; &#48373;&#44396;&#46112; &#46412; &#48260;&#51204; &#48520;&#51068;&#52824;&#51032; &#50948;&#54744;&#51012; &#48169;&#51648;&#54616;&#47140;&#47732; &#53364;&#47084;&#49828;&#53552;&#50640; &#51080;&#45716; &#47784;&#46304; &#51064;&#49828;&#53556;&#49828;&#47484; &#46041;&#49884;&#50640; &#50629;&#44536;&#47112;&#51060;&#46300;&#54633;&#45768;&#45796;. &#44536;&#47111;&#51648; &#50506;&#51004;&#47732; &#49464;&#49496;&#51060; &#45796;&#47480; &#44396;&#49457; &#50836;&#49548; &#48260;&#51204;&#51060; &#49892;&#54665; &#51473;&#51064; &#51064;&#49828;&#53556;&#49828;&#47196; &#48373;&#44396;&#46112; &#49688; &#51080;&#49845;&#45768;&#45796;.
<hr>

<p>&#44033; &#53364;&#47084;&#49828;&#53552;&#50640; &#45824;&#54644; &#48324;&#46020;&#47196; &#51060; &#51089;&#50629;&#51012; &#49688;&#54665;&#54633;&#45768;&#45796;. &#53364;&#47084;&#49828;&#53552;&#45716; &#53364;&#47084;&#49828;&#53552;&#50640; &#51080;&#45716; &#51064;&#49828;&#53556;&#49828;&#51032; &#49464;&#49496; &#48373;&#44396;&#50640; &#45824;&#54620; &#50504;&#51204; &#44221;&#44228;&#51032; &#47204;&#51012; &#54633;&#45768;&#45796;. &#54620; &#53364;&#47084;&#49828;&#53552;&#50640; &#51080;&#45716; &#49464;&#49496;&#51008; &#45796;&#47480; &#53364;&#47084;&#49828;&#53552;&#50640; &#51080;&#45716; &#49464;&#49496;&#51004;&#47196; &#48373;&#44396;&#46112; &#49688; &#50630;&#49845;&#45768;&#45796;. &#44536;&#47084;&#48064;&#47196; &#48260;&#51204; &#48520;&#51068;&#52824;&#51032; &#50948;&#54744;&#51060; &#48169;&#51648;&#46121;&#45768;&#45796;.</p>
<ol>
<li>
<p>&#53364;&#47084;&#49828;&#53552;&#47484; &#51221;&#51648;&#54633;&#45768;&#45796;.</p>
<p><a href="task-stop-cluster.html">&#53364;&#47084;&#49828;&#53552;&#47484; &#51221;&#51648;&#54616;&#45716; &#48169;&#48277;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</li>
<li>
<p>&#54644;&#45817; &#53364;&#47084;&#49828;&#53552;&#51032; &#44396;&#49457; &#50836;&#49548;&#47484; &#50629;&#44536;&#47112;&#51060;&#46300;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#53364;&#47084;&#49828;&#53552;&#47484; &#49884;&#51089;&#54633;&#45768;&#45796;.</p>
<p><a href="task-start-cluster.html">&#53364;&#47084;&#49828;&#53552;&#47484; &#49884;&#51089;&#54616;&#45716; &#48169;&#48277;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</li>
</ol>
<a id="sthref66" name="sthref66"></a>
<h5>&#44288;&#47144; &#54637;&#47785;</h5>
<ul>
<li>
<p><a href="task-create-cluster.html">&#53364;&#47084;&#49828;&#53552;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-delete-cluster.html">&#53364;&#47084;&#49828;&#53552;&#47484; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-availabilityservice.html">&#53364;&#47084;&#49828;&#53552; &#44032;&#50857;&#49457; &#49444;&#51221;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-start-cluster.html">&#53364;&#47084;&#49828;&#53552;&#47484; &#49884;&#51089;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-stop-cluster.html">&#53364;&#47084;&#49828;&#53552;&#47484; &#51221;&#51648;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-modify-cluster-config.html">&#53364;&#47084;&#49828;&#53552; &#44396;&#49457;&#51012; &#49688;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-cluster-app-deploy.html">&#53364;&#47084;&#49828;&#53552;&#50640; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#48176;&#52824;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-cluster-app-list.html">&#53364;&#47084;&#49828;&#53552;&#50640; &#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#45208;&#50676;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-cluster-app-undeploy.html">&#53364;&#47084;&#49828;&#53552;&#50640;&#49436; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#48176;&#52824;&#47484; &#54644;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-cluster-app-remove.html">&#53364;&#47084;&#49828;&#53552;&#50640;&#49436; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#51228;&#44144;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-cluster-app-edit.html">&#53364;&#47084;&#49828;&#53552;&#50640; &#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-cluster-app-enable-disable.html">&#53364;&#47084;&#49828;&#53552;&#50640; &#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#49324;&#50857; &#46608;&#45716; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-cluster-app-lb-enable-disable.html">&#53364;&#47084;&#49828;&#53552;&#50640; &#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#45824;&#54620; &#47196;&#46300; &#44512;&#54805; &#51312;&#51221;&#51012; &#49324;&#50857; &#46608;&#45716; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-create.html">&#53364;&#47084;&#49828;&#53552;&#50640; &#45824;&#54620; &#47532;&#49548;&#49828;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-display.html">&#53364;&#47084;&#49828;&#53552;&#50640; &#45824;&#54620; &#47532;&#49548;&#49828;&#47484; &#45208;&#50676;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-enable-disable.html">&#47532;&#49548;&#49828;&#47484; &#51204;&#50669;&#51201;&#51004;&#47196; &#49324;&#50857; &#46608;&#45716; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-edit.html">&#53364;&#47084;&#49828;&#53552;&#50640; &#45824;&#54620; &#47532;&#49548;&#49828;&#47484; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
