<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-deletenode" name="task-deletenode"></a><a id="GHCLU00082" name="GHCLU00082"></a></p>

<h4><a id="sthref228" name="sthref228"></a>&#45432;&#46300;&#47484; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#45432;&#46300;&#47484; &#49325;&#51228;&#54616;&#47732; DAS(&#46020;&#47700;&#51064; &#44288;&#47532; &#49436;&#48260;)&#51032; &#44396;&#49457;&#50640;&#49436; &#45432;&#46300;&#44032; &#51228;&#44144;&#46121;&#45768;&#45796;. &#45432;&#46300;&#50640; &#51080;&#45716; &#47560;&#51648;&#47561; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#44032; &#49325;&#51228;&#46104;&#47732; &#45432;&#46300;&#51032; &#46356;&#47113;&#53664;&#47532; &#48143; &#54028;&#51068;&#51060; &#49325;&#51228;&#46121;&#45768;&#45796;.</p>
<p>&#45432;&#46300;&#44032; &#49325;&#51228;&#46112; &#46412; &#45432;&#46300; &#54840;&#49828;&#53944;&#50640;&#49436; GlassFish Server &#49548;&#54532;&#53944;&#50920;&#50612;&#51032; &#49444;&#52824;&#44032; &#51228;&#44144;&#46104;&#46020;&#47197; &#49440;&#53469;&#54624; &#49688;&#46020; &#51080;&#49845;&#45768;&#45796;.</p>
<a id="sthref229" name="sthref229"></a>
<h5>&#49884;&#51089;&#54616;&#44592; &#51204;&#50640;</h5>
<p>&#49325;&#51228;&#54624; &#45432;&#46300;&#50640; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#44032; &#50630;&#45716;&#51648; &#54869;&#51064;&#54633;&#45768;&#45796;.</p>
<ol>
<li>
<p>&#53456;&#49353; &#53944;&#47532;&#50640;&#49436; [&#45432;&#46300;] &#45432;&#46300;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>[&#45432;&#46300;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>&#49325;&#51228;&#54624; &#44033; &#45432;&#46300;&#50640; &#45824;&#54644; &#45432;&#46300; &#53580;&#51060;&#48660;&#50640;&#49436; &#45432;&#46300; &#50694;&#50640; &#51080;&#45716; &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>

<hr>
<p><b>&#51452;:</b></p>
&#48120;&#47532; &#51221;&#51032;&#46108; &#45432;&#46300; <code>localhost-</code><i>domain</i>&#51008; &#49325;&#51228;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
<hr>

</li>
<li>
<p>&#45800;&#52628;&#47484; &#45580;&#47084; &#45432;&#46300;&#47484; &#49325;&#51228;&#54616;&#44144;&#45208; &#45432;&#46300;&#47484; &#49325;&#51228;&#54620; &#45796;&#51020; &#45432;&#46300; &#54840;&#49828;&#53944;&#50640;&#49436; GlassFish Server &#49548;&#54532;&#53944;&#50920;&#50612;&#51032; &#49444;&#52824;&#47484; &#51228;&#44144;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<ul>
<li>
<p>GlassFish Server &#49548;&#54532;&#53944;&#50920;&#50612;&#51032; &#49444;&#52824;&#47484; &#51228;&#44144;&#54616;&#51648; &#50506;&#44256; &#45432;&#46300;&#47484; &#49325;&#51228;&#54616;&#47140;&#47732; [&#49325;&#51228;]&#47484; &#45572;&#47493;&#45768;&#45796;.</p>
<p>&#45432;&#46300;&#47484; &#49325;&#51228;&#54624; &#44163;&#51064;&#51648; &#54869;&#51064;&#54616;&#45716; &#47700;&#49884;&#51648;&#44032; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>&#45432;&#46300;&#47484; &#49325;&#51228;&#54620; &#45796;&#51020; &#45432;&#46300; &#54840;&#49828;&#53944;&#50640;&#49436; GlassFish Server &#49548;&#54532;&#53944;&#50920;&#50612;&#51032; &#49444;&#52824;&#47484; &#51228;&#44144;&#54616;&#47140;&#47732; [&#49325;&#51228; &#48143; &#49444;&#52824; &#54644;&#51228;]&#47484; &#45572;&#47493;&#45768;&#45796;.</p>
<p>&#45432;&#46300;&#47484; &#49325;&#51228;&#54620; &#45796;&#51020; &#45432;&#46300; &#54840;&#49828;&#53944;&#50640;&#49436; GlassFish Server &#49548;&#54532;&#53944;&#50920;&#50612;&#51032; &#49444;&#52824;&#47484; &#51228;&#44144;&#54624;&#51648; &#54869;&#51064;&#54616;&#45716; &#47700;&#49884;&#51648;&#44032; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>

<hr>
<p><b>&#51452;:</b></p>
CONFIG &#50976;&#54805;&#51032; &#45432;&#46300;&#44032; &#45208;&#53440;&#45236;&#45716; &#54840;&#49828;&#53944;&#50640;&#49436;&#45716; GlassFish Server &#49548;&#54532;&#53944;&#50920;&#50612;&#51032; &#49444;&#52824;&#47484; &#51228;&#44144;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#45432;&#46300;&#47564; &#49325;&#51228;&#46121;&#45768;&#45796;.
<hr>

</li>
</ul>
</li>
<li>
<p>&#45432;&#46300;&#47484; &#49325;&#51228;&#54624;&#51648; &#50500;&#45768;&#47732; &#45432;&#46300;&#47484; &#49325;&#51228;&#54620; &#45796;&#51020; &#45432;&#46300; &#54840;&#49828;&#53944;&#50640;&#49436; GlassFish Server &#49548;&#54532;&#53944;&#50920;&#50612;&#51032; &#49444;&#52824;&#47484; &#51228;&#44144;&#54624;&#51648; &#54869;&#51064;&#54633;&#45768;&#45796;.</p>
<p>&#45432;&#46300;&#44032; &#49325;&#51228;&#46104;&#44256; [&#45432;&#46300;] &#54168;&#51060;&#51648;&#51032; &#45432;&#46300; &#53580;&#51060;&#48660;&#50640;&#49436; &#51228;&#44144;&#46121;&#45768;&#45796;. [&#49325;&#51228; &#48143; &#49444;&#52824; &#54644;&#51228;]&#47484; &#45572;&#47476;&#47732; GlassFish Server &#49548;&#54532;&#53944;&#50920;&#50612;&#46020; &#45432;&#46300; &#54840;&#49828;&#53944;&#50640;&#49436; &#51228;&#44144;&#46121;&#45768;&#45796;.</p>
</li>
</ol>
<a id="sthref230" name="sthref230"></a>
<h5>&#44288;&#47144; &#54637;&#47785;</h5>
<ul>
<li>
<p><a href="task-createnode.html">&#45432;&#46300;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-listnodes.html">&#54788;&#51116; &#46020;&#47700;&#51064;&#51032; &#47784;&#46304; &#45432;&#46300;&#47484; &#45208;&#50676;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-pingnode.html">&#50672;&#44208; &#44032;&#45733;&#54620; &#45432;&#46300;&#51064;&#51648; &#53580;&#49828;&#53944;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-editnode.html">&#45432;&#46300;&#47484; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
