<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-nodenewdcom" name="task-nodenewdcom"></a></p>
<!-- infolevel="all" infotype="General" -->
<h4>DCOM &#45432;&#46300; &#49373;&#49457;&#51012; &#50756;&#47308;&#54616;&#45716; &#48169;&#48277;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#51060; &#51089;&#50629;&#51008; DCOM &#45432;&#46300;&#51032; <a href="task-createnode.html">&#45432;&#46300;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a>&#50640; &#51060;&#50612;&#49436; &#49688;&#54665;&#46104;&#45716; &#51089;&#50629;&#51077;&#45768;&#45796;.</p>
<ol>
<li>
<p>GlassFish Server &#49548;&#54532;&#53944;&#50920;&#50612;&#47484; DAS &#54840;&#49828;&#53944;&#50640;&#49436; &#45432;&#46300; &#54840;&#49828;&#53944;&#47196; &#48373;&#49324;&#54616;&#47140;&#47732; [GlassFish Server &#49444;&#52824;] &#50741;&#49496;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#45432;&#46300; &#47588;&#44060;&#48320;&#49688; &#44160;&#51613;&#51060; &#49892;&#54056;&#54616;&#45908;&#46972;&#46020; DAS(&#46020;&#47700;&#51064; &#44288;&#47532; &#49436;&#48260;) &#44396;&#49457;&#50640; &#45432;&#46300;&#44032; &#49373;&#49457;&#46104;&#46020;&#47197; &#54616;&#47140;&#47732; [&#44053;&#51228; &#51201;&#50857;] &#50741;&#49496;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#45432;&#46300;&#47484; &#49373;&#49457;&#54616;&#44592; &#51204;&#50640; GlassFish Server&#50640;&#49436; DCOM&#51012; &#53685;&#54620; &#45432;&#46300; &#54840;&#49828;&#53944; &#51217;&#49549;&#51012; &#53580;&#49828;&#53944;&#54616;&#46020;&#47197; &#54616;&#47140;&#47732; &#45796;&#51020; &#45800;&#44228;&#47484; &#49688;&#54665;&#54633;&#45768;&#45796;.</p>
<ol type="a">
<li>
<p>[DCOM &#44160;&#51613;] &#50741;&#49496;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#50896;&#44201; &#53580;&#49828;&#53944; &#46356;&#47113;&#53664;&#47532;] &#54596;&#46300;&#50640; &#51217;&#49549; &#53580;&#49828;&#53944;&#47484; &#50948;&#54644; GlassFish Server&#50640;&#49436; &#54028;&#51068;&#51012; &#49373;&#49457;&#54644;&#50556; &#54616;&#45716; &#50896;&#44201; &#54840;&#49828;&#53944; &#54260;&#45908;&#51032; &#51060;&#47492;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
</li>
</ol>
</li>
<li>
<p>[Windows &#46020;&#47700;&#51064;] &#54596;&#46300;&#50640; [Windows &#49324;&#50857;&#51088; &#51060;&#47492;] &#50741;&#49496;&#50640; &#51648;&#51221;&#46108; &#49324;&#50857;&#51088;&#47484; &#54252;&#54632;&#54616;&#45716; Windows &#46020;&#47700;&#51064;&#51032; &#51060;&#47492;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[Windows &#49324;&#50857;&#51088; &#51060;&#47492;] &#54596;&#46300;&#50640; DCOM&#51012; &#53685;&#54644; &#54840;&#49828;&#53944;&#50640; &#51217;&#49549;&#54616;&#44592; &#50948;&#54620; &#54532;&#47196;&#49464;&#49828;&#47484; &#49892;&#54665;&#54624; &#51060; &#45432;&#46300; &#54840;&#49828;&#53944;&#51032; &#49324;&#50857;&#51088; &#51060;&#47492;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#51060; &#45432;&#46300; &#54840;&#49828;&#53944;&#50640; &#47196;&#44536;&#51064;&#54624; &#46412; Windows &#49324;&#50857;&#51088; &#51064;&#51613; &#48169;&#49885;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>

<hr>
<p><b>&#51452;:</b></p>
GlassFish Server&#50640;&#49436;&#45716; &#48708;&#48128;&#48264;&#54840; &#54028;&#51068;&#51032; <code>AS_ADMIN_WINDOWSPASSWORD</code> &#54637;&#47785;&#51012; &#53685;&#54620; &#48708;&#48128;&#48264;&#54840; &#51064;&#51613;&#46020; &#51648;&#50896;&#54633;&#45768;&#45796;. &#48708;&#48128;&#48264;&#54840; &#54028;&#51068;&#51008; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00263"><code>asadmin</code>(1)</a> &#50976;&#54008;&#47532;&#54000;&#51032; <code>--paswordfile</code> &#50741;&#49496;&#50640; &#51648;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.
<hr>

<ol type="a">
<li>
<p>DAS &#44396;&#49457;&#50640; &#51200;&#51109;&#46108; &#48708;&#48128;&#48264;&#54840;&#47484; &#53685;&#54644; &#51064;&#51613;&#51012; &#51648;&#51221;&#54616;&#47140;&#47732; &#45796;&#51020; &#45800;&#44228;&#47484; &#49688;&#54665;&#54633;&#45768;&#45796;.</p>

<hr>
<p><b>&#51452;&#51032;:</b></p>
&#51060; &#48708;&#48128;&#48264;&#54840;&#45716; DAS &#44396;&#49457;&#50640; &#51068;&#48152; &#53581;&#49828;&#53944;&#47196; &#51200;&#51109;&#46121;&#45768;&#45796;. &#48372;&#50504; &#54693;&#49345;&#51012; &#50948;&#54644; &#48708;&#48128;&#48264;&#54840; &#48324;&#52845;&#51012; &#49324;&#50857;&#54616;&#49901;&#49884;&#50724;.
<hr>

<ol>
<li>
<p>[Windows &#49324;&#50857;&#51088; &#51064;&#51613;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#48708;&#48128;&#48264;&#54840;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[Windows &#49324;&#50857;&#51088; &#48708;&#48128;&#48264;&#54840;] &#54596;&#46300;&#50640; Windows &#49324;&#50857;&#51088;&#44032; &#51060; &#45432;&#46300; &#54840;&#49828;&#53944;&#50640; &#47196;&#44536;&#51064;&#54624; &#46412; &#49324;&#50857;&#54616;&#45716; &#48708;&#48128;&#48264;&#54840;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
</li>
</ol>
</li>
<li>
<p>&#48708;&#48128;&#48264;&#54840; &#48324;&#52845;&#51012; &#53685;&#54644; &#51064;&#51613;&#51012; &#51648;&#51221;&#54616;&#47140;&#47732; &#45796;&#51020; &#45800;&#44228;&#47484; &#49688;&#54665;&#54633;&#45768;&#45796;.</p>
<ol>
<li>
<p>[Windows &#49324;&#50857;&#51088; &#51064;&#51613;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#48708;&#48128;&#48264;&#54840; &#48324;&#52845;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#48708;&#48128;&#48264;&#54840; &#48324;&#52845;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#44592;&#51316; &#48324;&#52845;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</li>
</ol>
</li>
</ol>
</li>
<li>
<p>[&#51200;&#51109;]&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
</li>
</ol>
<a id="sthref226" name="sthref226"></a>
<h5>&#44288;&#47144; &#54637;&#47785;</h5>
<p><a href="task-createnode.html">&#45432;&#46300;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
