<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Ficha Editar atributos avanzados del conjunto de conexiones - Ayuda en l&#237;nea de la Consola de administraci&#243;n de GlassFish Enterprise Server v3 Prelude de Sun
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>

</head>

<body class="HlpBdy">

<a name="gentextid-4098"></a><h4><a name="ref-jdbcconnpooladvanceattrtab"></a>Ficha Editar atributos avanzados del conjunto de conexiones</h4>
<p>Para ayudar a diagnosticar p&#233;rdidas de conexi&#243;n y a mejorar la facilidad
de uso, se ofrecen atributos avanzados para configurar un conjunto de conexiones
durante su creaci&#243;n.</p><dl><dt>Nombre</dt>
<dd><p>Campo de s&#243;lo lectura que identifica el nombre del conjunto de conexiones.</p></dd>
<dt>Tiempo de espera de instrucci&#243;n</dt>
<dd><p>Tiempo de espera, en segundos, tras el que finalizar&#225;n las consultas cuya ejecuci&#243;n se prolonga de modo inusual.Servidor empresarial establecer&#225; "QueryTimeout" en las instrucciones creadas. El valor predeterminado -1 significa que el atributo no est&#225; activado.</p></dd>
<dt>Ajustar objetos JDBC</dt>
<dd><p>Cuando este campo se establece en "true" (verdadero), las aplicaciones obtendr&#225;n objetos JDBC ajustados para <tt>Statement</tt>, <tt>PreparedStatement</tt>, <tt>CallableStatement</tt>, <tt>ResultSet</tt> y <tt>DatabaseMetaData</tt>. El valor predeterminado es Falso.</p></dd>
<dt>Validar m&#225;ximo una vez</dt>
<dd><p>Tiempo en segundos tras el que una conexi&#243;n se valida como m&#225;ximo una vez. Esto ayudar&#225; a reducir el n&#250;mero de solicitudes de validaci&#243;n para una conexi&#243;n. El valor predeterminado 0 significa que la validaci&#243;n de conexi&#243;n no est&#225; activada.</p></dd>
<dt>Tiempo de espera de p&#233;rdidas</dt>
<dd><p>Tiempo en segundos para realizar un seguimiento de las p&#233;rdidas de conexi&#243;n en un conjunto de conexiones. El valor predeterminado 0 significa que el seguimiento de p&#233;rdidas de conexi&#243;n est&#225; desactivado. Si el seguimiento de p&#233;rdidas de conexi&#243;n est&#225; activado, puede obtener estad&#237;sticas sobre el n&#250;mero de p&#233;rdidas de conexi&#243;n en la ficha Recursos de supervisi&#243;n. Para ver esta ficha, vaya a Application Server -&gt;Supervisi&#243;n-&gt; Recursos.</p></dd>
<dt>Reclamaci&#243;n de p&#233;rdidas</dt>
<dd><p>Si esta opci&#243;n est&#225; habilitada, las conexiones perdidas se restablecer&#225;n en el conjunto tras completar un seguimiento de las p&#233;rdidas de conexi&#243;n.</p></dd>
<dt>Intentos de creaci&#243;n</dt>
<dd><p>N&#250;mero de intentos que se realizar&#225;n si se produce un fallo en la creaci&#243;n de una nueva conexi&#243;n. El valor predeterminado 0 significa que no se realizar&#225;n intentos para volver a crear la conexi&#243;n.</p></dd>
<dt>Intervalo de reintentos</dt>
<dd><p>Intervalo de tiempo, en segundos, entre dos intentos para crear una conexi&#243;n. El valor predeterminado es 10 segundos. Este atributo se utiliza s&#243;lo si el valor de Intentos de creaci&#243;n es mayor que 0.</p></dd>
<dt>Asociaci&#243;n m&#237;nima</dt>
<dd><p>Si esta opci&#243;n est&#225; habilitada, las conexiones estar&#225;n ligeramente asociadas cuando se realice una operaci&#243;n con ellas. Adem&#225;s, se disocian cuando la transacci&#243;n se completa y un m&#233;todo de componentes finaliza, lo que ayuda a reutilizar las conexiones f&#237;sicas. Esta opci&#243;n est&#225; deshabilitada de forma predeterminada.</p></dd>
<dt>Registro de conexiones m&#237;nimo</dt>
<dd><p>Si esta opci&#243;n est&#225; deshabilitada, s&#243;lo se da de alta un recurso en la transacci&#243;n cuando se utiliza realmente en un m&#233;todo.</p></dd>
<dt>Asociar con subproceso</dt>
<dd><p>Si esta opci&#243;n est&#225; deshabilitada, se realiza una asociaci&#243;n entre una conexi&#243;n y el subproceso de forma que cuando el mismo subproceso necesite una conexi&#243;n, se pueda utilizar la conexi&#243;n ya asociada a ese subproceso y, por tanto, no se incurra en una sobrecarga a la hora de obtener una conexi&#243;n del conjunto. El valor predeterminado est&#225; desactivado.</p></dd>
<dt>Coincidir conexiones</dt>
<dd><p>Si esta opci&#243;n est&#225; habilitada, la coincidencia de conexi&#243;n del conjunto se activa/desactiva. Se puede deshabilitar si el administrador sabe que las conexiones del conjunto siempre ser&#225;n homog&#233;neas y, por tanto, para una conexi&#243;n recogida del conjunto no se necesita establecer una correspondencia mediante el adaptador de recursos. Esta opci&#243;n est&#225; deshabilitada de forma predeterminada.</p></dd>
<dt>Uso m&#225;ximo de conexi&#243;n</dt>
<dd><p>N&#250;mero de veces que una conexi&#243;n se puede reutilizar en el conjunto. Una vez que una conexi&#243;n se reutilice el n&#250;mero de veces especificado, se cerrar&#225;. Esto es &#250;til, por ejemplo, para evitar p&#233;rdidas por instrucci&#243;n. El valor predeterminado 0 significa que el atributo no est&#225; activado.</p></dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-setdbaccess.html">Para configurar el acceso a una base de datos</a></p></li>
<li><p><a href="task-integratejdbcdriver.html">Para integrar un controlador JDBC</a></p></li>
<li><p><a href="task-jdbcresourcenew.html">Para crear un recurso JDBC</a></p></li>
<li><p><a href="task-jdbcresourcesedit.html">Para editar un recurso JDBC</a></p></li>
<li><p><a href="task-jdbcresourcesdelete.html">Para eliminar un recurso JDBC</a></p></li>
<li><p><a href="task-jdbcconnectionpoolnew.html">Para crear un conjunto de conexiones JDBC</a></p></li>
<li><p><a href="task-jdbcconnectionpooledit.html">Para editar la configuraci&#243;n general del conjunto de conexiones JDBC</a></p></li>
<li><p><a href="task-jdbcconnectionpooladvance.html">Para editar atributos avanzados del conjunto de conexiones JDBC</a></p></li>
<li><p><a href="task-verifyconnpoolsettings.html">Para verificar la configuraci&#243;n del conjunto de conexiones</a></p></li>
<li><p><a href="task-jdbcconnectionpoolproperty.html">Para editar las propiedades del conjunto de conexiones JDBC</a></p></li>
<li><p><a href="task-jdbcconnectionpooldelete.html">Para eliminar un conjunto de conexiones JDBC</a></p></li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://docs.sun.com/doc/820-4497/add-resources-1?a=view"><tt>add-resources</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/create-jdbc-resource-1?a=view"><tt>create-jdbc-resource</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/delete-jdbc-resource-1?a=view"><tt>delete-jdbc-resource</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/list-jdbc-resources-1?a=view"><tt>list-jdbc-resources</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/create-jdbc-connection-pool-1?a=view"><tt>create-jdbc-connection-pool</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/delete-jdbc-connection-pool-1?a=view"><tt>delete-jdbc-connection-pool</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/list-jdbc-connection-pools-1?a=view"><tt>list-jdbc-connection-pools</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/ping-connection-pool-1?a=view"><tt>ping-connection-pool</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/start-database-1?a=view"><tt>start-database</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/stop-database-1?a=view"><tt>stop-database</tt>(1)</a></p></li></ul>

<br/>

</body>
</html>
