<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Ficha Editar escucha HTTP - Ayuda en l&#237;nea de la Consola de administraci&#243;n de GlassFish Enterprise Server v3 Prelude de Sun
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>

</head>

<body class="HlpBdy">

<a name="httplisteneredittab"></a><h4>Ficha Editar escucha HTTP</h4>
<p>Al editar el socket de escucha HTTP, Servidor empresarial puede procesar r&#225;pidamente
solicitudes HTTP.</p><dl><dt>Nombre</dt>
<dd><p>Identificador exclusivo de s&#243;lo lectura para la escucha.</p></dd>
<dt>Escucha</dt>
<dd><p>Introduzca una direcci&#243;n IP v&#225;lida para el servidor. </p></dd>
<dt>Seguridad</dt>
<dd><p>Disponible en cl&#250;steres y perfiles empresariales. Crea una escucha segura.</p></dd>
<dt>Direcci&#243;n de red</dt>
<dd><p>Introduzca 0.0.0.0 para la direcci&#243;n de red si desea que la escucha atienda a todas las direcciones IP del servidor mediante un valor de puerto exclusivo.</p></dd>
<dt>Puerto de escucha</dt>
<dd><p>Valor de puerto de escucha &#250;nico si el campo Direcci&#243;n de red es 0.0.0.0 o el valor de puerto deseado si utiliza otra direcci&#243;n IP.</p></dd>
<dt>Servidor virtual predeterminado</dt>
<dd><p>Seleccione un servidor virtual en la lista desplegable.</p></dd>
<dt>Nombre de servidor</dt>
<dd><p>Nombre de host que se debe utilizar en las URL que el servidor env&#237;a al cliente. Este nombre es el alias si el servidor hace uso de un nombre de alias. Si el servidor no utiliza un alias, deje el campo en blanco.</p></dd>
<dt>Redireccionar puerto</dt>
<dd><p>Introduzca un valor de puerto para redireccionar la solicitud a otro puerto. Servidor empresarial redirecciona autom&#225;ticamente la solicitud si se dan las dos condiciones siguientes:</p>
<ul><li><p>La escucha admite otras solicitudes que no son SSL.</p></li>
<li><p>Se recibe una solicitud para la que una restricci&#243;n de seguridad coincidente requiere transporte SSL.</p><p>Servidor empresarial utiliza el n&#250;mero de puerto especificado en la solicitud original de forma predeterminada.</p></li></ul>
</dd>
<dt>Subprocesos del aceptador</dt>
<dd><p>N&#250;mero de subprocesos del aceptador. El valor predeterminado es 1.</p></dd>
<dt>Funciona con</dt>
<dd><p>Desactive la casilla para deshabilitar la inclusi&#243;n del encabezado <tt>X-Powered-By: Servlet/2.4</tt> en encabezados de respuesta HTTP generados por servlet.</p><p>La especificaci&#243;n Java Servlet 2.4 define este encabezado, que los contenedores pueden agregar a respuestas generadas por Servlet. De modo similar, la especificaci&#243;n JavaServer Pages (JSP) 2.0 define un encabezado <tt>X-Powered-By: JSP/2.0</tt> para que se agregue (de forma opcional) a respuestas que utilizan la tecnolog&#237;a JSP. La inclusi&#243;n del encabezado <tt>X-Powered-By: JSP/2.0</tt> est&#225; activada de forma predeterminada para las aplicaciones web. El objetivo de estos encabezados es permitir a los administradores de sitios web recabar datos estad&#237;sticos sobre el uso de Servlet y la tecnolog&#237;a JSP. </p><p>Para obtener informaci&#243;n sobre c&#243;mo habilitar y deshabilitar el encabezado <tt>X-Powered-By</tt> para p&#225;ginas JSP, consulte el <a href="http://docs.sun.com/doc/820-4502/beaqi?a=view">Ap&#233;ndice A, <i>Deployment Descriptor Files</i> de <i>Sun GlassFish Enterprise Server v3 Prelude Application Deployment Guide</i></a>. </p><p>Los entornos de producci&#243;n pueden decidir omitir la generaci&#243;n de encabezados <tt>X-Powered-By</tt> para ocultar su tecnolog&#237;a subyacente.</p></dd>
<dt>Bloqueo</dt>
<dd><p>Activar bloqueo de escuchas y puertos externos.</p></dd>
<dt>Propiedades adicionales</dt>
<dd><p>Agregar propiedades a la escucha.</p></dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-httplistenerssl.html">C&#243;mo configurar una escucha HTTP para que utilice SSL</a></p></li>
<li><p><a href="task-httplistenerdelete.html">Para eliminar una escucha HTTP</a></p></li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://docs.sun.com/doc/820-4497/create-http-listener-1?a=view"><tt>create-http-listener</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/delete-http-listener-1?a=view"><tt>delete-http-listener</tt>(1)</a></p></li></ul>

<br/>

</body>
</html>
