<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-redeploy"></a><h4>Volver a implementar aplicaciones o m&#243;dulos</h4>
<p>Utilice la p&#225;gina Volver a implementar aplicaciones o m&#243;dulos para implementar de
nuevo una aplicaci&#243;n previamente implementada.</p><p>La p&#225;gina Volver a implementar aplicaciones o m&#243;dulos contiene las siguientes opciones.</p><dl><dt>Nombre</dt>
<dd><p>Campo de s&#243;lo lectura que muestra el nombre de la aplicaci&#243;n que est&#225; volviendo a implementar.</p></dd>
<dt>Conservar sesiones</dt>
<dd><p>Si est&#225; marcada la casilla de verificaci&#243;n Conservar sesiones, se preservar&#225;n las sesiones activas de la aplicaci&#243;n que est&#233; volviendo a implementar y despu&#233;s se restaurar&#225;n, cuando la nueva implementaci&#243;n se haya completado.</p><p>Si en alguna sesi&#243;n activa se produce alg&#250;n fallo en la preservaci&#243;n o restauraci&#243;n de la aplicaci&#243;n, no habr&#225; disponible <b>ninguna</b> sesi&#243;n cuando se haya completado la nueva implementaci&#243;n. Sin embargo, la reimplementaci&#243;n continuar&#225; y se registrar&#225; una advertencia.</p><p>Para preservar las sesiones activas, Servidor empresarial serializa las sesiones y las guarda en memoria. Para restaurar las sesiones, el cargador de clases de la aplicaci&#243;n que se acaba de volver a implementar deserializa cualquier sesi&#243;n que se hubiera guardado previamente.</p></dd>
<dt>Ubicaci&#243;n</dt>
<dd><p>Ubicaci&#243;n del nuevo archivo de almacenamiento para la aplicaci&#243;n que est&#225; volviendo a implementar.</p><p>Las siguientes opciones especifican desde d&#243;nde se puede acceder al archivo de almacenamiento y si es un archivo o directorio.</p><dl><dt>Archivo empaquetado que se cargar&#225; en el servidor</dt>
<dd><p>El archivo de almacenamiento se encuentra en un archivo que reside en la m&#225;quina cliente o al que se puede acceder desde la m&#225;quina cliente.</p><p>La m&#225;quina cliente es el host en el que est&#225; viendo la Consola de administraci&#243;n por medio de un navegador.</p></dd>
<dt>Directorio o archivo empaquetado local al que se puede acceder desde el servidor de aplicaciones</dt>
<dd><p>El archivo de almacenamiento es un archivo que reside en la m&#225;quina servidor o es una aplicaci&#243;n desempaquetada en un directorio de despliegue.</p><p>La m&#225;quina servidor es el host que ejecuta el servidor de administraci&#243;n de dominio del servidor de aplicaciones. </p></dd>
</dl>
</dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-appredeploy.html">C&#243;mo volver a implementar una aplicaci&#243;n implementada</a></p></li>
<li><p><a href="task-appdeployweb.html">C&#243;mo implementar una aplicaci&#243;n web</a></p></li>
<li><p><a href="task-deployentapp.html">Implementaci&#243;n de una aplicaci&#243;n empresarial</a></p></li>
<li><p><a href="task-appdeployclient.html">Implementar un cliente de aplicaciones</a></p></li>
<li><p><a href="task-appdeployconn.html">Implementaci&#243;n de un m&#243;dulo del conector</a></p></li>
<li><p><a href="task-appdeployejb.html">Implementaci&#243;n de un JAR EJB</a></p></li>
<li><p><a href="task-appdeployruby.html">Implementaci&#243;n de una aplicaci&#243;n de Ruby</a></p></li>
<li><p><a href="task-appedit.html">Para editar una aplicaci&#243;n implementada</a></p></li>
<li><p><a href="task-appviewdesc.html">C&#243;mo ver los descriptores de una aplicaci&#243;n</a></p></li>
<li><p><a href="task-applaunch.html">C&#243;mo iniciar una aplicaci&#243;n</a></p></li>
<li><p><a href="task-apprestart.html">C&#243;mo reiniciar una aplicaci&#243;n implementada</a></p></li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://docs.sun.com/doc/820-7701/deploy-1?a=view"><tt>deploy</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/redeploy-1?a=view"><tt>redeploy</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/list-applications-1?a=view"><tt>list-applications</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/list-modules-1?a=view"><tt>list-modules</tt>(1)</a></p></li></ul>

