<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-uploaddev"></a><h4>Implementar aplicaciones o m&#243;dulos</h4>
<p>Utilice la p&#225;gina Implementar aplicaciones o m&#243;dulos para implementar una aplicaci&#243;n.</p><p>La p&#225;gina Implementar aplicaciones o m&#243;dulos contiene las opciones siguientes para todas
las aplicaciones. &#218;nicamente aparecen m&#225;s opciones en caso de que especifique el
campo Ubicaci&#243;n para la aplicaci&#243;n.</p><dl><dt>Ubicaci&#243;n</dt>
<dd><p>Ubicaci&#243;n del archivo de almacenamiento para la aplicaci&#243;n que est&#225; implementando.</p><p>Las siguientes opciones especifican desde d&#243;nde se puede acceder al archivo de almacenamiento y si es un archivo o directorio.</p><dl><dt>Archivo empaquetado que se cargar&#225; en el servidor</dt>
<dd><p>El archivo de almacenamiento se encuentra en un archivo que reside en la m&#225;quina cliente o al que se puede acceder desde la m&#225;quina cliente.</p><p>La m&#225;quina cliente es el host en el que est&#225; viendo la Consola de administraci&#243;n por medio de un navegador.</p></dd>
<dt>Directorio o archivo empaquetado local al que se puede acceder desde Servidor empresarial</dt>
<dd><p>El archivo de almacenamiento es un archivo que reside en la m&#225;quina servidor o es una aplicaci&#243;n desempaquetada en un directorio de despliegue.</p><p>El equipo servidor es el sistema anfitri&#243;n que est&#225; ejecutando el servidor de administraci&#243;n del dominio de Servidor empresarial. </p></dd>
</dl>
</dd>
<dt>Tipo</dt>
<dd><p>Tipo de aplicaci&#243;n. Las opciones disponibles son:</p>
<ul><li><p>Aplicaci&#243;n de Web</p></li>
<li><p>Aplicaci&#243;n empresarial</p></li>
<li><p>Cliente de aplicaciones</p></li>
<li><p>M&#243;dulo del conector</p></li>
<li><p>JAR EJB</p></li>
<li><p>Aplicaci&#243;n de Ruby</p></li>
<li><p>Otro</p></li></ul>
</dd>
</dl>
<p>Las opciones adicionales para los distintos tipos de aplicaci&#243;n se describen en
las siguientes secciones.</p>
<ul><li><p><a href="#ref-webapp-options">Opciones adicionales para una aplicaci&#243;n web</a></p></li>
<li><p><a href="#ref-entapp-options">Opciones adicionales para una Aplicaci&#243;n empresarial</a></p></li>
<li><p><a href="#ref-appclient-options">Opciones adicionales para un Cliente de aplicaciones</a></p></li>
<li><p><a href="#ref-connmodule-options">Opciones adicionales para un M&#243;dulo de conector</a></p></li>
<li><p><a href="#ref-ejb-options">Opciones adicionales para un JAR EJB</a></p></li>
<li><p><a href="#ref-ruby-options">Opciones adicionales para una aplicaci&#243;n Ruby</a></p></li></ul>
<a name="ref-webapp-options"></a><h5>Opciones adicionales para una aplicaci&#243;n web</h5>
<p>Si el tipo de aplicaci&#243;n corresponde a una aplicaci&#243;n web, aparecen las
siguientes opciones.</p><dl><dt>Ra&#237;z de contexto</dt>
<dd><p>Ruta hacia la aplicaci&#243;n. En la URL de la aplicaci&#243;n web, la ra&#237;z de contexto aparece justo despu&#233;s del n&#250;mero de puerto (<tt>http://<i>host</i>:<i>port </i>/<i>context-root</i>/...</tt>). La ra&#237;z de contexto debe comenzar por una barra diagonal, por ejemplo, <tt>/hello</tt>.</p></dd>
<dt>Nombre de la aplicaci&#243;n</dt>
<dd><p>Nombre de la aplicaci&#243;n.</p></dd>
<dt>Servidores virtuales</dt>
<dd><p>Servidores virtuales asociados a esta aplicaci&#243;n.</p></dd>
<dt>Estado</dt>
<dd><p>Si est&#225; opci&#243;n est&#225; seleccionada, entonces la aplicaci&#243;n est&#225; activada. Esta opci&#243;n est&#225; seleccionada de forma predeterminada.</p></dd>
<dt>Precompilar JSP</dt>
<dd><p>Si est&#225; seleccionada esta opci&#243;n, los archivos JavaServer Pages<sup>TM</sup> ( JSP<sup>TM</sup>) se precompilar&#225;n. Si se deshabilita esta opci&#243;n, los archivos JSP se compilar&#225;n en el tiempo de ejecuci&#243;n cuando se acceda a los mismos por primera vez. Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p></dd>
<dt>Ejecutar verificador</dt>
<dd><p>Si esta opci&#243;n est&#225; seleccionada, el verificador se ejecutar&#225; antes de la implementaci&#243;n. Si se produce un error en la verificaci&#243;n, no se realiza la implementaci&#243;n. El verificador examinar&#225; la estructura y contenido del archivo. La verificaci&#243;n de aplicaciones de gran tama&#241;o tiende a llevar mucho tiempo. Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p></dd>
<dt>Forzar reimplementaci&#243;n</dt>
<dd><p>Si esta opci&#243;n est&#225; seleccionada, se volver&#225; a implementar la aplicaci&#243;n si est&#225; ya implementada. Si esta opci&#243;n no est&#225; seleccionada y se intenta implementar una aplicaci&#243;n que ya se haya implementado, se producir&#225; un error. Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p></dd>
<dt>Bibliotecas</dt>
<dd><p>Lista de archivos JAR de la biblioteca separados por comas espec&#237;ficos de este m&#243;dulo o aplicaci&#243;n. Las rutas pueden ser absolutas o relativas. Una ruta relativa es relativa a <tt></tt><i>domain-dir</i><tt>/lib/applibs</tt>. Si la ruta es absoluta, la ruta debe ser accesible para el servidor de administraci&#243;n del dominio (DAS), lo que implica que debe estar en <tt></tt><i>domain-dir</i><tt></tt>. Las bibliotecas est&#225;n disponibles para la aplicaci&#243;n en el orden en que est&#225;n especificadas.</p></dd>
<dt>Descripci&#243;n</dt>
<dd><p>Una descripci&#243;n de la aplicaci&#243;n.</p></dd>
</dl>
<a name="ref-entapp-options"></a><h5>Opciones adicionales para una Aplicaci&#243;n empresarial</h5>
<p>Si el tipo de aplicaci&#243;n corresponde a una aplicaci&#243;n empresarial, aparecen las
siguientes opciones.</p><dl><dt>Nombre de la aplicaci&#243;n</dt>
<dd><p>Nombre de la aplicaci&#243;n.</p></dd>
<dt>Servidores virtuales</dt>
<dd><p>Servidores virtuales asociados a esta aplicaci&#243;n.</p></dd>
<dt>Estado</dt>
<dd><p>Si est&#225; opci&#243;n est&#225; seleccionada, entonces la aplicaci&#243;n est&#225; activada. Esta opci&#243;n est&#225; seleccionada de forma predeterminada.</p></dd>
<dt>Precompilar JSP</dt>
<dd><p>Si est&#225; seleccionada esta opci&#243;n, los archivos JavaServer Pages ( JSP) se precompilar&#225;n. Si se deshabilita esta opci&#243;n, los archivos JSP se compilar&#225;n en el tiempo de ejecuci&#243;n cuando se acceda a los mismos por primera vez. Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p></dd>
<dt>Ejecutar verificador</dt>
<dd><p>Si esta opci&#243;n est&#225; seleccionada, el verificador se ejecutar&#225; antes de la implementaci&#243;n. Si se produce un error en la verificaci&#243;n, no se realiza la implementaci&#243;n. El verificador examinar&#225; la estructura y contenido del archivo. La verificaci&#243;n de aplicaciones de gran tama&#241;o tiende a llevar mucho tiempo. Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p></dd>
<dt>Java Web Start</dt>
<dd><p>Si esta opci&#243;n est&#225; seleccionada, se permite el acceso a Java Web Start para un m&#243;dulo de cliente de aplicaciones. Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p></dd>
<dt>Forzar reimplementaci&#243;n</dt>
<dd><p>Si esta opci&#243;n est&#225; seleccionada, se volver&#225; a implementar la aplicaci&#243;n si est&#225; ya implementada. Si esta opci&#243;n no est&#225; seleccionada y se intenta implementar una aplicaci&#243;n que ya se haya implementado, se producir&#225; un error. Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p></dd>
<dt>Bibliotecas</dt>
<dd><p>Lista de archivos JAR de la biblioteca separados por comas espec&#237;ficos de esta aplicaci&#243;n. Especifica una ruta de acceso absoluta o relativa. Una ruta relativa es relativa a <tt></tt><i>domain-dir</i><tt>/lib/applibs</tt>. Si la ruta es absoluta, la ruta debe ser accesible para el servidor de administraci&#243;n del dominio (DAS), lo que implica que debe estar en <tt></tt><i>domain-dir</i><tt></tt>. Las bibliotecas est&#225;n disponibles para la aplicaci&#243;n en el orden en que est&#225;n especificadas.</p></dd>
<dt>Descripci&#243;n</dt>
<dd><p>Una descripci&#243;n de la aplicaci&#243;n.</p></dd>
</dl>
<a name="ref-appclient-options"></a><h5>Opciones adicionales para un Cliente de aplicaciones</h5>
<p>Si el tipo de aplicaci&#243;n corresponde a un cliente de aplicaciones, aparecen
las siguientes opciones.</p><dl><dt>Nombre de la aplicaci&#243;n</dt>
<dd><p>Nombre de la aplicaci&#243;n.</p></dd>
<dt>Ejecutar verificador</dt>
<dd><p>Si esta opci&#243;n est&#225; seleccionada, el verificador se ejecutar&#225; antes de la implementaci&#243;n. Si se produce un error en la verificaci&#243;n, no se realiza la implementaci&#243;n. El verificador examinar&#225; la estructura y contenido del archivo. La verificaci&#243;n de aplicaciones de gran tama&#241;o tiende a llevar mucho tiempo. Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p></dd>
<dt>Java Web Start</dt>
<dd><p>Si esta opci&#243;n est&#225; seleccionada, se permite el acceso a Java Web Start para un m&#243;dulo de cliente de aplicaciones. Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p></dd>
<dt>Forzar reimplementaci&#243;n</dt>
<dd><p>Si esta opci&#243;n est&#225; seleccionada, se volver&#225; a implementar la aplicaci&#243;n si est&#225; ya implementada. Si esta opci&#243;n no est&#225; seleccionada y se intenta implementar una aplicaci&#243;n que ya se haya implementado, se producir&#225; un error. Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p></dd>
<dt>Descripci&#243;n</dt>
<dd><p>Una descripci&#243;n de la aplicaci&#243;n.</p></dd>
</dl>
<a name="ref-connmodule-options"></a><h5>Opciones adicionales para un M&#243;dulo de conector</h5>
<p>Si el tipo de aplicaci&#243;n corresponde a un m&#243;dulo de conector, aparecen
las siguientes opciones.</p><dl><dt>Nombre de la aplicaci&#243;n</dt>
<dd><p>Nombre de la aplicaci&#243;n.</p></dd>
<dt>Estado</dt>
<dd><p>Si est&#225; opci&#243;n est&#225; seleccionada, entonces la aplicaci&#243;n est&#225; activada. Esta opci&#243;n est&#225; seleccionada de forma predeterminada.</p></dd>
<dt>Ejecutar verificador</dt>
<dd><p>Si esta opci&#243;n est&#225; seleccionada, el verificador se ejecutar&#225; antes de la implementaci&#243;n. Si se produce un error en la verificaci&#243;n, no se realiza la implementaci&#243;n. El verificador examinar&#225; la estructura y contenido del archivo. La verificaci&#243;n de aplicaciones de gran tama&#241;o tiende a llevar mucho tiempo. Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p></dd>
<dt>Forzar reimplementaci&#243;n</dt>
<dd><p>Si esta opci&#243;n est&#225; seleccionada, se volver&#225; a implementar la aplicaci&#243;n si est&#225; ya implementada. Si esta opci&#243;n no est&#225; seleccionada y se intenta implementar una aplicaci&#243;n que ya se haya implementado, se producir&#225; un error. Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p></dd>
<dt>Id. del conjunto de subprocesos</dt>
<dd><p>Nombre del conjunto de subprocesos que utilizar&#225; la aplicaci&#243;n.</p></dd>
<dt>Descripci&#243;n</dt>
<dd><p>Una descripci&#243;n de la aplicaci&#243;n.</p></dd>
</dl>
<a name="ref-ejb-options"></a><h5>Opciones adicionales para un JAR EJB</h5>
<p>Si el tipo de aplicaci&#243;n corresponde a un JAR EJB, aparecen las
siguientes opciones.</p><dl><dt>Nombre de la aplicaci&#243;n</dt>
<dd><p>Nombre de la aplicaci&#243;n.</p></dd>
<dt>Estado</dt>
<dd><p>Si est&#225; opci&#243;n est&#225; seleccionada, entonces la aplicaci&#243;n est&#225; activada. Esta opci&#243;n est&#225; seleccionada de forma predeterminada.</p></dd>
<dt>Ejecutar verificador</dt>
<dd><p>Si esta opci&#243;n est&#225; seleccionada, el verificador se ejecutar&#225; antes de la implementaci&#243;n. Si se produce un error en la verificaci&#243;n, no se realiza la implementaci&#243;n. El verificador examinar&#225; la estructura y contenido del archivo. La verificaci&#243;n de aplicaciones de gran tama&#241;o tiende a llevar mucho tiempo. Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p></dd>
<dt>Forzar reimplementaci&#243;n</dt>
<dd><p>Si esta opci&#243;n est&#225; seleccionada, se volver&#225; a implementar la aplicaci&#243;n si est&#225; ya implementada. Si esta opci&#243;n no est&#225; seleccionada y se intenta implementar una aplicaci&#243;n que ya se haya implementado, se producir&#225; un error. Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p></dd>
<dt>Bibliotecas</dt>
<dd><p>Lista de archivos JAR de la biblioteca separados por comas espec&#237;ficos para este m&#243;dulo o aplicaci&#243;n. Especifica una ruta de acceso absoluta o relativa. Una ruta relativa es relativa a <tt></tt><i>domain-dir</i><tt>/lib/applibs</tt>. Si la ruta es absoluta, la ruta debe ser accesible para el servidor de administraci&#243;n del dominio (DAS), lo que implica que debe estar en <tt></tt><i>domain-dir</i><tt></tt>. Las bibliotecas est&#225;n disponibles para la aplicaci&#243;n en el orden en que est&#225;n especificadas.</p></dd>
<dt>Descripci&#243;n</dt>
<dd><p>Una descripci&#243;n de la aplicaci&#243;n.</p></dd>
</dl>
<a name="ref-ruby-options"></a><h5>Opciones adicionales para una aplicaci&#243;n Ruby</h5>
<p>Si el tipo de aplicaci&#243;n corresponde a una aplicaci&#243;n Ruby, aparecen las
siguientes opciones.</p><dl><dt>Nombre de la aplicaci&#243;n</dt>
<dd><p>Nombre de la aplicaci&#243;n.</p></dd>
<dt>Ra&#237;z de contexto</dt>
<dd><p>Ruta hacia la aplicaci&#243;n. En la URL de la aplicaci&#243;n web, la ra&#237;z de contexto aparece justo despu&#233;s del n&#250;mero de puerto (<tt>http://<i>host</i>:<i>port </i>/<i>context-root</i>/...</tt>). La ra&#237;z de contexto debe comenzar por una barra diagonal, por ejemplo, <tt>/hello</tt>.</p></dd>
<dt>Estado</dt>
<dd><p>Si est&#225; opci&#243;n est&#225; seleccionada, entonces la aplicaci&#243;n est&#225; activada. Esta opci&#243;n est&#225; seleccionada de forma predeterminada.</p></dd>
<dt>Forzar reimplementaci&#243;n</dt>
<dd><p>Si esta opci&#243;n est&#225; seleccionada, se volver&#225; a implementar la aplicaci&#243;n si est&#225; ya implementada. Si esta opci&#243;n no est&#225; seleccionada y se intenta implementar una aplicaci&#243;n que ya se haya implementado, se producir&#225; un error. Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p></dd>
<dt>Inicio de JRuby</dt>
<dd><p>Ruta hacia el directorio donde est&#225; instalado el contenedor Jruby. La ubicaci&#243;n predeterminada es <tt></tt><i>as-install</i><tt>/jruby</tt>. Si especifica un valor en este campo, el valor de la aplicaci&#243;n reemplazar&#225; al valor de Inicio de Jruby determinado para el contenedor de Ruby.</p></dd>
<dt>Tiempo de ejecuci&#243;n</dt>
<dd><p>Tiempo de ejecuci&#243;n inicial para iniciar JRuby. El valor debe ser igual o superior al valor del campo Tiempo de ejecuci&#243;n m&#237;nimo, pero inferior al valor que figura en el campo Tiempo de ejecuci&#243;n m&#225;ximo. El valor predeterminado es 1. Si especifica un valor en este campo, el valor de la aplicaci&#243;n reemplazar&#225; al valor de Tiempo de ejecuci&#243;n determinado para el contenedor de Ruby.</p></dd>
<dt>Tiempo de ejecuci&#243;n m&#237;nimo</dt>
<dd><p>Tiempo de ejecuci&#243;n m&#237;nimo de JRuby del conjunto. El valor debe ser inferior o igual al valor del campo Tiempo de ejecuci&#243;n e inferior al valor que figura en el campo Tiempo de ejecuci&#243;n m&#225;ximo. El valor predeterminado es 1. Si especifica un valor en este campo, el valor de la aplicaci&#243;n reemplazar&#225; al valor de Tiempo m&#237;nimo de ejecuci&#243;n determinado para el contenedor de Ruby.</p></dd>
<dt>Tiempo de ejecuci&#243;n m&#225;ximo</dt>
<dd><p>Tiempo de ejecuci&#243;n m&#225;ximo de JRuby del conjunto. El valor debe ser igual o superior al valor del campo Tiempo de ejecuci&#243;n m&#237;nimo e igual o superior al valor que figura en el campo Tiempo de ejecuci&#243;n. El valor predeterminado es 2. Si especifica un valor en este campo, el valor de la aplicaci&#243;n reemplazar&#225; al valor de Tiempo m&#225;ximo de ejecuci&#243;n determinado para el contenedor de Ruby.</p></dd>
<dt>Estructura</dt>
<dd><p>Estructura en la que se implementar&#225; la aplicaci&#243;n. Las opciones disponibles son <tt>rails</tt>, <tt>merb</tt>, <tt> sinatra</tt> y <tt>auto-detection</tt>. El valor predeterminado es <tt> rails</tt>. Si establece esta propiedad en un valor distinto a <tt>auto-detection</tt> omitir&#225; el proceso normal y potencialmente largo de detecci&#243;n autom&#225;tica y forzar&#225; la implementaci&#243;n en la estructura especificada. Si la aplicaci&#243;n implementada no se escribe para la estructura especificada, se produce un error.</p></dd>
<dt>Entorno Rack</dt>
<dd><p>Entorno en que se ejecuta la estructura JRuby, como Rails o Merb. Las opciones disponibles son <tt>production</tt>, <tt>development </tt> y <tt>test</tt>. El valor predeterminado es <tt>development</tt>.</p></dd>
<dt>MT-Seguro</dt>
<dd><p>Configuraci&#243;n del subproceso seguro para la estructura en que se ejecutar&#225; la aplicaci&#243;n. Esta propiedad afecta a aplicaciones iniciadas mediante detecci&#243;n autom&#225;tica de una secuencia de comandos de inicio proporcionada por el usuario. Las opciones disponibles son:</p><dl><dt><tt>true</tt></dt>
<dd><p>Especifica que la estructura cuenta son subprocesos seguros y por tanto no necesita la creaci&#243;n de un conjunto.</p></dd>
<dt><tt>false</tt></dt>
<dd><p>Especifica que la aplicaci&#243;n se inicia con un conjunto de instancias de aplicaci&#243;n, y a cada instancia de la aplicaci&#243;n accede un subproceso al mismo tiempo.</p></dd>
<dt><tt>default</tt></dt>
<dd><p>Servidor empresarial trata de detectar la seguridad de los subprocesos de manera autom&#225;tica. &#201;ste es el valor predeterminado.</p></dd>
</dl>
<p>Esta propiedad afecta &#250;nicamente a las estructuras iniciadas en lugares donde no se puede determinar autom&#225;ticamente la seguridad de los subprocesos. Si configura este valor en <tt></tt>, no se produce una detecci&#243;n autom&#225;tica de la aplicaci&#243;n Rails 2.1.<i>x</i> para que se inicie en modo de subprocesos seguros, ni se puede utilizar para forzar el inicio de una estructura de subprocesos seguros en modo agrupado.</p></dd>
<dt>Servidores virtuales</dt>
<dd><p>Servidores virtuales asociados a esta aplicaci&#243;n.</p></dd>
<dt>Descripci&#243;n</dt>
<dd><p>Una descripci&#243;n de la aplicaci&#243;n.</p></dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-appdeployweb.html">C&#243;mo implementar una aplicaci&#243;n web</a></p></li>
<li><p><a href="task-deployentapp.html">Implementaci&#243;n de una aplicaci&#243;n empresarial</a></p></li>
<li><p><a href="task-appdeployclient.html">Implementar un cliente de aplicaciones</a></p></li>
<li><p><a href="task-appdeployconn.html">Implementaci&#243;n de un m&#243;dulo del conector</a></p></li>
<li><p><a href="task-appdeployejb.html">Implementaci&#243;n de un JAR EJB</a></p></li>
<li><p><a href="task-appdeployruby.html">Implementaci&#243;n de una aplicaci&#243;n de Ruby</a></p></li>
<li><p><a href="task-appedit.html">Para editar una aplicaci&#243;n implementada</a></p></li>
<li><p><a href="task-appviewdesc.html">C&#243;mo ver los descriptores de una aplicaci&#243;n</a></p></li>
<li><p><a href="task-applaunch.html">C&#243;mo iniciar una aplicaci&#243;n</a></p></li>
<li><p><a href="task-appredeploy.html">C&#243;mo volver a implementar una aplicaci&#243;n implementada</a></p></li>
<li><p><a href="task-apprestart.html">C&#243;mo reiniciar una aplicaci&#243;n implementada</a></p></li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://docs.sun.com/doc/820-7701/deploy-1?a=view"><tt>deploy</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/redeploy-1?a=view"><tt>redeploy</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/list-applications-1?a=view"><tt>list-applications</tt>(1)</a></p></li></ul>

