<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-generaltab"></a><h4>Informaci&#243;n general</h4>
<p>Consulte la p&#225;gina Informaci&#243;n general para comprobar la configuraci&#243;n de Servidor empresarial
y ver los datos de la M&#225;quina virtual de Java.</p><p>La p&#225;gina Informaci&#243;n general contiene la siguiente informaci&#243;n.</p><dl><dt>Bot&#243;n Detener</dt>
<dd><p>Haga clic en Detener para detener el Servidor empresarial.</p></dd>
<dt>Bot&#243;n Reiniciar</dt>
<dd><p>Haga clic en Reiniciar para reiniciar el Servidor empresarial.</p></dd>
<dt>Bot&#243;n Ver archivos de registro</dt>
<dd><p>Haga clic en Ver archivos de registro para ver el registro del servidor.</p></dd>
<dt>Nombre</dt>
<dd><p>El nombre del servidor.</p></dd>
<dt>Informe de JVM</dt>
<dd><p>Si hace clic sobre el Informe de JVM, se abrir&#225; una ventana independiente que muestra informes en la m&#225;quina virtual de Java, incluyendo un informe resumido, un informe sobre administraci&#243;n de la memoria y recolecci&#243;n de elementos no utilizados, otro informe sobre carga de clases y un volcado de subprocesos actuales.</p></dd>
<dt>Directorio de configuraci&#243;n</dt>
<dd><p>Directorio del sistema anfitri&#243;n que contiene archivos de configuraci&#243;n, como <tt>domain.xml</tt>.</p></dd>
<dt>Versi&#243;n instalada</dt>
<dd><p>identificador de versi&#243;n del producto.</p></dd>
<dt>Depuraci&#243;n</dt>
<dd><p>Identifica si la depuraci&#243;n est&#225; habilitada. Si la depuraci&#243;n est&#225; habilitada, tambi&#233;n aparecer&#225; el n&#250;mero de puerto.</p></dd>
<dt>Puerto(s) HTTP</dt>
<dd><p>Puertos configurados actualmente para solicitudes y respuestas HTTP.</p></dd>
<dt>Puerto(s) IIOP</dt>
<dd><p>Puertos configurados actualmente para solicitudes y respuestas IIOP.</p></dd>
</dl>
<h5>Tarea relacionada</h5>

<ul><li><p><a href="task-generaltab.html">Vista de informaci&#243;n general acerca de Servidor empresarial</a></p></li>
<li><p><a href="task-logviewer.html">Para ver el registro del servidor</a></p></li></ul>

