<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-lifecyclemoduleedit"></a><h4>Editar m&#243;dulo de ciclo de vida</h4>
<p>Consulte la p&#225;gina Editar m&#243;dulo de ciclo de vida para modificar la
configuraci&#243;n del m&#243;dulo de ciclo de vida.</p><p>La p&#225;gina Editar m&#243;dulo de ciclo de vida contiene las opciones siguientes.</p><dl><dt>Nombre</dt>
<dd><p>Nombre del m&#243;dulo del ciclo de vida. &#201;ste campo es de s&#243;lo lectura. &#218;nicamente puede especificar un nombre al crear un nuevo m&#243;dulo de ciclo de vida.</p></dd>
<dt>Nombre de clase</dt>
<dd><p>Nombre completo del archivo de clase del m&#243;dulo de ciclo de vida. La clase debe implementar la interfaz <tt>com.sun.appserv.server.LifecycleListener</tt>.</p></dd>
<dt>Ruta de clase</dt>
<dd><p>Ruta de clase para el m&#243;dulo de ciclo de vida. La ruta de clase especifica la ubicaci&#243;n del m&#243;dulo de ciclo de vida. El valor predeterminado es <tt></tt><i>domain-dir</i><tt>/applications </tt>. Si el m&#243;dulo ya se encuentra en este directorio (es decir, en la ruta de clase del servidor), este campo puede dejarse en blanco.</p></dd>
<dt>Orden de carga</dt>
<dd><p>Orden en el que este m&#243;dulo de ciclo de vida se cargar&#225; en el arranque. Los m&#243;dulos con valores de orden de carga inferiores se cargar&#225;n antes. El valor puede estar entre 101 y el <tt>MAXINT</tt> del sistema operativo. Los valores de 0 a 100 est&#225;n reservados.</p></dd>
<dt>Estado</dt>
<dd><p>Si se selecciona esta opci&#243;n, el m&#243;dulo de ciclo de vida estar&#225; habilitado. Esta opci&#243;n est&#225; habilitada por defecto.</p></dd>
<dt>Error en la carga</dt>
<dd><p>Si se selecciona esta opci&#243;n, el servidor se apagar&#225; si se produce un error en la carga del m&#243;dulo de ciclo de vida. Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p></dd>
<dt>Servidores virtuales</dt>
<dd><p>Servidor o servidores virtuales que se asociar&#225;n con el m&#243;dulo de ciclo de vida. De manera predeterminada, no hay ning&#250;n servidor virtual seleccionado.</p></dd>
<dt>Descripci&#243;n</dt>
<dd><p>Descripci&#243;n del m&#243;dulo de ciclo de vida.</p></dd>
<dt>Propiedades adicionales</dt>
<dd><p>Propiedades adicionales del m&#243;dulo de ciclo de vida. Servidor empresarial no define ninguna propiedad adicional para los m&#243;dulos de ciclo de vida.</p></dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-lifecyclemodulenew.html">Creaci&#243;n de un m&#243;dulo de ciclo de vida</a></p></li>
<li><p><a href="task-lifecyclemoduleedit.html">Edici&#243;n de un m&#243;dulo de ciclo de vida</a></p></li>
<li><p><a href="task-lifecyclemoduledelete.html">Eliminaci&#243;n de un m&#243;dulo de ciclo de vida</a></p></li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://docs.sun.com/doc/820-7701/create-lifecycle-module-1?a=view"><tt>create-lifecycle-module</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/list-lifecycle-modules-1?a=view"><tt>list-lifecycle-modules</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/delete-lifecycle-module-1?a=view"><tt>delete-lifecycle-module</tt>(1)</a></p></li></ul>

