<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>P&#225;gina Configuraci&#243;n de aplicaciones - Ayuda en l&#237;nea de la Consola de administraci&#243;n de GlassFish Enterprise Server v3 Prelude de Sun
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>

</head>

<body class="HlpBdy">

<a name="ref-appconfigtab"></a><h4>P&#225;gina Configuraci&#243;n de aplicaciones</h4>
<p>Utilice la p&#225;gina Configuraci&#243;n de aplicaciones para establecer las propiedades que permiten
garantizar que los cambios realizados en las aplicaciones implementadas se detecten y
las clases modificadas se vuelvan a cargar.</p><dl><dt>Recargar</dt>
<dd><p>Si esta opci&#243;n est&#225; habilitada, las clases modificadas se recargar&#225;n de forma din&#225;mica. El servidor comprueba peri&#243;dicamente los cambios realizados en el directorio de implementaci&#243;n y vuelve a implementar la aplicaci&#243;n de forma autom&#225;tica y din&#225;mica con los cambios. Esto es &#250;til en un entorno de desarrollo ya que permite poner a prueba los cambios realizados en el c&#243;digo de forma r&#225;pida. En cambio, en un entorno de producci&#243;n la recarga din&#225;mica puede hacer que disminuya el rendimiento. Adem&#225;s, cuando ha finalizado la recarga, las sesiones del periodo de transici&#243;n pierden su validez. El cliente debe reiniciar la sesi&#243;n.</p></dd>
<dt>Intervalo de sondeo de recarga</dt>
<dd><p>Identifica con qu&#233; frecuencia debe comprobar el servidor los cambios en las aplicaciones implementadas.</p></dd>
<dt>Tiempo de espera de sesi&#243;n de administraci&#243;n</dt>
<dd><p>Identifica el n&#250;mero de minutos de inactividad antes de que se agote el tiempo de espera de Consola de administraci&#243;n y se deba iniciar una sesi&#243;n de nuevo.</p></dd>
<dt>Implementaci&#243;n autom&#225;tica</dt>
<dd><p>Si esta opci&#243;n est&#225; habilitada, las aplicaciones del directorio de implementaci&#243;n autom&#225;tica se implementan autom&#225;ticamente.</p></dd>
<dt>Intervalo de sondeo de implementaci&#243;n autom&#225;tica</dt>
<dd><p>Especifica con qu&#233; frecuencia debe comprobar el servidor el directorio de implementaci&#243;n autom&#225;tica de la aplicaci&#243;n o los archivos del m&#243;dulo. Si cambia el intervalo de sondeo no quedar&#225; afectado el tiempo que se tarda en implementar una aplicaci&#243;n o un m&#243;dulo.</p></dd>
<dt>Tiempo de espera de reintento de implementaci&#243;n autom&#225;tica</dt>
<dd><p>Especifica el n&#250;mero de segundos que el tama&#241;o de un archivo copiado parcialmente puede permanecer sin cambios antes de que se produzca un error. La opci&#243;n predeterminada es 30.</p><p>Si se copia un archivo lentamente en el directorio de implementaci&#243;n autom&#225;tica, &#233;ste puede aparecer antes de que se copie el archivo completo. Como resultado, se produce un error al intentar implementar la aplicaci&#243;n de forma autom&#225;tica. Si se produce un error al intentar implementar una aplicaci&#243;n de forma autom&#225;tica por este motivo, Servidor empresarial intentar&#225; implementar de nuevo la aplicaci&#243;n. Si el tama&#241;o del archivo copiado parcialmente permanece sin cambios durante el per&#237;odo de tiempo especificado, se producir&#225; un error.</p></dd>
<dt>Directorio de implementaci&#243;n autom&#225;tica</dt>
<dd><p>Identifica el directorio en el que se crea la aplicaci&#243;n, por lo que no tendr&#225; que copiar los archivos en el directorio de implementaci&#243;n autom&#225;tica predeterminado.</p></dd>
<dt>Verificador</dt>
<dd><p>Si se habilita esta opci&#243;n, el verificador se ejecutar&#225; antes de la implementaci&#243;n. El verificador examinar&#225; la estructura y contenido del archivo. La verificaci&#243;n de aplicaciones de gran tama&#241;o tiende a llevar mucho tiempo.</p></dd>
<dt>Precompilar</dt>
<dd><p>Si est&#225; habilitada esta opci&#243;n, los archivos JavaServer Pages<sup>TM</sup> (JSP<sup>TM</sup>) se precompilar&#225;n. Si se deshabilita esta opci&#243;n, los archivos JSP se compilar&#225;n en el tiempo de ejecuci&#243;n cuando se acceda a los mismos por primera vez.</p></dd>
<dt>Propiedades adicionales</dt>
<dd><p>Especifica las propiedades adicionales.</p></dd>
</dl>

<br/>

</body>
</html>
