<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-jmxconnectorssledit"></a><h4>SSL</h4>
<p>Consulte la p&#225;gina SSL para modificar la configuraci&#243;n SSL para el conector
JMX.</p><p>La configuraci&#243;n que aparece en esta p&#225;gina es &#250;nicamente relevante si est&#225;
habilitada la seguridad para el conector JMX en la p&#225;gina Editar conector
JMX.</p><p>La p&#225;gina SSL contiene las siguientes opciones.</p><dl><dt>SSL3</dt>
<dd><p>Si se selecciona esta casilla de verificaci&#243;n, se habilitar&#225; el protocolo SSL3 para el conector JMX. Esta opci&#243;n est&#225; habilitada por defecto.</p></dd>
<dt>TLS</dt>
<dd><p>Si se selecciona esta casilla de verificaci&#243;n, se habilitar&#225; el protocolo TLS&#183;para el conector JMX. Esta opci&#243;n est&#225; habilitada por defecto.</p></dd>
<dt></dt>
<dt>Autenticaci&#243;n de cliente</dt>
<dd><p>Si esta casilla de verificaci&#243;n est&#225; seleccionada, los clientes deben identificarse en el servidor con cada solicitud. Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p></dd>
<dt>Sobrenombre del certificado</dt>
<dd><p>Sobrenombre del certificado del servidor en la base de datos de certificados o token PKCS#11. En el certificado, el formato del nombre es <tt><i> tokenname</i>:<i>nickname</i></tt>. Incluyendo la <tt><i>tokenname</i>:</tt> parte del nombre de este atributo es opcional. El valor predeterminado es <tt>s1as</tt>.</p></dd>
<dt>Almac&#233;n de claves</dt>
<dd><p>Nombre de archivo del almac&#233;n de claves (por ejemplo, <tt>keystore.jks</tt>).</p></dd>
<dt>Algoritmo de confianza</dt>
<dd><p>Nombre del algoritmo de administraci&#243;n de confianza (por ejemplo, PKIX) que se utilizar&#225; para la validaci&#243;n de rutas de certificaci&#243;n.</p></dd>
<dt>Longitud m&#225;xima del certificado</dt>
<dd><p>N&#250;mero m&#225;ximo de certificados intermedios no autoemitidos que puede haber en una ruta de certificaci&#243;n. Este campo se utiliza solamente en caso de que el campo Algoritmo de confianza est&#233; configurado en PKIX. Un valor de 0 implica que la ruta &#250;nicamente puede contener un certificado. Un valor de -1 implica que la longitud de la ruta no est&#225; restringida (no hay un m&#225;ximo). La configuraci&#243;n en un valor inferior a -1 inicia una excepci&#243;n. El valor predeterminado es 5.</p></dd>
<dt>Almac&#233;n de confianza</dt>
<dd><p>Nombre de un archivo del almac&#233;n de confianza (por ejemplo, <tt>cacerts.jks</tt>).</p></dd>
<dt>Conjuntos de cifrado</dt>
<dd><p>&#193;rea en la que puede a&#241;adir o eliminar conjuntos de cifrado. Si no a&#241;ade ning&#250;n conjunto de cifrado, se utilizar&#225;n todos los conjuntos de cifrado.</p></dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-jmxconnectoredit.html">Edici&#243;n del conector JMX</a></p></li>
<li><p><a href="task-jmxconnectorssledit.html">Edici&#243;n de configuraci&#243;n SSL para el conector JMX</a></p></li></ul>

