<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-jmxconnectoredit"></a><h4>Editar conector JMX</h4>
<p>Consulte la p&#225;gina Editar conector JMX para editar el conector JMX compatible
con JSR 360.</p><p>La p&#225;gina Editar conector JMX contiene las opciones siguientes.</p><dl><dt>Nombre</dt>
<dd><p>Nombre del conector JMX. &#201;ste es un campo de s&#243;lo lectura.</p></dd>
<dt>Protocolo JMX</dt>
<dd><p>Nombre del protocolo que admite este conector JMX. &#201;ste es un campo de s&#243;lo lectura.</p></dd>
<dt>JMXServiceURL</dt>
<dd><p>URL del servicio JMX. &#201;ste es un campo de s&#243;lo lectura.</p></dd>
<dt>Seguridad</dt>
<dd><p>Si la casilla de verificaci&#243;n Habilitado aparece seleccionada, la comunicaci&#243;n JMX estar&#225; cifrada. Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p></dd>
<dt>Direcci&#243;n</dt>
<dd><p>Direcci&#243;n IP del servicio de asignaci&#243;n de nombres donde se encuentra registrado el c&#243;digo auxiliar del servidor del conector JMX. &#201;ste no es el puerto del socket del servidor que posibilita la comunicaci&#243;n real JMX. &#201;sta es la direcci&#243;n de la interfaz de red donde se ha iniciado el registro RMI. Si su sistema dispone de varias interfaces de red, modifique este valor para que s&#243;lo se seleccione una interfaz determinada. El valor predeterminado es <tt>0.0.0.0</tt>.</p></dd>
<dt>Puerto</dt>
<dd><p>N&#250;mero de puerto en el que el servicio de asignaci&#243;n de nombres (registro RMI) escucha las conexiones del cliente RMI. La &#250;nica funci&#243;n de este servicio de asignaci&#243;n de nombres es descargar los c&#243;digos auxiliares de RMI. Si el puerto predeterminado est&#225; ocupado, se utilizar&#225; otro puerto que est&#233; libre. Los valores v&#225;lidos se encuentran entre 1 y 65535. En sistemas UNIX<sup>&#174;</sup>, la creaci&#243;n de sockets de escucha para puertos 1-1024 requiere privilegios de superusuario. El valor predeterminado es 8686.</p></dd>
<dt>Nombre de dominio</dt>
<dd><p>Nombre que representa el dominio administrativo especial. Este dominio administrar&#225; toda la autenticaci&#243;n. El valor predeterminado es <tt>admin-realm</tt>.</p></dd>
<dt>Propiedades adicionales</dt>
<dd><p>Propiedades adicionales del conector JMX. Hay varias propiedades especificadas de manera predeterminada.</p></dd>
</dl>
<h5>Tarea relacionada</h5>

<ul><li><p><a href="task-jmxconnectoredit.html">Edici&#243;n del conector JMX</a></p></li>
<li><p><a href="task-jmxconnectorssledit.html">Edici&#243;n de configuraci&#243;n SSL para el conector JMX</a></p></li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>
<p>ninguna.</p>
