<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-registrationpage"></a><h4>Registro del producto</h4>
<p>Para registrar su instalaci&#243;n de Sun GlassFish<sup>TM</sup>Servidor empresarial con <a href="http://www.sun.com/service/sunconnection/index.jsp">Sun Connection</a>, debe disponer
de una <a href="https://reg.sun.com/whyregister">cuenta en l&#237;nea de Sun</a>. Si no tiene una cuenta Sun Online, Servidor empresarial
le permite crear una cuenta al registrar este producto.</p><p>La p&#225;gina Registro del producto contiene las siguientes opciones.</p><dl><dt>Ya tengo una cuenta Sun Online o una cuenta de Sun Developer Network (SDN)</dt>
<dd><p>Seleccione si ya tiene una cuenta. Si selecciona esta opci&#243;n, se ver&#225;n los siguientes campos.</p><dl><dt>Nombre de usuario</dt>
<dd><p>El nombre de usuario especificado al registrar su cuenta Sun Online.</p></dd>
<dt>Contrase&#241;a</dt>
<dd><p>La contrase&#241;a especificada al registrar su cuenta Sun Online.</p></dd>
<dt>Host del proxy</dt>
<dd><p>El nombre de host del servidor proxy del equipo en el que se est&#225; ejecutando Servidor empresarial.</p><p>Este campo s&#243;lo es aplicable si el equipo en el que se est&#225; ejecutando Servidor empresarial se conecta a Internet a trav&#233;s de un servidor proxy.</p></dd>
<dt>Puerto del proxy</dt>
<dd><p>El n&#250;mero de puerto del servidor proxy del equipo en el que se est&#225; ejecutando Servidor empresarial.</p><p>Este campo s&#243;lo es aplicable si el equipo en el que se est&#225; ejecutando Servidor empresarial se conecta a Internet a trav&#233;s de un servidor proxy.</p></dd>
</dl>
</dd>
<dt>No tengo ninguna cuenta en l&#237;nea de Sun. Registrarme.</dt>
<dd><p>Seleccione esta opci&#243;n si no tiene una cuenta y desea registrar su instalaci&#243;n de Servidor empresarial con Sun Connection. Si selecciona esta opci&#243;n, se ver&#225;n los siguientes campos.</p><dl><dt>Direcci&#243;n de correo electr&#243;nico</dt>
<dd><p>La direcci&#243;n de correo electr&#243;nico, que ser&#225; su nombre de usuario de la cuenta en l&#237;nea de Sun.</p></dd>
<dt>Contrase&#241;a</dt>
<dd><p>La contrase&#241;a que se utiliza con su Cuenta en l&#237;nea de Sun. La contrase&#241;a distingue entre may&#250;sculas y min&#250;sculas y debe tener 6&#8211;10 caracteres.</p></dd>
<dt>Volver a escribir la contrase&#241;a</dt>
<dd><p>Debe volver a escribir la contrase&#241;a que especific&#243; en el campo Contrase&#241;a.</p></dd>
<dt>Nombre</dt>
<dd><p>Su nombre.</p></dd>
<dt>Apellido</dt>
<dd><p>Su apellido.</p></dd>
<dt>Empresa</dt>
<dd><p>La empresa para la que trabaja, si procede.</p></dd>
<dt>Pa&#237;s/territorio</dt>
<dd><p>El pa&#237;s o territorio en el que reside.</p></dd>
<dt>Host del proxy</dt>
<dd><p>El nombre de host del servidor proxy del equipo en el que se est&#225; ejecutando Servidor empresarial.</p><p>Este campo s&#243;lo es aplicable si el equipo en el que se est&#225; ejecutando Servidor empresarial se conecta a Internet a trav&#233;s de un servidor proxy.</p></dd>
<dt>Puerto del proxy</dt>
<dd><p>El n&#250;mero de puerto del servidor proxy del equipo en el que se est&#225; ejecutando Servidor empresarial.</p><p>Este campo s&#243;lo es aplicable si el equipo en el que se est&#225; ejecutando Servidor empresarial se conecta a Internet a trav&#233;s de un servidor proxy.</p></dd>
</dl>
</dd>
</dl>
<h5>Tarea relacionada</h5>

<ul><li><p><a href="task-register.html">C&#243;mo registrar GlassFish de Sun Servidor empresarial en Sun Connection</a></p></li></ul>

