<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-security"></a><h4>Seguridad</h4>
<p>Utilice la p&#225;gina Seguridad para configurar las propiedades de seguridad de Servidor
empresarial.</p><p>La p&#225;gina Seguridad contiene las siguientes opciones.</p><dl><dt>Administrador de seguridad</dt>
<dd><p>Si se selecciona esta opci&#243;n, se activar&#225; el administrador de seguridad para el dominio. Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p><p>Si se activa esta opci&#243;n, se agregar&#225; una opci&#243;n de JVM, <tt>-Djava.security.manager </tt>, a los valores de configuraci&#243;n de JVM de Servidor empresarial. Consulte <a href="task-jvmoptions.html">Para configurar las opciones de JVM</a>. Debe reiniciar el servidor para habilitar este cambio. </p><p>Aseg&#250;rese de que ha otorgado los permisos correctos para todas las aplicaciones. Puede deshabilitar el administrador de seguridad para mejorar el rendimiento. </p></dd>
<dt>Registro de auditor&#237;a</dt>
<dd><p>Si esta opci&#243;n est&#225; activada, el servidor cargar&#225; y ejecutar&#225; todos los m&#243;dulos de auditor&#237;a especificados en la configuraci&#243;n de M&#243;dulos de auditor&#237;a. Si la opci&#243;n est&#225; desactivada, el servidor no acceder&#225; a los m&#243;dulos de auditor&#237;a. Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p></dd>
<dt>Dominio predeterminado</dt>
<dd><p>Dominio activo (predeterminado) que utiliza el servidor para la autenticaci&#243;n. Las aplicaciones utilizan este dominio siempre que el descriptor de implementaci&#243;n no especifique un dominio diferente. Todos los dominios configurados aparecen en la lista. El valor predeterminado es <tt>file</tt>.</p></dd>
<dt>Principal predeterminado</dt>
<dd><p>Especifica el nombre de usuario predeterminado. El servidor utilizar&#225; este nombre de usuario si no se proporciona otro principal. Si introduce un valor en este campo, tiene que introducir la contrase&#241;a correspondiente en el campo Contrase&#241;a principal predeterminada.</p><p>No se requiere un principal predeterminado para el funcionamiento normal de un servidor.</p></dd>
<dt>Contrase&#241;a principal predeterminada</dt>
<dd><p>Contrase&#241;a principal predeterminada especificada en el campo Principal predeterminado. No se requiere un principal predeterminado para el funcionamiento normal de un servidor.</p></dd>
<dt>JACC</dt>
<dd><p>Nombre de clase de un proveedor JACC configurado. El valor predeterminado es <tt>default</tt>.</p></dd>
<dt>M&#243;dulos de auditor&#237;a</dt>
<dd><p>M&#243;dulos del proveedor de auditor&#237;a que utilizar&#225; el subsistema de auditor&#237;as si se habilita el registro de auditor&#237;as. Por defecto el servidor utiliza un m&#243;dulo de auditor&#237;a llamado <tt>default</tt>. Para obtener informaci&#243;n sobre la creaci&#243;n de nuevos m&#243;dulos de auditor&#237;a, consulte <a href="task-auditmodulenew.html">C&#243;mo crear un m&#243;dulo de auditor&#237;a</a>.</p></dd>
<dt>Asignaci&#243;n predeterminada de principal a funci&#243;n activada</dt>
<dd><p>Si se selecciona esta opci&#243;n, se aplicar&#225; la asignaci&#243;n predeterminada de principal a funci&#243;n a las aplicaciones que no tengan ninguna asignaci&#243;n espec&#237;fica de aplicaci&#243;n.</p></dd>
<dt>Clases principales asignadas</dt>
<dd><p>Especifica una implementaci&#243;n personalizada de la clase <tt>java.security.Principal </tt> utilizada en la asignaci&#243;n predeterminada de principal a funci&#243;n, en caso de que la asignaci&#243;n predeterminada de principal a funci&#243;n est&#233; habilitada.</p></dd>
<dt>Propiedades adicionales</dt>
<dd><p>Propiedades de seguridad adicionales para el servidor.</p><p>Las propiedades v&#225;lidas dependen del tipo de dominio seleccionado en el campo Dominio predeterminado y se especifican habitualmente cuando edita un dominio. Para obtener m&#225;s informaci&#243;n, consulte los siguientes temas:</p>
<ul><li><p><a href="ref-editfile-adminrealm.html">Propiedades espec&#237;ficas de la clase <tt> FileRealm</tt></a></p></li>
<li><p><a href="ref-editcertrealm.html">Propiedades espec&#237;ficas de la clase <tt>CertificateRealm </tt></a></p></li>
<li><p><a href="ref-editjdbcrealm.html">Propiedades espec&#237;ficas de la clase <tt>JDBCRealm </tt></a></p></li>
<li><p><a href="ref-ldaprealmprop.html">Propiedades espec&#237;ficas de la clase <tt>LDAPRealm </tt></a></p></li>
<li><p><a href="ref-solarisrealmprop.html">Propiedades espec&#237;ficas de la clase <tt>SolarisRealm </tt></a></p></li></ul>
</dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-securitysettings.html">C&#243;mo configurar las opciones de seguridad</a></p></li>
<li><p><a href="task-auditmodulenew.html">C&#243;mo crear un m&#243;dulo de auditor&#237;a</a></p></li>
<li><p><a href="task-changeadminpasswd.html">Cambio de la contrase&#241;a de un usuario en el dominio de administrador</a></p></li>
<li><p><a href="task-accessadmintools.html">C&#243;mo otorgar acceso a las herramientas de administraci&#243;n.</a></p></li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>
<p>ninguna.</p>
