<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-logviewer"></a><h4>Visualizador de registros</h4>
<a name="indexterm-22"></a><a name="indexterm-23"></a><p>Consulte la p&#225;gina Visualizador de registros para ver los registros del servidor
y personalizar la pantalla de registros.</p><p>La p&#225;gina Visualizador de registros contiene tres &#225;reas:</p>
<ul><li><p>Criterios de b&#250;squeda</p></li>
<li><p>B&#250;squeda avanzada</p></li>
<li><p>Resultados de b&#250;squeda</p></li></ul>
<p>El &#225;rea Criterios de b&#250;squeda contiene las siguientes opciones.</p><dl><dt>B&#250;squeda avanzada</dt>
<dd><p>Al presionar en este enlace aparecer&#225; una zona que le permitir&#225; a&#241;adir elementos al visualizador de registros.</p></dd>
<dt>Marca de tiempo</dt>
<dd><p>El bot&#243;n de opci&#243;n M&#225;s reciente muestra los mensajes m&#225;s recientes. El bot&#243;n de opci&#243;n Intervalo espec&#237;fico habilita los campos Desde y Hasta que le permiten ver mensajes de un per&#237;odo concreto.</p><p>Para el valor Tiempo, la sintaxis debe tener la forma siguiente (<b>SSS</b> significa milisegundos):</p><pre><b>hh</b>:<b>mm</b>:<b>ss</b>.<b>SSS</b></pre><p>Por ejemplo:</p><pre>17:10:00.000</pre><p>Si el valor introducido en el campo De es posterior al valor introducido en el campo A, aparece un mensaje de error.</p></dd>
<dt>Nivel de registro</dt>
<dd><p>Nivel de registro seleccionado para el filtrado. De forma predeterminada, la pantalla incluye todos los mensajes que aparecen en el registro del servidor en el nivel de registro seleccionado y niveles m&#225;s graves. Seleccione la casilla de verificaci&#243;n No incluir m&#225;s mensajes graves para mostrar mensajes s&#243;lo en el nivel seleccionado.</p><p>Para asegurarse de que los mensaje que quiere ver aparecen en el registro del servidor, configure previamente los niveles de registro en la p&#225;gina Niveles de registro del m&#243;dulo. Vea <a href="task-eelogginglevels.html">Para configurar niveles de registro</a>.</p><p>Si decide filtrar mensajes de registro seg&#250;n nivel de registro, s&#243;lo se muestran los mensajes que se ajustan a los criterios de filtro especificados. Sin embargo, este filtro no afecta a qu&#233; mensajes est&#225;n registrados en el registro del servidor.</p></dd>
</dl>
<p>El &#225;rea B&#250;squeda avanzada contiene las siguientes opciones.</p><dl><dt>Registro</dt>
<dd><p>Espacios de nombre del registro para filtrar por m&#243;dulos. Utilice la tecla May&#250;s o la tecla Ctrl para seleccionar varios espacios de nombre.</p><p>La selecci&#243;n de un espacio de nombre en un nivel superior selecciona todos los espacios de nombre existentes por debajo. Por ejemplo, al seleccionar <tt>javax.enterprise.system</tt> tambi&#233;n se seleccionan los registradores de todos los m&#243;dulos existentes por debajo de ese espacio de nombre: <tt>javax.enterprise.system.core</tt>, <tt>javax.enterprise.system.tools.admin</tt>, etc.</p></dd>
<dt>Registro personalizado</dt>
<dd><p>Registros espec&#237;ficos de una aplicaci&#243;n determinada, uno por l&#237;nea.</p><p>Si la aplicaci&#243;n tiene varios m&#243;dulos, puede visualizar uno o todos ellos. Por ejemplo, suponga que la aplicaci&#243;n tiene registros con los nombres siguientes:</p><pre>com.mycompany.myapp.module1
com.mycompany.myapp.module2
com.mycompany.myapp.module3</pre><p>Para ver los mensajes de todos los m&#243;dulos de la aplicaci&#243;n, introduzca <tt>com.mycompany.myapp</tt>. Para ver los mensajes s&#243;lo de <tt>module2</tt>, introduzca <tt>com.mycompany.myapp.module2</tt>.</p><p>Cuando especifica uno o varios registros personalizados, los mensajes de los m&#243;dulos de Servidor empresarial aparecen s&#243;lo si los indica expl&#237;citamente en el &#225;rea Registro.</p></dd>
<dt>Pareja Nombre-Valor</dt>
<dd><p>Nombre clave y valor para un subproceso, para ver la salida de un subproceso espec&#237;fico. El nombre de clave es <tt>_ThreadID</tt>. Por ejemplo:</p><pre>_ThreadID=13</pre><p>Suponga que <tt>com.mycompany.myapp.module2</tt> se ejecuta en varios subprocesos. Para refinar la b&#250;squeda del visualizador de registros y mostrar s&#243;lo el resultado de un &#250;nico subproceso, especifique este registro del m&#243;dulo en el campo Registro personalizado y, a continuaci&#243;n, indique el ID del subproceso en este campo.</p></dd>
<dt>Visualizaci&#243;n</dt>
<dd><p>N&#250;mero de mensajes que se ven a la vez. El n&#250;mero predeterminado de mensajes mostrados es 40. Tambi&#233;n puede elegir 100, 250 y 1000.</p><p>Para ver seguimientos de pilas, anule la selecci&#243;n la casilla de verificaci&#243;n Limitar mensajes demasiado largos. De forma predeterminada, los seguimientos de pilas no aparecen en el visualizador; para visualizarlos, haga clic en el v&#237;nculo <tt>(details)</tt> para un mensaje.</p></dd>
</dl>
<p>La tabla Resultados de b&#250;squeda muestra los mensajes de registro del servidor.</p><p>La tabla Resultados de b&#250;squeda muestra la siguiente informaci&#243;n para cada mensaje.</p><dl><dt>N&#250;mero de registro</dt>
<dd><p>N&#250;mero del mensaje en el registro del servidor.</p></dd>
<dt>Nivel de registro</dt>
<dd><p>Nivel de registro del mensaje.</p></dd>
<dt>Mensaje</dt>
<dd><p>Breve texto del mensaje de registro. Presione el enlace <tt>(details)</tt> para ver una versi&#243;n con formato del mensaje.</p></dd>
<dt>Registro</dt>
<dd><p>M&#243;dulo de registro que gener&#243; el mensaje de registro.</p></dd>
<dt>Marca de tiempo</dt>
<dd><p>Hora y fecha en que se emiti&#243; el mensaje de registro.</p></dd>
<dt>Pareja Nombre/Valor</dt>
<dd><p>Nombre de subproceso e Id. del mensaje de registro.</p></dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-eelogging.html">Para configurar par&#225;metros generales de registros</a></p></li>
<li><p><a href="task-eelogginglevels.html">Para configurar niveles de registro</a></p></li>
<li><p><a href="task-logviewer.html">Para ver el registro del servidor</a></p></li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><tt>set-log-level</tt></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/rotate-log-1?a=view"><tt>rotate-log</tt>(1)</a></p></li></ul>

