<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-managefilerealm"></a><h4>Archivar usuarios</h4>
<p>Administre los usuarios del dominio <tt>file</tt> por medio de la Consola de
administraci&#243;n. &#60;Check Alignment of PHs&#62;Los usuarios y grupos del dominio <tt>file</tt> aparecen
en el archivo de claves, cuya ubicaci&#243;n est&#225; especificada por la propiedad
<tt>file</tt>.</p>
<hr><p><b>Nota - </b>Tambi&#233;n es posible seguir estos pasos para agregar usuarios a cualquier dominio
de archivo, incluido <tt>admin-realm</tt>. S&#243;lo tiene que sustituir el nombre del dominio
de destino en el dominio <tt>file</tt> indicado en esta secci&#243;n.</p>
<hr>
<p>Los usuarios del dominio <tt>file</tt> pueden pertenecer a un <b>grupo Java</b>, una categor&#237;a
de usuarios clasificados por rasgos en com&#250;n. &#60;Check Alignment of PHs&#62;Por ejemplo,
los clientes de una aplicaci&#243;n de comercio electr&#243;nico pueden pertenecer al grupo
<tt>CLIENTE</tt>, pero los que m&#225;s gastan pertenecer&#237;an al grupo <tt>PREFERENTE</tt>. La clasificaci&#243;n
de usuarios en grupos simplifica el control del acceso de grandes n&#250;meros
de usuarios.</p><p>Inicialmente, tras la instalaci&#243;n de Servidor empresarial, el &#250;nico usuario es el
administrador introducido durante la instalaci&#243;n. Por defecto, este usuario pertenece al grupo
<tt>asadmin</tt>, en el dominio <tt>admin-realm</tt>, lo que le da derecho a modificar
Servidor empresarial. Los usuarios asignados a este grupo tendr&#225;n privilegios de administrador,
es decir que podr&#225;n acceder a la herramienta <tt>asadmin</tt> y a la
Consola de administraci&#243;n.</p><p>La p&#225;gina Usuarios del archivo muestra una lista de usuarios del dominio
seleccionado. Para cada usuario aparece la siguiente informaci&#243;n:</p><dl><dt>Id. de usuario</dt>
<dd><p>El nombre de usuario.</p></dd>
<dt>Lista de grupos</dt>
<dd><p>Los grupos a los que pertenece el usuario.</p></dd>
</dl>

