<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-editjdbcrealm"></a><h4>Propiedades espec&#237;ficas de la clase <tt>JDBCRealm </tt></h4>
<p>Para proteger sus p&#225;ginas y aplicaciones web, puede configurar la seguridad para
que s&#243;lo puedan acceder a ellas los usuarios registrados. Esto se conoce
como recurso de autenticaci&#243;n. Este tipo de dominio se encarga de guardar
las credenciales de los usuarios en una base de datos. Servidor empresarial
utiliza la informaci&#243;n de la base de datos y la opci&#243;n de
dominio JDBC activada dentro del archivos de configuraci&#243;n.</p><p>Un dominio JDBC requiere las propiedades siguientes.</p><dl><dt>Contexto JAAS</dt>
<dd><p>El contexto JAAS (Servicio de autenticaci&#243;n y autorizaci&#243;n de Java) (mecanismo identificador para que el m&#243;dulo de entrada utilice este dominio). El &#250;nico valor v&#225;lido es <tt>jdbcRealm</tt>.</p></dd>
<dt>JNDI</dt>
<dd><p>Nombre JNDI de este dominio. El valor predeterminado es <tt>jdbc/security </tt>.</p></dd>
<dt>Tabla de usuarios</dt>
<dd><p>Esta tabla contiene una lista de usuarios autorizados para este dominio. El valor predeterminado es <tt>usertable</tt>.</p></dd>
<dt>Columna Nombre de usuario</dt>
<dd><p>Nombre de la columna que contiene la lista de los usuarios incluidos en la tabla de usuarios. El valor predeterminado es <tt>userid</tt>.</p></dd>
<dt>Columna de contrase&#241;as</dt>
<dd><p>Nombre de la columna que contiene las contrase&#241;as de cada uno de los usuarios incluidos en la tabla de usuarios. El valor predeterminado es <tt>password</tt>.</p></dd>
<dt>Tabla de grupos</dt>
<dd><p>El nombre de la tabla de grupo de la base de datos. El valor predeterminado es <tt>grouptable</tt>.</p></dd>
<dt>Columna Nombre de grupo</dt>
<dd><p>El nombre de la columna del nombre de grupo de la tabla del grupo de la base de datos. El valor predeterminado es <tt>groupid</tt>.</p></dd>
</dl>
<p>Las siguientes propiedades adicionales est&#225;n disponibles para un dominio JDBC.</p><dl><dt>Asignar grupos</dt>
<dd><p>Una lista de nombres de grupo separada por comas. A todos los clientes que presentan certificados v&#225;lidos se les asigna estos grupos, por ejemplo, <tt>employee,manager </tt>, donde estos son nombres de los grupos de usuarios.</p></dd>
<dt>Usuario de la base de datos</dt>
<dd><p>Le permite especificar el nombre de usuario de base de datos del dominio en lugar de <tt>jdbc-connection-pool</tt>. Esto impide que otras aplicaciones bloqueen la base de datos, consigan una conexi&#243;n y exploren la tabla de usuarios. De forma predeterminada, se utiliza la configuraci&#243;n <tt>jdbc-connection-pool</tt>.</p></dd>
<dt>Contrase&#241;a de la base de datos</dt>
<dd><p>Le permite especificar la contrase&#241;a de base de datos del dominio en lugar del <tt>jdbc-connection-pool</tt>. Esto impide que otras aplicaciones bloqueen la base de datos, consigan una conexi&#243;n y exploren la tabla de usuarios. De forma predeterminada, se utiliza la configuraci&#243;n <tt>jdbc-connection-pool</tt>.</p></dd>
<dt>Algoritmo de recopilaci&#243;n</dt>
<dd><p>El algoritmo de recopilaci&#243;n. El valor predeterminado es <tt>MD5</tt>. Puede utilizar cualquier logaritmo admitido en el JDK o <tt>none</tt>.</p></dd>
<dt>Codificaci&#243;n</dt>
<dd><p>La codificaci&#243;n. Los valores permitidos son <tt>Hex</tt> y <tt> Base64</tt>. Si no se especifica <tt>digest-algorithm</tt> el valor predeterminado es <tt>Hex</tt>. Si no se especifica <tt>digest-algorithm</tt> tampoco se especifica la codificaci&#243;n de forma predeterminada.</p></dd>
<dt>Conjunto de caracteres</dt>
<dd><p>El conjunto de caracteres del algoritmo de recopilaci&#243;n. </p></dd>
</dl>

