<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-uc-concepts"></a><h4>Conceptos clave de Herramienta de actualizaci&#243;n</h4>
<p>Herramienta de actualizaci&#243;n gestiona la instalaci&#243;n de componentes de software de Servidor
empresarial que se encuentran en un &#250;nico directorio de sistema de archivos
en su sistema.</p><p>Los conceptos clave de Herramienta de actualizaci&#243;n se describen en las secciones
que vienen a continuaci&#243;n.</p><a name="ref-uc-about-component"></a><h5>Componente</h5>
<p>Un <b>componente</b> es la unidad instalable que gestiona Herramienta de actualizaci&#243;n. Un
componente consta de varios archivos instalados como una unidad en el sistema
dentro de una imagen de instalaci&#243;n.</p><a name="ref-uc-about-image"></a><h5>Imagen de instalaci&#243;n</h5>
<p>Una <b>imagen de instalaci&#243;n</b> es el directorio que contiene los componentes del software, incluyendo
el contenido del directorio. La imagen de instalaci&#243;n se a&#241;ade a Herramienta
de actualizaci&#243;n como resultado de la descarga e instalaci&#243;n del software de
Servidor empresarial. Para habilitar la adici&#243;n y actualizaci&#243;n de componentes del software
de Servidor empresarial, cada imagen de instalaci&#243;n contiene informaci&#243;n sobre los componentes
de instalaci&#243;n.</p><a name="ref-uc-about-repository"></a><h5>Dep&#243;sito de red</h5>
<p>Un <b>dep&#243;sito de red</b> contiene los elementos siguientes:</p>
<ul><li><p>Componentes que pueden agregarse a una imagen de instalaci&#243;n</p></li>
<li><p>Actualizaciones disponibles para los componentes existentes en una imagen de instalaci&#243;n</p></li></ul>
<p>Una imagen de instalaci&#243;n se asocia con uno o m&#225;s dep&#243;sitos de
red. Cada uno de ellos est&#225; representado por un nombre y una
URL asociada. Cada imagen de instalaci&#243;n tiene un nombre de dep&#243;sito &#250;nico
que representa tanto a la organizaci&#243;n o al proyecto que gestiona el
dep&#243;sito, como a un &#225;mbito de contenidos bien definido.</p><a name="ref-uc-about-addon"></a><h5>Componente de complementos</h5>
<p>Un <b>componente de complementos</b> es un componente de la imagen de instalaci&#243;n que no
se ha instalado todav&#237;a.</p>
