<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>P&#225;gina Servicio de supervisi&#243;n - Ayuda en l&#237;nea de la Consola de administraci&#243;n de GlassFish Enterprise Server v3 Prelude de Sun
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>

</head>

<body class="HlpBdy">

<a name="ref-monitoringpage"></a><h4>P&#225;gina Servicio de supervisi&#243;n</h4>
<p>Utilice la p&#225;gina Servicio de supervisi&#243;n para configurar opciones de supervisi&#243;n de
servicios o componentes del servidor individual.</p><dl><dt>JVM</dt>
<dd><p>Nivel de supervisi&#243;n de JVM. Los niveles disponibles son BAJO, ALTO y DESACTIVADO. No existe diferencia alguna entre los niveles de supervisi&#243;n que ofrecen las opciones BAJO y ALTO de esta versi&#243;n.</p></dd>
<dt>Servicio HTTP</dt>
<dd><p>Nivel de supervisi&#243;n del servicio HTTP. Los niveles disponibles son BAJO, ALTO y DESACTIVADO. No existe diferencia alguna entre los niveles de supervisi&#243;n que ofrecen las opciones BAJO y ALTO de esta versi&#243;n.</p></dd>
<dt>Contenedor web</dt>
<dd><p>Nivel de supervisi&#243;n del contenedor web. Los niveles disponibles son BAJO, ALTO y DESACTIVADO. No existe diferencia alguna entre los niveles de supervisi&#243;n que ofrecen las opciones BAJO y ALTO de esta versi&#243;n.</p></dd>
<dt>Conjunto de subprocesos</dt>
<dd><p>Nivel de supervisi&#243;n del conjunto de subprocesos. Los niveles disponibles son BAJO, ALTO y DESACTIVADO. No existe diferencia alguna entre los niveles de supervisi&#243;n que ofrecen las opciones BAJO y ALTO de esta versi&#243;n.</p></dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-confmonitor.html">Para configurar el servicio de supervisi&#243;n</a></p></li>
<li><p><a href="task-viewmonitor-jvm.html">Para visualizar los datos de supervisi&#243;n de JVM</a></p></li>
<li><p><a href="task-viewmonitor-httpsvc.html">Para visualizar los datos de supervisi&#243;n del servicio HTTP</a></p></li>
<li><p><a href="task-viewmonitor-webcont.html">Para visualizar los datos de supervisi&#243;n del contenedor web</a></p></li>
<li><p><a href="task-viewmonitor-threadpool.html">Para visualizar los datos de supervisi&#243;n del conjunto de subprocesos</a></p></li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>
<p>ninguna.</p>
<br/>

</body>
</html>
