<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-appedit"></a><h4>Editar aplicaci&#243;n</h4>
<p>Utilice la p&#225;gina Editar aplicaci&#243;n para modificar una aplicaci&#243;n existente.</p><p>La p&#225;gina Editar aplicaci&#243;n contiene las siguientes opciones.</p><dl><dt>Nombre</dt>
<dd><p>Campo de solo lectura que muestra el nombre de la aplicaci&#243;n que est&#225; editando.</p></dd>
<dt>Servidores virtuales</dt>
<dd><p>Servidores virtuales asociados a esta aplicaci&#243;n.</p></dd>
<dt>Ra&#237;z de contexto</dt>
<dd><p>Para una aplicaci&#243;n web, se especifica la ruta de la aplicaci&#243;n. En la URL de la aplicaci&#243;n web, la ra&#237;z de contexto aparece justo despu&#233;s del n&#250;mero de puerto (<tt>http://<i>host</i>:<i>port </i>/<i>context-root</i>/...</tt>). La ra&#237;z de contexto debe comenzar por una barra diagonal, por ejemplo, <tt>/hello</tt>.</p></dd>
<dt>Descripci&#243;n</dt>
<dd><p>Breve descripci&#243;n de la aplicaci&#243;n.</p></dd>
<dt>Estado</dt>
<dd><p>Si se selecciona la casilla de verificaci&#243;n Habilitado, se habilita la aplicaci&#243;n. Esta opci&#243;n est&#225; seleccionada de forma predeterminada.</p></dd>
<dt>Java Web Start</dt>
<dd><p>Si se selecciona la casilla de verificaci&#243;n Habilitado, la aplicaci&#243;n emplear&#225; el software Java Web Start. Java Web Start proporciona una forma independiente de los navegadores de implementar aplicaciones Java para que se ejecuten en una m&#225;quina virtual de Java espec&#237;fica.</p></dd>
<dt>Directorio implementado</dt>
<dd><p>Si se selecciona esta casilla de verificaci&#243;n, la aplicaci&#243;n se implementa desde un directorio.</p></dd>
<dt>Ubicaci&#243;n</dt>
<dd><p>Campo de solo lectura que muestra la ubicaci&#243;n de la aplicaci&#243;n implementada.</p></dd>
<dt>Bibliotecas</dt>
<dd><p>Campo de solo lectura que muestra los archivos JAR de biblioteca que necesita la aplicaci&#243;n.</p></dd>
<dt>Subm&#243;dulos</dt>
<dd><p>Tabla que muestra los nombres de los subm&#243;dulos de la aplicaci&#243;n y sus motores.</p></dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-appedit.html">Para editar una aplicaci&#243;n implementada</a></p></li>
<li><p><a href="task-appdeployweb.html">C&#243;mo implementar una aplicaci&#243;n web</a></p></li>
<li><p><a href="task-deployentapp.html">Implementaci&#243;n de una aplicaci&#243;n empresarial</a></p></li>
<li><p><a href="task-appdeployclient.html">Implementar un cliente de aplicaciones</a></p></li>
<li><p><a href="task-appdeployconn.html">Implementaci&#243;n de un m&#243;dulo del conector</a></p></li>
<li><p><a href="task-appdeployejb.html">Implementaci&#243;n de un JAR EJB</a></p></li>
<li><p><a href="task-appdeployruby.html">Implementaci&#243;n de una aplicaci&#243;n de Ruby</a></p></li>
<li><p><a href="task-appviewdesc.html">C&#243;mo ver los descriptores de una aplicaci&#243;n</a></p></li>
<li><p><a href="task-applaunch.html">C&#243;mo iniciar una aplicaci&#243;n</a></p></li>
<li><p><a href="task-appredeploy.html">C&#243;mo volver a implementar una aplicaci&#243;n implementada</a></p></li>
<li><p><a href="task-apprestart.html">C&#243;mo reiniciar una aplicaci&#243;n implementada</a></p></li></ul>

