<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-serverinstjvmpathsettings"></a><h4>Configuraci&#243;n de ruta de clase JVM</h4>
<p>La ruta de clase es la lista de archivos JAR en la
que el entorno de ejecuci&#243;n de Java busca clases y otros recursos.</p><p>La p&#225;gina Configuraci&#243;n de ruta de clase de JVM contiene las siguientes
opciones.</p><dl><dt>Ruta de clase de entorno</dt>
<dd><p>Si se activa la casilla de verificaci&#243;n Ignorar, se omitir&#225; la variable de entorno <tt>CLASSPATH</tt>. La variable de entorno <tt>CLASSPATH</tt> es pr&#225;ctica para tutoriales b&#225;sicos de programaci&#243;n, pero no se recomienda para entornos empresariales.</p></dd>
<dt>Ruta de clase de servidor</dt>
<dd><p>Ruta de clase de Servidor empresarial. &#201;ste es un campo de s&#243;lo lectura.</p></dd>
<dt>Ruta de clase del sistema</dt>
<dd><p>La ruta a las clases del sistema.</p></dd>
<dt>Prefijo de ruta de clase</dt>
<dd><p>Rutas completas a los archivos JAR que se van a anteponer a la ruta de clase del servidor, una por l&#237;nea.</p></dd>
<dt>Sufijo de ruta de clase</dt>
<dd><p>Rutas completas a los archivos JAR que se van a anexar a la ruta de clase del servidor, una por l&#237;nea.</p></dd>
<dt>Prefijo de ruta de biblioteca nativa</dt>
<dd><p>Rutas completas a los archivos JAR que se van a anteponer a la ruta de biblioteca nativa, una por l&#237;nea.</p></dd>
<dt>Sufijo de ruta de biblioteca nativa</dt>
<dd><p>Rutas completas a los archivos JAR que se van a anexar a la ruta de biblioteca nativa, una por l&#237;nea.</p><p>La ruta de biblioteca nativa es una concatenaci&#243;n de la ruta relativa del servidor de sus bibliotecas compartidas nativas, la ruta de biblioteca nativa del entorno de ejecuci&#243;n est&#225;ndar, el valor del entorno shell (<tt>LD_LIBRARY_PATH</tt> en sistemas UNIX<sup>&#174;</sup>) y cualquier ruta especificada en la p&#225;gina <a href="ref-serverinstjvmprofiler.html">Configuraci&#243;n de analizador JVM</a>.</p></dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-jvmsettings.html">C&#243;mo establecer la configuraci&#243;n general de JVM</a></p></li>
<li><p><a href="task-jvmpathsettings.html">Para establecer los valores de la ruta de JVM</a></p></li>
<li><p><a href="task-jvmoptions.html">Para configurar las opciones de JVM</a></p></li>
<li><p><a href="task-securitymanagerdisable.html">Para deshabilitar el administrador de seguridad</a></p></li>
<li><p><a href="task-jvmprofilersettings.html">C&#243;mo configurar los valores del analizador JVM </a></p></li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://docs.sun.com/doc/820-7701/create-jvm-options-1?a=view"><tt>create-jvm-options</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/delete-jvm-options-1?a=view"><tt>delete-jvm-options</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/list-jvm-options-1?a=view"><tt>list-jvm-options</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/create-profiler-1?a=view"><tt>create-profiler</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/delete-profiler-1?a=view"><tt>delete-profiler</tt>(1)</a></p></li></ul>

