<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>P&#225;gina Preferencias de la ruta a JVM - Ayuda en l&#237;nea de la Consola de administraci&#243;n de GlassFish Enterprise Server v3 Prelude de Sun
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>

</head>

<body class="HlpBdy">

<a name="ref-jvmpathtab"></a><h4>P&#225;gina Preferencias de la ruta a JVM</h4>
<p>La ruta de clase es la lista de archivos JAR en la
que el entorno de ejecuci&#243;n de Java busca clases y otros recursos.</p><dl><dt>Ruta de clase del sistema</dt>
<dd><p>La ruta a las clases del sistema.</p></dd>
<dt>Ruta de clase de entorno</dt>
<dd><p>Si se activa la casilla de verificaci&#243;n Ignorar, se omitir&#225; la variable de entorno <tt>CLASSPATH</tt>. La variable de entorno <tt>CLASSPATH</tt> es pr&#225;ctica para tutoriales b&#225;sicos de programaci&#243;n, pero no se recomienda para entornos empresariales.</p></dd>
<dt>Ruta de clase de servidor</dt>
<dd><p>Campo de s&#243;lo lectura para ver la ruta de clase de Application Server.</p></dd>
<dt>Prefijo de ruta de clase</dt>
<dd><p>Rutas completas a los archivos JAR que se van a anteponer al prefijo de ruta de clase del servidor, una por l&#237;nea.</p></dd>
<dt>Sufijo de ruta de clase</dt>
<dd><p>Rutas completas a los archivos JAR que se van a anexar al sufijo de ruta de clase del servidor, una por l&#237;nea.</p></dd>
<dt>Prefijo de ruta de biblioteca nativa</dt>
<dd><p>Rutas completas a los archivos JAR que se van a anteponer a la ruta de biblioteca nativa, una por l&#237;nea.</p></dd>
<dt>Sufijo de ruta de biblioteca nativa</dt>
<dd><p>Rutas completas a los archivos JAR que se van a anexar a la ruta de biblioteca nativa, una por l&#237;nea.</p><p>La ruta de biblioteca nativa es una concatenaci&#243;n de la ruta relativa del servidor de sus bibliotecas compartidas nativas, la ruta de biblioteca nativa del entorno de ejecuci&#243;n est&#225;ndar, el valor del entorno del shell (<tt>LD_LIBRARY_PATH</tt> en sistemas UNIX<sup>&reg;</sup>
				 ) y cualquier ruta especificada en la p&#225;gina de configuraci&#243;n de JVM Profiler.</p></dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-jvmsettings.html">C&#243;mo establecer la configuraci&#243;n general de JVM</a></p></li>
<li><p><a href="task-jvmpathsettings.html">Para establecer los valores de la ruta de JVM</a></p></li>
<li><p><a href="task-jvmoptions.html">Para configurar las opciones de JVM</a></p></li>
<li><p><a href="task-securitymanagerdisable.html">Para deshabilitar el administrador de seguridad</a></p></li>
<li><p><a href="task-jvmprofilersettings.html">Para configurar los valores del JVM Profiler</a></p></li>
<li><p><a href="task-setadvanceappconfig.html">Para establecer la configuraci&#243;n de aplicaciones avanzada</a></p></li>
<li><p><a href="task-setadvancedomainattributes.html">Para establecer los atributos de dominio avanzados</a></p></li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://docs.sun.com/doc/820-4497/create-jvm-options-1?a=view"><tt>create-jvm-options</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/delete-jvm-options-1?a=view"><tt>delete-jvm-options</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/list-jvm-options-1?a=view"><tt>list-jvm-options</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/create-profiler-1?a=view"><tt>create-profiler</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/delete-profiler-1?a=view"><tt>delete-profiler</tt>(1)</a></p></li></ul>

<br/>

</body>
</html>
