<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-ldaprealmprop"></a><h4>Propiedades espec&#237;ficas de la clase <tt>LDAPRealm </tt></h4>
<p>Un dominio LDAP requiere las siguientes propiedades.</p><dl><dt>Contexto JAAS</dt>
<dd><p>El contexto JAAS (Servicio de autenticaci&#243;n y autorizaci&#243;n de Java) (mecanismo identificador para que el m&#243;dulo de entrada utilice este dominio). El &#250;nico valor v&#225;lido es <tt>solarisRealm</tt>.</p></dd>
<dt>Directorio</dt>
<dd><p>La URL LDAP de su servidor.</p></dd>
<dt>DN de base</dt>
<dd><p>Nombre distinguido (DN) de base LDAP para la ubicaci&#243;n de los datos del usuario. Este DN de base puede estar en cualquier nivel por encima de los datos de usuario, ya que se realiza una b&#250;squeda en tres &#225;mbitos. Cuanto m&#225;s peque&#241;o sea el &#225;rbol de b&#250;squeda, mejor ser&#225; su rendimiento.</p></dd>
</dl>
<p>La siguiente propiedad adicional est&#225; disponible para un dominio LDAP.</p><dl><dt>Asignar grupos</dt>
<dd><p>Una lista de nombres de grupo separada por comas. A todos los clientes que presentan certificados v&#225;lidos se les asigna estos grupos, por ejemplo, <tt>employee,manager </tt>, donde estos son nombres de los grupos de usuarios.</p></dd>
</dl>
<p>Las siguientes propiedades adicionales est&#225;n disponibles para un dominio LDAP.</p><dl><dt><tt>search-filter</tt></dt>
<dd><p>El filtro de b&#250;squeda que se usa para buscar al usuario. El valor predeterminado es <tt> uid=%s</tt> (<tt>%s</tt> se expande al nombre del asunto).</p></dd>
<dt><tt>group-base-dn</tt></dt>
<dd><p>El DN de base de la ubicaci&#243;n de los datos del grupo. De manera predeterminada, es igual al valor DN de base, pero puede ajustarse si fuera necesario.</p></dd>
<dt><tt>group-search-filter</tt></dt>
<dd><p>El filtro de b&#250;squeda para buscar los grupos a los que pertenece el usuario. El valor predeterminado es <tt>uniquemember=%d</tt> (<tt>%d</tt> se expande al DN del elemento del usuario).</p></dd>
<dt><tt>group-target</tt></dt>
<dd><p>El nombre del atributo LDAP que contiene las entradas del nombre de grupo. El valor predeterminado es <tt>CN</tt>.</p></dd>
<dt><tt>search-bind-dn</tt></dt>
<dd><p>Puede utilizarse un DN opcional para autenticarse en el directorio y llevar a cabo la b&#250;squeda <tt>search-filter</tt>. S&#243;lo se necesita para directorios que no permiten realizar b&#250;squedas an&#243;nimas.</p></dd>
<dt><tt>search-bind-password</tt></dt>
<dd><p>La contrase&#241;a LDAP del DN proporcionado en <tt>search-bind-dn</tt>.</p></dd>
</dl>

