<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-serverinstappsconfig"></a><h4>Configuraci&#243;n de aplicaciones</h4>
<a name="indexterm-24"></a><a name="indexterm-25"></a><a name="indexterm-26"></a><a name="indexterm-27"></a><p>Utilice la p&#225;gina Configuraci&#243;n de aplicaciones para establecer las propiedades que permiten
garantizar que los cambios realizados en las aplicaciones implementadas se detecten y
las clases modificadas se vuelven a cargar.</p><p>La p&#225;gina Configuraci&#243;n de aplicaciones contiene las siguientes opciones.</p><dl><dt>Recargar</dt>
<dd><p>Si esta opci&#243;n est&#225; habilitada, las clases modificadas se recargar&#225;n de forma din&#225;mica. El servidor comprueba peri&#243;dicamente los cambios realizados en el directorio de implementaci&#243;n y vuelve a implementar la aplicaci&#243;n de forma autom&#225;tica y din&#225;mica con los cambios. Esto es &#250;til en un entorno de desarrollo ya que permite poner a prueba los cambios realizados en el c&#243;digo de forma r&#225;pida. En cambio, en un entorno de producci&#243;n la recarga din&#225;mica puede hacer que disminuya el rendimiento. Adem&#225;s, cuando ha finalizado la recarga, las sesiones del periodo de transici&#243;n pierden su validez. El cliente debe reiniciar la sesi&#243;n. Esta opci&#243;n est&#225; habilitada por defecto.</p></dd>
<dt>Intervalo de sondeo de recarga</dt>
<dd><p>Identifica la frecuencia con que el servidor deber&#237;a comprobar los cambios de c&#243;digo en las aplicaciones y m&#243;dulos implementados. El valor predeterminado es 2.</p></dd>
<dt>Tiempo de espera de sesi&#243;n de administraci&#243;n</dt>
<dd><p>Identifica el n&#250;mero de minutos de inactividad antes de que se agote el tiempo de espera de Consola de administraci&#243;n y se deba iniciar una sesi&#243;n de nuevo. El valor predeterminado es 60.</p></dd>
<dt>Implementaci&#243;n autom&#225;tica</dt>
<dd><p>Si esta opci&#243;n est&#225; habilitada, las aplicaciones del directorio de implementaci&#243;n autom&#225;tica se implementan autom&#225;ticamente. Esta opci&#243;n est&#225; habilitada por defecto.</p></dd>
<dt>Intervalo de sondeo de implementaci&#243;n autom&#225;tica</dt>
<dd><p>Especifica la frecuencia con que el servidor deber&#237;a comprobar el directorio de implementaci&#243;n autom&#225;tica para comprobar los cambios del m&#243;dulo o de la aplicaci&#243;n. Si cambia el intervalo de sondeo no quedar&#225; afectado el tiempo que se tarda en implementar una aplicaci&#243;n o un m&#243;dulo. El valor predeterminado es 2.</p></dd>
<dt>Tiempo de espera de reintento de implementaci&#243;n autom&#225;tica</dt>
<dd><p>Especifica el n&#250;mero de segundos que el tama&#241;o de un archivo copiado parcialmente puede permanecer sin cambios antes de que se produzca un error. El valor prededeterminado es 4.</p><p>Si se copia un archivo lentamente en el directorio de implementaci&#243;n autom&#225;tica, &#233;ste puede aparecer antes de que se copie el archivo completo. Como resultado, se produce un error al intentar implementar la aplicaci&#243;n de forma autom&#225;tica. Si se produce un error al intentar implementar una aplicaci&#243;n de forma autom&#225;tica por este motivo, Servidor empresarial intentar&#225; implementar de nuevo la aplicaci&#243;n. Si el tama&#241;o del archivo copiado parcialmente permanece sin cambios durante el per&#237;odo de tiempo especificado, se producir&#225; un error.</p></dd>
<dt>Directorio de implementaci&#243;n autom&#225;tica</dt>
<dd><p>Identifica el directorio para supervisar la implementaci&#243;n autom&#225;tica de las aplicaciones. El valor predeterminado es <tt></tt><i>domain-dir</i><tt>/autodeploy</tt>.</p></dd>
<dt>Validaci&#243;n XML</dt>
<dd><p>Especifica el tipo de validaci&#243;n XML que se llevar&#225; a cabo en los descriptores de implementaci&#243;n est&#225;ndar y de Servidor empresarial. El tipo puede ser cualquiera de los siguientes:</p><dl><dt>Completo</dt>
<dd><p>Si se produce un error en la validaci&#243;n XML, no se realizar&#225; la implementaci&#243;n. &#201;ste es el valor predeterminado.</p></dd>
<dt>An&#225;lisis</dt>
<dd><p>Se informa acerca de errores en la validaci&#243;n XML, pero se realiza la implementaci&#243;n.</p></dd>
<dt>Ninguno</dt>
<dd><p>No se realiza ninguna implementaci&#243;n XML.</p></dd>
</dl>
</dd>
<dt>Verificador</dt>
<dd><p>Si se habilita esta opci&#243;n, el verificador se ejecuta antes de la implementaci&#243;n autom&#225;tica. Si se produce un error en la verificaci&#243;n, no se realiza la implementaci&#243;n. El verificador examinar&#225; la estructura y contenido del archivo. La verificaci&#243;n de aplicaciones de gran tama&#241;o tiende a llevar mucho tiempo. Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p></dd>
<dt>Precompilar</dt>
<dd><p>Si est&#225; habilitada esta opci&#243;n, los archivos JavaServer Pages<sup>TM</sup> ( JSP<sup>TM</sup>) se precompilar&#225;n. Si se deshabilita esta opci&#243;n, los archivos JSP se compilar&#225;n en el tiempo de ejecuci&#243;n cuando se acceda a los mismos por primera vez. Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p></dd>
<dt>Propiedades adicionales</dt>
<dd><p>Propiedades adicionales para las aplicaciones. Servidor empresarial no define ninguna propiedad adicional para las aplicaciones.</p></dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-setadvanceappconfig.html">Establecimiento de la configuraci&#243;n avanzada de aplicaciones</a></p></li>
<li><p><a href="task-setadvancedomainattributes.html">Para establecer los atributos de dominio avanzados</a></p></li></ul>

