<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-configreq-respolicy"></a><h4>Configuraciones de directiva de solicitud y respuesta</h4>
<p>Si Autenticar fuente es <tt>sender</tt>, entonces el mensaje contiene un encabezado <tt>wsse:Security</tt>
con un token <tt>wsse:UsernameToken</tt> (con contrase&#241;a). Si Autenticar fuente es contenido, entonces
el contenido del mensaje SOAP est&#225; firmado y el mensaje contiene un
encabezado <tt>wsse:Security</tt> con la firma del mensaje representado como <tt>ds</tt>: <tt> Signature</tt>.</p><p>Si Autenticar destinatario es <tt>before-content</tt> o <tt>after-content</tt>, el contenido del mensaje SOAP
estar&#225; cifrado y sustituido por los datos <tt>xend:EncryptedData</tt> resultantes. El mensaje contiene
un encabezado <tt>a wsse:Security</tt> que contiene una clave <tt>xenc:EncryptedKey</tt>. La clave <tt>xenc:EncryptedKey</tt> contiene
la clave utilizada para cifrar el mensaje SOAP. La clave est&#225; cifrada
con la clave p&#250;blica del destinatario.</p><p>Si los valores Autenticar fuente y Autenticar destinatario se dejan en blanco,
entonces no se habr&#225; especificado ninguna directiva de seguridad y los m&#243;dulos
no realizar&#225;n operaciones de seguridad.</p><p>En la siguiente tabla se muestran configuraciones de directiva de protecci&#243;n de
mensajes y las operaciones de seguridad de mensajes resultantes realizados por los
proveedores de seguridad de mensajes SOAP para dicha configuraci&#243;n.</p><a name="gbutq"></a><h6>Tabla&#160;1 Pol&#237;tica de protecci&#243;n de mensajes basada en la operaci&#243;n de seguridad de mensajes SOAP de seguridad WS</h6><table><col width="33%"><col width="33%"><col width="33%"><tr><th align="left" valign="top" scope="column"></th>
<th align="left" valign="top" scope="column"><p>Autenticar destinatario <tt>before-content</tt></p></th>
<th align="left" valign="top" scope="column"><p>Autenticar destinatario
<tt>after-content</tt></p></th>
</tr>
<tr><td align="left" valign="top" scope="row"><p>Autenticar fuente <tt>sender</tt></p></td>
<td colspan="2" align="left" valign="top" scope="row"><p>El contenido del mensaje SOAP est&#225; cifrado y reemplazado por
los datos <tt>xend:EncryptedData</tt> resultantes. El mensaje contiene el encabezado <tt>wsse:Security</tt> que contiene
un token <tt>wsse:UsernameToken</tt> (con contrase&#241;a) y una clave <tt>xenc:EncryptedKey</tt>. La clave <tt>xenc:EncryptedKey</tt>
contiene la clave utilizada para cifrar el mensaje SOAP. La clave est&#225;
cifrada con la clave p&#250;blica del destinatario.</p></td>
</tr>
<tr><td align="left" valign="top" scope="row"><p>Autenticar fuente <tt>content</tt></p></td>
<td align="left" valign="top" scope="row"><p>El contenido del mensaje
SOAP est&#225; cifrado y reemplazado por los datos <tt>xend:EncryptedData</tt> resultantes. Los datos
<tt>xenc:EncryptedData</tt> est&#225;n firmados. El mensaje contiene un encabezado <tt>a wsse:Security</tt> que contiene una
clave <tt>xenc:EncryptedKey</tt> y un <tt>ds:Signature</tt>. La clave <tt>xenc:EncryptedKey</tt> contiene la clave utilizada
para cifrar el mensaje SOAP. La clave est&#225; cifrada con la clave
p&#250;blica del destinatario.</p></td>
<td align="left" valign="top" scope="row"><p>El contenido del mensaje SOAP est&#225; firmado, cifrado y reemplazado
por los datos <tt>xend:EncryptedData</tt> resultantes. El mensaje contiene un encabezado <tt>a wsse:Security</tt> que
contiene una clave <tt>xenc:EncryptedKey</tt> y un <tt>ds:Signature</tt>. La clave <tt>xenc:EncryptedKey</tt> contiene la
clave utilizada para cifrar el mensaje SOAP. La clave est&#225; cifrada con
la clave p&#250;blica del destinatario.</p></td>
</tr>
</table>
