<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>P&#225;gina Configuraci&#243;n general JVM - Ayuda en l&#237;nea de la Consola de administraci&#243;n de GlassFish Enterprise Server v3 Prelude de Sun
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>

</head>

<body class="HlpBdy">

<a name="ref-jvmgeneraltab"></a><h4>P&#225;gina Configuraci&#243;n general JVM</h4>
<p>La m&#225;quina virtual de Java (JVM) viene incluida en la plataforma Java,
Standard Edition (plataforma Java SE), que necesita Servidor empresarial. La introducci&#243;n de
valores incorrectos para la configuraci&#243;n de JVM har&#225; que no funcione el
servidor; tiene que ir con cuidado a la hora de cambiar estos
valores.</p><dl><dt>Inicio de Java</dt>
<dd><p>Nombre del directorio de instalaci&#243;n del software de Java SE, que necesita Servidor empresarial para poder ejecutarse. Para comprobar que la versi&#243;n del software de Java SE que ha especificado sea compatible con esta versi&#243;n, consulte <a href="http://docs.sun.com/doc/820-4494"><i>Sun GlassFish Enterprise Server v3 Prelude Release Notes</i></a>. Si introduce un nombre de directorio no existente o un directorio para una versi&#243;n no compatible del software de Java SE, entonces Servidor empresarial no se podr&#225; iniciar.</p></dd>
<dt>Opciones de Javac</dt>
<dd><p>Opciones de l&#237;nea de comandos para el compilador del lenguaje de programaci&#243;n de Java. Servidor empresarial ejecuta el compilador cuando se implementan los componentes de Enterprise JavaBeans<sup>TM</sup> (EJB<sup>TM</sup>).</p></dd>
<dt>Depuraci&#243;n</dt>
<dd><p>Habilita la depuraci&#243;n con Java Platform Debugger Architecture (JPDA).</p><p>JPDA lo utilizan los desarrolladores de aplicaciones. Para obtener m&#225;s informaci&#243;n, consulte <a href="http://docs.sun.com/doc/820-4496"><i>Sun GlassFish Enterprise Server v3 Prelude Developer&#8217;s Guide</i></a>.</p></dd>
<dt>Opciones de depuraci&#243;n</dt>
<dd><p>Especifica las opciones de JPDA que enviar&#225; a JVM cuando se habilite la depuraci&#243;n.</p></dd>
<dt>Opciones de compilaci&#243;n RMI</dt>
<dd><p>Opciones de l&#237;nea de comandos para el compilador <tt>rmic</tt>. Servidor empresarial ejecuta el compilador <tt>rmic</tt> cuando se implementan componentes EJB.</p></dd>
<dt>Preprocesador de c&#243;digo byte</dt>
<dd><p>Nombres de clases para el preprocesamiento de c&#243;digo byte. Utilice comas para separar los nombres de clase. Todas las clases deben implementar com.sun.appserv.Interfaz del preprocesador de c&#243;digo byte. Las clases se llaman en el orden especificado.</p></dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-jvmsettings.html">C&#243;mo establecer la configuraci&#243;n general de JVM</a></p></li>
<li><p><a href="task-jvmpathsettings.html">Para establecer los valores de la ruta de JVM</a></p></li>
<li><p><a href="task-jvmoptions.html">Para configurar las opciones de JVM</a></p></li>
<li><p><a href="task-securitymanagerdisable.html">Para deshabilitar el administrador de seguridad</a></p></li>
<li><p><a href="task-jvmprofilersettings.html">Para configurar los valores del JVM Profiler</a></p></li>
<li><p><a href="task-setadvanceappconfig.html">Para establecer la configuraci&#243;n de aplicaciones avanzada</a></p></li>
<li><p><a href="task-setadvancedomainattributes.html">Para establecer los atributos de dominio avanzados</a></p></li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>
<p>ninguna.</p>
<br/>

</body>
</html>
