<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-eelogging"></a><h4>Configuraci&#243;n de registro</h4>
<p>Consulte la p&#225;gina Configuraci&#243;n de registro para configurar el registro de Servidor
empresarial.</p><p>La p&#225;gina Configuraci&#243;n de registro contiene las siguientes opciones.</p><dl><dt>Escribir en el registro del sistema</dt>
<dd><p>Si esta opci&#243;n est&#225; seleccionada, la salida de registro se env&#237;a al recurso <tt>syslog</tt> adem&#225;s de al registro del servidor. Esta caracter&#237;stica s&#243;lo est&#225; disponible en sistemas Solaris y Linux. Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p></dd>
<dt>Registrar en consola</dt>
<dd><p>Si se selecciona esta opci&#243;n, NO SABEMOS lo que ocurrir&#225;. Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p></dd>
<dt>Archivo de registro</dt>
<dd><p>Nombre o ubicaci&#243;n alternativa para el archivo de registro del servidor. La ubicaci&#243;n predeterminada es <tt>glassfish/domains/domain1/logs/server.log</tt>.</p></dd>
<dt>Controlador de registro</dt>
<dd><p>Nombre de clase absoluto de un controlador de registro personalizado. Un controlador de registro personalizado le permite enviar registros a un destino diferente de <tt>server.log</tt> o <tt>syslog</tt>. El controlador personalizado debe comprender la clase <tt>java.util.logging.Handler</tt> (una API compatible con JSR 047). Indique tambi&#233;n la clase de controlador en la ruta de clase Servidor empresarial para que el controlador se instale durante el arranque del servidor.</p></dd>
<dt>L&#237;mite de rotaci&#243;n de archivo</dt>
<dd><p>Tama&#241;o en bytes que el archivo de registro del servidor debe alcanzar antes de rotar. Cuando el registro del servidor alcanza el tama&#241;o especificado, Servidor empresarial crea un nuevo archivo vac&#237;o llamado <tt>server.log</tt> y cambia el nombre del archivo antiguo <tt>server.log_</tt><i>date</i>, donde <i>date</i> es la fecha y hora en la que se produjo la rotaci&#243;n del archivo. El valor predeterminado es 2 megabytes. El valor m&#237;nimo para el l&#237;mite es 500 kilobytes; si se especifica un valor inferior, el archivo rota cuando alcanza el tama&#241;o de 500 KB. Para deshabilitar la rotaci&#243;n del archivo de registros, defina el valor en 0.</p></dd>
<dt>L&#237;mite temporal de rotaci&#243;n de archivo</dt>
<dd><p>Minutos que transcurren antes de que el archivo del servidor tenga que rotar. El valor predeterminado es 0, lo que significa que el archivo rota cuando alcanza el tama&#241;o especificado en el campo L&#237;mite de rotaci&#243;n de archivo. Si especifica uno o m&#225;s minutos, el l&#237;mite de tiempo tiene prioridad sobre el l&#237;mite de tama&#241;o especificado en el campo L&#237;mite de rotaci&#243;n de archivo.</p></dd>
</dl>
<h5>Tareas relacionadas</h5>

<ul><li><p><a href="task-eelogging.html">Para configurar par&#225;metros generales de registros</a></p></li>
<li><p><a href="task-eelogginglevels.html">Para configurar niveles de registro</a></p></li>
<li><p><a href="task-logviewer.html">Para ver el registro del servidor</a></p></li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><tt>set-log-level</tt></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/rotate-log-1?a=view"><tt>rotate-log</tt>(1)</a></p></li></ul>

