<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-editfile-adminrealm"></a><h4>Propiedades espec&#237;ficas de la clase <tt> FileRealm</tt></h4>
<p>Un dominio <tt>file</tt> requiere las siguientes propiedades.</p><dl><dt>Contexto JAAS</dt>
<dd><p>El contexto JAAS (Servicio de autenticaci&#243;n y autorizaci&#243;n de Java) (mecanismo identificador para que el m&#243;dulo de entrada utilice este dominio). El &#250;nico valor v&#225;lido es <tt>fileRealm</tt>.</p></dd>
<dt>Archivo de claves</dt>
<dd><p>Ruta completa y nombre del archivo en el que el servidor almacenar&#225; toda la informaci&#243;n de este dominio relativa al usuario, el grupo y la contrase&#241;a. El valor predeterminado es <i>domain-dir</i><tt>/config/keyfile</tt> para el dominio <tt>file</tt> y <i>domain-dir</i><tt>/config/admin-keyfile</tt> para el dominio <tt>admin-realm </tt>.</p></dd>
</dl>
<p>&#60;Check Alignment of PHs&#62;El archivo de claves del dominio <tt>file</tt> est&#225; vac&#237;o
inicialmente, de manera que los usuarios deben de registrarse en la p&#225;gina
<a href="ref-managefilerealm.html">Archivar usuarios</a> antes de utilizar el dominio <tt>file</tt>.</p><p>El archivo de claves del dominio <tt>admin-realm</tt> contiene inicialmente el nombre de
usuario del administrador, la contrase&#241;a del administrador en formato cifrado y el
grupo al que el usuario pertenece (de manera predeterminada es <tt>asadmin</tt>). &#60;Check
Alignment of PHs&#62;Para obtener m&#225;s informaci&#243;n sobre c&#243;mo registrar usuarios en el
dominio <tt>admin-realm</tt>, consulte <a href="task-accessadmintools.html">C&#243;mo otorgar acceso a las herramientas de administraci&#243;n.</a>.</p>
<hr><p><b>Nota - </b>Los usuarios del grupo <tt>asadmin</tt> en <tt>admin-realm</tt> tienen autorizaci&#243;n para utilizar la
Consola de administraci&#243;n y las herramientas <tt>asadmin</tt>. Agregue a este grupo s&#243;lo
los usuarios que tienen privilegios de administraci&#243;n de servidores.</p>
<hr>
<p>La siguiente propiedad adicional est&#225; disponible para un dominio <tt>file</tt>.</p><dl><dt>Asignar grupos</dt>
<dd><p>Una lista de nombres de grupo separada por comas. A todos los clientes que presentan certificados v&#225;lidos se les asigna estos grupos, por ejemplo, <tt>employee,manager </tt>, donde estos son nombres de los grupos de usuarios.</p></dd>
</dl>

