<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-uc-update"></a><h4>Instalaci&#243;n de actualizaciones para componentes.</h4><p>La actualizaci&#243;n de un <a href="ref-uc-concepts.html#ref-uc-about-component">componente</a> instalado incluye las siguientes operaciones:</p>
<ul><li><p>Transferir s&#243;lo los archivos modificados de un <a href="ref-uc-concepts.html#ref-uc-about-repository">dep&#243;sito de red</a> a su sistema</p></li>
<li><p>Actualizar s&#243;lo los archivos modificados dentro de la <a href="ref-uc-concepts.html#ref-uc-about-repository">imagen de instalaci&#243;n</a> de Servidor empresarial en su sistema</p></li>
<li><p>Aplicar nuevas dependencias (si fuera necesario) entre los componentes actualizados</p></li></ul>
<ol>
<li><b>En el &#225;rbol de navegaci&#243;n, seleccione el nodo Herramienta de actualizaci&#243;n.</b><p>Se abrir&#225; la p&#225;gina Complementos disponibles.</p></li>
<li><b>En la p&#225;gina Complementos disponibles, haga clic en la ficha Actualizaciones disponibles.</b><p>Se abrir&#225; la p&#225;gina Actualizaciones disponibles.</p></li>
<li><b>En la tabla de actualizaciones disponibles, seleccione los componentes que desee actualizar.</b><p>Si no existen diferencias entre la versi&#243;n o el tama&#241;o de la
Versi&#243;n instalada y la Versi&#243;n nueva de un componente, no es necesario
actualizar el componente. Si no hay actualizaciones disponibles, la tabla aparecer&#225; vac&#237;a.</p><ul>
<li><b>Para seleccionar un componente individual, marque la casilla de verificaci&#243;n situada al
lado del nombre del componente.</b></li>
<li><b>Para seleccionar todos los componentes, haga clic en el icono Seleccionar todo
situado en el encabezado de la tabla.</b></li>
<li><b>Para anular la selecci&#243;n de todos los componentes, haga clic en el
icono Anular toda la selecci&#243;n situado en el encabezado de la tabla.</b></li></ul></li>
<li><b>Haga clic en "Instalar".</b></li>
<li><b>Acepte el acuerdo de licencia.</b><p>Servidor empresarial confirma que la instalaci&#243;n ha finalizado.</p></li>
<li><b>Reinicie el servidor.</b><p>Para obtener instrucciones detalladas, consulte la documentaci&#243;n siguiente:</p>
<ul><li><p><a href="http://docs.sun.com/doc/820-7692/ggoch?a=view">To Stop a Domain de <i>Sun GlassFish Enterprise Server v3 Administration Guide</i></a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7692/ggoda?a=view">To Start a Domain de <i>Sun GlassFish Enterprise Server v3 Administration Guide</i></a></p></li></ul>
</li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-uc-set-proxy.html">C&#243;mo configurar los valores del servidor proxy de red para acceder a los dep&#243;sitos de red</a></p></li>
<li><p><a href="task-uc-addon.html">C&#243;mo instalar componentes de complementos</a></p></li>
<li><p><a href="task-uc-installed-remove.html">C&#243;mo desinstalar componentes</a></p></li>
<li><p><a href="task-uc-pkgdetails.html">C&#243;mo ver informaci&#243;n detallada de un componente</a></p></li></ul>

