<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-lifecyclemoduleedit"></a><h4>Edici&#243;n de un m&#243;dulo de ciclo de vida</h4><ol>
<li><b>En el &#225;rbol de navegaci&#243;n, seleccione el nodo M&#243;dulo de ciclo de
vida.</b><p>Se abrir&#225; la p&#225;gina M&#243;dulos de ciclo de vida.</p></li>
<li><b>En la p&#225;gina M&#243;dulos de ciclo de vida, haga clic en el
nombre del m&#243;dulo de ciclo de vida que est&#225; editando.</b><p>Se abrir&#225; la p&#225;gina Editar m&#243;dulo de ciclo de vida.</p></li>
<li><b>En el campo Nombre de clase, escriba el nombre completo del archivo
de clase del m&#243;dulo de ciclo de vida.</b><p>La clase debe implementar la interfaz <tt>com.sun.appserv.server.LifecycleListener</tt>.</p></li>
<li><b>En el campo ruta de clase, introduzca la ruta de clase para
el m&#243;dulo de ciclo de vida.</b><p>La ruta de clase especifica d&#243;nde est&#225; ubicado el m&#243;dulo de ciclo
de vida. El valor predeterminado es <tt></tt><i>domain-dir</i><tt>/applications</tt>. Si el m&#243;dulo ya se
encuentra en este directorio (es decir, en la ruta de clase del
servidor), este campo puede dejarse en blanco.</p></li>
<li><b>En el campo Orden de carga, introduzca un valor que especifique el
orden en que este m&#243;dulo de ciclo de vida se cargar&#225; en
el arranque.</b><p>Los m&#243;dulos con valores de orden de carga inferiores se cargar&#225;n antes.
El valor puede estar entre 101 y el <tt>MAXINT</tt> del sistema operativo.
Los valores de 0 a 100 est&#225;n reservados.</p></li>
<li><b>Seleccione la casilla de verificaci&#243;n Estado habilitado para habilitar el m&#243;dulo de
ciclo de vida.</b><p>Esta opci&#243;n est&#225; habilitada por defecto.</p></li>
<li><b>Seleccione la casilla de verificaci&#243;n Arranque de instancia para impedir fallo en
la carga para especificar que el servidor debe apagarse si se produce
un error en la carga del m&#243;dulo de ciclo de vida.</b><p>Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p></li>
<li><b>En la lista desplegable Servidores virtuales, seleccione el servidor o servidores virtuales
que se asociar&#225; con el m&#243;dulo de ciclo de vida.</b><p>De manera predeterminada no hay ning&#250;n servidor virtual seleccionado.</p></li>
<li><b>En el campo Descripci&#243;n, introduzca una descripci&#243;n del m&#243;dulo de ciclo de
vida.</b></li>
<li>(Opcional) <b>En la secci&#243;n Propiedades adicionales, especifique las propiedades adicionales.</b><p>Servidor empresarial no define ninguna propiedad adicional para los m&#243;dulos de ciclo
de vida.</p><ul>
<li><b>Para a&#241;adir una propiedad, haga clic en el bot&#243;n Agregar propiedad. En
la fila vac&#237;a escriba el nombre de la propiedad en el campo
Nombre y el valor de la propiedad en el campo Valor.</b></li>
<li><b>Para modificar una propiedad, edite el campo Valor de la propiedad.</b></li>
<li><b>Para eliminar una propiedad, marque la casilla de verificaci&#243;n situada a la
izquierda del campo Nombre de la propiedad que quiera eliminar y, a
continuaci&#243;n, haga clic en el bot&#243;n Eliminar propiedades.</b></li></ul></li>
<li><b>Haga clic en Guardar.</b>
<hr><p><b>Consejo - </b>Para volver a los valores de configuraci&#243;n predeterminados, haga clic en el
bot&#243;n Cargar predeterminados y, a continuaci&#243;n, en Guardar.</p>
<hr>
</li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-lifecyclemodulenew.html">Creaci&#243;n de un m&#243;dulo de ciclo de vida</a></p></li>
<li><p><a href="task-lifecyclemoduledelete.html">Eliminaci&#243;n de un m&#243;dulo de ciclo de vida</a></p></li></ul>

