<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jaccprovidernew"></a><h4>Creaci&#243;n de un proveedor JACC</h4><p>JACC (Java Authorization Contract for Containers) es una parte de la especificaci&#243;n
de Java que define una interfaz para proveedores de autorizaci&#243;n conectables. Esto
permite al administrador establecer m&#243;dulos de <b>complemento</b> de terceras partes para llevar
a cabo la autorizaci&#243;n. Por defecto Servidor empresarial ofrece un motor de
autorizaci&#243;n sencillo basado en archivos que cumple con JACC.</p><p>Para obtener informaci&#243;n acerca de c&#243;mo escribir clases de implementaci&#243;n para un
proveedor JACC, consulte la especificaci&#243;n JACC en <a href="http://jcp.org/en/jsr/detail?id=115">http://jcp.org/en/jsr/detail?id=115</a>.</p><ol>
<li><b>En el &#225;rbol de navegaci&#243;n, expanda el nodo Configuraci&#243;n.</b></li>
<li><b>En el nodo Configuraci&#243;n, expanda el nodo Seguridad.</b></li>
<li><b>En el nodo Seguridad, seleccione el nodo Proveedores JACC.</b><p>Se abrir&#225; la p&#225;gina Proveedores JACC.</p></li>
<li><b>En la p&#225;gina Proveedores JACC haga clic en Nuevo.</b><p>Se abrir&#225; la p&#225;gina Nuevo proveedor JACC.</p></li>
<li><b>En la p&#225;gina Nuevo proveedor JACC, en el campo Nombre, introduzca el
nombre que identificar&#225; a este proveedor.</b></li>
<li><b>En el campo Configuraci&#243;n de directivas, introduzca el nombre de la clase
que implementa el generador de configuraci&#243;n de directivas.</b><p>El proveedor <tt>default</tt> utiliza <tt>com.sun.enterprise.security.provider.PolicyConfigurationFactoryImpl </tt>. El proveedor <tt>simple </tt> utiliza <tt>com.sun.enterprise.security.jacc.provider.SimplePolicyConfigurationFactory </tt>.</p></li>
<li><b>En el campo Proveedor de directivas, introduzca el nombre de la clase
que implementa el generador de directivas.</b><p>El proveedor <tt>default</tt> utiliza <tt>com.sun.enterprise.security.provider.PolicyWrapper</tt>. El proveedor <tt>simple</tt> utiliza <tt>com.sun.enterprise.security.jacc.provider.SimplePolicyProvider </tt>.</p></li>
<li>(Opcional) <b>En la secci&#243;n Propiedades adicionales, especifique las propiedades adicionales.</b><p>Para a&#241;adir una propiedad, haga clic en el bot&#243;n Agregar propiedad. En
la fila vac&#237;a escriba el nombre de la propiedad en el campo
Nombre y el valor de la propiedad en el campo Valor.</p><p>Para obtener una descripci&#243;n de las propiedades adicionales disponibles para proveedores JACC,
consulte<a href="ref-jaccproviderprop.html">Propiedades espec&#237;ficas de los proveedores JACC</a>.</p></li>
<li><b>Haga clic en Aceptar.</b></li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-jaccprovideredit.html">Edici&#243;n de un proveedor JACC</a></p></li>
<li><p><a href="task-jaccproviderdelete.html">Eliminaci&#243;n de un proveedor JACC</a></p></li>
<li><p><a href="task-setactivejaccprov.html">Establecimiento del proveedor JACC activo</a></p></li></ul>

