<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jmxconnectoredit"></a><h4>Edici&#243;n del conector JMX</h4><p>Utilice el servicio de administraci&#243;n para configurar un conector JMX remoto compatible
con JSR 160.</p><p>El conector JMX remoto compatible con JSR 169 procesa la comunicaci&#243;n entre
clientes JMX, como JConsole y el servicio JMX con fines de gesti&#243;n
del dominio.</p><ol>
<li><b>En el &#225;rbol de navegaci&#243;n, expanda el nodo Configuraci&#243;n.</b></li>
<li><b>En el nodo Configuraci&#243;n, seleccione el nodo Servicio de administraci&#243;n.</b><p>Se abrir&#225; la p&#225;gina Editar conector JMX.</p></li>
<li><b>Seleccione la casilla de verificaci&#243;n Seguridad habilitada para que la comunicaci&#243;n JMX
est&#233; cifrada.</b><p>Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p></li>
<li><b>En el campo Direcci&#243;n, introduzca la direcci&#243;n IP del servicio de asignaci&#243;n
de nombres donde se encuentra registrado el c&#243;digo auxiliar del servidor del
conector JMX.</b><p>&#201;ste no es el puerto del socket del servidor que posibilita la
comunicaci&#243;n JMX. &#201;sta es la direcci&#243;n de la interfaz de red donde
se ha iniciado el registro RMI. Si su sistema dispone de varias
interfaces de red, modifique este valor para que s&#243;lo se seleccione una
interfaz determinada. El valor predeterminado es <tt>0.0.0.0</tt>.</p></li>
<li><b>En el campo Puerto, introduzca el N&#250;mero de puerto en el que
el servicio de asignaci&#243;n de nombres (registro RMI) escucha las conexiones del
cliente RMI.</b><p>La &#250;nica funci&#243;n de este servicio de asignaci&#243;n de nombres es descargar
los c&#243;digos auxiliares de RMI. Si el puerto predeterminado est&#225; ocupado, se
utilizar&#225; otro puerto que est&#233; libre. Los valores v&#225;lidos se encuentran entre
1 y 65535. En sistemas UNIX<sup>&#174;</sup>, la creaci&#243;n de sockets de escucha
para puertos 1-1024 requiere privilegios de superusuario. El valor predeterminado es 8686.</p></li>
<li><b>En el campo Nombre de dominio, escriba el nombre que representa el
dominio administrativo especial.</b><p>Este dominio administrar&#225; toda la autenticaci&#243;n. El valor predeterminado es <tt>admin-realm</tt>.</p></li>
<li>(Opcional) <b>En la secci&#243;n Propiedades adicionales, especifique las propiedades adicionales.</b><p>Servidor empresarial especifica varias propiedades de manera predeterminada.</p><ul>
<li><b>Para a&#241;adir una propiedad, haga clic en el bot&#243;n Agregar propiedad. En
la fila vac&#237;a escriba el nombre de la propiedad en el campo
Nombre y el valor de la propiedad en el campo Valor.</b></li>
<li><b>Para modificar una propiedad, edite el campo Valor de la propiedad.</b></li>
<li><b>Para eliminar una propiedad, marque la casilla de verificaci&#243;n situada a la
izquierda del campo Nombre de la propiedad que quiera eliminar y, a
continuaci&#243;n, haga clic en el bot&#243;n Eliminar propiedades.</b></li></ul></li>
<li><b>Haga clic en Guardar.</b></li>
<li><b>Si marca la casilla de verificaci&#243;n Seguridad habilitada, siga los pasos descritos
en <a href="task-jmxconnectorssledit.html">Edici&#243;n de configuraci&#243;n SSL para el conector JMX</a>.</b></li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-jmxconnectorssledit.html">Edici&#243;n de configuraci&#243;n SSL para el conector JMX</a></p></li></ul>

