<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-auditmoduleedit"></a><h4>C&#243;mo editar un m&#243;dulo de auditor&#237;a</h4><p>Los m&#243;dulos de auditor&#237;a no se activan por defecto. Para obtener m&#225;s
informaci&#243;n sobre c&#243;mo habilitar los m&#243;dulos de auditor&#237;a, consulte <a href="task-enabledisableauditmod.html">C&#243;mo habilitar o deshabilitar el registro de auditor&#237;a</a>.</p><ol>
<li><b>En el &#225;rbol de navegaci&#243;n, expanda el nodo Configuraci&#243;n.</b></li>
<li><b>En el nodo Configuraci&#243;n, expanda el nodo Seguridad.</b></li>
<li><b>En el nodo Seguridad, seleccione el nodo M&#243;dulos de auditor&#237;a.</b><p>Se abrir&#225; la p&#225;gina M&#243;dulos de auditor&#237;a.</p></li>
<li><b>En la p&#225;gina M&#243;dulos de auditor&#237;a HTTP, haga clic en el nombre
del m&#243;dulo de auditor&#237;a que est&#225; editando.</b><p>Se abrir&#225; la p&#225;gina Editar m&#243;dulo de auditor&#237;a.</p></li>
<li><b>En la p&#225;gina Editar m&#243;dulo de auditor&#237;a, escriba un valor nuevo en
el campo Nombre de clase para modificar el nombre de clase.</b></li>
<li>(Opcional) <b>En la secci&#243;n Propiedades adicionales, especifique las propiedades adicionales.</b><p>Para ver una descripci&#243;n de las propiedades adicionales disponibles para los m&#243;dulos
de auditor&#237;a, consulte <a href="ref-auditmoduleprop.html">Propiedades espec&#237;ficas de los m&#243;dulos de auditor&#237;a</a>.</p><ul>
<li><b>Para a&#241;adir una propiedad, haga clic en el bot&#243;n Agregar propiedad. En
la fila vac&#237;a escriba el nombre de la propiedad en el campo
Nombre y el valor de la propiedad en el campo Valor.</b></li>
<li><b>Para modificar una propiedad, edite el campo Valor de la propiedad.</b></li>
<li><b>Para eliminar una propiedad, marque la casilla de verificaci&#243;n situada a la
izquierda del campo Nombre de la propiedad que quiera eliminar y, a
continuaci&#243;n, haga clic en el bot&#243;n Eliminar propiedades.</b></li></ul></li>
<li><b>Haga clic en Guardar.</b></li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-auditmodulenew.html">C&#243;mo crear un m&#243;dulo de auditor&#237;a</a></p></li>
<li><p><a href="task-auditmoduledelete.html">C&#243;mo eliminar un m&#243;dulo de auditor&#237;a</a></p></li>
<li><p><a href="task-enabledisableauditmod.html">C&#243;mo habilitar o deshabilitar el registro de auditor&#237;a</a></p></li>
<li><p><a href="task-setactiveauditmod.html">C&#243;mo establecer el m&#243;dulo de auditor&#237;a activo</a></p></li>
<li><p><a href="task-usedefaultauditmod.html">C&#243;mo utilizar el m&#243;dulo de auditor&#237;a predeterminado</a></p></li></ul>

