<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-register"></a><h4>C&#243;mo registrar GlassFish de Sun Servidor empresarial en Sun Connection</h4><a name="indexterm-1"></a><a name="indexterm-2"></a><a name="indexterm-3"></a><p>Como usuario registrado de Sun GlassFish<sup>TM</sup> Servidor empresarial, obtendr&#225; las siguientes ventajas:</p>
<ul><li><p>Informaci&#243;n de parches y actualizaciones de errores</p></li>
<li><p>V&#237;deos de procedimientos en pantalla y tutoriales</p></li>
<li><p>Noticias y eventos</p></li>
<li><p>Ofertas de asistencia y formaci&#243;n</p></li></ul>
<p>Para registrar su instalaci&#243;n de GlassFish de Sun Servidor empresarial con <a href="http://www.sun.com/service/sunconnection/index.jsp">Sun Connection</a>,
debe disponer de una <a href="https://reg.sun.com/whyregister">Cuenta en l&#237;nea de Sun</a>. Si no tiene una cuenta Sun Online,
Servidor empresarial le permite crear una cuenta al registrar este producto.</p>
<hr><p><b>Nota - </b>Si crea una cuenta Sun Online al registrar Servidor empresarial, se le
pedir&#225; s&#243;lo la informaci&#243;n necesaria. Tras registrar Servidor empresarial, puede obtener informaci&#243;n
adicional opcional <a href="https://reg.sun.com/updateaccount">actualizando su cuenta en l&#237;nea de Sun</a>. </p>
<hr>
<h6>Antes de empezar</h6><p>Si el equipo en el que se est&#225; ejecutando Servidor empresarial se
conecta a Internet a trav&#233;s de un proxy, obtenga el nombre de
host y el n&#250;mero de puerto del proxy. Si se est&#225; ejecutando
un navegador web en el equipo en el que se est&#225; ejecutando
Servidor empresarial, podr&#225; obtener esta informaci&#243;n del navegador web. De lo contrario,
p&#243;ngase en contacto con el administrador del sistema para obtener m&#225;s informaci&#243;n.</p><ol>
<li><b>En el &#225;rbol de navegaci&#243;n, seleccione el nodo Registro.</b><p>Se abrir&#225; la p&#225;gina Registro de productos.</p></li>
<li><b>En la p&#225;gina de registro del producto introduzca la informaci&#243;n necesaria.</b><ul>
<li><b>Si ya dispone de una cuenta Sun Online, introduzca la informaci&#243;n necesaria
siguiente:</b><ol style="list-style-type: lower-alpha">
<li><b>Seleccione la opci&#243;n Ya tengo una cuenta en l&#237;nea de Sun o
una cuenta de Sun Developer Network (SDN).</b></li>
<li><b>En el campo de Nombre de usuario, escriba el nombre de usuario
que especific&#243; al registrar su cuenta Sun Online.</b></li>
<li><b>En el campo de Contrase&#241;a, escriba la contrase&#241;a que especific&#243; al registrar
su cuenta Sun Online.</b></li></ol></li>
<li><b>Si no dispone de una cuenta Sun Online, introduzca la informaci&#243;n necesaria
siguiente:</b><ol style="list-style-type: lower-alpha">
<li><b>Seleccione la opci&#243;n No tengo una cuenta de Sun Online.</b></li>
<li><b>En el campo Direcci&#243;n de correo electr&#243;nico introduzca su direcci&#243;n de correo
electr&#243;nico.</b><p>Su direcci&#243;n de correo electr&#243;nico ser&#225; su nombre de usuario de cuenta
Sun Online.</p></li>
<li><b>En el campo Contrase&#241;a escriba la contrase&#241;a que utiliza para su cuenta
Sun Online.</b><p>La contrase&#241;a distingue entre may&#250;sculas y min&#250;sculas y debe tener 6&#8211;10 caracteres.</p></li>
<li><b>En el campo Vuelva a escribir su contrase&#241;a, vu&#233;lvala a escribir.</b></li>
<li><b>En el campo Nombre escriba su nombre.</b></li>
<li><b>En el campo Apellido escriba su apellido.</b></li>
<li><b>En el campo Empresa, escriba el nombre de su empresa, si procede.</b></li>
<li><b>De la lista desplegable seleccione el pa&#237;s o regi&#243;n donde vive.</b></li></ol></li></ul></li>
<li><b>Si el equipo en el que se est&#225; ejecutando Servidor empresarial se
conecta a Internet a trav&#233;s de un proxy, obtenga el nombre de
host y el n&#250;mero de puerto del proxy.</b><p>Si el equipo en el que se est&#225; ejecutando Servidor empresarial se
conecta directamente a Internet, omita este paso.</p><p>Un navegador web debe estar ejecut&#225;ndose en el equipo en el que
se est&#225; ejecutando Servidor empresarial. En esta situaci&#243;n, puede obtener el nombre
de host y el n&#250;mero de puerto del proxy del navegador web.
De lo contrario, p&#243;ngase en contacto con el administrador del sistema para
obtener m&#225;s informaci&#243;n.</p></li>
<li><b>Haga clic en Registrarse.</b><p>Para confirmar que se ha completado el registro, se abrir&#225; la <a href="ref-supportpage.html">p&#225;gina de asistencia t&#233;cnica</a>.</p></li></ol>
