<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-setadvanceappconfig"></a><h4>Establecimiento de la configuraci&#243;n avanzada de aplicaciones</h4><a name="indexterm-8"></a><a name="indexterm-9"></a><a name="indexterm-10"></a><a name="indexterm-11"></a><p>Utilice la p&#225;gina Configuraci&#243;n de aplicaciones para establecer las propiedades que permiten
garantizar que los cambios realizados en las aplicaciones implementadas se detecten y
las clases modificadas se vuelven a cargar.</p><ol>
<li><b>En el &#225;rbol de navegaci&#243;n, seleccione el nodo Servidor empresarial.</b><p>Aparecer&#225; la p&#225;gina de Informaci&#243;n general.</p></li>
<li><b>En la p&#225;gina Informaci&#243;n general, haga clic en la ficha Avanzado.</b><p>Se abrir&#225; la p&#225;gina Configuraci&#243;n de aplicaciones.</p></li>
<li><b>Marque la casilla de verificaci&#243;n Recarga activada para habilitar la recarga din&#225;mica
de las aplicaciones.</b><p>Si se habilita la recarga din&#225;mica, no tiene que volver a implementar
una aplicaci&#243;n o m&#243;dulo cuando cambia su c&#243;digo o descriptores de implementaci&#243;n.
Lo &#250;nico que tiene que hacer es copiar los archivos JavaServer Pages<sup>TM</sup> (JSP<sup>TM</sup>)
o de clase modificados en el directorio de implementaci&#243;n de la aplicaci&#243;n
o m&#243;dulo. El servidor comprueba peri&#243;dicamente los cambios realizados en el directorio
de implementaci&#243;n y vuelve a implementar la aplicaci&#243;n de forma autom&#225;tica y
din&#225;mica con los cambios. Esto es &#250;til en un entorno de desarrollo
ya que permite poner a prueba los cambios realizados en el c&#243;digo
de forma r&#225;pida. En cambio, en un entorno de producci&#243;n la recarga
din&#225;mica puede hacer que disminuya el rendimiento. Adem&#225;s, cuando ha finalizado la
recarga, las sesiones del periodo de transici&#243;n pierden su validez. El cliente
debe reiniciar la sesi&#243;n.</p><p>Esta opci&#243;n est&#225; habilitada por defecto.</p></li>
<li><b>En el campo Intervalo de sondeo de recarga, introduzca la longitud, en
segundos, del intervalo en el que se comprobar&#225;n los cambios de c&#243;digo
de las aplicaciones y m&#243;dulos, y si se han recargado de forma
din&#225;mica. </b><p>El valor predeterminado es 2.</p></li>
<li><b>En el campo Tiempo de espera de sesi&#243;n de administraci&#243;n, introduzca el
n&#250;mero de minutos de inactividad tras los que debe agotarse el tiempo
de espera de la Consola de administraci&#243;n.</b><p>El valor predeterminado es 60.</p></li>
<li><b>Marque la casilla de verificaci&#243;n Implementaci&#243;n autom&#225;tica activada para habilitar la implementaci&#243;n
autom&#225;tica de aplicaciones.</b><p>Si copia un archivo de aplicaci&#243;n o m&#243;dulo (JAR, WAR, RAR o
EAR) en un directorio especial y, a continuaci&#243;n, habilita la implementaci&#243;n autom&#225;tica,
Servidor empresarial implementar&#225; autom&#225;ticamente la aplicaci&#243;n o m&#243;dulo. Esta opci&#243;n est&#225; habilitada
por defecto.</p></li>
<li><b>En el campo Intervalo de sondeo de implementaci&#243;n autom&#225;tica, introduzca la longitud,
en segundos, del intervalo en el que se comprobar&#225;n los cambios de
c&#243;digo de las aplicaciones y m&#243;dulos, y si se han recargado de
forma din&#225;mica. </b><p>El valor predeterminado es 2. Si cambia el intervalo de sondeo no
quedar&#225; afectado el tiempo que se tarda en implementar una aplicaci&#243;n o
un m&#243;dulo.</p></li>
<li><b>En el campo Tiempo de espera de reintento de implementaci&#243;n autom&#225;tica, introduzca
el n&#250;mero de segundos que un archivo copiado parcialmente puede permanecer sin
cambios en el tama&#241;o antes de que se produzca un error.</b><p>El valor predeterminado es 4.</p></li>
<li><b>En el campo Directorio de implementaci&#243;n autom&#225;tica, introduzca la ruta completa del
directorio para supervisar la implementaci&#243;n autom&#225;tica de aplicaciones.</b><p>El valor predeterminado es <tt></tt><i>domain-dir</i><tt>/autodeploy</tt>.</p></li>
<li><b>En la lista desplegable Validaci&#243;n XML, seleccione el tipo de validaci&#243;n XML
que se llevar&#225; a cabo en los descriptores de implementaci&#243;n est&#225;ndar y
de Servidor empresarial.</b><p>El tipo puede ser cualquiera de los siguientes:</p><dl><dt><tt>full</tt></dt>
<dd><p>Si se produce un error en la validaci&#243;n, la implementaci&#243;n no se llevar&#225; a cabo. &#201;ste es el valor predeterminado.</p></dd>
<dt><tt>parsing</tt></dt>
<dd><p>Se informa acerca de errores en la validaci&#243;n XML, pero la implementaci&#243;n se lleva a cabo.</p></dd>
<dt><tt>none</tt></dt>
<dd><p>No se realiza ninguna validaci&#243;n XML.</p></dd>
</dl>
</li>
<li><b>Marque la casilla de verificaci&#243;n Verificador activado para verificar los archivos de
descriptor de implementaci&#243;n.</b><p>El verificador examinar&#225; la estructura y contenido del archivo antes de la
autoimplementaci&#243;n. Si se produce un error en la verificaci&#243;n, la implementaci&#243;n no
se llevar&#225; a cabo. La verificaci&#243;n de aplicaciones de gran tama&#241;o tiende
a llevar mucho tiempo. Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p></li>
<li><b>Marque la casilla de verificaci&#243;n Precompilaci&#243;n activada para precompilar los archivos JSP <sup>TM</sup>.</b><p>Si se deshabilita esta opci&#243;n, los archivos JSP se compilar&#225;n en el
tiempo de ejecuci&#243;n cuando se acceda a los mismos por primera vez.
Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p></li>
<li>(Opcional) <b>En la secci&#243;n Propiedades adicionales, especifique las propiedades adicionales.</b><p>Servidor empresarial no define ninguna propiedad adicional para las aplicaciones.</p><ul>
<li><b>Para a&#241;adir una propiedad, haga clic en el bot&#243;n Agregar propiedad. En
la fila vac&#237;a escriba el nombre de la propiedad en el campo
Nombre y el valor de la propiedad en el campo Valor.</b></li>
<li><b>Para modificar una propiedad, edite el campo Valor de la propiedad.</b></li>
<li><b>Para eliminar una propiedad, marque la casilla de verificaci&#243;n situada a la
izquierda del campo Nombre de la propiedad que quiera eliminar y, a
continuaci&#243;n, haga clic en el bot&#243;n Eliminar propiedades.</b></li></ul></li>
<li><b>Haga clic en Guardar.</b>
<hr><p><b>Consejo - </b>Para volver a los valores de configuraci&#243;n predeterminados, haga clic en el
bot&#243;n Cargar predeterminados y, a continuaci&#243;n, en Guardar.</p>
<hr>
</li>
<li><b>Reinicie el servidor.</b></li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-generaltab.html">Vista de informaci&#243;n general acerca de Servidor empresarial</a></p></li>
<li><p><a href="task-logviewer.html">Para ver el registro del servidor</a></p></li>
<li><p><a href="task-setadvancedomainattributes.html">Para establecer los atributos de dominio avanzados</a></p></li>
<li><p><a href="task-setadminpassword.html">Cambio de contrase&#241;a del administrador</a></p></li>
<li><p><a href="task-systemproperties.html">Gesti&#243;n de propiedades del sistema</a></p></li>
<li><p><a href="task-appmonitoringdata.html">Visualizaci&#243;n de datos de supervisi&#243;n de la aplicaci&#243;n</a></p></li>
<li><p><a href="task-servermonitoringdata.html">Visualizaci&#243;n de datos de supervisi&#243;n del servidor</a></p></li></ul>

