<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-appdeployruby"></a><h4>Implementaci&#243;n de una aplicaci&#243;n de Ruby</h4><ol>
<li><b>En el &#225;rbol de navegaci&#243;n, seleccione el nodo Aplicaciones.</b><p>Se abrir&#225; la p&#225;gina Aplicaciones </p></li>
<li><b>En la tabla Aplicaciones implementadas, haga clic en el bot&#243;n Implementar.</b><p>Se abrir&#225; la p&#225;gina Implementar aplicaciones o M&#243;dulos.</p></li>
<li><b>Especifique la ubicaci&#243;n del archivo de almacenamiento donde se encuentra la aplicaci&#243;n
que se va a implementar.</b><ul>
<li><b>Si el archivo de almacenamiento es un archivo que reside en la
m&#225;quina cliente o al que se puede acceder desde la m&#225;quina cliente,
seleccione la opci&#243;n Archivo empaquetado que se cargar&#225; en el servidor.</b><p>La m&#225;quina cliente es el host en el que est&#225; viendo la
Consola de administraci&#243;n por medio de un navegador.</p><p>Haga clic en Examinar para buscar el archivo o bien escriba la
ruta completa hasta el archivo.</p></li>
<li><b>Si el archivo de almacenamiento es un archivo que reside en el
equipo servidor o es una aplicaci&#243;n descomprimida desde un directorio desplegado, seleccione
la opci&#243;n Archivo empaquetado local o Directorio accesible desde Servidor empresarial.</b><p>El equipo servidor es el host que se est&#225; ejecutando en el
servidor de administraci&#243;n del dominio (DAS). </p><p>Haz clic en Examinar archivos para buscar un archivo, o en Examinar
carpetas para buscar un directorio. Como opci&#243;n alternativa, escriba el nombre de
la ruta completa del archivo o directorio. Es frecuente implementar una aplicaci&#243;n
JRuby desde un directorio.</p></li></ul></li>
<li><b>En la lista desplegable Tipo, seleccione aplicaci&#243;n Ruby.</b><p>Si ha especificado un Archivo empaquetado para ser cargado en el servidor
o un Archivo empaquetado local accesible desde Servidor empresarial,el tipo de aplicaci&#243;n
se detectar&#225; autom&#225;ticamente. Si ha especificado un Directorio accesible desde Servidor empresarial,
debe especificar el tipo de manera manual.</p></li>
<li><b>En el campo Nombre de la aplicaci&#243;n, puede mantener el nombre predeterminado,
que es el nombre del directorio o el prefijo del nombre del
archivo, o bien escribir un nombre distinto.</b><p>El nombre predeterminado aparece si decide cargar un archivo. El nombre de
la aplicaci&#243;n debe ser &#250;nico.</p></li>
<li><b>En el campo Ra&#237;z de contexto, introduzca la cadena que identifica la
aplicaci&#243;n Ruby.</b><p>En la URL de la aplicaci&#243;n Ruby, la ra&#237;z de contexto aparece
justo despu&#233;s del n&#250;mero de puerto (<tt>http://</tt><i>host</i><tt>:</tt><i> port</i><tt>/</tt><i>context-root</i><tt>/...</tt>). La ra&#237;z de contexto debe
comenzar por una barra diagonal, por ejemplo, <tt>/hello</tt>.</p></li>
<li><b>Seleccione la casilla de verificaci&#243;n Estado habilitado para habilitar la aplicaci&#243;n.</b><p>Esta opci&#243;n est&#225; seleccionada de forma predeterminada. Si esta opci&#243;n est&#225; deshabilitada,
la aplicaci&#243;n no estar&#225; disponible.</p></li>
<li><b>Seleccione la casilla de verificaci&#243;n Forzar reimplementaci&#243;n para forzar la reimplementaci&#243;n si
ya se ha implementado la aplicaci&#243;n.</b><p>Si esta opci&#243;n no est&#225; seleccionada y se intenta implementar una aplicaci&#243;n
que ya se haya implementado, se producir&#225; un error. Esta opci&#243;n se
encuentra deshabilitada de forma predeterminada.</p></li>
<li><b>En el campo Inicio de JRuby, introduzca la ruta hacia el directorio
en que est&#225; instalado el contenedor de JRuby.</b><p>La ubicaci&#243;n predeterminada es <tt></tt><i>as-install</i><tt>/jruby </tt>. Si especifica un valor en este campo,
el valor de la aplicaci&#243;n reemplazar&#225; al valor Inicio de JRuby determinado
para el contenedor JRuby.</p></li>
<li><b>En el campo Tiempo de ejecuci&#243;n, introduzca el tiempo de ejecuci&#243;n inicial
para JRuby.</b><p>El valor debe ser al menos igual al valor del campo Tiempo
de ejecuci&#243;n m&#237;nimo, pero inferior al valor que figura en el campo
Tiempo de ejecuci&#243;n m&#225;ximo. El valor predeterminado es 1. Si especifica un
valor en este campo, el valor de la aplicaci&#243;n reemplazar&#225; al valor
Tiempo de ejecuci&#243;n determinado para el contenedor de JRuby.</p></li>
<li><b>En el campo Tiempo de ejecuci&#243;n m&#237;nimo, introduzca el tiempo de ejecuci&#243;n
m&#237;nimo de JRuby en el conjunto.</b><p>El valor debe ser igual o inferior al valor del campo Tiempo
de ejecuci&#243;n e inferior al valor en el campo Tiempo de ejecuci&#243;n
m&#225;ximo. El valor predeterminado es 1. Si especifica un valor en este
campo, el valor de la aplicaci&#243;n reemplazar&#225; al valor Tiempo de ejecuci&#243;n
m&#237;nimo determinado para el contenedor de JRuby.</p></li>
<li><b>En el campo Tiempo de ejecuci&#243;n m&#225;ximo, introduzca el tiempo de ejecuci&#243;n
m&#225;ximo de JRuby en el conjunto.</b><p>El valor debe ser igual o superior al valor del campo Tiempo
de ejecuci&#243;n m&#237;nimo e igual o superior al valor del campo Tiempo
de ejecuci&#243;n. El valor predeterminado es 2. Si especifica un valor en
este campo, el valor de la aplicaci&#243;n reemplazar&#225; al valor Tiempo de
ejecuci&#243;n m&#225;ximo determinado para el contenedor de JRuby.</p></li>
<li><b>En la lista desplegable Estructuras, seleccione la estructura en la que se
implementar&#225; la aplicaci&#243;n.</b><p>Las opciones disponibles son <tt>rails</tt>, <tt>merb</tt>, <tt>sinatra</tt> y <tt>auto-detection</tt>. El valor predeterminado
es <tt>auto-detection</tt>. Si establece esta propiedad en un valor distinto a <tt>auto-detection</tt>
omitir&#225; el proceso normal y potencialmente largo de detecci&#243;n autom&#225;tica y forzar&#225;
la implementaci&#243;n en la estructura especificada. Si la aplicaci&#243;n implementada no se
escribe para la estructura especificada, se produce un error.</p></li>
<li><b>En la lista desplegable Entorno Rack, seleccione el entorno donde se ejecuta
una estructura JRuby, como Rails o Merb.</b><p>Las opciones disponibles son <tt>production</tt>, <tt>development</tt> y <tt>test</tt>. El valor predeterminado es
<tt>development</tt>.</p></li>
<li><b>En la lista desplegable MT-seguro, seleccione la configuraci&#243;n de subproceso seguro para
la estructura donde se ejecutar&#225; la aplicaci&#243;n.</b><p>Esta propiedad afecta a aplicaciones iniciadas mediante detecci&#243;n autom&#225;tica de una secuencia
de comandos de inicio proporcionada por el usuario. Las opciones disponibles son:</p><dl><dt><tt>true</tt></dt>
<dd><p>Especifica que la estructura cuenta son subprocesos seguros y por tanto no necesita la creaci&#243;n de un conjunto.</p></dd>
<dt><tt>false</tt></dt>
<dd><p>Especifica que la aplicaci&#243;n se inicia con un conjunto de instancias de aplicaci&#243;n, y a cada instancia de la aplicaci&#243;n accede un subproceso al mismo tiempo.</p></dd>
<dt><tt>default</tt></dt>
<dd><p>Servidor empresarial trata de detectar la seguridad de los subprocesos de manera autom&#225;tica. &#201;ste es el valor predeterminado.</p></dd>
</dl>
<p>Esta propiedad afecta &#250;nicamente a las estructuras iniciadas en lugares donde no
se puede determinar autom&#225;ticamente la seguridad de los subprocesos. Si configura este
valor en <tt>true</tt>, no se produce una detecci&#243;n autom&#225;tica de la aplicaci&#243;n
Rails 2.1.<i>x</i> para que se inicie en modo de subprocesos seguros, ni
se puede utilizar para forzar el inicio de una estructura de subprocesos
seguros en modo agrupado.</p></li>
<li><b>En la lista desplegable Servidores virtuales, seleccione el servidor virtual asociado a
esta aplicaci&#243;n.</b></li>
<li><b>En el campo Descripci&#243;n, introduzca una descripci&#243;n de esta aplicaci&#243;n </b></li>
<li><b>Haga clic en Aceptar.</b></li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-applistdeployed.html">Ver una lista de aplicaciones implementadas</a></p></li>
<li><p><a href="task-appdeployweb.html">C&#243;mo implementar una aplicaci&#243;n web</a></p></li>
<li><p><a href="task-deployentapp.html">Implementaci&#243;n de una aplicaci&#243;n empresarial</a></p></li>
<li><p><a href="task-appdeployclient.html">Implementar un cliente de aplicaciones</a></p></li>
<li><p><a href="task-appdeployconn.html">Implementaci&#243;n de un m&#243;dulo del conector</a></p></li>
<li><p><a href="task-appdeployejb.html">Implementaci&#243;n de un JAR EJB</a></p></li>
<li><p><a href="task-appedit.html">Para editar una aplicaci&#243;n implementada</a></p></li>
<li><p><a href="task-appviewdesc.html">C&#243;mo ver los descriptores de una aplicaci&#243;n</a></p></li>
<li><p><a href="task-applaunch.html">C&#243;mo iniciar una aplicaci&#243;n</a></p></li>
<li><p><a href="task-appredeploy.html">C&#243;mo volver a implementar una aplicaci&#243;n implementada</a></p></li>
<li><p><a href="task-apprestart.html">C&#243;mo reiniciar una aplicaci&#243;n implementada</a></p></li></ul>

