<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-eelogginglevels"></a><h4>Para configurar niveles de registro</h4><a name="indexterm-20"></a><a name="indexterm-21"></a><ol>
<li><b>En el &#225;rbol de navegaci&#243;n, expanda el nodo Configuraci&#243;n.</b></li>
<li><b>En el nodo Configuraci&#243;n, seleccione el nodo Configuraci&#243;n de registro.</b><p>Se abrir&#225; la p&#225;gina Configuraci&#243;n de registro.</p></li>
<li><b>En la p&#225;gina Configuraci&#243;n de registro, haga clic en la ficha Niveles
de registro.</b><p>Se abrir&#225; la p&#225;gina Niveles de registro del m&#243;dulo.</p></li>
<li><b>En la p&#225;gina Niveles de registro del m&#243;dulo, cambie los niveles de
registro para uno o m&#225;s m&#243;dulos de la siguiente manera.</b><ul>
<li><b>Para cambiar el nivel de registro para un m&#243;dulo individual, seleccione un
nuevo valor de la lista desplegable frente al m&#243;dulo cuyo nivel de
registro desea cambiar.</b></li>
<li><b>Para cambiar el nivel de registro para un grupo de m&#243;dulos:</b><ol style="list-style-type: lower-alpha">
<li><b>Seleccione las casillas de verificaci&#243;n junto a los nombres de los m&#243;dulos
cuyos niveles de registro desea cambiar.</b></li>
<li><b>Seleccione un valor en la lista desplegable en la parte superior de
la tabla.</b></li>
<li><b>Haga clic en el bot&#243;n Cambiar nivel.</b></li></ol></li></ul><p>Los mensajes en el nivel seleccionado o superior aparecen en el registro.
Seleccione alguno de los valores siguientes (listados de mayor a menor):</p>
<ul><li><p><tt>SEVERE</tt></p></li>
<li><p><tt>WARNING</tt></p></li>
<li><p><tt>INFO</tt></p></li>
<li><p><tt>CONFIG</tt></p></li>
<li><p><tt>FINE</tt></p></li>
<li><p><tt>FINER</tt></p></li>
<li><p><tt>FINEST</tt></p></li>
<li><p><tt>DESACTIVADO</tt></p></li></ul>
<p>Para obtener m&#225;s informaci&#243;n acerca del significado de los niveles de registro,
consulte <a href="ref-eelogginglevels.html">Niveles de registro del m&#243;dulo</a>. El nivel predeterminado es <tt>INFO</tt>, por tanto el registro contendr&#225;
mensajes de niveles <tt>INFO</tt>, <tt>WARNING</tt> o <tt>SEVERE</tt>.</p></li>
<li><b>Haga clic en Guardar.</b><p>Los cambios en la configuraci&#243;n del nivel de registro surten efecto de
forma inmediata. Asimismo, se guardan para su posterior uso cuando el servidor
se reinicia.</p></li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-eelogging.html">Para configurar par&#225;metros generales de registros</a></p></li>
<li><p><a href="task-logviewer.html">Para ver el registro del servidor</a></p></li></ul>

