<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-messagesecurityconfignew"></a><h4>Creaci&#243;n de la configuraci&#243;n de seguridad de mensajes</h4><p>Normalmente no ser&#225; necesario que cree una configuraci&#243;n de seguridad de mensajes.
Servidor empresarial incluye una configuraci&#243;n de seguridad de mensajes para la capa
de autenticaci&#243;n SOAP. Los proveedores para esta configuraci&#243;n no est&#225;n activados de
manera predeterminada, pero puede activarlos editando la configuraci&#243;n de seguridad de mensajes
SOAP. No obstante, puede crear una configuraci&#243;n para la capa de autenticaci&#243;n
HttpServlet y especificar una o m&#225;s configuraciones del proveedor para ella.</p><ol>
<li><b>En el &#225;rbol de navegaci&#243;n, expanda el nodo Configuraci&#243;n.</b></li>
<li><b>Expanda el nodo Seguridad.</b></li>
<li><b>Seleccione el nodo Seguridad de mensajes</b><p>Se abrir&#225; la p&#225;gina Configuraciones de seguridad de mensajes.</p></li>
<li><b>En la p&#225;gina Configuraciones de seguridad de mensajes, haga clic en Nuevo.</b><p>Se abrir&#225; la p&#225;gina Nueva configuraci&#243;n de seguridad de mensajes.</p></li>
<li><b>En la p&#225;gina Nueva configuraci&#243;n de seguridad de mensajes, en la lista
desplegable Capa de autenticaci&#243;n, seleccione la capa del mensajes para la que
est&#225; creando la configuraci&#243;n.</b><p>Debido a que de manera predeterminada hay una configuraci&#243;n SOAP disponible, la
&#250;nica opci&#243;n es <tt>HttpServlet</tt>.</p></li>
<li><b>En el campo Id. de proveedor, introduzca un identificador exclusivo de configuraci&#243;n
del proveedor para esta configuraci&#243;n de seguridad de mensajes.</b></li>
<li><b>Seleccione la casilla de verificaci&#243;n Proveedor predeterminado para especificar que esta configuraci&#243;n
de proveedor ser&#225; el proveedor predeterminado.</b></li>
<li><b>En la lista desplegable Tipo de proveedor, seleccione el tipo de proveedor.</b><p>Las opciones disponibles son:</p><dl><dt><tt>client</tt></dt>
<dd><p>Especifica que el proveedor es el proveedor de autenticaci&#243;n de clientes.</p></dd>
<dt><tt>server</tt></dt>
<dd><p>Especifica que el proveedor es el proveedor de autenticaci&#243;n del servidor.</p></dd>
<dt><tt>client-server</tt></dt>
<dd><p>Especifica que el proveedor es tanto el proveedor de autenticaci&#243;n del servidor como del cliente.</p></dd>
</dl>
</li>
<li><b>En el campo Nombre de clase, introduzca el nombre de la clase
de implementaci&#243;n de Java del proveedor.</b><p>Los proveedores de autenticaci&#243;n de clientes deben implementar la <tt>com.sun.enterprise.security.jauth.ClientAuthModule</tt> interfaz. Los
proveedores de servidor deben implementar la <tt>com.sun.enterprise.security.jauth.ServerAuthModule</tt> interfaz. Los proveedores de servidor
y cliente deben implementar ambas interfaces.</p></li>
<li>(Opcional) <b>En la secci&#243;n Propiedades adicionales, especifique las propiedades adicionales.</b><p>Para a&#241;adir una propiedad, haga clic en el bot&#243;n Agregar propiedad. En
la fila vac&#237;a escriba el nombre de la propiedad en el campo
Nombre y el valor de la propiedad en el campo Valor.</p><p>Servidor empresarial no define ninguna propiedad adicional para la configuraci&#243;n de seguridad
de mensajes.</p></li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-configmsgsecproviders.html">C&#243;mo configurar funciones de Servidor empresarial para que las utilicen los proveedores de seguridad de mensajes</a></p></li>
<li><p><a href="task-messagesecurityconfigedit.html">Edici&#243;n de la configuraci&#243;n de seguridad de mensajes.</a></p></li>
<li><p><a href="task-messagesecurityconfigdelete.html">Eliminaci&#243;n de la configuraci&#243;n de seguridad de mensajes</a></p></li>
<li><p><a href="task-messagesecurityproviderconfignew.html">Creaci&#243;n de una configuraci&#243;n del proveedor de seguridad de mensajes</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigedit.html">Edici&#243;n de una configuraci&#243;n del proveedor de seguridad de mensajes</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigdelete.html">Eliminaci&#243;n de la configuraci&#243;n del proveedor de seguridad de mensajes</a></p></li>
<li><p><a href="task-enablemesec4appclients.html">Habilitaci&#243;n de seguridad de mensajes para clientes de aplicaciones</a></p></li></ul>

