<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-eelogging"></a><h4>Para configurar par&#225;metros generales de registros</h4><a name="indexterm-19"></a><ol>
<li><b>En el &#225;rbol de navegaci&#243;n, expanda el nodo Configuraci&#243;n.</b></li>
<li><b>En el nodo Configuraci&#243;n, seleccione el nodo Configuraci&#243;n de registro.</b><p>Se abrir&#225; la p&#225;gina Configuraci&#243;n de registro.</p></li>
<li><b>Seleccione la casilla de verificaci&#243;n Escribir en el registro del sistema habilitado
para enviar la salida de registro al recurso <tt>syslog</tt> adem&#225;s de al
registro del servidor.</b><p>Esta caracter&#237;stica s&#243;lo est&#225; disponible en sistemas Solaris y Linux. Esta opci&#243;n
se encuentra deshabilitada de forma predeterminada.</p></li>
<li><b>Seleccione la casilla de verificaci&#243;n Registro en consola habilitado en DUNNO.</b><p>Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p></li>
<li><b>En el campo Archivo de registro, introduzca un nombre o ubicaci&#243;n alternativos
para el archivo de registro del servidor.</b><p>La ubicaci&#243;n predeterminada es <tt>glassfish/domains/domain1/logs/server.log </tt>.</p></li>
<li><b>En el campo Controlador de registro, introduzca el nombre de clase absoluto
de un controlador de registro personalizado.</b><p>Un controlador de registro personalizado le permite enviar registros a un destino
distinto a <tt>server.log</tt> o <tt>syslog</tt>. El controlador personalizado debe comprender la clase
<tt>java.util.logging.Handler</tt> (una API compatible con JSR 047). Indique la clase de controlador
en la ruta de clase Servidor empresarial para que el controlador se
instale durante el arranque del servidor.</p></li>
<li><b>En el campo L&#237;mite de rotaci&#243;n del archivo, introduzca el tama&#241;o en
bytes que el archivo de registro del servidor debe alcanzar antes de
rotar.</b><p>Cuando el registro del servidor alcanza el tama&#241;o especificado, crea un nuevo
archivo vac&#237;o llamado <tt>server.log</tt> y cambia el nombre del archivo antiguo <tt>server.log_</tt><i>date</i>,
donde <i>date</i> es la fecha y hora en la que se produjo
la rotaci&#243;n del archivo. El valor predeterminado es 2 megabytes. El valor
m&#237;nimo para el l&#237;mite es 500 kilobytes; si se especifica un valor
inferior, el archivo rota cuando alcanza el tama&#241;o de 500 KB. Para
deshabilitar la rotaci&#243;n del archivo de registros, defina el valor en 0.</p></li>
<li><b>En el campo L&#237;mite de tiempo para rotaci&#243;n del archivo, introduzca los
minutos que transcurren antes de que el archivo del servidor tenga que
rotar.</b><p>El valor predeterminado es 0, lo que significa que el archivo rota
cuando alcanza el tama&#241;o especificado en el campo L&#237;mite de rotaci&#243;n de
archivo.</p>
<hr><p><b>Nota - </b>Si especifica uno o m&#225;s minutos, el l&#237;mite de tiempo tiene prioridad
sobre el l&#237;mite de tama&#241;o especificado en el campo L&#237;mite de rotaci&#243;n
de archivo.</p>
<hr>
</li>
<li><b>Haga clic en Guardar.</b></li>
<li><b>Detenga y reinicie Servidor empresarial.</b></li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-eelogginglevels.html">Para configurar niveles de registro</a></p></li>
<li><p><a href="task-logviewer.html">Para ver el registro del servidor</a></p></li></ul>

