<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-messagesecurityconfigedit"></a><h4>Edici&#243;n de la configuraci&#243;n de seguridad de mensajes.</h4><p>Para habilitar la seguridad de los mensajes para puntos finales de servicios
web implementados en Servidor empresarial, debe especificar un proveedor para usar por
defecto en el servidor. Si activa un proveedor predeterminado para la seguridad
de los mensajes, tambi&#233;n tendr&#225; que habilitar proveedores para ser usados por
clientes de los servicios web implementados en Servidor empresarial. Encontrar&#225; informaci&#243;n sobre
la habilitaci&#243;n de los proveedores usados por clientes en <a href="task-enablemesec4appclients.html">Habilitaci&#243;n de seguridad de mensajes para clientes de aplicaciones</a>.</p><p>Para habilitar la seguridad de los mensajes para invocaciones de servicios web
que se originan en puntos finales implementados, debe especificar un proveedor de
cliente predeterminado. Si ha activado un proveedor de cliente predeterminado para Servidor
empresarial, debe asegurarse que los servicios invocados de los puntos finales implementados
en Servidor empresarial est&#225;n configurados de forma compatible para la seguridad de
la capa de mensajes.</p><ol>
<li><b>En el &#225;rbol de navegaci&#243;n, expanda el nodo Configuraci&#243;n.</b></li>
<li><b>Expanda el nodo Seguridad.</b></li>
<li><b>Seleccione el nodo Seguridad de mensajes</b><p>Se abrir&#225; la p&#225;gina Configuraciones de seguridad de mensajes.</p></li>
<li><b>En la p&#225;gina Configuraciones de seguridad de mensajes, haga clic en el
nombre de la Capa de seguridad de la configuraci&#243;n que est&#225; editando.</b><p>De manera predeterminada, la &#250;nica configuraci&#243;n de seguridad de mensajes configurada es
SOAP.</p><p>Se abrir&#225; la p&#225;gina Editar configuraci&#243;n de seguridad de mensajes.</p></li>
<li><b>En la p&#225;gina Editar configuraci&#243;n de seguridad de mensajes, en la lista
desplegable Proveedores predeterminados, seleccione un proveedor de servidor.</b><p>El proveedor de servidor predeterminado, tambi&#233;n llamado proveedor predeterminado, identifica el proveedor
de servidor invocado para una aplicaci&#243;n que no identifica un proveedor de
servidor espec&#237;fico. Las opciones disponibles son <tt>ServerProvider</tt>, <tt>XWS_ServerProvider</tt> o ninguno. De manera
predeterminada no hay ning&#250;n proveedor predeterminado, por tanto Servidor empresarial no invocar&#225;
un proveedor de seguridad de mensajes para el servidor. Generalmente, debe seleccionar
<tt>ServerProvider</tt> como proveedor predeterminado.</p></li>
<li><b>En la lista desplegable Proveedor de cliente predeterminado, seleccione un proveedor de
cliente.</b><p>El proveedor de cliente predeterminado identifica el proveedor de cliente invocado para
una aplicaci&#243;n que no identifica un proveedor de cliente espec&#237;fico. Las opciones
disponibles son <tt>ClientProvider</tt>, <tt>XWS_ClientProvider</tt> o ninguno. De manera predeterminada no hay ning&#250;n
proveedor seleccionado, por tanto Servidor empresarial no invocar&#225; un proveedor de seguridad
de mensajes para clientes. Generalmente, no debe seleccionar ninguno como proveedor de
clientes. Seleccione <tt>ClientProvider</tt> para habilitar un proveedor predeterminado y una directiva de
protecci&#243;n de mensajes para aplicar a las llamadas a servicios web que
se originan en los puntos finales de servicios web implementados en Servidor
empresarial.</p></li>
<li><b>Haga clic en Guardar.</b></li>
<li><b>Para obtener instrucciones sobre c&#243;mo modificar las directivas de protecci&#243;n de mensajes
de cliente habilitado o proveedores de servidores, consulte <a href="task-messagesecurityproviderconfigedit.html">Edici&#243;n de una configuraci&#243;n del proveedor de seguridad de mensajes</a>.</b></li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-configmsgsecproviders.html">C&#243;mo configurar funciones de Servidor empresarial para que las utilicen los proveedores de seguridad de mensajes</a></p></li>
<li><p><a href="task-messagesecurityconfignew.html">Creaci&#243;n de la configuraci&#243;n de seguridad de mensajes</a></p></li>
<li><p><a href="task-messagesecurityconfigdelete.html">Eliminaci&#243;n de la configuraci&#243;n de seguridad de mensajes</a></p></li>
<li><p><a href="task-messagesecurityproviderconfignew.html">Creaci&#243;n de una configuraci&#243;n del proveedor de seguridad de mensajes</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigedit.html">Edici&#243;n de una configuraci&#243;n del proveedor de seguridad de mensajes</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigdelete.html">Eliminaci&#243;n de la configuraci&#243;n del proveedor de seguridad de mensajes</a></p></li>
<li><p><a href="task-enablemesec4appclients.html">Habilitaci&#243;n de seguridad de mensajes para clientes de aplicaciones</a></p></li></ul>

