<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jaccprovideredit"></a><h4>Edici&#243;n de un proveedor JACC</h4><ol>
<li><b>En el &#225;rbol de navegaci&#243;n, expanda el nodo Configuraci&#243;n.</b></li>
<li><b>En el nodo Configuraci&#243;n, expanda el nodo Seguridad.</b></li>
<li><b>En el nodo Seguridad, seleccione el nodo Proveedores JACC.</b><p>Se abrir&#225; la p&#225;gina Proveedores JACC.</p></li>
<li><b>En la p&#225;gina Proveedores JACC, haga clic en el nombre del proveedor
JACC que est&#225; editando.</b><p>Se abrir&#225; la p&#225;gina Editar proveedor JACC.</p></li>
<li><b>En la p&#225;gina Editar proveedor JACC, en el campo Configuraci&#243;n de de
directivas, introduzca el nombre de la clase que implementa el generador de
configuraci&#243;n de directivas.</b></li>
<li><b>En el campo Proveedor de directivas, introduzca el nombre de la clase
que implementa el generador de directivas.</b></li>
<li>(Opcional) <b>En la secci&#243;n Propiedades adicionales, especifique las propiedades adicionales.</b><p>Para obtener una descripci&#243;n de propiedades adicionales disponibles para proveedores JACC, consulte
<a href="ref-jaccproviderprop.html">Propiedades espec&#237;ficas de los proveedores JACC</a>.</p><ul>
<li><b>Para a&#241;adir una propiedad, haga clic en el bot&#243;n Agregar propiedad. En
la fila vac&#237;a escriba el nombre de la propiedad en el campo
Nombre y el valor de la propiedad en el campo Valor.</b></li>
<li><b>Para modificar una propiedad, edite el campo Valor de la propiedad.</b></li>
<li><b>Para eliminar una propiedad, marque la casilla de verificaci&#243;n situada a la
izquierda del campo Nombre de la propiedad que quiera eliminar y, a
continuaci&#243;n, haga clic en el bot&#243;n Eliminar propiedades.</b></li></ul></li>
<li><b>Haga clic en Guardar.</b>
<hr><p><b>Consejo - </b>Para volver a los valores de configuraci&#243;n predeterminados, haga clic en el
bot&#243;n Cargar predeterminados y, a continuaci&#243;n, en Guardar.</p>
<hr>
</li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-jaccprovidernew.html">Creaci&#243;n de un proveedor JACC</a></p></li>
<li><p><a href="task-jaccproviderdelete.html">Eliminaci&#243;n de un proveedor JACC</a></p></li>
<li><p><a href="task-setactivejaccprov.html">Establecimiento del proveedor JACC activo</a></p></li></ul>

