<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jvmsettings"></a><h4>C&#243;mo establecer la configuraci&#243;n general de JVM</h4><p>La m&#225;quina virtual de Java<sup>TM</sup> (JVM) permite ejecutar c&#243;digo de bytes de
Java en un equipo f&#237;sico. Al ajustar los valores de configuraci&#243;n de
JVM, mejora el rendimiento y se evitan errores de asignaci&#243;n de memoria.</p><p>La m&#225;quina virtual de Java se incluye en la plataforma Java, Standard
Edition (plataforma Java SE), que necesita Servidor empresarial. La introducci&#243;n de valores
incorrectos para la configuraci&#243;n de JVM har&#225; que no funcione el servidor,
por lo que tiene que ir con cuidado a la hora de
cambiar estos valores.</p>
<hr><p><b>Nota - </b>Los t&#233;rminos &#8220;m&#225;quina virtual de Java&#8221; y &#8220;JVM&#8221; hacen referencia a una
m&#225;quina virtual para la plataforma Java.</p>
<hr>
<ol>
<li><b>En el &#225;rbol de navegaci&#243;n, seleccione el nodo Configuraci&#243;n.</b></li>
<li><b>En el nodo Configuraci&#243;n, seleccione el nodo Configuraci&#243;n de JVM.</b><p>Se abrir&#225; la p&#225;gina Configuraci&#243;n general de JVM.</p></li>
<li><b>En la p&#225;gina Configuraci&#243;n general de JVM, en el campo Inicio de
Java, escriba el nombre del directorio de instalaci&#243;n del software Java SE.</b><p>Servidor empresarial est&#225; basado en la plataforma Java SE. Para comprobar que
la versi&#243;n del software de JAVA SE que ha especificado es compatible
con esta versi&#243;n, consulte las <a href="http://docs.sun.com/doc/820-7688"><i>Sun GlassFish Enterprise Server v3 Preview Release Notes </i></a>. Si introduce un nombre de directorio
no existente o un directorio para una versi&#243;n no compatible del software
de Java SE, entonces Servidor empresarial no se podr&#225; iniciar.</p></li>
<li><b>En el campo Opciones de Javac, introduzca las opciones de l&#237;nea de
comandos del compilador del lenguaje de programaci&#243;n Java.</b><p>Servidor empresarial ejecuta el compilador cuando se implementan los componentes de Enterprise JavaBeans<sup>TM</sup>
(EJB<sup>TM</sup>).</p></li>
<li><b>Seleccione la casilla de verificaci&#243;n Depuraci&#243;n habilitada para habilitar la depuraci&#243;n con
Java Platform Debugger Architecture (JPDA).</b><p>JPDA lo utilizan los desarrolladores de aplicaciones. Para obtener m&#225;s informaci&#243;n, consulte
la <a href="http://docs.sun.com/doc/820-7695"><i>Sun GlassFish Enterprise Server v3 Preview Application Development Guide </i></a>.</p></li>
<li><b>En el campo Opciones de depuraci&#243;n, introduzca las opciones de JPDA que
van a pasar a la JVM.</b><p>Este campo s&#243;lo ser&#225; aplicable si se ha habilitado la depuraci&#243;n en
el paso anterior.</p></li>
<li><b>En el campo Opciones de compilaci&#243;n RMI, introduzca las opciones de l&#237;nea
de comandos del compilador <tt>rmic</tt>.</b><p>Servidor empresarial ejecuta el compilador <tt>rmic</tt> cuando se implementan componentes EJB.</p></li>
<li><b>En el campo Preprocesador de c&#243;digo byte, introduzca una lista de nombres
de clase.</b><p>Utilice comas para separar los nombres de clase. Cada clase debe implementar
la interfaz com.sun.appserv.BytecodePreprocessor . Las clases se llaman en el orden especificado.</p></li>
<li>(Opcional) <b>En la secci&#243;n Propiedades adicionales, especifique las propiedades adicionales.</b><p>Para a&#241;adir una propiedad, haga clic en el bot&#243;n Agregar propiedad. En
la fila vac&#237;a escriba el nombre de la propiedad en el campo
Nombre y el valor de la propiedad en el campo Valor.</p><p>Servidor empresarial no define ninguna propiedad adicional para JVM.</p></li>
<li><b>Haga clic en Guardar.</b></li>
<li><b>Reinicie el servidor.</b></li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-jvmpathsettings.html">Para establecer los valores de la ruta de JVM</a></p></li>
<li><p><a href="task-jvmoptions.html">Para configurar las opciones de JVM</a></p></li>
<li><p><a href="task-securitymanagerdisable.html">Para deshabilitar el administrador de seguridad</a></p></li>
<li><p><a href="task-jvmprofilersettings.html">C&#243;mo configurar los valores del analizador JVM </a></p></li></ul>

