<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-usedefaultauditmod"></a><h4>C&#243;mo utilizar el m&#243;dulo de auditor&#237;a predeterminado</h4><p>El m&#243;dulo de auditor&#237;a <tt>default</tt> registra solicitudes de autenticaci&#243;n y de autorizaci&#243;n
en el archivo de registro del servidor. Para obtener informaci&#243;n sobre c&#243;mo
cambiar la ubicaci&#243;n del archivo de registro consulte <a href="task-eelogging.html">Para configurar par&#225;metros generales de registros</a>.</p><p>Las entradas de registro de autenticaci&#243;n incluyen la informaci&#243;n siguiente:</p>
<ul><li><p>Nombres de usuarios que han intentado autenticarse</p></li>
<li><p>El dominio que ha procesado la solicitud de acceso</p></li>
<li><p>La direcci&#243;n del m&#243;dulo web o componente EJB solicitado</p></li>
<li><p>&#201;xito o fallo de la solicitud</p></li></ul>
<p>Independientemente de si se activa el registro de auditor&#237;a, Servidor empresarial registra
todos los sucesos de autenticaci&#243;n denegados.</p><p>Las entradas de registro de autorizaci&#243;n incluyen la informaci&#243;n siguiente:</p>
<ul><li><p>Los nombres de los usuarios autenticados, si hay alguno</p></li>
<li><p>La direcci&#243;n web o componente EJB solicitado</p></li>
<li><p>&#201;xito o fallo de las solicitudes</p></li></ul>
<ol>
<li><b>En el &#225;rbol de navegaci&#243;n, expanda el nodo Configuraci&#243;n.</b></li>
<li><b>En el nodo Configuraci&#243;n, seleccione el nodo Seguridad.</b><p>Se abrir&#225; la p&#225;gina Seguridad.</p></li>
<li><b>En la lista desplegable M&#243;dulos de auditor&#237;a, seleccione el m&#243;dulo de auditor&#237;a
llamado <tt>default</tt>.</b></li>
<li><b>Haga clic en Guardar.</b></li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-auditmodulenew.html">C&#243;mo crear un m&#243;dulo de auditor&#237;a</a></p></li>
<li><p><a href="task-auditmoduleedit.html">C&#243;mo editar un m&#243;dulo de auditor&#237;a</a></p></li>
<li><p><a href="task-auditmoduledelete.html">C&#243;mo eliminar un m&#243;dulo de auditor&#237;a</a></p></li>
<li><p><a href="task-enabledisableauditmod.html">C&#243;mo habilitar o deshabilitar el registro de auditor&#237;a</a></p></li>
<li><p><a href="task-setactiveauditmod.html">C&#243;mo establecer el m&#243;dulo de auditor&#237;a activo</a></p></li></ul>

