<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-uc-set-proxy"></a><h4>C&#243;mo configurar los valores del servidor proxy de red para acceder a los dep&#243;sitos de red</h4><p>Los valores de configuraci&#243;n del proxy de red determinan la manera en
que Servidor empresarial se conecta a Internet. Para habilitar a Herramienta de
actualizaci&#243;n para que acceda a los <a href="ref-uc-concepts.html#ref-uc-about-repository">dep&#243;sitos de red</a> a trav&#233;s de Internet, configure
los valores de configuraci&#243;n del proxy de red.</p><ol>
<li><b>En el &#225;rbol de navegaci&#243;n, seleccione el nodo Herramienta de actualizaci&#243;n.</b><p>Se abrir&#225; la p&#225;gina Complementos disponibles.</p></li>
<li><b>En la p&#225;gina Complementos disponibles, haga clic en la ficha Configuraci&#243;n.</b><p>Se muestra la p&#225;gina Configuraci&#243;n de Herramienta de actualizaci&#243;n.</p></li>
<li><b>En la p&#225;gina Configuraci&#243;n de Herramienta de actualizaci&#243;n, especifique c&#243;mo se conecta
a Internet el equipo en el que se est&#225; ejecuntado Servidor empresarial.</b><ul>
<li><b>Si el equipo se conecta a Internet directamente, seleccione la opci&#243;n Conexi&#243;n
directa.</b></li>
<li><b>Si el equipo se conecta a Internet a trav&#233;s de un proxy,
seleccione la opci&#243;n Mediante un servidor proxy.</b></li></ul></li>
<li><b>Si el equipo en el que se est&#225; ejecutando Servidor empresarial se
conecta a Internet a trav&#233;s de un proxy, obtenga el nombre de
host y el n&#250;mero de puerto del proxy.</b><p>Si el equipo en el que se est&#225; ejecutando Servidor empresarial se
conecta directamente a Internet, omita este paso.</p><p>Un navegador web debe estar ejecut&#225;ndose en el equipo en el que
se est&#225; ejecutando Servidor empresarial. En esta situaci&#243;n, puede obtener el nombre
de host y el n&#250;mero de puerto del proxy del navegador web.
De lo contrario, p&#243;ngase en contacto con el administrador del sistema para
obtener m&#225;s informaci&#243;n.</p></li>
<li><b>Haga clic en Guardar.</b></li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-uc-update.html">Instalaci&#243;n de actualizaciones para componentes.</a></p></li>
<li><p><a href="task-uc-addon.html">C&#243;mo instalar componentes de complementos</a></p></li>
<li><p><a href="task-uc-installed-remove.html">C&#243;mo desinstalar componentes</a></p></li>
<li><p><a href="task-uc-pkgdetails.html">C&#243;mo ver informaci&#243;n detallada de un componente</a></p></li></ul>

