<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-realmnew"></a><h4>C&#243;mo crear un dominio</h4><p>Servidor empresarial viene preconfigurado con tres dominios: <tt>file</tt>, <tt> certificate</tt> y <tt>admin-realm</tt>. Tambi&#233;n
es posible crear dominios <tt>ldap</tt>, <tt>JDBC</tt>, <tt>solaris</tt> y personalizados. Normalmente se tiene
un dominio de cada tipo en un servidor, pero en Servidor empresarial
existen dos dominios de archivo: <tt>file</tt> y <tt> admin-realm</tt>. Se trata de dos
dominios del mismo tipo utilizados para dos fines diferentes. Tambi&#233;n es posible
tener una base de datos de certificados diferente para cada servidor virtual
de su sistema.</p><ol>
<li><b>En el &#225;rbol de navegaci&#243;n, expanda el nodo Configuraci&#243;n.</b></li>
<li><b>Expanda el nodo Seguridad.</b></li>
<li><b>Seleccione el nodo Dominios.</b><p>Se abrir&#225; la p&#225;gina Dominios.</p></li>
<li><b>En la p&#225;gina Dominios haga clic en Nuevo.</b><p>Se abrir&#225; la p&#225;gina Nuevo dominio.</p></li>
<li><b>En el campo Nombre, introduzca un nombre para el dominio.</b></li>
<li><b>Para especificar el nombre de clase del dominio, realice una de las
siguientes acciones:</b><ul>
<li><b>En la lista desplegable Nombre de clase, seleccione el nombre de clase
para el dominio creado.</b><p>En la tabla siguiente se muestran las opciones v&#225;lidas.</p><table><col width="16%"><col width="83%"><tr><th align="left" valign="top" scope="column"><p>Nombre de dominio</p></th>
<th align="left" valign="top" scope="column"><p>Nombre de
clase</p></th>
</tr>
<tr><td align="left" valign="top" scope="row"><p><tt>file</tt></p></td>
<td align="left" valign="top" scope="row"><p><tt>com.sun.enterprise.security.auth.realm.file.FileRealm</tt></p></td>
</tr>
<tr><td align="left" valign="top" scope="row"><p><tt>certificate</tt></p></td>
<td align="left" valign="top" scope="row"><p><tt>com.sun.enterprise.security.auth.realm.certificate.CertificateRealm </tt></p></td>
</tr>
<tr><td align="left" valign="top" scope="row"><p><tt>ldap</tt></p></td>
<td align="left" valign="top" scope="row"><p><tt>com.sun.enterprise.security.auth.realm.ldap.LDAPRealm</tt></p></td>
</tr>
<tr><td align="left" valign="top" scope="row"><p><tt>JDBC</tt></p></td>
<td align="left" valign="top" scope="row"><p><tt>com.sun.enterprise.security.auth.realm.jdbc.JDBCRealm</tt></p></td>
</tr>
<tr><td align="left" valign="top" scope="row"><p><tt>solaris</tt></p></td>
<td align="left" valign="top" scope="row"><p><tt>com.sun.enterprise.security.auth.realm.solaris.SolarisRealm</tt></p></td>
</tr>
</table></li>
<li><b>Seleccione el bot&#243;n de opci&#243;n inferior y escriba el nombre de clase
del dominio personalizado creado.</b></li></ul></li>
<li>(Opcional) <b>En la secci&#243;n Propiedades adicionales, especifique las propiedades adicionales.</b><p>Para a&#241;adir una propiedad, haga clic en el bot&#243;n Agregar propiedad. En
la fila vac&#237;a escriba el nombre de la propiedad en el campo
Nombre y el valor de la propiedad en el campo Valor.</p><p>Las propiedades v&#225;lidas dependen del tipo de dominio.</p>
<ul><li><p>Para obtener una descripci&#243;n de las propiedades del dominio de archivo, consulte <a href="ref-editfile-adminrealm.html">Propiedades espec&#237;ficas de la clase <tt> FileRealm</tt></a>.</p></li>
<li><p>Para obtener una descripci&#243;n de las propiedades del dominio de certificado, consulte <a href="ref-editcertrealm.html">Propiedades espec&#237;ficas de la clase <tt>CertificateRealm </tt></a>.</p></li>
<li><p>Para obtener una descripci&#243;n de las propiedades del dominio JDBC, consulte <a href="ref-editjdbcrealm.html">Propiedades espec&#237;ficas de la clase <tt>JDBCRealm </tt></a>.</p></li>
<li><p>Para obtener una descripci&#243;n de las propiedades del dominio LDAP, consulte <a href="ref-ldaprealmprop.html">Propiedades espec&#237;ficas de la clase <tt>LDAPRealm </tt></a>.</p></li>
<li><p>Para obtener una descripci&#243;n de las propiedades del dominio Solaris, consulte <a href="ref-solarisrealmprop.html">Propiedades espec&#237;ficas de la clase <tt>SolarisRealm </tt></a>.</p></li></ul>
</li>
<li><b>Haga clic en Aceptar.</b></li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-realmedit.html">C&#243;mo editar un dominio</a></p></li>
<li><p><a href="task-todeleterealm.html">C&#243;mo eliminar un dominio</a></p></li>
<li><p><a href="task-tosetdefault.html">Como establecer el dominio predeterminado</a></p></li>
<li><p><a href="task-createcustomrealm.html">C&#243;mo crear un dominio personalizado</a></p></li></ul>

