<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-appdeployclient"></a><h4>Implementar un cliente de aplicaciones</h4><ol>
<li><b>En el &#225;rbol de navegaci&#243;n, seleccione el nodo Aplicaciones.</b><p>Se abrir&#225; la p&#225;gina Aplicaciones </p></li>
<li><b>En la tabla Aplicaciones implementadas, haga clic en el bot&#243;n Implementar.</b><p>Se abrir&#225; la p&#225;gina Implementar aplicaciones o M&#243;dulos.</p></li>
<li><b>Especifique la ubicaci&#243;n del archivo de almacenamiento donde se encuentra la aplicaci&#243;n
que se va a implementar.</b><ul>
<li><b>Si el archivo de almacenamiento es un archivo que reside en la
m&#225;quina cliente o al que se puede acceder desde la m&#225;quina cliente,
seleccione la opci&#243;n Archivo empaquetado que se cargar&#225; en el servidor.</b><p>La m&#225;quina cliente es el host en el que est&#225; viendo la
Consola de administraci&#243;n por medio de un navegador.</p><p>Haga clic en Examinar para buscar el archivo o bien escriba la
ruta completa hasta el archivo.</p></li>
<li><b>Si el archivo de almacenamiento es un archivo que reside en el
equipo servidor o es una aplicaci&#243;n descomprimida desde un directorio desplegado, seleccione
la opci&#243;n Archivo empaquetado local o Directorio accesible desde Servidor empresarial.</b><p>El equipo servidor es el host que se est&#225; ejecutando en el
servidor de administraci&#243;n del dominio (DAS). </p><p>Haz clic en Examinar archivos para buscar un archivo, o en Examinar
carpetas para buscar un directorio. Como opci&#243;n alternativa, escriba el nombre de
la ruta completa del archivo o directorio. Implementar desde un directorio desplegado
es para desarrolladores avanzados y no es recomendable para entornos de producci&#243;n.</p></li></ul></li>
<li><b>En la lista desplegable Tipo, seleccione Cliente de aplicaciones.</b><p>Si ha especificado un Archivo empaquetado para ser cargado en el servidor
o un Archivo empaquetado local accesible desde Servidor empresarial,el tipo de aplicaci&#243;n
se detectar&#225; autom&#225;ticamente. Si ha especificado un Directorio accesible desde Servidor empresarial,
debe especificar el tipo de manera manual.</p></li>
<li><b>En el campo Nombre de la aplicaci&#243;n, puede mantener el nombre predeterminado,
que es el nombre del directorio o el prefijo del nombre del
archivo, o bien escribir un nombre distinto. </b><p>El nombre predeterminado aparece si decide cargar un archivo. El nombre de
la aplicaci&#243;n debe ser &#250;nico.</p></li>
<li><b>Marque la casilla de verificaci&#243;n Ejecutar verificador para ejecutar el verificador antes
de la implementaci&#243;n.</b><p>Si esta opci&#243;n est&#225; seleccionada y se produce un error en la
verificaci&#243;n, la implementaci&#243;n no se llevar&#225; a cabo. El verificador examinar&#225; la
estructura y contenido del archivo. La verificaci&#243;n de aplicaciones de gran tama&#241;o
tiende a llevar mucho tiempo. Esta opci&#243;n se encuentra deshabilitada de forma
predeterminada.</p></li>
<li><b>Seleccione la casilla de verificaci&#243;n Java Web Start para habilitar el acceso
a Java Web Start para un m&#243;dulo de cliente de aplicaciones.</b><p>Esta opci&#243;n se encuentra deshabilitada de forma predeterminada.</p></li>
<li><b>Seleccione la casilla de verificaci&#243;n Forzar reimplementaci&#243;n para forzar la reimplementaci&#243;n si
ya se ha implementado la aplicaci&#243;n.</b><p>Si esta opci&#243;n no est&#225; seleccionada y se intenta implementar una aplicaci&#243;n
que ya se haya implementado, se producir&#225; un error. Esta opci&#243;n se
encuentra deshabilitada de forma predeterminada.</p></li>
<li><b>En el campo Descripci&#243;n, introduzca una descripci&#243;n de esta aplicaci&#243;n </b></li>
<li><b>Haga clic en Aceptar.</b></li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-applistdeployed.html">Ver una lista de aplicaciones implementadas</a></p></li>
<li><p><a href="task-appdeployweb.html">C&#243;mo implementar una aplicaci&#243;n web</a></p></li>
<li><p><a href="task-deployentapp.html">Implementaci&#243;n de una aplicaci&#243;n empresarial</a></p></li>
<li><p><a href="task-appdeployconn.html">Implementaci&#243;n de un m&#243;dulo del conector</a></p></li>
<li><p><a href="task-appdeployejb.html">Implementaci&#243;n de un JAR EJB</a></p></li>
<li><p><a href="task-appdeployruby.html">Implementaci&#243;n de una aplicaci&#243;n de Ruby</a></p></li>
<li><p><a href="task-appedit.html">Para editar una aplicaci&#243;n implementada</a></p></li>
<li><p><a href="task-appviewdesc.html">C&#243;mo ver los descriptores de una aplicaci&#243;n</a></p></li>
<li><p><a href="task-applaunch.html">C&#243;mo iniciar una aplicaci&#243;n</a></p></li>
<li><p><a href="task-appredeploy.html">C&#243;mo volver a implementar una aplicaci&#243;n implementada</a></p></li>
<li><p><a href="task-apprestart.html">C&#243;mo reiniciar una aplicaci&#243;n implementada</a></p></li></ul>

