<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-uc-addon"></a><h4>C&#243;mo instalar componentes de complementos</h4><p>La instalaci&#243;n de un <a href="ref-uc-concepts.html#ref-uc-about-addon">componente de complementos</a> incluye las operaciones siguientes:</p>
<ul><li><p>Transferir el contenido del componente y de los dep&#243;sitos del componente desde un <a href="ref-uc-concepts.html#ref-uc-about-repository">dep&#243;sito de red</a></p></li>
<li><p>Instalar el componente dentro de la <a href="ref-uc-concepts.html#ref-uc-about-repository">imagen de instalaci&#243;n</a> de Servidor empresarial en su sistema</p></li></ul>
<p>Si el componente requiere otros componentes que no est&#233;n instalados, estos componentes
tambi&#233;n se instalar&#225;n.</p><ol>
<li><b>En el &#225;rbol de navegaci&#243;n, seleccione el nodo Herramienta de actualizaci&#243;n.</b><p>Se abrir&#225; la p&#225;gina Complementos disponibles.</p></li>
<li><b>En la p&#225;gina Complementos disponibles, en la tabla que muestra los componentes
disponibles, seleccione los que desee instalar.</b><p>Si no hay componentes de complementos disponibles, la tabla aparecer&#225; vac&#237;a.</p><ul>
<li><b>Para seleccionar un componente individual, marque la casilla de verificaci&#243;n situada al
lado del nombre del componente.</b></li>
<li><b>Para seleccionar todos los componentes, haga clic en el icono Seleccionar todo
situado en el encabezado de la tabla.</b></li>
<li><b>Para anular la selecci&#243;n de todos los componentes, haga clic en el
icono Anular toda la selecci&#243;n situado en el encabezado de la tabla.</b></li></ul></li>
<li><b>Haga clic en "Instalar".</b><p>Aparecer&#225; un cuadro de di&#225;logo para que confirme que los componentes seleccionados
y los componentes requeridos por estos deben instalarse.</p></li>
<li><b>En el cuadro de di&#225;logo, haga clic en Aceptar.</b><p>Tambi&#233;n tendr&#225; que confirmar que acepta los contratos de licencia de los
componentes que va a instalar.</p></li>
<li><b>Acepte los acuerdos de licencia de los componentes que se van a
instalar.</b><p>Servidor empresarial confirma que la instalaci&#243;n ha finalizado. Los componentes desaparecer&#225;n de
la tabla de componentes de complementos y se agregar&#225;n a la tabla
de componentes instalados de la p&#225;gina Componentes instalados. </p></li>
<li><b>Reinicie el servidor.</b><p>Para obtener instrucciones detalladas, consulte la documentaci&#243;n siguiente:</p>
<ul><li><p><a href="http://docs.sun.com/doc/820-7692/ggoch?a=view">To Stop a Domain de <i>Sun GlassFish Enterprise Server v3 Administration Guide</i></a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7692/ggoda?a=view">To Start a Domain de <i>Sun GlassFish Enterprise Server v3 Administration Guide</i></a></p></li></ul>
</li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-uc-set-proxy.html">C&#243;mo configurar los valores del servidor proxy de red para acceder a los dep&#243;sitos de red</a></p></li>
<li><p><a href="task-uc-update.html">Instalaci&#243;n de actualizaciones para componentes.</a></p></li>
<li><p><a href="task-uc-installed-remove.html">C&#243;mo desinstalar componentes</a></p></li>
<li><p><a href="task-uc-pkgdetails.html">C&#243;mo ver informaci&#243;n detallada de un componente</a></p></li></ul>

