<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-realmedit"></a><h4>C&#243;mo editar un dominio</h4><ol>
<li><b>En el &#225;rbol de navegaci&#243;n, expanda el nodo Configuraci&#243;n.</b></li>
<li><b>Expanda el nodo Seguridad.</b></li>
<li><b>Expanda el nodo Dominios.</b></li>
<li><b>Seleccione el nombre de un dominio existente.</b><p>Se abrir&#225; la p&#225;gina Editar dominio.</p></li>
<li><b>Para modificar el nombre de clase del dominio, realice una de las
siguientes acciones:</b><ul>
<li><b>En la lista desplegable Nombre de clase, seleccione el nombre de clase
para el dominio creado.</b></li>
<li><b>Seleccione el segundo bot&#243;n de opci&#243;n y escriba el nombre de clase
del dominio personalizado creado.</b></li></ul></li>
<li>(Opcional) <b>En la secci&#243;n Propiedades adicionales, especifique las propiedades adicionales.</b><p>Las propiedades v&#225;lidas dependen del tipo de dominio.</p>
<ul><li><p>Para obtener una descripci&#243;n de las propiedades del dominio de archivo, consulte <a href="ref-editfile-adminrealm.html">Propiedades espec&#237;ficas de la clase <tt> FileRealm</tt></a>.</p></li>
<li><p>Para obtener una descripci&#243;n de las propiedades del dominio de certificado, consulte <a href="ref-editcertrealm.html">Propiedades espec&#237;ficas de la clase <tt>CertificateRealm </tt></a>.</p></li>
<li><p>Para obtener una descripci&#243;n de las propiedades del dominio JDBC, consulte <a href="ref-editjdbcrealm.html">Propiedades espec&#237;ficas de la clase <tt>JDBCRealm </tt></a>.</p></li>
<li><p>Para obtener una descripci&#243;n de las propiedades del dominio LDAP, consulte <a href="ref-ldaprealmprop.html">Propiedades espec&#237;ficas de la clase <tt>LDAPRealm </tt></a>.</p></li>
<li><p>Para obtener una descripci&#243;n de las propiedades del dominio Solaris, consulte <a href="ref-solarisrealmprop.html">Propiedades espec&#237;ficas de la clase <tt>SolarisRealm </tt></a>.</p></li></ul>
<ul>
<li><b>Para a&#241;adir una propiedad, haga clic en el bot&#243;n Agregar propiedad. En
la fila vac&#237;a escriba el nombre de la propiedad en el campo
Nombre y el valor de la propiedad en el campo Valor.</b></li>
<li><b>Para modificar una propiedad, edite el campo Valor de la propiedad.</b></li>
<li><b>Para eliminar una propiedad, marque la casilla de verificaci&#243;n situada a la
izquierda del campo Nombre de la propiedad que quiera eliminar y, a
continuaci&#243;n, haga clic en el bot&#243;n Eliminar propiedades.</b></li></ul></li>
<li><b>Haga clic en Guardar.</b></li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-realmnew.html">C&#243;mo crear un dominio</a></p></li>
<li><p><a href="task-todeleterealm.html">C&#243;mo eliminar un dominio</a></p></li>
<li><p><a href="task-tosetdefault.html">Como establecer el dominio predeterminado</a></p></li>
<li><p><a href="task-createcustomrealm.html">C&#243;mo crear un dominio personalizado</a></p></li></ul>

