<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-accessadmintools"></a><h4>C&#243;mo otorgar acceso a las herramientas de administraci&#243;n.</h4><p>S&#243;lo los usuarios del grupo <tt>asadmin</tt> pueden acceder a Consola de administraci&#243;n
y a la utilidad de l&#237;nea de comandos <tt>asadmin</tt>. Para otorgar acceso
a los usuarios de estas herramientas de administraci&#243;n, agregue los usuarios al
grupo <tt>asadmin </tt> de <tt>admin-realm</tt>.</p><ol>
<li><b>En el &#225;rbol de navegaci&#243;n, expanda el nodo Configuraci&#243;n.</b></li>
<li><b>Expanda el nodo Seguridad.</b></li>
<li><b>Expanda el nodo Dominios.</b></li>
<li><b>Seleccione el nodo <tt>admin-realm</tt>.</b><p>Aparecer&#225; la p&#225;gina Editar dominio.</p></li>
<li><b>En la p&#225;gina Editar dominio, haga clic en el bot&#243;n Administrar usuarios.</b><p>Se abrir&#225; la p&#225;gina Usuarios de file.</p><p>Inicialmente tras la instalaci&#243;n el nombre y usuario del administrador introducidos durante
la instalaci&#243;n aparecen en un archivo llamado <tt>admin-keyfile</tt>. Por defecto este usuario
pertenece al grupo <tt>asadmin</tt>, que da derecho a modificar Servidor empresarial. Asigne
usuarios a este grupo s&#243;lo si les quiere otorgar privilegios de administrador
para Servidor empresarial.</p><p>Si agrega usuarios al dominio <tt>admin-realm</tt>, pero los asigna a un grupo
diferente de <tt>asadmin</tt>, la informaci&#243;n de los usuarios permanecer&#225; escrita en el
archivo <tt>admin-keyfile</tt>, pero el usuario no tendr&#225; acceso a las herramientas administrativas
ni a las aplicaciones del dominio <tt>file</tt>.</p></li>
<li><b>En la p&#225;gina Usuarios de archivo, haga clic en Nuevo para a&#241;adir
un nuevo usuario al dominio <tt>admin-realm </tt>.</b><p>Se abrir&#225; la p&#225;gina Nuevo usuario de dominio file.</p></li>
<li><b>En el campo Id. de usuario, introduzca el nombre del nuevo usuario.</b></li>
<li><b>En el campo Lista de grupos, introduzca los nombres de los grupos
a los que pertenecer&#225; el usuario.</b><p>Para autorizar a un usuario la realizaci&#243;n de cambios a Servidor empresarial,
incluya el grupo <tt>asadmin</tt> en la Lista de grupos.</p></li>
<li><b>En los campos Nueva contrase&#241;a y Confirmar nueva contrase&#241;a, escriba la contrase&#241;a
del nuevo usuario.</b></li>
<li><b>Haga clic en Aceptar para agregar este usuario al dominio <tt>admin-realm</tt> o
haga clic en Cancelar para salir sin guardar.</b></li></ol><h6>V&#233;ase tambi&#233;n</h6>
<ul><li><p><a href="task-securitysettings.html">C&#243;mo configurar las opciones de seguridad</a></p></li>
<li><p><a href="task-changeadminpasswd.html">Cambio de la contrase&#241;a de un usuario en el dominio de administrador</a></p></li></ul>

