<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-ejbgeneral" name="task-ejbgeneral"></a></p>

<h4><a id="sthref2" name="sthref2"></a><a id="sthref3" name="sthref3"></a>Per configurare le impostazioni EJB</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Selezionare il nodo Configurazione nell'albero di navigazione.</p>
</li>
<li>
<p>Selezionare il nodo Contenitore EJB.</p>
<p>Viene visualizzata la pagina Enterprise Java Bean (EJB).</p>
</li>
<li>
<p>Nel campo Posizione di memorizzazione sessione digitare un nuovo valore per la posizione di memorizzazione della sessione.</p>
<p>Questo campo specifica la directory del file system utilizzata per memorizzare i bean di sessione con conservazione dello stato resi passivi e gli stati dei checkpoint SFSB persistenti. Il valore predefinito &egrave; <code>${com.sun.aas.instanceRoot}/session-store</code>.</p>
<p>I bean resi passivi sono bean di sessione con conservazione dello stato il cui stato &egrave; scritto in un file del file system. In genere i bean resi passivi sono stati inattivi per un determinato periodo di tempo e al momento nessun client tenta di accedervi. Analogamente, gli stati dei checkpoint SFSB persistenti sono singoli bean SFSB il cui stato &egrave; stato scritto in un file del file system.</p>
<p>Questa impostazione &egrave; valida per gli stati dei checkpoint SFSB soltanto se la disponibilit&agrave; del contenitore EJB &egrave; disabilitata. Per disabilitare la disponibilit&agrave;, vedere <a href="../../../ejb/en/help/task-ejbcontaineravailability.html">Per configurare le impostazioni di disponibilit&agrave; per il contenitore EJB</a>.</p>
</li>
<li>
<p>Selezionare i pulsanti di scelta relativi all'opzione B o all'opzione C per impostare l'opzione Opzione commit.</p>
<p>L'Opzione commit consente di specificare il tipo di memorizzazione cache da utilizzare nel contenitore per le istanze di bean resi passivi tra le transazioni.</p>
<ul>
<li>
<p>Se si seleziona l'opzione B (impostazione predefinita), il contenitore memorizza nella cache un'istanza pronta tra le transazioni.</p>
</li>
<li>
<p>Se si seleziona l'opzione C, il contenitore non memorizza nella cache un'istanza pronta tra le transazioni.</p>
</li>
</ul>
</li>
<li>
<p>Nel campo Dimensione pool iniziale e minima digitare il numero minimo di bean da gestire nel pool.</p>
<p>Il valore predefinito &egrave; 0.</p>
</li>
<li>
<p>Nel campo Dimensione massima pool digitare il numero massimo di bean che il contenitore pu&ograve; gestire contemporaneamente nel pool.</p>
<p>Il valore predefinito &egrave; 32.</p>
</li>
<li>
<p>Nel campo Quantit&agrave; di ridimensionamento pool digitare il numero di bean che saranno rimossi dal pool se inattivi per un periodo di tempo superiore a quello specificato nel campo Timeout inattivit&agrave; pool.</p>
<p>Il valore deve essere almeno 0 ed essere minore del valore Dimensione massima pool. Il valore predefinito &egrave; 8.</p>
</li>
<li>
<p>Nel campo Timeout inattivit&agrave; pool digitare il periodo di tempo, in secondi, durante il quale un bean nel pool pu&ograve; rimanere inattivo prima di essere rimosso dal pool.</p>
<p>Allo scadere di questo periodo, il bean viene eliminato. Il valore 0 indica che un bean pu&ograve; rimanere inattivo per un periodo di tempo indeterminato. Il valore predefinito &egrave; 600.</p>
</li>
<li>
<p>Nel campo Dimensione massima cache digitare il numero massimo di bean da conservare nella cache.</p>
<p>Per evitare il sovraccarico dovuto alla creazione e all'eliminazione dei bean, aumentare il numero massimo di bean da inserire nella cache. Tenere tuttavia presente che se si aumenta la capacit&agrave; della cache, il server utilizza una quantit&agrave; maggiore di memoria e di risorse. Assicurarsi che l'ambiente operativo in uso sia sufficiente per le impostazioni della cache. Il valore 0 indica una cache senza limiti. Il valore predefinito &egrave; 512.</p>
</li>
<li>
<p>Nel campo Quantit&agrave; di ridimensionamento cache digitare il numero di bean da rendere passivi quando la cache &egrave; piena.</p>
<p>Quando si raggiunge il numero massimo di bean inseriti nella cache, il contenitore rimuove un determinato numero di bean resi passivi dall'area di memorizzazione dei backup. Questo valore indica inoltre il numero di bean da creare se arriva una richiesta quando nel pool non sono presenti bean disponibili. Il valore deve essere maggiore di 1 e minore del valore Dimensione massima cache. Il valore predefinito &egrave; 32.</p>
</li>
<li>
<p>Nel campo Timeout di rimozione digitare il numero di secondi al termine dei quali un bean reso passivo viene rimosso dall'area di memorizzazione della sessione.</p>
<p>Il valore 0 indica che il contenitore non rimuove automaticamente i bean inattivi. Se il valore Timeout di rimozione &egrave; minore o uguale a quello di Timeout di inattivit&agrave; cache, i bean vengono rimossi immediatamente senza diventare passivi. Il valore predefinito &egrave; 5400.</p>
</li>
<li>
<p>Nell'elenco a discesa Criteri di selezione per rimozione selezionare il criterio utilizzato dal contenitore per rimuovere dalla cache i bean di sessione con conservazione dello stato.</p>
<p>Di seguito sono riportate le scelte disponibili.</p>
<dl>
<dt>Non utilizzato di recente (NRU)</dt>
<dd>
<p>(Impostazione predefinita) Rimuove un bean che non &egrave; stato utilizzato di recente.</p>
</dd>
<dt>First In First Out (FIFO)</dt>
<dd>
<p>Rimuove dalla cache il bean meno recente.</p>
</dd>
<dt>Utilizzato meno di recente (LRU)</dt>
<dd>
<p>Rimuove il bean con accesso meno recente.</p>
</dd>
</dl>
</li>
<li>
<p>Nel campo Timeout di inattivit&agrave; cache digitare il numero massimo di secondi durante i quali un bean pu&ograve; rimanere inattivo nella cache.</p>
<p>Al termine di questo periodo, il contenitore pu&ograve; rendere passivo questo bean. Il valore 0 indica che i bean non verranno mai resi passivi. Il valore predefinito &egrave; 600.</p>
</li>
<li>
<p>Nella sezione Propriet&agrave; aggiuntive, specificare le propriet&agrave; aggiuntive.</p>
<p>Per la descrizione delle propriet&agrave; disponibili, vedere <a href="ref-ejbgeneralproperties.html">Propriet&agrave; specifiche del contenitore EJB</a>.</p>
<ul>
<li>
<p>Per aggiungere una propriet&agrave;, fare clic sul pulsante Aggiungi propriet&agrave;. Nella riga vuota visualizzata, digitare il nome della propriet&agrave; nel campo Nome e il valore della propriet&agrave; nel campo Valore.</p>
</li>
<li>
<p>Per modificare una propriet&agrave;, &egrave; necessario modificare il valore del campo Valore della propriet&agrave;.</p>
</li>
<li>
<p>Per eliminare una propriet&agrave;, selezionare la casella di controllo a sinistra del campo Nome corrispondente alla propriet&agrave; da eliminare, quindi fare clic sul pulsante Elimina propriet&agrave;.</p>
</li>
</ul>
</li>
<li>
<p>Fare clic su Salva.</p>

<hr>
<p><b>Suggerimento:</b></p>
Per ripristinare le impostazioni predefinite, fare clic sul pulsante Carica impostazioni predefinite, quindi su Salva.
<hr>

</li>
<li>
<p>Riavviare GlassFish Server.</p>
</li>
</ol>
<a id="sthref4" name="sthref4"></a>
<h5>Vedere anche</h5>
<ul>
<li>
<p><a href="../../../ejb/en/help/task-ejbmdbpoolsettings.html">Per configurare le impostazioni del pool MDB</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbtimerservice.html">Per configurare il servizio timer EJB</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbcontaineravailability.html">Per configurare le impostazioni di disponibilit&agrave; per il contenitore EJB</a></p>
</li>
</ul>




<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
