<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-standaloneinstances" name="ref-standaloneinstances"></a></p>

<h4><a id="sthref319" name="sthref319"></a><a id="sthref320" name="sthref320"></a><a id="sthref321" name="sthref321"></a>Inst&acirc;ncias de Servidor Standalone</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilize a p&aacute;gina Inst&acirc;ncias de Servidor Standalone para criar e gerenciar as inst&acirc;ncias do GlassFish Server standalone.</p>
<p>A p&aacute;gina Inst&acirc;ncias de Servidor Standalone exibe uma lista de todas as inst&acirc;ncias standalone no dom&iacute;nio. Para cada inst&acirc;ncia, s&atilde;o fornecidas as seguintes informa&ccedil;&otilde;es:</p>
<dl>
<dt>Nome</dt>
<dd>
<p>Nome designado &agrave; inst&acirc;ncia quando a inst&acirc;ncia foi criada. Clicar no nome abre a p&aacute;gina <a href="ref-standaloneinstancegeneral.html">Informa&ccedil;&otilde;es Gerais</a> para a inst&acirc;ncia.</p>
</dd>
<dt>Peso do Balanceador de Cargas</dt>
<dd>
<p>Um inteiro que representa o peso do balanceamento de carga da inst&acirc;ncia.</p>
<p>O peso do balanceamento de carga determina a propor&ccedil;&atilde;o de todas as solicita&ccedil;&otilde;es do cluster que a inst&acirc;ncia deve processar.</p>
<p>Por exemplo, em um cluster com duas inst&acirc;ncias, &eacute; poss&iacute;vel processar uma das quatro solicita&ccedil;&otilde;es em uma inst&acirc;ncia e processar tr&ecirc;s das quatro solicita&ccedil;&otilde;es na outra inst&acirc;ncia. Nesta situa&ccedil;&atilde;o, defina como 1 o peso da inst&acirc;ncia que processa uma das quatro solicita&ccedil;&otilde;es e como 3 o peso da outra inst&acirc;ncia. Se preferir utilizar porcentagem, defina os pesos das inst&acirc;ncias como 25 e 75, respectivamente.</p>
<p>O valor default &eacute; 100.</p>
</dd>
<dt>Configura&ccedil;&atilde;o</dt>
<dd>
<p>Configura&ccedil;&atilde;o selecionada para inst&acirc;ncia quando a inst&acirc;ncia foi criada. Ao clicar na configura&ccedil;&atilde;o, a p&aacute;gina <a href="../../../common/en/help/ref-configuration.html">Configura&ccedil;&otilde;es</a> da inst&acirc;ncia se abre.</p>
</dd>
<dt>N&oacute;</dt>
<dd>
<p>O nome do n&oacute; no qual a inst&acirc;ncia reside. Clicar no nome abre a p&aacute;gina <a href="ref-nodeedit.html">Editar N&oacute;</a> para o n&oacute;.</p>
</dd>
<dt>Status</dt>
<dd>
<p>Indica&ccedil;&atilde;o de que a inst&acirc;ncia est&aacute; ou n&atilde;o em execu&ccedil;&atilde;o.</p>
</dd>
</dl>
<p>A tabela Inst&acirc;ncias do Servidor tamb&eacute;m cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Novo</dt>
<dd>
<p>Bot&atilde;o para criar uma inst&acirc;ncia standalone.</p>
</dd>
<dt>Deletar</dt>
<dd>
<p>Bot&atilde;o para deletar uma ou mais inst&acirc;ncias standalone selecionadas.</p>
</dd>
<dt>Iniciar</dt>
<dd>
<p>Bot&atilde;o para iniciar uma ou mais inst&acirc;ncias standalone selecionadas.</p>
</dd>
<dt>Interromper</dt>
<dd>
<p>Bot&atilde;o para interromper uma ou mais inst&acirc;ncias standalone selecionadas.</p>
</dd>
</dl>
<a id="sthref322" name="sthref322"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-create-standalone-instance.html">Para Criar uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-delete-standalone-instances.html">Para Deletar Inst&acirc;ncias do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-start-standalone-instances.html">Para Iniciar Inst&acirc;ncias do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-stop-standalone-instances.html">Para Interromper Inst&acirc;ncias do GlassFish Server Standalone</a></p>
</li>
</ul>
<a id="sthref323" name="sthref323"></a>
<h5>Subcomandos asadmin Equivalentes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00033"><code>create-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00085"><code>delete-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00170"><code>list-instances</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00236"><code>start-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00241"><code>stop-instance</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
