<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterinstances" name="ref-clusterinstances"></a></p>

<h4><a id="sthref266" name="sthref266"></a><a id="sthref267" name="sthref267"></a>Inst&acirc;ncias Clusterizadas do Servidor</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilize a p&aacute;gina Inst&acirc;ncias Clusterizadas do Servidor para criar e gerenciar as inst&acirc;ncias do GlassFish Server no cluster atual.</p>
<p>O campo Nome do Cluster &eacute; um campo somente para leitura que exibe o nome do cluster atual.</p>
<p>A p&aacute;gina Inst&acirc;ncias Clusterizadas do Servidor exibe uma lista de inst&acirc;ncias que s&atilde;o membros do cluster atual. Para cada inst&acirc;ncia, s&atilde;o fornecidas as seguintes informa&ccedil;&otilde;es:</p>
<dl>
<dt>Nome</dt>
<dd>
<p>Nome designado &agrave; inst&acirc;ncia quando a inst&acirc;ncia foi criada. Clicar no nome abre a p&aacute;gina <a href="ref-clusterinstanceedit.html">Informa&ccedil;&otilde;es Gerais</a> para a inst&acirc;ncia.</p>
</dd>
<dt>Peso do Balanceador de Cargas</dt>
<dd>
<p>Um inteiro que representa o peso do balanceamento de carga da inst&acirc;ncia.</p>
<p>O peso do balanceamento de carga determina a propor&ccedil;&atilde;o de todas as solicita&ccedil;&otilde;es do cluster que a inst&acirc;ncia deve processar.</p>
<p>Por exemplo, em um cluster com duas inst&acirc;ncias, &eacute; poss&iacute;vel processar uma das quatro solicita&ccedil;&otilde;es em uma inst&acirc;ncia e processar tr&ecirc;s das quatro solicita&ccedil;&otilde;es na outra inst&acirc;ncia. Nesta situa&ccedil;&atilde;o, defina como 1 o peso da inst&acirc;ncia que processa uma das quatro solicita&ccedil;&otilde;es e como 3 o peso da outra inst&acirc;ncia. Se preferir utilizar porcentagem, defina os pesos das inst&acirc;ncias como 25 e 75, respectivamente.</p>
<p>O valor default &eacute; 100.</p>
</dd>
<dt>Configura&ccedil;&atilde;o</dt>
<dd>
<p>A configura&ccedil;&atilde;o &agrave; qual a inst&acirc;ncia faz refer&ecirc;ncia. Ao clicar na configura&ccedil;&atilde;o, a p&aacute;gina <a href="../../../common/en/help/ref-configuration.html">Configura&ccedil;&otilde;es</a> da inst&acirc;ncia se abre.</p>
</dd>
<dt>N&oacute;</dt>
<dd>
<p>O nome do n&oacute; no qual a inst&acirc;ncia reside. Clicar no nome abre a p&aacute;gina <a href="ref-nodeedit.html">Editar N&oacute;</a> para o n&oacute;.</p>
</dd>
<dt>Status</dt>
<dd>
<p>Indica se a inst&acirc;ncia est&aacute; em execu&ccedil;&atilde;o, se requer reinicializa&ccedil;&atilde;o para que seja atualizada com as altera&ccedil;&otilde;es na configura&ccedil;&atilde;o ou se n&atilde;o est&aacute; em execu&ccedil;&atilde;o. Este campo &eacute; somente para leitura.</p>
</dd>
</dl>
<p>A tabela Inst&acirc;ncias do Servidor tamb&eacute;m cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Novo</dt>
<dd>
<p>Bot&atilde;o para adicionar uma inst&acirc;ncia ao cluster.</p>
</dd>
<dt>Deletar</dt>
<dd>
<p>Bot&atilde;o para remover uma ou mais inst&acirc;ncias selecionadas do cluster.</p>

<hr>
<p><b>Cuidado:</b></p>
Se estiver utilizando um cluster Java Message Service (JMS) com um broker mestre, n&atilde;o delete a inst&acirc;ncia que est&aacute; associada ao broker mestre. Se esta inst&acirc;ncia precisar ser deletada, use o subcomando <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00005"><code>change-master-broker</code>(1)</a> para designar o broker mestre a outra inst&acirc;ncia.
<hr>

</dd>
<dt>Iniciar</dt>
<dd>
<p>Bot&atilde;o para iniciar uma ou mais inst&acirc;ncias selecionadas no cluster.</p>
</dd>
<dt>Interromper</dt>
<dd>
<p>Bot&atilde;o para interromper uma ou mais inst&acirc;ncias selecionadas no cluster.</p>
</dd>
</dl>
<a id="sthref268" name="sthref268"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-create-clustered-instance.html">Para Adicionar uma Inst&acirc;ncia de GlassFish Server a um Cluster</a></p>
</li>
<li>
<p><a href="task-delete-clustered-instances.html">Para Deletar Inst&acirc;ncias do GlassFish Server Clusterizadas</a></p>
</li>
<li>
<p><a href="task-start-clustered-instances.html">Para Iniciar Inst&acirc;ncias do GlassFish Server Clusterizadas</a></p>
</li>
<li>
<p><a href="task-stop-clustered-instances.html">Para Interromper Inst&acirc;ncias do GlassFish Server Clusterizadas</a></p>
</li>
</ul>
<a id="sthref269" name="sthref269"></a>
<h5>Subcomandos asadmin Equivalentes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00033"><code>create-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00085"><code>delete-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00170"><code>list-instances</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00236"><code>start-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00241"><code>stop-instance</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
