<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterproperties" name="ref-clusterproperties"></a></p>

<h4><a id="sthref300" name="sthref300"></a><a id="sthref301" name="sthref301"></a>Propriedades Cluster</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>A p&aacute;gina Propriedades do Cluster exibe uma lista das propriedades que est&atilde;o definidas para os clusters selecionados. Estas propriedades acrescentam informa&ccedil;&otilde;es opcionais de configura&ccedil;&atilde;o sobre o cluster.</p>
<p>O campo Nome do Cluster &eacute; um campo somente para leitura que exibe o nome do cluster selecionado.</p>
<p>S&atilde;o exibidas as seguintes informa&ccedil;&otilde;es para cada propriedade:</p>
<dl>
<dt>Nome</dt>
<dd>
<p>O nome da propriedade.</p>
</dd>
<dt>Valor</dt>
<dd>
<p>Valor da propriedade definida para a inst&acirc;ncia selecionada.</p>
</dd>
<dt>Descri&ccedil;&atilde;o</dt>
<dd>
<p>Uma descri&ccedil;&atilde;o textual que fornece mais informa&ccedil;&otilde;es sobre a propriedade.</p>
</dd>
</dl>
<p>A tabela Propriedades Adicionais tamb&eacute;m cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Adicionar Propriedade</dt>
<dd>
<p>Bot&atilde;o para adicionar uma propriedade. Clicar neste bot&atilde;o adiciona uma linha &agrave; tabela Propriedades Adicionais.</p>
</dd>
<dt>Deletar Propriedades</dt>
<dd>
<p>Bot&atilde;o para deletar uma ou mais propriedades selecionadas. Qualquer propriedade deletada retorna ao seu valor default ou, se nenhum valor tiver sido definido, fica com valor indefinido.</p>
</dd>
</dl>
<p>O GlassFish Server define as seguintes propriedades do cluster:</p>
<dl>
<dt><code>GMS_DISCOVERY_URI_LIST</code></dt>
<dd>
<p>Os locais das inst&acirc;ncias do GlassFish Server no cluster a serem usados para descobrir o cluster. Essa propriedade s&oacute; ser&aacute; necess&aacute;ria se o Servi&ccedil;o de Gerenciamento de Grupos (GMS) n&atilde;o estiver usando multicast para transmitir mensagens.</p>
<p>Os valores v&aacute;lidos dessa propriedade s&atilde;o os seguintes:</p>
<ul>
<li>
<p>Uma lista separada por v&iacute;rgulas de URIs (Uniform Resource Identifiers). Cada URI deve localizar uma inst&acirc;ncia ou DAS do GlassFish Server. Esse formato &eacute; obrigat&oacute;rio se v&aacute;rias inst&acirc;ncias do GlassFish Server estiverem sendo executadas no mesmo host.</p>
<p>O formato de cada URI na lista &eacute; o seguinte:</p>
<p><i>scheme</i><code>://</code><i>host-name-or -IP-address</i><code>:</code><i>port</i></p>
<ul>
<li>
<p><i>scheme</i> &eacute; o esquema do URI que &eacute; <code>tcp</code>.</p>
</li>
<li>
<p><i>host-name-or -IP-address</i> &eacute; o nome do host ou o endere&ccedil;o IP do host no qual a inst&acirc;ncia est&aacute; sendo executada.</p>
</li>
<li>
<p><i>porta</i> &eacute; o n&uacute;mero da porta no qual a inst&acirc;ncia faz listening de mensagens de GMS. A propriedade do sistema <code>uniform resource identifiers</code><i>clustername</i> deve ser definida pela inst&acirc;ncia. Para obter informa&ccedil;&otilde;es sobre como definir essa propriedade do sistema para uma inst&acirc;ncia, consulte "<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSHAG00373">Discovering a Cluster When Multicast Transport Is Unavailable</a>" em <i>Oracle GlassFish Server High Availability Administration Guide</i>.</p>
</li>
</ul>
</li>
<li>
<p>Uma lista separada por v&iacute;rgulas de endere&ccedil;os IP ou nomes de host na qual o DAS ou as inst&acirc;ncias est&atilde;o sendo executados. A lista pode conter uma mistura de endere&ccedil;os IP e nomes de host. Esse formato s&oacute; poder&aacute; ser usado se uma inst&acirc;ncia clusterizada estiver sendo executada em cada host. O valor da propriedade <code>GMS_LISTENER_PORT</code> deve ser &uacute;nico para cada cluster no dom&iacute;nio.</p>
</li>
<li>
<p>A palavra-chave <code>gerar</code>. Este formato pode ser usado somente se uma inst&acirc;ncia em um cluster estiver em execu&ccedil;&atilde;o em cada host e o DAS estiver em execu&ccedil;&atilde;o em um host separado. V&aacute;rias inst&acirc;ncias no mesmo host n&atilde;o podem ser membros do mesmo cluster. O valor da propriedade <code>GMS_LISTENER_PORT</code> deve ser &uacute;nico para cada cluster no dom&iacute;nio.</p>
</li>
</ul>
</dd>
<dt><code>GMS_LISTENER_PORT</code></dt>
<dd>
<p>O n&uacute;mero da porta em que o cluster faz listening das mensagens do GMS.</p>
<p>O valor default &eacute; a refer&ecirc;ncia para a propriedade do sistema <code>GMS_LISTENER_PORT-</code><i>cluster-name</i>. Por default, esta propriedade do sistema n&atilde;o &eacute; definida. Nesta situa&ccedil;&atilde;o, o GMS seleciona uma porta livre da faixa que &eacute; definida pelas propriedades <code>GMS_TCPSTARTPORT</code> e <code>GMS_TCPENDPORT</code>. Por default, esta faixa &eacute; 9090-9200. Na maioria das situa&ccedil;&otilde;es, o comportamento default deve ser suficiente.</p>
<p>Entretanto, se GMS <b>n&atilde;o</b> estiver usando multicast para transmitir mensagens, essa propriedade dever&aacute; specificar um n&uacute;mero de porta que &eacute; v&aacute;lido para todas as inst&acirc;ncias GlassFish Server no cluster. Para usar o valor default para atender a essas exig&ecirc;ncias, use uma propriedade do sistema para definir o n&uacute;mero da porta de cada inst&acirc;ncia individualmente.</p>
<p>Por exemplo, use a p&aacute;gina <a href="ref-clustersystemproperties.html">Propriedades de Sistema do Cluster</a> para criar a propriedade do sistema <code>GMS_LISTENER_PORT-</code><i>cluster-name</i> para o DAS. Assim, para cada inst&acirc;ncia no cluster, defina a propriedade do sistema <code>GMS_LISTENER_PORT</code><i>cluster-name</i> para o n&uacute;mero da porta no qual a inst&acirc;ncia faz listening das mensagens de GMS. O valor default da propriedade <code>GMS_LISTENER_PORT</code> para o cluster faz refer&ecirc;ncia a essa propriedade do sistema.</p>
</dd>
<dt><code>GMS_LOOPBACK</code></dt>
<dd>
<p>Especifique se uma inst&acirc;ncia pode receber de si mesma mensagens do n&iacute;vel da aplica&ccedil;&atilde;o que a inst&acirc;ncia transmite para o cluster.</p>
<p>Os valores poss&iacute;veis s&atilde;o os seguintes:</p>
<dl>
<dt><code>false</code></dt>
<dd>
<p>A inst&acirc;ncia <i>n&atilde;o</i> pode receber mensagens de si mesma (default).</p>
</dd>
<dt><code>true</code></dt>
<dd>
<p>A inst&acirc;ncia pode receber mensagens de si mesma. Utilize esta defini&ccedil;&atilde;o para testar uma inst&acirc;ncia quando tal inst&acirc;ncia for a &uacute;nica em um cluster.</p>
</dd>
</dl>
</dd>
<dt><code>GMS_MULTICAST_TIME_TO_LIVE</code></dt>
<dd>
<p>O n&uacute;mero m&aacute;ximo de itera&ccedil;&otilde;es ou transmiss&otilde;es que uma mensagem multicast dos seguintes tipos de evento pode sofrer antes que a mensagem seja descartada:</p>
<ul>
<li>
<p>Descoberta de grupo</p>
</li>
<li>
<p>Pulsa&ccedil;&otilde;es do membro</p>
</li>
<li>
<p>Altera&ccedil;&otilde;es da associa&ccedil;&atilde;o</p>
</li>
</ul>
<p>Para coincidir com a configura&ccedil;&atilde;o da rede na qual o DAS e as inst&acirc;ncias clusterizadas est&atilde;o implantadas, defina este valor com menor valor poss&iacute;vel. Para determinar o menor valor poss&iacute;vel do sistema, use o subcomando <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00259"><code>validate-multicast</code>(1)</a>.</p>
<p>O valor 0 garante que as mensagens multicast nunca saiam do host do qual elas s&atilde;o transmitidas.</p>
<p>O valor 1 pode evitar a transmiss&atilde;o de mensagens entre hosts da mesma sub-rede conectados por um comutador ou um roteador.</p>
<p>O default &eacute; 4, o que garante que as mensagens sejam transmitidas com &ecirc;xito para todos os membros do cluster em redes nas quais os hosts est&atilde;o conectados por comutadores ou roteadores.</p>
</dd>
<dt><code>GMS_TCPENDPORT</code></dt>
<dd>
<p>O n&uacute;mero de porta mais alto na faixa da qual o GMS seleciona uma porta livre se a propriedade do sistema <code>GMS_LISTENER_PORT-</code><i>cluster-name</i> n&atilde;o estiver definida. O default &eacute; 9200.</p>
</dd>
<dt><code>GMS_TCPSTARTPORT</code></dt>
<dd>
<p>O n&uacute;mero de porta mais baixo na faixa da qual o GMS seleciona uma porta livre se a propriedade do sistema <code>GMS_LISTENER_PORT-</code><i>cluster-name</i> n&atilde;o for definida. O default &eacute; 9090.</p>
</dd>
</dl>
<a id="sthref302" name="sthref302"></a>
<h5>Subcomandos asadmin Equivalentes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00139"><code>get</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00145"><code>list</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00226"><code>set</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
