<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-standaloneinstancenew" name="ref-standaloneinstancenew"></a><a id="GHCLU00019" name="GHCLU00019"></a></p>

<h4><a id="sthref324" name="sthref324"></a><a id="sthref325" name="sthref325"></a><a id="sthref326" name="sthref326"></a>Nova Inst&acirc;ncia de Servidor Standalone</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilize a p&aacute;gina Nova Inst&acirc;ncia de Servidor Standalone para criar uma inst&acirc;ncia standalone do GlassFish Server.</p>
<p>A p&aacute;gina Nova Inst&acirc;ncia de Servidor Standalone cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Nome da Inst&acirc;ncia</dt>
<dd>
<p>O nome da inst&acirc;ncia que est&aacute; sendo criada.</p>
<p>O nome deve atender aos seguintes requisitos:</p>
<ul>
<li>
<p>O nome s&oacute; pode conter caracteres ASCII.</p>
</li>
<li>
<p>O nome deve come&ccedil;ar com uma letra, um n&uacute;mero ou um sublinhado.</p>
</li>
<li>
<p>O nome pode conter s&oacute; os seguintes caracteres:</p>
<ul>
<li>
<p>Letras min&uacute;sculas</p>
</li>
<li>
<p>Letras mai&uacute;sculas</p>
</li>
<li>
<p>N&uacute;meros</p>
</li>
<li>
<p>H&iacute;fen</p>
</li>
<li>
<p>Ponto</p>
</li>
<li>
<p>Sublinhado</p>
</li>
</ul>
</li>
<li>
<p>O nome deve ser &uacute;nico no dom&iacute;nio e n&atilde;o deve ser o nome de outra inst&acirc;ncia, um cluster, uma configura&ccedil;&atilde;o nomeada ou um n&oacute; do GlassFish Server.</p>
</li>
<li>
<p>O nome n&atilde;o deve ser <code>domain</code>, <code>server</code>, nem nenhuma outra palavra-chave que esteja reservada pelo GlassFish Server.</p>
</li>
</ul>
</dd>
<dt>N&oacute;</dt>
<dd>
<p>Lista drop-down dos n&oacute;s existentes que definem os hosts nos quais a inst&acirc;ncia pode estar. &Eacute; necess&aacute;rio selecionar um n&oacute; na lista. Se a inst&acirc;ncia for criada no host em que o servidor de administra&ccedil;&atilde;o de dom&iacute;nios (DAS) estiver em execu&ccedil;&atilde;o, selecione o dom&iacute;nio do n&oacute; predefinido <code>localhost-</code>.</p>
</dd>
<dt>Configura&ccedil;&atilde;o</dt>
<dd>
<p>Lista drop-down das configura&ccedil;&otilde;es nomeadas existentes que a inst&acirc;ncia pode utilizar. &Eacute; necess&aacute;rio selecionar uma configura&ccedil;&atilde;o na lista. A inst&acirc;ncia utilizar&aacute; a configura&ccedil;&atilde;o selecionada quando a inst&acirc;ncia for criada.</p>
</dd>
<dt>Criar uma C&oacute;pia da Configura&ccedil;&atilde;o Selecionada</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o for selecionada, a configura&ccedil;&atilde;o selecionada ser&aacute; copiada quando a inst&acirc;ncia for criada. Foi designado &agrave; c&oacute;pia da configura&ccedil;&atilde;o o nome <i>instance-name</i><code>-config</code>, em que <i>instance-name</i> &eacute; o nome da inst&acirc;ncia, conforme digitado no campo Nome da Inst&acirc;ncia.</p>
<p>Se <code>default-config</code> estiver selecionado na lista drop-down Configura&ccedil;&atilde;o, &eacute; necess&aacute;rio selecionar esta op&ccedil;&atilde;o. A configura&ccedil;&atilde;o <code>default-config</code> pode ser apenas copiada, n&atilde;o referenciada.</p>
</dd>
<dt>Referenciar a Configura&ccedil;&atilde;o Selecionada</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o for selecionada, a inst&acirc;ncia utilizar&aacute; a configura&ccedil;&atilde;o nomeada existente especificada.</p>
<p>Se <code>default-config</code> estiver selecionado na lista drop-down Configura&ccedil;&atilde;o, esta op&ccedil;&atilde;o <i>n&atilde;o</i> deve ser selecionada. A configura&ccedil;&atilde;o <code>default-config</code> n&atilde;o pode ser referenciada, somente copiada.</p>
</dd>
</dl>
<a id="sthref327" name="sthref327"></a>
<h5>Tarefas Relacionadas</h5>
<p><a href="task-create-standalone-instance.html">Para Criar uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
<a id="sthref328" name="sthref328"></a>
<h5>Subcomando asadmin Equivalente</h5>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00033"><code>create-instance</code>(1)</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
