<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-availabilityservice" name="ref-availabilityservice"></a></p>

<h4><a id="sthref352" name="sthref352"></a>Servi&ccedil;o de Disponibilidade</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilize a p&aacute;gina Servi&ccedil;o de Disponibilidade para alterar as defini&ccedil;&otilde;es de disponibilidade de um cluster.</p>
<p>A p&aacute;gina Servi&ccedil;o de Disponibilidade cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Carregar Defaults</dt>
<dd>
<p>Bot&atilde;o para restaurar defini&ccedil;&otilde;es para seus valores default. Defini&ccedil;&otilde;es que n&atilde;o tiveram seus valores default alterados.</p>
</dd>
<dt>Servi&ccedil;o de Disponibilidade</dt>
<dd>
<p>Se a caixa de sele&ccedil;&atilde;o Ativado estiver marcada, a disponibilidade est&aacute; ativada para o cluster. Por default, essa op&ccedil;&atilde;o est&aacute; selecionada.</p>
</dd>
<dt>Propriedades Adicionais</dt>
<dd>
<p>Uma tabela de propriedades adicionais do Servi&ccedil;o de Disponibilidade.</p>
<p>O GlassFish Server n&atilde;o define propriedades adicionais do Servi&ccedil;o de Disponibilidade.</p>
<p>S&atilde;o exibidas as seguintes informa&ccedil;&otilde;es para cada propriedade:</p>
<dl>
<dt>Nome</dt>
<dd>
<p>O nome da propriedade.</p>
</dd>
<dt>Valor</dt>
<dd>
<p>Valor da propriedade definida para a inst&acirc;ncia selecionada.</p>
</dd>
<dt>Descri&ccedil;&atilde;o</dt>
<dd>
<p>Uma descri&ccedil;&atilde;o textual que fornece mais informa&ccedil;&otilde;es sobre a propriedade.</p>
</dd>
</dl>
<p>A tabela Propriedades Adicionais tamb&eacute;m cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Adicionar Propriedade</dt>
<dd>
<p>Bot&atilde;o para adicionar uma propriedade. Clicar neste bot&atilde;o adiciona uma linha &agrave; tabela Propriedades Adicionais.</p>
</dd>
<dt>Deletar Propriedades</dt>
<dd>
<p>Bot&atilde;o para deletar uma ou mais propriedades selecionadas. Qualquer propriedade deletada retorna ao seu valor default ou, se nenhum valor tiver sido definido, fica com valor indefinido.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref353" name="sthref353"></a>
<h5>Tarefas Relacionadas</h5>
<p><a href="task-availabilityservice.html">Para Configurar as Defini&ccedil;&otilde;es de Disponibilidade de um Cluster</a></p>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
