<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-standaloneinstancegeneral" name="ref-standaloneinstancegeneral"></a><a id="GHCLU00020" name="GHCLU00020"></a></p>

<h4><a id="sthref329" name="sthref329"></a><a id="sthref330" name="sthref330"></a><a id="sthref331" name="sthref331"></a>Informa&ccedil;&otilde;es Gerais</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>A p&aacute;gina Informa&ccedil;&otilde;es Gerais cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Iniciar</dt>
<dd>
<p>Bot&atilde;o para iniciar a inst&acirc;ncia. Se a inst&acirc;ncia estiver em execu&ccedil;&atilde;o, este bot&atilde;o ser&aacute; desativado.</p>
</dd>
<dt>Interromper</dt>
<dd>
<p>Bot&atilde;o para interromper a inst&acirc;ncia. Se a inst&acirc;ncia estiver interrompida, este bot&atilde;o est&aacute; desativado.</p>
</dd>
<dt>Reiniciar</dt>
<dd>
<p>Bot&atilde;o para reiniciar a inst&acirc;ncia. Se a inst&acirc;ncia estiver interrompida, este bot&atilde;o est&aacute; desativado.</p>
</dd>
<dt>Exibir Arquivos de Log</dt>
<dd>
<p>Bot&atilde;o para exibir os arquivos de log da inst&acirc;ncia.</p>
</dd>
<dt>Rotacionar Log</dt>
<dd>
<p>Bot&atilde;o para rotacionar o arquivo de log da inst&acirc;ncia. Quando o arquivo de log for rotacionado, ele ser&aacute; renomeado com um nome do timestamp no formato <code>server.log_</code><i>date-and-time</i> e um arquivo de log vazio ser&aacute; criado para novas mensagens de log. As altera&ccedil;&otilde;es ser&atilde;o aplicadas dinamicamente. N&atilde;o &eacute; necess&aacute;rio reiniciar o servidor.</p>
</dd>
<dt>Recuperar Transa&ccedil;&otilde;es</dt>
<dd>
<p>Bot&atilde;o para recuperar transa&ccedil;&otilde;es da inst&acirc;ncia.</p>
</dd>
<dt>Nome</dt>
<dd>
<p>Nome designado &agrave; inst&acirc;ncia quando a inst&acirc;ncia foi criada. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>JVM</dt>
<dd>
<p>Se voc&ecirc; clicar em Relat&oacute;rio da JVM, ser&aacute; aberta uma janela separada que exibe relat&oacute;rios sobre a Java Virtual Machine, incluindo um relat&oacute;rio de resumo, um relat&oacute;rio de gerenciamento de mem&oacute;ria e de coleta de erros,um relat&oacute;rio de carregamento de classe e um dump de threads atuais.</p>
</dd>
<dt>Status</dt>
<dd>
<p>Indica&ccedil;&atilde;o de que a inst&acirc;ncia est&aacute; ou n&atilde;o em execu&ccedil;&atilde;o. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>N&oacute;</dt>
<dd>
<p>O nome do n&oacute; no qual a inst&acirc;ncia reside. Clicar no nome abre a p&aacute;gina <a href="ref-nodeedit.html">Editar N&oacute;</a> para o n&oacute;.</p>
</dd>
<dt>Configura&ccedil;&atilde;o</dt>
<dd>
<p>A configura&ccedil;&atilde;o &agrave; qual a inst&acirc;ncia faz refer&ecirc;ncia. Ao clicar na configura&ccedil;&atilde;o, a p&aacute;gina <a href="../../../common/en/help/ref-configuration.html">Configura&ccedil;&otilde;es</a> da inst&acirc;ncia se abre.</p>
</dd>
<dt>Depura&ccedil;&atilde;o</dt>
<dd>
<p>Uma indica&ccedil;&atilde;o de que a depura&ccedil;&atilde;o do JPDA (Java Platform Debugger Architecture) <code><a href="http://java.sun.com/javase/technologies/core/toolsapis/jpda/">http://java.sun.com/javase/technologies/core/toolsapis/jpda/</a></code>) est&aacute; ativada para a inst&acirc;ncia. Este campo &eacute; somente para leitura.</p>
<p>Se uma inst&acirc;ncia &eacute; iniciada a partir do Console de Administra&ccedil;&atilde;o, a depura&ccedil;&atilde;o JPDA n&atilde;o est&aacute; ativada para a inst&acirc;ncia. Para iniciar uma inst&acirc;ncia com a depura&ccedil;&atilde;o do JPDA ativada, use o subcomando <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00236"><code>start-instance</code>(1)</a>.</p>
</dd>
<dt>Portas HTTP</dt>
<dd>
<p>Uma lista separada por v&iacute;rgulas dos n&uacute;meros das portas na qual a inst&acirc;ncia faz listening dos seguintes tipos de solicita&ccedil;&otilde;es:</p>
<ul>
<li>
<p>Solicita&ccedil;&otilde;es de administra&ccedil;&atilde;o</p>
</li>
<li>
<p>Solicita&ccedil;&otilde;es HTTP</p>
</li>
<li>
<p>Solicita&ccedil;&otilde;es HTTPS</p>
</li>
</ul>
<p>Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Portas IIOP</dt>
<dd>
<p>Uma lista separada por v&iacute;rgulas dos n&uacute;meros das portas que a inst&acirc;ncia utiliza nos seguintes tipos de conex&otilde;es:</p>
<ul>
<li>
<p>Conex&atilde;o IIOP segura</p>
</li>
<li>
<p>Conex&otilde;es IIOP seguras com autentica&ccedil;&atilde;o do cliente</p>
</li>
<li>
<p>Conex&otilde;es IIOP</p>
</li>
</ul>
<p>Este campo &eacute; somente para leitura.</p>
</dd>
</dl>
<a id="sthref332" name="sthref332"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-start-standalone-instances.html">Para Iniciar Inst&acirc;ncias do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-stop-standalone-instances.html">Para Interromper Inst&acirc;ncias do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-view-logs-standalone-instance.html">Para Exibir Arquivos de Log de uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-recovertransactions-standalone-instance.html">Para Recuperar Transa&ccedil;&otilde;es de uma Inst&acirc;ncia de GlassFish Server Standalone</a></p>
</li>
</ul>
<a id="sthref333" name="sthref333"></a>
<h5>Subcomandos asadmin Equivalentes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00138"><code>generate-jvm-report</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00236"><code>start-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00241"><code>stop-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00224"><code>rotate-log</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
