<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterapplications" name="ref-clusterapplications"></a><a id="GHCLU00005" name="GHCLU00005"></a></p>

<h4><a id="sthref262" name="sthref262"></a><a id="sthref263" name="sthref263"></a>Aplica&ccedil;&otilde;es</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilize a p&aacute;gina Aplica&ccedil;&otilde;es para realizar as seguintes tarefas no cluster atual:</p>
<ul>
<li>
<p>Exibindo e gerenciando aplica&ccedil;&otilde;es que j&aacute; est&atilde;o implantadas no cluster</p>
</li>
<li>
<p>Implantando mais aplica&ccedil;&otilde;es no cluster</p>
</li>
</ul>
<p>O campo Nome do Cluster &eacute; um campo somente para leitura que exibe o nome do cluster atual.</p>
<p>A p&aacute;gina Aplica&ccedil;&otilde;es exibe uma lista das aplica&ccedil;&otilde;es que est&atilde;o implantadas no cluster atual. Para cada aplica&ccedil;&atilde;o, as informa&ccedil;&otilde;es a seguir s&atilde;o mostradas.</p>
<dl>
<dt>Nome</dt>
<dd>
<p>O nome da aplica&ccedil;&atilde;o.</p>
<p>O nome pode incluir um identificador de vers&atilde;o opcional, que segue o nome e &eacute; separado do nome por dois-pontos (<code>:</code>). Para obter mais informa&ccedil;&otilde;es sobre vers&otilde;es de m&oacute;dulo e da aplica&ccedil;&atilde;o, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> em <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt>Ativado</dt>
<dd>
<p>Uma indica&ccedil;&atilde;o que informa se a aplica&ccedil;&atilde;o est&aacute; ativada:</p>
<ul>
<li>
<p>Se a aplica&ccedil;&atilde;o estiver ativada, uma marca de verifica&ccedil;&atilde;o (&#10003;) ser&aacute; exibida.</p>
</li>
<li>
<p>Se a aplica&ccedil;&atilde;o for desativada, um &#10007; () &eacute; exibido.</p>
</li>
</ul>
</dd>
<dt>Balanceador de Carga Ativado</dt>
<dd>
<p>Indica&ccedil;&atilde;o de que a aplica&ccedil;&atilde;o est&aacute; ativada para balanceamento de carga:</p>
<ul>
<li>
<p>Se a aplica&ccedil;&atilde;o estiver ativada para balanceamento de carga, uma marca de verifica&ccedil;&atilde;o (&#10003;) ser&aacute; exibida.</p>
</li>
<li>
<p>Se a aplica&ccedil;&atilde;o for desativada para balanceamento de carga, um (&#10007;) &eacute; exibido.</p>
</li>
</ul>
</dd>
<dt>Mecanismos</dt>
<dd>
<p>Os tipos de cont&ecirc;ineres que a aplica&ccedil;&atilde;o utiliza. Os tipos de cont&ecirc;ineres podem ser os seguintes:</p>
<ul>
<li>
<p><code>web</code></p>
</li>
<li>
<p><code>webservices</code></p>
</li>
<li>
<p><code>ejb</code></p>
</li>
<li>
<p><code>connector</code></p>
</li>
<li>
<p><code>appclient</code></p>
</li>
<li>
<p><code>weld</code> &mdash; o cont&ecirc;iner para Contextos e Inje&ccedil;&atilde;o de Depend&ecirc;ncia para aplica&ccedil;&otilde;es da Plataforma Java EE</p>
</li>
</ul>
</dd>
</dl>
<p>A tabela Aplica&ccedil;&otilde;es Implantadas tamb&eacute;m cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Implantar</dt>
<dd>
<p>Bot&atilde;o para implantar uma aplica&ccedil;&atilde;o.</p>
</dd>
<dt>Cancelar Implanta&ccedil;&atilde;o</dt>
<dd>
<p>Bot&atilde;o para cancelar a implanta&ccedil;&atilde;o de uma ou mais aplica&ccedil;&otilde;es selecionadas.</p>
<p>O cancelamento da implanta&ccedil;&atilde;o de uma aplica&ccedil;&atilde;o remove a aplica&ccedil;&atilde;o de todos os alvos e do dom&iacute;nio. Quando a implanta&ccedil;&atilde;o de uma aplica&ccedil;&atilde;o &eacute; cancelada, a aplica&ccedil;&atilde;o deixa de ser listada na p&aacute;gina <a href="../../../common/en/help/ref-applications.html">Aplica&ccedil;&otilde;es</a> que exibe todas as aplica&ccedil;&otilde;es implantadas no GlassFish Server.</p>
<p>Para remover aplica&ccedil;&otilde;es somente do alvo atual, utilize o bot&atilde;o Remover desta p&aacute;gina.</p>
</dd>
<dt>Remover</dt>
<dd>
<p>Bot&atilde;o para remover um ou mais aplica&ccedil;&otilde;es selecionadas.</p>
<p>A remo&ccedil;&atilde;o de uma aplica&ccedil;&atilde;o remove a aplica&ccedil;&atilde;o somente do alvo atual. Quando uma aplica&ccedil;&atilde;o &eacute; removida de um alvo, a aplica&ccedil;&atilde;o continua a ser listada na p&aacute;gina <a href="../../../common/en/help/ref-applications.html">Aplica&ccedil;&otilde;es</a> que exibe todas as aplica&ccedil;&otilde;es implantadas no GlassFish Server. A aplica&ccedil;&atilde;o tamb&eacute;m permanece implantada nos outros alvos nos quais j&aacute; havia sido implantada.</p>
<p>Para remover aplica&ccedil;&otilde;es de todos os alvos e do dom&iacute;nio, utilize o bot&atilde;o Cancelar Implanta&ccedil;&atilde;o desta p&aacute;gina.</p>
</dd>
<dt>Mais A&ccedil;&otilde;es</dt>
<dd>
<p>Lista drop-down que realiza a&ccedil;&otilde;es adicionais em um ou mais aplica&ccedil;&otilde;es selecionadas.</p>
<dl>
<dt>Ativar</dt>
<dd>
<p>Ativa uma ou mais aplica&ccedil;&otilde;es selecionadas.</p>
</dd>
<dt>Desativar</dt>
<dd>
<p>Desativa um ou mais aplica&ccedil;&otilde;es selecionadas.</p>
</dd>
<dt>Ativar Balanceador de Carga</dt>
<dd>
<p>Ativa um ou mais aplica&ccedil;&otilde;es selecionadas para balanceamento de carga.</p>
</dd>
<dt>Desativar Balanceador de Carga</dt>
<dd>
<p>Desativa uma ou mais aplica&ccedil;&otilde;es selecionadas para balanceamento de carga.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref264" name="sthref264"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-cluster-app-deploy.html">Para Implantar uma Aplica&ccedil;&atilde;o em um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-list.html">Para Listar Aplica&ccedil;&otilde;es Que S&atilde;o Implantadas em um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-undeploy.html">Para Cancelar a Implanta&ccedil;&atilde;o de Aplica&ccedil;&otilde;es de um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-remove.html">Para Remover Aplica&ccedil;&otilde;es de um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-edit.html">Para Editar uma Aplica&ccedil;&atilde;o que &eacute; Implantada em um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-enable-disable.html">Para Ativar ou Desativar uma Aplica&ccedil;&atilde;o que est&aacute; Implantada em um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-lb-enable-disable.html">Para Ativar ou Desativar o Balanceamento de Carga de uma Aplica&ccedil;&atilde;o que foi Implantada em um Cluster</a></p>
</li>
</ul>
<a id="sthref265" name="sthref265"></a>
<h5>Subcomandos asadmin Equivalentes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00114"><code>implantar</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00116"><code>desativar</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00118"><code>disable-http-lb-application</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00124"><code>ativar</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00126"><code>enable-http-lb-application</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00148"><code>list-applications</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
