<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterinstanceedit" name="ref-clusterinstanceedit"></a></p>

<h4><a id="sthref275" name="sthref275"></a><a id="sthref276" name="sthref276"></a><a id="sthref277" name="sthref277"></a>Informa&ccedil;&otilde;es Gerais</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>A p&aacute;gina Informa&ccedil;&otilde;es Gerais cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Iniciar</dt>
<dd>
<p>Bot&atilde;o para iniciar a inst&acirc;ncia. Se a inst&acirc;ncia estiver em execu&ccedil;&atilde;o, este bot&atilde;o ser&aacute; desativado.</p>
</dd>
<dt>Interromper</dt>
<dd>
<p>Bot&atilde;o para interromper a inst&acirc;ncia. Se a inst&acirc;ncia estiver interrompida, este bot&atilde;o est&aacute; desativado.</p>
</dd>
<dt>Reiniciar</dt>
<dd>
<p>Bot&atilde;o para reiniciar a inst&acirc;ncia. Se a inst&acirc;ncia estiver interrompida, este bot&atilde;o est&aacute; desativado.</p>
</dd>
<dt>Exibir Arquivos de Log</dt>
<dd>
<p>Bot&atilde;o para exibir os arquivos de log da inst&acirc;ncia.</p>
</dd>
<dt>Recuperar Transa&ccedil;&otilde;es</dt>
<dd>
<p>Bot&atilde;o para recuperar transa&ccedil;&otilde;es da inst&acirc;ncia.</p>
</dd>
<dt>Nome do Cluster</dt>
<dd>
<p>Nome designado ao cluster quando o cluster &eacute; criado. Clicar no nome abre a p&aacute;gina <a href="ref-clustergeneral.html">Informa&ccedil;&otilde;es Gerais</a> para o cluster.</p>
</dd>
<dt>Nome da Inst&acirc;ncia</dt>
<dd>
<p>Nome designado &agrave; inst&acirc;ncia quando a inst&acirc;ncia foi adicionada ao cluster. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Status</dt>
<dd>
<p>Indica se a inst&acirc;ncia est&aacute; em execu&ccedil;&atilde;o, se requer reinicializa&ccedil;&atilde;o para que seja atualizada com as altera&ccedil;&otilde;es na configura&ccedil;&atilde;o ou se n&atilde;o est&aacute; em execu&ccedil;&atilde;o. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>JVM</dt>
<dd>
<p>Se voc&ecirc; clicar em Relat&oacute;rio da JVM, ser&aacute; aberta uma janela separada que exibe relat&oacute;rios sobre a Java Virtual Machine, incluindo um relat&oacute;rio de resumo, um relat&oacute;rio de gerenciamento de mem&oacute;ria e de coleta de erros,um relat&oacute;rio de carregamento de classe e um dump de threads atuais.</p>
</dd>
<dt>N&oacute;</dt>
<dd>
<p>O nome do n&oacute; no qual a inst&acirc;ncia reside. Clicar no nome abre a p&aacute;gina <a href="ref-nodeedit.html">Editar N&oacute;</a> para o n&oacute;.</p>
</dd>
<dt>Configura&ccedil;&atilde;o</dt>
<dd>
<p>A configura&ccedil;&atilde;o &agrave; qual a inst&acirc;ncia faz refer&ecirc;ncia. Ao clicar na configura&ccedil;&atilde;o, a p&aacute;gina <a href="../../../common/en/help/ref-configuration.html">Configura&ccedil;&otilde;es</a> da inst&acirc;ncia se abre.</p>
</dd>
<dt>Portas HTTP</dt>
<dd>
<p>Uma lista separada por v&iacute;rgulas dos n&uacute;meros das portas na qual a inst&acirc;ncia faz listening dos seguintes tipos de solicita&ccedil;&otilde;es:</p>
<ul>
<li>
<p>Solicita&ccedil;&otilde;es de administra&ccedil;&atilde;o</p>
</li>
<li>
<p>Solicita&ccedil;&otilde;es HTTP</p>
</li>
<li>
<p>Solicita&ccedil;&otilde;es HTTPS</p>
</li>
</ul>
<p>Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Portas IIOP</dt>
<dd>
<p>Uma lista separada por v&iacute;rgulas dos n&uacute;meros das portas que a inst&acirc;ncia utiliza nos seguintes tipos de conex&otilde;es:</p>
<ul>
<li>
<p>Conex&atilde;o IIOP segura</p>
</li>
<li>
<p>Conex&otilde;es IIOP seguras com autentica&ccedil;&atilde;o do cliente</p>
</li>
<li>
<p>Conex&otilde;es IIOP</p>
</li>
</ul>
<p>Este campo &eacute; somente para leitura.</p>
</dd>
</dl>
<a id="sthref278" name="sthref278"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-start-clustered-instances.html">Para Iniciar Inst&acirc;ncias do GlassFish Server Clusterizadas</a></p>
</li>
<li>
<p><a href="task-stop-clustered-instances.html">Para Interromper Inst&acirc;ncias do GlassFish Server Clusterizadas</a></p>
</li>
<li>
<p><a href="task-view-logs-clustered-instance.html">Para Exibir Arquivos de Log de uma Inst&acirc;ncia Clusterizada do GlassFish Server</a></p>
</li>
<li>
<p><a href="task-recovertransactions.html">Para Recuperar Transa&ccedil;&otilde;es de uma Inst&acirc;ncia de GlassFish Server Clusterizada</a></p>
</li>
</ul>
<a id="sthref279" name="sthref279"></a>
<h5>Subcomandos asadmin Equivalentes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00138"><code>generate-jvm-report</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00219"><code>restart-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00236"><code>start-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00241"><code>stop-instance</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
