<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clustergeneral" name="ref-clustergeneral"></a><a id="GHCLU00003" name="GHCLU00003"></a></p>

<h4><a id="sthref251" name="sthref251"></a><a id="sthref252" name="sthref252"></a><a id="sthref253" name="sthref253"></a><a id="sthref254" name="sthref254"></a>Informa&ccedil;&otilde;es Gerais</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>A p&aacute;gina Informa&ccedil;&otilde;es Gerais cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Iniciar Cluster</dt>
<dd>
<p>Bot&atilde;o para iniciar o cluster. Se todas as inst&acirc;ncias do cluster estiverem em execu&ccedil;&atilde;o, este bot&atilde;o est&aacute; desativado.</p>
</dd>
<dt>Interromper Cluster</dt>
<dd>
<p>Bot&atilde;o para interromper o cluster. Se todas as inst&acirc;ncias do cluster estiverem interrompidas, este bot&atilde;o est&aacute; desativado.</p>
</dd>
<dt>Migrar Timers EJB</dt>
<dd>
<p>Bot&atilde;o para migrar os timers da tecnologia Enterprise JavaBeans (EJB) de uma inst&acirc;ncia interrompida do GlassFish Server para uma inst&acirc;ncia em execu&ccedil;&atilde;o no cluster. Clicar neste bot&atilde;o abre a p&aacute;gina <a href="ref-migrateejbtimers.html">Migrar Timers EJB</a>. Se todas as inst&acirc;ncias do cluster estiverem em execu&ccedil;&atilde;o, este bot&atilde;o est&aacute; desativado.</p>
</dd>
<dt>Rotacionar Log</dt>
<dd>
<p>Bot&atilde;o para rotacionar arquivo log no cluster. Quando o arquivo de log for rotacionado, ele ser&aacute; renomeado com um nome do timestamp no formato <code>server.log_</code><i>date-and-time</i> e um arquivo de log vazio ser&aacute; criado para novas mensagens de log. As altera&ccedil;&otilde;es ser&atilde;o aplicadas dinamicamente. N&atilde;o &eacute; necess&aacute;rio reiniciar o servidor.</p>
</dd>
<dt>Nome do Cluster</dt>
<dd>
<p>Nome designado ao cluster quando o cluster &eacute; criado. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>JVM</dt>
<dd>
<p>Se voc&ecirc; clicar em Relat&oacute;rio da JVM, ser&aacute; aberta uma janela separada que exibe relat&oacute;rios sobre a Java Virtual Machine, incluindo um relat&oacute;rio de resumo, um relat&oacute;rio de gerenciamento de mem&oacute;ria e de coleta de erros,um relat&oacute;rio de carregamento de classe e um dump de threads atuais.</p>
</dd>
<dt>Configura&ccedil;&atilde;o</dt>
<dd>
<p>A configura&ccedil;&atilde;o selecionada para o cluster no momento em que ele foi criado. Clicar na configura&ccedil;&atilde;o abre a p&aacute;gina <a href="../../../common/en/help/ref-configuration.html">Configura&ccedil;&otilde;es</a> do cluster. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>GMS</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o estiver ativada, o GMS (Servi&ccedil;o de Gerenciamento de Grupos) ser&aacute; iniciado em cada inst&acirc;ncia do GlassFish Server do cluster e do DAS (Servidor de Administra&ccedil;&atilde;o de Dom&iacute;nios). O DAS participa de cada cluster no qual o GMS estiver ativado. O GMS oferece monitoramento de cluster, associa&ccedil;&atilde;o de cluster e servi&ccedil;os de comunica&ccedil;&atilde;o do grupo. Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</dd>
<dt>Porta Multicast</dt>
<dd>
<p>N&uacute;mero da porta de comunica&ccedil;&atilde;o na qual o GMS faz listening dos eventos do grupo. Esta op&ccedil;&atilde;o dever&aacute; especificar um n&uacute;mero v&aacute;lido de porta na faixa entre 2048-49151. O default &eacute; um valor gerado automaticamente dentro dessa faixa.</p>
</dd>
<dt>Endere&ccedil;o Multicast</dt>
<dd>
<p>Endere&ccedil;o no qual o GMS faz listening dos eventos do grupo. Esta op&ccedil;&atilde;o deve especificar um endere&ccedil;o multicast na faixa de 224.0.0.0 a 239.255.255.255. O default &eacute; 228.9.<i>XX</i>. <i>YY</i>, em que <i>XX</i> e <i>YY</i> s&atilde;o valores standalone gerados automaticamente entre 0 e 255.</p>
</dd>
<dt>Endere&ccedil;o da Interface de Bind</dt>
<dd>
<p>Endere&ccedil;o do Protocolo de Internet (IP) da interface de rede ao qual o GMS se vincula. Esta op&ccedil;&atilde;o deve especificar o endere&ccedil;o IP de uma interface de rede local. O default corresponde a todos os endere&ccedil;os p&uacute;blicos de interface de rede.</p>
<p>Em uma m&aacute;quina com v&aacute;rios endere&ccedil;os (multihome), esta op&ccedil;&atilde;o configura a interface de rede usada para o GMS. A m&aacute;quina com v&aacute;rios endere&ccedil;os (multihome) possui duas ou mais interfaces de rede.</p>
<p>Para especificar um endere&ccedil;o que seja v&aacute;lido para todas as inst&acirc;ncias do GlassFish Server do cluster, utilize uma propriedade do sistema para definir o endere&ccedil;o de forma individual de cada inst&acirc;ncia.</p>
<p>Por exemplo, use a p&aacute;gina <a href="ref-clustersystemproperties.html">Propriedades de Sistema do Cluster</a> para criar a propriedade do sistema <code>GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i>. Em seguida, defina a op&ccedil;&atilde;o Endere&ccedil;o de Bind nesta p&aacute;gina para <code>${GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i><code>}</code> para especificar a propriedade do sistema. Por fim, para cada inst&acirc;ncia no cluster, defina a propriedade do sistema <code>GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i> para o endere&ccedil;o da interface de rede solicitada na m&aacute;quina da inst&acirc;ncia.</p>
</dd>
<dt>Status</dt>
<dd>
<p>Indica&ccedil;&atilde;o do n&uacute;mero de inst&acirc;ncias do cluster que est&atilde;o e n&atilde;o est&atilde;o em execu&ccedil;&atilde;o. Este campo &eacute; somente para leitura.</p>
</dd>
</dl>
<a id="sthref255" name="sthref255"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-gmscluster.html">Para Configurar as Defini&ccedil;&otilde;es do Servi&ccedil;o de Gerenciamento de Grupos de um Cluster</a></p>
</li>
<li>
<p><a href="task-migrate-ejb-timers.html">Para Migrar Timers EJB</a></p>
</li>
</ul>
<a id="sthref256" name="sthref256"></a>
<h5>Subcomandos asadmin Equivalentes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00138"><code>generate-jvm-report</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00211"><code>migrate-timers</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00224"><code>rotate-log</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
