<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterinstanceconfigproperties" name="ref-clusterinstanceconfigproperties"></a><a id="GHCLU00010" name="GHCLU00010"></a></p>

<h4><a id="sthref283" name="sthref283"></a><a id="sthref284" name="sthref284"></a><a id="sthref285" name="sthref285"></a>Propriedades de Sistema da Inst&acirc;ncia</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>A p&aacute;gina Propriedades de Sistema da Inst&acirc;ncia exibe uma lista das propriedades do sistema Java que est&atilde;o definidas para a inst&acirc;ncia atual do GlassFish Server. As propriedades do sistema Java s&atilde;o especificadas para o acionador da aplica&ccedil;&atilde;o Java por meio da op&ccedil;&atilde;o <code>-D</code> do acionador da aplica&ccedil;&atilde;o Java quando GlassFish Server for iniciado.</p>
<p>Essas propriedades substituem as defini&ccedil;&otilde;es de propriedade para defini&ccedil;&otilde;es de porta na configura&ccedil;&atilde;o da inst&acirc;ncia. As defini&ccedil;&otilde;es de porta predefinidas dever&atilde;o ser substitu&iacute;das se, por exemplo, duas inst&acirc;ncias clusterizadas residirem no mesmo host. Nessa situa&ccedil;&atilde;o, as defini&ccedil;&otilde;es de porta para uma inst&acirc;ncia devem ser substitu&iacute;das porque ambas as inst&acirc;ncias compartilham a mesma configura&ccedil;&atilde;o.</p>
<p>Para obter informa&ccedil;&otilde;es sobre as defini&ccedil;&otilde;es de porta predefinidas, consulte <a href="../../../common/en/help/ref-predefinedconfigsysproperties.html">Predefined Configuration System Properties</a>.</p>
<p>O campo Nome da Inst&acirc;ncia &eacute; um campo somente para leitura que exibe o nome da inst&acirc;ncia atual.</p>
<p>S&atilde;o exibidas as seguintes informa&ccedil;&otilde;es para cada propriedade:</p>
<dl>
<dt>Nome da Vari&aacute;vel da Inst&acirc;ncia</dt>
<dd>
<p>O nome da propriedade do sistema.</p>
</dd>
<dt>Valor Atual</dt>
<dd>
<p>Valor atualmente definido para a propriedade. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Valor Substituto</dt>
<dd>
<p>O valor com o qual a propriedade ser&aacute; definida depois que as altera&ccedil;&otilde;es forem salvas.</p>
</dd>
</dl>
<p>A tabela Propriedades Adicionais tamb&eacute;m cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Adicionar Propriedade</dt>
<dd>
<p>Bot&atilde;o para adicionar uma propriedade. Clicar neste bot&atilde;o adiciona uma linha &agrave; tabela Propriedades Adicionais.</p>
</dd>
<dt>Deletar Propriedades</dt>
<dd>
<p>Bot&atilde;o para deletar uma ou mais propriedades selecionadas. Qualquer propriedade deletada retorna ao seu valor default ou, se nenhum valor tiver sido definido, fica com valor indefinido.</p>
</dd>
</dl>
<a id="sthref286" name="sthref286"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-change-clustered-instance-ports.html">Para Modificar os N&uacute;meros de Porta de uma Inst&acirc;ncia do GlassFish Server Clusterizada</a></p>
</li>
<li>
<p><a href="task-config-sys-properties-defaults.html">Para Definir os Valores Default para Configura&ccedil;&atilde;o das Propriedades do Sistema</a></p>
</li>
</ul>
<a id="sthref287" name="sthref287"></a>
<h5>Subcomandos asadmin Equivalentes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00059"><code>create-system-properties</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00110"><code>delete-system-property</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00203"><code>list-system-properties</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
