<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterinstanceproperties" name="ref-clusterinstanceproperties"></a></p>

<h4><a id="sthref288" name="sthref288"></a><a id="sthref289" name="sthref289"></a><a id="sthref290" name="sthref290"></a>Propriedades da Inst&acirc;ncia</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>A p&aacute;gina Propriedades exibe uma lista de propriedades que s&atilde;o definidas para a inst&acirc;ncia GlassFish Server atual. Estas propriedades acrescentam informa&ccedil;&otilde;es opcionais de configura&ccedil;&atilde;o sobre a inst&acirc;ncia.</p>
<p>O campo Nome da Inst&acirc;ncia &eacute; um campo somente para leitura que exibe o nome da inst&acirc;ncia atual.</p>
<p>S&atilde;o exibidas as seguintes informa&ccedil;&otilde;es para cada propriedade:</p>
<dl>
<dt>Nome</dt>
<dd>
<p>O nome da propriedade.</p>
</dd>
<dt>Valor</dt>
<dd>
<p>Valor da propriedade definida para a inst&acirc;ncia selecionada.</p>
</dd>
<dt>Descri&ccedil;&atilde;o</dt>
<dd>
<p>Uma descri&ccedil;&atilde;o textual que fornece mais informa&ccedil;&otilde;es sobre a propriedade.</p>
</dd>
</dl>
<p>A tabela Propriedades Adicionais tamb&eacute;m cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Adicionar Propriedade</dt>
<dd>
<p>Bot&atilde;o para adicionar uma propriedade. Clicar neste bot&atilde;o adiciona uma linha &agrave; tabela Propriedades Adicionais.</p>
</dd>
<dt>Deletar Propriedades</dt>
<dd>
<p>Bot&atilde;o para deletar uma ou mais propriedades selecionadas. Qualquer propriedade deletada retorna ao seu valor default ou, se nenhum valor tiver sido definido, fica com valor indefinido.</p>
</dd>
</dl>
<p>O GlassFish Server define as seguintes propriedades da inst&acirc;ncia:</p>
<dl>
<dt><code>rendezvousOccurred</code></dt>
<dd>
<p>Especifica se a inst&acirc;ncia contatou o servidor de administra&ccedil;&atilde;o de dom&iacute;nios (DAS). Os valores poss&iacute;veis s&atilde;o os seguintes:</p>
<dl>
<dt><code>true</code></dt>
<dd>
<p>A inst&acirc;ncia contatou o DAS.</p>
</dd>
<dt><code>false</code></dt>
<dd>
<p>A inst&acirc;ncia <i>n&atilde;o</i> contatou o DAS.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref291" name="sthref291"></a>
<h5>Tarefas Relacionadas</h5>
<p><a href="task-set-props-clustered-instance.html">Para Definir Propriedades S&oacute; da Inst&acirc;ncia de uma Inst&acirc;ncia do GlassFish Server Clusterizada</a></p>
<a id="sthref292" name="sthref292"></a>
<h5>Subcomandos asadmin Equivalentes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00139"><code>get</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00145"><code>list</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00226"><code>set</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
