<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusternew" name="ref-clusternew"></a></p>

<h4><a id="sthref247" name="sthref247"></a><a id="sthref248" name="sthref248"></a>Novo Cluster</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Novo Cluster para criar um cluster.</p>
<p>A p&aacute;gina Novo Cluster cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Nome do Cluster</dt>
<dd>
<p>O nome do cluster.</p>
<p>O nome deve atender aos seguintes requisitos:</p>
<ul>
<li>
<p>O nome s&oacute; pode conter caracteres ASCII.</p>
</li>
<li>
<p>O nome deve come&ccedil;ar com uma letra, um n&uacute;mero ou um sublinhado.</p>
</li>
<li>
<p>O nome pode conter s&oacute; os seguintes caracteres:</p>
<ul>
<li>
<p>Letras min&uacute;sculas</p>
</li>
<li>
<p>Letras mai&uacute;sculas</p>
</li>
<li>
<p>N&uacute;meros</p>
</li>
<li>
<p>H&iacute;fen</p>
</li>
<li>
<p>Ponto</p>
</li>
<li>
<p>Sublinhado</p>
</li>
</ul>
</li>
<li>
<p>O nome deve ser &uacute;nico no dom&iacute;nio e n&atilde;o deve ser o nome de outro cluster, uma configura&ccedil;&atilde;o nomeada, uma inst&acirc;ncia do GlassFish Server ou um n&oacute;.</p>
</li>
<li>
<p>O nome n&atilde;o deve ser <code>domain</code>, <code>server</code>, nem nenhuma outra palavra-chave que esteja reservada pelo GlassFish Server.</p>
</li>
</ul>
</dd>
<dt>Configura&ccedil;&atilde;o</dt>
<dd>
<p>Lista drop-down das configura&ccedil;&otilde;es nomeadas existentes que o cluster pode utilizar. Um cluster precisa de uma configura&ccedil;&atilde;o nomeada que defina a configura&ccedil;&atilde;o de todas as inst&acirc;ncias adicionadas ao cluster. &Eacute; necess&aacute;rio selecionar uma configura&ccedil;&atilde;o na lista. O cluster utilizar&aacute; a configura&ccedil;&atilde;o selecionada quando o cluster for criado.</p>
</dd>
<dt>Criar uma C&oacute;pia da Configura&ccedil;&atilde;o Selecionada</dt>
<dd>
<p>Se essa op&ccedil;&atilde;o for selecionada, a configura&ccedil;&atilde;o selecionada ser&aacute; copiada quando o cluster for criado. Foi designado &agrave; c&oacute;pia da configura&ccedil;&atilde;o o nome <i>cluster-name</i><code>-config</code>, em que <i>cluster-name</i> &eacute; o nome do cluster digitado no campo Nome do Cluster.</p>
<p>Se <code>default-config</code> estiver selecionado na lista drop-down Configura&ccedil;&atilde;o, &eacute; necess&aacute;rio selecionar esta op&ccedil;&atilde;o. A configura&ccedil;&atilde;o <code>default-config</code> pode ser apenas copiada, n&atilde;o referenciada.</p>
</dd>
<dt>Referenciar a Configura&ccedil;&atilde;o Selecionada</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o for selecionada, o cluster utilizar&aacute; a configura&ccedil;&atilde;o nomeada existente especificada.</p>
<p>Se <code>default-config</code> estiver selecionado na lista drop-down Configura&ccedil;&atilde;o, esta op&ccedil;&atilde;o <i>n&atilde;o</i> deve ser selecionada. A configura&ccedil;&atilde;o <code>default-config</code> n&atilde;o pode ser referenciada, somente copiada.</p>
</dd>
<dt>Tipo de Configura&ccedil;&atilde;o do Cluster do Message Queue</dt>
<dd>
<p>Use esta op&ccedil;&atilde;o para especificar o tipo de cluster do broker do Message Queue a ser usado para o novo cluster do GlassFish Server. Por default, GlassFish Server usa um cluster do broker do Message Queue convencional com um broker mestre, com um broker incorporado em cada uma das inst&acirc;ncias no cluster do GlassFish Server.</p>
<p>Se esta op&ccedil;&atilde;o estiver definida como Personalizado, v&aacute;rias op&ccedil;&otilde;es adicionais s&atilde;o exibidas para configurar o cluster do broker do &amp;cnMessageQueue para usar o cluster do GlassFish Server. Consulte <a href="#CHDJFEJB">Op&ccedil;&otilde;es para Clusters do Broker Personalizados do Message Queue</a>.</p>
</dd>
<dt>Inst&acirc;ncias do Servidor a Serem Criadas</dt>
<dd>
<p>Uma lista das inst&acirc;ncias do GlassFish Server que ser&atilde;o criadas quando o cluster for criado. Para cada inst&acirc;ncia, as informa&ccedil;&otilde;es a seguir s&atilde;o fornecidas:</p>
<dl>
<dt>Nome da Inst&acirc;ncia</dt>
<dd>
<p>O nome da inst&acirc;ncia.</p>
</dd>
<dt>Peso</dt>
<dd>
<p>Um inteiro que representa o peso do balanceamento de carga da inst&acirc;ncia.</p>
<p>O peso do balanceamento de carga determina a propor&ccedil;&atilde;o de todas as solicita&ccedil;&otilde;es do cluster que a inst&acirc;ncia deve processar.</p>
<p>Por exemplo, em um cluster com duas inst&acirc;ncias, &eacute; poss&iacute;vel processar uma das quatro solicita&ccedil;&otilde;es em uma inst&acirc;ncia e processar tr&ecirc;s das quatro solicita&ccedil;&otilde;es na outra inst&acirc;ncia. Nesta situa&ccedil;&atilde;o, defina como 1 o peso da inst&acirc;ncia que processa uma das quatro solicita&ccedil;&otilde;es e como 3 o peso da outra inst&acirc;ncia. Se preferir utilizar porcentagem, defina os pesos das inst&acirc;ncias como 25 e 75, respectivamente.</p>
<p>O valor default &eacute; 100.</p>
</dd>
<dt>N&oacute;</dt>
<dd>
<p>Lista drop-down dos n&oacute;s existentes nos quais a inst&acirc;ncia pode estar. &Eacute; necess&aacute;rio selecionar um n&oacute; na lista. A inst&acirc;ncia residir&aacute; no n&oacute; selecionado quando o cluster for criado.</p>
</dd>
</dl>
<p>As Inst&acirc;ncias do Servidor a serem Criadas tamb&eacute;m cont&ecirc;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Novo</dt>
<dd>
<p>Bot&atilde;o para criar uma inst&acirc;ncia. Se clicar neste bot&atilde;o, uma linha &eacute; adicionada &agrave; tabela Inst&acirc;ncias do Servidor a serem Criadas.</p>
</dd>
<dt>Deletar</dt>
<dd>
<p>Bot&atilde;o para deletar uma inst&acirc;ncia.</p>
</dd>
</dl>
</dd>
</dl>
<a id="CHDJFEJB" name="CHDJFEJB"></a>
<h5>Op&ccedil;&otilde;es para Clusters do Broker Personalizados do Message Queue</h5>
<p>Quando o Tipo de Configura&ccedil;&atilde;o do Cluster do Message Queue for definido como Personalizado, as seguintes op&ccedil;&otilde;es ser&atilde;o exibidas para configurar o cluster do broker do Message Queue para usar o cluster do GlassFish Server.</p>
<dl>
<dt>Tipo de Servi&ccedil;o JMS</dt>
<dd>
<p>Os tipos de brokers (chamados hosts JMS no GlassFish Server) a serem usados no cluster do broker. O tipo escolhido determina quais tipos de clusters do broker est&atilde;o dispon&iacute;veis. Os tipos de broker s&atilde;o os seguintes:</p>
<dl>
<dt>Incorporado</dt>
<dd>
<p>A configura&ccedil;&atilde;o e o ciclo de vida do broker s&atilde;o gerenciados pelo GlassFish Server. Cada inst&acirc;ncia clusterizada do GlassFish &eacute; atendida por um broker executado na mesma JVM da inst&acirc;ncia.</p>
<p>Se a op&ccedil;&atilde;o Tipo de Servi&ccedil;o JMS for definida como Incorporado, apenas clusters do broker convencionais do Message Queue ser&atilde;o suportados. As op&ccedil;&otilde;es para configura&ccedil;&atilde;o do cluster convencional s&atilde;o exibidas.</p>
</dd>
<dt>Local</dt>
<dd>
<p>A configura&ccedil;&atilde;o e o ciclo de vida do broker s&atilde;o gerenciados pelo GlassFish Server. Cada inst&acirc;ncia clusterizada do GlassFish &eacute; atendida por um broker executado em uma JVM separada no mesmo host da inst&acirc;ncia.</p>
<p>Se a op&ccedil;&atilde;o Tipo de Servi&ccedil;o JMS estiver definida como Local, os clusters do broker convencional e aprimorado (altamente dispon&iacute;vel) do Message Queue ser&atilde;o suportados. As op&ccedil;&otilde;es para sele&ccedil;&atilde;o do tipo de cluster e configura&ccedil;&atilde;o do cluster s&atilde;o exibidas.</p>
</dd>
<dt>Remoto</dt>
<dd>
<p>O configura&ccedil;&atilde;o e o ciclo de vida do broker e do cluster do broker s&atilde;o gerenciados usando as ferramentas administrativas do Message Queue.</p>
<p>Se a op&ccedil;&atilde;o Tipo de Servi&ccedil;o JMS estiver definida como Remoto, nenhuma outra op&ccedil;&atilde;o ser&aacute; exibida.</p>
</dd>
</dl>
</dd>
<dt>Tipo de Cluster JMS</dt>
<dd>
<p>O tipo de cluster do broker do Message Queue a ser usado para o cluster do GlassFish Server.</p>
<p>Se a op&ccedil;&atilde;o Tipo de Cluster JMS estiver definida como Convencional, as seguintes op&ccedil;&otilde;es ser&atilde;o exibidas.</p>
<dl>
<dt>Tipo de Armazenamento da Configura&ccedil;&atilde;o JMS</dt>
<dd>
<p>O tipo de armazenamento de dados a ser usado para os dados de configura&ccedil;&atilde;o do cluster convencional. Se esta op&ccedil;&atilde;o estiver definida como Broker Mestre, um broker no cluster ser&aacute; designado como broker mestre e os dados de configura&ccedil;&atilde;o ser&atilde;o armazenados por ele. Se esta op&ccedil;&atilde;o estiver definida como Banco de Dados Compartilhado, os dados de configura&ccedil;&atilde;o ser&atilde;o armazenados em um armazenamento de dados JDBC acess&iacute;vel a todos os brokers. Neste caso, as op&ccedil;&otilde;es relacionadas ao banco de dados ser&atilde;o exibidas.</p>
</dd>
<dt>Tipo de Armazenamento da Mensagem JMS</dt>
<dd>
<p>O tipo de armazenamento de dados que cada broker usar&aacute; para armazenar seus dados de mensagem. Se esta op&ccedil;&atilde;o estiver definida como Arquivar, cada broker armazenar&aacute; seus dados de mensagens em um armazenamento de dados baseado em arquivo. Se esta op&ccedil;&atilde;o estiver definida como JDBC, cada broker armazenar&aacute; seus dados de mensagens em um armazenamento de dados JDBC.</p>
</dd>
</dl>
<p>Se a op&ccedil;&atilde;o Tipo de Cluster JMS estiver definida como Aprimorado (Altamente Dispon&iacute;vel), ser&atilde;o exibidas as op&ccedil;&otilde;es relacionadas ao banco de dados.</p>
</dd>
<dt>Fornecedor do Banco de Dados</dt>
<dt>URL do Banco de Dados</dt>
<dt>Usu&aacute;rio do Banco de Dados</dt>
<dd>
<p>O fornecedor do banco de dados, URL de acesso e o banco de dados JDBC a ser usado em qualquer uma destas situa&ccedil;&otilde;es:</p>
<ul>
<li>
<p>Quando o tipo de armazenamento da configura&ccedil;&atilde;o de um cluster convencional estiver definido como Banco de Dados Compartilhado</p>
</li>
<li>
<p>Quando o tipo de armazenamento de mensagens de um cluster convencional estiver definido como JDBC</p>
</li>
<li>
<p>Quando o tipo de cluster estiver definido como Aprimorado (Altamente Dispon&iacute;vel)</p>
</li>
</ul>
<p>Para obter informa&ccedil;&otilde;es sobre os fornecedores suportados e os formatos de URLs de acesso para cada fornecedor, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GMADG00244">PJDBC-Based Persistence</a> em <i>Oracle GlassFish Server Message Queue Administration Guide</i>.</p>
</dd>
<dt>Autentica&ccedil;&atilde;o do Banco de Dados</dt>
<dt>Senha do Banco de Dados</dt>
<dt>Alias da Senha</dt>
<dd>
<p>As informa&ccedil;&otilde;es da senha para o usu&aacute;rio do banco de dados JDBC especificado em Usu&aacute;rio do Banco de Dados.</p>
<p>Se Autentica&ccedil;&atilde;o do Banco de Dados estiver definida como Senha, a op&ccedil;&atilde;o Senha do Banco de Dados ser&aacute; exibida. Se Autentica&ccedil;&atilde;o do Banco de Dados estiver definida como Alias da Senha, a op&ccedil;&atilde;o Alias da Senha ser&aacute; exibida.</p>
</dd>
<dt>Propriedades do Cluster JMS</dt>
<dd>
<p>Uma lista de uma ou mais propriedades do broker do Message Queue para configurar o brokers. A lista &eacute; separada por dois-pontos (<code>:</code>) e tem o formato:</p>
<pre>
<i>prop1Name</i>=<i>prop1Value</i>:<i>prop2Name</i>=<i>prop2Value</i>:...
</pre>
<p>Se uma propriedade do broker incluir pontos, insira duas barras invertidas antes dos pontos (<code>\\</code>); for exemplo, para incluir a propriedade <code>imq.system.max_count</code>, especifique <code>imq\\.system\\.max_count</code> na lista.</p>
</dd>
</dl>
<a id="sthref249" name="sthref249"></a>
<h5>Tarefas Relacionadas</h5>
<p><a href="task-create-cluster.html">Para Criar um Cluster</a></p>
<a id="sthref250" name="sthref250"></a>
<h5>Subcomando asadmin Equivalente</h5>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00017"><code>create-cluster</code>(1)</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
