<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-nodeedit" name="ref-nodeedit"></a></p>

<h4><a id="sthref313" name="sthref313"></a>Editar N&oacute;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilize a p&aacute;gina Editar n&oacute; para atualizar os dados de configura&ccedil;&atilde;o de um n&oacute; do GlassFish Server. Voc&ecirc; tamb&eacute;m poder&aacute; usar essa p&aacute;gina para alterar o tipo de um n&oacute; de CONFIG para DCOM ou SSH para ativar comunica&ccedil;&atilde;o remota para o n&oacute;.</p>
<p>Se voc&ecirc; alterar o tipo de n&oacute; de CONFIG para DCOM, os valores default ser&atilde;o aplicados se qualquer um dos campos a seguir ficarem vazios:</p>
<ul>
<li>
<p>Dom&iacute;nio do Windows</p>
</li>
<li>
<p>Usu&aacute;rio do Windows</p>
</li>
</ul>
<p>Se o tipo de n&oacute; for alterado de CONFIG para SSH , os valores default ser&atilde;o aplicados se nenhum dos campos a seguir for deixado em branco:</p>
<ul>
<li>
<p>Porta SSH</p>
</li>
<li>
<p>Nome de Usu&aacute;rio</p>
</li>
<li>
<p>Arquivo de Chave</p>
</li>
</ul>
<p>As op&ccedil;&otilde;es que a p&aacute;gina Editar N&oacute; cont&ecirc;m dependem do tipo de n&oacute;.</p>
<a id="sthref314" name="sthref314"></a>
<h5>Op&ccedil;&otilde;es para Todos os Tipos de N&oacute;s</h5>
<p>As op&ccedil;&otilde;es a seguir est&atilde;o dispon&iacute;veis para todos os tipos de n&oacute;s:</p>
<dl>
<dt>Nome</dt>
<dd>
<p>Nome designado ao n&oacute; quando o n&oacute; foi criado. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Tipo</dt>
<dd>
<p>Lista drop-down para especificar o tipo do n&oacute;, que &eacute; dos seguintes tipos:</p>
<dl>
<dt>CONFIG</dt>
<dd>
<p>O n&oacute; n&atilde;o oferece suporte &agrave; comunica&ccedil;&atilde;o remota. Se CONFIG for selecionado, nenhuma op&ccedil;&atilde;o de configura&ccedil;&atilde;o de DCOM ou SSH ser&aacute; exibida. Se o tipo atual de n&oacute; for SSH e voc&ecirc; selecionar CONFIG, DCOM ou SSH, os dados de configura&ccedil;&atilde;o ser&atilde;o removidos da configura&ccedil;&atilde;o do n&oacute; ao salvar as altera&ccedil;&otilde;es.</p>
</dd>
<dt>DCOM</dt>
<dd>
<p>O n&oacute; suporta comunica&ccedil;&atilde;o pelo protocolo remoto do DCOM (Distributed Component Object Model). O protocolo DCOM est&aacute; dispon&iacute;vel somente nos sistemas do Windows.</p>
</dd>
<dt>SSH</dt>
<dd>
<p>O n&oacute; oferece suporte a comunica&ccedil;&otilde;es com shell seguro (SSH).</p>
</dd>
</dl>
</dd>
<dt>Host do N&oacute;</dt>
<dd>
<p>Nome do host que o n&oacute; representar&aacute; depois que o n&oacute; for atualizado. Se este campo &eacute; obrigat&oacute;rio ou n&atilde;o, depende do tipo de n&oacute;:</p>
<ul>
<li>
<p>Se o tipo de n&oacute; for CONFIG, o nome do host pode ser omitido. O nome do host pode ser determinado quando as inst&acirc;ncias que residem no n&oacute; forem criadas.</p>
</li>
<li>
<p>Se o tipo de n&oacute; for DCOM ou SSH, o nome do host dever&aacute; ser especificado. Caso contr&aacute;rio, ocorre um erro.</p>
</li>
</ul>
</dd>
<dt>Diret&oacute;rio do N&oacute;</dt>
<dd>
<p>O caminho para o diret&oacute;rio que cont&eacute;m as inst&acirc;ncias GlassFish Server que s&atilde;o criadas no n&oacute;. Se um caminho relativo for especificado, o caminho &eacute; relativo ao diret&oacute;rio as-install, no qual as-install corresponde ao diret&oacute;rio de instala&ccedil;&atilde;o de base do software GlassFish Server no host.</p>
<p>Se este campo for deixado em branco, a configura&ccedil;&atilde;o do n&oacute; ser&aacute; atualizada da seguinte forma:</p>
<ul>
<li>
<p>Se o tipo do n&oacute; for CONFIG, nenhum diret&oacute;rio das inst&acirc;ncias &eacute; especificado para o n&oacute; na configura&ccedil;&atilde;o do servidor de administra&ccedil;&atilde;o de dom&iacute;nios (DAS). O diret&oacute;rio do n&oacute; pode ser determinado quando as inst&acirc;ncias que residem no n&oacute; forem criadas.</p>
</li>
<li>
<p>Se o tipo do n&oacute; for DCOM, o default &eacute; as-install<code>\nodes</code> em que as-install &eacute; o diret&oacute;rio base de instala&ccedil;&atilde;o do software GlassFish Server no host.</p>
</li>
<li>
<p>Se o tipo do n&oacute; for SSH, o diret&oacute;rio do n&oacute; ser&aacute; as-install<code>/nodes</code>, no qual as-install &eacute; o diret&oacute;rio de instala&ccedil;&atilde;o de base do software GlassFish Server no host.</p>
</li>
</ul>
</dd>
<dt>Diret&oacute;rio de Instala&ccedil;&atilde;o</dt>
<dd>
<p>O caminho completo do <i>pai</i> no diret&oacute;rio de instala&ccedil;&atilde;o base do software GlassFish Server no host, por exemplo, <code>/export/glassfish3/</code>.</p>
<p>Se este campo for deixado em branco, a configura&ccedil;&atilde;o do n&oacute; ser&aacute; atualizada da seguinte forma:</p>
<ul>
<li>
<p>Se o tipo do n&oacute; for CONFIG, nenhum diret&oacute;rio de instala&ccedil;&atilde;o &eacute; especificado para o n&oacute; na configura&ccedil;&atilde;o do DAS. O diret&oacute;rio de instala&ccedil;&atilde;o pode ser determinado quando as inst&acirc;ncias que residem no n&oacute; forem criadas.</p>
</li>
<li>
<p>Se o tipo de n&oacute; for DCOM ou SSH, o diret&oacute;rio de instala&ccedil;&atilde;o ser&aacute; o pai do diret&oacute;rio de instala&ccedil;&atilde;o base do software GlassFish Server para o DAS. Essa defini&ccedil;&atilde;o &eacute; &uacute;til s&oacute; se o GlassFish Server estiver instalado no mesmo local em todos as m&aacute;quinas.</p>
</li>
</ul>
</dd>
</dl>
<a id="sthref315" name="sthref315"></a>
<h5>Op&ccedil;&otilde;es Adicionais para N&oacute;s de DCOM</h5>
<p>As op&ccedil;&otilde;es a seguir s&oacute; est&atilde;o dispon&iacute;veis se o campo Tipo for definido como DCOM:</p>
<dl>
<dt>For&ccedil;ar</dt>
<dd>
<p>Se a op&ccedil;&atilde;o Ativado estiver selecionada, o n&oacute; &eacute; criado na configura&ccedil;&atilde;o DAS mesmo se a valida&ccedil;&atilde;o dos par&acirc;metros do n&oacute; falhar. Para validar os par&acirc;metros de um n&oacute;, ser&aacute; necess&aacute;rio que o DAS possa entrar com contato com o host por meio de DCOM.</p>
</dd>
<dt>Validar DCOM</dt>
<dd>
<p>Se a op&ccedil;&atilde;o Ativado for selecionada, o GlassFish Server ir&aacute; testar a conex&atilde;o do host do n&oacute; pelo DCOM antes de atualizar o n&oacute;. Como parte do teste, o GlassFish Server copia um script denominado <code>delete_me.bat</code> para o host.</p>
<p>Se voc&ecirc; selecionar essa op&ccedil;&atilde;o, o campo Diret&oacute;rio de Teste Remoto &eacute; ativado para possibilitar o fornecimento do diret&oacute;rio ao qual o GlassFish Server dever&aacute; copiar o script.</p>
</dd>
<dt>Diret&oacute;rio de Teste Remoto</dt>
<dd>
<p>A pasta no host remoto no qual o GlassFish Server dever&aacute; criar o arquivo <code>delete_me.bat</code>. O usu&aacute;rio que a op&ccedil;&atilde;o Nome de Usu&aacute;rio do Windows especifica deve ter acesso para grava&ccedil;&atilde;o a esta pasta. Caso contr&aacute;rio, ocorre um erro. O valor default &eacute; <code>C:\</code>.</p>
</dd>
<dt>Dom&iacute;nio do Windows</dt>
<dd>
<p>O nome do dom&iacute;nio do Wondows que cont&eacute;m o usu&aacute;rio que a op&ccedil;&atilde;o Nome do Usu&aacute;rio do Windows especifica. O valor default &eacute; o nome do host no qual o Console de Administra&ccedil;&atilde;o est&aacute; sendo executado.</p>
</dd>
<dt>Nome de Usu&aacute;rio do Windows</dt>
<dd>
<p>O usu&aacute;rio neste host do n&oacute; que ir&aacute; executar o processo para conectar-se ao host por meio de DCOM. O default &eacute; o usu&aacute;rio que est&aacute; executando o processo DAS. Se a op&ccedil;&atilde;o Host do N&oacute; estiver definida para o dom&iacute;nio <code>localhost-</code><i>,</i> a op&ccedil;&atilde;o Nome do Usu&aacute;rio do Windows ser&aacute; ingorada.</p>
</dd>
<dt>Autentica&ccedil;&atilde;o do Usu&aacute;rio do Windows</dt>
<dd>
<p>Lista drop-down para especificar como o usu&aacute;rio do Windows ser&aacute; autenticado ao efetuar log-in no host desse n&oacute;. Os poss&iacute;veis m&eacute;todos de autentica&ccedil;&atilde;o s&atilde;o os seguintes:</p>
<dl>
<dt>Senha</dt>
<dd>
<p>O usu&aacute;rio do Windows ser&aacute; autenticado por meio de uma senha que &eacute; armazenada na configura&ccedil;&atilde;o DAS.</p>

<hr>
<p><b>Cuidado:</b></p>
Esta senha &eacute; armazenada em forma de texto criptografado na configura&ccedil;&atilde;o do DAS. Para aumentar a seguran&ccedil;a, use um alias de senha.
<hr>

<p>Se voc&ecirc; selecionar esta op&ccedil;&atilde;o, o campo Senha do Usu&aacute;rio do Windows ser&aacute; ativado para possibilitar que voc&ecirc; forne&ccedil;a a senha.</p>
</dd>
<dt>Alias de Senha</dt>
<dd>
<p>O usu&aacute;rio do Windows ser&aacute; autenticado por meio de um alias de senha. Se selecionar esta op&ccedil;&atilde;o, selecione o alias de senha na lista drop-down Alias de senha.</p>
</dd>
</dl>
</dd>
<dt>Senha do Usu&aacute;rio do Windows</dt>
<dd>
<p>A senha que o usu&aacute;rio do Windows ir&aacute; usar ao efetuar log-in nesse host do n&oacute;.</p>
</dd>
<dt>Alias de Senha</dt>
<dd>
<p>Lista drop-down de aliases de senha definidos para este dom&iacute;nio.</p>
</dd>
</dl>
<a id="sthref316" name="sthref316"></a>
<h5>Op&ccedil;&otilde;es Adicionais para N&oacute;s de SSH</h5>
<p>As op&ccedil;&otilde;es a seguir s&oacute; ficam dispon&iacute;veis se o campo Tipo for definido como SSH:</p>
<dl>
<dt>For&ccedil;ar</dt>
<dd>
<p>Se a op&ccedil;&atilde;o Ativo estiver selecionada, o n&oacute; ser&aacute; atualizado na configura&ccedil;&atilde;o do servidor de administra&ccedil;&atilde;o de dom&iacute;nios (DAS) mesmo se a valida&ccedil;&atilde;o dos par&acirc;metros do n&oacute; falhar. Para validar os par&acirc;metros de um n&oacute;, o DAS deve ser capaz de contatar o host do n&oacute; por meio de SSH.</p>
</dd>
<dt>Porta SSH</dt>
<dd>
<p>A porta para utilizar para conex&otilde;es SSH para este host do n&oacute;.</p>
<p>Se o tipo de n&oacute; for alterado de CONFIG para SSH e este campo for deixado vazio, a op&ccedil;&atilde;o Porta SSH ser&aacute; definida como 22.</p>
<p>Se a op&ccedil;&atilde;o Host do N&oacute; estiver definida para o dom&iacute;nio <code>localhost-</code><i>,</i> a op&ccedil;&atilde;o Porta SSH ser&aacute; ignorada.</p>
</dd>
<dt>Nome de Usu&aacute;rio SSH</dt>
<dd>
<p>Usu&aacute;rio deste host do n&oacute; que deve executar o processo para conex&atilde;o com o host atrav&eacute;s de SSH.</p>
<p>Se o tipo de n&oacute; for alterado de CONFIG para SSH e este campo for deixado vazio, a op&ccedil;&atilde;o Nome de Usu&aacute;rio ser&aacute; definida como o usu&aacute;rio que estiver em execu&ccedil;&atilde;o no processo DAS.</p>
<p>Se a op&ccedil;&atilde;o Host do N&oacute; estiver definida para o dom&iacute;nio <code>localhost-</code><i>,</i> a op&ccedil;&atilde;o Usu&aacute;rio SSH ser&aacute; ignorada.</p>
</dd>
<dt>Autentica&ccedil;&atilde;o de Usu&aacute;rio SSH</dt>
<dd>
<p>Lista drop-down para especificar como o usu&aacute;rio SSH &eacute; autenticado ao efetuar log-in neste host do n&oacute;. Os poss&iacute;veis m&eacute;todos de autentica&ccedil;&atilde;o s&atilde;o os seguintes:</p>
<dl>
<dt>Arquivo de Chave</dt>
<dd>
<p>O usu&aacute;rio SSH &eacute; autenticado atrav&eacute;s de um arquivo de chave privada SSH. Se selecionar esta op&ccedil;&atilde;o, especifique um caminho absoluto para o arquivo no campo Arquivo de Chave.</p>
</dd>
<dt>Senha</dt>
<dd>
<p>O usu&aacute;rio SSH &eacute; autenticado atrav&eacute;s de uma senha que &eacute; armazenada na configura&ccedil;&atilde;o do DAS.</p>

<hr>
<p><b>Cuidado:</b></p>
Esta senha &eacute; armazenada em forma de texto criptografado na configura&ccedil;&atilde;o do DAS. Para maior seguran&ccedil;a, utilize um arquivo de chave ou um alias de senha.
<hr>

<p>Se voc&ecirc; selecionar esta op&ccedil;&atilde;o, o campo Senha do Usu&aacute;rio do SSH ser&aacute; ativado para possibilitar que voc&ecirc; forne&ccedil;a a senha.</p>
</dd>
<dt>Alias de Senha</dt>
<dd>
<p>O usu&aacute;rio SSH &eacute; autenticado atrav&eacute;s de um alias de senha. Se selecionar esta op&ccedil;&atilde;o, selecione o alias de senha na lista drop-down Alias de senha.</p>
</dd>
</dl>
</dd>
<dt>Configurar SSH</dt>
<dd>
<p>Se a op&ccedil;&atilde;o Ativado estiver selecionada, GlassFish Server define uma chave de SSH no host do n&oacute;. O GlassFish Server configura a chave de SSH copiando arquivos de chave existentes do host DAS ou, se necess&aacute;rio, gerando os arquivos antes de copi&aacute;-los. Essa op&ccedil;&atilde;o s&oacute; fica dispon&iacute;vel se a op&ccedil;&atilde;o Autentica&ccedil;&atilde;o do Usu&aacute;rio de SSH for definida como Arquivo de Chave.</p>
</dd>
<dt>Gerar Chave</dt>
<dd>
<p>Se a op&ccedil;&atilde;o Ativado for selecionada, GlassFish Server ir&aacute; gerar os arquivos de chave de SSH antes de copiar arquivos para o host do n&oacute;, caso os arquivos n&atilde;o existam. Se os arquivos de chave do SSH existirem, GlassFish Server n&atilde;o ir&aacute; gerar os arquivos, mesmo que a op&ccedil;&atilde;o Ativado esteja selecionada.</p>

<hr>
<p><b>Observa&ccedil;&atilde;o:</b></p>
Se os arquivos de chave do SSH n&atilde;o existirem, a op&ccedil;&atilde;o Ativado dever&aacute; ser selecionada. Caso contr&aacute;rio, ocorrer&aacute; um erro quando voc&ecirc; tentar salvar suas altera&ccedil;&otilde;es.
<hr>

</dd>
<dt>Senha de Usu&aacute;rio SSH</dt>
<dd>
<p>A senha que o usu&aacute;rio SSH utilizar&aacute; ao efetuar log-in neste host do n&oacute;.</p>
</dd>
<dt>Alias de Senha</dt>
<dd>
<p>Lista drop-down de aliases de senha definidos para este dom&iacute;nio.</p>
</dd>
<dt>Arquivo de Chave P&uacute;blica</dt>
<dd>
<p>O caminho absoluto para o arquivo de chave p&uacute;blica de SSH para o usu&aacute;rio que a op&ccedil;&atilde;o Nome de Usu&aacute;rio de SSH especifica. O conte&uacute;do do arquivo de chave p&uacute;blica &eacute; acrescentado ao arquivo <code>.ssh/authorized_keys</code> no host do n&oacute;. Se o arquivo <code>.ssh/authorized_keys</code> n&atilde;o existir no host, o GlassFish Server ir&aacute; cri&aacute;-lo.</p>
</dd>
<dt>Arquivo de Chave</dt>
<dd>
<p>Caminho absoluto para o arquivo da chave privada de SSH para o usu&aacute;rio que a op&ccedil;&atilde;o Nome de Usu&aacute;rio especifica. Este arquivo &eacute; utilizado para autentica&ccedil;&atilde;o do daemon <code>sshd</code> no host do n&oacute;.</p>

<hr>
<p><b>Observa&ccedil;&atilde;o:</b></p>
O GlassFish Server tamb&eacute;m suporta autentica&ccedil;&atilde;o por senha por meio da entrada <code>AS_ADMIN_SSHPASSWORD</code> no arquivo de senhas. O arquivo de senhas &eacute; especificado na op&ccedil;&atilde;o <code>-paswordfile</code>do utilit&aacute;rio <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00263"><code>asadmin</code>(1)</a>.
<hr>

<p>Se o arquivo de chave privada de SSH for protegido por uma frase-senha o arquivo de senhas dever&aacute; conter a entrada <code>AS_ADMIN_SSHKEYPASSPHRASE</code>.</p>
<p>O caminho para o arquivo de chave deve ser acess&iacute;vel pelo DAS e o arquivo de chave poder&aacute; ser lido pelo DAS.</p>
<p>O default depender&aacute; se o tipo do n&oacute; foi alterado de CONFIG para SSH para ativar a comunica&ccedil;&atilde;o SSH do n&oacute;:</p>
<p>Se o tipo de n&oacute; for alterado de CONFIG para SSH e este campo for deixado vazio, a op&ccedil;&atilde;o Arquivo de Chave ser&aacute; definida como um arquivo de chave no diret&oacute;rio <code>.ssh</code> do usu&aacute;rio. Se forem encontrados v&aacute;rios arquivos de chave, o GlassFish Server usa a seguinte ordem de prefer&ecirc;ncia:</p>
<ol>
<li>
<p><code>id_rsa</code></p>
</li>
<li>
<p><code>id_dsa</code></p>
</li>
<li>
<p><code>identity</code></p>
</li>
</ol>
</dd>
</dl>
<a id="sthref317" name="sthref317"></a>
<h5>Tarefas Relacionadas</h5>
<p><a href="task-editnode.html">Para Editar um N&oacute;</a></p>
<a id="sthref318" name="sthref318"></a>
<h5>Subcomandos asadmin Equivalentes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00255"><code>update-node-config</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM789"><code>update-node-dcom</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00256"><code>update-node-ssh</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
