<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-recovertransactions" name="ref-recovertransactions"></a></p>

<h4><a id="sthref280" name="sthref280"></a>Recuperar Transa&ccedil;&otilde;es</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilize a p&aacute;gina Recuperar Transa&ccedil;&otilde;es para recuperar transa&ccedil;&otilde;es de uma inst&acirc;ncia do GlassFish Server.</p>
<p>Se a inst&acirc;ncia estiver em execu&ccedil;&atilde;o, a p&aacute;gina Recuperar Transa&ccedil;&otilde;es cont&eacute;m somente o texto <b>A recupera&ccedil;&atilde;o &eacute; realizada pelo pr&oacute;prio servidor em execu&ccedil;&atilde;o</b> e o bot&atilde;o OK.</p>
<p>Se a inst&acirc;ncia n&atilde;o estiver em execu&ccedil;&atilde;o, a p&aacute;gina Recuperar Transa&ccedil;&otilde;es cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Nome da Inst&acirc;ncia</dt>
<dd>
<p>Nome designado &agrave; inst&acirc;ncia quando a inst&acirc;ncia foi criada. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Servidor de Destino</dt>
<dd>
<p>Outra inst&acirc;ncia que pode recuperar as transa&ccedil;&otilde;es na inst&acirc;ncia atual.</p>
</dd>
<dt>Diret&oacute;rio de Log de Transa&ccedil;&otilde;es</dt>
<dd>
<p>Diret&oacute;rio no qual os logs de transa&ccedil;&atilde;o s&atilde;o armazenados. O default &eacute; <code>/logs/tx</code> no diret&oacute;rio de dom&iacute;nio.</p>
<p>Os logs de transa&ccedil;&atilde;o s&atilde;o mantidos no subdiret&oacute;rio <code>tx</code> do diret&oacute;rio especificado pela defini&ccedil;&atilde;o do Localiza&ccedil;&atilde;o do Log de Transa&ccedil;&otilde;es do Servi&ccedil;o de Transa&ccedil;&atilde;o na configura&ccedil;&atilde;o do cluster. O valor default do Localiza&ccedil;&atilde;o do Log de Transa&ccedil;&otilde;es &eacute; o diret&oacute;rio especificado pelo campo Raiz de Log da p&aacute;gina Atributos do Dom&iacute;nio, que est&aacute; localizado na guia Avan&ccedil;ado do n&oacute; do GlassFish Server.</p>
</dd>
</dl>
<a id="sthref281" name="sthref281"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-recovertransactions.html">Para Recuperar Transa&ccedil;&otilde;es de uma Inst&acirc;ncia de GlassFish Server Clusterizada</a></p>
</li>
<li>
<p><a href="task-recovertransactions-standalone-instance.html">Para Recuperar Transa&ccedil;&otilde;es de uma Inst&acirc;ncia de GlassFish Server Standalone</a></p>
</li>
</ul>
<a id="sthref282" name="sthref282"></a>
<h5>Subcomandos asadmin Equivalentes</h5>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00216"><code>recover-transactions</code>(1)</a></p>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
