<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-set-props-standalone-instance" name="task-set-props-standalone-instance"></a></p>

<h4><a id="sthref194" name="sthref194"></a><a id="sthref195" name="sthref195"></a><a id="sthref196" name="sthref196"></a>Para Definir Propriedades S&oacute; da Inst&acirc;ncia de uma Inst&acirc;ncia do GlassFish Server Standalone</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>As propriedades de uma inst&acirc;ncia do GlassFish Server acrescentam informa&ccedil;&otilde;es opcionais de configura&ccedil;&atilde;o sobre a inst&acirc;ncia.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, selecione o n&oacute; Inst&acirc;ncias Standalone.</p>
<p>A p&aacute;gina Inst&acirc;ncia de Servidor Standalone ser&aacute; aberta.</p>
</li>
<li>
<p>Selecione a inst&acirc;ncia cujas propriedades s&oacute; da inst&acirc;ncia voc&ecirc; deseja modificar.</p>
<p>A p&aacute;gina Informa&ccedil;&otilde;es Gerais da inst&acirc;ncia se abre.</p>
</li>
<li>
<p>Na p&aacute;gina Informa&ccedil;&otilde;es Gerais, clique na guia Propriedades.</p>
</li>
<li>
<p>Se necess&aacute;rio, clique na guia Propriedades da Inst&acirc;ncia.</p>
<p>A p&aacute;gina Propriedades da Inst&acirc;ncia ser&aacute; aberta.</p>
<p>Esta p&aacute;gina exibe uma lista das propriedades que est&atilde;o definidas para a inst&acirc;ncia selecionada do GlassFish Server.</p>
</li>
<li>
<p>Digite o novo valor de cada propriedade que estiver sendo modificada no campo Valor de tal propriedade.</p>
</li>
<li>
<p>Defina os valores de quaisquer propriedades adicionais que forem necess&aacute;rias.</p>
<ol type="a">
<li>
<p>Na tabela Propriedades Adicionais, clique em Adicionar Propriedade.</p>
<p>Uma linha &eacute; adicionada &agrave; tabela Propriedades Adicionais.</p>
</li>
<li>
<p>No campo Nome, digite o nome da propriedade.</p>
</li>
<li>
<p>No campo Valor, digite o valor.</p>
</li>
<li>
<p>No campo Descri&ccedil;&atilde;o, digite uma descri&ccedil;&atilde;o breve da propriedade.</p>
</li>
</ol>
</li>
<li>
<p>Clique em Salvar.</p>
</li>
</ol>
<a id="sthref197" name="sthref197"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-create-standalone-instance.html">Para Criar uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-delete-standalone-instances.html">Para Deletar Inst&acirc;ncias do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-start-standalone-instances.html">Para Iniciar Inst&acirc;ncias do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-stop-standalone-instances.html">Para Interromper Inst&acirc;ncias do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-view-logs-standalone-instance.html">Para Exibir Arquivos de Log de uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-recovertransactions-standalone-instance.html">Para Recuperar Transa&ccedil;&otilde;es de uma Inst&acirc;ncia de GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-deploy.html">Para Implantar uma Aplica&ccedil;&atilde;o em uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-list.html">Para Listar Aplica&ccedil;&otilde;es Que S&atilde;o Implantadas em uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-undeploy.html">Para Cancelar a Implanta&ccedil;&atilde;o de Aplica&ccedil;&otilde;es de uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-remove.html">Para Remover Aplica&ccedil;&otilde;es de uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-edit.html">Para Editar uma Aplica&ccedil;&atilde;o que &eacute; Implantada em uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-enable-disable.html">Para Ativar ou Desativar uma Aplica&ccedil;&atilde;o que est&aacute; Implantada em uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-lb-enable-disable.html">Para Ativar ou Desativar o Balanceamento de Carga de uma Aplica&ccedil;&atilde;o que foi Implantada em uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-create.html">Para Criar um Recurso para uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-display.html">Para Listar Recursos de uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-enable-disable.html">Para Ativar ou Desativar um Recurso de uma Inst&acirc;ncia de GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-edit.html">Para Editar um Recurso para uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-change-standalone-instance-ports.html">Para Modificar os N&uacute;meros de Porta de uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-mon-app-standalone-instance.html">Para Exibir Dados para Monitoramento da Aplica&ccedil;&atilde;o da Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-mon-server-standalone-instance.html">Para Exibir Dados para Monitoramento do Servidor Virtual da Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-mon-resource-standalone-instance.html">Para Exibir Dados para Monitoramento do Recurso da Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
