<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-upgrade-components" name="task-upgrade-components"></a><a id="GHCLU00044" name="GHCLU00044"></a></p>

<h4><a id="sthref62" name="sthref62"></a><a id="sthref63" name="sthref63"></a><a id="sthref64" name="sthref64"></a><a id="sthref65" name="sthref65"></a>Para Fazer Upgrade de Componentes sem Perda de Servi&ccedil;o</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Em um ambiente clusterizado, um upgrade incremental reimplanta uma aplica&ccedil;&atilde;o com perda m&iacute;nima de servi&ccedil;o e sess&otilde;es. Uma sess&atilde;o &eacute; qualquer artefato que possa ser replicado, por exemplo:</p>
<ul>
<li>
<p><code>HttpSession</code></p>
</li>
<li>
<p><code>SingleSignOn</code></p>
</li>
<li>
<p><code>ServletTimer</code></p>
</li>
<li>
<p><code>DialogFragment</code></p>
</li>
<li>
<p>Bean de sess&atilde;o stateful</p>
</li>
</ul>
<p>&Eacute; poss&iacute;vel utilizar o balanceador de carga e v&aacute;rios clusters para fazer upgrade de componentes no GlassFish Server sem perda de servi&ccedil;o. Um componente pode ser, por exemplo, uma m&aacute;quina JVM, o software GlassFish Server ou uma aplica&ccedil;&atilde;o Web.</p>
<p>Um upgrade incremental pode ocorrer em cargas leves e moderadas. O procedimento demora cerca de 10 a 15 minutos em cada inst&acirc;ncia do GlassFish Server.</p>
<p>As aplica&ccedil;&otilde;es devem ser compat&iacute;veis no upgrade. Devem funcionar corretamente durante a transi&ccedil;&atilde;o quando algumas inst&acirc;ncias estiverem executando a vers&atilde;o antiga e outras inst&acirc;ncias estiverem executando a nova vers&atilde;o. A vers&atilde;o antiga e a nova devem ter a mesma forma de classes serializ&aacute;veis que formam os gr&aacute;ficos de objetos armazenados nas sess&otilde;es (por exemplo, vari&aacute;veis de inst&acirc;ncia n&atilde;o transit&oacute;rias). Se a forma destas classes tiver que ser alterado, o desenvolvedor da aplica&ccedil;&atilde;o deve certificar-se de que ocorra um correto comportamento de serializa&ccedil;&atilde;o. Se a aplica&ccedil;&atilde;o n&atilde;o for compat&iacute;vel em todo o upgrade, o cluster dever&aacute; ser interrompido para uma reimplanta&ccedil;&atilde;o completa.</p>
<p>Esta abordagem n&atilde;o &eacute; poss&iacute;vel se o upgrade da aplica&ccedil;&atilde;o implicar a altera&ccedil;&atilde;o no esquema do banco de dados da aplica&ccedil;&atilde;o.</p>

<hr>
<p><b>Cuidado:</b></p>
Para impedir o risco de incompatibilidade de vers&otilde;es quando uma sess&atilde;o falhar, fa&ccedil;a uprade de todas as inst&acirc;ncias de um cluster ao mesmo tempo. Do contr&aacute;rio, uma sess&atilde;o pode falhar em uma inst&acirc;ncia na qual vers&otilde;es diferentes de componentes est&atilde;o em execu&ccedil;&atilde;o.
<hr>

<p>Executee esta tarefa em cada cluster separadamente. Um cluster age como um limite seguro em failover de sess&atilde;o das inst&acirc;ncias do cluster. As sess&otilde;es de um cluster nunca podem causar failover em sess&otilde;es de outros cluster. Portanto, n&atilde;o h&aacute; risco de vers&otilde;es incompat&iacute;veis.</p>
<ol>
<li>
<p>Interrompa o cluster.</p>
<p>Consulte <a href="task-stop-cluster.html">Para Interromper um Cluster</a>.</p>
</li>
<li>
<p>Fa&ccedil;a upgrade do componente nesse cluster.</p>
</li>
<li>
<p>Inicie o cluster.</p>
<p>Consulte <a href="task-start-cluster.html">Para Iniciar um Cluster</a>.</p>
</li>
</ol>
<a id="sthref66" name="sthref66"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-create-cluster.html">Para Criar um Cluster</a></p>
</li>
<li>
<p><a href="task-delete-cluster.html">Para Deletar um Cluster</a></p>
</li>
<li>
<p><a href="task-availabilityservice.html">Para Configurar as Defini&ccedil;&otilde;es de Disponibilidade de um Cluster</a></p>
</li>
<li>
<p><a href="task-start-cluster.html">Para Iniciar um Cluster</a></p>
</li>
<li>
<p><a href="task-stop-cluster.html">Para Interromper um Cluster</a></p>
</li>
<li>
<p><a href="task-modify-cluster-config.html">Para Modificar a Configura&ccedil;&atilde;o de um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-deploy.html">Para Implantar uma Aplica&ccedil;&atilde;o em um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-list.html">Para Listar Aplica&ccedil;&otilde;es Que S&atilde;o Implantadas em um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-undeploy.html">Para Cancelar a Implanta&ccedil;&atilde;o de Aplica&ccedil;&otilde;es de um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-remove.html">Para Remover Aplica&ccedil;&otilde;es de um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-edit.html">Para Editar uma Aplica&ccedil;&atilde;o que &eacute; Implantada em um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-enable-disable.html">Para Ativar ou Desativar uma Aplica&ccedil;&atilde;o que est&aacute; Implantada em um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-lb-enable-disable.html">Para Ativar ou Desativar o Balanceamento de Carga de uma Aplica&ccedil;&atilde;o que foi Implantada em um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-resource-create.html">Para Criar um Recurso para um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-resource-display.html">Para Listar Recursos para um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-resource-enable-disable.html">Para Ativar ou Desativar um Recurso Globalmente</a></p>
</li>
<li>
<p><a href="task-cluster-resource-edit.html">Para Editar um Recurso para um Cluster</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
