<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-gmsenable" name="task-gmsenable"></a></p>

<h4><a id="sthref217" name="sthref217"></a><a id="sthref218" name="sthref218"></a>Para Ativar o Servi&ccedil;o de Gerenciamento de Grupos</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>O Servi&ccedil;o de Gerenciamento de Grupos (GMS) &eacute; um servi&ccedil;o em andamento que oferece monitoramento de cluster, associa&ccedil;&atilde;o de cluster e servi&ccedil;os de comunica&ccedil;&atilde;o de grupos. O GMS realiza as seguintes fun&ccedil;&otilde;es:</p>
<ul>
<li>
<p>Notifica os m&oacute;dulos registrados em uma inst&acirc;ncia do GlassFish Server quando uma ou mais inst&acirc;ncias do membro s&atilde;o adicionadas ou removidas de um cluster, ou quando tais inst&acirc;ncias s&atilde;o suspeitas de ter falhas ou realmente tenham falhas.</p>
</li>
<li>
<p>Fornece a capacidade de enviar e receber mensagens entre membros do cluster.</p>
</li>
</ul>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Clusters.</p>
</li>
<li>
<p>Selecione o cluster para o qual voc&ecirc; est&aacute; ativando o servi&ccedil;o de gerenciamento de grupos (GMS).</p>
<p>A p&aacute;gina Informa&ccedil;&otilde;es Gerais do cluster ser&aacute; aberta.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o GMS Ativado para ativar o GMS do cluster.</p>
<p>Por default, essa op&ccedil;&atilde;o est&aacute; selecionada. Para desativar o GMS do cluster, desmarque a caixa de sele&ccedil;&atilde;o GMS Ativado.</p>
<p>Se ativado, o Servi&ccedil;o de Gerenciamento de Grupos (GMS) &eacute; iniciado em cada inst&acirc;ncia do servidor do cluster e do Servidor de Administra&ccedil;&atilde;o de Dom&iacute;nios (DAS). O DAS participa de cada cluster no qual o GMS estiver ativado.</p>
</li>
<li>
<p>Clique em Salvar.</p>
</li>
</ol>
<a id="sthref219" name="sthref219"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-gmscluster.html">Para Configurar as Defini&ccedil;&otilde;es do Servi&ccedil;o de Gerenciamento de Grupos de um Cluster</a></p>
</li>
<li>
<p><a href="task-gms.html">Para Configurar o Servi&ccedil;o de Gerenciamento de Grupos</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
