<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-set-props-clustered-instance" name="task-set-props-clustered-instance"></a><a id="GHCLU00052" name="GHCLU00052"></a></p>

<h4><a id="sthref99" name="sthref99"></a><a id="sthref100" name="sthref100"></a><a id="sthref101" name="sthref101"></a>Para Definir Propriedades S&oacute; da Inst&acirc;ncia de uma Inst&acirc;ncia do GlassFish Server Clusterizada</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>As propriedades de uma inst&acirc;ncia do GlassFish Server acrescentam informa&ccedil;&otilde;es opcionais de configura&ccedil;&atilde;o sobre a inst&acirc;ncia.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Clusters.</p>
</li>
<li>
<p>No n&oacute; Clusters expandidos, selecione o n&oacute; do cluster.</p>
<p>A p&aacute;gina Informa&ccedil;&otilde;es Gerais do cluster ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Informa&ccedil;&otilde;es Gerais, clique na guia Inst&acirc;ncias.</p>
<p>A p&aacute;gina Inst&acirc;ncias de Servidor Clusterizado ser&aacute; aberta com informa&ccedil;&otilde;es sobre o cluster.</p>
</li>
<li>
<p>Selecione a inst&acirc;ncia cujas propriedades s&oacute; da inst&acirc;ncia voc&ecirc; deseja modificar.</p>
<p>A p&aacute;gina Informa&ccedil;&otilde;es Gerais da inst&acirc;ncia se abre.</p>
</li>
<li>
<p>Na p&aacute;gina Informa&ccedil;&otilde;es Gerais, clique na guia Propriedades.</p>
</li>
<li>
<p>Se necess&aacute;rio, clique na guia Propriedades da Inst&acirc;ncia.</p>
<p>A p&aacute;gina Propriedades da Inst&acirc;ncia ser&aacute; aberta.</p>
<p>Esta p&aacute;gina exibe uma lista das propriedades que est&atilde;o definidas para a inst&acirc;ncia selecionada do GlassFish Server.</p>
</li>
<li>
<p>Digite o novo valor de cada propriedade que estiver sendo modificada no campo Valor de tal propriedade.</p>
</li>
<li>
<p>Defina os valores de quaisquer propriedades adicionais que forem necess&aacute;rias.</p>
<ol type="a">
<li>
<p>Na tabela Propriedades Adicionais, clique em Adicionar Propriedade.</p>
<p>Uma linha &eacute; adicionada &agrave; tabela Propriedades Adicionais.</p>
</li>
<li>
<p>No campo Nome, digite o nome da propriedade.</p>
</li>
<li>
<p>No campo Valor, digite o valor.</p>
</li>
<li>
<p>No campo Descri&ccedil;&atilde;o, digite uma descri&ccedil;&atilde;o breve da propriedade.</p>
</li>
</ol>
</li>
<li>
<p>Clique em Salvar.</p>
</li>
</ol>
<a id="sthref102" name="sthref102"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-create-clustered-instance.html">Para Adicionar uma Inst&acirc;ncia de GlassFish Server em um Cluster</a></p>
</li>
<li>
<p><a href="task-delete-clustered-instances.html">Para Deletar Inst&acirc;ncias do GlassFish Server Clusterizadas</a></p>
</li>
<li>
<p><a href="task-start-clustered-instances.html">Para Iniciar Inst&acirc;ncias do GlassFish Server Clusterizadas</a></p>
</li>
<li>
<p><a href="task-stop-clustered-instances.html">Para Interromper Inst&acirc;ncias do GlassFish Server Clusterizadas</a></p>
</li>
<li>
<p><a href="task-view-logs-clustered-instance.html">Para Exibir Arquivos de Log de uma Inst&acirc;ncia Clusterizada do GlassFish Server</a></p>
</li>
<li>
<p><a href="task-recovertransactions.html">Para Recuperar Transa&ccedil;&otilde;es de uma Inst&acirc;ncia de GlassFish Server Clusterizada</a></p>
</li>
<li>
<p><a href="task-change-clustered-instance-ports.html">Para Modificar os N&uacute;meros de Porta de uma Inst&acirc;ncia do GlassFish Server Clusterizada</a></p>
</li>
<li>
<p><a href="task-mon-app-clustered-instance.html">Para Exibir Dados para Monitoramento da Aplica&ccedil;&atilde;o da Inst&acirc;ncia do GlassFish Server Clusterizada</a></p>
</li>
<li>
<p><a href="task-mon-server-clustered-instance.html">Para Exibir Dados para Monitoramento do Servidor Virtual da Inst&acirc;ncia do GlassFish Server Clusterizada</a></p>
</li>
<li>
<p><a href="task-mon-resource-clustered-instance.html">Para Exibir Dados para Monitoramento do Recurso da Inst&acirc;ncia do GlassFish Server Clusterizada</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
