<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-change-standalone-instance-ports" name="task-change-standalone-instance-ports"></a></p>

<h4><a id="sthref190" name="sthref190"></a><a id="sthref191" name="sthref191"></a><a id="sthref192" name="sthref192"></a>Para Modificar os N&uacute;meros de Porta de uma Inst&acirc;ncia do GlassFish Server Standalone</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Os n&uacute;meros de porta de uma inst&acirc;ncia standalone do GlassFish Server s&atilde;o definidos inicialmente na configura&ccedil;&atilde;o que a inst&acirc;ncia faz refer&ecirc;ncia. &Eacute; necess&aacute;rio modificar estes n&uacute;meros de porta se, por exemplo, duas inst&acirc;ncias que fazem refer&ecirc;ncia &agrave; mesma configura&ccedil;&atilde;o residirem no mesmo host. Nesse caso, os n&uacute;meros de porta de uma inst&acirc;ncia devem ser modificados porque ambas as inst&acirc;ncias fazem refer&ecirc;ncia &agrave; mesma configura&ccedil;&atilde;o.</p>
<p>Os n&uacute;meros de porta de uma inst&acirc;ncia s&atilde;o armazenados como propriedades de sistema Java. Essas propriedades s&atilde;o passadas para o acionador da aplica&ccedil;&atilde;o Java por meio da op&ccedil;&atilde;o <code>-D</code> do acionador da aplica&ccedil;&atilde;o Java quando o GlassFish Server &eacute; iniciado.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, selecione o n&oacute; Inst&acirc;ncias Standalone.</p>
<p>A p&aacute;gina Inst&acirc;ncia de Servidor Standalone ser&aacute; aberta.</p>
</li>
<li>
<p>Selecione a inst&acirc;ncia cujos n&uacute;meros de porta deseja modificar.</p>
<p>A p&aacute;gina Informa&ccedil;&otilde;es Gerais da inst&acirc;ncia se abre.</p>
</li>
<li>
<p>Na p&aacute;gina Informa&ccedil;&otilde;es Gerais, clique na guia Propriedades.</p>
<p>A p&aacute;gina Propriedades de Sistema da Inst&acirc;ncia ser&aacute; aberta.</p>
<p>Esta p&aacute;gina exibe os valores atuais das seguintes propriedades do sistema para a inst&acirc;ncia:</p>
<ul>
<li>
<p><a href="../../../common/en/help/ref-predefinedconfigsysproperties.html">N&uacute;meros de porta predefinidos na configura&ccedil;&atilde;o da inst&acirc;ncia</a></p>
</li>
<li>
<p>Propriedades personalizadas definidas para a inst&acirc;ncia, se houver</p>
</li>
</ul>
</li>
<li>
<p>Digite o novo valor de cada propriedade que estiver sendo modificada no campo Valor Substituto.</p>
</li>
<li>
<p>Defina os valores de quaisquer propriedades adicionais que forem necess&aacute;rias.</p>
<ol type="a">
<li>
<p>Na tabela Propriedades Adicionais, clique em Adicionar Propriedade.</p>
<p>Uma linha &eacute; adicionada &agrave; tabela Propriedades Adicionais.</p>
</li>
<li>
<p>No campo Nome da Vari&aacute;vel da Inst&acirc;ncia, digite o nome da propriedade.</p>
</li>
<li>
<p>No campo Valor Substituto, digite o valor.</p>
</li>
</ol>
</li>
<li>
<p>Clique em Salvar.</p>
</li>
</ol>
<a id="sthref193" name="sthref193"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-create-standalone-instance.html">Para Criar uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-delete-standalone-instances.html">Para Deletar Inst&acirc;ncias do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-start-standalone-instances.html">Para Iniciar Inst&acirc;ncias do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-stop-standalone-instances.html">Para Interromper Inst&acirc;ncias do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-view-logs-standalone-instance.html">Para Exibir Arquivos de Log de uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-recovertransactions-standalone-instance.html">Para Recuperar Transa&ccedil;&otilde;es de uma Inst&acirc;ncia de GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-deploy.html">Para Implantar uma Aplica&ccedil;&atilde;o em uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-list.html">Para Listar Aplica&ccedil;&otilde;es Que S&atilde;o Implantadas em uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-undeploy.html">Para Cancelar a Implanta&ccedil;&atilde;o de Aplica&ccedil;&otilde;es de uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-remove.html">Para Remover Aplica&ccedil;&otilde;es de uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-edit.html">Para Editar uma Aplica&ccedil;&atilde;o que &eacute; Implantada em uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-enable-disable.html">Para Ativar ou Desativar uma Aplica&ccedil;&atilde;o que est&aacute; Implantada em uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-lb-enable-disable.html">Para Ativar ou Desativar o Balanceamento de Carga de uma Aplica&ccedil;&atilde;o que foi Implantada em uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-create.html">Para Criar um Recurso para uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-display.html">Para Listar Recursos de uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-enable-disable.html">Para Ativar ou Desativar um Recurso de uma Inst&acirc;ncia de GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-edit.html">Para Editar um Recurso para uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-set-props-standalone-instance.html">Para Definir Propriedades S&oacute; da Inst&acirc;ncia de uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-mon-app-standalone-instance.html">Para Exibir Dados para Monitoramento da Aplica&ccedil;&atilde;o da Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-mon-server-standalone-instance.html">Para Exibir Dados para Monitoramento do Servidor Virtual da Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-mon-resource-standalone-instance.html">Para Exibir Dados para Monitoramento do Recurso da Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
