<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-nodeeditssh" name="task-nodeeditssh"></a></p>
<!-- infolevel="all" infotype="General" -->
<h4>Para Finalizar a Atualiza&ccedil;&atilde;o de um N&oacute; SSH</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Esta tarefa &eacute; a continua&ccedil;&atilde;o de um n&oacute; SSH de <a href="task-editnode.html">Para Editar um N&oacute;</a>.</p>
<ol>
<li>
<p>Para for&ccedil;ar a atualiza&ccedil;&atilde;o do n&oacute; na configura&ccedil;&atilde;o do servidor de administra&ccedil;&atilde;o de dom&iacute;nios (DAS) mesmo que haja falha na valida&ccedil;&atilde;o dos par&acirc;metros do n&oacute;, ative a op&ccedil;&atilde;o For&ccedil;ar.</p>
</li>
<li>
<p>No campo Porta SSH, digite a porta para utilizar as conex&otilde;es SSH com este host do n&oacute;.</p>
<p>Se o tipo de n&oacute; for alterado de CONFIG para SSH e este campo for deixado vazio, a op&ccedil;&atilde;o Porta SSH ser&aacute; definida como 22.</p>
</li>
<li>
<p>No campo Nome do Usu&aacute;rio SSH, digite o nome do usu&aacute;rio deste host do n&oacute; que deve executar o processo para conex&atilde;o com o host atrav&eacute;s de SSH.</p>
<p>Se o tipo de n&oacute; for alterado de CONFIG para SSH e este campo for deixado vazio, a op&ccedil;&atilde;o Nome de usu&aacute;rio SSH &eacute; definida como o usu&aacute;rio que estiver em execu&ccedil;&atilde;o no processo DAS.</p>
</li>
<li>
<p>Especifique como o usu&aacute;rio SSH ser&aacute; autenticado ao efetuar log-in no host do n&oacute;.</p>
<ul>
<li>
<p>Para especificar a autentica&ccedil;&atilde;o atrav&eacute;s de um arquivo de chave privada SSH, execute estas etapas:</p>
<ol type="a">
<li>
<p>Na lista drop-down Autentica&ccedil;&atilde;o de Usu&aacute;rio SSH, selecione Arquivo de Chave.</p>
</li>
<li>
<p>Se voc&ecirc; quiser que o GlassFish Server configure uma chave SSH no host do n&oacute;, ative a Op&ccedil;&atilde;o Configurar SSH.</p>
<p>O GlassFish Server configura a chave de SSH copiando arquivos-chave existentes do host DAS ou, se necess&aacute;rio, gerando os arquivos antes de copi&aacute;-los.</p>
<p>O campo Gerar Chave e o campo Arquivo de Chave P&uacute;blica s&atilde;o adicionados &agrave; janela.</p>
</li>
<li>
<p>Se voc&ecirc; quiser que o GlassFish Server gere os arquivos de chave SSH antes de copi&aacute;-los para o host do n&oacute;, ative a Op&ccedil;&atilde;o Gerar Chave.</p>
<p>Se os arquivos de chave do SSH existirem, o GlassFish Server n&atilde;o ir&aacute; gerar os arquivos, mesmo que a op&ccedil;&atilde;o Ativado esteja selecionada.</p>

<hr>
<p><b>Observa&ccedil;&atilde;o:</b></p>
Se os arquivos de chave do SSH n&atilde;o existirem, voc&ecirc; dever&aacute; selecionar a op&ccedil;&atilde;o Ativado. Caso contr&aacute;rio, ocorrer&aacute; um erro quando voc&ecirc; tentar salvar suas altera&ccedil;&otilde;es.
<hr>

</li>
<li>
<p>No campo Senha do Usu&aacute;rio SSH, digite a senha que o usu&aacute;rio do SSH usar&aacute; quando efetuar log-in no host deste n&oacute;.</p>
</li>
<li>
<p>No campo Arquivo de Chaves P&uacute;blicas, digite o caminho absoluto para o arquivo de chaves p&uacute;blicas SSH relativo ao usu&aacute;rio especificado pela op&ccedil;&atilde;o Nome do Usu&aacute;rio SSH.</p>
</li>
<li>
<p>No campo Arquivo de Chave, digite o caminho absoluto para o arquivo da chave privada de SSH para o usu&aacute;rio que a op&ccedil;&atilde;o Nome de Usu&aacute;rio SSH especifica.</p>

<hr>
<p><b>Observa&ccedil;&atilde;o:</b></p>
O GlassFish Server tamb&eacute;m suporta autentica&ccedil;&atilde;o por senha por meio da entrada <code>AS_ADMIN_SSHPASSWORD</code> no arquivo de senhas. O arquivo de senhas &eacute; especificado na op&ccedil;&atilde;o <code>-paswordfile</code>do utilit&aacute;rio <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00263"><code>asadmin</code>(1)</a>.
<hr>

<p>Se voc&ecirc; alteraro tipo do n&oacute; para SSH e deixar este campo em branco, a op&ccedil;&atilde;o Arquivo de Chaves ser&aacute; definida para um arquivo de chaves no diret&oacute;rio <code>.ssh</code> do usu&aacute;rio. Se forem encontrados v&aacute;rios arquivos de chave, o GlassFish Server usa a seguinte ordem de prefer&ecirc;ncia:</p>
<pre>
id_rsa
id_dsa
identity
</pre></li>
</ol>
</li>
<li>
<p>Para especificar a autentica&ccedil;&atilde;o atrav&eacute;s de uma senha armazenada na configura&ccedil;&atilde;o do DAS, execute estas etapas:</p>

<hr>
<p><b>Cuidado:</b></p>
Esta senha &eacute; armazenada em forma de texto criptografado na configura&ccedil;&atilde;o do DAS. Para maior seguran&ccedil;a, utilize um arquivo de chave ou um alias de senha.
<hr>

<ol type="a">
<li>
<p>Na lista drop-down Autentica&ccedil;&atilde;o de Usu&aacute;rio SSH, selecione Senha.</p>
</li>
<li>
<p>No campo Senha do Usu&aacute;rio SSH, digite a senha que o usu&aacute;rio do SSH usar&aacute; quando efetuar log-in no host deste n&oacute;.</p>
</li>
</ol>
</li>
<li>
<p>Para especificar a autentica&ccedil;&atilde;o atrav&eacute;s de um alias de senha, execute estas etapas:</p>
<ol type="a">
<li>
<p>Na lista drop-down Autentica&ccedil;&atilde;o de Usu&aacute;rio SSH, selecione Alias de Senha.</p>
</li>
<li>
<p>Na lista drop-down Alias de Senha, selecione o alias existente.</p>
</li>
</ol>
</li>
</ul>
</li>
<li>
<p>Clique em Salvar.</p>
</li>
</ol>
<a id="sthref239" name="sthref239"></a>
<h5>Consulte Tamb&eacute;m</h5>
<p><a href="task-editnode.html">Para Editar um N&oacute;</a></p>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
