<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-nodeupdatedcom" name="task-nodeupdatedcom"></a></p>
<!-- infolevel="all" infotype="General" -->
<h4>Para Finalizar a Atualiza&ccedil;&atilde;o de um N&oacute; DCOM</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Esta tarefa &eacute; a continua&ccedil;&atilde;o de um n&oacute; DCOM de <a href="task-editnode.html">Para Editar um N&oacute;</a>.</p>
<ol>
<li>
<p>Para for&ccedil;ar a cria&ccedil;&atilde;o do n&oacute; na configura&ccedil;&atilde;o do servidor de administra&ccedil;&atilde;o de dom&iacute;nios (DAS) mesmo se a valida&ccedil;&atilde;o dos par&acirc;metros do n&oacute; falhar, ative a op&ccedil;&atilde;o For&ccedil;ar.</p>
</li>
<li>
<p>Se voc&ecirc; quiser que o GlassFish Server teste a conex&atilde;o por meio do DCOM com o host do n&oacute; antes de atualizar o n&oacute;, execute estas etapas:</p>
<ol type="a">
<li>
<p>Ative a op&ccedil;&atilde;o Validar DCOM.</p>
</li>
<li>
<p>No campo Diret&oacute;rio de Teste Remoto, digite o nome da pasta no host remoto na qual o GlassFish Server dever&aacute; criar um arquivo para testar a conex&atilde;o.</p>
</li>
</ol>
</li>
<li>
<p>No campo Dom&iacute;nio do Windows, digite o nome do dom&iacute;nio Windows que cont&eacute;m o usu&aacute;rio especificado pela op&ccedil;&atilde;o Nome do Usu&aacute;rio do Windows.</p>
<p>Se voc&ecirc; alterar o tipo do n&oacute; para DCOM e deixar este campo em branco, a op&ccedil;&atilde;o Dom&iacute;nio do Windows ser&aacute; definida para o nome do host no qual a Console de Administra&ccedil;&atilde;o estiver em execu&ccedil;&atilde;o.</p>
</li>
<li>
<p>No campo Nome do Usu&aacute;rio do Windows, digite o nome do usu&aacute;rio no host deste n&oacute; que dever&aacute; executar o processo de conex&atilde;o com o host por meio do DCOM.</p>
<p>Se voc&ecirc; alterar o tipo do n&oacute; de CONFIG para DCOM e deixar este campo em branco, a op&ccedil;&atilde;o Nome do Usu&aacute;rio do Windows ser&aacute; definida para o usu&aacute;rio que estiver executando o processo DAS.</p>
</li>
<li>
<p>Especifique como o usu&aacute;rio do Windows ser&aacute; autenticado ao efetuar log-in no host deste n&oacute;.</p>

<hr>
<p><b>Observa&ccedil;&atilde;o:</b></p>
O GlassFish Server tamb&eacute;m suporta autentica&ccedil;&atilde;o de senha por meio da entrada <code>AS_ADMIN_WINDOWSPASSWORD</code> no arquivo de senha. O arquivo de senhas &eacute; especificado na op&ccedil;&atilde;o <code>-paswordfile</code>do utilit&aacute;rio <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00263"><code>asadmin</code>(1)</a>.
<hr>

<ol type="a">
<li>
<p>Para especificar a autentica&ccedil;&atilde;o atrav&eacute;s de uma senha armazenada na configura&ccedil;&atilde;o do DAS, execute estas etapas:</p>

<hr>
<p><b>Cuidado:</b></p>
Esta senha &eacute; armazenada em forma de texto criptografado na configura&ccedil;&atilde;o do DAS. Para aumentar a seguran&ccedil;a, use um alias de senha.
<hr>

<ol>
<li>
<p>Na lista drop-down Autentica&ccedil;&atilde;o do Usu&aacute;rio Windows, selecione Senha.</p>
</li>
<li>
<p>No campo Senha do Usu&aacute;rio do Windows, digite a senha que o usu&aacute;rio do Windows usar&aacute; ao efetuar log-in no host deste n&oacute;.</p>
</li>
</ol>
</li>
<li>
<p>Para especificar a autentica&ccedil;&atilde;o atrav&eacute;s de um alias de senha, execute estas etapas:</p>
<ol>
<li>
<p>Na lista drop-down Autentica&ccedil;&atilde;o do Usu&aacute;rio do Windows, selecione Alias de Senha.</p>
</li>
<li>
<p>Na lista drop-down Alias de Senha, selecione o alias existente.</p>
</li>
</ol>
</li>
</ol>
</li>
<li>
<p>Clique em Salvar.</p>
</li>
</ol>
<a id="sthref238" name="sthref238"></a>
<h5>Consulte Tamb&eacute;m</h5>
<p><a href="task-editnode.html">Para Editar um N&oacute;</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
