<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-deletenode" name="task-deletenode"></a></p>

<h4><a id="sthref228" name="sthref228"></a>Para Deletar N&oacute;s</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>A dele&ccedil;&atilde;o de um n&oacute; remove o n&oacute; da configura&ccedil;&atilde;o do servidor de administra&ccedil;&atilde;o de dom&iacute;nios (DAS). Os diret&oacute;rios e arquivos do n&oacute; s&atilde;o deletados quando a &uacute;ltima inst&acirc;ncia do GlassFish Server que reside no n&oacute; &eacute; deletada.</p>
<p>Voc&ecirc; tamb&eacute;m pode optar por desinstalar o software GlassFish Server do host do n&oacute; quando o n&oacute; for deletado.</p>
<a id="sthref229" name="sthref229"></a>
<h5>Antes de Come&ccedil;ar</h5>
<p>Certifique-se de que nenhuma inst&acirc;ncia do GlassFish Server resida no n&oacute; que est&aacute; sendo deletado.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, selecione o n&oacute; N&oacute;s.</p>
<p>A p&aacute;gina N&oacute;s ser&aacute; aberta.</p>
</li>
<li>
<p>Para cada n&oacute; que estiver sendo deletado, marque a caixa de sele&ccedil;&atilde;o ao lado do n&oacute; na tabela N&oacute;s.</p>

<hr>
<p><b>Observa&ccedil;&atilde;o:</b></p>
O n&oacute; predefinido <code>localhost-</code><i>domain</i> n&atilde;o pode ser deletado.
<hr>

</li>
<li>
<p>Clique no bot&atilde;o para deletar os n&oacute;s ou deletar os n&oacute;s e desinstalar o software GlassFish Server dos hosts do n&oacute;.</p>
<ul>
<li>
<p>Para deletar os n&oacute;s sem desinstalar o software GlassFish Server, clique em Deletar.</p>
<p>Ser&aacute; solicitado que voc&ecirc; confirme se deseja deletar os n&oacute;s.</p>
</li>
<li>
<p>Para deletar os n&oacute;s e desinstalar o software GlassFish Server dos hosts do n&oacute;, clique em Deletar e Desinstalar.</p>
<p>Ser&aacute; solicitado que voc&ecirc; confirme se deseja deletar os n&oacute;s e desinstalar o software GlassFish Server dos hosts do n&oacute;.</p>

<hr>
<p><b>Observa&ccedil;&atilde;o:</b></p>
O software GlassFish Server n&atilde;o &eacute; desinstalado de qualquer host representado por um n&oacute; do tipo CONFIG. Somente o n&oacute; &eacute; deletado.
<hr>

</li>
</ul>
</li>
<li>
<p>Confirme se deseja deletar os n&oacute;s ou deletar os n&oacute;s e desinstalar o software GlassFish Server dos hosts do n&oacute;.</p>
<p>Os n&oacute;s s&atilde;o deletados e removidos da tabela de n&oacute;s na p&aacute;gina N&oacute;s. Se voc&ecirc; tiver clicado em Deletar e Desinstalar, o software GlassFish Server tamb&eacute;m ser&aacute; desinstalado dos hosts do n&oacute;.</p>
</li>
</ol>
<a id="sthref230" name="sthref230"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-createnode.html">Para Criar um N&oacute;</a></p>
</li>
<li>
<p><a href="task-listnodes.html">Para Listar Todos os N&oacute;s no Dom&iacute;nio Atual</a></p>
</li>
<li>
<p><a href="task-pingnode.html">Para Testar se um N&oacute; &eacute; Acess&iacute;vel</a></p>
</li>
<li>
<p><a href="task-editnode.html">Para Editar um N&oacute;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
