<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-delete-clustered-instances" name="task-delete-clustered-instances"></a></p>

<h4><a id="sthref72" name="sthref72"></a><a id="sthref73" name="sthref73"></a><a id="sthref74" name="sthref74"></a>Para Deletar Inst&acirc;ncias do GlassFish Server Clusterizadas</h4>
<a name="BEGIN" id="BEGIN"></a>

<hr>
<p><b>Cuidado:</b></p>
Se estiver utilizando um cluster Java Message Service (JMS) com um broker mestre, n&atilde;o delete a inst&acirc;ncia que est&aacute; associada ao broker mestre. Se esta inst&acirc;ncia precisar ser deletada, use o subcomando <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00005"><code>change-master-broker</code>(1)</a> para designar o broker mestre a outra inst&acirc;ncia.
<hr>

<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Clusters.</p>
</li>
<li>
<p>No n&oacute; Clusters expandidos, selecione o n&oacute; do cluster.</p>
<p>A p&aacute;gina Informa&ccedil;&otilde;es Gerais do cluster ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Informa&ccedil;&otilde;es Gerais, clique na guia Inst&acirc;ncias.</p>
<p>A p&aacute;gina Inst&acirc;ncias de Servidor Clusterizado ser&aacute; aberta com informa&ccedil;&otilde;es sobre o cluster.</p>
</li>
<li>
<p>Para cada inst&acirc;ncia que voc&ecirc; estiver deletando, marque a caixa de sele&ccedil;&atilde;o pr&oacute;xima &agrave; inst&acirc;ncia na tabela Inst&acirc;ncias do Servidor.</p>
</li>
<li>
<p>Clique em Deletar.</p>
<p>Ser&aacute; solicitado que voc&ecirc; confirme se deseja deletar as inst&acirc;ncias.</p>
</li>
<li>
<p>Confirme se deseja deletar as inst&acirc;ncias.</p>
<p>As inst&acirc;ncias s&atilde;o deletadas e removidas da tabela de inst&acirc;ncias da p&aacute;gina.</p>
</li>
</ol>
<a id="sthref75" name="sthref75"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-create-clustered-instance.html">Para Adicionar uma Inst&acirc;ncia de GlassFish Server a um Cluster</a></p>
</li>
<li>
<p><a href="task-start-clustered-instances.html">Para Iniciar Inst&acirc;ncias do GlassFish Server Clusterizadas</a></p>
</li>
<li>
<p><a href="task-stop-clustered-instances.html">Para Interromper Inst&acirc;ncias do GlassFish Server Clusterizadas</a></p>
</li>
<li>
<p><a href="task-view-logs-clustered-instance.html">Para Exibir Arquivos de Log de uma Inst&acirc;ncia Clusterizada do GlassFish Server</a></p>
</li>
<li>
<p><a href="task-recovertransactions.html">Para Recuperar Transa&ccedil;&otilde;es de uma Inst&acirc;ncia de GlassFish Server Clusterizada</a></p>
</li>
<li>
<p><a href="task-change-clustered-instance-ports.html">Para Modificar os N&uacute;meros de Porta de uma Inst&acirc;ncia do GlassFish Server Clusterizada</a></p>
</li>
<li>
<p><a href="task-set-props-clustered-instance.html">Para Definir Propriedades S&oacute; da Inst&acirc;ncia de uma Inst&acirc;ncia do GlassFish Server Clusterizada</a></p>
</li>
<li>
<p><a href="task-mon-app-clustered-instance.html">Para Exibir Dados para Monitoramento da Aplica&ccedil;&atilde;o da Inst&acirc;ncia do GlassFish Server Clusterizada</a></p>
</li>
<li>
<p><a href="task-mon-server-clustered-instance.html">Para Exibir Dados para Monitoramento do Servidor Virtual da Inst&acirc;ncia do GlassFish Server Clusterizada</a></p>
</li>
<li>
<p><a href="task-mon-resource-clustered-instance.html">Para Exibir Dados para Monitoramento do Recurso da Inst&acirc;ncia do GlassFish Server Clusterizada</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
