<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-pingnode" name="task-pingnode"></a></p>
<!-- infolevel="all" infotype="General" -->
<h4><a id="sthref233" name="sthref233"></a>Para Testar se um N&oacute; &eacute; Acess&iacute;vel</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Para criar ou iniciar as inst&acirc;ncias do GlassFish Server em um n&oacute; que representa um host remoto, o DAS deve ser capaz de contatar o n&oacute;. Antes de tentar criar ou iniciar as inst&acirc;ncias em tal n&oacute;, teste se o DAS pode contatar o n&oacute;.</p>
<p>O tipo do n&oacute; que voc&ecirc; est&aacute; testando deve ser DCOM ou SSH. Voc&ecirc; n&atilde;o pode testar um n&oacute; do tipo CONFIG porque um n&oacute; desse tipo n&atilde;o &eacute; ativado para comunica&ccedil;&atilde;o remota.</p>
<a id="sthref234" name="sthref234"></a>
<h5>Antes de Come&ccedil;ar</h5>
<p>Certifique-se de que o protocolo apropriado para o tipo do n&oacute; esteja configurado no host representado pelo n&oacute;. O n&oacute; est&aacute; ativado para comunica&ccedil;&atilde;o remota por meio deste protocolo.</p>
<ul>
<li>
<p>Se o tipo do n&oacute; for DCOM, o protocolo DCOM (Distributed Component Object Model) dever&aacute; ser configurado.</p>
</li>
<li>
<p>Se o tipo do n&oacute; for SSH, o protocolo secure shell (SSH) dever&aacute; ser configurado.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, selecione o n&oacute; N&oacute;s.</p>
<p>A p&aacute;gina <a href="ref-nodes.html">N&oacute;s</a> ser&aacute; aberta. Esta p&aacute;gina lista todos os n&oacute;s do dom&iacute;nio atual.</p>
</li>
<li>
<p>Na tabela de n&oacute;s, siga o link Ping relativo ao n&oacute; que voc&ecirc; estiver testando.</p>
<p>Uma mensagem que indica se o DAS pode contatar o n&oacute; &eacute; adicionada &agrave; p&aacute;gina N&oacute;s.</p>
</li>
</ol>
</li>
</ul>
<a id="sthref235" name="sthref235"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-createnode.html">Para Criar um N&oacute;</a></p>
</li>
<li>
<p><a href="task-deletenode.html">Para Deletar N&oacute;s</a></p>
</li>
<li>
<p><a href="task-listnodes.html">Para Listar Todos os N&oacute;s no Dom&iacute;nio Atual</a></p>
</li>
<li>
<p><a href="task-editnode.html">Para Editar um N&oacute;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
