<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-create-cluster" name="task-create-cluster"></a><a id="GHCLU00027" name="GHCLU00027"></a></p>

<h4><a id="sthref2" name="sthref2"></a>Para Criar um Cluster</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Um cluster &eacute; um conjunto nomeado de inst&acirc;ncias do GlassFish Server que compartilha as mesmas aplica&ccedil;&otilde;es, recursos e informa&ccedil;&otilde;es de configura&ccedil;&atilde;o.</p>
<p>Um cluster proporciona alta disponibilidade por meio de escalabilidade, balanceamento de carga e prote&ccedil;&atilde;o contra falhas. Quando uma inst&acirc;ncia ou um host de um cluster falha, o GlassFish Server detecta a falha, redireciona as solicita&ccedil;&otilde;es da inst&acirc;ncia falha a outras inst&acirc;ncias do cluster e recupera o estado da sess&atilde;o do usu&aacute;rio. Como os mesmos recursos e aplica&ccedil;&otilde;es est&atilde;o em todas as inst&acirc;ncias do cluster, uma inst&acirc;ncia pode falhar em qualquer outra inst&acirc;ncia do cluster.</p>
<p>O GlassFish Server permite administrar todas as inst&acirc;ncias de um cluster como uma &uacute;nica unidade de um &uacute;nico host, independentemente se as inst&acirc;ncias residem no mesmo host ou em hosts diferentes.</p>
<a id="sthref3" name="sthref3"></a>
<h5>Antes de Come&ccedil;ar</h5>
<p>Se tiver a inten&ccedil;&atilde;o de adicionar inst&acirc;ncias do GlassFish Server ao cluster que estiver criando, certifique-se de que os n&oacute;s nos quais as inst&acirc;ncias devem residir j&aacute; existem.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, selecione o n&oacute; Clusters.</p>
<p>A p&aacute;gina Clusters ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Clusters, clique em Novo.</p>
<p>A p&aacute;gina Novo Cluster ser&aacute; aberta.</p>
</li>
<li>
<p>No campo Nome do Cluster, digite um nome para o cluster.</p>
<p>O nome deve atender aos seguintes requisitos:</p>
<ul>
<li>
<p>O nome s&oacute; pode conter caracteres ASCII.</p>
</li>
<li>
<p>O nome deve come&ccedil;ar com uma letra, um n&uacute;mero ou um sublinhado.</p>
</li>
<li>
<p>O nome pode conter s&oacute; os seguintes caracteres:</p>
<ul>
<li>
<p>Letras min&uacute;sculas</p>
</li>
<li>
<p>Letras mai&uacute;sculas</p>
</li>
<li>
<p>N&uacute;meros</p>
</li>
<li>
<p>H&iacute;fen</p>
</li>
<li>
<p>Ponto</p>
</li>
<li>
<p>Sublinhado</p>
</li>
</ul>
</li>
<li>
<p>O nome deve ser &uacute;nico no dom&iacute;nio e n&atilde;o deve ser o nome de outro cluster, uma configura&ccedil;&atilde;o nomeada, uma inst&acirc;ncia do GlassFish Server ou um n&oacute;.</p>
</li>
<li>
<p>O nome n&atilde;o deve ser <code>domain</code>, <code>server</code>, nem nenhuma outra palavra-chave que esteja reservada pelo GlassFish Server.</p>
</li>
</ul>
</li>
<li>
<p>Na lista drop-down Configura&ccedil;&atilde;o, selecione a configura&ccedil;&atilde;o nomeada que o cluster utilizar&aacute;.</p>

<hr>
<p><b>Observa&ccedil;&atilde;o:</b></p>
Se selecionar <code>default-config</code>, deve especificar na etapa seguinte que a configura&ccedil;&atilde;o <i>n&atilde;o</i> &eacute; compartilhada. A configura&ccedil;&atilde;o <code>default-config</code> n&atilde;o pode ser compartilhada.
<hr>

</li>
<li>
<p>Especifique se a configura&ccedil;&atilde;o que o cluster utilizar&aacute; &eacute; compartilhada.</p>
<ul>
<li>
<p>Se a configura&ccedil;&atilde;o n&atilde;o for compartilhada, deixe marcada a op&ccedil;&atilde;o Fazer uma C&oacute;pia da Configura&ccedil;&atilde;o selecionada.</p>
<p>A configura&ccedil;&atilde;o selecionada ser&aacute; copiada quando o cluster for criado. A c&oacute;pia da configura&ccedil;&atilde;o recebe o nome <i>cluster-name</i><code>-config</code>, em que <i>cluster-name</i> &eacute; o nome do cluster que voc&ecirc; est&aacute; criando.</p>
</li>
<li>
<p>Se a configura&ccedil;&atilde;o for compartilhada, selecione a op&ccedil;&atilde;o Referenciar a Configura&ccedil;&atilde;o Selecionada.</p>
<p>O cluster utilizar&aacute; a configura&ccedil;&atilde;o nomeada existente especificada.</p>
</li>
</ul>
</li>
<li>
<p><a id="sthref4" name="sthref4"></a>Adicionar inst&acirc;ncias do GlassFish Server ao cluster.</p>

<hr>
<p><b>Observa&ccedil;&atilde;o:</b></p>
Para criar uma inst&acirc;ncia em um n&oacute; do tipo CONFIG que represente um host remoto, voc&ecirc; dever&aacute; usar o subcomando <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00044"><code>create-local-instance</code>(1)</a>. N&atilde;o &eacute; poss&iacute;vel utilizar o Console de Administra&ccedil;&atilde;o para este prop&oacute;sito.
<hr>

<p>Voc&ecirc; tamb&eacute;m pode adicionar inst&acirc;ncias ap&oacute;s a cria&ccedil;&atilde;o do cluster, conforme descrito em <a href="task-create-clustered-instance.html">Para Adicionar uma Inst&acirc;ncia de GlassFish Server em um Cluster</a>.</p>
<p>Adicione cada inst&acirc;ncia da seguinte forma:</p>
<ol type="a">
<li>
<p>Na &aacute;rea Inst&acirc;ncias do Servidor a Serem Criadas, clique em Adicionar.</p>
<p>Uma linha &eacute; adicionada &agrave; tabela de inst&acirc;ncias do cluster.</p>
</li>
<li>
<p>No campo Nome da Inst&acirc;ncia, digite um nome para a inst&acirc;ncia.</p>
</li>
<li>
<p>No campo Peso, digite um inteiro que represente o peso do balanceamento de carga da inst&acirc;ncia.</p>
<p>O peso do balanceamento de carga determina a propor&ccedil;&atilde;o de todas as solicita&ccedil;&otilde;es do cluster que a inst&acirc;ncia deve processar.</p>
<p>Por exemplo, em um cluster com duas inst&acirc;ncias, &eacute; poss&iacute;vel processar uma das quatro solicita&ccedil;&otilde;es em uma inst&acirc;ncia e processar tr&ecirc;s das quatro solicita&ccedil;&otilde;es na outra inst&acirc;ncia. Nesta situa&ccedil;&atilde;o, defina como 1 o peso da inst&acirc;ncia que processa uma das quatro solicita&ccedil;&otilde;es e como 3 o peso da outra inst&acirc;ncia. Se preferir utilizar porcentagem, defina os pesos das inst&acirc;ncias como 25 e 75, respectivamente.</p>
<p>O valor default &eacute; 100.</p>
</li>
<li>
<p>Na lista drop-down N&oacute;, selecione o n&oacute; no qual a inst&acirc;ncia deve residir.</p>
</li>
</ol>
</li>
<li>
<p>Clique em OK.</p>
<p>Voc&ecirc; voltar&aacute; &agrave; p&aacute;gina Clusters. O cluster ser&aacute; adicionado &agrave; tabela de clusters na p&aacute;gina.</p>
</li>
</ol>
<a id="sthref5" name="sthref5"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-delete-cluster.html">Para Deletar um Cluster</a></p>
</li>
<li>
<p><a href="task-availabilityservice.html">Para Configurar as Defini&ccedil;&otilde;es de Disponibilidade de um Cluster</a></p>
</li>
<li>
<p><a href="task-start-cluster.html">Para Iniciar um Cluster</a></p>
</li>
<li>
<p><a href="task-stop-cluster.html">Para Interromper um Cluster</a></p>
</li>
<li>
<p><a href="task-modify-cluster-config.html">Para Modificar a Configura&ccedil;&atilde;o de um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-deploy.html">Para Implantar uma Aplica&ccedil;&atilde;o em um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-list.html">Para Listar Aplica&ccedil;&otilde;es Que S&atilde;o Implantadas em um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-undeploy.html">Para Cancelar a Implanta&ccedil;&atilde;o de Aplica&ccedil;&otilde;es de um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-remove.html">Para Remover Aplica&ccedil;&otilde;es de um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-edit.html">Para Editar uma Aplica&ccedil;&atilde;o que &eacute; Implantada em um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-enable-disable.html">Para Ativar ou Desativar uma Aplica&ccedil;&atilde;o que est&aacute; Implantada em um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-lb-enable-disable.html">Para Ativar ou Desativar o Balanceamento de Carga de uma Aplica&ccedil;&atilde;o que foi Implantada em um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-resource-create.html">Para Criar um Recurso para um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-resource-display.html">Para Listar Recursos para um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-resource-enable-disable.html">Para Ativar ou Desativar um Recurso Globalmente</a></p>
</li>
<li>
<p><a href="task-cluster-resource-edit.html">Para Editar um Recurso para um Cluster</a></p>
</li>
<li>
<p><a href="task-upgrade-components.html">Para Fazer Upgrade de Componentes sem Perda de Servi&ccedil;o</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
