<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-create-standalone-instance" name="task-create-standalone-instance"></a></p>

<h4><a id="sthref122" name="sthref122"></a><a id="sthref123" name="sthref123"></a><a id="sthref124" name="sthref124"></a>Para Criar uma Inst&acirc;ncia do GlassFish Server Standalone</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>As inst&acirc;ncias do GlassFish Server formam a base da implanta&ccedil;&atilde;o de uma aplica&ccedil;&atilde;o. Uma inst&acirc;ncia standalone n&atilde;o &eacute; membro de um cluster. Cada inst&acirc;ncia pertence a um &uacute;nico dom&iacute;nio e tem sua pr&oacute;pria estrutura de diret&oacute;rio, configura&ccedil;&atilde;o e aplica&ccedil;&otilde;es implantadas. Cada inst&acirc;ncia tamb&eacute;m inclui o cont&ecirc;iner Web Java Platform, Enterprise Edition (Java EE) e o cont&ecirc;iner da tecnologia Enterprise JavaBeans (tecnologia EJB). Cada inst&acirc;ncia nova deve conter uma refer&ecirc;ncia a um n&oacute; que defina o host no qual a inst&acirc;ncia residir&aacute;.</p>

<hr>
<p><b>Observa&ccedil;&atilde;o:</b></p>
Para criar uma inst&acirc;ncia em um n&oacute; do tipo CONFIG que represente um host remoto, voc&ecirc; dever&aacute; usar o subcomando <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00044"><code>create-local-instance</code>(1)</a>. N&atilde;o &eacute; poss&iacute;vel utilizar o Console de Administra&ccedil;&atilde;o para este prop&oacute;sito.
<hr>

<a id="sthref125" name="sthref125"></a>
<h5>Antes de Come&ccedil;ar</h5>
<p>Certifique-se de que exista o n&oacute; no qual a inst&acirc;ncia dever&aacute; residir. Consulte <a href="task-createnode.html">Para Criar um N&oacute;</a> para obter instru&ccedil;&otilde;es.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, selecione o n&oacute; Inst&acirc;ncias Standalone.</p>
<p>A p&aacute;gina Inst&acirc;ncia de Servidor Standalone ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Inst&acirc;ncias do Servidor Standalone, clique em Novo.</p>
<p>A p&aacute;gina Nova Inst&acirc;ncia de Servidor Standalone ser&aacute; aberta.</p>
</li>
<li>
<p>No campo Nome, digite um nome para a inst&acirc;ncia.</p>
<p>O nome deve atender aos seguintes requisitos:</p>
<ul>
<li>
<p>O nome s&oacute; pode conter caracteres ASCII.</p>
</li>
<li>
<p>O nome deve come&ccedil;ar com uma letra, um n&uacute;mero ou um sublinhado.</p>
</li>
<li>
<p>O nome pode conter s&oacute; os seguintes caracteres:</p>
<ul>
<li>
<p>Letras min&uacute;sculas</p>
</li>
<li>
<p>Letras mai&uacute;sculas</p>
</li>
<li>
<p>N&uacute;meros</p>
</li>
<li>
<p>H&iacute;fen</p>
</li>
<li>
<p>Ponto</p>
</li>
<li>
<p>Sublinhado</p>
</li>
</ul>
</li>
<li>
<p>O nome deve ser &uacute;nico no dom&iacute;nio e n&atilde;o deve ser o nome de outra inst&acirc;ncia, um cluster, uma configura&ccedil;&atilde;o nomeada ou um n&oacute; do GlassFish Server.</p>
</li>
<li>
<p>O nome n&atilde;o deve ser <code>domain</code>, <code>server</code>, nem nenhuma outra palavra-chave que esteja reservada pelo GlassFish Server.</p>
</li>
</ul>
</li>
<li>
<p>Na lista drop-down N&oacute;, selecione o n&oacute; no qual a inst&acirc;ncia residir&aacute;.</p>
</li>
<li>
<p>Na lista drop-down Configura&ccedil;&atilde;o, selecione a configura&ccedil;&atilde;o nomeada que a inst&acirc;ncia utilizar&aacute;.</p>

<hr>
<p><b>Observa&ccedil;&atilde;o:</b></p>
Se selecionar <code>default-config</code>, deve especificar na etapa seguinte que a configura&ccedil;&atilde;o <i>n&atilde;o</i> &eacute; compartilhada. A configura&ccedil;&atilde;o <code>default-config</code> n&atilde;o pode ser compartilhada.
<hr>

</li>
<li>
<p>Especifique se a configura&ccedil;&atilde;o que a inst&acirc;ncia utilizar&aacute; &eacute; compartilhada.</p>
<ul>
<li>
<p>Se a configura&ccedil;&atilde;o n&atilde;o for compartilhada, deixe marcada a op&ccedil;&atilde;o Fazer uma C&oacute;pia da Configura&ccedil;&atilde;o selecionada.</p>
<p>A configura&ccedil;&atilde;o selecionada ser&aacute; copiada quando a inst&acirc;ncia for criada. A c&oacute;pia da configura&ccedil;&atilde;o recebe o nome de <i>instance-name</i><code>-config</code>, em que <i>instance-name</i> &eacute; o nome da inst&acirc;ncia que voc&ecirc; est&aacute; criando.</p>
</li>
<li>
<p>Se a configura&ccedil;&atilde;o for compartilhada, selecione a op&ccedil;&atilde;o Referenciar a Configura&ccedil;&atilde;o Selecionada.</p>
<p>A inst&acirc;ncia utilizar&aacute; a configura&ccedil;&atilde;o nomeada existente especificada.</p>
</li>
</ul>
</li>
<li>
<p>Clique em OK.</p>
</li>
</ol>
<a id="sthref126" name="sthref126"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-delete-standalone-instances.html">Para Deletar Inst&acirc;ncias do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-start-standalone-instances.html">Para Iniciar Inst&acirc;ncias do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-stop-standalone-instances.html">Para Interromper Inst&acirc;ncias do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-view-logs-standalone-instance.html">Para Exibir Arquivos de Log de uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-recovertransactions-standalone-instance.html">Para Recuperar Transa&ccedil;&otilde;es de uma Inst&acirc;ncia de GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-deploy.html">Para Implantar uma Aplica&ccedil;&atilde;o em uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-list.html">Para Listar Aplica&ccedil;&otilde;es Que S&atilde;o Implantadas em uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-undeploy.html">Para Cancelar a Implanta&ccedil;&atilde;o de Aplica&ccedil;&otilde;es de uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-remove.html">Para Remover Aplica&ccedil;&otilde;es de uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-edit.html">Para Editar uma Aplica&ccedil;&atilde;o que &eacute; Implantada em uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-enable-disable.html">Para Ativar ou Desativar uma Aplica&ccedil;&atilde;o que est&aacute; Implantada em uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-lb-enable-disable.html">Para Ativar ou Desativar o Balanceamento de Carga de uma Aplica&ccedil;&atilde;o que foi Implantada em uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-create.html">Para Criar um Recurso para uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-display.html">Para Listar Recursos de uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-enable-disable.html">Para Ativar ou Desativar um Recurso de uma Inst&acirc;ncia de GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-edit.html">Para Editar um Recurso para uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-change-standalone-instance-ports.html">Para Modificar os N&uacute;meros de Porta de uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-set-props-standalone-instance.html">Para Definir Propriedades S&oacute; da Inst&acirc;ncia de uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-mon-app-standalone-instance.html">Para Exibir Dados para Monitoramento da Aplica&ccedil;&atilde;o da Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-mon-server-standalone-instance.html">Para Exibir Dados para Monitoramento do Servidor Virtual da Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-mon-resource-standalone-instance.html">Para Exibir Dados para Monitoramento do Recurso da Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
