<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-create-clustered-instance" name="task-create-clustered-instance"></a><a id="GHCLU00045" name="GHCLU00045"></a></p>

<h4><a id="sthref67" name="sthref67"></a><a id="sthref68" name="sthref68"></a><a id="sthref69" name="sthref69"></a>Para Adicionar uma Inst&acirc;ncia de GlassFish Server em um Cluster</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>As inst&acirc;ncias do GlassFish Server formam a base da implanta&ccedil;&atilde;o de uma aplica&ccedil;&atilde;o. Uma inst&acirc;ncia clusterizada &eacute; um membro de um cluster. Cada inst&acirc;ncia pertence a um &uacute;nico dom&iacute;nio e tem sua pr&oacute;pria estrutura de diret&oacute;rio, configura&ccedil;&atilde;o e aplica&ccedil;&otilde;es implantadas. Cada inst&acirc;ncia tamb&eacute;m inclui o cont&ecirc;iner Web Java Platform, Enterprise Edition (Java EE) e o cont&ecirc;iner da tecnologia Enterprise JavaBeans (tecnologia EJB). Cada inst&acirc;ncia nova deve conter uma refer&ecirc;ncia a um n&oacute; que defina o host no qual a inst&acirc;ncia residir&aacute;.</p>

<hr>
<p><b>Observa&ccedil;&atilde;o:</b></p>
Para criar uma inst&acirc;ncia em um n&oacute; do tipo CONFIG que represente um host remoto, voc&ecirc; dever&aacute; usar o subcomando <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00044"><code>create-local-instance</code>(1)</a>. N&atilde;o &eacute; poss&iacute;vel utilizar o Console de Administra&ccedil;&atilde;o para este prop&oacute;sito.
<hr>

<a id="sthref70" name="sthref70"></a>
<h5>Antes de Come&ccedil;ar</h5>
<p>Certifique-se de que os seguintes itens existam:</p>
<ul>
<li>
<p>O cluster ao qual voc&ecirc; est&aacute; adicionando a inst&acirc;ncia. Consulte <a href="task-create-cluster.html">Para Criar um Cluster</a> para obter instru&ccedil;&otilde;es.</p>
</li>
<li>
<p>O n&oacute; no qual a inst&acirc;ncia deve residir. Consulte <a href="task-createnode.html">Para Criar um N&oacute;</a> para obter instru&ccedil;&otilde;es.</p>
</li>
</ul>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Clusters.</p>
</li>
<li>
<p>No n&oacute; Clusters expandidos, selecione o n&oacute; do cluster.</p>
<p>A p&aacute;gina Informa&ccedil;&otilde;es Gerais do cluster ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Informa&ccedil;&otilde;es Gerais, clique na guia Inst&acirc;ncias.</p>
<p>A p&aacute;gina Inst&acirc;ncias de Servidor Clusterizado ser&aacute; aberta com informa&ccedil;&otilde;es sobre o cluster.</p>
</li>
<li>
<p>Na p&aacute;gina Inst&acirc;ncias de Servidor Clusterizado, clique em Novo.</p>
<p>A p&aacute;gina Nova Inst&acirc;ncia de Servidor Clusterizado ser&aacute; aberta.</p>
</li>
<li>
<p>No campo Nome, digite um nome para a inst&acirc;ncia.</p>
<p>O nome deve atender aos seguintes requisitos:</p>
<ul>
<li>
<p>O nome s&oacute; pode conter caracteres ASCII.</p>
</li>
<li>
<p>O nome deve come&ccedil;ar com uma letra, um n&uacute;mero ou um sublinhado.</p>
</li>
<li>
<p>O nome pode conter s&oacute; os seguintes caracteres:</p>
<ul>
<li>
<p>Letras min&uacute;sculas</p>
</li>
<li>
<p>Letras mai&uacute;sculas</p>
</li>
<li>
<p>N&uacute;meros</p>
</li>
<li>
<p>H&iacute;fen</p>
</li>
<li>
<p>Ponto</p>
</li>
<li>
<p>Sublinhado</p>
</li>
</ul>
</li>
<li>
<p>O nome deve ser &uacute;nico no dom&iacute;nio e n&atilde;o deve ser o nome de outra inst&acirc;ncia, um cluster, uma configura&ccedil;&atilde;o nomeada ou um n&oacute; do GlassFish Server.</p>
</li>
<li>
<p>O nome n&atilde;o deve ser <code>domain</code>, <code>server</code>, nem nenhuma outra palavra-chave que esteja reservada pelo GlassFish Server.</p>
</li>
</ul>
</li>
<li>
<p>Na lista drop-down N&oacute;, selecione o n&oacute; no qual a inst&acirc;ncia residir&aacute;.</p>
</li>
<li>
<p>Clique em OK.</p>
</li>
</ol>
<a id="sthref71" name="sthref71"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-delete-clustered-instances.html">Para Deletar Inst&acirc;ncias do GlassFish Server Clusterizadas</a></p>
</li>
<li>
<p><a href="task-start-clustered-instances.html">Para Iniciar Inst&acirc;ncias do GlassFish Server Clusterizadas</a></p>
</li>
<li>
<p><a href="task-stop-clustered-instances.html">Para Interromper Inst&acirc;ncias do GlassFish Server Clusterizadas</a></p>
</li>
<li>
<p><a href="task-view-logs-clustered-instance.html">Para Exibir Arquivos de Log de uma Inst&acirc;ncia Clusterizada do GlassFish Server</a></p>
</li>
<li>
<p><a href="task-recovertransactions.html">Para Recuperar Transa&ccedil;&otilde;es de uma Inst&acirc;ncia de GlassFish Server Clusterizada</a></p>
</li>
<li>
<p><a href="task-change-clustered-instance-ports.html">Para Modificar os N&uacute;meros de Porta de uma Inst&acirc;ncia do GlassFish Server Clusterizada</a></p>
</li>
<li>
<p><a href="task-set-props-clustered-instance.html">Para Definir Propriedades S&oacute; da Inst&acirc;ncia de uma Inst&acirc;ncia do GlassFish Server Clusterizada</a></p>
</li>
<li>
<p><a href="task-mon-app-clustered-instance.html">Para Exibir Dados para Monitoramento da Aplica&ccedil;&atilde;o da Inst&acirc;ncia do GlassFish Server Clusterizada</a></p>
</li>
<li>
<p><a href="task-mon-server-clustered-instance.html">Para Exibir Dados para Monitoramento do Servidor Virtual da Inst&acirc;ncia do GlassFish Server Clusterizada</a></p>
</li>
<li>
<p><a href="task-mon-resource-clustered-instance.html">Para Exibir Dados para Monitoramento do Recurso da Inst&acirc;ncia do GlassFish Server Clusterizada</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
