<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-change-clustered-instance-ports" name="task-change-clustered-instance-ports"></a></p>

<h4><a id="sthref95" name="sthref95"></a><a id="sthref96" name="sthref96"></a><a id="sthref97" name="sthref97"></a>Para Modificar os N&uacute;meros de Porta de uma Inst&acirc;ncia do GlassFish Server Clusterizada</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Os n&uacute;meros de porta de uma inst&acirc;ncia clusterizada do GlassFish Server s&atilde;o definidos inicialmente na configura&ccedil;&atilde;o que a inst&acirc;ncia herda do cluster pai. &Eacute; necess&aacute;rio modificar estes n&uacute;meros de porta se, por exemplo, duas inst&acirc;ncias clusterizadas residirem no mesmo host. Nesse caso, os n&uacute;meros de porta de uma inst&acirc;ncia devem ser modificados porque ambas as inst&acirc;ncias compartilham a mesma configura&ccedil;&atilde;o.</p>
<p>Os n&uacute;meros de porta de uma inst&acirc;ncia s&atilde;o armazenados como propriedades de sistema Java. Essas propriedades s&atilde;o passadas para o acionador da aplica&ccedil;&atilde;o Java por meio da op&ccedil;&atilde;o <code>-D</code> do acionador da aplica&ccedil;&atilde;o Java quando o GlassFish Server &eacute; iniciado.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Clusters.</p>
</li>
<li>
<p>No n&oacute; Clusters expandidos, selecione o n&oacute; do cluster.</p>
<p>A p&aacute;gina Informa&ccedil;&otilde;es Gerais do cluster ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Informa&ccedil;&otilde;es Gerais, clique na guia Inst&acirc;ncias.</p>
<p>A p&aacute;gina Inst&acirc;ncias de Servidor Clusterizado ser&aacute; aberta com informa&ccedil;&otilde;es sobre o cluster.</p>
</li>
<li>
<p>Selecione a inst&acirc;ncia cujos n&uacute;meros de porta deseja modificar.</p>
<p>A p&aacute;gina Informa&ccedil;&otilde;es Gerais da inst&acirc;ncia se abre.</p>
</li>
<li>
<p>Na p&aacute;gina Informa&ccedil;&otilde;es Gerais, clique na guia Propriedades.</p>
<p>A p&aacute;gina Propriedades de Sistema da Inst&acirc;ncia ser&aacute; aberta.</p>
<p>Esta p&aacute;gina exibe os valores atuais das seguintes propriedades do sistema para a inst&acirc;ncia:</p>
<ul>
<li>
<p><a href="../../../common/en/help/ref-predefinedconfigsysproperties.html">N&uacute;meros de porta predefinidos na configura&ccedil;&atilde;o da inst&acirc;ncia</a></p>
</li>
<li>
<p>Propriedades personalizadas definidas para a inst&acirc;ncia, se houver</p>
</li>
</ul>
</li>
<li>
<p>Digite o novo valor de cada propriedade que estiver sendo modificada no campo Valor Substituto.</p>
</li>
<li>
<p>Defina os valores de quaisquer propriedades adicionais que forem necess&aacute;rias.</p>
<ol type="a">
<li>
<p>Na tabela Propriedades Adicionais, clique em Adicionar Propriedade.</p>
<p>Uma linha &eacute; adicionada &agrave; tabela Propriedades Adicionais.</p>
</li>
<li>
<p>No campo Nome da Vari&aacute;vel da Inst&acirc;ncia, digite o nome da propriedade.</p>
</li>
<li>
<p>No campo Valor Substituto, digite o valor.</p>
</li>
</ol>
</li>
<li>
<p>Clique em Salvar.</p>
</li>
</ol>
<a id="sthref98" name="sthref98"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-create-clustered-instance.html">Para Adicionar uma Inst&acirc;ncia de GlassFish Server a um Cluster</a></p>
</li>
<li>
<p><a href="task-delete-clustered-instances.html">Para Deletar Inst&acirc;ncias do GlassFish Server Clusterizadas</a></p>
</li>
<li>
<p><a href="task-start-clustered-instances.html">Para Iniciar Inst&acirc;ncias do GlassFish Server Clusterizadas</a></p>
</li>
<li>
<p><a href="task-stop-clustered-instances.html">Para Interromper Inst&acirc;ncias do GlassFish Server Clusterizadas</a></p>
</li>
<li>
<p><a href="task-view-logs-clustered-instance.html">Para Exibir Arquivos de Log de uma Inst&acirc;ncia Clusterizada do GlassFish Server</a></p>
</li>
<li>
<p><a href="task-recovertransactions.html">Para Recuperar Transa&ccedil;&otilde;es de uma Inst&acirc;ncia de GlassFish Server Clusterizada</a></p>
</li>
<li>
<p><a href="task-set-props-clustered-instance.html">Para Definir Propriedades S&oacute; da Inst&acirc;ncia de uma Inst&acirc;ncia do GlassFish Server Clusterizada</a></p>
</li>
<li>
<p><a href="task-mon-app-clustered-instance.html">Para Exibir Dados para Monitoramento da Aplica&ccedil;&atilde;o da Inst&acirc;ncia do GlassFish Server Clusterizada</a></p>
</li>
<li>
<p><a href="task-mon-server-clustered-instance.html">Para Exibir Dados para Monitoramento do Servidor Virtual da Inst&acirc;ncia do GlassFish Server Clusterizada</a></p>
</li>
<li>
<p><a href="task-mon-resource-clustered-instance.html">Para Exibir Dados para Monitoramento do Recurso da Inst&acirc;ncia do GlassFish Server Clusterizada</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
