<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-availabilityservice" name="task-availabilityservice"></a></p>

<h4><a id="sthref9" name="sthref9"></a><a id="sthref10" name="sthref10"></a><a id="sthref11" name="sthref11"></a><a id="sthref12" name="sthref12"></a>Para Configurar as Defini&ccedil;&otilde;es de Disponibilidade de um Cluster</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&atilde;o.</p>
</li>
<li>
<p>Selecione a configura&ccedil;&atilde;o do cluster que est&aacute; sendo alterado.</p>
</li>
<li>
<p>No n&oacute; da configura&ccedil;&atilde;o, selecione o n&oacute; Servi&ccedil;o de Disponibilidade.</p>
<p>A p&aacute;gina Servi&ccedil;o de Disponibilidade ser&aacute; aberta.</p>
</li>
<li>
<p>No campo Servi&ccedil;o de Disponibilidade, marque a caixa Ativado para ativar a disponibilidade do cluster com a configura&ccedil;&atilde;o selecionada.</p>
<p>Para desativar a disponibilidade, desmarque a caixa Servi&ccedil;o de Disponibilidade Ativado.</p>
</li>
<li>
<p>Na se&ccedil;&atilde;o Propriedades Adicionais, especifique as propriedades adicionais.</p>
<p>O GlassFish Server n&atilde;o define nenhuma propriedade adicional da disponibilidade do cluster.</p>
<ul>
<li>
<p>Para adicionar uma propriedade, clique no bot&atilde;o Adicionar Propriedade. Na linha em branco que for exibida, digite o nome da propriedade no campo Nome e digite o valor da propriedade no campo Valor.</p>
</li>
<li>
<p>Para modificar uma propriedade, edite o campo Valor da propriedade.</p>
</li>
<li>
<p>Para deletar uma propriedade, marque a caixa de sele&ccedil;&atilde;o &agrave; esquerda do campo Nome da Propriedade a ser deletada. Clique no bot&atilde;o Deletar Propriedades.</p>
</li>
</ul>
</li>
<li>
<p>Clique em Salvar.</p>
</li>
</ol>
<a id="sthref13" name="sthref13"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-create-cluster.html">Para Criar um Cluster</a></p>
</li>
<li>
<p><a href="task-delete-cluster.html">Para Deletar um Cluster</a></p>
</li>
<li>
<p><a href="task-start-cluster.html">Para Iniciar um Cluster</a></p>
</li>
<li>
<p><a href="task-stop-cluster.html">Para Interromper um Cluster</a></p>
</li>
<li>
<p><a href="task-modify-cluster-config.html">Para Modificar a Configura&ccedil;&atilde;o de um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-deploy.html">Para Implantar uma Aplica&ccedil;&atilde;o em um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-list.html">Para Listar Aplica&ccedil;&otilde;es Que S&atilde;o Implantadas em um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-undeploy.html">Para Cancelar a Implanta&ccedil;&atilde;o de Aplica&ccedil;&otilde;es de um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-remove.html">Para Remover Aplica&ccedil;&otilde;es de um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-edit.html">Para Editar uma Aplica&ccedil;&atilde;o que &eacute; Implantada em um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-enable-disable.html">Para Ativar ou Desativar uma Aplica&ccedil;&atilde;o que est&aacute; Implantada em um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-lb-enable-disable.html">Para Ativar ou Desativar o Balanceamento de Carga de uma Aplica&ccedil;&atilde;o que foi Implantada em um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-resource-create.html">Para Criar um Recurso para um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-resource-display.html">Para Listar Recursos para um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-resource-enable-disable.html">Para Ativar ou Desativar um Recurso Globalmente</a></p>
</li>
<li>
<p><a href="task-cluster-resource-edit.html">Para Editar um Recurso para um Cluster</a></p>
</li>
<li>
<p><a href="task-upgrade-components.html">Para Fazer Upgrade de Componentes sem Perda de Servi&ccedil;o</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
