<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-start-cluster" name="task-start-cluster"></a></p>

<h4><a id="sthref14" name="sthref14"></a>Para Iniciar um Cluster</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Iniciar um cluster inicial todas as inst&acirc;ncias de GlassFish Server no cluster que ainda n&atilde;o foram executadas.</p>
<a id="sthref15" name="sthref15"></a>
<h5>Antes de Come&ccedil;ar</h5>
<p>Certifique-se de que os seguintes pr&eacute;-requisitos foram atendidos:</p>
<ul>
<li>
<p>Todos os n&oacute;s nos quais se encontram as inst&acirc;ncias do cluster est&atilde;o ativados para comunica&ccedil;&atilde;o remota.</p>
</li>
<li>
<p>O usu&aacute;rio do servidor de administra&ccedil;&atilde;o de dom&iacute;nios (DAS) pode usar o protocolo remoto DCOM (Distributed Component Object Model) ou secure shell (SSH) para efetuar log-in no host para qualquer n&oacute; em que residam as inst&acirc;ncias no cluster.</p>
</li>
</ul>
<p>Se algum desses pr&eacute;-requisitos n&atilde;o for atendido, inicie o cluster, iniciando cada inst&acirc;ncia individualmente pela linha de comandos, usando o subcomando <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00237"><code>start-local-instance</code>(1)</a>.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, selecione o n&oacute; Clusters.</p>
<p>A p&aacute;gina Clusters ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Clusters, marque a caixa de sele&ccedil;&atilde;o ao lado do nome do cluster.</p>
</li>
<li>
<p>Clique em Iniciar Cluster.</p>
<p>Ser&aacute; solicitado que voc&ecirc; confirme se deseja iniciar o cluster.</p>
</li>
<li>
<p>Confirme se deseja iniciar o cluster.</p>
<p>O cluster ser&aacute; iniciado. O status de cada inst&acirc;ncia do cluster ser&aacute; atualizado na p&aacute;gina Clusters quando a inst&acirc;ncia for iniciada.</p>
</li>
</ol>
<a id="sthref16" name="sthref16"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-create-cluster.html">Para Criar um Cluster</a></p>
</li>
<li>
<p><a href="task-delete-cluster.html">Para Deletar um Cluster</a></p>
</li>
<li>
<p><a href="task-availabilityservice.html">Para Configurar as Defini&ccedil;&otilde;es de Disponibilidade de um Cluster</a></p>
</li>
<li>
<p><a href="task-stop-cluster.html">Para Interromper um Cluster</a></p>
</li>
<li>
<p><a href="task-modify-cluster-config.html">Para Modificar a Configura&ccedil;&atilde;o de um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-deploy.html">Para Implantar uma Aplica&ccedil;&atilde;o em um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-list.html">Para Listar Aplica&ccedil;&otilde;es Que S&atilde;o Implantadas em um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-undeploy.html">Para Cancelar a Implanta&ccedil;&atilde;o de Aplica&ccedil;&otilde;es de um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-remove.html">Para Remover Aplica&ccedil;&otilde;es de um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-edit.html">Para Editar uma Aplica&ccedil;&atilde;o que &eacute; Implantada em um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-enable-disable.html">Para Ativar ou Desativar uma Aplica&ccedil;&atilde;o que est&aacute; Implantada em um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-lb-enable-disable.html">Para Ativar ou Desativar o Balanceamento de Carga de uma Aplica&ccedil;&atilde;o que foi Implantada em um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-resource-create.html">Para Criar um Recurso para um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-resource-display.html">Para Listar Recursos para um Cluster</a></p>
</li>
<li>
<p><a href="task-cluster-resource-enable-disable.html">Para Ativar ou Desativar um Recurso Globalmente</a></p>
</li>
<li>
<p><a href="task-cluster-resource-edit.html">Para Editar um Recurso para um Cluster</a></p>
</li>
<li>
<p><a href="task-upgrade-components.html">Para Fazer Upgrade de Componentes sem Perda de Servi&ccedil;o</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
