<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-migrate-ejb-timers" name="task-migrate-ejb-timers"></a><a id="GHCLU00085" name="GHCLU00085"></a></p>

<h4><a id="sthref240" name="sthref240"></a><a id="sthref241" name="sthref241"></a><a id="sthref242" name="sthref242"></a>Para Migrar Timers EJB</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Se uma inst&acirc;ncia do GlassFish Server for interrompida, os timers da tecnologia Enterprise JavaBeans (EJB) instalados em tal inst&acirc;ncia tamb&eacute;m interrompem a execu&ccedil;&atilde;o. Se a inst&acirc;ncia foi interrompida de forma anormal ou inesperada, para permitir que estes timers funcionem enquanto a inst&acirc;ncia estiver interrompida, &eacute; necess&aacute;rio migrar os timers para uma inst&acirc;ncia do servidor em execu&ccedil;&atilde;o no cluster.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Clusters.</p>
</li>
<li>
<p>No n&oacute; Clusters da &aacute;rvore de navega&ccedil;&atilde;o, selecione o cluster.</p>
<p>A p&aacute;gina Informa&ccedil;&otilde;es Gerais do cluster ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Informa&ccedil;&otilde;es Gerais, clique em Migrar Timers EJB.</p>
<p>A p&aacute;gina Migrar Timers EJB ser&aacute; aberta.</p>

<hr>
<p><b>Observa&ccedil;&atilde;o:</b></p>
Se todas as inst&acirc;ncias do cluster estiverem em execu&ccedil;&atilde;o, o bot&atilde;o Migrar Timers EJB ficar&aacute; desativado.
<hr>

<p>Para ajud&aacute;-lo na migra&ccedil;&atilde;o de timers, a p&aacute;gina Migrar Timers de EJB cont&eacute;m uma tabela de timers de EJB com as informa&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Nome do Servidor</dt>
<dd>
<p>Lista de inst&acirc;ncias de GlassFish Server no cluster.</p>
</dd>
<dt>Contagem do Timer</dt>
<dd>
<p>N&uacute;mero de timers persist&ecirc;ncias em cada inst&acirc;ncia.</p>
</dd>
</dl>
</li>
<li>
<p>Na p&aacute;gina Migrar Timers EJB, selecione a inst&acirc;ncia da qual e para a qual migrar os Timers.</p>
<ol type="a">
<li>
<p>Na lista drop-down Origem, selecione a inst&acirc;ncia interrompida da qual migrar os timers.</p>
</li>
<li>
<p>Na lista drop-down Destino, selecione a inst&acirc;ncia em execu&ccedil;&atilde;o para a qual migrar os timers.</p>
</li>
<li>
<p>Clique em OK.</p>
</li>
</ol>
</li>
</ol>
<p>Se a inst&acirc;ncia de origem estiver em execu&ccedil;&atilde;o ou se a inst&acirc;ncia de destino n&atilde;o estiver em execu&ccedil;&atilde;o, o Console de Administra&ccedil;&atilde;o exibe uma mensagem de erro.</p>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
