<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-recovertransactions" name="task-recovertransactions"></a></p>

<h4><a id="sthref91" name="sthref91"></a><a id="sthref92" name="sthref92"></a><a id="sthref93" name="sthref93"></a>Para Recuperar Transa&ccedil;&otilde;es de uma Inst&acirc;ncia de GlassFish Server Clusterizada</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Clusters.</p>
</li>
<li>
<p>No n&oacute; Clusters expandidos, selecione o n&oacute; do cluster.</p>
<p>A p&aacute;gina Informa&ccedil;&otilde;es Gerais do cluster ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Informa&ccedil;&otilde;es Gerais, clique na guia Inst&acirc;ncias.</p>
<p>A p&aacute;gina Inst&acirc;ncias de Servidor Clusterizado ser&aacute; aberta com informa&ccedil;&otilde;es sobre o cluster.</p>
</li>
<li>
<p>Selecione a inst&acirc;ncia para a qual &eacute; necess&aacute;ria a recupera&ccedil;&atilde;o de transa&ccedil;&otilde;es.</p>
<p>A p&aacute;gina Informa&ccedil;&otilde;es Gerais da inst&acirc;ncia se abre.</p>
</li>
<li>
<p>Na p&aacute;gina Informa&ccedil;&otilde;es Gerais, clique em Recuperar Transa&ccedil;&otilde;es.</p>
<p>A p&aacute;gina Recuperar Transa&ccedil;&otilde;es se abre.</p>
<p>O conte&uacute;do da p&aacute;gina depende se a inst&acirc;ncia est&aacute; ou n&atilde;o em execu&ccedil;&atilde;o.</p>
<ul>
<li>
<p>Se a inst&acirc;ncia estiver em execu&ccedil;&atilde;o, a p&aacute;gina Recuperar Transa&ccedil;&otilde;es cont&eacute;m somente o texto <b>A recupera&ccedil;&atilde;o &eacute; realizada pelo pr&oacute;prio servidor em execu&ccedil;&atilde;o</b> e o bot&atilde;o OK.</p>
</li>
<li>
<p>Se a inst&acirc;ncia n&atilde;o estiver em execu&ccedil;&atilde;o, a p&aacute;gina Recuperar Transa&ccedil;&otilde;es cont&eacute;m op&ccedil;&otilde;es adicionais.</p>
</li>
</ul>
</li>
<li>
<p>Na lista drop-down Servidor de Destino, selecione outra inst&acirc;ncia no mesmo cluster que pode recuperar as transa&ccedil;&otilde;es na inst&acirc;ncia atual.</p>
</li>
<li>
<p>No campo Diret&oacute;rio de Log de Transa&ccedil;&otilde;es, digite o diret&oacute;rio em que os logs de transa&ccedil;&atilde;o s&atilde;o armazenados.</p>
<p>O default &eacute; <code>/logs/tx</code> no diret&oacute;rio de dom&iacute;nio. Os logs de transa&ccedil;&atilde;o s&atilde;o mantidos no subdiret&oacute;rio <code>tx</code> do diret&oacute;rio especificado pela defini&ccedil;&atilde;o do Localiza&ccedil;&atilde;o do Log de Transa&ccedil;&otilde;es do Servi&ccedil;o de Transa&ccedil;&atilde;o na configura&ccedil;&atilde;o do cluster. O valor default do Localiza&ccedil;&atilde;o do Log de Transa&ccedil;&otilde;es &eacute; o diret&oacute;rio especificado pelo campo Raiz de Log da p&aacute;gina Atributos do Dom&iacute;nio, que est&aacute; localizado na guia Avan&ccedil;ado do n&oacute; do GlassFish Server.</p>
</li>
<li>
<p>Clique em OK.</p>
</li>
</ol>
<a id="sthref94" name="sthref94"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-create-clustered-instance.html">Para Adicionar uma Inst&acirc;ncia de GlassFish Server a um Cluster</a></p>
</li>
<li>
<p><a href="task-delete-clustered-instances.html">Para Deletar Inst&acirc;ncias do GlassFish Server Clusterizadas</a></p>
</li>
<li>
<p><a href="task-start-clustered-instances.html">Para Iniciar Inst&acirc;ncias do GlassFish Server Clusterizadas</a></p>
</li>
<li>
<p><a href="task-stop-clustered-instances.html">Para Interromper Inst&acirc;ncias do GlassFish Server Clusterizadas</a></p>
</li>
<li>
<p><a href="task-view-logs-clustered-instance.html">Para Exibir Arquivos de Log de uma Inst&acirc;ncia Clusterizada do GlassFish Server</a></p>
</li>
<li>
<p><a href="task-change-clustered-instance-ports.html">Para Modificar os N&uacute;meros de Porta de uma Inst&acirc;ncia do GlassFish Server Clusterizada</a></p>
</li>
<li>
<p><a href="task-set-props-clustered-instance.html">Para Definir Propriedades S&oacute; da Inst&acirc;ncia de uma Inst&acirc;ncia do GlassFish Server Clusterizada</a></p>
</li>
<li>
<p><a href="task-mon-app-clustered-instance.html">Para Exibir Dados para Monitoramento da Aplica&ccedil;&atilde;o da Inst&acirc;ncia do GlassFish Server Clusterizada</a></p>
</li>
<li>
<p><a href="task-mon-server-clustered-instance.html">Para Exibir Dados para Monitoramento do Servidor Virtual da Inst&acirc;ncia do GlassFish Server Clusterizada</a></p>
</li>
<li>
<p><a href="task-mon-resource-clustered-instance.html">Para Exibir Dados para Monitoramento do Recurso da Inst&acirc;ncia do GlassFish Server Clusterizada</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
