<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-standalone-instance-resource-enable-disable" name="task-standalone-instance-resource-enable-disable"></a></p>

<h4><a id="sthref182" name="sthref182"></a><a id="sthref183" name="sthref183"></a><a id="sthref184" name="sthref184"></a><a id="sthref185" name="sthref185"></a>Para Ativar ou Desativar um Recurso de uma Inst&acirc;ncia de GlassFish Server Standalone</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, selecione o n&oacute; Inst&acirc;ncias Standalone.</p>
<p>A p&aacute;gina Inst&acirc;ncia de Servidor Standalone ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Inst&acirc;ncia de Servidor Standalone, selecione a inst&acirc;ncia.</p>
<p>A p&aacute;gina Informa&ccedil;&otilde;es Gerais da inst&acirc;ncia se abre.</p>
</li>
<li>
<p>Na p&aacute;gina Informa&ccedil;&otilde;es Gerais, clique na guia Recursos.</p>
<p>A p&aacute;gina Recursos da inst&acirc;ncia se abre.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o ao lado do recurso.</p>
</li>
<li>
<p>Clique no bot&atilde;o apropriado.</p>
<ul>
<li>
<p>Para ativar o recurso, escolha Ativar.</p>
</li>
<li>
<p>Para desativar o recurso, escolha Desativar.</p>
<p>A desativa&ccedil;&atilde;o de um recurso n&atilde;o o remove.</p>
</li>
</ul>
</li>
</ol>
<a id="sthref186" name="sthref186"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-create-standalone-instance.html">Para Criar uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-delete-standalone-instances.html">Para Deletar Inst&acirc;ncias do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-start-standalone-instances.html">Para Iniciar Inst&acirc;ncias do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-stop-standalone-instances.html">Para Interromper Inst&acirc;ncias do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-view-logs-standalone-instance.html">Para Exibir Arquivos de Log de uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-recovertransactions-standalone-instance.html">Para Recuperar Transa&ccedil;&otilde;es de uma Inst&acirc;ncia de GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-deploy.html">Para Implantar uma Aplica&ccedil;&atilde;o em uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-list.html">Para Listar Aplica&ccedil;&otilde;es Que S&atilde;o Implantadas em uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-undeploy.html">Para Cancelar a Implanta&ccedil;&atilde;o de Aplica&ccedil;&otilde;es de uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-remove.html">Para Remover Aplica&ccedil;&otilde;es de uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-edit.html">Para Editar uma Aplica&ccedil;&atilde;o que &eacute; Implantada em uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-enable-disable.html">Para Ativar ou Desativar uma Aplica&ccedil;&atilde;o que est&aacute; Implantada em uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-lb-enable-disable.html">Para Ativar ou Desativar o Balanceamento de Carga de uma Aplica&ccedil;&atilde;o que foi Implantada em uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-create.html">Para Criar um Recurso para uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-display.html">Para Listar Recursos de uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-edit.html">Para Editar um Recurso para uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-change-standalone-instance-ports.html">Para Modificar os N&uacute;meros de Porta de uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-set-props-standalone-instance.html">Para Definir Propriedades S&oacute; da Inst&acirc;ncia de uma Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-mon-app-standalone-instance.html">Para Exibir Dados para Monitoramento da Aplica&ccedil;&atilde;o da Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-mon-server-standalone-instance.html">Para Exibir Dados para Monitoramento do Servidor Virtual da Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
<li>
<p><a href="task-mon-resource-standalone-instance.html">Para Exibir Dados para Monitoramento do Recurso da Inst&acirc;ncia do GlassFish Server Standalone</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
