<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-transactionservice" name="ref-transactionservice"></a><a id="GHJTS00002" name="GHJTS00002"></a></p>

<h4><a id="sthref14" name="sthref14"></a>Servi&ccedil;o de Transa&ccedil;&atilde;o</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Servi&ccedil;o de Transa&ccedil;&atilde;o para configurar recupera&ccedil;&atilde;o, time-out e log de transa&ccedil;&atilde;o.</p>
<p>A p&aacute;gina Servi&ccedil;o de Transa&ccedil;&atilde;o cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Carregar Defaults</dt>
<dd>
<p>Bot&atilde;o para restaurar defini&ccedil;&otilde;es para seus valores default. Defini&ccedil;&otilde;es que n&atilde;o tiveram seus valores default alterados.</p>
</dd>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Ao Reiniciar</dt>
<dd>
<p>Se a caixa de sele&ccedil;&atilde;o Ativado estiver marcada, o GlassFish Server tentar&aacute; recuperar as transa&ccedil;&otilde;es incompletas quando o servidor for reiniciado. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Time-out da Transa&ccedil;&atilde;o</dt>
<dd>
<p>N&uacute;mero de segundos que o servidor aguarda antes de reverter uma transa&ccedil;&atilde;o n&atilde;o conclu&iacute;da. O valor default &eacute; 0, significando que o servidor aguarda indefinidamente que uma transa&ccedil;&atilde;o seja conclu&iacute;da.</p>
</dd>
<dt>Time-out p/Novas Tentativas</dt>
<dd>
<p>N&uacute;mero de segundos em que o GlassFish Server tenta se conectar a um servidor inacess&iacute;vel. O valor default &eacute; 600 (10 minutos).</p>
</dd>
<dt>Localiza&ccedil;&atilde;o do Log de Transa&ccedil;&otilde;es</dt>
<dd>
<p>O diret&oacute;rio no qual os logs do servidor s&atilde;o mantidos. Os logs de transa&ccedil;&atilde;o s&atilde;o mantidos no subdiret&oacute;rio <code>tx</code> do diret&oacute;rio especificado neste campo. O valor default &eacute; o diret&oacute;rio especificado pelo campo Raiz de Logs da p&aacute;gina Atributos de Dom&iacute;nio, que est&aacute; localizada na guia Avan&ccedil;ado do n&oacute; do GlassFish Server.</p>
</dd>
<dt>Decis&atilde;o Heur&iacute;stica</dt>
<dd>
<p>Define se as transa&ccedil;&otilde;es envolvendo servidores inacess&iacute;veis devem ser confirmadas ou revertidas. O valor default &eacute; Reverter. A confirma&ccedil;&atilde;o de transa&ccedil;&otilde;es indeterminadas pode comprometer a integridade dos dados da aplica&ccedil;&atilde;o.</p>
</dd>
<dt>Intervalo de Keypoint</dt>
<dd>
<p>O n&uacute;mero de transa&ccedil;&otilde;es entre as opera&ccedil;&otilde;es de ponto-chave, que compacta o arquivo de log de transa&ccedil;&atilde;o. O valor default &eacute; 65536.</p>
</dd>
<dt>Propriedades Adicionais</dt>
<dd>
<p>As propriedades adicionais do Servi&ccedil;o de Transa&ccedil;&atilde;o.</p>
<p>Para obter uma descri&ccedil;&atilde;o das propriedades dispon&iacute;veis, consulte <a href="ref-transactionsvcproperties.html">Propriedades Espec&iacute;ficas para o Servi&ccedil;o de Transa&ccedil;&atilde;o</a>.</p>
</dd>
</dl>
<a id="sthref15" name="sthref15"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-configtransservice.html">Para Configurar o Servi&ccedil;o de Transa&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-configtransrecovery.html">Para Configurar Como o GlassFish Server Recupera as Transa&ccedil;&otilde;es</a></p>
</li>
<li>
<p><a href="task-settranstimeout.html">Para Definir um Valor de Time-out da Transa&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-settranslog.html">Para Definir a Localiza&ccedil;&atilde;o de Logs da Transa&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-setkeyptinterval.html">Para Definir o Intervalo de Keypoint</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
