<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-transactionsvcproperties" name="ref-transactionsvcproperties"></a><a id="GHJTS00003" name="GHJTS00003"></a></p>

<h4><a id="sthref16" name="sthref16"></a><a id="sthref17" name="sthref17"></a>Propriedades Espec&iacute;ficas para o Servi&ccedil;o de Transa&ccedil;&atilde;o</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>As propriedades a seguir est&atilde;o dispon&iacute;veis para configura&ccedil;&atilde;o do Servi&ccedil;o de Transa&ccedil;&atilde;o.</p>
<dl>
<dt><code>oracle-xa-recovery-workaround</code></dt>
<dd>
<p>Se definido como <code>verdadeiro</code>, a solu&ccedil;&atilde;o alternativa Oracle XA Resource ser&aacute; utilizada na recupera&ccedil;&atilde;o da transa&ccedil;&atilde;o. O valor default &eacute; <code>true</code>.</p>
</dd>
<dt><code>disable-distributed-transaction-logging</code></dt>
<dd>
<p>Se definido como <code>verdadeiro</code>, desativa o log de transa&ccedil;&atilde;o, o que pode melhorar o desempenho. Se a caixa de sele&ccedil;&atilde;o Ativado Ao Reiniciar estiver marcada, essa propriedade ser&aacute; ignorada. O valor default &eacute; <code>false</code>.</p>
</dd>
<dt><code>xaresource-txn-timeout</code></dt>
<dd>
<p>Altera o time-out <code>XAResource</code>. Em alguns casos, o time-out default <code>XAResource</code> pode fazer com que transa&ccedil;&otilde;es sejam abortadas. Por isso, &eacute; aconselh&aacute;vel alter&aacute;-lo. O valor default &eacute; especifico para o <code>XAResource</code> usado.</p>
</dd>
<dt><code>pending-txn-cleanup-interval</code></dt>
<dd>
<p>Especifica o intervalo, em segundos, em que um thread ass&iacute;ncrono verifica se h&aacute; transa&ccedil;&otilde;es pendentes e as conclui. Se essa propriedade n&atilde;o for especificada, n&atilde;o haver&aacute; nenhum default a ser aplicado. Se a propriedade estiver presente, mas n&atilde;o incluir nenhum valor, o valor default ser&aacute; 60.</p>
</dd>
<dt><code>use-last-agent-optimization</code></dt>
<dd>
<p>Se definido como <code>true</code>, ativa a otimiza&ccedil;&atilde;o do &uacute;ltimo agente, o que melhora o resultado das transa&ccedil;&otilde;es. Se um recurso n&atilde;o-XA for utilizado com recursos XA na mesma transa&ccedil;&atilde;o, o recurso n&atilde;o-XA ser&aacute; o &uacute;ltimo agente. O valor default &eacute; <code>true</code>.</p>
</dd>
<dt><code>delegated-recovery</code></dt>
<dd>
<p>Se definido como <code>true</code>, a recupera&ccedil;&atilde;o delegada em todo o cluster ser&aacute; ativada. O valor default &eacute; falso.</p>
</dd>
<dt><code>wait-time-before-recovery-insec</code></dt>
<dd>
<p>Especifica o tempo de espera, em segundos, ap&oacute;s o qual uma inst&acirc;ncia iniciar&aacute; a recupera&ccedil;&atilde;o de uma inst&acirc;ncia inativa.</p>
</dd>
<dt><code>db-logging-resource</code></dt>
<dd>
<p>Especifica o nome JNDI do recurso JDBC para o banco de dados em que as transa&ccedil;&otilde;es est&atilde;o registradas em log. Para obter mais informa&ccedil;&otilde;es, consulte<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDVG00018">Cap&iacute;tulo 17,<i>Using the Transaction Service,</i> em <i>Oracle GlassFish Server Application Development Guide</i></a>. N&atilde;o h&aacute; valor default.</p>
</dd>
<dt><code>xa-servername</code></dt>
<dd>
<p>Especifica o nome de host utilizado pelo servi&ccedil;o de transa&ccedil;&atilde;o para identificar as transa&ccedil;&otilde;es gerenciadas pelo GlassFish Server instalado. Isso pode, &agrave;s vezes, ser &uacute;til para a recupera&ccedil;&atilde;o de transa&ccedil;&otilde;es do arquivo de log criado em outro host com GlassFish Server em execu&ccedil;&atilde;o.</p>
</dd>
</dl>




<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
