<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-configtransrecovery" name="task-configtransrecovery"></a></p>

<h4><a id="sthref4" name="sthref4"></a>Para Configurar Como o GlassFish Server Recupera as Transa&ccedil;&otilde;es</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>As transa&ccedil;&otilde;es podem ser incompletas porque o servidor falhou ou porque um gerenciador de recursos falhou entre as fases de uma confirma&ccedil;&atilde;o de 2 fases. &Eacute; essencial concluir essas transa&ccedil;&otilde;es retidas e se recuperar das falhas. O GlassFish Server &eacute; projetado para se recuperar dessas falhas e concluir as transa&ccedil;&otilde;es na inicializa&ccedil;&atilde;o do servidor.</p>
<p>Antes de executar a recupera&ccedil;&atilde;o, verifique se todos os recursos envolvidos est&atilde;o ativos e em execu&ccedil;&atilde;o.</p>
<p>Quando a transa&ccedil;&atilde;o se espalha pelos servidores, o servidor que iniciou a transa&ccedil;&atilde;o pode contatar os demais servidores para obter o resultado das transa&ccedil;&otilde;es. Se os demais servidores forem inacess&iacute;veis, a transa&ccedil;&atilde;o utiliza o campo Decis&atilde;o Heur&iacute;stica para determinar o resultado.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&atilde;o.</p>
</li>
<li>
<p>Selecione a inst&acirc;ncia que ser&aacute; configurada:</p>
<ul>
<li>
<p>Para configurar uma inst&acirc;ncia espec&iacute;fica, selecione o n&oacute; de configura&ccedil;&atilde;o da inst&acirc;ncia. Por exemplo, na inst&acirc;ncia default, <code>server</code>, selecione o n&oacute; <code>server-config</code>.</p>
</li>
<li>
<p>Para definir as defini&ccedil;&otilde;es default de todas as inst&acirc;ncias, selecione o n&oacute; <code>default-config</code>.</p>
</li>
</ul>
</li>
<li>
<p>Selecione o n&oacute; Servi&ccedil;o de Transa&ccedil;&atilde;o.</p>
<p>A p&aacute;gina Servi&ccedil;o de Transa&ccedil;&atilde;o &eacute; aberta.</p>
</li>
<li>
<p>Para ativar a recupera&ccedil;&atilde;o de transa&ccedil;&otilde;es incompletas, na p&aacute;gina Servi&ccedil;o de Transa&ccedil;&atilde;o, marque a caixa de sele&ccedil;&atilde;o Ativado ao Reiniciar.</p>
<p>Por default, a caixa de sele&ccedil;&atilde;o Ativado n&atilde;o &eacute; selecionada.</p>
</li>
<li>
<p>No campo Time-out para Novas Tentativas, digite o n&uacute;mero de segundos que o GlassFish Server tenta se conectar a um servidor inacess&iacute;vel.</p>
<p>O valor default &eacute; 600 (10 minutos).</p>
</li>
<li>
<p>Na lista drop-down Decis&atilde;o Heur&iacute;stica, selecione a pol&iacute;tica para servidores inacess&iacute;veis em uma transa&ccedil;&atilde;o.</p>
<p>A menos que haja um bom motivo para selecionar Confirmar, deixe a Decis&atilde;o Heur&iacute;stica definida como Revers&atilde;o (o default). A confirma&ccedil;&atilde;o de transa&ccedil;&otilde;es indeterminadas pode comprometer a integridade dos dados da aplica&ccedil;&atilde;o.</p>
</li>
<li>
<p>Clique em Salvar.</p>
</li>
<li>
<p>Reinicie o GlassFish Server.</p>
</li>
</ol>
<a id="sthref5" name="sthref5"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-configtransservice.html">Para Configurar o Servi&ccedil;o de Transa&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-settranstimeout.html">Para Definir um Valor de Time-out da Transa&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-settranslog.html">Para Definir a Localiza&ccedil;&atilde;o de Logs da Transa&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-setkeyptinterval.html">Para Definir o Intervalo de Keypoint</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
