<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-settranstimeout" name="task-settranstimeout"></a></p>

<h4><a id="sthref6" name="sthref6"></a>Para Definir um Valor de Time-out da Transa&ccedil;&atilde;o</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Por default, o servidor n&atilde;o efetua time-out de uma transa&ccedil;&atilde;o. Ou seja, o servidor espera indefinidamente pela conclus&atilde;o de uma transa&ccedil;&atilde;o. Caso voc&ecirc; defina um valor de time-out para transa&ccedil;&otilde;es, se uma transa&ccedil;&atilde;o n&atilde;o for conclu&iacute;da dentro do tempo configurado, o GlassFish Server reverter&aacute; a transa&ccedil;&atilde;o.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&atilde;o.</p>
</li>
<li>
<p>Selecione a inst&acirc;ncia que ser&aacute; configurada:</p>
<ul>
<li>
<p>Para configurar uma inst&acirc;ncia espec&iacute;fica, selecione o n&oacute; de configura&ccedil;&atilde;o da inst&acirc;ncia. Por exemplo, na inst&acirc;ncia default, <code>server</code>, selecione o n&oacute; <code>server-config</code>.</p>
</li>
<li>
<p>Para definir as defini&ccedil;&otilde;es default de todas as inst&acirc;ncias, selecione o n&oacute; <code>default-config</code>.</p>
</li>
</ul>
</li>
<li>
<p>Selecione o n&oacute; Servi&ccedil;o de Transa&ccedil;&atilde;o.</p>
<p>A p&aacute;gina Servi&ccedil;o de Transa&ccedil;&atilde;o &eacute; aberta.</p>
</li>
<li>
<p>No campo Time-out da Transa&ccedil;&atilde;o, digite o n&uacute;mero de segundos at&eacute; que seja efetuado time-out da transa&ccedil;&atilde;o.</p>
<p>O valor default &eacute; 0. Esse valor desativa os time-outs das transa&ccedil;&otilde;es.</p>
</li>
<li>
<p>Clique em Salvar.</p>
</li>
<li>
<p>Reinicie o GlassFish Server.</p>
</li>
</ol>
<a id="sthref7" name="sthref7"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-configtransservice.html">Para Configurar o Servi&ccedil;o de Transa&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-configtransrecovery.html">Para Configurar Como o GlassFish Server Recupera as Transa&ccedil;&otilde;es</a></p>
</li>
<li>
<p><a href="task-settranslog.html">Para Definir a Localiza&ccedil;&atilde;o de Logs da Transa&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-setkeyptinterval.html">Para Definir o Intervalo de Keypoint</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
