<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-settranslog" name="task-settranslog"></a></p>

<h4><a id="sthref8" name="sthref8"></a><a id="sthref9" name="sthref9"></a>Para Definir a Localiza&ccedil;&atilde;o de Logs da Transa&ccedil;&atilde;o</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>O log da transa&ccedil;&atilde;o registra as informa&ccedil;&otilde;es sobre cada transa&ccedil;&atilde;o, a fim de manter a integridade dos dados dos recursos envolvidos e se recuperar de falhas. Os logs de transa&ccedil;&atilde;o s&atilde;o mantidos no sub diret&oacute;rio <code>tx</code> do diret&oacute;rio especificado pelo campo Localiza&ccedil;&atilde;o do Log de Transa&ccedil;&otilde;es. Esses logs n&atilde;o s&atilde;o leg&iacute;veis para as pessoas.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&atilde;o.</p>
</li>
<li>
<p>Selecione a inst&acirc;ncia que ser&aacute; configurada:</p>
<ul>
<li>
<p>Para configurar uma inst&acirc;ncia espec&iacute;fica, selecione o n&oacute; de configura&ccedil;&atilde;o da inst&acirc;ncia. Por exemplo, na inst&acirc;ncia default, <code>server</code>, selecione o n&oacute; <code>server-config</code>.</p>
</li>
<li>
<p>Para definir as defini&ccedil;&otilde;es default de todas as inst&acirc;ncias, selecione o n&oacute; <code>default-config</code>.</p>
</li>
</ul>
</li>
<li>
<p>Selecione o n&oacute; Servi&ccedil;o de Transa&ccedil;&atilde;o.</p>
<p>A p&aacute;gina Servi&ccedil;o de Transa&ccedil;&atilde;o &eacute; aberta.</p>
</li>
<li>
<p>No campo Localiza&ccedil;&atilde;o do Log de Transa&ccedil;&otilde;es, digite a localiza&ccedil;&atilde;o dos logs de transa&ccedil;&atilde;o.</p>
<p>&Eacute; criado um subdiret&oacute;rio <code>tx</code> e os logs de transa&ccedil;&atilde;o s&atilde;o mantidos nesse diret&oacute;rio.</p>
</li>
<li>
<p>Clique em Salvar.</p>
</li>
</ol>
<a id="sthref10" name="sthref10"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-configtransservice.html">Para Configurar o Servi&ccedil;o de Transa&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-configtransrecovery.html">Para Configurar Como o GlassFish Server Recupera as Transa&ccedil;&otilde;es</a></p>
</li>
<li>
<p><a href="task-settranstimeout.html">Para Definir um Valor de Time-out da Transa&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-setkeyptinterval.html">Para Definir o Intervalo de Keypoint</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
