<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-lifecyclemodules" name="ref-lifecyclemodules"></a><a id="GHCOM00079" name="GHCOM00079"></a></p>

<h4><a id="sthref309" name="sthref309"></a>&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12399;&#12289;&#12469;&#12540;&#12496;&#12540;&#12398;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12398;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12452;&#12505;&#12531;&#12488;&#12395;&#12424;&#12387;&#12390;&#12488;&#12522;&#12460;&#12540;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#12289;&#12479;&#12473;&#12463;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;&#12488;&#12522;&#12460;&#12540;&#12392;&#12394;&#12427;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12505;&#12531;&#12488;&#12395;&#12399;&#12289;&#21021;&#26399;&#21270;&#12289;&#36215;&#21205;&#12289;&#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#20966;&#29702;&#12377;&#12427;&#28310;&#20633;&#12398;&#23436;&#20102;&#12289;&#12362;&#12424;&#12403;&#20572;&#27490;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12399;Java EE&#20181;&#27096;&#12398;&#19968;&#37096;&#12391;&#12399;&#12394;&#12367;&#12289;GlassFish Server&#12398;&#25313;&#24373;&#12391;&#12377;&#12290;</p>
<p>&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12372;&#12392;&#12395;&#12289;&#27425;&#12398;&#24773;&#22577;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#21517;&#21069;</dt>
<dd>
<p>&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#21517;&#21069;&#12290;</p>
</dd>
<dt>&#12300;&#26377;&#21177;&#12301;&#12414;&#12383;&#12399;&#12300;&#12473;&#12486;&#12540;&#12479;&#12473;&#12301;</dt>
<dd>
<p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12399;&#12481;&#12455;&#12483;&#12463;&#12510;&#12540;&#12463;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#28961;&#21177;&#12394;&#22580;&#21512;&#12399;X (&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;<code>server</code>&#12398;&#12415;&#12364;&#23384;&#22312;&#12377;&#12427;&#22580;&#21512;)&#12290;</p>
<p>&#12463;&#12521;&#12473;&#12479;&#12414;&#12383;&#12399;&#12381;&#12398;&#20182;&#12398;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#23384;&#22312;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12300;&#12377;&#12409;&#12390;&#12398;&#12479;&#12540;&#12466;&#12483;&#12488;&#19978;&#12391;&#26377;&#21177;&#12301;&#12434;&#36984;&#25246;&#12375;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12390;&#12356;&#12427;&#12479;&#12540;&#12466;&#12483;&#12488;&#12434;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12525;&#12540;&#12489;&#38918;&#24207;</dt>
<dd>
<p>&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#12525;&#12540;&#12489;&#12377;&#12427;&#30456;&#23550;&#30340;&#12394;&#38918;&#24207;&#12434;&#25351;&#23450;&#12377;&#12427;&#20516;&#12290;</p>
</dd>
</dl>
<p>&#12300;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12301;&#12398;&#34920;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12418;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#26032;&#35215;</dt>
<dd>
<p>&#26032;&#35215;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
<dt>&#21066;&#38500;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#21066;&#38500;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
<dt>&#26377;&#21177;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;<code>server</code>&#12398;&#12415;&#12364;&#23384;&#22312;&#12377;&#12427;&#22580;&#21512;&#12395;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#28961;&#21177;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#28961;&#21177;&#12395;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;<code>server</code>&#12398;&#12415;&#12364;&#23384;&#22312;&#12377;&#12427;&#22580;&#21512;&#12395;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<a id="sthref310" name="sthref310"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-lifecyclemodulenew.html">&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-lifecyclemoduleedit.html">&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-lifecyclemoduledelete.html">&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref311" name="sthref311"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00043"><code>create-lifecycle-module</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00181"><code>list-lifecycle-modules</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00095"><code>delete-lifecycle-module</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
