<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-monitoring" name="ref-monitoring"></a></p>

<h4><a id="sthref188" name="sthref188"></a>&#12514;&#12491;&#12479;&#12540;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;&#12514;&#12491;&#12479;&#12540;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12514;&#12491;&#12479;&#12540;&#12434;&#27083;&#25104;&#12375;&#12289;&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12362;&#12424;&#12403;&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12372;&#12392;&#12395;&#12289;&#27425;&#12398;&#24773;&#22577;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21517;</dt>
<dd>
<p>&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#21517;&#21069;&#12290;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21517;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12300;&#19968;&#33324;&#24773;&#22577;&#12301;&#12506;&#12540;&#12472;&#12395;&#31227;&#21205;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12463;&#12521;&#12473;&#12479;&#21517;</dt>
<dd>
<p>&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#23646;&#12377;&#12427;&#12463;&#12521;&#12473;&#12479;&#12398;&#21517;&#21069;(&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#22580;&#21512;)&#12290;&#12463;&#12521;&#12473;&#12479;&#21517;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#12463;&#12521;&#12473;&#12479;&#12398;&#12300;&#19968;&#33324;&#24773;&#22577;&#12301;&#12506;&#12540;&#12472;&#12395;&#31227;&#21205;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12450;&#12463;&#12471;&#12519;&#12531;</dt>
<dd>
<p>&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#19978;&#12391;&#27425;&#12398;&#25805;&#20316;&#12434;&#23455;&#34892;&#12391;&#12365;&#12427;&#12522;&#12531;&#12463;&#12290;</p>
<dl>
<dt>&#12514;&#12491;&#12479;&#12540;&#12434;&#27083;&#25104;</dt>
<dd>
<p>&#12463;&#12521;&#12473;&#12479;&#12414;&#12383;&#12399;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#27083;&#25104;&#12398;&#12300;&#12514;&#12491;&#12479;&#12540;&#12434;&#27083;&#25104;&#12301;&#12506;&#12540;&#12472;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
</dd>
<dt>&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;</dt>
<dd>
<p>&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#27425;&#12398;&#12479;&#12452;&#12503;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12391;&#12365;&#12427;&#12522;&#12531;&#12463;&#12290;</p>
<dl>
<dt>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;</dt>
<dd>
<p>&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12300;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12514;&#12491;&#12479;&#12540;&#12301;&#12506;&#12540;&#12472;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12469;&#12540;&#12496;&#12540;</dt>
<dd>
<p>&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12300;&#12469;&#12540;&#12496;&#12540;&#12398;&#12514;&#12491;&#12479;&#12540;&#12301;&#12506;&#12540;&#12472;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12522;&#12477;&#12540;&#12473;</dt>
<dd>
<p>&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12300;&#12522;&#12477;&#12540;&#12473;&#12398;&#12514;&#12491;&#12479;&#12540;&#12301;&#12506;&#12540;&#12472;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
</dd>
</dl>
<a id="GHCOM399" name="GHCOM399"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-confmonitor.html">&#12514;&#12491;&#12479;&#12540;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appmonitoringdata.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-servermonitoringdata.html">&#12469;&#12540;&#12496;&#12540;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-resourcemonitoringdata.html">&#12522;&#12477;&#12540;&#12473;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="GHCOM400" name="GHCOM400"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00128"><code>enable-monitoring</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00120"><code>disable-monitoring</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00212"><code>monitor</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
