<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-eelogging" name="ref-eelogging"></a></p>

<h4><a id="sthref193" name="sthref193"></a>&#12525;&#12460;&#12540;&#12398;&#35373;&#23450;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;&#12525;&#12460;&#12540;&#12398;&#35373;&#23450;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12289;&#36984;&#25246;&#12375;&#12383;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12414;&#12383;&#12399;&#12463;&#12521;&#12473;&#12479;&#12398;&#12525;&#12462;&#12531;&#12464;&#12434;&#27083;&#25104;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12525;&#12460;&#12540;&#12398;&#35373;&#23450;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12489;</dt>
<dd>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12354;&#12427;&#35373;&#23450;&#12434;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12395;&#24489;&#20803;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12394;&#12356;&#35373;&#23450;&#12399;&#22793;&#26356;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>&#27083;&#25104;&#21517;</dt>
<dd>
<p>&#12371;&#12398;&#12506;&#12540;&#12472;&#12398;&#35373;&#23450;&#12364;&#36969;&#29992;&#12373;&#12428;&#12427;&#27083;&#25104;&#12398;&#21517;&#21069;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12471;&#12473;&#12486;&#12512;&#12539;&#12525;&#12464;&#12395;&#26360;&#36796;&#12415;</dt>
<dd>
<p>&#26377;&#21177;&#12394;&#22580;&#21512;&#12289;&#12525;&#12462;&#12531;&#12464;&#20986;&#21147;&#12364;&#12469;&#12540;&#12496;&#12540;&#12539;&#12525;&#12464;&#12395;&#21152;&#12360;&#12289;<code>syslog</code>&#27231;&#33021;&#12395;&#12418;&#36865;&#20449;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#27231;&#33021;&#12399;Solaris&#12362;&#12424;&#12403;Linux&#12471;&#12473;&#12486;&#12512;&#12398;&#12415;&#12391;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12467;&#12531;&#12477;&#12540;&#12523;&#12395;&#12525;&#12464;&#12434;&#35352;&#37682;</dt>
<dd>
<p>&#26377;&#21177;&#12394;&#22580;&#21512;&#12289;&#12525;&#12462;&#12531;&#12464;&#20986;&#21147;&#12364;&#12471;&#12473;&#12486;&#12512;&#12539;&#12467;&#12531;&#12477;&#12540;&#12523;&#12395;&#36865;&#20449;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#26085;&#20184;&#22793;&#26356;&#12398;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;</dt>
<dd>
<p>&#26377;&#21177;&#12394;&#22580;&#21512;&#12289;GlassFish Server&#12399;&#12289;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#27598;&#26085;&#21320;&#21069;0&#26178;&#12395;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#35079;&#25968;&#34892;&#12514;&#12540;&#12489;</dt>
<dd>
<p>&#26377;&#21177;&#21270;&#12373;&#12428;&#12390;&#12356;&#12427;&#12392;&#12289;&#12525;&#12464;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#26412;&#25991;&#12364;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12504;&#12483;&#12480;&#12540;&#12398;&#24460;&#12398;&#26032;&#12375;&#12356;&#34892;&#12363;&#12425;&#38283;&#22987;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12467;&#12531;&#12477;&#12540;&#12523;&#12398;&#12525;&#12462;&#12531;&#12464;&#12539;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;</dt>
<dd>
<p>&#12467;&#12531;&#12477;&#12540;&#12523;&#12408;&#12398;&#12525;&#12462;&#12531;&#12464;&#12395;&#20351;&#29992;&#12373;&#12428;&#12427;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12290;&#20351;&#29992;&#21487;&#33021;&#12394;&#36984;&#25246;&#32930;&#12399;&#12289;ULF (UniformLogFormatter)&#12414;&#12383;&#12399;ODL (Oracle Diagnostics Logging)&#12391;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12399;ULF&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#12525;&#12462;&#12531;&#12464;&#12539;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;</dt>
<dd>
<p>&#12469;&#12540;&#12496;&#12540;&#12539;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12408;&#12398;&#12525;&#12462;&#12531;&#12464;&#12395;&#20351;&#29992;&#12373;&#12428;&#12427;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12290;&#20351;&#29992;&#21487;&#33021;&#12394;&#36984;&#25246;&#32930;&#12399;ULF&#12414;&#12383;&#12399;ODL&#12391;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12399;ODL&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#38500;&#22806;&#12501;&#12451;&#12540;&#12523;&#12489;</dt>
<dd>
<p>&#12525;&#12464;&#12539;&#12524;&#12467;&#12540;&#12489;&#12391;&#38500;&#22806;&#12377;&#12427;&#12501;&#12451;&#12540;&#12523;&#12489;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12289;&#12377;&#12409;&#12390;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12501;&#12449;&#12452;&#12523;&#12539;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#21046;&#38480;</dt>
<dd>
<p>&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12373;&#12428;&#12427;&#12414;&#12391;&#12395;&#12469;&#12540;&#12496;&#12540;&#12539;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12364;&#21040;&#36948;&#12377;&#12427;&#12469;&#12452;&#12474;(&#12496;&#12452;&#12488;&#21336;&#20301;)&#12290;&#12469;&#12540;&#12496;&#12540;&#12539;&#12525;&#12464;&#12364;&#25351;&#23450;&#12375;&#12383;&#12469;&#12452;&#12474;&#12395;&#36948;&#12377;&#12427;&#12392;&#12289;GlassFish Server&#12399;<code>server.log</code>&#12392;&#12356;&#12358;&#21517;&#21069;&#12398;&#26032;&#12375;&#12356;&#31354;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#20316;&#25104;&#12375;&#12289;&#21476;&#12356;&#12501;&#12449;&#12452;&#12523;&#12398;&#21517;&#21069;&#12434;<code>server.log_</code><i>date</i>&#12395;&#22793;&#26356;&#12375;&#12414;&#12377;(&#12371;&#12371;&#12391;&#12289;<i>date</i>&#12399;&#12501;&#12449;&#12452;&#12523;&#12364;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12373;&#12428;&#12383;&#26085;&#26178;&#12391;&#12377;)&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;2MB&#12391;&#12377;&#12290;&#21046;&#38480;&#12398;&#26368;&#23567;&#20516;&#12399;500KB&#12391;&#12377;&#12290;&#12381;&#12428;&#12424;&#12426;&#23567;&#12373;&#12394;&#20516;&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12501;&#12449;&#12452;&#12523;&#12399;500KB&#12395;&#36948;&#12375;&#12383;&#26178;&#28857;&#12391;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12373;&#12428;&#12414;&#12377;&#12290;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12434;&#28961;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;&#12371;&#12398;&#20516;&#12434;0&#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12501;&#12449;&#12452;&#12523;&#12539;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12398;&#21046;&#38480;&#26178;&#38291;</dt>
<dd>
<p>&#12469;&#12540;&#12496;&#12540;&#12539;&#12525;&#12464;&#12364;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12373;&#12428;&#12427;&#12414;&#12391;&#12398;&#26178;&#38291;(&#20998;&#21336;&#20301;)&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;0&#12391;&#12377;&#12290;&#12371;&#12428;&#12399;&#12289;&#12300;&#12501;&#12449;&#12452;&#12523;&#12539;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#21046;&#38480;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12391;&#25351;&#23450;&#12375;&#12383;&#12469;&#12452;&#12474;&#12395;&#36948;&#12375;&#12383;&#12392;&#12365;&#12395;&#12289;&#12501;&#12449;&#12452;&#12523;&#12364;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12373;&#12428;&#12427;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;1&#20998;&#20197;&#19978;&#12398;&#20516;&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12300;&#12501;&#12449;&#12452;&#12523;&#12539;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#21046;&#38480;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12391;&#25351;&#23450;&#12375;&#12383;&#12469;&#12452;&#12474;&#21046;&#38480;&#12424;&#12426;&#12418;&#12289;&#26178;&#38291;&#12395;&#12424;&#12427;&#21046;&#38480;&#12364;&#20778;&#20808;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12501;&#12521;&#12483;&#12471;&#12517;&#12398;&#38971;&#24230;</dt>
<dd>
<p>&#12461;&#12517;&#12540;&#12363;&#12425;&#12469;&#12540;&#12496;&#12540;&#12539;&#12525;&#12464;&#12395;&#19968;&#24230;&#12395;&#26360;&#12365;&#36796;&#12416;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#26368;&#22823;&#25968;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;1&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#23653;&#27508;&#12501;&#12449;&#12452;&#12523;&#25968;</dt>
<dd>
<p>&#26368;&#12418;&#21476;&#12356;&#12501;&#12449;&#12452;&#12523;&#12434;&#21066;&#38500;&#12377;&#12427;&#21069;&#12395;GlassFish Server&#12364;&#20445;&#25345;&#12377;&#12427;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#26368;&#22823;&#25968;&#12290;&#12371;&#12398;&#20516;&#12434;&#12476;&#12525;(0)&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;GlassFish Server&#12399;&#21476;&#12356;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#21066;&#38500;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;</dt>
<dd>
<p>&#12469;&#12540;&#12496;&#12540;&#12539;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#21029;&#21517;&#12414;&#12383;&#12399;&#22580;&#25152;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#22580;&#25152;&#12399;&#12289;domain-dir<code>/logs/server.log</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12525;&#12464;&#12539;&#12495;&#12531;&#12489;&#12521;</dt>
<dd>
<p>&#12459;&#12473;&#12479;&#12512;&#12539;&#12525;&#12464;&#12539;&#12495;&#12531;&#12489;&#12521;&#12398;&#32118;&#23550;&#12463;&#12521;&#12473;&#21517;&#12290;&#12459;&#12473;&#12479;&#12512;&#12539;&#12525;&#12464;&#12539;&#12495;&#12531;&#12489;&#12521;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;<code>server.log</code>&#12414;&#12383;&#12399;<code>syslog</code>&#20197;&#22806;&#12398;&#23451;&#20808;&#12395;&#12525;&#12464;&#12434;&#36865;&#20449;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12459;&#12473;&#12479;&#12512;&#12539;&#12495;&#12531;&#12489;&#12521;&#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12463;&#12521;&#12473;<code>java.util.logging.Handler</code>(JSR 047&#28310;&#25312;&#12398;API)&#12434;&#25313;&#24373;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12495;&#12531;&#12489;&#12521;&#12539;&#12463;&#12521;&#12473;&#12434;GlassFish Server&#12398;&#12463;&#12521;&#12473;&#12497;&#12473;&#12395;&#32622;&#12365;&#12289;&#12469;&#12540;&#12496;&#12540;&#12398;&#36215;&#21205;&#26178;&#12395;&#12495;&#12531;&#12489;&#12521;&#12364;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<a id="GHCOM421" name="GHCOM421"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-eelogging.html">&#20840;&#33324;&#30340;&#12394;&#12525;&#12462;&#12531;&#12464;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-eelogginglevels.html">&#12525;&#12464;&#12539;&#12524;&#12505;&#12523;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-logviewer.html">DAS&#12398;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="GHCOM422" name="GHCOM422"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00007"><code>collect-log-files</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00183"><code>list-log-levels</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00224"><code>rotate-log</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00228"><code>set-log-levels</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM879"><code>set-log-file-format</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
