<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-uc-concepts" name="ref-uc-concepts"></a></p>

<h4><a id="sthref447" name="sthref447"></a>&#26356;&#26032;&#12484;&#12540;&#12523;&#12398;&#20027;&#12394;&#27010;&#24565;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#26356;&#26032;&#12484;&#12540;&#12523;&#12399;&#12289;&#12471;&#12473;&#12486;&#12512;&#19978;&#12398;1&#12388;&#12398;&#12501;&#12449;&#12452;&#12523;&#12539;&#12471;&#12473;&#12486;&#12512;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#21547;&#12414;&#12428;&#12427;GlassFish Server&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12539;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12434;&#31649;&#29702;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398;&#26356;&#26032;&#12484;&#12540;&#12523;&#12391;&#12399;&#12289;&#27425;&#12398;&#25805;&#20316;&#12434;&#23455;&#34892;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#12450;&#12489;&#12458;&#12531;&#12539;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</p>
</li>
<li>
<p>&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#28168;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12395;&#23550;&#12377;&#12427;&#26356;&#26032;&#12398;&#34920;&#31034;</p>
</li>
<li>
<p>&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#28168;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#34920;&#31034;</p>
</li>
</ul>
<p>&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#28168;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#26356;&#26032;&#12414;&#12383;&#12399;&#38500;&#21435;&#12377;&#12427;&#12395;&#12399;&#12289;GlassFish Server&#12489;&#12513;&#12452;&#12531;&#12434;&#20572;&#27490;&#12375;&#12383;&#24460;&#12395;&#12289;&#27425;&#12398;&#12356;&#12378;&#12428;&#12363;&#12398;&#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#29992;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>as-install-parent<code>/bin/updatetool</code>(&#26356;&#26032;&#12484;&#12540;&#12523;&#12539;&#12464;&#12521;&#12501;&#12451;&#12459;&#12523;&#12539;&#12518;&#12540;&#12486;&#12451;&#12522;&#12486;&#12451;&#12434;&#36215;&#21205;)</p>
</li>
<li>
<p>as-install-parent<code>/bin/pkg</code>(&#12467;&#12510;&#12531;&#12489;&#12539;&#12521;&#12452;&#12531;&#12539;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398;&#26356;&#26032;&#12484;&#12540;&#12523;)</p>
</li>
</ul>
<p>&#26356;&#26032;&#12484;&#12540;&#12523;&#12398;&#20027;&#12394;&#27010;&#24565;&#12434;&#12289;&#27425;&#12398;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;</p>
<a id="ref-uc-about-component" name="ref-uc-about-component"></a>
<h5>&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;</h5>
<p>&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12399;&#12289;&#26356;&#26032;&#12484;&#12540;&#12523;&#12364;&#31649;&#29702;&#12377;&#12427;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#21487;&#33021;&#12394;&#21336;&#20301;&#12391;&#12377;&#12290;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12399;&#12289;&#12471;&#12473;&#12486;&#12512;&#19978;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12452;&#12513;&#12540;&#12472;&#20869;&#12395;1&#12388;&#12398;&#21336;&#20301;&#12392;&#12375;&#12390;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12427;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#27083;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<a id="ref-uc-about-image" name="ref-uc-about-image"></a>
<h5>&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12452;&#12513;&#12540;&#12472;</h5>
<p>&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12452;&#12513;&#12540;&#12472;&#12399;&#12289;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12398;&#20869;&#23481;&#12394;&#12393;&#12398;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12539;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#21547;&#12416;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12391;&#12377;&#12290;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12452;&#12513;&#12540;&#12472;&#12399;&#12289;GlassFish Server&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12362;&#12424;&#12403;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12398;&#32080;&#26524;&#12392;&#12375;&#12390;&#26356;&#26032;&#12484;&#12540;&#12523;&#12395;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290;GlassFish Server&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12539;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#36861;&#21152;&#12392;&#26356;&#26032;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#21508;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12452;&#12513;&#12540;&#12472;&#12395;&#12399;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12395;&#38306;&#12377;&#12427;&#24773;&#22577;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<a id="ref-uc-about-repository" name="ref-uc-about-repository"></a>
<h5>&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;</h5>
<p>&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12395;&#12399;&#12289;&#27425;&#12398;&#38917;&#30446;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12452;&#12513;&#12540;&#12472;&#12395;&#36861;&#21152;&#12391;&#12365;&#12427;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;</p>
</li>
<li>
<p>&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12452;&#12513;&#12540;&#12472;&#20869;&#12398;&#26082;&#23384;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12395;&#23550;&#12377;&#12427;&#26356;&#26032;</p>
</li>
</ul>
<p>&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12452;&#12513;&#12540;&#12472;&#12399;&#12289;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12414;&#12377;&#12290;&#21508;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12399;&#12289;&#21517;&#21069;&#12362;&#12424;&#12403;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12390;&#12356;&#12427;URL&#12395;&#12424;&#12387;&#12390;&#34920;&#12373;&#12428;&#12414;&#12377;&#12290;&#12522;&#12509;&#12472;&#12488;&#12522;&#21517;&#12399;&#12289;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12452;&#12513;&#12540;&#12472;&#12372;&#12392;&#12395;&#19968;&#24847;&#12391;&#12289;&#12381;&#12398;&#12522;&#12509;&#12472;&#12488;&#12522;&#12434;&#31649;&#29702;&#12377;&#12427;&#32068;&#32340;&#12414;&#12383;&#12399;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12415;&#12394;&#12425;&#12378;&#12289;&#20869;&#23481;&#12398;&#26126;&#30906;&#12394;&#31684;&#22258;&#12418;&#34920;&#12375;&#12414;&#12377;&#12290;GlassFish Server&#29992;&#12395;&#20107;&#21069;&#12395;&#27083;&#25104;&#12373;&#12428;&#12390;&#12356;&#12427;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSADG00569"><i>Oracle GlassFish Server&#31649;&#29702;&#12460;&#12452;&#12489;</i>&#12398;<i>Preconfigured Repositories for GlassFish Server</i></a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<a id="ref-uc-about-addon" name="ref-uc-about-addon"></a>
<h5>&#12450;&#12489;&#12458;&#12531;&#12539;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;</h5>
<p>&#12450;&#12489;&#12458;&#12531;&#12539;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12399;&#12289;&#12414;&#12384;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12452;&#12513;&#12540;&#12472;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12391;&#12377;&#12290;</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
