<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-messagesecurityconfig" name="ref-messagesecurityconfig"></a><a id="GHCOM00118" name="GHCOM00118"></a></p>

<h4><a id="sthref400" name="sthref400"></a>&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12398;&#20351;&#29992;&#21487;&#33021;&#12394;&#27083;&#25104;&#12434;&#34920;&#31034;&#12362;&#12424;&#12403;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12392;Web&#12469;&#12540;&#12499;&#12473;&#12398;&#27010;&#24565;&#12395;&#12388;&#12356;&#12390;&#12398;&#22522;&#26412;&#30340;&#12394;&#29702;&#35299;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;&#35443;&#32048;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSSCG00037"><i>Oracle GlassFish Server&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12460;&#12452;&#12489;</i>&#12398;&#31532;3&#31456;&#12289;<i>Administering Message Security</i></a>&#12362;&#12424;&#12403;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSADG00009"><i>Oracle GlassFish Server&#31649;&#29702;&#12460;&#12452;&#12489;</i>&#12398;&#31532;6&#31456;&#12289;<i>Administering Web Applications</i></a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>GlassFish Server&#12399;&#12289;SOAP&#20966;&#29702;&#12524;&#12452;&#12516;&#12540;&#20869;&#12395;&#32113;&#21512;&#21270;&#12373;&#12428;&#12383;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12434;&#23455;&#35013;&#12375;&#12414;&#12377;&#12290;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12399;&#12289;GlassFish Server&#12398;&#12381;&#12398;&#20182;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27231;&#33021;&#12395;&#20381;&#23384;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#27083;&#25104;&#12372;&#12392;&#12395;&#12289;&#27425;&#12398;&#24773;&#22577;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#35469;&#35388;&#12524;&#12452;&#12516;&#12540;</dt>
<dd>
<p>&#35469;&#35388;&#12364;&#23455;&#34892;&#12373;&#12428;&#12427;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12524;&#12452;&#12516;&#12540;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;SOAP&#27083;&#25104;&#12364;&#25351;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;HttpServlet&#27083;&#25104;&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;</dt>
<dd>
<p>&#12371;&#12398;&#27083;&#25104;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12399;&#27083;&#25104;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;</dt>
<dd>
<p>&#12371;&#12398;&#27083;&#25104;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12399;&#27083;&#25104;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
</dl>
<p>&#12300;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12301;&#12398;&#34920;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12418;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#26032;&#35215;</dt>
<dd>
<p>&#26032;&#35215;&#27083;&#25104;&#12434;&#20316;&#25104;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
<dt>&#21066;&#38500;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#27083;&#25104;&#12434;&#21066;&#38500;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
</dl>
<a id="sthref401" name="sthref401"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12391;&#20351;&#29992;&#12373;&#12428;&#12427;GlassFish Server&#27231;&#33021;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#27083;&#25104;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#27083;&#25104;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#27083;&#25104;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref402" name="sthref402"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<p>&#12394;&#12375;&#12290;</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
