<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-webapp-displaydd" name="ref-webapp-displaydd"></a></p>

<h4>&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#35352;&#36848;&#23376;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#35352;&#36848;&#23376;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#35352;&#36848;&#23376;&#12434;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#35352;&#36848;&#23376;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#24773;&#22577;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#21517;</dt>
<dd>
<p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#21517;&#21069;&#12290;</p>
<p>&#21517;&#21069;&#12395;&#12399;&#12289;&#12458;&#12503;&#12471;&#12519;&#12531;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#35672;&#21029;&#23376;&#12434;&#21547;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#35672;&#21029;&#23376;&#12399;&#21517;&#21069;&#12398;&#24460;&#12395;&#32154;&#12365;&#12289;&#12467;&#12525;&#12531;(<code>:</code>)&#12391;&#21517;&#21069;&#12392;&#21306;&#20999;&#12426;&#12414;&#12377;&#12290;&#12514;&#12472;&#12517;&#12540;&#12523;&#12362;&#12424;&#12403;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Oracle GlassFish Server&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12460;&#12452;&#12489;</i>&#12398;<i>Module and Application Versions</i></a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</dd>
<dt>&#12514;&#12472;&#12517;&#12540;&#12523;&#21517;</dt>
<dd>
<p>&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#35352;&#36848;&#23376;&#12434;&#21547;&#12416;&#12514;&#12472;&#12517;&#12540;&#12523;&#21517;&#12290;</p>
</dd>
<dt>&#35352;&#36848;&#23376;&#12501;&#12449;&#12452;&#12523;&#21517;</dt>
<dd>
<p>&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#35352;&#36848;&#23376;&#12501;&#12449;&#12452;&#12523;&#21517;&#12290;</p>
</dd>
</dl>
<a id="sthref273" name="sthref273"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-appviewdesc.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#35352;&#36848;&#23376;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-applistdeployed.html">&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12522;&#12473;&#12488;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12434;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">&#12467;&#12493;&#12463;&#12479;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">EJB JAR&#12434;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appedit.html">&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appviewtargets.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12479;&#12540;&#12466;&#12483;&#12488;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-endpoint.html">Web&#12469;&#12540;&#12499;&#12473;&#12398;&#12456;&#12531;&#12489;&#12509;&#12452;&#12531;&#12488;&#24773;&#22577;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-applaunch.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#36215;&#21205;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12434;&#36215;&#21205;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12473;&#12479;&#12502;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appredeploy.html">&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#20877;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-apprestart.html">&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#20877;&#12525;&#12540;&#12489;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#23550;&#35937;&#31684;&#22258;&#12392;&#12377;&#12427;&#12395;&#12399;&#12522;&#12477;&#12540;&#12473;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#23550;&#35937;&#31684;&#22258;&#12392;&#12377;&#12427;&#12395;&#12399;&#12522;&#12477;&#12540;&#12473;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref274" name="sthref274"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00148"><code>list-applications</code>(1)</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
