<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-monitoringservice" name="ref-monitoringservice"></a></p>

<h4><a id="sthref430" name="sthref430"></a>&#12514;&#12491;&#12479;&#12540;&#12539;&#12469;&#12540;&#12499;&#12473;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;&#12514;&#12491;&#12479;&#12540;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#20491;&#12293;&#12398;&#12469;&#12540;&#12496;&#12540;&#12539;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12414;&#12383;&#12399;&#12469;&#12540;&#12499;&#12473;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#27083;&#25104;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12514;&#12491;&#12479;&#12540;&#12434;&#27083;&#25104;&#12377;&#12427;&#21069;&#12395;&#12289;&#12514;&#12491;&#12479;&#12540;&#23550;&#35937;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12289;&#12414;&#12383;&#12399;&#12469;&#12540;&#12499;&#12473;&#12434;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12514;&#12491;&#12479;&#12540;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#27083;&#25104;&#21517;</dt>
<dd>
<p>&#12371;&#12398;&#12506;&#12540;&#12472;&#12398;&#35373;&#23450;&#12364;&#36969;&#29992;&#12373;&#12428;&#12427;&#27083;&#25104;&#12398;&#21517;&#21069;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12514;&#12491;&#12479;&#12540;&#12539;&#12469;&#12540;&#12499;&#12473;</dt>
<dd>
<p>&#12300;&#12514;&#12491;&#12479;&#12540;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;GlassFish Server&#12391;&#12514;&#12491;&#12479;&#12540;&#12364;&#26377;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12514;&#12491;&#12479;&#12540;MBean</dt>
<dd>
<p>&#12300;&#12514;&#12491;&#12479;&#12540;MBean&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12514;&#12491;&#12479;&#12540;&#12395;&#24517;&#35201;&#12394;&#12377;&#12409;&#12390;&#12398;MBean&#12364;GlassFish Server&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
<p>&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12364;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12300;&#12514;&#12491;&#12479;&#12540;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12364;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12391;&#12418;&#12289;&#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12391;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#22580;&#21512;&#12399;&#12289;&#12467;&#12510;&#12531;&#12489;&#12539;&#12521;&#12452;&#12531;&#12434;&#20351;&#29992;&#12375;&#12390;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12398;&#36984;&#25246;&#12434;&#35299;&#38500;&#12377;&#12427;&#12392;&#12289;GlassFish Server&#12398;&#12513;&#12514;&#12522;&#12540;&#12539;&#12501;&#12483;&#12488;&#12503;&#12522;&#12531;&#12488;&#12364;&#28187;&#23569;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>DTrace</dt>
<dd>
<p>Oracle Enterprise Manager DTrace Monitoring&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12300;DTrace&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;Solaris&#12398;DTrace&#27231;&#33021;&#12434;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<p>&#20351;&#29992;&#21487;&#33021;&#12394;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12372;&#12392;&#12395;&#12289;&#27425;&#12398;&#24773;&#22577;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;</dt>
<dd>
<p>GlassFish Server&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#21517;&#21069;&#12290;</p>
</dd>
<dt>&#12514;&#12491;&#12479;&#12540;&#12539;&#12524;&#12505;&#12523;</dt>
<dd>
<p>&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12395;&#35373;&#23450;&#12373;&#12428;&#12383;&#12514;&#12491;&#12479;&#12540;&#12398;&#12524;&#12505;&#12523;&#12290;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12372;&#12392;&#12395;&#12289;&#12300;LOW&#12301;&#12289;&#12300;HIGH&#12301;&#12289;&#12362;&#12424;&#12403;&#12300;OFF&#12301;&#12398;&#12524;&#12505;&#12523;&#12434;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12300;OFF&#12301;&#12391;&#12377;&#12290;&#29694;&#22312;&#12398;&#12522;&#12522;&#12540;&#12473;&#12391;&#12399;&#12289;&#12300;LOW&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12392;&#12300;HIGH&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12395;&#12424;&#12427;&#12514;&#12491;&#12479;&#12540;&#12539;&#12524;&#12505;&#12523;&#12395;&#24046;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
</dl>
<p>&#12300;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12539;&#12524;&#12505;&#12523;&#12398;&#35373;&#23450;&#12301;&#12398;&#34920;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12418;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12524;&#12505;&#12523;&#12398;&#22793;&#26356;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12524;&#12505;&#12523;&#12434;&#22793;&#26356;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
<dt>&#12524;&#12505;&#12523;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;&#12377;&#12409;&#12390;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12395;&#36969;&#29992;&#12377;&#12427;&#12514;&#12491;&#12479;&#12540;&#12539;&#12524;&#12505;&#12523;&#12434;&#36984;&#25246;&#12377;&#12427;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12290;</p>
</dd>
</dl>
<a id="sthref431" name="sthref431"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-confmonitor.html">&#12514;&#12491;&#12479;&#12540;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appmonitoringdata.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-servermonitoringdata.html">&#12469;&#12540;&#12496;&#12540;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-resourcemonitoringdata.html">&#12522;&#12477;&#12540;&#12473;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref432" name="sthref432"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00128"><code>enable-monitoring</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00120"><code>disable-monitoring</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00212"><code>monitor</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
