<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-endpoint" name="ref-endpoint"></a></p>

<h4><a id="sthref281" name="sthref281"></a><a id="sthref282" name="sthref282"></a><a id="sthref283" name="sthref283"></a>Web&#12469;&#12540;&#12499;&#12473;&#12539;&#12456;&#12531;&#12489;&#12509;&#12452;&#12531;&#12488;&#24773;&#22577;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Web&#12469;&#12540;&#12499;&#12473;&#12539;&#12456;&#12531;&#12489;&#12539;&#12509;&#12452;&#12531;&#12488;&#12395;&#38306;&#12377;&#12427;&#24773;&#22577;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;Web&#12469;&#12540;&#12499;&#12473;&#12539;&#12456;&#12531;&#12489;&#12539;&#12509;&#12452;&#12531;&#12488;&#24773;&#22577;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;Web&#12469;&#12540;&#12499;&#12473;&#12539;&#12456;&#12531;&#12489;&#12539;&#12509;&#12452;&#12531;&#12488;&#24773;&#22577;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#24773;&#22577;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#21517;</dt>
<dd>
<p>&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12390;&#12356;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#21517;&#21069;&#12290;&#12300;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12395;&#25147;&#12427;&#12395;&#12399;&#12289;&#12371;&#12398;&#12522;&#12531;&#12463;&#12414;&#12383;&#12399;&#12300;&#25147;&#12427;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#21517;&#21069;&#12395;&#12399;&#12289;&#12458;&#12503;&#12471;&#12519;&#12531;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#35672;&#21029;&#23376;&#12434;&#21547;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#35672;&#21029;&#23376;&#12399;&#21517;&#21069;&#12398;&#24460;&#12395;&#32154;&#12365;&#12289;&#12467;&#12525;&#12531;(<code>:</code>)&#12391;&#21517;&#21069;&#12392;&#21306;&#20999;&#12426;&#12414;&#12377;&#12290;&#12514;&#12472;&#12517;&#12540;&#12523;&#12362;&#12424;&#12403;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Oracle GlassFish Server&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12460;&#12452;&#12489;</i>&#12398;<i>Module and Application Versions</i></a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</dd>
<dt>&#12486;&#12473;&#12479;&#12540;</dt>
<dd>
<p>&#12300;&#12486;&#12473;&#12479;&#12540;&#12301;&#12398;&#12522;&#12531;&#12463;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12479;&#12452;&#12503;&#12364;&#12300;RI&#12301;&#20197;&#22806;(&#12383;&#12392;&#12360;&#12400;&#12289;&#12300;109&#12301;)&#12398;&#22580;&#21512;&#12395;&#12398;&#12415;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12522;&#12531;&#12463;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;Web&#12469;&#12540;&#12499;&#12473;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#12486;&#12473;&#12488;&#12377;&#12427;&#12383;&#12417;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12434;&#35373;&#23450;&#12377;&#12427;&#12506;&#12540;&#12472;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>WSDL</dt>
<dd>
<p>&#12456;&#12531;&#12489;&#12539;&#12509;&#12452;&#12531;&#12488;&#12398;Web Services Definition Language (WSDL)&#12290;&#12371;&#12398;&#12522;&#12531;&#12463;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#12502;&#12521;&#12454;&#12470;&#12398;&#26032;&#35215;&#12479;&#12502;&#12414;&#12383;&#12399;&#26032;&#35215;&#12454;&#12451;&#12531;&#12489;&#12454;&#12395;WSDL&#12501;&#12449;&#12452;&#12523;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<p>Web&#12502;&#12521;&#12454;&#12470;&#12398;&#20013;&#12395;&#12399;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;WSDL&#12522;&#12531;&#12463;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#38555;&#12395;WSDL&#12477;&#12540;&#12473;&#12434;&#35299;&#37320;&#12375;&#12289;&#12371;&#12398;&#32080;&#26524;&#12289;&#31354;&#30333;&#12506;&#12540;&#12472;&#12434;&#34920;&#31034;&#12377;&#12427;&#12418;&#12398;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12424;&#12358;&#12394;&#12502;&#12521;&#12454;&#12470;&#12391;&#12399;&#12289;&#31354;&#30333;&#12506;&#12540;&#12472;&#19978;&#12391;&#12502;&#12521;&#12454;&#12470;&#12398;View Source&#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;WSDL&#12477;&#12540;&#12473;&#12434;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12456;&#12531;&#12489;&#12539;&#12509;&#12452;&#12531;&#12488;&#21517;</dt>
<dd>
<p>&#12456;&#12531;&#12489;&#12539;&#12509;&#12452;&#12531;&#12488;&#12398;&#21517;&#21069;&#12290;</p>
</dd>
<dt>&#12469;&#12540;&#12499;&#12473;&#21517;</dt>
<dd>
<p>Web&#12469;&#12540;&#12499;&#12473;&#12398;&#21517;&#21069;&#12290;</p>
</dd>
<dt>&#12509;&#12540;&#12488;&#21517;</dt>
<dd>
<p>Web&#12469;&#12540;&#12499;&#12473;&#12539;&#12509;&#12540;&#12488;&#12398;&#21517;&#21069;&#12290;</p>
</dd>
<dt>&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12479;&#12452;&#12503;</dt>
<dd>
<p>Web&#12469;&#12540;&#12499;&#12473;&#12398;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12479;&#12452;&#12503;(&#12383;&#12392;&#12360;&#12400;&#12289;RI&#12414;&#12383;&#12399;109)&#12290;</p>
</dd>
<dt>&#23455;&#35013;&#12479;&#12452;&#12503;</dt>
<dd>
<p>Web&#12469;&#12540;&#12499;&#12473;&#12398;&#23455;&#35013;&#12398;&#12479;&#12452;&#12503;(&#12383;&#12392;&#12360;&#12400;&#12289;SERVLET&#12414;&#12383;&#12399;EJB)&#12290;</p>
</dd>
<dt>&#23455;&#35013;&#12463;&#12521;&#12473;&#21517;</dt>
<dd>
<p>Web&#12469;&#12540;&#12499;&#12473;&#12398;&#23455;&#35013;&#12463;&#12521;&#12473;&#12398;&#21517;&#21069;&#12290;</p>
</dd>
<dt>&#12456;&#12531;&#12489;&#12539;&#12509;&#12452;&#12531;&#12488;&#12539;&#12450;&#12489;&#12524;&#12473;URI</dt>
<dd>
<p>&#12456;&#12531;&#12489;&#12539;&#12509;&#12452;&#12531;&#12488;&#12539;&#12450;&#12489;&#12524;&#12473;&#12398;URI&#12290;</p>
</dd>
<dt>&#21517;&#21069;&#31354;&#38291;</dt>
<dd>
<p>Web&#12469;&#12540;&#12499;&#12473;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12383;&#12479;&#12540;&#12466;&#12483;&#12488;&#12398;&#21517;&#21069;&#31354;&#38291;&#12290;</p>
</dd>
<dt>&#35500;&#26126;</dt>
<dd>
<p>&#12456;&#12531;&#12489;&#12539;&#12509;&#12452;&#12531;&#12488;&#12398;&#35500;&#26126;(&#23384;&#22312;&#12377;&#12427;&#22580;&#21512;)&#12290;</p>
</dd>
</dl>
<a id="sthref284" name="sthref284"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-endpoint.html">Web&#12469;&#12540;&#12499;&#12473;&#12398;&#12456;&#12531;&#12489;&#12509;&#12452;&#12531;&#12488;&#24773;&#22577;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-applistdeployed.html">&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12522;&#12473;&#12488;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12434;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">&#12467;&#12493;&#12463;&#12479;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">EJB JAR&#12434;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appedit.html">&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#35352;&#36848;&#23376;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-applaunch.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#36215;&#21205;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12434;&#36215;&#21205;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12473;&#12479;&#12502;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appredeploy.html">&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#20877;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-apprestart.html">&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#20877;&#12525;&#12540;&#12489;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#23550;&#35937;&#31684;&#22258;&#12392;&#12377;&#12427;&#12395;&#12399;&#12522;&#12477;&#12540;&#12473;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#23550;&#35937;&#31684;&#22258;&#12392;&#12377;&#12427;&#12395;&#12399;&#12522;&#12477;&#12540;&#12473;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
