<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-appedit" name="ref-appedit"></a></p>

<h4><a id="sthref159" name="sthref159"></a>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#32232;&#38598;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#26082;&#23384;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12479;&#12452;&#12503;&#12395;&#24540;&#12376;&#12390;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12398;&#12377;&#12409;&#12390;&#12414;&#12383;&#12399;&#19968;&#37096;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#21517;&#21069;</dt>
<dd>
<p>&#32232;&#38598;&#12377;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#21517;&#21069;&#12434;&#34920;&#31034;&#12377;&#12427;&#35501;&#21462;&#12426;&#23554;&#29992;&#12501;&#12451;&#12540;&#12523;&#12489;&#12290;</p>
<p>&#21517;&#21069;&#12395;&#12399;&#12289;&#12458;&#12503;&#12471;&#12519;&#12531;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#35672;&#21029;&#23376;&#12434;&#21547;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#35672;&#21029;&#23376;&#12399;&#21517;&#21069;&#12398;&#24460;&#12395;&#32154;&#12365;&#12289;&#12467;&#12525;&#12531;(<code>:</code>)&#12391;&#21517;&#21069;&#12392;&#21306;&#20999;&#12426;&#12414;&#12377;&#12290;&#12514;&#12472;&#12517;&#12540;&#12523;&#12362;&#12424;&#12403;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Oracle GlassFish Server&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12460;&#12452;&#12489;</i>&#12398;<i>Module and Application Versions</i></a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</dd>
<dt>&#12473;&#12486;&#12540;&#12479;&#12473;</dt>
<dd>
<p>&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12364;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#20351;&#29992;&#21487;&#33021;&#12391;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12523;&#12540;&#12488;</dt>
<dd>
<p>Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#22580;&#21512;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12497;&#12473;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;URL&#12391;&#12399;&#12289;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12523;&#12540;&#12488;&#12399;&#12509;&#12540;&#12488;&#30058;&#21495;&#12398;&#30452;&#24460;&#12395;&#32154;&#12365;&#12414;&#12377;(<code>http://</code><i>host</i><code>:</code><i>port</i><code>/</code><i>context-root</i><code>/...</code>)&#12290;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12523;&#12540;&#12488;&#12399;&#12473;&#12521;&#12483;&#12471;&#12517;&#12391;&#22987;&#12417;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;(&#20363;: <code>/hello</code>)&#12290;</p>
</dd>
<dt>&#21487;&#29992;&#24615;</dt>
<dd>
<p>&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;Web&#12475;&#12483;&#12471;&#12519;&#12531;&#12289;&#12473;&#12486;&#12540;&#12488;&#12501;&#12523;&#12539;&#12475;&#12483;&#12471;&#12519;&#12531;Bean (SFSB)&#12481;&#12455;&#12483;&#12463;&#12509;&#12452;&#12531;&#12488;&#35373;&#23450;&#12289;&#12497;&#12483;&#12471;&#12505;&#12540;&#12471;&#12519;&#12531;&#12394;&#12393;&#12395;&#20633;&#12360;&#12390;&#39640;&#21487;&#29992;&#24615;&#12364;&#26377;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;false (&#12487;&#12501;&#12457;&#12523;&#12488;)&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#12377;&#12409;&#12390;&#12398;Web&#12475;&#12483;&#12471;&#12519;&#12531;&#12398;&#20445;&#23384;&#12392;SFSB&#12398;&#12481;&#12455;&#12483;&#12463;&#12509;&#12452;&#12531;&#12488;&#35373;&#23450;&#12364;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12289;Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12289;&#12414;&#12383;&#12399;EJB&#12514;&#12472;&#12517;&#12540;&#12523;&#12391;&#28961;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;true&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12414;&#12383;&#12399;&#12514;&#12472;&#12517;&#12540;&#12523;&#12391;&#39640;&#21487;&#29992;&#24615;&#12364;&#26377;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#39640;&#21487;&#29992;&#24615;&#12364;&#12469;&#12540;&#12496;&#12540;&#12539;&#12524;&#12505;&#12523;&#12420;&#12467;&#12531;&#12486;&#12490;&#12539;&#12524;&#12505;&#12523;&#12394;&#12393;&#12398;&#12424;&#12426;&#39640;&#12356;&#12524;&#12505;&#12523;&#12391;&#27083;&#25104;&#12362;&#12424;&#12403;&#26377;&#21177;&#21270;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12398;&#12415;&#12289;true&#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;(<code>server</code>)&#12398;&#20182;&#12395;&#12463;&#12521;&#12473;&#12479;&#12414;&#12383;&#12399;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#23384;&#22312;&#12377;&#12427;&#22580;&#21512;&#12395;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;</dt>
<dd>
<p>&#12371;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12392;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12390;&#12356;&#12427;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12290;</p>
<p>&#12300;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;<code>server</code>&#12398;&#12415;&#12364;&#23384;&#22312;&#12377;&#12427;&#22580;&#21512;&#12395;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12463;&#12521;&#12473;&#12479;&#12414;&#12383;&#12399;&#12381;&#12398;&#20182;&#12398;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#23384;&#22312;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#24460;&#12289;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12434;&#36984;&#25246;&#12391;&#12365;&#12414;&#12377;&#12290;&#12300;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12395;&#31227;&#21205;&#12375;&#12390;&#12300;&#12479;&#12540;&#12466;&#12483;&#12488;&#12301;&#12479;&#12502;&#12434;&#36984;&#25246;&#12375;&#12289;&#30446;&#30340;&#12398;&#12479;&#12540;&#12466;&#12483;&#12488;&#12395;&#12300;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12398;&#31649;&#29702;&#12301;&#12434;&#36984;&#25246;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</dd>
<dt>Java Web Start</dt>
<dd>
<p>(&#19968;&#37096;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12479;&#12452;&#12503;&#12398;&#12415;)&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12364;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;Java Web Start&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;Java Web Start&#12391;&#12399;&#12502;&#12521;&#12454;&#12470;&#12395;&#20381;&#23384;&#12375;&#12394;&#12356;&#26041;&#27861;&#12391;&#12289;&#23554;&#29992;&#12398;Java&#20206;&#24819;&#12510;&#12471;&#12531;&#12391;&#23455;&#34892;&#12377;&#12427;Java&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12487;&#12503;&#12525;&#12452;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#35500;&#26126;</dt>
<dd>
<p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#30701;&#12356;&#35500;&#26126;&#12290;</p>
</dd>
<dt>&#20301;&#32622;</dt>
<dd>
<p>&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12390;&#12356;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#22580;&#25152;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12487;&#12503;&#12525;&#12452;&#38918;&#24207;</dt>
<dd>
<p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12487;&#12503;&#12525;&#12452;&#38918;&#24207;&#12290;</p>
<p>&#12469;&#12540;&#12496;&#12540;&#36215;&#21205;&#26178;&#12395;&#23567;&#12373;&#12356;&#25968;&#20516;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#20808;&#12395;&#12525;&#12540;&#12489;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12503;&#12525;&#12452;&#38918;&#24207;110&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12424;&#12426;&#20808;&#12395;&#12487;&#12503;&#12525;&#12452;&#38918;&#24207;102&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12525;&#12540;&#12489;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12503;&#12525;&#12452;&#38918;&#24207;&#12364;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12487;&#12503;&#12525;&#12452;&#26178;&#12395;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12487;&#12503;&#12525;&#12452;&#38918;&#24207;100&#12364;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12414;&#12377;&#12290;2&#12388;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#21516;&#12376;&#12487;&#12503;&#12525;&#12452;&#38918;&#24207;&#12391;&#12354;&#12427;&#22580;&#21512;&#12289;&#20808;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#26368;&#21021;&#12395;&#12525;&#12540;&#12489;&#12373;&#12428;&#12414;&#12377;&#12290;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#20381;&#23384;&#24615;&#12364;&#12354;&#12426;&#12289;&#29305;&#23450;&#12398;&#38918;&#24207;&#12391;&#12525;&#12540;&#12489;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#22580;&#21512;&#12289;&#12487;&#12503;&#12525;&#12452;&#38918;&#24207;&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#20415;&#21033;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12521;&#12452;&#12502;&#12521;&#12522;</dt>
<dd>
<p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#24517;&#35201;&#12394;&#12521;&#12452;&#12502;&#12521;&#12522;JAR&#12501;&#12449;&#12452;&#12523;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12514;&#12472;&#12517;&#12540;&#12523;&#12392;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;</dt>
<dd>
<p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#21517;&#21069;&#12392;&#12381;&#12428;&#12382;&#12428;&#12398;&#12456;&#12531;&#12472;&#12531;&#12434;&#34920;&#31034;&#12377;&#12427;&#34920;&#12290;Web&#12469;&#12540;&#12499;&#12473;&#12539;&#12456;&#12531;&#12489;&#12539;&#12509;&#12452;&#12531;&#12488;&#12395;&#12399;&#12289;&#12300;&#12456;&#12531;&#12489;&#12539;&#12509;&#12452;&#12531;&#12488;&#12398;&#34920;&#31034;&#12301;&#12434;&#36984;&#25246;&#12375;&#12289;&#12300;Web&#12469;&#12540;&#12499;&#12473;&#12539;&#12456;&#12531;&#12489;&#12539;&#12509;&#12452;&#12531;&#12488;&#24773;&#22577;&#12301;&#12506;&#12540;&#12472;&#12434;&#34920;&#31034;&#12391;&#12365;&#12414;&#12377;&#12290;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12395;&#12399;&#12289;&#12300;&#36215;&#21205;&#12301;&#12434;&#36984;&#25246;&#12375;&#12390;&#12300;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#36215;&#21205;&#12301;&#12506;&#12540;&#12472;&#12434;&#34920;&#31034;&#12375;&#12383;&#12426;&#12289;&#12300;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12473;&#12479;&#12502;&#12398;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12301;&#12434;&#36984;&#25246;&#12375;&#12390;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12473;&#12479;&#12502;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<a id="GHCOM368" name="GHCOM368"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-appedit.html">&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-applistdeployed.html">&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12522;&#12473;&#12488;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12434;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">&#12467;&#12493;&#12463;&#12479;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">EJB JAR&#12434;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#35352;&#36848;&#23376;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appviewtargets.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12479;&#12540;&#12466;&#12483;&#12488;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-endpoint.html">Web&#12469;&#12540;&#12499;&#12473;&#12398;&#12456;&#12531;&#12489;&#12509;&#12452;&#12531;&#12488;&#24773;&#22577;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-applaunch.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#36215;&#21205;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12434;&#36215;&#21205;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12473;&#12479;&#12502;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appredeploy.html">&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#20877;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-apprestart.html">&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#20877;&#12525;&#12540;&#12489;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#23550;&#35937;&#31684;&#22258;&#12392;&#12377;&#12427;&#12395;&#12399;&#12522;&#12477;&#12540;&#12473;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#23550;&#35937;&#31684;&#22258;&#12392;&#12377;&#12427;&#12395;&#12399;&#12522;&#12477;&#12540;&#12473;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
