<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-serverinstjvmpathsettings" name="ref-serverinstjvmpathsettings"></a></p>

<h4><a id="sthref190" name="sthref190"></a>JVM&#12497;&#12473;&#35373;&#23450;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12493;&#12452;&#12486;&#12451;&#12502;&#12539;&#12521;&#12452;&#12502;&#12521;&#12522;&#12539;&#12497;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;JVM&#12497;&#12473;&#35373;&#23450;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#12493;&#12452;&#12486;&#12451;&#12502;&#12539;&#12521;&#12452;&#12502;&#12521;&#12522;&#12539;&#12497;&#12473;&#12399;&#12289;&#27425;&#12398;&#12497;&#12473;&#12434;&#36899;&#32080;&#12375;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;</p>
<ul>
<li>
<p>&#12493;&#12452;&#12486;&#12451;&#12502;&#12539;&#12521;&#12452;&#12502;&#12521;&#12522;&#12539;&#12497;&#12473;&#12398;&#25509;&#38957;&#36766;</p>
</li>
<li>
<p>&#12493;&#12452;&#12486;&#12451;&#12502;&#12539;&#12521;&#12452;&#12502;&#12521;&#12522;&#12398;&#12469;&#12540;&#12496;&#12540;&#12398;&#12497;&#12473;(as-install<code>/lib</code>)</p>
</li>
<li>
<p>64&#12499;&#12483;&#12488;&#12398;&#12493;&#12452;&#12486;&#12451;&#12502;&#12539;&#12521;&#12452;&#12502;&#12521;&#12522;&#12398;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;(&#35442;&#24403;&#12377;&#12427;&#22580;&#21512;)</p>
</li>
<li>
<p>GlassFish Server&#12398;&#36215;&#21205;&#12395;&#20351;&#29992;&#12377;&#12427;JVM&#12398;<code>java.library.path</code>&#22793;&#25968;&#12398;&#20516;(&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12539;&#12471;&#12473;&#12486;&#12512;&#12395;&#12424;&#12387;&#12390;&#30064;&#12394;&#12427;)</p>
</li>
<li>
<p>&#12300;<a href="ref-serverinstjvmprofiler.html">JVM&#12503;&#12525;&#12501;&#12449;&#12452;&#12521;&#35373;&#23450;</a>&#12301;&#12506;&#12540;&#12472;&#12391;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#12377;&#12409;&#12390;&#12398;&#12497;&#12473;(&#12503;&#12525;&#12501;&#12449;&#12452;&#12521;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;)</p>
</li>
<li>
<p>&#12493;&#12452;&#12486;&#12451;&#12502;&#12539;&#12521;&#12452;&#12502;&#12521;&#12522;&#12539;&#12497;&#12473;&#12398;&#25509;&#23614;&#36766;</p>
</li>
</ul>
<p>&#12381;&#12398;&#20182;&#12398;&#35373;&#23450;&#12399;&#12289;GlassFish Server&#12398;&#20197;&#21069;&#12398;&#12522;&#12522;&#12540;&#12473;&#12363;&#12425;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12373;&#12428;&#12383;&#12489;&#12513;&#12452;&#12531;&#12398;&#35501;&#21462;&#12426;&#23554;&#29992;&#12398;&#20516;&#12392;&#12375;&#12390;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12399;&#12289;v3&#12522;&#12522;&#12540;&#12473;&#12391;&#12399;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;</p>
<p>&#12300;JVM&#12497;&#12473;&#35373;&#23450;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#27083;&#25104;&#21517;</dt>
<dd>
<p>&#12371;&#12398;&#12506;&#12540;&#12472;&#12398;&#35373;&#23450;&#12364;&#36969;&#29992;&#12373;&#12428;&#12427;&#27083;&#25104;&#12398;&#21517;&#21069;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#29872;&#22659;&#12463;&#12521;&#12473;&#12497;&#12473;</dt>
<dd>
<p>&#12300;&#28961;&#35222;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12364;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;<code>CLASSPATH</code>&#29872;&#22659;&#22793;&#25968;&#12399;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290;<code>CLASSPATH</code>&#29872;&#22659;&#22793;&#25968;&#12399;&#12289;&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#12398;&#22522;&#26412;&#32244;&#32722;&#12391;&#12399;&#20415;&#21033;&#12391;&#12377;&#12364;&#12289;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#29872;&#22659;&#12391;&#12398;&#20351;&#29992;&#12399;&#12362;&#34214;&#12417;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12471;&#12473;&#12486;&#12512;&#12539;&#12463;&#12521;&#12473;&#12497;&#12473;</dt>
<dd>
<p>&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#12471;&#12473;&#12486;&#12512;&#19978;&#12398;&#12463;&#12521;&#12473;&#12408;&#12398;&#12497;&#12473;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12463;&#12521;&#12473;&#12497;&#12473;&#12398;&#25509;&#38957;&#36766;</dt>
<dd>
<p>&#12469;&#12540;&#12496;&#12540;&#12398;&#12463;&#12521;&#12473;&#12497;&#12473;&#12398;&#21069;&#12395;&#36861;&#21152;&#12373;&#12428;&#12427;JAR&#12501;&#12449;&#12452;&#12523;&#12408;&#12398;&#12501;&#12523;&#12497;&#12473;&#12290;1&#34892;&#12395;1&#12388;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12463;&#12521;&#12473;&#12497;&#12473;&#12398;&#25509;&#23614;&#36766;</dt>
<dd>
<p>&#12469;&#12540;&#12496;&#12540;&#12398;&#12463;&#12521;&#12473;&#12497;&#12473;&#12398;&#24460;&#12395;&#36861;&#21152;&#12373;&#12428;&#12427;JAR&#12501;&#12449;&#12452;&#12523;&#12408;&#12398;&#12501;&#12523;&#12497;&#12473;&#12290;1&#34892;&#12395;1&#12388;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12493;&#12452;&#12486;&#12451;&#12502;&#12539;&#12521;&#12452;&#12502;&#12521;&#12522;&#12539;&#12497;&#12473;&#12398;&#25509;&#38957;&#36766;</dt>
<dd>
<p>&#12493;&#12452;&#12486;&#12451;&#12502;&#12539;&#12521;&#12452;&#12502;&#12521;&#12522;&#12539;&#12497;&#12473;&#12398;&#21069;&#12395;&#36861;&#21152;&#12373;&#12428;&#12427;JAR&#12501;&#12449;&#12452;&#12523;&#12408;&#12398;&#12501;&#12523;&#12497;&#12473;&#12290;1&#34892;&#12395;1&#12388;&#12290;</p>
</dd>
<dt>&#12493;&#12452;&#12486;&#12451;&#12502;&#12539;&#12521;&#12452;&#12502;&#12521;&#12522;&#12539;&#12497;&#12473;&#12398;&#25509;&#23614;&#36766;</dt>
<dd>
<p>&#12493;&#12452;&#12486;&#12451;&#12502;&#12539;&#12521;&#12452;&#12502;&#12521;&#12522;&#12539;&#12497;&#12473;&#12398;&#24460;&#12395;&#36861;&#21152;&#12373;&#12428;&#12427;JAR&#12501;&#12449;&#12452;&#12523;&#12408;&#12398;&#12501;&#12523;&#12497;&#12473;&#12290;1&#34892;&#12395;1&#12388;&#12290;</p>
</dd>
</dl>
<a id="GHCOM414" name="GHCOM414"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-jvmsettings.html">JVM&#12398;&#20840;&#33324;&#30340;&#12394;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jvmpathsettings.html">JVM&#12497;&#12473;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jvmoptions.html">JVM&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-securitymanagerdisable.html">&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12493;&#12540;&#12472;&#12515;&#12434;&#28961;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jvmprofilersettings.html">JVM&#12503;&#12525;&#12501;&#12449;&#12452;&#12521;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="GHCOM415" name="GHCOM415"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00042"><code>create-jvm-options</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00094"><code>delete-jvm-options</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00180"><code>list-jvm-options</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00050"><code>create-profiler</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00102"><code>delete-profiler</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
