<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-securityadmin" name="ref-securityadmin"></a></p>

<h4>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#20445;&#35703;&#12373;&#12428;&#12383;&#31649;&#29702;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#20445;&#35703;&#12373;&#12428;&#12383;&#31649;&#29702;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#20445;&#35703;&#12373;&#12428;&#12383;&#31649;&#29702;&#12434;&#26377;&#21177;&#12414;&#12383;&#12399;&#28961;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#20445;&#35703;&#12373;&#12428;&#12383;&#31649;&#29702;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12398;&#21205;&#20316;&#12399;&#27425;&#12398;&#12392;&#12362;&#12426;&#12391;&#12377;&#12290;</p>
<ul>
<li>
<p>&#12489;&#12513;&#12452;&#12531;&#12398;DAS&#12362;&#12424;&#12403;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#12289;SSL&#35388;&#26126;&#26360;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#30456;&#20114;&#12395;&#36865;&#20449;&#12377;&#12427;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#26263;&#21495;&#21270;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>DAS&#12399;&#12289;asadmin&#12518;&#12540;&#12486;&#12451;&#12522;&#12486;&#12451;&#12420;IDE&#12394;&#12393;&#12398;&#12522;&#12514;&#12540;&#12488;&#31649;&#29702;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12363;&#12425;&#31649;&#29702;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#21463;&#12369;&#20837;&#12428;&#12414;&#12377;&#12290;</p>
</li>
</ul>
<p>&#12300;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#20445;&#35703;&#12373;&#12428;&#12383;&#31649;&#29702;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#24773;&#22577;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#20445;&#35703;&#12373;&#12428;&#12383;&#31649;&#29702;&#12398;&#26377;&#21177;&#21270;</dt>
<dd>
<p>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#20445;&#35703;&#12373;&#12428;&#12383;&#31649;&#29702;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12371;&#12398;&#12508;&#12479;&#12531;&#12399;&#12289;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#20445;&#35703;&#12373;&#12428;&#12383;&#31649;&#29702;&#12364;&#26377;&#21177;&#12391;&#12394;&#12356;&#22580;&#21512;&#12398;&#12415;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
&#12489;&#12513;&#12452;&#12531;&#12398;&#31649;&#29702;&#12518;&#12540;&#12470;&#12540;&#12398;&#12497;&#12473;&#12527;&#12540;&#12489;&#12364;&#31354;&#12398;&#22580;&#21512;&#12289;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#20445;&#35703;&#12373;&#12428;&#12383;&#31649;&#29702;&#12398;&#26377;&#21177;&#21270;&#12399;&#22833;&#25943;&#12375;&#12414;&#12377;&#12290;<br />
<hr>

</dd>
<dt>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#20445;&#35703;&#12373;&#12428;&#12383;&#31649;&#29702;&#12398;&#28961;&#21177;&#21270;</dt>
<dd>
<p>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#20445;&#35703;&#12373;&#12428;&#12383;&#31649;&#29702;&#12434;&#28961;&#21177;&#12395;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12371;&#12398;&#12508;&#12479;&#12531;&#12399;&#12289;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#20445;&#35703;&#12373;&#12428;&#12383;&#31649;&#29702;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12398;&#12415;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#31649;&#29702;&#12456;&#12452;&#12522;&#12450;&#12473;</dt>
<dd>
<p>DAS&#19978;&#12398;SSL/TLS&#35388;&#26126;&#26360;&#12434;&#21442;&#29031;&#12377;&#12427;&#12456;&#12452;&#12522;&#12450;&#12473;&#12290;&#12371;&#12398;&#12456;&#12452;&#12522;&#12450;&#12473;&#12399;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#23550;&#12375;&#12390;&#33258;&#36523;&#12434;&#35672;&#21029;&#12377;&#12427;&#12383;&#12417;&#12395;DAS&#12395;&#12424;&#12387;&#12390;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>s1as</code>&#12391;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#20445;&#35703;&#12373;&#12428;&#12383;&#31649;&#29702;&#12364;&#26377;&#21177;&#12391;&#12394;&#12356;&#22580;&#21512;&#12398;&#12415;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12539;&#12456;&#12452;&#12522;&#12450;&#12473;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#19978;&#12398;SSL/TLS&#35388;&#26126;&#26360;&#12434;&#21442;&#29031;&#12377;&#12427;&#12456;&#12452;&#12522;&#12450;&#12473;&#12290;&#12371;&#12398;&#12456;&#12452;&#12522;&#12450;&#12473;&#12399;&#12289;DAS&#12395;&#23550;&#12375;&#12390;&#33258;&#36523;&#12434;&#35672;&#21029;&#12377;&#12427;&#12383;&#12417;&#12395;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12424;&#12387;&#12390;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>glassfish-instance</code>&#12391;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#20445;&#35703;&#12373;&#12428;&#12383;&#31649;&#29702;&#12364;&#26377;&#21177;&#12391;&#12394;&#12356;&#22580;&#21512;&#12398;&#12415;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<a id="GHCOM357" name="GHCOM357"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-enable-secure-admin.html">&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#20445;&#35703;&#12373;&#12428;&#12383;&#31649;&#29702;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-disable-secure-admin.html">&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#20445;&#35703;&#12373;&#12428;&#12383;&#31649;&#29702;&#12434;&#28961;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="GHCOM358" name="GHCOM358"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00129"><code>enable-secure-admin</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00121"><code>disable-secure-admin</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
