<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-messagesecurityconfigedit" name="ref-messagesecurityconfigedit"></a></p>

<h4><a id="sthref229" name="sthref229"></a>&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12398;&#32232;&#38598;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12398;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12398;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>GlassFish Server&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;Web&#12469;&#12540;&#12499;&#12473;&#12539;&#12456;&#12531;&#12489;&#12539;&#12509;&#12452;&#12531;&#12488;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;&#12469;&#12540;&#12496;&#12540;&#20596;&#12391;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#20351;&#29992;&#12373;&#12428;&#12427;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#22580;&#21512;&#12289;GlassFish Server&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;Web&#12469;&#12540;&#12499;&#12473;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12364;&#20351;&#29992;&#12377;&#12427;&#12503;&#12525;&#12496;&#12452;&#12480;&#12418;&#26377;&#21177;&#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12364;&#20351;&#29992;&#12377;&#12427;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#26041;&#27861;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a href="task-enablemesec4appclients.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a>&#12395;&#35352;&#36617;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12503;&#12525;&#12452;&#28168;&#12456;&#12531;&#12489;&#12539;&#12509;&#12452;&#12531;&#12488;&#12363;&#12425;&#12398;Web&#12469;&#12540;&#12499;&#12473;&#21628;&#20986;&#12375;&#12395;&#23550;&#12375;&#12390;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;GlassFish Server&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#26377;&#21177;&#12395;&#12375;&#12383;&#22580;&#21512;&#12289;GlassFish Server&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#12456;&#12531;&#12489;&#12539;&#12509;&#12452;&#12531;&#12488;&#12363;&#12425;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;&#12377;&#12409;&#12390;&#12398;&#12469;&#12540;&#12499;&#12473;&#12364;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12524;&#12452;&#12516;&#12540;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12392;&#20114;&#25563;&#24615;&#12434;&#25345;&#12388;&#12424;&#12358;&#12395;&#27083;&#25104;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12398;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#27083;&#25104;&#21517;</dt>
<dd>
<p>&#12371;&#12398;&#12506;&#12540;&#12472;&#12398;&#35373;&#23450;&#12364;&#36969;&#29992;&#12373;&#12428;&#12427;&#27083;&#25104;&#12398;&#21517;&#21069;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#35469;&#35388;&#12524;&#12452;&#12516;&#12540;</dt>
<dd>
<p>&#35469;&#35388;&#12364;&#23455;&#34892;&#12373;&#12428;&#12427;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12524;&#12452;&#12516;&#12540;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;&#25351;&#23450;&#12391;&#12365;&#12427;&#20516;&#12399;&#12289;<code>SOAP</code>(&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;)&#12414;&#12383;&#12399;<code>HttpServlet</code>&#12398;&#12356;&#12378;&#12428;&#12363;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;</dt>
<dd>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12469;&#12540;&#12496;&#12540;&#20596;&#12503;&#12525;&#12496;&#12452;&#12480;(&#12354;&#12427;&#22580;&#21512;)&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;(&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;)&#12399;&#12289;&#29305;&#23450;&#12398;&#12469;&#12540;&#12496;&#12540;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#35672;&#21029;&#12375;&#12394;&#12356;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;&#12467;&#12540;&#12523;&#12373;&#12428;&#12427;&#12469;&#12540;&#12496;&#12540;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12391;&#12377;&#12290;<code>ServerProvider</code>&#12414;&#12383;&#12399;<code>XWS_ServerProvider</code>&#12434;&#25351;&#23450;&#12377;&#12427;&#12363;&#12289;&#20309;&#12418;&#25351;&#23450;&#12375;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12503;&#12525;&#12496;&#12452;&#12480;&#12399;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#12375;&#12383;&#12364;&#12387;&#12390;&#12289;GlassFish Server&#12399;&#12469;&#12540;&#12496;&#12540;&#20596;&#12391;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#21628;&#12403;&#20986;&#12375;&#12414;&#12379;&#12435;&#12290;&#36890;&#24120;&#12399;&#12289;<code>ServerProvider</code>&#12434;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12392;&#12375;&#12390;&#36984;&#25246;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</dd>
<dt>&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;</dt>
<dd>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;(&#12354;&#12427;&#22580;&#21512;)&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12399;&#12289;&#29305;&#23450;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#35672;&#21029;&#12375;&#12394;&#12356;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12391;&#12377;&#12290;<code>ClientProvider</code>&#12414;&#12383;&#12399;<code>XWS_ClientProvider</code>&#12434;&#25351;&#23450;&#12377;&#12427;&#12363;&#12289;&#20309;&#12418;&#25351;&#23450;&#12375;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12503;&#12525;&#12496;&#12452;&#12480;&#12399;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#12375;&#12383;&#12364;&#12387;&#12390;&#12289;GlassFish Server&#12399;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#20596;&#12391;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#21628;&#12403;&#20986;&#12375;&#12414;&#12379;&#12435;&#12290;&#36890;&#24120;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12395;&#12399;&#20309;&#12418;&#36984;&#25246;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12392;&#12513;&#12483;&#12475;&#12540;&#12472;&#20445;&#35703;&#12509;&#12522;&#12471;&#12540;&#12434;&#26377;&#21177;&#12395;&#12375;&#12390;&#12289;GlassFish Server&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;Web&#12469;&#12540;&#12499;&#12473;&#12539;&#12456;&#12531;&#12489;&#12539;&#12509;&#12452;&#12531;&#12488;&#12363;&#12425;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;Web&#12469;&#12540;&#12499;&#12473;&#12395;&#36969;&#29992;&#12377;&#12427;&#22580;&#21512;&#12289;<code>ClientProvider</code>&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<a id="GHCOM461" name="GHCOM461"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12391;&#20351;&#29992;&#12373;&#12428;&#12427;GlassFish Server&#27231;&#33021;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#27083;&#25104;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#27083;&#25104;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#27083;&#25104;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="GHCOM462" name="GHCOM462"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<p>&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00226"><code>set</code>(1)</a>&#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#25351;&#23450;&#12377;&#12427;&#12395;&#12399;&#12289;&#27425;&#12398;&#12467;&#12510;&#12531;&#12489;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;</p>
<pre>
asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
default_provider=ServerProvider
</pre></li>
<li>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#25351;&#23450;&#12377;&#12427;&#12395;&#12399;&#12289;&#27425;&#12398;&#12467;&#12510;&#12531;&#12489;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;</p>
<pre>
asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
default_client_provider=ClientProvider
</pre></li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
