<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-generaltab" name="ref-generaltab"></a><a id="GHCOM00058" name="GHCOM00058"></a></p>

<h4><a id="sthref232" name="sthref232"></a><a id="sthref233" name="sthref233"></a>&#19968;&#33324;&#24773;&#22577;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>GlassFish Server&#12399;&#12289;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#26178;&#12395;<code>server</code>&#12392;&#12356;&#12358;&#21517;&#21069;&#12398;1&#12388;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#21066;&#38500;&#12375;&#12289;&#24517;&#35201;&#12395;&#24540;&#12376;&#12390;&#26032;&#35215;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#21029;&#12398;&#21517;&#21069;&#12391;&#20316;&#25104;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<p>GlassFish Server&#12398;&#21508;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12399;&#12289;&#22266;&#26377;&#12398;Java&#27083;&#25104;&#12289;Java&#12522;&#12477;&#12540;&#12473;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#38936;&#22495;&#12289;&#12362;&#12424;&#12403;&#12469;&#12540;&#12496;&#12540;&#27083;&#25104;&#35373;&#23450;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;1&#12388;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#22793;&#26356;&#12375;&#12390;&#12418;&#12289;&#20182;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12399;&#24433;&#38911;&#12375;&#12414;&#12379;&#12435;&#12290;1&#12388;&#12398;&#31649;&#29702;&#12489;&#12513;&#12452;&#12531;&#20869;&#12395;1&#12388;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#21547;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<p>&#22810;&#12367;&#12398;&#12518;&#12540;&#12470;&#12540;&#12399;&#12289;1&#12388;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#12491;&#12540;&#12474;&#12364;&#28288;&#12383;&#12373;&#12428;&#12414;&#12377;&#12290;&#12383;&#12384;&#12375;&#12289;&#29872;&#22659;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#36861;&#21152;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#38283;&#30330;&#29872;&#22659;&#12391;&#30064;&#12394;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20351;&#29992;&#12375;&#12289;&#30064;&#12394;&#12427;GlassFish Server&#27083;&#25104;&#12391;&#12486;&#12473;&#12488;&#12375;&#12383;&#12426;&#12289;&#30064;&#12394;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12434;&#27604;&#36611;&#12375;&#12390;&#12486;&#12473;&#12488;&#12391;&#12365;&#12414;&#12377;&#12290;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#31777;&#21336;&#12395;&#36861;&#21152;&#12414;&#12383;&#12399;&#21066;&#38500;&#12391;&#12365;&#12427;&#12383;&#12417;&#12289;&#12381;&#12428;&#12434;&#21033;&#29992;&#12375;&#12390;&#19968;&#26178;&#30340;&#12394;&#12300;&#12469;&#12531;&#12489;&#12508;&#12483;&#12463;&#12473;&#12301;&#38936;&#22495;&#12434;&#20316;&#25104;&#12375;&#12289;&#38283;&#30330;&#20013;&#12395;&#23455;&#39443;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<p>&#12414;&#12383;&#12289;&#21508;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12434;&#20316;&#25104;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;&#21336;&#19968;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#28168;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#20869;&#12391;&#12289;&#20250;&#31038;&#12420;&#20491;&#20154;&#12398;&#12489;&#12513;&#12452;&#12531;&#21517;&#12289;IP&#12450;&#12489;&#12524;&#12473;&#12289;&#12362;&#12424;&#12403;&#35079;&#25968;&#12398;&#31649;&#29702;&#27231;&#33021;&#12434;&#25552;&#20379;&#12391;&#12365;&#12414;&#12377;&#12290;&#12518;&#12540;&#12470;&#12540;&#12395;&#12392;&#12387;&#12390;&#12399;&#12289;&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12362;&#12424;&#12403;&#22522;&#26412;&#30340;&#12394;&#12469;&#12540;&#12496;&#12540;&#12539;&#12513;&#12531;&#12486;&#12490;&#12531;&#12473;&#12394;&#12375;&#12391;&#12289;&#29420;&#33258;&#12398;Web&#12469;&#12540;&#12496;&#12540;&#12434;&#25152;&#26377;&#12377;&#12427;&#12398;&#12392;&#21516;&#27096;&#12391;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12399;&#12289;&#35079;&#25968;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12414;&#12383;&#12364;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12398;&#35443;&#32048;&#12399;&#12289;<a href="ref-serverinstjvmgeneral.html">JVM&#12398;&#20840;&#33324;&#30340;&#12394;&#35373;&#23450;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>&#36939;&#29992;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12391;&#12399;&#12289;&#22810;&#12367;&#12398;&#30446;&#30340;&#12398;&#12383;&#12417;&#12395;&#12289;&#35079;&#25968;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#12399;&#12394;&#12367;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12434;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#12383;&#12384;&#12375;&#12289;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12364;&#12491;&#12540;&#12474;&#12434;&#28288;&#12383;&#12373;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#35079;&#25968;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<p>GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#33258;&#21205;&#30340;&#12395;&#36215;&#21205;&#12375;&#12414;&#12379;&#12435;&#12290;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#19968;&#24230;&#36215;&#21205;&#12377;&#12427;&#12392;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#20572;&#27490;&#12377;&#12427;&#12414;&#12391;&#23455;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20572;&#27490;&#12377;&#12427;&#12392;&#12289;&#12381;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#26032;&#35215;&#25509;&#32154;&#12398;&#21463;&#20837;&#12428;&#12434;&#20572;&#27490;&#12375;&#12383;&#24460;&#12289;&#26410;&#20966;&#29702;&#12398;&#25509;&#32154;&#12364;&#12377;&#12409;&#12390;&#23436;&#20102;&#12377;&#12427;&#12414;&#12391;&#24453;&#27231;&#12375;&#12414;&#12377;&#12290;&#12510;&#12471;&#12531;&#12364;&#12463;&#12521;&#12483;&#12471;&#12517;&#12375;&#12383;&#12426;&#12458;&#12501;&#12521;&#12452;&#12531;&#12395;&#12394;&#12427;&#12392;&#12289;&#12469;&#12540;&#12496;&#12540;&#12364;&#32066;&#20102;&#12377;&#12427;&#12383;&#12417;&#12289;&#20966;&#29702;&#20013;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12364;&#22833;&#12431;&#12428;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#19968;&#33324;&#24773;&#22577;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;GlassFish Server&#35373;&#23450;&#12434;&#30906;&#35469;&#12375;&#12289;Java&#20206;&#24819;&#12510;&#12471;&#12531;&#12398;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#19968;&#33324;&#24773;&#22577;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#24773;&#22577;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12300;&#20572;&#27490;&#12301;&#12508;&#12479;&#12531;</dt>
<dd>
<p>&#12300;&#20572;&#27490;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;GlassFish Server&#12364;&#20572;&#27490;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12300;&#20877;&#36215;&#21205;&#12301;&#12508;&#12479;&#12531;</dt>
<dd>
<p>&#12300;&#20877;&#36215;&#21205;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;GlassFish Server&#12364;&#20877;&#36215;&#21205;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12300;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#34920;&#31034;&#12301;&#12508;&#12479;&#12531;</dt>
<dd>
<p>&#12300;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#34920;&#31034;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#12289;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12414;&#12383;&#12399;&#12463;&#12521;&#12473;&#12479;&#12398;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#34920;&#31034;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12300;&#12525;&#12464;&#12398;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12301;&#12508;&#12479;&#12531;</dt>
<dd>
<p>&#12300;&#12525;&#12464;&#12398;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#12289;&#31649;&#29702;&#12469;&#12540;&#12496;&#12540;(<code>server</code>&#12392;&#12356;&#12358;&#21517;&#21069;)&#12398;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12300;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#12522;&#12459;&#12496;&#12522;&#12301;&#12508;&#12479;&#12531;</dt>
<dd>
<p>&#12300;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#12522;&#12459;&#12496;&#12522;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#12289;&#12300;<code>&#12301;&#12506;&#12540;&#12472;&#12395;&#12354;&#12427;&#31649;&#29702;&#12469;&#12540;&#12496;&#12540;(</code>server<a href="ref-recovertransactions.html">&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#12522;&#12459;&#12496;&#12522;</a>&#12392;&#12356;&#12358;&#21517;&#21069;)&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#12522;&#12459;&#12496;&#12522;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12300;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#20445;&#35703;&#12373;&#12428;&#12383;&#31649;&#29702;&#12301;&#12508;&#12479;&#12531;</dt>
<dd>
<p>&#12300;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#20445;&#35703;&#12373;&#12428;&#12383;&#31649;&#29702;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#12289;&#12300;<a href="ref-securityadmin.html">&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#20445;&#35703;&#12373;&#12428;&#12383;&#31649;&#29702;</a>&#12301;&#12506;&#12540;&#12472;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#20445;&#35703;&#12373;&#12428;&#12383;&#31649;&#29702;&#12434;&#26377;&#21177;&#12414;&#12383;&#12399;&#28961;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#21517;&#21069;</dt>
<dd>
<p>&#29694;&#22312;&#12398;&#12469;&#12540;&#12496;&#12540;&#12398;&#21517;&#21069;&#12290;</p>
</dd>
<dt>&#12473;&#12486;&#12540;&#12479;&#12473;</dt>
<dd>
<p>&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#29694;&#22312;&#12398;&#12473;&#12486;&#12540;&#12479;&#12473;&#12290;&#12469;&#12540;&#12496;&#12540;&#12398;&#12473;&#12486;&#12540;&#12479;&#12473;&#12399;&#12289;&#12300;&#20572;&#27490;&#12301;&#12289;&#12300;&#38283;&#22987;&#12301;&#12289;&#12414;&#12383;&#12399;&#12300;&#31292;&#20685;&#20013;&#12301;&#12398;&#12356;&#12378;&#12428;&#12363;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#31292;&#20685;&#26178;&#38291;</dt>
<dd>
<p>&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#36899;&#32154;&#12375;&#12390;&#31292;&#20685;&#12375;&#12390;&#12356;&#12427;&#26178;&#38291;&#25968;(&#26178;&#12362;&#12424;&#12403;&#20998;)&#12290;&#12371;&#12428;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>HTTP&#12525;&#12540;&#12489;&#12539;&#12496;&#12521;&#12531;&#12469;</dt>
<dd>
<p>&#12525;&#12540;&#12489;&#12539;&#12496;&#12521;&#12531;&#12469;&#12398;&#21517;&#21069;(&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#23550;&#12375;&#12390;&#26377;&#21177;&#12394;&#22580;&#21512;)&#12290;</p>
</dd>
<dt>JVM</dt>
<dd>
<p>&#12300;JVM&#12524;&#12509;&#12540;&#12488;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;Java&#20206;&#24819;&#12510;&#12471;&#12531;&#12395;&#38306;&#12377;&#12427;&#12524;&#12509;&#12540;&#12488;&#12364;&#12289;&#26032;&#35215;&#12454;&#12451;&#12531;&#12489;&#12454;&#12391;&#38283;&#12365;&#12414;&#12377;&#12290;&#34920;&#31034;&#12373;&#12428;&#12427;&#12524;&#12509;&#12540;&#12488;&#12399;&#12289;&#12469;&#12510;&#12522;&#12540;&#12539;&#12524;&#12509;&#12540;&#12488;&#12289;&#12513;&#12514;&#12522;&#12540;&#31649;&#29702;&#12362;&#12424;&#12403;&#12460;&#12505;&#12540;&#12472;&#12539;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12539;&#12524;&#12509;&#12540;&#12488;&#12289;&#12463;&#12521;&#12473;&#12539;&#12525;&#12540;&#12487;&#12451;&#12531;&#12464;&#12539;&#12524;&#12509;&#12540;&#12488;&#12289;&#12362;&#12424;&#12403;&#29694;&#22312;&#12398;&#12473;&#12524;&#12483;&#12489;&#12398;&#12480;&#12531;&#12503;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#27083;&#25104;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;</dt>
<dd>
<p><code>domain.xml</code>&#12394;&#12393;&#12398;&#27083;&#25104;&#12501;&#12449;&#12452;&#12523;&#12434;&#21547;&#12416;&#12507;&#12473;&#12488;&#12539;&#12510;&#12471;&#12531;&#19978;&#12398;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12290;</p>
</dd>
<dt>&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12390;&#12356;&#12427;&#12496;&#12540;&#12472;&#12519;&#12531;</dt>
<dd>
<p>&#35069;&#21697;&#12496;&#12540;&#12472;&#12519;&#12531;&#35672;&#21029;&#23376;&#12290;</p>
</dd>
<dt>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#20445;&#35703;&#12373;&#12428;&#12383;&#31649;&#29702;</dt>
<dd>
<p>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#20445;&#35703;&#12373;&#12428;&#12383;&#31649;&#29702;&#12398;&#29694;&#22312;&#12398;&#12473;&#12486;&#12540;&#12479;&#12473;&#12290;&#20351;&#29992;&#21487;&#33021;&#12394;&#20516;&#12399;&#12300;&#26377;&#21177;&#12301;&#12362;&#12424;&#12403;&#12300;&#28961;&#21177;&#12301;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12487;&#12496;&#12483;&#12464;</dt>
<dd>
<p>&#12487;&#12496;&#12483;&#12464;&#12364;&#26377;&#21177;&#12395;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#35672;&#21029;&#12375;&#12414;&#12377;&#12290;&#12487;&#12496;&#12483;&#12464;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12289;&#12509;&#12540;&#12488;&#30058;&#21495;&#12418;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>HTTP&#12509;&#12540;&#12488;</dt>
<dd>
<p>HTTP&#12522;&#12463;&#12456;&#12473;&#12488;&#12362;&#12424;&#12403;&#12524;&#12473;&#12509;&#12531;&#12473;&#29992;&#12395;&#29694;&#22312;&#27083;&#25104;&#12373;&#12428;&#12390;&#12356;&#12427;&#12509;&#12540;&#12488;&#12290;</p>
</dd>
<dt>IIOP&#12509;&#12540;&#12488;</dt>
<dd>
<p>IIOP&#12522;&#12463;&#12456;&#12473;&#12488;&#12362;&#12424;&#12403;&#12524;&#12473;&#12509;&#12531;&#12473;&#29992;&#12395;&#29694;&#22312;&#27083;&#25104;&#12373;&#12428;&#12390;&#12356;&#12427;&#12509;&#12540;&#12488;&#12290;</p>
</dd>
</dl>
<a id="sthref234" name="sthref234"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-generaltab.html">DAS&#12398;&#19968;&#33324;&#24773;&#22577;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-logviewer.html">DAS&#12398;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
