<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmxconnectoredit" name="ref-jmxconnectoredit"></a><a id="GHCOM00127" name="GHCOM00127"></a></p>

<h4><a id="sthref423" name="sthref423"></a>JMX&#12467;&#12493;&#12463;&#12479;&#12398;&#32232;&#38598;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;JMX&#12467;&#12493;&#12463;&#12479;&#12434;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;JSR 360&#28310;&#25312;&#12398;JMX&#12467;&#12493;&#12463;&#12479;&#12434;&#32232;&#38598;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;JMX&#12467;&#12493;&#12463;&#12479;&#12434;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#27083;&#25104;&#21517;</dt>
<dd>
<p>&#12371;&#12398;&#12506;&#12540;&#12472;&#12398;&#35373;&#23450;&#12364;&#36969;&#29992;&#12373;&#12428;&#12427;&#27083;&#25104;&#12398;&#21517;&#21069;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#21517;&#21069;</dt>
<dd>
<p>JMX&#12467;&#12493;&#12463;&#12479;&#12398;&#21517;&#21069;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>JMX&#12503;&#12525;&#12488;&#12467;&#12523;</dt>
<dd>
<p>&#12371;&#12398;JMX&#12467;&#12493;&#12463;&#12479;&#12364;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427;&#12503;&#12525;&#12488;&#12467;&#12523;&#12398;&#21517;&#21069;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>JMXServiceURL</dt>
<dd>
<p>JMX&#12469;&#12540;&#12499;&#12473;&#12398;URL&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;</dt>
<dd>
<p>&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12364;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;JMX&#36890;&#20449;&#12399;&#26263;&#21495;&#21270;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12450;&#12489;&#12524;&#12473;</dt>
<dd>
<p>JMX&#12467;&#12493;&#12463;&#12479;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12473;&#12479;&#12502;&#12364;&#30331;&#37682;&#12373;&#12428;&#12427;&#12493;&#12540;&#12512;&#12539;&#12469;&#12540;&#12499;&#12473;&#12398;IP&#12450;&#12489;&#12524;&#12473;&#12290;&#12371;&#12428;&#12399;&#12289;&#23455;&#38555;&#12398;JMX&#36890;&#20449;&#12434;&#34892;&#12358;&#12469;&#12540;&#12496;&#12540;&#12539;&#12477;&#12465;&#12483;&#12488;&#12398;&#12509;&#12540;&#12488;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;RMI&#12524;&#12472;&#12473;&#12488;&#12522;&#12364;&#38283;&#22987;&#12373;&#12428;&#12427;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12398;&#12450;&#12489;&#12524;&#12473;&#12391;&#12377;&#12290;&#12471;&#12473;&#12486;&#12512;&#12395;&#35079;&#25968;&#12398;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12364;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;&#29305;&#23450;&#12398;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12398;&#12415;&#12364;&#36984;&#25246;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12289;&#12371;&#12398;&#20516;&#12434;&#22793;&#26356;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12289;<code>0.0.0.0</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12509;&#12540;&#12488;</dt>
<dd>
<p>&#12493;&#12540;&#12512;&#12539;&#12469;&#12540;&#12499;&#12473;(RMI&#12524;&#12472;&#12473;&#12488;&#12522;)&#12364;RMI&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#25509;&#32154;&#12434;&#12522;&#12473;&#12491;&#12531;&#12464;&#12377;&#12427;&#12509;&#12540;&#12488;&#30058;&#21495;&#12290;&#12371;&#12398;&#12493;&#12540;&#12512;&#12539;&#12469;&#12540;&#12499;&#12473;&#12399;&#12289;RMI&#12473;&#12479;&#12502;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12377;&#12427;&#12383;&#12417;&#12395;&#12398;&#12415;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12509;&#12540;&#12488;&#12364;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#31354;&#12356;&#12390;&#12356;&#12427;&#12509;&#12540;&#12488;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#36969;&#20999;&#12394;&#20516;&#12399;1&#12363;&#12425;65535&#12391;&#12377;&#12290;UNIX&#12471;&#12473;&#12486;&#12512;&#12391;&#12289;&#12509;&#12540;&#12488;1&#12363;&#12425;1024&#12391;&#12522;&#12473;&#12491;&#12531;&#12464;&#12377;&#12427;&#12477;&#12465;&#12483;&#12488;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12473;&#12540;&#12497;&#12540;&#12518;&#12540;&#12470;&#12540;&#27177;&#38480;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;8686&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12524;&#12523;&#12512;&#21517;</dt>
<dd>
<p>&#29305;&#21029;&#12394;&#31649;&#29702;&#12524;&#12523;&#12512;&#12434;&#34920;&#12377;&#21517;&#21069;&#12290;&#12377;&#12409;&#12390;&#12398;&#35469;&#35388;&#12399;&#12289;&#12371;&#12398;&#12524;&#12523;&#12512;&#12395;&#12424;&#12387;&#12390;&#20966;&#29702;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>admin-realm</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;</dt>
<dd>
<p>JMX&#12467;&#12493;&#12463;&#12479;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12290;&#12356;&#12367;&#12388;&#12363;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<a id="sthref424" name="sthref424"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-jmxconnectoredit.html">JMX&#12467;&#12493;&#12463;&#12479;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmxconnectorssledit.html">JMX&#12467;&#12493;&#12463;&#12479;&#12398;SSL&#35373;&#23450;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref425" name="sthref425"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<p>&#12394;&#12375;&#12290;</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
