<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-uc-addon" name="ref-uc-addon"></a></p>

<h4><a id="sthref448" name="sthref448"></a><a id="sthref449" name="sthref449"></a>&#20351;&#29992;&#21487;&#33021;&#12394;&#12450;&#12489;&#12458;&#12531;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;&#20351;&#29992;&#21487;&#33021;&#12394;&#12450;&#12489;&#12458;&#12531;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#12414;&#12384;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12452;&#12513;&#12540;&#12472;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12395;&#38306;&#12377;&#12427;&#24773;&#22577;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#20351;&#29992;&#21487;&#33021;&#12394;&#12450;&#12489;&#12458;&#12531;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12497;&#12473;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12452;&#12513;&#12540;&#12472;&#12398;&#12523;&#12540;&#12488;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12414;&#12383;&#12399;&#26368;&#19978;&#20301;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12398;&#12501;&#12449;&#12452;&#12523;&#12539;&#12471;&#12473;&#12486;&#12512;&#12539;&#12497;&#12473;&#12290;</p>
</dd>
<dt>&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12450;&#12489;&#12458;&#12531;&#12539;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
<dt>&#20351;&#29992;&#21487;&#33021;&#12394;&#12450;&#12489;&#12458;&#12531;</dt>
<dd>
<p>&#12371;&#12398;&#34920;&#12395;&#12399;&#12289;&#12414;&#12384;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12452;&#12513;&#12540;&#12472;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12372;&#12392;&#12395;&#12289;&#27425;&#12398;&#24773;&#22577;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;</dt>
<dd>
<p>&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#21517;&#21069;&#12290;</p>
</dd>
<dt>&#12459;&#12486;&#12468;&#12522;</dt>
<dd>
<p>&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12364;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12390;&#12356;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12459;&#12486;&#12468;&#12522;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12289;&#12471;&#12473;&#12486;&#12512;&#12539;&#12484;&#12540;&#12523;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12394;&#12393;&#12391;&#12377;&#12290;&#12459;&#12486;&#12468;&#12522;&#12399;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#20316;&#25104;&#26178;&#12395;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#20316;&#25104;&#32773;&#12395;&#12424;&#12387;&#12390;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12496;&#12540;&#12472;&#12519;&#12531;</dt>
<dd>
<p>&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12364;&#25552;&#20379;&#12373;&#12428;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#30058;&#21495;&#12290;</p>
</dd>
<dt>&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;</dt>
<dd>
<p>&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12391;&#28040;&#36027;&#12373;&#12428;&#12427;&#12487;&#12451;&#12473;&#12463;&#23481;&#37327;&#12290;</p>
</dd>
<dt>&#12477;&#12540;&#12473;</dt>
<dd>
<p>&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#21462;&#24471;&#12377;&#12427;<a href="ref-uc-concepts.html#ref-uc-about-repository">&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;</a>&#12398;&#21517;&#21069;&#12290;</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref450" name="sthref450"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<p><a href="task-uc-addon.html">&#12450;&#12489;&#12458;&#12531;&#12539;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12395;&#12399;</a></p>
<a id="sthref451" name="sthref451"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<p>&#12394;&#12375;&#12290;</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
