<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-redeploy" name="ref-redeploy"></a></p>

<h4><a id="sthref182" name="sthref182"></a><a id="sthref183" name="sthref183"></a>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12414;&#12383;&#12399;&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#20877;&#12487;&#12503;&#12525;&#12452;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20197;&#21069;&#12395;&#12487;&#12503;&#12525;&#12452;&#12375;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#20877;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12414;&#12383;&#12399;&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#20877;&#12487;&#12503;&#12525;&#12452;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12414;&#12383;&#12399;&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#20877;&#12487;&#12503;&#12525;&#12452;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#20301;&#32622;</dt>
<dd>
<p>&#20877;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#26032;&#35215;&#12450;&#12540;&#12459;&#12452;&#12502;&#12398;&#22580;&#25152;&#12290;</p>
<p>&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12450;&#12540;&#12459;&#12452;&#12502;&#12395;&#12450;&#12463;&#12475;&#12473;&#21487;&#33021;&#12394;&#22580;&#25152;&#12392;&#12450;&#12540;&#12459;&#12452;&#12502;&#12364;&#12501;&#12449;&#12452;&#12523;&#12391;&#12354;&#12427;&#12363;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12391;&#12354;&#12427;&#12363;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12469;&#12540;&#12496;&#12540;&#12395;&#12450;&#12483;&#12503;&#12525;&#12540;&#12489;&#12373;&#12428;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#12539;&#12501;&#12449;&#12452;&#12523;</dt>
<dd>
<p>&#12371;&#12398;&#12450;&#12540;&#12459;&#12452;&#12502;&#12399;&#12289;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12510;&#12471;&#12531;&#12395;&#12354;&#12427;&#12501;&#12449;&#12452;&#12523;&#12289;&#12414;&#12383;&#12399;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12510;&#12471;&#12531;&#12363;&#12425;&#12450;&#12463;&#12475;&#12473;&#21487;&#33021;&#12394;&#12501;&#12449;&#12452;&#12523;&#12391;&#12377;&#12290;</p>
<p>&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12510;&#12471;&#12531;&#12392;&#12399;&#12289;&#12502;&#12521;&#12454;&#12470;&#12434;&#20171;&#12375;&#12390;&#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12434;&#34920;&#31034;&#12375;&#12390;&#12356;&#12427;&#12507;&#12473;&#12488;&#12391;&#12377;&#12290;</p>
</dd>
<dt>GlassFish Server&#12363;&#12425;&#12450;&#12463;&#12475;&#12473;&#21487;&#33021;&#12394;&#12525;&#12540;&#12459;&#12523;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12539;&#12501;&#12449;&#12452;&#12523;&#12414;&#12383;&#12399;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;</dt>
<dd>
<p>&#12371;&#12398;&#12450;&#12540;&#12459;&#12452;&#12502;&#12399;&#12289;&#12469;&#12540;&#12496;&#12540;&#12539;&#12510;&#12471;&#12531;&#12395;&#12354;&#12427;&#12501;&#12449;&#12452;&#12523;&#12289;&#12414;&#12383;&#12399;&#23637;&#38283;&#12373;&#12428;&#12383;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#12354;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#21270;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12377;&#12290;</p>
<p>&#12469;&#12540;&#12496;&#12540;&#12539;&#12510;&#12471;&#12531;&#12399;&#12289;GlassFish Server&#12398;&#12489;&#12513;&#12452;&#12531;&#31649;&#29702;&#12469;&#12540;&#12496;&#12540;&#12434;&#31292;&#20685;&#12375;&#12390;&#12356;&#12427;&#12507;&#12473;&#12488;&#12391;&#12377;&#12290;</p>
</dd>
</dl>
</dd>
<dt>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#21517;</dt>
<dd>
<p>&#20877;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#21517;&#21069;&#12434;&#34920;&#31034;&#12377;&#12427;&#35501;&#21462;&#12426;&#23554;&#29992;&#12501;&#12451;&#12540;&#12523;&#12489;&#12290;</p>
<p>&#21517;&#21069;&#12395;&#12399;&#12289;&#12458;&#12503;&#12471;&#12519;&#12531;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#35672;&#21029;&#23376;&#12434;&#21547;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#35672;&#21029;&#23376;&#12399;&#21517;&#21069;&#12398;&#24460;&#12395;&#32154;&#12365;&#12289;&#12467;&#12525;&#12531;(<code>:</code>)&#12391;&#21517;&#21069;&#12392;&#21306;&#20999;&#12426;&#12414;&#12377;&#12290;&#12514;&#12472;&#12517;&#12540;&#12523;&#12362;&#12424;&#12403;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Oracle GlassFish Server&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12460;&#12452;&#12489;</i>&#12398;<i>Module and Application Versions</i></a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</dd>
<dt>&#21487;&#29992;&#24615;</dt>
<dd>
<p>&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;Web&#12475;&#12483;&#12471;&#12519;&#12531;&#12289;&#12473;&#12486;&#12540;&#12488;&#12501;&#12523;&#12539;&#12475;&#12483;&#12471;&#12519;&#12531;Bean (SFSB)&#12481;&#12455;&#12483;&#12463;&#12509;&#12452;&#12531;&#12488;&#35373;&#23450;&#12289;&#12497;&#12483;&#12471;&#12505;&#12540;&#12471;&#12519;&#12531;&#12394;&#12393;&#12395;&#20633;&#12360;&#12390;&#39640;&#21487;&#29992;&#24615;&#12364;&#26377;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;false (&#12487;&#12501;&#12457;&#12523;&#12488;)&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#12377;&#12409;&#12390;&#12398;Web&#12475;&#12483;&#12471;&#12519;&#12531;&#12398;&#20445;&#23384;&#12392;SFSB&#12398;&#12481;&#12455;&#12483;&#12463;&#12509;&#12452;&#12531;&#12488;&#35373;&#23450;&#12364;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12289;Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12289;&#12414;&#12383;&#12399;EJB&#12514;&#12472;&#12517;&#12540;&#12523;&#12391;&#28961;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;true&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12414;&#12383;&#12399;&#12514;&#12472;&#12517;&#12540;&#12523;&#12391;&#39640;&#21487;&#29992;&#24615;&#12364;&#26377;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#39640;&#21487;&#29992;&#24615;&#12364;&#12469;&#12540;&#12496;&#12540;&#12539;&#12524;&#12505;&#12523;&#12420;&#12467;&#12531;&#12486;&#12490;&#12539;&#12524;&#12505;&#12523;&#12394;&#12393;&#12398;&#12424;&#12426;&#39640;&#12356;&#12524;&#12505;&#12523;&#12391;&#27083;&#25104;&#12362;&#12424;&#12403;&#26377;&#21177;&#21270;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12398;&#12415;&#12289;true&#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;(<code>server</code>)&#12398;&#20182;&#12395;&#12463;&#12521;&#12473;&#12479;&#12414;&#12383;&#12399;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#23384;&#22312;&#12377;&#12427;&#22580;&#21512;&#12395;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>JSP&#12434;&#12503;&#12522;&#12467;&#12531;&#12497;&#12452;&#12523;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;JavaServer Pages (JSP)&#12501;&#12449;&#12452;&#12523;&#12364;&#12503;&#12522;&#12467;&#12531;&#12497;&#12452;&#12523;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#28961;&#21177;&#12394;&#22580;&#21512;&#12289;JSP&#12501;&#12449;&#12452;&#12523;&#12399;&#21021;&#12417;&#12390;&#12450;&#12463;&#12475;&#12473;&#12373;&#12428;&#12383;&#23455;&#34892;&#26178;&#12395;&#12467;&#12531;&#12497;&#12452;&#12523;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12505;&#12522;&#12501;&#12449;&#12452;&#12450;&#12434;&#23455;&#34892;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12398;&#21069;&#12395;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#35352;&#36848;&#23376;&#12364;&#30906;&#35469;&#12373;&#12428;&#12414;&#12377;&#12290;&#30906;&#35469;&#12364;&#22833;&#25943;&#12377;&#12427;&#12392;&#12289;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12399;&#23455;&#34892;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12505;&#12522;&#12501;&#12449;&#12452;&#12450;&#12399;&#12289;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#35352;&#36848;&#23376;&#12398;&#27083;&#36896;&#12392;&#12467;&#12531;&#12486;&#12531;&#12484;&#12434;&#35519;&#12409;&#12414;&#12377;&#12290;&#22823;&#12365;&#12394;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#30906;&#35469;&#12399;&#26178;&#38291;&#12364;&#12363;&#12363;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
<p>&#26356;&#26032;&#12484;&#12540;&#12523;&#12363;&#12425;&#12505;&#12522;&#12501;&#12449;&#12452;&#12450;&#12539;&#12497;&#12483;&#12465;&#12540;&#12472;&#12364;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12390;&#12356;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12289;&#12371;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12364;&#23384;&#22312;&#12375;&#12394;&#12356;&#12392;&#35686;&#21578;&#12364;&#35352;&#37682;&#12373;&#12428;&#12289;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>Java Web Start</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12391;Java Web Start&#12450;&#12463;&#12475;&#12473;&#12364;&#35377;&#21487;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#29366;&#24907;&#12398;&#32173;&#25345;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;Web&#12475;&#12483;&#12471;&#12519;&#12531;&#12289;SFSB&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12289;&#12362;&#12424;&#12403;&#27704;&#32154;&#30340;&#12395;&#20316;&#25104;&#12373;&#12428;&#12383;EJB&#12479;&#12452;&#12510;&#12540;&#12434;&#12289;&#27425;&#12398;&#20877;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12391;&#12418;&#20445;&#25345;&#12377;&#12427;&#12363;&#12434;&#21046;&#24481;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12427;&#12398;&#12399;&#12289;<code>server</code>&#12392;&#12356;&#12358;&#21517;&#21069;&#12364;&#20184;&#12356;&#12383;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#19978;&#12398;&#12415;&#12391;&#12377;&#12290;&#20182;&#12398;&#12479;&#12540;&#12466;&#12483;&#12488;&#12391;&#12399;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12378;&#12289;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<p>&#20877;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12414;&#12391;&#12398;&#38291;&#12395;&#34892;&#12431;&#12428;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#22793;&#26356;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#12371;&#12398;&#27231;&#33021;&#12364;&#27491;&#24120;&#12395;&#21205;&#20316;&#12375;&#12394;&#12367;&#12394;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;SFSB Bean&#12463;&#12521;&#12473;&#12391;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#22793;&#25968;&#12475;&#12483;&#12488;&#12434;&#22793;&#26356;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#22580;&#21512;&#12289;&#12371;&#12398;&#27231;&#33021;&#12434;&#36969;&#29992;&#12391;&#12365;&#12427;&#12398;&#12399;<code>glassfish-web-app.xml</code>&#12501;&#12449;&#12452;&#12523;&#12391;<code>session-manager</code>&#35201;&#32032;&#12398;<code>persistence-type</code>&#23646;&#24615;&#12364;<code>file</code>&#12398;&#12392;&#12365;&#12398;&#12415;&#12391;&#12377;&#12290;</p>
<p>&#12473;&#12486;&#12540;&#12488;&#12501;&#12523;&#12539;&#12475;&#12483;&#12471;&#12519;&#12531;Bean&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#22580;&#21512;&#12289;&#39640;&#21487;&#29992;&#24615;&#12434;&#25552;&#20379;&#12375;&#12394;&#12356;&#27704;&#32154;&#24615;&#12479;&#12452;&#12503;&#12399;&#12469;&#12540;&#12496;&#12540;(&#12300;SFSB&#27704;&#32154;&#24615;&#12398;&#12479;&#12452;&#12503;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;)&#20869;&#12391;&#35373;&#23450;&#12375;&#12289;<code>file</code>(&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12289;&#25512;&#22888;&#20516;)&#12395;&#35373;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<p>&#12450;&#12463;&#12486;&#12451;&#12502;&#12394;Web&#12475;&#12483;&#12471;&#12519;&#12531;&#12289;SFSB&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12289;&#12414;&#12383;&#12399;EJB&#12479;&#12452;&#12510;&#12540;&#12398;&#20445;&#25345;&#12414;&#12383;&#12399;&#24489;&#20803;&#12395;&#22833;&#25943;&#12375;&#12383;&#22580;&#21512;&#12289;&#20877;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12364;&#23436;&#20102;&#12375;&#12383;&#12392;&#12365;&#12395;<i>&#12371;&#12428;&#12425;&#12377;&#12409;&#12390;&#12434;</i>&#20351;&#29992;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12383;&#12384;&#12375;&#12289;&#20877;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12434;&#32154;&#12369;&#12427;&#12392;&#35686;&#21578;&#12364;&#12525;&#12464;&#12395;&#35352;&#37682;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<p>&#12450;&#12463;&#12486;&#12451;&#12502;&#12394;&#29366;&#24907;&#12487;&#12540;&#12479;&#12434;&#20445;&#25345;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;GlassFish Server&#12399;&#12487;&#12540;&#12479;&#12434;&#12471;&#12522;&#12450;&#12521;&#12452;&#12474;&#12375;&#12289;&#12513;&#12514;&#12522;&#12540;&#12395;&#20445;&#23384;&#12375;&#12414;&#12377;&#12290;&#12487;&#12540;&#12479;&#12434;&#24489;&#20803;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#26032;&#12383;&#12395;&#20877;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12463;&#12521;&#12473;&#12539;&#12525;&#12540;&#12480;&#12540;&#12399;&#20197;&#21069;&#12395;&#20445;&#23384;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#12434;&#12487;&#12471;&#12522;&#12450;&#12521;&#12452;&#12474;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#23550;&#35937;&#31684;&#22258;&#12392;&#12377;&#12427;&#12522;&#12477;&#12540;&#12473;&#12398;&#32173;&#25345;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12473;&#12467;&#12540;&#12503;&#12398;&#12522;&#12477;&#12540;&#12473;&#12364;&#20445;&#25345;&#12373;&#12428;&#12289;&#20877;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#20013;&#12395;&#24489;&#20803;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#36984;&#25246;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
</dl>
<a id="GHCOM386" name="GHCOM386"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-appredeploy.html">&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#20877;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-applistdeployed.html">&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12522;&#12473;&#12488;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12539;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12434;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">&#12467;&#12493;&#12463;&#12479;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">EJB JAR&#12434;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appedit.html">&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#35352;&#36848;&#23376;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-endpoint.html">Web&#12469;&#12540;&#12499;&#12473;&#12398;&#12456;&#12531;&#12489;&#12509;&#12452;&#12531;&#12488;&#24773;&#22577;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-applaunch.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#36215;&#21205;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12434;&#36215;&#21205;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12473;&#12479;&#12502;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-apprestart.html">&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#20877;&#12525;&#12540;&#12489;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#23550;&#35937;&#31684;&#22258;&#12392;&#12377;&#12427;&#12395;&#12399;&#12522;&#12477;&#12540;&#12473;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#23550;&#35937;&#31684;&#22258;&#12392;&#12377;&#12427;&#12395;&#12399;&#12522;&#12477;&#12540;&#12473;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbcontaineravailability.html">EJB&#12467;&#12531;&#12486;&#12490;&#12398;&#21487;&#29992;&#24615;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="GHCOM387" name="GHCOM387"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00114"><code>deploy</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00217"><code>redeploy</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00148"><code>list-applications</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00185"><code>list-modules</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
