<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-configurationsystemproperties" name="ref-configurationsystemproperties"></a><a id="GHCOM00130" name="GHCOM00130"></a></p>

<h4><a id="sthref433" name="sthref433"></a><a id="sthref434" name="sthref434"></a>&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#36984;&#25246;&#12375;&#12383;&#21517;&#21069;&#20184;&#12365;&#27083;&#25104;&#12391;&#23450;&#32681;&#12373;&#12428;&#12390;&#12356;&#12427;Java&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12522;&#12473;&#12488;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;Java&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;GlassFish Server&#12398;&#36215;&#21205;&#26178;&#12395;Java&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12521;&#12531;&#12481;&#12515;&#12398;<code>-D</code>&#12458;&#12503;&#12471;&#12519;&#12531;&#12395;&#12424;&#12387;&#12390;&#12289;Java&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12521;&#12531;&#12481;&#12515;&#12395;&#28193;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12428;&#12425;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#12424;&#12426;&#12289;&#27083;&#25104;&#12434;&#21442;&#29031;&#12377;&#12427;&#12377;&#12409;&#12390;&#12398;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12509;&#12540;&#12488;&#35373;&#23450;&#20516;&#12364;&#23450;&#32681;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<p>&#27083;&#25104;&#20869;&#12398;&#23450;&#32681;&#28168;&#12509;&#12540;&#12488;&#35373;&#23450;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a href="ref-predefinedconfigsysproperties.html">&#23450;&#32681;&#28168;&#12398;&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12372;&#12392;&#12395;&#12289;&#27425;&#12398;&#24773;&#22577;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;:</p>
<dl>
<dt>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#22793;&#25968;&#21517;</dt>
<dd>
<p>&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21517;&#21069;&#12290;</p>
</dd>
<dt>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#21442;&#29031;&#12377;&#12427;&#21517;&#21069;&#20184;&#12365;&#27083;&#25104;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#23550;&#12375;&#12390;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#20516;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#20516;</dt>
<dd>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;<a href="ref-sysinstancevalues.html">&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#20516;</a>&#12301;&#12506;&#12540;&#12472;&#12395;&#23550;&#12377;&#12427;&#12522;&#12531;&#12463;&#12290;</p>
</dd>
</dl>
<p>&#12300;&#36861;&#21152;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12398;&#34920;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12418;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;</dt>
<dd>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12371;&#12398;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#12300;&#36861;&#21152;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12398;&#34920;&#12395;&#34892;&#12364;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21066;&#38500;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#21066;&#38500;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#21066;&#38500;&#12373;&#12428;&#12383;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12395;&#25147;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12364;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12399;&#26410;&#23450;&#32681;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<p>&#12300;&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12418;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#27083;&#25104;&#21517;</dt>
<dd>
<p>&#12371;&#12398;&#12506;&#12540;&#12472;&#12398;&#35373;&#23450;&#12364;&#36969;&#29992;&#12373;&#12428;&#12427;&#27083;&#25104;&#12398;&#21517;&#21069;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#21205;&#30340;&#20877;&#27083;&#25104;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12392;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20877;&#36215;&#21205;&#12375;&#12394;&#12367;&#12390;&#12418;&#12289;&#27083;&#25104;&#12434;&#21442;&#29031;&#12377;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#27083;&#25104;&#12398;&#22793;&#26356;&#12364;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12371;&#12398;&#27083;&#25104;&#12434;&#20351;&#29992;&#12377;&#12427;&#12463;&#12521;&#12473;&#12479;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12289;&#12414;&#12383;&#12399;&#20001;&#26041;</dt>
<dd>
<p>&#27083;&#25104;&#12434;&#21442;&#29031;&#12377;&#12427;&#12463;&#12521;&#12473;&#12479;&#12392;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12522;&#12473;&#12488;&#12290;&#21508;&#12463;&#12521;&#12473;&#12479;&#12414;&#12383;&#12399;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12418;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#12463;&#12521;&#12473;&#12479;&#12414;&#12383;&#12399;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#23455;&#34892;&#20013;&#12398;&#22580;&#21512;&#12289;&#12481;&#12455;&#12483;&#12463;&#12510;&#12540;&#12463;(&#10003;)&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12463;&#12521;&#12473;&#12479;&#12414;&#12383;&#12399;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20572;&#27490;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#24863;&#22022;&#31526;(<code>!</code>)&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</dd>
</dl>
<a id="sthref435" name="sthref435"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<p>&#27083;&#25104;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</p>
<a id="sthref436" name="sthref436"></a>
<h5>&#21516;&#31561;&#12398;asadmin&#12469;&#12502;&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00059"><code>create-system-properties</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00110"><code>delete-system-property</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00203"><code>list-system-properties</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
