<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-editfile-adminrealm" name="ref-editfile-adminrealm"></a></p>

<h4><a id="sthref201" name="sthref201"></a><a id="sthref202" name="sthref202"></a><code>FileRealm</code>&#12463;&#12521;&#12473;&#12395;&#22266;&#26377;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p><code>file</code>&#12524;&#12523;&#12512;&#12395;&#24517;&#35201;&#12394;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#27425;&#12398;&#12392;&#12362;&#12426;&#12391;&#12377;&#12290;</p>
<dl>
<dt>JAAS&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;</dt>
<dd>
<p>JAAS (Java Authentication and Authorization Service)&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;(&#12371;&#12398;&#12524;&#12523;&#12512;&#12395;&#20351;&#29992;&#12377;&#12427;&#12525;&#12464;&#12452;&#12531;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#35672;&#21029;&#23376;)&#12290;&#26377;&#21177;&#12394;&#20516;&#12399;<code>fileRealm</code>&#12398;&#12415;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#37749;&#12501;&#12449;&#12452;&#12523;</dt>
<dd>
<p>&#12469;&#12540;&#12496;&#12540;&#12364;&#12371;&#12398;&#12524;&#12523;&#12512;&#12398;&#12377;&#12409;&#12390;&#12398;&#12518;&#12540;&#12470;&#12540;&#12289;&#12464;&#12523;&#12540;&#12503;&#12289;&#12362;&#12424;&#12403;&#12497;&#12473;&#12527;&#12540;&#12489;&#24773;&#22577;&#12434;&#26684;&#32013;&#12377;&#12427;&#12501;&#12449;&#12452;&#12523;&#12398;&#12501;&#12523;&#12497;&#12473;&#12392;&#21517;&#21069;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12289;<code>file</code>&#12524;&#12523;&#12512;&#12391;&#12399;domain-dir<code>/config/keyfile</code>&#12289;<code>admin-realm</code>&#12524;&#12523;&#12512;&#12391;&#12399;domain-dir<code>/config/admin-keyfile</code>&#12391;&#12377;&#12290;</p>
</dd>
</dl>
<p><code>file</code>&#12524;&#12523;&#12512;&#12398;&#37749;&#12501;&#12449;&#12452;&#12523;&#12399;&#26368;&#21021;&#12399;&#31354;&#12391;&#12354;&#12427;&#12383;&#12417;&#12289;<code>file</code>&#12524;&#12523;&#12512;&#12434;&#20351;&#29992;&#12377;&#12427;&#21069;&#12395;&#12289;&#12300;<a href="ref-managefilerealm.html">&#12501;&#12449;&#12452;&#12523;&#12539;&#12518;&#12540;&#12470;&#12540;</a>&#12301;&#12506;&#12540;&#12472;&#12391;&#12518;&#12540;&#12470;&#12540;&#12434;&#36861;&#21152;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<p><code>admin-realm</code>&#12524;&#12523;&#12512;&#12398;&#37749;&#12501;&#12449;&#12452;&#12523;&#12395;&#12399;&#12289;&#26368;&#21021;&#12399;&#31649;&#29702;&#32773;&#12518;&#12540;&#12470;&#12540;&#21517;&#12289;&#26263;&#21495;&#21270;&#24418;&#24335;&#12398;&#31649;&#29702;&#32773;&#12497;&#12473;&#12527;&#12540;&#12489;&#12289;&#12362;&#12424;&#12403;&#12371;&#12398;&#12518;&#12540;&#12470;&#12540;&#12364;&#23646;&#12377;&#12427;&#12464;&#12523;&#12540;&#12503;(&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;<code>asadmin</code>)&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;<code>admin-realm</code>&#12395;&#12518;&#12540;&#12470;&#12540;&#12434;&#36861;&#21152;&#12377;&#12427;&#26041;&#27861;&#12398;&#35443;&#32048;&#12399;&#12289;<a href="task-accessadmintools.html">&#31649;&#29702;&#12484;&#12540;&#12523;&#12395;&#12450;&#12463;&#12475;&#12473;&#27177;&#12434;&#20184;&#19982;&#12377;&#12427;&#12395;&#12399;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
<code>admin-realm</code>&#12398;&#12464;&#12523;&#12540;&#12503;<code>asadmin</code>&#12398;&#12518;&#12540;&#12470;&#12540;&#12395;&#12399;&#12289;&#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12362;&#12424;&#12403;<code>asadmin</code>&#12484;&#12540;&#12523;&#12434;&#20351;&#29992;&#12377;&#12427;&#27177;&#38480;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12464;&#12523;&#12540;&#12503;&#12395;&#12399;&#12289;&#12469;&#12540;&#12496;&#12540;&#12398;&#31649;&#29702;&#27177;&#38480;&#12398;&#12354;&#12427;&#12518;&#12540;&#12470;&#12540;&#12398;&#12415;&#12434;&#36861;&#21152;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
<hr>

<p><code>file</code>&#12524;&#12523;&#12512;&#12391;&#20351;&#29992;&#21487;&#33021;&#12394;&#12458;&#12503;&#12471;&#12519;&#12531;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#27425;&#12398;&#12392;&#12362;&#12426;&#12391;&#12377;&#12290;</p>
<dl>
<dt>&#12464;&#12523;&#12540;&#12503;&#21106;&#24403;&#12390;</dt>
<dd>
<p>&#12464;&#12523;&#12540;&#12503;&#21517;&#12398;&#12459;&#12531;&#12510;&#21306;&#20999;&#12426;&#12522;&#12473;&#12488;&#12290;&#26377;&#21177;&#12394;&#35388;&#26126;&#26360;&#12434;&#25552;&#31034;&#12377;&#12427;&#12377;&#12409;&#12390;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12364;&#12371;&#12428;&#12425;&#12398;&#12464;&#12523;&#12540;&#12503;&#12395;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12414;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;<code>employee,manager</code>&#12394;&#12393;&#12391;&#12289;&#12371;&#12428;&#12425;&#12399;&#12518;&#12540;&#12470;&#12540;&#12539;&#12464;&#12523;&#12540;&#12503;&#12398;&#21517;&#21069;&#12391;&#12377;&#12290;</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
