<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-uc-pkgdetails" name="ref-uc-pkgdetails"></a><a id="GHCOM00137" name="GHCOM00137"></a></p>

<h4><a id="sthref458" name="sthref458"></a>&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#35443;&#32048;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#35443;&#32048;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12395;&#38306;&#12377;&#12427;&#35443;&#32048;&#24773;&#22577;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#35443;&#32048;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#25147;&#12427;</dt>
<dd>
<p>&#12371;&#12398;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#35443;&#32048;&#12364;&#34920;&#31034;&#12373;&#12428;&#12390;&#12356;&#12427;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#36984;&#25246;&#12375;&#12383;&#12506;&#12540;&#12472;&#12395;&#25147;&#12426;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12497;&#12483;&#12465;&#12540;&#12472;&#21517;</dt>
<dd>
<p>&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12364;&#25552;&#20379;&#12373;&#12428;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#21517;&#21069;&#12290;</p>
</dd>
<dt>&#19968;&#24847;&#12398;&#35672;&#21029;&#23376;</dt>
<dd>
<p>&#12522;&#12509;&#12472;&#12488;&#12522;&#12395;&#23384;&#22312;&#12377;&#12427;&#12289;&#12371;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#23436;&#20840;&#20462;&#39166;&#35672;&#21029;&#23376;&#12290;</p>
</dd>
<dt>&#12459;&#12486;&#12468;&#12522;</dt>
<dd>
<p>&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12364;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12390;&#12356;&#12427;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12459;&#12486;&#12468;&#12522;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12289;&#12471;&#12473;&#12486;&#12512;&#12539;&#12484;&#12540;&#12523;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12394;&#12393;&#12391;&#12377;&#12290;&#12459;&#12486;&#12468;&#12522;&#12399;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#20316;&#25104;&#26178;&#12395;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#20316;&#25104;&#32773;&#12395;&#12424;&#12387;&#12390;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12496;&#12540;&#12472;&#12519;&#12531;</dt>
<dd>
<p>&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12364;&#25552;&#20379;&#12373;&#12428;&#12427;&#12497;&#12483;&#12465;&#12540;&#12472;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#30058;&#21495;&#12290;</p>
</dd>
<dt>&#20844;&#38283;&#26085;</dt>
<dd>
<p>&#12371;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12364;&#12522;&#12509;&#12472;&#12488;&#12522;&#12395;&#20844;&#38283;&#12373;&#12428;&#12383;&#26085;&#26178;&#12290;&#12371;&#12398;&#26085;&#20184;&#12399;&#12289;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12452;&#12513;&#12540;&#12472;&#20869;&#12395;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12364;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12383;&#26085;&#26178;&#12391;&#12399;<i>&#12354;&#12426;&#12414;&#12379;&#12435;</i>&#12290;</p>
</dd>
<dt>&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#28168;&#12469;&#12452;&#12474;</dt>
<dd>
<p>&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12391;&#28040;&#36027;&#12373;&#12428;&#12427;&#12487;&#12451;&#12473;&#12463;&#23481;&#37327;&#12290;</p>
</dd>
<dt>&#12477;&#12540;&#12473;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#28168;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12391;&#12399;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12364;&#21462;&#24471;&#12373;&#12428;&#12383;<a href="ref-uc-concepts.html#ref-uc-about-repository">&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;</a>&#12398;&#21517;&#21069;&#12391;&#12377;&#12290;</p>
<p>&#12450;&#12489;&#12458;&#12531;&#12539;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12420;&#26356;&#26032;&#12391;&#12399;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12364;&#21462;&#24471;&#12373;&#12428;&#12427;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12398;&#21517;&#21069;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#35500;&#26126;</dt>
<dd>
<p>&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#27010;&#35201;&#12290;</p>
</dd>
</dl>
<a id="sthref459" name="sthref459"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<p><a href="task-uc-pkgdetails.html">&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#35443;&#32048;&#24773;&#22577;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
<a id="sthref460" name="sthref460"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<p>&#12394;&#12375;&#12290;</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
