<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-managefilerealm" name="ref-managefilerealm"></a></p>

<h4><a id="sthref367" name="sthref367"></a>&#12501;&#12449;&#12452;&#12523;&#12539;&#12518;&#12540;&#12470;&#12540;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p><code>file</code>&#12524;&#12523;&#12512;&#12398;&#12518;&#12540;&#12470;&#12540;&#12434;&#31649;&#29702;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12501;&#12449;&#12452;&#12523;&#12539;&#12518;&#12540;&#12470;&#12540;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;<code>file</code>&#12524;&#12523;&#12512;&#12398;&#12518;&#12540;&#12470;&#12540;&#12362;&#12424;&#12403;&#12464;&#12523;&#12540;&#12503;&#12399;&#37749;&#12501;&#12449;&#12452;&#12523;&#12395;&#12522;&#12473;&#12488;&#12373;&#12428;&#12289;&#12381;&#12398;&#22580;&#25152;&#12399;<code>file</code>&#12503;&#12525;&#12497;&#12486;&#12451;&#12391;&#25351;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<p><code>file</code>&#12524;&#12523;&#12512;&#12398;&#12518;&#12540;&#12470;&#12540;&#12399;&#12289;&#20849;&#36890;&#12398;&#29305;&#24615;&#12391;&#20998;&#39006;&#12373;&#12428;&#12427;&#12518;&#12540;&#12470;&#12540;&#12398;&#12459;&#12486;&#12468;&#12522;&#12391;&#12354;&#12427;&#12300;Java&#12464;&#12523;&#12540;&#12503;&#12301;&#12395;&#23646;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;E&#12467;&#12510;&#12540;&#12473;&#12539;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#39015;&#23458;&#12399;<code>CUSTOMER</code>&#12464;&#12523;&#12540;&#12503;&#12395;&#23646;&#12375;&#12414;&#12377;&#12364;&#12289;&#12362;&#24471;&#24847;&#27096;&#12399;<code>PREFERRED</code>&#12464;&#12523;&#12540;&#12503;&#12395;&#23646;&#12375;&#12414;&#12377;&#12290;&#12518;&#12540;&#12470;&#12540;&#12434;&#12464;&#12523;&#12540;&#12503;&#12395;&#20998;&#39006;&#12377;&#12427;&#12392;&#12289;&#22823;&#37327;&#12398;&#12518;&#12540;&#12470;&#12540;&#12395;&#12424;&#12427;&#12450;&#12463;&#12475;&#12473;&#12434;&#23481;&#26131;&#12395;&#21046;&#24481;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<p>GlassFish Server&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#24460;&#12398;&#24403;&#21021;&#12399;&#12289;&#12518;&#12540;&#12470;&#12540;&#12399;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12398;&#38555;&#12395;&#20837;&#21147;&#12375;&#12383;&#31649;&#29702;&#32773;&#12398;&#12415;&#12391;&#12377;&#12290;&#12371;&#12398;&#12518;&#12540;&#12470;&#12540;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;GlassFish Server&#12434;&#22793;&#26356;&#12377;&#12427;&#27177;&#38480;&#12434;&#20184;&#19982;&#12373;&#12428;&#12427;&#12289;<code>admin-realm</code>&#12524;&#12523;&#12512;&#12398;<code>asadmin</code>&#12464;&#12523;&#12540;&#12503;&#12395;&#23646;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12464;&#12523;&#12540;&#12503;&#12395;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12427;&#12377;&#12409;&#12390;&#12398;&#12518;&#12540;&#12470;&#12540;&#12399;&#12289;&#31649;&#29702;&#32773;&#27177;&#38480;&#12364;&#20184;&#19982;&#12373;&#12428;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;<code>asadmin</code>&#12484;&#12540;&#12523;&#12362;&#12424;&#12403;&#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;&#27177;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12501;&#12449;&#12452;&#12523;&#12539;&#12518;&#12540;&#12470;&#12540;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#36984;&#25246;&#12375;&#12383;&#12524;&#12523;&#12512;&#12398;&#12518;&#12540;&#12470;&#12540;&#12398;&#12522;&#12473;&#12488;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12518;&#12540;&#12470;&#12540;&#12372;&#12392;&#12395;&#12289;&#27425;&#12398;&#24773;&#22577;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12518;&#12540;&#12470;&#12540;ID</dt>
<dd>
<p>&#12518;&#12540;&#12470;&#12540;&#21517;&#12290;</p>
</dd>
<dt>&#12464;&#12523;&#12540;&#12503;&#12539;&#12522;&#12473;&#12488;</dt>
<dd>
<p>&#12518;&#12540;&#12470;&#12540;&#12364;&#23646;&#12375;&#12390;&#12356;&#12427;&#12464;&#12523;&#12540;&#12503;&#12290;</p>
</dd>
</dl>
<p>&#12300;&#12501;&#12449;&#12452;&#12523;&#12539;&#12518;&#12540;&#12470;&#12540;&#12301;&#12398;&#34920;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12418;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#26032;&#35215;</dt>
<dd>
<p>&#26032;&#35215;&#12518;&#12540;&#12470;&#12540;&#12434;&#20316;&#25104;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
<dt>&#21066;&#38500;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;1&#20154;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12518;&#12540;&#12470;&#12540;&#12434;&#21066;&#38500;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
</dl>
<a id="sthref368" name="sthref368"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-fileuserscreate.html">&#12518;&#12540;&#12470;&#12540;&#12434;&#12501;&#12449;&#12452;&#12523;&#12539;&#12524;&#12523;&#12512;&#12395;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-fileusersedit.html">&#12501;&#12449;&#12452;&#12523;&#12539;&#12524;&#12523;&#12512;&#12539;&#12518;&#12540;&#12470;&#12540;&#24773;&#22577;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-fileusersdelete.html">&#12501;&#12449;&#12452;&#12523;&#12539;&#12524;&#12523;&#12512;&#12363;&#12425;&#12518;&#12540;&#12470;&#12540;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref369" name="sthref369"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00165"><code>list-file-users</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00024"><code>create-file-user</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00254"><code>update-file-user</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00076"><code>delete-file-user</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
