<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmxconnectorssledit" name="ref-jmxconnectorssledit"></a></p>

<h4><a id="sthref239" name="sthref239"></a><a id="sthref240" name="sthref240"></a><a id="sthref241" name="sthref241"></a>SSL</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;SSL&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;JMX&#12467;&#12493;&#12463;&#12479;&#12398;SSL&#35373;&#23450;&#12434;&#22793;&#26356;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12506;&#12540;&#12472;&#12398;&#35373;&#23450;&#12399;&#12289;&#12300;JMX&#12467;&#12493;&#12463;&#12479;&#12434;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12391;JMX&#12467;&#12493;&#12463;&#12479;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12364;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#21177;&#26524;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<p>&#12300;SSL&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#27083;&#25104;&#21517;</dt>
<dd>
<p>&#12371;&#12398;&#12506;&#12540;&#12472;&#12398;&#35373;&#23450;&#12364;&#36969;&#29992;&#12373;&#12428;&#12427;&#27083;&#25104;&#12398;&#21517;&#21069;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>SSL3</dt>
<dd>
<p>&#12371;&#12398;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12364;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;JMX&#12467;&#12493;&#12463;&#12479;&#12391;SSL3&#12503;&#12525;&#12488;&#12467;&#12523;&#12364;&#26377;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>TLS</dt>
<dd>
<p>&#12371;&#12398;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12364;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;JMX&#12467;&#12493;&#12463;&#12479;&#12391;TLS&#12503;&#12525;&#12488;&#12467;&#12523;&#12364;&#26377;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#35469;&#35388;</dt>
<dd>
<p>&#12371;&#12398;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12364;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12399;&#12522;&#12463;&#12456;&#12473;&#12488;&#12372;&#12392;&#12395;&#33258;&#36523;&#12434;&#12469;&#12540;&#12496;&#12540;&#12395;&#23550;&#12375;&#12390;&#35672;&#21029;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#35388;&#26126;&#26360;&#12398;&#12491;&#12483;&#12463;&#12493;&#12540;&#12512;</dt>
<dd>
<p>&#35388;&#26126;&#26360;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12414;&#12383;&#12399;PKCS#11&#12488;&#12540;&#12463;&#12531;&#20869;&#12398;&#12469;&#12540;&#12496;&#12540;&#35388;&#26126;&#26360;&#12398;&#12491;&#12483;&#12463;&#12493;&#12540;&#12512;&#12290;&#35388;&#26126;&#26360;&#12391;&#12399;&#12289;&#21517;&#21069;&#12398;&#24418;&#24335;&#12399;<i>tokenname</i><code>:</code><i>nickname</i>&#12391;&#12377;&#12290;&#12371;&#12398;&#23646;&#24615;&#12395;&#21517;&#21069;&#12398;<i>tokenname</i><code>:</code>&#12398;&#37096;&#20998;&#12434;&#21547;&#12417;&#12427;&#12363;&#12393;&#12358;&#12363;&#12399;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12461;&#12540;&#12473;&#12488;&#12450;</dt>
<dd>
<p>&#12461;&#12540;&#12473;&#12488;&#12450;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#21517;&#21069;(&#20363;: <code>keystore.jks</code>)&#12290;</p>
</dd>
<dt>&#12488;&#12521;&#12473;&#12488;&#12539;&#12450;&#12523;&#12468;&#12522;&#12474;&#12512;</dt>
<dd>
<p>&#35388;&#26126;&#26360;&#12497;&#12473;&#12398;&#26908;&#35388;&#12395;&#20351;&#29992;&#12377;&#12427;&#12488;&#12521;&#12473;&#12488;&#31649;&#29702;&#12450;&#12523;&#12468;&#12522;&#12474;&#12512;&#12398;&#21517;&#21069;(&#20363;: PKIX)&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#35388;&#26126;&#26360;&#38263;</dt>
<dd>
<p>&#35388;&#26126;&#26360;&#12497;&#12473;&#12395;&#23384;&#22312;&#12391;&#12365;&#12427;&#12289;&#33258;&#24049;&#30330;&#34892;&#12391;&#12399;&#12394;&#12356;&#20013;&#38291;&#35388;&#26126;&#26360;&#12398;&#26368;&#22823;&#25968;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#12289;&#12300;&#12488;&#12521;&#12473;&#12488;&#12539;&#12450;&#12523;&#12468;&#12522;&#12474;&#12512;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12364;&#12300;PKIX&#12301;&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;0&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12497;&#12473;&#12395;&#12399;&#21336;&#19968;&#12398;&#35388;&#26126;&#26360;&#12398;&#12415;&#21547;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;-1&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12497;&#12473;&#12398;&#38263;&#12373;&#12399;&#21046;&#38480;&#12373;&#12428;&#12414;&#12379;&#12435;(&#26368;&#22823;&#25968;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;)&#12290;-1&#12424;&#12426;&#23567;&#12373;&#12356;&#20516;&#12434;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#20363;&#22806;&#12364;&#12473;&#12525;&#12540;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12488;&#12521;&#12473;&#12488;&#12539;&#12473;&#12488;&#12450;</dt>
<dd>
<p>&#12488;&#12521;&#12473;&#12488;&#12539;&#12473;&#12488;&#12450;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#21517;&#21069;(&#20363;: <code>cacerts.jks</code>)&#12290;</p>
</dd>
<dt>&#26263;&#21495;&#12473;&#12452;&#12540;&#12488;</dt>
<dd>
<p>&#26263;&#21495;&#12473;&#12452;&#12540;&#12488;&#12434;&#36861;&#21152;&#12414;&#12383;&#12399;&#38500;&#21435;&#12391;&#12365;&#12427;&#38936;&#22495;&#12290;&#26263;&#21495;&#12473;&#12452;&#12540;&#12488;&#12434;&#36861;&#21152;&#12375;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#26263;&#21495;&#12473;&#12452;&#12540;&#12488;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<a id="GHCOM473" name="GHCOM473"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-jmxconnectoredit.html">JMX&#12467;&#12493;&#12463;&#12479;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmxconnectorssledit.html">JMX&#12467;&#12493;&#12463;&#12479;&#12398;SSL&#35373;&#23450;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
