<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-uc-config" name="ref-uc-config"></a></p>

<h4><a id="sthref461" name="sthref461"></a>&#26356;&#26032;&#12484;&#12540;&#12523;&#27083;&#25104;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;&#27083;&#25104;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#26356;&#26032;&#12484;&#12540;&#12523;&#12395;&#12388;&#12356;&#12390;&#12398;&#27083;&#25104;&#24773;&#22577;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12289;&#26356;&#26032;&#12484;&#12540;&#12523;&#12434;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12395;&#25509;&#32154;&#12377;&#12427;&#26041;&#27861;&#12434;&#22793;&#26356;&#12391;&#12365;&#12414;&#12377;&#12290;&#26356;&#26032;&#12484;&#12540;&#12523;&#27083;&#25104;&#12398;&#20182;&#12398;&#38917;&#30446;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;&#12289;as-install-parent<code>/bin</code>&#12395;&#12354;&#12427;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12398;<code>updatetool</code>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26356;&#26032;&#12484;&#12540;&#12523;&#12398;&#27083;&#25104;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12497;&#12473;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12452;&#12513;&#12540;&#12472;&#12398;&#12523;&#12540;&#12488;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12414;&#12383;&#12399;&#26368;&#19978;&#20301;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12398;&#12501;&#12449;&#12452;&#12523;&#12539;&#12471;&#12473;&#12486;&#12512;&#12539;&#12497;&#12473;&#12290;</p>
</dd>
<dt>&#20778;&#20808;&#12522;&#12509;&#12472;&#12488;&#12522;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12452;&#12513;&#12540;&#12472;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12390;&#12356;&#12427;&#20778;&#20808;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12398;&#21517;&#21069;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;<code>glassfish.org</code>&#12394;&#12393;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#25509;&#32154;</dt>
<dd>
<p>GlassFish Server&#12398;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12408;&#12398;&#25509;&#32154;&#26041;&#27861;:</p>
<dl>
<dt>&#30452;&#25509;&#25509;&#32154;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;GlassFish Server&#12364;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12395;&#30452;&#25509;&#25509;&#32154;&#12377;&#12427;&#12424;&#12358;&#12395;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12503;&#12525;&#12461;&#12471;&#32076;&#30001;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;GlassFish Server&#12364;&#12503;&#12525;&#12461;&#12471;&#12539;&#12469;&#12540;&#12496;&#12540;&#32076;&#30001;&#12391;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12395;&#25509;&#32154;&#12377;&#12427;&#12424;&#12358;&#12395;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#22580;&#21512;&#12289;&#12300;&#12503;&#12525;&#12461;&#12471;&#12539;&#12507;&#12473;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12392;&#12300;&#12503;&#12525;&#12461;&#12471;&#12539;&#12509;&#12540;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12364;&#12371;&#12398;&#12506;&#12540;&#12472;&#12395;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
</dd>
<dt>&#12503;&#12525;&#12461;&#12471;&#12539;&#12507;&#12473;&#12488;</dt>
<dd>
<p>GlassFish Server&#12434;&#23455;&#34892;&#12375;&#12390;&#12356;&#12427;&#12510;&#12471;&#12531;&#12398;&#12503;&#12525;&#12461;&#12471;&#12539;&#12469;&#12540;&#12496;&#12540;&#12398;&#12507;&#12473;&#12488;&#21517;&#12290;</p>
<p>&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#12289;GlassFish Server&#12434;&#23455;&#34892;&#12375;&#12390;&#12356;&#12427;&#12510;&#12471;&#12531;&#12364;&#12503;&#12525;&#12461;&#12471;&#12539;&#12469;&#12540;&#12496;&#12540;&#12434;&#20171;&#12375;&#12390;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12395;&#25509;&#32154;&#12377;&#12427;&#22580;&#21512;&#12398;&#12415;&#36969;&#29992;&#21487;&#33021;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12503;&#12525;&#12461;&#12471;&#12539;&#12509;&#12540;&#12488;</dt>
<dd>
<p>GlassFish Server&#12434;&#23455;&#34892;&#12375;&#12390;&#12356;&#12427;&#12510;&#12471;&#12531;&#12398;&#12503;&#12525;&#12461;&#12471;&#12539;&#12469;&#12540;&#12496;&#12540;&#12398;&#12509;&#12540;&#12488;&#30058;&#21495;&#12290;</p>
<p>&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#12289;GlassFish Server&#12434;&#23455;&#34892;&#12375;&#12390;&#12356;&#12427;&#12510;&#12471;&#12531;&#12364;&#12503;&#12525;&#12461;&#12471;&#12539;&#12469;&#12540;&#12496;&#12540;&#12434;&#20171;&#12375;&#12390;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12395;&#25509;&#32154;&#12377;&#12427;&#22580;&#21512;&#12398;&#12415;&#36969;&#29992;&#21487;&#33021;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12522;&#12509;&#12472;&#12488;&#12522;</dt>
<dd>
<p>&#12371;&#12398;&#34920;&#12395;&#12399;&#12289;&#12371;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12452;&#12513;&#12540;&#12472;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12390;&#12356;&#12427;&#21508;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12395;&#38306;&#12377;&#12427;&#27425;&#12398;&#24773;&#22577;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12522;&#12509;&#12472;&#12488;&#12522;</dt>
<dd>
<p>&#12522;&#12509;&#12472;&#12488;&#12522;&#12398;&#21517;&#21069;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;<code>dev.glassfish.org</code>&#12394;&#12393;&#12391;&#12377;&#12290;</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref462" name="sthref462"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<p><a href="task-uc-set-proxy.html">&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12503;&#12525;&#12461;&#12471;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
<a id="sthref463" name="sthref463"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<p>&#12394;&#12375;&#12290;</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
