<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-lifecyclemodulenew" name="ref-lifecyclemodulenew"></a><a id="GHCOM00080" name="GHCOM00080"></a></p>

<h4><a id="sthref312" name="sthref312"></a>&#26032;&#35215;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;&#26032;&#35215;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#26032;&#35215;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26032;&#35215;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#21517;&#21069;</dt>
<dd>
<p>&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#21517;&#21069;&#12290;</p>
</dd>
<dt>&#12463;&#12521;&#12473;&#21517;</dt>
<dd>
<p>&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#12463;&#12521;&#12473;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#23436;&#20840;&#20462;&#39166;&#21517;&#12290;&#12463;&#12521;&#12473;&#12399;<code>com.sun.appserv.server.LifecycleListener</code>&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12434;&#23455;&#35013;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12463;&#12521;&#12473;&#12497;&#12473;</dt>
<dd>
<p>&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#12463;&#12521;&#12473;&#12497;&#12473;&#12290;&#12463;&#12521;&#12473;&#12497;&#12473;&#12399;&#12289;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12364;&#37197;&#32622;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#25152;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;domain-dir<code>/applications</code>&#12391;&#12377;&#12290;&#12514;&#12472;&#12517;&#12540;&#12523;&#12364;&#12377;&#12391;&#12395;&#12371;&#12398;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;(&#12388;&#12414;&#12426;&#12289;&#12469;&#12540;&#12496;&#12540;&#12398;&#12463;&#12521;&#12473;&#12497;&#12473;)&#12395;&#12354;&#12427;&#22580;&#21512;&#12289;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#31354;&#30333;&#12398;&#12414;&#12414;&#12391;&#12363;&#12414;&#12356;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>&#12525;&#12540;&#12489;&#38918;&#24207;</dt>
<dd>
<p>&#36215;&#21205;&#26178;&#12395;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12364;&#12525;&#12540;&#12489;&#12373;&#12428;&#12427;&#38918;&#24207;&#12290;&#12525;&#12540;&#12489;&#38918;&#12398;&#25972;&#25968;&#20516;&#12364;&#23567;&#12373;&#12356;&#12514;&#12472;&#12517;&#12540;&#12523;&#12411;&#12393;&#12289;&#20808;&#12395;&#12525;&#12540;&#12489;&#12373;&#12428;&#12414;&#12377;&#12290;&#25351;&#23450;&#12391;&#12365;&#12427;&#20516;&#12399;&#12289;101&#12363;&#12425;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12539;&#12471;&#12473;&#12486;&#12512;&#12398;<code>MAXINT</code>&#12414;&#12391;&#12391;&#12377;&#12290;1&#12363;&#12425;100&#12398;&#20516;&#12399;&#20104;&#32004;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#35500;&#26126;</dt>
<dd>
<p>&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#35500;&#26126;&#12290;</p>
</dd>
<dt>&#12473;&#12486;&#12540;&#12479;&#12473;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12364;&#26377;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12525;&#12540;&#12489;&#26178;&#12398;&#38556;&#23475;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#12525;&#12540;&#12489;&#12395;&#22833;&#25943;&#12375;&#12383;&#12392;&#12365;&#12395;&#12289;&#12469;&#12540;&#12496;&#12540;&#12364;&#20572;&#27490;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12479;&#12540;&#12466;&#12483;&#12488;</dt>
<dd>
<p>&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#12463;&#12521;&#12473;&#12479;&#12392;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12290;&#24517;&#35201;&#12394;&#12479;&#12540;&#12466;&#12483;&#12488;&#12434;&#12300;&#36984;&#25246;&#12375;&#12383;&#12479;&#12540;&#12466;&#12483;&#12488;&#12301;&#21015;&#12395;&#31227;&#21205;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12414;&#12383;&#12399;&#12300;&#12377;&#12409;&#12390;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#19981;&#35201;&#12394;&#12479;&#12540;&#12466;&#12483;&#12488;&#12434;&#12300;&#20351;&#29992;&#21487;&#33021;&#12394;&#12479;&#12540;&#12466;&#12483;&#12488;&#12301;&#21015;&#12395;&#31227;&#21205;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#38500;&#21435;&#12301;&#12508;&#12479;&#12531;&#12414;&#12383;&#12399;&#12300;&#12377;&#12409;&#12390;&#38500;&#21435;&#12301;&#12508;&#12479;&#12531;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12489;&#12513;&#12452;&#12531;&#20869;&#12395;&#12463;&#12521;&#12473;&#12479;&#12414;&#12383;&#12399;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20316;&#25104;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<a id="sthref313" name="sthref313"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-lifecyclemodulenew.html">&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-lifecyclemoduleedit.html">&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-lifecyclemoduledelete.html">&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref314" name="sthref314"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00043"><code>create-lifecycle-module</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00181"><code>list-lifecycle-modules</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00095"><code>delete-lifecycle-module</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
