<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-editjdbcrealm" name="ref-editjdbcrealm"></a><a id="GHCOM00102" name="GHCOM00102"></a></p>

<h4><a id="sthref359" name="sthref359"></a><a id="sthref360" name="sthref360"></a><code>JDBCRealm</code>&#12463;&#12521;&#12473;&#12395;&#22266;&#26377;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Web&#12506;&#12540;&#12472;&#12420;Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#20445;&#35703;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#30331;&#37682;&#12518;&#12540;&#12470;&#12540;&#12398;&#12415;&#12364;&#12381;&#12428;&#12425;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12434;&#35373;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#35469;&#35388;&#27231;&#33021;&#12392;&#12375;&#12390;&#30693;&#12425;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12371;&#12398;&#12479;&#12452;&#12503;&#12398;&#12524;&#12523;&#12512;&#12391;&#12399;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#20869;&#12395;&#12518;&#12540;&#12470;&#12540;&#12398;&#36039;&#26684;&#35388;&#26126;&#12434;&#26684;&#32013;&#12375;&#12414;&#12377;&#12290;GlassFish Server&#12399;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#24773;&#22577;&#12362;&#12424;&#12403;&#27083;&#25104;&#12501;&#12449;&#12452;&#12523;&#20869;&#12398;&#26377;&#21177;&#21270;&#12373;&#12428;&#12383;JDBC&#12524;&#12523;&#12512;&#12539;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>JDBC&#12524;&#12523;&#12512;&#12395;&#24517;&#35201;&#12394;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#27425;&#12398;&#12392;&#12362;&#12426;&#12391;&#12377;&#12290;</p>
<dl>
<dt>JAAS&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;</dt>
<dd>
<p>JAAS (Java Authentication and Authorization Service)&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;(&#12371;&#12398;&#12524;&#12523;&#12512;&#12395;&#20351;&#29992;&#12377;&#12427;&#12525;&#12464;&#12452;&#12531;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#35672;&#21029;&#23376;)&#12290;&#26377;&#21177;&#12394;&#20516;&#12399;<code>jdbcRealm</code>&#12398;&#12415;&#12391;&#12377;&#12290;</p>
</dd>
<dt>JNDI</dt>
<dd>
<p>&#12371;&#12398;&#12524;&#12523;&#12512;&#12398;JNDI&#21517;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>jdbc/security</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12518;&#12540;&#12470;&#12540;&#34920;</dt>
<dd>
<p>&#12371;&#12398;&#12524;&#12523;&#12512;&#12395;&#23550;&#12375;&#12390;&#25215;&#35469;&#12373;&#12428;&#12383;&#12518;&#12540;&#12470;&#12540;&#12398;&#12522;&#12473;&#12488;&#12434;&#21547;&#12416;&#34920;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>usertable</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12518;&#12540;&#12470;&#12540;&#21517;&#21015;</dt>
<dd>
<p>&#12518;&#12540;&#12470;&#12540;&#34920;&#20869;&#12398;&#12289;&#12518;&#12540;&#12470;&#12540;&#12398;&#12522;&#12473;&#12488;&#12434;&#21547;&#12416;&#21015;&#12398;&#21517;&#21069;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>userid</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12497;&#12473;&#12527;&#12540;&#12489;&#21015;</dt>
<dd>
<p>&#12518;&#12540;&#12470;&#12540;&#34920;&#20869;&#12398;&#12289;&#21508;&#12518;&#12540;&#12470;&#12540;&#12398;&#12497;&#12473;&#12527;&#12540;&#12489;&#12434;&#21547;&#12416;&#21015;&#12398;&#21517;&#21069;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>password</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12464;&#12523;&#12540;&#12503;&#34920;</dt>
<dd>
<p>&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#12464;&#12523;&#12540;&#12503;&#34920;&#12398;&#21517;&#21069;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>grouptable</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12464;&#12523;&#12540;&#12503;&#21517;&#21015;</dt>
<dd>
<p>&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#12464;&#12523;&#12540;&#12503;&#34920;&#12398;&#12464;&#12523;&#12540;&#12503;&#21517;&#21015;&#12398;&#21517;&#21069;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>groupid</code>&#12391;&#12377;&#12290;</p>
</dd>
</dl>
<p>JDBC&#12524;&#12523;&#12512;&#12391;&#20351;&#29992;&#21487;&#33021;&#12394;&#12458;&#12503;&#12471;&#12519;&#12531;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#27425;&#12398;&#12392;&#12362;&#12426;&#12391;&#12377;&#12290;</p>
<dl>
<dt>&#12464;&#12523;&#12540;&#12503;&#21106;&#24403;&#12390;</dt>
<dd>
<p>&#12464;&#12523;&#12540;&#12503;&#21517;&#12398;&#12459;&#12531;&#12510;&#21306;&#20999;&#12426;&#12522;&#12473;&#12488;&#12290;&#26377;&#21177;&#12394;&#35388;&#26126;&#26360;&#12434;&#25552;&#31034;&#12377;&#12427;&#12377;&#12409;&#12390;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12364;&#12371;&#12428;&#12425;&#12398;&#12464;&#12523;&#12540;&#12503;&#12395;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12414;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;<code>employee,manager</code>&#12394;&#12393;&#12391;&#12289;&#12371;&#12428;&#12425;&#12399;&#12518;&#12540;&#12470;&#12540;&#12539;&#12464;&#12523;&#12540;&#12503;&#12398;&#21517;&#21069;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12518;&#12540;&#12470;&#12540;</dt>
<dd>
<p><code>jdbc-connection-pool</code>&#12398;&#12363;&#12431;&#12426;&#12395;&#12289;&#12524;&#12523;&#12512;&#12395;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12518;&#12540;&#12470;&#12540;&#21517;&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12428;&#12395;&#12424;&#12426;&#12289;&#20182;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12424;&#12427;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#26908;&#32034;&#12289;&#25509;&#32154;&#21462;&#24471;&#12289;&#12518;&#12540;&#12470;&#12540;&#34920;&#12398;&#12502;&#12521;&#12454;&#12474;&#12434;&#22238;&#36991;&#12391;&#12365;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;<code>jdbc-connection-pool</code>&#27083;&#25104;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12497;&#12473;&#12527;&#12540;&#12489;</dt>
<dd>
<p><code>jdbc-connection-pool</code>&#12398;&#12363;&#12431;&#12426;&#12395;&#12289;&#12524;&#12523;&#12512;&#12395;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12497;&#12473;&#12527;&#12540;&#12489;&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12428;&#12395;&#12424;&#12426;&#12289;&#20182;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12424;&#12427;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#26908;&#32034;&#12289;&#25509;&#32154;&#21462;&#24471;&#12289;&#12518;&#12540;&#12470;&#12540;&#34920;&#12398;&#12502;&#12521;&#12454;&#12474;&#12434;&#22238;&#36991;&#12391;&#12365;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;<code>jdbc-connection-pool</code>&#27083;&#25104;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12480;&#12452;&#12472;&#12455;&#12473;&#12488;&#12539;&#12450;&#12523;&#12468;&#12522;&#12474;&#12512;</dt>
<dd>
<p>(&#12458;&#12503;&#12471;&#12519;&#12531;)&#12480;&#12452;&#12472;&#12455;&#12473;&#12488;&#12539;&#12450;&#12523;&#12468;&#12522;&#12474;&#12512;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;<code>SHA-256</code>&#12391;&#12377;&#12290;JDK&#12391;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12450;&#12523;&#12468;&#12522;&#12474;&#12512;&#12289;&#12414;&#12383;&#12399;none&#12434;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
4.0&#12424;&#12426;&#12418;&#21069;&#12398;GlassFish Server&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12450;&#12523;&#12468;&#12522;&#12474;&#12512;&#12399;<code>MD5</code>&#12391;&#12375;&#12383;&#12290;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;<code>MD5</code>&#12450;&#12523;&#12468;&#12522;&#12474;&#12512;&#12395;&#20381;&#23384;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;<code>asadmin set</code>&#12469;&#12502;&#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;<code>SHA-25</code>&#12450;&#12523;&#12468;&#12522;&#12474;&#12512;&#12434;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12391;&#12365;&#12414;&#12377;&#12290;
<pre>
asadmin&gt; <b>set server.security-service.property.default-digest-algorithm=MD5</b>
</pre>
<p><code>asadmin get</code>&#12469;&#12502;&#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12393;&#12398;&#12450;&#12523;&#12468;&#12522;&#12474;&#12512;&#12364;&#29694;&#22312;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#30906;&#35469;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<pre>
asadmin&gt; <b>get server.security-service.property.default-digest-algorithm</b>
</pre>
<p>GlassFish Serverv2.<i>x</i>&#12414;&#12383;&#12399;v3.0. <i>x</i>&#12363;&#12425;GlassFish Server4.0&#12395;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#21476;&#12356;GlassFish Server&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#12480;&#12452;&#12472;&#12455;&#12473;&#12488;&#12539;&#12450;&#12523;&#12468;&#12522;&#12474;&#12512;&#12364;&#26126;&#31034;&#30340;&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12363;&#12366;&#12426;&#12289;&#19979;&#20301;&#20114;&#25563;&#24615;&#12434;&#20445;&#12388;&#20966;&#32622;&#12392;&#12375;&#12390;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12450;&#12523;&#12468;&#12522;&#12474;&#12512;&#12364;&#33258;&#21205;&#30340;&#12395;<code>MD5</code>&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>

<hr>

</dd>
<dt>&#12497;&#12473;&#12527;&#12540;&#12489;&#26263;&#21495;&#21270;&#12450;&#12523;&#12468;&#12522;&#12474;&#12512;</dt>
<dd>
<p>&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#26684;&#32013;&#12373;&#12428;&#12427;&#12497;&#12473;&#12527;&#12540;&#12489;&#12434;&#26263;&#21495;&#21270;&#12377;&#12427;&#12383;&#12417;&#12398;&#12450;&#12523;&#12468;&#12522;&#12474;&#12512;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
&#12497;&#12473;&#12527;&#12540;&#12489;&#26263;&#21495;&#21270;&#12450;&#12523;&#12468;&#12522;&#12474;&#12512;&#12434;&#25351;&#23450;&#12375;&#12394;&#12356;&#12392;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#19978;&#12398;&#12522;&#12473;&#12463;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;<br />
<hr>

</dd>
<dt>&#12456;&#12531;&#12467;&#12540;&#12487;&#12451;&#12531;&#12464;</dt>
<dd>
<p>&#12456;&#12531;&#12467;&#12540;&#12487;&#12451;&#12531;&#12464;&#12290;&#20516;&#12399;<code>Hex</code>&#12392;<code>Base64</code>&#12434;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;<code>digest-algorithm</code>&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;<code>Hex</code>&#12391;&#12377;&#12290;<code>digest-algorithm</code>&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12456;&#12531;&#12467;&#12540;&#12487;&#12451;&#12531;&#12464;&#12364;&#25351;&#23450;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>&#25991;&#23383;&#12475;&#12483;&#12488;</dt>
<dd>
<p>&#12480;&#12452;&#12472;&#12455;&#12473;&#12488;&#12539;&#12450;&#12523;&#12468;&#12522;&#12474;&#12512;&#12398;&#25991;&#23383;&#12475;&#12483;&#12488;&#12290;</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
