<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-serverinstjvmgeneral" name="ref-serverinstjvmgeneral"></a></p>

<h4><a id="sthref189" name="sthref189"></a>JVM&#12398;&#20840;&#33324;&#30340;&#12394;&#35373;&#23450;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Java&#20206;&#24819;&#12510;&#12471;&#12531;(JVM)&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;&#29289;&#29702;&#12510;&#12471;&#12531;&#19978;&#12391;Java&#12496;&#12452;&#12488;&#12539;&#12467;&#12540;&#12489;&#12434;&#23455;&#34892;&#12391;&#12365;&#12414;&#12377;&#12290;JVM&#35373;&#23450;&#12434;&#35519;&#25972;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#25913;&#21892;&#12420;&#12513;&#12514;&#12522;&#12540;&#21106;&#24403;&#12390;&#12456;&#12521;&#12540;&#12434;&#22238;&#36991;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<p>GlassFish Server&#12391;&#24517;&#35201;&#12394;Java&#20206;&#24819;&#12510;&#12471;&#12531;&#12399;&#12289;Java&#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;&#12398;Standard Edition (Java SE&#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;)&#12395;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;JVM&#12398;&#35373;&#23450;&#12395;&#35492;&#12426;&#12364;&#12354;&#12427;&#12392;&#12469;&#12540;&#12496;&#12540;&#12364;&#31292;&#20685;&#12375;&#12394;&#12367;&#12394;&#12427;&#12383;&#12417;&#12289;&#12371;&#12398;&#35373;&#23450;&#12434;&#22793;&#26356;&#12377;&#12427;&#12392;&#12365;&#12399;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
&#12300;Java&#20206;&#24819;&#12510;&#12471;&#12531;&#12301;&#12392;&#12300;JVM&#12301;&#12392;&#12356;&#12358;&#29992;&#35486;&#12399;&#12289;Java&#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;&#12398;&#20206;&#24819;&#12510;&#12471;&#12531;&#12434;&#24847;&#21619;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
<hr>

<p>&#12300;JVM&#12398;&#20840;&#33324;&#30340;&#12394;&#35373;&#23450;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12489;</dt>
<dd>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12354;&#12427;&#35373;&#23450;&#12434;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12395;&#24489;&#20803;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12394;&#12356;&#35373;&#23450;&#12399;&#22793;&#26356;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>&#27083;&#25104;&#21517;</dt>
<dd>
<p>&#12371;&#12398;&#12506;&#12540;&#12472;&#12398;&#35373;&#23450;&#12364;&#36969;&#29992;&#12373;&#12428;&#12427;&#27083;&#25104;&#12398;&#21517;&#21069;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>Java&#12507;&#12540;&#12512;</dt>
<dd>
<p>GlassFish Server&#12398;&#23455;&#34892;&#12395;&#24517;&#35201;&#12394;Java SE&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12398;&#21517;&#21069;&#12290;&#25351;&#23450;&#12377;&#12427;Java SE&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12364;&#12371;&#12398;&#12522;&#12522;&#12540;&#12473;&#12391;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12377;&#12427;&#12395;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRLN"><i>Oracle GlassFish Server&#12522;&#12522;&#12540;&#12473;&#12539;&#12494;&#12540;&#12488;</i></a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#23384;&#22312;&#12375;&#12394;&#12356;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#21517;&#12434;&#20837;&#21147;&#12375;&#12383;&#12426;&#12289;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398;Java SE&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12434;&#25351;&#23450;&#12375;&#12383;&#22580;&#21512;&#12289;GlassFish Server&#12399;&#36215;&#21205;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>Javac&#12458;&#12503;&#12471;&#12519;&#12531;</dt>
<dd>
<p>Java&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#35328;&#35486;&#12467;&#12531;&#12497;&#12452;&#12521;&#12398;&#12467;&#12510;&#12531;&#12489;&#12539;&#12521;&#12452;&#12531;&#12539;&#12458;&#12503;&#12471;&#12519;&#12531;&#12290;GlassFish Server&#12399;&#12289;Enterprise JavaBeans (EJB)&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12487;&#12503;&#12525;&#12452;&#26178;&#12395;&#12289;&#12371;&#12398;&#12467;&#12531;&#12497;&#12452;&#12521;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12487;&#12496;&#12483;&#12464;</dt>
<dd>
<p>Java Platform Debugger Architecture (JPDA)&#12434;&#20351;&#29992;&#12375;&#12383;&#12487;&#12496;&#12483;&#12464;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>JPDA&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#38283;&#30330;&#32773;&#12395;&#12424;&#12387;&#12390;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#35443;&#32048;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDVG"><i>Oracle GlassFish Server&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#38283;&#30330;&#12460;&#12452;&#12489;</i></a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</dd>
<dt>&#12487;&#12496;&#12483;&#12464;&#12539;&#12458;&#12503;&#12471;&#12519;&#12531;</dt>
<dd>
<p>&#12487;&#12496;&#12483;&#12464;&#12434;&#26377;&#21177;&#12395;&#12375;&#12383;&#12392;&#12365;&#12395;JVM&#12395;&#28193;&#12373;&#12428;&#12427;JPDA&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>RMI&#12467;&#12531;&#12497;&#12452;&#12523;&#12539;&#12458;&#12503;&#12471;&#12519;&#12531;</dt>
<dd>
<p><code>rmic</code>&#12467;&#12531;&#12497;&#12452;&#12521;&#12398;&#12467;&#12510;&#12531;&#12489;&#12539;&#12521;&#12452;&#12531;&#12539;&#12458;&#12503;&#12471;&#12519;&#12531;&#12290;EJB&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12487;&#12503;&#12525;&#12452;&#26178;&#12395;GlassFish Server&#12399;<code>rmic</code>&#12467;&#12531;&#12497;&#12452;&#12521;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12496;&#12452;&#12488;&#12467;&#12540;&#12489;&#12539;&#12503;&#12522;&#12503;&#12525;&#12475;&#12483;&#12469;</dt>
<dd>
<p>&#12496;&#12452;&#12488;&#12467;&#12540;&#12489;&#12539;&#12503;&#12522;&#12503;&#12525;&#12475;&#12483;&#12471;&#12531;&#12464;&#12398;&#12463;&#12521;&#12473;&#12398;&#21517;&#21069;&#12290;&#35079;&#25968;&#12398;&#12463;&#12521;&#12473;&#21517;&#12434;&#21306;&#20999;&#12427;&#12395;&#12399;&#12289;&#12459;&#12531;&#12510;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#21508;&#12463;&#12521;&#12473;&#12399;&#12289;com.sun.appserv.BytecodePreprocessor&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12434;&#23455;&#35013;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12463;&#12521;&#12473;&#12399;&#25351;&#23450;&#12398;&#38918;&#24207;&#12391;&#12467;&#12540;&#12523;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;</dt>
<dd>
<p>JVM&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12290;GlassFish Server&#12399;JVM&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#23450;&#32681;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
</dl>
<a id="GHCOM412" name="GHCOM412"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-jvmsettings.html">JVM&#12398;&#20840;&#33324;&#30340;&#12394;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jvmpathsettings.html">JVM&#12497;&#12473;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jvmoptions.html">JVM&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-securitymanagerdisable.html">&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12493;&#12540;&#12472;&#12515;&#12434;&#28961;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jvmprofilersettings.html">JVM&#12503;&#12525;&#12501;&#12449;&#12452;&#12521;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="GHCOM413" name="GHCOM413"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<p>&#12394;&#12375;&#12290;</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
