<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-domainattributestab" name="ref-domainattributestab"></a><a id="GHCOM00052" name="GHCOM00052"></a></p>

<h4><a id="sthref210" name="sthref210"></a>&#12489;&#12513;&#12452;&#12531;&#23646;&#24615;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>GlassFish Server&#12395;&#38306;&#12377;&#12427;&#12489;&#12513;&#12452;&#12531;&#12398;&#35443;&#32048;&#23646;&#24615;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12489;&#12513;&#12452;&#12531;&#23646;&#24615;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12489;&#12513;&#12452;&#12531;&#23646;&#24615;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>DAS&#36215;&#21205;&#24460;&#12395;&#12467;&#12531;&#12477;&#12540;&#12523;&#12434;&#12525;&#12540;&#12489;</dt>
<dd>
<p>&#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12434;&#12525;&#12540;&#12489;&#12377;&#12427;&#12479;&#12452;&#12511;&#12531;&#12464;&#12434;&#27770;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#20351;&#29992;&#29366;&#27841;&#12505;&#12540;&#12473;</dt>
<dd>
<p>&#12467;&#12531;&#12477;&#12540;&#12523;&#12364;&#36942;&#21435;24&#26178;&#38291;&#20197;&#20869;&#12395;&#20351;&#29992;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;&#12414;&#12383;&#12399;&#12489;&#12513;&#12452;&#12531;&#31649;&#29702;&#12469;&#12540;&#12496;&#12540;(DAS)&#20197;&#22806;&#12398;&#20182;&#12398;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#23384;&#22312;&#12377;&#12427;&#22580;&#21512;&#12289;DAS&#36215;&#21205;&#24460;&#12395;&#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12434;&#12525;&#12540;&#12489;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#24120;&#26178;</dt>
<dd>
<p>DAS&#36215;&#21205;&#24460;&#12395;&#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12434;&#24120;&#12395;&#12525;&#12540;&#12489;&#12375;&#12414;&#12377;&#12290;&#12467;&#12531;&#12477;&#12540;&#12523;&#12399;&#12289;GlassFish Server&#12398;&#20027;&#35201;&#12394;&#36215;&#21205;&#38918;&#24207;&#12398;&#23436;&#20102;&#24460;&#12395;&#12525;&#12540;&#12489;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12394;&#12375;</dt>
<dd>
<p>DAS&#36215;&#21205;&#24460;&#12395;&#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12434;&#12525;&#12540;&#12489;&#12375;&#12414;&#12379;&#12435;&#12290;&#12467;&#12531;&#12477;&#12540;&#12523;&#12399;&#12289;&#12450;&#12463;&#12475;&#12473;&#12364;&#12522;&#12463;&#12456;&#12473;&#12488;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#12525;&#12540;&#12489;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
</dd>
<dt>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12523;&#12540;&#12488;</dt>
<dd>
<p>&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#23384;&#22312;&#12377;&#12427;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12398;&#12501;&#12523;&#12497;&#12473;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;domain-dir<code>/applications</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12525;&#12464;&#12539;&#12523;&#12540;&#12488;</dt>
<dd>
<p>&#12469;&#12540;&#12496;&#12540;&#12398;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#20445;&#25345;&#12377;&#12427;&#22580;&#25152;&#12434;&#35672;&#21029;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;domain-dir<code>/logs</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12525;&#12465;&#12540;&#12523;</dt>
<dd>
<p>&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#31354;&#30333;&#12398;&#12414;&#12414;&#12395;&#12377;&#12427;&#12392;&#12289;&#12507;&#12473;&#12488;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12465;&#12540;&#12523;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<p>&#12525;&#12465;&#12540;&#12523;&#12399;&#12289;&#35328;&#35486;&#12392;&#22320;&#22495;&#12398;&#29305;&#23450;&#12398;&#32068;&#21512;&#12379;&#12434;&#25351;&#23450;&#12377;&#12427;&#35672;&#21029;&#23376;&#12391;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#31859;&#22269;&#33521;&#35486;&#12398;&#12525;&#12465;&#12540;&#12523;&#12399;<code>en_US</code>&#12391;&#12289;&#26085;&#26412;&#35486;&#12398;&#12525;&#12465;&#12540;&#12523;&#12399;<code>ja_JP</code>&#12391;&#12377;&#12290;&#33521;&#35486;&#20197;&#22806;&#12398;&#12525;&#12465;&#12540;&#12523;&#12434;&#20351;&#29992;&#12377;&#12427;&#12395;&#12399;&#12289;&#33521;&#35486;&#12434;&#30446;&#30340;&#12398;&#35328;&#35486;&#12395;&#32763;&#35379;&#12375;&#12390;&#12289;GlassFish Server&#12434;&#12525;&#12540;&#12459;&#12521;&#12452;&#12474;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<a id="sthref211" name="sthref211"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-setadvanceappconfig.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#27083;&#25104;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-setadvancedomainattributes.html">&#12489;&#12513;&#12452;&#12531;&#23646;&#24615;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
