<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-serverinstappsconfig" name="ref-serverinstappsconfig"></a></p>

<h4><a id="sthref212" name="sthref212"></a><a id="sthref213" name="sthref213"></a><a id="sthref214" name="sthref214"></a><a id="sthref215" name="sthref215"></a><a id="sthref216" name="sthref216"></a>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#27083;&#25104;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#27083;&#25104;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#23550;&#12377;&#12427;&#22793;&#26356;&#12398;&#26908;&#20986;&#12392;&#22793;&#26356;&#12373;&#12428;&#12383;&#12463;&#12521;&#12473;&#12398;&#20877;&#12525;&#12540;&#12489;&#12434;&#30906;&#23455;&#12395;&#23455;&#34892;&#12391;&#12365;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#27083;&#25104;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12488;&#12500;&#12483;&#12463;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12489;</dt>
<dd>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12354;&#12427;&#35373;&#23450;&#12434;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12395;&#24489;&#20803;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12394;&#12356;&#35373;&#23450;&#12399;&#22793;&#26356;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>&#20877;&#12525;&#12540;&#12489;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12289;&#22793;&#26356;&#12373;&#12428;&#12383;&#12463;&#12521;&#12473;&#12399;&#21205;&#30340;&#12395;&#20877;&#12525;&#12540;&#12489;&#12373;&#12428;&#12414;&#12377;&#12290;&#12469;&#12540;&#12496;&#12540;&#12399;&#12289;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#20869;&#12398;&#22793;&#26356;&#12434;&#23450;&#26399;&#30340;&#12395;&#30906;&#35469;&#12375;&#12289;&#22793;&#26356;&#12395;&#20276;&#12356;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#33258;&#21205;&#30340;&#12362;&#12424;&#12403;&#21205;&#30340;&#12395;&#20877;&#12487;&#12503;&#12525;&#12452;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#27231;&#33021;&#12399;&#12289;&#22793;&#26356;&#12375;&#12383;&#12467;&#12540;&#12489;&#12434;&#12377;&#12368;&#12395;&#12486;&#12473;&#12488;&#12391;&#12365;&#12427;&#12383;&#12417;&#12289;&#38283;&#30330;&#29872;&#22659;&#12391;&#24441;&#12395;&#31435;&#12385;&#12414;&#12377;&#12290;&#12375;&#12363;&#12375;&#12289;&#26412;&#30058;&#29872;&#22659;&#12391;&#12399;&#12289;&#21205;&#30340;&#20877;&#12525;&#12540;&#12489;&#12399;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12434;&#20302;&#19979;&#12373;&#12379;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;&#20877;&#12525;&#12540;&#12489;&#12364;&#34892;&#12431;&#12428;&#12390;&#12356;&#12427;&#12392;&#12365;&#12399;&#12289;&#12381;&#12398;&#36578;&#36865;&#26178;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12364;&#28961;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12434;&#20877;&#36215;&#21205;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#20877;&#12525;&#12540;&#12489;&#12398;&#12509;&#12540;&#12522;&#12531;&#12464;&#38291;&#38548;</dt>
<dd>
<p>&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12392;&#12514;&#12472;&#12517;&#12540;&#12523;&#20869;&#12398;&#12467;&#12540;&#12489;&#22793;&#26356;&#12434;&#12469;&#12540;&#12496;&#12540;&#12364;&#12481;&#12455;&#12483;&#12463;&#12377;&#12427;&#38971;&#24230;&#12434;&#35672;&#21029;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;2&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#31649;&#29702;&#12475;&#12483;&#12471;&#12519;&#12531;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;</dt>
<dd>
<p>&#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12364;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12375;&#12289;&#20877;&#24230;&#12525;&#12464;&#12452;&#12531;&#12364;&#24517;&#35201;&#12392;&#12394;&#12427;&#12414;&#12391;&#12398;&#38750;&#12450;&#12463;&#12486;&#12451;&#12502;&#29366;&#24907;&#12398;&#20998;&#25968;&#12434;&#35672;&#21029;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;60&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#33258;&#21205;&#12487;&#12503;&#12525;&#12452;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12289;&#33258;&#21205;&#12487;&#12503;&#12525;&#12452;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#20869;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#33258;&#21205;&#30340;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#33258;&#21205;&#12487;&#12503;&#12525;&#12452;&#12398;&#12509;&#12540;&#12522;&#12531;&#12464;&#38291;&#38548;</dt>
<dd>
<p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12414;&#12383;&#12399;&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#22793;&#26356;&#29992;&#12398;&#33258;&#21205;&#12487;&#12503;&#12525;&#12452;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12434;&#12469;&#12540;&#12496;&#12540;&#12364;&#12481;&#12455;&#12483;&#12463;&#12377;&#12427;&#38971;&#24230;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12509;&#12540;&#12522;&#12531;&#12464;&#38291;&#38548;&#12434;&#22793;&#26356;&#12375;&#12390;&#12418;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12420;&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#12487;&#12503;&#12525;&#12452;&#12395;&#12363;&#12363;&#12427;&#26178;&#38291;&#12395;&#12399;&#24433;&#38911;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;2&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#33258;&#21205;&#12487;&#12503;&#12525;&#12452;&#12398;&#20877;&#35430;&#34892;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;</dt>
<dd>
<p>&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12377;&#12427;&#12414;&#12391;&#12395;&#37096;&#20998;&#30340;&#12395;&#12467;&#12500;&#12540;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12398;&#12469;&#12452;&#12474;&#12364;&#22793;&#26356;&#12373;&#12428;&#12378;&#12395;&#27531;&#12427;&#31186;&#25968;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;4&#12391;&#12377;&#12290;</p>
<p>&#33258;&#21205;&#12487;&#12503;&#12525;&#12452;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12408;&#12398;&#12501;&#12449;&#12452;&#12523;&#12398;&#12467;&#12500;&#12540;&#12395;&#26178;&#38291;&#12364;&#12363;&#12363;&#12427;&#12392;&#12289;&#12501;&#12449;&#12452;&#12523;&#20840;&#20307;&#12364;&#12467;&#12500;&#12540;&#12373;&#12428;&#12427;&#21069;&#12395;&#12381;&#12398;&#12501;&#12449;&#12452;&#12523;&#12364;&#34920;&#31034;&#12373;&#12428;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12381;&#12398;&#32080;&#26524;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#33258;&#21205;&#12487;&#12503;&#12525;&#12452;&#12364;&#22833;&#25943;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#29702;&#30001;&#12395;&#12424;&#12387;&#12390;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#33258;&#21205;&#12487;&#12503;&#12525;&#12452;&#12395;&#22833;&#25943;&#12375;&#12383;&#22580;&#21512;&#12289;GlassFish Server&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12487;&#12503;&#12525;&#12452;&#12434;&#20877;&#35430;&#34892;&#12375;&#12414;&#12377;&#12290;&#37096;&#20998;&#30340;&#12395;&#12467;&#12500;&#12540;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12398;&#12469;&#12452;&#12474;&#12364;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#26178;&#38291;&#12434;&#36942;&#12366;&#12390;&#12418;&#22793;&#26356;&#12373;&#12428;&#12394;&#12356;&#12392;&#12289;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#33258;&#21205;&#12487;&#12503;&#12525;&#12452;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;</dt>
<dd>
<p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#33258;&#21205;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12434;&#12514;&#12491;&#12479;&#12540;&#12377;&#12427;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;domain-dir<code>/autodeploy</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt>XML&#26908;&#26619;</dt>
<dd>
<p>&#27161;&#28310;&#12362;&#12424;&#12403;GlassFish Server&#12398;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#35352;&#36848;&#23376;&#12391;&#23455;&#34892;&#12373;&#12428;&#12427;&#12289;XML&#26908;&#26619;&#12398;&#12479;&#12452;&#12503;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#27425;&#12398;&#12356;&#12378;&#12428;&#12363;&#12398;&#12479;&#12452;&#12503;&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#23436;&#20840;</dt>
<dd>
<p>XML&#26908;&#26619;&#12364;&#22833;&#25943;&#12377;&#12427;&#12392;&#12289;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12418;&#22833;&#25943;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#20516;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#35299;&#26512;&#20013;</dt>
<dd>
<p>XML&#26908;&#26619;&#12398;&#12456;&#12521;&#12540;&#12364;&#12524;&#12509;&#12540;&#12488;&#12373;&#12428;&#12414;&#12377;&#12364;&#12289;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12399;&#23455;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12394;&#12375;</dt>
<dd>
<p>XML&#26908;&#26619;&#12399;&#23455;&#34892;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
</dl>
</dd>
<dt>&#12505;&#12522;&#12501;&#12449;&#12452;&#12450;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12399;&#12289;&#33258;&#21205;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12398;&#21069;&#12395;&#12505;&#12522;&#12501;&#12449;&#12452;&#12450;&#12364;&#23455;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;&#30906;&#35469;&#12364;&#22833;&#25943;&#12377;&#12427;&#12392;&#12289;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12399;&#23455;&#34892;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12505;&#12522;&#12501;&#12449;&#12452;&#12450;&#12399;&#12501;&#12449;&#12452;&#12523;&#12398;&#27083;&#36896;&#12392;&#12467;&#12531;&#12486;&#12531;&#12484;&#12434;&#35519;&#12409;&#12414;&#12377;&#12290;&#22823;&#12365;&#12394;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#30906;&#35469;&#12399;&#26178;&#38291;&#12364;&#12363;&#12363;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12503;&#12522;&#12467;&#12531;&#12497;&#12452;&#12523;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12399;&#12289;JavaServer Pages (JSP)&#12501;&#12449;&#12452;&#12523;&#12364;&#12503;&#12522;&#12467;&#12531;&#12497;&#12452;&#12523;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#28961;&#21177;&#12394;&#22580;&#21512;&#12289;JSP&#12501;&#12449;&#12452;&#12523;&#12399;&#21021;&#12417;&#12390;&#12450;&#12463;&#12475;&#12473;&#12373;&#12428;&#12383;&#23455;&#34892;&#26178;&#12395;&#12467;&#12531;&#12497;&#12452;&#12523;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;</dt>
<dd>
<p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12290;GlassFish Server&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#23450;&#32681;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
</dl>
<a id="sthref217" name="sthref217"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-setadvanceappconfig.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#27083;&#25104;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-setadvancedomainattributes.html">&#12489;&#12513;&#12452;&#12531;&#23646;&#24615;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
