<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-enablemesec4appclients" name="task-enablemesec4appclients"></a><a id="GHCOM00210" name="GHCOM00210"></a></p>

<h4><a id="sthref184" name="sthref184"></a>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12395;&#12399;&#12289;&#23550;&#35441;&#20808;&#12398;&#12469;&#12540;&#12496;&#12540;&#20596;&#12503;&#12525;&#12496;&#12452;&#12480;&#12392;&#21516;&#12376;&#12513;&#12483;&#12475;&#12540;&#12472;&#20445;&#35703;&#12509;&#12522;&#12471;&#12540;&#12434;&#35373;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;GlassFish Server&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#26178;&#12395;&#27083;&#25104;&#12373;&#12428;&#12289;&#12414;&#12384;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12394;&#12356;&#12503;&#12525;&#12496;&#12452;&#12480;&#12391;&#12399;&#12289;&#12377;&#12391;&#12395;&#12381;&#12398;&#12424;&#12358;&#12395;&#27083;&#25104;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
<p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12467;&#12531;&#12486;&#12490;&#12398;GlassFish Server&#22266;&#26377;&#12398;&#27083;&#25104;&#12434;&#22793;&#26356;&#12375;&#12414;&#12377;&#12290;</p>
<ol>
<li>
<p>&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12467;&#12531;&#12486;&#12490;&#35352;&#36848;&#23376;&#12395;&#20381;&#23384;&#12377;&#12427;&#12377;&#12409;&#12390;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#20572;&#27490;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12486;&#12461;&#12473;&#12488;&#12539;&#12456;&#12487;&#12451;&#12479;&#12391;&#12289;domain-dir<code>/config/sun-acc.xml.</code>&#12395;&#26684;&#32013;&#12373;&#12428;&#12390;&#12356;&#12427;Sun&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12467;&#12531;&#12486;&#12490;&#35352;&#36848;&#23376;&#12434;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;<code>default-client-provider</code>&#23646;&#24615;&#12434;<code>message-security-config</code>&#35201;&#32032;&#12395;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#27425;&#12395;&#31034;&#12377;&#12467;&#12540;&#12489;&#12398;&#21069;&#24460;&#12398;&#37096;&#20998;&#12399;&#35500;&#26126;&#12398;&#12383;&#12417;&#12398;&#12418;&#12398;&#12391;&#12289;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#29872;&#22659;&#12395;&#12424;&#12387;&#12390;&#33509;&#24178;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;&#22793;&#26356;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<pre>
&lt;client-container&gt;
  &lt;target-server name="<i>your-host</i>" address="<i>your-host</i>"
      port="<i>your-port</i>"
  &lt;log-service file="" level="WARNING"
  &lt;message-security-config auth-layer="SOAP"
      <b>default-client-provider="ClientProvider"</b>&gt;
    &lt;provider-config
        class-name="com.sun.enterprise.security.jauth.ClientAuthModule"
        provider-id="clientprovider" provider-type="client"&gt;
      &lt;request-policy auth-source="sender"
      &lt;response-policy
        &lt;property name="security.config"
          value="C:/Sun/AppServer/lib/appclient/wss-client-config.xml"
    &lt;/provider-config&gt;
  &lt;/message-security-config&gt;
&lt;/client-container&gt;
</pre>
<p>&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12467;&#12531;&#12486;&#12490;&#12391;&#27083;&#25104;&#12373;&#12428;&#12383;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12399;&#12289;&#31192;&#23494;&#37749;&#12362;&#12424;&#12403;&#20449;&#38972;&#12373;&#12428;&#12383;&#35388;&#26126;&#26360;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;&#12434;&#35377;&#21487;&#12373;&#12428;&#12390;&#12356;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12450;&#12463;&#12475;&#12473;&#12434;&#35377;&#21487;&#12377;&#12427;&#12395;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#36215;&#21205;&#12473;&#12463;&#12522;&#12503;&#12488;&#12391;&#27425;&#12398;&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<pre>
-Djavax.net.ssl.keyStore

-Djavax.net.ssl.trustStore
</pre></li>
</ol>
<a id="sthref185" name="sthref185"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12391;&#20351;&#29992;&#12373;&#12428;&#12427;GlassFish Server&#27231;&#33021;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#27083;&#25104;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#27083;&#25104;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#27083;&#25104;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
