<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-uc-update" name="task-uc-update"></a></p>

<h4><a id="sthref198" name="sthref198"></a>&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#20351;&#29992;&#21487;&#33021;&#12394;&#26356;&#26032;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;&#20351;&#29992;&#21487;&#33021;&#12394;&#26356;&#26032;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12383;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12452;&#12513;&#12540;&#12472;&#12398;&#26032;&#35215;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12395;&#38306;&#12377;&#12427;&#24773;&#22577;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#26356;&#26032;&#12484;&#12540;&#12523;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#20351;&#29992;&#21487;&#33021;&#12394;&#12450;&#12489;&#12458;&#12531;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20351;&#29992;&#21487;&#33021;&#12394;&#12450;&#12489;&#12458;&#12531;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;&#20351;&#29992;&#21487;&#33021;&#12394;&#26356;&#26032;&#12301;&#12479;&#12502;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#20351;&#29992;&#21487;&#33021;&#12394;&#26356;&#26032;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;&#20351;&#29992;&#21487;&#33021;&#12394;&#26356;&#26032;&#12364;&#12394;&#12356;&#22580;&#21512;&#12289;&#34920;&#12399;&#31354;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref199" name="sthref199"></a>
<h5>&#27425;&#12398;&#12473;&#12486;&#12483;&#12503;</h5>
<p>&#20351;&#29992;&#21487;&#33021;&#12394;&#26356;&#26032;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12395;&#12399;&#12289;&#12414;&#12378;GlassFish Server&#12489;&#12513;&#12452;&#12531;&#12434;&#20572;&#27490;&#12375;&#12414;&#12377;&#12290;&#32154;&#12356;&#12390;&#12289;&#27425;&#12398;&#12356;&#12378;&#12428;&#12363;&#12398;&#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>as-install-parent<code>/bin/updatetool</code>(&#26356;&#26032;&#12484;&#12540;&#12523;&#12539;&#12464;&#12521;&#12501;&#12451;&#12459;&#12523;&#12539;&#12518;&#12540;&#12486;&#12451;&#12522;&#12486;&#12451;&#12434;&#36215;&#21205;)</p>
</li>
<li>
<p>as-install-parent<code>/bin/pkg</code>(&#12467;&#12510;&#12531;&#12489;&#12539;&#12521;&#12452;&#12531;&#12539;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398;&#26356;&#26032;&#12484;&#12540;&#12523;)</p>
</li>
</ul>
<p><code>pkg</code>&#12467;&#12510;&#12531;&#12489;&#12398;&#20351;&#29992;&#26041;&#27861;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSADG00014"><i>Oracle GlassFish Server&#31649;&#29702;&#12460;&#12452;&#12489;</i>&#12398;&#31532;11&#31456;&#12289;<i>Extending and Updating GlassFish Server</i></a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#26356;&#26032;&#12484;&#12540;&#12523;&#12539;&#12518;&#12540;&#12486;&#12451;&#12522;&#12486;&#12451;&#12395;&#12399;&#12458;&#12531;&#12521;&#12452;&#12531;&#12539;&#12504;&#12523;&#12503;&#12364;&#29992;&#24847;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
<p>&#26356;&#26032;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12364;&#32066;&#20102;&#12375;&#12383;&#12425;&#12289;&#12469;&#12540;&#12496;&#12540;&#12434;&#20877;&#36215;&#21205;&#12375;&#12414;&#12377;&#12290;</p>
<a id="sthref200" name="sthref200"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-uc-addon.html">&#12450;&#12489;&#12458;&#12531;&#12539;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-uc-installed-remove.html">&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#28168;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-uc-pkgdetails.html">&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#35443;&#32048;&#24773;&#22577;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-uc-set-proxy.html">&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12503;&#12525;&#12461;&#12471;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
