<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-configmsgsecproviders" name="task-configmsgsecproviders"></a></p>

<h4><a id="sthref102" name="sthref102"></a>&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12391;&#20351;&#29992;&#12373;&#12428;&#12427;GlassFish Server&#27231;&#33021;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#12518;&#12540;&#12470;&#12540;&#21517;&#12488;&#12540;&#12463;&#12531;&#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#24517;&#35201;&#12395;&#24540;&#12376;&#12390;&#12518;&#12540;&#12470;&#12540;&#12539;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12434;&#27083;&#25104;&#12375;&#12414;&#12377;&#12290;</p>
<p>username/password&#12488;&#12540;&#12463;&#12531;&#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#26368;&#21021;&#12395;&#36969;&#20999;&#12394;&#12524;&#12523;&#12512;&#12434;&#27083;&#25104;&#12375;&#12289;&#12371;&#12398;&#12524;&#12523;&#12512;&#12395;&#36969;&#20999;&#12394;&#12518;&#12540;&#12470;&#12540;&#12539;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12518;&#12540;&#12470;&#12540;&#12539;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#27083;&#25104;&#26041;&#27861;&#12399;&#12289;<a href="task-realmedit.html">&#12524;&#12523;&#12512;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a>&#12395;&#35352;&#36617;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#24517;&#35201;&#12395;&#24540;&#12376;&#12390;&#35388;&#26126;&#26360;&#12392;&#31192;&#23494;&#37749;&#12434;&#31649;&#29702;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="GHCOM308" name="GHCOM308"></a>
<h5>&#27425;&#12398;&#12473;&#12486;&#12483;&#12503;</h5>
<p>GlassFish Server&#12398;&#27231;&#33021;&#12398;&#27083;&#25104;&#12364;&#23436;&#20102;&#12375;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12364;&#12381;&#12428;&#12425;&#12398;&#27231;&#33021;&#12434;&#20351;&#29992;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12392;&#12289;GlassFish Server&#12392;&#12392;&#12418;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12383;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#26377;&#21177;&#12395;&#12391;&#12365;&#12414;&#12377;&#12290;&#25163;&#38918;&#12399;&#12289;<a href="task-messagesecurityconfigedit.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<a id="GHCOM309" name="GHCOM309"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-messagesecurityconfignew.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#27083;&#25104;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#27083;&#25104;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#27083;&#25104;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
