<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-uc-set-proxy" name="task-uc-set-proxy"></a><a id="GHCOM00218" name="GHCOM00218"></a></p>

<h4><a id="sthref206" name="sthref206"></a><a id="sthref207" name="sthref207"></a><a id="sthref208" name="sthref208"></a>&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12503;&#12525;&#12461;&#12471;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12503;&#12525;&#12461;&#12471;&#35373;&#23450;&#12395;&#12424;&#12426;&#12289;GlassFish Server&#12398;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12408;&#12398;&#25509;&#32154;&#26041;&#27861;&#12364;&#25351;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;&#26356;&#26032;&#12484;&#12540;&#12523;&#12364;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#32076;&#30001;&#12391;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12503;&#12525;&#12461;&#12471;&#12434;&#27083;&#25104;&#12375;&#12414;&#12377;&#12290;</p>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#26356;&#26032;&#12484;&#12540;&#12523;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#20351;&#29992;&#21487;&#33021;&#12394;&#12450;&#12489;&#12458;&#12531;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20351;&#29992;&#21487;&#33021;&#12394;&#12450;&#12489;&#12458;&#12531;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;&#27083;&#25104;&#12301;&#12479;&#12502;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26356;&#26032;&#12484;&#12540;&#12523;&#12398;&#27083;&#25104;&#12301;&#12506;&#12540;&#12472;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26356;&#26032;&#12484;&#12540;&#12523;&#12398;&#27083;&#25104;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;GlassFish Server&#12364;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;&#12510;&#12471;&#12531;&#12364;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12395;&#25509;&#32154;&#12377;&#12427;&#26041;&#27861;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#12510;&#12471;&#12531;&#12364;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12395;&#30452;&#25509;&#25509;&#32154;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12300;&#30452;&#25509;&#25509;&#32154;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12510;&#12471;&#12531;&#12364;&#12503;&#12525;&#12461;&#12471;&#32076;&#30001;&#12391;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12395;&#25509;&#32154;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12300;&#12503;&#12525;&#12461;&#12471;&#32076;&#30001;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>GlassFish Server&#12434;&#23455;&#34892;&#12375;&#12390;&#12356;&#12427;&#12510;&#12471;&#12531;&#12364;&#12503;&#12525;&#12461;&#12471;&#12434;&#20171;&#12375;&#12390;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12395;&#25509;&#32154;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12503;&#12525;&#12461;&#12471;&#12398;&#12503;&#12525;&#12461;&#12471;&#12539;&#12507;&#12473;&#12488;&#21517;&#12392;&#12503;&#12525;&#12461;&#12471;&#12539;&#12509;&#12540;&#12488;&#30058;&#21495;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>GlassFish Server&#12434;&#23455;&#34892;&#12375;&#12390;&#12356;&#12427;&#12510;&#12471;&#12531;&#12364;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12395;&#30452;&#25509;&#25509;&#32154;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12371;&#12398;&#12473;&#12486;&#12483;&#12503;&#12434;&#30465;&#30053;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>GlassFish Server&#12434;&#23455;&#34892;&#12375;&#12390;&#12356;&#12427;&#12510;&#12471;&#12531;&#12391;Web&#12502;&#12521;&#12454;&#12470;&#12434;&#23455;&#34892;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12381;&#12398;&#22580;&#21512;&#12399;&#12289;&#12503;&#12525;&#12461;&#12471;&#12398;&#12507;&#12473;&#12488;&#21517;&#12392;&#12509;&#12540;&#12488;&#30058;&#21495;&#12434;Web&#12502;&#12521;&#12454;&#12470;&#12363;&#12425;&#21462;&#24471;&#12391;&#12365;&#12414;&#12377;&#12290;&#12381;&#12428;&#20197;&#22806;&#12398;&#22580;&#21512;&#12399;&#12289;&#12471;&#12473;&#12486;&#12512;&#31649;&#29702;&#32773;&#12395;&#21839;&#12356;&#21512;&#12379;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref209" name="sthref209"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-uc-update.html">&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#20351;&#29992;&#21487;&#33021;&#12394;&#26356;&#26032;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-uc-addon.html">&#12450;&#12489;&#12458;&#12531;&#12539;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-uc-installed-remove.html">&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#28168;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-uc-pkgdetails.html">&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#35443;&#32048;&#24773;&#22577;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
