<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-setadvancedomainattributes" name="task-setadvancedomainattributes"></a></p>

<h4><a id="sthref5" name="sthref5"></a>&#12489;&#12513;&#12452;&#12531;&#23646;&#24615;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#12489;&#12513;&#12452;&#12531;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12489;&#12513;&#12452;&#12531;&#23646;&#24615;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;DAS&#36215;&#21205;&#24460;&#12395;&#12467;&#12531;&#12477;&#12540;&#12523;&#12434;&#12525;&#12540;&#12489;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12391;&#12289;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#27425;&#12398;&#12356;&#12378;&#12428;&#12363;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#20351;&#29992;&#29366;&#27841;&#12505;&#12540;&#12473;</dt>
<dd>
<p>&#12467;&#12531;&#12477;&#12540;&#12523;&#12364;&#36942;&#21435;24&#26178;&#38291;&#20197;&#20869;&#12395;&#20351;&#29992;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;&#12414;&#12383;&#12399;&#12489;&#12513;&#12452;&#12531;&#31649;&#29702;&#12469;&#12540;&#12496;&#12540;(DAS)&#20197;&#22806;&#12398;&#20182;&#12398;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#23384;&#22312;&#12377;&#12427;&#22580;&#21512;&#12289;DAS&#36215;&#21205;&#24460;&#12395;&#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12434;&#12525;&#12540;&#12489;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#24120;&#26178;</dt>
<dd>
<p>DAS&#36215;&#21205;&#24460;&#12395;&#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12434;&#24120;&#12395;&#12525;&#12540;&#12489;&#12375;&#12414;&#12377;&#12290;&#12467;&#12531;&#12477;&#12540;&#12523;&#12399;&#12289;GlassFish Server&#12398;&#20027;&#35201;&#12394;&#36215;&#21205;&#38918;&#24207;&#12398;&#23436;&#20102;&#24460;&#12395;&#12525;&#12540;&#12489;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12394;&#12375;</dt>
<dd>
<p>DAS&#36215;&#21205;&#24460;&#12395;&#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12434;&#12525;&#12540;&#12489;&#12375;&#12414;&#12379;&#12435;&#12290;&#12467;&#12531;&#12477;&#12540;&#12523;&#12399;&#12289;&#12450;&#12463;&#12475;&#12473;&#12364;&#12522;&#12463;&#12456;&#12473;&#12488;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#12525;&#12540;&#12489;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
</li>
<li>
<p>&#12300;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12523;&#12540;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#37197;&#32622;&#12373;&#12428;&#12383;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12398;&#12501;&#12523;&#12497;&#12473;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;domain-dir<code>/applications</code>&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12525;&#12464;&#12539;&#12523;&#12540;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12469;&#12540;&#12496;&#12540;&#12398;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#26684;&#32013;&#12377;&#12427;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12398;&#12501;&#12523;&#12497;&#12473;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;domain-dir<code>/logs</code>&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12525;&#12465;&#12540;&#12523;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#31354;&#30333;&#12398;&#12414;&#12414;&#12395;&#12375;&#12390;&#12289;&#12507;&#12473;&#12488;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12525;&#12465;&#12540;&#12523;&#12434;&#20351;&#29992;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12525;&#12465;&#12540;&#12523;&#12399;&#12289;&#35328;&#35486;&#12392;&#22320;&#22495;&#12398;&#29305;&#23450;&#12398;&#32068;&#21512;&#12379;&#12434;&#25351;&#23450;&#12377;&#12427;&#35672;&#21029;&#23376;&#12391;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#31859;&#22269;&#33521;&#35486;&#12398;&#12525;&#12465;&#12540;&#12523;&#12399;<code>en_US</code>&#12391;&#12289;&#26085;&#26412;&#35486;&#12398;&#12525;&#12465;&#12540;&#12523;&#12399;<code>ja_JP</code>&#12391;&#12377;&#12290;&#33521;&#35486;&#20197;&#22806;&#12398;&#12525;&#12465;&#12540;&#12523;&#12434;&#20351;&#29992;&#12377;&#12427;&#12395;&#12399;&#12289;&#33521;&#35486;&#12434;&#30446;&#30340;&#12398;&#35328;&#35486;&#12395;&#32763;&#35379;&#12375;&#12390;&#12289;GlassFish Server&#12434;&#12525;&#12540;&#12459;&#12521;&#12452;&#12474;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12469;&#12540;&#12496;&#12540;&#12434;&#20877;&#36215;&#21205;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref6" name="sthref6"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-generaltab.html">DAS&#12398;&#19968;&#33324;&#24773;&#22577;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-logviewer.html">DAS&#12398;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-filter-logs.html">&#34920;&#31034;&#12373;&#12428;&#12383;&#12525;&#12464;&#12539;&#12524;&#12467;&#12540;&#12489;&#12434;&#12501;&#12451;&#12523;&#12479;&#12522;&#12531;&#12464;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-setadvanceappconfig.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#27083;&#25104;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-collectdomainlogs.html">&#12489;&#12513;&#12452;&#12531;&#12539;&#12525;&#12464;&#12434;&#21454;&#38598;&#12362;&#12424;&#12403;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-setadminpassword.html">&#31649;&#29702;&#32773;&#12497;&#12473;&#12527;&#12540;&#12489;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-systemproperties.html">&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#31649;&#29702;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appmonitoringdata.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-servermonitoringdata.html">&#12469;&#12540;&#12496;&#12540;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-resourcemonitoringdata.html">&#12522;&#12477;&#12540;&#12473;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
