<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-appviewtargets" name="task-appviewtargets"></a></p>

<h4>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12479;&#12540;&#12466;&#12483;&#12488;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12479;&#12540;&#12466;&#12483;&#12488;&#12434;&#34920;&#31034;&#12377;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#21517;&#12395;&#12399;&#12289;&#12458;&#12503;&#12471;&#12519;&#12531;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#35672;&#21029;&#23376;&#12434;&#21547;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#35672;&#21029;&#23376;&#12399;&#21517;&#21069;&#12398;&#24460;&#12395;&#32154;&#12365;&#12289;&#12467;&#12525;&#12531;(<code>:</code>)&#12395;&#12424;&#12387;&#12390;&#21517;&#21069;&#12392;&#12398;&#21306;&#20999;&#12426;&#12434;&#20184;&#12369;&#12414;&#12377;&#12290;&#12514;&#12472;&#12517;&#12540;&#12523;&#12362;&#12424;&#12403;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Oracle GlassFish Server&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12460;&#12452;&#12489;</i>&#12398;<i>Module and Application Versions</i></a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12479;&#12540;&#12466;&#12483;&#12488;&#12301;&#12479;&#12502;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12479;&#12540;&#12466;&#12483;&#12488;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12363;&#12428;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#29694;&#22312;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#12479;&#12540;&#12466;&#12483;&#12488;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#29305;&#23450;&#12398;&#12479;&#12540;&#12466;&#12483;&#12488;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12414;&#12383;&#12399;&#12463;&#12521;&#12473;&#12479;&#12391;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12414;&#12383;&#12399;&#28961;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;&#12479;&#12540;&#12466;&#12483;&#12488;&#12398;&#38563;&#12398;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#12300;&#12381;&#12398;&#20182;&#12398;&#25805;&#20316;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12513;&#12491;&#12517;&#12540;&#12363;&#12425;&#12300;&#26377;&#21177;&#12301;&#12414;&#12383;&#12399;&#12300;&#28961;&#21177;&#12301;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#29305;&#23450;&#12398;&#12479;&#12540;&#12466;&#12483;&#12488;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12414;&#12383;&#12399;&#12463;&#12521;&#12473;&#12479;&#12391;&#12479;&#12540;&#12466;&#12483;&#12488;&#12398;&#12525;&#12540;&#12489;&#12539;&#12496;&#12521;&#12531;&#12471;&#12531;&#12464;&#12364;&#34892;&#12431;&#12428;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;&#12381;&#12398;&#12479;&#12540;&#12466;&#12483;&#12488;&#12398;&#38563;&#12398;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#12300;&#12381;&#12398;&#20182;&#12398;&#25805;&#20316;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12513;&#12491;&#12517;&#12540;&#12363;&#12425;&#12300;&#12525;&#12540;&#12489;&#12539;&#12496;&#12521;&#12531;&#12469;&#26377;&#21177;&#12301;&#12414;&#12383;&#12399;&#12300;&#12525;&#12540;&#12489;&#12539;&#12496;&#12521;&#12531;&#12469;&#28961;&#21177;&#12301;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#29305;&#23450;&#12398;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12392;&#38306;&#36899;&#20184;&#12369;&#12427;&#12395;&#12399;&#12289;&#30446;&#30340;&#12398;&#12479;&#12540;&#12466;&#12483;&#12488;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12414;&#12383;&#12399;&#12463;&#12521;&#12473;&#12479;&#12395;&#12300;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12398;&#31649;&#29702;&#12301;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12539;&#12479;&#12540;&#12466;&#12483;&#12488;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
<p>&#12479;&#12540;&#12466;&#12483;&#12488;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12434;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#20351;&#29992;&#21487;&#33021;&#12394;&#12479;&#12540;&#12466;&#12483;&#12488;&#12301;&#12398;&#12522;&#12473;&#12488;&#12363;&#12425;&#12381;&#12428;&#12425;&#12434;&#36984;&#25246;&#12375;&#12289;&#12300;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12434;&#20351;&#29992;&#12375;&#12390;&#12381;&#12428;&#12425;&#12434;&#12300;&#36984;&#25246;&#12375;&#12383;&#12479;&#12540;&#12466;&#12483;&#12488;&#12301;&#12398;&#12522;&#12473;&#12488;&#12395;&#31227;&#21205;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12514;&#12472;&#12517;&#12540;&#12523;&#12414;&#12383;&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;<code>server</code>&#12392;&#12356;&#12358;&#12487;&#12501;&#12457;&#12523;&#12488;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12414;&#12377;&#12290;&#12300;&#12377;&#12409;&#12390;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12377;&#12409;&#12390;&#12398;&#12479;&#12540;&#12466;&#12483;&#12488;&#12395;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290;&#12300;&#38500;&#21435;&#12301;&#12508;&#12479;&#12531;&#12392;&#12300;&#12377;&#12409;&#12390;&#38500;&#21435;&#12301;&#12508;&#12479;&#12531;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12300;&#36984;&#25246;&#12375;&#12383;&#12479;&#12540;&#12466;&#12483;&#12488;&#12301;&#12398;&#12522;&#12473;&#12488;&#12363;&#12425;&#12479;&#12540;&#12466;&#12483;&#12488;&#12434;&#38500;&#21435;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#36984;&#25246;&#12375;&#12289;&#12300;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12479;&#12540;&#12466;&#12483;&#12488;&#12301;&#12506;&#12540;&#12472;&#12395;&#25147;&#12426;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12479;&#12540;&#12466;&#12483;&#12488;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12414;&#12383;&#12399;&#12463;&#12521;&#12473;&#12479;&#12434;&#36861;&#21152;&#12414;&#12383;&#12399;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12479;&#12540;&#12466;&#12483;&#12488;&#12398;&#31649;&#29702;&#12301;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12479;&#12540;&#12466;&#12483;&#12488;&#12398;&#31649;&#29702;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
<p>&#12479;&#12540;&#12466;&#12483;&#12488;&#12434;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#20351;&#29992;&#21487;&#33021;&#12394;&#12479;&#12540;&#12466;&#12483;&#12488;&#12301;&#12398;&#12522;&#12473;&#12488;&#12363;&#12425;&#12381;&#12428;&#12425;&#12434;&#36984;&#25246;&#12375;&#12289;&#12300;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12434;&#20351;&#29992;&#12375;&#12390;&#12381;&#12428;&#12425;&#12434;&#12300;&#36984;&#25246;&#12375;&#12383;&#12479;&#12540;&#12466;&#12483;&#12488;&#12301;&#12398;&#12522;&#12473;&#12488;&#12395;&#31227;&#21205;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12377;&#12409;&#12390;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12377;&#12409;&#12390;&#12398;&#12479;&#12540;&#12466;&#12483;&#12488;&#12395;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290;&#12300;&#38500;&#21435;&#12301;&#12508;&#12479;&#12531;&#12392;&#12300;&#12377;&#12409;&#12390;&#38500;&#21435;&#12301;&#12508;&#12479;&#12531;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12300;&#36984;&#25246;&#12375;&#12383;&#12479;&#12540;&#12466;&#12483;&#12488;&#12301;&#12398;&#12522;&#12473;&#12488;&#12363;&#12425;&#12479;&#12540;&#12466;&#12483;&#12488;&#12434;&#38500;&#21435;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#36984;&#25246;&#12375;&#12289;&#12300;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12479;&#12540;&#12466;&#12483;&#12488;&#12301;&#12506;&#12540;&#12472;&#12395;&#25147;&#12426;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#20197;&#19978;&#12398;&#25805;&#20316;&#12391;&#12289;&#20462;&#27491;&#12373;&#12428;&#12383;&#12479;&#12540;&#12466;&#12483;&#12488;&#12398;&#12522;&#12473;&#12488;&#12395;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="GHCOM251" name="GHCOM251"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-appedit.html">&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#35352;&#36848;&#23376;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-applaunch.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#36215;&#21205;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
