<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-setadminpassword" name="task-setadminpassword"></a></p>

<h4><a id="sthref13" name="sthref13"></a><a id="sthref14" name="sthref14"></a>&#31649;&#29702;&#32773;&#12497;&#12473;&#12527;&#12540;&#12489;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#12489;&#12513;&#12452;&#12531;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12489;&#12513;&#12452;&#12531;&#23646;&#24615;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#31649;&#29702;&#32773;&#12497;&#12473;&#12527;&#12540;&#12489;&#12301;&#12479;&#12502;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26032;&#35215;&#31649;&#29702;&#32773;&#12497;&#12473;&#12527;&#12540;&#12489;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#29694;&#22312;&#12398;&#31649;&#29702;&#32773;&#12450;&#12459;&#12454;&#12531;&#12488;&#12398;&#12518;&#12540;&#12470;&#12540;ID&#12392;&#12464;&#12523;&#12540;&#12503;&#21517;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12518;&#12540;&#12470;&#12540;ID&#12399;<code>admin</code>&#12289;&#12464;&#12523;&#12540;&#12503;&#21517;&#12399;<code>asadmin</code>&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26032;&#35215;&#12497;&#12473;&#12527;&#12540;&#12489;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#29694;&#22312;&#12398;&#31649;&#29702;&#32773;&#12450;&#12459;&#12454;&#12531;&#12488;&#12398;&#26032;&#35215;&#12497;&#12473;&#12527;&#12540;&#12489;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26032;&#35215;&#12497;&#12473;&#12527;&#12540;&#12489;&#12398;&#30906;&#35469;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#26032;&#35215;&#12497;&#12473;&#12527;&#12540;&#12489;&#12434;&#20877;&#24230;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref15" name="sthref15"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-accessadmintools.html">&#31649;&#29702;&#12484;&#12540;&#12523;&#12395;&#12450;&#12463;&#12475;&#12473;&#27177;&#12434;&#20184;&#19982;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-fileuserscreate.html">&#12518;&#12540;&#12470;&#12540;&#12434;&#12501;&#12449;&#12452;&#12523;&#12539;&#12524;&#12523;&#12512;&#12395;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-fileusersedit.html">&#12501;&#12449;&#12452;&#12523;&#12539;&#12524;&#12523;&#12512;&#12539;&#12518;&#12540;&#12470;&#12540;&#24773;&#22577;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-fileusersdelete.html">&#12501;&#12449;&#12452;&#12523;&#12539;&#12524;&#12523;&#12512;&#12363;&#12425;&#12518;&#12540;&#12470;&#12540;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-generaltab.html">DAS&#12398;&#19968;&#33324;&#24773;&#22577;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-logviewer.html">DAS&#12398;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-filter-logs.html">&#34920;&#31034;&#12373;&#12428;&#12383;&#12525;&#12464;&#12539;&#12524;&#12467;&#12540;&#12489;&#12434;&#12501;&#12451;&#12523;&#12479;&#12522;&#12531;&#12464;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-setadvanceappconfig.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#27083;&#25104;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-setadvancedomainattributes.html">&#12489;&#12513;&#12452;&#12531;&#23646;&#24615;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-collectdomainlogs.html">&#12489;&#12513;&#12452;&#12531;&#12539;&#12525;&#12464;&#12434;&#21454;&#38598;&#12362;&#12424;&#12403;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-systemproperties.html">&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#31649;&#29702;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appmonitoringdata.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-servermonitoringdata.html">&#12469;&#12540;&#12496;&#12540;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-resourcemonitoringdata.html">&#12522;&#12477;&#12540;&#12473;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
