<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-messagesecurityproviderconfignew" name="task-messagesecurityproviderconfignew"></a><a id="GHCOM00207" name="GHCOM00207"></a></p>

<h4><a id="sthref176" name="sthref176"></a>&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#27083;&#25104;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#26032;&#35215;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#27083;&#25104;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#27425;&#12398;&#12473;&#12486;&#12483;&#12503;&#12395;&#24467;&#12356;&#12414;&#12377;&#12290;</p>
<a id="sthref177" name="sthref177"></a>
<h5>&#38283;&#22987;&#21069;</h5>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;<code>server-config</code>&#27083;&#25104;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12398;&#20316;&#25104;&#12392;&#21066;&#38500;&#12399;&#23455;&#34892;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;<code>server-config</code>&#12391;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12427;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12399;&#12289;SOAP&#12392;HttpServlet&#12398;&#12415;&#12391;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;2&#12388;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12399;GlassFish Server&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#26178;&#12395;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12377;&#12391;&#12395;&#20316;&#25104;&#12373;&#12428;&#12390;&#12356;&#12427;&#12383;&#12417;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;<code>server-config</code>&#12398;&#12300;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12301;&#12506;&#12540;&#12472;&#12391;&#12399;&#12300;&#26032;&#35215;&#12301;&#12508;&#12479;&#12531;&#12364;&#12464;&#12524;&#12540;&#34920;&#31034;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#32232;&#38598;&#12377;&#12427;&#27083;&#25104;&#12398;&#35469;&#35388;&#12524;&#12452;&#12516;&#12540;&#21517;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#27083;&#25104;&#28168;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12399;SOAP&#12398;&#12415;&#12391;&#12377;&#12290;</p>
<p>&#12300;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12398;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12503;&#12525;&#12496;&#12452;&#12480;&#12301;&#12479;&#12502;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12503;&#12525;&#12496;&#12452;&#12480;&#27083;&#25104;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12503;&#12525;&#12496;&#12452;&#12480;&#27083;&#25104;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;&#26032;&#35215;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26032;&#35215;&#12503;&#12525;&#12496;&#12452;&#12480;&#27083;&#25104;&#12301;&#12506;&#12540;&#12472;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26032;&#35215;&#12503;&#12525;&#12496;&#12452;&#12480;&#27083;&#25104;&#12301;&#12506;&#12540;&#12472;&#12398;&#12300;&#12503;&#12525;&#12496;&#12452;&#12480;ID&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12503;&#12525;&#12496;&#12452;&#12480;&#27083;&#25104;&#12398;&#19968;&#24847;&#12398;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#12371;&#12398;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12399;&#12289;&#29305;&#23450;&#12398;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#35672;&#21029;&#12375;&#12394;&#12356;&#12377;&#12409;&#12390;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;&#21628;&#12403;&#20986;&#12373;&#12428;&#12414;&#12377;&#12290;&#12503;&#12525;&#12496;&#12452;&#12480;&#12364;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12289;&#12414;&#12383;&#12399;&#12381;&#12398;&#20001;&#26041;&#12391;&#12354;&#12427;&#12363;&#12393;&#12358;&#12363;&#12399;&#12289;&#12503;&#12525;&#12496;&#12452;&#12480;&#12539;&#12479;&#12452;&#12503;&#12395;&#12424;&#12387;&#12390;&#27770;&#12414;&#12426;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12503;&#12525;&#12496;&#12452;&#12480;&#12539;&#12479;&#12452;&#12503;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#12503;&#12525;&#12496;&#12452;&#12480;&#12398;&#12479;&#12452;&#12503;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#36984;&#25246;&#21487;&#33021;&#12394;&#20516;&#12399;&#27425;&#12398;&#12392;&#12362;&#12426;&#12391;&#12377;:</p>
<dl>
<dt><code>client</code></dt>
<dd>
<p>&#12503;&#12525;&#12496;&#12452;&#12480;&#12364;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#35469;&#35388;&#12503;&#12525;&#12496;&#12452;&#12480;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt><code>server</code></dt>
<dd>
<p>&#12503;&#12525;&#12496;&#12452;&#12480;&#12364;&#12469;&#12540;&#12496;&#12540;&#35469;&#35388;&#12503;&#12525;&#12496;&#12452;&#12480;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt><code>client-server</code></dt>
<dd>
<p>&#12503;&#12525;&#12496;&#12452;&#12480;&#12364;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#35469;&#35388;&#12503;&#12525;&#12496;&#12452;&#12480;&#12362;&#12424;&#12403;&#12469;&#12540;&#12496;&#12540;&#35469;&#35388;&#12503;&#12525;&#12496;&#12452;&#12480;&#12398;&#20001;&#26041;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
</li>
<li>
<p>&#12300;&#12463;&#12521;&#12473;&#21517;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12503;&#12525;&#12496;&#12452;&#12480;&#12398;Java&#23455;&#35013;&#12463;&#12521;&#12473;&#12398;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#35469;&#35388;&#12503;&#12525;&#12496;&#12452;&#12480;&#12399;<code>com.sun.enterprise.security.jauth.ClientAuthModule</code>&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12434;&#23455;&#35013;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12469;&#12540;&#12496;&#12540;&#20596;&#12503;&#12525;&#12496;&#12452;&#12480;&#12399;<code>com.sun.enterprise.security.jauth.ServerAuthModule</code>&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12434;&#23455;&#35013;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12399;&#12289;&#20001;&#26041;&#12398;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12434;&#23455;&#35013;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12522;&#12463;&#12456;&#12473;&#12488;&#12539;&#12509;&#12522;&#12471;&#12540;&#12301;&#38936;&#22495;&#12398;&#12300;&#35469;&#35388;&#20803;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#12522;&#12463;&#12456;&#12473;&#12488;&#12539;&#12509;&#12522;&#12471;&#12540;&#12391;&#24517;&#35201;&#12394;&#35469;&#35388;&#12398;&#12479;&#12452;&#12503;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12522;&#12463;&#12456;&#12473;&#12488;&#12539;&#12509;&#12522;&#12471;&#12540;&#12395;&#12424;&#12387;&#12390;&#12289;&#35469;&#35388;&#12503;&#12525;&#12496;&#12452;&#12480;&#12364;&#23455;&#34892;&#12377;&#12427;&#12522;&#12463;&#12456;&#12473;&#12488;&#20966;&#29702;&#12364;&#27770;&#12414;&#12426;&#12414;&#12377;&#12290;&#12522;&#12463;&#12456;&#12473;&#12488;&#12539;&#12509;&#12522;&#12471;&#12540;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#12377;&#12364;&#12289;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12392;&#12289;&#35469;&#35388;&#12503;&#12525;&#12496;&#12452;&#12480;&#12399;&#12522;&#12463;&#12456;&#12473;&#12488;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#35469;&#35388;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
<p>&#12522;&#12463;&#12456;&#12473;&#12488;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12524;&#12452;&#12516;&#12540;&#36865;&#20449;&#20803;&#35469;&#35388;(&#12518;&#12540;&#12470;&#12540;&#21517;&#12420;&#12497;&#12473;&#12527;&#12540;&#12489;&#12394;&#12393;)&#12434;&#25351;&#23450;&#12377;&#12427;&#12395;&#12399;&#12289;<code>sender</code>&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#12522;&#12463;&#12456;&#12473;&#12488;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#35469;&#35388;(&#12487;&#12472;&#12479;&#12523;&#32626;&#21517;&#12394;&#12393;)&#12434;&#25351;&#23450;&#12377;&#12427;&#12395;&#12399;&#12289;<code>content</code>&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#12522;&#12463;&#12456;&#12473;&#12488;&#12398;&#36865;&#20449;&#20803;&#12434;&#35469;&#35388;&#12375;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#31354;&#12398;&#12414;&#12414;&#12395;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#35469;&#35388;&#12479;&#12452;&#12503;&#12399;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;</p>
<p>SOAP&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12364;&#23455;&#34892;&#12377;&#12427;&#12450;&#12463;&#12471;&#12519;&#12531;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a href="ref-configreq-respolicy.html">&#12522;&#12463;&#12456;&#12473;&#12488;&#12362;&#12424;&#12403;&#12524;&#12473;&#12509;&#12531;&#12473;&#12539;&#12509;&#12522;&#12471;&#12540;&#27083;&#25104;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
<li>
<p>&#12300;&#35469;&#35388;&#20808;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#35469;&#35388;&#20808;&#12398;&#35469;&#35388;&#12364;&#12522;&#12463;&#12456;&#12473;&#12488;&#12539;&#12509;&#12522;&#12471;&#12540;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#35469;&#35388;&#12398;&#21069;&#12414;&#12383;&#12399;&#24460;&#12398;&#12393;&#12385;&#12425;&#12391;&#30330;&#29983;&#12377;&#12427;&#12363;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p><code>before-content</code>&#12414;&#12383;&#12399;<code>after-content</code>&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#12522;&#12463;&#12456;&#12473;&#12488;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#21463;&#20449;&#32773;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12524;&#12452;&#12516;&#12540;&#35469;&#35388;&#12434;&#36865;&#20449;&#20803;&#12395;&#23550;&#12375;&#12390;&#25351;&#23450;&#12375;&#12414;&#12377;(XML&#26263;&#21495;&#21270;&#12434;&#20351;&#29992;)&#12290;&#20516;&#12434;&#25351;&#23450;&#12375;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;<code>after-content</code>&#12364;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12509;&#12522;&#12471;&#12540;&#12399;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#36865;&#20449;&#32773;&#12395;&#25351;&#23450;&#12373;&#12428;&#12383;&#38918;&#24207;&#12395;&#12424;&#12427;&#12383;&#12417;&#12289;<code>after-content</code>&#12391;&#12399;&#12513;&#12483;&#12475;&#12540;&#12472;&#21463;&#20449;&#32773;&#12399;&#32626;&#21517;&#12398;&#26908;&#35388;&#21069;&#12395;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#24489;&#21495;&#21270;&#12377;&#12427;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12524;&#12473;&#12509;&#12531;&#12473;&#12539;&#12509;&#12522;&#12471;&#12540;&#12301;&#38936;&#22495;&#12398;&#12300;&#35469;&#35388;&#20803;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#12524;&#12473;&#12509;&#12531;&#12473;&#12539;&#12509;&#12522;&#12471;&#12540;&#12391;&#24517;&#35201;&#12394;&#35469;&#35388;&#12398;&#12479;&#12452;&#12503;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12524;&#12473;&#12509;&#12531;&#12473;&#12539;&#12509;&#12522;&#12471;&#12540;&#12395;&#12424;&#12387;&#12390;&#12289;&#35469;&#35388;&#12503;&#12525;&#12496;&#12452;&#12480;&#12364;&#23455;&#34892;&#12377;&#12427;&#12524;&#12473;&#12509;&#12531;&#12473;&#20966;&#29702;&#12364;&#27770;&#12414;&#12426;&#12414;&#12377;&#12290;&#12524;&#12473;&#12509;&#12531;&#12473;&#12539;&#12509;&#12522;&#12471;&#12540;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#12377;&#12364;&#12289;&#12371;&#12428;&#12425;&#12434;&#25351;&#23450;&#12375;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12524;&#12473;&#12509;&#12531;&#12473;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12395;&#35469;&#35388;&#12364;&#36969;&#29992;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
<p>&#12524;&#12473;&#12509;&#12531;&#12473;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12524;&#12452;&#12516;&#12540;&#36865;&#20449;&#20803;&#35469;&#35388;(&#12518;&#12540;&#12470;&#12540;&#21517;&#12420;&#12497;&#12473;&#12527;&#12540;&#12489;&#12394;&#12393;)&#12434;&#25351;&#23450;&#12377;&#12427;&#12395;&#12399;&#12289;<code>sender</code>&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#12524;&#12473;&#12509;&#12531;&#12473;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#35469;&#35388;(&#12487;&#12472;&#12479;&#12523;&#32626;&#21517;&#12394;&#12393;)&#12434;&#25351;&#23450;&#12377;&#12427;&#12395;&#12399;&#12289;<code>content</code>&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#12524;&#12473;&#12509;&#12531;&#12473;&#12398;&#36865;&#20449;&#20803;&#12434;&#35469;&#35388;&#12375;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#31354;&#12398;&#12414;&#12414;&#12395;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#35469;&#35388;&#12479;&#12452;&#12503;&#12399;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;</p>
<p>SOAP&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12364;&#23455;&#34892;&#12377;&#12427;&#12450;&#12463;&#12471;&#12519;&#12531;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a href="ref-configreq-respolicy.html">&#12522;&#12463;&#12456;&#12473;&#12488;&#12362;&#12424;&#12403;&#12524;&#12473;&#12509;&#12531;&#12473;&#12539;&#12509;&#12522;&#12471;&#12540;&#27083;&#25104;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
<li>
<p>&#12300;&#35469;&#35388;&#20808;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#35469;&#35388;&#20808;&#12398;&#35469;&#35388;&#12364;&#12524;&#12473;&#12509;&#12531;&#12473;&#12539;&#12509;&#12522;&#12471;&#12540;&#12398;&#12467;&#12531;&#12486;&#12531;&#12484;&#35469;&#35388;&#12398;&#21069;&#12414;&#12383;&#12399;&#24460;&#12398;&#12393;&#12385;&#12425;&#12391;&#30330;&#29983;&#12377;&#12427;&#12363;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p><code>before-content</code>&#12414;&#12383;&#12399;<code>after-content</code>&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#36865;&#20449;&#20803;&#12395;&#23550;&#12377;&#12427;&#12524;&#12473;&#12509;&#12531;&#12473;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#21463;&#20449;&#32773;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12524;&#12452;&#12516;&#12540;&#35469;&#35388;&#35201;&#20214;&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;(XML&#26263;&#21495;&#21270;&#12434;&#20351;&#29992;)&#12290;&#20516;&#12434;&#25351;&#23450;&#12375;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;<code>after-content</code>&#12364;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12509;&#12522;&#12471;&#12540;&#12399;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#36865;&#20449;&#32773;&#12395;&#25351;&#23450;&#12373;&#12428;&#12383;&#38918;&#24207;&#12395;&#12424;&#12427;&#12383;&#12417;&#12289;<code>after-content</code>&#12391;&#12399;&#12513;&#12483;&#12475;&#12540;&#12472;&#21463;&#20449;&#32773;&#12399;&#32626;&#21517;&#12398;&#26908;&#35388;&#21069;&#12395;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#24489;&#21495;&#21270;&#12377;&#12427;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#12289;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#34920;&#31034;&#12373;&#12428;&#12427;&#31354;&#30333;&#34892;&#12391;&#12289;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#21517;&#12434;&#20837;&#21147;&#12375;&#12289;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12503;&#12525;&#12496;&#12452;&#12480;&#27083;&#25104;&#12391;&#20351;&#29992;&#21487;&#33021;&#12394;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a href="ref-messagesecurityproviderconfigprops.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#27083;&#25104;&#12395;&#22266;&#26377;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
<li>
<p>&#12300;OK&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref178" name="sthref178"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12391;&#20351;&#29992;&#12373;&#12428;&#12427;GlassFish Server&#27231;&#33021;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#27083;&#25104;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#27083;&#25104;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
