<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jvmsettings" name="task-jvmsettings"></a></p>
<a name="BEGIN" id="BEGIN"></a>



<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#22793;&#26356;&#12377;&#12427;&#27083;&#25104;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;JVM&#35373;&#23450;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;JVM&#12398;&#20840;&#33324;&#30340;&#12394;&#35373;&#23450;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12398;&#19979;&#12391;&#12289;&#12300;JVM&#35373;&#23450;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;JVM&#12398;&#20840;&#33324;&#30340;&#12394;&#35373;&#23450;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;JVM&#12398;&#20840;&#33324;&#30340;&#12394;&#35373;&#23450;&#12301;&#12506;&#12540;&#12472;&#12398;&#12300;Java&#12507;&#12540;&#12512;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;Java SE&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12398;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>GlassFish Server&#12399;Java SE&#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;&#12395;&#20381;&#23384;&#12375;&#12414;&#12377;&#12290;&#25351;&#23450;&#12377;&#12427;Java SE&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12364;&#12371;&#12398;&#12522;&#12522;&#12540;&#12473;&#12391;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12377;&#12427;&#12395;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRLN"><i>Oracle GlassFish Server&#12522;&#12522;&#12540;&#12473;&#12539;&#12494;&#12540;&#12488;</i></a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#23384;&#22312;&#12375;&#12394;&#12356;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#21517;&#12434;&#20837;&#21147;&#12375;&#12383;&#12426;&#12289;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398;Java SE&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12434;&#25351;&#23450;&#12375;&#12383;&#22580;&#21512;&#12289;GlassFish Server&#12399;&#36215;&#21205;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p>&#12300;Javac&#12458;&#12503;&#12471;&#12519;&#12531;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;Java&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#35328;&#35486;&#12467;&#12531;&#12497;&#12452;&#12521;&#12398;&#12467;&#12510;&#12531;&#12489;&#12539;&#12521;&#12452;&#12531;&#12539;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>GlassFish Server&#12399;&#12289;Enterprise JavaBeans (EJB)&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12487;&#12503;&#12525;&#12452;&#26178;&#12395;&#12289;&#12371;&#12398;&#12467;&#12531;&#12497;&#12452;&#12521;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12487;&#12496;&#12483;&#12464;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;JPDA(Java Platform Debugger Architecture)&#12434;&#20351;&#29992;&#12377;&#12427;&#12487;&#12496;&#12483;&#12464;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>JPDA&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#38283;&#30330;&#32773;&#12395;&#12424;&#12387;&#12390;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#35443;&#32048;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDVG"><i>Oracle GlassFish Server&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#38283;&#30330;&#12460;&#12452;&#12489;</i></a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
<li>
<p>&#12300;&#12487;&#12496;&#12483;&#12464;&#12539;&#12458;&#12503;&#12471;&#12519;&#12531;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;JVM&#12395;&#21463;&#12369;&#28193;&#12377;JPDA&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#12289;&#21069;&#36848;&#12398;&#12473;&#12486;&#12483;&#12503;&#12391;&#12487;&#12496;&#12483;&#12464;&#12434;&#26377;&#21177;&#12392;&#12375;&#12383;&#22580;&#21512;&#12398;&#12415;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;RMI&#12467;&#12531;&#12497;&#12452;&#12523;&#12539;&#12458;&#12503;&#12471;&#12519;&#12531;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;<code>rmic</code>&#12467;&#12531;&#12497;&#12452;&#12521;&#12398;&#12467;&#12510;&#12531;&#12489;&#12539;&#12521;&#12452;&#12531;&#12539;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>EJB&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12487;&#12503;&#12525;&#12452;&#26178;&#12395;GlassFish Server&#12399;<code>rmic</code>&#12467;&#12531;&#12497;&#12452;&#12521;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12496;&#12452;&#12488;&#12467;&#12540;&#12489;&#12539;&#12503;&#12522;&#12503;&#12525;&#12475;&#12483;&#12469;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12463;&#12521;&#12473;&#21517;&#12398;&#12522;&#12473;&#12488;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#35079;&#25968;&#12398;&#12463;&#12521;&#12473;&#21517;&#12434;&#21306;&#20999;&#12427;&#12395;&#12399;&#12289;&#12459;&#12531;&#12510;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#21508;&#12463;&#12521;&#12473;&#12399;&#12289;com.sun.appserv.BytecodePreprocessor&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12434;&#23455;&#35013;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12463;&#12521;&#12473;&#12399;&#25351;&#23450;&#12398;&#38918;&#24207;&#12391;&#12467;&#12540;&#12523;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#12289;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#34920;&#31034;&#12373;&#12428;&#12427;&#31354;&#30333;&#34892;&#12391;&#12289;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#21517;&#12434;&#20837;&#21147;&#12375;&#12289;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>GlassFish Server&#12399;JVM&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#23450;&#32681;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#12498;&#12531;&#12488;:</b></p>
&#12487;&#12501;&#12457;&#12523;&#12488;&#35373;&#23450;&#12395;&#36820;&#12377;&#12395;&#12399;&#12289;&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12489;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12289;&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;<br />
<hr>

</li>
<li>
<p>&#12469;&#12540;&#12496;&#12540;&#12434;&#20877;&#36215;&#21205;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<p><a id="sthref107" name="sthref107"></a></p>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-jvmpathsettings.html">JVM&#12497;&#12473;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jvmoptions.html">JVM&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-securitymanagerdisable.html">&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12493;&#12540;&#12472;&#12515;&#12434;&#28961;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jvmprofilersettings.html">JVM&#12503;&#12525;&#12501;&#12449;&#12452;&#12521;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
