<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-usedefaultauditmod" name="task-usedefaultauditmod"></a></p>

<h4><a id="sthref160" name="sthref160"></a>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#30435;&#26619;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#20351;&#29992;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p><code>default</code>&#30435;&#26619;&#12514;&#12472;&#12517;&#12540;&#12523;&#12399;&#12289;&#12469;&#12540;&#12496;&#12540;&#12539;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12408;&#35469;&#35388;&#12522;&#12463;&#12456;&#12473;&#12488;&#12362;&#12424;&#12403;&#25215;&#35469;&#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#35352;&#37682;&#12375;&#12414;&#12377;&#12290;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#22580;&#25152;&#12434;&#22793;&#26356;&#12377;&#12427;&#26041;&#27861;&#12399;&#12289;<a href="task-eelogging.html">&#20840;&#33324;&#30340;&#12394;&#12525;&#12462;&#12531;&#12464;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>&#35469;&#35388;&#12525;&#12464;&#12539;&#12456;&#12531;&#12488;&#12522;&#12395;&#12399;&#12289;&#27425;&#12398;&#24773;&#22577;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#35469;&#35388;&#12377;&#12427;&#12518;&#12540;&#12470;&#12540;&#12398;&#21517;&#21069;&#12290;</p>
</li>
<li>
<p>&#12450;&#12463;&#12475;&#12473;&#12539;&#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#20966;&#29702;&#12377;&#12427;&#12524;&#12523;&#12512;&#12290;</p>
</li>
<li>
<p>&#12522;&#12463;&#12456;&#12473;&#12488;&#12373;&#12428;&#12383;Web&#12514;&#12472;&#12517;&#12540;&#12523;URI&#12414;&#12383;&#12399;EJB&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12290;</p>
</li>
<li>
<p>&#12522;&#12463;&#12456;&#12473;&#12488;&#12398;&#25104;&#21151;&#12414;&#12383;&#12399;&#22833;&#25943;&#12290;</p>
</li>
</ul>
<p>&#30435;&#26619;&#12525;&#12462;&#12531;&#12464;&#12364;&#26377;&#21177;&#12363;&#12393;&#12358;&#12363;&#12395;&#12363;&#12363;&#12431;&#12425;&#12378;&#12289;GlassFish Server&#12399;&#12377;&#12409;&#12390;&#12398;&#25298;&#21542;&#35469;&#35388;&#12452;&#12505;&#12531;&#12488;&#12434;&#35352;&#37682;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#25215;&#35469;&#12525;&#12464;&#12539;&#12456;&#12531;&#12488;&#12522;&#12395;&#12399;&#12289;&#27425;&#12398;&#24773;&#22577;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#25215;&#35469;&#12373;&#12428;&#12383;&#12518;&#12540;&#12470;&#12540;&#12398;&#21517;&#21069;(&#12354;&#12427;&#22580;&#21512;)&#12290;</p>
</li>
<li>
<p>&#12522;&#12463;&#12456;&#12473;&#12488;&#12373;&#12428;&#12383;Web URI&#12414;&#12383;&#12399;EJB&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12290;</p>
</li>
<li>
<p>&#12522;&#12463;&#12456;&#12473;&#12488;&#12398;&#25104;&#21151;&#12414;&#12383;&#12399;&#22833;&#25943;&#12290;</p>
</li>
</ul>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#27083;&#25104;&#12377;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;:</p>
<ul>
<li>
<p>&#29305;&#23450;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12381;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#27083;&#25104;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;<code>server</code>&#12398;&#22580;&#21512;&#12399;&#12289;<code>server-config</code>&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12377;&#12409;&#12390;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;<code>default-config</code>&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12398;&#19979;&#12391;&#12289;&#12300;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#30435;&#26619;&#12514;&#12472;&#12517;&#12540;&#12523;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;<code>default</code>&#12392;&#12356;&#12358;&#21517;&#21069;&#12398;&#30435;&#26619;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref161" name="sthref161"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-auditmodulenew.html">&#30435;&#26619;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-auditmoduleedit.html">&#30435;&#26619;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-auditmoduledelete.html">&#30435;&#26619;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-enabledisableauditmod.html">&#30435;&#26619;&#12525;&#12462;&#12531;&#12464;&#12434;&#26377;&#21177;&#12414;&#12383;&#12399;&#28961;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-setactiveauditmod.html">&#12450;&#12463;&#12486;&#12451;&#12502;&#12394;&#30435;&#26619;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
