<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-securitysettings" name="task-securitysettings"></a></p>

<h4><a id="sthref78" name="sthref78"></a><a id="sthref79" name="sthref79"></a>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12391;&#12399;&#12289;&#12471;&#12473;&#12486;&#12512;&#20840;&#20307;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#35373;&#23450;&#12434;&#27096;&#12293;&#12395;&#35373;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12398;&#19979;&#12391;&#12289;&#12300;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#35373;&#23450;&#12301;&#12434;&#27083;&#25104;&#12377;&#12427;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12414;&#12383;&#12399;&#12463;&#12521;&#12473;&#12479;&#12398;&#27083;&#25104;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#27083;&#25104;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#27083;&#25104;&#12301;&#12506;&#12540;&#12472;&#12391;&#12300;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#36984;&#25246;&#12375;&#12383;&#27083;&#25104;&#12479;&#12540;&#12466;&#12483;&#12488;&#12398;&#12300;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#35373;&#23450;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12493;&#12540;&#12472;&#12515;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12493;&#12540;&#12472;&#12515;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12392;&#12289;JVM&#12458;&#12503;&#12471;&#12519;&#12531;&#12398;<code>-Djava.security.manager</code>&#12364;GlassFish Server&#12398;JVM&#35373;&#23450;&#12395;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290;<a href="task-jvmoptions.html">JVM&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12371;&#12398;&#22793;&#26356;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;&#12469;&#12540;&#12496;&#12540;&#12434;&#20877;&#36215;&#21205;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<p>&#12377;&#12409;&#12390;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12388;&#12356;&#12390;&#27491;&#12375;&#12356;&#27177;&#38480;&#12434;&#19982;&#12360;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12493;&#12540;&#12472;&#12515;&#12434;&#28961;&#21177;&#12395;&#12377;&#12427;&#12392;&#12289;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12434;&#21521;&#19978;&#12373;&#12379;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#30435;&#26619;&#12525;&#12462;&#12531;&#12464;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#30435;&#26619;&#12525;&#12462;&#12531;&#12464;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12392;&#12289;&#12469;&#12540;&#12496;&#12540;&#12399;&#12300;&#30435;&#26619;&#12514;&#12472;&#12517;&#12540;&#12523;&#12301;&#12522;&#12473;&#12488;&#12391;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12427;&#12377;&#12409;&#12390;&#12398;&#30435;&#26619;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#12525;&#12540;&#12489;&#12375;&#12289;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#28961;&#21177;&#12395;&#12377;&#12427;&#12392;&#12289;&#12469;&#12540;&#12496;&#12540;&#12399;&#30435;&#26619;&#12514;&#12472;&#12517;&#12540;&#12523;&#12395;&#12450;&#12463;&#12475;&#12473;&#12375;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12524;&#12523;&#12512;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#12469;&#12540;&#12496;&#12540;&#12364;&#35469;&#35388;&#12395;&#20351;&#29992;&#12377;&#12427;&#12450;&#12463;&#12486;&#12451;&#12502;&#12394;&#12524;&#12523;&#12512;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#35352;&#36848;&#23376;&#12395;&#12424;&#12387;&#12390;&#21029;&#12398;&#12524;&#12523;&#12512;&#12364;&#25351;&#23450;&#12373;&#12428;&#12394;&#12356;&#12363;&#12366;&#12426;&#12289;&#12371;&#12398;&#12524;&#12523;&#12512;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#27083;&#25104;&#12373;&#12428;&#12390;&#12356;&#12427;&#12377;&#12409;&#12390;&#12398;&#12524;&#12523;&#12512;&#12364;&#12371;&#12398;&#12522;&#12473;&#12488;&#12395;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>file</code>&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12503;&#12522;&#12531;&#12471;&#12497;&#12523;&#24773;&#22577;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<ol type="a">
<li>
<p>&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12503;&#12522;&#12531;&#12471;&#12497;&#12523;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12518;&#12540;&#12470;&#12540;&#21517;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#20182;&#12398;&#12503;&#12522;&#12531;&#12471;&#12497;&#12523;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12392;&#12365;&#12289;&#12469;&#12540;&#12496;&#12540;&#12399;&#12371;&#12398;&#12518;&#12540;&#12470;&#12540;&#21517;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12503;&#12522;&#12531;&#12471;&#12497;&#12523;&#12398;&#12497;&#12473;&#12527;&#12540;&#12489;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12503;&#12522;&#12531;&#12471;&#12497;&#12523;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12391;&#25351;&#23450;&#12375;&#12383;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12503;&#12522;&#12531;&#12471;&#12497;&#12523;&#12398;&#12497;&#12473;&#12527;&#12540;&#12489;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<p>&#36890;&#24120;&#12398;&#12469;&#12540;&#12496;&#12540;&#12398;&#25805;&#20316;&#12395;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12503;&#12522;&#12531;&#12471;&#12497;&#12523;&#12399;&#24517;&#35201;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p>&#12300;JACC&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#27083;&#25104;&#12375;&#12383;JACC&#12503;&#12525;&#12496;&#12452;&#12480;&#12398;&#21517;&#21069;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#36984;&#25246;&#12399;&#12289;<code>default</code>&#12362;&#12424;&#12403;<code>simple</code>&#12391;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;<code>default</code>&#12391;&#12377;&#12290;&#26032;&#35215;JACC&#12503;&#12525;&#12496;&#12452;&#12480;&#12398;&#20316;&#25104;&#26041;&#27861;&#12399;&#12289;***&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
<li>
<p>&#12300;&#30435;&#26619;&#12514;&#12472;&#12517;&#12540;&#12523;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#30435;&#26619;&#12525;&#12462;&#12531;&#12464;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12395;&#30435;&#26619;&#12469;&#12502;&#12471;&#12473;&#12486;&#12512;&#12364;&#20351;&#29992;&#12377;&#12427;&#30435;&#26619;&#12503;&#12525;&#12496;&#12452;&#12480;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12289;&#12469;&#12540;&#12496;&#12540;&#12399;<code>default</code>&#12392;&#12356;&#12358;&#21517;&#21069;&#12398;&#30435;&#26619;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#26032;&#35215;&#30435;&#26619;&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#20316;&#25104;&#26041;&#27861;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a href="task-auditmodulenew.html">&#30435;&#26619;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
<li>
<p>&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12523;&#12539;&#12510;&#12483;&#12500;&#12531;&#12464;&#12398;&#12503;&#12522;&#12531;&#12471;&#12497;&#12523;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12523;&#12539;&#12510;&#12483;&#12500;&#12531;&#12464;&#12398;&#12503;&#12522;&#12531;&#12471;&#12497;&#12523;&#12434;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#22266;&#26377;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12364;&#12394;&#12356;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#36969;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12523;&#12539;&#12510;&#12483;&#12500;&#12531;&#12464;&#12398;&#12503;&#12522;&#12531;&#12471;&#12497;&#12523;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12399;&#12289;&#12300;&#12510;&#12483;&#12500;&#12531;&#12464;&#12373;&#12428;&#12383;&#12503;&#12522;&#12531;&#12471;&#12497;&#12523;&#12398;&#12463;&#12521;&#12473;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12523;&#12539;&#12510;&#12483;&#12500;&#12531;&#12464;&#12398;&#12503;&#12522;&#12531;&#12471;&#12497;&#12523;&#12391;&#20351;&#29992;&#12377;&#12427;&#12289;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;&#12375;&#12383;<code>java.security.Principal</code>&#23455;&#35013;&#12463;&#12521;&#12473;&#12398;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#12289;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#26377;&#21177;&#12394;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12524;&#12523;&#12512;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12391;&#36984;&#25246;&#12375;&#12383;&#12524;&#12523;&#12512;&#12398;&#12479;&#12452;&#12503;&#12395;&#12424;&#12387;&#12390;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;&#27083;&#25104;&#12377;&#12427;&#12524;&#12523;&#12512;&#12539;&#12479;&#12452;&#12503;&#12395;&#21512;&#12379;&#12289;&#27425;&#12398;&#12522;&#12473;&#12488;&#20869;&#12398;&#22949;&#24403;&#12394;&#12456;&#12531;&#12488;&#12522;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<ul>
<li>
<p><a href="ref-editfile-adminrealm.html"><code>FileRealm</code>&#12463;&#12521;&#12473;&#12395;&#22266;&#26377;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;</a></p>
</li>
<li>
<p><a href="ref-editcertrealm.html"><code>CertificateRealm</code>&#12463;&#12521;&#12473;&#12395;&#22266;&#26377;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;</a></p>
</li>
<li>
<p><a href="ref-editjdbcrealm.html"><code>JDBCRealm</code>&#12463;&#12521;&#12473;&#12395;&#22266;&#26377;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;</a></p>
</li>
<li>
<p><a href="ref-ldaprealmprop.html"><code>LDAPRealm</code>&#12463;&#12521;&#12473;&#12395;&#22266;&#26377;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;</a></p>
</li>
<li>
<p><a href="ref-solarisrealmprop.html"><code>SolarisRealm</code>&#12463;&#12521;&#12473;&#12395;&#22266;&#26377;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;</a></p>
</li>
<li>
<p><a href="ref-pamrealmprop.html"><code>PamRealm</code>&#12463;&#12521;&#12473;&#12395;&#22266;&#26377;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;</a></p>
</li>
</ul>
<ul>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#34920;&#31034;&#12373;&#12428;&#12427;&#31354;&#30333;&#34892;&#12391;&#12289;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#21517;&#12434;&#20837;&#21147;&#12375;&#12289;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;&#12289;&#12381;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#32232;&#38598;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;&#12289;&#21066;&#38500;&#12377;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12398;&#24038;&#20596;&#12395;&#12354;&#12427;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21066;&#38500;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="GHCOM280" name="GHCOM280"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-accessadmintools.html">&#31649;&#29702;&#12484;&#12540;&#12523;&#12395;&#12450;&#12463;&#12475;&#12473;&#27177;&#12434;&#20184;&#19982;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-changeadminpasswd.html">&#31649;&#29702;&#12524;&#12523;&#12512;&#12398;&#12518;&#12540;&#12470;&#12540;&#12398;&#12497;&#12473;&#12527;&#12540;&#12489;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
