<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-filter-logs" name="task-filter-logs"></a><a id="GHCOM00148" name="GHCOM00148"></a></p>

<h4>&#34920;&#31034;&#12373;&#12428;&#12383;&#12525;&#12464;&#12539;&#12524;&#12467;&#12540;&#12489;&#12434;&#12501;&#12451;&#12523;&#12479;&#12522;&#12531;&#12464;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a><a id="sthref26" name="sthref26"></a>
<h5>&#38283;&#22987;&#21069;</h5>
<p>&#12489;&#12513;&#12452;&#12531;&#31649;&#29702;&#12469;&#12540;&#12496;&#12540;(DAS)&#12289;&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12289;&#12414;&#12383;&#12399;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12364;&#34920;&#31034;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#35443;&#32048;&#12399;&#12289;&#27425;&#12398;&#38917;&#30446;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<ul>
<li>
<p><a href="task-logviewer.html">DAS&#12398;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="../../../cluster/en/help/task-view-logs-clustered-instance.html">&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="../../../cluster/en/help/task-view-logs-standalone-instance.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<ol>
<li>
<p>&#12300;&#26908;&#32034;&#22522;&#28310;&#12301;&#38936;&#22495;&#12391;&#12289;&#12467;&#12531;&#12486;&#12531;&#12484;&#12289;&#26399;&#38291;&#12289;&#12362;&#12424;&#12403;&#12525;&#12464;&#12539;&#12524;&#12505;&#12523;&#12391;&#12524;&#12467;&#12540;&#12489;&#12434;&#12501;&#12451;&#12523;&#12479;&#12522;&#12531;&#12464;&#12375;&#12414;&#12377;&#12290;</p>
<ol type="a">
<li>
<p>&#29305;&#23450;&#12398;&#12486;&#12461;&#12473;&#12488;&#12364;&#21547;&#12414;&#12428;&#12427;&#12524;&#12467;&#12540;&#12489;&#12398;&#12415;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12486;&#12461;&#12473;&#12488;&#26908;&#32034;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12381;&#12398;&#12486;&#12461;&#12473;&#12488;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#26908;&#32034;&#12391;&#12399;&#12289;&#22823;&#25991;&#23383;&#12392;&#23567;&#25991;&#23383;&#12364;&#21306;&#21029;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12525;&#12464;&#12539;&#12524;&#12467;&#12540;&#12489;&#12434;&#34920;&#31034;&#12377;&#12427;&#26399;&#38291;&#12434;&#36984;&#25246;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12479;&#12452;&#12512;&#12473;&#12479;&#12531;&#12503;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#26368;&#26032;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#26368;&#26032;&#12301;(&#12487;&#12501;&#12457;&#12523;&#12488;)&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#29305;&#23450;&#26399;&#38291;&#20869;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#12415;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#29305;&#23450;&#31684;&#22258;&#12301;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#34920;&#31034;&#12373;&#12428;&#12427;&#12300;&#38283;&#22987;&#12301;&#12392;&#12300;&#32066;&#20102;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#26085;&#20184;&#12392;&#26178;&#38291;&#12398;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26085;&#20184;&#12301;&#20516;&#12399;&#27425;&#12398;&#26360;&#24335;&#12391;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<pre>
<i>MM</i>/<i>DD</i>/<i>YY</i>
</pre>
<p><code><i>MM</i></code>&#12399;&#12289;&#26376;&#12434;&#31034;&#12377;1&#12363;&#12425;12&#12398;&#31684;&#22258;&#12398;&#25972;&#25968;(&#12383;&#12392;&#12360;&#12400;1&#26376;&#12399;1&#12289;10&#26376;&#12399;10)&#12391;&#12377;&#12290;<code><i>DD</i></code>&#12399;&#12289;&#26085;&#12434;&#31034;&#12377;1&#12363;&#12425;31&#12398;&#31684;&#22258;&#12398;&#25972;&#25968;&#12391;&#12377;&#12290;<code><i>YY</i></code>&#12399;&#12289;&#24180;&#12398;&#26368;&#24460;&#12398;2&#26689;(&#12383;&#12392;&#12360;&#12400;&#12289;2011&#24180;&#12399;11)&#12391;&#12377;&#12290;</p>
<p>&#12383;&#12392;&#12360;&#12400;&#12289;2011&#24180;2&#26376;1&#26085;&#12434;&#25351;&#23450;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#26085;&#20184;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;<code>2/1/11</code>&#12392;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26178;&#38291;&#12301;&#20516;&#12399;&#27425;&#12398;&#26360;&#24335;&#12391;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<pre>
<i>hh</i>:<i>mm</i>:<i>ss</i>.<i>SSS</i>
</pre>
<p><code><i>hh</i></code>&#12399;&#12289;&#26178;&#38291;&#12434;&#31034;&#12377;0&#12363;&#12425;23&#12398;&#31684;&#22258;&#12398;&#25972;&#25968;&#12391;&#12377;&#12290;&#21320;&#24460;&#12398;&#26178;&#38291;&#12398;&#22580;&#21512;&#12399;&#12289;12&#12363;&#12425;23&#12398;&#31684;&#22258;&#12398;&#25972;&#25968;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;(&#12383;&#12392;&#12360;&#12400;&#12289;&#21320;&#24460;2&#26178;&#12434;&#34920;&#12377;&#12395;&#12399;14)&#12290;<code><i>mm</i></code>&#12399;&#12289;&#27598;&#26178;&#12385;&#12423;&#12358;&#12393;&#12363;&#12425;&#32076;&#36942;&#12375;&#12383;&#20998;&#25968;&#12434;&#31034;&#12377;0&#12363;&#12425;59&#12398;&#31684;&#22258;&#12398;&#25972;&#25968;&#12391;&#12377;&#12290;<code><i>ss</i></code>&#12399;&#12289;&#31186;&#25968;&#12434;&#31034;&#12377;0&#12363;&#12425;59&#12398;&#31684;&#22258;&#12398;&#25972;&#25968;&#12391;&#12377;&#12290;<code><i>SSS</i></code>&#12399;&#12289;&#12511;&#12522;&#31186;&#25968;&#12434;&#31034;&#12377;000&#12363;&#12425;999&#12398;&#31684;&#22258;&#12398;3&#26689;&#12398;&#25972;&#25968;&#12391;&#12289;&#24517;&#35201;&#12395;&#24540;&#12376;&#12390;&#20808;&#38957;&#12395;&#12476;&#12525;(0)&#12434;&#22475;&#12417;&#12414;&#12377;&#12290;</p>
<p>&#12383;&#12392;&#12360;&#12400;&#12289;&#21320;&#24460;5&#26178;10&#20998;&#12434;&#25351;&#23450;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#26178;&#38291;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;<code>17:10:00.000</code>&#12392;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#38283;&#22987;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12398;&#20516;&#12364;&#12300;&#32066;&#20102;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12398;&#20516;&#12424;&#12426;&#12418;&#36933;&#12356;&#22580;&#21512;&#12399;&#12289;&#12456;&#12521;&#12540;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#12525;&#12464;&#12539;&#12524;&#12505;&#12523;&#12391;&#12501;&#12451;&#12523;&#12479;&#12522;&#12531;&#12464;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#34920;&#31034;&#12377;&#12427;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#30906;&#23455;&#12395;&#12469;&#12540;&#12496;&#12540;&#12539;&#12525;&#12464;&#12395;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;&#12289;&#26368;&#21021;&#12395;&#12300;&#12514;&#12472;&#12517;&#12540;&#12523;&#12539;&#12525;&#12464;&#12539;&#12524;&#12505;&#12523;&#12301;&#12506;&#12540;&#12472;&#12391;&#36969;&#20999;&#12394;&#12525;&#12464;&#12539;&#12524;&#12505;&#12523;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#35443;&#32048;&#12399;&#12289;<a href="task-eelogginglevels.html">&#12525;&#12464;&#12539;&#12524;&#12505;&#12523;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>&#12525;&#12464;&#12539;&#12524;&#12505;&#12523;&#12391;&#12525;&#12464;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#12501;&#12451;&#12523;&#12479;&#12522;&#12531;&#12464;&#12377;&#12427;&#12371;&#12392;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#25351;&#23450;&#12375;&#12383;&#12501;&#12451;&#12523;&#12479;&#22522;&#28310;&#12392;&#19968;&#33268;&#12377;&#12427;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#12415;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12375;&#12363;&#12375;&#12289;&#12371;&#12398;&#12501;&#12451;&#12523;&#12479;&#12522;&#12531;&#12464;&#12399;&#12289;&#12393;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#12469;&#12540;&#12496;&#12540;&#12539;&#12525;&#12464;&#12395;&#35352;&#37682;&#12373;&#12428;&#12427;&#12363;&#12395;&#12399;&#24433;&#38911;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
<ol>
<li>
<p>&#12300;&#12525;&#12464;&#12539;&#12524;&#12505;&#12523;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#12525;&#12464;&#12539;&#12524;&#12505;&#12523;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#36984;&#25246;&#12375;&#12383;&#12524;&#12505;&#12523;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#12415;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12424;&#12426;&#37325;&#24230;&#12398;&#39640;&#12356;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#12371;&#12428;&#20197;&#19978;&#21547;&#12417;&#12394;&#12356;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12469;&#12540;&#12496;&#12540;&#12539;&#12525;&#12464;&#20869;&#12398;&#12289;&#37325;&#24230;&#12364;&#12289;&#36984;&#25246;&#12375;&#12383;&#12525;&#12464;&#12539;&#12524;&#12505;&#12523;&#20197;&#19978;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#12377;&#12409;&#12390;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
</ol>
</li>
</ol>
</li>
<li>
<p>&#12300;&#35443;&#32048;&#26908;&#32034;&#12301;&#38936;&#22495;&#12391;&#12289;&#12525;&#12460;&#12540;&#12398;&#21517;&#21069;&#31354;&#38291;&#12391;&#12524;&#12467;&#12540;&#12489;&#12434;&#12501;&#12451;&#12523;&#12479;&#12522;&#12531;&#12464;&#12375;&#12289;&#34920;&#31034;&#12373;&#12428;&#12427;&#24773;&#22577;&#12398;&#37327;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<ol type="a">
<li>
<p>&#12300;&#35443;&#32048;&#26908;&#32034;&#12301;&#12522;&#12531;&#12463;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#35443;&#32048;&#26908;&#32034;&#12301;&#38936;&#22495;&#12364;&#12300;&#12525;&#12464;&#12539;&#12499;&#12517;&#12540;&#12450;&#12301;&#12454;&#12451;&#12531;&#12489;&#12454;&#12395;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12514;&#12472;&#12517;&#12540;&#12523;&#12391;&#12501;&#12451;&#12523;&#12479;&#12522;&#12531;&#12464;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12525;&#12460;&#12540;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#21517;&#21069;&#31354;&#38291;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>Shift-click&#12414;&#12383;&#12399;Control-click&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#35079;&#25968;&#12398;&#21517;&#21069;&#31354;&#38291;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#39640;&#12356;&#12524;&#12505;&#12523;&#12398;&#21517;&#21069;&#31354;&#38291;&#12434;1&#12388;&#36984;&#12406;&#12392;&#12289;&#12381;&#12398;&#19979;&#12398;&#12377;&#12409;&#12390;&#12398;&#21517;&#21069;&#31354;&#38291;&#12364;&#36984;&#25246;&#12373;&#12428;&#12414;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;<code>javax.enterprise.system</code>&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12381;&#12398;&#21517;&#21069;&#31354;&#38291;&#12398;&#19979;&#12395;&#12354;&#12427;&#12377;&#12409;&#12390;&#12398;&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#12525;&#12460;&#12540;(<code>javax.enterprise.system.core</code>&#12289;<code>javax.enterprise.system.tools.admin</code>&#12394;&#12393;)&#12418;&#36984;&#25246;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#29305;&#23450;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12525;&#12460;&#12540;&#12363;&#12425;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12459;&#12473;&#12479;&#12512;&#12539;&#12525;&#12460;&#12540;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12391;&#20491;&#21029;&#12398;&#34892;&#12395;&#21508;&#12525;&#12460;&#12540;&#12398;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#35079;&#25968;&#12398;&#12514;&#12472;&#12517;&#12540;&#12523;&#12364;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;&#20219;&#24847;&#12398;&#12514;&#12472;&#12517;&#12540;&#12523;&#12414;&#12383;&#12399;&#12377;&#12409;&#12390;&#12398;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#34920;&#31034;&#12391;&#12365;&#12414;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12399;&#27425;&#12398;&#12525;&#12460;&#12540;&#12364;&#23384;&#22312;&#12377;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<pre>
com.example.myapp.module1
com.example.myapp.module2
com.example.myapp.module3
</pre>
<p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#20869;&#12398;&#12377;&#12409;&#12390;&#12398;&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;&#12289;<code>com.mycompany.myapp</code>&#12392;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;<code>module2</code>&#12363;&#12425;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#12415;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;&#12289;<code>com.example.myapp.module2</code>&#12392;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>1&#12388;&#20197;&#19978;&#12398;&#12459;&#12473;&#12479;&#12512;&#12539;&#12525;&#12460;&#12540;&#12434;&#25351;&#23450;&#12375;&#12383;&#22580;&#21512;&#12289;GlassFish Server&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#12289;&#12300;&#12525;&#12460;&#12540;&#12301;&#38936;&#22495;&#12391;&#26126;&#31034;&#30340;&#12395;&#25351;&#23450;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;&#12398;&#12415;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#34920;&#31034;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#34920;&#31034;&#12377;&#12427;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#25968;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#34920;&#31034;&#12373;&#12428;&#12427;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#25968;&#12399;40&#12391;&#12377;&#12290;&#12381;&#12398;&#20182;&#12398;&#36984;&#25246;&#32930;&#12399;&#12289;100&#12289;250&#12289;&#12362;&#12424;&#12403;1000&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12473;&#12479;&#12483;&#12463;&#12539;&#12488;&#12524;&#12540;&#12473;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#36942;&#24230;&#12395;&#38263;&#12356;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#21046;&#38480;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12398;&#36984;&#25246;&#12434;&#35299;&#38500;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12499;&#12517;&#12540;&#12450;&#12395;&#12473;&#12479;&#12483;&#12463;&#12539;&#12488;&#12524;&#12540;&#12473;&#12399;&#34920;&#31034;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12473;&#12479;&#12483;&#12463;&#12539;&#12488;&#12524;&#12540;&#12473;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;(&#35443;&#32048;)&#12522;&#12531;&#12463;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#35443;&#32048;&#26908;&#32034;&#12301;&#38936;&#22495;&#12434;&#38750;&#34920;&#31034;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#22522;&#26412;&#26908;&#32034;&#12301;&#12522;&#12531;&#12463;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
</li>
<li>
<p>&#34920;&#31034;&#12377;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#12289;&#38306;&#36899;&#12377;&#12427;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#25351;&#23450;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#26908;&#32034;&#12434;&#22793;&#26356;&#12301;&#38936;&#22495;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#12300;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;&#12289;&#24403;&#21021;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#34920;&#31034;&#12377;&#12427;&#12371;&#12392;&#12434;&#36984;&#25246;&#12375;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#12377;&#12290;&#12489;&#12513;&#12452;&#12531;&#31649;&#29702;&#12469;&#12540;&#12496;&#12540;(DAS)&#12398;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#34920;&#31034;&#12377;&#12427;&#12371;&#12392;&#12434;&#36984;&#25246;&#12375;&#12383;&#22580;&#21512;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;&#12469;&#12540;&#12496;&#12540;(&#12371;&#12428;&#12399;DAS&#12434;&#24847;&#21619;&#12377;&#12427;)&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;<code>server.log</code>&#12391;&#12377;&#12290;&#20182;&#12398;&#36984;&#25246;&#32930;&#12399;&#12289;&#36984;&#25246;&#12375;&#12383;&#12479;&#12540;&#12466;&#12483;&#12488;&#12398;&#12525;&#12464;&#35373;&#23450;&#12395;&#12424;&#12387;&#12390;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#26908;&#32034;&#32080;&#26524;&#12301;&#38936;&#22495;&#12391;&#12525;&#12464;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#34920;&#31034;&#26041;&#27861;&#12434;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26908;&#32034;&#32080;&#26524;&#12301;&#38936;&#22495;&#12395;&#12399;&#12289;&#12300;&#12525;&#12462;&#12531;&#12464;&#35373;&#23450;&#12301;&#12506;&#12540;&#12472;&#12392;&#12300;&#12525;&#12464;&#12539;&#12524;&#12505;&#12523;&#12301;&#12506;&#12540;&#12472;&#12398;&#35373;&#23450;&#12395;&#22522;&#12389;&#12356;&#12390;&#12289;&#12469;&#12540;&#12496;&#12540;&#12539;&#12525;&#12464;&#20869;&#12395;&#12354;&#12427;&#26368;&#26032;&#12398;40&#12456;&#12531;&#12488;&#12522;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#21029;&#12398;&#26041;&#27861;&#12391;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#12477;&#12540;&#12488;&#12377;&#12427;&#12395;&#12399;&#12289;&#21015;&#20869;&#12398;&#30690;&#21360;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#26360;&#24335;&#35373;&#23450;&#12373;&#12428;&#12383;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;(&#35443;&#32048;)&#12522;&#12531;&#12463;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12525;&#12464;&#12539;&#12456;&#12531;&#12488;&#12522;&#12398;&#35443;&#32048;&#12301;&#12454;&#12451;&#12531;&#12489;&#12454;&#12364;&#38283;&#12363;&#12428;&#12289;&#26360;&#24335;&#35373;&#23450;&#12373;&#12428;&#12383;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#20869;&#12398;&#21476;&#12356;&#12456;&#12531;&#12488;&#12522;&#12414;&#12383;&#12399;&#26032;&#12375;&#12356;&#12456;&#12531;&#12488;&#12522;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;&#12289;&#34920;&#12398;&#19978;&#37096;&#12395;&#12354;&#12427;&#12300;N&#12424;&#12426;&#21069;&#12398;&#12524;&#12467;&#12540;&#12489;&#25968;&#12301;&#12392;&#12300;N&#12424;&#12426;&#24460;&#12398;&#12524;&#12467;&#12540;&#12489;&#25968;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
</ol>
<a id="sthref27" name="sthref27"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-eelogging.html">&#20840;&#33324;&#30340;&#12394;&#12525;&#12462;&#12531;&#12464;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-eelogginglevels.html">&#12525;&#12464;&#12539;&#12524;&#12505;&#12523;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-logviewer.html">DAS&#12398;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="../../../cluster/en/help/task-view-logs-clustered-instance.html">&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="../../../cluster/en/help/task-view-logs-standalone-instance.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
