<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-accessadmintools" name="task-accessadmintools"></a><a id="GHCOM00182" name="GHCOM00182"></a></p>

<h4><a id="sthref128" name="sthref128"></a>&#31649;&#29702;&#12484;&#12540;&#12523;&#12395;&#12450;&#12463;&#12475;&#12473;&#27177;&#12434;&#20184;&#19982;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p><code>asadmin</code>&#12464;&#12523;&#12540;&#12503;&#12398;&#12518;&#12540;&#12470;&#12540;&#12398;&#12415;&#12364;&#12289;&#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12362;&#12424;&#12403;<code>asadmin</code>&#12467;&#12510;&#12531;&#12489;&#12539;&#12521;&#12452;&#12531;&#12539;&#12518;&#12540;&#12486;&#12451;&#12522;&#12486;&#12451;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#31649;&#29702;&#12484;&#12540;&#12523;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;&#12434;&#12518;&#12540;&#12470;&#12540;&#12395;&#35377;&#21487;&#12377;&#12427;&#12395;&#12399;&#12289;&#12518;&#12540;&#12470;&#12540;&#12434;<code>admin-realm</code>&#12398;<code>asadmin</code>&#12464;&#12523;&#12540;&#12503;&#12395;&#36861;&#21152;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<ol>
<li>
<p>&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12398;&#19979;&#12391;&#12289;&#31649;&#29702;&#12450;&#12463;&#12475;&#12473;&#27177;&#38480;&#12434;&#27083;&#25104;&#12377;&#12427;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12414;&#12383;&#12399;&#12463;&#12521;&#12473;&#12479;&#12398;&#27083;&#25104;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12524;&#12523;&#12512;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;<code>admin-realm</code>&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12524;&#12523;&#12512;&#12434;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12524;&#12523;&#12512;&#12434;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;&#12518;&#12540;&#12470;&#12540;&#12434;&#31649;&#29702;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#31649;&#29702;&#12518;&#12540;&#12470;&#12540;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
<p>&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#24460;&#24403;&#21021;&#12399;&#12289;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12398;&#38555;&#12395;&#20837;&#21147;&#12375;&#12383;&#31649;&#29702;&#32773;&#12518;&#12540;&#12470;&#12540;&#21517;&#12362;&#12424;&#12403;&#12497;&#12473;&#12527;&#12540;&#12489;&#12364;<code>admin-keyfile</code>&#12392;&#12356;&#12358;&#21517;&#21069;&#12398;&#12501;&#12449;&#12452;&#12523;&#12395;&#12522;&#12473;&#12488;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12518;&#12540;&#12470;&#12540;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;GlassFish Server&#12434;&#22793;&#26356;&#12377;&#12427;&#27177;&#38480;&#12434;&#20184;&#19982;&#12373;&#12428;&#12427;<code>asadmin</code>&#12464;&#12523;&#12540;&#12503;&#12395;&#23646;&#12375;&#12414;&#12377;&#12290;&#36984;&#25246;&#12375;&#12383;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12414;&#12383;&#12399;&#12463;&#12521;&#12473;&#12479;&#12398;&#31649;&#29702;&#32773;&#27177;&#38480;&#12434;&#12518;&#12540;&#12470;&#12540;&#12395;&#20184;&#19982;&#12377;&#12427;&#22580;&#21512;&#12395;&#12363;&#12366;&#12426;&#12289;&#12518;&#12540;&#12470;&#12540;&#12434;&#12371;&#12398;&#12464;&#12523;&#12540;&#12503;&#12395;&#21106;&#12426;&#24403;&#12390;&#12414;&#12377;&#12290;</p>
<p>&#12518;&#12540;&#12470;&#12540;&#12434;<code>admin-realm</code>&#12524;&#12523;&#12512;&#12395;&#36861;&#21152;&#12375;&#12390;&#12418;&#12289;&#12518;&#12540;&#12470;&#12540;&#12434;&#21106;&#12426;&#24403;&#12390;&#12427;&#12464;&#12523;&#12540;&#12503;&#12364;<code>asadmin</code>&#20197;&#22806;&#12398;&#22580;&#21512;&#12289;&#12518;&#12540;&#12470;&#12540;&#12398;&#24773;&#22577;&#12399;<code>admin-keyfile</code>&#12392;&#12356;&#12358;&#21517;&#21069;&#12398;&#12501;&#12449;&#12452;&#12523;&#12395;&#35352;&#36848;&#12373;&#12428;&#12414;&#12377;&#12364;&#12289;&#12381;&#12398;&#12518;&#12540;&#12470;&#12540;&#12395;&#12399;<code>file</code>&#12524;&#12523;&#12512;&#12398;&#31649;&#29702;&#12484;&#12540;&#12523;&#12414;&#12383;&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;&#27177;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p>&#12300;&#31649;&#29702;&#12518;&#12540;&#12470;&#12540;&#12301;&#12506;&#12540;&#12472;&#12398;&#12300;&#26032;&#35215;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12289;&#26032;&#35215;&#12518;&#12540;&#12470;&#12540;&#12434;<code>admin-realm</code>&#12524;&#12523;&#12512;&#12395;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26032;&#35215;&#12501;&#12449;&#12452;&#12523;&#12539;&#12524;&#12523;&#12512;&#12539;&#12518;&#12540;&#12470;&#12540;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12518;&#12540;&#12470;&#12540;ID&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#26032;&#35215;&#12518;&#12540;&#12470;&#12540;&#21517;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12464;&#12523;&#12540;&#12503;&#12539;&#12522;&#12473;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12518;&#12540;&#12470;&#12540;&#12364;&#23646;&#12377;&#12427;&#12464;&#12523;&#12540;&#12503;&#12398;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>GlassFish Server&#12395;&#22793;&#26356;&#12434;&#21152;&#12360;&#12427;&#12518;&#12540;&#12470;&#12540;&#12434;&#25215;&#35469;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12464;&#12523;&#12540;&#12503;&#12539;&#12522;&#12473;&#12488;&#12301;&#12395;<code>asadmin</code>&#12464;&#12523;&#12540;&#12503;&#12434;&#21547;&#12417;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26032;&#35215;&#12497;&#12473;&#12527;&#12540;&#12489;&#12301;&#12362;&#12424;&#12403;&#12300;&#26032;&#35215;&#12497;&#12473;&#12527;&#12540;&#12489;&#12398;&#30906;&#35469;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#26032;&#35215;&#12518;&#12540;&#12470;&#12540;&#12398;&#12497;&#12473;&#12527;&#12540;&#12489;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;OK&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#12289;&#12371;&#12398;&#12518;&#12540;&#12470;&#12540;&#12434;<code>admin-realm</code>&#12524;&#12523;&#12512;&#12395;&#36861;&#21152;&#12377;&#12427;&#12363;&#12289;&#12414;&#12383;&#12399;&#12300;&#21462;&#28040;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#20445;&#23384;&#12379;&#12378;&#12395;&#32066;&#20102;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref129" name="sthref129"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-securitysettings.html">&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-changeadminpasswd.html">&#31649;&#29702;&#12524;&#12523;&#12512;&#12398;&#12518;&#12540;&#12470;&#12540;&#12398;&#12497;&#12473;&#12527;&#12540;&#12489;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
