<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmxconnectoredit" name="task-jmxconnectoredit"></a><a id="GHCOM00211" name="GHCOM00211"></a></p>
<a name="BEGIN" id="BEGIN"></a>


<p>&#12300;&#12509;&#12540;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12493;&#12540;&#12512;&#12539;&#12469;&#12540;&#12499;&#12473;(RMI&#12524;&#12472;&#12473;&#12488;&#12522;)&#12364;RMI&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#25509;&#32154;&#12434;&#12522;&#12473;&#12491;&#12531;&#12464;&#12377;&#12427;&#12509;&#12540;&#12488;&#30058;&#21495;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12493;&#12540;&#12512;&#12539;&#12469;&#12540;&#12499;&#12473;&#12399;&#12289;RMI&#12473;&#12479;&#12502;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12377;&#12427;&#12383;&#12417;&#12395;&#12398;&#12415;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12509;&#12540;&#12488;&#12364;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#31354;&#12356;&#12390;&#12356;&#12427;&#12509;&#12540;&#12488;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#36969;&#20999;&#12394;&#20516;&#12399;1&#12363;&#12425;65535&#12391;&#12377;&#12290;UNIX&#12471;&#12473;&#12486;&#12512;&#12391;&#12289;&#12509;&#12540;&#12488;1&#12363;&#12425;1024&#12391;&#12522;&#12473;&#12491;&#12531;&#12464;&#12377;&#12427;&#12477;&#12465;&#12483;&#12488;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12473;&#12540;&#12497;&#12540;&#12518;&#12540;&#12470;&#12540;&#27177;&#38480;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;8686&#12391;&#12377;&#12290;</p>
<p>&#12300;&#12524;&#12523;&#12512;&#21517;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#29305;&#21029;&#12394;&#31649;&#29702;&#12524;&#12523;&#12512;&#12434;&#34920;&#12377;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12377;&#12409;&#12390;&#12398;&#35469;&#35388;&#12399;&#12289;&#12371;&#12398;&#12524;&#12523;&#12512;&#12395;&#12424;&#12387;&#12390;&#20966;&#29702;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>admin-realm</code>&#12391;&#12377;&#12290;</p>
<p>&#12300;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#12289;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12289;GlassFish Server&#12364;&#12356;&#12367;&#12388;&#12363;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#34920;&#31034;&#12373;&#12428;&#12427;&#31354;&#30333;&#34892;&#12391;&#12289;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#21517;&#12434;&#20837;&#21147;&#12375;&#12289;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;&#12289;&#12381;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#32232;&#38598;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;&#12289;&#21066;&#38500;&#12377;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12398;&#24038;&#20596;&#12395;&#12354;&#12427;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21066;&#38500;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12383;&#22580;&#21512;&#12399;&#12289;<a href="task-jmxconnectorssledit.html">JMX&#12467;&#12493;&#12463;&#12479;&#12398;SSL&#35373;&#23450;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a>&#12398;&#12473;&#12486;&#12483;&#12503;&#12395;&#24467;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<a id="sthref186" name="sthref186"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<p><a href="task-jmxconnectorssledit.html">JMX&#12467;&#12493;&#12463;&#12479;&#12398;SSL&#35373;&#23450;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
