<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-lifecyclemoduleedit" name="task-lifecyclemoduleedit"></a><a id="GHCOM00170" name="GHCOM00170"></a></p>

<h4><a id="sthref103" name="sthref103"></a>&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#32232;&#38598;&#12377;&#12427;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#21517;&#21069;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12463;&#12521;&#12473;&#21517;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#12463;&#12521;&#12473;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#23436;&#20840;&#20462;&#39166;&#21517;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12463;&#12521;&#12473;&#12399;<code>com.sun.appserv.server.LifecycleListener</code>&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12434;&#23455;&#35013;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12463;&#12521;&#12473;&#12497;&#12473;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#12463;&#12521;&#12473;&#12497;&#12473;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12463;&#12521;&#12473;&#12497;&#12473;&#12399;&#12289;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12364;&#37197;&#32622;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#25152;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;domain-dir<code>/applications</code>&#12391;&#12377;&#12290;&#12514;&#12472;&#12517;&#12540;&#12523;&#12364;&#12377;&#12391;&#12395;&#12371;&#12398;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;(&#12388;&#12414;&#12426;&#12289;&#12469;&#12540;&#12496;&#12540;&#12398;&#12463;&#12521;&#12473;&#12497;&#12473;)&#12395;&#12354;&#12427;&#22580;&#21512;&#12289;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#31354;&#30333;&#12398;&#12414;&#12414;&#12391;&#12363;&#12414;&#12356;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p>&#12300;&#12525;&#12540;&#12489;&#38918;&#24207;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#36215;&#21205;&#26178;&#12395;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#12525;&#12540;&#12489;&#12377;&#12427;&#38918;&#24207;&#12434;&#25351;&#23450;&#12377;&#12427;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12525;&#12540;&#12489;&#38918;&#12398;&#25972;&#25968;&#20516;&#12364;&#23567;&#12373;&#12356;&#12514;&#12472;&#12517;&#12540;&#12523;&#12411;&#12393;&#12289;&#20808;&#12395;&#12525;&#12540;&#12489;&#12373;&#12428;&#12414;&#12377;&#12290;&#25351;&#23450;&#12391;&#12365;&#12427;&#20516;&#12399;&#12289;101&#12363;&#12425;&#12458;&#12506;&#12524;&#12540;&#12486;&#12451;&#12531;&#12464;&#12539;&#12471;&#12473;&#12486;&#12512;&#12398;<code>MAXINT</code>&#12414;&#12391;&#12391;&#12377;&#12290;1&#12363;&#12425;100&#12398;&#20516;&#12399;&#20104;&#32004;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#35500;&#26126;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#35500;&#26126;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12473;&#12486;&#12540;&#12479;&#12473;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#12525;&#12540;&#12489;&#12395;&#22833;&#25943;&#12375;&#12383;&#12392;&#12365;&#12395;&#12469;&#12540;&#12496;&#12540;&#12434;&#20572;&#27490;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12300;&#12525;&#12540;&#12489;&#26178;&#12398;&#38556;&#23475;&#12395;&#12424;&#12387;&#12390;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36215;&#21205;&#12375;&#12394;&#12356;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12479;&#12540;&#12466;&#12483;&#12488;&#12301;&#12479;&#12502;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;<code>server</code>&#12398;&#20182;&#12395;&#12463;&#12521;&#12473;&#12479;&#12414;&#12383;&#12399;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#23384;&#22312;&#12377;&#12427;&#22580;&#21512;&#12395;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12364;&#26377;&#21177;&#12395;&#35373;&#23450;&#12373;&#12428;&#12383;&#12479;&#12540;&#12466;&#12483;&#12488;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12479;&#12540;&#12466;&#12483;&#12488;&#12301;&#12479;&#12502;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12479;&#12540;&#12466;&#12483;&#12488;&#12391;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#26377;&#21177;&#12414;&#12383;&#12399;&#28961;&#21177;&#12395;&#12377;&#12427;&#26041;&#27861;&#12399;&#12289;<a href="task-appviewtargets.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12479;&#12540;&#12466;&#12483;&#12488;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref104" name="sthref104"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-lifecyclemodulenew.html">&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-lifecyclemoduledelete.html">&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
