<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-confmonitor" name="task-confmonitor"></a></p>

<h4><a id="sthref192" name="sthref192"></a>&#12514;&#12491;&#12479;&#12540;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#12300;&#12514;&#12491;&#12479;&#12540;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12434;&#38283;&#12367;&#12395;&#12399;&#12289;&#27425;&#12398;&#12356;&#12378;&#12428;&#12363;&#12398;&#25805;&#20316;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#12300;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12289;&#12514;&#12491;&#12479;&#12540;&#12434;&#27083;&#25104;&#12377;&#12427;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12300;&#12514;&#12491;&#12479;&#12540;&#12434;&#27083;&#25104;&#12301;&#12522;&#12531;&#12463;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#12463;&#12521;&#12473;&#12479;&#12398;&#12514;&#12491;&#12479;&#12540;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12463;&#12521;&#12473;&#12479;&#12398;&#20219;&#24847;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
<ul>
<li>
<p>&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12398;&#19979;&#12391;&#12289;&#12514;&#12491;&#12479;&#12540;&#12434;&#27083;&#25104;&#12377;&#12427;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12414;&#12383;&#12399;&#12463;&#12521;&#12473;&#12479;&#27083;&#25104;&#12434;&#23637;&#38283;&#12375;&#12289;&#12300;&#12514;&#12491;&#12479;&#12540;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
<p>&#12300;&#12514;&#12491;&#12479;&#12540;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12514;&#12491;&#12479;&#12540;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;GlassFish Server&#12398;&#12514;&#12491;&#12479;&#12540;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12363;&#12289;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#35299;&#38500;&#12375;&#12390;&#12514;&#12491;&#12479;&#12540;&#12434;&#28961;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12514;&#12491;&#12479;&#12540;MBean&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12514;&#12491;&#12479;&#12540;&#12395;&#24517;&#35201;&#12394;&#12377;&#12409;&#12390;&#12398;MBean&#12434;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12363;&#12289;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#35299;&#38500;&#12375;&#12390;&#12371;&#12428;&#12425;&#12398;MBean&#12434;&#12450;&#12531;&#12487;&#12503;&#12525;&#12452;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
<p>&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12364;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12300;&#12514;&#12491;&#12479;&#12540;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12364;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12391;&#12418;&#12289;&#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12391;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#22580;&#21512;&#12399;&#12289;&#12467;&#12510;&#12531;&#12489;&#12539;&#12521;&#12452;&#12531;&#12434;&#20351;&#29992;&#12375;&#12390;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12398;&#36984;&#25246;&#12434;&#35299;&#38500;&#12377;&#12427;&#12392;&#12289;GlassFish Server&#12398;&#12513;&#12514;&#12522;&#12540;&#12539;&#12501;&#12483;&#12488;&#12503;&#12522;&#12531;&#12488;&#12364;&#28187;&#23569;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>DTrace&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;Solaris&#12398;DTrace&#27231;&#33021;&#12398;&#20351;&#29992;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>Solaris&#12398;DTrace&#27231;&#33021;&#12434;&#20351;&#29992;&#12377;&#12427;&#12395;&#12399;&#12289;Oracle Enterprise Manager DTrace&#12514;&#12491;&#12479;&#12522;&#12531;&#12464;&#12418;&#24517;&#35201;&#12391;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#34920;&#12391;&#27425;&#12398;&#12356;&#12378;&#12428;&#12363;&#12398;&#12450;&#12463;&#12471;&#12519;&#12531;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#12300;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12301;&#21015;&#12398;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12395;&#23550;&#12375;&#12390;&#12289;&#12300;&#12514;&#12491;&#12479;&#12540;&#12539;&#12524;&#12505;&#12523;&#12301;&#21015;&#12398;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12300;LOW&#12301;&#12414;&#12383;&#12399;&#12300;HIGH&#12301;&#12434;&#36984;&#25246;&#12375;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12514;&#12491;&#12479;&#12540;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#27178;&#12395;&#12354;&#12427;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12383;&#24460;&#12289;&#34920;&#12398;&#19978;&#37096;&#12395;&#12354;&#12427;&#12300;&#12524;&#12505;&#12523;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12300;LOW&#12301;&#12414;&#12383;&#12399;&#12300;HIGH&#12301;&#12434;&#36984;&#25246;&#12375;&#12289;&#12300;&#12524;&#12505;&#12523;&#12398;&#22793;&#26356;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#12289;&#36984;&#25246;&#12375;&#12383;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12524;&#12505;&#12523;&#12434;&#22793;&#26356;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
<p>&#29694;&#22312;&#12398;&#12522;&#12522;&#12540;&#12473;&#12391;&#12399;&#12289;&#12300;LOW&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12392;&#12300;HIGH&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12395;&#12424;&#12427;&#12514;&#12491;&#12479;&#12540;&#12539;&#12524;&#12505;&#12523;&#12395;&#24046;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12514;&#12491;&#12479;&#12540;&#12434;&#28961;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;OFF&#12301;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12300;OFF&#12301;&#12391;&#12377;&#12290;</p>
<p>&#12514;&#12491;&#12479;&#12540;&#12434;&#27083;&#25104;&#12377;&#12427;&#21069;&#12395;&#12289;&#12514;&#12491;&#12479;&#12540;&#23550;&#35937;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12289;&#12414;&#12383;&#12399;&#12469;&#12540;&#12499;&#12473;&#12434;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref193" name="sthref193"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-appmonitoringdata.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-servermonitoringdata.html">&#12469;&#12540;&#12496;&#12540;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-resourcemonitoringdata.html">&#12522;&#12477;&#12540;&#12473;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
