<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-eelogginglevels" name="task-eelogginglevels"></a></p>

<h4><a id="sthref73" name="sthref73"></a><a id="sthref74" name="sthref74"></a>&#12525;&#12464;&#12539;&#12524;&#12505;&#12523;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12398;&#19979;&#12391;&#12289;&#12300;&#12525;&#12460;&#12540;&#12398;&#35373;&#23450;&#12301;&#12434;&#27083;&#25104;&#12377;&#12427;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12414;&#12383;&#12399;&#12463;&#12521;&#12473;&#12479;&#12398;&#27083;&#25104;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#27083;&#25104;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#27083;&#25104;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;&#12525;&#12460;&#12540;&#12398;&#35373;&#23450;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#36984;&#25246;&#12375;&#12383;&#27083;&#25104;&#12479;&#12540;&#12466;&#12483;&#12488;&#12398;&#12300;&#12525;&#12460;&#12540;&#12398;&#35373;&#23450;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12525;&#12460;&#12540;&#12398;&#35373;&#23450;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;&#12525;&#12464;&#12539;&#12524;&#12505;&#12523;&#12301;&#12479;&#12502;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12514;&#12472;&#12517;&#12540;&#12523;&#12539;&#12525;&#12464;&#12539;&#12524;&#12505;&#12523;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12514;&#12472;&#12517;&#12540;&#12523;&#12539;&#12525;&#12464;&#12539;&#12524;&#12505;&#12523;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#12525;&#12464;&#12539;&#12524;&#12505;&#12523;&#12434;&#12289;&#27425;&#12398;&#12424;&#12358;&#12395;&#22793;&#26356;&#12375;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#12514;&#12472;&#12517;&#12540;&#12523;&#12372;&#12392;&#12395;&#12525;&#12464;&#12539;&#12524;&#12505;&#12523;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;&#12289;&#12525;&#12464;&#12539;&#12524;&#12505;&#12523;&#12434;&#22793;&#26356;&#12377;&#12427;&#12514;&#12472;&#12517;&#12540;&#12523;&#12395;&#23550;&#24540;&#12377;&#12427;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#26032;&#12375;&#12356;&#20516;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#12464;&#12523;&#12540;&#12503;&#12398;&#12525;&#12464;&#12539;&#12524;&#12505;&#12523;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;&#12289;&#27425;&#12398;&#25163;&#38918;&#12395;&#24467;&#12356;&#12414;&#12377;&#12290;</p>
<ol type="a">
<li>
<p>&#12525;&#12464;&#12539;&#12524;&#12505;&#12523;&#12434;&#22793;&#26356;&#12377;&#12427;&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#12289;&#21517;&#21069;&#12398;&#27178;&#12395;&#12354;&#12427;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#34920;&#12398;&#19978;&#37096;&#12395;&#12354;&#12427;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#20516;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12524;&#12505;&#12523;&#12398;&#22793;&#26356;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
</li>
</ul>
<p>&#36984;&#25246;&#12375;&#12383;&#12524;&#12505;&#12523;&#12362;&#12424;&#12403;&#12381;&#12428;&#20197;&#19978;&#12398;&#12524;&#12505;&#12523;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#12525;&#12464;&#12395;&#35352;&#37682;&#12373;&#12428;&#12414;&#12377;&#12290;&#27425;&#12398;&#20516;&#12398;&#12356;&#12378;&#12428;&#12363;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;(&#26368;&#39640;&#12363;&#12425;&#26368;&#20302;&#12414;&#12391;&#12522;&#12473;&#12488;)&#12290;</p>
<ul>
<li>
<p><code>EMERGENCY</code></p>
</li>
<li>
<p><code>ALERT</code></p>
</li>
<li>
<p><code>SEVERE</code></p>
</li>
<li>
<p><code>WARNING</code></p>
</li>
<li>
<p><code>INFO</code></p>
</li>
<li>
<p><code>CONFIG</code></p>
</li>
<li>
<p><code>FINE</code></p>
</li>
<li>
<p><code>FINER</code></p>
</li>
<li>
<p><code>FINEST</code></p>
</li>
<li>
<p><code>OFF</code></p>
</li>
</ul>
<p>&#21508;&#12525;&#12464;&#12539;&#12524;&#12505;&#12523;&#12398;&#24847;&#21619;&#12398;&#35443;&#32048;&#12399;&#12289;<a href="ref-eelogginglevels.html">&#12514;&#12472;&#12517;&#12540;&#12523;&#12539;&#12525;&#12464;&#12539;&#12524;&#12505;&#12523;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12524;&#12505;&#12523;&#12399;<code>INFO</code>&#12391;&#12377;&#12290;&#12371;&#12398;&#22580;&#21512;&#12289;&#12525;&#12464;&#12395;&#12399;<code>INFO</code>&#12289;<code>WARNING</code>&#12289;&#12414;&#12383;&#12399;<code>SEVERE</code>&#12524;&#12505;&#12523;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#35352;&#37682;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12525;&#12464;&#12539;&#12524;&#12505;&#12523;&#35373;&#23450;&#12398;&#22793;&#26356;&#12399;&#21363;&#26178;&#12395;&#26377;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;&#22793;&#26356;&#12364;&#20445;&#23384;&#12373;&#12428;&#12289;&#12469;&#12540;&#12496;&#12540;&#12398;&#20877;&#36215;&#21205;&#26178;&#12395;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="GHCOM277" name="GHCOM277"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-eelogging.html">&#20840;&#33324;&#30340;&#12394;&#12525;&#12462;&#12531;&#12464;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-logging-max-logfiles.html">&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12373;&#12428;&#12427;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#25968;&#12398;&#21046;&#38480;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-logviewer.html">DAS&#12398;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-collectdomainlogs.html">&#12489;&#12513;&#12452;&#12531;&#12539;&#12525;&#12464;&#12434;&#21454;&#38598;&#12362;&#12424;&#12403;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
