<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-eelogging" name="task-eelogging"></a></p>

<h4><a id="sthref116" name="sthref116"></a>&#20840;&#33324;&#30340;&#12394;&#12525;&#12462;&#12531;&#12464;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12398;&#19979;&#12391;&#12289;&#12300;&#12525;&#12460;&#12540;&#12398;&#35373;&#23450;&#12301;&#12434;&#27083;&#25104;&#12377;&#12427;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12414;&#12383;&#12399;&#12463;&#12521;&#12473;&#12479;&#12398;&#27083;&#25104;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#27083;&#25104;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#27083;&#25104;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;&#12525;&#12460;&#12540;&#12398;&#35373;&#23450;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#36984;&#25246;&#12375;&#12383;&#27083;&#25104;&#12479;&#12540;&#12466;&#12483;&#12488;&#12398;&#12300;&#12525;&#12460;&#12540;&#12398;&#35373;&#23450;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12525;&#12462;&#12531;&#12464;&#20986;&#21147;&#12434;&#12289;&#12469;&#12540;&#12496;&#12540;&#12539;&#12525;&#12464;&#12395;&#21152;&#12360;&#12390;<code>syslog</code>&#27231;&#33021;&#12395;&#12418;&#36865;&#20449;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12300;&#12471;&#12473;&#12486;&#12512;&#12539;&#12525;&#12464;&#12408;&#12398;&#26360;&#36796;&#12415;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#27231;&#33021;&#12399;Solaris&#12362;&#12424;&#12403;Linux&#12471;&#12473;&#12486;&#12512;&#12398;&#12415;&#12391;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12467;&#12531;&#12477;&#12540;&#12523;&#12395;&#12525;&#12464;&#12434;&#35352;&#37682;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#12525;&#12462;&#12531;&#12464;&#20986;&#21147;&#12434;&#12471;&#12473;&#12486;&#12512;&#12539;&#12467;&#12531;&#12477;&#12540;&#12523;&#12395;&#36865;&#20449;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26085;&#20184;&#22793;&#26356;&#12398;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#12469;&#12540;&#12496;&#12540;&#12539;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#27598;&#26085;&#21320;&#21069;0&#26178;&#12395;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#35079;&#25968;&#34892;&#12514;&#12540;&#12489;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#35501;&#12415;&#12420;&#12377;&#12356;&#12424;&#12358;&#12395;&#12525;&#12464;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#26360;&#24335;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#12525;&#12464;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#26412;&#25991;&#12399;&#12289;&#12452;&#12531;&#12487;&#12531;&#12488;&#12373;&#12428;&#12390;&#26032;&#35215;&#34892;&#12391;&#38283;&#22987;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12467;&#12531;&#12477;&#12540;&#12523;&#12398;&#12525;&#12462;&#12531;&#12464;&#12539;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#12467;&#12531;&#12477;&#12540;&#12523;&#12408;&#12398;&#12525;&#12462;&#12531;&#12464;&#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;ODL(Oracle Diagnostics Logging)&#12391;&#12377;&#12290;&#20182;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;ULF(UniformLogFormatter)&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#12525;&#12462;&#12531;&#12464;&#12539;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#12469;&#12540;&#12496;&#12540;&#12539;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12408;&#12398;&#12525;&#12462;&#12531;&#12464;&#12398;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;ODL&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12501;&#12449;&#12452;&#12523;&#12539;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#21046;&#38480;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12469;&#12540;&#12496;&#12540;&#12539;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12377;&#12427;&#12469;&#12452;&#12474;&#12434;&#12496;&#12452;&#12488;&#21336;&#20301;&#12391;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12469;&#12540;&#12496;&#12540;&#12539;&#12525;&#12464;&#12364;&#25351;&#23450;&#12375;&#12383;&#12469;&#12452;&#12474;&#12395;&#36948;&#12377;&#12427;&#12392;&#12289;GlassFish Server&#12399;<code>server.log</code>&#12392;&#12356;&#12358;&#21517;&#21069;&#12398;&#26032;&#12375;&#12356;&#31354;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#20316;&#25104;&#12375;&#12289;&#21476;&#12356;&#12501;&#12449;&#12452;&#12523;&#12398;&#21517;&#21069;&#12434;<code>server.log_</code><i>date</i>&#12395;&#22793;&#26356;&#12375;&#12414;&#12377;&#12290;<i>date</i>&#12399;&#12289;&#12501;&#12449;&#12452;&#12523;&#12364;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12373;&#12428;&#12383;&#26085;&#26178;&#12391;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;2MB&#12391;&#12377;&#12290;&#21046;&#38480;&#12398;&#26368;&#23567;&#20516;&#12399;500KB&#12391;&#12377;&#12290;&#12381;&#12428;&#12424;&#12426;&#23567;&#12373;&#12394;&#20516;&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12501;&#12449;&#12452;&#12523;&#12399;500KB&#12395;&#36948;&#12375;&#12383;&#26178;&#28857;&#12391;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12373;&#12428;&#12414;&#12377;&#12290;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12434;&#28961;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;&#12371;&#12398;&#20516;&#12434;0&#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12501;&#12449;&#12452;&#12523;&#12539;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12398;&#21046;&#38480;&#26178;&#38291;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12469;&#12540;&#12496;&#12540;&#12539;&#12525;&#12464;&#12434;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12377;&#12427;&#12414;&#12391;&#12398;&#26178;&#38291;&#12434;&#20998;&#21336;&#20301;&#12391;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;0&#12391;&#12377;&#12290;&#12371;&#12428;&#12399;&#12289;&#12300;&#12501;&#12449;&#12452;&#12523;&#12539;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#21046;&#38480;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12391;&#25351;&#23450;&#12375;&#12383;&#12469;&#12452;&#12474;&#12395;&#36948;&#12375;&#12383;&#12392;&#12365;&#12395;&#12289;&#12501;&#12449;&#12452;&#12523;&#12364;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12373;&#12428;&#12427;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
1&#20998;&#20197;&#19978;&#12398;&#20516;&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12300;&#12501;&#12449;&#12452;&#12523;&#12539;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#21046;&#38480;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12391;&#25351;&#23450;&#12375;&#12383;&#12469;&#12452;&#12474;&#21046;&#38480;&#12424;&#12426;&#12418;&#12289;&#26178;&#38291;&#12395;&#12424;&#12427;&#21046;&#38480;&#12364;&#20778;&#20808;&#12373;&#12428;&#12414;&#12377;&#12290;
<hr>

</li>
<li>
<p>&#12300;&#12501;&#12521;&#12483;&#12471;&#12517;&#12398;&#38971;&#24230;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12461;&#12517;&#12540;&#12363;&#12425;&#12469;&#12540;&#12496;&#12540;&#12539;&#12525;&#12464;&#12395;&#19968;&#24230;&#12395;&#26360;&#12365;&#36796;&#12416;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#26368;&#22823;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;1&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26368;&#22823;&#23653;&#27508;&#12501;&#12449;&#12452;&#12523;&#25968;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#26368;&#12418;&#21476;&#12356;&#12501;&#12449;&#12452;&#12523;&#12434;&#21066;&#38500;&#12377;&#12427;&#21069;&#12395;GlassFish Server&#12364;&#20445;&#25345;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#26368;&#22823;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#20516;&#12434;&#12476;&#12525;(0)&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;GlassFish Server&#12399;&#21476;&#12356;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#21066;&#38500;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p>&#12300;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12469;&#12540;&#12496;&#12540;&#12539;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#21029;&#21517;&#12414;&#12383;&#12399;&#22580;&#25152;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#22580;&#25152;&#12399;&#12289;<code>${com.sun.aas.instanceRoot}/logs/server.log</code>&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12525;&#12464;&#12539;&#12495;&#12531;&#12489;&#12521;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12459;&#12473;&#12479;&#12512;&#12539;&#12525;&#12464;&#12539;&#12495;&#12531;&#12489;&#12521;&#12398;&#32118;&#23550;&#12463;&#12521;&#12473;&#21517;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12459;&#12473;&#12479;&#12512;&#12539;&#12525;&#12464;&#12539;&#12495;&#12531;&#12489;&#12521;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;<code>server.log</code>&#12414;&#12383;&#12399;<code>syslog</code>&#20197;&#22806;&#12398;&#23451;&#20808;&#12395;&#12525;&#12464;&#12434;&#36865;&#20449;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12459;&#12473;&#12479;&#12512;&#12539;&#12495;&#12531;&#12489;&#12521;&#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12463;&#12521;&#12473;<code>java.util.logging.ConsoleHandler</code>(JSR 047&#28310;&#25312;&#12398;API)&#12434;&#25313;&#24373;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12495;&#12531;&#12489;&#12521;&#12539;&#12463;&#12521;&#12473;&#12434;GlassFish Server&#12398;&#12463;&#12521;&#12473;&#12497;&#12473;&#12395;&#32622;&#12365;&#12289;&#12469;&#12540;&#12496;&#12540;&#12398;&#36215;&#21205;&#26178;&#12395;&#12495;&#12531;&#12489;&#12521;&#12364;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
&#12525;&#12462;&#12531;&#12464;&#12434;&#26377;&#21177;&#12395;&#12375;&#12383;&#27083;&#25104;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;&#12469;&#12540;&#12496;&#12540;&#12398;&#20877;&#36215;&#21205;&#12364;&#24517;&#35201;&#12395;&#12394;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
<p>&#12469;&#12540;&#12496;&#12540;&#12398;&#20877;&#36215;&#21205;&#12399;&#12289;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#21517;&#21069;&#12364;&#12487;&#12501;&#12457;&#12523;&#12488;&#35373;&#23450;&#12363;&#12425;&#22793;&#26356;&#12373;&#12428;&#12427;&#22580;&#21512;&#12395;&#12418;&#24517;&#35201;&#12395;&#12394;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12469;&#12540;&#12496;&#12540;&#12398;&#20877;&#36215;&#21205;&#12364;&#24517;&#35201;&#12394;&#22580;&#21512;&#12395;&#12399;&#12289;&#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12398;&#21491;&#19978;&#38533;&#12395;&#12300;<code>&#20877;&#36215;&#21205;&#12364;&#24517;&#35201;&#12391;&#12377;</code>&#12301;&#12392;&#12356;&#12358;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<hr>
<hr>

</li>
</ol>
<a id="sthref117" name="sthref117"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-eelogginglevels.html">&#12525;&#12464;&#12539;&#12524;&#12505;&#12523;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-logging-max-logfiles.html">&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12373;&#12428;&#12427;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#25968;&#12398;&#21046;&#38480;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-logviewer.html">DAS&#12398;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-collectdomainlogs.html">&#12489;&#12513;&#12452;&#12531;&#12539;&#12525;&#12464;&#12434;&#21454;&#38598;&#12362;&#12424;&#12403;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
