<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-logging-max-logfiles" name="task-logging-max-logfiles"></a><a id="GHCOM00179" name="GHCOM00179"></a></p>

<h4><a id="sthref121" name="sthref121"></a><a id="sthref122" name="sthref122"></a><a id="sthref123" name="sthref123"></a>&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12373;&#12428;&#12427;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#25968;&#12398;&#21046;&#38480;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12377;&#12427;&#12392;&#12365;&#12289;GlassFish Server&#12399;<code>server.log</code>&#12392;&#12356;&#12358;&#21517;&#21069;&#12391;&#26032;&#12375;&#12356;&#31354;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#20316;&#25104;&#12375;&#12289;&#21476;&#12356;&#12501;&#12449;&#12452;&#12523;&#12398;&#21517;&#21069;&#12434;<code>server.log_</code><i>date</i>&#12395;&#22793;&#26356;&#12375;&#12414;&#12377;&#12290;<i>date</i>&#12399;&#12501;&#12449;&#12452;&#12523;&#12364;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12373;&#12428;&#12383;&#26085;&#20184;&#12392;&#26178;&#38291;&#12391;&#12377;&#12290;</p>
<p>GlassFish Server&#12391;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12373;&#12428;&#12427;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#25968;&#12434;10&#20491;&#12414;&#12391;&#12395;&#21046;&#38480;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#12371;&#12398;&#21046;&#38480;&#12395;&#36948;&#12377;&#12427;&#12392;&#12289;GlassFish Server&#12391;&#27425;&#22238;&#12395;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12377;&#12427;&#38555;&#12395;&#26368;&#12418;&#21476;&#12356;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12364;&#21066;&#38500;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<p>&#24517;&#35201;&#12395;&#24540;&#12376;&#12390;&#12289;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12373;&#12428;&#12427;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#25968;&#12398;&#21046;&#38480;&#12434;&#22793;&#26356;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#35373;&#23450;&#12375;&#12383;&#26032;&#12375;&#12356;&#21046;&#38480;&#12399;&#12289;&#12450;&#12463;&#12475;&#12473;&#12539;&#12525;&#12462;&#12531;&#12464;&#12392;&#12469;&#12540;&#12496;&#12540;&#12539;&#12525;&#12464;&#12398;&#20001;&#26041;&#12398;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12395;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<ol>
<li>
<p><code>com.sun.enterprise.server.logging.max_history_files</code>&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#12289;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12373;&#12428;&#12427;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#20445;&#25345;&#12377;&#12427;&#26368;&#22823;&#25968;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#35373;&#23450;&#12377;&#12427;&#26041;&#27861;&#12399;&#12289;<a href="task-systemproperties.html">&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#31649;&#29702;&#12377;&#12427;&#12395;&#12399;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p><code>com.sun.enterprise.server.logging.max_history_files</code>&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21205;&#20316;&#12399;&#27425;&#12398;&#12392;&#12362;&#12426;&#12391;&#12377;&#12290;</p>
<ul>
<li>
<p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;GlassFish Server&#12399;&#12289;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12373;&#12428;&#12427;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#26368;&#22823;&#12391;10&#20491;&#12414;&#12391;&#20445;&#25345;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#28961;&#21177;&#12394;&#25968;&#20516;&#12414;&#12383;&#12399;null&#12364;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;GlassFish Server&#12399;&#12289;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12373;&#12428;&#12427;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#26368;&#22823;&#12391;10&#20491;&#12414;&#12391;&#20445;&#25345;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;0&#12364;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;GlassFish Server&#12399;&#12289;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12373;&#12428;&#12427;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#20445;&#25345;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
</li>
</ul>
</li>
</ol>
<a id="sthref124" name="sthref124"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-eelogging.html">&#20840;&#33324;&#30340;&#12394;&#12525;&#12462;&#12531;&#12464;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-eelogginglevels.html">&#12525;&#12464;&#12539;&#12524;&#12505;&#12523;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-logviewer.html">DAS&#12398;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-collectdomainlogs.html">&#12489;&#12513;&#12452;&#12531;&#12539;&#12525;&#12464;&#12434;&#21454;&#38598;&#12362;&#12424;&#12403;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-systemproperties.html">&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#31649;&#29702;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
