<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-uc-addon" name="task-uc-addon"></a></p>

<h4><a id="sthref116" name="sthref116"></a><a id="sthref117" name="sthref117"></a>&#12450;&#12489;&#12458;&#12531;&#12539;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12450;&#12489;&#12458;&#12531;&#12539;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12395;&#12399;&#27425;&#12398;&#25805;&#20316;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12363;&#12425;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12392;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#20381;&#23384;&#24615;&#12398;&#20869;&#23481;&#12434;&#36578;&#36865;&#12377;&#12427;</p>
</li>
<li>
<p>&#12471;&#12473;&#12486;&#12512;&#19978;&#12398;GlassFish Server&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12452;&#12513;&#12540;&#12472;&#12398;&#19979;&#12395;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;</p>
</li>
</ul>
<p>&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12395;&#12414;&#12384;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#20182;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12364;&#24517;&#35201;&#12394;&#22580;&#21512;&#12399;&#12289;&#12381;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12418;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#26356;&#26032;&#12484;&#12540;&#12523;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#20351;&#29992;&#21487;&#33021;&#12394;&#12450;&#12489;&#12458;&#12531;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20351;&#29992;&#21487;&#33021;&#12394;&#12450;&#12489;&#12458;&#12531;&#12301;&#12506;&#12540;&#12472;&#12398;&#20351;&#29992;&#21487;&#33021;&#12394;&#12450;&#12489;&#12458;&#12531;&#12539;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#34920;&#12391;&#12289;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#20351;&#29992;&#21487;&#33021;&#12394;&#12450;&#12489;&#12458;&#12531;&#12539;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12364;&#12394;&#12356;&#22580;&#21512;&#12289;&#34920;&#12399;&#31354;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#20491;&#12293;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#36984;&#25246;&#12377;&#12427;&#12395;&#12399;&#12289;&#12381;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#21517;&#21069;&#12398;&#38563;&#12395;&#12354;&#12427;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12377;&#12409;&#12390;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#36984;&#25246;&#12377;&#12427;&#12395;&#12399;&#12289;&#34920;&#12504;&#12483;&#12480;&#12540;&#12398;&#12300;&#12377;&#12409;&#12390;&#12434;&#36984;&#25246;&#12301;&#12450;&#12452;&#12467;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12377;&#12409;&#12390;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#36984;&#25246;&#35299;&#38500;&#12377;&#12427;&#12395;&#12399;&#12289;&#34920;&#12504;&#12483;&#12480;&#12540;&#12398;&#12300;&#12377;&#12409;&#12390;&#12434;&#36984;&#25246;&#35299;&#38500;&#12301;&#12450;&#12452;&#12467;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#36984;&#25246;&#12375;&#12383;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12392;&#12381;&#12428;&#12364;&#24517;&#35201;&#12392;&#12377;&#12427;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12364;&#24517;&#35201;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12377;&#12427;&#12480;&#12452;&#12450;&#12525;&#12464;&#12539;&#12508;&#12483;&#12463;&#12473;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12480;&#12452;&#12450;&#12525;&#12464;&#12539;&#12508;&#12483;&#12463;&#12473;&#12398;&#12300;OK&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#22865;&#32004;&#12398;&#21463;&#35582;&#12364;&#27714;&#12417;&#12425;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12521;&#12452;&#12475;&#12531;&#12473;&#22865;&#32004;&#12434;&#21463;&#35582;&#12375;&#12414;&#12377;&#12290;</p>
<p>GlassFish Server&#12399;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12364;&#23436;&#20102;&#12375;&#12383;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12414;&#12377;&#12290;&#12450;&#12489;&#12458;&#12531;&#12539;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#34920;&#12363;&#12425;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12364;&#38500;&#21435;&#12373;&#12428;&#12289;&#12300;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#28168;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12301;&#12506;&#12540;&#12472;&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#28168;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#34920;&#12395;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12469;&#12540;&#12496;&#12540;&#12434;&#20877;&#36215;&#21205;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#35443;&#32048;&#12394;&#25163;&#38918;&#12399;&#12289;&#27425;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSADG00336"><i>Oracle GlassFish Server&#31649;&#29702;&#12460;&#12452;&#12489;</i>&#12398;<i>To Stop a Domain</i></a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSADG00335"><i>Oracle GlassFish Server&#31649;&#29702;&#12460;&#12452;&#12489;</i>&#12398;<i>To Start a Domain</i></a></p>
</li>
</ul>
</li>
</ol>
<a id="GHCOM328" name="GHCOM328"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-uc-update.html">&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#20351;&#29992;&#21487;&#33021;&#12394;&#26356;&#26032;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-uc-installed-remove.html">&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#28168;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-uc-pkgdetails.html">&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#35443;&#32048;&#24773;&#22577;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-uc-set-proxy.html">&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12503;&#12525;&#12461;&#12471;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
