<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmxconnectorssledit" name="task-jmxconnectorssledit"></a><a id="GHCOM00212" name="GHCOM00212"></a></p>

<h4><a id="sthref187" name="sthref187"></a><a id="sthref188" name="sthref188"></a><a id="sthref189" name="sthref189"></a>JMX&#12467;&#12493;&#12463;&#12479;&#12398;SSL&#35373;&#23450;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a><a id="sthref190" name="sthref190"></a>
<h5>&#38283;&#22987;&#21069;</h5>
<p>&#12371;&#12398;&#12479;&#12473;&#12463;&#12399;&#12289;JMX&#12467;&#12493;&#12463;&#12479;&#12391;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12395;&#12398;&#12415;&#21177;&#26524;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12398;&#19979;&#12391;&#12289;&#12300;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;JMX&#12467;&#12493;&#12463;&#12479;&#12434;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>JMX&#36890;&#20449;&#12434;&#26263;&#21495;&#21270;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;SSL&#12301;&#12479;&#12502;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;SSL&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;SSL&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;SSL3&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;SSL3&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;TLS&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;Transport Layer Security(TLS)&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#35469;&#35388;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#12522;&#12463;&#12456;&#12473;&#12488;&#12372;&#12392;&#12395;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12364;&#12469;&#12540;&#12496;&#12540;&#12395;&#23550;&#12375;&#12390;&#33258;&#36523;&#12398;&#35672;&#21029;&#12434;&#24517;&#35201;&#12392;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#35388;&#26126;&#26360;&#12398;&#12491;&#12483;&#12463;&#12493;&#12540;&#12512;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#35388;&#26126;&#26360;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12414;&#12383;&#12399;PKCS#11&#12488;&#12540;&#12463;&#12531;&#12395;&#12354;&#12427;&#12469;&#12540;&#12496;&#12540;&#35388;&#26126;&#26360;&#12398;&#12491;&#12483;&#12463;&#12493;&#12540;&#12512;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#35388;&#26126;&#26360;&#12391;&#12399;&#12289;&#21517;&#21069;&#12398;&#24418;&#24335;&#12399;<i>tokenname</i><code>:</code><i>nickname</i>&#12391;&#12377;&#12290;&#12371;&#12398;&#23646;&#24615;&#12395;&#21517;&#21069;&#12398;<i>tokenname</i><code>:</code>&#12398;&#37096;&#20998;&#12434;&#21547;&#12417;&#12427;&#12363;&#12393;&#12358;&#12363;&#12399;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12461;&#12540;&#12473;&#12488;&#12450;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12461;&#12540;&#12473;&#12488;&#12450;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;(&#20363;: <code>keystore.jks</code>)&#12290;</p>
</li>
<li>
<p>&#12300;&#12488;&#12521;&#12473;&#12488;&#12539;&#12450;&#12523;&#12468;&#12522;&#12474;&#12512;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#35388;&#26126;&#26360;&#12497;&#12473;&#12398;&#26908;&#35388;&#12395;&#20351;&#29992;&#12377;&#12427;&#12488;&#12521;&#12473;&#12488;&#31649;&#29702;&#12450;&#12523;&#12468;&#12522;&#12474;&#12512;&#12398;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;(&#20363;: PKIX)&#12290;</p>
</li>
<li>
<p>&#12300;&#35388;&#26126;&#26360;&#12398;&#26368;&#22823;&#38263;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#35388;&#26126;&#26360;&#12497;&#12473;&#12395;&#23384;&#22312;&#12391;&#12365;&#12427;&#12289;&#33258;&#24049;&#30330;&#34892;&#12391;&#12399;&#12394;&#12356;&#20013;&#38291;&#35388;&#26126;&#26360;&#12398;&#26368;&#22823;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#12289;&#12300;&#12488;&#12521;&#12473;&#12488;&#12539;&#12450;&#12523;&#12468;&#12522;&#12474;&#12512;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12364;&#12300;PKIX&#12301;&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;0&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12497;&#12473;&#12395;&#12399;&#21336;&#19968;&#12398;&#35388;&#26126;&#26360;&#12398;&#12415;&#21547;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;-1&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12497;&#12473;&#12398;&#38263;&#12373;&#12399;&#21046;&#38480;&#12373;&#12428;&#12414;&#12379;&#12435;(&#26368;&#22823;&#25968;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;)&#12290;-1&#12424;&#12426;&#23567;&#12373;&#12356;&#20516;&#12434;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#20363;&#22806;&#12364;&#12473;&#12525;&#12540;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12488;&#12521;&#12473;&#12488;&#12539;&#12473;&#12488;&#12450;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12488;&#12521;&#12473;&#12488;&#12539;&#12473;&#12488;&#12450;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;(&#20363;: <code>cacerts.jks</code>)&#12290;</p>
</li>
<li>
<p>&#12300;&#26263;&#21495;&#12473;&#12452;&#12540;&#12488;&#12301;&#38936;&#22495;&#12391;&#12289;&#20351;&#29992;&#12377;&#12427;&#26263;&#21495;&#12473;&#12452;&#12540;&#12488;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#26263;&#21495;&#12473;&#12452;&#12540;&#12488;&#12434;&#36861;&#21152;&#12375;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#26263;&#21495;&#12473;&#12452;&#12540;&#12488;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;OK&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref191" name="sthref191"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<p><a href="task-jmxconnectoredit.html">JMX&#12467;&#12493;&#12463;&#12479;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
