<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-messagesecurityconfigdelete" name="task-messagesecurityconfigdelete"></a><a id="GHCOM00206" name="GHCOM00206"></a></p>

<h4><a id="sthref174" name="sthref174"></a>&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#21066;&#38500;&#12377;&#12427;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12398;&#24038;&#20596;&#12395;&#12354;&#12427;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;<code>server-config</code>&#27083;&#25104;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12398;&#20316;&#25104;&#12392;&#21066;&#38500;&#12399;&#23455;&#34892;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;<code>server-config</code>&#12391;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12427;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12399;&#12289;SOAP&#12392;HttpServlet&#12398;&#12415;&#12391;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;2&#12388;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12399;GlassFish Server&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#26178;&#12395;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12377;&#12391;&#12395;&#20316;&#25104;&#12373;&#12428;&#12390;&#12356;&#12427;&#12383;&#12417;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;<code>server-config</code>&#12398;&#12300;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12301;&#12506;&#12540;&#12472;&#12395;&#12300;&#21066;&#38500;&#12301;&#12508;&#12479;&#12531;&#12399;&#34920;&#31034;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;
<hr>

</li>
<li>
<p>&#12300;&#21066;&#38500;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref175" name="sthref175"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12391;&#20351;&#29992;&#12373;&#12428;&#12427;GlassFish Server&#27231;&#33021;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#27083;&#25104;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#27083;&#25104;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#27083;&#25104;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
