<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-messagesecurityconfigedit" name="task-messagesecurityconfigedit"></a><a id="GHCOM00205" name="GHCOM00205"></a></p>

<h4><a id="sthref172" name="sthref172"></a>&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>GlassFish Server&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;Web&#12469;&#12540;&#12499;&#12473;&#12539;&#12456;&#12531;&#12489;&#12539;&#12509;&#12452;&#12531;&#12488;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;&#12469;&#12540;&#12496;&#12540;&#20596;&#12391;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#20351;&#29992;&#12373;&#12428;&#12427;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#22580;&#21512;&#12289;GlassFish Server&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;Web&#12469;&#12540;&#12499;&#12473;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12364;&#20351;&#29992;&#12377;&#12427;&#12503;&#12525;&#12496;&#12452;&#12480;&#12418;&#26377;&#21177;&#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12364;&#20351;&#29992;&#12377;&#12427;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#26041;&#27861;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a href="task-enablemesec4appclients.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a>&#12395;&#35352;&#36617;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12503;&#12525;&#12452;&#28168;&#12456;&#12531;&#12489;&#12539;&#12509;&#12452;&#12531;&#12488;&#12363;&#12425;&#12398;Web&#12469;&#12540;&#12499;&#12473;&#21628;&#20986;&#12375;&#12395;&#23550;&#12375;&#12390;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;GlassFish Server&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#26377;&#21177;&#12395;&#12375;&#12383;&#22580;&#21512;&#12289;GlassFish Server&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#12456;&#12531;&#12489;&#12539;&#12509;&#12452;&#12531;&#12488;&#12363;&#12425;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;&#12377;&#12409;&#12390;&#12398;&#12469;&#12540;&#12499;&#12473;&#12364;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12524;&#12452;&#12516;&#12540;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12392;&#20114;&#25563;&#24615;&#12434;&#25345;&#12388;&#12424;&#12358;&#12395;&#27083;&#25104;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#32232;&#38598;&#12377;&#12427;&#27083;&#25104;&#12398;&#35469;&#35388;&#12524;&#12452;&#12516;&#12540;&#21517;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#27083;&#25104;&#28168;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12399;SOAP&#12398;&#12415;&#12391;&#12377;&#12290;</p>
<p>&#12300;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12398;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12398;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12469;&#12540;&#12496;&#12540;&#20596;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;(&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;)&#12399;&#12289;&#29305;&#23450;&#12398;&#12469;&#12540;&#12496;&#12540;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#35672;&#21029;&#12375;&#12394;&#12356;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;&#12467;&#12540;&#12523;&#12373;&#12428;&#12427;&#12469;&#12540;&#12496;&#12540;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12391;&#12377;&#12290;<code>ServerProvider</code>&#12414;&#12383;&#12399;<code>XWS_ServerProvider</code>&#12434;&#25351;&#23450;&#12377;&#12427;&#12363;&#12289;&#20309;&#12418;&#25351;&#23450;&#12375;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12503;&#12525;&#12496;&#12452;&#12480;&#12399;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#12375;&#12383;&#12364;&#12387;&#12390;&#12289;GlassFish Server&#12399;&#12469;&#12540;&#12496;&#12540;&#20596;&#12391;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#21628;&#12403;&#20986;&#12375;&#12414;&#12379;&#12435;&#12290;&#36890;&#24120;&#12399;&#12289;<code>ServerProvider</code>&#12434;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12392;&#12375;&#12390;&#36984;&#25246;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
<li>
<p>&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12399;&#12289;&#29305;&#23450;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#35672;&#21029;&#12375;&#12394;&#12356;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12391;&#12377;&#12290;<code>ClientProvider</code>&#12414;&#12383;&#12399;<code>XWS_ClientProvider</code>&#12434;&#25351;&#23450;&#12377;&#12427;&#12363;&#12289;&#20309;&#12418;&#25351;&#23450;&#12375;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12503;&#12525;&#12496;&#12452;&#12480;&#12399;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#12375;&#12383;&#12364;&#12387;&#12390;&#12289;GlassFish Server&#12399;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#20596;&#12391;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#21628;&#12403;&#20986;&#12375;&#12414;&#12379;&#12435;&#12290;&#36890;&#24120;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12395;&#12399;&#20309;&#12418;&#36984;&#25246;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12392;&#12513;&#12483;&#12475;&#12540;&#12472;&#20445;&#35703;&#12509;&#12522;&#12471;&#12540;&#12434;&#26377;&#21177;&#12395;&#12375;&#12390;&#12289;GlassFish Server&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;Web&#12469;&#12540;&#12499;&#12473;&#12539;&#12456;&#12531;&#12489;&#12539;&#12509;&#12452;&#12531;&#12488;&#12363;&#12425;&#21628;&#12403;&#20986;&#12373;&#12428;&#12427;Web&#12469;&#12540;&#12499;&#12473;&#12395;&#36969;&#29992;&#12377;&#12427;&#22580;&#21512;&#12289;<code>ClientProvider</code>&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#26377;&#21177;&#12395;&#12375;&#12383;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12414;&#12383;&#12399;&#12469;&#12540;&#12496;&#12540;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#20445;&#35703;&#12509;&#12522;&#12471;&#12540;&#12434;&#22793;&#26356;&#12377;&#12427;&#26041;&#27861;&#12399;&#12289;<a href="task-messagesecurityproviderconfigedit.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#27083;&#25104;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
</ol>
<a id="sthref173" name="sthref173"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12391;&#20351;&#29992;&#12373;&#12428;&#12427;GlassFish Server&#27231;&#33021;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#27083;&#25104;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#27083;&#25104;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#27083;&#25104;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#27083;&#25104;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
