<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jaccprovidernew" name="task-jaccprovidernew"></a></p>
<a name="BEGIN" id="BEGIN"></a>


<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;GlassFish Server&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12395;&#12399;&#12289;<code>default</code>&#12362;&#12424;&#12403;<code>simple</code>&#12398;2&#12388;&#12398;JACC&#12503;&#12525;&#12496;&#12452;&#12480;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;&#12518;&#12540;&#12470;&#12540;&#12364;&#20316;&#25104;&#12377;&#12427;&#26032;&#35215;JACC&#12503;&#12525;&#12496;&#12452;&#12480;&#12399;&#12377;&#12409;&#12390;&#12289;&#12371;&#12428;&#12425;2&#12388;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12395;&#23550;&#12377;&#12427;&#36861;&#21152;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;GlassFish Server JACC&#12503;&#12525;&#12496;&#12452;&#12480;&#12399;&#12289;JACC&#20181;&#27096;&#12395;&#28310;&#25312;&#12375;&#12383;&#31777;&#21336;&#12394;&#12501;&#12449;&#12452;&#12523;&#12505;&#12540;&#12473;&#35469;&#35388;&#12456;&#12531;&#12472;&#12531;&#12434;&#23455;&#35013;&#12375;&#12414;&#12377;&#12290;</p>
<p>JACC&#12503;&#12525;&#12496;&#12452;&#12480;&#12398;&#23455;&#35013;&#12463;&#12521;&#12473;&#12398;&#26360;&#36796;&#12415;&#26041;&#27861;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<code><a href="http://jcp.org/en/jsr/detail?id=115">http://jcp.org/en/jsr/detail?id=115</a></code>&#12398;JACC&#20181;&#27096;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12398;&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12398;&#19979;&#12391;&#12289;JACC&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#20316;&#25104;&#12377;&#12427;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12414;&#12383;&#12399;&#12463;&#12521;&#12473;&#12479;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12377;&#12409;&#12390;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12362;&#12424;&#12403;&#12463;&#12521;&#12473;&#12479;&#12391;&#20351;&#29992;&#12391;&#12365;&#12427;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;<code>default-config</code>&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#23637;&#38283;&#12373;&#12428;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12414;&#12383;&#12399;&#12463;&#12521;&#12473;&#12479;&#12398;&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12398;&#19979;&#12391;&#12289;&#12300;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12301;&#12494;&#12540;&#12489;&#12398;&#19979;&#12391;&#12289;&#12300;JACC&#12503;&#12525;&#12496;&#12452;&#12480;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;JACC&#12503;&#12525;&#12496;&#12452;&#12480;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;JACC&#12503;&#12525;&#12496;&#12452;&#12480;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;&#26032;&#35215;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26032;&#35215;JACC&#12503;&#12525;&#12496;&#12452;&#12480;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26032;&#35215;JACC&#12503;&#12525;&#12496;&#12452;&#12480;&#12301;&#12506;&#12540;&#12472;&#12398;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12371;&#12398;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#35672;&#21029;&#12377;&#12427;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#21517;&#21069;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;<code>domain.xml</code>&#12398;<code>jacc-provider</code>&#35201;&#32032;&#12434;&#21442;&#29031;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12509;&#12522;&#12471;&#12540;&#12398;&#27083;&#25104;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12509;&#12522;&#12471;&#12540;&#27083;&#25104;&#12501;&#12449;&#12463;&#12488;&#12522;&#12434;&#23455;&#35013;&#12377;&#12427;&#12463;&#12521;&#12473;&#12398;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p><code>default</code>&#12503;&#12525;&#12496;&#12452;&#12480;&#12399;&#12289;<code>com.sun.enterprise.security.provider.PolicyConfigurationFactoryImpl</code>&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;<code>simple</code>&#12503;&#12525;&#12496;&#12452;&#12480;&#12399;&#12289;<code>com.sun.enterprise.security.jacc.provider.SimplePolicyConfigurationFactory</code>&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12509;&#12522;&#12471;&#12540;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12509;&#12522;&#12471;&#12540;&#12539;&#12501;&#12449;&#12463;&#12488;&#12522;&#12434;&#23455;&#35013;&#12377;&#12427;&#12463;&#12521;&#12473;&#12398;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p><code>default</code>&#12503;&#12525;&#12496;&#12452;&#12480;&#12399;&#12289;<code>com.sun.enterprise.security.provider.PolicyWrapper</code>&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;<code>simple</code>&#12503;&#12525;&#12496;&#12452;&#12480;&#12399;&#12289;<code>com.sun.enterprise.security.jacc.provider.SimplePolicyProvider</code>&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#12289;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#34920;&#31034;&#12373;&#12428;&#12427;&#31354;&#30333;&#34892;&#12391;&#12289;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#21517;&#12434;&#20837;&#21147;&#12375;&#12289;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>JACC&#12503;&#12525;&#12496;&#12452;&#12480;&#12391;&#20351;&#29992;&#21487;&#33021;&#12394;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#35443;&#32048;&#12399;&#12289;<a href="ref-jaccproviderprop.html">JACC&#12503;&#12525;&#12496;&#12452;&#12480;&#12395;&#22266;&#26377;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
<li>
<p>&#12300;OK&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<p><a id="sthref162" name="sthref162"></a></p>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-jaccprovideredit.html">JACC&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jaccproviderdelete.html">JACC&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
