<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-setadvanceappconfig" name="task-setadvanceappconfig"></a></p>

<h4><a id="sthref6" name="sthref6"></a><a id="sthref7" name="sthref7"></a><a id="sthref8" name="sthref8"></a><a id="sthref9" name="sthref9"></a><a id="sthref10" name="sthref10"></a>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#27083;&#25104;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#27083;&#25104;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#23550;&#12377;&#12427;&#22793;&#26356;&#12398;&#26908;&#20986;&#12392;&#22793;&#26356;&#12373;&#12428;&#12383;&#12463;&#12521;&#12473;&#12398;&#20877;&#12525;&#12540;&#12489;&#12434;&#30906;&#23455;&#12395;&#23455;&#34892;&#12391;&#12365;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#12489;&#12513;&#12452;&#12531;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12489;&#12513;&#12452;&#12531;&#23646;&#24615;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#27083;&#25104;&#12301;&#12479;&#12502;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#27083;&#25104;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20877;&#12525;&#12540;&#12489;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#21205;&#30340;&#20877;&#12525;&#12540;&#12489;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#21205;&#30340;&#20877;&#12525;&#12540;&#12489;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12420;&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#12467;&#12540;&#12489;&#12420;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#35352;&#36848;&#23376;&#12434;&#22793;&#26356;&#12375;&#12383;&#12392;&#12365;&#12399;&#12289;&#12381;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12420;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#20877;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#24517;&#35201;&#12394;&#25805;&#20316;&#12399;&#12289;&#22793;&#26356;&#12373;&#12428;&#12383;JavaServer Pages(JSP)&#12414;&#12383;&#12399;&#12463;&#12521;&#12473;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12414;&#12383;&#12399;&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#12467;&#12500;&#12540;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;&#12469;&#12540;&#12496;&#12540;&#12399;&#12289;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#20869;&#12398;&#22793;&#26356;&#12434;&#23450;&#26399;&#30340;&#12395;&#30906;&#35469;&#12375;&#12289;&#22793;&#26356;&#12395;&#20276;&#12356;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#33258;&#21205;&#30340;&#12362;&#12424;&#12403;&#21205;&#30340;&#12395;&#20877;&#12487;&#12503;&#12525;&#12452;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#27231;&#33021;&#12399;&#12289;&#22793;&#26356;&#12375;&#12383;&#12467;&#12540;&#12489;&#12434;&#12377;&#12368;&#12395;&#12486;&#12473;&#12488;&#12391;&#12365;&#12427;&#12383;&#12417;&#12289;&#38283;&#30330;&#29872;&#22659;&#12391;&#24441;&#12395;&#31435;&#12385;&#12414;&#12377;&#12290;&#12375;&#12363;&#12375;&#12289;&#26412;&#30058;&#29872;&#22659;&#12391;&#12399;&#12289;&#21205;&#30340;&#20877;&#12525;&#12540;&#12489;&#12399;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12434;&#20302;&#19979;&#12373;&#12379;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;&#20877;&#12525;&#12540;&#12489;&#12364;&#34892;&#12431;&#12428;&#12390;&#12356;&#12427;&#12392;&#12365;&#12399;&#12289;&#12381;&#12398;&#36578;&#36865;&#26178;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12364;&#28961;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12434;&#20877;&#36215;&#21205;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20877;&#12525;&#12540;&#12489;&#12398;&#12509;&#12540;&#12522;&#12531;&#12464;&#38291;&#38548;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12467;&#12540;&#12489;&#22793;&#26356;&#12395;&#12388;&#12356;&#12390;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12392;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#30906;&#35469;&#12375;&#12289;&#21205;&#30340;&#12395;&#20877;&#12525;&#12540;&#12489;&#12377;&#12427;&#38291;&#38548;(&#31186;&#21336;&#20301;)&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;2&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#31649;&#29702;&#12475;&#12483;&#12471;&#12519;&#12531;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12450;&#12463;&#12486;&#12451;&#12502;&#12391;&#12394;&#12356;&#29366;&#24907;&#12364;&#32154;&#12365;&#12289;&#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12364;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12377;&#12427;&#12414;&#12391;&#12398;&#20998;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;60&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#33258;&#21205;&#12487;&#12503;&#12525;&#12452;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#33258;&#21205;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12414;&#12383;&#12399;&#12514;&#12472;&#12517;&#12540;&#12523;&#12539;&#12501;&#12449;&#12452;&#12523;(JAR&#12289;WAR&#12289;RAR&#12289;&#12414;&#12383;&#12399;EAR)&#12434;&#23554;&#29992;&#12398;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#12467;&#12500;&#12540;&#12375;&#12390;&#33258;&#21205;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12392;&#12289;GlassFish Server&#12395;&#12424;&#12387;&#12390;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12414;&#12383;&#12399;&#12514;&#12472;&#12517;&#12540;&#12523;&#12364;&#33258;&#21205;&#30340;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#33258;&#21205;&#12487;&#12503;&#12525;&#12452;&#12398;&#12509;&#12540;&#12522;&#12531;&#12464;&#38291;&#38548;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12467;&#12540;&#12489;&#22793;&#26356;&#12395;&#12388;&#12356;&#12390;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12392;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#30906;&#35469;&#12375;&#12289;&#21205;&#30340;&#12395;&#20877;&#12525;&#12540;&#12489;&#12377;&#12427;&#38291;&#38548;(&#31186;&#21336;&#20301;)&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;2&#12391;&#12377;&#12290;&#12509;&#12540;&#12522;&#12531;&#12464;&#38291;&#38548;&#12434;&#22793;&#26356;&#12375;&#12390;&#12418;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12420;&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#12487;&#12503;&#12525;&#12452;&#12395;&#12363;&#12363;&#12427;&#26178;&#38291;&#12395;&#12399;&#24433;&#38911;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p>&#12300;&#33258;&#21205;&#12487;&#12503;&#12525;&#12452;&#12398;&#20877;&#35430;&#34892;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12377;&#12427;&#12414;&#12391;&#12395;&#37096;&#20998;&#30340;&#12395;&#12467;&#12500;&#12540;&#12373;&#12428;&#12383;&#12501;&#12449;&#12452;&#12523;&#12398;&#12469;&#12452;&#12474;&#12364;&#22793;&#26356;&#12373;&#12428;&#12378;&#12395;&#27531;&#12427;&#31186;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;4&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#33258;&#21205;&#12487;&#12503;&#12525;&#12452;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#33258;&#21205;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12398;&#23550;&#35937;&#12392;&#12375;&#12390;&#12514;&#12491;&#12479;&#12540;&#12377;&#12427;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12398;&#12501;&#12523;&#12497;&#12473;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;domain-dir<code>/autodeploy</code>&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;XML&#26908;&#26619;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#27161;&#28310;&#12362;&#12424;&#12403;GlassFish Server&#12398;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#35352;&#36848;&#23376;&#12391;&#23455;&#34892;&#12377;&#12427;XML&#26908;&#26619;&#12398;&#12479;&#12452;&#12503;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#27425;&#12398;&#12356;&#12378;&#12428;&#12363;&#12398;&#12479;&#12452;&#12503;&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<dl>
<dt><code>&#23436;&#20840;</code></dt>
<dd>
<p>XML&#26908;&#26619;&#12364;&#22833;&#25943;&#12377;&#12427;&#12392;&#12289;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12418;&#22833;&#25943;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#20516;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12377;&#12290;</p>
</dd>
<dt><code>&#35299;&#26512;&#20013;</code></dt>
<dd>
<p>XML&#26908;&#26619;&#12398;&#12456;&#12521;&#12540;&#12364;&#12524;&#12509;&#12540;&#12488;&#12373;&#12428;&#12414;&#12377;&#12364;&#12289;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12399;&#23455;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt><code>&#12394;&#12375;</code></dt>
<dd>
<p>XML&#26908;&#26619;&#12399;&#23455;&#34892;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
</dl>
</li>
<li>
<p>&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#35352;&#36848;&#23376;&#12501;&#12449;&#12452;&#12523;&#12434;&#30906;&#35469;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12505;&#12522;&#12501;&#12449;&#12452;&#12450;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12505;&#12522;&#12501;&#12449;&#12452;&#12450;&#12399;&#33258;&#21205;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12398;&#21069;&#12395;&#12501;&#12449;&#12452;&#12523;&#12398;&#27083;&#36896;&#12392;&#12467;&#12531;&#12486;&#12531;&#12484;&#12434;&#35519;&#12409;&#12414;&#12377;&#12290;&#30906;&#35469;&#12364;&#22833;&#25943;&#12377;&#12427;&#12392;&#12289;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12399;&#23455;&#34892;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#22823;&#12365;&#12394;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#30906;&#35469;&#12399;&#26178;&#38291;&#12364;&#12363;&#12363;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>JSP&#12501;&#12449;&#12452;&#12523;&#12434;&#12503;&#12522;&#12467;&#12531;&#12497;&#12452;&#12523;&#12377;&#12427;&#12395;&#12399;&#12289;&#12503;&#12522;&#12467;&#12531;&#12497;&#12452;&#12523;&#12434;&#26377;&#21177;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#28961;&#21177;&#12394;&#22580;&#21512;&#12289;JSP&#12501;&#12449;&#12452;&#12523;&#12399;&#21021;&#12417;&#12390;&#12450;&#12463;&#12475;&#12473;&#12373;&#12428;&#12383;&#23455;&#34892;&#26178;&#12395;&#12467;&#12531;&#12497;&#12452;&#12523;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#12289;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>GlassFish Server&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#23450;&#32681;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
<ul>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#34920;&#31034;&#12373;&#12428;&#12427;&#31354;&#30333;&#34892;&#12391;&#12289;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#21517;&#12434;&#20837;&#21147;&#12375;&#12289;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;&#12289;&#12381;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#32232;&#38598;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;&#12289;&#21066;&#38500;&#12377;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12398;&#24038;&#20596;&#12395;&#12354;&#12427;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21066;&#38500;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#12498;&#12531;&#12488;:</b></p>
&#12487;&#12501;&#12457;&#12523;&#12488;&#35373;&#23450;&#12395;&#36820;&#12377;&#12395;&#12399;&#12289;&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12489;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12289;&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;<br />
<hr>

</li>
<li>
<p>&#12469;&#12540;&#12496;&#12540;&#12434;&#20877;&#36215;&#21205;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="GHCOM223" name="GHCOM223"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-generaltab.html">DAS&#12398;&#19968;&#33324;&#24773;&#22577;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-logviewer.html">DAS&#12398;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-filter-logs.html">&#34920;&#31034;&#12373;&#12428;&#12383;&#12525;&#12464;&#12539;&#12524;&#12467;&#12540;&#12489;&#12434;&#12501;&#12451;&#12523;&#12479;&#12522;&#12531;&#12464;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-setadvancedomainattributes.html">&#12489;&#12513;&#12452;&#12531;&#23646;&#24615;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-collectdomainlogs.html">&#12489;&#12513;&#12452;&#12531;&#12539;&#12525;&#12464;&#12434;&#21454;&#38598;&#12362;&#12424;&#12403;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-setadminpassword.html">&#31649;&#29702;&#32773;&#12497;&#12473;&#12527;&#12540;&#12489;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-systemproperties.html">&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#31649;&#29702;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-appmonitoringdata.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-servermonitoringdata.html">&#12469;&#12540;&#12496;&#12540;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-resourcemonitoringdata.html">&#12522;&#12477;&#12540;&#12473;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
