<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterproperties" name="ref-clusterproperties"></a><a id="GHCLU00014" name="GHCLU00014"></a></p>

<h4><a id="sthref300" name="sthref300"></a><a id="sthref301" name="sthref301"></a>Propriet&agrave; cluster</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Nella pagina Propriet&agrave; cluster viene visualizzata la lista delle propriet&agrave; impostate per i cluster selezionati. Queste propriet&agrave; aggiungono informazioni di configurazione opzionali sul cluster.</p>
<p>Il campo Nome cluster &egrave; un campo di sola lettura in cui viene visualizzato il nome del cluster selezionato.</p>
<p>Per ogni propriet&agrave; vengono visualizzate le informazioni riportate di seguito.</p>
<dl>
<dt>Nome</dt>
<dd>
<p>Il nome della propriet&agrave;.</p>
</dd>
<dt>Valore</dt>
<dd>
<p>Il valore della propriet&agrave; impostato per l'istanza selezionata.</p>
</dd>
<dt>Descrizione</dt>
<dd>
<p>Descrizione di testo che fornisce ulteriori informazioni sulla propriet&agrave;.</p>
</dd>
</dl>
<p>La tabella Propriet&agrave; aggiuntive contiene inoltre le opzioni riportate di seguito.</p>
<dl>
<dt>Aggiungi propriet&agrave;</dt>
<dd>
<p>Pulsante che consente di aggiungere una propriet&agrave;. Se si fa clic su questo pulsante, viene aggiunta una riga alla tabella Propriet&agrave; aggiuntive.</p>
</dd>
<dt>Elimina propriet&agrave;</dt>
<dd>
<p>Pulsante che consente di eliminare una o pi&ugrave; propriet&agrave; selezionate. L'eliminazione comporta il ripristino del valore predefinito della propriet&agrave;. Se il valore predefinito non &egrave; stato impostato, la propriet&agrave; rimane non definita.</p>
</dd>
</dl>
<p>GlassFish Server definisce le propriet&agrave; di cluster riportate di seguito.</p>
<dl>
<dt><code>GMS_DISCOVERY_URI_LIST</code></dt>
<dd>
<p>Le posizioni delle istanze di GlassFish Server nel cluster da utilizzare per trovare il cluster. Questa propriet&agrave; &egrave; necessaria solo se il servizio GMS (Group Management Service) non usa la modalit&agrave; multicast per la trasmissione dei messaggi.</p>
<p>Di seguito vengono forniti i valori validi per questa propriet&agrave;.</p>
<ul>
<li>
<p>Lista separata da virgole di URI (Uniform Resource Identifier). Ogni URI deve consentire di individuare un'istanza di GlassFish Server o il server DAS. Questo formato &egrave; obbligatorio se pi&ugrave; istanze di GlassFish Server sono in esecuzione sullo stesso host.</p>
<p>Per ogni URI della lista viene utilizzato il formato seguente:</p>
<p><i>schema</i><code>://</code><i>nome-host o indirizzo-IP</i><code>:</code><i>porta</i></p>
<ul>
<li>
<p><i>schema</i> rappresenta lo schema dell'URI, ovvero <code>tcp</code>.</p>
</li>
<li>
<p><i>nome-host o indirizzo-IP</i> rappresenta il nome o l'indirizzo IP dell'host su cui &egrave; in esecuzione l'istanza.</p>
</li>
<li>
<p><i>porta</i> rappresenta il numero della porta su cui l'istanza ascolta i messaggi provenienti dal servizio GMS. La propriet&agrave; di sistema <code>GMS_LISTENER_PORT-</code><i>nome-cluster</i> deve essere impostata per l'istanza. Per informazioni su come impostare questa propriet&agrave; di sistema per un'istanza, vedere "<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSHAG00373">Discovering a Cluster When Multicast Transport Is Unavailable</a>" in <i>Oracle GlassFish Server High Availability Administration Guide</i>.</p>
</li>
</ul>
</li>
<li>
<p>Lista separata da virgole di indirizzi IP o nomi host sui quali sono in esecuzione il server DAS o le istanze. La lista pu&ograve; contenere una combinazione di indirizzi IP e nomi host. Questo formato pu&ograve; essere utilizzato soltanto se una sola istanza in cluster &egrave; in esecuzione su ogni host. Il valore della propriet&agrave; <code>GMS_LISTENER_PORT</code> deve essere univoco per ogni cluster di un dominio.</p>
</li>
<li>
<p>Parola chiave <code>generate</code>. Questo formato pu&ograve; essere utilizzato soltanto se una sola istanza in un cluster &egrave; in esecuzione su ogni host e se il server DAS &egrave; in esecuzione su un host distinto. Pi&ugrave; istanze nello stesso host non possono essere membri dello stesso cluster. Il valore della propriet&agrave; <code>GMS_LISTENER_PORT</code> deve essere univoco per ogni cluster di un dominio.</p>
</li>
</ul>
</dd>
<dt><code>GMS_LISTENER_PORT</code></dt>
<dd>
<p>Il numero della porta utilizzata dal cluster per l'ascolto dei messaggi trasmessi dal servizio GMS.</p>
<p>Il valore predefinito &egrave; un riferimento alla propriet&agrave; di sistema <code>GMS_LISTENER_PORT-</code><i>nome-cluster</i>. Per impostazione predefinita, questa propriet&agrave; di sistema non &egrave; impostata. In questa situazione, il servizio GMS seleziona una porta libera nell'intervallo definito dalle propriet&agrave; <code>GMS_TCPSTARTPORT</code> e <code>GMS_TCPENDPORT</code>. Per impostazione predefinita, l'intervallo &egrave; compreso tra 9090 e 9200. Il funzionamento predefinito &egrave; sufficiente nella maggior parte dei casi.</p>
<p>Se tuttavia il servizio GMS <b>non</b> utilizza la modalit&agrave; multicast per la trasmissione dei messaggi, questa propriet&agrave; deve specificare un numero di porta valido per tutte le istanze di GlassFish Server del cluster. Per soddisfare questo requisito utilizzando il valore predefinito, usare una propriet&agrave; di sistema per impostare il numero di porta per ogni singola istanza.</p>
<p>Ad esempio, utilizzare la pagina <a href="ref-clustersystemproperties.html">Propriet&agrave; di sistema del cluster</a> per creare la propriet&agrave; di sistema <code>GMS_LISTENER_PORT-</code><i>nome-cluster</i> per il server DAS. In seguito, per ogni istanza del cluster, impostare la propriet&agrave; di sistema <code>GMS_LISTENER_PORT-</code><i>nome-cluster</i> sul numero della porta utilizzata dall'istanza per l'ascolto dei messaggi del servizio GMS. Il valore predefinito della propriet&agrave; <code>GMS_LISTENER_PORT</code> per il cluster fa riferimento a questa propriet&agrave; di sistema.</p>
</dd>
<dt><code>GMS_LOOPBACK</code></dt>
<dd>
<p>Specifica se un'istanza pu&ograve; ricevere da se stessa i messaggi a livello di applicazione trasmessi dall'istanza al cluster.</p>
<p>I possibili valori sono:</p>
<dl>
<dt><code>false</code></dt>
<dd>
<p>L'istanza <i>non</i> pu&ograve; ricevere messaggi provenienti da se stessa (impostazione predefinita).</p>
</dd>
<dt><code>true</code></dt>
<dd>
<p>L'istanza pu&ograve; ricevere messaggi da se stessa. Utilizzare questa impostazione per sottoporre a test un'istanza quando &egrave; l'unica istanza in un cluster.</p>
</dd>
</dl>
</dd>
<dt><code>GMS_MULTICAST_TIME_TO_LIVE</code></dt>
<dd>
<p>Il numero massimo di iterazioni o trasmissioni che possono verificarsi per i tipi di eventi seguenti prima che un messaggio multicast venga ignorato:</p>
<ul>
<li>
<p>Individuazione gruppo</p>
</li>
<li>
<p>Heartbeat membro</p>
</li>
<li>
<p>Modifiche appartenenza</p>
</li>
</ul>
<p>Per soddisfare la configurazione della rete in cui vengono distribuite le istanze DAS e le istanze in cluster, impostare il valore minimo possibile. Per determinare il valore minimo possibile per il sistema in uso, utilizzare il comando secondario <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00259"><code>validate-multicast</code>(1)</a>.</p>
<p>Se si imposta il valore 0, i messaggi multicast non lasciano mai l'host dal quale vengono trasmessi.</p>
<p>Il valore 1 potrebbe invece impedire la trasmissione dei messaggi tra host della stessa sottorete connessi tramite switch o router.</p>
<p>L'impostazione predefinita 4 garantisce che i messaggi vengano trasmessi correttamente a tutti i membri del cluster nelle reti in cui gli host sono connessi tramite switch o router.</p>
</dd>
<dt><code>GMS_TCPENDPORT</code></dt>
<dd>
<p>Il numero di porta pi&ugrave; alto nell'intervallo all'interno del quale il servizio GMS seleziona una porta libera qualora la propriet&agrave; di sistema <code>GMS_LISTENER_PORT-</code><i>nome-cluster</i> non sia impostata. L'impostazione predefinita &egrave; 9200.</p>
</dd>
<dt><code>GMS_TCPSTARTPORT</code></dt>
<dd>
<p>Il numero di porta pi&ugrave; basso nell'intervallo all'interno del quale il servizio GMS seleziona una porta libera qualora la propriet&agrave; di sistema <code>GMS_LISTENER_PORT-</code><i>nome-cluster</i> non sia impostata. L'impostazione predefinita &egrave; 9090.</p>
</dd>
</dl>
<a id="sthref302" name="sthref302"></a>
<h5>Comandi secondari asadmin equivalenti</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00139"><code>get</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00145"><code>list</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00226"><code>set</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
