<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-gms" name="ref-gms"></a></p>

<h4><a id="sthref354" name="sthref354"></a>Modifica Group Management Service</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilizzare la pagina Group Management Service per modificare le impostazioni del servizio GMS.</p>
<p>GMS (Group Management Service) &egrave; un servizio in-process che offre servizi di monitoraggio del cluster, appartenenza del cluster e comunicazione di gruppo. Il servizio GMS &egrave; stato creato nella parte superiore di uno stack configurabile di protocolli di individuazione di appartenenza ai gruppi e di monitoraggio dell'integrit&agrave;. Il servizio GMS esegue le funzioni seguenti:</p>
<ul>
<li>
<p>notifica ai moduli registrati in un'istanza di GlassFish Server l'aggiunta o la rimozione di una o pi&ugrave; istanze membro da un cluster oppure un errore sospettato o confermato di tali istanze;</p>
</li>
<li>
<p>consente di inviare e ricevere messaggi tra i membri del cluster.</p>
</li>
</ul>
<p>La pagina Group Management Service contiene le opzioni riportate di seguito.</p>
<dl>
<dt>Carica impostazioni predefinite</dt>
<dd>
<p>Pulsante per ripristinare i valori predefiniti delle impostazioni che dispongono di valori predefiniti. Le impostazioni che non dispongono di valori predefiniti non vengono modificate.</p>
</dd>
<dt>Nome configurazione</dt>
<dd>
<p>Il nome della configurazione a cui si applicano le impostazioni presenti in questa pagina. Questo campo &egrave; di sola lettura.</p>
</dd>
<dt>Numero massimo heartbeat mancati</dt>
<dd>
<p>Il numero massimo di heartbeat mancati da un membro oltre il quale si sospetta un errore dell'istanza del server. L'impostazione predefinita &egrave; 3.</p>
</dd>
<dt>Frequenza heartbeat</dt>
<dd>
<p>Il periodo di tempo che intercorre tra gli heartbeat mancati da un membro. L'impostazione predefinita &egrave; 2000 millisecondi.</p>
</dd>
<dt>Timeout individuazione gruppo</dt>
<dd>
<p>Il periodo di tempo durante il quale il servizio GMS rimane in attesa dell'individuazione di altri membri del cluster. L'impostazione predefinita &egrave; 5000 millisecondi.</p>
</dd>
<dt>Tempo di attesa verifica errore</dt>
<dd>
<p>Il periodo di tempo di attesa prima di verificare se segnalare come in stato di errore un membro nel quale si sospetta si siano verificati errori. L'impostazione predefinita &egrave; 1500 millisecondi.</p>
</dd>
<dt>Propriet&agrave; aggiuntive</dt>
<dd>
<p>Tabella di propriet&agrave; aggiuntive per il servizio GMS.</p>
<p>GlassFish Server non definisce alcuna propriet&agrave; GMS aggiuntiva.</p>
<p>Per ogni propriet&agrave; vengono visualizzate le informazioni riportate di seguito.</p>
<dl>
<dt>Nome</dt>
<dd>
<p>Il nome della propriet&agrave;.</p>
</dd>
<dt>Valore</dt>
<dd>
<p>Il valore della propriet&agrave; impostato per l'istanza selezionata.</p>
</dd>
<dt>Descrizione</dt>
<dd>
<p>Descrizione di testo che fornisce ulteriori informazioni sulla propriet&agrave;.</p>
</dd>
</dl>
<p>La tabella Propriet&agrave; aggiuntive contiene inoltre le opzioni riportate di seguito.</p>
<dl>
<dt>Aggiungi propriet&agrave;</dt>
<dd>
<p>Pulsante che consente di aggiungere una propriet&agrave;. Se si fa clic su questo pulsante, viene aggiunta una riga alla tabella Propriet&agrave; aggiuntive.</p>
</dd>
<dt>Elimina propriet&agrave;</dt>
<dd>
<p>Pulsante che consente di eliminare una o pi&ugrave; propriet&agrave; selezionate. L'eliminazione comporta il ripristino del valore predefinito della propriet&agrave;. Se il valore predefinito non &egrave; stato impostato, la propriet&agrave; rimane non definita.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref355" name="sthref355"></a>
<h5>Task correlati</h5>
<ul>
<li>
<p><a href="task-gmsenable.html">Per abilitare il servizio GMS (Group Management Service)</a></p>
</li>
<li>
<p><a href="task-gms.html">Per configurare il servizio GMS (Group Management Service)</a></p>
</li>
<li>
<p><a href="task-gmscluster.html">Per configurare le impostazioni del servizio GMS per un cluster</a></p>
</li>
</ul>





<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
