<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-availabilityservice" name="task-availabilityservice"></a><a id="GHCLU00029" name="GHCLU00029"></a></p>

<h4><a id="sthref9" name="sthref9"></a><a id="sthref10" name="sthref10"></a><a id="sthref11" name="sthref11"></a><a id="sthref12" name="sthref12"></a>Per configurare le impostazioni di disponibilit&agrave; per un cluster</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Espandere il nodo Configurazione nell'albero di navigazione.</p>
</li>
<li>
<p>Selezionare la configurazione per il cluster da modificare.</p>
</li>
<li>
<p>Nel nodo della configurazione, selezionare il nodo Servizio disponibilit&agrave;.</p>
<p>Viene visualizzata la pagina Servizio disponibilit&agrave;.</p>
</li>
<li>
<p>Nel campo Servizio disponibilit&agrave; selezionare la casella Abilitato per abilitare la disponibilit&agrave; per il cluster con la configurazione selezionata.</p>
<p>Per disabilitare la disponibilit&agrave;, rimuovere il segno di spunta dalla casella Servizio disponibilit&agrave; abilitato.</p>
</li>
<li>
<p>Nella sezione Propriet&agrave; aggiuntive, specificare le propriet&agrave; aggiuntive.</p>
<p>GlassFish Server non definisce alcuna propriet&agrave; aggiuntiva per la disponibilit&agrave; del cluster.</p>
<ul>
<li>
<p>Per aggiungere una propriet&agrave;, fare clic sul pulsante Aggiungi propriet&agrave;. Nella riga vuota visualizzata, digitare il nome della propriet&agrave; nel campo Nome e il valore della propriet&agrave; nel campo Valore.</p>
</li>
<li>
<p>Per modificare una propriet&agrave;, &egrave; necessario modificare il valore del campo Valore della propriet&agrave;.</p>
</li>
<li>
<p>Per eliminare una propriet&agrave;, selezionare la casella di controllo a sinistra del campo Nome corrispondente alla propriet&agrave; da eliminare, quindi fare clic sul pulsante Elimina propriet&agrave;.</p>
</li>
</ul>
</li>
<li>
<p>Fare clic su Salva.</p>
</li>
</ol>
<a id="sthref13" name="sthref13"></a>
<h5>Vedere anche</h5>
<ul>
<li>
<p><a href="task-create-cluster.html">Per creare un cluster</a></p>
</li>
<li>
<p><a href="task-delete-cluster.html">Per eliminare un cluster</a></p>
</li>
<li>
<p><a href="task-start-cluster.html">Per avviare un cluster</a></p>
</li>
<li>
<p><a href="task-stop-cluster.html">Per arrestare un cluster</a></p>
</li>
<li>
<p><a href="task-modify-cluster-config.html">Per modificare la configurazione di un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-deploy.html">Per distribuire un'applicazione a un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-list.html">Per elencare le applicazioni distribuite a un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-undeploy.html">Per annullare la distribuzione delle applicazioni a un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-remove.html">Per rimuovere le applicazioni da un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-edit.html">Per modificare un'applicazione distribuita a un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-enable-disable.html">Per abilitare o disabilitare un'applicazione distribuita a un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-lb-enable-disable.html">Per abilitare o disabilitare il bilanciamento del carico per un'applicazione distribuita a un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-resource-create.html">Per creare una risorsa per un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-resource-display.html">Per elencare le risorse per un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-resource-enable-disable.html">Per abilitare o disabilitare una risorsa a livello globale</a></p>
</li>
<li>
<p><a href="task-cluster-resource-edit.html">Per modificare una risorsa per un cluster</a></p>
</li>
<li>
<p><a href="task-upgrade-components.html">Per aggiornare i componenti senza perdita di servizio</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
