<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-batchjobslisting" name="ref-batchjobslisting"></a></p>

<h4>Execu&ccedil;&otilde;es de Jobs em Lote</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>O GlassFish Server fornece um tempo de execu&ccedil;&atilde;o em batch para a programa&ccedil;&atilde;o e execu&ccedil;&atilde;o de jobs em batch. Os jobs em batch geralmente s&atilde;o de longa execu&ccedil;&atilde;o, tarefas orientadas a alto volume que cont&ecirc;m uma s&eacute;rie de etapas. Aplica&ccedil;&otilde;es em lote submetem jobs ao tempo de execu&ccedil;&atilde;o em batch e fornecem instru&ccedil;&otilde;es sobre como e quando executar as etapas. O tempo de execu&ccedil;&atilde;o em batch processa as etapas e armazena informa&ccedil;&otilde;es sobre os jobs em um reposit&oacute;rio de jobs. No GlassFish Server, o reposit&oacute;rio de jobs &eacute; um banco de dados.</p>
<p>Use a p&aacute;gina Execu&ccedil;&otilde;es de Jobs em Batch para exibir detalhes sobre execu&ccedil;&otilde;es registradas de jobs em batch.</p>
<p>A p&aacute;gina Execu&ccedil;&otilde;es de Jobs em Batch cont&eacute;m as seguintes informa&ccedil;&otilde;es:</p>
<dl>
<dt>Nome da Inst&acirc;ncia</dt>
<dt>Nome do Cluster</dt>
<dd>
<p>O nome da inst&acirc;ncia de cluster ou servidor do GlassFish &agrave; qual a configura&ccedil;&atilde;o se aplica.</p>
</dd>
<dt>Jobs em Batch</dt>
<dd>
<p>Uma lista de execu&ccedil;&otilde;es de job em batch registradas para a inst&acirc;ncia ou cluster. Para cada execu&ccedil;&atilde;o, as seguintes informa&ccedil;&otilde;es s&atilde;o exibidas:</p>
<dl>
<dt>ID de Execu&ccedil;&atilde;o</dt>
<dd>
<p>O ID designado &agrave; execu&ccedil;&atilde;o do job em batch. Se voc&ecirc; clicar no ID de execu&ccedil;&atilde;o, a p&aacute;gina Detalhes da Execu&ccedil;&atilde;o do Job em Batch correspondente ser&aacute; aberta. Uma nova execu&ccedil;&atilde;o &eacute; criada na primeira vez em que um job &eacute; iniciado e cada vez que a execu&ccedil;&atilde;o existente &eacute; reiniciada.</p>
</dd>
<dt>Nome do Job</dt>
<dd>
<p>O nome do job.</p>
</dd>
<dt>Status do Batch</dt>
<dd>
<p>O status da execu&ccedil;&atilde;o conforme definido pelo tempo de execu&ccedil;&atilde;o do batch.</p>
</dd>
<dt>Status de Sa&iacute;da</dt>
<dd>
<p>O status da execu&ccedil;&atilde;o conforme definido pelo XML do Job ou pela aplica&ccedil;&atilde;o em batch. Por default, o status de sa&iacute;da e o status do lote s&atilde;o iguais, a menos que o status de sa&iacute;da seja substitu&iacute;do explicitamente.</p>
</dd>
<dt>ID da Inst&acirc;ncia</dt>
<dd>
<p>O ID designado &agrave; inst&acirc;ncia do job em batch. A inst&acirc;ncia de um job em batch pode ter v&aacute;rias execu&ccedil;&otilde;es.</p>
</dd>
<dt>Hor&aacute;rio de In&iacute;cio</dt>
<dd>
<p>O hor&aacute;rio em que a execu&ccedil;&atilde;o foi iniciada.</p>
</dd>
<dt>Hor&aacute;rio de T&eacute;rmino</dt>
<dd>
<p>O hor&aacute;rio em que a execu&ccedil;&atilde;o foi finalizada.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref26" name="sthref26"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="tasks-topic-group002.html#CEGEIGCJ">Para Exibir Execu&ccedil;&otilde;es de Jobs em Batch</a></p>
</li>
<li>
<p><a href="tasks-topic-group004.html#CEGEEGBB">Para Configurar o Tempo de Execu&ccedil;&atilde;o em Batch</a></p>
</li>
</ul>
<a id="GHJML141" name="GHJML141"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM861"><code>list-batch-jobs</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM884"><code>list-batch-job-executions</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM895"><code>list-batch-job-steps</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM863"><code>list-batch-runtime-configuration</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM897"><code>set-batch-runtime-configuration</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
