<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-javamailsessionsedit" name="ref-javamailsessionsedit"></a></p>

<h4><a id="sthref35" name="sthref35"></a>Editar Sess&atilde;o JavaMail</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilize a p&aacute;gina Editar Sess&atilde;o JavaMail para editar uma sess&atilde;o JavaMail.</p>
<p>A p&aacute;gina Editar Sess&atilde;o JavaMail cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Carregar Defaults</dt>
<dd>
<p>Bot&atilde;o para restaurar defini&ccedil;&otilde;es para seus valores default. Defini&ccedil;&otilde;es que n&atilde;o tiveram seus valores default alterados.</p>
</dd>
<dt>Nome JNDI</dt>
<dd>
<p>Um nome exclusivo que identifica a sess&atilde;o JavaMail. O nome JNDI &eacute; um campo somente para leitura. Voc&ecirc; somente pode especificar o nome JNDI quando cria uma nova sess&atilde;o JavaMail.</p>
</dd>
<dt>Host de Correio</dt>
<dd>
<p>O nome do host do servidor de correio default. Os m&eacute;todos de conex&atilde;o dos objetos Armazenamento e Transporte usam esse valor se n&atilde;o &eacute; fornecida uma propriedade de host espec&iacute;fica do protocolo. O nome deve ser resol&uacute;vel para um nome de host real.</p>
</dd>
<dt>Usu&aacute;rio Default</dt>
<dd>
<p>O nome de usu&aacute;rio a ser fornecido ao conectar-se a um servidor de correio. Os m&eacute;todos de conex&atilde;o dos objetos Armazenamento e Transporte usam esse valor se n&atilde;o &eacute; fornecida uma propriedade de nome de usu&aacute;rio espec&iacute;fica do protocolo. O nome de usu&aacute;rio deve conter somente caracteres alfanum&eacute;ricos, sublinhado, tra&ccedil;o ou ponto.</p>
</dd>
<dt>Endere&ccedil;o Default do Remetente</dt>
<dd>
<p>O endere&ccedil;o de e-mail do usu&aacute;rio default. O formato &eacute;</p>
</dd>
</dl>


 
<p><code>Nome do usu&aacute;rio<i>@</i><i>host</i>.<i>domain</i>.</code></p>
<dl>
<dt>Ordem de Implanta&ccedil;&atilde;o</dt>
</dl>
<p>A ordem de implanta&ccedil;&atilde;o do recurso de sess&atilde;o do JavaMail.</p>
<dl>
<dt>Descri&ccedil;&atilde;o</dt>
</dl>
<p>Uma descri&ccedil;&atilde;o dessa sess&atilde;o de correio.</p>
<dl>
<dt>Status</dt>
</dl>
<p>Se o recurso est&aacute; dispon&iacute;vel no runtime.</p>
<p>Se apenas a inst&acirc;ncia do servidor default, <code>server</code>, existir no dom&iacute;nio, a disponibilidade de runtime do recurso poder&aacute; ser ativada ou desativada. A disponibilidade de runtime est&aacute; ativada por default.</p>
<p>Se clusters ou inst&acirc;ncias standalone tiverem sido criados no dom&iacute;nio, utilize a guia Alvo para controlar a disponibilidade de runtime do recurso em seus alvos.</p>
<dl>
<dt>Protocolo de Armazenamento</dt>
</dl>
<p>O servi&ccedil;o de protocolo de armazenamento, que se conecta a um servidor de correio, recuperar mensagens e as salva em uma ou mais pastas. Os valores permitidos s&atilde;o <code>imap</code>, <code>pop3</code>, <code>imaps</code> e <code>pop3s</code>. O valor default &eacute; <code>imap</code>.</p>
<dl>
<dt>Classe do Protocolo de Armazenamento</dt>
</dl>
<p>A classe de implementa&ccedil;&atilde;o do provedor do servi&ccedil;o para armazenamento. Os valores permitidos s&atilde;o:</p>
<ul>
<li>
<p><code>com.sun.mail.imap.IMAPStore</code></p>
</li>
<li>
<p><code>com.sun.mail.pop3.POP3Store</code></p>
</li>
<li>
<p><code>com.sun.mail.imap.IMAPSSLStore</code></p>
</li>
<li>
<p><code>com.sun.mail.pop3.POP3SSLStore</code></p>
</li>
</ul>
<p>O valor default &eacute; <code>com.sun.mail.imap.IMAPStore</code>.</p>
<dl>
<dt>Protocolo de Transporte</dt>
</dl>
<p>O servi&ccedil;o de protocolo de transporte, que envia mensagens. Os valores permitidos s&atilde;o <code>smtp</code> e <code>smtps</code>. O valor default &eacute; <code>smtp</code>.</p>
<dl>
<dt>Classe do Protocolo de Transporte</dt>
</dl>
<p>A classe de implementa&ccedil;&atilde;o do provedor do servi&ccedil;o de transporte. Os valores permitidos s&atilde;o:</p>
<ul>
<li>
<p><code>com.sun.mail.smtp.SMTPTransport</code></p>
</li>
<li>
<p><code>com.sun.mail.smtp.SMTPSSLTransport</code></p>
</li>
</ul>
<p>O valor default &eacute; <code>com.sun.mail.smtp.SMTPTransport</code>.</p>
<dl>
<dt>Depura&ccedil;&atilde;o</dt>
</dl>
<p>Se essa op&ccedil;&atilde;o for selecionada, a depura&ccedil;&atilde;o para esse recurso &eacute; ativada. Se o n&iacute;vel de log JavaMail estiver definido como <code>BOM</code> ou melhor, a sa&iacute;da de depura&ccedil;&atilde;o ser&aacute; gerada e inclu&iacute;da no arquivo de log do sistema. Para obter informa&ccedil;&otilde;es sobre a defini&ccedil;&atilde;o do n&iacute;vel de log, consulte <a href="../../../common/en/help/task-eelogginglevels.html">Para Configurar N&iacute;veis de Log</a>.</p>
<dl>
<dt>Propriedades Adicionais</dt>
</dl>
<p>Propriedades adicionais para a sess&atilde;o JavaMail. Para obter uma lista das propriedades dispon&iacute;veis, consulte a documenta&ccedil;&atilde;o da API JavaMail (<code><a href="http://java.sun.com/products/javamail/javadocs/index.html">http://java.sun.com/products/javamail/javadocs/index.html</a></code>). Propriedades adicionais devem come&ccedil;ar com <code>mail-</code> e devem usar h&iacute;fens, n&atilde;o pontos, como separadores. Por exemplo, <code>mail-debug</code> &eacute; correto, mas <code>mail.debug</code> n&atilde;o. O back-end do GlassFish Server converte os h&iacute;fens nos pontos esperados pela JavaMail API.</p>
<dl>
<dd><a id="GHJML121" name="GHJML121"></a></dd>
</dl>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-javamailsessioncreate.html">Para Criar uma Sess&atilde;o JavaMail</a></p>
</li>
<li>
<p><a href="task-javamailsessionsedit.html">Para Editar uma Sess&atilde;o JavaMail</a></p>
</li>
<li>
<p><a href="task-javamailsessionsdelete.html">Para Deletar uma Sess&atilde;o JavaMail</a></p>
</li>
</ul>
<p><a id="GHJML122" name="GHJML122"></a></p>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00035"><code>create-javamail-resource</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00172"><code>list-javamail-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00087"><code>delete-javamail-resource</code>(1)</a></p>
</li>
</ul>
<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
