<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-batchjobsconfiguration" name="ref-batchjobsconfiguration"></a></p>

<h4>Configura&ccedil;&atilde;o do Tempo de Execu&ccedil;&atilde;o em Batch</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>O GlassFish Server fornece um tempo de execu&ccedil;&atilde;o em batch para a programa&ccedil;&atilde;o e execu&ccedil;&atilde;o de jobs em batch. Os jobs em batch geralmente s&atilde;o de longa execu&ccedil;&atilde;o, tarefas orientadas a alto volume que cont&ecirc;m uma s&eacute;rie de etapas. Aplica&ccedil;&otilde;es em lote submetem jobs ao tempo de execu&ccedil;&atilde;o em batch e fornecem instru&ccedil;&otilde;es sobre como e quando executar as etapas. O tempo de execu&ccedil;&atilde;o em batch processa as etapas e armazena informa&ccedil;&otilde;es sobre os jobs em um reposit&oacute;rio de jobs. No GlassFish Server, o reposit&oacute;rio de jobs &eacute; um banco de dados.</p>
<p>Use a p&aacute;gina Configura&ccedil;&atilde;o de Tempo de Execu&ccedil;&atilde;o em Batch para exibir e alterar a configura&ccedil;&atilde;o do tempo de execu&ccedil;&atilde;o em batch. O tempo de execu&ccedil;&atilde;o em batch usa um servi&ccedil;o executor gerenciado e uma origem de dados para executar jobs em batch. O servi&ccedil;o executor gerenciado fornece threads aos jobs, e a origem de dados armazena informa&ccedil;&otilde;es sobre o job. Os dados de configura&ccedil;&atilde;o de runtime de batch s&atilde;o armazenados no elemento <code>config</code> no <code>domain.xml</code>.</p>
<p>A p&aacute;gina Configura&ccedil;&atilde;o do Tempo de Execu&ccedil;&atilde;o em Batch cont&eacute;m as seguintes informa&ccedil;&otilde;es:</p>
<dl>
<dt>Nome da Inst&acirc;ncia</dt>
<dt>Nome do Cluster</dt>
<dd>
<p>O nome da inst&acirc;ncia de cluster ou servidor do GlassFish &agrave; qual a configura&ccedil;&atilde;o se aplica. Este &eacute; um campo somente para leitura.</p>
</dd>
<dt>Nome de Pesquisa do Servi&ccedil;o Executor</dt>
<dd>
<p>O nome da pesquisa JNDI do servi&ccedil;o executor gerenciado que fornece threads a jobs batch. O servi&ccedil;o executor gerenciado default &eacute; <code>concurrent/__defaultManagedExecutorService</code>.</p>
<p>O servi&ccedil;o executor gerenciado pode ser alterado ap&oacute;s um job em batch ter sido submetido ao tempo de execu&ccedil;&atilde;o em lote sem causar impacto sobre a execu&ccedil;&atilde;o do job.</p>
</dd>
<dt>Nome de Pesquisa da Origem de Dados</dt>
<dd>
<p>O nome da pesquisa JNDI da origem de dados que armazena informa&ccedil;&otilde;es sobre jobs em batch atuais e anteriores. A origem de dados default &eacute; <code>jdbc/__TimerPool</code>.</p>
<p>N&atilde;o altere a origem de dados ap&oacute;s o primeiro job em batch ter sido submetido &agrave; execu&ccedil;&atilde;o do tempo de execu&ccedil;&atilde;o em batch. Se a origem de dados tiver de ser alterada, interrompa e reinicie o dom&iacute;nio e, em seguida, fa&ccedil;a a altera&ccedil;&atilde;o antes de qualquer job ser inicializado ou reinicializado. No entanto, depois que a origem de dados tiver sido alterada, as informa&ccedil;&otilde;es armazenadas na origem de dados anterior ficar&atilde;o inacess&iacute;veis.</p>
</dd>
</dl>
<a id="sthref31" name="sthref31"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="tasks-topic-group004.html#CEGEEGBB">Para Configurar o Tempo de Execu&ccedil;&atilde;o em Batch</a></p>
</li>
<li>
<p><a href="tasks-topic-group002.html#CEGEIGCJ">Para Exibir Execu&ccedil;&otilde;es de Jobs em Batch</a></p>
</li>
</ul>
<a id="sthref32" name="sthref32"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM897"><code>set-batch-runtime-configuration</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM863"><code>list-batch-runtime-configuration</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM861"><code>list-batch-jobs</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM884"><code>list-batch-job-executions</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM895"><code>list-batch-job-steps</code>(1)</a></p>
</li>
</ul>




<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
