<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-javamailsessioncreate" name="task-javamailsessioncreate"></a><a id="GHJML00011" name="GHJML00011"></a></p>

<h4><a id="sthref2" name="sthref2"></a>Para Criar uma Sess&atilde;o JavaMail</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Recursos.</p>
</li>
<li>
<p>No n&oacute; Recursos, selecione Sess&otilde;es JavaMail.</p>
<p>A p&aacute;gina Sess&otilde;es JavaMail &eacute; aberta.</p>
</li>
<li>
<p>Na tabela Sess&otilde;es, clique em Novo.</p>
<p>A p&aacute;gina Nova sess&atilde;o JavaMail ser&aacute; aberta.</p>
</li>
<li>
<p>No campo Nome JNDI, digite um nome exclusivo para o recurso de sess&atilde;o de correio.</p>
<p>Use o prefixo de subcontexto de nomea&ccedil;&atilde;o <code>mail/</code>para recursos do JavaMail. Por exemplo, <code>mail/MySession</code>. O nome deve conter somente caracteres alfanum&eacute;ricos, sublinhado, tra&ccedil;o ou ponto.</p>
</li>
<li>
<p>No campo Host de Correio, digite o nome do host do servidor de correio default.</p>
<p>Os m&eacute;todos de conex&atilde;o dos objetos Armazenamento e Transporte usam esse valor se n&atilde;o &eacute; fornecida uma propriedade de host espec&iacute;fica do protocolo. O nome deve ser resol&uacute;vel para um nome de host real.</p>
</li>
<li>
<p>No campo Usu&aacute;rio Default, digite o nome do usu&aacute;rio a ser fornecido durante a conex&atilde;o com um servidor de correio.</p>
<p>Os m&eacute;todos de conex&atilde;o dos objetos Armazenamento e Transporte usam esse valor se n&atilde;o &eacute; fornecida uma propriedade de nome de usu&aacute;rio espec&iacute;fica do protocolo. O nome de usu&aacute;rio deve conter somente caracteres alfanum&eacute;ricos, sublinhado, tra&ccedil;o ou ponto.</p>
</li>
<li>
<p>No campo Endere&ccedil;o Default do Remetente, digite o endere&ccedil;o de e-mail do usu&aacute;rio default.</p>
<p>O formato &eacute;</p>
</li>
</ol>



 
<p><code>Nome do usu&aacute;rio<i>@</i><i>host</i>.<i>domain</i>.</code></p>
<p>No campo Descri&ccedil;&atilde;o, digite uma descri&ccedil;&atilde;o para a sess&atilde;o de correio.</p>
<p>Marque a caixa de sele&ccedil;&atilde;o Status Ativado para ativar a sess&atilde;o de correio.</p>
<p>O valor default &eacute; Ativado.</p>
<p>No campo Protocolo do Armazenamento, defina o servi&ccedil;o de protocolo do armazenamento a ser utilizado.</p>
<p>O servi&ccedil;o de protocolo do armazenamento conecta-se a um servidor de correio, recupera mensagens e as salva em uma ou mais pastas. Os valores permitidos s&atilde;o <code>imap</code>, <code>pop3</code>, <code>imaps</code> e <code>pop3s</code>. O valor default &eacute; <code>imap</code>.</p>
<p>No campo Classe de Protocolo do Armazenamento, especifique a classe de implementa&ccedil;&atilde;o do provedor de servi&ccedil;o para armazenamento.</p>
<p>Os valores permitidos s&atilde;o:</p>
<ul>
<li>
<p><code>com.sun.mail.imap.IMAPStore</code></p>
</li>
<li>
<p><code>com.sun.mail.pop3.POP3Store</code></p>
</li>
<li>
<p><code>com.sun.mail.imap.IMAPSSLStore</code></p>
</li>
<li>
<p><code>com.sun.mail.pop3.POP3SSLStore</code></p>
</li>
</ul>
<p>O valor default &eacute; <code>com.sun.mail.imap.IMAPStore</code>.</p>
<p>No campo Protocolo do Transporte, especifique o m&eacute;todo de comunica&ccedil;&atilde;o de transporte.</p>
<p>O servi&ccedil;o de protocolo de transporte envia mensagens. Os valores permitidos s&atilde;o <code>smtp</code> e <code>smtps</code>. Por default, o Protocolo do Transporte &eacute; <code>smtp</code>.</p>
<p>No campo Classe do Protocolo de Transporte, especifique a classe de implementa&ccedil;&atilde;o do provedor de servi&ccedil;o para transporte.</p>
<p>O valor default &eacute; <code>com.sun.mail.smtp.SMTPTransport</code>.</p>
<p>Marque a caixa de sele&ccedil;&atilde;o Depura&ccedil;&atilde;o para ativar a sa&iacute;da de depura&ccedil;&atilde;o extra, incluindo um rastreamento de protocolo, para a sess&atilde;o de correio.</p>
<p>Se o n&iacute;vel de log JavaMail estiver definido como <code>BOM</code> ou melhor, a sa&iacute;da de depura&ccedil;&atilde;o ser&aacute; gerada e inclu&iacute;da no arquivo de log do sistema. Para obter informa&ccedil;&otilde;es sobre a defini&ccedil;&atilde;o do n&iacute;vel de log, consulte <a href="../../../common/en/help/task-eelogginglevels.html">Para Configurar N&iacute;veis de Log</a>. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
<p>Na tabela Propriedades Adicionais, especifique propriedades adicionais requeridas por aplica&ccedil;&otilde;es, como uma propriedade de nome de usu&aacute;rio ou de host espec&iacute;fica do protocolo.</p>
<p>Para obter uma lista das propriedades dispon&iacute;veis, consulte a documenta&ccedil;&atilde;o da API JavaMail (<code><a href="http://java.sun.com/products/javamail/javadocs/index.html">http://java.sun.com/products/javamail/javadocs/index.html</a></code>). Propriedades adicionais devem come&ccedil;ar com <code>mail-</code> e devem usar h&iacute;fens, n&atilde;o pontos, como separadores. Por exemplo, <code>mail-debug</code> &eacute; correto, mas <code>mail.debug</code> n&atilde;o. O back-end do GlassFish Server converte os h&iacute;fens nos pontos esperados pela JavaMail API.</p>
<p>Para adicionar uma propriedade, clique no bot&atilde;o Adicionar Propriedade. Na linha em branco que for exibida, digite o nome da propriedade no campo Nome e digite o valor da propriedade no campo Valor.</p>
<p>Na lista de alvos dispon&iacute;veis, selecione o alvo ou alvos dos quais configurar a sess&atilde;o de e-mail e clique em Adicionar.</p>
<p>Os alvos podem ser clusters ou inst&acirc;ncias standalone do servidor. Se um alvo n&atilde;o for selecionado, a sess&atilde;o &eacute; configurado com a inst&acirc;ncia default do servidor <code>server</code>.</p>
<p>Clique em OK.</p>
<a id="GHJML103" name="GHJML103"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-javamailsessionsedit.html">Para Editar uma Sess&atilde;o JavaMail</a></p>
</li>
<li>
<p><a href="task-javamailsessionsdelete.html">Para Deletar uma Sess&atilde;o JavaMail</a></p>
</li>
</ul>
<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
