<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="CEGEEGBB" name="CEGEEGBB"></a></p>
<!-- infolevel="all" infotype="General" -->
<h4><a id="sthref6" name="sthref6"></a>Para Configurar o Tempo de Execu&ccedil;&atilde;o em Batch</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, selecione a inst&acirc;ncia de cluster ou servidor do GlassFish Server cujas execu&ccedil;&otilde;es de job em batch voc&ecirc; deseja exibir.</p>
<p>A p&aacute;gina Informa&ccedil;&otilde;es Gerais ser&aacute; aberta.</p>
</li>
<li>
<p>Selecione a guia Batch.</p>
<p>A p&aacute;gina Execu&ccedil;&otilde;es de Job em Batch &eacute; aberta.</p>
</li>
<li>
<p>Clique na guia Configura&ccedil;&atilde;o.</p>
<p>A p&aacute;gina Configura&ccedil;&atilde;o do Tempo de Execu&ccedil;&atilde;o em Batch &eacute; aberta. O runtime usa um servi&ccedil;o executor gerenciado e uma origem de dados para executar jobs em batch.</p>
</li>
<li>
<p>Na lista drop-down Nome de Pesquisa do Servi&ccedil;o Executor, selecione o executor gerenciado a ser usado para fornecer threads aos jobs em batch.</p>
<p>O servi&ccedil;o executor gerenciado default &eacute; <code>concurrent/__defaultManagedExecutorService</code>. O servi&ccedil;o executor gerenciado pode ser alterado ap&oacute;s um job em batch ter sido submetido ao tempo de execu&ccedil;&atilde;o em lote sem causar impacto sobre a execu&ccedil;&atilde;o do job.</p>
</li>
<li>
<p>Na lista drop-down Nome de Pesquisa da Origem de Dados, selecione a origem de dados a ser usada para armazenar informa&ccedil;&otilde;es sobre o job.</p>
<p>A origem de dados default &eacute; <code>jdbc/__TimerPool</code>. N&atilde;o altere a origem de dados ap&oacute;s o primeiro job em batch ter sido submetido &agrave; execu&ccedil;&atilde;o do tempo de execu&ccedil;&atilde;o em batch. Se a origem de dados tiver de ser alterada, interrompa e reinicie o dom&iacute;nio e, em seguida, fa&ccedil;a a altera&ccedil;&atilde;o antes de qualquer job ser inicializado ou reinicializado. No entanto, depois que a origem de dados tiver sido alterada, as informa&ccedil;&otilde;es armazenadas na origem de dados anterior ficar&atilde;o inacess&iacute;veis.</p>
</li>
<li>
<p>Clique em Salvar.</p>
</li>
</ol>
<a id="sthref7" name="sthref7"></a>
<h5>Consulte Tamb&eacute;m</h5>
<p><a href="tasks-topic-group002.html#CEGEIGCJ">Para Exibir Execu&ccedil;&otilde;es de Jobs em Batch</a></p>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
