<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jndiexternalresourcecreate" name="task-jndiexternalresourcecreate"></a></p>

<h4><a id="sthref20" name="sthref20"></a><a id="sthref21" name="sthref21"></a>Para Criar um Recurso JNDI Externo</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Um recurso JNDI externo acessa um reposit&oacute;rio JNDI externo, como um servidor LDAP.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Recursos.</p>
</li>
<li>
<p>No n&oacute; Recursos, expanda o n&oacute; JNDI.</p>
</li>
<li>
<p>No n&oacute; JNDI, selecione Recursos Externos.</p>
<p>A p&aacute;gina Recursos Externos &eacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Recursos Externos, clique em Novo.</p>
<p>A p&aacute;gina Novos Recursos Externos &eacute; aberta.</p>
</li>
<li>
<p>No campo Nome da JNDI, digite um nome exclusivo.</p>
<p>Esse nome ser&aacute; registrado no servi&ccedil;o atribui&ccedil;&atilde;o de atribui&ccedil;&atilde;o de nomes de JNDI. O nome JNDI organiza e localiza os componentes em um ambiente de computa&ccedil;&atilde;o distribu&iacute;do, de maneira semelhante ao cat&aacute;logo de cart&atilde;o que organiza e representa os locais de livros em uma biblioteca. Consequentemente, o nome da JNDI torna-se um m&eacute;todo importante de acessar o recurso.</p>
</li>
<li>
<p>No campo Tipo de Recurso, efetue um dos procedimentos a seguir.</p>
<ul>
<li>
<p>Na lista drop-down, selecione uma defini&ccedil;&atilde;o de tipo.</p>
</li>
<li>
<p>Selecione o segundo bot&atilde;o de op&ccedil;&atilde;o e digite uma defini&ccedil;&atilde;o de tipo totalmente qualificada que siga o formato <i>xxx</i><code>.</code><i>xxx</i>.</p>
</li>
</ul>
</li>
<li>
<p>No campo Classe de F&aacute;brica, digite um reposit&oacute;rio externo de classe de f&aacute;brica para que o recurso externo seja criado.</p>
<p>A Classe de F&aacute;brica &eacute; o nome de usu&aacute;rio especificado para a classe de f&aacute;brica, como <code>com.sun.jndi.ldap</code>. Essa classe implementa a interface <code>javax.naming.spi.InitialContextFactory</code>.</p>
</li>
<li>
<p>No campo Pesquisa JNDI, digite o valor de JNDI a ser pesquisado no reposit&oacute;rio externo.</p>
<p>Por exemplo, ao criar um recurso externo para conect&aacute;-lo a um reposit&oacute;rio externo, para testar uma classe de bean, a Pesquisa de JNDI ter&aacute; a seguinte apar&ecirc;ncia<code>cn=</code><i>testmybean</i>.</p>
</li>
<li>
<p>No campo Descri&ccedil;&atilde;o, digite uma descri&ccedil;&atilde;o curta do recurso.</p>
<p>Esta descri&ccedil;&atilde;o &eacute; um valor de string e pode incluir no m&aacute;ximo 250 caracteres.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Status ativo para ativar o recurso.</p>
<p>Por default, o recurso est&aacute; ativado, significando que est&aacute; dispon&iacute;vel assim que &eacute; criado.</p>
</li>
<li>
<p>Na se&ccedil;&atilde;o Propriedades Adicionais, especifique propriedades adicionais para o recurso externo.</p>
<p>O GlassFish Server n&atilde;o define propriedades adicionais para recursos externos.</p>
<p>Para adicionar uma propriedade, clique no bot&atilde;o Adicionar Propriedade. Na linha em branco que for exibida, digite o nome da propriedade no campo Nome e digite o valor da propriedade no campo Valor.</p>
</li>
<li>
<p>Clique em OK.</p>
</li>
</ol>
<a id="GHJML111" name="GHJML111"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-jndicustomresourcenew.html">Para Criar um Recurso JNDI Personalizado</a></p>
</li>
<li>
<p><a href="task-jndicustomresourceedit.html">Para Editar um Recurso JNDI Personalizado</a></p>
</li>
<li>
<p><a href="task-jndicustomresourcedelete.html">Para Deletar um Recurso JNDI Personalizado</a></p>
</li>
<li>
<p><a href="task-jndiexternalresourceedit.html">Para Editar um Recurso JNDI Externo</a></p>
</li>
<li>
<p><a href="task-jndiexternalresourcedelete.html">Para Deletar um Recurso JNDI Externo</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
