<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-javamailsessionsedit" name="task-javamailsessionsedit"></a><a id="GHJML00012" name="GHJML00012"></a></p>

<h4><a id="sthref3" name="sthref3"></a>Para Editar uma Sess&atilde;o JavaMail</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Recursos.</p>
</li>
<li>
<p>No n&oacute; Recursos, selecione Sess&otilde;es JavaMail.</p>
<p>A p&aacute;gina Sess&otilde;es JavaMail &eacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Sess&otilde;es JavaMail, clique no nome da sess&atilde;o a ser editada.</p>
<p>A p&aacute;gina Editar Sess&atilde;o JavaMail &eacute; aberta.</p>
</li>
<li>
<p>No campo Host de Correio, especifique o nome do host do servidor de correio default.</p>
<p>Os m&eacute;todos de conex&atilde;o dos objetos Armazenamento e Transporte usam esse valor se n&atilde;o &eacute; fornecida uma propriedade de host espec&iacute;fica do protocolo. O nome deve ser resol&uacute;vel para um nome de host real.</p>
</li>
<li>
<p>No campo Usu&aacute;rio Default, digite outro nome de usu&aacute;rio a ser fornecido durante a conex&atilde;o com um servidor de correio.</p>
<p>Os m&eacute;todos de conex&atilde;o dos objetos Armazenamento e Transporte usam esse valor se n&atilde;o &eacute; fornecida uma propriedade de nome de usu&aacute;rio espec&iacute;fica do protocolo. O nome de usu&aacute;rio deve conter somente caracteres alfanum&eacute;ricos, sublinhado, tra&ccedil;o ou ponto.</p>
</li>
<li>
<p>No campo Endere&ccedil;o Default do Remetente, digite o endere&ccedil;o de e-mail do usu&aacute;rio default.</p>
<p>O formato &eacute;</p>
</li>
</ol>


 
<p><code>Nome do usu&aacute;rio<i>@</i><i>host</i>.<i>domain</i>.</code></p>
<p>No campo Descri&ccedil;&atilde;o, altere a descri&ccedil;&atilde;o da sess&atilde;o de correio.</p>
<p>Marque a caixa de sele&ccedil;&atilde;o Status Ativado para ativar a sess&atilde;o de correio.</p>
<p>O valor default &eacute; Ativado.</p>
<p>No campo Protocolo do Armazenamento, defina o m&eacute;todo de comunica&ccedil;&atilde;o do objeto Armazenamento a ser usado.</p>
<p>Por default, o Protocolo do Armazenamento &eacute; <code>imap</code>.</p>
<p>No campo Classe de Protocolo do Armazenamento, especifique a classe do m&eacute;todo de comunica&ccedil;&atilde;o do Armazenamento que implementa o protocolo do Armazenamento desejado.</p>
<p>Por default, a Classe do Protocolo de Armazenamento &eacute; <code>com.sun.mail.imap.IMAPStore</code>.</p>
<p>No campo Protocolo do Transporte, especifique o m&eacute;todo de comunica&ccedil;&atilde;o de transporte.</p>
<p>Por default, o Protocolo do Transporte &eacute; <code>smtp</code>.</p>
<p>No campo Classe do Protocolo de Transporte, especifique o m&eacute;todo de comunica&ccedil;&atilde;o para a classe de Transporte.</p>
<p>Por default, a Classe do Protocolo de Transporte &eacute; <code>com.sun.mail.smtp.SMTPTransport</code>.</p>
<p>Marque a caixa de sele&ccedil;&atilde;o Depura&ccedil;&atilde;o para ativar a sa&iacute;da de depura&ccedil;&atilde;o extra, incluindo um rastreamento de protocolo, para a sess&atilde;o de correio.</p>
<p>Se o n&iacute;vel de log JavaMail estiver definido como <code>BOM</code> ou melhor, a sa&iacute;da de depura&ccedil;&atilde;o ser&aacute; gerada e inclu&iacute;da no arquivo de log do sistema. Para obter informa&ccedil;&otilde;es sobre a defini&ccedil;&atilde;o do n&iacute;vel de log, consulte <a href="../../../common/en/help/task-eelogginglevels.html">Para Configurar N&iacute;veis de Log</a>.</p>
<p>Na tabela Propriedades Adicionais, especifique propriedades adicionais requeridas por aplica&ccedil;&otilde;es, como uma propriedade de nome de usu&aacute;rio ou de host espec&iacute;fica do protocolo.</p>
<p>Para obter uma lista das propriedades dispon&iacute;veis, consulte a documenta&ccedil;&atilde;o da API do JavaMail (<code><a href="http://java.sun.com/products/javamail/javadocs/index.html">http://java.sun.com/products/javamail/javadocs/index.html</a></code>). Propriedades adicionais devem come&ccedil;ar com <code>mail-</code> e devem usar h&iacute;fens, n&atilde;o pontos, como separadores. Por exemplo, <code>mail-debug</code> &eacute; correto, mas <code>mail.debug</code> n&atilde;o. O back-end do GlassFish Server converte os h&iacute;fens nos pontos esperados pela JavaMail API.</p>
<ul>
<li>
<p>Para adicionar uma propriedade, clique no bot&atilde;o Adicionar Propriedade. Na linha em branco que for exibida, digite o nome da propriedade no campo Nome e digite o valor da propriedade no campo Valor.</p>
</li>
<li>
<p>Para modificar uma propriedade, edite o campo Valor da propriedade.</p>
</li>
<li>
<p>Para deletar uma propriedade, marque a caixa de sele&ccedil;&atilde;o &agrave; esquerda do campo Nome da Propriedade a ser deletada. Clique no bot&atilde;o Deletar Propriedades.</p>
</li>
</ul>
<p>Clique em Salvar.</p>

<hr>
<p><b>Dica:</b></p>
Para voltar &agrave;s defini&ccedil;&otilde;es default, clique no bot&atilde;o Carregar Defaults e depois em Salvar.
<hr>

<a id="GHJML104" name="GHJML104"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-javamailsessioncreate.html">Para Criar uma Sess&atilde;o JavaMail</a></p>
</li>
<li>
<p><a href="task-javamailsessionsdelete.html">Para Deletar uma Sess&atilde;o JavaMail</a></p>
</li>
</ul>
<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
