<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="documentinfo"></a><p>R&#233;f&#233;rence&#160;: 821-0084-10</p><p>Mai 2009</p><p>4150 Network Circle<br>Santa Clara,  CA 95054<br>U.S.A.</p><p>Copyright 2009 Sun Microsystems, Inc.</p><p>Sun
Microsystems, Inc. d&#233;tient les droits de propri&#233;t&#233; intellectuelle de la technologie utilis&#233;e
par le produit d&#233;crit dans le pr&#233;sent document. Notamment, mais non exclusivement,
ces droits de propri&#233;t&#233; intellectuelle peuvent inclure un ou plusieurs brevets des
&#201;tats-Unis ou des demandes de brevet en attente aux &#201;tats-Unis et dans
d'autres pays.</p><p>Droits &#233;nonc&#233;s par le gouvernement am&#233;ricain &#8211; Logiciel commercial. Les utilisateurs
du gouvernement sont soumis au contrat de licence standard de Sun Microsystems,
Inc. ainsi qu'aux dispositions applicables du FAR et de ses suppl&#233;ments.</p><p>Cette distribution
peut int&#233;grer des &#233;l&#233;ments con&#231;us par des tiers.</p><p>Il est possible que des
parties du produit soient d&#233;riv&#233;es des syst&#232;mes Berkeley BSD, conc&#233;d&#233;s en licence
par la University of California. UNIX est une marque d&#233;pos&#233;e aux &#201;tats-Unis
et dans d'autres pays, exclusivement conc&#233;d&#233;e en licence par X/Open Company, Ltd.</p><p>Sun,
Sun Microsystems, le logo Sun, le logo Solaris, le logo Java Coffee
Cup, docs.sun.com,  Enterprise JavaBeans, EJB, GlassFish, J2EE, J2SE, Java Naming and Directory
Interface, JavaBeans, Javadoc, JDBC, JDK, JavaScript, JavaServer, JavaServer Pages, JMX, JRE, JSP,
JVM, MySQL, NetBeans, OpenSolaris, SunSolve, Sun GlassFish,  Java et Solaris sont des marques
de fabrique ou des marques d&#233;pos&#233;es de Sun Microsystems, Inc. ou de
ses filiales aux &#201;tats-Unis et dans d'autres pays. Toutes les marques d&#233;pos&#233;es
SPARC sont utilis&#233;es sous licence et sont des marques commerciales ou d&#233;pos&#233;es
de SPARC International, Inc. aux &#201;tats-Unis et dans d' autres pays. Les
produits portant les marques d&#233;pos&#233;es SPARC sont constitu&#233;s selon une architecture d&#233;velopp&#233;e
par Sun Microsystems, Inc. </p><p>OPEN LOOK et l' interface graphique utilisateur Sun<sup>TM</sup>
sont d&#233;velopp&#233;s par Sun Microsystems, Inc. pour ses utilisateurs et ses concessionnaires.
Sun reconna&#238;t les efforts de pionniers de Xerox pour la recherche et
le d&#233;veloppement du concept des interfaces utilisateur visuelles ou graphiques pour l&#8217;industrie
de l&#8217;informatique. Sun est sous licence non-exclusive de Xerox pour Xerox Graphical
User Interface,dont la licence couvre &#233;galement les d&#233;tenteurs de licence Sun qui
impl&#233;mentent OPEN LOOK GUIs en accord avec les contrats de licence &#233;crits
de Sun.</p><p>Les produits couverts et les informations contenues dans cette publication sont
contr&#244;l&#233;s par les lois r&#233;gissant les exportations aux &#201;tats-Unis et peuvent &#234;tre
soumises aux lois r&#233;gissant les exportations ou les importations dans d'autres pays.
L'utilisation d'armes nucl&#233;aires, de missiles, d'armes biologiques et chimiques ou d'armes nucl&#233;aires
maritimes, qu'elle soit directe ou indirecte, est strictement interdite. Son exportation ou
r&#233;exportation vers des pays soumis &#224; l' embargo am&#233;ricain ou &#224; des
entit&#233;s exclues des listes d' exportation am&#233;ricaines, notamment mais pas exclusivement, les
personnes et pays figurant sur des listes noires, est strictement interdite.</p><p>LA DOCUMENTATION
EST FOURNIE &#171; EN L'&#201;TAT &#187; ET TOUTES LES AUTRES CONDITIONS, DECLARATIONS
ET GARANTIES EXPRESSES OU TACITES SONT FORMELLEMENT EXCLUES, DANS LA MESURE AUTORISEE
PAR LA LOI APPLICABLE, Y COMPRIS NOTAMMENT TOUTE GARANTIE IMPLICITE RELATIVE A
LA QUALITE MARCHANDE, A L'APTITUDE A UNE UTILISATION PARTICULIERE OU A L'ABSENCE
DE CONTREFA&#199;ON.</p><p></p><p>Sun Microsystems, Inc. d&#233;tient les droits de propri&#233;t&#233; intellectuelle relatifs &#224; la
technologie incorpor&#233;e dans le produit qui est d&#233;crit dans ce document. En particulier, et
ce sans limitation, ces droits de propri&#233;t&#233; intellectuelle peuvent inclure un ou plusieurs brevets am&#233;ricains
ou des applications de brevet en attente aux Etats-Unis et dans d'autres pays.</p><p>Cette distribution
peut comprendre des composants d&#233;velopp&#233;s par des tierces personnes.</p><p>Certaines composants de ce produit
peuvent &#234;tre d&#233;riv&#233;es du logiciel Berkeley BSD, licenci&#233;s par l'Universit&#233; de Californie. UNIX est une
marque d&#233;pos&#233;e aux Etats-Unis et dans d'autres pays; elle est licenci&#233;e exclusivement par X/Open
Company, Ltd. </p><p>Sun, Sun Microsystems, le logo Sun, le logo Solaris, le
logo Java Coffee Cup, docs.sun.com,  Enterprise JavaBeans, EJB, GlassFish, J2EE, J2SE, Java Naming
and Directory Interface, JavaBeans, Javadoc, JDBC, JDK, JavaScript, JavaServer, JavaServer Pages, JMX,
JRE, JSP, JVM, MySQL, NetBeans, OpenSolaris, SunSolve, Sun GlassFish,   Java et Solaris
sont des marques de fabrique ou des marques d&#233;pos&#233;es de Sun Microsystems, Inc., ou
ses filiales, aux Etats-Unis et dans d'autres pays. Toutes les marques SPARC sont utilis&#233;es
sous licence et sont des marques de fabrique ou des marques d&#233;pos&#233;es de SPARC
International, Inc. aux Etats-Unis et dans d'autres pays. Les produits portant les marques SPARC
sont bas&#233;s sur une architecture d&#233;velopp&#233;e par Sun Microsystems, Inc.</p><p>L'interface d'utilisation graphique OPEN LOOK
et Sun a &#233;t&#233; d&#233;velopp&#233;e par Sun Microsystems, Inc. pour ses utilisateurs et licenci&#233;s. Sun reconna&#238;t
les efforts de pionniers de Xerox pour la recherche et le d&#233;veloppement du concept
des interfaces d'utilisation visuelle ou graphique pour l'industrie de l'informatique. Sun d&#233;tient une licence non
exclusive de Xerox sur l'interface d'utilisation graphique Xerox, cette licence couvrant &#233;galement les licenci&#233;s de
Sun qui mettent en place l'interface d'utilisation graphique OPEN LOOK et qui, en outre,
se conforment aux licences &#233;crites de Sun.</p><p>Les produits qui font l'objet de
cette publication et les informations qu'il contient sont r&#233;gis par la legislation am&#233;ricaine en
mati&#232;re de contr&#244;le des exportations et peuvent &#234;tre soumis au droit d'autres pays
dans le domaine des exportations et importations. Les utilisations finales, ou utilisateurs finaux,
pour des armes nucl&#233;aires, des missiles, des armes chimiques ou biologiques ou pour
le nucl&#233;aire maritime, directement ou indirectement, sont strictement interdites. Les exportations ou r&#233;exportations
vers des pays sous embargo des Etats-Unis, ou vers des entit&#233;s figurant sur
les listes d'exclusion d'exportation am&#233;ricaines, y compris, mais de mani&#232;re non exclusive, la liste
de personnes qui font objet d'un ordre de ne pas participer, d'une
fa&#231;on directe ou indirecte, aux exportations des produits ou des services qui sont r&#233;gis par
la legislation am&#233;ricaine en mati&#232;re de contr&#244;le des exportations et la liste de ressortissants sp&#233;cifiquement
design&#233;s, sont rigoureusement interdites.</p><p>LA DOCUMENTATION EST FOURNIE "EN L'ETAT" ET TOUTES AUTRES CONDITIONS, DECLARATIONS
ET GARANTIES EXPRESSES OU TACITES SONT FORMELLEMENT EXCLUES, DANS LA MESURE AUTORISEE PAR
LA LOI APPLICABLE, Y COMPRIS NOTAMMENT TOUTE GARANTIE IMPLICITE RELATIVE A LA QUALITE
MARCHANDE, A L'APTITUDE A UNE UTILISATION PARTICULIERE OU A L'ABSENCE DE CONTREFACON. </p>
