<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Onglet Modifier les attributs avanc&#233;s du pool de connexions - Aide en ligne de la console d'administration de Sun GlassFish Enterprise Server v3 Prelude
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>

</head>

<body class="HlpBdy">

<a name="gentextid-4097"></a><h4><a name="ref-jdbcconnpooladvanceattrtab"></a>Onglet Modifier les attributs avanc&#233;s du pool de connexions</h4>
<p>Pour mieux diagnostiquer les fuites de connexion et am&#233;liorer la simplicit&#233;&#8211;d'utilisation, des
attributs avanc&#233;s permettent de configurer un pool de connexions lors de sa
cr&#233;ation.</p><dl><dt>Nom</dt>
<dd><p>Champ en lecture seule identifiant le nom du pool de connexions.</p></dd>
<dt>D&#233;lai d'expiration de l'instruction</dt>
<dd><p>D&#233;lai en secondes au-del&#224; duquel des requ&#234;tes anormalement longues &#224; ex&#233;cuter sont abandonn&#233;es.Enterprise Server d&#233;finit "QueryTimeout" sur les instructions cr&#233;&#233;es. La valeur par d&#233;faut -1 signifie que l'attribut n'est pas activ&#233;.</p></dd>
<dt>Imbriquer des objets JDBC</dt>
<dd><p>Lorsque ce champ est d&#233;fini sur true (vrai), les applications imbriquent les objets JDBC pour <tt>Statement</tt>, <tt>PreparedStatement</tt>, <tt>CallableStatement</tt>, <tt>ResultSet</tt>, <tt>DatabaseMetaData</tt>. La valeur par d&#233;faut est 'false' (faux).</p></dd>
<dt>Valider une seule fois</dt>
<dd><p>D&#233;lai en secondes au-del&#224; duquel une connexion est valid&#233;e une fois au maximum. Cette option permet de r&#233;duire le nombre de demandes de validation effectu&#233;es par une connexion. La valeur par d&#233;faut 0 signifie que la validation de la connexion n'est pas activ&#233;e.</p></dd>
<dt>D&#233;lai d'expiration de la fuite</dt>
<dd><p>P&#233;riode (en secondes) n&#233;cessaire pour effectuer un suivi des fuites de connexion dans un pool de connexions. La valeur par d&#233;faut 0 signifie que le suivi des fuites de connexion est d&#233;sactiv&#233;. Si le suivi des fuites de connexion est activ&#233;, des statistiques sur le nombre de fuites de connexion s'affichent dans l'onglet Contr&#244;le des ressources. Pour acc&#233;der &#224; cet onglet, choisissez Application Server -&gt; Contr&#244;le -&gt; Ressources.</p></dd>
<dt>R&#233;cup&#233;ration de la fuite</dt>
<dd><p>Si cette option est activ&#233;e, les connexions pr&#233;sentant des fuites sont restaur&#233;es dans le pool une fois le suivi des fuites de connexion termin&#233;.</p></dd>
<dt>Nouvelles tentatives de cr&#233;ation</dt>
<dd><p>Nombre de tentatives effectu&#233;es en cas d'&#233;chec de cr&#233;ation d'une connexion. La valeur par d&#233;faut 0 signifie qu'aucune tentative ne sera effectu&#233;e pour recr&#233;er une connexion.</p></dd>
<dt>Fr&#233;quence des tentatives</dt>
<dd><p>Intervalle en secondes s&#233;parant deux tentatives de cr&#233;ation d'une connexion. La valeur par d&#233;faut est 10 secondes. Cet attribut n'est utilis&#233; que si la valeur de l'option Nouvelles tentatives de cr&#233;ation est sup&#233;rieure &#224; 0.</p></dd>
<dt>Association diff&#233;r&#233;e</dt>
<dd><p>Si cette option est activ&#233;e, les connexions sont associ&#233;es en diff&#233;r&#233; lorsque vous effectuez une op&#233;ration sur ces derni&#232;res. De plus, elles sont dissoci&#233;es lorsque la transaction est termin&#233;e et qu'une m&#233;thode de composant prend fin, ce qui facilite la r&#233;utilisation des connexions physiques. La valeur par d&#233;faut est d&#233;sactiv&#233;e.</p></dd>
<dt>Enr&#244;lement diff&#233;r&#233; de la connexion</dt>
<dd><p>Si cette option est activ&#233;e, les ressources de la transaction ne sont enr&#244;l&#233;es que lorsqu'elles sont r&#233;ellement utilis&#233;es dans une m&#233;thode.</p></dd>
<dt>Associer au thread</dt>
<dd><p>Si cette option est activ&#233;e, la connexion est associ&#233;e &#224; la thread de sorte que lorsque celle-ci n&#233;cessite une connexion, elle puisse r&#233;utiliser la connexion qui lui est d&#233;j&#224; associ&#233;e, permettant ainsi de limiter le temps d'arr&#234;t lors de l'obtention d'une connexion &#224; partir du pool. La valeur par d&#233;faut est d&#233;sactiv&#233;e.</p></dd>
<dt>Associer des connexions</dt>
<dd><p>Si cette option est activ&#233;e, l'association des connexions pour le pool est activ&#233;e/d&#233;sactiv&#233;e. Cette option peut &#234;tre d&#233;sactiv&#233;e si l'administrateur sait que les connexions du pool seront toujours homog&#232;nes et qu'il est donc inutile pour l'adaptateur de ressources d'associer une connexion emprunt&#233;e au pool. La valeur par d&#233;faut est d&#233;sactiv&#233;e.</p></dd>
<dt>Utilisation du nombre maximal de connexions</dt>
<dd><p>Nombre de fois o&#249; une connexion doit &#234;tre r&#233;utilis&#233;e par le pool. Une fois qu'une connexion a &#233;t&#233; r&#233;utilis&#233;e le nombre de fois sp&#233;cifi&#233;, elle est ferm&#233;e. Ceci est utile pour &#233;viter les fuites d'instructions, par exemple. La valeur par d&#233;faut 0 signifie que cet attribut n'est pas activ&#233;.</p></dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-setdbaccess.html">Configurer l'acc&#232;s &#224; la base de donn&#233;es</a></p></li>
<li><p><a href="task-integratejdbcdriver.html">Int&#233;grer un pilote JDBC</a></p></li>
<li><p><a href="task-jdbcresourcenew.html">Cr&#233;er une ressource JDBC</a></p></li>
<li><p><a href="task-jdbcresourcesedit.html">Modifier une ressource JDBC</a></p></li>
<li><p><a href="task-jdbcresourcesdelete.html">Supprimer une ressource JDBC</a></p></li>
<li><p><a href="task-jdbcconnectionpoolnew.html">Cr&#233;er un pool de connexions JDBC</a></p></li>
<li><p><a href="task-jdbcconnectionpooledit.html">Modifier les param&#232;tres g&#233;n&#233;raux du pool de connexions JDBC</a></p></li>
<li><p><a href="task-jdbcconnectionpooladvance.html">Modifier les attributs avanc&#233;s d'un pool de connexions JDBC</a></p></li>
<li><p><a href="task-verifyconnpoolsettings.html">V&#233;rifier les param&#232;tres du pool de connexions</a></p></li>
<li><p><a href="task-jdbcconnectionpoolproperty.html">Modifier les propri&#233;t&#233;s du pool de connexions JDBC</a></p></li>
<li><p><a href="task-jdbcconnectionpooldelete.html">Supprimer un pool de connexions JDBC</a></p></li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>

<ul><li><p><a href="http://docs.sun.com/doc/820-4497/add-resources-1?a=view"><tt>add-resources</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/create-jdbc-resource-1?a=view"><tt>create-jdbc-resource</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/delete-jdbc-resource-1?a=view"><tt>delete-jdbc-resource</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/list-jdbc-resources-1?a=view"><tt>list-jdbc-resources</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/create-jdbc-connection-pool-1?a=view"><tt>create-jdbc-connection-pool</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/delete-jdbc-connection-pool-1?a=view"><tt>delete-jdbc-connection-pool</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/list-jdbc-connection-pools-1?a=view"><tt>list-jdbc-connection-pools</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/ping-connection-pool-1?a=view"><tt>ping-connection-pool</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/start-database-1?a=view"><tt>start-database</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/stop-database-1?a=view"><tt>stop-database</tt>(1)</a></p></li></ul>

<br/>

</body>
</html>
