<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Onglet Modification du module d'&#233;coute HTTP - Aide en ligne de la console d'administration de Sun GlassFish Enterprise Server v3 Prelude
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>

</head>

<body class="HlpBdy">

<a name="httplisteneredittab"></a><h4>Onglet Modification du module d'&#233;coute HTTP</h4>
<p>La modification du socket de module d'&#233;coute HTTP permet &#224; Enterprise Server
de traiter rapidement les requ&#234;tes HTTP.</p><dl><dt>Nom</dt>
<dd><p>Identificateur unique en lecture seule du module d'&#233;coute.</p></dd>
<dt>Module d'&#233;coute</dt>
<dd><p>Entrez une adresse IP valide pour le serveur. </p></dd>
<dt>S&#233;curit&#233;</dt>
<dd><p>Disponible dans les profils Clusters et Enterprise. Cr&#233;e un module d'&#233;coute s&#233;curis&#233;.</p></dd>
<dt>Adresse r&#233;seau</dt>
<dd><p>Entrez l'adresse r&#233;seau 0.0.0.0 si vous souhaitez que le module &#233;coute sur toutes les adresses IP du serveur &#224; l'aide d'une valeur de port unique.</p></dd>
<dt>Port du module d'&#233;coute</dt>
<dd><p>Valeur de port unique de module d'&#233;coute si le champ Adresse r&#233;seau est 0.0.0.0, ou la valeur de port d&#233;sir&#233;e si vous utilisez une autre adresse IP.</p></dd>
<dt>Serveur virtuel par d&#233;faut</dt>
<dd><p>Choisissez un serveur virtuel dans la liste d&#233;roulante.</p></dd>
<dt>Nom de serveur</dt>
<dd><p>Nom d'h&#244;te &#224; utiliser dans les URL envoy&#233;es par le serveur au client. Ce nom est l'alias si votre serveur en utilise un. Si votre serveur n'utilise aucun alias, laissez ce champ vide.</p></dd>
<dt>Port de redirection</dt>
<dd><p>Entrez une valeur de port pour rediriger les requ&#234;tes vers un autre port. Enterprise Server r&#233;achemine automatiquement la requ&#234;te si les deux conditions suivantes sont remplies :</p>
<ul><li><p>Ce listener prend en charge des requ&#234;tes non SSL.</p></li>
<li><p>Une requ&#234;te pour laquelle une contrainte de s&#233;curit&#233; correspondante requiert le transport SSL est re&#231;ue.</p><p>Par d&#233;faut, Enterprise Server utilise le num&#233;ro de port sp&#233;cifi&#233; dans la requ&#234;te d'origine.</p></li></ul>
</dd>
<dt>Threads accepteur</dt>
<dd><p>Nombre de threads accepteur. La valeur par d&#233;faut est 1.</p></dd>
<dt>Powered By</dt>
<dd><p>D&#233;sactivez la case &#224; cocher Powered By pour d&#233;sactiver l'ajout de l'en-t&#234;te <tt>X-Powered-By: Servlet/2.4</tt> aux en-t&#234;tes de r&#233;ponse HTTP g&#233;n&#233;r&#233;s par le servlet.</p><p>La sp&#233;cification Java Servlet 2.4 d&#233;finit cet en-t&#234;te, que les conteneurs peuvent ajouter aux r&#233;ponses g&#233;n&#233;r&#233;es par le servlet. De m&#234;me, la sp&#233;cification Pages JavaServer (JSP) 2.0 d&#233;finit un en-t&#234;te <tt>X-Powered-By: JSP/2.0</tt> &#224; ajouter (si vous le souhaitez) aux r&#233;ponses utilisant la technologie JSP. L'ajout de l'en-t&#234;te <tt>X-Powered-By: JSP/2.0</tt> est activ&#233; par d&#233;faut pour les applications Web. Ces en-t&#234;tes ont pour objectif d'aider les administrateurs &#224; collecter des donn&#233;es statistiques sur l'utilisation du servlet et de la technologie JSP. </p><p>Pour plus d'informations sur l'activation et la d&#233;sactivation de l'en-t&#234;te <tt>X-Powered-By</tt> pour les pages JSP, reportez-vous &#224; l'<a href="http://docs.sun.com/doc/820-4502/beaqi?a=view">Annexe A, <i>Deployment Descriptor Files</i> du <i>Sun GlassFish Enterprise Server v3 Prelude Application Deployment Guide</i></a>. </p><p>Il est possible que les environnements de production omettent volontairement la g&#233;n&#233;ration d'en-t&#234;tes <tt>X-Powered-By</tt> pour masquer leur technologie sous-jacente.</p></dd>
<dt>Blockage activ&#233;</dt>
<dd><p>Active le blocage pour les modules d'&#233;coute et les ports externes.</p></dd>
<dt>Autres propri&#233;t&#233;s</dt>
<dd><p>Ajoutez des propri&#233;t&#233;s au module d'&#233;coute.</p></dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-httplistenerssl.html">Configurer un listener HTTP afin qu'il utilise SSL</a></p></li>
<li><p><a href="task-httplistenerdelete.html">Supprimer un module d'&#233;coute HTTP</a></p></li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>

<ul><li><p><a href="http://docs.sun.com/doc/820-4497/create-http-listener-1?a=view"><tt>create-http-listener</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/delete-http-listener-1?a=view"><tt>delete-http-listener</tt>(1)</a></p></li></ul>

<br/>

</body>
</html>
