<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-uc-config"></a><h4>Configuration de Outil de mise &#224; jour</h4>
<p>La page Configuration contient les informations de configuration de Outil de mise
&#224; jour et vous permet de modifier la configuration de Outil de
mise &#224; jour.</p><p>La page Configuration de Outil de mise &#224; jour contient les options
suivantes&#160;:</p><dl><dt>Chemin d'installation</dt>
<dd><p>Chemin du syst&#232;me de fichiers du r&#233;pertoire root ou du r&#233;pertoire sup&#233;rieur de l'image d'installation.</p></dd>
<dt>R&#233;f&#233;rentiel pr&#233;f&#233;r&#233;</dt>
<dd><p>Nom du <a href="ref-uc-concepts.html#ref-uc-about-repository">r&#233;f&#233;rentiel r&#233;seau</a> pr&#233;f&#233;r&#233; qui est associ&#233; &#224; cette image d'installation, comme par exemple <tt>glassfish.org</tt>.</p></dd>
<dt>Connexion Internet</dt>
<dd><p>Mode de connexion de Enterprise Server &#224; Internet :</p><dl><dt>Connexion directe</dt>
<dd><p>Cette option signifie que Enterprise Server se connecte directement &#224; Internet.</p></dd>
<dt>Via un proxy</dt>
<dd><p>Cette option signifie que Enterprise Server se connecte &#224; Internet via un serveur proxy. Lorsque cette option est s&#233;lectionn&#233;e, les champs H&#244;te proxy et Port proxy sont ajout&#233;s &#224; la page.</p></dd>
</dl>
</dd>
<dt>H&#244;te proxy</dt>
<dd><p>Nom d'h&#244;te du serveur proxy de l'ordinateur sur lequel Enterprise Server s'ex&#233;cute.</p><p>Ce champ est applicable uniquement si l'ordinateur sur lequel Enterprise Server s'ex&#233;cute se connecte &#224; Internet par l'interm&#233;diaire d'un serveur proxy.</p></dd>
<dt>Port proxy</dt>
<dd><p>Num&#233;ro de port du serveur proxy de l'ordinateur sur lequel Enterprise Server s'ex&#233;cute.</p><p>Ce champ est applicable uniquement si l'ordinateur sur lequel Enterprise Server s'ex&#233;cute se connecte &#224; Internet par l'interm&#233;diaire d'un serveur proxy.</p></dd>
<dt>R&#233;f&#233;rentiels</dt>
<dd><p>Le tableau pr&#233;sente les informations ci-dessous pour chaque <a href="ref-uc-concepts.html#ref-uc-about-repository">r&#233;f&#233;rentiel r&#233;seau</a> associ&#233; &#224; cette image d'installation :</p><dl><dt>R&#233;f&#233;rentiel</dt>
<dd><p>Nom du r&#233;f&#233;rentiel, par exemple <tt>glassfish.org</tt>.</p></dd>
</dl>
</dd>
</dl>
<h5>T&#226;ches connexes</h5>
<p><a href="task-uc-set-proxy.html">Configurer les param&#232;tres proxy de r&#233;seau pour acc&#233;der aux r&#233;f&#233;rentiels de r&#233;seau</a></p><h5>Commandes <tt>asadmin</tt> connexes</h5>
<p>aucune.</p>
