<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-messagesecurityconfig"></a><h4>Configuration de la s&#233;curit&#233; des messages</h4>
<p>La page Configuration de la s&#233;curit&#233; des messages r&#233;pertorie les configurations disponibles
pour les fournisseurs de s&#233;curit&#233; des messages.</p><p>Pour configurer la s&#233;curit&#233; des messages, vous devez comprendre les bases des
concepts de s&#233;curit&#233; et des services Web. Pour en savoir plus, consultez
le <a href="http://docs.sun.com/doc/820-7692/ablrk?a=view">Chapitre 13, Administering Message Security du <i>Sun GlassFish Enterprise Server v3 Administration Guide</i></a> et le <a href="http://docs.sun.com/doc/820-7692/gbbjk?a=view">Chapitre 6, Administering Web Applications du <i>Sun GlassFish Enterprise Server v3 Administration Guide</i></a>.</p><p>Le Enterprise Server impl&#233;mente la s&#233;curit&#233; des messages via les fournisseurs de
s&#233;curit&#233; des messages int&#233;gr&#233;s &#224; sa couche de traitement SOAP. Les fournisseurs
de s&#233;curit&#233; des messages d&#233;pendent des autres utilitaires de s&#233;curit&#233; du Enterprise
Server.</p><p>Pour chaque configuration, la page Configuration de la s&#233;curit&#233; des messages contient
les informations suivantes.</p><dl><dt>Couche d'authentification</dt>
<dd><p>Couche message &#224; laquelle l'authentification est effectu&#233;e. Par d&#233;faut, une configuration SOAP est fournie. Il est &#233;galement possible de fournir une configuration HttpServlet.</p></dd>
<dt>Fournisseur par d&#233;faut</dt>
<dd><p>Fournisseur de serveur par d&#233;faut pour cette configuration. Par d&#233;faut, aucun fournisseur de serveur par d&#233;faut n'est configur&#233;.</p></dd>
<dt>Fournisseur client par d&#233;faut</dt>
<dd><p>Fournisseur client par d&#233;faut pour cette configuration. Par d&#233;faut, aucun fournisseur client par d&#233;faut n'est configur&#233;.</p></dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-configmsgsecproviders.html">Configurer les utilitaires du Enterprise Server pour permettre l'utilisation par des fournisseurs de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityconfignew.html">Pour cr&#233;er une configuration de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityconfigedit.html">Pour modifier une configuration de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityconfigdelete.html">Pour supprimer une configuration de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityproviderconfignew.html">Pour cr&#233;er la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigedit.html">Pour modifier la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigdelete.html">Pour supprimer la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-enablemesec4appclients.html">Pour activer la s&#233;curit&#233; des messages pour les clients de l'application</a></p></li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>
<p>aucune.</p>
