<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Page des param&#232;tres g&#233;n&#233;raux JVM - Aide en ligne de la console d'administration de Sun GlassFish Enterprise Server v3 Prelude
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>

</head>

<body class="HlpBdy">

<a name="ref-jvmgeneraltab"></a><h4>Page des param&#232;tres g&#233;n&#233;raux JVM</h4>
<p>La machine virtuelle Java (JVM) est incluse dans le logiciel Java Platform
Standard Edition (J2SE<sup>TM</sup>), n&#233;cessaire &#224; l'ex&#233;cution d'Enterprise Server. La saisie de param&#232;tres
JVM incorrects emp&#234;chant l'ex&#233;cution du serveur, vous devez &#234;tre prudent(e) lors de
la modification de ces param&#232;tres.</p><dl><dt>Accueil Java</dt>
<dd><p>Nom du r&#233;pertoire d'installation du logiciel Java SE, n&#233;cessaire &#224; l'ex&#233;cution d'Enterprise Server. Pour v&#233;rifier si la version du logiciel Java SE sp&#233;cifi&#233; est prise en charge par cette version, consultez les <a href="http://docs.sun.com/doc/820-4494"><i>Sun GlassFish Enterprise Server v3 Prelude Release Notes</i></a>. Si vous saisissez un nom de r&#233;pertoire inexistant ou le r&#233;pertoire d'une version non prise en charge du logiciel Java SE, Enterprise Server ne d&#233;marrera pas.</p></dd>
<dt>Options Javac</dt>
<dd><p>Options de ligne de commande pour le compilateur de langage de programmation Java. Enterprise Server ex&#233;cute le compilateur lorsque des composants Enterprise JavaBeans<sup>TM</sup> (EJB<sup>TM</sup>) sont d&#233;ploy&#233;s.</p></dd>
<dt>D&#233;bogage</dt>
<dd><p>Active le d&#233;bogage avec JPDA (Architecture de d&#233;bogueur de plate-forme Java).</p><p>L'architecture JPDA est utilis&#233;e par les d&#233;veloppeurs d'applications. Pour plus d'informations, consultez le <a href="http://docs.sun.com/doc/820-4496"><i>Sun GlassFish Enterprise Server v3 Prelude Developer&#8217;s Guide</i></a>.</p></dd>
<dt>Options de d&#233;bogage</dt>
<dd><p>Indique les options JPDA transmises &#224; la JVM quand le d&#233;bogage est activ&#233;.</p></dd>
<dt>Options de compilation RMI</dt>
<dd><p>Options de ligne de commande pour le compilateur <tt>rmic</tt>. Enterprise Server ex&#233;cute le compilateur <tt>rmic</tt> lorsque des composants EJB sont d&#233;ploy&#233;s.</p></dd>
<dt>Pr&#233;processeur du bytecode</dt>
<dd><p>Noms des classes de pr&#233;traitement du bytecode. S&#233;parez les noms de classe par des virgules. Chaque classe doit impl&#233;menter l'interface com.sun.appserv.BytecodePreprocessor. Les classes sont appel&#233;es par ordre d'&#233;num&#233;ration.</p></dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-jvmsettings.html">Configurer les param&#232;tres g&#233;n&#233;raux du profileur JVM</a></p></li>
<li><p><a href="task-jvmpathsettings.html">Configurer les param&#232;tres du chemin d'acc&#232;s &#224; la JVM </a></p></li>
<li><p><a href="task-jvmoptions.html">Configurer les options JVM</a></p></li>
<li><p><a href="task-securitymanagerdisable.html">D&#233;sactiver le gestionnaire de s&#233;curit&#233;</a></p></li>
<li><p><a href="task-jvmprofilersettings.html">Configurer les param&#232;tres du profileur JVM </a></p></li>
<li><p><a href="task-setadvanceappconfig.html">D&#233;finir la configuration avanc&#233;e des applications</a></p></li>
<li><p><a href="task-setadvancedomainattributes.html">D&#233;finir les attributs avanc&#233;s du domaine</a></p></li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>
<p>aucune.</p>
<br/>

</body>
</html>
