<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-uc-pkgdetails"></a><h4>D&#233;tails des composants</h4>
<p>La page D&#233;tails des composants contient des informations d&#233;taill&#233;es sur un composant.</p><p>La page D&#233;tails des composants contient les options suivantes&#160;:</p><dl><dt>Pr&#233;c&#233;dente</dt>
<dd><p>Ce bouton permet de revenir &#224; la page sur laquelle vous avez s&#233;lectionn&#233; le composant dont vous consultez les d&#233;tails.</p></dd>
<dt>Nom du package</dt>
<dd><p>Nom du package comprenant le composant.</p></dd>
<dt>Identificateur unique</dt>
<dd><p>Identificateur complet du composant tel qu'il existe dans le r&#233;f&#233;rentiel.</p></dd>
<dt>Cat&#233;gorie</dt>
<dd><p>Cat&#233;gorie du logiciel &#224; laquelle le composant est associ&#233;, comme par exemple serveurs d'application, outils syst&#232;me et bases de donn&#233;es. La cat&#233;gorie est affect&#233;e au composant par le fabricant du composant au moment de sa cr&#233;ation.</p></dd>
<dt>Version</dt>
<dd><p>Num&#233;ro de version du package comprenant le composant.</p></dd>
<dt>Taille de l'installation</dt>
<dd><p>Espace disque utilis&#233; pour l'installation du composant.</p></dd>
<dt>Date de publication</dt>
<dd><p>Date et heure auxquelles cette version du composant a &#233;t&#233; publi&#233;e dans le r&#233;f&#233;rentiel. Cette date <b>ne correspond pas</b> &#224; la date et &#224; l'heure auxquelles le composant a &#233;t&#233; install&#233; dans l'image d'installation.</p></dd>
<dt>Source</dt>
<dd><p>Pour un composant install&#233;, nom du <a href="ref-uc-concepts.html#ref-uc-about-repository">R&#233;f&#233;rentiel r&#233;seau</a> &#224; partir duquel le composant a &#233;t&#233; obtenu. </p><p>Pour un composant add-on ou une mise &#224; jour, nom du r&#233;f&#233;rentiel r&#233;seau &#224; partir duquel le composant a &#233;t&#233; obtenu. </p></dd>
<dt>Description</dt>
<dd><p>Pr&#233;sentation du composant.</p></dd>
</dl>
<h5>T&#226;ches connexes</h5>
<p><a href="task-uc-pkgdetails.html">Afficher les informations d&#233;taill&#233;es d'un composant</a></p><h5>Commandes <tt>asadmin</tt> connexes</h5>
<p>aucune.</p>
