<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Page Configuration des applications - Aide en ligne de la console d'administration de Sun GlassFish Enterprise Server v3 Prelude
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>

</head>

<body class="HlpBdy">

<a name="ref-appconfigtab"></a><h4>Page Configuration des applications</h4>
<p>Sur cette page, vous pouvez d&#233;finir les propri&#233;t&#233;s de configuration des applications
qui permettent de s'assurer que les modifications apport&#233;es aux applications d&#233;ploy&#233;es sont
d&#233;tect&#233;es et que les classes modifi&#233;es sont recharg&#233;es.</p><dl><dt>Recharger</dt>
<dd><p>Si cette option est activ&#233;e, les classes modifi&#233;es sont recharg&#233;es dynamiquement. Le serveur recherche r&#233;guli&#232;rement la pr&#233;sence de modifications dans le r&#233;pertoire de d&#233;ploiement et red&#233;ploie l'application, automatiquement et dynamiquement, avec ces modifications. Cette fonction est utile dans un environnement de d&#233;veloppement, car elle permet de tester rapidement les modifications du code. Cependant, dans un environnement de production, le rechargement dynamique peut diminuer les performances. De plus, &#224; chaque rechargement, les sessions ouvertes durant cette p&#233;riode de transition ne sont pas valides. Le client doit red&#233;marrer la session.</p></dd>
<dt>Intervalle d'interrogation de rechargement</dt>
<dd><p>D&#233;finit la fr&#233;quence &#224; laquelle le serveur doit v&#233;rifier les &#233;ventuelles modifications dans les applications d&#233;ploy&#233;es.</p></dd>
<dt>D&#233;lai d'expiration de session d'administration</dt>
<dd><p>D&#233;finit le nombre de minutes d'inactivit&#233; devant s'&#233;couler avant que la Console d&#8217;administration n'arrive &#224; expiration et exige une reconnexion.</p></dd>
<dt>D&#233;ploiement automatique</dt>
<dd><p>Si cette option est activ&#233;e, les applications plac&#233;es dans le r&#233;pertoire de d&#233;ploiement automatique sont d&#233;ploy&#233;es automatiquement.</p></dd>
<dt>Intervalle d'interrogation de d&#233;ploiement automatique</dt>
<dd><p>D&#233;finit la fr&#233;quence &#224; laquelle le serveur doit v&#233;rifier la pr&#233;sence d'archives d'application ou de module dans le r&#233;pertoire de d&#233;ploiement automatique. La modification de l'intervalle d'interrogation n'affecte pas le temps de d&#233;ploiement d'une application ou d'un module.</p></dd>
<dt>D&#233;lai d'expiration de la tentative de d&#233;ploiement automatique</dt>
<dd><p>D&#233;finit le nombre de secondes pendant lesquelles la taille d'un fichier partiellement copi&#233; peut demeurer inchang&#233;e avant qu'une erreur ne se produise. La valeur par d&#233;faut est 30.</p><p>Lorsqu'un fichier est copi&#233; lentement dans le r&#233;pertoire de d&#233;ploiement automatique, il peut s'afficher avant d'&#234;tre copi&#233; en entier, entra&#238;nant l'&#233;chec de la tentative de d&#233;ploiement automatique de l'application. Dans ce cas, Enterprise Server tente de d&#233;ployer l'application &#224; nouveau. Si la taille du fichier partiellement copi&#233; demeure inchang&#233;e pendant le d&#233;lai sp&#233;cifi&#233;, une erreur se produit.</p></dd>
<dt>R&#233;pertoire de d&#233;ploiement automatique</dt>
<dd><p>Identifie le r&#233;pertoire dans lequel vous d&#233;veloppez votre application de sorte que vous n'ayez pas besoin de copier les fichiers dans le r&#233;pertoire de d&#233;ploiement automatique par d&#233;faut.</p></dd>
<dt>V&#233;rificateur</dt>
<dd><p>Si cette option est activ&#233;e, le v&#233;rificateur est ex&#233;cut&#233; avant le d&#233;ploiement. Le v&#233;rificateur examine la structure et le contenu du fichier. En g&#233;n&#233;ral, la v&#233;rification de grosses applications prend du temps.</p></dd>
<dt>Pr&#233;compiler</dt>
<dd><p>Si cette option est activ&#233;e, les fichiers JavaServer Pages<sup>TM</sup> (JSP<sup>TM</sup>) sont pr&#233;compil&#233;s. Si cette option est d&#233;sactiv&#233;e, les fichiers JSP sont compil&#233;s au moment de l'ex&#233;cution lors de leur premier acc&#232;s.</p></dd>
<dt>Autres propri&#233;t&#233;s</dt>
<dd><p>D&#233;finit d'autres propri&#233;t&#233;s.</p></dd>
</dl>

<br/>

</body>
</html>
