<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-registrationpage"></a><h4>Enregistrement du produit</h4>
<p>Pour enregistrer votre installation de Sun GlassFish<sup>TM</sup>Enterprise Server avec <a href="http://www.sun.com/service/sunconnection/index.jsp">une connexion Sun</a>, vous devez
avoir un <a href="https://reg.sun.com/whyregister">compte en ligne Sun</a>. Si vous n'avez pas encore de compte en ligne
Sun, Enterprise Server vous permet d'en cr&#233;er un lors de l'enregistrement.</p><p>La page Enregistrement du produit contient les options suivantes&#160;:</p><dl><dt>J'ai d&#233;j&#224; un compte en ligne Sun ou un compte SDN (Sun Developer Network)</dt>
<dd><p>S&#233;lectionnez cette option si vous poss&#233;dez d&#233;j&#224; un compte. Si vous s&#233;lectionnez cette option, les champs suivants sont visibles.</p><dl><dt>Nom de l'utilisateur</dt>
<dd><p>Nom d'utilisateur que vous avez sp&#233;cifi&#233; lors de l'enregistrement de votre compte en ligne Sun.</p></dd>
<dt>Mot de passe</dt>
<dd><p>Mot de passe que vous avez sp&#233;cifi&#233; lors de l'enregistrement de votre compte en ligne Sun.</p></dd>
<dt>H&#244;te proxy</dt>
<dd><p>Nom d'h&#244;te du serveur proxy de l'ordinateur sur lequel Enterprise Server s'ex&#233;cute.</p><p>Ce champ est applicable uniquement si l'ordinateur sur lequel Enterprise Server s'ex&#233;cute se connecte &#224; Internet par l'interm&#233;diaire d'un serveur proxy.</p></dd>
<dt>Port proxy</dt>
<dd><p>Num&#233;ro de port du serveur proxy de l'ordinateur sur lequel Enterprise Server s'ex&#233;cute.</p><p>Ce champ est applicable uniquement si l'ordinateur sur lequel Enterprise Server s'ex&#233;cute se connecte &#224; Internet par l'interm&#233;diaire d'un serveur proxy.</p></dd>
</dl>
</dd>
<dt>Je n'ai pas de compte en ligne Sun. M'inscrire.</dt>
<dd><p>S&#233;lectionnez cette option si vous n'avez pas de compte et que vous souhaitez enregistrer votre installation de Enterprise Server avec Sun Connection. Si vous s&#233;lectionnez cette option, les champs suivants sont visibles.</p><dl><dt>Adresse e-mail</dt>
<dd><p>Cette derni&#232;re sera le nom d'utilisateur de votre compte en ligne Sun.</p></dd>
<dt>Mot de passe</dt>
<dd><p>Mot de passe &#224; utiliser pour votre compte en ligne Sun. Celui-ci est sensible &#224; la casse et doit comporter entre 6 et 10 caract&#232;res.</p></dd>
<dt>Ressaisir le mot de passe</dt>
<dd><p>Vous devez ressaisir le mot de passe sp&#233;cifi&#233; dans le champ Mot de passe.</p></dd>
<dt>Pr&#233;nom</dt>
<dd><p>Votre pr&#233;nom.</p></dd>
<dt>Nom</dt>
<dd><p>Votre nom.</p></dd>
<dt>Soci&#233;t&#233;</dt>
<dd><p>Soci&#233;t&#233; pour laquelle vous travaillez, le cas &#233;ch&#233;ant.</p></dd>
<dt>Pays/Territoire</dt>
<dd><p>Votre pays ou territoire de r&#233;sidence.</p></dd>
<dt>H&#244;te proxy</dt>
<dd><p>Nom d'h&#244;te du serveur proxy de l'ordinateur sur lequel Enterprise Server s'ex&#233;cute.</p><p>Ce champ est applicable uniquement si l'ordinateur sur lequel Enterprise Server s'ex&#233;cute se connecte &#224; Internet par l'interm&#233;diaire d'un serveur proxy.</p></dd>
<dt>Port proxy</dt>
<dd><p>Num&#233;ro de port du serveur proxy de l'ordinateur sur lequel Enterprise Server s'ex&#233;cute.</p><p>Ce champ est applicable uniquement si l'ordinateur sur lequel Enterprise Server s'ex&#233;cute se connecte &#224; Internet par l'interm&#233;diaire d'un serveur proxy.</p></dd>
</dl>
</dd>
</dl>
<h5>T&#226;che connexe</h5>

<ul><li><p><a href="task-register.html">Enregistrer Sun GlassFish Enterprise Server avec Sun Connection</a></p></li></ul>

