<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-uc-update"></a><h4>Mises &#224; jour disponibles</h4>
<p>La page Mises &#224; jour disponibles contient des informations sur les derni&#232;res
versions des <a href="ref-uc-concepts.html#ref-uc-about-component">composants</a> de l'<a href="ref-uc-concepts.html#ref-uc-about-repository">image d'installation</a> d&#233;j&#224; install&#233;s. </p><p>La page Mises &#224; jour disponibles contient les options suivantes&#160;:</p><dl><dt>Chemin d'installation</dt>
<dd><p>Chemin du syst&#232;me de fichiers du r&#233;pertoire root ou du r&#233;pertoire sup&#233;rieur de l'image d'installation.</p></dd>
<dt>Installer</dt>
<dd><p>Ce bouton met &#224; jour les composants s&#233;lectionn&#233;s.</p></dd>
<dt>Available Updates</dt>
<dd><p>Le tableau pr&#233;sente les informations ci-dessous pour chaque composant pour lequel une nouvelle version est disponible :</p><dl><dt>Composant</dt>
<dd><p>Nom du composant.</p></dd>
<dt>Cat&#233;gorie</dt>
<dd><p>Cat&#233;gorie du logiciel &#224; laquelle le composant est associ&#233;, comme par exemple serveurs d'application, outils syst&#232;me et bases de donn&#233;es. La cat&#233;gorie est affect&#233;e au composant par le fabricant du composant au moment de sa cr&#233;ation.</p></dd>
<dt>Version</dt>
<dd><p>Num&#233;ro de version du package comprenant le composant.</p></dd>
<dt>Taille de l'installation</dt>
<dd><p>Espace disque utilis&#233; pour l'installation du composant.</p></dd>
<dt>Source</dt>
<dd><p>Pour un composant install&#233;, nom du <a href="ref-uc-concepts.html#ref-uc-about-repository">R&#233;f&#233;rentiel r&#233;seau</a> &#224; partir duquel le composant a &#233;t&#233; obtenu. </p><p>Pour un composant add-on ou une mise &#224; jour, nom du r&#233;f&#233;rentiel r&#233;seau &#224; partir duquel le composant a &#233;t&#233; obtenu. </p></dd>
</dl>
</dd>
</dl>
<h5>T&#226;ches connexes</h5>
<p><a href="task-uc-update.html">Pour installer des mises &#224; jour de composants</a></p><h5>Commandes <tt>asadmin</tt> connexes</h5>
<p>aucune.</p>
