<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-messagesecurityconfignew"></a><h4>Nouvelle configuration de s&#233;curit&#233; des messages</h4>
<p>Utilisez la page Nouvelle configuration de s&#233;curit&#233; des messages pour cr&#233;er une
configuration HttpServlet pour la s&#233;curit&#233; des messages.</p><p>La page Nouvelle configuration de s&#233;curit&#233; des messages contient les options suivantes.</p><dl><dt>Couche d'authentification</dt>
<dd><p>Sp&#233;cifie la couche message &#224; laquelle l'authentification est effectu&#233;e. La valeur doit &#234;tre <tt>SOAP</tt> ou <tt>HttpServlet</tt>. Comme une configuration SOAP est disponible par d&#233;faut, le seul choix est <tt> HttpServlet</tt>.</p></dd>
<dt>ID fournisseur</dt>
<dd><p>Identifiant unique de la configuration du fournisseur pour cette configuration de s&#233;curit&#233; des messages.</p></dd>
<dt>Fournisseur par d&#233;faut</dt>
<dd><p>Si cette option est s&#233;lectionn&#233;e, ce fournisseur est le fournisseur par d&#233;faut. Le fournisseur par d&#233;faut est appel&#233; lorsque l'application n'identifie aucun fournisseur sp&#233;cifique. Le Type de fournisseur d&#233;termine si le fournisseur est le fournisseur client par d&#233;faut, le fournisseur de serveur par d&#233;faut, ou les deux.</p></dd>
<dt>Type de fournisseur</dt>
<dd><p>Sp&#233;cifie le type du fournisseur. Les choix disponibles sont les suivants :</p><dl><dt><tt>client</tt></dt>
<dd><p>Sp&#233;cifie que le fournisseur est le fournisseur d'authentification du client.</p></dd>
<dt><tt>serveur</tt></dt>
<dd><p>Sp&#233;cifie que le fournisseur est le fournisseur d'authentification du serveur.</p></dd>
<dt><tt>client-serveur</tt></dt>
<dd><p>Sp&#233;cifie que le fournisseur est &#224; la fois le fournisseur d'authentification du client et du serveur.</p></dd>
</dl>
</dd>
<dt>Nom de classe</dt>
<dd><p>Nom de la classe d'impl&#233;mentation Java du fournisseur. Les fournisseurs d'authentification client doivent impl&#233;menter l'interface <tt>com.sun.enterprise.security.jauth.ClientAuthModule</tt> . Les fournisseurs c&#244;t&#233; serveur doivent impl&#233;menter l'interface <tt>com.sun.enterprise.security.jauth.ServerAuthModule</tt> . Les fournisseurs c&#244;t&#233; client doivent impl&#233;menter les deux interfaces.</p></dd>
<dt>Autres propri&#233;t&#233;s</dt>
<dd><p>Autres propri&#233;t&#233;s pour la configuration de s&#233;curit&#233; des messages.</p></dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-configmsgsecproviders.html">Configurer les utilitaires du Enterprise Server pour permettre l'utilisation par des fournisseurs de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityconfignew.html">Pour cr&#233;er une configuration de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityconfigedit.html">Pour modifier une configuration de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityconfigdelete.html">Pour supprimer une configuration de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityproviderconfignew.html">Pour cr&#233;er la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigedit.html">Pour modifier la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigdelete.html">Pour supprimer la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-enablemesec4appclients.html">Pour activer la s&#233;curit&#233; des messages pour les clients de l'application</a></p></li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>
<p>aucune.</p>
