<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-serverinstjvmpathsettings"></a><h4>Param&#232;tres de classpath JVM</h4>
<p>Le chemin de classe est la liste des fichiers JAR dans laquelle
l'environnement d'ex&#233;cution Java recherche des classes et d'autres ressources.</p><p>La page Param&#232;tres de classpath JVM contient les options suivantes&#160;:</p><dl><dt>Classpath de l'environnement</dt>
<dd><p>Si la case &#224; cocher Ignorer est activ&#233;e, la variable d'environnement <tt>CLASSPATH</tt> est ignor&#233;e. La variable d'environnement <tt>CLASSPATH</tt> est utile pour les didacticiels de base relatifs &#224; la programmation, mais d&#233;conseill&#233;e pour les environnements d'entreprise.</p></dd>
<dt>Classpath du serveur</dt>
<dd><p>Classpath du Enterprise Server. Ce champ est en lecture seule.</p></dd>
<dt>Classpath du syst&#232;me</dt>
<dd><p>Chemin des classes sur votre syst&#232;me.</p></dd>
<dt>Pr&#233;fixe du chemin de classe</dt>
<dd><p>Chemins complets des fichiers JAR &#224; ajouter au d&#233;but du classpath du serveur, un par ligne.</p></dd>
<dt>Suffixe du chemin de classe</dt>
<dd><p>Chemins complets des fichiers JAR &#224; ajouter &#224; la fin du classpath du serveur, un par ligne.</p></dd>
<dt>Pr&#233;fixe du chemin de biblioth&#232;que native</dt>
<dd><p>Chemins complets des fichiers JAR &#224; ajouter au pr&#233;fixe du chemin de biblioth&#232;que native, un par ligne.</p></dd>
<dt>Suffixe du chemin de biblioth&#232;que native</dt>
<dd><p>Chemins complets des fichiers JAR &#224; ajouter au chemin de biblioth&#232;que native, un par ligne.</p><p>Le chemin d'acc&#232;s &#224; la biblioth&#232;que native est une concat&#233;nation du chemin d'acc&#232;s relatif au serveur pour ses biblioth&#232;ques partag&#233;es natives, du chemin d'acc&#232;s &#224; la biblioth&#232;que native JRE standard, du param&#232;tre de l'environnement de shell (<tt>LD_LIBRARY_PATH</tt> sous UNIX<sup>&#174;</sup>) et de tout chemin sp&#233;cifi&#233; sur la page <a href="ref-serverinstjvmprofiler.html">Param&#232;tres du profileur JVM</a>.</p></dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-jvmsettings.html">Configurer les param&#232;tres g&#233;n&#233;raux du profileur JVM</a></p></li>
<li><p><a href="task-jvmpathsettings.html">Configurer les param&#232;tres du chemin d'acc&#232;s &#224; la JVM </a></p></li>
<li><p><a href="task-jvmoptions.html">Configurer les options JVM</a></p></li>
<li><p><a href="task-securitymanagerdisable.html">D&#233;sactiver le gestionnaire de s&#233;curit&#233;</a></p></li>
<li><p><a href="task-jvmprofilersettings.html">Configurer les param&#232;tres du profileur JVM </a></p></li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>

<ul><li><p><a href="http://docs.sun.com/doc/820-7701/create-jvm-options-1?a=view"><tt>create-jvm-options</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/delete-jvm-options-1?a=view"><tt>delete-jvm-options</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/list-jvm-options-1?a=view"><tt>list-jvm-options</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/create-profiler-1?a=view"><tt>create-profiler</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/delete-profiler-1?a=view"><tt>delete-profiler</tt>(1)</a></p></li></ul>

