<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-editjdbcrealm"></a><h4>Propri&#233;t&#233;s sp&#233;cifiques de la classe <tt>JDBCRealm</tt></h4>
<p>Pour prot&#233;ger vos pages ou applications Web, vous pouvez param&#233;trer la s&#233;curit&#233;
de fa&#231;on &#224; n'autoriser l'acc&#232;s qu'aux utilisateurs enregistr&#233;s. Il s'agit de l'utilitaire
d'authentification. Ce type de domaine implique de stocker les informations d'identification de
vos utilisateurs dans une base de donn&#233;es. Le Enterprise Server utilise les
informations de la base de donn&#233;es et l'option de domaine JDBC activ&#233;e
dans le fichier de configuration.</p><p>Les propri&#233;t&#233;s suivantes sont requises pour un domaine JDBC.</p><dl><dt>Contexte JAAS</dt>
<dd><p>Contexte JAAS (Java Authentication and Authorization Service), identificateur du module de connexion &#224; utiliser pour ce domaine. La seule valeur valide est <tt>jdbcRealm</tt>.</p></dd>
<dt>JNDI</dt>
<dd><p>Nom JNDI de ce domaine. La valeur par d&#233;faut est <tt>jdbc/security </tt>.</p></dd>
<dt> Table d'utilisateurs</dt>
<dd><p>Table contenant la liste des utilisateurs autoris&#233;s pour ce domaine. La valeur par d&#233;faut est <tt>usertable</tt>.</p></dd>
<dt>Colonne de nom d'utilisateur</dt>
<dd><p>Nom de la colonne contenant la liste des utilisateurs dans la table d'utilisateurs. La valeur par d&#233;faut est <tt>userid</tt>.</p></dd>
<dt>Colonne de mot de passe</dt>
<dd><p>Nom de la colonne contenant le mot de passe de l'utilisateur correspondant dans la table d'utilisateurs. La valeur par d&#233;faut est <tt>password</tt>.</p></dd>
<dt>Table de groupes</dt>
<dd><p>Nom de la table de groupes dans la base de donn&#233;es. La valeur par d&#233;faut est <tt>grouptable</tt>.</p></dd>
<dt>Colonne de nom de groupe</dt>
<dd><p>Nom de la colonne de nom de groupe dans la table de groupes de la base de donn&#233;es. La valeur par d&#233;faut est <tt>groupid</tt>.</p></dd>
</dl>
<p>Les propri&#233;t&#233;s facultatives suivantes sont disponibles pour un domaine JDBC.</p><dl><dt>Assignation de groupes</dt>
<dd><p>Liste de noms de groupes s&#233;par&#233;s par une virgule. Tous les clients pr&#233;sentant un certificat valide sont affect&#233;s &#224; ces groupes, comme par exemple <tt>employee, manager </tt> qui sont des noms de groupes d'utilisateurs.</p></dd>
<dt>Utilisateur de base de donn&#233;es</dt>
<dd><p>Vous permet de sp&#233;cifier le nom d'utilisateur de base de donn&#233;es dans le domaine plut&#244;t que le <tt>jdbc-connection-pool</tt>. Cela emp&#234;che d'autres applications de faire des recherches dans la base de donn&#233;es, d'obtenir une connexion et de parcourir la table des utilisateurs. Par d&#233;faut, la configuration <tt>jdbc-connection-pool</tt> est utilis&#233;e.</p></dd>
<dt>Mot de passe de base de donn&#233;es</dt>
<dd><p>Vous permet de sp&#233;cifier le mot de passe de base de donn&#233;es dans le domaine plut&#244;t que le <tt>jdbc-connection-pool</tt>. Cela emp&#234;che d'autres applications de faire des recherches dans la base de donn&#233;es, d'obtenir une connexion et de parcourir la table des utilisateurs. Par d&#233;faut, la configuration <tt>jdbc-connection-pool</tt> est utilis&#233;e.</p></dd>
<dt>Algorithme de hachage</dt>
<dd><p>Algorithme de hachage. La valeur par d&#233;faut est <tt>MD5</tt>. Vous pouvez utiliser tout algorithme pris en charge dans le JDK ou <tt>none</tt>.</p></dd>
<dt>Codage</dt>
<dd><p>Codage. Les valeurs autoris&#233;es sont <tt>Hex</tt> et <tt> Base64</tt>. Si <tt>digest-algorithm</tt> est sp&#233;cifi&#233;, la valeur par d&#233;faut est <tt>Hex</tt>. Si <tt>digest-algorithm</tt> n'est pas sp&#233;cifi&#233;, par d&#233;faut aucun codage n'est sp&#233;cifi&#233;.</p></dd>
<dt>Jeu de caract&#232;res</dt>
<dd><p>Jeu de caract&#232;res pour l'algorithme de hachage. </p></dd>
</dl>

