<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-messagesecurityproviderconfigedit"></a><h4>Modifier la configuration du fournisseur</h4>
<p>Utilisez la page Modifier la configuration du fournisseur pour modifier la configuration
d'un fournisseur de s&#233;curit&#233; des messages.</p><p>La page Modifier la configuration du fournisseur contient les options suivantes.</p><dl><dt>Couche d'authentification</dt>
<dd><p>Couche d'authentification (SOAP ou HttpServlet) pour laquelle cette configuration de fournisseur a &#233;t&#233; cr&#233;&#233;e. Ce champ est en lecture seule.</p></dd>
<dt>ID fournisseur</dt>
<dd><p>Nom de la configuration du fournisseur de s&#233;curit&#233; des messages. Ce champ est en lecture seule. Vous pouvez sp&#233;cifier l'ID fournisseur uniquement lors de la cr&#233;ation d'une nouvelle configuration de fournisseur de s&#233;curit&#233; des messages.</p></dd>
<dt>Fournisseur par d&#233;faut</dt>
<dd><p>Si cette option est s&#233;lectionn&#233;e, ce fournisseur est le fournisseur par d&#233;faut. Le fournisseur par d&#233;faut est appel&#233; lorsque l'application n'identifie aucun fournisseur sp&#233;cifique. Le Type de fournisseur d&#233;termine si le fournisseur est le fournisseur client par d&#233;faut, le fournisseur de serveur par d&#233;faut, ou les deux.</p></dd>
<dt>Type de fournisseur</dt>
<dd><p>Sp&#233;cifie le type du fournisseur. Les choix disponibles sont les suivants :</p><dl><dt><tt>client</tt></dt>
<dd><p>Sp&#233;cifie que le fournisseur est le fournisseur d'authentification du client.</p></dd>
<dt><tt>serveur</tt></dt>
<dd><p>Sp&#233;cifie que le fournisseur est le fournisseur d'authentification du serveur.</p></dd>
<dt><tt>client-serveur</tt></dt>
<dd><p>Sp&#233;cifie que le fournisseur est &#224; la fois le fournisseur d'authentification du client et du serveur.</p></dd>
</dl>
</dd>
<dt>Nom de classe</dt>
<dd><p>Nom de la classe d'impl&#233;mentation Java du fournisseur. Les fournisseurs d'authentification client doivent impl&#233;menter l'interface <tt>com.sun.enterprise.security.jauth.ClientAuthModule</tt> . Les fournisseurs c&#244;t&#233; serveur doivent impl&#233;menter l'interface <tt>com.sun.enterprise.security.jauth.ServerAuthModule</tt> . Les fournisseurs c&#244;t&#233; client doivent impl&#233;menter les deux interfaces.</p></dd>
<dt>Authentifier la source (pour la strat&#233;gie de requ&#234;te)</dt>
<dd><p>Type d'authentification requise pour la strat&#233;gie de requ&#234;te. La strat&#233;gie de requ&#234;te d&#233;termine le traitement des requ&#234;tes par le fournisseur d'authentification. Les champs de strat&#233;gie de requ&#234;te sont facultatifs, mais s'ils ne sont pas sp&#233;cifi&#233;s, le fournisseur d'authentification n'authentifie pas les messages de requ&#234;te.</p><p>S&#233;lectionnez <tt>exp&#233;diteur</tt> pour sp&#233;cifier au niveau de la couche message l'authentification de l'exp&#233;diteur (par exemple, nom d'utilisateur et mot de passe) des messages de requ&#234;te. S&#233;lectionnez <tt>content</tt> pour sp&#233;cifier l'authentification du contenu (par exemple, signature num&#233;rique) des messages de requ&#234;te. Laissez le champ vierge pour ne pas authentifier la source des requ&#234;tes. Par d&#233;faut, aucun type d'authentification n'est s&#233;lectionn&#233;.</p><p>Pour une description des actions r&#233;alis&#233;es par les fournisseurs de s&#233;curit&#233; des messages SOAP, reportez-vous &#224; la rubrique <a href="ref-configreq-respolicy.html">Configurer les modalit&#233;s de requ&#234;te et de r&#233;ponse</a>.</p></dd>
<dt>Authentifier le destinataire (pour la strat&#233;gie de requ&#234;te)</dt>
<dd><p>Sp&#233;cifie si l'authentification du destinataire a lieu avant ou apr&#232;s l'authentification du contenu pour la strat&#233;gie de requ&#234;te.</p><p>S&#233;lectionnez <tt>avant contenu</tt> ou <tt>apr&#232;s contenu</tt> pour demander au niveau de la couche message l'authentification du destinataire du message de requ&#234;te &#224; son exp&#233;diteur (par cryptage XML). Si la valeur n'est pas indiqu&#233;e, la valeur par d&#233;faut est <tt>after-content</tt>. Les strat&#233;gies sont exprim&#233;es dans l'ordre de l'exp&#233;diteur du message, donc <tt>apr&#232;s contenu</tt> signifie que le destinataire du message d&#233;crypte le message avant de valider la signature.</p></dd>
<dt>Authentifier la source (pour la strat&#233;gie de r&#233;ponse)</dt>
<dd><p>Type d'authentification requise pour la strat&#233;gie de r&#233;ponse. La strat&#233;gie de r&#233;ponse d&#233;termine le traitement des r&#233;ponses par le fournisseur d'authentification. Les champs de strat&#233;gie de r&#233;ponse sont facultatifs, mais s'ils ne sont pas renseign&#233;s, aucune authentification n'est appliqu&#233;e aux messages de r&#233;ponse.</p><p>S&#233;lectionnez <tt>exp&#233;diteur</tt> pour sp&#233;cifier au niveau de la couche message l'authentification de l'exp&#233;diteur (par exemple, nom d'utilisateur et mot de passe) des messages de r&#233;ponse. S&#233;lectionnez <tt>contenu</tt> pour sp&#233;cifier l'authentification du contenu (par exemple, signature num&#233;rique) des messages de r&#233;ponse. Laissez le champ vide pour ne pas authentifier les sources de r&#233;ponse. Par d&#233;faut, aucun type d'authentification n'est s&#233;lectionn&#233;.</p><p>Pour une description des actions r&#233;alis&#233;es par les fournisseurs de s&#233;curit&#233; des messages SOAP, reportez-vous &#224; la rubrique <a href="ref-configreq-respolicy.html">Configurer les modalit&#233;s de requ&#234;te et de r&#233;ponse</a>.</p></dd>
<dt>Authentifier le destinataire (pour la strat&#233;gie de r&#233;ponse)</dt>
<dd><p>Sp&#233;cifie si l'authentification du destinataire a lieu avant ou apr&#232;s l'authentification du contenu pour la strat&#233;gie de r&#233;ponse.</p><p>S&#233;lectionnez <tt>avant contenu</tt> ou <tt>apr&#232;s contenu</tt> pour d&#233;finir une demande au niveau de la couche message d'authentification du destinataire du message de r&#233;ponse &#224; son exp&#233;diteur (par cryptage XML). Si la valeur n'est pas indiqu&#233;e, la valeur par d&#233;faut est <tt>after-content</tt>. Les strat&#233;gies sont exprim&#233;es dans l'ordre de l'exp&#233;diteur du message, donc <tt>apr&#232;s contenu</tt> signifie que le destinataire du message d&#233;crypte le message avant de valider la signature.</p></dd>
<dt>Autres propri&#233;t&#233;s</dt>
<dd><p>Autres propri&#233;t&#233;s pour la configuration du fournisseur de s&#233;curit&#233; des messages. Pour obtenir une description des autres propri&#233;t&#233;s disponibles pour les configurations de fournisseurs, consultez <a href="ref-messagesecurityproviderconfigprops.html">Propri&#233;t&#233;s propres aux configurations de fournisseur de s&#233;curit&#233; des messages</a>.</p></dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-configmsgsecproviders.html">Configurer les utilitaires du Enterprise Server pour permettre l'utilisation par des fournisseurs de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityconfignew.html">Pour cr&#233;er une configuration de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityconfigedit.html">Pour modifier une configuration de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityconfigdelete.html">Pour supprimer une configuration de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityproviderconfignew.html">Pour cr&#233;er la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigedit.html">Pour modifier la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigdelete.html">Pour supprimer la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-enablemesec4appclients.html">Pour activer la s&#233;curit&#233; des messages pour les clients de l'application</a></p></li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>

<ul><li><p><a href="http://docs.sun.com/doc/820-7701/create-message-security-provider-1?a=view"><tt>create-message-security-provider</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/list-message-security-providers-1?a=view"><tt>list-message-security-providers</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/delete-message-security-provider-1?a=view"><tt>delete-message-security-provider</tt>(1)</a></p></li></ul>
<p>De plus, utilisez la commande <a href="http://docs.sun.com/doc/820-7701/set-1?a=view"><tt>set</tt>(1)</a> pour modifier les strat&#233;gies de requ&#234;te
et de r&#233;ponse.</p><p>Pour d&#233;finir la strat&#233;gie de r&#233;ponse, remplacez <tt>request</tt> dans les commandes suivantes
par <tt>response</tt>.</p>
<ul><li><p>Ajoutez une strat&#233;gie de requ&#234;te au client et d&#233;finissez la source d'authentification :</p><pre>asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
provider-config.ClientProvider.request-policy.auth_source=
sender | content</pre></li>
<li><p>Ajoutez une strat&#233;gie de requ&#234;te au serveur et d&#233;finissez la source d'authentification :</p><pre>asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
provider-config.ServerProvider.request-policy.auth_source=
sender | content</pre></li>
<li><p>Ajoutez une strat&#233;gie de requ&#234;te au client et d&#233;finissez le destinataire de l'authentification :</p><pre>asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
provider-config.ClientProvider.request-policy.auth_recipient=
before-content | after-content</pre></li>
<li><p>Ajoutez une strat&#233;gie de requ&#234;te au serveur et d&#233;finissez le destinataire de l'authentification :</p><pre>asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
provider-config.ServerProvider.request-policy.auth_recipient=
before-content | after-content</pre></li></ul>

