<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-messagesecurityproviderconfig"></a><h4>Configurations de fournisseurs</h4>
<p>Utilisez la page Configurations de fournisseurs pour configurer les configurations de fournisseurs
de s&#233;curit&#233; des messages pour le niveau d'authentification SOAP ou HttpServlet.</p><p>Par d&#233;faut, quatre fournisseurs sont configur&#233;s pour le niveau d'authentification SOAP.</p><p>Pour chaque configuration de fournisseur, la page Configurations de fournisseurs contient les
informations suivantes.</p><dl><dt>ID fournisseur</dt>
<dd><p>Nom de la configuration du fournisseur.</p></dd>
<dt>Type de fournisseur</dt>
<dd><p>Type du fournisseur, qui peut &#234;tre l'un des &#233;l&#233;ments suivants :</p><dl><dt><tt>client</tt></dt>
<dd><p>Sp&#233;cifie que le fournisseur est le fournisseur d'authentification du client.</p></dd>
<dt><tt>serveur</tt></dt>
<dd><p>Sp&#233;cifie que le fournisseur est le fournisseur d'authentification du serveur.</p></dd>
<dt><tt>client-serveur</tt></dt>
<dd><p>Sp&#233;cifie que le fournisseur est &#224; la fois le fournisseur d'authentification du client et du serveur.</p></dd>
</dl>
</dd>
<dt>Fournisseur par d&#233;faut</dt>
<dd><p>S'il est d&#233;fini &#224; <tt>true</tt>, le fournisseur est le fournisseur par d&#233;faut.</p></dd>
<dt>Nom de classe</dt>
<dd><p>Nom de la classe d'impl&#233;mentation Java du fournisseur.</p></dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-configmsgsecproviders.html">Configurer les utilitaires du Enterprise Server pour permettre l'utilisation par des fournisseurs de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityconfignew.html">Pour cr&#233;er une configuration de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityconfigedit.html">Pour modifier une configuration de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityconfigdelete.html">Pour supprimer une configuration de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityproviderconfignew.html">Pour cr&#233;er la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigedit.html">Pour modifier la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigdelete.html">Pour supprimer la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-enablemesec4appclients.html">Pour activer la s&#233;curit&#233; des messages pour les clients de l'application</a></p></li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>

<ul><li><p><a href="http://docs.sun.com/doc/820-7701/create-message-security-provider-1?a=view"><tt>create-message-security-provider</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/list-message-security-providers-1?a=view"><tt>list-message-security-providers</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/delete-message-security-provider-1?a=view"><tt>delete-message-security-provider</tt>(1)</a></p></li></ul>

