<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-generaltab"></a><h4>Informations g&#233;n&#233;rales</h4>
<p>Utilisez la page Informations g&#233;n&#233;rales pour v&#233;rifier les param&#232;tres d'Enterprise Server et
afficher les donn&#233;es de la Java Virtual Machine.</p><p>La page Informations g&#233;n&#233;rales contient les informations suivantes.</p><dl><dt>Bouton Stop (Arr&#234;ter)</dt>
<dd><p>Cliquez sur le bouton Stop pour arr&#234;ter le Enterprise Server.</p></dd>
<dt>Bouton Red&#233;marrer</dt>
<dd><p>Cliquez sur le bouton Red&#233;marrer pour red&#233;marrer le Enterprise Server.</p></dd>
<dt>Bouton Afficher les fichiers journaux</dt>
<dd><p>Cliquez sur le bouton Afficher les fichiers journaux pour afficher le journal du serveur.</p></dd>
<dt>Nom</dt>
<dd><p>Nom du serveur.</p></dd>
<dt>Rapport JVM</dt>
<dd><p>Si vous cliquez sur Rapport JVM, une fen&#234;tre distincte s'ouvre et affiche des rapports sur la Java Virtual Machine, notamment un rapport de synth&#232;se, un rapport de gestion de m&#233;moire et de collecte de d&#233;chets, un rapport de chargement de classes et le vidage des threads en cours.</p></dd>
<dt>R&#233;pertoire de configuration</dt>
<dd><p>R&#233;pertoire de la machine h&#244;te qui contient les fichiers de configuration, tels que <tt>domain.xml</tt>.</p></dd>
<dt>Version install&#233;e</dt>
<dd><p>Identifiant de la version du produit.</p></dd>
<dt>D&#233;bogage</dt>
<dd><p>Indique si le d&#233;bogage est activ&#233;. Dans l'affirmative, le num&#233;ro de port est &#233;galement affich&#233;.</p></dd>
<dt>Port(s) HTTP</dt>
<dd><p>Ports actuellement configur&#233;s pour les requ&#234;tes et les r&#233;ponses HTTP.</p></dd>
<dt>Port(s) IIOP</dt>
<dd><p>Ports actuellement configur&#233;s pour les requ&#234;tes et les r&#233;ponses IIOP.</p></dd>
</dl>
<h5>T&#226;che connexe</h5>

<ul><li><p><a href="task-generaltab.html">Pour afficher des Informations g&#233;n&#233;rales sur le Enterprise Server</a></p></li>
<li><p><a href="task-logviewer.html">Afficher le journal du serveur</a></p></li></ul>

