<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-logviewer"></a><h4>Afficheur du journal</h4>
<a name="indexterm-22"></a><a name="indexterm-23"></a><p>Utilisez la page Afficheur du journal pour afficher le journal du serveur
et personnaliser l'affichage du journal.</p><p>La page Afficheur du journal se compose de trois zones :</p>
<ul><li><p>Crit&#232;res de recherche</p></li>
<li><p>Recherche avanc&#233;e</p></li>
<li><p>R&#233;sultats de la recherche</p></li></ul>
<p>La zone Crit&#232;res de recherche contient les options suivantes.</p><dl><dt>Recherche avanc&#233;e</dt>
<dd><p>Un clic sur ce lien ouvre une zone qui vous permet d'affiner davantage l'afficheur du journal.</p></dd>
<dt>Horodatage</dt>
<dd><p>Le bouton-radio Le plus r&#233;cent affiche les messages les plus r&#233;cents. Le bouton-radio Plage sp&#233;cifique ouvre les champ De et A qui vous permettent d'afficher les messages d'une certaine p&#233;riode uniquement.</p><p>Pour la valeur Heure, la syntaxe doit prendre la forme suivante (<b>SSS</b> est mis pour millisecondes) :</p><pre><b>hh</b>:<b>mm</b>:<b>ss</b>.<b>SSS</b></pre><p>Par exemple :</p><pre>17:10:00.000</pre><p>Si la valeur de d&#233;but est post&#233;rieure &#224; la valeur de fin, un message d'erreur appara&#238;t.</p></dd>
<dt>Niveau de journalisation</dt>
<dd><p>Niveau de journalisation s&#233;lectionn&#233; pour le filtrage. Par d&#233;faut, tous les messages figurant dans le journal du serveur &#224; partir du niveau de journalisation choisi sont affich&#233;s. S&#233;lectionnez la case &#171; Ne pas inclure des messages plus graves &#187; pour afficher uniquement les messages du niveau choisi.</p><p>Pour vous assurer que les messages que vous voulez afficher apparaissent dans le journal du serveur, commencez par d&#233;finir les niveaux de journalisation appropri&#233;s sur la page Niveaux de journalisation de module. Voir <a href="task-eelogginglevels.html">Configurer les niveaux de journalisation</a>.</p><p>Si vous choisissez de filtrer les messages du journal en fonction du niveau de journalisation, seuls les messages correspondant aux crit&#232;res de filtre sp&#233;cifi&#233;s s'affichent. Toutefois, ce filtrage n'affecte pas les messages consign&#233;s dans le journal du serveur.</p></dd>
</dl>
<p>La zone Recherche avanc&#233;e contient les options suivantes.</p><dl><dt>Journal</dt>
<dd><p>Espaces de noms du journal pour filtrer par module. Utilisez maj + clic ou Ctrl + clic pour s&#233;lectionner plusieurs espaces de noms.</p><p>Si vous s&#233;lectionnez un espace de noms &#224; un niveau sup&#233;rieur, tous les espaces de noms situ&#233;s en dessous seront &#233;galement s&#233;lectionn&#233;s. Par exemple, si vous s&#233;lectionnez <tt>javax.enterprise.system</tt>, seront &#233;galement s&#233;lectionn&#233;s les journaux de tous les modules situ&#233;s sous cet espace de noms : <tt>javax.enterprise.system.core</tt>, <tt>javax.enterprise.system.tools.admin </tt>, etc.</p></dd>
<dt>Journal personnalis&#233;</dt>
<dd><p>Journals propres &#224; une application particuli&#232;re, un par ligne.</p><p>Si l'application comprend plusieurs modules, vous pouvez les afficher tous ou seulement une partie. Prenons l'exemple d'une application comprenant les journaux suivants :</p><pre>com.mycompany.myapp.module1
com.mycompany.myapp.module2
com.mycompany.myapp.module3</pre><p>Pour afficher des messages de tous les modules dans l'application, tapez <tt>com.mycompany.myapp </tt>. Pour afficher les messages du <tt>module2</tt> uniquement, entrez <tt>com.mycompany.myapp.module2</tt>.</p><p>Si vous sp&#233;cifiez un ou plusieurs enregistreurs personnalis&#233;s, les messages des modules du Enterprise Server n'apparaissent que si vous les avez explicitement sp&#233;cifi&#233;s dans la zone Enregistreur.</p></dd>
<dt>Paires de valeurs de nom</dt>
<dd><p>Nom cl&#233; et valeur d'un thread pour afficher le r&#233;sultat d'un thread particulier. Le nom cl&#233; est <tt>_ThreadID</tt>. Par exemple :</p><pre>_ThreadID=13</pre><p>Supposons que <tt>com.mycompany.myapp.module2</tt> fonctionne sur plusieurs threads. Pour affiner le visionneur de journaux et afficher uniquement le r&#233;sultat d'un seul thread, sp&#233;cifiez le journal de ce module dans le champ Enregistreur personnalis&#233;, puis sp&#233;cifiez l'ID thread.</p></dd>
<dt>Affichage</dt>
<dd><p>Nombre de messages &#224; afficher &#224; la fois. Le nombre de messages affich&#233;s par d&#233;faut est de 40. Les autres choix sont 100, 250 et 1000.</p><p>Pour afficher les suivis de pile, d&#233;s&#233;lectionnez la case &#171; Tronquer les messages trop longs &#187;. Par d&#233;faut, les suivis de pile n'apparaissent pas dans le visionneur. Pour les afficher, cliquez sur le lien <tt>(d&#233;tails)</tt> pour un message.</p></dd>
</dl>
<p>Le tableau des R&#233;sultats de la recherche affiche les messages du journal
du serveur.</p><p>Pour chaque message, le tableau des R&#233;sultats de la recherche contient les
informations suivantes.</p><dl><dt>Num&#233;ro d'enregistrement</dt>
<dd><p>Num&#233;ro du message dans le journal du serveur.</p></dd>
<dt>Niveau de journalisation</dt>
<dd><p>Niveau de journalisation du message.</p></dd>
<dt>Message</dt>
<dd><p>Texte bref du message du journal. Cliquez sur le lien <tt>(d&#233;tails)</tt> pour afficher la version format&#233;e d'un message.</p></dd>
<dt>Journal</dt>
<dd><p>Le module de journalisation qui a g&#233;n&#233;r&#233; le message du journal.</p></dd>
<dt>Horodatage</dt>
<dd><p>Date et heure d'&#233;mission du message du journal.</p></dd>
<dt>Nom/Paires de valeurs</dt>
<dd><p>Nom du thread et ID du message du journal.</p></dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-eelogging.html">Configurer les param&#232;tres g&#233;n&#233;raux de journalisation</a></p></li>
<li><p><a href="task-eelogginglevels.html">Configurer les niveaux de journalisation</a></p></li>
<li><p><a href="task-logviewer.html">Afficher le journal du serveur</a></p></li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>

<ul><li><p><tt>set-log-level</tt></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/rotate-log-1?a=view"><tt>rotate-log</tt>(1)</a></p></li></ul>

