<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-jmxconnectoredit"></a><h4>Modifier le connecteur JMX</h4>
<p>Utilisez la page Modifier le connecteur JMX pour modifier le connecteur JMX
conforme au JSR 360.</p><p>La page Modifier le connecteur JMX contient les options suivantes.</p><dl><dt>Nom</dt>
<dd><p>Nom du connecteur JMX. Ce champ est en lecture seule.</p></dd>
<dt>Protocole JMX</dt>
<dd><p>Nom du protocole que ce connecteur JMX prend en charge. Ce champ est en lecture seule.</p></dd>
<dt>JMXServiceURL</dt>
<dd><p>URL du service JMX. Ce champ est en lecture seule.</p></dd>
<dt>S&#233;curit&#233;</dt>
<dd><p>Si la case Activ&#233; est coch&#233;e, la communication JMX est chiffr&#233;e. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p></dd>
<dt>Adresse</dt>
<dd><p>Adresse IP du service de nommage o&#249; le stub de serveurs de connecteurs JMX est enregistr&#233;. Ce n'est pas le port du socket de serveur qui effectue la v&#233;ritable communication JMX. C'est l'adresse de l'interface r&#233;seau depuis laquelle le registre RMI est lanc&#233;. Si votre syst&#232;me est dot&#233; de plusieurs interfaces r&#233;seau, modifiez cette valeur pour qu'une seule interface soit s&#233;lectionn&#233;e. La valeur par d&#233;faut est <tt>0.0.0.0</tt>.</p></dd>
<dt>Port</dt>
<dd><p>Num&#233;ro du port sur lequel le service de nommage (registre RMI) &#233;coute les connexions client RMI. La seule utilisation de ce service de nommage consiste &#224; t&#233;l&#233;charger les stubs RMI. Si le port par d&#233;faut est occup&#233;, on utilise un port libre. Les valeurs l&#233;gales sont de 1 &#224; 65535. Sous les syst&#232;mes UNIX<sup>&#174;</sup>, la cr&#233;ation de sockets qui &#233;coutent sur les ports 1 &#224; 1024 n&#233;cessite des privil&#232;ges de super utilisateur. La valeur par d&#233;faut est 8686.</p></dd>
<dt>Nom de domaine</dt>
<dd><p>Nom qui repr&#233;sente le domaine administratif sp&#233;cial. Toutes les authentifications sont g&#233;r&#233;es par ce domaine. La valeur par d&#233;faut est <tt>admin-realm </tt>.</p></dd>
<dt>Autres propri&#233;t&#233;s</dt>
<dd><p>Autres propri&#233;t&#233;s du connecteur JMX. Plusieurs propri&#233;t&#233;s sont indiqu&#233;es par d&#233;faut.</p></dd>
</dl>
<h5>T&#226;che connexe</h5>

<ul><li><p><a href="task-jmxconnectoredit.html">Pour modifier le connecteur JMX</a></p></li>
<li><p><a href="task-jmxconnectorssledit.html">Pour modifier les param&#232;tres SSL du connecteur JMX</a></p></li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>
<p>aucune.</p>
