<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-lifecyclemodulenew"></a><h4>Nouveau module de cycle de vie</h4>
<p>Utilisez la page Nouveau module de cycle de vie pour d&#233;finir un
nouveau module de cycle de vie.</p><p>La page Nouveau module de cycle de vie contient les options suivantes.</p><dl><dt>Nom</dt>
<dd><p>Nom du module de cycle de vie.</p></dd>
<dt>Nom de classe</dt>
<dd><p>Nom complet complet du fichier de classe du module de cycle de vie. La classe doit impl&#233;menter l'interface <tt>com.sun.appserv.server.LifecycleListener</tt>.</p></dd>
<dt>Classpath</dt>
<dd><p>Classpatch du module de cycle de vie. Le classpath indique l&#224; o&#249; se trouve le module de cycle de vie. La valeur par d&#233;faut est <tt></tt><i>domain-dir</i><tt>/applications</tt>. Si le module est d&#233;j&#224; dans ce r&#233;pertoire (c'est-&#224;-dire dans le classpath du serveur), ce champ peut &#234;tre laiss&#233; vierge.</p></dd>
<dt>Ordre de chargement</dt>
<dd><p>Ordre dans lequel ce module de cycle de vie doit &#234;tre charg&#233; au d&#233;marrage. Les modules aux valeurs d'ordre de chargement &#224; petit nombre sont charg&#233;s plus t&#244;t. La valeur peut aller de 101 &#224; la valeur <tt>MAXINT</tt> du syst&#232;me d'exploitation. Les valeurs de 1 &#224; 100 sont r&#233;serv&#233;es.</p></dd>
<dt>Statut</dt>
<dd><p>Si cette option est s&#233;lectionn&#233;e, le module de cycle de vie est activ&#233;. Cette option est activ&#233;e par d&#233;faut.</p></dd>
<dt>Echec au chargement</dt>
<dd><p>Si cette option est s&#233;lectionn&#233;e, le serveur sera arr&#234;t&#233; en cas d'&#233;chec de chargement du module de cycle de vie. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p></dd>
<dt>Serveurs virtuels</dt>
<dd><p>Le ou les serveur(s) virtuel(s) &#224; associer au module de cycle de vie. Par d&#233;faut, aucun serveur virtuel n'est s&#233;lectionn&#233;.</p></dd>
<dt>Description</dt>
<dd><p>Description du module de cycle de vie.</p></dd>
<dt>Autres propri&#233;t&#233;s</dt>
<dd><p>Autres propri&#233;t&#233;s de module de cycle de vie. Le Enterprise Server ne d&#233;finit aucune autre propri&#233;t&#233; pour les modules de cycle de vie.</p></dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-lifecyclemodulenew.html">Pour cr&#233;er un module de cycle de vie</a></p></li>
<li><p><a href="task-lifecyclemoduleedit.html">Pour modifier un module de cycle de vie</a></p></li>
<li><p><a href="task-lifecyclemoduledelete.html">Pour supprimer un module de cycle de vie</a></p></li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>

<ul><li><p><a href="http://docs.sun.com/doc/820-7701/create-lifecycle-module-1?a=view"><tt>create-lifecycle-module</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/list-lifecycle-modules-1?a=view"><tt>list-lifecycle-modules</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/delete-lifecycle-module-1?a=view"><tt>delete-lifecycle-module</tt>(1)</a></p></li></ul>

