<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-configreq-respolicy"></a><h4>Configurer les modalit&#233;s de requ&#234;te et de r&#233;ponse</h4>
<p>Si Authentifier la source est <tt>sender</tt>, alors le message contient l'en-t&#234;te <tt>wsse:Security</tt>
avec <tt>wsse:UsernameToken </tt> (avec mot de passe). Si Authentifier la source indique contenu,
alors le contenu du corps de message SOAP est sign&#233; et le
message contient l'en-t&#234;te <tt>wsse:Security </tt> avec la signature du corps de message repr&#233;sent&#233;e
par <tt>ds</tt> : <tt> Signature</tt>.</p><p>Si Authentifier le destinataire indique <tt>Before Content</tt> ou <tt>After Content</tt>, le contenu du corps
de message SOAP est crypt&#233; et remplac&#233; par <tt>xend:EncryptedData</tt>. Le message contient
l'en-t&#234;te <tt>a wsse:Security</tt> qui inclut  <tt>xenc:EncryptedKey</tt>. <tt>xenc:EncryptedKey </tt> contient la cl&#233; utilis&#233;e pour
crypter le corps du message SOAP. La cl&#233; est crypt&#233;e dans la
cl&#233; publique du destinataire.</p><p>Si les champs Authentifier la source et Authentifier le destinataire sont laiss&#233;s
vides, alors aucune strat&#233;gie de s&#233;curit&#233; n'est sp&#233;cifi&#233;e et les modules n'effectuent
aucune op&#233;ration de s&#233;curit&#233;.</p><p>Le tableau suivant affiche les diff&#233;rentes strat&#233;gies de protection des messages et
les op&#233;rations de s&#233;curit&#233; des messages effectu&#233;es par les fournisseurs WS-Security de
s&#233;curit&#233; des messages SOAP pour chaque configuration.</p><a name="gbutq"></a><h6>Tableau&#160;1 Strat&#233;gie de protection des messages bas&#233;e sur les op&#233;rations WS-Security de s&#233;curit&#233; des messages SOAP</h6><table><col width="33%"><col width="33%"><col width="33%"><tr><th align="left" valign="top" scope="column"></th>
<th align="left" valign="top" scope="column"><p>Authentifier le destinataire <tt>avant contenu</tt></p></th>
<th align="left" valign="top" scope="column"><p>Authentifier le destinataire
<tt>apr&#232;s contenu</tt></p></th>
</tr>
<tr><td align="left" valign="top" scope="row"><p>Authentifier la source <tt>exp&#233;diteur</tt></p></td>
<td colspan="2" align="left" valign="top" scope="row"><p>Le contenu du corps de message SOAP est crypt&#233;
et remplac&#233; par <tt>xend:EncryptedData</tt>. Le message contient l'en-t&#234;te <tt>wsse:Security</tt> comprenant <tt>wsse:UsernameToken (with password)</tt> et
<tt>xenc:EncryptedKey</tt>. <tt>xenc:EncryptedKey </tt> contient la cl&#233; utilis&#233;e pour crypter le corps du message
SOAP. La cl&#233; est crypt&#233;e dans la cl&#233; publique du destinataire.</p></td>
</tr>
<tr><td align="left" valign="top" scope="row"><p>Authentifier la
source <tt>contenu</tt></p></td>
<td align="left" valign="top" scope="row"><p>Le contenu du corps de message SOAP est crypt&#233; et remplac&#233;
par <tt>xend:EncryptedData</tt>. <tt>xenc:EncryptedData</tt> est sign&#233;. Le message contient l'en-t&#234;te <tt>wsse:Security</tt> comprenant <tt>xenc:EncryptedKey</tt>
et une <tt>ds: Signature </tt>. <tt>xenc:EncryptedKey </tt> contient la cl&#233; utilis&#233;e pour crypter le corps
du message SOAP. La cl&#233; est crypt&#233;e dans la cl&#233; publique du
destinataire.</p></td>
<td align="left" valign="top" scope="row"><p>Le contenu du corps de message SOAP est sign&#233;, puis crypt&#233; et
remplac&#233; par <tt>xend:EncryptedData</tt>. Le message contient l'en-t&#234;te <tt>wsse:Security</tt> qui inclut <tt>xenc:EncryptedKey</tt> et
<tt>ds:Signature</tt>. <tt>xenc:EncryptedKey </tt> contient la cl&#233; utilis&#233;e pour crypter le corps du message
SOAP. La cl&#233; est crypt&#233;e dans la cl&#233; publique du destinataire.</p></td>
</tr>
</table>
