<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-redeploy"></a><h4>Red&#233;ploiement d'applications ou de modules</h4>
<p>Pour red&#233;ployer une application qui a d&#233;j&#224; &#233;t&#233; d&#233;ploy&#233;e, utilisez la page
Red&#233;ploiement d'applications ou de modules.</p><p>La page Red&#233;ploiement d'applications ou de modules contient les options suivantes&#160;:</p><dl><dt>Nom</dt>
<dd><p>Champ en lecture seule indiquant le nom de l'application que vous red&#233;ployez.</p></dd>
<dt>Conserver les sessions</dt>
<dd><p>Si la case Conserver les sessions est s&#233;lectionn&#233;e, les sessions actives de l'application que vous red&#233;ployez sont conserv&#233;es, puis restaur&#233;es une fois le red&#233;ploiement termin&#233;.</p><p>Si la conservation ou la restauration d'une session active de l'application &#233;choue, <b> aucune</b> des sessions ne sera disponible une fois le red&#233;ploiement termin&#233;. Toutefois, le red&#233;ploiement se poursuit et un avertissement est enregistr&#233;.</p><p>Pour conserver les sessions actives, Enterprise Server s&#233;rialise les sessions et les enregistre dans la m&#233;moire. Pour restaurer les sessions, le chargeur de classe de l'application qui vient d'&#234;tre red&#233;ploy&#233;e d&#233;s&#233;rialise les sessions qui ont &#233;t&#233; enregistr&#233;es.</p></dd>
<dt>Lieu</dt>
<dd><p>Le lieu de la nouvelle archive de l'application que vous red&#233;ployez.</p><p>Les options suivantes indiquent les points d'acc&#232;s &#224; l'archive et pr&#233;cisent si cette derni&#232;re est un fichier ou un r&#233;pertoire.</p><dl><dt>Fichier empaquet&#233; &#224; t&#233;l&#233;charger sur le serveur</dt>
<dd><p>L'archive est contenue dans un fichier stock&#233; sur la machine client ou accessible depuis cette m&#234;me machine.</p><p>L'ordinateur client est l'h&#244;te sur lequel vous visualisez la Console d?administration via un navigateur.</p></dd>
<dt>Fichier empaquet&#233; ou r&#233;pertoire local accessible depuis le serveur d'application</dt>
<dd><p>L'archive est un fichier stock&#233; sur la machine serveur ou une application non empaquet&#233;e contenue dans un r&#233;pertoire &#233;clat&#233;.</p><p>Le serveur est l'h&#244;te qui ex&#233;cute le serveur d'administration du domaine Application Server. </p></dd>
</dl>
</dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-appredeploy.html">Red&#233;ploiement d'une application d&#233;ploy&#233;e</a></p></li>
<li><p><a href="task-appdeployweb.html">D&#233;ployer une application Web</a></p></li>
<li><p><a href="task-deployentapp.html">Pour d&#233;ployer une application d'entreprise</a></p></li>
<li><p><a href="task-appdeployclient.html">Pour d&#233;ployer un client d'application</a></p></li>
<li><p><a href="task-appdeployconn.html">Pour d&#233;ployer un module connecteur</a></p></li>
<li><p><a href="task-appdeployejb.html">Pour d&#233;ployer un Jar EJB</a></p></li>
<li><p><a href="task-appdeployruby.html">Pour d&#233;ployer une application Ruby </a></p></li>
<li><p><a href="task-appedit.html">Modification d'une application d&#233;ploy&#233;e</a></p></li>
<li><p><a href="task-appviewdesc.html">Affichage des descripteurs d'une application</a></p></li>
<li><p><a href="task-applaunch.html">Lancement d'une application</a></p></li>
<li><p><a href="task-apprestart.html">Red&#233;marrage d'une application d&#233;ploy&#233;e</a></p></li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>

<ul><li><p><a href="http://docs.sun.com/doc/820-7701/deploy-1?a=view"><tt>deploy</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/redeploy-1?a=view"><tt>redeploy</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/list-applications-1?a=view"><tt>list-applications</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/list-modules-1?a=view"><tt>list-modules</tt>(1)</a></p></li></ul>

