<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-ldaprealmprop"></a><h4>Propri&#233;t&#233;s sp&#233;cifiques &#224; la classe <tt>LDAPRealm </tt></h4>
<p>Les propri&#233;t&#233;s suivantes sont requises pour un domaine LDAP.</p><dl><dt>Contexte JAAS</dt>
<dd><p>Contexte JAAS (Java Authentication and Authorization Service), identificateur du module de connexion &#224; utiliser pour ce domaine. La seule valeur valide est <tt>solarisRealm</tt>.</p></dd>
<dt>R&#233;pertoire</dt>
<dd><p>URL LDAP de votre serveur.</p></dd>
<dt>DN de base</dt>
<dd><p>Nom distinctif (DN) de base LDAP pour l'emplacement des donn&#233;es utilisateur. Ce DN de base peut se trouver &#224; n'importe quel niveau au-dessus des donn&#233;es utilisateur, &#233;tant donn&#233; qu'une recherche en arborescence est effectu&#233;e. Plus l'arbre de recherche est r&#233;duit, meilleures sont les performances.</p></dd>
</dl>
<p>La propri&#233;t&#233; facultative suivante est disponible pour un domaine LDAP.</p><dl><dt>Assignation de groupes</dt>
<dd><p>Liste de noms de groupes s&#233;par&#233;s par une virgule. Tous les clients pr&#233;sentant un certificat valide sont affect&#233;s &#224; ces groupes, comme par exemple <tt>employee, manager </tt> qui sont des noms de groupes d'utilisateurs.</p></dd>
</dl>
<p>Les propri&#233;t&#233;s facultatives suivantes sont disponibles pour un domaine LDAP.</p><dl><dt><tt>search-filter</tt></dt>
<dd><p>Filtre de recherche &#224; utiliser pour trouver l'utilisateur. La valeur par d&#233;faut est <tt> uid=%s</tt> (<tt>%s</tt> s'&#233;tend au nom du sujet).</p></dd>
<dt><tt>group-base-dn</tt></dt>
<dd><p>DN de base pour l'emplacement des donn&#233;es de groupe. Par d&#233;faut, il est identique &#224; la valeur du DN de base, mais il peut &#234;tre affin&#233; si n&#233;cessaire.</p></dd>
<dt><tt>group-search-filter</tt></dt>
<dd><p>Filtre de recherche pour trouver les appartenances de l'utilisateur &#224; des groupes. La valeur par d&#233;faut est <tt>uniquemember=%d</tt> (<tt>%d</tt> s'&#233;tend au DN d'&#233;l&#233;ment de l'utilisateur).</p></dd>
<dt><tt>group-target</tt></dt>
<dd><p>Nom d'attribut LDAP contenant les entr&#233;es des noms de groupes. La valeur par d&#233;faut est <tt>CN</tt>.</p></dd>
<dt><tt>search-bind-dn</tt></dt>
<dd><p>DN facultatif utilis&#233; pour authentifier le r&#233;pertoire d'ex&#233;cution de la recherche <tt>search-filter</tt>. Requis uniquement pour les r&#233;pertoires ne permettant pas de recherche anonyme.</p></dd>
<dt><tt>search-bind-password</tt></dt>
<dd><p>Mot de passe LDAP pour le DN donn&#233; dans <tt>search-bind-dn</tt>.</p></dd>
</dl>

