<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-eelogging"></a><h4>Param&#232;tres du journal</h4>
<p>Utilisez la page Param&#232;tres du journal pour configurer la journalisation pour le
Enterprise Server.</p><p>La page Param&#232;tres du journal contient les options suivantes.</p><dl><dt>Ecrire dans le journal syst&#232;me</dt>
<dd><p>Si cette option est s&#233;lectionn&#233;e, le r&#233;sultat de journalisation est envoy&#233; &#224; l'utilitaire <tt> syslog</tt> en plus du journal du serveur. Cette fonction est disponible sur les syst&#232;mes Solaris et Linux uniquement. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p></dd>
<dt>Consigner sur la console</dt>
<dd><p>Si cette option est s&#233;lectionn&#233;e, NE SAIS PAS ce qui se passe. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p></dd>
<dt>Fichier journal</dt>
<dd><p>Un autre nom ou emplacement pour le fichier du journal du serveur. L'emplacement par d&#233;faut est <tt>glassfish/domains/domain1/logs/server.log</tt>.</p></dd>
<dt>Gestionnaire du journal</dt>
<dd><p>Nom de classe absolu d'un gestionnaire de journal personnalis&#233;. Un gestionnaire de journal personnalis&#233; vous permet d'envoyer des journaux vers une destination autre que <tt>server.log </tt> ou <tt>syslog</tt>. Celui-ci doit venir en extension de la classe <tt>java.util.logging.Handler</tt> (API compatible JSR 047). Ajoutez la classe du gestionnaire au classpath du Enterprise Server de fa&#231;on &#224; installer le gestionnaire lors du d&#233;marrage du serveur.</p></dd>
<dt>Limite de rotation du fichier</dt>
<dd><p>La taille en octets que le fichier du journal du serveur doit atteindre avant la rotation. Lorsque le journal du serveur atteint la taille indiqu&#233;e, le Enterprise Server cr&#233;e un nouveau fichier vide nomm&#233; <tt>server.log</tt> et renomme l'ancien fichier <tt>server.log_</tt><i>date</i>, o&#249; <i> date</i> indique la date et l'heure de rotation du fichier. La valeur par d&#233;faut est 2 m&#233;gaoctets. La valeur minimale est 500 ko. Si vous sp&#233;cifiez une valeur inf&#233;rieure, le fichier effectuera la rotation &#224; 500 ko. Pour d&#233;sactiver la rotation du fichier journal, sp&#233;cifiez la valeur 0.</p></dd>
<dt>Temps limite de rotation du fichier</dt>
<dd><p>Nombre de minutes au bout duquel la rotation du journal du serveur doit s'effectuer. La valeur par d&#233;faut est 0, ce qui signifie que le fichier effectuera la rotation lorsqu'il aura atteint la taille sp&#233;cifi&#233;e dans le champ Limite de rotation du fichier. Si vous sp&#233;cifiez une ou plusieurs minutes, le temps limite remplace la taille limite indiqu&#233;e par le champ Limite de rotation du fichier.</p></dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-eelogging.html">Configurer les param&#232;tres g&#233;n&#233;raux de journalisation</a></p></li>
<li><p><a href="task-eelogginglevels.html">Configurer les niveaux de journalisation</a></p></li>
<li><p><a href="task-logviewer.html">Afficher le journal du serveur</a></p></li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>

<ul><li><p><tt>set-log-level</tt></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/rotate-log-1?a=view"><tt>rotate-log</tt>(1)</a></p></li></ul>

