<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-serverinstjvmgeneral"></a><h4>Param&#232;tres g&#233;n&#233;raux JVM</h4>
<p>La machine virtuelle Java<sup>TM</sup> (JVM<sup>TM</sup>) permet d'ex&#233;cuter du code binaire Java sur
une machine physique. Vous pouvez r&#233;gler les param&#232;tres de JVM pour am&#233;liorer
les performances et emp&#234;cher des erreurs d'allocation de m&#233;moire de se produire.</p><p>La machine virtuelle Java est incluse dans le logiciel Java Platform Standard
Edition (plate-formeJavaSE), n&#233;cessaire &#224; l'ex&#233;cution de Enterprise Server. La saisie de param&#232;tres
JVM incorrects emp&#234;chant l'ex&#233;cution du serveur, vous devez &#234;tre prudent(e) lors de
la modification de ces param&#232;tres.</p>
<hr><p><b>Remarque - </b>Les termes &#171;&#160;Machine Java Virtual&#160;&#187; et &#171;&#160;JVM&#160;&#187; d&#233;signent une machine virtuelle pour
plate-forme Java.</p>
<hr>
<p>La page Param&#232;tres g&#233;n&#233;raux JVM contient les options suivantes&#160;:</p><dl><dt>Accueil Java</dt>
<dd><p>Nom du r&#233;pertoire d'installation du logiciel Java SE, n&#233;cessaire &#224; l'ex&#233;cution d'Enterprise Server. Pour v&#233;rifier que la version du logiciel Java SE sp&#233;cifi&#233; est prise en charge par cette version, consultez <a href="http://docs.sun.com/doc/820-7688"><i>Sun GlassFish Enterprise Server v3 Release Notes</i></a>. Si vous saisissez un nom de r&#233;pertoire inexistant ou le r&#233;pertoire d'une version non prise en charge du logiciel Java SE, Enterprise Server ne d&#233;marrera pas.</p></dd>
<dt>Options Javac</dt>
<dd><p>Options de ligne de commande pour le compilateur de langage de programmation Java. Enterprise Server ex&#233;cute le compilateur lorsque des composants Enterprise JavaBeans <sup>TM</sup> (EJB<sup>TM</sup>) sont d&#233;ploy&#233;s.</p></dd>
<dt>D&#233;bogage</dt>
<dd><p>Active le d&#233;bogage avec JPDA (Architecture de d&#233;bogueur de plate-forme Java).</p><p>L'architecture JPDA est utilis&#233;e par les d&#233;veloppeurs d'applications. Pour plus d'informations, consultez le <a href="http://docs.sun.com/doc/820-7695"><i>Sun GlassFish Enterprise Server v3 Preview Application Development Guide </i></a>.</p></dd>
<dt>Options de d&#233;bogage</dt>
<dd><p>Indique les options JPDA transmises &#224; la JVM quand le d&#233;bogage est activ&#233;.</p></dd>
<dt>Options de compilation RMI</dt>
<dd><p>Options de ligne de commande pour le compilateur <tt>rmic</tt>. Enterprise Server ex&#233;cute le compilateur <tt>rmic</tt> lorsque des composants EJB sont d&#233;ploy&#233;s.</p></dd>
<dt>Pr&#233;processeur du bytecode</dt>
<dd><p>Noms des classes de pr&#233;traitement du bytecode. S&#233;parez les noms de classe par des virgules. Chaque classe doit impl&#233;menter l'interface com.sun.appserv.BytecodePreprocessor . Les classes sont appel&#233;es par ordre d'&#233;num&#233;ration.</p></dd>
<dt>Autres propri&#233;t&#233;s</dt>
<dd><p>Autres propri&#233;t&#233;s de la JVM. Le Enterprise Server ne d&#233;finit aucune autre propri&#233;t&#233; pour la JVM.</p></dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-jvmsettings.html">Configurer les param&#232;tres g&#233;n&#233;raux du profileur JVM</a></p></li>
<li><p><a href="task-jvmpathsettings.html">Configurer les param&#232;tres du chemin d'acc&#232;s &#224; la JVM </a></p></li>
<li><p><a href="task-jvmoptions.html">Configurer les options JVM</a></p></li>
<li><p><a href="task-securitymanagerdisable.html">D&#233;sactiver le gestionnaire de s&#233;curit&#233;</a></p></li>
<li><p><a href="task-jvmprofilersettings.html">Configurer les param&#232;tres du profileur JVM </a></p></li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>
<p>aucune.</p>
