<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-managefilerealm"></a><h4>Utilisateurs de fichiers...</h4>
<p>G&#233;rez les utilisateurs du domaine <tt>fichier</tt> &#224; l'aide de la Console d?administration.
Les utilisateurs et les groupes du domaine <tt>file</tt> sont r&#233;pertori&#233;s dans le
fichier cl&#233;, dont l'emplacement est sp&#233;cifi&#233; par la propri&#233;t&#233; <tt>file</tt>.</p>
<hr><p><b>Remarque - </b>Vous pouvez &#233;galement utiliser ces &#233;tapes pour ajouter des utilisateurs &#224; un
domaine de fichier, y compris le domaine <tt>administrateur</tt>. Entrez simplement le nom
du domaine cible &#224; la place du domaine <tt>fichier</tt> r&#233;f&#233;renc&#233; dans cette
section.</p>
<hr>
<p>Un utilisateur du domaine <tt>fichier</tt> peut appartenir &#224; un  a <b>groupe Java</b>,
c'est-&#224;-dire une cat&#233;gorie d'utilisateurs class&#233;s par caract&#233;ristiques communes. Par exemple, les clients
d'une application d'e-commerce appartiendront au groupe <tt>CUSTOMER</tt>, tandis que les plus gros
clients appartiendront au groupe <tt>PREFERRED</tt>. La classification des utilisateurs dans des groupes
facilite le contr&#244;le de l'acc&#232;s d'un grand nombre d'utilisateurs.</p><p>Une fois le Enterprise Server install&#233;, le seul utilisateur est l'administrateur configur&#233;
lors de l'installation. Par d&#233;faut, cet utilisateur appartient au groupe <tt>asadmin</tt>, du
domaine <tt>administrateur</tt>, qui autorise la modification du Enterprise Server. Les utilisateurs rattach&#233;s
&#224; ce groupe ont des privil&#232;ges d'administrateur, c'est-&#224;-dire qu'ils ont acc&#232;s &#224;
l'outil <tt>asadmin</tt>  et &#224; la Console d?administration.</p><p>La page Utilisateurs de fichiers affiche une liste des utilisateurs pour le
domaine s&#233;lectionn&#233;. Pour chaque utilisateur, les informations suivantes sont fournies&#160;:</p><dl><dt>ID utilisateur</dt>
<dd><p>Nom d'utilisateur.</p></dd>
<dt>Liste des groupes</dt>
<dd><p>Groupes auxquels l'utilisateur appartient.</p></dd>
</dl>

