<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-security"></a><h4>S&#233;curit&#233;</h4>
<p>La page S&#233;curit&#233; vous permet de d&#233;finir des propri&#233;t&#233;s de s&#233;curit&#233; pour
le Enterprise Server.</p><p>La page S&#233;curit&#233; contient les options suivantes&#160;:</p><dl><dt>Gestionnaire de s&#233;curit&#233;</dt>
<dd><p>Si cette option est s&#233;lectionn&#233;e, le gestionnaire de s&#233;curit&#233; est activ&#233; pour le domaine. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p><p>Lorsque cette option est activ&#233;e, une option JVM, <tt>-Djava.security.manager</tt>, est alors ajout&#233;e aux param&#232;tres JVM de Enterprise Server. Voir <a href="task-jvmoptions.html">Configurer les options JVM</a>. Vous devez red&#233;marrer le serveur pour activer la modification. </p><p>V&#233;rifiez que vous avez bien accord&#233; les autorisations n&#233;cessaires pour toutes les applications. Vous pouvez d&#233;sactiver le gestionnaire de s&#233;curit&#233; pour am&#233;liorer les performances.</p></dd>
<dt>Journalisation d'audit</dt>
<dd><p>Si cette option est activ&#233;e, le serveur charge et ex&#233;cute tous les modules d'audit s&#233;lectionn&#233;s dans le param&#232;tre des modules d'audit. Si cette option est d&#233;sactiv&#233;e, le serveur n'acc&#232;dera pas aux modules d'audit. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p></dd>
<dt>Domaine par d&#233;faut</dt>
<dd><p>Domaine actif (par d&#233;faut) utilis&#233; par le serveur pour l'authentification. Les applications utilisent ce domaine sauf indication contraire de leur descripteur de d&#233;ploiement. Tous les domaines configur&#233;s apparaissent dans la liste. La valeur par d&#233;faut est <tt>file</tt>.</p></dd>
<dt>Principal par d&#233;faut</dt>
<dd><p>Sp&#233;cifie le nom d'utilisateur par d&#233;faut. Le serveur utilise ce nom d'utilisateur lorsque aucun autre principal n'est fourni. Si vous saisissez une valeur dans ce champ, saisissez le mot de passe correspondant dans le champ Mot de passe principal par d&#233;faut.</p><p>Aucune valeur principale par d&#233;faut n'est requise pour un fonctionnement normal du serveur.</p></dd>
<dt>Mot de passe principal par d&#233;faut</dt>
<dd><p>Mot de passe du principal par d&#233;faut sp&#233;cifi&#233; dans le champ Principal. Aucune valeur principale par d&#233;faut n'est requise pour un fonctionnement normal du serveur.</p></dd>
<dt>JACC</dt>
<dd><p>Nom de classe d'un fournisseur JACC configur&#233;. La valeur par d&#233;faut est <tt>default</tt>.</p></dd>
<dt>Audit Modules</dt>
<dd><p>Modules de fournisseur d'audit utilis&#233;s par le sous-syst&#232;me d'audit si la journalisation d'audit est activ&#233;e. Par d&#233;faut, le serveur utilise un module d'audit nomm&#233; <tt>default</tt>. Pour plus d'informations sur la cr&#233;ation de modules d'audit, consultez <a href="task-auditmodulenew.html">Cr&#233;er un module d'audit</a>.</p></dd>
<dt>Mappage principal-r&#244;le par d&#233;faut activ&#233;</dt>
<dd><p>Si cette option est s&#233;lectionn&#233;e, le mappage principal-r&#244;le par d&#233;faut est appliqu&#233; aux applications qui ne poss&#232;dent pas de mappage propre.</p></dd>
<dt>Classe de principal mapp&#233;e</dt>
<dd><p>Sp&#233;cifie une impl&#233;mentation personnalis&#233;e de la classe <tt>java.security.Principal </tt> utilis&#233;e dans le mappage principal-r&#244;le par d&#233;faut, si ce dernier est activ&#233;.</p></dd>
<dt>Autres propri&#233;t&#233;s</dt>
<dd><p>Autres propri&#233;t&#233;s de s&#233;curit&#233; du serveur.</p><p>Les propri&#233;t&#233;s valides d&#233;pendent du type de domaine s&#233;lectionn&#233; dans le champ Domaine par d&#233;faut et sont g&#233;n&#233;ralement sp&#233;cifi&#233;es lorsque vous modifiez un domaine. Pour plus de d&#233;tails, consultez les rubriques suivantes&#160;:</p>
<ul><li><p><a href="ref-editfile-adminrealm.html">Propri&#233;t&#233;s sp&#233;cifiques de la classe <tt>FileRealm</tt></a></p></li>
<li><p><a href="ref-editcertrealm.html">Propri&#233;t&#233;s sp&#233;cifiques de la classe <tt>CertificateRealm</tt></a></p></li>
<li><p><a href="ref-editjdbcrealm.html">Propri&#233;t&#233;s sp&#233;cifiques de la classe <tt>JDBCRealm</tt></a></p></li>
<li><p><a href="ref-ldaprealmprop.html">Propri&#233;t&#233;s sp&#233;cifiques &#224; la classe <tt>LDAPRealm </tt></a></p></li>
<li><p><a href="ref-solarisrealmprop.html">Propri&#233;t&#233;s sp&#233;cifiques &#224; la classe <tt>SolarisRealm </tt></a></p></li></ul>
</dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-securitysettings.html">Configurer les r&#233;glages de s&#233;curit&#233;</a></p></li>
<li><p><a href="task-auditmodulenew.html">Cr&#233;er un module d'audit</a></p></li>
<li><p><a href="task-changeadminpasswd.html">Pour modifier le mot de passe d'un utilisateur du domaine d'administration</a></p></li>
<li><p><a href="task-accessadmintools.html">Autoriser l'acc&#232;s aux outils d'administration</a></p></li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>
<p>aucune.</p>
