<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Page Service de contr&#244;le - Aide en ligne de la console d'administration de Sun GlassFish Enterprise Server v3 Prelude
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>

</head>

<body class="HlpBdy">

<a name="ref-monitoringpage"></a><h4>Page Service de contr&#244;le</h4>
<p>La page Service de contr&#244;le permet de configurer les options de contr&#244;le
pour les composants ou services des serveurs individuels.</p><dl><dt>JVM</dt>
<dd><p>Niveau de contr&#244;le JVM. Les niveaux disponibles sont BAS, HAUT et D&#201;SACTIV&#201;. Dans cette version, il n'existe aucune diff&#233;rence entre les options BAS et HAUT.</p></dd>
<dt>Service HTTP</dt>
<dd><p>Niveau de contr&#244;le du service HTTP. Les niveaux disponibles sont BAS, HAUT et D&#201;SACTIV&#201;. Dans cette version, il n'existe aucune diff&#233;rence entre les options BAS et HAUT.</p></dd>
<dt>Conteneur Web</dt>
<dd><p>Niveau de contr&#244;le du conteneur Web. Les niveaux disponibles sont BAS, HAUT et D&#201;SACTIV&#201;. Dans cette version, il n'existe aucune diff&#233;rence entre les options BAS et HAUT.</p></dd>
<dt>Pool de threads</dt>
<dd><p>Niveau de contr&#244;le des pools de threads. Les niveaux disponibles sont BAS, HAUT et D&#201;SACTIV&#201;. Dans cette version, il n'existe aucune diff&#233;rence entre les options BAS et HAUT.</p></dd>
</dl>
<h5>T&#226;ches connexes</h5>

<ul><li><p><a href="task-confmonitor.html">Configurer le service de contr&#244;le</a></p></li>
<li><p><a href="task-viewmonitor-jvm.html">Afficher les donn&#233;es de contr&#244;le JVM</a></p></li>
<li><p><a href="task-viewmonitor-httpsvc.html">Afficher les donn&#233;es de contr&#244;le du service HTTP</a></p></li>
<li><p><a href="task-viewmonitor-webcont.html">Afficher les donn&#233;es de contr&#244;le du conteneur Web</a></p></li>
<li><p><a href="task-viewmonitor-threadpool.html">Afficher les donn&#233;es de contr&#244;le du pool de threads</a></p></li></ul>
<h5>Commandes <tt>asadmin</tt> connexes</h5>
<p>aucune.</p>
<br/>

</body>
</html>
