<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-messagesecurityconfigedit"></a><h4>Pour modifier une configuration de s&#233;curit&#233; des messages</h4><p>Pour activer la s&#233;curit&#233; des messages au niveau des extr&#233;mit&#233;s des services
Web d&#233;ploy&#233;s sur le Enterprise Server, vous devez sp&#233;cifier un fournisseur &#224;
utiliser par d&#233;faut du c&#244;t&#233; du serveur. Si vous activez un fournisseur
de s&#233;curit&#233; des messages par d&#233;faut, vous devez &#233;galement activer les fournisseurs
&#224; utiliser par les clients des services Web d&#233;ploy&#233;s sur le Enterprise
Server. Pour savoir comment activer les fournisseurs utilis&#233;s par les clients, consultez
la rubrique <a href="task-enablemesec4appclients.html">Pour activer la s&#233;curit&#233; des messages pour les clients de l'application</a>.</p><p>Pour activer la s&#233;curit&#233; des messages pour les appels de service Web
provenant des points d'extr&#233;mit&#233; d&#233;ploy&#233;s, vous devez sp&#233;cifier un fournisseur client par
d&#233;faut. Si vous avez activ&#233; un fournisseur client par d&#233;faut pour le
Enterprise Server, vous devez vous assurer que les services appel&#233;s depuis les
points d'extr&#233;mit&#233; d&#233;ploy&#233;s sur le Enterprise Server soient configur&#233;s de mani&#232;re compatible
avec la s&#233;curit&#233; de la couche &#171; message &#187;.</p><ol>
<li><b>Dans l'arborescence de navigation, d&#233;veloppez le n&#339;ud Configuration.</b></li>
<li><b>D&#233;veloppez le n&#339;ud S&#233;curit&#233;.</b></li>
<li><b>S&#233;lectionnez le n&#339;ud S&#233;curit&#233; des messages.</b><p>La page Configurations de s&#233;curit&#233; des messages s'ouvre.</p></li>
<li><b>Sur la page Configurations de s&#233;curit&#233; des messages, cliquez sur le nom
Couche d'authentification de la configuration que vous modifiez.</b><p>Par d&#233;faut, la seule configuration de s&#233;curit&#233; des messages configur&#233;e est SOAP.</p><p>La page Modifier la configuration de s&#233;curit&#233; des messages s'ouvre.</p></li>
<li><b>Sur la page Modifier la configuration de s&#233;curit&#233; des messages, dans la
liste d&#233;roulante Fournisseur par d&#233;faut, s&#233;lectionnez un fournisseur c&#244;t&#233; serveur.</b><p>Le fournisseur de serveur par d&#233;faut, &#233;galement appel&#233; le fournisseur par d&#233;faut,
identifie le fournisseur de serveur appel&#233; si l'application n'identifie aucun fournisseur de
serveur sp&#233;cifique. Les choix disponibles sont <tt>ServerProvider</tt>, <tt>XWS_ServerProvider </tt>, ou aucun. Par d&#233;faut,
aucun fournisseur n'est s&#233;lectionn&#233;, pour que Enterprise Server n'appelle pas de fournisseur
de s&#233;curit&#233; des messages du c&#244;t&#233; serveur. La plupart du temps, s&#233;lectionnez
<tt> ServerProvider</tt> comme fournisseur par d&#233;faut.</p></li>
<li><b>Dans la liste d&#233;roulante Fournisseur client par d&#233;faut, s&#233;lectionnez un fournisseur client.</b><p>Le fournisseur client par d&#233;faut identifie le fournisseur client appel&#233; si l'application
n'identifie aucun fournisseur client sp&#233;cifique. Les choix disponibles sont <tt>ClientProvider</tt>, <tt> XWS_ClientProvider</tt>, ou
aucun. Par d&#233;faut, aucun fournisseur n'est s&#233;lectionn&#233;, pour que Enterprise Server n'appelle
pas de fournisseur de s&#233;curit&#233; des messages du c&#244;t&#233; client. La plupart
du temps, s&#233;lectionnez "aucun" comme fournisseur client par d&#233;faut. S&#233;lectionnez <tt>ClientProvider</tt> pour
appliquer un fournisseur et une strat&#233;gie par d&#233;faut de protection des messages
aux appels de services Web provenant des points d'extr&#233;mit&#233; des services Web
d&#233;ploy&#233;s sur Enterprise Server.</p></li>
<li><b>Cliquez sur Enregistrer.</b></li>
<li><b>Pour savoir comment modifier les strat&#233;gies de protection des messages des fournisseurs
client et fournisseurs de serveur activ&#233;s, reportez-vous &#224; la rubrique <a href="task-messagesecurityproviderconfigedit.html">Pour modifier la configuration d'un fournisseur de s&#233;curit&#233; des messages</a>.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-configmsgsecproviders.html">Configurer les utilitaires du Enterprise Server pour permettre l'utilisation par des fournisseurs de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityconfignew.html">Pour cr&#233;er une configuration de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityconfigdelete.html">Pour supprimer une configuration de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityproviderconfignew.html">Pour cr&#233;er la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigedit.html">Pour modifier la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigdelete.html">Pour supprimer la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-enablemesec4appclients.html">Pour activer la s&#233;curit&#233; des messages pour les clients de l'application</a></p></li></ul>

