<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jvmsettings"></a><h4>Configurer les param&#232;tres g&#233;n&#233;raux du profileur JVM</h4><p>La machine virtuelle Java<sup>TM</sup> (JVM) permet d'ex&#233;cuter du code binaire Java sur
une machine physique. Vous pouvez r&#233;gler les param&#232;tres de JVM pour am&#233;liorer
les performances et emp&#234;cher des erreurs d'allocation de m&#233;moire de se produire.</p><p>La machine virtuelle Java est incluse dans le logiciel Java Platform Standard
Edition (plate-formeJavaSE), n&#233;cessaire &#224; l'ex&#233;cution de Enterprise Server. La saisie de param&#232;tres
JVM incorrects emp&#234;chant l'ex&#233;cution du serveur, vous devez &#234;tre prudent(e) lors de
la modification de ces param&#232;tres.</p>
<hr><p><b>Remarque - </b>Les termes &#171;&#160;Machine Java Virtual&#160;&#187; et &#171;&#160;JVM&#160;&#187; d&#233;signent une machine virtuelle pour
plate-forme Java.</p>
<hr>
<ol>
<li><b>Dans l'arborescence de navigation, s&#233;lectionnez le noeud Configuration.</b></li>
<li><b>Sous le n&#339;ud Configuration, s&#233;lectionnez le n&#339;ud Param&#232;tres JVM.</b><p>La page Param&#232;tres JVM s'ouvre.</p></li>
<li><b>Sur la page Param&#232;tres g&#233;n&#233;raux JVM, dans le champ Accueil Java, saisissez
le nom du r&#233;pertoire d'installation du logiciel Java SE.</b><p>Enterprise Server fonctionne avec la plate-forme Java SE. Pour v&#233;rifier que la
version du logiciel Java SE sp&#233;cifi&#233; est prise en charge par cette
version, consultez <a href="http://docs.sun.com/doc/820-7688"><i>Sun GlassFish Enterprise Server v3 Preview Release Notes </i></a>. Si vous saisissez un nom de r&#233;pertoire inexistant ou
le r&#233;pertoire d'une version non prise en charge du logiciel Java SE,
Enterprise Server ne d&#233;marrera pas.</p></li>
<li><b>Dans le champ Options Javac, saisissez les options de ligne de commande
du compilateur du langage de programmation Java.</b><p>Enterprise Server ex&#233;cute le compilateur lorsque des composants Enterprise JavaBeans<sup>TM</sup> (EJB<sup>TM</sup>) sont d&#233;ploy&#233;s.</p></li>
<li><b>Cochez la case D&#233;bogage activ&#233; pour activer le d&#233;bogage avec JPDA (Java
Platform Debugger Architecture).</b><p>L'architecture JPDA est utilis&#233;e par les d&#233;veloppeurs d'applications. Pour plus d'informations, consultez
le <a href="http://docs.sun.com/doc/820-7695"><i>Sun GlassFish Enterprise Server v3 Preview Application Development Guide </i></a>.</p></li>
<li><b>Dans le champ Options de d&#233;bogage, saisissez les options JPDA &#224; transmettre
&#224; la JVM.</b><p>Ce champ ne s'applique que si le d&#233;bogage a &#233;t&#233; activ&#233; &#224;
l'&#233;tape pr&#233;c&#233;dente.</p></li>
<li><b>Dans le champ Options de compilation RMI, saisissez les options de ligne
de commande du compilateur <tt>rmic</tt>.</b><p>Enterprise Server ex&#233;cute le compilateur <tt>rmic</tt> lorsque des composants EJB sont d&#233;ploy&#233;s.</p></li>
<li><b>Dans le champ Pr&#233;processeur du bytecode, saisissez la liste des noms de
classe.</b><p>S&#233;parez les noms de classe par des virgules. Chaque classe doit impl&#233;menter
l'interface com.sun.appserv.BytecodePreprocessor . Les classes sont appel&#233;es par ordre d'&#233;num&#233;ration.</p></li>
<li>(Facultatif) <b>Dans la section Autres propri&#233;t&#233;s, sp&#233;cifiez d'autres propri&#233;t&#233;s.</b><p>Pour ajouter une propri&#233;t&#233;, cliquez sur le bouton Ajouter propri&#233;t&#233;. Sur la
ligne vide qui appara&#238;t, saisissez le nom de la propri&#233;t&#233; dans le
champ Nom et la valeur de la propri&#233;t&#233; dans le champ Valeur.</p><p>Le Enterprise Server ne d&#233;finit aucune autre propri&#233;t&#233; pour la JVM.</p></li>
<li><b>Cliquez sur Enregistrer.</b></li>
<li><b>Red&#233;marrez le serveur.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-jvmpathsettings.html">Configurer les param&#232;tres du chemin d'acc&#232;s &#224; la JVM </a></p></li>
<li><p><a href="task-jvmoptions.html">Configurer les options JVM</a></p></li>
<li><p><a href="task-securitymanagerdisable.html">D&#233;sactiver le gestionnaire de s&#233;curit&#233;</a></p></li>
<li><p><a href="task-jvmprofilersettings.html">Configurer les param&#232;tres du profileur JVM </a></p></li></ul>

