<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-uc-update"></a><h4>Pour installer des mises &#224; jour de composants</h4><p>La mise &#224; jour d'un <a href="ref-uc-concepts.html#ref-uc-about-component">composant</a> install&#233; comprend les op&#233;rations suivantes :</p>
<ul><li><p>Transf&#233;rer uniquement les fichiers modifi&#233;s depuis un <a href="ref-uc-concepts.html#ref-uc-about-repository">r&#233;f&#233;rentiel de r&#233;seau</a> vers votre syst&#232;me</p></li>
<li><p>Mettre &#224; jour uniquement les fichiers modifi&#233;s dans l'Enterprise Server <a href="ref-uc-concepts.html#ref-uc-about-repository">image d'installation</a> dans votre syst&#232;me</p></li>
<li><p>Appliquer de nouvelles d&#233;pendances (si n&#233;cessaire) entre les composants mis &#224; jour</p></li></ul>
<ol>
<li><b>Dans l'arborescence de navigation, s&#233;lectionnez le n&#339;ud Outil de mise &#224; jour.</b><p>La page Add-ons disponibles s'affiche.</p></li>
<li><b>Dans la page Add-ons disponibles, cliquez sur l'onglet Mises &#224; jour disponibles.</b><p>La page Mises &#224; jour disponibles s'affiche.</p></li>
<li><b>Dans le tableau des mises &#224; jour disponibles, s&#233;lectionnez les composants &#224;
mettre &#224; jour.</b><p>Il n'y a aucune diff&#233;rence de version ni de taille entre la
Version install&#233;e et la Nouvelle version d'un composant, inutile donc de mettre
le composant &#224; jour. Si aucune mise &#224; jour n'est disponible, le
tableau est vide.</p><ul>
<li><b>Pour s&#233;lectionner un composant, cochez la case situ&#233;e en regard de son
nom.</b></li>
<li><b>Pour s&#233;lectionner tous les composants, cliquez sur l'ic&#244;ne S&#233;lectionner tout dans l'en-t&#234;te
du tableau.</b></li>
<li><b>Pour d&#233;s&#233;lectionner tous les composants, cliquez sur l'ic&#244;ne D&#233;s&#233;lectionner tout dans l'en-t&#234;te
du tableau.</b></li></ul></li>
<li><b>Cliquez sur Installer.</b></li>
<li><b>Acceptez le contrat de licence.</b><p>Enterprise Server confirme que l'installation est termin&#233;e.</p></li>
<li><b>Red&#233;marrez le serveur.</b><p>Pour consulter des instructions d&#233;taill&#233;es, reportez-vous &#224; la documentation ci-dessous:</p>
<ul><li><p><a href="http://docs.sun.com/doc/820-7692/ggoch?a=view">To Stop a Domain du <i>Sun GlassFish Enterprise Server v3 Administration Guide</i></a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7692/ggoda?a=view">To Start a Domain du <i>Sun GlassFish Enterprise Server v3 Administration Guide</i></a></p></li></ul>
</li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-uc-set-proxy.html">Configurer les param&#232;tres proxy de r&#233;seau pour acc&#233;der aux r&#233;f&#233;rentiels de r&#233;seau</a></p></li>
<li><p><a href="task-uc-addon.html">Installer des composants add-ons</a></p></li>
<li><p><a href="task-uc-installed-remove.html">D&#233;sinstaller des composants</a></p></li>
<li><p><a href="task-uc-pkgdetails.html">Afficher les informations d&#233;taill&#233;es d'un composant</a></p></li></ul>

