<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-auditmoduleedit"></a><h4>Pour modifier un module d'audit</h4><p>Les modules d'audit ne sont pas activ&#233;s par d&#233;faut. Pour plus d'informations
sur l'activation des modules d'audit, consultez <a href="task-enabledisableauditmod.html">Activer ou d&#233;sactiver la journalisation d'audit</a>.</p><ol>
<li><b>Dans l'arborescence de navigation, d&#233;veloppez le n&#339;ud Configuration.</b></li>
<li><b>Sous le n&#339;ud Configuration, d&#233;veloppez le n&#339;ud S&#233;curit&#233;.</b></li>
<li><b>Sous le n&#339;ud Securit&#233;, s&#233;lectionnez le n&#339;ud Modules d'audit.</b><p>La page Modules d'audit s'affiche.</p></li>
<li><b>Sur la page Modules d'audit, cliquez sur le nom du module d'audit
que vous modifiez.</b><p>La page Modification du module d'audit s'ouvre.</p></li>
<li><b>Sur la page Modification du module d'audit, saisissez une nouvelle valeur dans
le champ Nom de classe pour modifier le nom de classe.</b></li>
<li>(Facultatif) <b>Dans la section Autres propri&#233;t&#233;s, sp&#233;cifiez d'autres propri&#233;t&#233;s.</b><p>Pour obtenir une description de la propri&#233;t&#233; suppl&#233;mentaire disponible pour les modules
d'audit, consultez <a href="ref-auditmoduleprop.html">Propri&#233;t&#233;s propres aux modules d'audit</a>.</p><ul>
<li><b>Pour ajouter une propri&#233;t&#233;, cliquez sur le bouton Ajouter propri&#233;t&#233;. Sur la
ligne vide qui appara&#238;t, saisissez le nom de la propri&#233;t&#233; dans le
champ Nom et la valeur de la propri&#233;t&#233; dans le champ Valeur.</b></li>
<li><b>Pour modifier une propri&#233;t&#233;, modifiez le champ Valeur de cette propri&#233;t&#233;.</b></li>
<li><b>Pour supprimer une propri&#233;t&#233;, cochez la case situ&#233;e &#224; gauche du champ
Nom de la propri&#233;t&#233; que vous supprimez,  puis cliquez sur le
bouton Supprimer propri&#233;t&#233;s.</b></li></ul></li>
<li><b>Cliquez sur Enregistrer.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-auditmodulenew.html">Cr&#233;er un module d'audit</a></p></li>
<li><p><a href="task-auditmoduledelete.html">Supprimer un module d'audit</a></p></li>
<li><p><a href="task-enabledisableauditmod.html">Activer ou d&#233;sactiver la journalisation d'audit</a></p></li>
<li><p><a href="task-setactiveauditmod.html">D&#233;finir le module d'audit actif</a></p></li>
<li><p><a href="task-usedefaultauditmod.html">Utiliser le module d'audit par d&#233;faut</a></p></li></ul>

