<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-messagesecurityproviderconfigedit"></a><h4>Pour modifier la configuration d'un fournisseur de s&#233;curit&#233; des messages</h4><p>En g&#233;n&#233;ral, pour modifier les strat&#233;gies de protection des messages d'un fournisseur,
vous devez le re-configurer, m&#234;me si le type de fournisseur, la classe
d'impl&#233;mentation et les propri&#233;t&#233;s de configuration sp&#233;cifiques au fournisseur peuvent &#233;galement &#234;tre
modifi&#233;s.</p><ol>
<li><b>Dans l'arborescence de navigation, d&#233;veloppez le n&#339;ud Configuration.</b></li>
<li><b>D&#233;veloppez le n&#339;ud S&#233;curit&#233;.</b></li>
<li><b>S&#233;lectionnez le n&#339;ud S&#233;curit&#233; des messages.</b><p>La page Configurations de s&#233;curit&#233; des messages s'ouvre.</p></li>
<li><b>Sur la page Configurations de s&#233;curit&#233; des messages, cliquez sur le nom
Couche d'authentification de la configuration que vous modifiez.</b><p>Par d&#233;faut, la seule configuration de s&#233;curit&#233; des messages configur&#233;e est SOAP.</p><p>La page Modifier la configuration de s&#233;curit&#233; des messages s'ouvre.</p></li>
<li><b>Cliquez sur l'onglet Fournisseurs.</b><p>La page Configurations de fournisseurs s'ouvre.</p><p>Par d&#233;faut, quatre fournisseurs sont configur&#233;s pour le niveau d'authentification SOAP.</p></li>
<li><b>Sur la page Configurations de fournisseurs, cliquez sur l'ID fournisseur de la
configuration du fournisseur que vous voulez modifier.</b><p>La page Modification de la configuration du fournisseur s'affiche.</p></li>
<li><b>Sur la page Modification de la configuration du fournisseur, cochez la case
Fournisseur par d&#233;faut pour faire de ce fournisseur le fournisseur par d&#233;faut.</b><p>Le fournisseur par d&#233;faut est appel&#233; lorsque l'application n'identifie aucun fournisseur sp&#233;cifique.
Le Type de fournisseur d&#233;termine si le fournisseur est le fournisseur client
par d&#233;faut, le fournisseur de serveur par d&#233;faut, ou les deux.</p></li>
<li><b>Dans la liste d&#233;roulante Type de fournisseur, s&#233;lectionnez le type de fournisseur.</b><p>Les choix disponibles sont les suivants :</p><dl><dt><tt>client</tt></dt>
<dd><p>Sp&#233;cifie que le fournisseur est le fournisseur d'authentification du client.</p></dd>
<dt><tt>serveur</tt></dt>
<dd><p>Sp&#233;cifie que le fournisseur est le fournisseur d'authentification du serveur.</p></dd>
<dt><tt>client-serveur</tt></dt>
<dd><p>Sp&#233;cifie que le fournisseur est &#224; la fois le fournisseur d'authentification du client et du serveur.</p></dd>
</dl>
</li>
<li><b>Dans le champ Nom de la classe, saisissez le nom de la
classe d'impl&#233;mentation Java du fournisseur.</b><p>Les fournisseurs d'authentification client doivent impl&#233;menter l'interface <tt>com.sun.enterprise.security.jauth.ClientAuthModule</tt> . Les fournisseurs c&#244;t&#233;
serveur doivent impl&#233;menter l'interface <tt>com.sun.enterprise.security.jauth.ServerAuthModule</tt> . Les fournisseurs c&#244;t&#233; client doivent impl&#233;menter
les deux interfaces.</p></li>
<li><b>Dans la zone Strat&#233;gie de requ&#234;te, dans la liste d&#233;roulante Authentifier la
source, s&#233;lectionnez le type d'authentification requise pour la strat&#233;gie de requ&#234;te.</b><p>La strat&#233;gie de requ&#234;te d&#233;termine le traitement des requ&#234;tes par le fournisseur
d'authentification. Les champs de strat&#233;gie de requ&#234;te sont facultatifs, mais s'ils ne
sont pas sp&#233;cifi&#233;s, le fournisseur d'authentification n'authentifie pas les messages de requ&#234;te.</p><p>S&#233;lectionnez <tt>exp&#233;diteur</tt> pour sp&#233;cifier au niveau de la couche message l'authentification de
l'exp&#233;diteur (par exemple, nom d'utilisateur et mot de passe) des messages de
requ&#234;te. S&#233;lectionnez <tt>content</tt> pour sp&#233;cifier l'authentification du contenu (par exemple, signature num&#233;rique)
des messages de requ&#234;te. Laissez le champ vierge pour ne pas authentifier
la source des requ&#234;tes. Par d&#233;faut, aucun type d'authentification n'est s&#233;lectionn&#233;.</p><p>Pour une description des actions r&#233;alis&#233;es par les fournisseurs de s&#233;curit&#233; des
messages SOAP, reportez-vous &#224; la rubrique <a href="ref-configreq-respolicy.html">Configurer les modalit&#233;s de requ&#234;te et de r&#233;ponse</a>.</p></li>
<li><b>Dans la liste d&#233;roulante Authentifier le destinataire, d&#233;terminez si l'authentification du destinataire
doit avoir lieu avant ou apr&#232;s l'authentification du contenu pour la strat&#233;gie
de requ&#234;te.</b><p>S&#233;lectionnez <tt>avant contenu</tt> ou <tt>apr&#232;s contenu</tt> pour demander au niveau de la couche message
l'authentification du destinataire du message de requ&#234;te &#224; son exp&#233;diteur (par cryptage
XML). Si la valeur n'est pas indiqu&#233;e, la valeur par d&#233;faut est
<tt>after-content</tt>. Les strat&#233;gies sont exprim&#233;es dans l'ordre de l'exp&#233;diteur du message, donc
<tt>apr&#232;s contenu</tt> signifie que le destinataire du message d&#233;crypte le message avant de
valider la signature.</p></li>
<li><b>Dans la zone Strat&#233;gie de r&#233;ponse, dans la liste d&#233;roulante Authentifier la
source, s&#233;lectionnez le type d'authentification requise pour la strat&#233;gie de r&#233;ponse.</b><p>La strat&#233;gie de r&#233;ponse d&#233;termine le traitement des r&#233;ponses par le fournisseur
d'authentification. Les champs de strat&#233;gie de r&#233;ponse sont facultatifs, mais s'ils ne
sont pas renseign&#233;s, aucune authentification n'est appliqu&#233;e aux messages de r&#233;ponse.</p><p>S&#233;lectionnez <tt>exp&#233;diteur</tt> pour sp&#233;cifier au niveau de la couche message l'authentification de
l'exp&#233;diteur (par exemple, nom d'utilisateur et mot de passe) des messages de
r&#233;ponse. S&#233;lectionnez <tt>contenu</tt> pour sp&#233;cifier l'authentification du contenu (par exemple, signature num&#233;rique)
des messages de r&#233;ponse. Laissez le champ vide pour ne pas authentifier
les sources de r&#233;ponse. Par d&#233;faut, aucun type d'authentification n'est s&#233;lectionn&#233;.</p><p>Pour une description des actions r&#233;alis&#233;es par les fournisseurs de s&#233;curit&#233; des
messages SOAP, reportez-vous &#224; la rubrique <a href="ref-configreq-respolicy.html">Configurer les modalit&#233;s de requ&#234;te et de r&#233;ponse</a>.</p></li>
<li><b>Dans la liste d&#233;roulante Authentifier le destinataire, d&#233;terminez si l'authentification du destinataire
doit avoir lieu avant ou apr&#232;s l'authentification du contenu pour la strat&#233;gie
de r&#233;ponse.</b><p>S&#233;lectionnez <tt>avant contenu</tt> ou <tt>apr&#232;s contenu</tt> pour d&#233;finir une demande au niveau de la
couche message d'authentification du destinataire du message de r&#233;ponse &#224; son exp&#233;diteur
(par cryptage XML). Si la valeur n'est pas indiqu&#233;e, la valeur par
d&#233;faut est <tt>apr&#232;s contenu</tt>. Les strat&#233;gies sont exprim&#233;es dans l'ordre de l'exp&#233;diteur du
message, donc <tt>apr&#232;s contenu</tt> signifie que le destinataire du message d&#233;crypte le message
avant de valider la signature.</p></li>
<li><b>Dans la section Autres propri&#233;t&#233;s, sp&#233;cifiez d'autres propri&#233;t&#233;s.</b><p>Pour obtenir une description des autres propri&#233;t&#233;s disponibles pour les configurations de
fournisseurs, consultez <a href="ref-messagesecurityproviderconfigprops.html">Propri&#233;t&#233;s propres aux configurations de fournisseur de s&#233;curit&#233; des messages</a>.</p><ul>
<li><b>Pour ajouter une propri&#233;t&#233;, cliquez sur le bouton Ajouter propri&#233;t&#233;. Sur la
ligne vide qui appara&#238;t, saisissez le nom de la propri&#233;t&#233; dans le
champ Nom et la valeur de la propri&#233;t&#233; dans le champ Valeur.</b></li>
<li><b>Pour modifier une propri&#233;t&#233;, modifiez le champ Valeur de cette propri&#233;t&#233;.</b></li>
<li><b>Pour supprimer une propri&#233;t&#233;, cochez la case situ&#233;e &#224; gauche du champ
Nom de la propri&#233;t&#233; que vous supprimez,  puis cliquez sur le
bouton Supprimer propri&#233;t&#233;s.</b></li></ul></li>
<li><b>Cliquez sur Enregistrer.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-configmsgsecproviders.html">Configurer les utilitaires du Enterprise Server pour permettre l'utilisation par des fournisseurs de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityconfignew.html">Pour cr&#233;er une configuration de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityconfigedit.html">Pour modifier une configuration de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityconfigdelete.html">Pour supprimer une configuration de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityproviderconfignew.html">Pour cr&#233;er la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigdelete.html">Pour supprimer la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-enablemesec4appclients.html">Pour activer la s&#233;curit&#233; des messages pour les clients de l'application</a></p></li></ul>

