<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-messagesecurityproviderconfigdelete"></a><h4>Pour supprimer la configuration d'un fournisseur de s&#233;curit&#233; des messages</h4><ol>
<li><b>Dans l'arborescence de navigation, d&#233;veloppez le n&#339;ud Configuration.</b></li>
<li><b>D&#233;veloppez le n&#339;ud S&#233;curit&#233;.</b></li>
<li><b>S&#233;lectionnez le n&#339;ud S&#233;curit&#233; des messages.</b><p>La page Configurations de s&#233;curit&#233; des messages s'ouvre.</p></li>
<li><b>Sur la page Configurations de s&#233;curit&#233; des messages, s&#233;lectionnez SOAP.</b><p>La page Modifier la configuration de s&#233;curit&#233; des messages s'ouvre.</p></li>
<li><b>Sur la page Modifier la configuration de s&#233;curit&#233; des messages, cliquez sur
l'onglet Fournisseurs.</b><p>La page Modifier la configuration du fournisseur s'ouvre.</p></li>
<li><b>Sur la page Modifier la configuration du fournisseur, cochez la case situ&#233;e
sur la gauche de la configuration du fournisseur &#224; supprimer.</b></li>
<li><b>Cliquez sur Delete.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-configmsgsecproviders.html">Configurer les utilitaires du Enterprise Server pour permettre l'utilisation par des fournisseurs de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityconfignew.html">Pour cr&#233;er une configuration de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityconfigedit.html">Pour modifier une configuration de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityconfigdelete.html">Pour supprimer une configuration de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityproviderconfignew.html">Pour cr&#233;er la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigedit.html">Pour modifier la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-enablemesec4appclients.html">Pour activer la s&#233;curit&#233; des messages pour les clients de l'application</a></p></li></ul>

