<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-enablemesec4appclients"></a><h4>Pour activer la s&#233;curit&#233; des messages pour les clients de l'application</h4><p>Les fournisseurs client doivent avoir les m&#234;mes strat&#233;gies de protection des messages
que les fournisseurs c&#244;t&#233; serveur avec lesquels ils interagissent. C'est d&#233;j&#224; le
cas des fournisseurs configur&#233;s (mais non activ&#233;s) lors de l'installation du Enterprise
Server.</p><p>Pour activer la s&#233;curit&#233; des messages pour les applications client, modifiez la
configuration sp&#233;cifique du Enterprise Server pour le conteneur client de l'application.</p><ol>
<li><b>Arr&#234;tez les applications client qui d&#233;pendent du descripteur du conteneur client.</b></li>
<li><b>Dans un &#233;diteur de texte, ouvrez le descripteur du conteneur client de
l'application Sun, qui se trouve dans <i>domain-dir</i><tt>/config/sun-acc.xml.</tt></b></li>
<li><b>Pour activer le fournisseur client par d&#233;faut dans le client de l'application,
ajoutez l'attribut <tt>default-client-provider</tt> &#224; l'&#233;l&#233;ment <tt>message-security-config</tt>. </b><p>Le code environnant existe pour le contexte et peut &#234;tre l&#233;g&#232;rement diff&#233;rent
dans votre installation. Ne le changez pas.</p><pre>&#60;client-container>
  &#60;target-server name="<i>your-host</i>" address="<i>your-host</i>"
      port="<i>your-port</i>"/>
  &#60;log-service file="" level="WARNING"/>
  &#60;message-security-config auth-layer="SOAP"
      <b>default-client-provider="ClientProvider"</b>>
    &#60;provider-config
        class-name="com.sun.enterprise.security.jauth.ClientAuthModule"
        provider-id="ClientProvider" provider-type="client">
      &#60;request-policy auth-source="sender"/>
      &#60;response-policy/>
        &#60;property name="security.config"
          value="C:/Sun/AppServer/lib/appclient/wss-client-config.xml"/>
    &#60;/provider-config>
  &#60;/message-security-config>
&#60;/client-container></pre><p>Le fournisseur de s&#233;curit&#233; des messages configur&#233; dans le conteneur client doit
avoir acc&#232;s aux cl&#233;s priv&#233;es et aux certificats de confiance. Pour permettre
l'acc&#232;s, d&#233;finissez les valeurs des propri&#233;t&#233;s syst&#232;mes suivantes dans le script de
d&#233;marrage du client de l'application :</p><pre>-Djavax.net.ssl.keyStore</pre><pre>-Djavax.net.ssl.trustStore</pre></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-configmsgsecproviders.html">Configurer les utilitaires du Enterprise Server pour permettre l'utilisation par des fournisseurs de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityconfignew.html">Pour cr&#233;er une configuration de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityconfigedit.html">Pour modifier une configuration de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityconfigdelete.html">Pour supprimer une configuration de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityproviderconfignew.html">Pour cr&#233;er la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigedit.html">Pour modifier la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigdelete.html">Pour supprimer la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p></li></ul>

