<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-setadvancedomainattributes"></a><h4>D&#233;finir les attributs avanc&#233;s du domaine</h4><ol>
<li><b>Dans l'arborescence de navigation, s&#233;lectionnez le n&#339;ud Application Server.</b><p>La page Informations g&#233;n&#233;rales s'affiche.</p></li>
<li><b>Dans la page Informations g&#233;n&#233;rales, cliquez sur l'onglet Avanc&#233;.</b><p>La page Configuration des applications s'ouvre.</p></li>
<li><b>Dans la page Configuration des applications, cliquez sur l'onglet Attributs de domaine.</b><p>La page Attributs de domaine s'ouvre.</p></li>
<li><b>Dans le champ Racine application, saisissez le chemin complet du r&#233;pertoire dans
lequel les applications d&#233;ploy&#233;es r&#233;sident.</b><p>La valeur par d&#233;faut est <tt></tt><i>domain-dir</i><tt>/applications</tt>.</p></li>
<li><b>Dans le champ Racine journal, saisissez le chemin complet du r&#233;pertoire dans
lequel les fichiers journaux du serveur sont conserv&#233;s.</b><p>La valeur par d&#233;faut est <tt></tt><i>domain-dir</i><tt>/logs</tt>.</p></li>
<li><b>Pour utiliser les param&#232;tres locaux de l'h&#244;te, ne renseignez pas le champ
Param&#232;tres locaux.</b><p>Un environnement linguistique est un identifiant qui sp&#233;cifie une combinaison particuli&#232;re de
langues et de r&#233;gions. Par exemple, l'environnement linguistique pour l'anglais des &#201;tats-Unis
est <tt>en_US</tt> et pour le japonais, <tt>ja_JP</tt>. Pour utiliser un environnement linguistique
non anglophone, Enterprise Server doit &#234;tre localis&#233;, c'est-&#224;-dire adapt&#233; de l'anglais en
une autre langue.</p></li>
<li><b>Cliquez sur Enregistrer.</b></li>
<li><b>Red&#233;marrez le serveur.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-generaltab.html">Pour afficher des Informations g&#233;n&#233;rales sur le Enterprise Server</a></p></li>
<li><p><a href="task-logviewer.html">Afficher le journal du serveur</a></p></li>
<li><p><a href="task-setadvanceappconfig.html">Pour d&#233;finir la configuration avanc&#233;e des applications</a></p></li>
<li><p><a href="task-setadminpassword.html">Pour changer le mot de passe administrateur</a></p></li>
<li><p><a href="task-systemproperties.html">Pour g&#233;rer les propri&#233;t&#233;s syst&#232;me</a></p></li>
<li><p><a href="task-appmonitoringdata.html">Pour afficher les donn&#233;es de contr&#244;le des applications</a></p></li>
<li><p><a href="task-servermonitoringdata.html">Pour afficher les donn&#233;es de contr&#244;le des serveurs</a></p></li></ul>

