<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-uc-installed-remove"></a><h4>D&#233;sinstaller des composants</h4><p>La d&#233;sinstallation d'un <a href="ref-uc-concepts.html#ref-uc-about-component"> composant</a> implique la suppression des &#233;l&#233;ments suivants :</p>
<ul><li><p>Tous les fichiers et r&#233;pertoires qui figuraient dans l'installation initiale du composant</p></li>
<li><p>Tous les fichiers et r&#233;pertoires charg&#233;s par les mises &#224; jour du composant apr&#232;s l'installation initiale</p></li></ul>
<ol>
<li><b>Dans l'arborescence de navigation, s&#233;lectionnez le n&#339;ud Outil de mise &#224; jour.</b><p>La page Add-ons disponibles s'affiche.</p></li>
<li><b>Sur la page Add-ons disponibles, cliquez sur l'onglet Composants install&#233;s.</b><p>La page Composants install&#233;s s'ouvre.</p></li>
<li><b>Dans le tableau des composants install&#233;s, s&#233;lectionnez les composants &#224; d&#233;sinstaller.</b><ul>
<li><b>Pour s&#233;lectionner un composant, cochez la case situ&#233;e en regard de son
nom.</b></li>
<li><b>Pour s&#233;lectionner tous les composants, cliquez sur l'ic&#244;ne S&#233;lectionner tout dans l'en-t&#234;te
du tableau.</b></li>
<li><b>Pour d&#233;s&#233;lectionner tous les composants, cliquez sur l'ic&#244;ne D&#233;s&#233;lectionner tout dans l'en-t&#234;te
du tableau.</b></li></ul></li>
<li><b>Cliquez sur Supprimer.</b><p>Une bo&#238;te de dialogue vous demande de confirmer que les composants s&#233;lectionn&#233;s
doivent &#234;tre d&#233;sinstall&#233;s.</p></li>
<li><b>Dans la bo&#238;te de dialogue, cliquez sur OK.</b><p>Enterprise Server confirme que la d&#233;sinstallation est termin&#233;e. Les composants sont supprim&#233;s
du tableau des composants install&#233;s et ajout&#233;s au tableau des add-ons disponibles
dans la page Available Add-Ons.</p></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-uc-set-proxy.html">Configurer les param&#232;tres proxy de r&#233;seau pour acc&#233;der aux r&#233;f&#233;rentiels de r&#233;seau</a></p></li>
<li><p><a href="task-uc-update.html">Pour installer des mises &#224; jour de composants</a></p></li>
<li><p><a href="task-uc-addon.html">Installer des composants add-ons</a></p></li>
<li><p><a href="task-uc-pkgdetails.html">Afficher les informations d&#233;taill&#233;es d'un composant</a></p></li></ul>

