<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-setadvanceappconfig"></a><h4>Pour d&#233;finir la configuration avanc&#233;e des applications</h4><a name="indexterm-8"></a><a name="indexterm-9"></a><a name="indexterm-10"></a><a name="indexterm-11"></a><p>Sur la page Configuration des applications, vous pouvez d&#233;finir les propri&#233;t&#233;s de
configuration des applications qui permettent de s'assurer que les modifications apport&#233;es aux
applications d&#233;ploy&#233;es sont d&#233;tect&#233;es et que les classes modifi&#233;es sont recharg&#233;es.</p><ol>
<li><b>Dans l'arborescence de navigation, s&#233;lectionnez le n&#339;ud Enterprise Server.</b><p>La page Informations g&#233;n&#233;rales s'affiche.</p></li>
<li><b>Dans la page Informations g&#233;n&#233;rales, cliquez sur l'onglet Avanc&#233;.</b><p>La page Configuration des applications s'ouvre.</p></li>
<li><b>Cochez la case Rechargement activ&#233; pour autoriser le rechargement dynamique des applications.</b><p>Lorsque le rechargement dynamique est activ&#233;, il n'est pas n&#233;cessaire de red&#233;ployer
une application ou un module lorsque vous changez son code ou ses
descripteurs de d&#233;ploiement. Il suffit de copier les fichiers  JSP<sup>TM</sup> (JavaServer Pages<sup>TM</sup>)
ou de classe modifi&#233;s dans le r&#233;pertoire de d&#233;ploiement pour l'application ou
le module. Le serveur recherche r&#233;guli&#232;rement la pr&#233;sence de modifications dans le
r&#233;pertoire de d&#233;ploiement et red&#233;ploie l'application, automatiquement et dynamiquement, avec ces modifications.
Cette fonction est utile dans un environnement de d&#233;veloppement, car elle permet
de tester rapidement les modifications du code. Cependant, dans un environnement de
production, le rechargement dynamique peut diminuer les performances. De plus, &#224; chaque
rechargement, les sessions ouvertes durant cette p&#233;riode de transition ne sont pas
valides. Le client doit red&#233;marrer la session.</p><p>Cette option est activ&#233;e par d&#233;faut.</p></li>
<li><b>Dans le champ Intervalle d'interrogation de rechargement, saisissez la dur&#233;e, en secondes,
de l'intervalle selon lequel les modifications du code doivent &#234;tre v&#233;rifi&#233;es dans
les applications et les modules et selon lequel ces derniers doivent &#234;tre
recharg&#233;s dynamiquement. </b><p>La valeur par d&#233;faut est 2.</p></li>
<li><b>Dans le champ D&#233;lai d'expiration de session d'administration, saisissez le nombre de
minutes d'inactivit&#233; apr&#232;s lesquelles la session de la Console d?administration doit expirer.</b><p>La valeur par d&#233;faut est 60.</p></li>
<li><b>Cochez la case D&#233;ploiement automatique activ&#233; pour activer le d&#233;ploiement automatique.</b><p>Si vous copiez un fichier d'application ou de module (JAR, WAR, RAR
ou EAR) dans un r&#233;pertoire particulier, puis activez le d&#233;ploiement automatiquement, l'application
ou le module sera automatiquement d&#233;ploy&#233; par le Enterprise Server. Cette option
est activ&#233;e par d&#233;faut.</p></li>
<li><b>Dans le champ Intervalle d'interrogation de d&#233;ploiement automatique, saisissez la dur&#233;e, en
secondes, de l'intervalle selon lequel les modifications du code doivent &#234;tre v&#233;rifi&#233;es
dans les applications et les modules et selon lequel ces derniers doivent
&#234;tre recharg&#233;s dynamiquement. </b><p>La valeur par d&#233;faut est 2. La modification de l'intervalle d'interrogation n'affecte
pas le temps de d&#233;ploiement d'une application ou d'un module.</p></li>
<li><b>Dans le champ D&#233;lai d'expiration de la tentative de d&#233;ploiement automatique, saisissez
le nombre de secondes durant lesquelles la taille d'un fichier partiellement copi&#233;
peut demeurer inchang&#233;e avant qu'une erreur ne se produise.</b><p>La valeur par d&#233;faut est 4.</p></li>
<li><b>Dans le champ R&#233;pertoire de d&#233;ploiement automatique, saisissez le chemin complet du
r&#233;pertoire &#224; surveiller pour le d&#233;ploiement automatique des applications.</b><p>La valeur par d&#233;faut est <tt></tt><i>domain-dir</i><tt>/autodeploy</tt>.</p></li>
<li><b>Dans la liste d&#233;roulante Validation XML, s&#233;lectionnez le type de validation XML
&#224; effectuer sur les descripteurs de d&#233;ploiement standard et de Enterprise Server.</b><p>Le type peut &#234;tre l'un des suivants :</p><dl><dt><tt>total</tt></dt>
<dd><p>En cas d'&#233;chec de la validation XML, le d&#233;ploiement sera un &#233;chec. Il s'agit de la valeur par d&#233;faut.</p></dd>
<dt><tt>analyse</tt></dt>
<dd><p>Les erreurs de validation XML sont signal&#233;es, mais le d&#233;ploiement a lieu.</p></dd>
<dt><tt>aucun</tt></dt>
<dd><p>Aucune validation XML n'est effectu&#233;e.</p></dd>
</dl>
</li>
<li><b>Cochez la case V&#233;rificateur activ&#233; pour v&#233;rifier les fichiers du descripteur de
d&#233;ploiement.</b><p>Le v&#233;rificateur examine la structure et le contenu du fichier avant le
d&#233;ploiement automatique. En cas d'&#233;chec de la v&#233;rification, le d&#233;ploiement n'a pas
lieu. La v&#233;rification d'applications volumineuses est souvent une t&#226;che qui demande du
temps. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p></li>
<li><b>Cochez la case Pr&#233;compilation activ&#233;e pour compiler pr&#233;alablement les fichiers JSP.</b><p>Si cette option est d&#233;sactiv&#233;e, les fichiers JSP sont compil&#233;s au moment
de l'ex&#233;cution lors de leur premier acc&#232;s. Cette option est d&#233;sactiv&#233;e par
d&#233;faut.</p></li>
<li>(Facultatif) <b>Dans la section Autres propri&#233;t&#233;s, sp&#233;cifiez d'autres propri&#233;t&#233;s.</b><p>Le Enterprise Server ne d&#233;finit aucune autre propri&#233;t&#233; pour les applications. </p><ul>
<li><b>Pour ajouter une propri&#233;t&#233;, cliquez sur le bouton Ajouter propri&#233;t&#233;. Sur la
ligne vide qui appara&#238;t, saisissez le nom de la propri&#233;t&#233; dans le
champ Nom et la valeur de la propri&#233;t&#233; dans le champ Valeur.</b></li>
<li><b>Pour modifier une propri&#233;t&#233;, modifiez le champ Valeur de cette propri&#233;t&#233;.</b></li>
<li><b>Pour supprimer une propri&#233;t&#233;, cochez la case situ&#233;e &#224; gauche du champ
Nom de la propri&#233;t&#233; que vous supprimez,  puis cliquez sur le
bouton Supprimer propri&#233;t&#233;s.</b></li></ul></li>
<li><b>Cliquez sur Enregistrer.</b>
<hr><p><b>Astuce - </b>Pour revenir aux param&#232;tres par d&#233;faut, cliquez sur le bouton Charger valeurs
par d&#233;faut, puis sur Enregistrer.</p>
<hr>
</li>
<li><b>Red&#233;marrez le serveur.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-generaltab.html">Pour afficher des Informations g&#233;n&#233;rales sur le Enterprise Server</a></p></li>
<li><p><a href="task-logviewer.html">Afficher le journal du serveur</a></p></li>
<li><p><a href="task-setadvancedomainattributes.html">D&#233;finir les attributs avanc&#233;s du domaine</a></p></li>
<li><p><a href="task-setadminpassword.html">Pour changer le mot de passe administrateur</a></p></li>
<li><p><a href="task-systemproperties.html">Pour g&#233;rer les propri&#233;t&#233;s syst&#232;me</a></p></li>
<li><p><a href="task-appmonitoringdata.html">Pour afficher les donn&#233;es de contr&#244;le des applications</a></p></li>
<li><p><a href="task-servermonitoringdata.html">Pour afficher les donn&#233;es de contr&#244;le des serveurs</a></p></li></ul>

