<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jaccprovideredit"></a><h4>Pour modifier un fournisseur JACC</h4><ol>
<li><b>Dans l'arborescence de navigation, d&#233;veloppez le n&#339;ud Configuration.</b></li>
<li><b>Sous le n&#339;ud Configuration, d&#233;veloppez le n&#339;ud S&#233;curit&#233;.</b></li>
<li><b>Sous le n&#339;ud Securit&#233;, s&#233;lectionnez le n&#339;ud Fournisseurs JACC.</b><p>La page Fournisseurs JACC s'ouvre.</p></li>
<li><b>Sur la page Fournisseurs JACC, cliquez sur le nom du fournisseur JACC
&#224; modifier.</b><p>La page Modifier un fournisseur JACC s'ouvre.</p></li>
<li><b>Sur la page Modifier un fournisseur JACC, dans le champ Configuration des
strat&#233;gies, saisissez le nom de la classe qui impl&#233;mente la fabrique de
configuration des strat&#233;gies.</b></li>
<li><b>Dans le champ Fournisseur de strat&#233;gies, saisissez le nom de la classe
qui impl&#233;mente la fabrique de strat&#233;gies.</b></li>
<li>(Facultatif) <b>Dans la section Autres propri&#233;t&#233;s, sp&#233;cifiez d'autres propri&#233;t&#233;s.</b><p>Pour obtenir une description de l'autre propri&#233;t&#233; disponible pour les fournisseurs JACC,
consultez <a href="ref-jaccproviderprop.html">Propri&#233;t&#233;s propres aux fournisseurs JACC</a>.</p><ul>
<li><b>Pour ajouter une propri&#233;t&#233;, cliquez sur le bouton Ajouter propri&#233;t&#233;. Sur la
ligne vide qui appara&#238;t, saisissez le nom de la propri&#233;t&#233; dans le
champ Nom et la valeur de la propri&#233;t&#233; dans le champ Valeur.</b></li>
<li><b>Pour modifier une propri&#233;t&#233;, modifiez le champ Valeur de cette propri&#233;t&#233;.</b></li>
<li><b>Pour supprimer une propri&#233;t&#233;, cochez la case situ&#233;e &#224; gauche du champ
Nom de la propri&#233;t&#233; que vous supprimez,  puis cliquez sur le
bouton Supprimer propri&#233;t&#233;s.</b></li></ul></li>
<li><b>Cliquez sur Enregistrer.</b>
<hr><p><b>Astuce - </b>Pour revenir aux param&#232;tres par d&#233;faut, cliquez sur le bouton Charger valeurs
par d&#233;faut, puis sur Enregistrer.</p>
<hr>
</li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-jaccprovidernew.html">Pour cr&#233;er un fournisseur JACC</a></p></li>
<li><p><a href="task-jaccproviderdelete.html">Pour supprimer un fournisseur JACC</a></p></li>
<li><p><a href="task-setactivejaccprov.html">Pour d&#233;finir le fournisseur JACC actif</a></p></li></ul>

