<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-realmnew"></a><h4>Cr&#233;er un domaine</h4><p>Le Enterprise Server est pr&#233;configur&#233; avec trois domaines : <tt>file</tt>, <tt> certificate</tt> et
<tt>admin-realm</tt>. Il est &#233;galement possible de cr&#233;er d'autres domaines <tt>ldap</tt>, <tt>JDBC</tt>, <tt>solaris</tt>
et des domaines personnalis&#233;s. Un serveur comprend g&#233;n&#233;ralement un domaine de chaque
type, tandis que le Enterprise Server comprend deux domaines de fichiers :
<tt>file</tt> et <tt> admin-realm</tt>. Il s'agit de deux domaines du m&#234;me type, mais
ayant deux utilisations diff&#233;rentes. Il est &#233;galement possible d'avoir une base de
donn&#233;es de certificats diff&#233;rente pour chaque serveur virtuel du syst&#232;me.</p><ol>
<li><b>Dans l'arborescence de navigation, d&#233;veloppez le n&#339;ud Configuration.</b></li>
<li><b>D&#233;veloppez le n&#339;ud S&#233;curit&#233;.</b></li>
<li><b>S&#233;lectionnez le n&#339;ud Domaines.</b><p>La page Domaines s'affiche.</p></li>
<li><b>Sur la page Domaines, cliquez sur Nouveau.</b><p>La page Nouveau domaine s'affiche.</p></li>
<li><b>Dans le champ Nom, attribuez un nom au domaine.</b></li>
<li><b>Pour sp&#233;cifier le nom de classe pour le domaine, proc&#233;dez de l'une
des mani&#232;res suivantes&#160;:</b><ul>
<li><b>Dans la liste d&#233;roulante Nom de la classe, s&#233;lectionnez le nom de
classe du domaine &#224; cr&#233;er.</b><p>Les choix possibles sont affich&#233;s dans le tableau suivant.</p><table><col width="16%"><col width="83%"><tr><th align="left" valign="top" scope="column"><p>Nom de domaine</p></th>
<th align="left" valign="top" scope="column"><p>Nom de
la classe</p></th>
</tr>
<tr><td align="left" valign="top" scope="row"><p><tt>fichier</tt></p></td>
<td align="left" valign="top" scope="row"><p><tt>com.sun.enterprise.security.auth.realm.file.FileRealm</tt></p></td>
</tr>
<tr><td align="left" valign="top" scope="row"><p><tt>certificat</tt></p></td>
<td align="left" valign="top" scope="row"><p><tt>com.sun.enterprise.security.auth.realm.certificate.CertificateRealm</tt></p></td>
</tr>
<tr><td align="left" valign="top" scope="row"><p><tt>ldap</tt></p></td>
<td align="left" valign="top" scope="row"><p><tt>com.sun.enterprise.security.auth.realm.ldap.LDAPRealm</tt></p></td>
</tr>
<tr><td align="left" valign="top" scope="row"><p><tt>JDBC</tt></p></td>
<td align="left" valign="top" scope="row"><p><tt>com.sun.enterprise.security.auth.realm.jdbc.JDBCRealm</tt></p></td>
</tr>
<tr><td align="left" valign="top" scope="row"><p><tt>solaris</tt></p></td>
<td align="left" valign="top" scope="row"><p><tt>com.sun.enterprise.security.auth.realm.solaris.SolarisRealm</tt></p></td>
</tr>
</table></li>
<li><b>S&#233;lectionnez le bouton radio inf&#233;rieur et saisissez le nom de classe du
domaine personnalis&#233; &#224; cr&#233;er.</b></li></ul></li>
<li>(Facultatif) <b>Dans la section Autres propri&#233;t&#233;s, sp&#233;cifiez d'autres propri&#233;t&#233;s.</b><p>Pour ajouter une propri&#233;t&#233;, cliquez sur le bouton Ajouter propri&#233;t&#233;. Sur la
ligne vide qui appara&#238;t, saisissez le nom de la propri&#233;t&#233; dans le
champ Nom et la valeur de la propri&#233;t&#233; dans le champ Valeur.</p><p>Les propri&#233;t&#233;s valides d&#233;pendent du type de domaine.</p>
<ul><li><p>Pour une description des propri&#233;t&#233;s de domaine de fichier, consultez <a href="ref-editfile-adminrealm.html">Propri&#233;t&#233;s sp&#233;cifiques de la classe <tt>FileRealm</tt></a>.</p></li>
<li><p>Pour une description des propri&#233;t&#233;s de domaine de certificat, consultez <a href="ref-editcertrealm.html">Propri&#233;t&#233;s sp&#233;cifiques de la classe <tt>CertificateRealm</tt></a>.</p></li>
<li><p>Pour une description des propri&#233;t&#233;s de domaine JDBC, consultez <a href="ref-editjdbcrealm.html">Propri&#233;t&#233;s sp&#233;cifiques de la classe <tt>JDBCRealm</tt></a>.</p></li>
<li><p>Pour une description des propri&#233;t&#233;s de domaine LDAP, consultez <a href="ref-ldaprealmprop.html">Propri&#233;t&#233;s sp&#233;cifiques &#224; la classe <tt>LDAPRealm </tt></a>.</p></li>
<li><p>Pour une description des propri&#233;t&#233;s de domaine Solaris, consultez <a href="ref-solarisrealmprop.html">Propri&#233;t&#233;s sp&#233;cifiques &#224; la classe <tt>SolarisRealm </tt></a>.</p></li></ul>
</li>
<li><b>Cliquez sur OK.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-realmedit.html">Modifier un domaine</a></p></li>
<li><p><a href="task-todeleterealm.html">Supprimer un domaine</a></p></li>
<li><p><a href="task-tosetdefault.html">D&#233;finir le domaine par d&#233;faut</a></p></li>
<li><p><a href="task-createcustomrealm.html">Cr&#233;er un domaine personnalis&#233;</a></p></li></ul>

