<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-realmedit"></a><h4>Modifier un domaine</h4><ol>
<li><b>Dans l'arborescence de navigation, d&#233;veloppez le n&#339;ud Configuration.</b></li>
<li><b>D&#233;veloppez le n&#339;ud S&#233;curit&#233;.</b></li>
<li><b>D&#233;veloppez le n&#339;ud Domaines.</b></li>
<li><b>S&#233;lectionnez le nom d'un domaine existant.</b><p>La page Modification du domaine s'ouvre.</p></li>
<li><b>Pour modifier le nom de la classe du domaine, proc&#233;dez de l'une
des mani&#232;res suivantes&#160;:</b><ul>
<li><b>Dans la liste d&#233;roulante Nom de la classe, s&#233;lectionnez le nom de
classe du domaine &#224; cr&#233;er.</b></li>
<li><b>S&#233;lectionnez le second bouton radio et saisissez le nom de classe du
domaine personnalis&#233; &#224; cr&#233;er.</b></li></ul></li>
<li>(Facultatif) <b>Dans la section Autres propri&#233;t&#233;s, sp&#233;cifiez d'autres propri&#233;t&#233;s.</b><p>Les propri&#233;t&#233;s valides d&#233;pendent du type de domaine.</p>
<ul><li><p>Pour une description des propri&#233;t&#233;s de domaine de fichier, consultez <a href="ref-editfile-adminrealm.html">Propri&#233;t&#233;s sp&#233;cifiques de la classe <tt>FileRealm</tt></a>.</p></li>
<li><p>Pour une description des propri&#233;t&#233;s de domaine de certificat, consultez <a href="ref-editcertrealm.html">Propri&#233;t&#233;s sp&#233;cifiques de la classe <tt>CertificateRealm</tt></a>.</p></li>
<li><p>Pour une description des propri&#233;t&#233;s de domaine JDBC, consultez <a href="ref-editjdbcrealm.html">Propri&#233;t&#233;s sp&#233;cifiques de la classe <tt>JDBCRealm</tt></a>.</p></li>
<li><p>Pour une description des propri&#233;t&#233;s de domaine LDAP, consultez <a href="ref-ldaprealmprop.html">Propri&#233;t&#233;s sp&#233;cifiques &#224; la classe <tt>LDAPRealm </tt></a>.</p></li>
<li><p>Pour une description des propri&#233;t&#233;s de domaine Solaris, consultez <a href="ref-solarisrealmprop.html">Propri&#233;t&#233;s sp&#233;cifiques &#224; la classe <tt>SolarisRealm </tt></a>.</p></li></ul>
<ul>
<li><b>Pour ajouter une propri&#233;t&#233;, cliquez sur le bouton Ajouter propri&#233;t&#233;. Sur la
ligne vide qui appara&#238;t, saisissez le nom de la propri&#233;t&#233; dans le
champ Nom et la valeur de la propri&#233;t&#233; dans le champ Valeur.</b></li>
<li><b>Pour modifier une propri&#233;t&#233;, modifiez le champ Valeur de cette propri&#233;t&#233;.</b></li>
<li><b>Pour supprimer une propri&#233;t&#233;, cochez la case situ&#233;e &#224; gauche du champ
Nom de la propri&#233;t&#233; que vous supprimez,  puis cliquez sur le
bouton Supprimer propri&#233;t&#233;s.</b></li></ul></li>
<li><b>Cliquez sur Enregistrer.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-realmnew.html">Cr&#233;er un domaine</a></p></li>
<li><p><a href="task-todeleterealm.html">Supprimer un domaine</a></p></li>
<li><p><a href="task-tosetdefault.html">D&#233;finir le domaine par d&#233;faut</a></p></li>
<li><p><a href="task-createcustomrealm.html">Cr&#233;er un domaine personnalis&#233;</a></p></li></ul>

