<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jaccprovidernew"></a><h4>Pour cr&#233;er un fournisseur JACC</h4><p>JACC (Java Authorization Contract for Containers) fait partie de la sp&#233;cification Java
EE qui d&#233;finit une interface pour les fournisseurs d'autorisation enfichables. Cela permet
&#224; l'administrateur de configurer des modules de <b>branchement</b> tiers pour appliquer l'autorisation.
Par d&#233;faut, le Enterprise Server fournit un moteur d'autorisation simple, bas&#233; sur
le fichier et compatible JACC.</p><p>Pour en savoir plus sur l'&#233;criture de classes d'impl&#233;mentation pour un fournisseur
JACC, consultez la sp&#233;cification JACC sur <a href="http://jcp.org/en/jsr/detail?id=115">http://jcp.org/en/jsr/detail?id=115</a>.</p><ol>
<li><b>Dans l'arborescence de navigation, d&#233;veloppez le n&#339;ud Configuration.</b></li>
<li><b>Sous le n&#339;ud Configuration, d&#233;veloppez le n&#339;ud S&#233;curit&#233;.</b></li>
<li><b>Sous le n&#339;ud Securit&#233;, s&#233;lectionnez le n&#339;ud Fournisseurs JACC.</b><p>La page Fournisseurs JACC s'ouvre.</p></li>
<li><b>Sur la page Fournisseurs JACC, cliquez sur Nouveau.</b><p>La page Nouveau fournisseur JACC s'ouvre.</p></li>
<li><b>Sur la page Nouveau fournisseur JACC, dans le champ Nom, saisissez le
nom qui identifiera ce fournisseur.</b></li>
<li><b>Dans le champ Configuration des strat&#233;gies, saisissez le nom de la classe
qui impl&#233;mente la fabrique de configuration de strat&#233;gies.</b><p>Le fournisseur <tt>par d&#233;faut </tt> utilise <tt>com.sun.enterprise.security.provider.PolicyConfigurationFactoryImpl </tt>. Le fournisseur <tt>simple</tt> utilise <tt>com.sun.enterprise.security.jacc.provider.SimplePolicyConfigurationFactory </tt>.</p></li>
<li><b>Dans le champ Fournisseur de strat&#233;gies, saisissez le nom de la classe
qui impl&#233;mente la fabrique de strat&#233;gies.</b><p>Le fournisseur <tt>par d&#233;faut</tt> utilise <tt>com.sun.enterprise.security.provider.PolicyWrapper</tt>. Le fournisseur <tt>simple</tt> utilise <tt>com.sun.enterprise.security.jacc.provider.SimplePolicyProvider </tt>.</p></li>
<li>(Facultatif) <b>Dans la section Autres propri&#233;t&#233;s, sp&#233;cifiez d'autres propri&#233;t&#233;s.</b><p>Pour ajouter une propri&#233;t&#233;, cliquez sur le bouton Ajouter propri&#233;t&#233;. Sur la
ligne vide qui appara&#238;t, saisissez le nom de la propri&#233;t&#233; dans le
champ Nom et la valeur de la propri&#233;t&#233; dans le champ Valeur.</p><p>Pour obtenir une description des autres propri&#233;t&#233;s disponibles pour les fournisseurs JACC,
consultez <a href="ref-jaccproviderprop.html">Propri&#233;t&#233;s propres aux fournisseurs JACC</a>.</p></li>
<li><b>Cliquez sur OK.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-jaccprovideredit.html">Pour modifier un fournisseur JACC</a></p></li>
<li><p><a href="task-jaccproviderdelete.html">Pour supprimer un fournisseur JACC</a></p></li>
<li><p><a href="task-setactivejaccprov.html">Pour d&#233;finir le fournisseur JACC actif</a></p></li></ul>

