<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jvmpathsettings"></a><h4>Configurer les param&#232;tres du chemin d'acc&#232;s &#224; la JVM </h4><p>Le chemin de classe est la liste des fichiers JAR dans laquelle
l'environnement d'ex&#233;cution Java recherche des classes et d'autres ressources.</p><ol>
<li><b>Dans l'arborescence de navigation, s&#233;lectionnez le noeud Configuration.</b></li>
<li><b>Sous le n&#339;ud Configuration, s&#233;lectionnez le n&#339;ud Param&#232;tres JVM.</b><p>La page Param&#232;tres JVM s'ouvre.</p></li>
<li><b>Dans la page Param&#232;tres g&#233;n&#233;raux JVM, cliquez sur l'onglet Param&#232;tres du chemin.</b><p>La page Param&#232;tres de classpath JVM s'ouvre.</p></li>
<li><b>Cochez la case Ignorer le classpath de l'environnement pour ignorer la variable
d'environnement <tt>CLASSPATH</tt>.</b><p>La variable d'environnement <tt>CLASSPATH</tt> est utile pour les didacticiels de base relatifs
&#224; la programmation, mais d&#233;conseill&#233;e pour les environnements d'entreprise.</p></li>
<li><b>Dans le champ Classpath du syst&#232;me, saisissez le chemin d'acc&#232;s des classes
sur votre syst&#232;me.</b></li>
<li><b>Dans le champ Pr&#233;fixe du chemin de classe, saisissez les chemins complets
des fichiers JAR pour lesquels vous voulez ajouter un pr&#233;fixe au chemin
de classe du serveur.</b><p>Pour ajouter un pr&#233;fixe &#224; plusieurs fichiers, saisissez un chemin par ligne.</p></li>
<li><b>Dans le champ Suffixe du chemin de classe, saisissez les chemins complets
des fichiers JAR pour lesquels vous voulez ajouter un suffixe au chemin
de classe du serveur. </b><p>Par exemple, vous devez sp&#233;cifier le fichier JAR d'un pilote de base
de donn&#233;es. Voir <a href="../../../jdbc/en/help/">To Integrate a JDBC Driver</a>.</p><p>Pour ajouter un suffixe &#224; plusieurs fichiers, saisissez un chemin par ligne.</p></li>
<li><b>Dans le champ Pr&#233;fixe du chemin de biblioth&#232;que native, saisissez les chemins
complets des fichiers JAR pour lesquels vous voulez ajouter un pr&#233;fixe au
chemin de biblioth&#232;que native.</b><p>Pour ajouter un pr&#233;fixe &#224; plusieurs fichiers, saisissez un chemin par ligne.</p></li>
<li><b>Dans le champ Suffixe du chemin de biblioth&#232;que native, saisissez les chemins
complets des fichiers JAR pour lesquels vous voulez ajouter un suffixe au
chemin de biblioth&#232;que native. </b><p>Pour ajouter un suffixe &#224; plusieurs fichiers, saisissez un chemin par ligne.</p><p>Le chemin de la biblioth&#232;que native est une concat&#233;nation des chemins suivants
:</p>
<ul><li><p>Chemin relatif du serveur pour ses biblioth&#232;ques natives partag&#233;es</p></li>
<li><p>Chemin de la biblioth&#232;que native dans l'environnement d'ex&#233;cution standard</p></li>
<li><p>Param&#232;tre de l'environnement shell (<tt>LD_LIBRARY_PATH</tt> sous UNIX<sup>&#174;</sup>)</p></li>
<li><p>Tout chemin indiqu&#233; sur la page <a href="ref-serverinstjvmprofiler.html">Param&#232;tres du profileur JVM</a></p></li></ul>
</li>
<li><b>Cliquez sur Enregistrer.</b></li>
<li><b>Red&#233;marrez le serveur.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-jvmsettings.html">Configurer les param&#232;tres g&#233;n&#233;raux du profileur JVM</a></p></li>
<li><p><a href="task-jvmoptions.html">Configurer les options JVM</a></p></li>
<li><p><a href="task-securitymanagerdisable.html">D&#233;sactiver le gestionnaire de s&#233;curit&#233;</a></p></li>
<li><p><a href="task-jvmprofilersettings.html">Configurer les param&#232;tres du profileur JVM </a></p></li></ul>

