<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-securitysettings"></a><h4>Configurer les r&#233;glages de s&#233;curit&#233;</h4><p>La Console d?administration vous permet de d&#233;finir toute une s&#233;rie de r&#233;glages
de s&#233;curit&#233; dans le syst&#232;me.</p><ol>
<li><b>Dans l'arborescence de navigation, d&#233;veloppez le n&#339;ud Configuration.</b></li>
<li><b>Sous le n&#339;ud Configuration, s&#233;lectionnez le n&#339;ud S&#233;curit&#233;.</b><p>La page S&#233;curit&#233; s'ouvre.</p></li>
<li><b>Cochez la case Gestionnaire de s&#233;curit&#233; activ&#233;.</b><p>Une option JVM, <tt>-Djava.security.manager</tt>, est alors ajout&#233;e aux param&#232;tres JVM de Enterprise
Server. Voir <a href="task-jvmoptions.html">Configurer les options JVM</a>. Vous devez red&#233;marrer le serveur pour activer la modification.</p><p>V&#233;rifiez que vous avez bien accord&#233; les autorisations n&#233;cessaires pour toutes les
applications. Vous pouvez d&#233;sactiver le gestionnaire de s&#233;curit&#233; pour am&#233;liorer les performances.
Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p></li>
<li><b>Cochez la case Journalisation d'audit activ&#233;e.</b><p>Lorsque cette option est activ&#233;e, le serveur charge et ex&#233;cute tous les
modules d'audit s&#233;lectionn&#233;s dans la liste des modules d'audit. Si cette option
n'est pas activ&#233;e, le serveur n'acc&#232;de pas aux modules d'audit. Cette option
est d&#233;sactiv&#233;e par d&#233;faut.</p></li>
<li><b>Dans la liste d&#233;roulante Domaine par d&#233;faut, s&#233;lectionnez le domaine actif que
le serveur utilisera pour l'authentification.</b><p>Les applications utiliseront ce domaine sauf indication contraire de leur descripteur de
d&#233;ploiement. Tous les domaines configur&#233;s apparaissent dans la liste. La valeur par
d&#233;faut est <tt>file</tt>.</p></li>
<li><b>Indiquez les informations du principal par d&#233;faut.</b><ol style="list-style-type: lower-alpha">
<li><b>Dans le champ Principal par d&#233;faut, saisissez le nom de l'utilisateur par
d&#233;faut.</b><p>Le serveur utilise ce nom d'utilisateur lorsque aucun autre principal n'est fourni.</p></li>
<li><b>Dans le champ Mot de passe du principal par d&#233;faut, saisissez le
mot de passe du principal par d&#233;faut indiqu&#233; dans le champ Principal
par d&#233;faut.</b></li></ol><p>Aucune valeur principale par d&#233;faut n'est requise pour un fonctionnement normal du
serveur.</p></li>
<li><b>Dans la liste d&#233;roulante JACC, s&#233;lectionnez le nom d'un fournisseur JACC configur&#233;.</b><p>Les choix par d&#233;faut sont <tt>par d&#233;faut</tt> et <tt> simple</tt>. L'option par d&#233;faut est
<tt>par d&#233;faut</tt>.</p></li>
<li><b>Dans la liste d&#233;roulante Modules d'audit, s&#233;lectionnez les modules de fournisseur d'audit
qui seront utilis&#233;s par le sous-syst&#232;me d'audit si la journalisation d'audit est
activ&#233;e.</b><p>Par d&#233;faut, le serveur utilise un module d'audit nomm&#233; <tt>default</tt>. Pour plus
d'informations sur la cr&#233;ation de modules d'audit, consultez <a href="task-auditmodulenew.html">Cr&#233;er un module d'audit</a>.</p></li>
<li><b>Cochez la case Mappage principal-r&#244;le par d&#233;faut activ&#233; pour appliquer un mappage
principal-r&#244;le par d&#233;faut &#224; des applications d&#233;pourvues de mappage sp&#233;cifique aux applications.</b></li>
<li><b>Si vous avez activ&#233; le mappage principal-r&#244;le par d&#233;faut, dans le champ
Classe de principal mapp&#233;e, saisissez le nom d'une classe d'impl&#233;mentation <tt>java.security.Principal </tt> pesronnalis&#233;e
&#224; utiliser dans le mappage principal-r&#244;le par d&#233;faut.</b></li>
<li>(Facultatif) <b>Dans la section Autres propri&#233;t&#233;s, sp&#233;cifiez d'autres propri&#233;t&#233;s.</b><p>Les propri&#233;t&#233;s valides d&#233;pendent du type de domaine s&#233;lectionn&#233; dans le champ
Domaine par d&#233;faut.</p>
<ul><li><p>Pour une description des propri&#233;t&#233;s de domaine de fichier, consultez <a href="ref-editfile-adminrealm.html">Propri&#233;t&#233;s sp&#233;cifiques de la classe <tt>FileRealm</tt></a>.</p></li>
<li><p>Pour une description des propri&#233;t&#233;s de domaine de certificat, consultez <a href="ref-editcertrealm.html">Propri&#233;t&#233;s sp&#233;cifiques de la classe <tt>CertificateRealm</tt></a>.</p></li>
<li><p>Pour une description des propri&#233;t&#233;s de domaine JDBC, consultez <a href="ref-editjdbcrealm.html">Propri&#233;t&#233;s sp&#233;cifiques de la classe <tt>JDBCRealm</tt></a>.</p></li>
<li><p>Pour une description des propri&#233;t&#233;s de domaine LDAP, consultez <a href="ref-ldaprealmprop.html">Propri&#233;t&#233;s sp&#233;cifiques &#224; la classe <tt>LDAPRealm </tt></a>.</p></li>
<li><p>Pour une description des propri&#233;t&#233;s de domaine Solaris, consultez <a href="ref-solarisrealmprop.html">Propri&#233;t&#233;s sp&#233;cifiques &#224; la classe <tt>SolarisRealm </tt></a>.</p></li></ul>
<ul>
<li><b>Pour ajouter une propri&#233;t&#233;, cliquez sur le bouton Ajouter propri&#233;t&#233;. Sur la
ligne vide qui appara&#238;t, saisissez le nom de la propri&#233;t&#233; dans le
champ Nom et la valeur de la propri&#233;t&#233; dans le champ Valeur.</b></li>
<li><b>Pour modifier une propri&#233;t&#233;, modifiez le champ Valeur de cette propri&#233;t&#233;.</b></li>
<li><b>Pour supprimer une propri&#233;t&#233;, cochez la case situ&#233;e &#224; gauche du champ
Nom de la propri&#233;t&#233; que vous supprimez,  puis cliquez sur le
bouton Supprimer propri&#233;t&#233;s.</b></li></ul></li>
<li><b>Cliquez sur Enregistrer.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-accessadmintools.html">Autoriser l'acc&#232;s aux outils d'administration</a></p></li>
<li><p><a href="task-changeadminpasswd.html">Pour modifier le mot de passe d'un utilisateur du domaine d'administration</a></p></li></ul>

