<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-appredeploy"></a><h4>Red&#233;ploiement d'une application d&#233;ploy&#233;e</h4><p>Le red&#233;ploiement d'une application d&#233;ploie une nouvelle version de l'application tout en
conservant les param&#232;tres et les options avec lesquels l'application a &#233;t&#233; d&#233;ploy&#233;e
initialement.</p><h6>Avant de commencer</h6><p>Assurez-vous que l'application &#224; red&#233;ployer est d&#233;j&#224; d&#233;ploy&#233;e.</p><ol>
<li><b>Dans l'arborescence de navigation, s&#233;lectionnez le n&#339;ud Applications.</b><p>La page Applications s'affiche.</p></li>
<li><b>Dans le tableau Applications d&#233;ploy&#233;es, cliquez sur Red&#233;ployer sur la ligne de
l'application que vous voulez red&#233;ployer.</b><p>La page Red&#233;ploiement d'applications ou de modules s'affiche.</p></li>
<li><b>Indiquez l'emplacement de l'archive qui contient l'application &#224; red&#233;ployer.</b><ul>
<li><b>Si l'archive est un fichier stock&#233; sur la machine client ou accessible
depuis cette derni&#232;re, s&#233;lectionnez l'option Fichier empaquet&#233; &#224; t&#233;l&#233;charger sur le serveur.</b><p>L'ordinateur client est l'h&#244;te sur lequel vous visualisez la Console d?administration via
un navigateur.</p><p>Cliquez sur Parcourir pour acc&#233;der au fichier ou tapez le chemin d'acc&#232;s
complet au fichier.</p></li>
<li><b>Si l'archive est un fichier stock&#233; sur la machine serveur ou une
application non empaquet&#233;e dans un r&#233;pertoire &#233;clat&#233;, s&#233;lectionnez l'option Fichier local empaquet&#233;
ou R&#233;pertoire accessible depuis le Enterprise Server.</b><p>La machine serveur est l'h&#244;te sur lequel fonctionne le serveur d'administration du
domaine. </p><p>Cliquez sur Parcourir les fichiers pour acc&#233;der &#224; un fichier ou Parcourir
les dossiers pour acc&#233;der &#224; un r&#233;pertoire. Vous pouvez &#233;galement saisir le
nom du chemin d'acc&#232;s complet au fichier ou au r&#233;pertoire. Le d&#233;ploiement
&#224; partir d'un r&#233;pertoire &#233;clat&#233; est r&#233;serv&#233; aux d&#233;veloppeurs exp&#233;riment&#233;s et est
d&#233;conseill&#233; pour les environnements de production.</p></li></ul></li>
<li><b>Pour conserver puis restaurer les sessions actives de l'application &#224; la fin
du red&#233;ploiement, cochez la case Conserver les sessions.</b><p>Si la conservation ou la restauration d'une session active de l'application &#233;choue,
 <b> aucune</b> des sessions ne sera disponible une fois le red&#233;ploiement termin&#233;.
Toutefois, le red&#233;ploiement se poursuit et un avertissement est enregistr&#233;.</p></li>
<li><b>Cochez la case Pr&#233;compiler les JSP pour compiler au pr&#233;alable les fichiers
JavaServer Pages (JSP).</b><p>Si cette option est d&#233;sactiv&#233;e, les fichiers JSP sont compil&#233;s au moment
de l'ex&#233;cution lors de leur premier acc&#232;s. Cette option est d&#233;sactiv&#233;e par
d&#233;faut.</p></li>
<li><b>Cochez la case Ex&#233;cuter le v&#233;rificateur pour ex&#233;cuter le v&#233;rificateur avant le
red&#233;ploiement.</b><p>Si cette option est s&#233;lectionn&#233;e et que la v&#233;rification &#233;choue, le red&#233;ploiement
n'a pas lieu. Le v&#233;rificateur examine la structure et le contenu du
fichier. La v&#233;rification d'applications volumineuses est souvent une t&#226;che qui demande du
temps. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p></li>
<li><b>Cliquez sur OK.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-applistdeployed.html">Pour afficher la liste des applications d&#233;ploy&#233;es</a></p></li>
<li><p><a href="task-appdeployweb.html">D&#233;ployer une application Web</a></p></li>
<li><p><a href="task-deployentapp.html">Pour d&#233;ployer une application d'entreprise</a></p></li>
<li><p><a href="task-appdeployclient.html">Pour d&#233;ployer un client d'application</a></p></li>
<li><p><a href="task-appdeployconn.html">Pour d&#233;ployer un module connecteur</a></p></li>
<li><p><a href="task-appdeployejb.html">Pour d&#233;ployer un Jar EJB</a></p></li>
<li><p><a href="task-appdeployruby.html">Pour d&#233;ployer une application Ruby </a></p></li>
<li><p><a href="task-appedit.html">Modification d'une application d&#233;ploy&#233;e</a></p></li>
<li><p><a href="task-appviewdesc.html">Affichage des descripteurs d'une application</a></p></li>
<li><p><a href="task-applaunch.html">Lancement d'une application</a></p></li>
<li><p><a href="task-apprestart.html">Red&#233;marrage d'une application d&#233;ploy&#233;e</a></p></li></ul>

