<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-eelogging"></a><h4>Configurer les param&#232;tres g&#233;n&#233;raux de journalisation</h4><a name="indexterm-19"></a><ol>
<li><b>Dans l'arborescence de navigation, d&#233;veloppez le n&#339;ud Configuration.</b></li>
<li><b>Sous le n&#339;ud Configuration, s&#233;lectionnez le n&#339;ud Param&#232;tres du .</b><p>La page Param&#232;tres du  s'ouvre.</p></li>
<li><b>Cochez la case Ecriture sur le journal syst&#232;me activ&#233;e pour envoyer le
r&#233;sultat de la journalisation &#224; l'utilitaire <tt>syslog</tt> en plus du journal du
serveur.</b><p>Cette fonction est disponible sur les syst&#232;mes Solaris et Linux uniquement. Cette
option est d&#233;sactiv&#233;e par d&#233;faut.</p></li>
<li><b>Cochez la case Journaliser sur la console pour NE SAIS PAS</b><p>Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p></li>
<li><b>Dans le champ Fichier journal, saisissez un autre nom ou emplacement pour
le fichier journal du serveur.</b><p>L'emplacement par d&#233;faut est <tt>glassfish/domains/domain1/logs/server.log</tt>.</p></li>
<li><b>Dans le champ Gestionnaire de journaux, saisissez le nom de classe absolu
d'un gestionnaire de journal personnalis&#233;.</b><p>Un gestionnaire de journal personnalis&#233; vous permet d'envoyer des journaux vers une
destination autre que <tt>server.log </tt> ou <tt>syslog</tt>. Celui-ci doit venir en extension de
la classe <tt>java.util.logging.Handler</tt> (API compatible JSR 047). Ajoutez la classe du gestionnaire
au classpath du Enterprise Server de fa&#231;on &#224; installer le gestionnaire lors
du d&#233;marrage du serveur.</p></li>
<li><b>Dans le champ Limite de rotation du fichier, saisissez la taille en
octets que le fichier journal du serveur doit atteindre avant sa rotation.</b><p>Lorsque le journal du serveur atteint la taille indiqu&#233;e, le Enterprise Server
cr&#233;e un nouveau fichier vide nomm&#233; <tt>server.log</tt> et renomme l'ancien fichier <tt>server.log_</tt><i>date</i>,
o&#249; <i> date</i> indique la date et l'heure de rotation du fichier. La
valeur par d&#233;faut est 2 m&#233;gaoctets. La valeur minimale est 500 ko.
Si vous sp&#233;cifiez une valeur inf&#233;rieure, le fichier effectuera la rotation &#224;
500 ko. Pour d&#233;sactiver la rotation du fichier journal, sp&#233;cifiez la valeur
0.</p></li>
<li><b>Dans le champ Temps limite de rotation du fichier, saisissez le nombre
de minutes au bout duquel la rotation du journal du serveur doit
s'effectuer.</b><p>La valeur par d&#233;faut est 0, ce qui signifie que le fichier
effectuera la rotation lorsqu'il aura atteint la taille sp&#233;cifi&#233;e dans le champ
Limite de rotation du fichier.</p>
<hr><p><b>Remarque - </b>Si vous sp&#233;cifiez une ou plusieurs minutes, le temps limite remplace la
taille limite indiqu&#233;e par le champ Limite de rotation du fichier.</p>
<hr>
</li>
<li><b>Cliquez sur Enregistrer.</b></li>
<li><b>Arr&#234;tez et red&#233;marrez Enterprise Server.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-eelogginglevels.html">Configurer les niveaux de journalisation</a></p></li>
<li><p><a href="task-logviewer.html">Afficher le journal du serveur</a></p></li></ul>

