<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-appdeployejb"></a><h4>Pour d&#233;ployer un Jar EJB</h4><ol>
<li><b>Dans l'arborescence de navigation, s&#233;lectionnez le n&#339;ud Applications.</b><p>La page des applications s'affiche.</p></li>
<li><b>Dans le tableau Applications d&#233;ploy&#233;es, cliquez sur le bouton D&#233;ployer.</b><p>La page D&#233;ploiement d'applications ou de modules s'affiche.</p></li>
<li><b>Indiquez l'emplacement de l'archive qui contient l'application &#224; d&#233;ployer.</b><ul>
<li><b>Si l'archive est un fichier stock&#233; sur la machine client ou accessible
depuis cette derni&#232;re, s&#233;lectionnez l'option Fichier empaquet&#233; &#224; t&#233;l&#233;charger sur le serveur.</b><p>L'ordinateur client est l'h&#244;te sur lequel vous visualisez la Console d?administration via
un navigateur.</p><p>Cliquez sur Parcourir pour acc&#233;der au fichier ou tapez le chemin d'acc&#232;s
complet au fichier.</p></li>
<li><b>Si l'archive est un fichier stock&#233; sur la machine serveur ou une
application non empaquet&#233;e dans un r&#233;pertoire &#233;clat&#233;, s&#233;lectionnez l'option Fichier local empaquet&#233;
ou R&#233;pertoire accessible depuis le Enterprise Server.</b><p>La machine serveur est l'h&#244;te sur lequel fonctionne le serveur d'administration du
domaine. </p><p>Cliquez sur Parcourir les fichiers pour acc&#233;der &#224; un fichier ou Parcourir
les dossiers pour acc&#233;der &#224; un r&#233;pertoire. Vous pouvez &#233;galement saisir le
nom du chemin d'acc&#232;s complet au fichier ou au r&#233;pertoire. Le d&#233;ploiement
&#224; partir d'un r&#233;pertoire &#233;clat&#233; est r&#233;serv&#233; aux d&#233;veloppeurs exp&#233;riment&#233;s et est
d&#233;conseill&#233; pour les environnements de production.</p></li></ul></li>
<li><b>Dans la liste d&#233;roulante Type, s&#233;lectionnez Jar EJB. </b><p>Si vous avez sp&#233;cifi&#233; un Fichier empaquet&#233; &#224; charger sur le serveur
ou un Fichier local empaquet&#233; accessible depuis le Enterprise Server, le type
d'application est d&#233;tect&#233; automatiquement. Si vous avez sp&#233;cifi&#233; un R&#233;pertoire accessible depuis
le Enterprise Server, vous devez sp&#233;cifier le type manuellement.</p></li>
<li><b>Dans le champ Nom de l'application, conservez le nom par d&#233;faut, qui
correspond au nom du r&#233;pertoire ou au pr&#233;fixe du nom de fichier,
ou bien saisissez un autre nom. </b><p>Le nom par d&#233;faut appara&#238;t si vous d&#233;cidez de t&#233;l&#233;charger un fichier.
Le nom de l'application doit &#234;tre unique.</p></li>
<li><b>Cochez la case &#201;tat activ&#233; pour activer l'application.</b><p>Cette option est activ&#233;e par d&#233;faut. Si cette option est d&#233;sactiv&#233;e, l'application
est indisponible.</p></li>
<li><b>Cochez la case Ex&#233;cuter le v&#233;rificateur pour ex&#233;cuter le v&#233;rificateur avant le
d&#233;ploiement.</b><p>Si cette option est activ&#233;e est si la v&#233;rification &#233;choue, le d&#233;ploiement
n'a pas lieu. Le v&#233;rificateur examine la structure et le contenu du
fichier. La v&#233;rification d'applications volumineuses est souvent une t&#226;che qui demande du
temps. Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p></li>
<li><b>Dans le champ Biblioth&#232;ques, saisissez une liste s&#233;par&#233;e par des virgules des
fichiers JAR de biblioth&#232;que propres &#224; cette application.</b><p>Les chemins peuvent &#234;tre absolus ou relatifs. Un chemin relatif est relatif
&#224; <tt></tt><i>domain-dir</i><tt>/lib/applibs</tt>. Si le chemin est absolu, il doit &#234;tre accessible au
serveur d'administration du domaine (DAS), ce qui signifie qu'il doit &#234;tre sous
<tt></tt><i>domain-dir</i><tt></tt>. Les biblioth&#232;ques sont rendues accessibles &#224; l'application dans l'ordre dans lequel
elles sont sp&#233;cifi&#233;es.</p></li>
<li><b>Dans le champ Description, entrez une br&#232;ve description de cette application.</b></li>
<li><b>Cliquez sur OK.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-applistdeployed.html">Pour afficher la liste des applications d&#233;ploy&#233;es</a></p></li>
<li><p><a href="task-appdeployweb.html">D&#233;ployer une application Web</a></p></li>
<li><p><a href="task-deployentapp.html">Pour d&#233;ployer une application d'entreprise</a></p></li>
<li><p><a href="task-appdeployclient.html">Pour d&#233;ployer un client d'application</a></p></li>
<li><p><a href="task-appdeployconn.html">Pour d&#233;ployer un module connecteur</a></p></li>
<li><p><a href="task-appdeployruby.html">Pour d&#233;ployer une application Ruby </a></p></li>
<li><p><a href="task-appedit.html">Modification d'une application d&#233;ploy&#233;e</a></p></li>
<li><p><a href="task-appviewdesc.html">Affichage des descripteurs d'une application</a></p></li>
<li><p><a href="task-applaunch.html">Lancement d'une application</a></p></li>
<li><p><a href="task-appredeploy.html">Red&#233;ploiement d'une application d&#233;ploy&#233;e</a></p></li>
<li><p><a href="task-apprestart.html">Red&#233;marrage d'une application d&#233;ploy&#233;e</a></p></li></ul>

