<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-uc-addon"></a><h4>Installer des composants add-ons</h4><p>L'installation d'un <a href="ref-uc-concepts.html#ref-uc-about-addon">composant add-on</a> comprend les op&#233;rations suivantes :</p>
<ul><li><p>Transf&#233;rer le contenu du composant et de ses d&#233;pendances depuis un <a href="ref-uc-concepts.html#ref-uc-about-repository"> r&#233;f&#233;rentiel de r&#233;seau</a></p></li>
<li><p>Installer le composant sous l'Enterprise Server <a href="ref-uc-concepts.html#ref-uc-about-repository">image d'installation</a> dans votre syst&#232;me</p></li></ul>
<p>Si un composant n&#233;cessite un autre composant qui n'est pas d&#233;j&#224; install&#233;,
ce dernier est &#233;galement install&#233;.</p><ol>
<li><b>Dans l'arborescence de navigation, s&#233;lectionnez le n&#339;ud Outil de mise &#224; jour.</b><p>La page Add-ons disponibles s'affiche.</p></li>
<li><b>Dans le tableau des Add-ons disponibles de la page Add-ons disponibles, s&#233;lectionnez
les composants install&#233;s.</b><p>Si aucun composant add-on n'est disponible, le tableau est vide.</p><ul>
<li><b>Pour s&#233;lectionner un composant, cochez la case situ&#233;e en regard de son
nom.</b></li>
<li><b>Pour s&#233;lectionner tous les composants, cliquez sur l'ic&#244;ne S&#233;lectionner tout dans l'en-t&#234;te
du tableau.</b></li>
<li><b>Pour d&#233;s&#233;lectionner tous les composants, cliquez sur l'ic&#244;ne D&#233;s&#233;lectionner tout dans l'en-t&#234;te
du tableau.</b></li></ul></li>
<li><b>Cliquez sur Installer.</b><p>Une bo&#238;te de dialogue vous demande de confirmer que les composants s&#233;lectionn&#233;s,
ainsi que tout autre composant requis, doivent &#234;tre install&#233;s.</p></li>
<li><b>Dans la bo&#238;te de dialogue, cliquez sur OK.</b><p>On vous demande d'accepter les contrats de licence des composants que vous
installez.</p></li>
<li><b>Acceptez les contrats de licence des composants que vous installez.</b><p>Enterprise Server confirme que l'installation est termin&#233;e. Les composants sont supprim&#233;s du
tableau des composants add-ons et sont ajout&#233;s au tableau des composants install&#233;s
dans la page Composants install&#233;s. </p></li>
<li><b>Red&#233;marrez le serveur.</b><p>Pour consulter des instructions d&#233;taill&#233;es, reportez-vous &#224; la documentation ci-dessous:</p>
<ul><li><p><a href="http://docs.sun.com/doc/820-7692/ggoch?a=view">To Stop a Domain du <i>Sun GlassFish Enterprise Server v3 Administration Guide</i></a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7692/ggoda?a=view">To Start a Domain du <i>Sun GlassFish Enterprise Server v3 Administration Guide</i></a></p></li></ul>
</li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-uc-set-proxy.html">Configurer les param&#232;tres proxy de r&#233;seau pour acc&#233;der aux r&#233;f&#233;rentiels de r&#233;seau</a></p></li>
<li><p><a href="task-uc-update.html">Pour installer des mises &#224; jour de composants</a></p></li>
<li><p><a href="task-uc-installed-remove.html">D&#233;sinstaller des composants</a></p></li>
<li><p><a href="task-uc-pkgdetails.html">Afficher les informations d&#233;taill&#233;es d'un composant</a></p></li></ul>

