<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jmxconnectoredit"></a><h4>Pour modifier le connecteur JMX</h4><p>Utilisez le Service d'administration pour configurer un connecteur JMX distant conforme au
JSR-160.</p><p>Le connecteur JMX distant conforme au JSR-160 g&#232;re la communication entre les
clients JMX, comme par exemple JConsole et le service JMX, &#224; des
fins de gestion de domaine.</p><ol>
<li><b>Dans l'arborescence de navigation, d&#233;veloppez le n&#339;ud Configuration.</b></li>
<li><b>Sous le n&#339;ud Configuration, s&#233;lectionnez le n&#339;ud Service d'administration.</b><p>La page Modifier le connecteur JMX s'ouvre.</p></li>
<li><b>Cochez la case S&#233;curit&#233; activ&#233;e pour que la communication JMX soit crypt&#233;e.</b><p>Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p></li>
<li><b>Dans le champ Adresse, saisissez l'adresse IP du service de nommage o&#249;
le stub du serveur du connecteur JMX est enregistr&#233;.</b><p>Ce n'est pas le port du socket de serveur qui effectue la
v&#233;ritable communication JMX. C'est l'adresse de l'interface r&#233;seau depuis laquelle le registre
RMI est lanc&#233;. Si votre syst&#232;me est dot&#233; de plusieurs interfaces r&#233;seau,
modifiez cette valeur pour qu'une seule interface soit s&#233;lectionn&#233;e. La valeur par
d&#233;faut est <tt>0.0.0.0</tt>.</p></li>
<li><b>Dans le champ Port, saisissez le num&#233;ro de port sur lequel le
service de nommage (registre RMI) &#233;coute les connexions client RMI.</b><p>La seule utilisation de ce service de nommage consiste &#224; t&#233;l&#233;charger les
stubs RMI. Si le port par d&#233;faut est occup&#233;, on utilise un
port libre. Les valeurs l&#233;gales sont de 1 &#224; 65535. Sous les
syst&#232;mes UNIX<sup>&#174;</sup>, la cr&#233;ation de sockets qui &#233;coutent sur les ports 1
&#224; 1024 n&#233;cessite des privil&#232;ges de superutilisateur. La valeur par d&#233;faut est
8686.</p></li>
<li><b>Dans le champ Nom de domaine, saisissez le nom qui repr&#233;sente le
domaine administratif particulier. </b><p>Toutes les authentifications sont g&#233;r&#233;es par ce domaine. La valeur par d&#233;faut
est <tt>admin-realm </tt>.</p></li>
<li>(Facultatif) <b>Dans la section Autres propri&#233;t&#233;s, sp&#233;cifiez d'autres propri&#233;t&#233;s.</b><p>Le Enterprise Server sp&#233;cifie plusieurs propri&#233;t&#233;s par d&#233;faut.</p><ul>
<li><b>Pour ajouter une propri&#233;t&#233;, cliquez sur le bouton Ajouter propri&#233;t&#233;. Sur la
ligne vide qui appara&#238;t, saisissez le nom de la propri&#233;t&#233; dans le
champ Nom et la valeur de la propri&#233;t&#233; dans le champ Valeur.</b></li>
<li><b>Pour modifier une propri&#233;t&#233;, modifiez le champ Valeur de cette propri&#233;t&#233;.</b></li>
<li><b>Pour supprimer une propri&#233;t&#233;, cochez la case situ&#233;e &#224; gauche du champ
Nom de la propri&#233;t&#233; que vous supprimez,  puis cliquez sur le
bouton Supprimer propri&#233;t&#233;s.</b></li></ul></li>
<li><b>Cliquez sur Enregistrer.</b></li>
<li><b>Si vous avez coch&#233; la case S&#233;curit&#233; activ&#233;e, suivez les &#233;tapes de
<a href="task-jmxconnectorssledit.html">Pour modifier les param&#232;tres SSL du connecteur JMX</a>.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-jmxconnectorssledit.html">Pour modifier les param&#232;tres SSL du connecteur JMX</a></p></li></ul>

