<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-lifecyclemoduleedit"></a><h4>Pour modifier un module de cycle de vie</h4><ol>
<li><b>Dans l'arborescence de navigation, s&#233;lectionnez le noeud Modules de cycle de vie.</b><p>La page Modules de cycle de vie s'affiche.</p></li>
<li><b>Sur la page Modules de cycle de vie, cliquez sur le nom
du module de cycle de vie que vous modifiez.</b><p>La page Modification du module de cycle de vie s'ouvre.</p></li>
<li><b>Dans le champ Nom de la classe, saisissez le nom complet du
fichier de classe du module de cycle de vie.</b><p>La classe doit impl&#233;menter l'interface <tt>com.sun.appserv.server.LifecycleListener</tt>.</p></li>
<li><b>Dans le champ Classpath, saisissez le classpath du module de cycle de
vie.</b><p>Le classpath indique l&#224; o&#249; se trouve le module de cycle de
vie. La valeur par d&#233;faut est <tt></tt><i>domain-dir</i><tt>/applications</tt>. Si le module est d&#233;j&#224;
dans ce r&#233;pertoire (c'est-&#224;-dire dans le classpath du serveur), ce champ peut
&#234;tre laiss&#233; vierge.</p></li>
<li><b>Dans le champ Ordre de chargement, saisissez une valeur indiquant l'ordre dans
lequel ce module de cycle de vie doit &#234;tre charg&#233; au d&#233;marrage.</b><p>Les modules aux valeurs d'ordre de chargement &#224; petit nombre sont charg&#233;s
plus t&#244;t. La valeur peut aller de 101 &#224; la valeur <tt>MAXINT</tt>
du syst&#232;me d'exploitation. Les valeurs de 1 &#224; 100 sont r&#233;serv&#233;es.</p></li>
<li><b>Cochez la case &#201;tat activ&#233; pour activer le module de cycle de
vie.</b><p>Cette option est activ&#233;e par d&#233;faut.</p></li>
<li><b>Cochez la case Emp&#234;cher le d&#233;marrage de l'instance en cas d'&#233;chec du
chargement pour indiquer que le serveur doit &#234;tre arr&#234;t&#233; en cas d'&#233;chec
de chargement du module de cycle de vie.</b><p>Cette option est d&#233;sactiv&#233;e par d&#233;faut.</p></li>
<li><b>Dans la liste d&#233;roulante Serveurs virtuels, s&#233;lectionnez le ou les serveur(s) virtuel(s)
&#224; associer au module de cycle de vie.</b><p>Par d&#233;faut, aucun serveur virtuel n'est s&#233;lectionn&#233;.</p></li>
<li><b>Dans le champ Description, saisissez une description du module de cycle de
vie.</b></li>
<li>(Facultatif) <b>Dans la section Autres propri&#233;t&#233;s, sp&#233;cifiez d'autres propri&#233;t&#233;s.</b><p>Le Enterprise Server ne d&#233;finit aucune autre propri&#233;t&#233; pour les modules de
cycle de vie.</p><ul>
<li><b>Pour ajouter une propri&#233;t&#233;, cliquez sur le bouton Ajouter propri&#233;t&#233;. Sur la
ligne vide qui appara&#238;t, saisissez le nom de la propri&#233;t&#233; dans le
champ Nom et la valeur de la propri&#233;t&#233; dans le champ Valeur.</b></li>
<li><b>Pour modifier une propri&#233;t&#233;, modifiez le champ Valeur de cette propri&#233;t&#233;.</b></li>
<li><b>Pour supprimer une propri&#233;t&#233;, cochez la case situ&#233;e &#224; gauche du champ
Nom de la propri&#233;t&#233; que vous supprimez,  puis cliquez sur le
bouton Supprimer propri&#233;t&#233;s.</b></li></ul></li>
<li><b>Cliquez sur Enregistrer.</b>
<hr><p><b>Astuce - </b>Pour revenir aux param&#232;tres par d&#233;faut, cliquez sur le bouton Charger valeurs
par d&#233;faut, puis sur Enregistrer.</p>
<hr>
</li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-lifecyclemodulenew.html">Pour cr&#233;er un module de cycle de vie</a></p></li>
<li><p><a href="task-lifecyclemoduledelete.html">Pour supprimer un module de cycle de vie</a></p></li></ul>

