<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-createcustomrealm"></a><h4>Cr&#233;er un domaine personnalis&#233;</h4><p>En plus des trois domaines int&#233;gr&#233;s, vous pouvez &#233;galement cr&#233;er des domaines
personnalis&#233;s pour enregistrer les donn&#233;es utilisateur d'une autre mani&#232;re, par exemple dans
une base de donn&#233;es relationnelle. La cr&#233;ation d'un domaine personnalis&#233; n'entre pas
dans le domaine d'application de ce document. Pour plus d'informations, reportez-vous au
<a href="http://docs.sun.com/doc/820-7695/beabg?a=view">Chapitre 5, Securing Applications du <i>Sun GlassFish Enterprise Server v3 Preview Application Development Guide</i></a>.</p><p>Pour une meilleure gestion, des domaines personnalis&#233;s sont impl&#233;ment&#233;s par une classe
(appel&#233;e <tt>LoginModule</tt>) issue du package Java Authentication and Authorization Service (JAAS).</p><ol>
<li><b>Suivez la proc&#233;dure dans <a href="task-realmnew.html">Cr&#233;er un domaine</a>, en saisissant le nom du domaine personnalis&#233;
et le nom de la classe <tt> LoginModule</tt>. </b><p>Utilisez un nom unique pour le domaine personnalis&#233;, par exemple <tt>monDomainePersonnalis&#233;</tt>.</p></li>
<li><b>Cliquez sur OK.</b></li>
<li><b>Modifiez le fichier de configuration de connexion du domaine, <tt></tt><i>domain-dir</i><tt>/config/login.conf </tt>, et ajoutez
le nom de classe complet du module <tt>LoginModule </tt> JASS &#224; la fin
du fichier, comme suit :</b><pre><i>realmName</i> {
    <i>fully-qualified-LoginModule-classname</i> required;
};</pre><p>Par exemple,</p><pre>myCustomRealm {
    com.foo.bar.security.customrealm.simpleCustomLoginModule required;
};</pre></li>
<li><b>Copiez la classe du module <tt>LoginModule</tt><tt> et toutes les classes qui en d&#233;pendent dans le r&#233;pertoire </tt><i>domain-dir</i><tt>/lib/classes</tt>.</b></li>
<li><b>Red&#233;marrez le serveur si Red&#233;marrage requis s'affiche dans la Console d?administration.</b></li>
<li><b>Assurez-vous que le domaine a &#233;t&#233; correctement charg&#233;.</b><p>V&#233;rifiez <tt></tt><i>domain-dir</i><tt>/logs/server.log </tt> pour vous assurer que le domaine a bien &#233;t&#233; charg&#233;
par le serveur. Le serveur doit appeler la m&#233;thode <tt>init</tt> du domaine.</p></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-realmnew.html">Cr&#233;er un domaine</a></p></li>
<li><p><a href="task-realmedit.html">Modifier un domaine</a></p></li>
<li><p><a href="task-todeleterealm.html">Supprimer un domaine</a></p></li>
<li><p><a href="task-tosetdefault.html">D&#233;finir le domaine par d&#233;faut</a></p></li></ul>

