<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-register"></a><h4>Enregistrer Sun GlassFish Enterprise Server avec Sun Connection</h4><a name="indexterm-1"></a><a name="indexterm-2"></a><a name="indexterm-3"></a><p>Les utilisateurs enregistr&#233;s de Sun GlassFish<sup>TM</sup> Enterprise Server b&#233;n&#233;ficient des avantages suivants&#160;:</p>
<ul><li><p>Des informations sur les patches et des mises &#224; jour sur les bogues</p></li>
<li><p>Screencasts et didacticiels</p></li>
<li><p>Des actualit&#233;s et des &#233;v&#233;nements</p></li>
<li><p>Des offres d'assistance et de formation</p></li></ul>
<p>Pour enregistrer votre installation de Sun GlassFish Enterprise Server avec une <a href="http://www.sun.com/service/sunconnection/index.jsp">connexion Sun</a>,
vous devez avoir un <a href="https://reg.sun.com/whyregister">compte en ligne Sun</a>. Si vous n'avez pas encore de compte
en ligne Sun, Enterprise Server vous permet d'en cr&#233;er un lors de
l'enregistrement.</p>
<hr><p><b>Remarque - </b>Si vous optez pour cette solution, vous &#234;tes invit&#233;e &#224; saisir uniquement
les informations obligatoires. Apr&#232;s l'enregistrement de Enterprise Server, vous pouvez fournir des
informations suppl&#233;mentaires facultatives en <a href="https://reg.sun.com/updateaccount">mettant &#224; jour votre compte en ligne Sun</a>. </p>
<hr>
<h6>Avant de commencer</h6><p>Si la machine sur laquelle Enterprise Server s'ex&#233;cute se connecte &#224; Internet
par l'interm&#233;diaire d'un proxy, procurez-vous le nom de l'h&#244;te et son num&#233;ro
de port. Si un navigateur Web s'ex&#233;cute sur la m&#234;me machine que
Enterprise Server, vous pouvez obtenir ces informations dans ce navigateur. Sinon, contactez
votre administrateur syst&#232;me.</p><ol>
<li><b>Dans l'arborescence de navigation, s&#233;lectionnez le n&#339;ud Enregistrement.</b><p>La page Enregistrement du produit s'ouvre.</p></li>
<li><b>Dans la page d'enregistrement du produit, saisissez les informations requises.</b><ul>
<li><b>Si vous disposez d&#233;j&#224; d'un compte en ligne Sun, proc&#233;dez comme suit
:</b><ol style="list-style-type: lower-alpha">
<li><b>S&#233;lectionnez l'option J'ai d&#233;j&#224; un compte en ligne Sun ou un compte
SDN (Sun Developer Network).</b></li>
<li><b>Dans le champ Nom d'utilisateur, entrez le nom sp&#233;cifi&#233; &#224; la cr&#233;ation
de votre compte en ligne.</b></li>
<li><b>Faites de m&#234;me pour le champ Mot de passe.</b></li></ol></li>
<li><b>Si vous ne disposez pas d'un compte en ligne Sun, proc&#233;dez comme
suit :</b><ol style="list-style-type: lower-alpha">
<li><b>S&#233;lectionnez l'option Je ne poss&#232;de pas de compte en ligne Sun.</b></li>
<li><b>Dans le champ Adresse &#233;lectronique, entrez votre adresse e-mail.</b><p>Cette derni&#232;re sera le nom d'utilisateur de votre compte en ligne Sun.</p></li>
<li><b>Dans le champ Mot de passe, entrez le mot de passe choisi
pour acc&#233;der &#224; votre compte.</b><p>Celui-ci est sensible &#224; la casse et doit comporter entre 6 et
10 caract&#232;res.</p></li>
<li><b>Dans le champ Confirmation du mot de passe, entrez &#224; nouveau le
mot de passe choisi pr&#233;c&#233;demment.</b></li>
<li><b>Dans le champ Pr&#233;nom, entrez votre pr&#233;nom.</b></li>
<li><b>Dans le champ Nom, entrez votre nom.</b></li>
<li><b>Dans le champ Soci&#233;t&#233;, saisissez le nom de votre soci&#233;t&#233;, le cas
&#233;ch&#233;ant.</b></li>
<li><b>&#192; partir de la liste d&#233;roulante, s&#233;lectionnez votre pays ou territoire de
r&#233;sidence.</b></li></ol></li></ul></li>
<li><b>Si la machine sur laquelle Enterprise Server s'ex&#233;cute se connecte &#224; Internet
par l'interm&#233;diaire d'un proxy, entrez le nom de l'h&#244;te et son num&#233;ro
de port.</b><p>Si la machine sur laquelle Enterprise Server s'ex&#233;cute se connecte directement &#224;
Internet, ignorez cette &#233;tape.</p><p>Il est possible qu'un navigateur Web s'ex&#233;cute sur la m&#234;me machine que
Enterprise Server. Dans ce cas, vous pouvez obtenir le nom d'h&#244;te et
le num&#233;ro de port du proxy dans ce navigateur. Sinon, contactez votre
administrateur syst&#232;me.</p></li>
<li><b>Cliquez sur S'enregistrer.</b><p>Pour confirmer la fin de l'enregistrement, la <a href="ref-supportpage.html">page Support</a> s'ouvre.</p></li></ol>
