<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-logviewer"></a><h4>Afficher le journal du serveur</h4><a name="indexterm-6"></a><a name="indexterm-7"></a><ol>
<li><b>Dans l'arborescence de navigation, s&#233;lectionnez le n&#339;ud Application Server.</b><p>La page Informations g&#233;n&#233;rales s'affiche.</p></li>
<li><b>Sur la page Informations g&#233;n&#233;rales, cliquez sur le bouton Afficher les fichiers
journaux.</b><p>Une fen&#234;tre de visionneur de journaux s'ouvre.</p></li>
<li><b>Utilisez la zone Crit&#232;res de recherche pour personnaliser et filtrer le visionneur
de journaux.</b><ul>
<li><b>Cliquez sur Recherche avanc&#233;e dans la zone Crit&#232;res de recherche pour filtrer
davantage le visionneur de journaux.</b></li>
<li><b>Dans le champ Horodatage :</b><ul>
<li><b>Pour afficher les messages les plus r&#233;cents, s&#233;lectionnez Le plus r&#233;cent (valeur
par d&#233;faut).</b></li>
<li><b>Pour afficher les messages uniquement sur une p&#233;riode donn&#233;e, s&#233;lectionnez Plage sp&#233;cifique
et entrez une date et une heure dans les champs De et
&#192; qui apparaissent.</b><p>Pour la valeur Heure, la syntaxe doit prendre la forme suivante (<b>SSS</b>
est mis pour millisecondes) :</p><pre><b>hh</b>:<b>mm</b>:<b>ss</b>.<b>SSS</b></pre><p>Par exemple :</p><pre>17:10:00.000</pre><p>Si la valeur de d&#233;but est post&#233;rieure &#224; la valeur de fin,
un message d'erreur appara&#238;t.</p></li></ul></li>
<li><b>Dans la liste d&#233;roulante Niveau de journalisation, s&#233;lectionnez un niveau de journalisation
pour filtrer les messages par niveau de journalisation. S&#233;lectionnez la case &#171;
Ne pas inclure des messages plus graves &#187; pour afficher uniquement les
messages du niveau choisi.</b><p>Par d&#233;faut, tous les messages figurant dans le journal du serveur &#224;
partir du niveau de journalisation choisi sont affich&#233;s.</p><p>Pour &#234;tre s&#251;r que les messages que vous voulez afficher apparaissent dans
le journal du serveur, commencez par d&#233;finir les niveaux de journalisation appropri&#233;s
sur la page Niveaux de journalisation de module. Voir <a href="task-eelogginglevels.html">Configurer les niveaux de journalisation</a>.</p><p>Si vous choisissez de filtrer les messages du journal en fonction du
niveau de journalisation, seuls les messages correspondant aux crit&#232;res de filtre sp&#233;cifi&#233;s
s'affichent. Toutefois, ce filtrage n'affecte pas les messages consign&#233;s dans le journal
du serveur.</p></li></ul></li>
<li><b>Si vous avez cliqu&#233; sur Recherche avanc&#233;e dans la zone Crit&#232;res de
recherche, suivez ces &#233;tapes.</b><ol style="list-style-type: lower-alpha">
<li><b>Dans la liste d&#233;roulante , s&#233;lectionnez un ou plusieurs noms des espaces
pour filtrer par module.</b><p>Utilisez maj + clic ou Ctrl + clic pour s&#233;lectionner plusieurs espaces
de noms.</p><p>Si vous s&#233;lectionnez un espace de noms &#224; un niveau sup&#233;rieur, tous
les espaces de noms situ&#233;s en dessous seront &#233;galement s&#233;lectionn&#233;s. Par exemple,
si vous s&#233;lectionnez <tt>javax.enterprise.system</tt>, seront &#233;galement s&#233;lectionn&#233;s les journaux de tous les
modules situ&#233;s sous cet espace de noms : <tt>javax.enterprise.system.core</tt>, <tt>javax.enterprise.system.tools.admin </tt>, etc.</p></li>
<li><b>Dans le champ  personnalis&#233;, saisissez les noms des journals, un par
ligne, pour afficher les messages des journals propres &#224; une application particuli&#232;res.</b><p>Si l'application comprend plusieurs modules, vous pouvez les afficher tous ou seulement
une partie. Prenons l'exemple d'une application comprenant les journaux suivants :</p><pre>com.mycompany.myapp.module1
com.mycompany.myapp.module2
com.mycompany.myapp.module3</pre><p>Pour afficher des messages de tous les modules dans l'application, tapez <tt>com.mycompany.myapp </tt>.
Pour afficher les messages du <tt>module2</tt> uniquement, entrez <tt>com.mycompany.myapp.module2</tt>.</p><p>Si vous sp&#233;cifiez un ou plusieurs enregistreurs personnalis&#233;s, les messages des modules
du Enterprise Server n'apparaissent que si vous les avez explicitement sp&#233;cifi&#233;s dans
la zone Enregistreur.</p></li>
<li><b>Dans le champ Nom-paire de valeurs, saisissez le nom-cl&#233; et la valeur
de ce thread pour afficher le r&#233;sutlat d'un thread sp&#233;cifique.</b><p>Le nom cl&#233; est <tt>_ThreadID</tt>. Par exemple :</p><pre>_ThreadID=13</pre><p>Supposons que <tt>com.mycompany.myapp.module2</tt> fonctionne sur plusieurs threads. Pour affiner le visionneur de
journaux et afficher uniquement le r&#233;sultat d'un seul thread, sp&#233;cifiez le journal
de ce module dans le champ Enregistreur personnalis&#233;, puis sp&#233;cifiez l'ID thread.</p></li>
<li><b>Dans la liste d&#233;roulante Affichage, s&#233;lectionnez une valeur dans la liste d&#233;roulante
pour afficher le nombre de messages &#224; la fois.</b><p>Le nombre de messages affich&#233;s par d&#233;faut est de 40. Les autres
choix sont 100, 250 et 1000.</p><p>Pour afficher les suivis de pile, d&#233;s&#233;lectionnez la case &#171; Tronquer les
messages trop longs &#187;. Par d&#233;faut, les suivis de pile n'apparaissent pas
dans le visionneur. Pour les afficher, cliquez sur le lien <tt>(d&#233;tails)</tt> pour
un message.</p></li>
<li><b>Cliquez sur Recherche &#233;l&#233;mentaire pour masquer la zone Options avanc&#233;es.</b></li></ol></li>
<li><b>Dans la zone R&#233;sultats de la recherche, vous pouvez personnaliser l'affichage des
messages.</b><p>La zone R&#233;sultats de la recherche affiche les 40 derni&#232;res entr&#233;es dans
le journal du serveur, en fonction des param&#232;tres sp&#233;cifi&#233;s aux pages Param&#232;tres
de journalisation et Niveaux de journalisation.</p><ul>
<li><b>Cliquez sur les fl&#232;ches des colonnes pour trier les messages diff&#233;remment.</b></li>
<li><b>Cliquez sur le lien intitul&#233; <tt>(d&#233;tails)</tt> pour afficher la version format&#233;e d'un
message.</b><p>La fen&#234;tre D&#233;tails de l'entr&#233;e de journal s'affiche avec une version format&#233;e
du message.</p></li>
<li><b>Cliquez sur les boutons situ&#233;s en haut et en bas du tableau
pour afficher les entr&#233;es ant&#233;rieures ou post&#233;rieures du fichier journal.</b></li></ul></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-eelogging.html">Configurer les param&#232;tres g&#233;n&#233;raux de journalisation</a></p></li>
<li><p><a href="task-eelogginglevels.html">Configurer les niveaux de journalisation</a></p></li>
<li><p><a href="task-generaltab.html">Pour afficher des Informations g&#233;n&#233;rales sur le Enterprise Server</a></p></li>
<li><p><a href="task-setadvanceappconfig.html">Pour d&#233;finir la configuration avanc&#233;e des applications</a></p></li>
<li><p><a href="task-setadvancedomainattributes.html">D&#233;finir les attributs avanc&#233;s du domaine</a></p></li>
<li><p><a href="task-setadminpassword.html">Pour changer le mot de passe administrateur</a></p></li>
<li><p><a href="task-systemproperties.html">Pour g&#233;rer les propri&#233;t&#233;s syst&#232;me</a></p></li>
<li><p><a href="task-appmonitoringdata.html">Pour afficher les donn&#233;es de contr&#244;le des applications</a></p></li>
<li><p><a href="task-servermonitoringdata.html">Pour afficher les donn&#233;es de contr&#244;le des serveurs</a></p></li></ul>

