<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-auditmodulenew"></a><h4>Cr&#233;er un module d'audit</h4><p>Les modules d'audit contr&#244;lent la mani&#232;re dont le Enterprise Server consigne les
&#233;v&#233;nements importants, comme les erreurs et les br&#232;ches de s&#233;curit&#233;. Le Enterprise
Server consigne tous les &#233;v&#233;nements d'authentification dans des fichiers journaux. Un journal
d'acc&#232;s fournit un suivi s&#233;quentiel des &#233;v&#233;nements d'acc&#232;s du Enterprise Server.</p><p>Enterprise Server fournit un simple module d'audit par d&#233;faut ; pour plus
d'informations, consultez <a href="task-usedefaultauditmod.html">Utiliser le module d'audit par d&#233;faut</a> .</p><ol>
<li><b>Dans l'arborescence de navigation, d&#233;veloppez le n&#339;ud Configuration.</b></li>
<li><b>Sous le n&#339;ud Configuration, d&#233;veloppez le n&#339;ud S&#233;curit&#233;.</b></li>
<li><b>Sous le n&#339;ud Securit&#233;, s&#233;lectionnez le n&#339;ud Modules d'audit.</b><p>La page Modules d'audit s'affiche.</p></li>
<li><b>Sur la page Modules d'audit, cliquez sur Nouveau.</b><p>La page Nouveau module d'audit s'affiche.</p></li>
<li><b>Sur la page Nouveau module d'audit, dans le champ Nom, saisissez le
nom du module d'audit.</b></li>
<li><b>Dans le champ Nom de la classe, saisissez le nom complet de
la classe qui impl&#233;mente ce module.</b><p>Le nom de classe du module d'audit par d&#233;faut est <tt>com.sun.enterprise.security.Audit</tt>.</p></li>
<li>(Facultatif) <b>Dans la section Autres propri&#233;t&#233;s, sp&#233;cifiez d'autres propri&#233;t&#233;s.</b><p>Pour ajouter une propri&#233;t&#233;, cliquez sur le bouton Ajouter propri&#233;t&#233;. Sur la
ligne vide qui appara&#238;t, saisissez le nom de la propri&#233;t&#233; dans le
champ Nom et la valeur de la propri&#233;t&#233; dans le champ Valeur.</p><p>Pour obtenir une description de la propri&#233;t&#233; suppl&#233;mentaire disponible pour les modules
d'audit, consultez <a href="ref-auditmoduleprop.html">Propri&#233;t&#233;s propres aux modules d'audit</a>.</p></li>
<li><b>Cliquez sur OK.</b></li></ol><h6>Voir aussi</h6>
<ul><li><p><a href="task-auditmoduleedit.html">Pour modifier un module d'audit</a></p></li>
<li><p><a href="task-auditmoduledelete.html">Supprimer un module d'audit</a></p></li>
<li><p><a href="task-enabledisableauditmod.html">Activer ou d&#233;sactiver la journalisation d'audit</a></p></li>
<li><p><a href="task-setactiveauditmod.html">D&#233;finir le module d'audit actif</a></p></li>
<li><p><a href="task-usedefaultauditmod.html">Utiliser le module d'audit par d&#233;faut</a></p></li></ul>

