<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-configmsgsecproviders"></a><h4>Configurer les utilitaires du Enterprise Server pour permettre l'utilisation par des fournisseurs de s&#233;curit&#233; des messages</h4><ol>
<li><b>Si vous utilisez un jeton de nom d'utilisateur, configurez une base de
donn&#233;es utilisateur, si n&#233;cessaire.</b><p>Si vous utilisez un jeton nom d'utilisateur/mot de passe, configurez d'abord un
domaine appropri&#233; et une base de donn&#233;es utilisateur pour le domaine.</p><p>Pour savoir comment configurer une base de donn&#233;es utilisateur, reportez-vous &#224; la
rubrique <a href="task-realmedit.html">Modifier un domaine</a>.</p></li>
<li><b>G&#233;rez les certificats et les cl&#233;s priv&#233;es, si n&#233;cessaire.</b></li></ol><h6>&#201;tapes suivantes</h6><p>Une fois les utilitaires du Enterprise Server configur&#233;s pour &#234;tre utilis&#233;s par
les fournisseurs de s&#233;curit&#233; des messages, les fournisseurs install&#233;s sur le Enterprise
Server peuvent &#234;tre activ&#233;s conform&#233;ment &#224; la rubrique <a href="task-messagesecurityconfigedit.html">Pour modifier une configuration de s&#233;curit&#233; des messages</a>.</p><h6>Voir aussi</h6>
<ul><li><p><a href="task-messagesecurityconfignew.html">Pour cr&#233;er une configuration de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityconfigedit.html">Pour modifier une configuration de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityconfigdelete.html">Pour supprimer une configuration de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityproviderconfignew.html">Pour cr&#233;er la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigedit.html">Pour modifier la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigdelete.html">Pour supprimer la configuration d'un fournisseur de s&#233;curit&#233; des messages</a></p></li>
<li><p><a href="task-enablemesec4appclients.html">Pour activer la s&#233;curit&#233; des messages pour les clients de l'application</a></p></li></ul>

