<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-connectorresourcenew" name="ref-connectorresourcenew"></a><a id="GHJCA00039" name="GHJCA00039"></a></p>

<h4><a id="sthref60" name="sthref60"></a>&#26032;&#35215;&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#26032;&#35215;&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#26032;&#35215;&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26032;&#35215;&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>JNDI&#21517;</dt>
<dd>
<p>&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#35672;&#21029;&#12377;&#12427;&#19968;&#24847;&#12398;&#21517;&#21069;&#12290;</p>
</dd>
<dt>&#12503;&#12540;&#12523;&#21517;</dt>
<dd>
<p>&#26032;&#35215;&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#25509;&#32154;&#12503;&#12540;&#12523;&#12290;</p>
</dd>
<dt>&#35500;&#26126;</dt>
<dd>
<p>&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;&#12398;&#35500;&#26126;&#12290;</p>
</dd>
<dt>&#12473;&#12486;&#12540;&#12479;&#12473;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;&#12364;&#26377;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;</dt>
<dd>
<p>&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12290;&#20351;&#29992;&#21487;&#33021;&#12394;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12395;&#12424;&#12387;&#12390;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#34920;&#12391;&#25351;&#23450;&#12377;&#12427;&#21517;&#21069;&#12392;&#20516;&#12398;&#12506;&#12450;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12398;&#12505;&#12531;&#12480;&#12540;&#12364;&#23450;&#32681;&#12375;&#12383;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12434;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12479;&#12540;&#12466;&#12483;&#12488;</dt>
<dd>
<p>&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;&#12398;&#12463;&#12521;&#12473;&#12479;&#12362;&#12424;&#12403;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12290;&#24517;&#35201;&#12394;&#12479;&#12540;&#12466;&#12483;&#12488;&#12434;&#12300;&#36984;&#25246;&#12375;&#12383;&#12479;&#12540;&#12466;&#12483;&#12488;&#12301;&#21015;&#12395;&#31227;&#21205;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12414;&#12383;&#12399;&#12300;&#12377;&#12409;&#12390;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#19981;&#35201;&#12394;&#12479;&#12540;&#12466;&#12483;&#12488;&#12434;&#12300;&#20351;&#29992;&#21487;&#33021;&#12394;&#12479;&#12540;&#12466;&#12483;&#12488;&#12301;&#21015;&#12395;&#31227;&#21205;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#38500;&#21435;&#12301;&#12508;&#12479;&#12531;&#12414;&#12383;&#12399;&#12300;&#12377;&#12409;&#12390;&#38500;&#21435;&#12301;&#12508;&#12479;&#12531;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12489;&#12513;&#12452;&#12531;&#20869;&#12395;&#12463;&#12521;&#12473;&#12479;&#12414;&#12383;&#12399;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20316;&#25104;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<a id="sthref61" name="sthref61"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-connectorresourcenew.html">&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-connectorresourceedit.html">&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-connectorresourcesdelete.html">&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref62" name="sthref62"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00019"><code>create-connector-resource</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00158"><code>list-connector-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00071"><code>delete-connector-resource</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
