<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-connectorconnectionpooladvance" name="ref-connectorconnectionpooladvance"></a></p>

<h4><a id="sthref78" name="sthref78"></a>&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#35443;&#32048;&#23646;&#24615;&#12398;&#32232;&#38598;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#35443;&#32048;&#35373;&#23450;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#35443;&#32048;&#23646;&#24615;&#12398;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#35443;&#32048;&#23646;&#24615;&#12398;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12489;</dt>
<dd>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12354;&#12427;&#35373;&#23450;&#12434;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12395;&#24489;&#20803;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12394;&#12356;&#35373;&#23450;&#12399;&#22793;&#26356;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#12391;1&#22238;&#26908;&#35388;</dt>
<dd>
<p>&#25509;&#32154;&#12434;&#26908;&#35388;&#12377;&#12427;&#12383;&#12417;&#12398;&#36899;&#32154;&#12375;&#12383;&#12522;&#12463;&#12456;&#12473;&#12488;&#12398;&#26178;&#38291;&#38291;&#38548;&#12434;&#31186;&#21336;&#20301;&#12391;&#19968;&#24230;&#12398;&#12415;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;0&#12391;&#12377;&#12290;&#12371;&#12398;&#23646;&#24615;&#12364;&#28961;&#21177;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12522;&#12540;&#12463;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;</dt>
<dd>
<p>&#25509;&#32154;&#12503;&#12540;&#12523;&#20869;&#12398;&#25509;&#32154;&#12522;&#12540;&#12463;&#12434;&#36861;&#36321;&#12377;&#12427;&#26178;&#38291;(&#31186;)&#12290;0&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#25509;&#32154;&#12522;&#12540;&#12463;&#12398;&#30435;&#35222;&#12364;&#28961;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;0&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12522;&#12540;&#12463;&#20877;&#35201;&#27714;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12522;&#12540;&#12463;&#25509;&#32154;&#12398;&#30435;&#35222;&#12364;&#23436;&#20102;&#12375;&#12383;&#24460;&#12391;&#12289;&#12522;&#12540;&#12463;&#12375;&#12383;&#25509;&#32154;&#12364;&#12503;&#12540;&#12523;&#12395;&#24489;&#20803;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#20316;&#25104;&#20877;&#35430;&#34892;&#22238;&#25968;</dt>
<dd>
<p>&#26032;&#35215;&#25509;&#32154;&#12398;&#20316;&#25104;&#12395;&#22833;&#25943;&#12375;&#12383;&#22580;&#21512;&#12395;&#34892;&#12431;&#12428;&#12427;&#35430;&#34892;&#12398;&#22238;&#25968;&#12290;0&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#25509;&#32154;&#12398;&#20316;&#25104;&#12399;&#20877;&#35430;&#34892;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;0&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#20877;&#35430;&#34892;&#38291;&#38548;</dt>
<dd>
<p>&#25509;&#32154;&#20316;&#25104;&#12398;&#35430;&#34892;&#12398;&#38291;&#38548;(&#31186;&#21336;&#20301;)&#12290;&#12371;&#12398;&#23646;&#24615;&#12399;&#12289;&#12300;&#20316;&#25104;&#20877;&#35430;&#34892;&#22238;&#25968;&#12301;&#12364;1&#20197;&#19978;&#12398;&#22580;&#21512;&#12395;&#12398;&#12415;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;10&#31186;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12503;&#12540;&#12523;</dt>
<dd>
<p>&#12503;&#12540;&#12523;&#12398;&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#20351;&#29992;&#26178;&#12395;&#12398;&#12415;&#38306;&#36899;&#20184;&#12369;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#25509;&#32154;&#12399;&#25805;&#20316;&#12364;&#23455;&#34892;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;&#12398;&#12415;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12414;&#12377;&#12290;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12364;&#23436;&#20102;&#12375;&#12390;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12539;&#12513;&#12477;&#12483;&#12489;&#12364;&#32066;&#20102;&#12375;&#12383;&#12392;&#12365;&#12395;&#38306;&#36899;&#20184;&#12369;&#12364;&#35299;&#38500;&#12373;&#12428;&#12427;&#12383;&#12417;&#12289;&#29289;&#29702;&#30340;&#12394;&#25509;&#32154;&#12434;&#20877;&#21033;&#29992;&#12375;&#12420;&#12377;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#20351;&#29992;&#26178;&#12395;&#12398;&#12415;&#25509;&#32154;&#12434;&#30331;&#37682;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12522;&#12477;&#12540;&#12473;&#12399;&#23455;&#38555;&#12395;&#12513;&#12477;&#12483;&#12489;&#12391;&#20351;&#29992;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;&#12398;&#12415;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12395;&#30331;&#37682;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12473;&#12524;&#12483;&#12489;&#12392;&#12398;&#38306;&#36899;&#20184;&#12369;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#25509;&#32154;&#12399;&#12473;&#12524;&#12483;&#12489;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12414;&#12377;&#12290;&#21516;&#12376;&#12473;&#12524;&#12483;&#12489;&#12364;&#25509;&#32154;&#12434;&#24517;&#35201;&#12392;&#12377;&#12427;&#22580;&#21512;&#12289;&#12473;&#12524;&#12483;&#12489;&#12399;&#12377;&#12391;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12390;&#12356;&#12427;&#25509;&#32154;&#12434;&#20877;&#21033;&#29992;&#12391;&#12365;&#12427;&#12383;&#12417;&#12289;&#12503;&#12540;&#12523;&#12363;&#12425;&#25509;&#32154;&#12434;&#21462;&#24471;&#12377;&#12427;&#12383;&#12417;&#12398;&#12458;&#12540;&#12496;&#12540;&#12504;&#12483;&#12489;&#12364;&#30330;&#29983;&#12375;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#25509;&#32154;&#12398;&#29031;&#21512;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12503;&#12540;&#12523;&#12395;&#23550;&#12377;&#12427;&#25509;&#32154;&#12398;&#29031;&#21512;&#12364;&#26377;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12503;&#12540;&#12523;&#20869;&#12398;&#25509;&#32154;&#12364;&#24120;&#12395;&#21516;&#12376;&#31278;&#39006;&#12391;&#12289;&#12503;&#12540;&#12523;&#12363;&#12425;&#36984;&#25246;&#12375;&#12383;&#25509;&#32154;&#12392;&#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12434;&#29031;&#21512;&#12377;&#12427;&#24517;&#35201;&#12364;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#28961;&#21177;&#12395;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#25509;&#32154;&#20351;&#29992;&#25968;&#12398;&#29031;&#21512;</dt>
<dd>
<p>&#25509;&#32154;&#12434;&#12503;&#12540;&#12523;&#12391;&#20877;&#21033;&#29992;&#12377;&#12427;&#22238;&#25968;&#12290;&#25351;&#23450;&#12373;&#12428;&#12383;&#22238;&#25968;&#12384;&#12369;&#20877;&#21033;&#29992;&#12373;&#12428;&#12427;&#12392;&#12289;&#12381;&#12398;&#25509;&#32154;&#12399;&#12463;&#12525;&#12540;&#12474;&#12373;&#12428;&#12414;&#12377;&#12290;0&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12371;&#12398;&#23646;&#24615;&#12399;&#28961;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;0&#12391;&#12377;&#12290;</p>
</dd>
</dl>
<a id="sthref79" name="sthref79"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-connectorconnectionpoolnew.html">&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#35443;&#32048;&#23646;&#24615;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12395;&#23550;&#12377;&#12427;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12395;&#23550;&#12377;&#12427;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12395;&#23550;&#12377;&#12427;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref80" name="sthref80"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00018"><code>create-connector-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00157"><code>list-connector-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00070"><code>delete-connector-connection-pool</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
