<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-connectorresources" name="ref-connectorresources"></a></p>

<h4><a id="sthref57" name="sthref57"></a>&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;&#12392;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;EIS&#12408;&#12398;&#25509;&#32154;&#12434;&#25552;&#20379;&#12377;&#12427;&#12503;&#12525;&#12464;&#12521;&#12512;&#12539;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;</p>
<p>&#12522;&#12477;&#12540;&#12473;&#12372;&#12392;&#12395;&#12289;&#27425;&#12398;&#24773;&#22577;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>JNDI&#21517;</dt>
<dd>
<p>&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#35672;&#21029;&#12377;&#12427;&#19968;&#24847;&#12398;&#21517;&#21069;&#12290;</p>
</dd>
<dt>&#26377;&#21177;</dt>
<dd>
<p>(&#12371;&#12398;&#21015;&#12399;&#12289;&#12489;&#12513;&#12452;&#12531;&#12395;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;<code>server</code>&#12398;&#12415;&#12364;&#23384;&#22312;&#12377;&#12427;&#22580;&#21512;&#12395;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;)</p>
<p>&#12522;&#12477;&#12540;&#12473;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12399;&#12481;&#12455;&#12483;&#12463;&#12510;&#12540;&#12463;&#12289;&#12522;&#12477;&#12540;&#12473;&#12364;&#28961;&#21177;&#12394;&#22580;&#21512;&#12399;X&#12290;</p>
</dd>
<dt>&#12473;&#12486;&#12540;&#12479;&#12473;</dt>
<dd>
<p>(&#12371;&#12398;&#21015;&#12399;&#12289;&#12489;&#12513;&#12452;&#12531;&#20869;&#12395;&#12463;&#12521;&#12473;&#12479;&#12414;&#12383;&#12399;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20316;&#25104;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;)</p>
<p>&#12522;&#12477;&#12540;&#12473;&#12398;&#12479;&#12540;&#12466;&#12483;&#12488;&#12391;&#12354;&#12427;&#12463;&#12521;&#12473;&#12479;&#12392;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#25968;&#12289;&#12362;&#12424;&#12403;&#12381;&#12428;&#12425;&#12398;&#12479;&#12540;&#12466;&#12483;&#12488;&#12398;&#12358;&#12385;&#12289;&#12522;&#12477;&#12540;&#12473;&#12364;&#26377;&#21177;&#21270;&#12373;&#12428;&#12390;&#12356;&#12427;&#25968;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#12300;4&#12479;&#12540;&#12466;&#12483;&#12488;&#12398;2&#12391;&#26377;&#21177;&#12301;&#12399;&#12289;&#12522;&#12477;&#12540;&#12473;&#12364;4&#12388;&#12398;&#12463;&#12521;&#12473;&#12479;&#12392;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#12479;&#12540;&#12466;&#12483;&#12488;&#12392;&#12375;&#12390;&#12362;&#12426;&#12289;&#12381;&#12428;&#12425;4&#12388;&#12398;&#12479;&#12540;&#12466;&#12483;&#12488;&#12398;&#12358;&#12385;&#12289;2&#12388;&#12391;&#26377;&#21177;&#21270;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#25509;&#32154;&#12503;&#12540;&#12523;</dt>
<dd>
<p>&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12383;&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12290;</p>
</dd>
<dt>&#35500;&#26126;</dt>
<dd>
<p>&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;&#12398;&#35500;&#26126;&#12290;</p>
</dd>
</dl>
<p>&#12300;&#12522;&#12477;&#12540;&#12473;&#12301;&#12398;&#34920;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12418;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#26032;&#35215;</dt>
<dd>
<p>&#26032;&#35215;&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
<dt>&#21066;&#38500;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#21066;&#38500;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
<dt>&#26377;&#21177;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
<dt>&#28961;&#21177;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#28961;&#21177;&#12395;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
</dl>
<a id="sthref58" name="sthref58"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-connectorresourcenew.html">&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-connectorresourceedit.html">&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-connectorresourcesdelete.html">&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref59" name="sthref59"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00019"><code>create-connector-resource</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00158"><code>list-connector-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00071"><code>delete-connector-resource</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
