<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-connectionservice" name="ref-connectionservice"></a></p>

<h4><a id="sthref125" name="sthref125"></a>&#12467;&#12493;&#12463;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12434;&#31649;&#29702;&#12377;&#12427;&#12467;&#12493;&#12463;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12398;&#19968;&#33324;&#35373;&#23450;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12467;&#12493;&#12463;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12467;&#12493;&#12463;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12489;</dt>
<dd>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12354;&#12427;&#35373;&#23450;&#12434;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12395;&#24489;&#20803;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12394;&#12356;&#35373;&#23450;&#12399;&#22793;&#26356;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>&#27083;&#25104;&#21517;</dt>
<dd>
<p>&#12371;&#12398;&#12506;&#12540;&#12472;&#12398;&#35373;&#23450;&#12364;&#36969;&#29992;&#12373;&#12428;&#12427;&#27083;&#25104;&#12398;&#21517;&#21069;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#20572;&#27490;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;</dt>
<dd>
<p>GlassFish Server&#12398;&#20572;&#27490;&#20013;&#12395;&#12289;&#12467;&#12493;&#12463;&#12479;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;<code>ResourceAdapter.stop</code>&#12513;&#12477;&#12483;&#12489;&#12364;&#23436;&#20102;&#12377;&#12427;&#12414;&#12391;&#12395;&#24453;&#27231;&#12377;&#12427;&#26368;&#22823;&#26178;&#38291;(&#31186;&#21336;&#20301;)&#12290;&#20572;&#27490;&#12395;&#12363;&#12363;&#12427;&#26178;&#38291;&#12364;&#12371;&#12398;&#20516;&#12434;&#36229;&#12360;&#12427;&#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12399;&#28961;&#35222;&#12373;&#12428;&#12289;GlassFish Server&#12399;&#20572;&#27490;&#12434;&#32153;&#32154;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;30&#31186;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12467;&#12493;&#12463;&#12479;Classloading&#12398;&#12509;&#12522;&#12471;&#12540;</dt>
<dd>
<p>&#12463;&#12521;&#12473;&#12398;&#12525;&#12540;&#12489;&#12395;&#20351;&#29992;&#12377;&#12427;&#12509;&#12522;&#12471;&#12540;&#12290;&#36984;&#25246;&#21487;&#33021;&#12394;&#20516;&#12399;&#27425;&#12398;&#12392;&#12362;&#12426;&#12391;&#12377;:</p>
<dl>
<dt><code>derived</code></dt>
<dd>
<p>&#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12398;&#12522;&#12477;&#12540;&#12473;&#12434;&#21442;&#29031;&#12377;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#24467;&#12387;&#12390;&#12289;&#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12364;&#25552;&#20379;&#12373;&#12428;&#12427;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12509;&#12522;&#12471;&#12540;&#12364;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12377;&#12290;</p>
</dd>
<dt><code>global</code></dt>
<dd>
<p>&#12377;&#12409;&#12390;&#12398;&#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12364;&#12289;&#12377;&#12409;&#12390;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12363;&#12425;&#21442;&#29031;&#21487;&#33021;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<p>&#12371;&#12398;&#12509;&#12522;&#12471;&#12540;&#12399;&#12289;&#12503;&#12522;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#28168;&#12398;JMS&#12471;&#12473;&#12486;&#12512;&#12539;&#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12398;<code>jmsra</code>&#12395;&#12399;&#36969;&#29992;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12399;&#12289;&#24120;&#12395;&#12377;&#12409;&#12390;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12363;&#12425;&#21442;&#29031;&#21487;&#33021;&#12391;&#12377;&#12290;</p>
</dd>
</dl>
<a id="sthref126" name="sthref126"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-connectionservice.html">&#12467;&#12493;&#12463;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="../../../common/en/help/task-appdeployconn.html">&#12467;&#12493;&#12463;&#12479;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref127" name="sthref127"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<p>&#12394;&#12375;&#12290;</p>





<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
