<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-worksecuritymapedit" name="ref-worksecuritymapedit"></a><a id="GHJCA00055" name="GHJCA00055"></a></p>

<h4>&#20316;&#26989;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12434;&#32232;&#38598;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20316;&#26989;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12398;&#35373;&#23450;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#20316;&#26989;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12434;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#20316;&#26989;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12434;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#21517;</dt>
<dd>
<p>&#20316;&#26989;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12398;&#21517;&#21069;&#12290;&#21517;&#21069;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12501;&#12451;&#12540;&#12523;&#12489;&#12391;&#12377;&#12290;&#12300;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#21517;&#12301;&#12395;&#20516;&#12434;&#25351;&#23450;&#12391;&#12365;&#12427;&#12398;&#12399;&#12289;&#26032;&#35215;&#20316;&#26989;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12398;&#20316;&#25104;&#26178;&#12398;&#12415;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12464;&#12523;&#12540;&#12503;</dt>
<dd>
<p>&#12300;&#12464;&#12523;&#12540;&#12503;&#12301;&#12521;&#12472;&#12458;&#12539;&#12508;&#12479;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#21508;&#12496;&#12483;&#12463;&#12456;&#12531;&#12489;EIS&#12518;&#12540;&#12470;&#12540;&#12539;&#12464;&#12523;&#12540;&#12503;&#12392;&#12289;GlassFish Server&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12489;&#12513;&#12452;&#12531;&#12391;&#23450;&#32681;&#12373;&#12428;&#12383;&#23550;&#24540;&#12377;&#12427;&#12518;&#12540;&#12470;&#12540;&#12539;&#12464;&#12523;&#12540;&#12503;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12434;&#12289;&#12486;&#12461;&#12473;&#12488;&#12539;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12459;&#12531;&#12510;&#21306;&#20999;&#12426;&#12522;&#12473;&#12488;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#35079;&#25968;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#20363;:</p>
<pre>
eis-group-1=server-group-1,eis-group-2=server-group-2
</pre></dd>
<dt>&#12503;&#12522;&#12531;&#12471;&#12497;&#12523;</dt>
<dd>
<p>&#12300;&#12503;&#12522;&#12531;&#12471;&#12497;&#12523;&#12301;&#12521;&#12472;&#12458;&#12539;&#12508;&#12479;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#21508;&#12496;&#12483;&#12463;&#12456;&#12531;&#12489;EIS&#12503;&#12522;&#12531;&#12471;&#12497;&#12523;&#12392;&#12289;GlassFish Server&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12489;&#12513;&#12452;&#12531;&#12391;&#23450;&#32681;&#12373;&#12428;&#12383;&#23550;&#24540;&#12377;&#12427;&#12503;&#12522;&#12531;&#12471;&#12497;&#12523;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12434;&#12289;&#12486;&#12461;&#12473;&#12488;&#12539;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12459;&#12531;&#12510;&#21306;&#20999;&#12426;&#12522;&#12473;&#12488;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#35079;&#25968;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#20363;:</p>
<pre>
eis-principal-1=server-principal-1,eis-principal-2=server-principal-2
</pre></dd>
<dt>&#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;</dt>
<dd>
<p>EIS&#12398;&#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12290;</p>
</dd>
<dt>&#35500;&#26126;</dt>
<dd>
<p>&#20316;&#26989;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12398;&#35500;&#26126;&#12290;</p>
</dd>
<dt>&#12473;&#12486;&#12540;&#12479;&#12473;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#20316;&#26989;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12364;&#26377;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<a id="sthref111" name="sthref111"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-worksecuritymapnew.html">&#20316;&#26989;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">&#20316;&#26989;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">&#20316;&#26989;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref112" name="sthref112"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00021"><code>create-connector-work-security-map</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00160"><code>list-connector-work-security-maps</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00073"><code>delete-connector-work-security-map</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00253"><code>update-connector-work-security-map</code>(1)</a></p>
</li>
</ul>




<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
