<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-connectorconnectionpoolproperty" name="ref-connectorconnectionpoolproperty"></a><a id="GHJCA00046" name="GHJCA00046"></a></p>

<h4><a id="sthref78" name="sthref78"></a><a id="sthref79" name="sthref79"></a>&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#32232;&#38598;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;</dt>
<dd>
<p>&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12290;&#20351;&#29992;&#21487;&#33021;&#12394;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12395;&#12424;&#12387;&#12390;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#34920;&#12391;&#25351;&#23450;&#12377;&#12427;&#21517;&#21069;&#12392;&#20516;&#12398;&#12506;&#12450;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12398;&#12505;&#12531;&#12480;&#12540;&#12364;&#23450;&#32681;&#12375;&#12383;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12434;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12434;&#25351;&#23450;&#12375;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#32232;&#38598;&#12364;&#32066;&#20102;&#12375;&#12383;&#12392;&#12365;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#34920;&#12363;&#12425;&#38500;&#21435;&#12373;&#12428;&#12414;&#12377;&#12290;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12434;&#12377;&#12368;&#12395;&#35373;&#23450;&#12379;&#12378;&#12289;&#24460;&#12391;&#35373;&#23450;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#34920;&#20869;&#12395;&#27531;&#12377;&#22580;&#21512;&#12399;&#12289;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#31354;&#12398;&#25324;&#24359;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<pre>
()
</pre></dd>
</dl>
<a id="sthref80" name="sthref80"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-connectorconnectionpoolnew.html">&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#35443;&#32048;&#23646;&#24615;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12395;&#23550;&#12377;&#12427;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12395;&#23550;&#12377;&#12427;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12395;&#23550;&#12377;&#12427;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref81" name="sthref81"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00018"><code>create-connector-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00157"><code>list-connector-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00070"><code>delete-connector-connection-pool</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
