<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-worksecuritymaps" name="ref-worksecuritymaps"></a><a id="GHJCA00053" name="GHJCA00053"></a></p>

<h4><a id="sthref106" name="sthref106"></a><a id="sthref107" name="sthref107"></a>&#20316;&#26989;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12398;&#20316;&#26989;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#20316;&#26989;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12467;&#12493;&#12463;&#12479;&#20316;&#26989;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12399;&#12289;&#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12398;EIS&#12503;&#12522;&#12531;&#12471;&#12497;&#12523;&#12414;&#12383;&#12399;EIS&#12464;&#12523;&#12540;&#12503;&#12364;&#36865;&#20449;&#12375;&#12383;&#20316;&#26989;&#12398;&#12467;&#12540;&#12523;&#20596;&#12450;&#12452;&#12487;&#12531;&#12486;&#12451;&#12486;&#12451;&#12434;&#12289;GlassFish Server&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12489;&#12513;&#12452;&#12531;&#12398;&#36969;&#20999;&#12394;&#12503;&#12522;&#12531;&#12471;&#12497;&#12523;&#12414;&#12383;&#12399;&#12518;&#12540;&#12470;&#12540;&#12539;&#12464;&#12523;&#12540;&#12503;&#12395;&#12510;&#12483;&#12500;&#12531;&#12464;&#12375;&#12414;&#12377;&#12290;1&#12388;&#20197;&#19978;&#12398;&#20316;&#26989;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12434;&#12289;1&#12388;&#12398;&#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12395;&#38306;&#36899;&#20184;&#12369;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12467;&#12493;&#12463;&#12479;&#20316;&#26989;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12398;&#27083;&#25104;&#12391;&#12399;&#12289;&#12527;&#12452;&#12523;&#12489;&#12459;&#12540;&#12489;&#25991;&#23383;&#12392;&#12375;&#12390;&#12450;&#12473;&#12479;&#12522;&#12473;&#12463;(<code>*</code>)&#12434;&#20351;&#29992;&#12375;&#12289;&#12377;&#12409;&#12390;&#12398;&#12518;&#12540;&#12470;&#12540;&#12414;&#12383;&#12399;&#12377;&#12409;&#12390;&#12398;&#12518;&#12540;&#12470;&#12540;&#12539;&#12464;&#12523;&#12540;&#12503;&#12434;&#31034;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<p>&#20316;&#26989;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12399;&#12289;&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12392;&#12399;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12399;&#12289;&#12469;&#12540;&#12502;&#12524;&#12483;&#12488;&#12414;&#12383;&#12399;EJB&#12398;&#35469;&#35388;&#20013;&#12395;&#21463;&#12369;&#21462;&#12387;&#12383;&#12503;&#12522;&#12531;&#12471;&#12497;&#12523;&#12434;&#12289;EIS&#12391;&#21463;&#35582;&#12373;&#12428;&#12383;&#36039;&#26684;&#35388;&#26126;&#12395;&#12510;&#12483;&#12500;&#12531;&#12464;&#12375;&#12414;&#12377;&#12290;&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a href="ref-connectorsecuritymaps.html">&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>EIS(Enterprise Information System)&#12399;&#12289;&#32068;&#32340;&#12398;&#12487;&#12540;&#12479;&#12434;&#20445;&#25345;&#12377;&#12427;&#12471;&#12473;&#12486;&#12512;&#12391;&#12377;&#12290;&#12513;&#12452;&#12531;&#12501;&#12524;&#12540;&#12512;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12531;&#12464;&#12539;&#12471;&#12473;&#12486;&#12512;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12471;&#12473;&#12486;&#12512;&#12289;&#12414;&#12383;&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12371;&#12428;&#12395;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<p>&#20316;&#26989;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12372;&#12392;&#12395;&#12289;&#27425;&#12398;&#24773;&#22577;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#21517;&#21069;</dt>
<dd>
<p>&#20316;&#26989;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12398;&#21517;&#21069;&#12290;</p>
</dd>
</dl>
<p>&#12300;&#20316;&#26989;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12418;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#26032;&#35215;</dt>
<dd>
<p>&#26032;&#35215;&#20316;&#26989;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12434;&#20316;&#25104;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
<dt>&#21066;&#38500;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#20316;&#26989;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12434;&#21066;&#38500;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
</dl>
<a id="sthref108" name="sthref108"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-worksecuritymapnew.html">&#20316;&#26989;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">&#20316;&#26989;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">&#20316;&#26989;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref109" name="sthref109"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00021"><code>create-connector-work-security-map</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00160"><code>list-connector-work-security-maps</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00073"><code>delete-connector-work-security-map</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00253"><code>update-connector-work-security-map</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
