<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-connectorconnectionpooledit" name="task-connectorconnectionpooledit"></a></p>

<h4><a id="sthref12" name="sthref12"></a>&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#12522;&#12477;&#12540;&#12473;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12467;&#12493;&#12463;&#12479;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12467;&#12493;&#12463;&#12479;&#12301;&#12494;&#12540;&#12489;&#12391;&#12289;&#12300;&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#32232;&#38598;&#12377;&#12427;&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#21517;&#21069;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#21029;&#12398;&#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#25509;&#32154;&#23450;&#32681;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#25509;&#32154;&#23450;&#32681;&#12398;&#12463;&#12521;&#12473;&#21517;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12522;&#12473;&#12488;&#12395;&#34920;&#31034;&#12373;&#12428;&#12427;&#38917;&#30446;&#12399;&#12289;&#36984;&#25246;&#12375;&#12383;&#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12395;&#12424;&#12387;&#12390;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;&#25509;&#32154;&#23450;&#32681;&#12395;&#12424;&#12387;&#12390;&#12289;&#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12398;<code>connection-definition</code>&#35201;&#32032;&#12364;<code>ra.xml</code>&#12501;&#12449;&#12452;&#12523;&#20869;&#12391;&#35672;&#21029;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;Ping&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#20316;&#25104;&#12414;&#12383;&#12399;&#20877;&#27083;&#25104;&#20013;&#12398;&#25509;&#32154;&#12503;&#12540;&#12523;&#12395;&#23550;&#12375;&#12390;ping&#12434;&#23455;&#34892;&#12375;&#12289;&#35492;&#12387;&#12383;&#23646;&#24615;&#12398;&#20516;&#12434;&#35672;&#21029;&#12362;&#12424;&#12403;&#35686;&#21578;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#35500;&#26126;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#35500;&#26126;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#21021;&#26399;&#12362;&#12424;&#12403;&#26368;&#23567;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12395;&#21547;&#12414;&#12428;&#12427;&#25509;&#32154;&#12398;&#26368;&#23567;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;8&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26368;&#22823;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12395;&#21547;&#12414;&#12428;&#12427;&#25509;&#32154;&#12398;&#26368;&#22823;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;32&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;&#22793;&#26356;&#37327;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12503;&#12540;&#12523;&#12398;&#12450;&#12452;&#12489;&#12523;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12395;&#36948;&#12375;&#12383;&#12392;&#12365;&#12395;&#38500;&#21435;&#12377;&#12427;&#25509;&#32154;&#12398;&#25968;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;2&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12450;&#12452;&#12489;&#12523;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#25509;&#32154;&#12364;&#12503;&#12540;&#12523;&#20869;&#12391;&#12450;&#12452;&#12489;&#12523;&#29366;&#24907;&#12434;&#32173;&#25345;&#12391;&#12365;&#12427;&#26368;&#22823;&#26178;&#38291;&#12434;&#31186;&#21336;&#20301;&#12391;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;300&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26368;&#22823;&#24453;&#27231;&#26178;&#38291;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#25509;&#32154;&#12434;&#12522;&#12463;&#12456;&#12473;&#12488;&#12375;&#12390;&#12356;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#25509;&#32154;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12395;&#12394;&#12427;&#12414;&#12391;&#12398;&#26368;&#22823;&#26178;&#38291;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;60000&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#25509;&#32154;&#26908;&#35388;&#12301;&#12398;&#12300;&#24517;&#38920;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#25509;&#32154;&#26908;&#35388;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#24517;&#38920;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#25552;&#20379;&#12373;&#12428;&#12427;&#21069;&#12395;&#25509;&#32154;&#12364;&#26908;&#35388;&#12373;&#12428;&#12414;&#12377;&#12290;&#12522;&#12477;&#12540;&#12473;&#12398;&#26908;&#35388;&#12395;&#22833;&#25943;&#12375;&#12383;&#22580;&#21512;&#12399;&#12289;&#12522;&#12477;&#12540;&#12473;&#12364;&#30772;&#26820;&#12373;&#12428;&#12289;&#26032;&#12375;&#12356;&#12522;&#12477;&#12540;&#12473;&#12364;&#20316;&#25104;&#12373;&#12428;&#12390;&#36820;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12377;&#12409;&#12390;&#12398;&#38556;&#23475;&#26178;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;1&#12388;&#12398;&#25509;&#32154;&#12391;&#38556;&#23475;&#12364;&#30330;&#29983;&#12375;&#12383;&#12392;&#12365;&#12395;&#12289;GlassFish Server&#12364;&#12503;&#12540;&#12523;&#20869;&#12398;&#12377;&#12409;&#12390;&#12398;&#25509;&#32154;&#12434;&#38281;&#12376;&#12383;&#24460;&#12289;&#12371;&#12428;&#12425;&#12434;&#20877;&#30906;&#31435;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#20351;&#29992;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;&#12398;&#12415;&#20491;&#12293;&#12398;&#25509;&#32154;&#12364;&#20877;&#30906;&#31435;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12469;&#12509;&#12540;&#12488;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12469;&#12509;&#12540;&#12488;&#12398;&#12479;&#12452;&#12503;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#36984;&#25246;&#12375;&#12383;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12469;&#12509;&#12540;&#12488;&#12399;&#12289;&#25509;&#32154;&#12503;&#12540;&#12523;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12383;&#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12469;&#12509;&#12540;&#12488;&#12434;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12375;&#12289;&#19979;&#20301;&#20114;&#25563;&#24615;&#12434;&#32173;&#25345;&#12375;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;&#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12395;&#25351;&#23450;&#12375;&#12383;&#12524;&#12505;&#12523;&#12424;&#12426;&#20302;&#12356;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12524;&#12505;&#12523;&#12289;&#12414;&#12383;&#12399;&#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12395;&#25351;&#23450;&#12375;&#12383;&#12524;&#12505;&#12523;&#12392;&#21516;&#12376;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12524;&#12505;&#12523;&#12399;&#12469;&#12509;&#12540;&#12488;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;&#12381;&#12428;&#12424;&#12426;&#39640;&#12356;&#12524;&#12505;&#12523;&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;</p>
<p>&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12391;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>NoTransaction: &#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12399;&#12289;&#12522;&#12477;&#12540;&#12473;&#12539;&#12510;&#12493;&#12540;&#12472;&#12515;&#12398;&#12525;&#12540;&#12459;&#12523;&#12414;&#12383;&#12399;JTA&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#12469;&#12509;&#12540;&#12488;&#12379;&#12378;&#12289;XAResource&#12414;&#12383;&#12399;LocalTransaction&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12434;&#23455;&#35013;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p>LocalTransaction: &#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12399;&#12289;LocalTransaction&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12434;&#23455;&#35013;&#12375;&#12390;&#12525;&#12540;&#12459;&#12523;&#12539;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12525;&#12540;&#12459;&#12523;&#12539;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12399;&#12522;&#12477;&#12540;&#12473;&#12539;&#12510;&#12493;&#12540;&#12472;&#12515;&#12398;&#20869;&#37096;&#12391;&#31649;&#29702;&#12373;&#12428;&#12289;&#22806;&#37096;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12510;&#12493;&#12540;&#12472;&#12515;&#12434;&#24517;&#35201;&#12392;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p>XATransaction: &#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12399;&#12289;LocalTransaction&#12362;&#12424;&#12403;XAResource&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12434;&#23455;&#35013;&#12375;&#12390;&#12289;&#12522;&#12477;&#12540;&#12473;&#12539;&#12510;&#12493;&#12540;&#12472;&#12515;&#12398;&#12525;&#12540;&#12459;&#12523;&#12362;&#12424;&#12403;JTA&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12414;&#12377;&#12290;</p>
<p>XA&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12399;&#12289;&#12522;&#12477;&#12540;&#12473;&#12539;&#12510;&#12493;&#12540;&#12472;&#12515;&#12398;&#22806;&#37096;&#12395;&#12354;&#12427;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12510;&#12493;&#12540;&#12472;&#12515;&#12391;&#31649;&#29702;&#12362;&#12424;&#12403;&#35519;&#25972;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#12501;&#12521;&#12483;&#12471;&#12517;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#12289;&#12503;&#12540;&#12523;&#12363;&#12425;&#12377;&#12409;&#12390;&#12398;&#25509;&#32154;&#12434;&#12501;&#12521;&#12483;&#12471;&#12517;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12501;&#12521;&#12483;&#12471;&#12517;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#26082;&#23384;&#12398;&#25509;&#32154;&#12364;&#30772;&#26820;&#12373;&#12428;&#12414;&#12377;&#12290;&#12503;&#12540;&#12523;&#12391;&#30906;&#31435;&#12373;&#12428;&#12383;&#25509;&#32154;&#12364;&#20877;&#20316;&#25104;&#12373;&#12428;&#12289;&#12503;&#12540;&#12523;&#12364;&#21021;&#26399;&#12362;&#12424;&#12403;&#26368;&#23567;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;&#12395;&#24489;&#20803;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;Ping&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#12289;&#25509;&#32154;&#12503;&#12540;&#12523;&#12364;&#20351;&#29992;&#21487;&#33021;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#12498;&#12531;&#12488;:</b></p>
&#12487;&#12501;&#12457;&#12523;&#12488;&#35373;&#23450;&#12395;&#36820;&#12377;&#12395;&#12399;&#12289;&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12489;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12289;&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;<br />
<hr>

</li>
</ol>
<a id="sthref13" name="sthref13"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-connectorresourcenew.html">&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-connectorresourceedit.html">&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-connectorresourcesdelete.html">&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolnew.html">&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#35443;&#32048;&#23646;&#24615;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12395;&#23550;&#12377;&#12427;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12395;&#23550;&#12377;&#12427;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12395;&#23550;&#12377;&#12427;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">&#12467;&#12493;&#12463;&#12479;&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-setupeisaccess.html">EIS&#12450;&#12463;&#12475;&#12473;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-adminobjectnew.html">&#31649;&#29702;&#23550;&#35937;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-adminobjectedit.html">&#31649;&#29702;&#23550;&#35937;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-administeredobjectresourcedelete.html">&#31649;&#29702;&#23550;&#35937;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-worksecuritymapnew.html">&#20316;&#26989;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">&#20316;&#26989;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">&#20316;&#26989;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12539;&#12510;&#12483;&#12503;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
