<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-ejbgeneralproperties" name="ref-ejbgeneralproperties"></a></p>

<h4>Propiedades Espec&iacute;ficas del Contenedor EJB</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Las siguientes propiedades est&aacute;n disponibles para configurar el contenedor EJB. Para obtener m&aacute;s informaci&oacute;n acerca de las propiedades relacionadas con threads, consulte <a href="http://docs.oracle.com/javase/6/docs/api/java/util/concurrent/ThreadPoolExecutor.html"><code>http://docs.oracle.com/javase/6/docs/api/java/util/concurrent/ThreadPoolExecutor.html</code></a>.</p>
<dl>
<dt><code>thread-core-pool-size</code></dt>
<dd>
<p>Especifica el n&uacute;mero de threads del n&uacute;cleo en el pool de threads del contenedor EJB. El valor por defecto es <code>16</code>.</p>
</dd>
<dt><code>thread-max-pool-size</code></dt>
<dd>
<p>Especifica el n&uacute;mero m&aacute;ximo de threads del pool de threads comunes del contenedor EJB. El valor por defecto es <code>32</code>.</p>
</dd>
<dt><code>thread-queue-capacity</code></dt>
<dd>
<p>Especifica el tama&ntilde;o de la cola del pool de threads, que almacena nuevas solicitudes si se ejecutan m&aacute;s threads que <code>thread-core-pool-size</code>. El valor por defecto es <code>Integer.MAX_VALUE</code>.</p>
</dd>
<dt><code>thread-keep-alive-seconds</code></dt>
<dd>
<p>Especifica el tiempo, en segundos, pasado el cual los threads que superen <code>thread-core-pool-size</code> se terminar&aacute;. El valor por defecto es <code>60</code>.</p>
</dd>
<dt><code>allow-core-thread-timeout</code></dt>
<dd>
<p>Si se define en <code>true</code>, todos los threads, incluso los threads de n&uacute;cleo, quedan sujetos a la terminaci&oacute;n despu&eacute;s de <code>thread-keep-alive-seconds</code>. El valor por defecto es <code>false</code>.</p>
</dd>
<dt><code>prestart-all-core-threads</code></dt>
<dd>
<p>Si se define en <code>true</code>, todos los threads del pool de threads comunes del contenedor EJB se inician, con lo que quedan inactivos a la espera de trabajo. Si se define en <code>false</code>, los threads no se inician hasta que llegan nuevas solicitudes. El valor por defecto es <code>false</code>.</p>
</dd>
<dt><code>disable-nonportable-jndi-names</code></dt>
<dd>
<p>Si se define en <code>true</code>, se desactivar&aacute;n los nombres de JNDI espec&iacute;ficos de GlassFish Server para un m&oacute;dulo EJB. El valor por defecto es <code>false</code>.</p>
<p>Puesto que la especificaci&oacute;n EJB 3.1 define nombres de JNDI EJB port&aacute;tiles, no resultan tan necesarios los nombres de JNDI espec&iacute;ficos de GlassFish Server. Por defecto, los nombres de JNDI espec&iacute;ficos de GlassFish Server se aplican autom&aacute;ticamente para permitir la compatibilidad con las versiones anteriores.</p>
</dd>
</dl>




<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
