<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-ejbgeneral" name="ref-ejbgeneral"></a><a id="GHEJL00001" name="GHEJL00001"></a></p>

<h4><a id="sthref5" name="sthref5"></a><a id="sthref6" name="sthref6"></a>Enterprise Java Beans (EJB)</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Enterprise Java Beans (EJB) para configurar los valores del contenedor EJB.</p>
<p>Aparte de la configuraci&oacute;n general de beans de empresa, puede configurar los valores de pool y de cach&eacute;.</p>
<ul>
<li>
<p>La configuraci&oacute;n del pool se aplica s&oacute;lo a los beans de sesi&oacute;n sin estado. Por defecto, el contenedor mantiene un pool de beans de empresa para responder a solicitudes de clientes sin el acierto rendimiento debido al proceso de creaci&oacute;n de beans.</p>
<p>Si una aplicaci&oacute;n que utiliza beans de empresa desplegados tiene problemas de rendimiento, dicho rendimiento puede mejorarse creando un pool o aumentando la cantidad de beans mantenidos por un pool ya creado.</p>
</li>
<li>
<p>La configuraci&oacute;n de cach&eacute; se aplica &uacute;nicamente a los beans de sesi&oacute;n con estado. El contenedor mantiene una cach&eacute; de datos de beans de empresa para los beans de empresa m&aacute;s utilizados. De este modo, el contenedor responde con m&aacute;s rapidez a las solicitudes de otros m&oacute;dulos de aplicaciones para datos desde los beans de empresa.</p>
<p>Los beans de empresa almacenados en cach&eacute; tienen uno de los tres estados siguientes: activo, inactivo y desactivado. Si un bean de empresa est&aacute; activo, significa que los clientes obtienen acceso a &eacute;l. Los datos de un bean de empresa inactivo est&aacute;n en la memoria cach&eacute;, pero no hay clientes que intenten obtener acceso al bean. Los datos de un bean de empresa desactivado se almacenan temporalmente y se vuelven a leer en la memoria cach&eacute; si un cliente solicita el bean.</p>
</li>
</ul>
<p>La p&aacute;gina Enterprise Java Beans (EJB) contiene las opciones siguientes.</p>
<dl>
<dt>Cargar Valores por Defecto</dt>
<dd>
<p>Bot&oacute;n para restaurar configuraci&oacute;n que tiene valores por defecto a sus valores por defecto. Las configuraciones que no tienen valores por defecto no se modifican.</p>
</dd>
<dt>Nombre de Configuraci&oacute;n</dt>
<dd>
<p>Nombre de la configuraci&oacute;n a la que se aplican los valores de esta p&aacute;gina. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>Ubicaci&oacute;n del almac&eacute;n de sesi&oacute;n</dt>
<dd>
<p>Directorio en el que las sesiones de beans desactivados y las sesiones de HTTP que siguen activas se almacenan en el sistema de archivos. El valor por defecto es <code>${com.sun.aas.instanceRoot}/session-store</code>.</p>
<p>Los beans desactivados son beans de sesi&oacute;n cuyo estado se ha escrito en un archivo del sistema de archivos. En general, los beans desactivados han estado inactivos durante un per&iacute;odo de tiempo y actualmente los clientes no tienen acceso a ellos. Asimismo, las sesiones HTTP que contin&uacute;an activas son sesiones web individuales cuyo estado se ha escrito en un archivo del sistema de archivos.</p>
</dd>
<dt>Opci&oacute;n de confirmaci&oacute;n</dt>
<dd>
<p>Especifica el modo en que el contenedor almacena en cach&eacute; instancias de beans desactivados entre transacciones. Si selecciona la opci&oacute;n B (valor por defecto), el contenedor almacena en cach&eacute; una instancia lista entre transacciones. Si selecciona la opci&oacute;n C, el contenedor no almacena en cach&eacute; una instancia lista entre transacciones.</p>
</dd>
<dt>Tama&ntilde;o de pool inicial y m&iacute;nimo:</dt>
<dd>
<p>N&uacute;mero m&iacute;nimo de beans que se mantendr&aacute;n en el pool. El valor por defecto es 0.</p>
</dd>
<dt>Tama&ntilde;o de Pool M&aacute;ximo</dt>
<dd>
<p>N&uacute;mero m&aacute;ximo de beans que el contenedor puede mantener en el pool al mismo tiempo. El valor por defecto es 32.</p>
</dd>
<dt>Cantidad de Cambio de Tama&ntilde;o del Pool</dt>
<dd>
<p>N&uacute;mero de beans que se eliminan del pool si est&aacute;n inactivos durante m&aacute;s tiempo del especificado en el campo Timeout de inactividad del pool. El valor debe ser 0 como m&iacute;nimo e inferior al valor de Tama&ntilde;o de pool m&aacute;ximo. El valor por defecto es 8.</p>
</dd>
<dt>Timeout de inactividad de pool</dt>
<dd>
<p>Intervalo de tiempo, en segundos, que un bean del pool puede estar inactivo antes de que se elimine del pool. Una vez transcurrido dicho intervalo de tiempo, el bean se destruye. Un valor de 0 significa que un bean puede permanecer inactivo indefinidamente. El valor por defecto es 600.</p>
</dd>
<dt>Tama&ntilde;o de cach&eacute; m&aacute;ximo</dt>
<dd>
<p>N&uacute;mero m&aacute;ximo de beans que puede haber en la memoria cach&eacute;. Aumente el n&uacute;mero m&aacute;ximo de beans que puede haber en cach&eacute; para eliminar la sobrecarga de la creaci&oacute;n y destrucci&oacute;n de beans. Sin embargo, si la cach&eacute; se aumenta, el servidor consume m&aacute;s memoria y recursos. Aseg&uacute;rese de que el entorno operativo soporte la configuraci&oacute;n de la cach&eacute;. El valor 0 indica una memoria cach&eacute; ilimitada. El valor por defecto es 512.</p>
</dd>
<dt>Cantidad de cambio de tama&ntilde;o de cach&eacute;</dt>
<dd>
<p>N&uacute;mero de beans que se deben desactivar cuando la memoria cach&eacute; est&aacute; llena. Cuando se alcanza el n&uacute;mero m&aacute;ximo de beans en cach&eacute;, el contenedor elimina del almac&eacute;n de copia de seguridad un determinado n&uacute;mero de beans desactivados. Este valor especifica tambi&eacute;n el n&uacute;mero de beans que se deben crear si llega una solicitud y en ese momento el pool no dispone de beans. El valor debe ser mayor que 1 y menor que el valor de Tama&ntilde;o de cach&eacute; m&aacute;ximo. El valor por defecto es 32.</p>
</dd>
<dt>Timeout de eliminaci&oacute;n</dt>
<dd>
<p>N&uacute;mero de segundos despu&eacute;s de los cuales un bean desactivado se elimina del almac&eacute;n de sesi&oacute;n. Un valor de 0 significa que el contenedor no elimina los beans inactivos autom&aacute;ticamente. Si el valor de Timeout de eliminaci&oacute;n es menor o igual al de Timeout de inactividad de cach&eacute;, los beans se eliminan inmediatamente sin desactivarse. El valor por defecto es 5400.</p>
</dd>
<dt>Pol&iacute;tica de selecci&oacute;n de eliminaci&oacute;n</dt>
<dd>
<p>Pol&iacute;tica que el contenedor aplica para eliminar beans de sesi&oacute;n con estado de la cach&eacute;. Las opciones son las siguientes:</p>
<dl>
<dt>No usado recientemente (NRU)</dt>
<dd>
<p>Elimina un bean que no se haya utilizado de forma reciente. &Eacute;ste es el valor por defecto.</p>
</dd>
<dt>Primero en entrar, primero en salir (FIFO)</dt>
<dd>
<p>Elimina el bean m&aacute;s antiguo de la cach&eacute;.</p>
</dd>
<dt>Menos recientemente usado (LRU)</dt>
<dd>
<p>Elimina el bean que se haya utilizado menos recientemente.</p>
</dd>
</dl>
</dd>
<dt>Timeout de inactividad de cach&eacute;</dt>
<dd>
<p>N&uacute;mero m&aacute;ximo de segundos que un bean puede permanecer inactivo en la cach&eacute;. Una vez transcurrido ese tiempo, el contenedor puede desactivar este bean. Un valor de 0 especifica que los beans nunca se convierten en candidatos para la desactivaci&oacute;n. El valor por defecto es 600.</p>
</dd>
<dt>Propiedades Adicionales</dt>
<dd>
<p>Propiedades adicionales del contenedor EJB.</p>
<p>Para obtener una descripci&oacute;n de las propiedades disponibles, consulte <a href="ref-ejbgeneralproperties.html">Propiedades Espec&iacute;ficas del Contenedor EJB</a>.</p>
</dd>
</dl>
<a id="sthref7" name="sthref7"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-ejbgeneral.html">Para configurar los valores de EJB</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbmdbpoolsettings.html">Configurar valores de pool de beans controlados por mensajes</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbtimerservice.html">configurar el servicio de temporizador EJB</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbcontaineravailability.html">Configurar los valores de disponibilidad del contenedor EJB</a></p>
</li>
</ul>
<a id="sthref8" name="sthref8"></a>
<h5>Comandos asadmin Relacionados</h5>
<p>Ninguno.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
