<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-ejbgeneral" name="task-ejbgeneral"></a><a id="GHEJL00002" name="GHEJL00002"></a></p>

<h4><a id="sthref2" name="sthref2"></a><a id="sthref3" name="sthref3"></a>Para configurar los valores de EJB</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, seleccione el nodo Configuraci&oacute;n.</p>
</li>
<li>
<p>Seleccione el nodo Contenedor EJB.</p>
<p>Se abrir&aacute; la p&aacute;gina de Enterprise Java Beans (EJB).</p>
</li>
<li>
<p>En el campo Ubicaci&oacute;n del almacenamiento de sesi&oacute;n, introduzca un valor nuevo para la ubicaci&oacute;n de almacenamiento de la sesi&oacute;n.</p>
<p>Este campo especifica el directorio en el que los beans de sesi&oacute;n con estado pasivo y los estados de punto de control de SFSB persistentes se almacenan en el sistema de archivos. El valor por defecto es <code>${com.sun.aas.instanceRoot}/session-store</code>.</p>
<p>Los beans desactivados son beans de sesi&oacute;n cuyo estado se ha escrito en un archivo del sistema de archivos. En general, los beans desactivados han estado inactivos durante un per&iacute;odo de tiempo y actualmente los clientes no tienen acceso a ellos. Asimismo, los estados de punto de control de SFSB persistentes son SFSB individuales cuyo estado se ha escrito en un archivo del sistema de archivos.</p>
<p>Este valor se aplica a estados de punto de control de SFSB s&oacute;lo si la disponibilidad del contenedor EJB est&aacute; desactivada. Para desactivar la disponibilidad, consulte <a href="../../../ejb/en/help/task-ejbcontaineravailability.html">Para configurar los valores de disponibilidad para el contenedor EJB</a>.</p>
</li>
<li>
<p>Seleccione el bot&oacute;n de radio Opci&oacute;n B u Opci&oacute;n C para definir Opci&oacute;n de confirmaci&oacute;n.</p>
<p>Opci&oacute;n de confirmaci&oacute;n especifica la forma en que el contenedor almacena en cach&eacute; las instancias de beans desactivados entre transacciones.</p>
<ul>
<li>
<p>Si selecciona la opci&oacute;n B (valor por defecto), el contenedor almacena en cach&eacute; una instancia lista entre transacciones.</p>
</li>
<li>
<p>Si selecciona la opci&oacute;n C, el contenedor no almacena en cach&eacute; una instancia lista entre transacciones.</p>
</li>
</ul>
</li>
<li>
<p>En el campo Tama&ntilde;o de pool inicial y m&iacute;nimo, introduzca el n&uacute;mero m&iacute;nimo de beans que se mantendr&aacute;n en el pool.</p>
<p>El valor por defecto es 0.</p>
</li>
<li>
<p>En el campo Tama&ntilde;o de pool m&aacute;ximo, escriba el n&uacute;mero m&aacute;ximo de beans que el contenedor puede mantener en el pool al mismo tiempo.</p>
<p>El valor por defecto es 32.</p>
</li>
<li>
<p>En el campo Cantidad de cambio de tama&ntilde;o del pool, introduzca el n&uacute;mero de beans que se eliminar&aacute;n del pool si permanecen en estado inactivo durante un tiempo superior al especificado en el campo Timeout de inactividad del pool.</p>
<p>El valor debe ser 0 como m&iacute;nimo e inferior al valor de Tama&ntilde;o de pool m&aacute;ximo. El valor por defecto es 8.</p>
</li>
<li>
<p>En el campo Timeout de inactividad del pool, introduzca la cantidad de segundos que un bean del pool puede estar inactivo antes de que se elimine del pool.</p>
<p>Una vez transcurrido dicho intervalo de tiempo, el bean se destruye. Un valor de 0 significa que un bean puede permanecer inactivo indefinidamente. El valor por defecto es 600.</p>
</li>
<li>
<p>En el campo Tama&ntilde;o de cach&eacute; m&aacute;ximo, introduzca el n&uacute;mero m&aacute;ximo de beans que se mantendr&aacute;n en la cach&eacute;.</p>
<p>Aumente el n&uacute;mero m&aacute;ximo de beans que puede haber en cach&eacute; para eliminar la sobrecarga de la creaci&oacute;n y destrucci&oacute;n de beans. Sin embargo, si la cach&eacute; se aumenta, el servidor consume m&aacute;s memoria y recursos. Aseg&uacute;rese de que el entorno operativo soporte la configuraci&oacute;n de la cach&eacute;. El valor 0 indica una memoria cach&eacute; ilimitada. El valor por defecto es 512.</p>
</li>
<li>
<p>En el campo Cantidad de cambio de tama&ntilde;o de cach&eacute;, introduzca el n&uacute;mero de beans que se deben desactivar cuando la cach&eacute; est&eacute; llena.</p>
<p>Cuando se alcanza el n&uacute;mero m&aacute;ximo de beans en cach&eacute;, el contenedor elimina del almac&eacute;n de copia de seguridad un determinado n&uacute;mero de beans desactivados. Este valor especifica tambi&eacute;n el n&uacute;mero de beans que se deben crear si llega una solicitud y en ese momento el pool no dispone de beans. El valor debe ser mayor que 1 y menor que el valor de Tama&ntilde;o de cach&eacute; m&aacute;ximo. El valor por defecto es 32.</p>
</li>
<li>
<p>En el campo Timeout de eliminaci&oacute;n, introduzca el n&uacute;mero de segundos despu&eacute;s de los cuales un bean desactivado se elimina del almac&eacute;n de la sesi&oacute;n.</p>
<p>Un valor de 0 significa que el contenedor no elimina los beans inactivos autom&aacute;ticamente. Si el valor de Timeout de eliminaci&oacute;n es menor o igual al de Timeout de inactividad de cach&eacute;, los beans se eliminan inmediatamente sin desactivarse. El valor por defecto es 5400.</p>
</li>
<li>
<p>En la lista desplegable Pol&iacute;tica de selecci&oacute;n de eliminaci&oacute;n, seleccione la pol&iacute;tica que el contenedor utiliza para eliminar beans de sesi&oacute;n con estado de la cach&eacute;.</p>
<p>Las opciones son las siguientes:</p>
<dl>
<dt>No usado recientemente (NRU)</dt>
<dd>
<p>(Valor por defecto) Elimina un bean que no se haya utilizado de forma reciente.</p>
</dd>
<dt>Primero en entrar, primero en salir (FIFO)</dt>
<dd>
<p>Elimina el bean m&aacute;s antiguo de la cach&eacute;.</p>
</dd>
<dt>Menos recientemente usado (LRU)</dt>
<dd>
<p>Elimina el bean que se haya utilizado menos recientemente.</p>
</dd>
</dl>
</li>
<li>
<p>En el campo Timeout de inactividad de cach&eacute;, introduzca el n&uacute;mero m&aacute;ximo de segundos que un bean puede permanecer inactivo en la cach&eacute;.</p>
<p>Una vez transcurrido ese tiempo, el contenedor puede desactivar este bean. Un valor de 0 especifica que los beans nunca se convierten en candidatos para la desactivaci&oacute;n. El valor por defecto es 600.</p>
</li>
<li>
<p>En la secci&oacute;n Propiedades Adicionales, especifique las propiedades adicionales.</p>
<p>Para obtener una descripci&oacute;n de las propiedades disponibles, consulte <a href="ref-ejbgeneralproperties.html">Propiedades Espec&iacute;ficas del Contenedor EJB</a>.</p>
<ul>
<li>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, introduzca el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
</li>
<li>
<p>Para modificar una propiedad, edite el campo Valor.</p>
</li>
<li>
<p>Para suprimir una propiedad, active la casilla de control a la izquierda del campo Nombre de la propiedad que est&aacute; suprimiendo y, a continuaci&oacute;n, haga clic en el bot&oacute;n Suprimir Propiedades.</p>
</li>
</ul>
</li>
<li>
<p>Haga clic en Guardar.</p>

<hr>
<p><b>Sugerencia:</b></p>
Para volver a la configuraci&oacute;n por defecto, haga clic en el bot&oacute;n Cargar Valores por Defecto y, a continuaci&oacute;n, en Guardar.
<hr>

</li>
<li>
<p>Reinicie GlassFish Server.</p>
</li>
</ol>
<a id="sthref4" name="sthref4"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="../../../ejb/en/help/task-ejbmdbpoolsettings.html">Configurar valores de pool de beans controlados por mensajes</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbtimerservice.html">configurar el servicio de temporizador EJB</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbcontaineravailability.html">Configurar los valores de disponibilidad del contenedor EJB</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
