<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-orb" name="ref-orb"></a></p>

<h4><a id="sthref14" name="sthref14"></a><a id="sthref15" name="sthref15"></a>ORB</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina ORB para configurar el Object Request Broker.</p>
<p>El ORB proporciona la infraestructura necesaria para identificar y localizar objetos, gestionar las conexiones, enviar datos y solicitar comunicaci&oacute;n. Los clientes remotos de beans de empresa (m&oacute;dulos EJB) se comunican con GlassFish Server mediante ORB.</p>
<p>La p&aacute;gina ORB contiene las siguientes opciones.</p>
<dl>
<dt>Cargar Valores por Defecto</dt>
<dd>
<p>Bot&oacute;n para restaurar configuraci&oacute;n que tiene valores por defecto a sus valores por defecto. Las configuraciones que no tienen valores por defecto no se modifican.</p>
</dd>
<dt>Nombre de Configuraci&oacute;n</dt>
<dd>
<p>Nombre de la configuraci&oacute;n a la que se aplican los valores de esta p&aacute;gina. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>ID de Pool de Threads</dt>
<dd>
<p>Pool de threads que utiliza el ORB. ORB utiliza pools de threads para responder a solicitudes de clientes remotos de beans de empresa y otros clientes que se comunican mediante RMI-IIOP. El pool de threads por defecto para ORB es <code>thread-pool-1</code>, que utiliza valores por defecto apropiados para las solicitudes de RMI/IIOP.</p>
</dd>
<dt>Tama&ntilde;o m&aacute;ximo de fragmentos de mensaje</dt>
<dd>
<p>Tama&ntilde;o m&aacute;ximo para los fragmentos de mensajes IIOP. Los mensajes m&aacute;s grandes que este tama&ntilde;o se fragmentar&aacute;n. El valor por defecto es de 1024 bytes.</p>
</dd>
<dt>Total de conexiones</dt>
<dd>
<p>N&uacute;mero m&aacute;ximo de conexiones entrantes para todos los listeners IIOP. El valor por defecto es 1024.</p>
</dd>
<dt>Autenticaci&oacute;n de cliente IIOP</dt>
<dd>
<p>Si la casilla de control Activado est&aacute; activada, el servidor rechaza las solicitudes no autenticadas e inserta un bit de autenticaci&oacute;n necesaria en las referencias de objetos remotos interoperables (IOR) enviadas a los clientes. La autenticaci&oacute;n de cliente IIOP se puede activar o desactivar. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Propiedades Adicionales</dt>
<dd>
<p>Propiedades adicionales de ORB. GlassFish Server no define ninguna propiedad adicional para ORB.</p>
</dd>
</dl>
<a id="sthref16" name="sthref16"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-orb.html">Para configurar ORB</a></p>
</li>
<li>
<p><a href="task-iioplistenernew.html">Crear un listener IIOP</a></p>
</li>
<li>
<p><a href="task-iioplisteneredit.html">Editar un listener IIOP</a></p>
</li>
<li>
<p><a href="task-editiiopssl.html">Editar configuraci&oacute;n SSL para un listener IIOP seguro</a></p>
</li>
<li>
<p><a href="task-iioplistenerdelete.html">Para suprimir un listener IIOP</a></p>
</li>
</ul>
<a id="sthref17" name="sthref17"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00032"><code>create-iiop-listener</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00169"><code>list-iiop-listeners</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00084"><code>delete-iiop-listener</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00058"><code>create-ssl</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00109"><code>delete-ssl</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
