<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-orb" name="task-orb"></a><a id="GHCOR00006" name="GHCOR00006"></a></p>

<h4><a id="sthref2" name="sthref2"></a><a id="sthref3" name="sthref3"></a>Para configurar ORB</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el componente de &aacute;rbol, ampl&iacute;e el nodo Configuraci&oacute;n.</p>
</li>
<li>
<p>Seleccione la instancia que va a configurar:</p>
<ul>
<li>
<p>Para configurar una instancia determinada, seleccione el nodo de configuraci&oacute;n de la instancia. Por ejemplo, para la instancia por defecto, <code>server</code>, seleccione el nodo <code>server-config</code>.</p>
</li>
<li>
<p>Para definir la configuraci&oacute;n por defecto para instancias futuras que utilicen una copia de <code>default-config</code>, seleccione el nodo <code>default-config</code>.</p>
</li>
</ul>
</li>
<li>
<p>Seleccione el nodo ORB.</p>
<p>Se abrir&aacute; la p&aacute;gina ORB.</p>
</li>
<li>
<p>Seleccione el pool de threads que utilizar&aacute; ORB de la lista desplegable ID de pool de threads.</p>
<p>ORB utiliza pools de threads para responder a solicitudes de clientes remotos de beans de empresa y otros clientes que se comunican mediante RMI-IIOP. El pool de threads por defecto para ORB es <code>thread-pool-1</code>, que utiliza valores por defecto apropiados para las solicitudes de RMI/IIOP.</p>
<p>Consulte <a href="../../../web/en/help/ref-threadpools.html">Pools de threads</a> para obtener m&aacute;s informaci&oacute;n.</p>
</li>
<li>
<p>En la lista desplegable Tama&ntilde;o m&aacute;ximo de fragmentos de mensaje, seleccione el tama&ntilde;o m&aacute;ximo para los fragmentos de mensajes IIOP.</p>
<p>Los mensajes m&aacute;s grandes que este tama&ntilde;o se fragmentar&aacute;n. El valor por defecto es de 1024 bytes.</p>
</li>
<li>
<p>En el campo N&ordm; total de conexiones, defina el n&uacute;mero m&aacute;ximo de conexiones entrantes para los listeners IIOP.</p>
<p>El valor por defecto es 1024.</p>
</li>
<li>
<p>Active la casilla de control de autenticaci&oacute;n necesaria de cliente IIOP para especificar que la autenticaci&oacute;n del cliente IIOP es necesaria.</p>
<p>Si la autenticaci&oacute;n de cliente IIOP est&aacute; activada, el servidor rechazar&aacute; las solicitudes no autenticadas e insertar&aacute; un bit de autenticaci&oacute;n necesaria en las referencias de objetos remotos interoperables (IOR) enviadas a los clientes. Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>En la secci&oacute;n Propiedades adicionales, especifique las propiedades adicionales.</p>
<p>GlassFish Server no define ninguna propiedad adicional para ORB.</p>
<ul>
<li>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, introduzca el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
</li>
<li>
<p>Para modificar una propiedad, edite el campo Valor.</p>
</li>
<li>
<p>Para suprimir una propiedad, active la casilla de control a la izquierda del campo Nombre de la propiedad que est&aacute; suprimiendo y, a continuaci&oacute;n, haga clic en el bot&oacute;n Suprimir Propiedades.</p>
</li>
</ul>
</li>
<li>
<p>Haga clic en Guardar.</p>

<hr>
<p><b>Sugerencia:</b></p>
Para volver a la configuraci&oacute;n por defecto, haga clic en el bot&oacute;n Cargar Valores por Defecto y, a continuaci&oacute;n, en Guardar.
<hr>

</li>
<li>
<p>Reinicie GlassFish Server.</p>
</li>
</ol>
<a id="sthref4" name="sthref4"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-iioplistenernew.html">Crear un listener IIOP</a></p>
</li>
<li>
<p><a href="task-iioplisteneredit.html">Editar un listener IIOP</a></p>
</li>
<li>
<p><a href="task-editiiopssl.html">Editar configuraci&oacute;n SSL para un listener IIOP seguro</a></p>
</li>
<li>
<p><a href="task-iioplistenerdelete.html">Para suprimir un listener IIOP</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
