<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-ldaprealmprop" name="ref-ldaprealmprop"></a><a id="GHCOM00103" name="GHCOM00103"></a></p>

<h4><a id="sthref367" name="sthref367"></a><a id="sthref368" name="sthref368"></a>F&uuml;r die <code>LDAPRealm</code>-Klasse spezifische Eigenschaften</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Folgende Eigenschaften sind f&uuml;r eine LDAP-Realm erforderlich.</p>
<dl>
<dt>JAAS-Kontext</dt>
<dd>
<p>Der JAAS-(Java-Authentifizierungs- und Autorisierungsdienst)-Kontext (die ID f&uuml;r das Anmeldemodul, das f&uuml;r diesen Bereich zu verwenden ist). Der einzige g&uuml;ltige Wert ist <code>solarisRealm</code>.</p>
</dd>
<dt>Verzeichnis</dt>
<dd>
<p>Die LDAP-URL f&uuml;r Ihren Server.</p>
</dd>
<dt>Basis-DN</dt>
<dd>
<p>Der LDAP-Basis-DN (Distinguished Name) f&uuml;r den Speicherort von Benutzerdaten. Dieser Basis-DN kann sich auf jeder beliebigen Ebene oberhalb der Benutzerdaten befinden, da eine Suche in der Baumstruktur durchgef&uuml;hrt wird. Je kleiner der Suchbaum, desto besser die Performance.</p>
</dd>
</dl>
<p>Die folgende optionale Eigenschaft ist f&uuml;r eine LDAP-Realm verf&uuml;gbar.</p>
<dl>
<dt>Gruppen zuweisen</dt>
<dd>
<p>Eine durch Komma getrennte Liste mit Gruppennamen. Alle Clients, die &uuml;ber g&uuml;ltige Zertifikate verf&uuml;gen, werden diesen Gruppen zugewiesen, zum Beispiel <code>employee,manager</code> , wobei dies die Namen von Benutzergruppen sind.</p>
</dd>
</dl>
<p>Die folgenden weiteren Eigenschaften sind f&uuml;r eine LDAP-Realm verf&uuml;gbar.</p>
<dl>
<dt><code>search-filter</code></dt>
<dd>
<p>Der Suchfilter, der verwendet wird, um den Benutzer zu finden. Der Standardwert ist <code>uid=%s</code> (<code>%s</code> blendet den Namen des Gesuchten ein).</p>
</dd>
<dt><code>group-base-dn</code></dt>
<dd>
<p>Der Basis-DN f&uuml;r den Speicherort von Gruppendaten. Standardm&auml;&szlig;ig ist er mit dem Basis-DN-Wert identisch, erforderlichenfalls kann er angepasst werden.</p>
</dd>
<dt><code>group-search-filter</code></dt>
<dd>
<p>Der Suchfilter, der verwendet wird, um Gruppenzugeh&ouml;rigkeiten des Benutzers zu finden. Der Standardwert ist <code>uniquemember=%d</code> (<code>%d</code> blendet den Benutzerelement-DN ein).</p>
</dd>
<dt><code>group-target</code></dt>
<dd>
<p>Der LDAP-Attributname, der Gruppennamenseintr&auml;ge enth&auml;lt. Der Standardwert ist <code>CN</code>.</p>
</dd>
<dt><code>search-bind-dn</code></dt>
<dd>
<p>Ein optionaler DN, der zur Authentifizierung gegen&uuml;ber dem Verzeichnis verwendet wird, um den <code>search-filter</code> aufzurufen. Dies ist nur bei Verzeichnissen erforderlich, die keine anonyme Suche erlauben.</p>
</dd>
<dt><code>search-bind-password</code></dt>
<dd>
<p>Das LDAP-Kennwort f&uuml;r den DN, der in <code>search-bind-dn</code> angegeben ist.</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
