<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-uploaddev" name="ref-uploaddev"></a><a id="GHCOM00077" name="GHCOM00077"></a></p>

<h4><a id="sthref294" name="sthref294"></a><a id="sthref295" name="sthref295"></a><a id="sthref296" name="sthref296"></a><a id="sthref297" name="sthref297"></a><a id="sthref298" name="sthref298"></a><a id="sthref299" name="sthref299"></a><a id="sthref300" name="sthref300"></a><a id="sthref301" name="sthref301"></a><a id="sthref302" name="sthref302"></a><a id="sthref303" name="sthref303"></a><a id="sthref304" name="sthref304"></a><a id="sthref305" name="sthref305"></a>Anwendungen oder Module bereitstellen</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&Uuml;ber die Seite "Anwendungen oder Module bereitstellen" k&ouml;nnen Sie eine Anwendung bereitstellen.</p>
<p>Diese Seite enth&auml;lt die folgenden Optionen f&uuml;r alle Anwendungen. Zus&auml;tzliche Optionen werden erst angezeigt, nachdem Sie das Feld "Verzeichnis" f&uuml;r die Anwendung festgelegt haben.</p>
<dl>
<dt>Verzeichnis</dt>
<dd>
<p>Das Verzeichnis des Archivs f&uuml;r die bereitzustellende Anwendung.</p>
<p>Die folgenden Optionen geben an, von wo aus auf das Archiv zugegriffen werden kann und ob das Archiv eine Datei oder ein Verzeichnis ist.</p>
<dl>
<dt>Gepackte Datei zum Hochladen auf den Server</dt>
<dd>
<p>Das Archiv ist in einer Datei gespeichert, die sich auf dem Clientrechner befindet oder auf die von dort aus zugegriffen werden kann.</p>
<p>Der Clientrechner ist der Host, auf dem Sie die Administrationskonsole &uuml;ber einen Browser anzeigen.</p>
</dd>
<dt>Lokale gepackte Datei oder Verzeichnis, auf die/das von GlassFish Server aus zugegriffen werden kann;</dt>
<dd>
<p>Das Archiv ist eine Datei, die sich auf dem Serverrechner befindet, oder eine nicht gepackte Anwendung in einem entpackten Verzeichnis.</p>
<p>Der Serverrechner ist der Host, der den GlassFish Server Domain Administration Server (DAS) ausf&uuml;hrt.</p>
</dd>
</dl>
</dd>
<dt>Typ</dt>
<dd>
<p>Der Typ der Anwendung. Zur Auswahl stehen:</p>
<ul>
<li>
<p>Webanwendung</p>
</li>
<li>
<p>Unternehmensanwendung</p>
</li>
<li>
<p>Anwendungsclient</p>
</li>
<li>
<p>Connector-Modul</p>
</li>
<li>
<p>EJB-JAR</p>
</li>
<li>
<p>Andere</p>
</li>
</ul>
</dd>
<dt>Ziele</dt>
<dd>
<p>Cluster und Standalone-Instanzen, f&uuml;r die die Anwendung oder das Modul bereitgestellt werden soll. Mithilfe der Schaltfl&auml;chen "Hinzuf&uuml;gen" und "Alle hinzuf&uuml;gen" verschieben Sie die ben&ouml;tigten Ziele in die Spalte "Ausgew&auml;hlte Ziele". Verschieben Sie die nicht ben&ouml;tigten Ziele in die Spalte "Verf&uuml;gbare Ziele" mithilfe der Schaltfl&auml;chen "Entfernen" und "Alle entfernen".</p>
<p>Diese Option wird nur dann angezeigt, wenn in der Domain Cluster oder Standalone-Instanzen erstellt wurden.</p>
</dd>
</dl>
<p>Zus&auml;tzliche Optionen f&uuml;r die verschiedenen Anwendungstypen sind in den folgenden Abschnitten beschrieben.</p>
<ul>
<li>
<p><a href="#ref-webapp-options">Weitere Optionen f&uuml;r eine Webanwendung</a></p>
</li>
<li>
<p><a href="#ref-entapp-options">Weitere Optionen f&uuml;r eine Unternehmensanwendung</a></p>
</li>
<li>
<p><a href="#ref-appclient-options">Weitere Optionen f&uuml;r einen Anwendungsclient</a></p>
</li>
<li>
<p><a href="#ref-connmodule-options">Zus&auml;tzliche Optionen f&uuml;r ein Connector-Modul</a></p>
</li>
<li>
<p><a href="#ref-ejb-options">Weitere Optionen f&uuml;r eine EJB-JAR-Datei</a></p>
</li>
</ul>
<a id="ref-webapp-options" name="ref-webapp-options"></a>
<h5>Weitere Optionen f&uuml;r eine Webanwendung</h5>
<p>Wenn der Anwendungstyp eine Webanwendung ist, werden die folgenden Optionen angezeigt.</p>
<dl>
<dt>Context Root</dt>
<dd>
<p>Der Pfad zu der Anwendung. In der URL der Webanwendung folgt Context Root unmittelbar auf die Portnummer (<code>http://</code><i>host</i><code>:</code><i>port</i><code>/</code><i>context-root</i><code>/...</code>). Context Root muss mit einem Schr&auml;gstrich beginnen, Beispiel: <code>/hello</code>.</p>
</dd>
<dt>Anwendungsname</dt>
<dd>
<p>Der Name der Anwendung.</p>
<p>Der Name kann eine optionale Versions-ID enthalten, die dem Namen folgt und von diesem durch einen Doppelpunkt (<code>:</code>) getrennt ist. Die Versions-ID muss mit einem Buchstaben oder einer Zahl beginnen. Er kann alphanumerische Zeichen sowie Unterstriche (<code>_</code>), Bindestriche (<code>-</code>) und Punkte (<code>.</code>) enthalten. Weitere Informationen zu Modul- und Anwendungsversionen finden Sie unter <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> im <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt>Virtuelle Server</dt>
<dd>
<p>Die mit dieser Anwendung verbundenen virtuellen Server.</p>
<p>Die Option "Virtuelle Server" wird angezeigt, wenn nur die Standardserverinstanz <code>server</code> vorhanden ist. Wenn Cluster oder andere Standalone-Serverinstanzen vorhanden sind, k&ouml;nnen Sie nach dem Deployment virtuelle Server ausw&auml;hlen. W&auml;hlen Sie auf der Seite "Anwendung bearbeiten" die Registerkarte "Ziel" und anschlie&szlig;end "Virtuelle Server verwalten" f&uuml;r das gew&uuml;nschte Ziel.</p>
</dd>
<dt>Status</dt>
<dd>
<p>Wenn diese Option ausgew&auml;hlt wird, wird die Anwendung aktiviert. Diese Option ist standardm&auml;&szlig;ig aktiviert.</p>
</dd>
<dt>Verf&uuml;gbarkeit</dt>
<dd>
<p>Wenn dieses Kontrollk&auml;stchen aktiviert ist, wird die Hochverf&uuml;gbarkeit f&uuml;r Websessions und f&uuml;r die Stateful Session-Bean (SFSB)-Fixpunktroutine und m&ouml;glicherweise die Passivierung aktiviert. Ist der Wert auf "False" (Standardwert) gesetzt, werden alle Websession-Speichervorg&auml;nge und SFSB-Checkpoints f&uuml;r die angegebene Anwendung, Webanwendung oder das EJB-Modul deaktiviert. Ist der Wert auf "True" gesetzt, wird die angegebene Anwendung oder das Modul f&uuml;r Hochverf&uuml;gbarkeit aktiviert. Setzen Sie diese Option nur dann auf "True", wenn die Hochverf&uuml;gbarkeit auf einer h&ouml;heren Ebene konfiguriert und aktiviert ist, beispielsweise auf Server- und Containerebene.</p>
<p>Diese Option wird angezeigt, wenn neben der standardm&auml;&szlig;igen Serverinstanz (<code>server</code>) Cluster oder eigenst&auml;ndige Serverinstanzen vorhanden sind.</p>
</dd>
<dt>JSPs vorkompilieren</dt>
<dd>
<p>Wenn Sie diese Option aktivieren, werden JavaServer Pages-(JSP-)Dateien vorkompiliert. Wenn Sie diese Option deaktivieren, werden die JSP-Dateien beim ersten Zugriff zur Laufzeit kompiliert. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>Verifier ausf&uuml;hren</dt>
<dd>
<p>Wenn diese Option aktiviert ist, werden Deployment-Deskriptoren vor dem Deployment verifiziert. Wenn die Verifizierung nicht erfolgreich ist, wird das Deployment nicht ausgef&uuml;hrt. Der Verifier &uuml;berpr&uuml;ft Struktur und Content der Deployment-Deskriptoren. Die &Uuml;berpr&uuml;fung von gro&szlig;en Anwendungen ist h&auml;ufig sehr zeitaufwendig. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
<p>Verifier-Packages m&uuml;ssen mithilfe des Updatetools installiert werden. Andernfalls wird eine Warnung protokolliert und diese Option wird ignoriert.</p>
</dd>
<dt>Erneutes Deployment erzwingen</dt>
<dd>
<p>Ist diese Option ausgew&auml;hlt, wird die bereits bereitgestellte Anwendung erneut bereitgestellt. Ist diese Option nicht ausgew&auml;hlt, wird beim Versuch, eine bereits bereitgestellte Anwendung bereitzustellen, eine Fehlermeldung angezeigt. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>Status beibehalten</dt>
<dd>
<p>Diese Option kontrolliert, ob Websessions, SFSB-Instanzen und persistent erstellte EJB-Timer zwischen erneuten Deployments erhalten bleiben.</p>
<p>Diese Option ist standardm&auml;&szlig;ig deaktiviert. Diese Option wird nur bei der standardm&auml;&szlig;igen Serverinstanz (<code>server</code>) unterst&uuml;tzt. Bei anderen Zielen wird sie nicht unterst&uuml;tzt und ignoriert.</p>
<p>&Auml;nderungen, die an einer Anwendung zwischen Deployments vorgenommen werden, verhindern, dass diese Funktion richtig funktioniert. Beispiel: &Auml;ndern Sie die Instanzenvariablen in der SFSB-Bean-Klasse nicht.</p>
<p>Bei Webanwendungen ist dieses Feature nur dann anwendbar, wenn in der Datei <code>glassfish-web-app.xml</code> das Attribut <code>persistence-type</code> des Elements <code>session-manager</code> <code>file</code> lautet.</p>
<p>Bei Stateful-Session-Bean-Instanzen wird der Persistenztyp ohne hohe Verf&uuml;gbarkeit im Server festgelegt (die Option "SFSB-Persistenztyp") und muss auf <code>file</code>, den empfohlenen Standardwert, gesetzt werden.</p>
<p>Kann eine aktive Websession, SFSB-Instanz oder ein EJB-Timer nicht gespeichert oder wiederhergestellt werden, stehen diese <i>nicht</i> zur Verf&uuml;gung, wenn das erneute Deployment abgeschlossen ist. Das erneute Deployment wird jedoch fortgesetzt, und eine Warnmeldung wird aufgezeichnet.</p>
<p>Damit die Daten aktiver Zust&auml;nde erhalten bleiben, werden die Daten von GlassFish Server serialisiert und gespeichert. Zum Wiederherstellen der Daten deserialisiert der Class Loader der erneut bereitgestellten Anwendung die Daten, die zuvor gespeichert wurden.</p>
</dd>
<dt>Anwendungsspezifische Ressourcen beibehalten</dt>
<dd>
<p>Wenn diese Option aktiviert ist, werden f&uuml;r bestimmte Anwendungen definierte Ressourcen gespeichert und w&auml;hrend des erneuten Deployments wiederhergestellt. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>Deployment-Reihenfolge</dt>
<dd>
<p>Die Deployment-Reihenfolge der Anwendung.</p>
<p>Anwendungen mit einer niedrigeren Nummer werden beim Hochfahren des Servers zuerst geladen. Eine Anwendung mit einer Deployment-Reihenfolge von 102 wird vor einer Anwendung mit einer Deployment-Reihenfolge von 110 geladen. Wenn beim Deployment einer Anwendung keine Deployment-Reihenfolge angegeben wird, wird die Standard-Deployment-Reihenfolge von 100 zugewiesen. Wenn zwei Anwendungen dieselbe Deployment-Reihenfolge haben, wird die Anwendung, die zuerst bereitgestellt wurde, zuerst geladen. Die Angabe einer Deployment-Reihenfolge ist sinnvoll, wenn die Anwendung Abh&auml;ngigkeiten hat und in einer bestimmten Reihenfolge geladen werden muss.</p>
</dd>
<dt>Librarys</dt>
<dd>
<p>Eine durch Komma getrennte Liste der JAR-Dateien in der Library, die auf dieses Modul oder diese Anwendung zugeschnitten sind. Die Pfade k&ouml;nnen absolut oder relativ sein. Ein relativer Pfad ist relativ zu domain-dir<code>/lib/applibs</code>. Wenn der Pfad absolut ist, muss der Pfad f&uuml;r den Domain Administration Server (DAS) zug&auml;nglich sein. Dies bedeutet, dass er sich unter domain-dir befinden muss. Die Librarys werden der Anwendung in der Reihenfolge zur Verf&uuml;gung gestellt, in der sie angegeben sind.</p>
</dd>
<dt>Beschreibung</dt>
<dd>
<p>Eine Beschreibung der Anwendung.</p>
</dd>
</dl>
<a id="ref-entapp-options" name="ref-entapp-options"></a>
<h5>Weitere Optionen f&uuml;r eine Unternehmensanwendung</h5>
<p>Falls der Anwendungstyp "Unternehmensanwendung" ist, werden die folgenden Optionen angezeigt.</p>
<dl>
<dt>Anwendungsname</dt>
<dd>
<p>Der Name der Anwendung.</p>
<p>Der Name kann eine optionale Versions-ID enthalten, die dem Namen folgt und von diesem durch einen Doppelpunkt (<code>:</code>) getrennt ist. Die Versions-ID muss mit einem Buchstaben oder einer Zahl beginnen. Er kann alphanumerische Zeichen sowie Unterstriche (<code>_</code>), Bindestriche (<code>-</code>) und Punkte (<code>.</code>) enthalten. Weitere Informationen zu Modul- und Anwendungsversionen finden Sie unter <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> im <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt>Virtuelle Server</dt>
<dd>
<p>Die mit dieser Anwendung verbundenen virtuellen Server.</p>
<p>Die Option "Virtuelle Server" wird angezeigt, wenn nur die Standardserverinstanz <code>server</code> vorhanden ist. Wenn Cluster oder andere Standalone-Serverinstanzen vorhanden sind, k&ouml;nnen Sie nach dem Deployment virtuelle Server ausw&auml;hlen. W&auml;hlen Sie auf der Seite "Anwendung bearbeiten" die Registerkarte "Ziel" und anschlie&szlig;end "Virtuelle Server verwalten" f&uuml;r das gew&uuml;nschte Ziel.</p>
</dd>
<dt>Status</dt>
<dd>
<p>Wenn diese Option ausgew&auml;hlt wird, wird die Anwendung aktiviert. Diese Option ist standardm&auml;&szlig;ig aktiviert.</p>
</dd>
<dt>Verf&uuml;gbarkeit</dt>
<dd>
<p>Wenn dieses Kontrollk&auml;stchen aktiviert ist, wird die Hochverf&uuml;gbarkeit f&uuml;r Websessions und f&uuml;r die Stateful Session-Bean (SFSB)-Fixpunktroutine und m&ouml;glicherweise die Passivierung aktiviert. Ist der Wert auf "False" (Standardwert) gesetzt, werden alle Websession-Speichervorg&auml;nge und SFSB-Checkpoints f&uuml;r die angegebene Anwendung, Webanwendung oder das EJB-Modul deaktiviert. Ist der Wert auf "True" gesetzt, wird die angegebene Anwendung oder das Modul f&uuml;r Hochverf&uuml;gbarkeit aktiviert. Setzen Sie diese Option nur dann auf "True", wenn die Hochverf&uuml;gbarkeit auf einer h&ouml;heren Ebene konfiguriert und aktiviert ist, beispielsweise auf Server- und Containerebene.</p>
<p>Diese Option wird angezeigt, wenn neben der standardm&auml;&szlig;igen Serverinstanz (<code>server</code>) Cluster oder eigenst&auml;ndige Serverinstanzen vorhanden sind.</p>
</dd>
<dt>Java Web Start</dt>
<dd>
<p>Ist diese Option ausgew&auml;hlt, ist der Zugriff auf Java Web Start f&uuml;r ein Anwendungsclientmodul nicht zul&auml;ssig. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>JSPs vorkompilieren</dt>
<dd>
<p>Wenn Sie diese Option aktivieren, werden JavaServer Pages-(JSP-)Dateien vorkompiliert. Wenn Sie diese Option deaktivieren, werden die JSP-Dateien beim ersten Zugriff zur Laufzeit kompiliert. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>Verifier ausf&uuml;hren</dt>
<dd>
<p>Wenn diese Option aktiviert ist, werden Deployment-Deskriptoren vor dem Deployment verifiziert. Wenn die Verifizierung nicht erfolgreich ist, wird das Deployment nicht ausgef&uuml;hrt. Der Verifier &uuml;berpr&uuml;ft Struktur und Content der Deployment-Deskriptoren. Die &Uuml;berpr&uuml;fung von gro&szlig;en Anwendungen ist h&auml;ufig sehr zeitaufwendig. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
<p>Verifier-Packages m&uuml;ssen mithilfe des Updatetools installiert werden. Andernfalls wird eine Warnung protokolliert und diese Option wird ignoriert.</p>
</dd>
<dt>Kompatibilit&auml;t</dt>
<dd>
<p>Wenn diese Option aktiviert ist, werden GlassFish Server v2 JAR-Sichtbarkeitsanforderungen f&uuml;r Anwendungen anstelle der strikteren Java EE 6-Anforderungen verwendet, die in GlassFish Server v3-Versionen einschlie&szlig;lich 4.0 implementiert sind. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
<p>Die Java EE 6-Plattformspezifikation enth&auml;lt striktere Anforderungen als Java EE 5, was die Sichtbarkeit bestimmter JAR-Dateien f&uuml;r verschiedene Module innerhalb einer EAR-Datei angeht. Insbesondere d&uuml;rfen Anwendungsclients keinen Zugriff auf EJB-JAR-Dateien oder andere JAR-Dateien in der EAR-Datei haben, es sei denn, Referenzen verwenden den standardm&auml;&szlig;igen Java SE-Mechanismus (beispielsweise Erweiterungen) oder den Java EE-Library-Verzeichnismechanismus. Wenn dieses Kontrollk&auml;stchen aktiviert wird, werden diese Java EE 6-Beschr&auml;nkungen entfernt.</p>
</dd>
<dt>Erneutes Deployment erzwingen</dt>
<dd>
<p>Ist diese Option ausgew&auml;hlt, wird die bereits bereitgestellte Anwendung erneut bereitgestellt. Ist diese Option nicht ausgew&auml;hlt, wird beim Versuch, eine bereits bereitgestellte Anwendung bereitzustellen, eine Fehlermeldung angezeigt. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>Status beibehalten</dt>
<dd>
<p>Diese Option kontrolliert, ob Websessions, SFSB-Instanzen und persistent erstellte EJB-Timer zwischen erneuten Deployments erhalten bleiben.</p>
<p>Diese Option ist standardm&auml;&szlig;ig deaktiviert. Diese Option wird nur bei der standardm&auml;&szlig;igen Serverinstanz (<code>server</code>) unterst&uuml;tzt. Bei anderen Zielen wird sie nicht unterst&uuml;tzt und ignoriert.</p>
<p>&Auml;nderungen, die an einer Anwendung zwischen Deployments vorgenommen werden, verhindern, dass diese Funktion richtig funktioniert. Beispiel: &Auml;ndern Sie die Instanzenvariablen in der SFSB-Bean-Klasse nicht.</p>
<p>Bei Webanwendungen ist dieses Feature nur dann anwendbar, wenn in der Datei <code>glassfish-web-app.xml</code> das Attribut <code>persistence-type</code> des Elements <code>session-manager</code> <code>file</code> lautet.</p>
<p>Bei Stateful-Session-Bean-Instanzen wird der Persistenztyp ohne hohe Verf&uuml;gbarkeit im Server festgelegt (die Option "SFSB-Persistenztyp") und muss auf <code>file</code>, den empfohlenen Standardwert, gesetzt werden.</p>
<p>Kann eine aktive Websession, SFSB-Instanz oder ein EJB-Timer nicht gespeichert oder wiederhergestellt werden, stehen diese <i>nicht</i> zur Verf&uuml;gung, wenn das erneute Deployment abgeschlossen ist. Das erneute Deployment wird jedoch fortgesetzt, und eine Warnmeldung wird aufgezeichnet.</p>
<p>Damit die Daten aktiver Zust&auml;nde erhalten bleiben, werden die Daten von GlassFish Server serialisiert und gespeichert. Zum Wiederherstellen der Daten deserialisiert der Class Loader der erneut bereitgestellten Anwendung die Daten, die zuvor gespeichert wurden.</p>
</dd>
<dt>Anwendungsspezifische Ressourcen beibehalten</dt>
<dd>
<p>Wenn diese Option aktiviert ist, werden f&uuml;r bestimmte Anwendungen definierte Ressourcen gespeichert und w&auml;hrend des erneuten Deployments wiederhergestellt. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>Deployment-Reihenfolge</dt>
<dd>
<p>Die Deployment-Reihenfolge der Anwendung.</p>
<p>Anwendungen mit einer niedrigeren Nummer werden beim Hochfahren des Servers zuerst geladen. Eine Anwendung mit einer Deployment-Reihenfolge von 102 wird vor einer Anwendung mit einer Deployment-Reihenfolge von 110 geladen. Wenn beim Deployment einer Anwendung keine Deployment-Reihenfolge angegeben wird, wird die Standard-Deployment-Reihenfolge von 100 zugewiesen. Wenn zwei Anwendungen dieselbe Deployment-Reihenfolge haben, wird die Anwendung, die zuerst bereitgestellt wurde, zuerst geladen. Die Angabe einer Deployment-Reihenfolge ist sinnvoll, wenn die Anwendung Abh&auml;ngigkeiten hat und in einer bestimmten Reihenfolge geladen werden muss.</p>
</dd>
<dt>Librarys</dt>
<dd>
<p>Eine durch Kommas getrennte Liste der JAR-Dateien der Library f&uuml;r diese Anwendung. Legt einen absoluten oder relativen Pfad fest. Ein relativer Pfad ist relativ zu domain-dir<code>/lib/applibs</code>. Wenn der Pfad absolut ist, muss der Pfad f&uuml;r den Domain Administration Server (DAS) zug&auml;nglich sein. Dies bedeutet, dass er sich unter domain-dir befinden muss. Die Librarys werden der Anwendung in der Reihenfolge zur Verf&uuml;gung gestellt, in der sie angegeben sind.</p>
</dd>
<dt>Beschreibung</dt>
<dd>
<p>Eine Beschreibung der Anwendung.</p>
</dd>
</dl>
<a id="ref-appclient-options" name="ref-appclient-options"></a>
<h5>Weitere Optionen f&uuml;r einen Anwendungsclient</h5>
<p>Wenn der Anwendungstyp ein Anwendungsclient ist, werden die folgenden Optionen angezeigt.</p>
<dl>
<dt>Anwendungsname</dt>
<dd>
<p>Der Name der Anwendung.</p>
<p>Der Name kann eine optionale Versions-ID enthalten, die dem Namen folgt und von diesem durch einen Doppelpunkt (<code>:</code>) getrennt ist. Die Versions-ID muss mit einem Buchstaben oder einer Zahl beginnen. Er kann alphanumerische Zeichen sowie Unterstriche (<code>_</code>), Bindestriche (<code>-</code>) und Punkte (<code>.</code>) enthalten. Weitere Informationen zu Modul- und Anwendungsversionen finden Sie unter <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> im <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt>Java Web Start</dt>
<dd>
<p>Ist diese Option ausgew&auml;hlt, ist der Zugriff auf Java Web Start f&uuml;r ein Anwendungsclientmodul nicht zul&auml;ssig. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>Verifier ausf&uuml;hren</dt>
<dd>
<p>Wenn diese Option aktiviert ist, werden Deployment-Deskriptoren vor dem Deployment verifiziert. Wenn die Verifizierung nicht erfolgreich ist, wird das Deployment nicht ausgef&uuml;hrt. Der Verifier &uuml;berpr&uuml;ft Struktur und Content der Deployment-Deskriptoren. Die &Uuml;berpr&uuml;fung von gro&szlig;en Anwendungen ist h&auml;ufig sehr zeitaufwendig. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
<p>Verifier-Packages m&uuml;ssen mithilfe des Updatetools installiert werden. Andernfalls wird eine Warnung protokolliert und diese Option wird ignoriert.</p>
</dd>
<dt>Erneutes Deployment erzwingen</dt>
<dd>
<p>Ist diese Option ausgew&auml;hlt, wird die bereits bereitgestellte Anwendung erneut bereitgestellt. Ist diese Option nicht ausgew&auml;hlt, wird beim Versuch, eine bereits bereitgestellte Anwendung bereitzustellen, eine Fehlermeldung angezeigt. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>Deployment-Reihenfolge</dt>
<dd>
<p>Die Deployment-Reihenfolge der Anwendung.</p>
<p>Anwendungen mit einer niedrigeren Nummer werden beim Hochfahren des Servers zuerst geladen. Eine Anwendung mit einer Deployment-Reihenfolge von 102 wird vor einer Anwendung mit einer Deployment-Reihenfolge von 110 geladen. Wenn beim Deployment einer Anwendung keine Deployment-Reihenfolge angegeben wird, wird die Standard-Deployment-Reihenfolge von 100 zugewiesen. Wenn zwei Anwendungen dieselbe Deployment-Reihenfolge haben, wird die Anwendung, die zuerst bereitgestellt wurde, zuerst geladen. Die Angabe einer Deployment-Reihenfolge ist sinnvoll, wenn die Anwendung Abh&auml;ngigkeiten hat und in einer bestimmten Reihenfolge geladen werden muss.</p>
</dd>
<dt>Beschreibung</dt>
<dd>
<p>Eine Beschreibung der Anwendung.</p>
</dd>
</dl>
<a id="ref-connmodule-options" name="ref-connmodule-options"></a>
<h5>Zus&auml;tzliche Optionen f&uuml;r ein Connector-Modul</h5>
<p>Wenn der Anwendungstyp ein Connector-Modul ist, werden die folgenden Optionen angezeigt.</p>
<dl>
<dt>Anwendungsname</dt>
<dd>
<p>Der Name der Anwendung.</p>
<p>Der Name kann eine optionale Versions-ID enthalten, die dem Namen folgt und von diesem durch einen Doppelpunkt (<code>:</code>) getrennt ist. Die Versions-ID muss mit einem Buchstaben oder einer Zahl beginnen. Er kann alphanumerische Zeichen sowie Unterstriche (<code>_</code>), Bindestriche (<code>-</code>) und Punkte (<code>.</code>) enthalten. Weitere Informationen zu Modul- und Anwendungsversionen finden Sie unter <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> im <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt>Status</dt>
<dd>
<p>Wenn diese Option ausgew&auml;hlt wird, wird die Anwendung aktiviert. Diese Option ist standardm&auml;&szlig;ig aktiviert.</p>
</dd>
<dt>Verifier ausf&uuml;hren</dt>
<dd>
<p>Wenn diese Option aktiviert ist, werden Deployment-Deskriptoren vor dem Deployment verifiziert. Wenn die Verifizierung nicht erfolgreich ist, wird das Deployment nicht ausgef&uuml;hrt. Der Verifier &uuml;berpr&uuml;ft Struktur und Content der Deployment-Deskriptoren. Die &Uuml;berpr&uuml;fung von gro&szlig;en Anwendungen ist h&auml;ufig sehr zeitaufwendig. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
<p>Verifier-Packages m&uuml;ssen mithilfe des Updatetools installiert werden. Andernfalls wird eine Warnung protokolliert und diese Option wird ignoriert.</p>
</dd>
<dt>Erneutes Deployment erzwingen</dt>
<dd>
<p>Ist diese Option ausgew&auml;hlt, wird die bereits bereitgestellte Anwendung erneut bereitgestellt. Ist diese Option nicht ausgew&auml;hlt, wird beim Versuch, eine bereits bereitgestellte Anwendung bereitzustellen, eine Fehlermeldung angezeigt. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>Anwendungsspezifische Ressourcen beibehalten</dt>
<dd>
<p>Wenn diese Option aktiviert ist, werden f&uuml;r bestimmte Anwendungen definierte Ressourcen gespeichert und w&auml;hrend des erneuten Deployments wiederhergestellt. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>Deployment-Reihenfolge</dt>
<dd>
<p>Die Deployment-Reihenfolge der Anwendung.</p>
<p>Anwendungen mit einer niedrigeren Nummer werden beim Hochfahren des Servers zuerst geladen. Eine Anwendung mit einer Deployment-Reihenfolge von 102 wird vor einer Anwendung mit einer Deployment-Reihenfolge von 110 geladen. Wenn beim Deployment einer Anwendung keine Deployment-Reihenfolge angegeben wird, wird die Standard-Deployment-Reihenfolge von 100 zugewiesen. Wenn zwei Anwendungen dieselbe Deployment-Reihenfolge haben, wird die Anwendung, die zuerst bereitgestellt wurde, zuerst geladen. Die Angabe einer Deployment-Reihenfolge ist sinnvoll, wenn die Anwendung Abh&auml;ngigkeiten hat und in einer bestimmten Reihenfolge geladen werden muss.</p>
</dd>
<dt>Beschreibung</dt>
<dd>
<p>Eine Beschreibung der Anwendung.</p>
</dd>
</dl>
<a id="ref-ejb-options" name="ref-ejb-options"></a>
<h5>Weitere Optionen f&uuml;r eine EJB-JAR-Datei</h5>
<p>Wenn der Anwendungstyp EJB-JAR ist, werden die folgenden Optionen angezeigt.</p>
<dl>
<dt>Anwendungsname</dt>
<dd>
<p>Der Name der Anwendung.</p>
<p>Der Name kann eine optionale Versions-ID enthalten, die dem Namen folgt und von diesem durch einen Doppelpunkt (<code>:</code>) getrennt ist. Die Versions-ID muss mit einem Buchstaben oder einer Zahl beginnen. Er kann alphanumerische Zeichen sowie Unterstriche (<code>_</code>), Bindestriche (<code>-</code>) und Punkte (<code>.</code>) enthalten. Weitere Informationen zu Modul- und Anwendungsversionen finden Sie unter <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> im <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt>Status</dt>
<dd>
<p>Wenn diese Option ausgew&auml;hlt wird, wird die Anwendung aktiviert. Diese Option ist standardm&auml;&szlig;ig aktiviert.</p>
</dd>
<dt>Verf&uuml;gbarkeit</dt>
<dd>
<p>Wenn dieses Kontrollk&auml;stchen aktiviert ist, wird die Hochverf&uuml;gbarkeit f&uuml;r Websessions und f&uuml;r die Stateful Session-Bean (SFSB)-Fixpunktroutine und m&ouml;glicherweise die Passivierung aktiviert. Ist der Wert auf "False" (Standardwert) gesetzt, werden alle Websession-Speichervorg&auml;nge und SFSB-Checkpoints f&uuml;r die angegebene Anwendung, Webanwendung oder das EJB-Modul deaktiviert. Ist der Wert auf "True" gesetzt, wird die angegebene Anwendung oder das Modul f&uuml;r Hochverf&uuml;gbarkeit aktiviert. Setzen Sie diese Option nur dann auf "True", wenn die Hochverf&uuml;gbarkeit auf einer h&ouml;heren Ebene konfiguriert und aktiviert ist, beispielsweise auf Server- und Containerebene.</p>
<p>Diese Option wird angezeigt, wenn neben der standardm&auml;&szlig;igen Serverinstanz (<code>server</code>) Cluster oder eigenst&auml;ndige Serverinstanzen vorhanden sind.</p>
</dd>
<dt>Verifier ausf&uuml;hren</dt>
<dd>
<p>Wenn diese Option aktiviert ist, werden Deployment-Deskriptoren vor dem Deployment verifiziert. Wenn die Verifizierung nicht erfolgreich ist, wird das Deployment nicht ausgef&uuml;hrt. Der Verifier &uuml;berpr&uuml;ft Struktur und Content der Deployment-Deskriptoren. Die &Uuml;berpr&uuml;fung von gro&szlig;en Anwendungen ist h&auml;ufig sehr zeitaufwendig. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
<p>Verifier-Packages m&uuml;ssen mithilfe des Updatetools installiert werden. Andernfalls wird eine Warnung protokolliert und diese Option wird ignoriert.</p>
</dd>
<dt>Kompatibilit&auml;t</dt>
<dd>
<p>Wenn diese Option aktiviert ist, werden GlassFish Server v2 JAR-Sichtbarkeitsanforderungen f&uuml;r Anwendungen anstelle der strikteren Java EE 6-Anforderungen verwendet, die in GlassFish Server v3-Versionen einschlie&szlig;lich 4.0 implementiert sind. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
<p>Die Java EE 6-Plattformspezifikation enth&auml;lt striktere Anforderungen als Java EE 5, was die Sichtbarkeit bestimmter JAR-Dateien f&uuml;r verschiedene Module innerhalb einer EAR-Datei angeht. Insbesondere d&uuml;rfen Anwendungsclients keinen Zugriff auf EJB-JAR-Dateien oder andere JAR-Dateien in der EAR-Datei haben, es sei denn, Referenzen verwenden den standardm&auml;&szlig;igen Java SE-Mechanismus (beispielsweise Erweiterungen) oder den Java EE-Library-Verzeichnismechanismus. Wenn dieses Kontrollk&auml;stchen aktiviert wird, werden diese Java EE 6-Beschr&auml;nkungen entfernt.</p>
</dd>
<dt>Erneutes Deployment erzwingen</dt>
<dd>
<p>Ist diese Option ausgew&auml;hlt, wird die bereits bereitgestellte Anwendung erneut bereitgestellt. Ist diese Option nicht ausgew&auml;hlt, wird beim Versuch, eine bereits bereitgestellte Anwendung bereitzustellen, eine Fehlermeldung angezeigt. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>Status beibehalten</dt>
<dd>
<p>Diese Option kontrolliert, ob Websessions, SFSB-Instanzen und persistent erstellte EJB-Timer zwischen erneuten Deployments erhalten bleiben.</p>
<p>Diese Option ist standardm&auml;&szlig;ig deaktiviert. Diese Option wird nur bei der standardm&auml;&szlig;igen Serverinstanz (<code>server</code>) unterst&uuml;tzt. Bei anderen Zielen wird sie nicht unterst&uuml;tzt und ignoriert.</p>
<p>&Auml;nderungen, die an einer Anwendung zwischen Deployments vorgenommen werden, verhindern, dass diese Funktion richtig funktioniert. Beispiel: &Auml;ndern Sie die Instanzenvariablen in der SFSB-Bean-Klasse nicht.</p>
<p>Bei Webanwendungen ist dieses Feature nur dann anwendbar, wenn in der Datei <code>glassfish-web-app.xml</code> das Attribut <code>persistence-type</code> des Elements <code>session-manager</code> <code>file</code> lautet.</p>
<p>Bei Stateful-Session-Bean-Instanzen wird der Persistenztyp ohne hohe Verf&uuml;gbarkeit im Server festgelegt (die Option "SFSB-Persistenztyp") und muss auf <code>file</code>, den empfohlenen Standardwert, gesetzt werden.</p>
<p>Kann eine aktive Websession, SFSB-Instanz oder ein EJB-Timer nicht gespeichert oder wiederhergestellt werden, stehen diese <i>nicht</i> zur Verf&uuml;gung, wenn das erneute Deployment abgeschlossen ist. Das erneute Deployment wird jedoch fortgesetzt, und eine Warnmeldung wird aufgezeichnet.</p>
<p>Damit die Daten aktiver Zust&auml;nde erhalten bleiben, werden die Daten von GlassFish Server serialisiert und gespeichert. Zum Wiederherstellen der Daten deserialisiert der Class Loader der erneut bereitgestellten Anwendung die Daten, die zuvor gespeichert wurden.</p>
</dd>
<dt>Anwendungsspezifische Ressourcen beibehalten</dt>
<dd>
<p>Wenn diese Option aktiviert ist, werden f&uuml;r bestimmte Anwendungen definierte Ressourcen gespeichert und w&auml;hrend des erneuten Deployments wiederhergestellt. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>Deployment-Reihenfolge</dt>
<dd>
<p>Die Deployment-Reihenfolge der Anwendung.</p>
<p>Anwendungen mit einer niedrigeren Nummer werden beim Hochfahren des Servers zuerst geladen. Eine Anwendung mit einer Deployment-Reihenfolge von 102 wird vor einer Anwendung mit einer Deployment-Reihenfolge von 110 geladen. Wenn beim Deployment einer Anwendung keine Deployment-Reihenfolge angegeben wird, wird die Standard-Deployment-Reihenfolge von 100 zugewiesen. Wenn zwei Anwendungen dieselbe Deployment-Reihenfolge haben, wird die Anwendung, die zuerst bereitgestellt wurde, zuerst geladen. Die Angabe einer Deployment-Reihenfolge ist sinnvoll, wenn die Anwendung Abh&auml;ngigkeiten hat und in einer bestimmten Reihenfolge geladen werden muss.</p>
</dd>
<dt>Librarys</dt>
<dd>
<p>Eine durch Komma getrennte Liste der JAR-Dateien in der Library, die auf dieses Modul oder diese Anwendung zugeschnitten sind. Legt einen absoluten oder relativen Pfad fest. Ein relativer Pfad ist relativ zu domain-dir<code>/lib/applibs</code>. Wenn der Pfad absolut ist, muss der Pfad f&uuml;r den Domain Administration Server (DAS) zug&auml;nglich sein. Dies bedeutet, dass er sich unter domain-dir befinden muss. Die Librarys werden der Anwendung in der Reihenfolge zur Verf&uuml;gung gestellt, in der sie angegeben sind.</p>
</dd>
<dt>Beschreibung</dt>
<dd>
<p>Eine Beschreibung der Anwendung.</p>
</dd>
</dl>
<a id="sthref306" name="sthref306"></a>
<h5>Weitere Optionen f&uuml;r Anwendungen vom Typ "Andere"</h5>
<p>Wenn der Anwendungstyp "Andere" ist, werden die folgenden Optionen angezeigt.</p>
<dl>
<dt>Anwendungsname</dt>
<dd>
<p>Der Name der Anwendung.</p>
<p>Der Name kann eine optionale Versions-ID enthalten, die dem Namen folgt und von diesem durch einen Doppelpunkt (<code>:</code>) getrennt ist. Die Versions-ID muss mit einem Buchstaben oder einer Zahl beginnen. Er kann alphanumerische Zeichen sowie Unterstriche (<code>_</code>), Bindestriche (<code>-</code>) und Punkte (<code>.</code>) enthalten. Weitere Informationen zu Modul- und Anwendungsversionen finden Sie unter <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> im <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt>Virtuelle Server</dt>
<dd>
<p>Die mit dieser Anwendung verbundenen virtuellen Server.</p>
<p>Die Option "Virtuelle Server" wird angezeigt, wenn nur die Standardserverinstanz <code>server</code> vorhanden ist. Wenn Cluster oder andere Standalone-Serverinstanzen vorhanden sind, k&ouml;nnen Sie nach dem Deployment virtuelle Server ausw&auml;hlen. W&auml;hlen Sie auf der Seite "Anwendung bearbeiten" die Registerkarte "Ziel" und anschlie&szlig;end "Virtuelle Server verwalten" f&uuml;r das gew&uuml;nschte Ziel.</p>
</dd>
<dt>Status</dt>
<dd>
<p>Wenn diese Option ausgew&auml;hlt wird, wird die Anwendung aktiviert. Diese Option ist standardm&auml;&szlig;ig aktiviert.</p>
</dd>
<dt>Verf&uuml;gbarkeit</dt>
<dd>
<p>Wenn dieses Kontrollk&auml;stchen aktiviert ist, wird die Hochverf&uuml;gbarkeit f&uuml;r Websessions und f&uuml;r die Stateful Session-Bean (SFSB)-Fixpunktroutine und m&ouml;glicherweise die Passivierung aktiviert. Ist der Wert auf "False" (Standardwert) gesetzt, werden alle Websession-Speichervorg&auml;nge und SFSB-Checkpoints f&uuml;r die angegebene Anwendung, Webanwendung oder das EJB-Modul deaktiviert. Ist der Wert auf "True" gesetzt, wird die angegebene Anwendung oder das Modul f&uuml;r Hochverf&uuml;gbarkeit aktiviert. Setzen Sie diese Option nur dann auf "True", wenn die Hochverf&uuml;gbarkeit auf einer h&ouml;heren Ebene konfiguriert und aktiviert ist, beispielsweise auf Server- und Containerebene.</p>
<p>Diese Option wird angezeigt, wenn neben der standardm&auml;&szlig;igen Serverinstanz (<code>server</code>) Cluster oder eigenst&auml;ndige Serverinstanzen vorhanden sind.</p>
</dd>
<dt>OSGi-Typ</dt>
<dd>
<p>Wenn diese Option aktiviert ist, wird ein OSGi-/Java-EE-Hybridmodul angegeben. Diese Option wird nur dann angezeigt, wenn der gew&auml;hlte Typ "Andere" ist.</p>
</dd>
<dt>JSPs vorkompilieren</dt>
<dd>
<p>Wenn Sie diese Option aktivieren, werden JavaServer Pages-(JSP-)Dateien vorkompiliert. Wenn Sie diese Option deaktivieren, werden die JSP-Dateien beim ersten Zugriff zur Laufzeit kompiliert. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>Verifier ausf&uuml;hren</dt>
<dd>
<p>Wenn diese Option aktiviert ist, werden Deployment-Deskriptoren vor dem Deployment verifiziert. Wenn die Verifizierung nicht erfolgreich ist, wird das Deployment nicht ausgef&uuml;hrt. Der Verifier &uuml;berpr&uuml;ft Struktur und Content der Deployment-Deskriptoren. Die &Uuml;berpr&uuml;fung von gro&szlig;en Anwendungen ist h&auml;ufig sehr zeitaufwendig. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
<p>Verifier-Packages m&uuml;ssen mithilfe des Updatetools installiert werden. Andernfalls wird eine Warnung protokolliert und diese Option wird ignoriert.</p>
</dd>
<dt>Erneutes Deployment erzwingen</dt>
<dd>
<p>Ist diese Option ausgew&auml;hlt, wird die bereits bereitgestellte Anwendung erneut bereitgestellt. Ist diese Option nicht ausgew&auml;hlt, wird beim Versuch, eine bereits bereitgestellte Anwendung bereitzustellen, eine Fehlermeldung angezeigt. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>Status beibehalten</dt>
<dd>
<p>Diese Option kontrolliert, ob Websessions, SFSB-Instanzen und persistent erstellte EJB-Timer zwischen erneuten Deployments erhalten bleiben.</p>
<p>Diese Option ist standardm&auml;&szlig;ig deaktiviert. Diese Option wird nur bei der standardm&auml;&szlig;igen Serverinstanz (<code>server</code>) unterst&uuml;tzt. Bei anderen Zielen wird sie nicht unterst&uuml;tzt und ignoriert.</p>
<p>&Auml;nderungen, die an einer Anwendung zwischen Deployments vorgenommen werden, verhindern, dass diese Funktion richtig funktioniert. Beispiel: &Auml;ndern Sie die Instanzenvariablen in der SFSB-Bean-Klasse nicht.</p>
<p>Bei Webanwendungen ist dieses Feature nur dann anwendbar, wenn in der Datei <code>glassfish-web-app.xml</code> das Attribut <code>persistence-type</code> des Elements <code>session-manager</code> <code>file</code> lautet.</p>
<p>Bei Stateful-Session-Bean-Instanzen wird der Persistenztyp ohne hohe Verf&uuml;gbarkeit im Server festgelegt (die Option "SFSB-Persistenztyp") und muss auf <code>file</code>, den empfohlenen Standardwert, gesetzt werden.</p>
<p>Kann eine aktive Websession, SFSB-Instanz oder ein EJB-Timer nicht gespeichert oder wiederhergestellt werden, stehen diese <i>nicht</i> zur Verf&uuml;gung, wenn das erneute Deployment abgeschlossen ist. Das erneute Deployment wird jedoch fortgesetzt, und eine Warnmeldung wird aufgezeichnet.</p>
<p>Damit die Daten aktiver Zust&auml;nde erhalten bleiben, werden die Daten von GlassFish Server serialisiert und gespeichert. Zum Wiederherstellen der Daten deserialisiert der Class Loader der erneut bereitgestellten Anwendung die Daten, die zuvor gespeichert wurden.</p>
</dd>
<dt>Deployment-Reihenfolge</dt>
<dd>
<p>Die Deployment-Reihenfolge der Anwendung.</p>
<p>Anwendungen mit einer niedrigeren Nummer werden beim Hochfahren des Servers zuerst geladen. Eine Anwendung mit einer Deployment-Reihenfolge von 102 wird vor einer Anwendung mit einer Deployment-Reihenfolge von 110 geladen. Wenn beim Deployment einer Anwendung keine Deployment-Reihenfolge angegeben wird, wird die Standard-Deployment-Reihenfolge von 100 zugewiesen. Wenn zwei Anwendungen dieselbe Deployment-Reihenfolge haben, wird die Anwendung, die zuerst bereitgestellt wurde, zuerst geladen. Die Angabe einer Deployment-Reihenfolge ist sinnvoll, wenn die Anwendung Abh&auml;ngigkeiten hat und in einer bestimmten Reihenfolge geladen werden muss.</p>
</dd>
<dt>Librarys</dt>
<dd>
<p>Eine durch Komma getrennte Liste der JAR-Dateien in der Library, die auf dieses Modul oder diese Anwendung zugeschnitten sind. Legt einen absoluten oder relativen Pfad fest. Ein relativer Pfad ist relativ zu domain-dir<code>/lib/applibs</code>. Wenn der Pfad absolut ist, muss der Pfad f&uuml;r den Domain Administration Server (DAS) zug&auml;nglich sein. Dies bedeutet, dass er sich unter domain-dir befinden muss. Die Librarys werden der Anwendung in der Reihenfolge zur Verf&uuml;gung gestellt, in der sie angegeben sind.</p>
</dd>
<dt>Beschreibung</dt>
<dd>
<p>Eine Beschreibung der Anwendung.</p>
</dd>
</dl>
<a id="sthref307" name="sthref307"></a>
<h5>Verwandte Aufgaben</h5>
<ul>
<li>
<p><a href="task-applistdeployed.html">So wird eine Liste der bereitgestellten Anwendungen angezeigt</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">So wird eine Webanwendung bereitgestellt</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">So wird eine Unternehmensanwendung bereitgestellt</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">So wird ein Anwendungsclient bereitgestellt</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">So stellen Sie ein Connector-Modul bereit</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">So wird ein EJB-JAR bereitgestellt</a></p>
</li>
<li>
<p><a href="task-appedit.html">So wird eine bereitgestellte Anwendung bearbeitet</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">So werden Deskriptoren einer Anwendung angezeigt</a></p>
</li>
<li>
<p><a href="task-endpoint.html">So werden End Point-Informationen f&uuml;r einen Webservice angezeigt</a></p>
</li>
<li>
<p><a href="task-applaunch.html">So wird eine Anwendung gestartet</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">So wird ein Anwendungsclient gestartet</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">So werden Anwendungsclient-Stubs heruntergeladen</a></p>
</li>
<li>
<p><a href="task-appredeploy.html">So wird eine bereitgestellte Anwendung erneut bereitgestellt</a></p>
</li>
<li>
<p><a href="task-apprestart.html">So wird eine bereitgestellte Anwendung erneut geladen</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">So werden anwendungsspezifische Ressourcen angezeigt</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">So werden anwendungsspezifische Ressourcen ge&auml;ndert</a></p>
</li>
</ul>
<a id="sthref308" name="sthref308"></a>
<h5>Zugeh&ouml;rige asadmin-Befehle</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00114"><code>deploy</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00217"><code>redeploy</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00148"><code>list-applications</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
