<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-messagesecurityconfig" name="ref-messagesecurityconfig"></a></p>

<h4><a id="sthref227" name="sthref227"></a>Nachrichtensicherheitskonfiguration</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Auf der Seite "Nachrichtensicherheitskonfigurationen" k&ouml;nnen Sie die verf&uuml;gbaren Konfigurationen f&uuml;r Nachrichtensicherheitsprovider anzeigen und &auml;ndern.</p>
<p>Um Nachrichtensicherheit zu konfigurieren, ben&ouml;tigen Sie ein grundlegendes Verst&auml;ndnis von Sicherheits- und Webservicekonzepten. Weitere Informationen finden Sie in <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSSCG00037">Chapter 3, <i>Administering Message Security,</i> im <i>Oracle GlassFish Server Security Guide</i></a> und <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSADG00009">Chapter 6, <i>Administering Web Applications,</i> im <i>Oracle GlassFish Server Administration Guide</i></a>.</p>
<p>GlassFish Server implementiert die Nachrichtensicherheit mithilfe von Nachrichtensicherheitsprovidern, die auf SOAP-Verarbeitungsebene integriert sind. Die Nachrichtensicherheitsprovider h&auml;ngen von den Sicherheitsfunktionen von GlassFish Server ab.</p>
<p>F&uuml;r jede Konfiguration werden die folgenden Informationen zur Verf&uuml;gung gestellt.</p>
<dl>
<dt>Authentifizierungslayer</dt>
<dd>
<p>Die Nachrichtenlayer, in der Authentifizierung durchgef&uuml;hrt wird. Standardm&auml;&szlig;ig wird eine SOAP-Konfiguration bereitgestellt. Es ist dar&uuml;ber hinaus m&ouml;glich, eine HttpServlet-Konfiguration bereitzustellen.</p>
</dd>
<dt>Standardprovider</dt>
<dd>
<p>Der Standardserverprovider f&uuml;r diese Konfiguration. Standardm&auml;&szlig;ig ist kein Standardserverprovider konfiguriert.</p>
</dd>
<dt>Standardclientprovider</dt>
<dd>
<p>Der Standardclientprovider f&uuml;r diese Konfiguration. Standardm&auml;&szlig;ig ist kein Standardclientprovider konfiguriert.</p>
</dd>
</dl>
<p>Die Tabelle "Nachrichtensicherheitskonfiguration" enth&auml;lt auch die folgenden Optionen.</p>
<dl>
<dt>Neu</dt>
<dd>
<p>Schaltfl&auml;che zum Erstellen einer neuen Konfiguration.</p>
</dd>
<dt>L&ouml;schen</dt>
<dd>
<p>Schaltfl&auml;che zum L&ouml;schen von mindestens einer ausgew&auml;hlten Konfiguration.</p>
</dd>
</dl>
<a id="GHCOM457" name="GHCOM457"></a>
<h5>Verwandte Aufgaben</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">So werden GlassFish Server-Funktionalit&auml;ten zur Verwendung durch Nachrichtensicherheitsprovider konfiguriert</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">So wird eine Nachrichtensicherheitskonfiguration erstellt</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">So wird eine Nachrichtensicherheitskonfiguration bearbeitet</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">So wird eine Nachrichtensicherheitskonfiguration gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">So wird eine Nachrichtensicherheitsproviderkonfiguration erstellt</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">So wird eine Nachrichtensicherheitsproviderkonfiguration bearbeitet</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">So wird eine Nachrichtensicherheitsproviderkonfiguration gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">So wird die Nachrichtensicherheit f&uuml;r Anwendungsclients aktiviert</a></p>
</li>
</ul>
<a id="GHCOM458" name="GHCOM458"></a>
<h5>Zugeh&ouml;rige asadmin-Befehle</h5>
<p>Kein.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
