<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-editjdbcrealm" name="ref-editjdbcrealm"></a><a id="GHCOM00102" name="GHCOM00102"></a></p>

<h4><a id="sthref365" name="sthref365"></a><a id="sthref366" name="sthref366"></a>F&uuml;r die <code>JDBCRealm</code>-Klasse spezifische Eigenschaften</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Um Ihre Webseiten oder Webanwendungen zu sch&uuml;tzen, k&ouml;nnen Sie die Sicherheit so einstellen, dass nur registrierte Benutzer darauf zugreifen k&ouml;nnen. Dies wird auch als Authentifizierungsfunktionalit&auml;t bezeichnet. Dieser Realm-Typ bezieht das Speichern von Zugangsdaten der Benutzer innerhalb der Datenbank mit ein. GlassFish Server verwendet die Datenbankinformationen und die aktivierte Option f&uuml;r die JDBC-Realm in der Konfigurationsdatei.</p>
<p>Folgende Eigenschaften sind f&uuml;r eine JDBC-Realm erforderlich.</p>
<dl>
<dt>JAAS-Kontext</dt>
<dd>
<p>Der JAAS-(Java-Authentifizierungs- und Autorisierungsdienst)-Kontext (die ID f&uuml;r das Anmeldemodul, das f&uuml;r diesen Bereich zu verwenden ist). Der einzig g&uuml;ltige Wert ist <code>jdbcRealm</code>.</p>
</dd>
<dt>JNDI</dt>
<dd>
<p>Der JNDI-Name f&uuml;r diese Realm. Der Standardwert ist <code>jdbc/security</code>.</p>
</dd>
<dt>Benutzertabelle</dt>
<dd>
<p>Die Tabelle, die eine Liste der autorisierten Benutzer f&uuml;r diese Realm enth&auml;lt. Der Standardwert ist <code>usertable</code>.</p>
</dd>
<dt>Benutzernamenspalte</dt>
<dd>
<p>Name der Spalte mit Liste der Benutzer in der Benutzertabelle. Der Standardwert ist <code>userid</code>.</p>
</dd>
<dt>Kennwortspalte</dt>
<dd>
<p>Name der Spalte mit dem entsprechenden Benutzerpasswort in der Benutzertabelle. Der Standardwert ist <code>password</code>.</p>
</dd>
<dt>Gruppentabelle</dt>
<dd>
<p>Name der Gruppentabelle in der Datenbank. Der Standardwert ist <code>grouptable</code>.</p>
</dd>
<dt>Spalte mit Gruppennamen</dt>
<dd>
<p>Name der Spalte mit Gruppennamen in der Gruppentabelle der Datenbank. Der Standardwert ist <code>groupid</code>.</p>
</dd>
</dl>
<p>Die folgenden optionalen Eigenschaften sind f&uuml;r eine JDBC-Realm verf&uuml;gbar.</p>
<dl>
<dt>Gruppen zuweisen</dt>
<dd>
<p>Eine durch Komma getrennte Liste mit Gruppennamen. Alle Clients, die &uuml;ber g&uuml;ltige Zertifikate verf&uuml;gen, werden diesen Gruppen zugewiesen, zum Beispiel <code>employee,manager</code> , wobei dies die Namen von Benutzergruppen sind.</p>
</dd>
<dt>Datenbankbenutzer</dt>
<dd>
<p>Hier haben Sie die M&ouml;glichkeit, den Datenbankbenutzernamen in der Realm anstelle von <code>jdbc-connection-pool</code> anzugeben. Dadurch wird verhindert, dass andere Anwendungen die Datenbank aufrufen, eine Verbindung erhalten und die Benutzertabelle durchsuchen k&ouml;nnen. Standardm&auml;&szlig;ig wird die <code>jdbc-connection-pool</code>-Konfiguration verwendet.</p>
</dd>
<dt>Datenbankkennwort</dt>
<dd>
<p>Hier haben Sie die M&ouml;glichkeit, das Datenbankkennwort in der Realm anstelle von <code>jdbc-connection-pool</code> anzugeben. Dadurch wird verhindert, dass andere Anwendungen die Datenbank aufrufen, eine Verbindung erhalten und die Benutzertabelle durchsuchen k&ouml;nnen. Standardm&auml;&szlig;ig wird die <code>jdbc-connection-pool</code>-Konfiguration verwendet.</p>
</dd>
<dt>Digest-Algorithmus</dt>
<dd>
<p>(Optional) Gibt den Digest-Algorithmus an. Der Standardwert ist <code>SHA-256</code>. Sie k&ouml;nnen jeden beliebigen Algorithmus verwenden, der von JDK unterst&uuml;tzt wird, oder keinen.</p>

<hr>
<p><b>Hinweis:</b></p>
In Versionen von GlassFish Server vor 4.0 war der Standardalgorithmus <code>MD5</code>. Wenn Sie Anwendungen verwenden, die vom Algorithmus <code>MD5</code> abh&auml;ngen, k&ouml;nnen Sie den Standardwert <code>SHA-25</code> &uuml;berschreiben, indem Sie den Unterbefehl <code>asadmin set</code> verwenden:
<pre>
asadmin&gt; <b>set server.security-service.property.default-digest-algorithm=MD5</b>
</pre>
<p>Sie k&ouml;nnen den Unterbefehl <code>asadmin get</code> verwenden, um zu bestimmen, welcher Unterbefehl aktuell verwendet wird:</p>
<pre>
asadmin&gt; <b>get server.security-service.property.default-digest-algorithm</b>
</pre>
<p>Beachten Sie: Bei einem Upgrade von GlassFish Server v2.<i>x</i> oder v3.0. <i>x</i> auf GlassFish Server 4.0 wird der Standardalgorithmus automatisch auf <code>MD5</code> gesetzt, wenn der Verarbeitungsalgorithmus nicht explizit in der &auml;lteren GlassFish Server-Version festgelegt wurde. Dadurch wird die Abw&auml;rtskompatibilit&auml;t beibehalten.</p>

<hr>

</dd>
<dt>Kennwortverschl&uuml;sselungsalgorithmus</dt>
<dd>
<p>Der Algorithmus zur Verschl&uuml;sselung von Kennw&ouml;rtern, die in der Datenbank gespeichert sind.</p>

<hr>
<p><b>Hinweis:</b></p>
Wenn kein Kennwortverschl&uuml;sselungsalgorithmus angegeben wird, stellt dies ein Sicherheitsrisiko dar.
<hr>

</dd>
<dt>Codierung</dt>
<dd>
<p>Die Codierung. Zul&auml;ssige Werte sind <code>Hex</code> und <code>Base64</code>. Wenn der <code>digest-algorithm</code> angegeben ist, dann ist der Standardwert <code>Hex</code>. Wenn der <code>digest-algorithm</code> nicht angegeben ist, dann ist standardm&auml;&szlig;ig keine Codierung angegeben.</p>
</dd>
<dt>Zeichensatz</dt>
<dd>
<p>Der Zeichensatz f&uuml;r den Digest-Algorithmus.</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
