<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-editfile-adminrealm" name="ref-editfile-adminrealm"></a><a id="GHCOM00100" name="GHCOM00100"></a></p>

<h4><a id="sthref361" name="sthref361"></a><a id="sthref362" name="sthref362"></a>F&uuml;r die <code>FileRealm</code>-Klasse spezifische Eigenschaften</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>F&uuml;r eine <code>file</code>-Realm sind die folgenden Eigenschaften erforderlich.</p>
<dl>
<dt>JAAS-Kontext</dt>
<dd>
<p>Der JAAS-(Java-Authentifizierungs- und Autorisierungsdienst)-Kontext (die ID f&uuml;r das Anmeldemodul, das f&uuml;r diesen Bereich zu verwenden ist). Der einzig g&uuml;ltige Wert ist <code>fileRealm</code>.</p>
</dd>
<dt>Schl&uuml;sseldatei</dt>
<dd>
<p>Vollst&auml;ndiger Pfad und Name der Datei, in der der Server alle Benutzer-, Gruppen- und Passwortinformationen f&uuml;r diese Realm speichert. Der Standardwert ist domain-dir<code>/config/keyfile</code> f&uuml;r die <code>file</code> Realm und domain-dir<code>/config/admin-keyfile</code> f&uuml;r die <code>admin-realm</code>-Realm.</p>
</dd>
</dl>
<p>Die Schl&uuml;sseldatei f&uuml;r die <code>file</code>-Realm ist anf&auml;nglich leer, sodass Benutzer auf der Seite <a href="ref-managefilerealm.html">Dateibenutzer</a> hinzugef&uuml;gt werden m&uuml;ssen, bevor die <code>file</code>-Realm verwendet wird.</p>
<p>Die Schl&uuml;sseldatei f&uuml;r die Realm <code>admin-realm</code> enth&auml;lt anf&auml;nglich den Administratorbenutzernamen, das Administratorkennwort in verschl&uuml;sselter Form sowie die Gruppe, zu der dieser Benutzer geh&ouml;rt (standardm&auml;&szlig;ig <code>asadmin</code>). Weitere Informationen zum Hinzuf&uuml;gen von Benutzern zu der <code>admin-realm</code> finden Sie unter <a href="task-accessadmintools.html">So wird Zugriff auf Administrationstools erteilt</a>.</p>

<hr>
<p><b>Hinweis:</b></p>
Benutzer in der Gruppe <code>asadmin</code> im Bereich <code>admin-realm</code> sind zur Verwendung der Administrationskonsole und der <code>asadmin</code>-Tools berechtigt. F&uuml;gen Sie dieser Gruppe nur Benutzer hinzu, die &uuml;ber Administratorberechtigungen f&uuml;r den Server verf&uuml;gen.
<hr>

<p>Die folgende optionale Eigenschaft ist f&uuml;r eine <code>file</code>-Realm verf&uuml;gbar.</p>
<dl>
<dt>Gruppen zuweisen</dt>
<dd>
<p>Eine durch Komma getrennte Liste mit Gruppennamen. Alle Clients, die &uuml;ber g&uuml;ltige Zertifikate verf&uuml;gen, werden diesen Gruppen zugewiesen, zum Beispiel <code>employee,manager</code> , wobei dies die Namen von Benutzergruppen sind.</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
