<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-applications" name="ref-applications"></a></p>

<h4><a id="sthref158" name="sthref158"></a>Anwendungen</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Die Seite "Anwendungen" zeigt eine Liste von Anwendungen an, die im GlassFish Server eingesetzt werden. Sie k&ouml;nnen die bereits bereitgestellten Anwendungen anzeigen und verwalten, und Sie k&ouml;nnen weitere Anwendungen bereitstellen.</p>
<p>F&uuml;r jede Anwendung werden die folgenden Informationen zur Verf&uuml;gung gestellt.</p>
<dl>
<dt>Name</dt>
<dd>
<p>Der Name der Anwendung.</p>
<p>Der Name kann eine optionale Versions-ID enthalten, die dem Namen folgt und von diesem durch einen Doppelpunkt (<code>:</code>) getrennt ist. Weitere Informationen zu Modul- und Anwendungsversionen finden Sie unter <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> im <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt>Deployment-Reihenfolge</dt>
<dd>
<p>Die Deployment-Reihenfolge der Anwendung.</p>
<p>Anwendungen mit einer niedrigeren Nummer werden beim Hochfahren des Servers zuerst geladen. Eine Anwendung mit einer Deployment-Reihenfolge von 102 wird vor einer Anwendung mit einer Deployment-Reihenfolge von 110 geladen. Wenn beim Deployment einer Anwendung keine Deployment-Reihenfolge angegeben wird, wird die Standard-Deployment-Reihenfolge von 100 zugewiesen. Wenn zwei Anwendungen dieselbe Deployment-Reihenfolge haben, wird die Anwendung, die zuerst bereitgestellt wurde, zuerst geladen. Die Angabe einer Deployment-Reihenfolge ist sinnvoll, wenn die Anwendung Abh&auml;ngigkeiten hat und in einer bestimmten Reihenfolge geladen werden muss.</p>
</dd>
<dt>Aktiviert oder Status</dt>
<dd>
<p>Ein H&auml;kchen, wenn die Anwendung aktiviert ist. Ein X, wenn die Anwendung deaktiviert und nur die standardm&auml;&szlig;ige Serverinstanz <code>server</code> vorhanden ist.</p>
<p>Wenn Cluster oder eigenst&auml;ndige Serverinstanzen vorhanden sind, aktivieren Sie "Aktiviert auf Zielen", um die Ziele anzuzeigen, auf denen die Anwendung bereitgestellt wird.</p>
</dd>
<dt>Engines</dt>
<dd>
<p>Die von der Anwendung verwendeten Containertypen. Es stehen folgende Containertypen zur Verf&uuml;gung:</p>
<ul>
<li>
<p><code>web</code></p>
</li>
<li>
<p><code>webservices</code></p>
</li>
<li>
<p><code>ejb</code></p>
</li>
<li>
<p><code>connector</code></p>
</li>
<li>
<p><code>appclient</code></p>
</li>
<li>
<p><code>weld</code> (der Container f&uuml;r Contexts und Dependency Injection f&uuml;r Anwendungen der Java EE-Plattform)</p>
</li>
</ul>
</dd>
<dt>Aktion</dt>
<dd>
<p>Links zu den Aktionen, die Sie mit der Komponente ausf&uuml;hren k&ouml;nnen, nachdem sie bereitgestellt wurde. "Erneut bereitstellen" und "Erneut laden" f&uuml;r alle Komponenten, "Starten" f&uuml;r Webanwendungen und Anwendungsclients und "Client-Stubs herunterladen" f&uuml;r Anwendungsclients.</p>
</dd>
</dl>
<p>Die Tabelle "Bereitgestellte Anwendungen" enth&auml;lt dar&uuml;ber hinaus die folgenden Optionen.</p>
<dl>
<dt>Bereitstellen</dt>
<dd>
<p>Schaltfl&auml;che zum Bereitstellen einer Anwendung.</p>
</dd>
<dt>Deployment aufheben</dt>
<dd>
<p>Schaltfl&auml;che, um das Deployment einer oder mehrerer ausgew&auml;hlter Anwendungen aufzuheben.</p>
</dd>
<dt>Aktivieren</dt>
<dd>
<p>Schaltfl&auml;che, um eine oder mehrere ausgew&auml;hlte Anwendungen zu aktivieren, wenn nur die standardm&auml;&szlig;ige Serverinstanz <code>server</code> vorhanden ist.</p>
</dd>
<dt>Deaktivieren</dt>
<dd>
<p>Schaltfl&auml;che, um eine oder mehrere ausgew&auml;hlte Anwendungen zu deaktivieren, wenn nur die standardm&auml;&szlig;ige Serverinstanz <code>server</code> vorhanden ist.</p>
</dd>
<dt>Filter</dt>
<dd>
<p>Dropdown-Liste, die Anwendungen nach Engine filtert.</p>
</dd>
</dl>
<a id="GHCOM367" name="GHCOM367"></a>
<h5>Verwandte Aufgaben</h5>
<ul>
<li>
<p><a href="task-applistdeployed.html">So wird eine Liste der bereitgestellten Anwendungen angezeigt</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">So wird eine Webanwendung bereitgestellt</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">So wird eine Unternehmensanwendung bereitgestellt</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">So wird ein Anwendungsclient bereitgestellt</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">So stellen Sie ein Connector-Modul bereit</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">So wird ein EJB-JAR bereitgestellt</a></p>
</li>
<li>
<p><a href="task-appedit.html">So wird eine bereitgestellte Anwendung bearbeitet</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">So werden Deskriptoren einer Anwendung angezeigt</a></p>
</li>
<li>
<p><a href="task-appviewtargets.html">So werden Anwendungsziele angezeigt</a></p>
</li>
<li>
<p><a href="task-endpoint.html">So werden End Point-Informationen f&uuml;r einen Webservice angezeigt</a></p>
</li>
<li>
<p><a href="task-applaunch.html">So wird eine Anwendung gestartet</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">So wird ein Anwendungsclient gestartet</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">So werden Anwendungsclient-Stubs heruntergeladen</a></p>
</li>
<li>
<p><a href="task-appredeploy.html">So wird eine bereitgestellte Anwendung erneut bereitgestellt</a></p>
</li>
<li>
<p><a href="task-apprestart.html">So wird eine bereitgestellte Anwendung erneut geladen</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">So werden anwendungsspezifische Ressourcen angezeigt</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">So werden anwendungsspezifische Ressourcen ge&auml;ndert</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
