<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jaccprovidernew" name="ref-jaccprovidernew"></a></p>

<h4><a id="sthref223" name="sthref223"></a>Neuer JACC-Provider</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Verwenden Sie die Seite "Neuer JACC-Provider", um einen neuen, mit JSR-115/196 konformen Java Authorization Contract for Containers (JACC)-Provider zu erstellen, der von Drittanbieter-Autorisierungsmodulen f&uuml;r Anwendungen verwendet werden kann, die in GlassFish Server laufen. Der JACC-Provider wird als <code>jacc-provider</code>-Element innerhalb des <code>security-service</code>-Elements in der Datei <code>domain.xml</code> der Domain erstellt.</p>
<p>Die standardm&auml;&szlig;ige GlassFish Server-Installation enth&auml;lt zwei JACC-Provider namens <code>standard</code> und <code>simple</code>. Neue JACC-Provider werden zus&auml;tzlich zu diesen beiden Standardprovidern erstellt. Die Standard-JACC-Provider von GlassFish Server implementieren eine einfache, dateibasierte Autorisierungs-Engine, die der JACC-Spezifikation entspricht.</p>
<p>Alle GlassFish Server-JACC-Provider m&uuml;ssen die Java Authentication and Authorization Service (JAAS)-APIs verwenden. JAAS erlaubt Services, den Benutzerzugriff durch Authentifizierung und Zugriffskontrolle zu kontrollieren. JAAS implementiert eine Java-Technologieversion der standardm&auml;&szlig;igen Pluggable Authentication Module (PAM)-Struktur.</p>
<p>Mit JSR 196 k&ouml;nnen Sie Plug-ins auf verschiedenen Ebenen entwickeln. Sie k&ouml;nnen Plug-ins definieren, die die Art und Weise &auml;ndern, in der neue Authentifizierungsmechanismen konfiguriert werden, wie beispielsweise <code>AuthConfigProvider</code> und <code>AuthConfigFactory</code>. Sie k&ouml;nnen auch neue Authentifizierungsmechanismen definieren, wie beispielsweise <code>ServerAuthModule</code> und <code>ClientAuthModule</code>.</p>
<p>Die Seite "Neuer JACC-Provider" enth&auml;lt die folgenden Optionen.</p>
<dl>
<dt>Name der Konfiguration</dt>
<dd>
<p>Der Name der Konfiguration, f&uuml;r die die Einstellungen auf dieser Seite angewendet werden. Dieses Feld ist schreibgesch&uuml;tzt.</p>
</dd>
<dt>Name</dt>
<dd>
<p>Der Name des JACC-Providers. Dieser Name wird verwendet, um auf das <code>jacc-provider</code>-Element in <code>domain.xml</code> zu verweisen.</p>
</dd>
<dt>Policy-Konfiguration</dt>
<dd>
<p>Der vollst&auml;ndig angegebene Name f&uuml;r den <code>javax.security.jacc.PolicyConfigurationFactory.provider</code>, der die providerspezifische <code>javax.security.jacc.PolicyConfigurationFactory</code> implementiert.</p>
</dd>
<dt>Policy-Provider</dt>
<dd>
<p>Der vollst&auml;ndig angegebene Klassenname f&uuml;r den <code>javax.security.jacc.policy.provider</code>, der die <code>java.security.Policy</code> implementiert.</p>
</dd>
<dt>Weitere Eigenschaften</dt>
<dd>
<p>Zus&auml;tzliche Eigenschaften f&uuml;r den JACC-Provider. Eine Beschreibung der zus&auml;tzlichen Eigenschaften, die f&uuml;r JACC-Provider verf&uuml;gbar sind, finden Sie unter <a href="ref-jaccproviderprop.html">F&uuml;r JACC-Provider spezifische Eigenschaften</a></p>
</dd>
</dl>
<a id="GHCOM452" name="GHCOM452"></a>
<h5>Verwandte Aufgaben</h5>
<ul>
<li>
<p><a href="task-jaccprovidernew.html">So wird ein JACC-Provider erstellt</a></p>
</li>
<li>
<p><a href="task-jaccprovideredit.html">So wird ein JACC-Provider bearbeitet</a></p>
</li>
<li>
<p><a href="task-jaccproviderdelete.html">So wird ein JACC-Provider gel&ouml;scht</a></p>
</li>
</ul>
<a id="GHCOM453" name="GHCOM453"></a>
<h5>Zugeh&ouml;rige asadmin-Befehle</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00034"><code>create-jacc-provider</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00086"><code>delete-jacc-provider</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00171"><code>list-jacc-providers</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
