<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-logviewer" name="ref-logviewer"></a><a id="GHCOM00059" name="GHCOM00059"></a></p>

<h4><a id="sthref241" name="sthref241"></a><a id="sthref242" name="sthref242"></a><a id="sthref243" name="sthref243"></a>Log-Viewer</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Verwenden Sie die Seite "Log-Viewer", um die Logdateien f&uuml;r ausgew&auml;hlte GlassFish Server-Instanzen und -Cluster anzuzeigen und die Loganzeige anzupassen.</p>
<p>Die Seite "Log-Viewer" ist in vier Bereiche unterteilt:</p>
<ul>
<li>
<p>Suchkriterien</p>
</li>
<li>
<p>Erweiterte Suche</p>
</li>
<li>
<p>Suche &auml;ndern</p>
</li>
<li>
<p>Suchergebnisse</p>
</li>
</ul>
<p>Der Bereich "Suchkriterien" enth&auml;lt die folgenden Optionen.</p>
<dl>
<dt>Erweiterte Suche</dt>
<dd>
<p>Wenn Sie auf diesen Link klicken, wird ein Bereich ge&ouml;ffnet, in dem Sie weitere Feineinstellungen im Log-Viewer vornehmen k&ouml;nnen.</p>
</dd>
<dt>Zeitstempel</dt>
<dd>
<p>Im Optionsfeld "Neu" werden die neuen Nachrichten angezeigt. &Uuml;ber das Optionsfeld "Bestimmter Bereich" lassen sich die Felder "Von" und "Bis" &ouml;ffnen. Auf diese Weise k&ouml;nnen Sie Nachrichten anzeigen, die einem bestimmten Zeitraum entstammen.</p>
<p>F&uuml;r den Wert Zeit muss die Syntax folgende Form annehmen (<i>SSS</i> steht f&uuml;r Millisekunden):</p>
<pre>
<i>hh</i>:<i>mm</i>:<i>ss</i>.<i>SSS</i>
</pre>
<p>Beispiel:</p>
<pre>
17:10:00.000
</pre>
<p>Wenn der Wert im Feld "Von" zeitlich hinter dem Wert in "Bis" liegt, wird eine Fehlermeldung angezeigt.</p>
</dd>
<dt>Logebene</dt>
<dd>
<p>Die f&uuml;r den Filtervorgang ausgew&auml;hlte Logebene. Standardm&auml;&szlig;ig werden alle im Serverlog enthaltenen Meldungen angezeigt, die der gew&auml;hlten oder einer h&ouml;heren Logebene zugeordnet sind. Aktivieren Sie das Kontrollk&auml;stchen "Keine weiteren als 'schwerwiegend' eingestuften Meldungen aufnehmen", um nur Meldungen der gew&auml;hlten Ebene anzuzeigen.</p>
<p>Um sicherzustellen, dass die Meldungen, die Sie anzeigen m&ouml;chten, im Serverlog angezeigt werden, legen Sie zun&auml;chst die geeigneten Logebenen auf der Seite "Modul-Logebenen" fest. Siehe <a href="task-eelogginglevels.html">So werden Logebenen konfiguriert</a></p>
<p>Wenn Sie sich f&uuml;r eine Filterung von Logmeldungen basierend auf der Logebene entschieden haben, werden nur Meldungen angezeigt, die den angegebenen Filterkriterien entsprechen. Diese Filterung wirkt sich jedoch nicht darauf aus, welche Meldungen im Serverlog aufgezeichnet werden.</p>
</dd>
</dl>
<p>Der Bereich "Erweiterte Suche" enth&auml;lt die folgenden Optionen.</p>
<dl>
<dt>Logger</dt>
<dd>
<p>Logger Namespaces zum Filtern nach Modul. Klicken Sie bei gedr&uuml;ckter Umschalt- oder Strg+Taste, um mehrere Namespaces auszuw&auml;hlen.</p>
<p>Die Auswahl eines Namespaces einer h&ouml;heren Ebene f&uuml;hrt zur Auswahl aller darunter angeordneten Namespaces. Beispiel: Wenn Sie <code>javax.enterprise.system</code> ausw&auml;hlen, werden auch die Logger aller Module unterhalb dieses Namespaces ausgew&auml;hlt: <code>javax.enterprise.system.core</code>, <code>javax.enterprise.system.tools.admin</code> usw.</p>
</dd>
<dt>Benutzerdefinierter Logger</dt>
<dd>
<p>Logger, die zu einer bestimmten Anwendung geh&ouml;ren, einer pro Zeile.</p>
<p>Wenn die Anwendung &uuml;ber mehrere Module verf&uuml;gt, k&ouml;nnen Sie einige oder alle dieser Module anzeigen. Angenommen, die Anwendung weist Logger mit den folgenden Namen auf:</p>
<pre>
com.mycompany.myapp.module1
com.mycompany.myapp.module2
com.mycompany.myapp.module3
</pre>
<p>Um Meldungen aller Module in der Anwendung anzuzeigen, geben Sie <code>com.mycompany.myapp</code> ein. Um nur Meldungen von <code>module2</code> anzuzeigen, geben Sie <code>com.mycompany.myapp.module2</code> ein.</p>
<p>Wenn Sie mindestens einen benutzerdefinierten Logger angeben, werden Meldungen von GlassFish Server-Modulen nur dann angezeigt, wenn Sie sie im Bereich "Logger" explizit auff&uuml;hren.</p>
</dd>
<dt>Anzeige</dt>
<dd>
<p>Die Anzahl der gleichzeitig angezeigten Nachrichten. Als Standardanzeige f&uuml;r Meldungen wird 40 angezeigt. Dar&uuml;ber hinaus stehen 100, 250 und 1000 zur Auswahl.</p>
<p>Um Stacktraces anzuzeigen, deaktivieren Sie das Kontrollk&auml;stchen "Sehr lange Meldungen begrenzen". Standardm&auml;&szlig;ig werden in der Anzeige keine Stacktraces angezeigt. Um diese einzublenden, klicken Sie auf den Link <code>(Details)</code> f&uuml;r eine Meldung.</p>
</dd>
</dl>
<p>Mithilfe des Bereichs "Suche modifizieren" k&ouml;nnen Sie die Serverinstanz oder das Cluster angeben, sowie den Namen einer zugeh&ouml;rigen Logdatei, die angezeigt werden soll.</p>
<dl>
<dt>Instanz</dt>
<dd>
<p>Die Serverinstanz oder das Cluster, f&uuml;r die/das Datens&auml;tze angezeigt werden. Der Standardwert ist "server". Andere Optionen h&auml;ngen von den Clustern und Instanzen ab, die f&uuml;r die Domain definiert und aktiviert werden k&ouml;nnen.</p>
</dd>
<dt>Logdatei</dt>
<dd>
<p>Der Name der Logdatei, die Sie anzeigen m&ouml;chten. Der Standardname lautet <code>server.log</code>. Andere Optionen h&auml;ngen von den Logeinstellungen f&uuml;r das gew&auml;hlte Ziel ab.</p>
</dd>
</dl>
<p>Die Tabelle "Log-Viewer-Ergebnisse" zeigt die Meldungen des Serverlogs an. Verwenden Sie die Schaltfl&auml;chen "Eintr&auml;ge vor" und "Eintr&auml;ge nach", die sich am oberen Rand der Tabelle befinden, um den Bereich der Datens&auml;tze auszuw&auml;hlen, die Sie anzeigen m&ouml;chten.</p>
<p>F&uuml;r jede Nachricht enth&auml;lt die Tabelle "Log-Viewer-Ergebnisse" die folgenden Informationen.</p>
<dl>
<dt>Datensatznummer</dt>
<dd>
<p>Die Nummer der Meldung im Serverlog.</p>
</dd>
<dt>Logebene</dt>
<dd>
<p>Die Logebene der Meldung.</p>
</dd>
<dt>Meldung</dt>
<dd>
<p>Der kurze Text der Logmeldung. Klicken Sie auf den Link <code>(Details)</code>, um eine formatierte Version einer Meldung anzuzeigen.</p>
</dd>
<dt>Logger</dt>
<dd>
<p>Das Logger-Modul, das die Logmeldung generiert hat.</p>
</dd>
<dt>Zeitstempel</dt>
<dd>
<p>Datum und Uhrzeit der Erstellung der Logmeldung.</p>
</dd>
<dt>Name/Wertpaare</dt>
<dd>
<p>Der Name und die ID des Threads der Logmeldung.</p>
</dd>
</dl>
<a id="sthref244" name="sthref244"></a>
<h5>Verwandte Aufgaben</h5>
<ul>
<li>
<p><a href="task-eelogging.html">So werden allgemeine Logging-Einstellungen konfiguriert</a></p>
</li>
<li>
<p><a href="task-eelogginglevels.html">So werden Logebenen konfiguriert</a></p>
</li>
<li>
<p><a href="task-logviewer.html">So werden Logdateien f&uuml;r DAS angezeigt</a></p>
</li>
</ul>
<a id="sthref245" name="sthref245"></a>
<h5>Zugeh&ouml;rige asadmin-Befehle</h5>
<ul>
<li>
<p><code>set-log-level</code></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00224"><code>rotate-log</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
