<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-configurationsystemproperties" name="ref-configurationsystemproperties"></a><a id="GHCOM00130" name="GHCOM00130"></a></p>

<h4><a id="sthref439" name="sthref439"></a><a id="sthref440" name="sthref440"></a>Systemeigenschaften</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Auf der Seite "Systemeigenschaften" werden die Java-Systemeigenschaften aufgelistet, die f&uuml;r die ausgew&auml;hlte benannte Konfiguration definiert sind. Java-Systemeigenschaften werden an das Java-Anwendungsstarttool &uuml;ber die Option <code>-D</code> des Java-Anwendungsstarttools weitergeleitet, wenn GlassFish Server gestartet wird.</p>
<p>Diese Eigenschaften definieren die Standardwerte der Porteinstellungen f&uuml;r alle GlassFish Server-Instanzen, die auf die Konfiguration verweisen.</p>
<p>Weitere Informationen zu vordefinierten Porteinstellungen in einer Konfiguration finden Sie unter <a href="ref-predefinedconfigsysproperties.html">Vordefinierte Systemeigenschaften</a>.</p>
<p>F&uuml;r jede Instanz werden folgende Informationen angezeigt:</p>
<dl>
<dt>Name der Instanzenvariablen</dt>
<dd>
<p>Der Name der Systemeigenschaft.</p>
</dd>
<dt>Standardwert</dt>
<dd>
<p>Der Wert, der f&uuml;r die Eigenschaft in der benannten Konfiguration festgelegt ist, auf den die Instanz verweist. Dieses Feld ist schreibgesch&uuml;tzt.</p>
</dd>
<dt>Instanzwerte</dt>
<dd>
<p>Ein Link zur Seite <a href="ref-sysinstancevalues.html">Instanzwerte</a> f&uuml;r die Eigenschaft.</p>
</dd>
</dl>
<p>Die Tabelle "Weitere Eigenschaften" enth&auml;lt dar&uuml;ber hinaus die folgenden Optionen.</p>
<dl>
<dt>Eigenschaft hinzuf&uuml;gen</dt>
<dd>
<p>Schaltfl&auml;che zum Hinzuf&uuml;gen einer Eigenschaft. Durch Klicken auf diese Schaltfl&auml;che wird eine Zeile zur Tabelle "Weitere Eigenschaften" hinzugef&uuml;gt.</p>
</dd>
<dt>Eigenschaften l&ouml;schen</dt>
<dd>
<p>Schaltfl&auml;che zum L&ouml;schen von mindestens einer ausgew&auml;hlten Eigenschaft. Eine gel&ouml;schte Eigenschaft wird auf den Standardwert zur&uuml;ckgesetzt oder, falls kein Standardwert vorhanden ist, nicht definiert.</p>
</dd>
</dl>
<p>Die Seite "Systemeigenschaften" enth&auml;lt dar&uuml;ber hinaus die folgenden Optionen.</p>
<dl>
<dt>Name der Konfiguration</dt>
<dd>
<p>Der Name der Konfiguration, f&uuml;r die die Einstellungen auf dieser Seite angewendet werden. Dieses Feld ist schreibgesch&uuml;tzt.</p>
</dd>
<dt>Dynamische Neukonfiguration</dt>
<dd>
<p>Wenn diese Option aktiviert ist, werden &Auml;nderungen an der Konfiguration auf die Instanzen &uuml;bertragen, die auf die Konfiguration verweisen, ohne dass die Instanzen neu gestartet werden m&uuml;ssen.</p>
</dd>
<dt>Cluster und/oder Instanzen, die diese Konfiguration verwenden</dt>
<dd>
<p>Eine Liste der Cluster und Instanzen, die auf die Konfiguration verweisen, mit einer Angabe, ob die einzelnen Cluster oder Instanzen ausgef&uuml;hrt werden:</p>
<ul>
<li>
<p>Wenn das Cluster oder die Instanz ausgef&uuml;hrt wird, wird ein H&auml;kchen (&#10003;) angezeigt.</p>
</li>
<li>
<p>Wenn das Cluster oder die Instanz angehalten ist, wird ein Ausrufezeichen (<code>!</code>) angezeigt.</p>
</li>
</ul>
</dd>
</dl>
<a id="sthref441" name="sthref441"></a>
<h5>Verwandte Aufgaben</h5>
<p>So legen Sie Standardwerte f&uuml;r Konfigurationseigenschaften fest</p>
<a id="sthref442" name="sthref442"></a>
<h5>Entsprechende asadmin-Unterbefehle</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00059"><code>create-system-properties</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00110"><code>delete-system-property</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00203"><code>list-system-properties</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
