<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-eelogging" name="ref-eelogging"></a><a id="GHCOM00094" name="GHCOM00094"></a></p>

<h4><a id="sthref341" name="sthref341"></a>Logger-Einstellungen</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Verwenden Sie die Seite "Logger-Einstellungen", um das Logging f&uuml;r die ausgew&auml;hlte GlassFish Server-Instanz oder das Cluster zu konfigurieren.</p>
<p>Die Seite "Logger-Einstellungen" enth&auml;lt die folgenden Optionen.</p>
<dl>
<dt>Name der Konfiguration</dt>
<dd>
<p>Der Name der Konfiguration, f&uuml;r die die Einstellungen auf dieser Seite angewendet werden. Dieses Feld ist schreibgesch&uuml;tzt.</p>
</dd>
<dt>In Systemlog schreiben</dt>
<dd>
<p>Wenn diese Option aktiviert ist, wird die Logausgabe zus&auml;tzlich zum Serverlog an <code>syslog</code> gesendet. Dieses Feature ist ausschlie&szlig;lich unter den Betriebssystemen Solaris und Linux verf&uuml;gbar. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>Log an Konsole</dt>
<dd>
<p>Wenn diese Option aktiviert ist, wird die Logausgabe an die Systemkonsole gesendet.</p>
</dd>
<dt>Rotation bei Datumswechsel</dt>
<dd>
<p>Wenn diese Option aktiviert ist, rotiert GlassFish Server die Logdateien t&auml;glich um Mitternacht.</p>
</dd>
<dt>Mehrzeiliger Modus</dt>
<dd>
<p>Wenn diese Option aktiviert ist, werden Logmeldungen so formatiert, dass sie einfacher gelesen werden k&ouml;nnen. Der Haupttext der Logmeldung wird eingezogen und beginnt auf einer neuen Zeile.</p>
</dd>
<dt>Logging-Format f&uuml;r Konsole</dt>
<dd>
<p>Das Format f&uuml;r das Logging auf der Konsole. Zur Auswahl stehen: ULF (UniformLogFormatter) und ODL (Oracle Diagnostics Logging). Der Standardwert ist ODL.</p>
</dd>
<dt>Logging-Format f&uuml;r LogFile</dt>
<dd>
<p>Das Logging-Format f&uuml;r das Loggen in der Serverlogdatei. Zur Auswahl stehen ULF und ODL. Der Standardwert ist ODL.</p>
</dd>
<dt>Begrenzung f&uuml;r Dateirotation</dt>
<dd>
<p>Die Gr&ouml;&szlig;e in Byte, die die Serverlogdatei erreichen muss, bevor sie rotiert wird. Wenn das Serverlog die angegebene Gr&ouml;&szlig;e erreicht, wird eine neue, leere Datei mit dem Namen <code>server.log</code> erstellt. Die alte Datei wird in <code>server.log_</code><i>Datum</i> umbenannt, wobei <i>Datum</i> das Datum und die Uhrzeit der Rotation angibt. Der Standardwert ist 2 MB. Der Mindestwert f&uuml;r diese Einstellung betr&auml;gt 500 KB; wenn Sie einen niedrigeren Wert einstellen, findet die Dateirotation statt, wenn die Logdatei eine Gr&ouml;&szlig;e von 500 KB erreicht. Zur Deaktivierung der Logdateirotation setzen Sie den Wert auf 0.</p>
</dd>
<dt>Zeitlimit f&uuml;r Dateirotation</dt>
<dd>
<p>Die Anzahl Minuten, nach der das Serverlog rotiert werden muss. Der Standardwert ist 0, d.h.: Die Dateirotation wird auf Grundlage der im Feld "Begrenzung f&uuml;r Dateirotation" angegebenen Dateigr&ouml;&szlig;e durchgef&uuml;hrt. Wenn Sie mindestens eine Minute festlegen, hat das Zeitlimit Vorrang vor dem Gr&ouml;&szlig;enlimit, das im Feld "Dateirotationslimit" festgelegt wurde.</p>
</dd>
<dt>Leerungsh&auml;ufigkeit</dt>
<dd>
<p>Die maximale Anzahl von Meldungen, die gleichzeitig aus der Warteschlange in das Serverlog geschrieben werden k&ouml;nnen. Der Standardwert ist 1.</p>
</dd>
<dt>Max. Historiendateien</dt>
<dd>
<p>Die maximale Anzahl von Logdateien, die GlassFish Server beibeh&auml;lt, bevor die &auml;lteste Datei gel&ouml;scht wird. Wenn Sie diesen Wert auf null (0) setzen, l&ouml;scht GlassFish Server keine alten Logdateien.</p>
</dd>
<dt>Logdatei</dt>
<dd>
<p>Ein alternativer Name oder alternatives Verzeichnis f&uuml;r die Serverlogdatei. Das Standardverzeichnis ist domain-dir<code>/logs/server.log</code>.</p>
</dd>
<dt>Log-Handler</dt>
<dd>
<p>Der absolute Klassenname eines benutzerdefinierten Log-Handlers. Mit einem benutzerdefinierten Log-Handler k&ouml;nnen Sie Logs an ein anderes Ziels als <code>server.log</code> oder <code>syslog</code> senden. Der benutzerdefinierte Handler muss die Klasse <code>java.util.logging.Handler</code> erweitern (eine JSR 047-kompatible API). Setzen Sie die Handler-Klasse in den Classpath von GlassFish Server, damit der Handler beim Hochfahren des Servers installiert wird.</p>
</dd>
</dl>
<a id="sthref342" name="sthref342"></a>
<h5>Verwandte Aufgaben</h5>
<ul>
<li>
<p><a href="task-eelogging.html">So werden allgemeine Logging-Einstellungen konfiguriert</a></p>
</li>
<li>
<p><a href="task-eelogginglevels.html">So werden Logebenen konfiguriert</a></p>
</li>
<li>
<p><a href="task-logviewer.html">So werden Logdateien f&uuml;r DAS angezeigt</a></p>
</li>
</ul>
<a id="sthref343" name="sthref343"></a>
<h5>Zugeh&ouml;rige asadmin-Befehle</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00007"><code>collect-log-files</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00183"><code>list-log-levels</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00224"><code>rotate-log</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00228"><code>set-log-levels</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
