<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-eelogging" name="task-eelogging"></a></p>

<h4><a id="sthref117" name="sthref117"></a>So werden allgemeine Logging-Einstellungen konfiguriert</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Blenden Sie in der Navigationsbaumstruktur den Knoten "Konfigurationen" ein.</p>
</li>
<li>
<p>Klicken Sie unter dem Knoten "Konfigurationen" auf die Serverinstanz oder die Clusterkonfiguration, f&uuml;r die Sie Einstellungen der Protokollfunktion konfigurieren m&ouml;chten.</p>
<p>Die Seite "Konfiguration" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie auf der Seite "Konfiguration" auf "Logger-Einstellungen".</p>
<p>Die Seite "Logger-Einstellungen" f&uuml;r das ausgew&auml;hlte Konfigurationsziel wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "In Systemlog schreiben aktiviert", um die Logausgabe zus&auml;tzlich zum Serverlog an die <code>syslog</code>-Funktion zu senden.</p>
<p>Dieses Feature ist ausschlie&szlig;lich unter den Betriebssystemen Solaris und Linux verf&uuml;gbar. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>W&auml;hlen Sie das Kontrollk&auml;stchen "Log an Konsole", um die Logging-Ausgabe an die Systemkonsole zu senden.</p>
</li>
<li>
<p>W&auml;hlen Sie das Kontrollk&auml;stchen "Rotation bei Datumswechsel", um Serverlogdateien t&auml;glich um Mitternacht zu rotieren.</p>
</li>
<li>
<p>W&auml;hlen Sie das Kontrollk&auml;stchen "Mehrzeiliger Modus", um Logmeldungen so zu formatieren, dass sie einfacher zu lesen sind. Der Haupttext der Logmeldung wird eingezogen und beginnt auf einer neuen Zeile.</p>
</li>
<li>
<p>W&auml;hlen Sie aus der Dropdown-Liste "Logging-Format f&uuml;r Konsole" das Format f&uuml;r das Logging in der Konsole. Die Standardoption ist ODL (Oracle Diagnostics Logging). Die andere Option ist ULF (UniformLogFormatter).</p>
</li>
<li>
<p>W&auml;hlen Sie aus der Dropdown-Liste "Logging-Format f&uuml;r LogFile" das Format f&uuml;r das Logging der Serverlogdatei. Die Standardoption ist ODL.</p>
</li>
<li>
<p>Geben Sie im Feld "Dateirotationsgrenzwert" die Gr&ouml;&szlig;e in Byte ein, die die Serverlogdatei erreichen muss, bevor sie rotiert wird.</p>
<p>Wenn das Serverlog die angegebene Gr&ouml;&szlig;e erreicht, wird eine neue, leere Datei mit dem Namen <code>server.log</code> erstellt. Die alte Datei wird in <code>server.log_</code><i>Datum</i> umbenannt, wobei <i>Datum</i> das Datum und die Uhrzeit der Rotation angibt. Der Standardwert ist 2 MB. Der Mindestwert f&uuml;r diese Einstellung betr&auml;gt 500 KB; wenn Sie einen niedrigeren Wert einstellen, findet die Dateirotation statt, wenn die Logdatei eine Gr&ouml;&szlig;e von 500 KB erreicht. Zur Deaktivierung der Logdateirotation setzen Sie den Wert auf 0.</p>
</li>
<li>
<p>Geben Sie im Feld "Dateirotations-Zeitlimit" die Anzahl Minuten ein, nach denen das Serverlog rotiert werden muss.</p>
<p>Der Standardwert ist 0, d.h.: Die Dateirotation wird auf Grundlage der im Feld "Begrenzung f&uuml;r Dateirotation" angegebenen Dateigr&ouml;&szlig;e durchgef&uuml;hrt.</p>

<hr>
<p><b>Hinweis:</b></p>
Wenn Sie mindestens eine Minute festlegen, hat das Zeitlimit Vorrang vor dem Gr&ouml;&szlig;enlimit, das im Feld "Dateirotationslimit" festgelegt wurde.
<hr>

</li>
<li>
<p>Geben Sie im Feld "Zur&uuml;cksetzungsh&auml;ufigkeit" die maximale Anzahl von Meldungen ein, die gleichzeitig aus der Queue in das Serverlog geschrieben werden k&ouml;nnen.</p>
<p>Der Standardwert ist 1.</p>
</li>
<li>
<p>Geben Sie im Feld "Max. Historiendateien" die maximale Anzahl von Logdateien an, die GlassFish Server beibehalten soll, bevor die &auml;lteste Datei gel&ouml;scht wird. Wenn Sie diesen Wert auf null (0) setzen, l&ouml;scht GlassFish Server keine alten Logdateien.</p>
</li>
<li>
<p>Geben Sie im Feld "Logdatei" einen alternativen Namen oder Ort f&uuml;r die Serverlogdatei ein.</p>
<p>Das Standardverzeichnis ist <code>${com.sun.aas.instanceRoot}/logs/server.log</code>.</p>
</li>
<li>
<p>Geben Sie im Feld "Log-Handler" den absoluten Klassennamen eines benutzerdefinierten Log-Handlers ein.</p>
<p>Mit einem benutzerdefinierten Log-Handler k&ouml;nnen Sie Logs an ein anderes Ziels als <code>server.log</code> oder <code>syslog</code> senden. Der benutzerdefinierte Handler muss die Klasse <code>java.util.logging.ConsoleHandler</code> erweitern (eine JSR 047-konforme API). Setzen Sie die Handler-Klasse in den Classpath von GlassFish Server, damit der Handler beim Hochfahren des Servers installiert wird.</p>
</li>
<li>
<p>Klicken Sie auf "Speichern".</p>

<hr>
<p><b>Hinweis:</b></p>
Je nach der Konfiguration, f&uuml;r die das Logging aktiviert wurde, kann ein Serverneustart erforderlich sein.
<p>Auch kann ein Serverneustart erforderlich sein, wenn der standardm&auml;&szlig;ige Name der Logdatei ge&auml;ndert wurde. Die Meldung <code>Neustart erforderlich</code> wird in der oberen rechten Ecke der Administrationskonsole angezeigt, wenn der Server neu gestartet werden muss.</p>

<hr>

</li>
</ol>
<a id="sthref118" name="sthref118"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-eelogginglevels.html">So werden Logebenen konfiguriert</a></p>
</li>
<li>
<p><a href="task-logging-max-logfiles.html">So wird der Grenzwert f&uuml;r die Anzahl von rotierten Logdateien ge&auml;ndert</a></p>
</li>
<li>
<p><a href="task-logviewer.html">So werden Logdateien f&uuml;r DAS angezeigt</a></p>
</li>
<li>
<p><a href="task-collectdomainlogs.html">So werden Domainlogs gesammelt und heruntergeladen</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
