<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-uc-set-proxy" name="task-uc-set-proxy"></a><a id="GHCOM00218" name="GHCOM00218"></a></p>

<h4><a id="sthref212" name="sthref212"></a><a id="sthref213" name="sthref213"></a><a id="sthref214" name="sthref214"></a>So werden Netzwerkproxyeinstellungen f&uuml;r den Zugriff auf Netzwerk-Repositorys konfiguriert</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Netzwerkproxyeinstellungen legen fest, wie GlassFish Server eine Verbindung mit dem Internet herstellt. Damit Updatetool &uuml;ber das Internet auf Netzwerk-Repositorys zugreifen kann, m&uuml;ssen Sie Ihre Netzwerkproxyeinstellungen konfigurieren.</p>
<ol>
<li>
<p>W&auml;hlen Sie in der Navigationsbaumstruktur den Knoten "Updatetool".</p>
<p>Die Seite "Verf&uuml;gbare Add-ons" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie auf der Seite "Verf&uuml;gbare Add-ons" auf die Registerkarte "Konfiguration".</p>
<p>Die Seite Updatetool-Konfiguration wird angezeigt.</p>
</li>
<li>
<p>Geben Sie auf der Seite "Updatetool-Konfiguration" an, wie der Rechner, auf dem GlassFish Server ausgef&uuml;hrt wird, eine Verbindung zum Internet herstellt.</p>
<ul>
<li>
<p>Stellt der Rechner eine Direktverbindung mit dem Internet her, so w&auml;hlen Sie die Option "Direktverbindung".</p>
</li>
<li>
<p>Stellt der Rechner eine Internetverbindung &uuml;ber einen Proxy her, w&auml;hlen Sie die Option "&Uuml;ber einen Proxy".</p>
</li>
</ul>
</li>
<li>
<p>Wenn der Rechner, auf dem GlassFish Server ausgef&uuml;hrt wird, &uuml;ber einen Proxy eine Verbindung zum Internet herstellt, geben Sie den Hostnamen und die Portnummer des Proxys an.</p>
<p>Wenn der Rechner, auf dem GlassFish Server ausgef&uuml;hrt wird, eine direkte Verbindung zum Internet herstellt, lassen Sie diesen Schritt aus.</p>
<p>M&ouml;glicherweise wird ein Webbrowser auf dem Rechner ausgef&uuml;hrt, auf dem GlassFish Server ausgef&uuml;hrt wird. In diesem Fall k&ouml;nnen Sie den Hostnamen und die Portnummer des Proxys &uuml;ber den Webbrowser abrufen. Andernfalls erhalten Sie die ben&ouml;tigten Informationen von Ihrem Systemadministrator.</p>
</li>
<li>
<p>Klicken Sie auf "Speichern".</p>
</li>
</ol>
<a id="sthref215" name="sthref215"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-uc-update.html">So werden verf&uuml;gbare Updates f&uuml;r Komponenten angezeigt</a></p>
</li>
<li>
<p><a href="task-uc-addon.html">So werden Add-on-Komponenten installiert</a></p>
</li>
<li>
<p><a href="task-uc-installed-remove.html">So werden installierte Komponenten angezeigt</a></p>
</li>
<li>
<p><a href="task-uc-pkgdetails.html">So werden detaillierte Informationen &uuml;ber eine Komponente angezeigt</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
