<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-appviewtargets" name="task-appviewtargets"></a></p>

<h4>So werden Anwendungsziele angezeigt</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>W&auml;hlen Sie in der Navigationsbaumstruktur den Anwendungsknoten.</p>
<p>Die Seite "Anwendungen" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>W&auml;hlen Sie eine Anwendung, f&uuml;r die Sie die Ziele anzeigen m&ouml;chten.</p>
<p>Der Anwendungsname kann eine optionale Versions-ID enthalten, die dem Namen folgt und von diesem durch einen Doppelpunkt (<code>:</code>) getrennt ist. Weitere Informationen zu Modul- und Anwendungsversionen finden Sie unter <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> im <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
<p>Die Seite f&uuml;r die Anwendung wird ge&ouml;ffnet.</p>
</li>
<li>
<p>W&auml;hlen Sie die Registerkarte "Ziel".</p>
<p>Die Seite "Anwendungsziele" wird ge&ouml;ffnet, und die aktuell f&uuml;r die Anwendung definierten Ziele werden angezeigt.</p>
</li>
<li>
<p>Um eine Anwendung auf einer bestimmten Zielinstanz oder einem Cluster zu aktivieren oder zu deaktivieren, klicken Sie auf das Kontrollk&auml;stchen neben dem Ziel und w&auml;hlen aus dem Dropdown-Men&uuml; "Weitere Aktionen" den Eintrag "Aktivieren" oder "Deaktivieren".</p>
</li>
<li>
<p>Um das Load Balancing f&uuml;r ein Ziel auf einer bestimmten Zielinstanz oder einem Cluster zu aktivieren, klicken Sie auf das Kontrollk&auml;stchen neben dem Ziel und w&auml;hlen aus dem Dropdown-Men&uuml; "Weitere Aktionen" den Eintrag "Load Balancer aktivieren" oder "Load Balancer deaktivieren".</p>
</li>
<li>
<p>Um eine Anwendung mit bestimmten virtuellen Servern zu verkn&uuml;pfen, w&auml;hlen Sie f&uuml;r die Zielinstanz oder das Cluster die Option "Virtuelle Server verwalten".</p>
<p>Die Seite "Virtuelle Serverziele" wird ge&ouml;ffnet.</p>
<p>Um virtuelle Zielserver hinzuzuf&uuml;gen, w&auml;hlen Sie diese aus der Liste "Verf&uuml;gbare Ziele" und verwenden die Schaltfl&auml;che "Hinzuf&uuml;gen", um sie in die Liste "Ausgew&auml;hlte Ziele" zu verschieben.</p>
<p>Das Modul oder die Anwendung wird standardm&auml;&szlig;ig mit dem Standard-Virtual Server (<code>server</code>) verkn&uuml;pft. Verwenden Sie die Schaltfl&auml;che "Alle hinzuf&uuml;gen", um alle Ziele hinzuzuf&uuml;gen. Verwenden Sie die Schaltfl&auml;chen "Entfernen" und "Alle entfernen", um Ziele aus der Liste "Ausgew&auml;hlte Ziele" zu entfernen.</p>
<p>Klicken Sie auf "Speichern", um zur Seite "Anwendungsziele" zur&uuml;ckzukehren.</p>
</li>
<li>
<p>Um Zielinstanzen oder Cluster f&uuml;r eine Anwendung hinzuzuf&uuml;gen oder zu l&ouml;schen, w&auml;hlen Sie "Ziele verwalten".</p>
<p>Die Seite "Ziel verwalten" wird ge&ouml;ffnet.</p>
<p>Um Ziele hinzuzuf&uuml;gen, w&auml;hlen Sie diese aus der Liste "Verf&uuml;gbare Ziele" und verwenden die Schaltfl&auml;che "Hinzuf&uuml;gen", um sie in die Liste "Ausgew&auml;hlte Ziele" zu verschieben.</p>
<p>Verwenden Sie die Schaltfl&auml;che "Alle hinzuf&uuml;gen", um alle Ziele hinzuzuf&uuml;gen. Verwenden Sie die Schaltfl&auml;chen "Entfernen" und "Alle entfernen", um Ziele aus der Liste "Ausgew&auml;hlte Ziele" zu entfernen.</p>
<p>Klicken Sie auf "Speichern", um zur Seite "Anwendungsziele" zur&uuml;ckzukehren.</p>
</li>
<li>
<p>Klicken Sie auf "Speichern".</p>
<p>Die Anwendung ist nun f&uuml;r die bearbeitete Liste der Ziele verf&uuml;gbar.</p>
</li>
</ol>
<a id="GHCOM251" name="GHCOM251"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-appedit.html">So wird eine bereitgestellte Anwendung bearbeitet</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">So werden Deskriptoren einer Anwendung angezeigt</a></p>
</li>
<li>
<p><a href="task-applaunch.html">So wird eine Anwendung gestartet</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
