<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-securitysettings" name="task-securitysettings"></a></p>

<h4><a id="sthref78" name="sthref78"></a><a id="sthref79" name="sthref79"></a>So werden Sicherheitseinstellungen konfiguriert</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Mit der Administrationskonsole k&ouml;nnen verschiedene systemweite Sicherheitseinstellungen festgelegt werden.</p>
<ol>
<li>
<p>Blenden Sie in der Navigationsbaumstruktur den Knoten "Konfigurationen" ein.</p>
</li>
<li>
<p>Klicken Sie unter dem Knoten "Konfigurationen" auf die Serverinstanz oder die Clusterkonfiguration, f&uuml;r die Sie Sicherheitseinstellungen konfigurieren m&ouml;chten.</p>
<p>Die Seite "Konfiguration" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie auf der Seite "Konfiguration" auf "Sicherheit".</p>
<p>Die Seite "Sicherheitseinstellungen" wird f&uuml;r das ausgew&auml;hlte Konfigurationsziel ge&ouml;ffnet.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Sicherheitsmanager aktiviert", um den Sicherheitsmanager zu aktivieren.</p>
<p>Bei Aktivierung wird eine JVM-Option, <code>Djava.security.manager</code>, zu den JVM-Einstellungen von GlassFish Server hinzugef&uuml;gt. Siehe <a href="task-jvmoptions.html">So werden JVM-Optionen konfiguriert</a> Um diese &Auml;nderung zu &uuml;bernehmen, muss der Server neu gestartet werden.</p>
<p>Stellen Sie sicher, dass Sie &uuml;ber die erforderlichen Berechtigungen f&uuml;r alle Anwendungen verf&uuml;gen. Der Sicherheitsmanager kann zum Verbessern der Performance deaktiviert werden. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Audit-Logging aktiviert", um das Audit-Logging einzuschalten.</p>
<p>Ist diese Option aktiviert, l&auml;dt der Server alle in der Liste "Auditmodule" ausgew&auml;hlten Auditmodule und f&uuml;hrt sie aus. Ist diese Option deaktiviert, greift der Server nicht auf Auditmodule zu. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>W&auml;hlen Sie aus der Dropdown-Liste "Standard-Realm" eine aktive Realm, die der Server zur Authentifizierung verwenden wird.</p>
<p>Diese Realm wird von Anwendungen verwendet, es sei denn, ihr Deployment-Deskriptor gibt eine andere Realm an. Alle konfigurierten Realms werden in der Liste angezeigt. Der Standardwert ist <code>file</code>.</p>
</li>
<li>
<p>Geben Sie Standard-Principal-Informationen an.</p>
<ol type="a">
<li>
<p>Geben Sie in das Feld "Standard-Principal" den Standardbenutzernamen ein.</p>
<p>Dieser Benutzername wird vom Server verwendet, wenn kein anderer Principal angegeben wird.</p>
</li>
<li>
<p>Geben Sie in das Feld "Standard-Principal-Kennwort" das Kennwort des im Feld "Standard-Principal" angegebenen Standard-Principals ein.</p>
</li>
</ol>
<p>Ein Standard-Principal ist f&uuml;r normale Servervorg&auml;nge nicht erforderlich.</p>
</li>
<li>
<p>W&auml;hlen Sie aus der Dropdown-Liste "JACC" den Namen eines konfigurierten JACC-Providers aus.</p>
<p>Sie k&ouml;nnen unter den Standardoptionen <code>Standard</code> und <code>einfach</code> w&auml;hlen. Die Standardoption ist <code>Standard</code>. Weitere Informationen &uuml;ber das Erstellen neuer JACC-Provider finden Sie unter ***.</p>
</li>
<li>
<p>W&auml;hlen Sie aus der Dropdown-Liste "Auditmodule" die Auditprovidermodule, die vom Auditsubsystem verwendet werden, wenn das Audit-Logging aktiviert wird.</p>
<p>Standardm&auml;&szlig;ig verwendet der Server das Auditmodul <code>default</code>. Informationen zum Erstellen neuer Auditmodule finden Sie unter <a href="task-auditmodulenew.html">So wird ein Auditmodul erstellt</a>.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Zuordnung von Standard-Principal zu Rolle", um eine Zuordnung von Standard-Principal zu Rolle f&uuml;r die Anwendungen anzuwenden, bei denen keine anwendungsspezifische Zuordnung erfolgt.</p>
</li>
<li>
<p>Wenn Sie die Standard-Principal/Rolle-Zuordnung aktivieren, geben Sie in das Feld "Zugeordnete Principal-Klasse" den Namen einer benutzerdefinierten <code>java.security.Principal</code>-Implementierungsklasse ein, die bei der Standard-Principal/Rolle-Zuordnung verwendet werden soll.</p>
</li>
<li>
<p>Geben Sie im Abschnitt "Weitere Eigenschaften" weitere Eigenschaften an.</p>
<p>Zul&auml;ssige Eigenschaften h&auml;ngen vom Realm-Typ ab, der im Feld "Standard-Realm" ausgew&auml;hlt wurde. Informationen zur Art der Realm, die Sie konfigurieren m&ouml;chten, entnehmen Sie der folgenden Liste.</p>
<ul>
<li>
<p><a href="ref-editfile-adminrealm.html">F&uuml;r die <code>FileRealm</code>-Klasse spezifische Eigenschaften</a></p>
</li>
<li>
<p><a href="ref-editcertrealm.html">F&uuml;r die <code>CertificateRealm</code>-Klasse spezifische Eigenschaften</a></p>
</li>
<li>
<p><a href="ref-editjdbcrealm.html">F&uuml;r die <code>JDBCRealm</code>-Klasse spezifische Eigenschaften</a></p>
</li>
<li>
<p><a href="ref-ldaprealmprop.html">F&uuml;r die <code>LDAPRealm</code>-Klasse spezifische Eigenschaften</a></p>
</li>
<li>
<p><a href="ref-solarisrealmprop.html">F&uuml;r die <code>SolarisRealm</code>-Klasse spezifische Eigenschaften</a></p>
</li>
<li>
<p><a href="ref-pamrealmprop.html">F&uuml;r die <code>PamRealm</code>-Klasse spezifische Eigenschaften</a></p>
</li>
</ul>
<ul>
<li>
<p>Um eine Eigenschaft hinzuzuf&uuml;gen, klicken Sie auf die Schaltfl&auml;che "Eigenschaft hinzuf&uuml;gen". Geben Sie in die daraufhin angezeigte leere Zeile den Eigenschaftsnamen in das Feld "Name" und den Eigenschaftswert in das Feld "Wert" ein.</p>
</li>
<li>
<p>Um eine Eigenschaft zu &auml;ndern, bearbeiten Sie das Feld "Wert" dieser Eigenschaft.</p>
</li>
<li>
<p>Um eine Eigenschaft zu l&ouml;schen, aktivieren Sie das Kontrollk&auml;stchen links neben dem Feld "Name" der zu l&ouml;schenden Eigenschaft und klicken anschlie&szlig;end auf die Schaltfl&auml;che "Eigenschaften l&ouml;schen".</p>
</li>
</ul>
</li>
<li>
<p>Klicken Sie auf "Speichern".</p>
</li>
</ol>
<a id="GHCOM280" name="GHCOM280"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-accessadmintools.html">So wird Zugriff auf Administrationstools erteilt</a></p>
</li>
<li>
<p><a href="task-changeadminpasswd.html">So wird das Kennwort f&uuml;r einen Benutzer in der Admin-Realm ge&auml;ndert</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
