<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-accessadmintools" name="task-accessadmintools"></a></p>

<h4><a id="sthref129" name="sthref129"></a>So wird Zugriff auf Administrationstools erteilt</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Nur Benutzer der Gruppe <code>asadmin</code> k&ouml;nnen auf die Administrationskonsole und das Befehlszeilenutility <code>asadmin</code> zugreifen. Um Benutzern den Zugriff auf diese Administrationstools zu erteilen, f&uuml;gen Sie sie der Gruppe <code>asadmin</code> in <code>admin-realm</code> hinzu.</p>
<ol>
<li>
<p>Blenden Sie unter dem Knoten "Konfigurationen" die Serverinstanz oder die Clusterkonfiguration ein, f&uuml;r die Sie Administrationszugriffsberechtigungen konfigurieren m&ouml;chten.</p>
</li>
<li>
<p>Blenden Sie den Knoten "Sicherheit" ein.</p>
</li>
<li>
<p>Blenden Sie den Knoten "Realms" ein.</p>
</li>
<li>
<p>W&auml;hlen Sie den Knoten <code>admin-realm</code>.</p>
<p>Die Seite "Realm bearbeiten" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie auf der Seite "Realm bearbeiten" auf die Schaltfl&auml;che "Benutzer verwalten".</p>
<p>Die Seite "Admin-Benutzer" wird ge&ouml;ffnet.</p>
<p>Nach der Installation werden die w&auml;hrend der Installation eingegebenen Werte f&uuml;r Benutzername und Kennwort des Administrators in einer Datei mit dem Namen <code>admin-keyfile</code> aufgelistet. Standardm&auml;&szlig;ig geh&ouml;rt dieser Benutzer zur Gruppe <code>asadmin</code>, die &uuml;ber Berechtigungen zum &Auml;ndern von GlassFish Server verf&uuml;gt. F&uuml;gen Sie zu dieser Gruppe nur Benutzer hinzu, denen Sie Administratorberechtigungen f&uuml;r die ausgew&auml;hlte GlassFish Server-Instanz oder das Cluster gew&auml;hren m&ouml;chten.</p>
<p>Wenn Sie einen Benutzer der Realm <code>admin-realm</code> hinzuf&uuml;gen, jedoch nicht der Gruppe <code>asadmin</code> zuweisen, werden die Benutzerinformationen zwar in die Datei <code>admin-keyfile</code> geschrieben, der Benutzer ist jedoch nicht f&uuml;r den Zugriff auf die Administrationstools oder Anwendungen in der Realm <code>file</code> berechtigt.</p>
</li>
<li>
<p>Klicken Sie auf der Seite "Admin-Benutzer" auf "Neu", um der Realm <code>admin-realm</code> einen neuen Benutzer hinzuzuf&uuml;gen.</p>
<p>Die Seite "Neuer File Realm-Benutzer" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Geben Sie in das Feld "Benutzer-ID" den neuen Benutzernamen ein.</p>
</li>
<li>
<p>Geben Sie in das Feld "Gruppenliste" die Namen der Gruppen ein, zu denen der Benutzer geh&ouml;rt.</p>
<p>Um einem Benutzer Berechtigungen zum Durchf&uuml;hren von &Auml;nderungen an GlassFish Server zuzuweisen, f&uuml;gen Sie die Gruppe <code>asadmin</code> im Feld "Gruppenliste" hinzu.</p>
</li>
<li>
<p>Geben Sie in die Felder "Neues Kennwort" und "Neues Kennwort best&auml;tigen" das Kennwort f&uuml;r den neuen Benutzer ein.</p>
</li>
<li>
<p>Klicken Sie auf "OK", um diesen Benutzer der Realm <code>admin-realm</code> hinzuzuf&uuml;gen, oder klicken Sie auf "Abbrechen", um den Vorgang ohne Speichern zu beenden.</p>
</li>
</ol>
<a id="sthref130" name="sthref130"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-securitysettings.html">So werden Sicherheitseinstellungen konfiguriert</a></p>
</li>
<li>
<p><a href="task-changeadminpasswd.html">So wird das Kennwort f&uuml;r einen Benutzer in der Admin-Realm ge&auml;ndert</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
