<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-messagesecurityproviderconfignew" name="task-messagesecurityproviderconfignew"></a></p>

<h4><a id="sthref181" name="sthref181"></a>So wird eine Nachrichtensicherheitsproviderkonfiguration erstellt</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Zum Erstellen einer neuen Nachrichtensicherheitsproviderkonfiguration f&uuml;hren Sie die folgenden Schritte aus:</p>
<a id="sthref182" name="sthref182"></a>
<h5>Bevor Sie beginnen</h5>
<p>Es ist nicht m&ouml;glich, Nachrichtensicherheitsprovider f&uuml;r die standardm&auml;&szlig;ige Konfiguration <code>server-config</code> zu erstellen oder zu l&ouml;schen. Die einzigen Nachrichtensicherheitsprovider, die f&uuml;r die standardm&auml;&szlig;ige Konfiguration <code>server-config</code> unterst&uuml;tzt werden, sind SOAP und HttpServlet. Da diese beiden Nachrichtensicherheitsprovider bei der Installation von GlassFish Server standardm&auml;&szlig;ig erstellt werden, wird die Schaltfl&auml;che "Neu" auf der Seite "Nachrichtensicherheitskonfigurationen" f&uuml;r die Standardkonfiguration <code>server-config</code> ausgegraut.</p>
<ol>
<li>
<p>Blenden Sie in der Navigationsbaumstruktur den Knoten "Konfiguration" ein.</p>
</li>
<li>
<p>Blenden Sie den Knoten "Sicherheit" ein.</p>
</li>
<li>
<p>W&auml;hlen Sie den Knoten "Nachrichtensicherheit".</p>
<p>Die Seite "Nachrichtensicherheitskonfigurationen" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie auf der Seite "Nachrichtensicherheitskonfigurationen" auf den Namen der Authentifizierungslayer der Konfiguration, die Sie bearbeiten.</p>
<p>Standardm&auml;&szlig;ig ist die einzige konfigurierte Nachrichtensicherheitskonfiguration SOAP.</p>
<p>Die Seite "Neue Nachrichtensicherheitskonfiguration bearbeiten" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie auf die Registerkarte "Provider".</p>
<p>Die Seite "Providerkonfigurationen" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie auf der Seite "Providerkonfigurationen" auf "Neu".</p>
<p>Die Seite zur Konfiguration eines neuen Providers wird angezeigt.</p>
</li>
<li>
<p>Geben Sie auf der Seite "Neue Providerkonfiguration" im Feld "Provider-ID" einen eindeutigen Namen f&uuml;r die Providerkonfiguration ein.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Standardprovider", um diesen Provider zum Standardprovider zu machen.</p>
<p>Der Standardprovider wird f&uuml;r alle Anwendungen aufgerufen, f&uuml;r die kein spezifischer Provider angegeben ist. Die Einstellung "Providertyp" legt fest, ob es sich um den standardm&auml;&szlig;igen Clientprovider, den standardm&auml;&szlig;igen Serverprovider oder um beide handelt.</p>
</li>
<li>
<p>W&auml;hlen Sie aus der Dropdown-Liste "Providertyp" den Providertyp.</p>
<p>Zur Auswahl stehen:</p>
<dl>
<dt><code>client</code></dt>
<dd>
<p>Legt fest, dass der Provider der Clientauthentifizierungsprovider ist.</p>
</dd>
<dt><code>server</code></dt>
<dd>
<p>Legt fest, dass der Provider der Serverauthentifizierungsprovider ist.</p>
</dd>
<dt><code>client-server</code></dt>
<dd>
<p>Legt fest, dass der Provider sowohl ein Client- als auch ein Serverauthentifizierungsprovider ist.</p>
</dd>
</dl>
</li>
<li>
<p>Geben Sie im Feld "Klassename" den Namen der Java-Implementierungsklasse des Providers an.</p>
<p>Clientauthentifizierungsprovider m&uuml;ssen die <code>com.sun.enterprise.security.jauth.ClientAuthModule</code>-Schnittstelle implementieren. Serverseitige Provider m&uuml;ssen die <code>com.sun.enterprise.security.jauth.ServerAuthModule</code>-Schnittstelle implementieren. Clientserver-Provider m&uuml;ssen beide Schnittstellen implementieren.</p>
</li>
<li>
<p>W&auml;hlen Sie im Bereich "Anforderungs-Policy" aus der Dropdown-Liste "Authentifizierungsquelle" den Typ der angeforderten Authentifizierung f&uuml;r die Anforderungs-Policy.</p>
<p>Die Anforderungs-Policy legt die Anforderungsverarbeitung f&uuml;r den Authentifizierungsprovider fest. Die Anforderungs-Policy-Felder sind optional; wenn sie jedoch nicht angegeben werden, authentifiziert der Authentifizierungsprovider keine Anforderungsnachrichten.</p>
<p>W&auml;hlen Sie <code>sender</code>, um die Absenderauthentifizierung des Nachrichtenlayers (z.B. Benutzername und Kennwort) f&uuml;r Anforderungsnachrichten festzulegen. W&auml;hlen Sie <code>content</code>, um die Contentauthentifizierung f&uuml;r Anforderungsnachrichten (z.B. digitale Signaturen) festzulegen. Lassen Sie das Feld leer, um die Quelle der Anforderungen nicht zu authentifizieren. Standardm&auml;&szlig;ig ist kein Authentifizierungstyp ausgew&auml;hlt.</p>
<p>Eine Beschreibung der Aktionen, die von den SOAP-Providern f&uuml;r die Nachrichtensicherheit ausgef&uuml;hrt werden, finden Sie unter <a href="ref-configreq-respolicy.html">Konfiguration von Anforderungs- und Antwort-Policy</a></p>
</li>
<li>
<p>W&auml;hlen Sie &uuml;ber die Dropdown-Liste "Empf&auml;ngerauthentifizierung", ob die Empf&auml;ngerauthentifizierung vor oder nach der Contentauthentifizierung f&uuml;r die Anforderungs-Policy durchgef&uuml;hrt wird.</p>
<p>W&auml;hlen Sie <code>before-content</code> oder <code>after-content</code>, um die Authentifizierung des Empf&auml;ngers von Anforderungsnachrichten gegen&uuml;ber dem Absender auf Nachrichtenlayer festzulegen (durch XML-Verschl&uuml;sselung). Wenn der Wert nicht festgelegt ist, ist der Standard <code>after-content</code>. Policys werden in der Reihenfolge des Nachrichteneingangs angegeben, sodass der Nachrichtenempf&auml;nger die Nachricht bei Auswahl von <code>after-content</code> vor der Validierung der Signatur entschl&uuml;sselt.</p>
</li>
<li>
<p>W&auml;hlen Sie im Bereich "Antwort-Policy" aus der Dropdown-Liste "Authentifizierungsquelle" den Typ der angeforderten Authentifizierung f&uuml;r die Antwort-Policy.</p>
<p>Die Antwort-Policy legt die Antwortverarbeitung f&uuml;r den Authentifizierungsprovider fest. Die Antwort-Policy-Felder sind optional. Wenn sie jedoch nicht festgelegt sind, wird keine Authentifizierung auf die Antwortnachrichten angewendet.</p>
<p>W&auml;hlen Sie <code>sender</code>, um die Absenderauthentifizierung des Nachrichtenlayers (z.B. Benutzername und Kennwort) f&uuml;r Antwortnachrichten festzulegen. W&auml;hlen Sie <code>content</code>, um die Contentauthentifizierung f&uuml;r Antwortnachrichten (z.B. digitale Signaturen) festzulegen. Lassen Sie das Feld leer, um keine Antwortquellen zu authentifizieren. Standardm&auml;&szlig;ig ist kein Authentifizierungstyp ausgew&auml;hlt.</p>
<p>Eine Beschreibung der Aktionen, die von den SOAP-Providern f&uuml;r die Nachrichtensicherheit ausgef&uuml;hrt werden, finden Sie unter <a href="ref-configreq-respolicy.html">Konfiguration von Anforderungs- und Antwort-Policy</a></p>
</li>
<li>
<p>W&auml;hlen Sie &uuml;ber die Dropdown-Liste "Empf&auml;ngerauthentifizierung", ob die Empf&auml;ngerauthentifizierung vor oder nach der Contentauthentifizierung f&uuml;r die Antwort-Policy stattfindet.</p>
<p>W&auml;hlen Sie <code>before-content</code> oder <code>after-content</code>, um eine Anforderung f&uuml;r die Authentifizierung des Empf&auml;ngers von Anforderungsnachrichten gegen&uuml;ber dem Absender auf Nachrichtenlayer festzulegen (durch XML-Verschl&uuml;sselung). Wenn der Wert nicht festgelegt ist, ist der Standard <code>after-content</code>. Policys werden in der Reihenfolge des Nachrichteneingangs angegeben, sodass der Nachrichtenempf&auml;nger die Nachricht bei Auswahl von <code>after-content</code> vor der Validierung der Signatur entschl&uuml;sselt.</p>
</li>
<li>
<p>Geben Sie im Abschnitt "Weitere Eigenschaften" weitere Eigenschaften an.</p>
<p>Um eine Eigenschaft hinzuzuf&uuml;gen, klicken Sie auf die Schaltfl&auml;che "Eigenschaft hinzuf&uuml;gen". Geben Sie in die daraufhin angezeigte leere Zeile den Eigenschaftsnamen in das Feld "Name" und den Eigenschaftswert in das Feld "Wert" ein.</p>
<p>Eine Beschreibung der zus&auml;tzlichen Eigenschaften, die f&uuml;r Providerkonfigurationen verf&uuml;gbar sind, finden Sie unter <a href="ref-messagesecurityproviderconfigprops.html">F&uuml;r die Konfiguration von Nachrichtensicherheitsprovidern spezifische Eigenschaften</a></p>
</li>
<li>
<p>Klicken Sie auf "OK".</p>
</li>
</ol>
<a id="sthref183" name="sthref183"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">So werden GlassFish Server-Funktionalit&auml;ten zur Verwendung durch Nachrichtensicherheitsprovider konfiguriert</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">So wird eine Nachrichtensicherheitskonfiguration erstellt</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">So wird eine Nachrichtensicherheitskonfiguration bearbeitet</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">So wird eine Nachrichtensicherheitskonfiguration gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">So wird eine Nachrichtensicherheitsproviderkonfiguration bearbeitet</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">So wird eine Nachrichtensicherheitsproviderkonfiguration gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">So wird die Nachrichtensicherheit f&uuml;r Anwendungsclients aktiviert</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
