<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-messagesecurityconfignew" name="task-messagesecurityconfignew"></a></p>

<h4><a id="sthref175" name="sthref175"></a>So wird eine Nachrichtensicherheitskonfiguration erstellt</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>In der Regel ist es nicht erforderlich, eine Nachrichtensicherheitskonfiguration zu erstellen. GlassFish Server umfasst eine Nachrichtensicherheitskonfiguration f&uuml;r die SOAP-Authentifizierungslayer. Die Provider f&uuml;r diese Konfiguration sind nicht standardm&auml;&szlig;ig aktiviert. Sie k&ouml;nnen sie jedoch aktivieren, indem Sie die SOAP-Nachrichtensicherheitskonfiguration bearbeiten. Sie k&ouml;nnen jedoch eine Konfiguration f&uuml;r die HttpServlet-Authentifizierungslayer erstellen und mindestens eine Providerkonfiguration f&uuml;r sie festlegen.</p>
<ol>
<li>
<p>Blenden Sie in der Navigationsbaumstruktur den Knoten "Konfiguration" ein.</p>
</li>
<li>
<p>Blenden Sie den Knoten "Sicherheit" ein.</p>
</li>
<li>
<p>W&auml;hlen Sie den Knoten "Nachrichtensicherheit".</p>
<p>Die Seite "Nachrichtensicherheitskonfigurationen" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie auf der Seite "Nachrichtensicherheitskonfigurationen" auf "Neu".</p>
<p>Die Seite "Neue Nachrichtensicherheitskonfiguration" wird ge&ouml;ffnet.</p>

<hr>
<p><b>Hinweis:</b></p>
Es ist nicht m&ouml;glich, Nachrichtensicherheitsprovider f&uuml;r die standardm&auml;&szlig;ige Konfiguration <code>server-config</code> zu erstellen oder zu l&ouml;schen. Die einzigen Nachrichtensicherheitsprovider, die f&uuml;r die standardm&auml;&szlig;ige Konfiguration <code>server-config</code> unterst&uuml;tzt werden, sind SOAP und HttpServlet. Da diese beiden Nachrichtensicherheitsprovider bei der Installation von GlassFish Server standardm&auml;&szlig;ig erstellt werden, wird die Schaltfl&auml;che "Neu" auf der Seite "Nachrichtensicherheitskonfigurationen" f&uuml;r die Standardkonfiguration <code>server-config</code> ausgegraut.
<hr>

</li>
<li>
<p>W&auml;hlen Sie auf der Seite "Neue Nachrichtensicherheitskonfiguration" aus der Dropdown-Liste "Authentifizierungslayer" eine Nachrichtenlayer, f&uuml;r die Sie eine Konfiguration erstellen.</p>
<p>Da eine SOAP-Konfiguration standardm&auml;&szlig;ig zur Verf&uuml;gung steht, lautet die einzige Auswahl <code>HttpServlet</code>.</p>
</li>
<li>
<p>Geben Sie im Feld "Provider-ID" die eindeutige ID der Providerkonfiguration f&uuml;r diese Nachrichtensicherheitskonfiguration ein.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Standardprovider", um festzulegen, dass diese Providerkonfiguration der Standardprovider ist.</p>
</li>
<li>
<p>W&auml;hlen Sie aus der Dropdown-Liste "Providertyp" den Typ dieses Providers.</p>
<p>Zur Auswahl stehen:</p>
<dl>
<dt><code>client</code></dt>
<dd>
<p>Legt fest, dass der Provider der Clientauthentifizierungsprovider ist.</p>
</dd>
<dt><code>server</code></dt>
<dd>
<p>Legt fest, dass der Provider der Serverauthentifizierungsprovider ist.</p>
</dd>
<dt><code>client-server</code></dt>
<dd>
<p>Legt fest, dass der Provider sowohl ein Client- als auch ein Serverauthentifizierungsprovider ist.</p>
</dd>
</dl>
</li>
<li>
<p>Geben Sie im Feld "Klassename" den Namen der Java-Implementierungsklasse des Providers an.</p>
<p>Clientauthentifizierungsprovider m&uuml;ssen die <code>com.sun.enterprise.security.jauth.ClientAuthModule</code>-Schnittstelle implementieren. Serverseitige Provider m&uuml;ssen die <code>com.sun.enterprise.security.jauth.ServerAuthModule</code>-Schnittstelle implementieren. Clientserver-Provider m&uuml;ssen beide Schnittstellen implementieren.</p>
</li>
<li>
<p>Geben Sie im Abschnitt "Weitere Eigenschaften" weitere Eigenschaften an.</p>
<p>Um eine Eigenschaft hinzuzuf&uuml;gen, klicken Sie auf die Schaltfl&auml;che "Eigenschaft hinzuf&uuml;gen". Geben Sie in die daraufhin angezeigte leere Zeile den Eigenschaftsnamen in das Feld "Name" und den Eigenschaftswert in das Feld "Wert" ein.</p>
<p>GlassFish Server definiert keine weiteren Eigenschaften von Nachrichtensicherheitskonfigurationen.</p>
</li>
</ol>
<a id="sthref176" name="sthref176"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">So werden GlassFish Server-Funktionalit&auml;ten zur Verwendung durch Nachrichtensicherheitsprovider konfiguriert</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">So wird eine Nachrichtensicherheitskonfiguration bearbeitet</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">So wird eine Nachrichtensicherheitskonfiguration gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">So wird eine Nachrichtensicherheitsproviderkonfiguration erstellt</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">So wird eine Nachrichtensicherheitsproviderkonfiguration bearbeitet</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">So wird eine Nachrichtensicherheitsproviderkonfiguration gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">So wird die Nachrichtensicherheit f&uuml;r Anwendungsclients aktiviert</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
