<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-appdeployejb" name="task-appdeployejb"></a><a id="GHCOM00160" name="GHCOM00160"></a></p>

<h4><a id="sthref67" name="sthref67"></a><a id="sthref68" name="sthref68"></a><a id="sthref69" name="sthref69"></a>So wird ein EJB-JAR bereitgestellt</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>W&auml;hlen Sie in der Navigationsbaumstruktur den Anwendungsknoten.</p>
<p>Die Seite "Anwendungen" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie in der Tabelle "Bereitgestellte Anwendungen" auf die Schaltfl&auml;che "Bereitstellen".</p>
<p>Die Seite "Anwendungen oder Module bereitstellen" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Geben Sie das Verzeichnis der bereitzustellenden Anwendung an.</p>
<ul>
<li>
<p>Wenn es sich bei der Anwendung um eine Archivdatei handelt, die auf dem Clientcomputer gespeichert oder &uuml;ber diesen zug&auml;nglich ist, w&auml;hlen Sie die Option "Gepackte Datei zum Hochladen auf den Server".</p>
<p>Der Clientrechner ist der Host, auf dem Sie die Administrationskonsole &uuml;ber einen Browser anzeigen.</p>
<p>Klicken Sie auf "Durchsuchen", um nach der Datei zu suchen, oder geben Sie den vollst&auml;ndigen Pfad zu der Datei ein.</p>
</li>
<li>
<p>Wenn es sich bei der Anwendung um eine Archivdatei handelt, die auf dem Servercomputer gespeichert ist, oder um eine nicht gepackte Anwendung aus einem entpackten Verzeichnis, w&auml;hlen Sie die Option "Lokale gepackte Datei oder Verzeichnis, auf die/das von GlassFish Server aus zugegriffen werden kann".</p>
<p>Der Serverrechner ist der Host, der den Domain Administration Server (DAS) ausf&uuml;hrt.</p>
<p>Klicken auf "Dateien durchsuchen", um zu einer Datei zu gelangen, oder auf "Ordner durchsuchen", um zu einem Verzeichnis zu gelangen. Alternativ k&ouml;nnen Sie auch den vollst&auml;ndigen Pfadnamen zur Datei oder zum Verzeichnis eingeben. Das Deployment aus einem entpackten Verzeichnis ist f&uuml;r erfahrene Entwickler vorgesehen und wird f&uuml;r Production-Umgebungen nicht empfohlen.</p>
</li>
</ul>
</li>
<li>
<p>W&auml;hlen Sie "EJB-JAR" aus der Dropdown-Liste "Typ".</p>
<p>Wenn Sie entweder eine gepackte Datei angegeben haben, die auf den Server hochgeladen werden soll, oder eine lokale gepackte Datei, die von GlassFish Server aus zug&auml;nglich ist, wird der Anwendungstyp automatisch erkannt. Wenn Sie ein Verzeichnis festgelegt haben, auf das von GlassFish Server aus zugegriffen werden kann, m&uuml;ssen Sie den Typ manuell festlegen.</p>
</li>
<li>
<p>Im Feld "Anwendungsname" k&ouml;nnen Sie den Standardnamen (der Verzeichnisname oder das Pr&auml;fix des Dateinamens) beibehalten oder einen anderen Namen eingeben.</p>
<p>Der Standardname wird angezeigt, wenn Sie eine Datei f&uuml;r den Upload ausw&auml;hlen. Der Anwendungsname muss eindeutig sein.</p>
<p>Der Name kann eine optionale Versions-ID enthalten, die dem Namen folgt und von diesem durch einen Doppelpunkt (<code>:</code>) getrennt ist. Die Versions-ID muss mit einem Buchstaben oder einer Zahl beginnen. Er kann alphanumerische Zeichen sowie Unterstriche (<code>_</code>), Bindestriche (<code>-</code>) und Punkte (<code>.</code>) enthalten. Weitere Informationen zu Modul- und Anwendungsversionen finden Sie unter <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> im <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Status aktiviert", um die Anwendung zu aktivieren.</p>
<p>Diese Option ist standardm&auml;&szlig;ig aktiviert. Wenn diese Option deaktiviert wird, ist die Anwendung nicht verf&uuml;gbar.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Verf&uuml;gbarkeit aktiviert", um das SFSB-Checkpointing f&uuml;r die Anwendung zu aktivieren.</p>
<p>Wenn dieses Kontrollk&auml;stchen aktiviert ist, wird die Hochverf&uuml;gbarkeit f&uuml;r die Stateful Session-Bean (SFSB)-Fixpunktroutine und m&ouml;glicherweise die Passivierung aktiviert. Ist der Wert auf False (Standardwert) gesetzt, werden alle SFSB-Fixpunktroutinen f&uuml;r das angegebene EJB-Modul deaktiviert. Ist der Wert auf True gesetzt, wird das angegebene EJB-Modul f&uuml;r Hochverf&uuml;gbarkeit aktiviert. Setzen Sie diese Option nur dann auf "True", wenn die Hochverf&uuml;gbarkeit auf einer h&ouml;heren Ebene konfiguriert und aktiviert ist, beispielsweise auf Server- und Containerebene.</p>
<p>Diese Option wird angezeigt, wenn neben der standardm&auml;&szlig;igen Serverinstanz (<code>server</code>) Cluster oder eigenst&auml;ndige Serverinstanzen vorhanden sind.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Verifier ausf&uuml;hren", um die Deployment-Deskriptoren vor dem Deployment zu verifizieren.</p>
<p>Wenn die &Uuml;berpr&uuml;fung bei Auswahl dieser Option nicht erfolgreich ist, findet kein Deployment statt. Der Verifier &uuml;berpr&uuml;ft Struktur und Content der Deployment-Deskriptoren. Die &Uuml;berpr&uuml;fung von gro&szlig;en Anwendungen ist h&auml;ufig sehr zeitaufwendig. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
<p>Verifier-Packages m&uuml;ssen mithilfe des Updatetools installiert werden. Andernfalls wird eine Warnung protokolliert und diese Option wird ignoriert.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Kompatibilit&auml;t", um GlassFish Server v2 JAR-Sichtbarkeitsanforderungen f&uuml;r Anwendungen anstelle der strikteren Java EE 6-Anforderungen zu verwenden, die in GlassFish Server v3-Versionen einschlie&szlig;lich 4.0 implementiert sind.</p>
<p>Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
<p>Die Java EE 6-Plattformspezifikation enth&auml;lt striktere Anforderungen als Java EE 5, was die Sichtbarkeit bestimmter JAR-Dateien f&uuml;r verschiedene Module innerhalb einer EAR-Datei angeht. Insbesondere d&uuml;rfen Anwendungsclients keinen Zugriff auf EJB-JAR-Dateien oder andere JAR-Dateien in der EAR-Datei haben, es sei denn, Referenzen verwenden den standardm&auml;&szlig;igen Java SE-Mechanismus (beispielsweise Erweiterungen) oder den Java EE-Library-Verzeichnismechanismus. Wenn dieses Kontrollk&auml;stchen aktiviert wird, werden diese Java EE 6-Beschr&auml;nkungen entfernt.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Erneutes Deployment erzwingen", um das erneute Deployment zu erzwingen, wenn die Anwendung bereits bereitgestellt ist.</p>
<p>Ist diese Option nicht ausgew&auml;hlt, wird beim Versuch, eine bereits bereitgestellte Anwendung bereitzustellen, eine Fehlermeldung angezeigt. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Status beibehalten", um Websessions, SFSB-Instanzen und persistent erstellte EJB-Timer zwischen erneuten Deployments beizubehalten.</p>
<p>Diese Option ist standardm&auml;&szlig;ig deaktiviert. Diese Option wird nur bei der standardm&auml;&szlig;igen Serverinstanz (<code>server</code>) unterst&uuml;tzt. Bei anderen Zielen wird sie nicht unterst&uuml;tzt und ignoriert.</p>
<p>&Auml;nderungen, die an einer Anwendung zwischen Deployments vorgenommen werden, verhindern, dass diese Funktion richtig funktioniert. Beispiel: &Auml;ndern Sie die Instanzenvariablen in der SFSB-Bean-Klasse nicht.</p>
<p>Bei Webanwendungen ist dieses Feature nur dann anwendbar, wenn in der Datei <code>glassfish-web-app.xml</code> das Attribut <code>persistence-type</code> des Elements <code>session-manager</code> <code>file</code> lautet.</p>
<p>Bei Stateful-Session-Bean-Instanzen wird der Persistenztyp ohne hohe Verf&uuml;gbarkeit im Server festgelegt (die Option "SFSB-Persistenztyp") und muss auf <code>file</code>, den empfohlenen Standardwert, gesetzt werden.</p>
<p>Kann eine aktive Websession, SFSB-Instanz oder ein EJB-Timer nicht gespeichert oder wiederhergestellt werden, stehen diese <i>nicht</i> zur Verf&uuml;gung, wenn das erneute Deployment abgeschlossen ist. Das erneute Deployment wird jedoch fortgesetzt, und eine Warnmeldung wird aufgezeichnet.</p>
<p>Damit die Daten aktiver Zust&auml;nde erhalten bleiben, werden die Daten von GlassFish Server serialisiert und gespeichert. Zum Wiederherstellen der Daten deserialisiert der Class Loader der erneut bereitgestellten Anwendung die Daten, die zuvor gespeichert wurden.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Anwendungsspezifische Ressourcen beibehalten", um f&uuml;r bestimmte Anwendungen definierte Ressourcen beizubehalten und w&auml;hrend des erneuten Deployments wiederherzustellen.</p>
<p>Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Geben Sie im Feld "Deployment-Reihenfolge" eine Nummer ein, um die Deployment-Reihenfolge der Anwendung anzugeben.</p>
<p>Anwendungen mit einer niedrigeren Nummer werden beim Hochfahren des Servers zuerst geladen. Eine Anwendung mit einer Deployment-Reihenfolge von 102 wird vor einer Anwendung mit einer Deployment-Reihenfolge von 110 geladen. Wenn beim Deployment einer Anwendung keine Deployment-Reihenfolge angegeben wird, wird die Standard-Deployment-Reihenfolge von 100 zugewiesen. Wenn zwei Anwendungen dieselbe Deployment-Reihenfolge haben, wird die Anwendung, die zuerst bereitgestellt wurde, zuerst geladen. Die Angabe einer Deployment-Reihenfolge ist sinnvoll, wenn die Anwendung Abh&auml;ngigkeiten hat und in einer bestimmten Reihenfolge geladen werden muss.</p>
</li>
<li>
<p>Geben Sie im Feld "Librarys" eine durch Komma getrennte Liste von Library-JAR-Dateien ein, die f&uuml;r diese Anwendung spezifisch sind.</p>
<p>Die Pfade k&ouml;nnen absolut oder relativ sein. Ein relativer Pfad ist relativ zu domain-dir<code>/lib/applibs</code>. Wenn der Pfad absolut ist, muss der Pfad f&uuml;r den Domain Administration Server (DAS) zug&auml;nglich sein. Dies bedeutet, dass er sich unter domain-dir befinden muss. Die Librarys werden der Anwendung in der Reihenfolge zur Verf&uuml;gung gestellt, in der sie angegeben sind.</p>
</li>
<li>
<p>Geben Sie im Feld "Beschreibung" eine Beschreibung dieser Anwendung ein.</p>
</li>
<li>
<p>Um Zielserverinstanzen und Cluster hinzuzuf&uuml;gen, auf denen das Modul oder die Anwendung bereitgestellt werden soll, w&auml;hlen Sie "Zielserverinstanzen" oder "Cluster" aus der Liste "Verf&uuml;gbare Ziele" und verwenden die Schaltfl&auml;che "Hinzuf&uuml;gen", um sie in die Liste "Ausgew&auml;hlte Ziele" zu verschieben.</p>
<p>Die Option "Ziel" wird angezeigt, wenn neben der standardm&auml;&szlig;igen Serverinstanz (<code>server</code>) Cluster oder eigenst&auml;ndige Serverinstanzen vorhanden sind. Das Modul oder die Anwendung wird standardm&auml;&szlig;ig f&uuml;r die standardm&auml;&szlig;ige Serverinstanz <code>server</code> bereitgestellt. Verwenden Sie die Schaltfl&auml;che "Alle hinzuf&uuml;gen", um das Deployment f&uuml;r alle Ziele durchzuf&uuml;hren. Verwenden Sie die Schaltfl&auml;chen "Entfernen" und "Alle entfernen", um Ziele aus der Liste "Ausgew&auml;hlte Ziele" zu entfernen.</p>
</li>
<li>
<p>Klicken Sie auf "OK".</p>
</li>
</ol>
<a id="sthref70" name="sthref70"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-applistdeployed.html">So wird eine Liste der bereitgestellten Anwendungen angezeigt</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">So wird eine Webanwendung bereitgestellt</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">So wird eine Unternehmensanwendung bereitgestellt</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">So wird ein Anwendungsclient bereitgestellt</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">So stellen Sie ein Connector-Modul bereit</a></p>
</li>
<li>
<p><a href="task-appedit.html">So wird eine bereitgestellte Anwendung bearbeitet</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">So werden Deskriptoren einer Anwendung angezeigt</a></p>
</li>
<li>
<p><a href="task-endpoint.html">So werden End Point-Informationen f&uuml;r einen Webservice angezeigt</a></p>
</li>
<li>
<p><a href="task-applaunch.html">So wird eine Anwendung gestartet</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">So wird ein Anwendungsclient gestartet</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">So werden Anwendungsclient-Stubs heruntergeladen</a></p>
</li>
<li>
<p><a href="task-appredeploy.html">So wird eine bereitgestellte Anwendung erneut bereitgestellt</a></p>
</li>
<li>
<p><a href="task-apprestart.html">So wird eine bereitgestellte Anwendung erneut geladen</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">So werden anwendungsspezifische Ressourcen angezeigt</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">So werden anwendungsspezifische Ressourcen ge&auml;ndert</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
