<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-filter-logs" name="task-filter-logs"></a><a id="GHCOM00148" name="GHCOM00148"></a></p>

<h4>So werden angezeigte Logdatens&auml;tze gefiltert</h4>
<a name="BEGIN" id="BEGIN"></a><a id="sthref26" name="sthref26"></a>
<h5>Bevor Sie beginnen</h5>
<p>Stellen Sie sicher, dass Sie die Logdateien f&uuml;r den Domain Administration Server (DAS), eine GlassFish Server-Clusterinstanz oder eine eigenst&auml;ndige Instanz anzeigen. Weitere Informationen finden Sie unter den folgenden Themen:</p>
<ul>
<li>
<p><a href="task-logviewer.html">So werden Logdateien f&uuml;r DAS angezeigt</a></p>
</li>
<li>
<p><a href="../../../cluster/en/help/task-view-logs-clustered-instance.html">So zeigen Sie Logdateien f&uuml;r eine GlassFish Server-Clusterinstanz an</a></p>
</li>
<li>
<p><a href="../../../cluster/en/help/task-view-logs-standalone-instance.html">So zeigen Sie Logdateien f&uuml;r eine Standalone-GlassFish Server-Instanz an</a></p>
</li>
</ul>
<ol>
<li>
<p>Filtern Sie im Bereich "Suchkriterien" die Datens&auml;tze nach Content, Zeitraum und Logebene.</p>
<ol type="a">
<li>
<p>Um nur Datens&auml;tze anzuzeigen, die einen bestimmten Text enthalten, geben Sie im Feld "Textsuche" den betreffenden Text ein.</p>
<p>Bei der Suche wird zwischen Gro&szlig;- und Kleinschreibung unterschieden.</p>
</li>
<li>
<p>Um auszuw&auml;hlen, wie lange Logdatens&auml;tze angezeigt werden, verwenden Sie die Option "Zeitstempel".</p>
<ul>
<li>
<p>Um die aktuellsten Meldungen anzuzeigen, w&auml;hlen Sie "Aktuell" (Standardeinstellung).</p>
</li>
<li>
<p>Um Meldungen aus einem bestimmten Zeitraum anzuzeigen, w&auml;hlen Sie "Bestimmter Zeitraum", und geben Sie einen Datums- und Uhrzeitwert in die Felder "Von" und "Bis" ein.</p>
<p>Der Wert "Datum" muss folgendes Format aufweisen:</p>
<pre>
<i>MM</i>/<i>DD</i>/<i>YY</i>
</pre>
<p><code><i>MM</i></code> ist eine Ganzzahl im Bereich 1-12 f&uuml;r die Monatszahl; Beispiel: 1 f&uuml;r Januar oder 10 f&uuml;r Oktober. <code><i>DD</i></code> ist eine Ganzzahl im Bereich 1-31 f&uuml;r den Tag des Monats. <code><i>YY</i></code> sind die beiden letzten Ziffern des Jahres; Beispiel: 11 f&uuml;r das Jahr 2011.</p>
<p>Beispiel: Um das Datum 1. Februar 2011 anzugeben, geben Sie <code>2/1/11</code> in das Feld "Datum" ein.</p>
<p>Der Wert "Zeit" muss folgendes Format aufweisen:</p>
<pre>
<i>hh</i>:<i>mm</i>:<i>ss</i>.<i>SSS</i>
</pre>
<p><code><i>hh</i></code> ist eine Ganzzahl im Bereich 0-23 zur Darstellung der Stunde. F&uuml;r Zeiten am Nachmittag verwenden Sie Ganzzahlen im Bereich von 12-23; Beispiel: 14 f&uuml;r 2 Uhr nachmittags. <code><i>mm</i></code> ist eine Ganzzahl im Bereich 0-59 f&uuml;r die Anzahl von Minuten nach Angabe der Stunde. <code><i>ss</i></code> ist eine Ganzzahl im Bereich 0-59 f&uuml;r die Anzahl von Sekunden. <code><i>SSS</i></code> ist eine dreistellige Ganzzahl, gegebenenfalls mit f&uuml;hrenden Nullen, im Bereich 000-999 f&uuml;r die Anzahl von Millisekunden.</p>
<p>Beispiel: Um die Zeit 5:10 Uhr nachmittags anzugeben, geben Sie im Feld "Zeit" <code>17:10:00.000</code> ein.</p>
<p>Wenn der Wert im Feld "Von" zeitlich hinter dem Wert in "Bis" liegt, wird eine Fehlermeldung angezeigt.</p>
</li>
</ul>
</li>
<li>
<p>Meldungen nach Logebene filtern.</p>
<p>Um sicherzustellen, dass die Meldungen, die Sie anzeigen m&ouml;chten, im Serverlog angezeigt werden, definieren Sie zun&auml;chst auf der Seite "Modullogebenen" die entsprechenden Logebenen. Weitere Anweisungen finden Sie in <a href="task-eelogginglevels.html">So werden Logebenen konfiguriert</a>.</p>
<p>Wenn Sie sich f&uuml;r eine Filterung von Logmeldungen basierend auf der Logebene entschieden haben, werden nur Meldungen angezeigt, die den angegebenen Filterkriterien entsprechen. Diese Filterung wirkt sich jedoch nicht darauf aus, welche Meldungen im Serverlog aufgezeichnet werden.</p>
<ol>
<li>
<p>W&auml;hlen Sie aus der Dropdown-Liste "Logebene" die Logebene.</p>
</li>
<li>
<p>Um Meldungen ausschlie&szlig;lich auf der gew&auml;hlten Ebene anzuzeigen, aktivieren Sie die Option "Keine weiteren als schwerwiegend eingestuften Meldungen aufnehmen".</p>
<p>Standardm&auml;&szlig;ig werden alle im Serverlog enthaltenen Meldungen angezeigt, die der gew&auml;hlten Logebene oder einer Ebene mit h&ouml;herer Dringlichkeit entsprechen.</p>
</li>
</ol>
</li>
</ol>
</li>
<li>
<p>Im Bereich "Erweiterte Suche" filtern Sie Datens&auml;tze entsprechend dem Logger Namespace und w&auml;hlen den Informationsumfang, der angezeigt wird.</p>
<ol type="a">
<li>
<p>Klicken Sie auf den Link "Erweiterte Suche".</p>
<p>Der Bereich "Erweiterte Suche" wird in das Fenster "Log Viewer" eingef&uuml;gt.</p>
</li>
<li>
<p>Um nach Modul zu filtern, w&auml;hlen Sie aus der Dropdown-Liste "Logger" mindestens einen Namespaces.</p>
<p>Klicken Sie bei gedr&uuml;ckter Umschalt- oder Strg-Taste, um mehrere Namespaces auszuw&auml;hlen.</p>
<p>Die Auswahl eines Namespaces einer h&ouml;heren Ebene f&uuml;hrt zur Auswahl aller darunter angeordneten Namespaces. Beispiel: Wenn Sie <code>javax.enterprise.system</code> ausw&auml;hlen, werden auch die Logger aller Module unterhalb dieses Namespace ausgew&auml;hlt, wie <code>javax.enterprise.system.core</code>, <code>javax.enterprise.system.tools.admin</code> usw.</p>
</li>
<li>
<p>Um Meldungen von Loggern f&uuml;r eine bestimmte Anwendung anzuzeigen, geben Sie im Feld "Benutzerdefinierter Logger" den Namen jedes Loggers auf jeweils einer separaten Zeile ein.</p>
<p>Wenn die Anwendung &uuml;ber mehrere Module verf&uuml;gt, k&ouml;nnen Sie einige oder alle dieser Module anzeigen. Beispielsweise kann eine Anwendung &uuml;ber folgende Protokollfunktionen verf&uuml;gen:</p>
<pre>
com.example.myapp.module1
com.example.myapp.module2
com.example.myapp.module3
</pre>
<p>Um Meldungen aller Module in der Anwendung anzuzeigen, geben Sie <code>com.mycompany.myapp</code> ein. Um nur Meldungen von <code>module2</code> anzuzeigen, geben Sie <code>com.example.myapp.module2</code> ein.</p>
<p>Wenn Sie mindestens einen benutzerdefinierten Logger angeben, werden Meldungen von GlassFish Server-Modulen nur dann angezeigt, wenn Sie sie im Bereich "Logger" explizit auff&uuml;hren.</p>
</li>
<li>
<p>W&auml;hlen Sie aus der Dropdown-Liste "Anzeigen" die Meldungen, die angezeigt werden sollen.</p>
<p>Als Standardanzeige f&uuml;r Meldungen wird 40 angezeigt. Dar&uuml;ber hinaus stehen 100, 250 und 1000 zur Auswahl.</p>
</li>
<li>
<p>Um Stacktraces anzuzeigen, deaktivieren Sie die Option "Sehr lange Meldungen begrenzen".</p>
<p>Standardm&auml;&szlig;ig werden im Viewer keine Stacktraces angezeigt. Um Stacktraces anzuzeigen, klicken Sie auf den Link (Details) f&uuml;r eine Meldung.</p>
</li>
<li>
<p>Um den Bereich "Erweiterte Suche" auszublenden, klicken Sie auf den Link "Einfache Suche".</p>
</li>
</ol>
</li>
<li>
<p>Um die Instanz und die zugeh&ouml;rige Logdatei anzugeben, die Sie anzeigen m&ouml;chten, verwenden Sie den Bereich "Suche modifizieren".</p>
<ul>
<li>
<p>W&auml;hlen Sie aus der Dropdown-Liste "Instanz" die Instanz.</p>
<p>Der Standardwert ist die Instanz, f&uuml;r die Sie anfangs festgelegt hatten, dass Logdateien angezeigt werden sollen. Wenn Sie festgelegt haben, dass Logdateien f&uuml;r den Domain Administration Server (DAS) angezeigt werden sollen, lautet der Standardwert, der den DAS angibt, "server".</p>
</li>
<li>
<p>W&auml;hlen Sie aus der Dropdown-Liste "Logdatei" die Logdatei.</p>
<p>Der Standardname lautet <code>server.log</code>. Andere Optionen h&auml;ngen von den Logeinstellungen f&uuml;r das gew&auml;hlte Ziel ab.</p>
</li>
</ul>
</li>
<li>
<p>Passen Sie im Bereich "Suchergebnisse" die Anzeige von Logmeldungen an.</p>
<p>Im Bereich "Suchergebnisse" werden entsprechend den Einstellungen auf den Seiten "Logging-Einstellungen" und "Logebenen" die letzten 40 Eintr&auml;ge des Serverlogs angezeigt.</p>
<ul>
<li>
<p>Um die Meldungen unterschiedlich zu sortieren, klicken Sie auf die Pfeile in den Spalten.</p>
</li>
<li>
<p>Um eine formatierte Version einer Meldung anzuzeigen, klicken Sie auf den Link (Details) f&uuml;r eine Meldung.</p>
<p>Es wird ein Fenster "Logeintragsdetail" angezeigt, das eine formatierte Version der Meldung enth&auml;lt.</p>
</li>
<li>
<p>Um vorhergehende oder nachfolgende Eintr&auml;ge in der Logdatei anzuzeigen, klicken Sie auf die Schaltfl&auml;chen "Eintr&auml;ge vor" bzw. "Eintr&auml;ge nach", die sich am oberen Rand der Tabelle befinden.</p>
</li>
</ul>
</li>
</ol>
<a id="sthref27" name="sthref27"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-eelogging.html">So werden allgemeine Logging-Einstellungen konfiguriert</a></p>
</li>
<li>
<p><a href="task-eelogginglevels.html">So werden Logebenen konfiguriert</a></p>
</li>
<li>
<p><a href="task-logviewer.html">So werden Logdateien f&uuml;r DAS angezeigt</a></p>
</li>
<li>
<p><a href="../../../cluster/en/help/task-view-logs-clustered-instance.html">So zeigen Sie Logdateien f&uuml;r eine GlassFish Server-Clusterinstanz an</a></p>
</li>
<li>
<p><a href="../../../cluster/en/help/task-view-logs-standalone-instance.html">So zeigen Sie Logdateien f&uuml;r eine Standalone-GlassFish Server-Instanz an</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
