<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-appedit" name="task-appedit"></a></p>

<h4><a id="sthref48" name="sthref48"></a>So wird eine bereitgestellte Anwendung bearbeitet</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>W&auml;hlen Sie in der Navigationsbaumstruktur den Anwendungsknoten.</p>
<p>Die Seite "Anwendungen" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie in der Tabelle "Bereitgestellte Anwendungen" auf den Namen der zu bearbeitenden Anwendung.</p>
<p>Der Name kann eine optionale Versions-ID enthalten, die dem Namen folgt und von diesem durch einen Doppelpunkt (<code>:</code>) getrennt ist. Weitere Informationen zu Modul- und Anwendungsversionen finden Sie unter <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> im <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
<p>Die Seite "Anwendung bearbeiten" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Entfernen Sie die Markierung des Kontrollk&auml;stchens "Status aktiviert", um die Anwendung zu deaktivieren, so dass sie nicht verf&uuml;gbar ist.</p>
<p>Standardm&auml;&szlig;ig ist der Status einer Anwendung mit dem Deployment "Aktiviert".</p>
</li>
<li>
<p>Geben Sie f&uuml;r eine Webanwendung im Feld "Context Root" den Pfad f&uuml;r die Anwendung ein.</p>
<p>In der URL der Webanwendung folgt Context Root unmittelbar auf die Portnummer (<code>http://</code><i>host</i><code>:</code><i>port</i><code>/</code><i>context-root</i><code>/...</code>). Context Root muss mit einem Schr&auml;gstrich beginnen, Beispiel: <code>/hello</code>.</p>
</li>
<li>
<p>Deaktivieren Sie das Kontrollk&auml;stchen "Verf&uuml;gbarkeit aktiviert", um die Sessionpersistenz und das SFSB-Checkpointing f&uuml;r die Anwendung zu deaktivieren.</p>
<p>Wenn dieses Kontrollk&auml;stchen aktiviert ist, wird die Hochverf&uuml;gbarkeit f&uuml;r Websessions und f&uuml;r die Stateful Session-Bean (SFSB)-Fixpunktroutine und m&ouml;glicherweise die Passivierung aktiviert. Ist der Wert auf "False" (Standardwert) gesetzt, werden alle Websession-Speichervorg&auml;nge und SFSB-Checkpoints f&uuml;r die angegebene Anwendung, Webanwendung oder das EJB-Modul deaktiviert. Ist der Wert auf "True" gesetzt, wird die angegebene Anwendung oder das Modul f&uuml;r Hochverf&uuml;gbarkeit aktiviert. Setzen Sie diese Option nur dann auf "True", wenn die Hochverf&uuml;gbarkeit auf einer h&ouml;heren Ebene konfiguriert und aktiviert ist, beispielsweise auf Server- und Containerebene.</p>
<p>Diese Option wird angezeigt, wenn neben der standardm&auml;&szlig;igen Serverinstanz (<code>server</code>) Cluster oder eigenst&auml;ndige Serverinstanzen vorhanden sind.</p>
</li>
<li>
<p>W&auml;hlen Sie aus der Dropdown-Liste "Virtuelle Server" den mit dieser Anwendung zu verkn&uuml;pfenden virtuellen Server.</p>
<p>Die Option "Virtuelle Server" wird angezeigt, wenn nur die Standardserverinstanz <code>server</code> vorhanden ist. Wenn Cluster oder andere Standalone-Serverinstanzen vorhanden sind, k&ouml;nnen Sie nach dem Deployment virtuelle Server ausw&auml;hlen. W&auml;hlen Sie auf der Seite "Anwendung bearbeiten" die Registerkarte "Ziel" und anschlie&szlig;end "Virtuelle Server verwalten" f&uuml;r das gew&uuml;nschte Ziel.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Java Web Start aktiviert", um die Java Web Start-Software zum Deployment der Anwendung zu verwenden.</p>
<p>Diese Option ist standardm&auml;&szlig;ig aktiviert oder deaktiviert, was von der Einstellung zum Zeitpunkt des urspr&uuml;nglichen Deployments abh&auml;ngt.</p>
</li>
<li>
<p>Geben Sie im Feld "Deployment-Reihenfolge" eine Nummer ein, um die Deployment-Reihenfolge der Anwendung anzugeben.</p>
<p>Anwendungen mit einer niedrigeren Nummer werden beim Hochfahren des Servers zuerst geladen. Eine Anwendung mit einer Deployment-Reihenfolge von 102 wird vor einer Anwendung mit einer Deployment-Reihenfolge von 110 geladen. Wenn beim Deployment einer Anwendung keine Deployment-Reihenfolge angegeben wird, wird die Standard-Deployment-Reihenfolge von 100 zugewiesen. Wenn zwei Anwendungen dieselbe Deployment-Reihenfolge haben, wird die Anwendung, die zuerst bereitgestellt wurde, zuerst geladen. Die Angabe einer Deployment-Reihenfolge ist sinnvoll, wenn die Anwendung Abh&auml;ngigkeiten hat und in einer bestimmten Reihenfolge geladen werden muss.</p>
</li>
<li>
<p>Geben Sie im Feld "Beschreibung" eine Beschreibung dieser Anwendung ein.</p>
</li>
<li>
<p>Zum Anzeigen der Liste mit den Moduldeskriptoren f&uuml;r die Anwendung klicken Sie auf die Registerkarte "Beschreibung". Weitere Einzelheiten finden Sie unter <a href="task-appviewdesc.html">So werden Deskriptoren einer Anwendung angezeigt</a>.</p>
</li>
<li>
<p>Der Status einer Anwendung ist standardm&auml;&szlig;ig f&uuml;r alle Ziele aktiviert. Klicken Sie auf die Registerkarte "Ziele", um die Ziele anzuzeigen, auf denen die Anwendung aktiviert wurde. Sie k&ouml;nnen Anwendungen f&uuml;r mindestens ein Ziel aktivieren oder deaktivieren. Siehe <a href="task-appviewtargets.html">So werden Anwendungsziele angezeigt</a></p>
</li>
<li>
<p>Klicken Sie auf "Speichern".</p>
</li>
</ol>
<a id="GHCOM248" name="GHCOM248"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-applistdeployed.html">So wird eine Liste der bereitgestellten Anwendungen angezeigt</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">So wird eine Webanwendung bereitgestellt</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">So wird eine Unternehmensanwendung bereitgestellt</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">So wird ein Anwendungsclient bereitgestellt</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">So stellen Sie ein Connector-Modul bereit</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">So wird ein EJB-JAR bereitgestellt</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">So werden Deskriptoren einer Anwendung angezeigt</a></p>
</li>
<li>
<p><a href="task-appviewtargets.html">So werden Anwendungsziele angezeigt</a></p>
</li>
<li>
<p><a href="task-endpoint.html">So werden End Point-Informationen f&uuml;r einen Webservice angezeigt</a></p>
</li>
<li>
<p><a href="task-applaunch.html">So wird eine Anwendung gestartet</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">So wird ein Anwendungsclient gestartet</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">So werden Anwendungsclient-Stubs heruntergeladen</a></p>
</li>
<li>
<p><a href="task-appredeploy.html">So wird eine bereitgestellte Anwendung erneut bereitgestellt</a></p>
</li>
<li>
<p><a href="task-apprestart.html">So wird eine bereitgestellte Anwendung erneut geladen</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">So werden anwendungsspezifische Ressourcen angezeigt</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">So werden anwendungsspezifische Ressourcen ge&auml;ndert</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
