<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-setadvanceappconfig" name="task-setadvanceappconfig"></a></p>

<h4><a id="sthref7" name="sthref7"></a><a id="sthref8" name="sthref8"></a><a id="sthref9" name="sthref9"></a><a id="sthref10" name="sthref10"></a><a id="sthref11" name="sthref11"></a>So wird die Anwendungskonfiguration festgelegt</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Auf dieser Seite k&ouml;nnen Sie die Eigenschaften f&uuml;r die Anwendungskonfiguration festlegen, um sicherzustellen, dass &Auml;nderungen an bereitgestellten Anwendungen ermittelt und die ge&auml;nderten Klassen neu geladen werden.</p>
<ol>
<li>
<p>W&auml;hlen Sie in der Navigationsbaumstruktur den Knoten "Domain".</p>
<p>Die Seite "Domainattribute" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>W&auml;hlen Sie die Registerkarte "Anwendungskonfiguration".</p>
<p>Die Seite "Anwendungskonfiguration" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Neu laden aktiviert", um das dynamische erneute Laden von Anwendungen zu aktivieren.</p>
<p>Wenn das dynamische erneute Laden aktiviert ist, m&uuml;ssen Sie eine Anwendung oder ein Modul nicht erneut bereitstellen, wenn sich der zugeh&ouml;rige Code oder die Deployment-Deskriptoren &auml;ndern. Sie m&uuml;ssen lediglich die ge&auml;nderten JavaServer Pages (JSP) oder Klassendateien in das Deployment-Verzeichnis f&uuml;r die Anwendung oder das Modul kopieren. Der Server pr&uuml;ft das Deployment-Verzeichnis regelm&auml;&szlig;ig auf &Auml;nderungen und stellt die Anwendung automatisch und dynamisch, einschlie&szlig;lich der &Auml;nderungen, erneut bereit. Diese Funktion ist besonders in einer Entwicklungsumgebung sehr n&uuml;tzlich, da Code&auml;nderungen schnell getestet werden k&ouml;nnen. In einer Production-Umgebung hingegen kann das dynamische erneute Laden zu einer Beeintr&auml;chtigung der Performance f&uuml;hren. Dar&uuml;ber hinaus werden bei jedem erneuten Laden die Sessions ung&uuml;ltig, die zum Zeitpunkt des Ladevorgangs bestehen. Der Client muss die Session neu starten.</p>
<p>Diese Option ist standardm&auml;&szlig;ig aktiviert.</p>
</li>
<li>
<p>Geben Sie im Feld "Intervall f&uuml;r Neuladen des Abrufs" die Zeit (in Sekunden) f&uuml;r das Intervall ein, in dem Anwendungen und Module auf Code&auml;nderungen gepr&uuml;ft und dynamisch neu geladen werden sollen.</p>
<p>Der Standardwert ist 2.</p>
</li>
<li>
<p>Geben Sie im Feld "Admin-Sessiontimeout" die Dauer (in Minuten) der Inaktivit&auml;t an, nach deren Ablauf f&uuml;r die Administrationskonsole-Session ein Timeout festgelegt ist.</p>
<p>Der Standardwert ist 60.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Automatisches Deployment aktiviert", um das automatische Deployment von Anwendungen zu aktivieren.</p>
<p>Wenn Sie eine Anwendung oder Moduldatei (JAR, WAR, RAR oder EAR) in ein gesondertes Verzeichnis kopieren und anschlie&szlig;end das automatische Deployment aktivieren, wird die Anwendung oder das Modul automatisch von GlassFish Server bereitgestellt. Diese Option ist standardm&auml;&szlig;ig aktiviert.</p>
</li>
<li>
<p>Geben Sie im Feld "Abrufintervall f&uuml;r automatisches Deployment" die Dauer (in Sekunden) des Intervalls an, in dem Anwendungen und Module auf Code&auml;nderungen gepr&uuml;ft und dynamisch neu geladen werden sollen.</p>
<p>Der Standardwert ist 2. Das &Auml;ndern des Abrufintervalls hat keine Auswirkungen auf die Zeit f&uuml;r das Deployment von Anwendungen oder Modulen.</p>
</li>
<li>
<p>Geben Sie im Feld "Zeit&uuml;berschreitung f&uuml;r Wiederholung des automatischen Deployments" die Dauer (in Sekunden) an, w&auml;hrend der die Gr&ouml;&szlig;e einer teilweise kopierten Datei unver&auml;ndert bleiben kann, bevor ein Fehler auftritt.</p>
<p>Der Standardwert ist 4.</p>
</li>
<li>
<p>Geben Sie im Feld "Verzeichnis f&uuml;r automatisches Deployment" den vollst&auml;ndigen Pfad zum Verzeichnis an, das auf automatisches Deployment von Anwendungen &uuml;berwacht werden soll.</p>
<p>Der Standardwert ist domain-dir<code>/autodeploy</code>.</p>
</li>
<li>
<p>W&auml;hlen Sie aus der Dropdown-Liste "XML-Validierung" den Typ der XML-Validierung, der bei den Deployment-Deskriptoren "Standard" und "GlassFish Server" ausgef&uuml;hrt wird.</p>
<p>Der Typ kann einen der folgenden Werte annehmen:</p>
<dl>
<dt><code>Vollst&auml;ndig</code></dt>
<dd>
<p>Wenn die XML-Validierung nicht erfolgreich ist, kann das Deployment nicht durchgef&uuml;hrt werden. Dies ist der Standardwert.</p>
</dd>
<dt><code>Parsing</code></dt>
<dd>
<p>Fehler bei der XML-Validierung werden protokolliert, das Deployment wird jedoch durchgef&uuml;hrt.</p>
</dd>
<dt><code>Keine</code></dt>
<dd>
<p>Es wird keine XML-Validierung durchgef&uuml;hrt.</p>
</dd>
</dl>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Verifier aktiviert", um Ihre Deployment-Deskriptordateien zu &uuml;berpr&uuml;fen.</p>
<p>Der Verifier &uuml;berpr&uuml;ft Struktur und Content der Datei vor dem automatischen Deployment. Wenn die Verifizierung nicht erfolgreich ist, wird das Deployment nicht ausgef&uuml;hrt. Die &Uuml;berpr&uuml;fung von gro&szlig;en Anwendungen ist h&auml;ufig sehr zeitaufwendig. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Vorkompilieren aktiviert", um JSP-Dateien vorzukompilieren.</p>
<p>Wenn Sie diese Option deaktivieren, werden die JSP-Dateien beim ersten Zugriff zur Laufzeit kompiliert. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Geben Sie im Abschnitt "Weitere Eigenschaften" weitere Eigenschaften an.</p>
<p>GlassFish Server definiert keine zus&auml;tzlichen Eigenschaften f&uuml;r Anwendungen.</p>
<ul>
<li>
<p>Um eine Eigenschaft hinzuzuf&uuml;gen, klicken Sie auf die Schaltfl&auml;che "Eigenschaft hinzuf&uuml;gen". Geben Sie in die daraufhin angezeigte leere Zeile den Eigenschaftsnamen in das Feld "Name" und den Eigenschaftswert in das Feld "Wert" ein.</p>
</li>
<li>
<p>Um eine Eigenschaft zu &auml;ndern, bearbeiten Sie das Feld "Wert" dieser Eigenschaft.</p>
</li>
<li>
<p>Um eine Eigenschaft zu l&ouml;schen, aktivieren Sie das Kontrollk&auml;stchen links neben dem Feld "Name" der zu l&ouml;schenden Eigenschaft und klicken anschlie&szlig;end auf die Schaltfl&auml;che "Eigenschaften l&ouml;schen".</p>
</li>
</ul>
</li>
<li>
<p>Klicken Sie auf "Speichern".</p>

<hr>
<p><b>Tipp:</b></p>
Um zu den Standardeinstellungen zur&uuml;ckzukehren, klicken Sie auf die Schaltfl&auml;che "Standardwerte laden" und anschlie&szlig;end auf "Speichern".
<hr>

</li>
<li>
<p>Starten Sie den Server neu.</p>
</li>
</ol>
<a id="sthref12" name="sthref12"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-generaltab.html">So werden allgemeine Informationen f&uuml;r DAS angezeigt</a></p>
</li>
<li>
<p><a href="task-logviewer.html">So werden Logdateien f&uuml;r DAS angezeigt</a></p>
</li>
<li>
<p><a href="task-filter-logs.html">So werden angezeigte Logdatens&auml;tze gefiltert</a></p>
</li>
<li>
<p><a href="task-setadvancedomainattributes.html">So werden die Domainattribute festgelegt</a></p>
</li>
<li>
<p><a href="task-collectdomainlogs.html">So werden Domainlogs gesammelt und heruntergeladen</a></p>
</li>
<li>
<p><a href="task-setadminpassword.html">So wird das Administratorkennwort ge&auml;ndert</a></p>
</li>
<li>
<p><a href="task-systemproperties.html">So werden Systemeigenschaften verwaltet</a></p>
</li>
<li>
<p><a href="task-appmonitoringdata.html">So werden Anwendungs&uuml;berwachungsdaten angezeigt</a></p>
</li>
<li>
<p><a href="task-servermonitoringdata.html">So werden Server&uuml;berwachungsdaten angezeigt</a></p>
</li>
<li>
<p><a href="task-resourcemonitoringdata.html">So werden Ressourcen&uuml;berwachungsdaten angezeigt</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
