<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-appredeploy" name="task-appredeploy"></a><a id="GHCOM00167" name="GHCOM00167"></a></p>

<h4><a id="sthref92" name="sthref92"></a><a id="sthref93" name="sthref93"></a>So wird eine bereitgestellte Anwendung erneut bereitgestellt</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Durch die erneute Bereitstellung einer Webanwendung wird eine neue Version der Anwendung bereitgestellt, wobei die Einstellungen und anderen Optionen der urspr&uuml;nglichen Anwendungsbereitstellung beibehalten werden.</p>
<a id="sthref94" name="sthref94"></a>
<h5>Bevor Sie beginnen</h5>
<p>Stellen Sie sicher, dass die neu bereitzustellende Webanwendung bereits bereitgestellt ist.</p>
<ol>
<li>
<p>W&auml;hlen Sie in der Navigationsbaumstruktur den Anwendungsknoten.</p>
<p>Die Seite "Anwendungen" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie in der Tabelle "Bereitgestellte Anwendungen" in der Zeile f&uuml;r die neu bereitzustellende Anwendung auf "Erneut bereitstellen".</p>
<p>Der Anwendungsname kann eine optionale Versions-ID enthalten, die dem Namen folgt und von diesem durch einen Doppelpunkt (<code>:</code>) getrennt ist. Weitere Informationen zu Modul- und Anwendungsversionen finden Sie unter <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> im <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
<p>Die Seite "Anwendungen oder Module erneut bereitstellen" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Geben Sie das Verzeichnis der erneut bereitzustellenden Anwendung an.</p>
<ul>
<li>
<p>Wenn es sich bei der Anwendung um eine Archivdatei handelt, die auf dem Clientcomputer gespeichert oder &uuml;ber diesen zug&auml;nglich ist, w&auml;hlen Sie die Option "Gepackte Datei zum Hochladen auf den Server".</p>
<p>Der Clientrechner ist der Host, auf dem Sie die Administrationskonsole &uuml;ber einen Browser anzeigen.</p>
<p>Klicken Sie auf "Durchsuchen", um nach der Datei zu suchen, oder geben Sie den vollst&auml;ndigen Pfad zu der Datei ein.</p>
</li>
<li>
<p>Wenn es sich bei der Anwendung um eine Archivdatei handelt, die auf dem Servercomputer gespeichert ist, oder um eine nicht gepackte Anwendung aus einem entpackten Verzeichnis, w&auml;hlen Sie die Option "Lokale gepackte Datei oder Verzeichnis, auf die/das von GlassFish Server aus zugegriffen werden kann".</p>
<p>Der Serverrechner ist der Host, der den Domain Administration Server (DAS) ausf&uuml;hrt.</p>
<p>Klicken auf "Dateien durchsuchen", um zu einer Datei zu gelangen, oder auf "Ordner durchsuchen", um zu einem Verzeichnis zu gelangen. Alternativ k&ouml;nnen Sie auch den vollst&auml;ndigen Pfadnamen zur Datei oder zum Verzeichnis eingeben. Das Deployment aus einem entpackten Verzeichnis ist f&uuml;r erfahrene Entwickler vorgesehen und wird f&uuml;r Production-Umgebungen nicht empfohlen.</p>
</li>
</ul>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Verf&uuml;gbarkeit aktiviert", um die Sessionpersistenz und das SFSB-Checkpointing f&uuml;r die Anwendung zu aktivieren.</p>
<p>Wenn dieses Kontrollk&auml;stchen aktiviert ist, wird die Hochverf&uuml;gbarkeit f&uuml;r Websessions und f&uuml;r die Stateful Session-Bean (SFSB)-Fixpunktroutine und m&ouml;glicherweise die Passivierung aktiviert. Ist der Wert auf False (Standardwert) gesetzt, werden alle Websessionspeichervorg&auml;nge und SFSB-Fixpunktroutinen f&uuml;r die angegebene Anwendung deaktiviert. Ist der Wert auf True gesetzt, wird die angegebene Anwendung f&uuml;r Hochverf&uuml;gbarkeit aktiviert. Setzen Sie diese Option nur dann auf "True", wenn die Hochverf&uuml;gbarkeit auf einer h&ouml;heren Ebene konfiguriert und aktiviert ist, beispielsweise auf Server- und Containerebene.</p>
<p>Diese Option wird angezeigt, wenn neben der standardm&auml;&szlig;igen Serverinstanz (<code>server</code>) Cluster oder eigenst&auml;ndige Serverinstanzen vorhanden sind.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "JSP vorkompilieren", um eine Vorkompilierung der JavaServer Pages- (JSP-)Dateien durchzuf&uuml;hren.</p>
<p>Wenn Sie diese Option deaktivieren, werden die JSP-Dateien beim ersten Zugriff zur Laufzeit kompiliert. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Verifier ausf&uuml;hren", um die Deployment-Deskriptoren vor dem erneuten Deployment zu verifizieren.</p>
<p>Wenn die &Uuml;berpr&uuml;fung bei Auswahl dieser Option nicht erfolgreich ist, findet kein erneutes Deployment statt. Der Verifier &uuml;berpr&uuml;ft Struktur und Content der Deployment-Deskriptoren. Die &Uuml;berpr&uuml;fung von gro&szlig;en Anwendungen ist h&auml;ufig sehr zeitaufwendig. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
<p>Verifier-Packages m&uuml;ssen mithilfe des Updatetools installiert werden. Andernfalls wird eine Warnung protokolliert und diese Option wird ignoriert.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Java Web Start", um den Zugriff auf Java Web Start f&uuml;r ein Anwendungsclientmodul zu aktivieren.</p>
<p>Diese Option ist standardm&auml;&szlig;ig aktiviert oder deaktiviert, was von der Einstellung zum Zeitpunkt des urspr&uuml;nglichen Deployments abh&auml;ngt.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Status beibehalten", um Websessions, SFSB-Instanzen und persistent erstellte EJB-Timer zwischen erneuten Deployments beizubehalten.</p>
<p>Diese Option ist standardm&auml;&szlig;ig deaktiviert. Diese Option wird nur bei der standardm&auml;&szlig;igen Serverinstanz (<code>server</code>) unterst&uuml;tzt. Bei anderen Zielen wird sie nicht unterst&uuml;tzt und ignoriert.</p>
<p>&Auml;nderungen, die an einer Anwendung zwischen Deployments vorgenommen werden, verhindern, dass diese Funktion richtig funktioniert. Beispiel: &Auml;ndern Sie die Instanzenvariablen in der SFSB-Bean-Klasse nicht.</p>
<p>Bei Webanwendungen ist dieses Feature nur dann anwendbar, wenn in der Datei <code>glassfish-web-app.xml</code> das Attribut <code>persistence-type</code> des Elements <code>session-manager</code> <code>file</code> lautet.</p>
<p>Bei Stateful-Session-Bean-Instanzen wird der Persistenztyp ohne hohe Verf&uuml;gbarkeit im Server festgelegt (die Option "SFSB-Persistenztyp") und muss auf <code>file</code>, den empfohlenen Standardwert, gesetzt werden.</p>
<p>Kann eine aktive Websession, SFSB-Instanz oder ein EJB-Timer nicht gespeichert oder wiederhergestellt werden, stehen diese <i>nicht</i> zur Verf&uuml;gung, wenn das erneute Deployment abgeschlossen ist. Das erneute Deployment wird jedoch fortgesetzt, und eine Warnmeldung wird aufgezeichnet.</p>
<p>Damit die Daten aktiver Zust&auml;nde erhalten bleiben, werden die Daten von GlassFish Server serialisiert und gespeichert. Zum Wiederherstellen der Daten deserialisiert der Class Loader der erneut bereitgestellten Anwendung die Daten, die zuvor gespeichert wurden.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Anwendungsspezifische Ressourcen beibehalten", um f&uuml;r bestimmte Anwendungen definierte Ressourcen beizubehalten und w&auml;hrend des erneuten Deployments wiederherzustellen.</p>
<p>Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Klicken Sie auf "OK".</p>
</li>
</ol>
<a id="sthref95" name="sthref95"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-applistdeployed.html">So wird eine Liste der bereitgestellten Anwendungen angezeigt</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">So wird eine Webanwendung bereitgestellt</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">So wird eine Unternehmensanwendung bereitgestellt</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">So wird ein Anwendungsclient bereitgestellt</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">So stellen Sie ein Connector-Modul bereit</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">So wird ein EJB-JAR bereitgestellt</a></p>
</li>
<li>
<p><a href="task-appedit.html">So wird eine bereitgestellte Anwendung bearbeitet</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">So werden Deskriptoren einer Anwendung angezeigt</a></p>
</li>
<li>
<p><a href="task-appviewtargets.html">So werden Anwendungsziele angezeigt</a></p>
</li>
<li>
<p><a href="task-endpoint.html">So werden End Point-Informationen f&uuml;r einen Webservice angezeigt</a></p>
</li>
<li>
<p><a href="task-applaunch.html">So wird eine Anwendung gestartet</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">So wird ein Anwendungsclient gestartet</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">So werden Anwendungsclient-Stubs heruntergeladen</a></p>
</li>
<li>
<p><a href="task-apprestart.html">So wird eine bereitgestellte Anwendung erneut geladen</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">So werden anwendungsspezifische Ressourcen angezeigt</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">So werden anwendungsspezifische Ressourcen ge&auml;ndert</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbcontaineravailability.html">So werden Verf&uuml;gbarkeitseinstellungen f&uuml;r den EJB-Container konfiguriert</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
