<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-confmonitor" name="task-confmonitor"></a><a id="GHCOM00213" name="GHCOM00213"></a></p>

<h4><a id="sthref198" name="sthref198"></a>So wird der &Uuml;berwachungsservice konfiguriert</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>F&uuml;hren Sie folgende Schritte aus, um die Seite "&Uuml;berwachungsservice" zu &ouml;ffnen:</p>
<ul>
<li>
<p>W&auml;hlen Sie den Knoten "&Uuml;berwachungsdaten", und klicken Sie auf den Link "&Uuml;berwachung konfigurieren" f&uuml;r die Serverinstanz, f&uuml;r die Sie die &Uuml;berwachung konfigurieren m&ouml;chten. Um die &Uuml;berwachung f&uuml;r ein Cluster zu konfigurieren, w&auml;hlen Sie eine Instanz in dem Cluster.</p>
</li>
</ul>
<ul>
<li>
<p>Blenden Sie unter dem Knoten "Konfigurationen" die Serverinstanz oder die Clusterkonfiguration ein, f&uuml;r die Sie die &Uuml;berwachung konfigurieren m&ouml;chten, und blenden Sie den Knoten "&Uuml;berwachung" ein.</p>
</li>
</ul>
<p>Die Seite "&Uuml;berwachungsservice" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "&Uuml;berwachungsservice", um die &Uuml;berwachung f&uuml;r GlassFish Server zu aktivieren, oder deaktivieren Sie das Kontrollk&auml;stchen, um die &Uuml;berwachung zu deaktivieren.</p>
<p>Diese Option ist standardm&auml;&szlig;ig aktiviert.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "&Uuml;berwachungs-MBeans", um alle f&uuml;r die &Uuml;berwachung ben&ouml;tigten MBeans bereitzustellen; deaktivieren Sie das Kontrollk&auml;stchen, wenn die MBeans nicht bereitgestellt werden sollen.</p>
<p>Diese Option ist standardm&auml;&szlig;ig aktiviert.</p>
<p>Wenn das Kontrollk&auml;stchen nicht aktiviert ist, k&ouml;nnen Sie keine &Uuml;berwachungsdaten in der Administrationskonsole anzeigen, auch dann nicht, wenn das Kontrollk&auml;stchen "&Uuml;berwachungsservice" aktiviert ist. Sie m&uuml;ssen die &Uuml;berwachungsdaten stattdessen &uuml;ber die Befehlszeile aufrufen. Wenn Sie die Auswahl des Kontrollk&auml;stchens aufheben, wird in GlassFish Server weniger Speicher belegt.</p>
</li>
<li>
<p>W&auml;hlen Sie das Kontrollk&auml;stchen "DTrace aktiviert", um die Verwendung der Solaris DTrace-Funktionalit&auml;t zu aktivieren.</p>
<p>Zur Verwendung der Solaris-DTrace-Funktionalit&auml;t ist au&szlig;erdem Oracle Enterprise Manager-DTrace-&Uuml;berwachung erforderlich. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>F&uuml;hren Sie in der Tabelle eine der folgenden Aktionen durch.</p>
<ul>
<li>
<p>W&auml;hlen Sie in der Spalte "&Uuml;berwachungsebene" aus der Dropdown-Liste HIGH (Hoch) oder LOW (Niedrig) f&uuml;r mindestens eine Komponente in der Spalte "Komponente", um die &Uuml;berwachung f&uuml;r diese Komponenten zu aktivieren.</p>
</li>
<li>
<p>Aktivieren Sie die Kontrollk&auml;stchen neben mindestens einer Komponente, w&auml;hlen Sie anschlie&szlig;end LOW (Niedrig) oder HIGH (Hoch) aus der Dropdown-Liste oben in der Tabelle aus und klicken Sie auf die Schaltfl&auml;che "Ebene &auml;ndern", um die &Uuml;berwachungsebene f&uuml;r alle diese Komponenten auf diesen Wert einzustellen.</p>
</li>
</ul>
<p>In dieser Version besteht kein Unterschied zwischen den &Uuml;berwachungsebenen der Optionen "NIEDRIG" und "HOCH". Um die &Uuml;berwachung f&uuml;r mindestens eine Komponente zu deaktivieren, w&auml;hlen Sie "Deaktiviert" aus. Der Standardwert ist OFF (Deaktiviert).</p>
<p>Sie m&uuml;ssen eine Anwendung, eine Komponente oder einen Service bereitstellen, bevor Sie die &Uuml;berwachung hierf&uuml;r konfigurieren k&ouml;nnen.</p>
</li>
<li>
<p>Klicken Sie auf "Speichern".</p>
</li>
</ol>
<a id="sthref199" name="sthref199"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-appmonitoringdata.html">So werden Anwendungs&uuml;berwachungsdaten angezeigt</a></p>
</li>
<li>
<p><a href="task-servermonitoringdata.html">So werden Server&uuml;berwachungsdaten angezeigt</a></p>
</li>
<li>
<p><a href="task-resourcemonitoringdata.html">So werden Ressourcen&uuml;berwachungsdaten angezeigt</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
