<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-messagesecurityconfigedit" name="task-messagesecurityconfigedit"></a></p>

<h4><a id="sthref104" name="sthref104"></a>So wird eine Nachrichtensicherheitskonfiguration bearbeitet</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Zum Aktivieren der Nachrichtensicherheit f&uuml;r in GlassFish Server bereitgestellte Webservice-End Points muss ein Provider als Standardprovider f&uuml;r die Serverseite angegeben werden. Wenn Sie einen Standardprovider f&uuml;r die Nachrichtensicherheit aktivieren, m&uuml;ssen ebenfalls Provider f&uuml;r die Clients der in GlassFish Server bereitgestellten Webservices aktiviert werden. Informationen &uuml;ber die Aktivierung der Provider, die von den Clients verwendet werden, sind in <a href="task-enablemesec4appclients.html">So wird die Nachrichtensicherheit f&uuml;r Anwendungsclients aktiviert</a> enthalten.</p>
<p>Zum Aktivieren der Nachrichtensicherheit f&uuml;r Webserviceaufrufe von bereitgestellten End Points muss ein standardm&auml;&szlig;iger Clientprovider angegeben werden. Wenn ein Standardclientprovider f&uuml;r GlassFish Server aktiviert wurde, muss sichergestellt werden, dass die von in GlassFish Server bereitgestellten End Points aufgerufenen Services f&uuml;r Sicherheit auf Nachrichtenebene konfiguriert sind.</p>
<ol>
<li>
<p>Blenden Sie in der Navigationsbaumstruktur den Knoten "Konfiguration" ein.</p>
</li>
<li>
<p>Blenden Sie den Knoten "Sicherheit" ein.</p>
</li>
<li>
<p>W&auml;hlen Sie den Knoten "Nachrichtensicherheit".</p>
<p>Die Seite "Nachrichtensicherheitskonfigurationen" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie auf der Seite "Nachrichtensicherheitskonfigurationen" auf den Namen der Authentifizierungslayer der Konfiguration, die Sie bearbeiten.</p>
<p>Standardm&auml;&szlig;ig ist die einzige konfigurierte Nachrichtensicherheitskonfiguration SOAP.</p>
<p>Die Seite "Neue Nachrichtensicherheitskonfiguration bearbeiten" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>W&auml;hlen Sie auf der Seite "Nachrichtensicherheitskonfiguration bearbeiten" aus der Dropdown-Liste "Standardprovider" einen serverseitigen Provider.</p>
<p>Der Standardserverprovider, auch Standardprovider genannt, gibt den Serverprovider an, der f&uuml;r Anwendungen aufgerufen wird, f&uuml;r die kein spezifischer Serverprovider festgelegt ist. Zur Auswahl stehen <code>ServerProvider</code>, <code>XWS_ServerProvider</code> oder "Kein". Standardm&auml;&szlig;ig wird kein Provider ausgew&auml;hlt, so dass GlassFish Server serverseitig keinen Nachrichtensicherheitsprovider aufruft. W&auml;hlen Sie im Allgemeinen <code>ServerProvider</code> als Standardprovider.</p>
</li>
<li>
<p>W&auml;hlen Sie aus der Dropdown-Liste "Standardclientprovider" einen Clientprovider.</p>
<p>Der Standardclientprovider gibt den Clientprovider an, der f&uuml;r Anwendungen aufgerufen wird, f&uuml;r die kein spezifischer Clientprovider festgelegt ist. Zur Auswahl stehen <code>ClientProvider</code>, <code>XWS_ClientProvider</code> oder "Kein". Standardm&auml;&szlig;ig ist kein Provider ausgew&auml;hlt, so dass GlassFish Server clientseitig keinen Nachrichtensicherheitsprovider aufruft. W&auml;hlen Sie im Allgemeinen f&uuml;r den Standardclientprovider "Kein". W&auml;hlen Sie <code>ClientProvider</code>, um einen Standardprovider und eine Nachrichtenschutz-Policy zu aktivieren, die f&uuml;r Webserviceaufrufe von in GlassFish Server bereitgestellten Webservice-End Points angewendet werden.</p>
</li>
<li>
<p>Klicken Sie auf "Speichern".</p>
</li>
<li>
<p>Weitere Anweisungen zur &Auml;nderung der Nachrichtenschutz-Policys von aktivierten Client- oder Serverprovidern finden Sie unter <a href="task-messagesecurityproviderconfigedit.html">So wird eine Nachrichtensicherheitsproviderkonfiguration bearbeitet</a>.</p>
</li>
</ol>
<a id="GHCOM311" name="GHCOM311"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">So werden GlassFish Server-Funktionalit&auml;ten zur Verwendung durch Nachrichtensicherheitsprovider konfiguriert</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">So wird eine Nachrichtensicherheitskonfiguration erstellt</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">So wird eine Nachrichtensicherheitskonfiguration gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">So wird eine Nachrichtensicherheitsproviderkonfiguration erstellt</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">So wird eine Nachrichtensicherheitsproviderkonfiguration bearbeitet</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">So wird eine Nachrichtensicherheitsproviderkonfiguration gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">So wird die Nachrichtensicherheit f&uuml;r Anwendungsclients aktiviert</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
