<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsservice" name="ref-jmsservice"></a></p>

<h4><a id="sthref74" name="sthref74"></a>Service JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilisez la page Service JMS pour configurer les param&egrave;tres pour le fournisseur JMS par d&eacute;faut, GlassFish Server Message Queue.</p>
<p>Pour plus d'informations sur la configuration du service JMS, reportez-vous au <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDVG00020">chapitre 19, <i>Using the Java Message Service,</i> du manuel <i>Oracle GlassFish Server Application Development Guide</i></a>.</p>
<p>La page Service JMS contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Charger les valeurs par d&eacute;faut</dt>
<dd>
<p>Bouton permettant de restaurer les valeurs par d&eacute;faut des param&egrave;tres qui en ont. Les param&egrave;tres qui n'ont pas de valeurs par d&eacute;faut ne sont pas modifi&eacute;s.</p>
</dd>
<dt>Ping</dt>
<dd>
<p>Bouton permettant de v&eacute;rifier que le service JMS est en cours d'ex&eacute;cution sur l'h&ocirc;te JMS par d&eacute;faut. Si le service JMS est en fonctionnement, un message signale que la commande ping a abouti.</p>
</dd>
<dt>Nom de configuration</dt>
<dd>
<p>Nom de la configuration &agrave; laquelle s'appliquent les param&egrave;tres de cette page. Ce champ est en lecture seule.</p>
</dd>
<dt>Type</dt>
<dd>
<p>Type d'acc&egrave;s du service JMS. Les choix disponibles sont les suivants :</p>
<dl>
<dt>EMBEDDED</dt>
<dd>
<p>Acc&eacute;dez au service JMS sur l'h&ocirc;te local. Le service JMS est d&eacute;marr&eacute; sur la m&ecirc;me JVM que GlassFish Server. L'initialisation en diff&eacute;r&eacute; d&eacute;marre le broker imbriqu&eacute; par d&eacute;faut au premier acc&egrave;s des services JMS et non au d&eacute;marrage de GlassFish Server. Il s'agit du type de service JMS par d&eacute;faut.</p>
</dd>
<dt>LOCAL</dt>
<dd>
<p>Acc&eacute;dez au service JMS sur l'h&ocirc;te local. Le fournisseur JMS est d&eacute;marr&eacute; en m&ecirc;me temps que GlassFish Server.</p>
</dd>
<dt>REMOTE</dt>
<dd>
<p>Acc&eacute;dez au service JMS sur un autre syst&egrave;me. Si vous choisissez REMOTE, le service JMS n'est pas d&eacute;marr&eacute; par GlassFish Server au prochain d&eacute;marrage du serveur. A la place, il est d&eacute;marr&eacute; et g&eacute;r&eacute; par Message Queue. Vous devez donc d&eacute;marrer le broker Message Queue s&eacute;par&eacute;ment. Pour plus d'informations sur le d&eacute;marrage du broker, reportez-vous &agrave; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GMADG00227"><i>Starting Brokers</i> dans le manuel <i>Oracle GlassFish Server Message Queue Administration Guide</i></a>. Si vous choisissez cette valeur et que vous utilisez un h&ocirc;te distant, suivez les instructions indiqu&eacute;es dans <a href="task-jmshostedit.html">Modification d'un h&ocirc;te JMS</a> pour sp&eacute;cifier le nom de l'h&ocirc;te distant.</p>
</dd>
</dl>
</dd>
<dt>D&eacute;lai de d&eacute;marrage</dt>
<dd>
<p>D&eacute;lai d'attente, en secondes, du d&eacute;marrage du service JMS au-del&agrave; duquel GlassFish Server abandonne l'op&eacute;ration. Sur un syst&egrave;me lent ou surcharg&eacute;, augmentez la valeur par d&eacute;faut. La valeur par d&eacute;faut est 60.</p>
</dd>
<dt>Arguments de d&eacute;marrage</dt>
<dd>
<p>Arguments permettant de personnaliser le d&eacute;marrage du service JMS. Utilisez les arguments disponibles &agrave; l'aide de la commande as-install-parent<code>/mq/bin/imqbrokerd</code>.</p>
</dd>
<dt>Reconnecter</dt>
<dd>
<p>Si la case Activ&eacute; du champ Reconnecter est coch&eacute;e, le service JMS tente de se reconnecter &agrave; un serveur de messagerie (ou &agrave; la liste d'adresses indiqu&eacute;e dans AddressList) en cas de perte de connexion. Cette option est activ&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Intervalle de reconnexion</dt>
<dd>
<p>D&eacute;lai, en secondes, entre les tentatives de reconnexion. Cet intervalle s'applique aux tentatives sur chaque adresse indiqu&eacute;e dans AddressList, ainsi qu'aux adresses successives dans la liste. Si l'intervalle est trop court, le broker n'a pas le temps de r&eacute;cup&eacute;rer. S'il est trop long, le d&eacute;lai de reconnexion peut &ecirc;tre inacceptable. La valeur par d&eacute;faut est de 5 secondes.</p>
</dd>
<dt>Tentatives de reconnexion</dt>
<dd>
<p>Nombre de tentatives de connexion (ou de reconnexion) pour chaque adresse indiqu&eacute;e dans AddressList avant que le programme client ne passe &agrave; l'adresse suivante dans la liste. La valeur -1 indique que le nombre de tentatives de reconnexion est illimit&eacute; (le programme client tentera de se connecter &agrave; la premi&egrave;re adresse jusqu'&agrave; ce qu'il y parvienne). La valeur par d&eacute;faut est 3.</p>
</dd>
<dt>H&ocirc;te JMS par d&eacute;faut</dt>
<dd>
<p>Nom de l'h&ocirc;te JMS par d&eacute;faut. La valeur par d&eacute;faut est <code>default_JMS_host</code>.</p>
</dd>
<dt>Broker ma&icirc;tre</dt>
<dd>
<p>Nom de l'instance incluse dans un cluster GlassFish Server dont le broker Message Queue associ&eacute; doit &ecirc;tre utilis&eacute; en tant que broker ma&icirc;tre dans le cluster de brokers Message Queue. Laissez ce champ vide pour que GlassFish Server d&eacute;signe automatiquement un broker ma&icirc;tre.</p>
<p>Si vous modifiez cette valeur, red&eacute;marrez le cluster GlassFish Server qui utilise la configuration.</p>
</dd>
<dt>Comportement de la liste d'adresses</dt>
<dd>
<p>Ordre des tentatives de connexion. Les choix disponibles sont les suivants :</p>
<dl>
<dt><code>random</code></dt>
<dd>
<p>S&eacute;lectionnez une adresse au hasard dans AddressList. Si un grand nombre de clients tentent de se connecter en utilisant la m&ecirc;me fabrique de connexions, choisissez <code>random</code> pour &eacute;viter qu'ils ne soient tous connect&eacute;s &agrave; la m&ecirc;me adresse. Il s'agit de l'option par d&eacute;faut.</p>
</dd>
<dt><code>priority</code></dt>
<dd>
<p>Le processus de reconnexion tente toujours de se connecter &agrave; la premi&egrave;re adresse de serveur dans AddressList et n'utilise une autre adresse que si le premier broker n'est pas disponible.</p>
</dd>
</dl>
</dd>
<dt>It&eacute;rations de la liste d'adresses</dt>
<dd>
<p>Nombre d'it&eacute;rations du service JMS dans AddressList afin d'&eacute;tablir (ou de r&eacute;tablir) une connexion. La valeur -1 indique que le nombre de tentatives est illimit&eacute;. La valeur par d&eacute;faut est 3. La valeur maximale est 2 147 483 647.</p>
</dd>
<dt>Sch&eacute;ma MQ et Service MQ</dt>
<dd>
<p>Nom du sch&eacute;ma d'adresses et du service de connexion Message Queue si un sch&eacute;ma ou un service non d&eacute;fini par d&eacute;faut doit &ecirc;tre utilis&eacute;. Pour plus d'informations sur la syntaxe, reportez-vous &agrave; <a href="ref-mqschemeservice.html">Syntaxe d'adresse du sch&eacute;ma MQ et du service MQ</a>.</p>
</dd>
<dt>Autres propri&eacute;t&eacute;s</dt>
<dd>
<p>Propri&eacute;t&eacute;s suppl&eacute;mentaires du service JMS.</p>
<p>Pour plus d'informations sur les propri&eacute;t&eacute;s disponibles, reportez-vous &agrave; <a href="ref-jmsservice-additional-props.html">Propri&eacute;t&eacute;s propres au service JMS</a>.</p>
</dd>
</dl>
<a id="sthref75" name="sthref75"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-jmsservice.html">Configuration du service JMS</a></p>
</li>
<li>
<p><a href="task-jmshostnew.html">Cr&eacute;ation d'un h&ocirc;te JMS</a></p>
</li>
<li>
<p><a href="task-jmshostedit.html">Modification d'un h&ocirc;te JMS</a></p>
</li>
<li>
<p><a href="task-jmshostdelete.html">Suppression d'un h&ocirc;te JMS</a></p>
</li>
</ul>
<a id="sthref76" name="sthref76"></a>
<h5>Commandes asadmin connexes</h5>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00144"><code>jms-ping</code>(1)</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
