<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsphysicaldestedit" name="ref-jmsphysicaldestedit"></a><a id="GHJMS00018" name="GHJMS00018"></a></p>

<h4><a id="sthref96" name="sthref96"></a><a id="sthref97" name="sthref97"></a>Modifier la destination physique JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Modifier la destination physique JMS permet de modifier les param&egrave;tres d'une destination physique JMS.</p>
<p>Elle contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Nom</dt>
<dd>
<p>Nom de la destination physique. Ce champ est en lecture seule. Vous ne pouvez sp&eacute;cifier le nom qu'&agrave; la cr&eacute;ation d'une ressource de destination ou d'une destination physique JMS.</p>
</dd>
<dt>Type</dt>
<dd>
<p>Type de la destination physique. Ce champ est en lecture seule. Vous ne pouvez sp&eacute;cifier le type qu'&agrave; la cr&eacute;ation d'une ressource de destination ou d'une destination physique JMS.</p>
</dd>
<dt>Nombre maximal de messages non distribu&eacute;s &agrave; un destinataire</dt>
<dd>
<p>Nombre maximal autoris&eacute; de messages non distribu&eacute;s pour la destination. La valeur -1 signifie que le nombre de messages non distribu&eacute;s est illimit&eacute;. La valeur par d&eacute;faut est -1.</p>
</dd>
<dt>Taille maximale d'un message</dt>
<dd>
<p>Taille maximale, en octets, d'un message. La valeur -1 indique une taille de message illimit&eacute;e. La valeur par d&eacute;faut est -1.</p>
</dd>
<dt>M&eacute;moire totale maximale</dt>
<dd>
<p>M&eacute;moire totale maximale, en octets, pour les messages non distribu&eacute;s. La valeur -1 signifie que la taille de la m&eacute;moire pour les messages non distribu&eacute;s est illimit&eacute;e. La valeur par d&eacute;faut est -1.</p>
</dd>
<dt>Comportement aux limites de seuil</dt>
<dd>
<p>Comportement que le broker doit suivre lorsque le seuil limite de la m&eacute;moire est atteint. Les choix disponibles sont les suivants :</p>
<dl>
<dt>Rejeter les derniers messages en date</dt>
<dd>
<p>Rejetez les messages les plus r&eacute;cents et informez-en le client &eacute;metteur &agrave; l'aide d'une exception, uniquement si le message est persistant. Il s'agit de la valeur par d&eacute;faut.</p>
</dd>
<dt>Ralentir les &eacute;metteurs</dt>
<dd>
<p>R&eacute;duisez la fr&eacute;quence &agrave; laquelle les &eacute;metteurs de messages envoient des messages.</p>
</dd>
<dt>Rejeter les &eacute;l&eacute;ments les plus anciens</dt>
<dd>
<p>Supprimez les messages les plus anciens.</p>
</dd>
<dt>Rejeter les messages dont la priorit&eacute; est la plus basse</dt>
<dd>
<p>Supprimez les messages dont le niveau de priorit&eacute; est le plus faible.</p>
</dd>
</dl>
<p>Si la valeur est Rejeter les &eacute;l&eacute;ments les plus anciens ou Rejeter les messages dont la priorit&eacute; est la plus basse, et que le param&egrave;tre Utiliser la file d'attente des messages bloqu&eacute;s a la valeur True, les messages en trop sont transf&eacute;r&eacute;s vers la file d'attente des messages bloqu&eacute;s.</p>
</dd>
<dt>Nombre maximal d'&eacute;metteurs</dt>
<dd>
<p>Nombre maximal d'&eacute;metteurs de messages pouvant &ecirc;tre associ&eacute;s &agrave; cette destination physique. Lorsque cette limite est atteinte, aucun &eacute;metteur suppl&eacute;mentaire ne peut &ecirc;tre cr&eacute;&eacute;. La valeur -1 indique un nombre illimit&eacute; d'&eacute;metteurs. La valeur par d&eacute;faut est 100.</p>
</dd>
<dt>Nombre maximal de messages lors de la distribution par batch</dt>
<dd>
<p>Nombre maximal de messages pouvant &ecirc;tre transmis aux destinataires en un seul batch. La valeur -1 indique un nombre illimit&eacute; de messages. La valeur par d&eacute;faut est 1000.</p>
</dd>
<dt>Utiliser la file d'attente des messages bloqu&eacute;s</dt>
<dd>
<p>Si cette option est activ&eacute;e, les messages bloqu&eacute;s sont plac&eacute;s dans la file d'attente des messages bloqu&eacute;s. Si cette option est d&eacute;sactiv&eacute;e, les messages bloqu&eacute;s sont supprim&eacute;s. Cette option est activ&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Valider le sch&eacute;ma XML</dt>
<dd>
<p>Si cette option est activ&eacute;e, le programme client Message Queue tentera de valider un message XML par rapport aux d&eacute;finitions de sch&eacute;ma XML sp&eacute;cifi&eacute;es (ou par rapport &agrave; la DTD si aucun fichier XSD n'est sp&eacute;cifi&eacute;) avant de l'envoyer au broker. Si le sch&eacute;ma sp&eacute;cifi&eacute; est introuvable ou que le message ne peut pas &ecirc;tre valid&eacute;, celui-ci n'est pas envoy&eacute; et une exception est g&eacute;n&eacute;r&eacute;e. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Liste des URI du sch&eacute;ma XML</dt>
<dd>
<p>Liste de cha&icirc;nes d'URI de d&eacute;finition de sch&eacute;ma XML (XSD), s&eacute;par&eacute;es par des espaces. Si la validation de sch&eacute;ma XML est activ&eacute;e, les URI pointent vers l'emplacement des fichiers XSD &agrave; utiliser pour la validation de sch&eacute;ma XML.</p>
</dd>
</dl>
<a id="sthref98" name="sthref98"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-jmsservice.html">Configuration du service JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestnew.html">Cr&eacute;ation d'une destination physique JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestedit.html">Modification d'une destination physique JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestdelete.html">Suppression d'une destination physique JMS</a></p>
</li>
<li>
<p><a href="task-jmsflushmessages.html">Suppression des messages d'une destination physique JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldeststats.html">Visualisation des statistiques d'une destination physique JMS</a></p>
</li>
</ul>
<a id="sthref99" name="sthref99"></a>
<h5>Commandes asadmin connexes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00038"><code>create-jmsdest</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00175"><code>list-jmsdest</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00090"><code>delete-jmsdest</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00136"><code>flush-jmsdest</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00144"><code>jms-ping</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
