<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsdestinationedit" name="ref-jmsdestinationedit"></a></p>

<h4><a id="sthref67" name="sthref67"></a><a id="sthref68" name="sthref68"></a>Modifier une ressource de destination JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Modifier une ressource de destination JMS permet de modifier les param&egrave;tres d'une ressource de destination JMS.</p>
<p>Elle contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Charger les valeurs par d&eacute;faut</dt>
<dd>
<p>Bouton permettant de restaurer les valeurs par d&eacute;faut des param&egrave;tres qui en ont. Les param&egrave;tres qui n'ont pas de valeurs par d&eacute;faut ne sont pas modifi&eacute;s.</p>
</dd>
<dt>Nom JNDI</dt>
<dd>
<p>Nom unique identifiant la ressource de destination. Le champ Nom JNDI est en lecture seule. Vous ne pouvez sp&eacute;cifier le nom JNDI qu'&agrave; la cr&eacute;ation d'une ressource de destination JMS.</p>
</dd>
<dt>Nom de la destination physique</dt>
<dd>
<p>Nom de la destination physique associ&eacute;e &agrave; cette ressource.</p>
<p>GlassFish Server cr&eacute;e la destination physique automatiquement lorsque cela est n&eacute;cessaire et la supprime lorsque vous supprimez la ressource de destination.</p>
</dd>
<dt>Type de ressource</dt>
<dd>
<p>Type de la ressource de destination. Les options disponibles sont <code>javax.jms.Topic</code> et <code>javax.jms.Queue</code>.</p>
</dd>
<dt>Ordre de d&eacute;ploiement</dt>
<dd>
<p>Ordre de d&eacute;ploiement de la ressource de destination.</p>
</dd>
<dt>Description</dt>
<dd>
<p>Description de la ressource de destination.</p>
</dd>
<dt>Statut</dt>
<dd>
<p>Indique si la ressource est disponible lors de l'ex&eacute;cution.</p>
<p>Si seule l'instance de serveur par d&eacute;faut <code>server</code>, existe dans le domaine, la disponibilit&eacute; d'ex&eacute;cution de la ressource peut &ecirc;tre activ&eacute;e ou d&eacute;sactiv&eacute;e. La disponibilit&eacute; d'ex&eacute;cution est activ&eacute;e par d&eacute;faut.</p>
<p>Si des clusters ou des instances autonomes ont &eacute;t&eacute; cr&eacute;&eacute;s dans le domaine, utilisez l'onglet Cible pour contr&ocirc;ler la disponibilit&eacute; d'ex&eacute;cution de la ressource sur ses cibles.</p>
</dd>
<dt>Autres propri&eacute;t&eacute;s</dt>
<dd>
<p>Propri&eacute;t&eacute;s suppl&eacute;mentaires de la ressource de destination. GlassFish Server ne d&eacute;finit aucune autre propri&eacute;t&eacute; pour les ressources de destination JMS.</p>
</dd>
</dl>
<a id="sthref69" name="sthref69"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-jmsdestinationnew.html">Cr&eacute;ation d'une ressource de destination JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationedit.html">Modification d'une ressource de destination JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationdelete.html">Suppression d'une ressource de destination JMS</a></p>
</li>
</ul>
<a id="sthref70" name="sthref70"></a>
<h5>Commandes asadmin connexes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00040"><code>create-jms-resource</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00177"><code>list-jms-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00092"><code>delete-jms-resource</code>(1)</a></p>
</li>
</ul>





<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
