<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsconnectionnew" name="ref-jmsconnectionnew"></a></p>

<h4><a id="sthref49" name="sthref49"></a><a id="sthref50" name="sthref50"></a>Nouvelle fabrique de connexions JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Nouvelle fabrique de connexions JMS permet de cr&eacute;er une fabrique de connexions JMS.</p>
<p>Elle contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Nom du pool</dt>
<dd>
<p>Nom unique identifiant la fabrique de connexions. GlassFish Server d&eacute;finit le nom JNDI de la fabrique de connexions sur cette valeur.</p>
</dd>
<dt>Type de ressource</dt>
<dd>
<p>Type de la fabrique de connexions. Les options disponibles sont <code>javax.jms.ConnectionFactory</code>, <code>javax.jms.QueueConnectionFactory</code> et <code>javax.jms.TopicConnectionFactory</code>.</p>
</dd>
<dt>Description</dt>
<dd>
<p>Description de la fabrique de connexions.</p>
</dd>
<dt>Statut</dt>
<dd>
<p>Statut de la fabrique de connexions. La fabrique de connexions peut &ecirc;tre activ&eacute;e ou d&eacute;sactiv&eacute;e. Cette option est activ&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Taille initiale et minimale du pool</dt>
<dd>
<p>Nombre minimal de connexions dans le pool pour la fabrique de connexions. La valeur par d&eacute;faut est 8.</p>
</dd>
<dt>Taille maximale du pool</dt>
<dd>
<p>Nombre maximal de connexions dans le pool pour la fabrique de connexions. La valeur par d&eacute;faut est 32.</p>
</dd>
<dt>Valeur de redimensionnement du pool</dt>
<dd>
<p>Nombre de connexions &agrave; enlever lorsque le d&eacute;lai d'inactivit&eacute; du pool est d&eacute;pass&eacute;. La valeur par d&eacute;faut est 2.</p>
</dd>
<dt>D&eacute;lai d'inactivit&eacute;</dt>
<dd>
<p>Dur&eacute;e maximale, en secondes, pendant laquelle une connexion peut rester inactive dans le pool. La valeur par d&eacute;faut est 300.</p>
</dd>
<dt>Attente max.</dt>
<dd>
<p>D&eacute;lai d'attente d'une application demandant une connexion au-del&agrave; duquel la connexion est temporis&eacute;e. La valeur par d&eacute;faut est 60 000.</p>
</dd>
<dt>Echec sur tout</dt>
<dd>
<p>Si la case Fermer toutes les connexions est coch&eacute;e, GlassFish Server ferme toutes les connexions du pool et les r&eacute;tablit en cas d'&eacute;chec de l'une d'entre elles. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Prise en charge des transactions</dt>
<dd>
<p>La prise en charge des transactions choisie remplace l'attribut de prise en charge des transactions dans l'adaptateur de ressources associ&eacute; au pool de connexions de fa&ccedil;on &agrave; garantir la compatibilit&eacute; descendante. En d'autres termes, la prise en charge d'un niveau de transaction inf&eacute;rieur ou &eacute;gal &agrave; celui sp&eacute;cifi&eacute; dans l'adaptateur de ressources est assur&eacute;e, mais pas la prise en charge d'un niveau sup&eacute;rieur.</p>
<p>Les valeurs possibles sont les suivantes :</p>
<dl>
<dt>XATransaction</dt>
<dd>
<p>La ressource peut &ecirc;tre utilis&eacute;e pour les transactions impliquant l'utilisation de plusieurs ressources dans la port&eacute;e d'une transaction. Il s'agit de la valeur par d&eacute;faut pour une fabrique de connexions JMS.</p>
<p>Par exemple, les transactions peuvent impliquer cette ressource ainsi qu'une ressource JDBC, une ressource de connecteur ou une autre ressource de fabrique de connexions JMS. Cette valeur offre un maximum de flexibilit&eacute;. Une ressource qui est configur&eacute;e comme XATransaction participera aux op&eacute;rations de validation (commit) en deux phases.</p>
</dd>
<dt>LocalTransaction</dt>
<dd>
<p>La ressource peut &ecirc;tre utilis&eacute;e soit pour les transactions qui impliquent uniquement une ressource dans la port&eacute;e de la transaction, soit en tant que dernier agent dans une transaction distribu&eacute;e qui implique plusieurs ressources XA.</p>
<p>Cette valeur offre de meilleures performances. Une ressource qui est configur&eacute;e comme LocalTransaction ne sera pas utilis&eacute;e dans les op&eacute;rations de validation (commit) en deux phases.</p>
</dd>
<dt>NoTransaction</dt>
<dd>
<p>La ressource ne peut participer &agrave; aucune transaction. Dans les applications JMS, l'utilisation de cette configuration est limit&eacute;e.</p>
</dd>
</dl>
</dd>
<dt>Validation de la connexion</dt>
<dd>
<p>Si la case Requis est coch&eacute;e, les connexions sont valid&eacute;es avant d'&ecirc;tre affect&eacute;es &agrave; l'application. Si la validation d'une ressource &eacute;choue, elle est d&eacute;truite et une autre ressource est cr&eacute;&eacute;e puis renvoy&eacute;e. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Autres propri&eacute;t&eacute;s</dt>
<dd>
<p>Propri&eacute;t&eacute;s suppl&eacute;mentaires de la fabrique de connexions.</p>
<p>Pour plus d'informations sur les propri&eacute;t&eacute;s disponibles, reportez-vous &agrave; <a href="ref-jmsconnectionproperties.html">Propri&eacute;t&eacute;s propres aux fabriques de connexions JMS</a>.</p>
</dd>
<dt>Cibles</dt>
<dd>
<p>Clusters et instances autonomes de la fabrique de connexions. D&eacute;placez les cibles souhait&eacute;es dans la colonne Cibles s&eacute;lectionn&eacute;es &agrave; l'aide des boutons Ajouter et Tout ajouter. D&eacute;placez toutes les cibles inutiles dans la colonne Cibles disponibles &agrave; l'aide des boutons Enlever et Tout enlever.</p>
<p>Cette option appara&icirc;t uniquement si des clusters ou des instances autonomes ont &eacute;t&eacute; cr&eacute;&eacute;s dans le domaine.</p>
</dd>
</dl>
<a id="sthref51" name="sthref51"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-jmsconnectionnew.html">Cr&eacute;ation d'une ressource de fabrique de connexions JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectionedit.html">Modification d'une ressource de fabrique de connexions JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">Suppression d'une ressource de fabrique de connexions JMS</a></p>
</li>
</ul>
<a id="sthref52" name="sthref52"></a>
<h5>Commandes asadmin connexes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00040"><code>create-jms-resource</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00177"><code>list-jms-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00092"><code>delete-jms-resource</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
