<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsconnectionproperties" name="ref-jmsconnectionproperties"></a></p>

<h4><a id="sthref57" name="sthref57"></a><a id="sthref58" name="sthref58"></a>Propri&eacute;t&eacute;s propres aux fabriques de connexions JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Les propri&eacute;t&eacute;s suppl&eacute;mentaires suivantes sont disponibles pour une fabrique de connexions JMS.</p>
<dl>
<dt><code>ClientId</code></dt>
<dd>
<p>Sp&eacute;cifie un ID client si la fabrique de connexions est destin&eacute;e &agrave; &ecirc;tre utilis&eacute;e par un abonn&eacute; durable.</p>
</dd>
<dt><code>AddressList</code></dt>
<dd>
<p>Indique les noms (et &eacute;ventuellement les num&eacute;ros de port) des instances de broker de message avec lesquelles les applications vont communiquer. Chaque adresse de la liste indique le nom d'h&ocirc;te (et &eacute;ventuellement le port de l'h&ocirc;te et le service de connexion) pour la connexion. Par exemple, la valeur peut &ecirc;tre <code>earth</code> ou <code>earth:7677</code>. Sp&eacute;cifiez le num&eacute;ro de port si le broker de message est ex&eacute;cut&eacute; sur un autre port que le port par d&eacute;faut (7676). Si les param&egrave;tres de propri&eacute;t&eacute; sp&eacute;cifient plusieurs h&ocirc;tes et plusieurs ports dans un environnement inclus dans un cluster, le premier h&ocirc;te disponible dans la liste est utilis&eacute;, &agrave; moins que la valeur de la propri&eacute;t&eacute; <code>AddressListBehavior</code> ne soit <code>RANDOM</code>.</p>
<p>Pour plus d'informations, reportez-vous au manuel <i>Message Queue Developer's Guide for Java Clients</i>.</p>
<p>La valeur par d&eacute;faut est l'h&ocirc;te local et le num&eacute;ro de port par d&eacute;faut (7676). Le client tentera de se connecter &agrave; un broker sur le port 7676 de l'h&ocirc;te local.</p>
</dd>
<dt><code>UserName</code></dt>
<dd>
<p>Nom utilisateur de la fabrique de connexions.</p>
<p>La valeur par d&eacute;faut est <code>guest</code>.</p>
</dd>
<dt><code>Password</code></dt>
<dd>
<p>Mot de passe de la fabrique de connexions.</p>
<p>La valeur par d&eacute;faut est <code>guest</code>.</p>
</dd>
<dt><code>ReconnectEnabled</code></dt>
<dd>
<p>Si cette propri&eacute;t&eacute; a la valeur <code>true</code>, indique que le programme client tente de se reconnecter &agrave; un serveur de messagerie (ou &agrave; la liste d'adresses indiqu&eacute;e dans <code>AddressList</code>) en cas de perte de connexion.</p>
<p>La valeur par d&eacute;faut est <code>true</code>.</p>
</dd>
<dt><code>ReconnectAttempts</code></dt>
<dd>
<p>D&eacute;finit le nombre de tentatives de connexion (ou de reconnexion) pour chaque adresse indiqu&eacute;e dans <code>AddressList</code> avant que le programme client ne passe &agrave; l'adresse suivante dans la liste. La valeur -1 indique que le nombre de tentatives de reconnexion est illimit&eacute; (le programme client tentera de se connecter &agrave; la premi&egrave;re adresse jusqu'&agrave; ce qu'il y parvienne).</p>
<p>La valeur par d&eacute;faut est 3.</p>
</dd>
<dt><code>ReconnectInterval</code></dt>
<dd>
<p>Sp&eacute;cifie l'intervalle, en millisecondes, entre les tentatives de reconnexion. Cet intervalle s'applique aux tentatives sur chaque adresse indiqu&eacute;e dans <code>AddressList</code>, ainsi qu'aux adresses successives dans la liste. Si l'intervalle est trop court, le broker n'a pas le temps de r&eacute;cup&eacute;rer. S'il est trop long, le d&eacute;lai de reconnexion peut &ecirc;tre inacceptable.</p>
<p>La valeur par d&eacute;faut est 30 000.</p>
</dd>
<dt><code>AddressListBehavior</code></dt>
<dd>
<p>Indique si les tentatives de connexion doivent suivre l'ordre des adresses indiqu&eacute;es dans l'attribut <code>AddressList</code> (<code>PRIORITY</code>) ou un ordre al&eacute;atoire (<code>RANDOM</code>).</p>
<p><code>RANDOM</code> signifie que le processus de reconnexion choisit une adresse au hasard dans <code>AddressList</code>. Si un grand nombre de clients sont susceptibles de se connecter en utilisant la m&ecirc;me fabrique de connexions, cette valeur les emp&ecirc;che d'&ecirc;tre tous connect&eacute;s &agrave; la m&ecirc;me adresse.</p>
<p><code>PRIORITY</code> signifie que le processus de reconnexion tentera toujours de se connecter &agrave; la premi&egrave;re adresse de serveur dans <code>AddressList</code> et n'utilisera une autre adresse que si le premier broker n'est pas disponible.</p>
<p>La valeur par d&eacute;faut est <code>RANDOM</code>.</p>
</dd>
<dt><code>AddressListIterations</code></dt>
<dd>
<p>Indique le nombre d'it&eacute;rations du programme client dans <code>AddressList</code> pour &eacute;tablir (ou r&eacute;tablir) une connexion. La valeur -1 indique que le nombre de tentatives est illimit&eacute;.</p>
<p>La valeur par d&eacute;faut est 3.</p>
</dd>
</dl>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
