<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsservice-additional-props" name="ref-jmsservice-additional-props"></a></p>

<h4><a id="sthref77" name="sthref77"></a><a id="sthref78" name="sthref78"></a>Propri&eacute;t&eacute;s propres au service JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Les propri&eacute;t&eacute;s suivantes de configuration du broker Message Queue de Oracle sont disponibles pour le service JMS.</p>
<dl>
<dt><code>instance-name</code></dt>
<dd>
<p>Indique le nom complet de l'instance de broker Message Queue. La valeur par d&eacute;faut est <code>imqbroker</code>.</p>
</dd>
<dt><code>instance-name-suffix</code></dt>
<dd>
<p>Sp&eacute;cifie un suffixe &agrave; ajouter au nom complet de l'instance de broker Message Queue. Le suffixe est s&eacute;par&eacute; du nom de l'instance par un trait de soulignement (<code>_</code>). Par exemple, si le nom de l'instance est <code>imqbroker</code>, l'ajout du suffixe <code>xyz</code> donne le nom <code>imqbroker_xyz</code>.</p>
</dd>
<dt><code>append-version</code></dt>
<dd>
<p>Si cette propri&eacute;t&eacute; a la valeur <code>true</code>, ajoute au nom d'instance de broker Message Queue les num&eacute;ros de version principale et secondaire, pr&eacute;c&eacute;d&eacute;s par des traits de soulignement (<code>_</code>). Par exemple, si le nom de l'instance est <code>imqbroker</code>, l'ajout des num&eacute;ros de version donne le nom <code>imqbroker_8_0</code>. La valeur par d&eacute;faut est <code>false</code>.</p>
</dd>
<dt><code>user-name</code></dt>
<dd>
<p>Nom utilisateur employ&eacute; pour la cr&eacute;ation de la connexion JMS. N&eacute;cessaire uniquement si le nom utilisateur ou le mot de passe par d&eacute;faut (<code>guest</code>/<code>guest</code>) n'est pas disponible dans le broker. La valeur par d&eacute;faut est <code>guest</code>.</p>
</dd>
<dt><code>password</code></dt>
<dd>
<p>Mot de passe employ&eacute; pour la cr&eacute;ation de la connexion JMS. N&eacute;cessaire uniquement si le nom utilisateur ou le mot de passe par d&eacute;faut (<code>guest</code>/<code>guest</code>) n'est pas disponible dans le broker. La valeur par d&eacute;faut est <code>guest</code>.</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
