<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsconnectionedit" name="task-jmsconnectionedit"></a></p>

<h4><a id="sthref5" name="sthref5"></a><a id="sthref6" name="sthref6"></a>Modification d'une ressource de fabrique de connexions JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Ressources.</p>
</li>
<li>
<p>Sous le noeud Ressources, d&eacute;veloppez le noeud Ressources JMS.</p>
</li>
<li>
<p>Sous le noeud Ressources JMS, s&eacute;lectionnez le noeud Fabriques de connexions JMS.</p>
<p>La page Fabriques de connexions JMS appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Fabriques de connexions JMS, cliquez sur le nom de la fabrique de connexions &agrave; modifier.</p>
<p>La page Modifier une fabrique de connexions JMS appara&icirc;t.</p>
</li>
<li>
<p>Dans le champ Description, saisissez la description de la fabrique de connexions.</p>
</li>
<li>
<p>S&eacute;lectionnez la case Activ&eacute; du champ Statut pour activer la ressource lors de l'ex&eacute;cution.</p>
<p>Cette option est activ&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Dans le champ Taille initiale et minimale du pool, sp&eacute;cifiez le nombre minimal de connexions dans le pool.</p>
<p>La valeur par d&eacute;faut est 8.</p>
</li>
<li>
<p>Dans le champ Taille maximale du pool, sp&eacute;cifiez le nombre maximal de connexions dans le pool.</p>
<p>La valeur par d&eacute;faut est 32.</p>
</li>
<li>
<p>Dans le champ Valeur de redimensionnement du pool, sp&eacute;cifiez le nombre de connexions &agrave; enlever lorsque le d&eacute;lai d'inactivit&eacute; du pool est d&eacute;pass&eacute;.</p>
<p>La valeur par d&eacute;faut est 2.</p>
</li>
<li>
<p>Dans le champ D&eacute;lai d'inactivit&eacute;, sp&eacute;cifiez la dur&eacute;e maximale, en secondes, pendant laquelle une connexion peut rester inactive dans le pool.</p>
<p>La valeur par d&eacute;faut est 300.</p>
</li>
<li>
<p>Dans le champ Attente max., sp&eacute;cifiez le d&eacute;lai d'attente au-del&agrave; duquel la connexion est temporis&eacute;e pour l'application demandant une connexion.</p>
<p>La valeur par d&eacute;faut est 60 000.</p>
</li>
<li>
<p>Si la case Fermer toutes les connexions du champ Echec sur tout est coch&eacute;e, GlassFish Server ferme toutes les connexions du pool et les r&eacute;tablit en cas d'&eacute;chec de l'une d'entre elles.</p>
<p>Si vous ne s&eacute;lectionnez pas cette case, les connexions individuelles ne seront r&eacute;tablies que lorsqu'elles seront utilis&eacute;es.</p>
</li>
<li>
<p>Pour une ressource de fabrique de connexions JMS, sp&eacute;cifiez la valeur de prise en charge des transactions comme suit :</p>
<ul>
<li>
<p>Choisissez <code>XATransaction</code> (valeur par d&eacute;faut) si la ressource peut &ecirc;tre utilis&eacute;e pour les transactions impliquant l'utilisation de plusieurs ressources dans la port&eacute;e d'une transaction.</p>
<p>Par exemple, cette ressource plus une ressource JDBC, une ressource de connecteur ou une autre ressource de fabrique de connexions JMS. Cette valeur offre un maximum de flexibilit&eacute;. Les ressources configur&eacute;es comme <code>XATransaction</code> participent aux op&eacute;rations de validation (commit) en deux phases.</p>
</li>
<li>
<p>Choisissez <code>LocalTransaction</code> si la ressource peut &ecirc;tre utilis&eacute;e soit pour les transactions impliquant uniquement une ressource dans la port&eacute;e de la transaction, soit en tant que dernier agent dans une transaction distribu&eacute;e impliquant plusieurs ressources XA.</p>
<p>Cette valeur offre de meilleures performances. Les ressources configur&eacute;es comme <code>LocalTransaction</code> ne sont pas utilis&eacute;es dans les op&eacute;rations de validation (commit) en deux phases.</p>
</li>
<li>
<p>Choisissez <code>NoTransaction</code> si la ressource ne peut participer &agrave; aucune transaction.</p>
<p>Dans les applications JMS, l'utilisation de cette configuration est limit&eacute;e.</p>
</li>
</ul>
</li>
<li>
<p>Cochez la case Validation de la connexion pour activer la validation de la connexion.</p>
<p>Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Dans la table Autres propri&eacute;t&eacute;s, sp&eacute;cifiez les propri&eacute;t&eacute;s suppl&eacute;mentaires de la fabrique de connexions.</p>
<p>Pour plus d'informations sur les propri&eacute;t&eacute;s disponibles, reportez-vous &agrave; <a href="ref-jmsconnectionproperties.html">Propri&eacute;t&eacute;s propres aux fabriques de connexions JMS</a>.</p>
<ul>
<li>
<p>Pour ajouter une propri&eacute;t&eacute;, cliquez sur le bouton Ajouter une propri&eacute;t&eacute;. Sur la ligne vide qui appara&icirc;t, saisissez le nom de la propri&eacute;t&eacute; dans le champ Nom et la valeur de la propri&eacute;t&eacute; dans le champ Valeur.</p>
</li>
<li>
<p>Pour modifier une propri&eacute;t&eacute;, modifiez le champ Valeur de cette propri&eacute;t&eacute;.</p>
</li>
<li>
<p>Pour supprimer une propri&eacute;t&eacute;, s&eacute;lectionnez la case situ&eacute;e &agrave; gauche du champ Nom de la propri&eacute;t&eacute; &agrave; supprimer, puis cliquez sur le bouton Supprimer des propri&eacute;t&eacute;s.</p>
</li>
</ul>
</li>
<li>
<p>Vous pouvez cliquer sur l'onglet Cibles pour acc&eacute;der &agrave; la page Cibles de ressources de la fabrique de connexions JMS. Sur cette page, proc&eacute;dez comme suit :</p>
<ol type="a">
<li>
<p>Cliquez sur G&eacute;rer les cibles pour ouvrir la page G&eacute;rer les cibles des ressources.</p>
<p>Sur cette page, d&eacute;placez les cibles entre les colonnes Disponible et S&eacute;lectionn&eacute;. Dans la colonne S&eacute;lectionn&eacute;, veillez &agrave; placer les cibles sur lesquelles les applications qui utilisent la ressource seront d&eacute;ploy&eacute;es. Les cibles disponibles comprennent les instances de serveur et les clusters disponibles, ainsi que l'instance de serveur par d&eacute;faut <code>server</code>. Cliquez sur OK pour enregistrer les modifications.</p>
</li>
<li>
<p>Cochez la case correspondant &agrave; une cible, puis cliquez sur Activer ou sur D&eacute;sactiver pour activer ou d&eacute;sactiver la ressource pour cette cible.</p>
</li>
</ol>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>

<hr>
<p><b>Conseil:</b></p>
Pour revenir aux param&egrave;tres par d&eacute;faut, cliquez sur le bouton Charger les valeurs par d&eacute;faut, puis sur Enregistrer.
<hr>

</li>
</ol>
<a id="sthref7" name="sthref7"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-jmsconnectionnew.html">Cr&eacute;ation d'une ressource de fabrique de connexions JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">Suppression d'une ressource de fabrique de connexions JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationnew.html">Cr&eacute;ation d'une ressource de destination JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationedit.html">Modification d'une ressource de destination JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationdelete.html">Suppression d'une ressource de destination JMS</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
