<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsconnectionnew" name="task-jmsconnectionnew"></a><a id="GHJMS00020" name="GHJMS00020"></a></p>

<h4><a id="sthref2" name="sthref2"></a><a id="sthref3" name="sthref3"></a>Cr&eacute;ation d'une ressource de fabrique de connexions JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Lorsque vous cr&eacute;ez une fabrique de connexions JMS, GlassFish Server cr&eacute;e un pool de connexions de connecteur et une ressource de connecteur pour la fabrique de connexions. Vous pouvez visualiser ces objets sous le noeud Connecteurs.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Ressources.</p>
</li>
<li>
<p>Sous le noeud Ressources, d&eacute;veloppez le noeud Ressources JMS.</p>
</li>
<li>
<p>Sous le noeud Ressources JMS, s&eacute;lectionnez le noeud Fabriques de connexions JMS.</p>
<p>La page Fabriques de connexions JMS appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Fabriques de connexions JMS, cliquez sur Nouveau.</p>
<p>La page Nouvelle fabrique de connexions JMS appara&icirc;t.</p>
</li>
<li>
<p>Dans le champ Nom du pool, saisissez le nom unique de la fabrique de connexions.</p>
<p>GlassFish Server d&eacute;finit le nom JNDI de la fabrique de connexions sur cette valeur.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Type de ressource, s&eacute;lectionnez <code>javax.jms.ConnectionFactory</code>, <code>javax.jms.QueueConnectionFactory</code> ou <code>javax.jms.TopicConnectionFactory</code>.</p>
</li>
<li>
<p>Dans le champ Description, saisissez la description de la fabrique de connexions.</p>
</li>
<li>
<p>S&eacute;lectionnez la case Activ&eacute; du champ Statut pour activer la ressource lors de l'ex&eacute;cution.</p>
<p>Cette option est activ&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Dans le champ Taille initiale et minimale du pool, sp&eacute;cifiez le nombre minimal de connexions dans le pool.</p>
<p>La valeur par d&eacute;faut est 8.</p>
</li>
<li>
<p>Dans le champ Taille maximale du pool, sp&eacute;cifiez le nombre maximal de connexions dans le pool.</p>
<p>La valeur par d&eacute;faut est 32.</p>
</li>
<li>
<p>Dans le champ Valeur de redimensionnement du pool, sp&eacute;cifiez le nombre de connexions &agrave; enlever lorsque le d&eacute;lai d'inactivit&eacute; du pool est d&eacute;pass&eacute;.</p>
<p>La valeur par d&eacute;faut est 2.</p>
</li>
<li>
<p>Dans le champ D&eacute;lai d'inactivit&eacute;, sp&eacute;cifiez la dur&eacute;e maximale, en secondes, pendant laquelle une connexion peut rester inactive dans le pool.</p>
<p>La valeur par d&eacute;faut est 300.</p>
</li>
<li>
<p>Dans le champ Attente max., sp&eacute;cifiez le d&eacute;lai d'attente au-del&agrave; duquel la connexion est temporis&eacute;e pour l'application demandant une connexion.</p>
<p>La valeur par d&eacute;faut est 60 000.</p>
</li>
<li>
<p>Si la case Fermer toutes les connexions du champ Echec sur tout est coch&eacute;e, GlassFish Server ferme toutes les connexions du pool et les r&eacute;tablit en cas d'&eacute;chec de l'une d'entre elles.</p>
<p>Si vous ne s&eacute;lectionnez pas cette case, les connexions individuelles ne seront r&eacute;tablies que lorsqu'elles seront utilis&eacute;es. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Pour une ressource de fabrique de connexions JMS, s&eacute;lectionnez le niveau de prise en charge des transactions.</p>
<p>La valeur s&eacute;lectionn&eacute;e remplace l'attribut de prise en charge des transactions dans l'adaptateur de ressources de fa&ccedil;on &agrave; garantir la compatibilit&eacute; descendante.</p>
<ul>
<li>
<p>S&eacute;lectionnez XATransaction (valeur par d&eacute;faut pour l'adaptateur de ressources JMS) pour une ressource pouvant &ecirc;tre utilis&eacute;e pour les transactions qui impliquent l'utilisation de plusieurs ressources dans la port&eacute;e d'une transaction.</p>
<p>Par exemple, les transactions peuvent impliquer cette ressource ainsi qu'une ressource JDBC, une ressource de connecteur ou une autre ressource de fabrique de connexions JMS. Cette valeur offre un maximum de flexibilit&eacute;. Une ressource qui est configur&eacute;e comme XATransaction participera aux op&eacute;rations de validation (commit) en deux phases.</p>
</li>
<li>
<p>S&eacute;lectionnez LocalTransaction pour une ressource pouvant &ecirc;tre utilis&eacute;e soit pour les transactions qui impliquent uniquement une ressource dans la port&eacute;e de la transaction, soit en tant que dernier agent dans une transaction distribu&eacute;e qui implique plusieurs ressources XA.</p>
<p>Cette valeur offre de meilleures performances. Une ressource qui est configur&eacute;e comme LocalTransaction ne sera pas utilis&eacute;e dans les op&eacute;rations de validation (commit) en deux phases.</p>
</li>
<li>
<p>S&eacute;lectionnez NoTransaction pour une ressource qui ne peut participer &agrave; aucune transaction.</p>
<p>Dans les applications JMS, l'utilisation de cette configuration est limit&eacute;e.</p>
</li>
</ul>
</li>
<li>
<p>Cochez la case Obligatoire du champ Validation de la connexion pour activer la validation des connexions.</p>
<p>Si cette option est s&eacute;lectionn&eacute;e, les connexions sont valid&eacute;es avant d'&ecirc;tre affect&eacute;es &agrave; l'application. Si la validation d'une ressource &eacute;choue, elle est d&eacute;truite et une autre ressource est cr&eacute;&eacute;e puis renvoy&eacute;e. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Dans la section Autres propri&eacute;t&eacute;s, sp&eacute;cifiez les propri&eacute;t&eacute;s suppl&eacute;mentaires de la fabrique de connexions.</p>
<p>Pour plus d'informations sur les propri&eacute;t&eacute;s disponibles, reportez-vous &agrave; <a href="ref-jmsconnectionproperties.html">Propri&eacute;t&eacute;s propres aux fabriques de connexions JMS</a>.</p>
<p>Pour ajouter une propri&eacute;t&eacute;, cliquez sur le bouton Ajouter une propri&eacute;t&eacute;. Sur la ligne vide qui appara&icirc;t, saisissez le nom de la propri&eacute;t&eacute; dans le champ Nom et la valeur de la propri&eacute;t&eacute; dans le champ Valeur.</p>
</li>
<li>
<p>Dans la zone Cibles, proc&eacute;dez comme suit :</p>
<ol type="a">
<li>
<p>Dans la colonne Disponible, s&eacute;lectionnez les cibles sur lesquelles les applications qui utilisent la ressource seront d&eacute;ploy&eacute;es.</p>
<p>Les cibles disponibles comprennent les instances de serveur et les clusters disponibles, ainsi que l'instance de serveur par d&eacute;faut <code>server</code>.</p>
</li>
<li>
<p>Cliquez sur Ajouter pour d&eacute;placer la cible vers la colonne S&eacute;lectionn&eacute;.</p>
</li>
</ol>
</li>
<li>
<p>Cliquez sur OK.</p>
</li>
</ol>
<a id="sthref4" name="sthref4"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-jmsconnectionedit.html">Modification d'une ressource de fabrique de connexions JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">Suppression d'une ressource de fabrique de connexions JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationnew.html">Cr&eacute;ation d'une ressource de destination JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationedit.html">Modification d'une ressource de destination JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationdelete.html">Suppression d'une ressource de destination JMS</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
