<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsphysicaldestnew" name="task-jmsphysicaldestnew"></a><a id="GHJMS00030" name="GHJMS00030"></a></p>

<h4><a id="sthref30" name="sthref30"></a><a id="sthref31" name="sthref31"></a>Cr&eacute;ation d'une destination physique JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Vous n'avez g&eacute;n&eacute;ralement pas besoin de cr&eacute;er de destinations physiques, car vous sp&eacute;cifiez un nom de destination physique lorsque vous cr&eacute;ez une ressource de destination JMS, et GlassFish Server cr&eacute;e automatiquement la destination physique si n&eacute;cessaire.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Configuration.</p>
</li>
<li>
<p>S&eacute;lectionnez l'instance &agrave; configurer :</p>
<ul>
<li>
<p>Pour configurer une instance sp&eacute;cifique, s&eacute;lectionnez le noeud de configuration de l'instance. Par exemple, pour l'instance par d&eacute;faut, <code>server</code>, s&eacute;lectionnez le noeud <code>server-config</code>.</p>
</li>
<li>
<p>Pour configurer les param&egrave;tres par d&eacute;faut des futures instances utilisant une copie de <code>default-config</code>, s&eacute;lectionnez le noeud <code>default-config</code>.</p>
</li>
</ul>
</li>
<li>
<p>Sous le noeud Configuration, d&eacute;veloppez le noeud Service JMS.</p>
</li>
<li>
<p>Sous le noeud Service JMS, s&eacute;lectionnez le noeud Destinations physiques.</p>
<p>La page Destinations physiques appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Destinations physiques, cliquez sur Nouveau.</p>
<p>La page Nouvelle destination physique appara&icirc;t.</p>
</li>
<li>
<p>Dans le champ Nom, saisissez le nom de la destination physique.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Type, s&eacute;lectionnez <code>javax.jms.Topic</code> ou <code>javax.jms.Queue</code>.</p>
</li>
<li>
<p>Dans le champ Nombre maximal de messages non distribu&eacute;s &agrave; un destinataire, saisissez le nombre maximal autoris&eacute; de messages non distribu&eacute;s pour la destination.</p>
<p>La valeur -1 signifie que le nombre de messages non distribu&eacute;s est illimit&eacute;. La valeur par d&eacute;faut est -1.</p>
</li>
<li>
<p>Dans le champ Taille maximale d'un message, saisissez la taille maximale, en octets, d'un message.</p>
<p>La valeur -1 indique une taille de message illimit&eacute;e. La valeur par d&eacute;faut est -1.</p>
</li>
<li>
<p>Dans le champ M&eacute;moire totale maximale, saisissez la taille totale maximale de la m&eacute;moire, en octets, pour les messages non distribu&eacute;s.</p>
<p>La valeur -1 signifie que la taille de la m&eacute;moire pour les messages non distribu&eacute;s est illimit&eacute;e. La valeur par d&eacute;faut est -1.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Comportement aux limites de seuil, s&eacute;lectionnez le comportement que le broker doit suivre lorsque le seuil limite de la m&eacute;moire est atteint.</p>
<ul>
<li>
<p><code>Rejeter les derniers messages en date</code> indique au broker de rejeter les messages les plus r&eacute;cents et d'en notifier le client &eacute;metteur &agrave; l'aide d'une exception, uniquement si le message est persistant.</p>
<p><code>Rejeter les derniers messages en date</code> est la valeur par d&eacute;faut.</p>
</li>
<li>
<p><code>Ralentir les &eacute;metteurs</code> indique au broker de r&eacute;duire la fr&eacute;quence &agrave; laquelle les &eacute;metteurs de messages envoient des messages.</p>
</li>
<li>
<p><code>Rejeter les &eacute;l&eacute;ments les plus anciens</code> indique au broker de supprimer les messages les plus anciens.</p>
</li>
<li>
<p><code>Rejeter les messages dont la priorit&eacute; est la plus basse</code> indique au broker de supprimer les messages dont le niveau de priorit&eacute; est le plus faible.</p>
</li>
</ul>
<p>Si la valeur est <code>Rejeter les &eacute;l&eacute;ments les plus anciens</code> ou <code>Rejeter les messages dont la priorit&eacute; est la plus basse</code> et que le param&egrave;tre Utiliser la file d'attente des messages bloqu&eacute;s a la valeur True, les messages en trop sont transf&eacute;r&eacute;s vers la file d'attente des messages bloqu&eacute;s.</p>
</li>
<li>
<p>Dans le champ Nombre maximal d'&eacute;metteurs, saisissez le nombre maximal d'&eacute;metteurs de messages pouvant &ecirc;tre associ&eacute;s &agrave; cette destination physique.</p>
<p>Lorsque cette limite est atteinte, aucun &eacute;metteur suppl&eacute;mentaire ne peut &ecirc;tre cr&eacute;&eacute;. La valeur -1 indique un nombre illimit&eacute; d'&eacute;metteurs. La valeur par d&eacute;faut est 100.</p>
</li>
<li>
<p>Dans le champ Nombre maximal de messages lors de la distribution par batch, saisissez le nombre maximal de messages pouvant &ecirc;tre transmis aux destinataires en un seul batch.</p>
<p>La valeur -1 indique un nombre illimit&eacute; de messages. La valeur par d&eacute;faut est 1000.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Utiliser la file d'attente des messages bloqu&eacute;s, s&eacute;lectionnez True pour placer les messages bloqu&eacute;s dans la file d'attente des messages bloqu&eacute;s.</p>
<p>Si la valeur est False, les messages bloqu&eacute;s sont supprim&eacute;s. Cette option a la valeur True par d&eacute;faut.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Valider le sch&eacute;ma XML, s&eacute;lectionnez True pour activer la validation de sch&eacute;ma XML pour la destination.</p>
<p>Si la valeur est True, le programme client Message Queue tentera de valider un message XML par rapport aux d&eacute;finitions de sch&eacute;ma XML sp&eacute;cifi&eacute;es (ou par rapport &agrave; la DTD si aucun fichier XSD n'est sp&eacute;cifi&eacute;) avant de l'envoyer au broker. Si le sch&eacute;ma sp&eacute;cifi&eacute; est introuvable ou que le message ne peut pas &ecirc;tre valid&eacute;, celui-ci n'est pas envoy&eacute; et une exception est g&eacute;n&eacute;r&eacute;e. Cette option a la valeur False par d&eacute;faut.</p>
</li>
<li>
<p>Dans le champ Liste des URI du sch&eacute;ma XML, entrez la liste des cha&icirc;nes d'URI de d&eacute;finition de sch&eacute;ma XML (XSD) s&eacute;par&eacute;es par des espaces.</p>
<p>Si la validation de sch&eacute;ma XML est activ&eacute;e, les URI pointent vers l'emplacement des fichiers XSD &agrave; utiliser pour la validation de sch&eacute;ma XML.</p>
</li>
</ol>
<a id="sthref32" name="sthref32"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-jmsservice.html">Configuration du service JMS</a></p>
</li>
<li>
<p><a href="task-jmshostnew.html">Cr&eacute;ation d'un h&ocirc;te JMS</a></p>
</li>
<li>
<p><a href="task-jmshostedit.html">Modification d'un h&ocirc;te JMS</a></p>
</li>
<li>
<p><a href="task-jmshostdelete.html">Suppression d'un h&ocirc;te JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestedit.html">Modification d'une destination physique JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestdelete.html">Suppression d'une destination physique JMS</a></p>
</li>
<li>
<p><a href="task-jmsflushmessages.html">Suppression des messages d'une destination physique JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldeststats.html">Visualisation des statistiques d'une destination physique JMS</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
