<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsdestinationedit" name="task-jmsdestinationedit"></a><a id="GHJMS00024" name="GHJMS00024"></a></p>

<h4><a id="sthref14" name="sthref14"></a><a id="sthref15" name="sthref15"></a>Modification d'une ressource de destination JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Ressources.</p>
</li>
<li>
<p>Sous le noeud Ressources, d&eacute;veloppez le noeud Ressources JMS.</p>
</li>
<li>
<p>Sous le noeud Ressources JMS, s&eacute;lectionnez le noeud Ressources de destination JMS.</p>
<p>La page Ressources de destination JMS appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Ressources de destination JMS, cliquez sur le nom de la ressource de destination &agrave; modifier.</p>
<p>La page Modifier une ressource de destination JMS appara&icirc;t.</p>
</li>
<li>
<p>Dans le champ Nom de la destination physique, saisissez le nom de la destination physique &agrave; associer &agrave; cette ressource.</p>
<p>GlassFish Server cr&eacute;e la destination physique automatiquement lorsque cela est n&eacute;cessaire et la supprime lorsque vous supprimez la ressource de destination.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Type de ressource, s&eacute;lectionnez <code>javax.jms.Topic</code> ou <code>javax.jms.Queue</code>.</p>
</li>
<li>
<p>Dans le champ Description, saisissez la description de la ressource de destination.</p>
</li>
<li>
<p>S&eacute;lectionnez la case Activ&eacute; du champ Statut pour activer la ressource lors de l'ex&eacute;cution.</p>
<p>Cette option est activ&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Dans la zone Autres propri&eacute;t&eacute;s, sp&eacute;cifiez les propri&eacute;t&eacute;s suppl&eacute;mentaires de la ressource de destination.</p>
<p>GlassFish Server ne d&eacute;finit aucune autre propri&eacute;t&eacute; pour les ressources de destination JMS.</p>
<ul>
<li>
<p>Pour ajouter une propri&eacute;t&eacute;, cliquez sur le bouton Ajouter une propri&eacute;t&eacute;. Sur la ligne vide qui appara&icirc;t, saisissez le nom de la propri&eacute;t&eacute; dans le champ Nom et la valeur de la propri&eacute;t&eacute; dans le champ Valeur.</p>
</li>
<li>
<p>Pour modifier une propri&eacute;t&eacute;, modifiez le champ Valeur de cette propri&eacute;t&eacute;.</p>
</li>
<li>
<p>Pour supprimer une propri&eacute;t&eacute;, s&eacute;lectionnez la case situ&eacute;e &agrave; gauche du champ Nom de la propri&eacute;t&eacute; &agrave; supprimer, puis cliquez sur le bouton Supprimer des propri&eacute;t&eacute;s.</p>
</li>
</ul>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>

<hr>
<p><b>Conseil:</b></p>
Pour revenir aux param&egrave;tres par d&eacute;faut, cliquez sur le bouton Charger les valeurs par d&eacute;faut, puis sur Enregistrer.
<hr>

</li>
<li>
<p>Vous pouvez cliquer sur l'onglet Cibles pour acc&eacute;der &agrave; la page Cibles de la ressource de destination JMS. Sur cette page, proc&eacute;dez comme suit :</p>
<ol type="a">
<li>
<p>Cliquez sur G&eacute;rer les cibles pour ouvrir la page G&eacute;rer les cibles des ressources.</p>
<p>Sur cette page, d&eacute;placez les cibles entre les colonnes Disponible et S&eacute;lectionn&eacute;. Dans la colonne S&eacute;lectionn&eacute;, veillez &agrave; placer les cibles sur lesquelles les applications qui utilisent la ressource seront d&eacute;ploy&eacute;es. Les cibles disponibles comprennent les instances de serveur et les clusters disponibles, ainsi que l'instance de serveur par d&eacute;faut <code>server</code>. Cliquez sur OK pour enregistrer les modifications.</p>
</li>
<li>
<p>Cochez la case correspondant &agrave; une cible, puis cliquez sur Activer ou sur D&eacute;sactiver pour activer ou d&eacute;sactiver la ressource pour cette cible.</p>
</li>
</ol>
</li>
</ol>
<a id="sthref16" name="sthref16"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-jmsconnectionnew.html">Cr&eacute;ation d'une ressource de fabrique de connexions JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectionedit.html">Modification d'une ressource de fabrique de connexions JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">Suppression d'une ressource de fabrique de connexions JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationnew.html">Cr&eacute;ation d'une ressource de destination JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationdelete.html">Suppression d'une ressource de destination JMS</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
