<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmshostnew" name="task-jmshostnew"></a><a id="GHJMS00027" name="GHJMS00027"></a></p>

<h4><a id="sthref24" name="sthref24"></a>Cr&eacute;ation d'un h&ocirc;te JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Configuration.</p>
</li>
<li>
<p>S&eacute;lectionnez l'instance &agrave; configurer :</p>
<ul>
<li>
<p>Pour configurer une instance sp&eacute;cifique, s&eacute;lectionnez le noeud de configuration de l'instance. Par exemple, pour l'instance par d&eacute;faut, <code>server</code>, s&eacute;lectionnez le noeud <code>server-config</code>.</p>
</li>
<li>
<p>Pour configurer les param&egrave;tres par d&eacute;faut des futures instances utilisant une copie de <code>default-config</code>, s&eacute;lectionnez le noeud <code>default-config</code>.</p>
</li>
</ul>
</li>
<li>
<p>Sous le noeud Configuration, d&eacute;veloppez le noeud Service JMS.</p>
</li>
<li>
<p>Sous le noeud Service JMS, s&eacute;lectionnez le noeud H&ocirc;tes JMS.</p>
<p>La page H&ocirc;tes JMS appara&icirc;t.</p>
</li>
<li>
<p>Sur la page H&ocirc;tes JMS, cliquez sur Nouveau.</p>
<p>La page Nouvel h&ocirc;te JMS appara&icirc;t.</p>
</li>
<li>
<p>Dans le champ Nom, saisissez le nom de l'h&ocirc;te.</p>
<p>Exemple :</p>
<pre>
NewJmsHost
</pre></li>
<li>
<p>Dans le champ H&ocirc;te, saisissez le nom ou l'adresse IP du syst&egrave;me sur lequel l'h&ocirc;te JMS sera ex&eacute;cut&eacute; (<code>localhost</code> ou le nom du syst&egrave;me local ou distant).</p>
</li>
<li>
<p>Dans le champ Port, indiquez le num&eacute;ro de port du service JMS.</p>
<p>Ne modifiez ce champ que si le service JMS &agrave; utiliser n'est pas ex&eacute;cut&eacute; sur le port par d&eacute;faut. Le port par d&eacute;faut est 7676.</p>
</li>
<li>
<p>Dans les champs Nom utilisateur de l'administrateur et Mot de passe de l'administrateur, saisissez le nom utilisateur et le mot de passe du broker Message Queue.</p>
<p>Ceux-ci diff&egrave;rent du nom utilisateur et du mot de passe GlassFish Server. Modifiez ces champs uniquement si les valeurs du broker Message Queue ont &eacute;t&eacute; modifi&eacute;es &agrave; l'aide de la commande as-install-parent<code>/mq/bin/imqusermgr</code>. Les valeurs par d&eacute;faut sont <code>admin</code> et <code>admin</code>.</p>
</li>
<li>
<p>Cliquez sur OK.</p>
</li>
</ol>
<a id="sthref25" name="sthref25"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-jmsservice.html">Configuration du service JMS</a></p>
</li>
<li>
<p><a href="task-jmshostedit.html">Modification d'un h&ocirc;te JMS</a></p>
</li>
<li>
<p><a href="task-jmshostdelete.html">Suppression d'un h&ocirc;te JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestnew.html">Cr&eacute;ation d'une destination physique JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestedit.html">Modification d'une destination physique JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestdelete.html">Suppression d'une destination physique JMS</a></p>
</li>
<li>
<p><a href="task-jmsflushmessages.html">Suppression des messages d'une destination physique JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldeststats.html">Visualisation des statistiques d'une destination physique JMS</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
