<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsdestinationnew" name="task-jmsdestinationnew"></a><a id="GHJMS00023" name="GHJMS00023"></a></p>

<h4><a id="sthref11" name="sthref11"></a><a id="sthref12" name="sthref12"></a>Cr&eacute;ation d'une ressource de destination JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Lorsque vous cr&eacute;ez une ressource de destination JMS, GlassFish Server cr&eacute;e une ressource d'objet d'administration pour la ressource de destination. Vous pouvez visualiser cette ressource sous le noeud Connecteurs.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Ressources.</p>
</li>
<li>
<p>Sous le noeud Ressources, d&eacute;veloppez le noeud Ressources JMS.</p>
</li>
<li>
<p>Sous le noeud Ressources JMS, s&eacute;lectionnez le noeud Ressources de destination JMS.</p>
<p>La page Ressources de destination JMS appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Ressources de destination JMS, cliquez sur Nouveau.</p>
<p>La page Nouvelle ressource de destination JMS appara&icirc;t.</p>
</li>
<li>
<p>Dans le champ Nom JNDI, saisissez le nom JNDI de la ressource.</p>
<p>Il est recommand&eacute; d'utiliser le pr&eacute;fixe de d&eacute;nomination de sous-contexte <code>jms/</code> pour les ressources JMS. Par exemple : <code>jms/Queue</code>.</p>
</li>
<li>
<p>Dans le champ Nom de la destination physique, saisissez le nom de la destination physique &agrave; associer &agrave; cette ressource.</p>
<p>GlassFish Server cr&eacute;e la destination physique automatiquement lorsque cela est n&eacute;cessaire et la supprime lorsque vous supprimez la ressource de destination.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Type de ressource, s&eacute;lectionnez <code>javax.jms.Topic</code> ou <code>javax.jms.Queue</code>.</p>
</li>
<li>
<p>Dans le champ Description, saisissez la description de la ressource de destination.</p>
</li>
<li>
<p>S&eacute;lectionnez la case Activ&eacute; du champ Statut pour activer la ressource lors de l'ex&eacute;cution.</p>
<p>Cette option est activ&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Dans la zone Autres propri&eacute;t&eacute;s, sp&eacute;cifiez les propri&eacute;t&eacute;s suppl&eacute;mentaires de la ressource de destination.</p>
<p>GlassFish Server ne d&eacute;finit aucune autre propri&eacute;t&eacute; pour les ressources de destination JMS.</p>
<p>Pour ajouter une propri&eacute;t&eacute;, cliquez sur le bouton Ajouter une propri&eacute;t&eacute;. Sur la ligne vide qui appara&icirc;t, saisissez le nom de la propri&eacute;t&eacute; dans le champ Nom et la valeur de la propri&eacute;t&eacute; dans le champ Valeur.</p>
</li>
<li>
<p>Dans la zone Cibles, proc&eacute;dez comme suit :</p>
<ol type="a">
<li>
<p>Dans la colonne Disponible, s&eacute;lectionnez les cibles sur lesquelles les applications qui utilisent la ressource seront d&eacute;ploy&eacute;es.</p>
<p>Les cibles disponibles comprennent les instances de serveur et les clusters disponibles, ainsi que l'instance de serveur par d&eacute;faut <code>server</code>.</p>
</li>
<li>
<p>Cliquez sur Ajouter pour d&eacute;placer la cible vers la colonne S&eacute;lectionn&eacute;.</p>
</li>
</ol>
</li>
<li>
<p>Cliquez sur OK.</p>
</li>
</ol>
<a id="sthref13" name="sthref13"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-jmsconnectionnew.html">Cr&eacute;ation d'une ressource de fabrique de connexions JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectionedit.html">Modification d'une ressource de fabrique de connexions JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">Suppression d'une ressource de fabrique de connexions JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationedit.html">Modification d'une ressource de destination JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationdelete.html">Suppression d'une ressource de destination JMS</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
