<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterproperties" name="ref-clusterproperties"></a></p>

<h4><a id="sthref300" name="sthref300"></a><a id="sthref301" name="sthref301"></a>&#12463;&#12521;&#12473;&#12479;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;&#12463;&#12521;&#12473;&#12479;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#36984;&#25246;&#12375;&#12383;&#12463;&#12521;&#12473;&#12479;&#12395;&#23550;&#12375;&#12390;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12522;&#12473;&#12488;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#12463;&#12521;&#12473;&#12479;&#12395;&#38306;&#12377;&#12427;&#12458;&#12503;&#12471;&#12519;&#12531;&#12398;&#27083;&#25104;&#24773;&#22577;&#12434;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12463;&#12521;&#12473;&#12479;&#21517;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#12289;&#36984;&#25246;&#12375;&#12383;&#12463;&#12521;&#12473;&#12479;&#12398;&#21517;&#21069;&#12364;&#34920;&#31034;&#12373;&#12428;&#12427;&#35501;&#21462;&#12426;&#23554;&#29992;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12391;&#12377;&#12290;</p>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12372;&#12392;&#12395;&#12289;&#27425;&#12398;&#24773;&#22577;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;:</p>
<dl>
<dt>&#21517;&#21069;</dt>
<dd>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21517;&#21069;&#12290;</p>
</dd>
<dt>&#20516;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#23550;&#12375;&#12390;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12290;</p>
</dd>
<dt>&#35500;&#26126;</dt>
<dd>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#38306;&#12377;&#12427;&#35443;&#32048;&#12434;&#25552;&#20379;&#12377;&#12427;&#12486;&#12461;&#12473;&#12488;&#24418;&#24335;&#12398;&#35500;&#26126;&#12290;</p>
</dd>
</dl>
<p>&#12300;&#36861;&#21152;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12398;&#34920;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12418;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;</dt>
<dd>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12371;&#12398;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#12300;&#36861;&#21152;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12398;&#34920;&#12395;&#34892;&#12364;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21066;&#38500;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#21066;&#38500;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#21066;&#38500;&#12373;&#12428;&#12383;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12395;&#25147;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12364;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12399;&#26410;&#23450;&#32681;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<p>GlassFish Server&#12391;&#12399;&#12289;&#27425;&#12398;&#12463;&#12521;&#12473;&#12479;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;:</p>
<dl>
<dt><code>GMS_DISCOVERY_URI_LIST</code></dt>
<dd>
<p>&#12463;&#12521;&#12473;&#12479;&#12434;&#26908;&#20986;&#12377;&#12427;&#12383;&#12417;&#12395;&#20351;&#29992;&#12377;&#12427;&#12289;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#22580;&#25152;&#12290;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;(GMS)&#12364;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12395;&#12510;&#12523;&#12481;&#12461;&#12515;&#12473;&#12488;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12395;&#12398;&#12415;&#24517;&#35201;&#12391;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#26377;&#21177;&#12394;&#20516;&#12399;&#12289;&#27425;&#12398;&#12392;&#12362;&#12426;&#12391;&#12377;:</p>
<ul>
<li>
<p>Uniform Resource Identifier (URI)&#12398;&#12459;&#12531;&#12510;&#21306;&#20999;&#12426;&#12522;&#12473;&#12488;&#12290;&#21508;URI&#12399;&#12289;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12414;&#12383;&#12399;DAS&#12398;&#20301;&#32622;&#12434;&#29305;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#35079;&#25968;&#12398;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#21516;&#12376;&#12507;&#12473;&#12488;&#19978;&#12391;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12371;&#12398;&#24418;&#24335;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;</p>
<p>&#12522;&#12473;&#12488;&#20869;&#12398;&#21508;URI&#12398;&#24418;&#24335;&#12399;&#12289;&#27425;&#12398;&#12392;&#12362;&#12426;&#12391;&#12377;&#12290;</p>
<p><i>scheme</i><code>://</code><i>host-name-or -IP-address</i><code>:</code><i>port</i></p>
<ul>
<li>
<p><i>scheme</i>&#12399;URI&#12473;&#12461;&#12540;&#12512;&#12391;&#12354;&#12426;&#12289;&#12371;&#12428;&#12399;<code>tcp</code>&#12391;&#12377;&#12290;</p>
</li>
<li>
<p><i>host-name-or -IP-address</i>&#12399;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;&#12507;&#12473;&#12488;&#12398;&#12507;&#12473;&#12488;&#21517;&#12414;&#12383;&#12399;IP&#12450;&#12489;&#12524;&#12473;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p><i>port</i>&#12399;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;GMS&#12363;&#12425;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#12522;&#12473;&#12491;&#12531;&#12464;&#12377;&#12427;&#12509;&#12540;&#12488;&#12398;&#12509;&#12540;&#12488;&#30058;&#21495;&#12391;&#12377;&#12290;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#23550;&#12375;&#12390;&#12289;&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;<code>GMS_LISTENER_PORT-</code><i>clustername</i>&#12434;&#35373;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#23550;&#12375;&#12390;&#12371;&#12398;&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#35373;&#23450;&#12377;&#12427;&#26041;&#27861;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<i>Oracle GlassFish Server&#39640;&#21487;&#29992;&#24615;&#31649;&#29702;&#12460;&#12452;&#12489;</i>&#12398;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSHAG00373">&#12510;&#12523;&#12481;&#12461;&#12515;&#12473;&#12488;&#12539;&#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;&#12364;&#28961;&#21177;&#12394;&#22580;&#21512;&#12398;&#12463;&#12521;&#12473;&#12479;&#12398;&#26908;&#20986;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>DAS&#12414;&#12383;&#12399;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;IP&#12450;&#12489;&#12524;&#12473;&#12414;&#12383;&#12399;&#12507;&#12473;&#12488;&#21517;&#12398;&#12459;&#12531;&#12510;&#21306;&#20999;&#12426;&#12522;&#12473;&#12488;&#12290;&#12522;&#12473;&#12488;&#12395;&#12399;&#12289;IP&#12450;&#12489;&#12524;&#12473;&#12362;&#12424;&#12403;&#12507;&#12473;&#12488;&#21517;&#12398;&#20001;&#26041;&#12434;&#21547;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#24418;&#24335;&#12434;&#20351;&#29992;&#12391;&#12365;&#12427;&#12398;&#12399;&#12289;&#21508;&#12507;&#12473;&#12488;&#12391;1&#12388;&#12398;&#12463;&#12521;&#12473;&#12479;&#21270;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12398;&#12415;&#12391;&#12377;&#12290;<code>GMS_LISTENER_PORT</code>&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12399;&#12289;&#12489;&#12513;&#12452;&#12531;&#20869;&#12398;&#12463;&#12521;&#12473;&#12479;&#12372;&#12392;&#12395;&#19968;&#24847;&#12391;&#12354;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12461;&#12540;&#12527;&#12540;&#12489;<code>generate</code>&#12290;&#12371;&#12398;&#24418;&#24335;&#12434;&#20351;&#29992;&#12391;&#12365;&#12427;&#12398;&#12399;&#12289;&#21508;&#12507;&#12473;&#12488;&#12391;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;1&#12388;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#23455;&#34892;&#12373;&#12428;&#12289;&#21029;&#12398;&#12507;&#12473;&#12488;&#12391;DAS&#12364;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12398;&#12415;&#12391;&#12377;&#12290;&#21516;&#12376;&#12507;&#12473;&#12488;&#19978;&#12398;&#35079;&#25968;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#12289;&#21516;&#12376;&#12463;&#12521;&#12473;&#12479;&#12398;&#12513;&#12531;&#12496;&#12540;&#12395;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;<code>GMS_LISTENER_PORT</code>&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12399;&#12289;&#12489;&#12513;&#12452;&#12531;&#20869;&#12398;&#12463;&#12521;&#12473;&#12479;&#12372;&#12392;&#12395;&#19968;&#24847;&#12391;&#12354;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</dd>
<dt><code>GMS_LISTENER_PORT</code></dt>
<dd>
<p>&#12463;&#12521;&#12473;&#12479;&#12364;GMS&#12363;&#12425;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#12522;&#12473;&#12491;&#12531;&#12464;&#12377;&#12427;&#12509;&#12540;&#12488;&#12398;&#12509;&#12540;&#12488;&#30058;&#21495;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12289;<code>GMS_LISTENER_PORT-</code><i>cluster-name</i>&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12408;&#12398;&#21442;&#29031;&#12391;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12371;&#12398;&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#22580;&#21512;&#12289;GMS&#12399;&#12289;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;<code>GMS_TCPSTARTPORT</code>&#12362;&#12424;&#12403;<code>GMS_TCPENDPORT</code>&#12391;&#23450;&#32681;&#12373;&#12428;&#12390;&#12356;&#12427;&#31684;&#22258;&#12363;&#12425;&#26410;&#20351;&#29992;&#12398;&#12509;&#12540;&#12488;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12371;&#12398;&#31684;&#22258;&#12399;9090&#12363;&#12425;9200&#12398;&#38291;&#12391;&#12377;&#12290;&#12411;&#12392;&#12435;&#12393;&#12398;&#22580;&#21512;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#21205;&#20316;&#12391;&#21839;&#38988;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;</p>
<p>&#12383;&#12384;&#12375;&#12289;GMS&#12364;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12395;&#12510;&#12523;&#12481;&#12461;&#12515;&#12473;&#12488;&#12434;&#20351;&#29992;&#12375;&#12390;<b>&#12356;&#12394;&#12356;</b>&#22580;&#21512;&#12399;&#12289;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12391;&#12289;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#12377;&#12409;&#12390;&#12398;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#23550;&#12375;&#12390;&#26377;&#21177;&#12391;&#12354;&#12427;&#12509;&#12540;&#12488;&#30058;&#21495;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#35201;&#20214;&#12434;&#28288;&#12383;&#12377;&#12383;&#12417;&#12395;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12434;&#20351;&#29992;&#12377;&#12427;&#12395;&#12399;&#12289;&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#21508;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#20491;&#21029;&#12398;&#12509;&#12540;&#12488;&#30058;&#21495;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12383;&#12392;&#12360;&#12400;&#12289;&#12300;<a href="ref-clustersystemproperties.html">&#12463;&#12521;&#12473;&#12479;&#12539;&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;</a>&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;DAS&#12395;&#23550;&#12375;&#12390;<code>GMS_LISTENER_PORT-</code><i>cluster-name</i>&#12392;&#12356;&#12358;&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;&#27425;&#12395;&#12289;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#21508;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#23550;&#12375;&#12390;&#12289;<code>GMS_LISTENER_PORT-</code><i>cluster-name</i>&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;GMS&#12363;&#12425;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#12522;&#12473;&#12491;&#12531;&#12464;&#12377;&#12427;&#12509;&#12540;&#12488;&#30058;&#21495;&#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#12463;&#12521;&#12473;&#12479;&#12398;<code>GMS_LISTENER_PORT</code>&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12289;&#12371;&#12398;&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#21442;&#29031;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt><code>GMS_LOOPBACK</code></dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#12463;&#12521;&#12473;&#12479;&#12395;&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12375;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12524;&#12505;&#12523;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#12289;&#12381;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#33258;&#36523;&#12364;&#21463;&#20449;&#12391;&#12365;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#20351;&#29992;&#21487;&#33021;&#12394;&#20516;&#12399;&#27425;&#12398;&#12392;&#12362;&#12426;&#12391;&#12377;:</p>
<dl>
<dt><code>false</code></dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#33258;&#36523;&#12363;&#12425;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#21463;&#20449;<i>&#12391;&#12365;&#12414;&#12379;&#12435;</i>(&#12487;&#12501;&#12457;&#12523;&#12488;)&#12290;</p>
</dd>
<dt><code>true</code></dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#33258;&#36523;&#12363;&#12425;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#21463;&#20449;&#12391;&#12365;&#12414;&#12377;&#12290;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#21807;&#19968;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#12354;&#12427;&#22580;&#21512;&#12395;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#12486;&#12473;&#12488;&#12377;&#12427;&#12395;&#12399;&#12289;&#12371;&#12398;&#35373;&#23450;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
</dd>
<dt><code>GMS_MULTICAST_TIME_TO_LIVE</code></dt>
<dd>
<p>&#27425;&#12398;&#12452;&#12505;&#12531;&#12488;&#12398;&#12479;&#12452;&#12503;&#12398;&#12510;&#12523;&#12481;&#12461;&#12515;&#12473;&#12488;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#21453;&#24489;&#20966;&#29702;&#12414;&#12383;&#12399;&#20253;&#36865;&#12377;&#12427;&#26368;&#22823;&#25968;&#12290;&#12371;&#12398;&#25968;&#12434;&#36229;&#12360;&#12427;&#12392;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#30772;&#26820;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#12464;&#12523;&#12540;&#12503;&#12398;&#26908;&#20986;</p>
</li>
<li>
<p>&#12513;&#12531;&#12496;&#12540;&#12398;&#12495;&#12540;&#12488;&#12499;&#12540;&#12488;</p>
</li>
<li>
<p>&#12513;&#12531;&#12496;&#12540;&#12471;&#12483;&#12503;&#12398;&#22793;&#26356;</p>
</li>
</ul>
<p>DAS&#12362;&#12424;&#12403;&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12390;&#12356;&#12427;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12398;&#27083;&#25104;&#12395;&#19968;&#33268;&#12373;&#12379;&#12427;&#12395;&#12399;&#12289;&#12371;&#12398;&#20516;&#12434;&#12391;&#12365;&#12427;&#12363;&#12366;&#12426;&#23567;&#12373;&#12367;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#12471;&#12473;&#12486;&#12512;&#12398;&#35373;&#23450;&#21487;&#33021;&#12394;&#26368;&#23567;&#20516;&#12434;&#21028;&#23450;&#12377;&#12427;&#12395;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00259"><code>validate-multicast</code>(1)</a>&#12469;&#12502;&#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#20516;0&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12510;&#12523;&#12481;&#12461;&#12515;&#12473;&#12488;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#20803;&#12398;&#12507;&#12473;&#12488;&#12363;&#12425;&#36865;&#20449;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
<p>&#20516;1&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12473;&#12452;&#12483;&#12481;&#12414;&#12383;&#12399;&#12523;&#12540;&#12479;&#12540;&#12391;&#25509;&#32154;&#12373;&#12428;&#12383;&#21516;&#12376;&#12469;&#12502;&#12493;&#12483;&#12488;&#19978;&#12398;&#12507;&#12473;&#12488;&#38291;&#12391;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12373;&#12428;&#12394;&#12367;&#12394;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;4&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12507;&#12473;&#12488;&#12364;&#12473;&#12452;&#12483;&#12481;&#12414;&#12383;&#12399;&#12523;&#12540;&#12479;&#12540;&#12391;&#25509;&#32154;&#12373;&#12428;&#12390;&#12356;&#12427;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12398;&#12377;&#12409;&#12390;&#12398;&#12463;&#12521;&#12473;&#12479;&#12539;&#12513;&#12531;&#12496;&#12540;&#12395;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#27491;&#24120;&#12395;&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt><code>GMS_TCPENDPORT</code></dt>
<dd>
<p><code>GMS_LISTENER_PORT-</code><i>cluster-name</i>&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12395;&#12289;GMS&#12364;&#26410;&#20351;&#29992;&#12398;&#12509;&#12540;&#12488;&#12434;&#36984;&#25246;&#12377;&#12427;&#31684;&#22258;&#20869;&#12398;&#26368;&#22823;&#12509;&#12540;&#12488;&#30058;&#21495;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;9200&#12391;&#12377;&#12290;</p>
</dd>
<dt><code>GMS_TCPSTARTPORT</code></dt>
<dd>
<p><code>GMS_LISTENER_PORT-</code><i>cluster-name</i>&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12395;&#12289;GMS&#12364;&#26410;&#20351;&#29992;&#12398;&#12509;&#12540;&#12488;&#12434;&#36984;&#25246;&#12377;&#12427;&#31684;&#22258;&#20869;&#12398;&#26368;&#23567;&#12509;&#12540;&#12488;&#30058;&#21495;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;9090&#12391;&#12377;&#12290;</p>
</dd>
</dl>
<a id="sthref302" name="sthref302"></a>
<h5>&#21516;&#31561;&#12398;asadmin&#12469;&#12502;&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00139"><code>get</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00145"><code>list</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00226"><code>set</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
