<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-standaloneinstanceconfigproperties" name="ref-standaloneinstanceconfigproperties"></a><a id="GHCLU00023" name="GHCLU00023"></a></p>

<h4><a id="sthref342" name="sthref342"></a><a id="sthref343" name="sthref343"></a><a id="sthref344" name="sthref344"></a>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12539;&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12539;&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#29694;&#22312;&#12398;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#23550;&#12375;&#12390;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;Java&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12522;&#12473;&#12488;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;Java&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;GlassFish Server&#12398;&#36215;&#21205;&#26178;&#12395;Java&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12521;&#12531;&#12481;&#12515;&#12398;<code>-D</code>&#12458;&#12503;&#12471;&#12519;&#12531;&#12395;&#12424;&#12387;&#12390;&#12289;Java&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12521;&#12531;&#12481;&#12515;&#12395;&#28193;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12428;&#12425;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#27083;&#25104;&#12395;&#12354;&#12427;&#12509;&#12540;&#12488;&#35373;&#23450;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#23450;&#32681;&#12434;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12375;&#12414;&#12377;&#12290;2&#12388;&#12398;&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#21516;&#12376;&#12507;&#12473;&#12488;&#19978;&#12395;&#23384;&#22312;&#12377;&#12427;&#22580;&#21512;&#12394;&#12393;&#12391;&#12399;&#12289;&#23450;&#32681;&#28168;&#12398;&#12509;&#12540;&#12488;&#35373;&#23450;&#12399;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12424;&#12358;&#12394;&#29366;&#27841;&#12391;&#12399;&#12289;&#20001;&#26041;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#21516;&#12376;&#27083;&#25104;&#12434;&#20849;&#26377;&#12377;&#12427;&#12383;&#12417;&#12289;&#19968;&#26041;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12509;&#12540;&#12488;&#35373;&#23450;&#12399;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12373;&#12428;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<p>&#27083;&#25104;&#20869;&#12398;&#20107;&#21069;&#23450;&#32681;&#28168;&#12509;&#12540;&#12488;&#35373;&#23450;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#12300;<a href="../../../common/en/help/ref-predefinedconfigsysproperties.html">&#20107;&#21069;&#23450;&#32681;&#28168;&#12398;&#27083;&#25104;&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;</a>&#12301;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>&#12300;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21517;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#12289;&#29694;&#22312;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#21517;&#21069;&#12364;&#34920;&#31034;&#12373;&#12428;&#12427;&#35501;&#21462;&#12426;&#23554;&#29992;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12391;&#12377;&#12290;</p>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12372;&#12392;&#12395;&#12289;&#27425;&#12398;&#24773;&#22577;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;:</p>
<dl>
<dt>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#22793;&#25968;&#21517;</dt>
<dd>
<p>&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21517;&#21069;&#12290;</p>
</dd>
<dt>&#29694;&#22312;&#12398;&#20516;</dt>
<dd>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#23550;&#12375;&#12390;&#29694;&#22312;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#20516;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#20516;</dt>
<dd>
<p>&#22793;&#26356;&#12398;&#20445;&#23384;&#24460;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#23550;&#12375;&#12390;&#35373;&#23450;&#12373;&#12428;&#12427;&#20516;&#12290;</p>
</dd>
</dl>
<p>&#12300;&#36861;&#21152;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12398;&#34920;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12418;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;</dt>
<dd>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12371;&#12398;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#12300;&#36861;&#21152;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12398;&#34920;&#12395;&#34892;&#12364;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21066;&#38500;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#21066;&#38500;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#21066;&#38500;&#12373;&#12428;&#12383;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12395;&#25147;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12364;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12399;&#26410;&#23450;&#32681;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<a id="sthref345" name="sthref345"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-change-standalone-instance-ports.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12509;&#12540;&#12488;&#30058;&#21495;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-config-sys-properties-defaults.html">&#27083;&#25104;&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref346" name="sthref346"></a>
<h5>&#21516;&#31561;&#12398;asadmin&#12469;&#12502;&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00059"><code>create-system-properties</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00110"><code>delete-system-property</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00203"><code>list-system-properties</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
