<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clustergeneral" name="ref-clustergeneral"></a></p>

<h4><a id="sthref251" name="sthref251"></a><a id="sthref252" name="sthref252"></a><a id="sthref253" name="sthref253"></a><a id="sthref254" name="sthref254"></a>&#19968;&#33324;&#24773;&#22577;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;&#19968;&#33324;&#24773;&#22577;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12463;&#12521;&#12473;&#12479;&#12398;&#36215;&#21205;</dt>
<dd>
<p>&#12463;&#12521;&#12473;&#12479;&#12434;&#36215;&#21205;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#12377;&#12409;&#12390;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12371;&#12398;&#12508;&#12479;&#12531;&#12399;&#38750;&#12450;&#12463;&#12486;&#12451;&#12502;&#21270;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12463;&#12521;&#12473;&#12479;&#12398;&#20572;&#27490;</dt>
<dd>
<p>&#12463;&#12521;&#12473;&#12479;&#12434;&#20572;&#27490;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#12377;&#12409;&#12390;&#20572;&#27490;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12371;&#12398;&#12508;&#12479;&#12531;&#12399;&#38750;&#12450;&#12463;&#12486;&#12451;&#12502;&#21270;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>EJB&#12479;&#12452;&#12510;&#12540;&#12398;&#31227;&#34892;</dt>
<dd>
<p>&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#20572;&#27490;&#12375;&#12390;&#12356;&#12427;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12363;&#12425;&#23455;&#34892;&#20013;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;Enterprise JavaBeans (EJB)&#12486;&#12463;&#12494;&#12525;&#12472;&#12398;&#12479;&#12452;&#12510;&#12540;&#12434;&#31227;&#34892;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12371;&#12398;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#12300;<a href="ref-migrateejbtimers.html">EJB&#12479;&#12452;&#12510;&#12540;&#12398;&#31227;&#34892;</a>&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#12377;&#12409;&#12390;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12371;&#12398;&#12508;&#12479;&#12531;&#12399;&#38750;&#12450;&#12463;&#12486;&#12451;&#12502;&#21270;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12525;&#12464;&#12398;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;</dt>
<dd>
<p>&#12463;&#12521;&#12473;&#12479;&#12398;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12434;&#34892;&#12358;&#12508;&#12479;&#12531;&#12290;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12364;&#34892;&#12431;&#12428;&#12427;&#12392;&#12289;<code>server.log_</code><i>date-and-time</i>&#12392;&#12356;&#12358;&#24418;&#24335;&#12398;&#12479;&#12452;&#12512;&#12473;&#12479;&#12531;&#12503;&#21517;&#12434;&#20351;&#29992;&#12375;&#12390;&#12501;&#12449;&#12452;&#12523;&#21517;&#12364;&#22793;&#26356;&#12373;&#12428;&#12289;&#26032;&#12375;&#12356;&#12525;&#12464;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#12383;&#12417;&#12395;&#31354;&#12398;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12364;&#20316;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#22793;&#26356;&#12399;&#21205;&#30340;&#12395;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12469;&#12540;&#12496;&#12540;&#12398;&#20877;&#36215;&#21205;&#12399;&#24517;&#35201;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>&#12463;&#12521;&#12473;&#12479;&#21517;</dt>
<dd>
<p>&#12463;&#12521;&#12473;&#12479;&#12364;&#20316;&#25104;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#12463;&#12521;&#12473;&#12479;&#12395;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12383;&#21517;&#21069;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>JVM</dt>
<dd>
<p>&#12300;JVM&#12524;&#12509;&#12540;&#12488;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;Java&#20206;&#24819;&#12510;&#12471;&#12531;&#12395;&#38306;&#12377;&#12427;&#12524;&#12509;&#12540;&#12488;&#12364;&#12289;&#26032;&#35215;&#12454;&#12451;&#12531;&#12489;&#12454;&#12391;&#38283;&#12365;&#12414;&#12377;&#12290;&#34920;&#31034;&#12373;&#12428;&#12427;&#12524;&#12509;&#12540;&#12488;&#12399;&#12289;&#12469;&#12510;&#12522;&#12540;&#12539;&#12524;&#12509;&#12540;&#12488;&#12289;&#12513;&#12514;&#12522;&#12540;&#31649;&#29702;&#12362;&#12424;&#12403;&#12460;&#12505;&#12540;&#12472;&#12539;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12539;&#12524;&#12509;&#12540;&#12488;&#12289;&#12463;&#12521;&#12473;&#12539;&#12525;&#12540;&#12487;&#12451;&#12531;&#12464;&#12539;&#12524;&#12509;&#12540;&#12488;&#12289;&#12362;&#12424;&#12403;&#29694;&#22312;&#12398;&#12473;&#12524;&#12483;&#12489;&#12398;&#12480;&#12531;&#12503;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#27083;&#25104;</dt>
<dd>
<p>&#12463;&#12521;&#12473;&#12479;&#12398;&#20316;&#25104;&#26178;&#12395;&#12463;&#12521;&#12473;&#12479;&#12395;&#23550;&#12375;&#12390;&#36984;&#25246;&#12373;&#12428;&#12383;&#27083;&#25104;&#12290;&#27083;&#25104;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#12463;&#12521;&#12473;&#12479;&#12398;&#12300;<a href="../../../common/en/help/ref-configuration.html">&#27083;&#25104;</a>&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>GMS</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12392;&#12289;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#21508;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#12489;&#12513;&#12452;&#12531;&#31649;&#29702;&#12469;&#12540;&#12496;&#12540;(DAS)&#12391;&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;(GMS)&#12364;&#38283;&#22987;&#12373;&#12428;&#12414;&#12377;&#12290;DAS&#12399;&#12289;GMS&#12364;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#21508;&#12463;&#12521;&#12473;&#12479;&#12395;&#21442;&#21152;&#12375;&#12414;&#12377;&#12290;GMS&#12399;&#12289;&#12463;&#12521;&#12473;&#12479;&#12398;&#12514;&#12491;&#12479;&#12540;&#12289;&#12463;&#12521;&#12473;&#12479;&#12398;&#12513;&#12531;&#12496;&#12540;&#12471;&#12483;&#12503;&#12289;&#12362;&#12424;&#12403;&#12464;&#12523;&#12540;&#12503;&#36890;&#20449;&#12398;&#21508;&#12469;&#12540;&#12499;&#12473;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12510;&#12523;&#12481;&#12461;&#12515;&#12473;&#12488;&#12539;&#12509;&#12540;&#12488;</dt>
<dd>
<p>GMS&#12364;&#12464;&#12523;&#12540;&#12503;&#12539;&#12452;&#12505;&#12531;&#12488;&#12434;&#12522;&#12473;&#12491;&#12531;&#12464;&#12377;&#12427;&#36890;&#20449;&#12509;&#12540;&#12488;&#12398;&#12509;&#12540;&#12488;&#30058;&#21495;&#12290;2048&#12363;&#12425;49151&#12398;&#38291;&#12398;&#26377;&#21177;&#12394;&#12509;&#12540;&#12488;&#30058;&#21495;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;&#12289;&#12371;&#12398;&#31684;&#22258;&#12363;&#12425;&#33258;&#21205;&#30340;&#12395;&#20316;&#25104;&#12373;&#12428;&#12383;&#20516;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12510;&#12523;&#12481;&#12461;&#12515;&#12473;&#12488;&#12539;&#12450;&#12489;&#12524;&#12473;</dt>
<dd>
<p>GMS&#12364;&#12464;&#12523;&#12540;&#12503;&#12539;&#12452;&#12505;&#12531;&#12488;&#12434;&#12522;&#12473;&#12491;&#12531;&#12464;&#12377;&#12427;&#12450;&#12489;&#12524;&#12473;&#12290;224.0.0.0&#12363;&#12425;239.255.255.255&#12398;&#31684;&#22258;&#12391;&#12510;&#12523;&#12481;&#12461;&#12515;&#12473;&#12488;&#12539;&#12450;&#12489;&#12524;&#12473;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;228.9<i>XX</i>. <i>YY</i>&#12391;&#12377;&#12290;<i>XX</i>&#12392;<i>YY</i>&#12399;&#12289;&#33258;&#21205;&#30340;&#12395;&#29983;&#25104;&#12373;&#12428;&#12427;0&#12363;&#12425;255&#12398;&#38291;&#12398;&#29420;&#31435;&#12375;&#12383;&#20516;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12539;&#12450;&#12489;&#12524;&#12473;&#12398;&#12496;&#12452;&#12531;&#12489;</dt>
<dd>
<p>GMS&#12364;&#12496;&#12452;&#12531;&#12489;&#12373;&#12428;&#12427;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12398;&#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12539;&#12503;&#12525;&#12488;&#12467;&#12523;(IP)&#12450;&#12489;&#12524;&#12473;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;&#12525;&#12540;&#12459;&#12523;&#12539;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12398;IP&#12450;&#12489;&#12524;&#12473;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#12497;&#12502;&#12522;&#12483;&#12463;&#12539;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12398;&#12450;&#12489;&#12524;&#12473;&#12391;&#12377;&#12290;</p>
<p>&#12510;&#12523;&#12481;&#12507;&#12540;&#12512;&#12539;&#12510;&#12471;&#12531;&#12391;&#12399;&#12289;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#12289;GMS&#12395;&#20351;&#29992;&#12377;&#12427;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12434;&#27083;&#25104;&#12375;&#12414;&#12377;&#12290;&#12510;&#12523;&#12481;&#12507;&#12540;&#12512;&#12539;&#12510;&#12471;&#12531;&#12395;&#12399;&#35079;&#25968;&#12398;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<p>&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#12377;&#12409;&#12390;&#12398;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#23550;&#12375;&#12390;&#26377;&#21177;&#12394;&#12450;&#12489;&#12524;&#12473;&#12434;&#25351;&#23450;&#12377;&#12427;&#12395;&#12399;&#12289;&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20351;&#29992;&#12375;&#12390;&#12381;&#12398;&#12450;&#12489;&#12524;&#12473;&#12434;&#21508;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#20491;&#21029;&#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12383;&#12392;&#12360;&#12400;&#12289;&#12300;<a href="ref-clustersystemproperties.html">&#12463;&#12521;&#12473;&#12479;&#12539;&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;</a>&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12390;<code>GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i>&#12392;&#12356;&#12358;&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;&#27425;&#12395;&#12289;&#12381;&#12398;&#12506;&#12540;&#12472;&#12398;&#12496;&#12452;&#12531;&#12489;&#12539;&#12450;&#12489;&#12524;&#12473;&#12539;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;<code>${GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i><code>}</code>&#12395;&#35373;&#23450;&#12375;&#12390;&#12381;&#12398;&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#26368;&#24460;&#12395;&#12289;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#21508;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12388;&#12356;&#12390;&#12289;<code>GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i>&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#12381;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12510;&#12471;&#12531;&#12391;&#24517;&#35201;&#12394;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12398;&#12450;&#12489;&#12524;&#12473;&#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12473;&#12486;&#12540;&#12479;&#12473;</dt>
<dd>
<p>&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#25968;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
</dl>
<a id="sthref255" name="sthref255"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-gmscluster.html">&#12463;&#12521;&#12473;&#12479;&#12398;&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-migrate-ejb-timers.html">EJB&#12479;&#12452;&#12510;&#12540;&#12434;&#31227;&#34892;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref256" name="sthref256"></a>
<h5>&#21516;&#31561;&#12398;asadmin&#12469;&#12502;&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00138"><code>generate-jvm-report</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00211"><code>migrate-timers</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00224"><code>rotate-log</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
