<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-standaloneinstancegeneral" name="ref-standaloneinstancegeneral"></a><a id="GHCLU00020" name="GHCLU00020"></a></p>

<h4><a id="sthref329" name="sthref329"></a><a id="sthref330" name="sthref330"></a><a id="sthref331" name="sthref331"></a>&#19968;&#33324;&#24773;&#22577;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;&#19968;&#33324;&#24773;&#22577;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#36215;&#21205;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36215;&#21205;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12371;&#12398;&#12508;&#12479;&#12531;&#12399;&#38750;&#12450;&#12463;&#12486;&#12451;&#12502;&#21270;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#20572;&#27490;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20572;&#27490;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20572;&#27490;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12371;&#12398;&#12508;&#12479;&#12531;&#12399;&#38750;&#12450;&#12463;&#12486;&#12451;&#12502;&#21270;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#20877;&#36215;&#21205;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20877;&#36215;&#21205;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20572;&#27490;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12371;&#12398;&#12508;&#12479;&#12531;&#12399;&#38750;&#12450;&#12463;&#12486;&#12451;&#12502;&#21270;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#34920;&#31034;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#34920;&#31034;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
<dt>&#12525;&#12464;&#12398;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12434;&#34892;&#12358;&#12508;&#12479;&#12531;&#12290;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12364;&#34892;&#12431;&#12428;&#12427;&#12392;&#12289;<code>server.log_</code><i>date-and-time</i>&#12392;&#12356;&#12358;&#24418;&#24335;&#12398;&#12479;&#12452;&#12512;&#12473;&#12479;&#12531;&#12503;&#21517;&#12434;&#20351;&#29992;&#12375;&#12390;&#12501;&#12449;&#12452;&#12523;&#21517;&#12364;&#22793;&#26356;&#12373;&#12428;&#12289;&#26032;&#12375;&#12356;&#12525;&#12464;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#12383;&#12417;&#12395;&#31354;&#12398;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12364;&#20316;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#22793;&#26356;&#12399;&#21205;&#30340;&#12395;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12469;&#12540;&#12496;&#12540;&#12398;&#20877;&#36215;&#21205;&#12399;&#24517;&#35201;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#12522;&#12459;&#12496;&#12522;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#12522;&#12459;&#12496;&#12522;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
<dt>&#21517;&#21069;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20316;&#25104;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12383;&#21517;&#21069;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>JVM</dt>
<dd>
<p>&#12300;JVM&#12524;&#12509;&#12540;&#12488;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;Java&#20206;&#24819;&#12510;&#12471;&#12531;&#12395;&#38306;&#12377;&#12427;&#12524;&#12509;&#12540;&#12488;&#12364;&#12289;&#26032;&#35215;&#12454;&#12451;&#12531;&#12489;&#12454;&#12391;&#38283;&#12365;&#12414;&#12377;&#12290;&#34920;&#31034;&#12373;&#12428;&#12427;&#12524;&#12509;&#12540;&#12488;&#12399;&#12289;&#12469;&#12510;&#12522;&#12540;&#12539;&#12524;&#12509;&#12540;&#12488;&#12289;&#12513;&#12514;&#12522;&#12540;&#31649;&#29702;&#12362;&#12424;&#12403;&#12460;&#12505;&#12540;&#12472;&#12539;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12539;&#12524;&#12509;&#12540;&#12488;&#12289;&#12463;&#12521;&#12473;&#12539;&#12525;&#12540;&#12487;&#12451;&#12531;&#12464;&#12539;&#12524;&#12509;&#12540;&#12488;&#12289;&#12362;&#12424;&#12403;&#29694;&#22312;&#12398;&#12473;&#12524;&#12483;&#12489;&#12398;&#12480;&#12531;&#12503;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12473;&#12486;&#12540;&#12479;&#12473;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#23455;&#34892;&#20013;&#12363;&#12393;&#12358;&#12363;&#12364;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12494;&#12540;&#12489;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#37197;&#32622;&#12373;&#12428;&#12390;&#12356;&#12427;&#12494;&#12540;&#12489;&#12398;&#21517;&#21069;&#12290;&#21517;&#21069;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#12494;&#12540;&#12489;&#12398;&#12300;<a href="ref-nodeedit.html">&#12494;&#12540;&#12489;&#12398;&#32232;&#38598;</a>&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#27083;&#25104;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#21442;&#29031;&#12377;&#12427;&#27083;&#25104;&#12290;&#27083;&#25104;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12300;<a href="../../../common/en/help/ref-configuration.html">&#27083;&#25104;</a>&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12487;&#12496;&#12483;&#12464;</dt>
<dd>
<p>Java Platform Debugger Architecture (JPDA)(<code><a href="http://java.sun.com/javase/technologies/core/toolsapis/jpda/">http://java.sun.com/javase/technologies/core/toolsapis/jpda/</a></code>)&#12487;&#12496;&#12483;&#12464;&#12364;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#23550;&#12375;&#12390;&#26377;&#21177;&#12363;&#12393;&#12358;&#12363;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12363;&#12425;&#36215;&#21205;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;JPDA&#12487;&#12496;&#12483;&#12464;&#12399;&#12289;&#12381;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#23550;&#12375;&#12390;&#26377;&#21177;&#12395;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;JPDA&#12487;&#12496;&#12483;&#12464;&#12434;&#26377;&#21177;&#12395;&#12375;&#12390;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36215;&#21205;&#12377;&#12427;&#12395;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00236"><code>start-instance</code>(1)</a>&#12469;&#12502;&#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>HTTP&#12509;&#12540;&#12488;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#27425;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12398;&#12479;&#12452;&#12503;&#12434;&#12522;&#12473;&#12491;&#12531;&#12464;&#12377;&#12427;&#12509;&#12540;&#12488;&#12398;&#12509;&#12540;&#12488;&#30058;&#21495;&#12398;&#12459;&#12531;&#12510;&#21306;&#20999;&#12426;&#12522;&#12473;&#12488;:</p>
<ul>
<li>
<p>&#31649;&#29702;&#12522;&#12463;&#12456;&#12473;&#12488;</p>
</li>
<li>
<p>HTTP&#12522;&#12463;&#12456;&#12473;&#12488;</p>
</li>
<li>
<p>HTTPS&#12522;&#12463;&#12456;&#12473;&#12488;</p>
</li>
</ul>
<p>&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>IIOP&#12509;&#12540;&#12488;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#27425;&#12398;&#25509;&#32154;&#12398;&#12479;&#12452;&#12503;&#12395;&#20351;&#29992;&#12377;&#12427;&#12509;&#12540;&#12488;&#12398;&#12509;&#12540;&#12488;&#30058;&#21495;&#12398;&#12459;&#12531;&#12510;&#21306;&#20999;&#12426;&#12522;&#12473;&#12488;&#12290;</p>
<ul>
<li>
<p>&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#20445;&#35703;&#12373;&#12428;&#12383;IIOP&#25509;&#32154;</p>
</li>
<li>
<p>&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#35469;&#35388;&#12391;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#20445;&#35703;&#12373;&#12428;&#12383;IIOP&#25509;&#32154;</p>
</li>
<li>
<p>IIOP&#25509;&#32154;</p>
</li>
</ul>
<p>&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
</dl>
<a id="sthref332" name="sthref332"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-start-standalone-instances.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36215;&#21205;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-stop-standalone-instances.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20572;&#27490;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-view-logs-standalone-instance.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-recovertransactions-standalone-instance.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#12522;&#12459;&#12496;&#12522;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref333" name="sthref333"></a>
<h5>&#21516;&#31561;&#12398;asadmin&#12469;&#12502;&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00138"><code>generate-jvm-report</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00236"><code>start-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00241"><code>stop-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00224"><code>rotate-log</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
