<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-nodenew" name="ref-nodenew"></a><a id="GHCLU00016" name="GHCLU00016"></a></p>

<h4><a id="sthref307" name="sthref307"></a>&#26032;&#35215;&#12494;&#12540;&#12489;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;&#26032;&#35215;&#12494;&#12540;&#12489;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;GlassFish Server&#12494;&#12540;&#12489;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;&#12494;&#12540;&#12489;&#12399;GlassFish Server&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12383;&#12507;&#12473;&#12488;&#12434;&#34920;&#12375;&#12414;&#12377;&#12290;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#23384;&#22312;&#12377;&#12427;&#12377;&#12409;&#12390;&#12398;&#12507;&#12473;&#12488;&#12395;&#12388;&#12356;&#12390;&#12494;&#12540;&#12489;&#12434;&#20316;&#25104;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26032;&#35215;&#12494;&#12540;&#12489;&#12301;&#12506;&#12540;&#12472;&#12395;&#21547;&#12414;&#12428;&#12427;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12494;&#12540;&#12489;&#12398;&#12479;&#12452;&#12503;&#12395;&#12424;&#12387;&#12390;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
<a id="sthref308" name="sthref308"></a>
<h5>&#12377;&#12409;&#12390;&#12398;&#12479;&#12452;&#12503;&#12398;&#12494;&#12540;&#12489;&#12395;&#23550;&#12377;&#12427;&#12458;&#12503;&#12471;&#12519;&#12531;</h5>
<p>&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#12479;&#12452;&#12503;&#12398;&#12494;&#12540;&#12489;&#12395;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#21517;&#21069;</dt>
<dd>
<p>&#12494;&#12540;&#12489;&#12398;&#21517;&#21069;&#12290;</p>
<p>&#21517;&#21069;&#12399;&#27425;&#12398;&#35201;&#20214;&#12434;&#28288;&#12383;&#12377;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;:</p>
<ul>
<li>
<p>&#21517;&#21069;&#12395;&#12399;ASCII&#25991;&#23383;&#12398;&#12415;&#12434;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#21517;&#21069;&#12399;&#33521;&#25968;&#23383;&#12414;&#12383;&#12399;&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#12391;&#22987;&#12417;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#21517;&#21069;&#12395;&#21547;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12398;&#12399;&#27425;&#12398;&#25991;&#23383;&#12398;&#12415;&#12391;&#12377;:</p>
<ul>
<li>
<p>&#23567;&#25991;&#23383;</p>
</li>
<li>
<p>&#22823;&#25991;&#23383;</p>
</li>
<li>
<p>&#25968;&#20516;</p>
</li>
<li>
<p>&#12495;&#12452;&#12501;&#12531;</p>
</li>
<li>
<p>&#12500;&#12522;&#12458;&#12489;</p>
</li>
<li>
<p>&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;</p>
</li>
</ul>
</li>
<li>
<p>&#21517;&#21069;&#12399;&#12489;&#12513;&#12452;&#12531;&#20869;&#12391;&#19968;&#24847;&#12395;&#12375;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;&#21029;&#12398;&#12494;&#12540;&#12489;&#12289;&#12463;&#12521;&#12473;&#12479;&#12289;&#21517;&#21069;&#20184;&#12365;&#27083;&#25104;&#12289;&#12414;&#12383;&#12399;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#21517;&#21069;&#12395;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p><code>&#12489;&#12513;&#12452;&#12531;</code>&#12289;<code>&#12469;&#12540;&#12496;&#12540;</code>&#12289;&#12414;&#12383;&#12399;GlassFish Server&#12391;&#20104;&#32004;&#12373;&#12428;&#12390;&#12356;&#12427;&#20182;&#12398;&#12461;&#12540;&#12527;&#12540;&#12489;&#12434;&#21517;&#21069;&#12395;&#20351;&#29992;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
</ul>
</dd>
<dt>&#12479;&#12452;&#12503;</dt>
<dd>
<p>&#12494;&#12540;&#12489;&#12398;&#12479;&#12452;&#12503;&#12434;&#25351;&#23450;&#12377;&#12427;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12290;&#12494;&#12540;&#12489;&#12398;&#12479;&#12452;&#12503;&#12399;&#27425;&#12398;&#12356;&#12378;&#12428;&#12363;&#12391;&#12377;&#12290;</p>
<dl>
<dt>CONFIG</dt>
<dd>
<p>&#12371;&#12398;&#12494;&#12540;&#12489;&#12399;&#12289;&#12522;&#12514;&#12540;&#12488;&#36890;&#20449;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12414;&#12379;&#12435;&#12290;&#12300;CONFIG&#12301;&#12434;&#36984;&#25246;&#12375;&#12383;&#22580;&#21512;&#12289;SSH&#27083;&#25104;&#12414;&#12383;&#12399;DCOM&#27083;&#25104;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#34920;&#31034;&#12373;&#12428;&#12378;&#12289;&#12300;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#12463;&#12522;&#12450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>DCOM</dt>
<dd>
<p>&#12371;&#12398;&#12494;&#12540;&#12489;&#12399;&#12289;&#20998;&#25955;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12539;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12539;&#12514;&#12487;&#12523;(DCOM)&#12522;&#12514;&#12540;&#12488;&#12539;&#12503;&#12525;&#12488;&#12467;&#12523;&#32076;&#30001;&#12398;&#36890;&#20449;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12414;&#12377;&#12290;DCOM&#12503;&#12525;&#12488;&#12467;&#12523;&#12399;&#12289;Windows&#12471;&#12473;&#12486;&#12512;&#12391;&#12398;&#12415;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</dd>
<dt>SSH</dt>
<dd>
<p>&#12371;&#12398;&#12494;&#12540;&#12489;&#12399;&#12289;Secure Shell(SSH)&#32076;&#30001;&#12398;&#36890;&#20449;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
</dd>
<dt>&#12494;&#12540;&#12489;&#12539;&#12507;&#12473;&#12488;</dt>
<dd>
<p>&#12494;&#12540;&#12489;&#12364;&#34920;&#12377;&#12507;&#12473;&#12488;&#12398;&#21517;&#21069;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#12289;&#29305;&#23450;&#12398;&#12494;&#12540;&#12489;&#12398;&#12479;&#12452;&#12503;&#12398;&#22580;&#21512;&#12395;&#24517;&#38920;&#12501;&#12451;&#12540;&#12523;&#12489;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#12494;&#12540;&#12489;&#12398;&#12479;&#12452;&#12503;&#12364;CONFIG&#12398;&#22580;&#21512;&#12399;&#12289;&#12507;&#12473;&#12488;&#21517;&#12399;&#30465;&#30053;&#21487;&#33021;&#12391;&#12377;&#12290;&#12507;&#12473;&#12488;&#21517;&#12399;&#12289;&#12494;&#12540;&#12489;&#19978;&#12395;&#23384;&#22312;&#12377;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20316;&#25104;&#12373;&#12428;&#12427;&#38555;&#12395;&#29305;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12494;&#12540;&#12489;&#12398;&#12479;&#12452;&#12503;&#12364;DCOM&#12414;&#12383;&#12399;SSH&#12398;&#22580;&#21512;&#12399;&#12289;&#12507;&#12473;&#12488;&#21517;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12381;&#12428;&#20197;&#22806;&#12398;&#22580;&#21512;&#12399;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</dd>
<dt>&#12494;&#12540;&#12489;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;</dt>
<dd>
<p>&#12494;&#12540;&#12489;&#19978;&#12391;&#20316;&#25104;&#12373;&#12428;&#12383;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#21547;&#12417;&#12427;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12398;&#12497;&#12473;&#12290;&#30456;&#23550;&#12497;&#12473;&#12434;&#25351;&#23450;&#12377;&#12427;&#22580;&#21512;&#12289;&#12497;&#12473;&#12399;as-install&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#30456;&#23550;&#30340;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;&#12289;&#12494;&#12540;&#12489;&#12398;&#12479;&#12452;&#12503;&#12395;&#12424;&#12387;&#12390;&#30064;&#12394;&#12426;&#12414;&#12377;:</p>
<ul>
<li>
<p>&#12494;&#12540;&#12489;&#12398;&#12479;&#12452;&#12503;&#12364;CONFIG&#12398;&#22580;&#21512;&#12289;&#12489;&#12513;&#12452;&#12531;&#31649;&#29702;&#12469;&#12540;&#12496;&#12540;(DAS)&#27083;&#25104;&#12391;&#12399;&#12289;&#12494;&#12540;&#12489;&#12395;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12399;&#25351;&#23450;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12494;&#12540;&#12489;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12399;&#12289;&#12494;&#12540;&#12489;&#19978;&#12395;&#23384;&#22312;&#12377;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20316;&#25104;&#12373;&#12428;&#12427;&#38555;&#12395;&#29305;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12494;&#12540;&#12489;&#12398;&#12479;&#12452;&#12503;&#12364;DCOM&#12398;&#22580;&#21512;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;as-install<code>\nodes</code>&#12391;&#12377;&#12290;as-install&#12399;&#12289;&#12507;&#12473;&#12488;&#19978;&#12398;GlassFish Server&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12505;&#12540;&#12473;&#12539;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12494;&#12540;&#12489;&#12398;&#12479;&#12452;&#12503;&#12364;SSH&#12398;&#22580;&#21512;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;as-install<code>/nodes</code>&#12391;&#12377;&#12290;as-install&#12399;&#12289;&#12507;&#12473;&#12488;&#19978;&#12398;GlassFish Server&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12505;&#12540;&#12473;&#12539;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12391;&#12377;&#12290;</p>
</li>
</ul>
</dd>
<dt>&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;</dt>
<dd>
<p>&#12507;&#12473;&#12488;&#19978;&#12398;GlassFish Server&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12505;&#12540;&#12473;&#12539;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12398;&#35242;&#12398;&#12501;&#12523;&#12497;&#12473;(&#20363;: <code>/export/glassfish3</code>)&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;&#12289;&#12494;&#12540;&#12489;&#12398;&#12479;&#12452;&#12503;&#12395;&#12424;&#12387;&#12390;&#30064;&#12394;&#12426;&#12414;&#12377;:</p>
<ul>
<li>
<p>&#12494;&#12540;&#12489;&#12398;&#12479;&#12452;&#12503;&#12364;CONFIG&#12398;&#22580;&#21512;&#12289;DAS&#27083;&#25104;&#12391;&#12399;&#12289;&#12494;&#12540;&#12489;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12399;&#25351;&#23450;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12399;&#12289;&#12494;&#12540;&#12489;&#19978;&#12395;&#23384;&#22312;&#12377;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20316;&#25104;&#12373;&#12428;&#12427;&#38555;&#12395;&#29305;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12494;&#12540;&#12489;&#12398;&#12479;&#12452;&#12503;&#12364;DCOM&#12414;&#12383;&#12399;SSH&#12398;&#22580;&#21512;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;&#12289;DAS&#12398;GlassFish Server&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12505;&#12540;&#12473;&#12539;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12398;&#35242;&#12391;&#12377;&#12290;&#12371;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12434;&#20351;&#29992;&#12391;&#12365;&#12427;&#12398;&#12399;&#12289;GlassFish Server&#12364;&#12377;&#12409;&#12390;&#12398;&#12507;&#12473;&#12488;&#12391;&#21516;&#12376;&#22580;&#25152;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12383;&#22580;&#21512;&#12398;&#12415;&#12391;&#12377;&#12290;</p>
</li>
</ul>
</dd>
</dl>
<a id="sthref309" name="sthref309"></a>
<h5>DCOM&#12494;&#12540;&#12489;&#12398;&#36861;&#21152;&#12458;&#12503;&#12471;&#12519;&#12531;</h5>
<p>&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12300;&#12479;&#12452;&#12503;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12364;&#12300;DCOM&#12301;&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<dl>
<dt>GlassFish Server&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</dt>
<dd>
<p>&#12300;&#26377;&#21177;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;DAS&#12395;&#12424;&#12387;&#12390;&#12289;DAS&#12507;&#12473;&#12488;&#12363;&#12425;&#12494;&#12540;&#12489;&#12539;&#12507;&#12473;&#12488;&#12395;GlassFish Server&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#12467;&#12500;&#12540;&#12373;&#12428;&#12414;&#12377;&#12290;GlassFish Server&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12507;&#12473;&#12488;&#12395;&#12467;&#12500;&#12540;&#12377;&#12427;&#12395;&#12399;&#12289;DAS&#12364;DCOM&#32076;&#30001;&#12391;&#12507;&#12473;&#12488;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#24375;&#21046;</dt>
<dd>
<p>&#12300;&#26377;&#21177;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12494;&#12540;&#12489;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12398;&#26908;&#35388;&#12395;&#22833;&#25943;&#12375;&#12383;&#22580;&#21512;&#12391;&#12418;&#12289;DAS&#27083;&#25104;&#12395;&#12494;&#12540;&#12489;&#12364;&#20316;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;&#12494;&#12540;&#12489;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12434;&#26908;&#35388;&#12377;&#12427;&#12395;&#12399;&#12289;DAS&#12364;DCOM&#32076;&#30001;&#12391;&#12494;&#12540;&#12489;&#12398;&#12507;&#12473;&#12488;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
</dd>
<dt>DCOM&#12398;&#26908;&#35388;</dt>
<dd>
<p>&#12300;&#26377;&#21177;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;GlassFish Server&#12395;&#12424;&#12387;&#12390;&#12289;&#12494;&#12540;&#12489;&#12398;&#20316;&#25104;&#21069;&#12395;&#12494;&#12540;&#12489;&#12539;&#12507;&#12473;&#12488;&#12395;&#23550;&#12377;&#12427;DCOM&#32076;&#30001;&#12398;&#25509;&#32154;&#12364;&#12486;&#12473;&#12488;&#12373;&#12428;&#12414;&#12377;&#12290;&#12486;&#12473;&#12488;&#12398;&#19968;&#29872;&#12392;&#12375;&#12390;&#12289;GlassFish Server&#12395;&#12424;&#12387;&#12390;&#12289;<code>delete_me.bat</code>&#12392;&#12356;&#12358;&#21517;&#21069;&#12398;&#12473;&#12463;&#12522;&#12503;&#12488;&#12364;&#12507;&#12473;&#12488;&#12395;&#12467;&#12500;&#12540;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12300;&#12522;&#12514;&#12540;&#12488;&#12539;&#12486;&#12473;&#12488;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12364;&#12450;&#12463;&#12486;&#12451;&#12502;&#21270;&#12373;&#12428;&#12289;GlassFish Server&#12364;&#12473;&#12463;&#12522;&#12503;&#12488;&#12434;&#12467;&#12500;&#12540;&#12377;&#12427;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12434;&#25351;&#23450;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12522;&#12514;&#12540;&#12488;&#12539;&#12486;&#12473;&#12488;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;</dt>
<dd>
<p>GlassFish Server&#12364;<code>delete_me.bat</code>&#12501;&#12449;&#12452;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#24517;&#35201;&#12398;&#12354;&#12427;&#12522;&#12514;&#12540;&#12488;&#12539;&#12507;&#12473;&#12488;&#19978;&#12398;&#12501;&#12457;&#12523;&#12480;&#12290;&#12300;Windows&#12518;&#12540;&#12470;&#12540;&#21517;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#25351;&#23450;&#12377;&#12427;&#12518;&#12540;&#12470;&#12540;&#12395;&#12399;&#12289;&#12371;&#12398;&#12501;&#12457;&#12523;&#12480;&#12395;&#23550;&#12377;&#12427;&#26360;&#36796;&#12415;&#12450;&#12463;&#12475;&#12473;&#27177;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;&#12381;&#12428;&#20197;&#22806;&#12398;&#22580;&#21512;&#12399;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;<code>C:\</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt>Windows&#12489;&#12513;&#12452;&#12531;</dt>
<dd>
<p>&#12300;Windows&#12518;&#12540;&#12470;&#12540;&#21517;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#25351;&#23450;&#12375;&#12383;&#12518;&#12540;&#12470;&#12540;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;Windows&#12489;&#12513;&#12452;&#12531;&#12398;&#21517;&#21069;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;&#12289;&#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12364;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;&#12507;&#12473;&#12488;&#12398;&#21517;&#21069;&#12391;&#12377;&#12290;</p>
</dd>
<dt>Windows&#12518;&#12540;&#12470;&#12540;&#21517;</dt>
<dd>
<p>DCOM&#32076;&#30001;&#12391;&#12507;&#12473;&#12488;&#12395;&#25509;&#32154;&#12377;&#12427;&#12383;&#12417;&#12398;&#12503;&#12525;&#12475;&#12473;&#12434;&#23455;&#34892;&#12377;&#12427;&#12289;&#12371;&#12398;&#12494;&#12540;&#12489;&#12398;&#12507;&#12473;&#12488;&#12398;&#12518;&#12540;&#12470;&#12540;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;DAS&#12503;&#12525;&#12475;&#12473;&#12434;&#23455;&#34892;&#12377;&#12427;&#12518;&#12540;&#12470;&#12540;&#12391;&#12377;&#12290;&#12300;&#12494;&#12540;&#12489;&#12539;&#12507;&#12473;&#12488;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;<code>localhost-</code><i>domain</i>&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12300;Windows&#12518;&#12540;&#12470;&#12540;&#21517;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>Windows&#12518;&#12540;&#12470;&#12540;&#35469;&#35388;</dt>
<dd>
<p>&#12371;&#12398;&#12494;&#12540;&#12489;&#12398;&#12507;&#12473;&#12488;&#12408;&#12398;&#12525;&#12464;&#12452;&#12531;&#26178;&#12395;Windows&#12518;&#12540;&#12470;&#12540;&#12434;&#35469;&#35388;&#12377;&#12427;&#26041;&#27861;&#12434;&#25351;&#23450;&#12377;&#12427;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12290;&#25351;&#23450;&#12391;&#12365;&#12427;&#35469;&#35388;&#26041;&#27861;&#12399;&#27425;&#12398;&#12392;&#12362;&#12426;&#12391;&#12377;&#12290;</p>
<dl>
<dt>&#12497;&#12473;&#12527;&#12540;&#12489;</dt>
<dd>
<p>Windows&#12518;&#12540;&#12470;&#12540;&#12399;&#12289;DAS&#27083;&#25104;&#12395;&#26684;&#32013;&#12373;&#12428;&#12390;&#12356;&#12427;&#12497;&#12473;&#12527;&#12540;&#12489;&#12395;&#12424;&#12387;&#12390;&#35469;&#35388;&#12373;&#12428;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
&#12371;&#12398;&#12497;&#12473;&#12527;&#12540;&#12489;&#12399;&#12289;DAS&#27083;&#25104;&#12395;&#12463;&#12522;&#12450;&#12539;&#12486;&#12461;&#12473;&#12488;&#12391;&#26684;&#32013;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#24375;&#21270;&#12398;&#12383;&#12417;&#12289;&#12497;&#12473;&#12527;&#12540;&#12489;&#12539;&#12456;&#12452;&#12522;&#12450;&#12473;&#12434;&#20351;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
<hr>

<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12300;Windows&#12518;&#12540;&#12470;&#12540;&#12539;&#12497;&#12473;&#12527;&#12540;&#12489;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12364;&#12450;&#12463;&#12486;&#12451;&#12502;&#21270;&#12373;&#12428;&#12289;&#12497;&#12473;&#12527;&#12540;&#12489;&#12434;&#20837;&#21147;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12497;&#12473;&#12527;&#12540;&#12489;&#12539;&#12456;&#12452;&#12522;&#12450;&#12473;</dt>
<dd>
<p>Windows&#12518;&#12540;&#12470;&#12540;&#12399;&#12289;&#12497;&#12473;&#12527;&#12540;&#12489;&#12539;&#12456;&#12452;&#12522;&#12450;&#12473;&#12395;&#12424;&#12387;&#12390;&#35469;&#35388;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12300;&#12497;&#12473;&#12527;&#12540;&#12489;&#12539;&#12456;&#12452;&#12522;&#12450;&#12473;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12497;&#12473;&#12527;&#12540;&#12489;&#12539;&#12456;&#12452;&#12522;&#12450;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
</dd>
<dt>Windows&#12518;&#12540;&#12470;&#12540;&#12539;&#12497;&#12473;&#12527;&#12540;&#12489;</dt>
<dd>
<p>&#12371;&#12398;&#12494;&#12540;&#12489;&#12398;&#12507;&#12473;&#12488;&#12408;&#12398;&#12525;&#12464;&#12452;&#12531;&#26178;&#12395;Windows&#12518;&#12540;&#12470;&#12540;&#12364;&#20351;&#29992;&#12377;&#12427;&#12497;&#12473;&#12527;&#12540;&#12489;&#12290;</p>
</dd>
<dt>&#12497;&#12473;&#12527;&#12540;&#12489;&#12539;&#12456;&#12452;&#12522;&#12450;&#12473;</dt>
<dd>
<p>&#12371;&#12398;&#12489;&#12513;&#12452;&#12531;&#12395;&#23550;&#12375;&#12390;&#23450;&#32681;&#12373;&#12428;&#12390;&#12356;&#12427;&#12497;&#12473;&#12527;&#12540;&#12489;&#12539;&#12456;&#12452;&#12522;&#12450;&#12473;&#12398;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12290;</p>
</dd>
</dl>
<a id="sthref310" name="sthref310"></a>
<h5>SSH&#12494;&#12540;&#12489;&#12398;&#36861;&#21152;&#12458;&#12503;&#12471;&#12519;&#12531;</h5>
<p>&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12300;&#12479;&#12452;&#12503;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12364;&#12300;SSH&#12301;&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<dl>
<dt>GlassFish Server&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</dt>
<dd>
<p>&#12300;&#26377;&#21177;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;DAS&#12395;&#12424;&#12387;&#12390;&#12289;DAS&#12507;&#12473;&#12488;&#12363;&#12425;&#12494;&#12540;&#12489;&#12539;&#12507;&#12473;&#12488;&#12395;GlassFish Server&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#12467;&#12500;&#12540;&#12373;&#12428;&#12414;&#12377;&#12290;GlassFish Server&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12507;&#12473;&#12488;&#12395;&#12467;&#12500;&#12540;&#12377;&#12427;&#12395;&#12399;&#12289;DAS&#12364;SSH&#32076;&#30001;&#12391;&#12507;&#12473;&#12488;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#24375;&#21046;</dt>
<dd>
<p>&#12300;&#26377;&#21177;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12494;&#12540;&#12489;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12398;&#26908;&#35388;&#12395;&#22833;&#25943;&#12375;&#12383;&#22580;&#21512;&#12391;&#12418;&#12289;DAS&#27083;&#25104;&#12395;&#12494;&#12540;&#12489;&#12364;&#20316;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;&#12494;&#12540;&#12489;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12434;&#26908;&#35388;&#12377;&#12427;&#12395;&#12399;&#12289;DAS&#12364;SSH&#32076;&#30001;&#12391;&#12494;&#12540;&#12489;&#12398;&#12507;&#12473;&#12488;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
</dd>
<dt>SSH&#12509;&#12540;&#12488;</dt>
<dd>
<p>&#12371;&#12398;&#12494;&#12540;&#12489;&#12398;&#12507;&#12473;&#12488;&#12395;&#23550;&#12377;&#12427;SSH&#25509;&#32154;&#12395;&#20351;&#29992;&#12377;&#12427;&#12509;&#12540;&#12488;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;22&#12391;&#12377;&#12290;&#12300;&#12494;&#12540;&#12489;&#12539;&#12507;&#12473;&#12488;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;<code>localhost-</code><i>domain</i>&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12300;SSH&#12509;&#12540;&#12488;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>SSH&#12518;&#12540;&#12470;&#12540;&#21517;</dt>
<dd>
<p>SSH&#32076;&#30001;&#12391;&#12507;&#12473;&#12488;&#12395;&#25509;&#32154;&#12377;&#12427;&#12383;&#12417;&#12398;&#12503;&#12525;&#12475;&#12473;&#12434;&#23455;&#34892;&#12377;&#12427;&#12289;&#12371;&#12398;&#12494;&#12540;&#12489;&#12398;&#12507;&#12473;&#12488;&#12398;&#12518;&#12540;&#12470;&#12540;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;DAS&#12503;&#12525;&#12475;&#12473;&#12434;&#23455;&#34892;&#12377;&#12427;&#12518;&#12540;&#12470;&#12540;&#12391;&#12377;&#12290;DAS&#12364;&#12371;&#12398;&#12518;&#12540;&#12470;&#12540;&#12398;SSH&#31192;&#23494;&#37749;&#12501;&#12449;&#12452;&#12523;&#12434;&#35501;&#12415;&#21462;&#12428;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;DAS&#12503;&#12525;&#12475;&#12473;&#12434;&#23455;&#34892;&#12375;&#12390;&#12356;&#12427;&#12518;&#12540;&#12470;&#12540;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12300;&#12494;&#12540;&#12489;&#12539;&#12507;&#12473;&#12488;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;<code>localhost-</code><i>domain</i>&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12300;&#12518;&#12540;&#12470;&#12540;&#21517;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>SSH&#12518;&#12540;&#12470;&#12540;&#35469;&#35388;</dt>
<dd>
<p>&#12371;&#12398;&#12494;&#12540;&#12489;&#12398;&#12507;&#12473;&#12488;&#12408;&#12398;&#12525;&#12464;&#12452;&#12531;&#26178;&#12395;SSH&#12518;&#12540;&#12470;&#12540;&#12434;&#35469;&#35388;&#12377;&#12427;&#26041;&#27861;&#12434;&#25351;&#23450;&#12377;&#12427;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12290;&#25351;&#23450;&#12391;&#12365;&#12427;&#35469;&#35388;&#26041;&#27861;&#12399;&#27425;&#12398;&#12392;&#12362;&#12426;&#12391;&#12377;&#12290;</p>
<dl>
<dt>&#37749;&#12501;&#12449;&#12452;&#12523;</dt>
<dd>
<p>SSH&#12518;&#12540;&#12470;&#12540;&#12399;&#12289;SSH&#31192;&#23494;&#37749;&#12501;&#12449;&#12452;&#12523;&#12395;&#12424;&#12387;&#12390;&#35469;&#35388;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12501;&#12449;&#12452;&#12523;&#12398;&#32118;&#23550;&#12497;&#12473;&#12434;&#12300;&#37749;&#12501;&#12449;&#12452;&#12523;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12497;&#12473;&#12527;&#12540;&#12489;</dt>
<dd>
<p>SSH&#12518;&#12540;&#12470;&#12540;&#12399;&#12289;DAS&#27083;&#25104;&#12395;&#26684;&#32013;&#12373;&#12428;&#12390;&#12356;&#12427;&#12497;&#12473;&#12527;&#12540;&#12489;&#12395;&#12424;&#12387;&#12390;&#35469;&#35388;&#12373;&#12428;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
&#12371;&#12398;&#12497;&#12473;&#12527;&#12540;&#12489;&#12399;&#12289;DAS&#27083;&#25104;&#12395;&#12463;&#12522;&#12450;&#12539;&#12486;&#12461;&#12473;&#12488;&#12391;&#26684;&#32013;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#24375;&#21270;&#12398;&#12383;&#12417;&#12289;&#37749;&#12501;&#12449;&#12452;&#12523;&#12414;&#12383;&#12399;&#12497;&#12473;&#12527;&#12540;&#12489;&#12539;&#12456;&#12452;&#12522;&#12450;&#12473;&#12434;&#20351;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
<hr>

<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12300;SSH&#12518;&#12540;&#12470;&#12540;&#12539;&#12497;&#12473;&#12527;&#12540;&#12489;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12364;&#12450;&#12463;&#12486;&#12451;&#12502;&#21270;&#12373;&#12428;&#12289;&#12497;&#12473;&#12527;&#12540;&#12489;&#12434;&#20837;&#21147;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12497;&#12473;&#12527;&#12540;&#12489;&#12539;&#12456;&#12452;&#12522;&#12450;&#12473;</dt>
<dd>
<p>SSH&#12518;&#12540;&#12470;&#12540;&#12399;&#12289;&#12497;&#12473;&#12527;&#12540;&#12489;&#12539;&#12456;&#12452;&#12522;&#12450;&#12473;&#12395;&#12424;&#12387;&#12390;&#35469;&#35388;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12300;&#12497;&#12473;&#12527;&#12540;&#12489;&#12539;&#12456;&#12452;&#12522;&#12450;&#12473;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12497;&#12473;&#12527;&#12540;&#12489;&#12539;&#12456;&#12452;&#12522;&#12450;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
</dd>
<dt>SSH&#12398;&#35373;&#23450;</dt>
<dd>
<p>&#12300;&#26377;&#21177;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;GlassFish Server&#12395;&#12424;&#12387;&#12390;&#12289;&#12494;&#12540;&#12489;&#12539;&#12507;&#12473;&#12488;&#12395;SSH&#37749;&#12364;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;GlassFish Server&#12391;&#12399;&#12289;&#26082;&#23384;&#12398;&#37749;&#12501;&#12449;&#12452;&#12523;&#12434;DAS&#12507;&#12473;&#12488;&#12363;&#12425;&#12467;&#12500;&#12540;&#12377;&#12427;&#12363;&#12289;&#12414;&#12383;&#12399;&#24517;&#35201;&#12394;&#22580;&#21512;&#12399;&#12501;&#12449;&#12452;&#12523;&#12398;&#12467;&#12500;&#12540;&#21069;&#12395;&#12501;&#12449;&#12452;&#12523;&#12434;&#29983;&#25104;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;&#12289;SSH&#37749;&#12364;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12300;SSH&#12518;&#12540;&#12470;&#12540;&#35469;&#35388;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#12300;&#37749;&#12501;&#12449;&#12452;&#12523;&#12301;&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#20351;&#29992;&#21487;&#33021;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#37749;&#12398;&#29983;&#25104;</dt>
<dd>
<p>&#12300;&#26377;&#21177;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;GlassFish Server&#12395;&#12424;&#12387;&#12390;&#12289;&#12501;&#12449;&#12452;&#12523;&#12434;&#12494;&#12540;&#12489;&#12539;&#12507;&#12473;&#12488;&#12395;&#12467;&#12500;&#12540;&#12377;&#12427;&#21069;&#12395;SSH&#37749;&#12501;&#12449;&#12452;&#12523;&#12364;&#29983;&#25104;&#12373;&#12428;&#12414;&#12377;(&#12501;&#12449;&#12452;&#12523;&#12364;&#23384;&#22312;&#12375;&#12394;&#12356;&#22580;&#21512;)&#12290;SSH&#37749;&#12501;&#12449;&#12452;&#12523;&#12364;&#23384;&#22312;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12300;&#26377;&#21177;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12375;&#12390;&#12418;GlassFish Server&#12395;&#12424;&#12387;&#12390;&#12501;&#12449;&#12452;&#12523;&#12364;&#29983;&#25104;&#12373;&#12428;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
SSH&#37749;&#12501;&#12449;&#12452;&#12523;&#12364;&#23384;&#22312;&#12375;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12300;&#26377;&#21177;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12381;&#12358;&#12375;&#12394;&#12356;&#12392;&#12289;&#22793;&#26356;&#12434;&#20445;&#23384;&#12377;&#12427;&#12392;&#12365;&#12395;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;
<hr>

</dd>
<dt>SSH&#12518;&#12540;&#12470;&#12540;&#12539;&#12497;&#12473;&#12527;&#12540;&#12489;</dt>
<dd>
<p>&#12371;&#12398;&#12494;&#12540;&#12489;&#12398;&#12507;&#12473;&#12488;&#12408;&#12398;&#12525;&#12464;&#12452;&#12531;&#26178;&#12395;SSH&#12518;&#12540;&#12470;&#12540;&#12364;&#20351;&#29992;&#12377;&#12427;&#12497;&#12473;&#12527;&#12540;&#12489;&#12290;</p>
</dd>
<dt>&#12497;&#12473;&#12527;&#12540;&#12489;&#12539;&#12456;&#12452;&#12522;&#12450;&#12473;</dt>
<dd>
<p>&#12371;&#12398;&#12489;&#12513;&#12452;&#12531;&#12395;&#23550;&#12375;&#12390;&#23450;&#32681;&#12373;&#12428;&#12390;&#12356;&#12427;&#12497;&#12473;&#12527;&#12540;&#12489;&#12539;&#12456;&#12452;&#12522;&#12450;&#12473;&#12398;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12290;</p>
</dd>
<dt>&#20844;&#38283;&#37749;&#12501;&#12449;&#12452;&#12523;</dt>
<dd>
<p>&#12300;SSH&#12518;&#12540;&#12470;&#12540;&#21517;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#25351;&#23450;&#12377;&#12427;&#12518;&#12540;&#12470;&#12540;&#12398;SSH&#20844;&#38283;&#37749;&#12501;&#12449;&#12452;&#12523;&#12398;&#32118;&#23550;&#12497;&#12473;&#12290;&#20844;&#38283;&#37749;&#12501;&#12449;&#12452;&#12523;&#12398;&#20869;&#23481;&#12399;&#12289;&#12494;&#12540;&#12489;&#12539;&#12507;&#12473;&#12488;&#19978;&#12398;&#12518;&#12540;&#12470;&#12540;&#12398;<code>.ssh/authorized_keys</code>&#12501;&#12449;&#12452;&#12523;&#12395;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290;<code>.ssh/authorized_keys</code>&#12501;&#12449;&#12452;&#12523;&#12364;&#12507;&#12473;&#12488;&#12395;&#23384;&#22312;&#12375;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;GlassFish Server&#12395;&#12424;&#12387;&#12390;&#12501;&#12449;&#12452;&#12523;&#12364;&#20316;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#37749;&#12501;&#12449;&#12452;&#12523;</dt>
<dd>
<p>&#12300;SSH&#12518;&#12540;&#12470;&#12540;&#21517;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#25351;&#23450;&#12377;&#12427;&#12518;&#12540;&#12470;&#12540;&#12398;SSH&#31192;&#23494;&#37749;&#12501;&#12449;&#12452;&#12523;&#12398;&#32118;&#23550;&#12497;&#12473;&#12290;&#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12399;&#12494;&#12540;&#12489;&#12398;&#12507;&#12473;&#12488;&#19978;&#12398;<code>sshd</code>&#12487;&#12540;&#12514;&#12531;&#12395;&#23550;&#12377;&#12427;&#35469;&#35388;&#12395;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
GlassFish Server&#12391;&#12399;&#12289;&#12497;&#12473;&#12527;&#12540;&#12489;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;<code>AS_ADMIN_SSHPASSWORD</code>&#12456;&#12531;&#12488;&#12522;&#12434;&#20351;&#29992;&#12375;&#12383;&#12497;&#12473;&#12527;&#12540;&#12489;&#35469;&#35388;&#12418;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12414;&#12377;&#12290;&#12497;&#12473;&#12527;&#12540;&#12489;&#12539;&#12501;&#12449;&#12452;&#12523;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00263"><code>asadmin</code>(1)</a>&#12518;&#12540;&#12486;&#12451;&#12522;&#12486;&#12451;&#12398;<code>--paswordfile</code>&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;
<hr>

<p>SSH&#31192;&#23494;&#37749;&#12501;&#12449;&#12452;&#12523;&#12364;&#12497;&#12473;&#12539;&#12501;&#12524;&#12540;&#12474;&#12391;&#20445;&#35703;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12497;&#12473;&#12527;&#12540;&#12489;&#12539;&#12501;&#12449;&#12452;&#12523;&#12395;<code>AS_ADMIN_SSHKEYPASSPHRASE</code>&#12456;&#12531;&#12488;&#12522;&#12434;&#21547;&#12417;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<p>&#37749;&#12501;&#12449;&#12452;&#12523;&#12399;&#12289;DAS&#12363;&#12425;&#21040;&#36948;&#21487;&#33021;&#12394;&#12497;&#12473;&#12395;&#12354;&#12426;&#12289;DAS&#12364;&#35501;&#21462;&#12426;&#21487;&#33021;&#12391;&#12354;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;&#12289;&#12518;&#12540;&#12470;&#12540;&#12398;<code>.ssh</code>&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#12354;&#12427;&#37749;&#12501;&#12449;&#12452;&#12523;&#12391;&#12377;&#12290;&#35079;&#25968;&#12398;&#37749;&#12501;&#12449;&#12452;&#12523;&#12364;&#26908;&#20986;&#12373;&#12428;&#12383;&#22580;&#21512;&#12399;&#12289;GlassFish Server&#12364;&#27425;&#12398;&#20778;&#20808;&#38918;&#20301;&#12395;&#24467;&#12356;&#12414;&#12377;&#12290;</p>
<ol>
<li>
<p><code>id_rsa</code></p>
</li>
<li>
<p><code>id_dsa</code></p>
</li>
<li>
<p><code>identity</code></p>
</li>
</ol>
</dd>
</dl>
<a id="sthref311" name="sthref311"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<p><a href="task-createnode.html">&#12494;&#12540;&#12489;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
<a id="sthref312" name="sthref312"></a>
<h5>&#21516;&#31561;&#12398;asadmin&#12469;&#12502;&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00047"><code>create-node-config</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM510"><code>create-node-dcom</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00048"><code>create-node-ssh</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00229"><code>setup-ssh</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM796"><code>validate-dcom</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
