<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-availabilityservice" name="ref-availabilityservice"></a><a id="GHCLU00025" name="GHCLU00025"></a></p>

<h4><a id="sthref352" name="sthref352"></a>&#21487;&#29992;&#24615;&#12469;&#12540;&#12499;&#12473;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;&#21487;&#29992;&#24615;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12463;&#12521;&#12473;&#12479;&#12398;&#21487;&#29992;&#24615;&#35373;&#23450;&#12434;&#22793;&#26356;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#21487;&#29992;&#24615;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#27083;&#25104;&#21517;</dt>
<dd>
<p>&#12371;&#12398;&#12506;&#12540;&#12472;&#12398;&#35373;&#23450;&#12364;&#36969;&#29992;&#12373;&#12428;&#12427;&#27083;&#25104;&#12398;&#21517;&#21069;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12489;</dt>
<dd>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12354;&#12427;&#35373;&#23450;&#12434;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12395;&#24489;&#20803;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12394;&#12356;&#35373;&#23450;&#12399;&#22793;&#26356;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>&#21487;&#29992;&#24615;&#12469;&#12540;&#12499;&#12473;</dt>
<dd>
<p>&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12395;&#12377;&#12427;&#12392;&#12289;&#12463;&#12521;&#12473;&#12479;&#12391;&#21487;&#29992;&#24615;&#12364;&#26377;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;</dt>
<dd>
<p>&#21487;&#29992;&#24615;&#12469;&#12540;&#12499;&#12473;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#34920;&#12290;</p>
<p>GlassFish Server&#12399;&#21487;&#29992;&#24615;&#12469;&#12540;&#12499;&#12473;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#23450;&#32681;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12372;&#12392;&#12395;&#12289;&#27425;&#12398;&#24773;&#22577;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;:</p>
<dl>
<dt>&#21517;&#21069;</dt>
<dd>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21517;&#21069;&#12290;</p>
</dd>
<dt>&#20516;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#23550;&#12375;&#12390;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12290;</p>
</dd>
<dt>&#35500;&#26126;</dt>
<dd>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#38306;&#12377;&#12427;&#35443;&#32048;&#12434;&#25552;&#20379;&#12377;&#12427;&#12486;&#12461;&#12473;&#12488;&#24418;&#24335;&#12398;&#35500;&#26126;&#12290;</p>
</dd>
</dl>
<p>&#12300;&#36861;&#21152;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12398;&#34920;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12418;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;</dt>
<dd>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12371;&#12398;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#12300;&#36861;&#21152;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12398;&#34920;&#12395;&#34892;&#12364;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21066;&#38500;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#21066;&#38500;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#21066;&#38500;&#12373;&#12428;&#12383;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12395;&#25147;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12364;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12399;&#26410;&#23450;&#32681;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref353" name="sthref353"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<p><a href="task-availabilityservice.html">&#12463;&#12521;&#12473;&#12479;&#12398;&#21487;&#29992;&#24615;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
