<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterinstances" name="ref-clusterinstances"></a></p>

<h4><a id="sthref266" name="sthref266"></a><a id="sthref267" name="sthref267"></a>&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#29694;&#22312;&#12398;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20316;&#25104;&#12362;&#12424;&#12403;&#31649;&#29702;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12463;&#12521;&#12473;&#12479;&#21517;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#12289;&#29694;&#22312;&#12398;&#12463;&#12521;&#12473;&#12479;&#12398;&#21517;&#21069;&#12364;&#34920;&#31034;&#12373;&#12428;&#12427;&#35501;&#21462;&#12426;&#23554;&#29992;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12391;&#12377;&#12290;</p>
<p>&#12300;&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#29694;&#22312;&#12398;&#12463;&#12521;&#12473;&#12479;&#12398;&#12513;&#12531;&#12496;&#12540;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12522;&#12473;&#12488;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12372;&#12392;&#12395;&#12289;&#27425;&#12398;&#24773;&#22577;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#21517;&#21069;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20316;&#25104;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12383;&#21517;&#21069;&#12290;&#21517;&#21069;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12300;<a href="ref-clusterinstanceedit.html">&#19968;&#33324;&#24773;&#22577;</a>&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</dd>
<dt>LB&#12398;&#37325;&#12415;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12525;&#12540;&#12489;&#12496;&#12521;&#12531;&#12471;&#12531;&#12464;&#12398;&#37325;&#12415;&#12434;&#34920;&#12377;&#25972;&#25968;&#12290;</p>
<p>&#12525;&#12540;&#12489;&#12496;&#12521;&#12531;&#12471;&#12531;&#12464;&#12398;&#37325;&#12415;&#12399;&#12289;&#12463;&#12521;&#12473;&#12479;&#12395;&#23550;&#12377;&#12427;&#12377;&#12409;&#12390;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12398;&#12358;&#12385;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20966;&#29702;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#21106;&#21512;&#12434;&#27770;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12383;&#12392;&#12360;&#12400;&#12289;2&#12388;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#27083;&#25104;&#12373;&#12428;&#12427;&#12463;&#12521;&#12473;&#12479;&#12391;&#12289;&#19968;&#26041;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;4&#12388;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12398;&#12358;&#12385;&#12398;1&#12388;&#12434;&#20966;&#29702;&#12375;&#12289;&#12418;&#12358;&#19968;&#26041;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#27531;&#12426;&#12398;3&#12388;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#20966;&#29702;&#12377;&#12427;&#12371;&#12392;&#12364;&#24517;&#35201;&#12395;&#12394;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#22580;&#21512;&#12289;4&#12388;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12398;&#12358;&#12385;&#12398;1&#12388;&#12434;&#20966;&#29702;&#12377;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#37325;&#12415;&#12434;1&#12395;&#35373;&#23450;&#12375;&#12289;&#12418;&#12358;&#19968;&#26041;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#37325;&#12415;&#12434;3&#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#12497;&#12540;&#12475;&#12531;&#12488;&#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#37325;&#12415;&#12434;&#12381;&#12428;&#12382;&#12428;25&#12392;75&#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#37325;&#12415;&#12399;100&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#27083;&#25104;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#21442;&#29031;&#12377;&#12427;&#27083;&#25104;&#12290;&#27083;&#25104;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12300;<a href="../../../common/en/help/ref-configuration.html">&#27083;&#25104;</a>&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12494;&#12540;&#12489;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#37197;&#32622;&#12373;&#12428;&#12390;&#12356;&#12427;&#12494;&#12540;&#12489;&#12398;&#21517;&#21069;&#12290;&#21517;&#21069;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#12494;&#12540;&#12489;&#12398;&#12300;<a href="ref-nodeedit.html">&#12494;&#12540;&#12489;&#12398;&#32232;&#38598;</a>&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12473;&#12486;&#12540;&#12479;&#12473;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#23455;&#34892;&#20013;&#12363;&#12393;&#12358;&#12363;&#12289;&#12414;&#12383;&#12399;&#22793;&#26356;&#12375;&#12383;&#27083;&#25104;&#12434;&#26356;&#26032;&#12377;&#12427;&#12383;&#12417;&#12395;&#20877;&#36215;&#21205;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12371;&#12392;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
</dl>
<p>&#12300;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12301;&#12398;&#34920;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12418;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#26032;&#35215;</dt>
<dd>
<p>&#12463;&#12521;&#12473;&#12479;&#12395;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36861;&#21152;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
<dt>&#21066;&#38500;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#12463;&#12521;&#12473;&#12479;&#12363;&#12425;&#38500;&#21435;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
&#12510;&#12473;&#12479;&#12540;&#12539;&#12502;&#12525;&#12540;&#12459;&#12364;&#12354;&#12427;Java Message Service (JMS)&#12463;&#12521;&#12473;&#12479;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12381;&#12398;&#12510;&#12473;&#12479;&#12540;&#12539;&#12502;&#12525;&#12540;&#12459;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12390;&#12356;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#21066;&#38500;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12390;&#12356;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#21066;&#38500;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00005"><code>change-master-broker</code>(1)</a>&#12469;&#12502;&#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12510;&#12473;&#12479;&#12540;&#12539;&#12502;&#12525;&#12540;&#12459;&#12434;&#20182;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#21106;&#12426;&#24403;&#12390;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
<hr>

</dd>
<dt>&#36215;&#21205;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36215;&#21205;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
<dt>&#20572;&#27490;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20572;&#27490;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
</dl>
<a id="sthref268" name="sthref268"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-create-clustered-instance.html">GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#12463;&#12521;&#12473;&#12479;&#12395;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-delete-clustered-instances.html">&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-start-clustered-instances.html">&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36215;&#21205;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-stop-clustered-instances.html">&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20572;&#27490;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref269" name="sthref269"></a>
<h5>&#21516;&#31561;&#12398;asadmin&#12469;&#12502;&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00033"><code>create-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00085"><code>delete-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00170"><code>list-instances</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00236"><code>start-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00241"><code>stop-instance</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
