<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-recovertransactions" name="ref-recovertransactions"></a><a id="GHCLU00009" name="GHCLU00009"></a></p>

<h4><a id="sthref280" name="sthref280"></a>&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#12522;&#12459;&#12496;&#12522;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#12522;&#12459;&#12496;&#12522;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#12522;&#12459;&#12496;&#12522;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#23455;&#34892;&#20013;&#12398;&#22580;&#21512;&#12289;&#12300;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#12522;&#12459;&#12496;&#12522;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#12300;<b>&#12522;&#12459;&#12496;&#12522;&#12399;&#12289;&#31292;&#20685;&#20013;&#12398;&#12469;&#12540;&#12496;&#12540;&#33258;&#20307;&#12395;&#12424;&#12387;&#12390;&#23455;&#34892;&#12373;&#12428;&#12414;&#12377;</b>&#12301;&#12392;&#12356;&#12358;&#12486;&#12461;&#12473;&#12488;&#12392;&#12300;OK&#12301;&#12508;&#12479;&#12531;&#12398;&#12415;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12300;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#12522;&#12459;&#12496;&#12522;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21517;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20316;&#25104;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12383;&#21517;&#21069;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#23451;&#20808;&#12469;&#12540;&#12496;&#12540;</dt>
<dd>
<p>&#29694;&#22312;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#12522;&#12459;&#12496;&#12522;&#12391;&#12365;&#12427;&#21029;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12290;</p>
</dd>
<dt>&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12525;&#12464;&#12398;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;</dt>
<dd>
<p>&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12525;&#12464;&#12364;&#26684;&#32013;&#12373;&#12428;&#12427;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;&#12289;&#12489;&#12513;&#12452;&#12531;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12398;<code>/logs/tx</code>&#12391;&#12377;&#12290;</p>
<p>&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12525;&#12464;&#12399;&#12289;&#12463;&#12521;&#12473;&#12479;&#27083;&#25104;&#12398;&#12300;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12398;&#12300;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12525;&#12464;&#12398;&#20301;&#32622;&#12301;&#12398;&#35373;&#23450;&#12391;&#25351;&#23450;&#12373;&#12428;&#12383;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12398;<code>tx</code>&#12469;&#12502;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#20445;&#25345;&#12373;&#12428;&#12414;&#12377;&#12290;&#12300;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12525;&#12464;&#12398;&#20301;&#32622;&#12301;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12289;&#12300;&#12489;&#12513;&#12452;&#12531;&#23646;&#24615;&#12301;&#12506;&#12540;&#12472;&#12398;&#12300;&#12525;&#12464;&#12539;&#12523;&#12540;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12391;&#25351;&#23450;&#12373;&#12428;&#12383;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12391;&#12377;&#12290;&#12371;&#12398;&#12506;&#12540;&#12472;&#12399;GlassFish Server&#12494;&#12540;&#12489;&#12398;&#12300;&#35443;&#32048;&#12301;&#12479;&#12502;&#12398;&#19979;&#12395;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<a id="sthref281" name="sthref281"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-recovertransactions.html">&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#12522;&#12459;&#12496;&#12522;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-recovertransactions-standalone-instance.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#12522;&#12459;&#12496;&#12522;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref282" name="sthref282"></a>
<h5>&#21516;&#31561;&#12398;asadmin&#12469;&#12502;&#12467;&#12510;&#12531;&#12489;</h5>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00216"><code>recover-transactions</code>(1)</a></p>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
