<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusternew" name="ref-clusternew"></a><a id="GHCLU00002" name="GHCLU00002"></a></p>

<h4><a id="sthref247" name="sthref247"></a><a id="sthref248" name="sthref248"></a>&#26032;&#35215;&#12463;&#12521;&#12473;&#12479;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;&#26032;&#35215;&#12463;&#12521;&#12473;&#12479;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12463;&#12521;&#12473;&#12479;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26032;&#35215;&#12463;&#12521;&#12473;&#12479;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12463;&#12521;&#12473;&#12479;&#21517;</dt>
<dd>
<p>&#12463;&#12521;&#12473;&#12479;&#12398;&#21517;&#21069;&#12290;</p>
<p>&#21517;&#21069;&#12399;&#27425;&#12398;&#35201;&#20214;&#12434;&#28288;&#12383;&#12377;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;:</p>
<ul>
<li>
<p>&#21517;&#21069;&#12395;&#12399;ASCII&#25991;&#23383;&#12398;&#12415;&#12434;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#21517;&#21069;&#12399;&#33521;&#25968;&#23383;&#12414;&#12383;&#12399;&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#12391;&#22987;&#12417;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#21517;&#21069;&#12395;&#21547;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12398;&#12399;&#27425;&#12398;&#25991;&#23383;&#12398;&#12415;&#12391;&#12377;:</p>
<ul>
<li>
<p>&#23567;&#25991;&#23383;</p>
</li>
<li>
<p>&#22823;&#25991;&#23383;</p>
</li>
<li>
<p>&#25968;&#20516;</p>
</li>
<li>
<p>&#12495;&#12452;&#12501;&#12531;</p>
</li>
<li>
<p>&#12500;&#12522;&#12458;&#12489;</p>
</li>
<li>
<p>&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;</p>
</li>
</ul>
</li>
<li>
<p>&#21517;&#21069;&#12399;&#12489;&#12513;&#12452;&#12531;&#20869;&#12391;&#19968;&#24847;&#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12289;&#21029;&#12398;&#12463;&#12521;&#12473;&#12479;&#12289;&#21517;&#21069;&#20184;&#12365;&#27083;&#25104;&#12289;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12289;&#12414;&#12383;&#12399;&#12494;&#12540;&#12489;&#12398;&#21517;&#21069;&#12395;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p><code>&#12489;&#12513;&#12452;&#12531;</code>&#12289;<code>&#12469;&#12540;&#12496;&#12540;</code>&#12289;&#12414;&#12383;&#12399;GlassFish Server&#12391;&#20104;&#32004;&#12373;&#12428;&#12390;&#12356;&#12427;&#20182;&#12398;&#12461;&#12540;&#12527;&#12540;&#12489;&#12434;&#21517;&#21069;&#12395;&#20351;&#29992;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
</ul>
</dd>
<dt>&#27083;&#25104;</dt>
<dd>
<p>&#12463;&#12521;&#12473;&#12479;&#12391;&#20351;&#29992;&#12391;&#12365;&#12427;&#26082;&#23384;&#12398;&#21517;&#21069;&#20184;&#12365;&#27083;&#25104;&#12398;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12290;&#12463;&#12521;&#12473;&#12479;&#12395;&#12399;&#12289;&#12463;&#12521;&#12473;&#12479;&#12395;&#36861;&#21152;&#12373;&#12428;&#12383;&#12377;&#12409;&#12390;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#27083;&#25104;&#12434;&#23450;&#32681;&#12377;&#12427;&#21517;&#21069;&#20184;&#12365;&#27083;&#25104;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;&#12522;&#12473;&#12488;&#12363;&#12425;&#12356;&#12378;&#12428;&#12363;&#12398;&#27083;&#25104;&#12434;&#36984;&#25246;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12463;&#12521;&#12473;&#12479;&#12391;&#12399;&#12289;&#12463;&#12521;&#12473;&#12479;&#12398;&#20316;&#25104;&#26178;&#12395;&#36984;&#25246;&#12375;&#12383;&#27083;&#25104;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#36984;&#25246;&#12375;&#12390;&#12356;&#12427;&#27083;&#25104;&#12398;&#12467;&#12500;&#12540;&#12434;&#20316;&#25104;&#12377;&#12427;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12463;&#12521;&#12473;&#12479;&#12398;&#20316;&#25104;&#26178;&#12395;&#36984;&#25246;&#12375;&#12383;&#27083;&#25104;&#12364;&#12467;&#12500;&#12540;&#12373;&#12428;&#12414;&#12377;&#12290;&#27083;&#25104;&#12398;&#12467;&#12500;&#12540;&#12395;&#12399;&#12289;<i>cluster-name</i><code>-config</code>&#12392;&#12356;&#12358;&#21517;&#21069;&#12364;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12414;&#12377;&#12290;<i>cluster-name</i>&#12399;&#12289;&#12300;&#12463;&#12521;&#12473;&#12479;&#21517;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#20837;&#21147;&#12373;&#12428;&#12390;&#12356;&#12427;&#12463;&#12521;&#12473;&#12479;&#12398;&#21517;&#21069;&#12391;&#12377;&#12290;</p>
<p>&#12300;&#27083;&#25104;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12300;<code>default-config</code>&#12301;&#12434;&#36984;&#25246;&#12375;&#12383;&#22580;&#21512;&#12399;&#12289;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;<code>default-config</code>&#27083;&#25104;&#12399;&#12289;&#12467;&#12500;&#12540;&#12398;&#12415;&#12364;&#21487;&#33021;&#12391;&#12289;&#21442;&#29031;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>&#36984;&#25246;&#12375;&#12390;&#12356;&#12427;&#27083;&#25104;&#12434;&#21442;&#29031;&#12377;&#12427;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#25351;&#23450;&#12375;&#12383;&#26082;&#23384;&#12398;&#21517;&#21069;&#20184;&#12365;&#27083;&#25104;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#27083;&#25104;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12300;<code>default-config</code>&#12301;&#12434;&#36984;&#25246;&#12375;&#12383;&#22580;&#21512;&#12399;&#12289;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;<code>default-config</code>&#27083;&#25104;&#12399;&#12289;&#12467;&#12500;&#12540;&#12398;&#12415;&#12364;&#21487;&#33021;&#12391;&#12289;&#21442;&#29031;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>Message Queue&#12463;&#12521;&#12473;&#12479;&#27083;&#25104;&#12479;&#12452;&#12503;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#26032;&#12375;&#12356;GlassFish Server&#12463;&#12521;&#12473;&#12479;&#12395;&#20351;&#29992;&#12377;&#12427;Message Queue&#12502;&#12525;&#12540;&#12459;&#12539;&#12463;&#12521;&#12473;&#12479;&#12398;&#12479;&#12452;&#12503;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;GlassFish Server&#12399;&#12289;&#24467;&#26469;&#12398;Message Queue&#12502;&#12525;&#12540;&#12459;&#12539;&#12463;&#12521;&#12473;&#12479;&#12434;GlassFish Server&#12463;&#12521;&#12473;&#12479;&#12398;&#21508;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#32068;&#12415;&#36796;&#12414;&#12428;&#12383;&#12510;&#12473;&#12479;&#12540;&#12539;&#12502;&#12525;&#12540;&#12459;&#12392;&#12392;&#12418;&#12395;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#12300;&#12459;&#12473;&#12479;&#12512;&#12301;&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;GlassFish Server&#12463;&#12521;&#12473;&#12479;&#12395;&#20351;&#29992;&#12377;&#12427;Message Queue&#12502;&#12525;&#12540;&#12459;&#12539;&#12463;&#12521;&#12473;&#12479;&#12434;&#27083;&#25104;&#12377;&#12427;&#12383;&#12417;&#12398;&#35079;&#25968;&#12398;&#36861;&#21152;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;<a href="#CHDJFEJB">&#12459;&#12473;&#12479;&#12512;Message Queue&#12502;&#12525;&#12540;&#12459;&#12539;&#12463;&#12521;&#12473;&#12479;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</dd>
<dt>&#20316;&#25104;&#12377;&#12427;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;</dt>
<dd>
<p>&#12463;&#12521;&#12473;&#12479;&#12398;&#20316;&#25104;&#26178;&#12395;&#20316;&#25104;&#12373;&#12428;&#12427;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12522;&#12473;&#12488;&#12290;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12372;&#12392;&#12395;&#12289;&#27425;&#12398;&#24773;&#22577;&#12364;&#31034;&#12373;&#12428;&#12414;&#12377;:</p>
<dl>
<dt>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21517;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#21517;&#21069;&#12290;</p>
</dd>
<dt>&#37325;&#12415;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12525;&#12540;&#12489;&#12496;&#12521;&#12531;&#12471;&#12531;&#12464;&#12398;&#37325;&#12415;&#12434;&#34920;&#12377;&#25972;&#25968;&#12290;</p>
<p>&#12525;&#12540;&#12489;&#12496;&#12521;&#12531;&#12471;&#12531;&#12464;&#12398;&#37325;&#12415;&#12399;&#12289;&#12463;&#12521;&#12473;&#12479;&#12395;&#23550;&#12377;&#12427;&#12377;&#12409;&#12390;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12398;&#12358;&#12385;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20966;&#29702;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#21106;&#21512;&#12434;&#27770;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12383;&#12392;&#12360;&#12400;&#12289;2&#12388;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#27083;&#25104;&#12373;&#12428;&#12427;&#12463;&#12521;&#12473;&#12479;&#12391;&#12289;&#19968;&#26041;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;4&#12388;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12398;&#12358;&#12385;&#12398;1&#12388;&#12434;&#20966;&#29702;&#12375;&#12289;&#12418;&#12358;&#19968;&#26041;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#27531;&#12426;&#12398;3&#12388;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#20966;&#29702;&#12377;&#12427;&#12371;&#12392;&#12364;&#24517;&#35201;&#12395;&#12394;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#22580;&#21512;&#12289;4&#12388;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12398;&#12358;&#12385;&#12398;1&#12388;&#12434;&#20966;&#29702;&#12377;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#37325;&#12415;&#12434;1&#12395;&#35373;&#23450;&#12375;&#12289;&#12418;&#12358;&#19968;&#26041;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#37325;&#12415;&#12434;3&#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#12497;&#12540;&#12475;&#12531;&#12488;&#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#37325;&#12415;&#12434;&#12381;&#12428;&#12382;&#12428;25&#12392;75&#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#37325;&#12415;&#12399;100&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12494;&#12540;&#12489;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#37197;&#32622;&#12391;&#12365;&#12427;&#26082;&#23384;&#12398;&#12494;&#12540;&#12489;&#12398;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12290;&#12522;&#12473;&#12488;&#12363;&#12425;&#12356;&#12378;&#12428;&#12363;&#12398;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12463;&#12521;&#12473;&#12479;&#12398;&#20316;&#25104;&#26178;&#12395;&#12289;&#36984;&#25246;&#12375;&#12383;&#12494;&#12540;&#12489;&#12395;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#37197;&#32622;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<p>&#12300;&#20316;&#25104;&#12377;&#12427;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12301;&#12398;&#34920;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12418;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#26032;&#35215;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12371;&#12398;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#12300;&#20316;&#25104;&#12377;&#12427;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12301;&#12398;&#34920;&#12395;&#34892;&#12364;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#21066;&#38500;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#21066;&#38500;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
</dl>
</dd>
</dl>
<a id="CHDJFEJB" name="CHDJFEJB"></a>
<h5>&#12459;&#12473;&#12479;&#12512;Message Queue&#12502;&#12525;&#12540;&#12459;&#12539;&#12463;&#12521;&#12473;&#12479;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;</h5>
<p>&#12300;Message Queue&#12463;&#12521;&#12473;&#12479;&#27083;&#25104;&#12479;&#12452;&#12503;&#12301;&#12434;&#12300;&#12459;&#12473;&#12479;&#12512;&#12301;&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;GlassFish Server&#12463;&#12521;&#12473;&#12479;&#12395;&#20351;&#29992;&#12377;&#12427;Message Queue&#12502;&#12525;&#12540;&#12459;&#12539;&#12463;&#12521;&#12473;&#12479;&#12434;&#27083;&#25104;&#12377;&#12427;&#12383;&#12417;&#12398;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>JMS&#12469;&#12540;&#12499;&#12473;&#12539;&#12479;&#12452;&#12503;</dt>
<dd>
<p>&#12502;&#12525;&#12540;&#12459;&#12539;&#12463;&#12521;&#12473;&#12479;&#20869;&#12391;&#20351;&#29992;&#12377;&#12427;&#12502;&#12525;&#12540;&#12459;(GlassFish Server&#12391;&#12399;JMS&#12507;&#12473;&#12488;&#12392;&#21628;&#12400;&#12428;&#12427;)&#12398;&#12479;&#12452;&#12503;&#12290;&#36984;&#25246;&#12375;&#12383;&#12479;&#12452;&#12503;&#12395;&#12424;&#12387;&#12390;&#12289;&#20351;&#29992;&#21487;&#33021;&#12394;&#12502;&#12525;&#12540;&#12459;&#12539;&#12463;&#12521;&#12473;&#12479;&#12398;&#12479;&#12452;&#12503;&#12364;&#27770;&#12414;&#12426;&#12414;&#12377;&#12290;&#12502;&#12525;&#12540;&#12459;&#12539;&#12479;&#12452;&#12503;&#12399;&#27425;&#12398;&#12392;&#12362;&#12426;&#12391;&#12377;&#12290;</p>
<dl>
<dt>Embedded</dt>
<dd>
<p>&#12502;&#12525;&#12540;&#12459;&#12398;&#27083;&#25104;&#12392;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12399;GlassFish Server&#12391;&#31649;&#29702;&#12373;&#12428;&#12414;&#12377;&#12290;&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;&#21508;GlassFish&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#12289;&#21516;&#12376;JVM&#12391;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#12375;&#12390;&#31292;&#20685;&#12375;&#12390;&#12356;&#12427;&#12502;&#12525;&#12540;&#12459;&#12395;&#12424;&#12387;&#12390;&#12469;&#12540;&#12499;&#12473;&#12434;&#21463;&#12369;&#12414;&#12377;&#12290;</p>
<p>JMS&#12469;&#12540;&#12499;&#12473;&#12539;&#12479;&#12452;&#12503;&#12539;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#12300;Embedded&#12301;&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#24467;&#26469;&#12398;Message Queue&#12502;&#12525;&#12540;&#12459;&#12539;&#12463;&#12521;&#12473;&#12479;&#12398;&#12415;&#12364;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12414;&#12377;&#12290;&#24467;&#26469;&#12398;&#12463;&#12521;&#12473;&#12479;&#12434;&#27083;&#25104;&#12377;&#12427;&#12383;&#12417;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>Local</dt>
<dd>
<p>&#12502;&#12525;&#12540;&#12459;&#12398;&#27083;&#25104;&#12392;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12399;GlassFish Server&#12391;&#31649;&#29702;&#12373;&#12428;&#12414;&#12377;&#12290;&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;&#21508;GlassFish&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#12289;&#21516;&#12376;&#12507;&#12473;&#12488;&#19978;&#12398;&#21029;&#12398;JVM&#12391;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#12375;&#12390;&#31292;&#20685;&#12375;&#12390;&#12356;&#12427;&#12502;&#12525;&#12540;&#12459;&#12395;&#12424;&#12387;&#12390;&#12469;&#12540;&#12499;&#12473;&#12434;&#21463;&#12369;&#12414;&#12377;&#12290;</p>
<p>JMS&#12469;&#12540;&#12499;&#12473;&#12539;&#12479;&#12452;&#12503;&#12539;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#12300;Local&#12301;&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#24467;&#26469;&#12362;&#12424;&#12403;&#25313;&#24373;(&#39640;&#21487;&#29992;&#24615;)Message Queue&#12502;&#12525;&#12540;&#12459;&#12539;&#12463;&#12521;&#12473;&#12479;&#12398;&#20001;&#26041;&#12364;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12414;&#12377;&#12290;&#12463;&#12521;&#12473;&#12479;&#12539;&#12479;&#12452;&#12503;&#12434;&#36984;&#25246;&#12375;&#12390;&#12463;&#12521;&#12473;&#12479;&#12434;&#27083;&#25104;&#12377;&#12427;&#12383;&#12417;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>Remote</dt>
<dd>
<p>&#12502;&#12525;&#12540;&#12459;&#12362;&#12424;&#12403;&#12502;&#12525;&#12540;&#12459;&#12539;&#12463;&#12521;&#12473;&#12479;&#12398;&#27083;&#25104;&#12392;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12399;Message Queue&#31649;&#29702;&#12484;&#12540;&#12523;&#12391;&#31649;&#29702;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<p>JMS&#12469;&#12540;&#12499;&#12473;&#12539;&#12479;&#12452;&#12503;&#12539;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#12300;Remote&#12301;&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#20182;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#34920;&#31034;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
</dl>
</dd>
<dt>JMS&#12463;&#12521;&#12473;&#12479;&#12539;&#12479;&#12452;&#12503;</dt>
<dd>
<p>GlassFish Server&#12463;&#12521;&#12473;&#12479;&#12395;&#20351;&#29992;&#12377;&#12427;Message Queue&#12502;&#12525;&#12540;&#12459;&#12539;&#12463;&#12521;&#12473;&#12479;&#12398;&#12479;&#12452;&#12503;&#12290;</p>
<p>&#12300;JMS&#12463;&#12521;&#12473;&#12479;&#12539;&#12479;&#12452;&#12503;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#12300;Conventional&#12301;&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>JMS&#27083;&#25104;&#12473;&#12488;&#12450;&#12539;&#12479;&#12452;&#12503;</dt>
<dd>
<p>&#24467;&#26469;&#12398;&#12463;&#12521;&#12473;&#12479;&#12398;&#27083;&#25104;&#12487;&#12540;&#12479;&#12395;&#20351;&#29992;&#12377;&#12427;&#12487;&#12540;&#12479;&#12539;&#12473;&#12488;&#12450;&#12398;&#12479;&#12452;&#12503;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#12300;&#12510;&#12473;&#12479;&#12540;&#12539;&#12502;&#12525;&#12540;&#12459;&#12301;&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;1&#12388;&#12398;&#12502;&#12525;&#12540;&#12459;&#12364;&#12510;&#12473;&#12479;&#12540;&#12539;&#12502;&#12525;&#12540;&#12459;&#12392;&#12375;&#12390;&#25351;&#23450;&#12373;&#12428;&#12289;&#12381;&#12398;&#12510;&#12473;&#12479;&#12540;&#12539;&#12502;&#12525;&#12540;&#12459;&#12395;&#12424;&#12387;&#12390;&#27083;&#25104;&#12487;&#12540;&#12479;&#12364;&#26684;&#32013;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#12300;&#20849;&#26377;DB&#12301;&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#12377;&#12409;&#12390;&#12398;&#12502;&#12525;&#12540;&#12459;&#12363;&#12425;&#12450;&#12463;&#12475;&#12473;&#21487;&#33021;&#12394;JDBC&#12487;&#12540;&#12479;&#12539;&#12473;&#12488;&#12450;&#12395;&#27083;&#25104;&#12487;&#12540;&#12479;&#12364;&#26684;&#32013;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#22580;&#21512;&#12399;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#38306;&#36899;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>JMS&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12473;&#12488;&#12450;&#12539;&#12479;&#12452;&#12503;</dt>
<dd>
<p>&#21508;&#12502;&#12525;&#12540;&#12459;&#12364;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12487;&#12540;&#12479;&#12398;&#26684;&#32013;&#12395;&#20351;&#29992;&#12377;&#12427;&#12487;&#12540;&#12479;&#12539;&#12473;&#12488;&#12450;&#12398;&#12479;&#12452;&#12503;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#12300;&#12501;&#12449;&#12452;&#12523;&#12301;&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#21508;&#12502;&#12525;&#12540;&#12459;&#12399;&#12501;&#12449;&#12452;&#12523;&#12505;&#12540;&#12473;&#12398;&#12487;&#12540;&#12479;&#12539;&#12473;&#12488;&#12450;&#12395;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12487;&#12540;&#12479;&#12434;&#26684;&#32013;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#12300;JDBC&#12301;&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#21508;&#12502;&#12525;&#12540;&#12459;&#12399;JDBC&#12487;&#12540;&#12479;&#12539;&#12473;&#12488;&#12450;&#12395;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12487;&#12540;&#12479;&#12434;&#26684;&#32013;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<p>&#12300;JMS&#12463;&#12521;&#12473;&#12479;&#12539;&#12479;&#12452;&#12503;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#12300;Enhanced (HA)&#12301;&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#38306;&#36899;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12505;&#12531;&#12480;&#12540;</dt>
<dt>&#12289;</dt>
<dt>&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;URL</dt>
<dt>&#12289;</dt>
<dt>&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12518;&#12540;&#12470;&#12540;</dt>
<dd>
<p>&#27425;&#12398;&#22580;&#21512;&#12395;&#20351;&#29992;&#12377;&#12427;JDBC&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12505;&#12531;&#12480;&#12540;&#12289;&#12450;&#12463;&#12475;&#12473;URL&#12289;&#12362;&#12424;&#12403;&#12518;&#12540;&#12470;&#12540;&#12290;</p>
<ul>
<li>
<p>&#24467;&#26469;&#12398;&#12463;&#12521;&#12473;&#12479;&#12398;&#27083;&#25104;&#12473;&#12488;&#12450;&#12539;&#12479;&#12452;&#12503;&#12434;&#12300;&#20849;&#26377;DB&#12301;&#12395;&#35373;&#23450;&#12375;&#12383;&#22580;&#21512;</p>
</li>
<li>
<p>&#24467;&#26469;&#12398;&#12463;&#12521;&#12473;&#12479;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12473;&#12488;&#12450;&#12539;&#12479;&#12452;&#12503;&#12434;&#12300;JDBC&#12301;&#12395;&#35373;&#23450;&#12375;&#12383;&#22580;&#21512;</p>
</li>
<li>
<p>&#12463;&#12521;&#12473;&#12479;&#12539;&#12479;&#12452;&#12503;&#12434;&#12300;Enhanced (HA)&#12301;&#12395;&#35373;&#23450;&#12375;&#12383;&#22580;&#21512;</p>
</li>
</ul>
<p>&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12427;&#12505;&#12531;&#12480;&#12540;&#12362;&#12424;&#12403;&#21508;&#12505;&#12531;&#12480;&#12540;&#12398;&#12450;&#12463;&#12475;&#12473;URL&#12398;&#24418;&#24335;&#12398;&#35443;&#32048;&#12399;&#12289;<i>Oracle GlassFish Server Message Queue&#31649;&#29702;&#12460;&#12452;&#12489;</i>&#12398;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GMADG00244">JDBC&#12505;&#12540;&#12473;&#12398;&#27704;&#32154;&#24615;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</dd>
<dt>&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#35469;&#35388;</dt>
<dt>&#12289;</dt>
<dt>&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12497;&#12473;&#12527;&#12540;&#12489;</dt>
<dt>&#12289;</dt>
<dt>&#12497;&#12473;&#12527;&#12540;&#12489;&#12539;&#12456;&#12452;&#12522;&#12450;&#12473;</dt>
<dd>
<p>&#12300;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12518;&#12540;&#12470;&#12540;&#12301;&#12395;&#25351;&#23450;&#12373;&#12428;&#12383;JDBC&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12518;&#12540;&#12470;&#12540;&#12398;&#12497;&#12473;&#12527;&#12540;&#12489;&#24773;&#22577;&#12290;</p>
<p>&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#35469;&#35388;&#12434;&#12300;&#12497;&#12473;&#12527;&#12540;&#12489;&#12301;&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#12300;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12497;&#12473;&#12527;&#12540;&#12489;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#35469;&#35388;&#12434;&#12300;&#12497;&#12473;&#12527;&#12540;&#12489;&#12539;&#12456;&#12452;&#12522;&#12450;&#12473;&#12301;&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#12300;&#12497;&#12473;&#12527;&#12540;&#12489;&#12539;&#12456;&#12452;&#12522;&#12450;&#12473;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>JMS&#12463;&#12521;&#12473;&#12479;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;</dt>
<dd>
<p>&#12502;&#12525;&#12540;&#12459;&#12434;&#27083;&#25104;&#12377;&#12427;&#12383;&#12417;&#12398;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;Message Queue&#12502;&#12525;&#12540;&#12459;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12522;&#12473;&#12488;&#12290;&#12371;&#12398;&#12522;&#12473;&#12488;&#12399;&#12467;&#12525;&#12531;&#21306;&#20999;&#12426;(<code>:</code>)&#12391;&#12289;&#27425;&#12398;&#24418;&#24335;&#12395;&#12394;&#12426;&#12414;&#12377;:</p>
<pre>
<i>prop1Name</i>=<i>prop1Value</i>:<i>prop2Name</i>=<i>prop2Value</i>:...
</pre>
<p>&#12502;&#12525;&#12540;&#12459;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#21517;&#12395;&#12489;&#12483;&#12488;&#12364;&#21547;&#12414;&#12428;&#12427;&#22580;&#21512;&#12399;&#12289;&#12489;&#12483;&#12488;&#12398;&#21069;&#12395;2&#12388;&#12398;&#12496;&#12483;&#12463;&#12473;&#12521;&#12483;&#12471;&#12517;(<code>\\</code>)&#12434;&#20184;&#12369;&#12414;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;<code>imq.system.max_count</code>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#21547;&#12417;&#12427;&#12395;&#12399;&#12289;&#12522;&#12473;&#12488;&#12395;<code>imq\\.system\\.max_count</code>&#12392;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<a id="sthref249" name="sthref249"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<p><a href="task-create-cluster.html">&#12463;&#12521;&#12473;&#12479;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
<a id="sthref250" name="sthref250"></a>
<h5>&#21516;&#31561;&#12398;asadmin&#12469;&#12502;&#12467;&#12510;&#12531;&#12489;</h5>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00017"><code>create-cluster</code>(1)</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
