<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-standaloneinstancenew" name="ref-standaloneinstancenew"></a></p>

<h4><a id="sthref324" name="sthref324"></a><a id="sthref325" name="sthref325"></a><a id="sthref326" name="sthref326"></a>&#26032;&#35215;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;&#26032;&#35215;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26032;&#35215;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21517;</dt>
<dd>
<p>&#20316;&#25104;&#12373;&#12428;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#21517;&#21069;&#12290;</p>
<p>&#21517;&#21069;&#12399;&#27425;&#12398;&#35201;&#20214;&#12434;&#28288;&#12383;&#12377;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;:</p>
<ul>
<li>
<p>&#21517;&#21069;&#12395;&#12399;ASCII&#25991;&#23383;&#12398;&#12415;&#12434;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#21517;&#21069;&#12399;&#33521;&#25968;&#23383;&#12414;&#12383;&#12399;&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#12391;&#22987;&#12417;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#21517;&#21069;&#12395;&#21547;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12398;&#12399;&#27425;&#12398;&#25991;&#23383;&#12398;&#12415;&#12391;&#12377;:</p>
<ul>
<li>
<p>&#23567;&#25991;&#23383;</p>
</li>
<li>
<p>&#22823;&#25991;&#23383;</p>
</li>
<li>
<p>&#25968;&#20516;</p>
</li>
<li>
<p>&#12495;&#12452;&#12501;&#12531;</p>
</li>
<li>
<p>&#12500;&#12522;&#12458;&#12489;</p>
</li>
<li>
<p>&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;</p>
</li>
</ul>
</li>
<li>
<p>&#21517;&#21069;&#12399;&#12489;&#12513;&#12452;&#12531;&#20869;&#12391;&#19968;&#24847;&#12395;&#12375;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;&#21029;&#12398;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12289;&#12463;&#12521;&#12473;&#12479;&#12289;&#21517;&#21069;&#20184;&#12365;&#27083;&#25104;&#12289;&#12414;&#12383;&#12399;&#12494;&#12540;&#12489;&#12398;&#21517;&#21069;&#12395;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p><code>&#12489;&#12513;&#12452;&#12531;</code>&#12289;<code>&#12469;&#12540;&#12496;&#12540;</code>&#12289;&#12414;&#12383;&#12399;GlassFish Server&#12391;&#20104;&#32004;&#12373;&#12428;&#12390;&#12356;&#12427;&#20182;&#12398;&#12461;&#12540;&#12527;&#12540;&#12489;&#12434;&#21517;&#21069;&#12395;&#20351;&#29992;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
</ul>
</dd>
<dt>&#12494;&#12540;&#12489;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#37197;&#32622;&#12391;&#12365;&#12427;&#12507;&#12473;&#12488;&#12434;&#23450;&#32681;&#12377;&#12427;&#26082;&#23384;&#12398;&#12494;&#12540;&#12489;&#12398;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12290;&#12522;&#12473;&#12488;&#12363;&#12425;&#12356;&#12378;&#12428;&#12363;&#12398;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12489;&#12513;&#12452;&#12531;&#31649;&#29702;&#12469;&#12540;&#12496;&#12540;(DAS)&#12364;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;&#12507;&#12473;&#12488;&#12395;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#23450;&#32681;&#28168;&#12494;&#12540;&#12489;<code>localhost-</code><i>domain</i>&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#27083;&#25104;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#20351;&#29992;&#12391;&#12365;&#12427;&#26082;&#23384;&#12398;&#21517;&#21069;&#20184;&#12365;&#27083;&#25104;&#12398;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12290;&#12522;&#12473;&#12488;&#12363;&#12425;&#12356;&#12378;&#12428;&#12363;&#12398;&#27083;&#25104;&#12434;&#36984;&#25246;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#12399;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#20316;&#25104;&#26178;&#12395;&#36984;&#25246;&#12375;&#12383;&#27083;&#25104;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#36984;&#25246;&#12375;&#12390;&#12356;&#12427;&#27083;&#25104;&#12398;&#12467;&#12500;&#12540;&#12434;&#20316;&#25104;&#12377;&#12427;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#20316;&#25104;&#26178;&#12395;&#36984;&#25246;&#12375;&#12383;&#27083;&#25104;&#12364;&#12467;&#12500;&#12540;&#12373;&#12428;&#12414;&#12377;&#12290;&#27083;&#25104;&#12398;&#12467;&#12500;&#12540;&#12395;&#12399;&#12289;<i>instance-name</i><code>-config</code>&#12392;&#12356;&#12358;&#21517;&#21069;&#12364;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12414;&#12377;&#12290;<i>instance-name</i>&#12399;&#12289;&#12300;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21517;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#20837;&#21147;&#12373;&#12428;&#12390;&#12356;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#21517;&#21069;&#12391;&#12377;&#12290;</p>
<p>&#12300;&#27083;&#25104;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12300;<code>default-config</code>&#12301;&#12434;&#36984;&#25246;&#12375;&#12383;&#22580;&#21512;&#12399;&#12289;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;<code>default-config</code>&#27083;&#25104;&#12399;&#12289;&#12467;&#12500;&#12540;&#12398;&#12415;&#12364;&#21487;&#33021;&#12391;&#12289;&#21442;&#29031;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>&#36984;&#25246;&#12375;&#12390;&#12356;&#12427;&#27083;&#25104;&#12434;&#21442;&#29031;&#12377;&#12427;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#25351;&#23450;&#12375;&#12383;&#26082;&#23384;&#12398;&#21517;&#21069;&#20184;&#12365;&#27083;&#25104;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#27083;&#25104;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12300;<code>default-config</code>&#12301;&#12434;&#36984;&#25246;&#12375;&#12383;&#22580;&#21512;&#12399;&#12289;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;<code>default-config</code>&#27083;&#25104;&#12399;&#12289;&#12467;&#12500;&#12540;&#12398;&#12415;&#12364;&#21487;&#33021;&#12391;&#12289;&#21442;&#29031;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
</dl>
<a id="sthref327" name="sthref327"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<p><a href="task-create-standalone-instance.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
<a id="sthref328" name="sthref328"></a>
<h5>&#21516;&#31561;&#12398;asadmin&#12469;&#12502;&#12467;&#12510;&#12531;&#12489;</h5>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00033"><code>create-instance</code>(1)</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
