<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-gms" name="ref-gms"></a></p>

<h4><a id="sthref354" name="sthref354"></a>&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;&#12398;&#32232;&#38598;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;GMS&#35373;&#23450;&#12434;&#22793;&#26356;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;(GMS)&#12399;&#12289;&#12463;&#12521;&#12473;&#12479;&#12398;&#12514;&#12491;&#12479;&#12540;&#12289;&#12463;&#12521;&#12473;&#12479;&#12398;&#12513;&#12531;&#12496;&#12540;&#12471;&#12483;&#12503;&#12289;&#12362;&#12424;&#12403;&#12464;&#12523;&#12540;&#12503;&#36890;&#20449;&#12398;&#21508;&#12469;&#12540;&#12499;&#12473;&#12434;&#25552;&#20379;&#12377;&#12427;&#12452;&#12531;&#12503;&#12525;&#12475;&#12473;&#12539;&#12469;&#12540;&#12499;&#12473;&#12391;&#12377;&#12290;GMS&#12399;&#12289;&#12464;&#12523;&#12540;&#12503;&#12539;&#12513;&#12531;&#12496;&#12540;&#12471;&#12483;&#12503;&#12398;&#26908;&#20986;&#12362;&#12424;&#12403;&#12504;&#12523;&#12473;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12503;&#12525;&#12488;&#12467;&#12523;&#12398;&#27083;&#25104;&#21487;&#33021;&#12394;&#12473;&#12479;&#12483;&#12463;&#12434;&#22522;&#30436;&#12395;&#27083;&#31689;&#12373;&#12428;&#12414;&#12377;&#12290;GMS&#12399;&#27425;&#12398;&#27231;&#33021;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12513;&#12531;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#12463;&#12521;&#12473;&#12479;&#12395;&#36861;&#21152;&#12373;&#12428;&#12427;&#12363;&#12289;&#12463;&#12521;&#12473;&#12479;&#12363;&#12425;&#38500;&#21435;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;&#12354;&#12427;&#12356;&#12399;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12513;&#12531;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#38556;&#23475;&#12364;&#30330;&#29983;&#12375;&#12383;&#30097;&#12356;&#12364;&#29983;&#12376;&#12383;&#12363;&#12289;&#38556;&#23475;&#12364;&#30330;&#29983;&#12375;&#12383;&#12371;&#12392;&#12364;&#30906;&#35469;&#12373;&#12428;&#12383;&#22580;&#21512;&#12395;&#12289;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#30331;&#37682;&#28168;&#12514;&#12472;&#12517;&#12540;&#12523;&#12395;&#36890;&#30693;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12463;&#12521;&#12473;&#12479;&#12539;&#12513;&#12531;&#12496;&#12540;&#38291;&#12391;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#36865;&#21463;&#20449;&#12377;&#12427;&#27231;&#33021;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
<p>&#12300;&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12489;</dt>
<dd>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12354;&#12427;&#35373;&#23450;&#12434;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12395;&#24489;&#20803;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12394;&#12356;&#35373;&#23450;&#12399;&#22793;&#26356;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>&#27083;&#25104;&#21517;</dt>
<dd>
<p>&#12371;&#12398;&#12506;&#12540;&#12472;&#12398;&#35373;&#23450;&#12364;&#36969;&#29992;&#12373;&#12428;&#12427;&#27083;&#25104;&#12398;&#21517;&#21069;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#12495;&#12540;&#12488;&#12499;&#12540;&#12488;&#21930;&#22833;&#22238;&#25968;</dt>
<dd>
<p>&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#38556;&#23475;&#12364;&#30097;&#12431;&#12428;&#12383;&#24460;&#12398;&#12513;&#12531;&#12496;&#12540;&#12398;&#12495;&#12540;&#12488;&#12499;&#12540;&#12488;&#21930;&#22833;&#22238;&#25968;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;3&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12495;&#12540;&#12488;&#12499;&#12540;&#12488;&#38971;&#24230;</dt>
<dd>
<p>&#12513;&#12531;&#12496;&#12540;&#12398;&#12495;&#12540;&#12488;&#12499;&#12540;&#12488;&#21930;&#22833;&#12398;&#38291;&#38548;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;2000&#12511;&#12522;&#31186;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12464;&#12523;&#12540;&#12503;&#26908;&#20986;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;</dt>
<dd>
<p>GMS&#12364;&#20182;&#12398;&#12463;&#12521;&#12473;&#12479;&#12539;&#12513;&#12531;&#12496;&#12540;&#12398;&#26908;&#20986;&#12434;&#24453;&#27231;&#12377;&#12427;&#26178;&#38291;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;5000&#12511;&#12522;&#31186;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#38556;&#23475;&#26908;&#35388;&#24453;&#27231;&#26178;&#38291;</dt>
<dd>
<p>&#38556;&#23475;&#30330;&#29983;&#12398;&#30097;&#12356;&#12398;&#12354;&#12427;&#12513;&#12531;&#12496;&#12540;&#12434;&#38556;&#23475;&#30330;&#29983;&#12513;&#12531;&#12496;&#12540;&#12392;&#12375;&#12390;&#22577;&#21578;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#30906;&#35469;&#12377;&#12427;&#21069;&#12395;&#24453;&#27231;&#12377;&#12427;&#26178;&#38291;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;1500&#12511;&#12522;&#31186;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;</dt>
<dd>
<p>&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#34920;&#12290;</p>
<p>GlassFish Server&#12399;GMS&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#23450;&#32681;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12372;&#12392;&#12395;&#12289;&#27425;&#12398;&#24773;&#22577;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;:</p>
<dl>
<dt>&#21517;&#21069;</dt>
<dd>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21517;&#21069;&#12290;</p>
</dd>
<dt>&#20516;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#23550;&#12375;&#12390;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12290;</p>
</dd>
<dt>&#35500;&#26126;</dt>
<dd>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#38306;&#12377;&#12427;&#35443;&#32048;&#12434;&#25552;&#20379;&#12377;&#12427;&#12486;&#12461;&#12473;&#12488;&#24418;&#24335;&#12398;&#35500;&#26126;&#12290;</p>
</dd>
</dl>
<p>&#12300;&#36861;&#21152;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12398;&#34920;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12418;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;</dt>
<dd>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12371;&#12398;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#12300;&#36861;&#21152;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12398;&#34920;&#12395;&#34892;&#12364;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21066;&#38500;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#21066;&#38500;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#21066;&#38500;&#12373;&#12428;&#12383;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12395;&#25147;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12364;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12399;&#26410;&#23450;&#32681;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref355" name="sthref355"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-gmsenable.html">&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-gms.html">&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-gmscluster.html">&#12463;&#12521;&#12473;&#12479;&#12398;&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>





<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
