<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterresources" name="ref-clusterresources"></a></p>

<h4><a id="sthref293" name="sthref293"></a><a id="sthref294" name="sthref294"></a><a id="sthref295" name="sthref295"></a>&#12522;&#12477;&#12540;&#12473;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;&#12522;&#12477;&#12540;&#12473;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#36984;&#25246;&#12375;&#12383;&#12463;&#12521;&#12473;&#12479;&#12391;&#27425;&#12398;&#12479;&#12473;&#12463;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#12463;&#12521;&#12473;&#12479;&#12398;&#26082;&#23384;&#12398;&#12522;&#12477;&#12540;&#12473;&#12398;&#34920;&#31034;&#12392;&#31649;&#29702;</p>
</li>
<li>
<p>&#12463;&#12521;&#12473;&#12479;&#12398;&#36861;&#21152;&#12398;&#12522;&#12477;&#12540;&#12473;&#12398;&#20316;&#25104;</p>
</li>
</ul>
<p>&#12300;&#12463;&#12521;&#12473;&#12479;&#21517;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#12289;&#29694;&#22312;&#12398;&#12463;&#12521;&#12473;&#12479;&#12398;&#21517;&#21069;&#12364;&#34920;&#31034;&#12373;&#12428;&#12427;&#35501;&#21462;&#12426;&#23554;&#29992;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12391;&#12377;&#12290;</p>
<p>&#12300;&#12522;&#12477;&#12540;&#12473;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#12463;&#12521;&#12473;&#12479;&#12398;&#26082;&#23384;&#12398;&#12522;&#12477;&#12540;&#12473;&#12398;&#12522;&#12473;&#12488;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12522;&#12477;&#12540;&#12473;&#12372;&#12392;&#12395;&#12289;&#27425;&#12398;&#24773;&#22577;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12522;&#12477;&#12540;&#12473;&#21517;</dt>
<dd>
<p>&#12522;&#12477;&#12540;&#12473;&#12364;&#20316;&#25104;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#12522;&#12477;&#12540;&#12473;&#12395;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12383;&#21517;&#21069;&#12290;&#21517;&#21069;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#12522;&#12477;&#12540;&#12473;&#12398;&#12479;&#12452;&#12503;&#12395;&#24540;&#12376;&#12390;&#12289;&#27425;&#12398;&#12356;&#12378;&#12428;&#12363;&#12398;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12289;&#35442;&#24403;&#12377;&#12427;&#12479;&#12452;&#12503;&#12398;&#12522;&#12477;&#12540;&#12473;&#12434;&#32232;&#38598;&#12391;&#12365;&#12414;&#12377;:</p>
<ul>
<li>
<p><a href="../../../jdbc/en/help/ref-jdbcresourceedit.html">JDBC&#12522;&#12477;&#12540;&#12473;&#12434;&#32232;&#38598;</a></p>
</li>
<li>
<p><a href="../../../full/en/help/ref-javamailsessionsedit.html">JavaMail&#12475;&#12483;&#12471;&#12519;&#12531;&#12434;&#32232;&#38598;</a></p>
</li>
<li>
<p><a href="../../../full/en/help/ref-jndicustomresourceedit.html">&#12459;&#12473;&#12479;&#12512;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#32232;&#38598;</a></p>
</li>
<li>
<p><a href="../../../full/en/help/ref-jndicustomresourcenew.html">&#26032;&#35215;&#12459;&#12473;&#12479;&#12512;&#12539;&#12522;&#12477;&#12540;&#12473;</a></p>
</li>
<li>
<p><a href="../../../full/en/help/ref-jndiexternalresourceedit.html">&#22806;&#37096;&#12522;&#12477;&#12540;&#12473;&#12434;&#32232;&#38598;</a></p>
</li>
<li>
<p><a href="../../../jca/en/help/ref-connectorresourceedit.html">&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#32232;&#38598;</a></p>
</li>
<li>
<p><a href="../../../jca/en/help/ref-adminobjectedit.html">&#31649;&#29702;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#32232;&#38598;</a></p>
</li>
</ul>
</dd>
<dt>&#26377;&#21177;</dt>
<dd>
<p>&#12522;&#12477;&#12540;&#12473;&#12364;&#26377;&#21177;&#12363;&#12393;&#12358;&#12363;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#12522;&#12477;&#12540;&#12473;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12289;&#12481;&#12455;&#12483;&#12463;&#12510;&#12540;&#12463;(&#10003;)&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12522;&#12477;&#12540;&#12473;&#12364;&#28961;&#21177;&#12394;&#22580;&#21512;&#12289;&#12496;&#12484;&#21360;(&#10007;)&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</dd>
<dt>&#12479;&#12452;&#12503;</dt>
<dd>
<p>&#12522;&#12477;&#12540;&#12473;&#12398;&#12479;&#12452;&#12503;&#12391;&#12377;&#12290;</p>
</dd>
</dl>
<p>&#12300;&#12522;&#12477;&#12540;&#12473;&#12301;&#12398;&#34920;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12418;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#26377;&#21177;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12522;&#12477;&#12540;&#12473;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
<dt>&#28961;&#21177;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12522;&#12477;&#12540;&#12473;&#12434;&#28961;&#21177;&#12395;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
<dt>&#26032;&#35215;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;&#12479;&#12452;&#12503;&#12398;&#12522;&#12477;&#12540;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12290;&#12522;&#12473;&#12488;&#12363;&#12425;&#12522;&#12477;&#12540;&#12473;&#12539;&#12479;&#12452;&#12503;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#27425;&#12398;&#12356;&#12378;&#12428;&#12363;&#12398;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12289;&#36984;&#25246;&#12375;&#12383;&#12479;&#12452;&#12503;&#12398;&#12522;&#12477;&#12540;&#12473;&#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p><a href="../../../jdbc/en/help/ref-jdbcresourcenew.html">&#26032;&#35215;JDBC&#12522;&#12477;&#12540;&#12473;</a></p>
</li>
<li>
<p><a href="../../../jms/en/help/ref-jmsconnectionnew.html">&#26032;&#35215;JMS&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;</a></p>
</li>
<li>
<p><a href="../../../jms/en/help/ref-jmsdestinationnew.html">&#26032;&#35215;JMS&#23451;&#20808;&#12522;&#12477;&#12540;&#12473;</a></p>
</li>
<li>
<p><a href="../../../full/en/help/ref-javamailsessioncreate.html">&#26032;&#35215;JavaMail&#12475;&#12483;&#12471;&#12519;&#12531;</a></p>
</li>
<li>
<p><a href="../../../full/en/help/ref-jndicustomresourcenew.html">&#26032;&#35215;&#12459;&#12473;&#12479;&#12512;&#12539;&#12522;&#12477;&#12540;&#12473;</a></p>
</li>
<li>
<p><a href="../../../full/en/help/ref-jndiexternalresourcenew.html">&#26032;&#35215;&#22806;&#37096;&#12522;&#12477;&#12540;&#12473;</a></p>
</li>
<li>
<p><a href="../../../jca/en/help/ref-connectorresourcenew.html">&#26032;&#35215;&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;</a></p>
</li>
<li>
<p><a href="../../../jca/en/help/ref-adminobjectnew.html">&#26032;&#35215;&#31649;&#29702;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12539;&#12522;&#12477;&#12540;&#12473;</a></p>
</li>
</ul>
</dd>
<dt>&#12501;&#12451;&#12523;&#12479;</dt>
<dd>
<p>&#34920;&#31034;&#12373;&#12428;&#12427;&#12522;&#12477;&#12540;&#12473;&#12398;&#12522;&#12473;&#12488;&#12434;&#12479;&#12452;&#12503;&#12391;&#12501;&#12451;&#12523;&#12479;&#12377;&#12427;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12290;</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
