<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-nodes" name="ref-nodes"></a></p>

<h4><a id="sthref303" name="sthref303"></a><a id="sthref304" name="sthref304"></a>&#12494;&#12540;&#12489;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;&#12494;&#12540;&#12489;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#12489;&#12513;&#12452;&#12531;&#20869;&#12398;&#12494;&#12540;&#12489;&#12398;&#12522;&#12473;&#12488;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12494;&#12540;&#12489;&#12372;&#12392;&#12395;&#12289;&#27425;&#12398;&#24773;&#22577;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#21517;&#21069;</dt>
<dd>
<p>&#12494;&#12540;&#12489;&#12364;&#20316;&#25104;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#12494;&#12540;&#12489;&#12395;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12383;&#21517;&#21069;&#12290;&#21517;&#21069;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#12494;&#12540;&#12489;&#12398;&#12300;<a href="ref-nodeedit.html">&#12494;&#12540;&#12489;&#12398;&#32232;&#38598;</a>&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12494;&#12540;&#12489;&#12539;&#12507;&#12473;&#12488;</dt>
<dd>
<p>&#12494;&#12540;&#12489;&#12364;&#34920;&#12377;&#12507;&#12473;&#12488;&#12398;&#21517;&#21069;&#12290;</p>
</dd>
<dt>&#12479;&#12452;&#12503;</dt>
<dd>
<p>&#12494;&#12540;&#12489;&#12398;&#12479;&#12452;&#12503;&#12290;&#27425;&#12398;&#12356;&#12378;&#12428;&#12363;&#12391;&#12377;:</p>
<dl>
<dt>CONFIG</dt>
<dd>
<p>&#12371;&#12398;&#12494;&#12540;&#12489;&#12399;&#12289;&#12522;&#12514;&#12540;&#12488;&#36890;&#20449;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>DCOM</dt>
<dd>
<p>&#12371;&#12398;&#12494;&#12540;&#12489;&#12399;&#12289;&#20998;&#25955;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12539;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12539;&#12514;&#12487;&#12523;(DCOM)&#12522;&#12514;&#12540;&#12488;&#12539;&#12503;&#12525;&#12488;&#12467;&#12523;&#32076;&#30001;&#12398;&#36890;&#20449;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12414;&#12377;&#12290;DCOM&#12503;&#12525;&#12488;&#12467;&#12523;&#12399;&#12289;Windows&#12471;&#12473;&#12486;&#12512;&#12391;&#12398;&#12415;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</dd>
<dt>SSH</dt>
<dd>
<p>&#12371;&#12398;&#12494;&#12540;&#12489;&#12399;&#12289;Secure Shell(SSH)&#32076;&#30001;&#12398;&#36890;&#20449;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
</dd>
<dt>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;</dt>
<dd>
<p>&#12494;&#12540;&#12489;&#19978;&#12395;&#23384;&#22312;&#12377;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12522;&#12473;&#12488;&#12290;&#12371;&#12398;&#12522;&#12473;&#12488;&#12395;&#12399;&#12289;&#21508;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#23455;&#34892;&#20013;&#12398;&#22580;&#21512;&#12289;&#12481;&#12455;&#12483;&#12463;&#12510;&#12540;&#12463;(&#10003;)&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20572;&#27490;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#24863;&#22022;&#31526;(<code>!</code>)&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
</ul>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#21517;&#21069;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12300;&#19968;&#33324;&#24773;&#22577;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12450;&#12463;&#12471;&#12519;&#12531;</dt>
<dd>
<p>&#12479;&#12452;&#12503;&#12364;DCOM&#12362;&#12424;&#12403;SSH&#12398;&#12494;&#12540;&#12489;&#12398;&#12415;: &#12494;&#12540;&#12489;&#12395;&#23550;&#12377;&#12427;Ping&#12450;&#12463;&#12471;&#12519;&#12531;&#12408;&#12398;&#12522;&#12531;&#12463;&#12290;&#12300;Ping&#12301;&#12522;&#12531;&#12463;&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#12494;&#12540;&#12489;&#12391;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12427;&#36890;&#20449;&#12503;&#12525;&#12488;&#12467;&#12523;&#12434;&#20171;&#12375;&#12390;&#12494;&#12540;&#12489;&#12395;&#21040;&#36948;&#21487;&#33021;&#12363;&#12393;&#12358;&#12363;&#12364;&#12486;&#12473;&#12488;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<p>CONFIG&#12494;&#12540;&#12489;&#12395;&#23550;&#12375;&#12390;&#12399;&#12289;&#12450;&#12463;&#12471;&#12519;&#12531;&#12399;&#23455;&#34892;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
</dl>
<p>&#12300;&#12494;&#12540;&#12489;&#12301;&#12398;&#34920;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12418;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#26032;&#35215;</dt>
<dd>
<p>&#12494;&#12540;&#12489;&#12434;&#20316;&#25104;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
<dt>&#21066;&#38500;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12494;&#12540;&#12489;&#12434;&#21066;&#38500;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
<dt>&#21066;&#38500;&#12392;&#12450;&#12531;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12494;&#12540;&#12489;&#12434;&#21066;&#38500;&#12375;&#12289;&#21066;&#38500;&#12373;&#12428;&#12383;&#21508;&#12494;&#12540;&#12489;&#12364;&#34920;&#12377;&#12507;&#12473;&#12488;&#12363;&#12425;GlassFish Server&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12450;&#12531;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
&#12300;CONFIG&#12301;&#12479;&#12452;&#12503;&#12398;&#12494;&#12540;&#12489;&#12364;&#34920;&#12377;&#12507;&#12473;&#12488;&#12363;&#12425;GlassFish Server&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#12450;&#12531;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12300;CONFIG&#12301;&#12479;&#12452;&#12503;&#12398;&#12494;&#12540;&#12489;&#12398;&#22580;&#21512;&#12289;&#12371;&#12398;&#12508;&#12479;&#12531;&#12398;&#12450;&#12463;&#12471;&#12519;&#12531;&#12399;&#12300;&#21066;&#38500;&#12301;&#12508;&#12479;&#12531;&#12398;&#12450;&#12463;&#12471;&#12519;&#12531;&#12392;&#21516;&#12376;&#12391;&#12377;&#12290;
<hr>

</dd>
</dl>
<a id="sthref305" name="sthref305"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-createnode.html">&#12494;&#12540;&#12489;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-deletenode.html">&#12494;&#12540;&#12489;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-listnodes.html">&#29694;&#22312;&#12398;&#12489;&#12513;&#12452;&#12531;&#20869;&#12395;&#12354;&#12427;&#12377;&#12409;&#12390;&#12398;&#12494;&#12540;&#12489;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-editnode.html">&#12494;&#12540;&#12489;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-pingnode.html">&#12494;&#12540;&#12489;&#12395;&#21040;&#36948;&#21487;&#33021;&#12363;&#12393;&#12358;&#12363;&#12434;&#12486;&#12473;&#12488;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref306" name="sthref306"></a>
<h5>&#21516;&#31561;&#12398;asadmin&#12469;&#12502;&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00047"><code>create-node-config</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM510"><code>create-node-dcom</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00048"><code>create-node-ssh</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00099"><code>delete-node-config</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM569"><code>delete-node-dcom</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00100"><code>delete-node-ssh</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00187"><code>list-nodes</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM728"><code>ping-node-dcom</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00215"><code>ping-node-ssh</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
