<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-createnode" name="task-createnode"></a><a id="GHCLU00081" name="GHCLU00081"></a></p>

<h4><a id="sthref224" name="sthref224"></a>&#12494;&#12540;&#12489;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12494;&#12540;&#12489;&#12399;GlassFish Server&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12383;&#12507;&#12473;&#12488;&#12434;&#34920;&#12375;&#12414;&#12377;&#12290;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#23384;&#22312;&#12377;&#12427;&#12377;&#12409;&#12390;&#12398;&#12507;&#12473;&#12488;&#12395;&#12388;&#12356;&#12390;&#12494;&#12540;&#12489;&#12434;&#20316;&#25104;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#12494;&#12540;&#12489;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12494;&#12540;&#12489;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12494;&#12540;&#12489;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;&#26032;&#35215;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26032;&#35215;&#12494;&#12540;&#12489;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12494;&#12540;&#12489;&#12398;&#21517;&#21069;&#12392;&#12375;&#12390;&#36984;&#25246;&#12375;&#12383;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12479;&#12452;&#12503;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12391;&#12289;&#20316;&#25104;&#12377;&#12427;&#12494;&#12540;&#12489;&#12398;&#12479;&#12452;&#12503;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#20998;&#25955;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12539;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12539;&#12514;&#12487;&#12523;(DCOM)&#12522;&#12514;&#12540;&#12488;&#12539;&#12503;&#12525;&#12488;&#12467;&#12523;&#32076;&#30001;&#12398;&#36890;&#20449;&#12434;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427;&#12424;&#12358;&#12395;&#12494;&#12540;&#12489;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;DCOM&#12301;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>Secure Shell(SSH)&#32076;&#30001;&#12398;&#36890;&#20449;&#12434;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427;&#12494;&#12540;&#12489;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;SSH&#12301;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12522;&#12514;&#12540;&#12488;&#36890;&#20449;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12394;&#12356;&#12494;&#12540;&#12489;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;CONFIG&#12301;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#12494;&#12540;&#12489;&#12539;&#12507;&#12473;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12494;&#12540;&#12489;&#12364;&#34920;&#12377;&#12507;&#12473;&#12488;&#12398;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#12289;&#29305;&#23450;&#12398;&#12494;&#12540;&#12489;&#12398;&#12479;&#12452;&#12503;&#12398;&#22580;&#21512;&#12395;&#24517;&#38920;&#12501;&#12451;&#12540;&#12523;&#12489;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#12494;&#12540;&#12489;&#12398;&#12479;&#12452;&#12503;&#12364;CONFIG&#12398;&#22580;&#21512;&#12399;&#12289;&#12507;&#12473;&#12488;&#21517;&#12399;&#30465;&#30053;&#21487;&#33021;&#12391;&#12377;&#12290;&#12507;&#12473;&#12488;&#21517;&#12399;&#12289;&#12494;&#12540;&#12489;&#19978;&#12395;&#23384;&#22312;&#12377;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20316;&#25104;&#12373;&#12428;&#12427;&#38555;&#12395;&#29305;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12494;&#12540;&#12489;&#12398;&#12479;&#12452;&#12503;&#12364;DCOM&#12414;&#12383;&#12399;SSH&#12398;&#22580;&#21512;&#12399;&#12289;&#12507;&#12473;&#12488;&#21517;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12381;&#12428;&#20197;&#22806;&#12398;&#22580;&#21512;&#12399;&#12456;&#12521;&#12540;&#12364;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#12494;&#12540;&#12489;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12494;&#12540;&#12489;&#19978;&#12391;&#20316;&#25104;&#12373;&#12428;&#12383;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#21547;&#12417;&#12427;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12398;&#12497;&#12473;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12494;&#12540;&#12489;&#12398;&#12479;&#12452;&#12503;&#12364;CONFIG&#12398;&#22580;&#21512;&#12399;&#12289;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#31354;&#12398;&#12414;&#12414;&#12395;&#12375;&#12414;&#12377;&#12290;&#12494;&#12540;&#12489;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12399;&#12289;&#12494;&#12540;&#12489;&#19978;&#12395;&#23384;&#22312;&#12377;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20316;&#25104;&#12373;&#12428;&#12427;&#38555;&#12395;&#29305;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<p>&#30456;&#23550;&#12497;&#12473;&#12434;&#20837;&#21147;&#12377;&#12427;&#12392;&#12289;&#12497;&#12473;&#12399;as-install&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#30456;&#23550;&#30340;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;as-install&#12399;&#12507;&#12473;&#12488;&#19978;&#12398;GlassFish Server&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12505;&#12540;&#12473;&#12539;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12507;&#12473;&#12488;&#19978;&#12398;GlassFish Server&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12398;&#12505;&#12540;&#12473;&#12539;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12398;<i>&#35242;</i>&#12398;&#12501;&#12523;&#12497;&#12473;(&#20363;: <code>/export/glassfish3</code>)&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12494;&#12540;&#12489;&#12398;&#12479;&#12452;&#12503;&#12364;CONFIG&#12398;&#22580;&#21512;&#12399;&#12289;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#31354;&#12398;&#12414;&#12414;&#12395;&#12375;&#12414;&#12377;&#12290;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12399;&#12289;&#12494;&#12540;&#12489;&#19978;&#12395;&#23384;&#22312;&#12377;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20316;&#25104;&#12373;&#12428;&#12427;&#38555;&#12395;&#29305;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12494;&#12540;&#12489;&#12398;&#12479;&#12452;&#12503;&#12372;&#12392;&#12395;&#24517;&#35201;&#12394;&#12494;&#12540;&#12489;&#12398;&#20316;&#25104;&#12434;&#32066;&#20102;&#12375;&#12414;&#12377;&#12290;</p>
<ol type="a">
<li>
<p>&#12494;&#12540;&#12489;&#12398;&#12479;&#12452;&#12503;&#12364;&#12300;CONFIG&#12301;&#12398;&#22580;&#21512;&#12399;&#12289;&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12494;&#12540;&#12489;&#12398;&#12479;&#12452;&#12503;&#12364;&#12300;DCOM&#12301;&#12398;&#22580;&#21512;&#12399;&#12289;<a href="task-nodenewdcom.html">DCOM&#12494;&#12540;&#12489;&#12398;&#20316;&#25104;&#12434;&#32066;&#20102;&#12377;&#12427;&#12395;&#12399;</a>&#12398;&#25163;&#38918;&#12395;&#24467;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12494;&#12540;&#12489;&#12398;&#12479;&#12452;&#12503;&#12364;&#12300;SSH&#12301;&#12398;&#22580;&#21512;&#12399;&#12289;<a href="task-nodenewssh.html">SSH&#12494;&#12540;&#12489;&#12398;&#20316;&#25104;&#12434;&#32066;&#20102;&#12377;&#12427;&#12395;&#12399;</a>&#12398;&#25163;&#38918;&#12395;&#24467;&#12356;&#12414;&#12377;&#12290;</p>
</li>
</ol>
</li>
</ol>
<a id="sthref225" name="sthref225"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-nodenewdcom.html">DCOM&#12494;&#12540;&#12489;&#12398;&#20316;&#25104;&#12434;&#32066;&#20102;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-nodenewssh.html">SSH&#12494;&#12540;&#12489;&#12398;&#20316;&#25104;&#12434;&#32066;&#20102;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-deletenode.html">&#12494;&#12540;&#12489;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-listnodes.html">&#29694;&#22312;&#12398;&#12489;&#12513;&#12452;&#12531;&#20869;&#12395;&#12354;&#12427;&#12377;&#12409;&#12390;&#12398;&#12494;&#12540;&#12489;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-pingnode.html">&#12494;&#12540;&#12489;&#12395;&#21040;&#36948;&#21487;&#33021;&#12363;&#12393;&#12358;&#12363;&#12434;&#12486;&#12473;&#12488;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-editnode.html">&#12494;&#12540;&#12489;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
