<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-upgrade-components" name="task-upgrade-components"></a></p>

<h4><a id="sthref62" name="sthref62"></a><a id="sthref63" name="sthref63"></a><a id="sthref64" name="sthref64"></a><a id="sthref65" name="sthref65"></a>&#12469;&#12540;&#12499;&#12473;&#12434;&#22833;&#12358;&#12371;&#12392;&#12394;&#12367;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;&#29872;&#22659;&#12391;&#12399;&#12289;&#12525;&#12540;&#12522;&#12531;&#12464;&#12539;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12395;&#12424;&#12426;&#12289;&#12469;&#12540;&#12499;&#12473;&#12392;&#12475;&#12483;&#12471;&#12519;&#12531;&#12398;&#25613;&#22833;&#12434;&#26368;&#23567;&#38480;&#12395;&#25233;&#12360;&#12390;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#20877;&#12487;&#12503;&#12525;&#12452;&#12391;&#12365;&#12414;&#12377;&#12290;&#12475;&#12483;&#12471;&#12519;&#12531;&#12399;&#12289;&#27425;&#12398;&#12424;&#12358;&#12394;&#12524;&#12503;&#12522;&#12465;&#12540;&#12488;&#21487;&#33021;&#12394;&#12450;&#12540;&#12486;&#12451;&#12501;&#12449;&#12463;&#12488;&#12391;&#12377;:</p>
<ul>
<li>
<p><code>HttpSession</code></p>
</li>
<li>
<p><code>SingleSignOn</code></p>
</li>
<li>
<p><code>ServletTimer</code></p>
</li>
<li>
<p><code>DialogFragment</code></p>
</li>
<li>
<p>&#12473;&#12486;&#12540;&#12488;&#12501;&#12523;&#12539;&#12475;&#12483;&#12471;&#12519;&#12531;Bean</p>
</li>
</ul>
<p>&#12525;&#12540;&#12489;&#12539;&#12496;&#12521;&#12531;&#12469;&#12392;&#35079;&#25968;&#12398;&#12463;&#12521;&#12473;&#12479;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12469;&#12540;&#12499;&#12473;&#12434;&#20572;&#27490;&#12377;&#12427;&#12371;&#12392;&#12394;&#12367;&#12289;GlassFish Server&#20869;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12391;&#12365;&#12414;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12392;&#12375;&#12390;&#12289;JVM&#12510;&#12471;&#12531;&#12289;GlassFish Server&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12289;&#12414;&#12383;&#12399;Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#21487;&#33021;&#12391;&#12377;&#12290;</p>
<p>&#12525;&#12540;&#12522;&#12531;&#12464;&#12539;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12399;&#12289;&#36605;&#24230;&#12363;&#12425;&#20013;&#24230;&#12398;&#12525;&#12540;&#12489;&#12391;&#34892;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#25163;&#38918;&#12398;&#23455;&#34892;&#12395;&#12399;&#12289;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12372;&#12392;&#12395;10&#20998;&#12363;&#12425;15&#20998;&#12363;&#12363;&#12426;&#12414;&#12377;&#12290;</p>
<p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#38291;&#12391;&#20114;&#25563;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#21476;&#12356;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#23455;&#34892;&#12375;&#12390;&#12356;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#12289;&#26032;&#12375;&#12356;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#23455;&#34892;&#12375;&#12390;&#12356;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#12354;&#12427;&#22580;&#21512;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#36983;&#31227;&#20013;&#12395;&#27491;&#12375;&#12367;&#27231;&#33021;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#21476;&#12356;&#12496;&#12540;&#12472;&#12519;&#12531;&#12392;&#26032;&#12375;&#12356;&#12496;&#12540;&#12472;&#12519;&#12531;&#12395;&#12399;&#12289;&#12475;&#12483;&#12471;&#12519;&#12531;&#12395;&#20445;&#23384;&#12373;&#12428;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12539;&#12464;&#12521;&#12501;&#12434;&#27083;&#25104;&#12377;&#12427;&#21516;&#12376;&#24418;&#29366;&#12398;&#12471;&#12522;&#12450;&#12521;&#12452;&#12474;&#21487;&#33021;&#12394;&#12463;&#12521;&#12473;(&#38750;&#31227;&#34892;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#22793;&#25968;&#12394;&#12393;)&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#12463;&#12521;&#12473;&#12398;&#24418;&#29366;&#12434;&#22793;&#26356;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#22580;&#21512;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#38283;&#30330;&#32773;&#12399;&#12471;&#12522;&#12450;&#12523;&#21270;&#12398;&#21205;&#20316;&#12364;&#27491;&#12375;&#12367;&#34892;&#12431;&#12428;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#38291;&#12391;&#12398;&#20114;&#25563;&#24615;&#12364;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#23436;&#20840;&#12394;&#20877;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12398;&#12383;&#12417;&#12395;&#12463;&#12521;&#12473;&#12479;&#12434;&#20572;&#27490;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12391;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12473;&#12461;&#12540;&#12510;&#12434;&#22793;&#26356;&#12377;&#12427;&#22580;&#21512;&#12289;&#12371;&#12398;&#26041;&#27861;&#12399;&#23455;&#34892;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
&#12475;&#12483;&#12471;&#12519;&#12531;&#12398;&#20966;&#29702;&#12434;&#32153;&#32154;&#12377;&#12427;&#12392;&#12365;&#12395;&#12496;&#12540;&#12472;&#12519;&#12531;&#19981;&#19968;&#33268;&#12398;&#12522;&#12473;&#12463;&#12434;&#22238;&#36991;&#12377;&#12427;&#12395;&#12399;&#12289;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#12377;&#12409;&#12390;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#21516;&#26178;&#12395;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12424;&#12358;&#12395;&#12375;&#12394;&#12356;&#22580;&#21512;&#12289;&#12475;&#12483;&#12471;&#12519;&#12531;&#12399;&#21029;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12364;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#20966;&#29702;&#12364;&#32153;&#32154;&#12373;&#12428;&#12414;&#12377;&#12290;<br />
<hr>

<p>&#21508;&#12463;&#12521;&#12473;&#12479;&#12391;&#20491;&#21029;&#12395;&#12371;&#12398;&#12479;&#12473;&#12463;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;&#12463;&#12521;&#12473;&#12479;&#12399;&#12289;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#23550;&#12377;&#12427;&#12475;&#12483;&#12471;&#12519;&#12531;&#12539;&#12501;&#12455;&#12452;&#12523;&#12458;&#12540;&#12496;&#12540;&#12398;&#23433;&#20840;&#12394;&#22659;&#30028;&#12392;&#12375;&#12390;&#27231;&#33021;&#12375;&#12414;&#12377;&#12290;1&#12388;&#12398;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12399;&#12289;&#21029;&#12398;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12391;&#20966;&#29702;&#12434;&#32153;&#32154;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12375;&#12383;&#12364;&#12387;&#12390;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531;&#19981;&#19968;&#33268;&#12398;&#12522;&#12473;&#12463;&#12399;&#22238;&#36991;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<ol>
<li>
<p>&#12463;&#12521;&#12473;&#12479;&#12434;&#20572;&#27490;&#12375;&#12414;&#12377;&#12290;</p>
<p><a href="task-stop-cluster.html">&#12463;&#12521;&#12473;&#12479;&#12434;&#20572;&#27490;&#12377;&#12427;&#12395;&#12399;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
<li>
<p>&#12381;&#12398;&#12463;&#12521;&#12473;&#12479;&#12391;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12463;&#12521;&#12473;&#12479;&#12434;&#36215;&#21205;&#12375;&#12414;&#12377;&#12290;</p>
<p><a href="task-start-cluster.html">&#12463;&#12521;&#12473;&#12479;&#12434;&#36215;&#21205;&#12377;&#12427;&#12395;&#12399;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
</ol>
<a id="sthref66" name="sthref66"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-create-cluster.html">&#12463;&#12521;&#12473;&#12479;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-delete-cluster.html">&#12463;&#12521;&#12473;&#12479;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-availabilityservice.html">&#12463;&#12521;&#12473;&#12479;&#12398;&#21487;&#29992;&#24615;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-start-cluster.html">&#12463;&#12521;&#12473;&#12479;&#12434;&#36215;&#21205;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-stop-cluster.html">&#12463;&#12521;&#12473;&#12479;&#12434;&#20572;&#27490;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-modify-cluster-config.html">&#12463;&#12521;&#12473;&#12479;&#12398;&#27083;&#25104;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-app-deploy.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12463;&#12521;&#12473;&#12479;&#12395;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-app-list.html">&#12463;&#12521;&#12473;&#12479;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12390;&#12356;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-app-undeploy.html">&#12463;&#12521;&#12473;&#12479;&#12363;&#12425;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12450;&#12531;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-app-remove.html">&#12463;&#12521;&#12473;&#12479;&#12363;&#12425;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#38500;&#21435;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-app-edit.html">&#12463;&#12521;&#12473;&#12479;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-app-enable-disable.html">&#12463;&#12521;&#12473;&#12479;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12414;&#12383;&#12399;&#28961;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-app-lb-enable-disable.html">&#12463;&#12521;&#12473;&#12479;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12525;&#12540;&#12489;&#12539;&#12496;&#12521;&#12531;&#12471;&#12531;&#12464;&#12434;&#26377;&#21177;&#12414;&#12383;&#12399;&#28961;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-create.html">&#12463;&#12521;&#12473;&#12479;&#12398;&#12522;&#12477;&#12540;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-display.html">&#12463;&#12521;&#12473;&#12479;&#12398;&#12522;&#12477;&#12540;&#12473;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-enable-disable.html">&#12522;&#12477;&#12540;&#12473;&#12434;&#12464;&#12525;&#12540;&#12496;&#12523;&#12395;&#26377;&#21177;&#12414;&#12383;&#12399;&#28961;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-edit.html">&#12463;&#12521;&#12473;&#12479;&#12398;&#12522;&#12477;&#12540;&#12473;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
