<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-config-sys-properties-defaults" name="task-config-sys-properties-defaults"></a><a id="GHCLU00086" name="GHCLU00086"></a></p>

<h4>&#27083;&#25104;&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#27083;&#25104;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12289;&#12463;&#12521;&#12473;&#12479;&#12414;&#12383;&#12399;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#21442;&#29031;&#12377;&#12427;&#27083;&#25104;&#12391;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290;</p>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#27083;&#25104;&#12398;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#23637;&#38283;&#12375;&#12383;&#12494;&#12540;&#12489;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12539;&#12479;&#12452;&#12503;&#12398;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#12300;&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#36984;&#25246;&#12375;&#12383;&#27083;&#25104;&#12398;&#12300;&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12395;&#31034;&#12377;&#27083;&#25104;&#12398;&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#29694;&#22312;&#12398;&#20516;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p><a href="../../../common/en/help/ref-predefinedconfigsysproperties.html">&#27083;&#25104;&#12398;&#20316;&#25104;&#26178;&#12395;&#23450;&#32681;&#12373;&#12428;&#12383;&#12509;&#12540;&#12488;&#30058;&#21495;</a></p>
</li>
<li>
<p>&#27083;&#25104;&#12395;&#36861;&#21152;&#12373;&#12428;&#12383;&#12459;&#12473;&#12479;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;(&#23384;&#22312;&#12377;&#12427;&#22580;&#21512;)</p>
</li>
</ul>
</li>
<li>
<p>&#12463;&#12521;&#12473;&#12479;&#12414;&#12383;&#12399;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20877;&#36215;&#21205;&#12375;&#12394;&#12356;&#12391;&#22793;&#26356;&#12434;&#36969;&#29992;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#21205;&#30340;&#20877;&#27083;&#25104;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12434;&#35373;&#23450;&#12377;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12372;&#12392;&#12395;&#12289;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#26032;&#12375;&#12356;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#24517;&#35201;&#12394;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<ol type="a">
<li>
<p>&#12300;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#34920;&#12391;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#36861;&#21152;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12398;&#34920;&#12395;&#34892;&#12364;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#22793;&#25968;&#21517;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#21517;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref243" name="sthref243"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-change-clustered-instance-ports.html">&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12509;&#12540;&#12488;&#30058;&#21495;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-change-standalone-instance-ports.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12509;&#12540;&#12488;&#30058;&#21495;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
