<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-gmscluster" name="task-gmscluster"></a></p>

<h4><a id="sthref220" name="sthref220"></a>&#12463;&#12521;&#12473;&#12479;&#12398;&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;(GMS)&#12399;&#12289;&#12463;&#12521;&#12473;&#12479;&#12398;&#12514;&#12491;&#12479;&#12540;&#12289;&#12463;&#12521;&#12473;&#12479;&#12398;&#12513;&#12531;&#12496;&#12540;&#12471;&#12483;&#12503;&#12289;&#12362;&#12424;&#12403;&#12464;&#12523;&#12540;&#12503;&#36890;&#20449;&#12398;&#21508;&#12469;&#12540;&#12499;&#12473;&#12434;&#25552;&#20379;&#12377;&#12427;&#12452;&#12531;&#12503;&#12525;&#12475;&#12473;&#12539;&#12469;&#12540;&#12499;&#12473;&#12391;&#12377;&#12290;GMS&#12399;&#27425;&#12398;&#27231;&#33021;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12513;&#12531;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#12463;&#12521;&#12473;&#12479;&#12395;&#36861;&#21152;&#12373;&#12428;&#12427;&#12363;&#12289;&#12463;&#12521;&#12473;&#12479;&#12363;&#12425;&#38500;&#21435;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;&#12354;&#12427;&#12356;&#12399;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12513;&#12531;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#38556;&#23475;&#12364;&#30330;&#29983;&#12375;&#12383;&#30097;&#12356;&#12364;&#29983;&#12376;&#12383;&#12363;&#12289;&#38556;&#23475;&#12364;&#30330;&#29983;&#12375;&#12383;&#12371;&#12392;&#12364;&#30906;&#35469;&#12373;&#12428;&#12383;&#22580;&#21512;&#12395;&#12289;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#30331;&#37682;&#28168;&#12514;&#12472;&#12517;&#12540;&#12523;&#12395;&#36890;&#30693;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12463;&#12521;&#12473;&#12479;&#12539;&#12513;&#12531;&#12496;&#12540;&#38291;&#12391;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#36865;&#21463;&#20449;&#12377;&#12427;&#27231;&#33021;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#12463;&#12521;&#12473;&#12479;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;(GMS)&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12463;&#12521;&#12473;&#12479;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12463;&#12521;&#12473;&#12479;&#12398;&#12300;&#19968;&#33324;&#24773;&#22577;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;GMS&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#12463;&#12521;&#12473;&#12479;&#12395;&#23550;&#12375;&#12390;GMS&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12463;&#12521;&#12473;&#12479;&#12395;&#23550;&#12375;&#12390;GMS&#12434;&#28961;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;GMS&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12398;&#36984;&#25246;&#12434;&#35299;&#38500;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#26377;&#21177;&#12395;&#12377;&#12427;&#12392;&#12289;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#21508;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#12489;&#12513;&#12452;&#12531;&#31649;&#29702;&#12469;&#12540;&#12496;&#12540;(DAS)&#12391;&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;&#12364;&#38283;&#22987;&#12373;&#12428;&#12414;&#12377;&#12290;DAS&#12399;&#12289;GMS&#12364;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#21508;&#12463;&#12521;&#12473;&#12479;&#12395;&#21442;&#21152;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12510;&#12523;&#12481;&#12461;&#12515;&#12473;&#12488;&#12539;&#12509;&#12540;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;&#12364;&#12464;&#12523;&#12540;&#12503;&#12539;&#12452;&#12505;&#12531;&#12488;&#12398;&#12522;&#12473;&#12491;&#12531;&#12464;&#12395;&#20351;&#29992;&#12377;&#12427;&#12509;&#12540;&#12488;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>2048&#12363;&#12425;49151&#12398;&#31684;&#22258;&#12391;&#27161;&#28310;&#12398;UDP&#12509;&#12540;&#12488;&#30058;&#21495;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;&#12289;&#12371;&#12398;&#31684;&#22258;&#12363;&#12425;&#33258;&#21205;&#30340;&#12395;&#20316;&#25104;&#12373;&#12428;&#12383;&#20516;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12510;&#12523;&#12481;&#12461;&#12515;&#12473;&#12488;&#12539;&#12450;&#12489;&#12524;&#12473;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;&#12364;&#12464;&#12523;&#12540;&#12503;&#12539;&#12452;&#12505;&#12531;&#12488;&#12398;&#12522;&#12473;&#12491;&#12531;&#12464;&#12395;&#20351;&#29992;&#12377;&#12427;&#12450;&#12489;&#12524;&#12473;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12463;&#12521;&#12473;D IP&#12510;&#12523;&#12481;&#12461;&#12515;&#12473;&#12488;&#12539;&#12450;&#12489;&#12524;&#12473;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12463;&#12521;&#12473;D IP&#12450;&#12489;&#12524;&#12473;&#12398;&#31684;&#22258;&#12399;&#12289;<code>239.255.255.255</code>&#12363;&#12425;<code>224.0.0.0</code>&#12414;&#12391;&#12391;&#12377;&#12290;&#12450;&#12489;&#12524;&#12473;<code>224.0.0.0</code>&#12399;&#20104;&#32004;&#28168;&#12398;&#12383;&#12417;&#20351;&#29992;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;228.9<i>XX</i>. <i>YY</i>&#12391;&#12377;&#12290;<i>XX</i>&#12392;<i>YY</i>&#12399;&#12289;&#33258;&#21205;&#30340;&#12395;&#29983;&#25104;&#12373;&#12428;&#12427;0&#12363;&#12425;255&#12398;&#38291;&#12398;&#29420;&#31435;&#12375;&#12383;&#20516;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12364;&#35079;&#25968;&#12354;&#12427;&#22580;&#21512;&#12289;&#12300;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12539;&#12450;&#12489;&#12524;&#12473;&#12398;&#12496;&#12452;&#12531;&#12489;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;&#12398;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12398;&#12450;&#12489;&#12524;&#12473;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#35373;&#23450;&#12391;&#12399;&#12289;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#12507;&#12473;&#12488;&#12375;&#12390;&#12356;&#12427;&#12510;&#12471;&#12531;&#12398;&#12356;&#12378;&#12428;&#12363;&#12395;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12364;&#35079;&#25968;&#12354;&#12427;&#22580;&#21512;&#12289;GMS&#12395;&#20351;&#29992;&#12377;&#12427;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12434;&#27083;&#25104;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#20516;&#12399;&#12289;&#12525;&#12540;&#12459;&#12523;&#12539;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12398;IP&#12450;&#12489;&#12524;&#12473;&#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#12497;&#12502;&#12522;&#12483;&#12463;&#12539;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12398;&#12450;&#12489;&#12524;&#12473;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<p>&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#12377;&#12409;&#12390;&#12398;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#23550;&#12375;&#12390;&#26377;&#21177;&#12394;&#12450;&#12489;&#12524;&#12473;&#12434;&#25351;&#23450;&#12377;&#12427;&#12395;&#12399;&#12289;&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20351;&#29992;&#12375;&#12390;&#12381;&#12398;&#12450;&#12489;&#12524;&#12473;&#12434;&#21508;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#20491;&#21029;&#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12383;&#12392;&#12360;&#12400;&#12289;DAS&#12391;<code>GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i>&#12392;&#12356;&#12358;&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;&#27425;&#12395;&#12289;&#12371;&#12398;&#12300;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12539;&#12450;&#12489;&#12524;&#12473;&#12398;&#12496;&#12452;&#12531;&#12489;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;<code>${GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i><code>}</code>&#12395;&#35373;&#23450;&#12375;&#12390;&#12381;&#12398;&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#26368;&#24460;&#12395;&#12289;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#21508;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12388;&#12356;&#12390;&#12289;<code>GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i>&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#12381;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12510;&#12471;&#12531;&#12391;&#24517;&#35201;&#12394;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12398;&#12450;&#12489;&#12524;&#12473;&#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#36861;&#21152;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12479;&#12502;&#12392;&#12300;&#12463;&#12521;&#12473;&#12479;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12469;&#12502;&#12479;&#12502;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#34920;&#31034;&#12373;&#12428;&#12427;&#31354;&#30333;&#34892;&#12391;&#12289;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#21517;&#12434;&#20837;&#21147;&#12375;&#12289;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;&#12289;&#12381;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#32232;&#38598;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;&#12289;&#21066;&#38500;&#12377;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12398;&#24038;&#20596;&#12395;&#12354;&#12427;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21066;&#38500;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref221" name="sthref221"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-gmsenable.html">&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-gms.html">&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
