<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-gms" name="task-gms"></a></p>

<h4><a id="sthref222" name="sthref222"></a>&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;(GMS)&#12399;&#12289;&#12463;&#12521;&#12473;&#12479;&#12398;&#12514;&#12491;&#12479;&#12540;&#12289;&#12463;&#12521;&#12473;&#12479;&#12398;&#12513;&#12531;&#12496;&#12540;&#12471;&#12483;&#12503;&#12289;&#12362;&#12424;&#12403;&#12464;&#12523;&#12540;&#12503;&#36890;&#20449;&#12398;&#21508;&#12469;&#12540;&#12499;&#12473;&#12434;&#25552;&#20379;&#12377;&#12427;&#12452;&#12531;&#12503;&#12525;&#12475;&#12473;&#12539;&#12469;&#12540;&#12499;&#12473;&#12391;&#12377;&#12290;GMS&#12399;&#27425;&#12398;&#27231;&#33021;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12513;&#12531;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#12463;&#12521;&#12473;&#12479;&#12395;&#36861;&#21152;&#12373;&#12428;&#12427;&#12363;&#12289;&#12463;&#12521;&#12473;&#12479;&#12363;&#12425;&#38500;&#21435;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;&#12354;&#12427;&#12356;&#12399;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12513;&#12531;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#38556;&#23475;&#12364;&#30330;&#29983;&#12375;&#12383;&#30097;&#12356;&#12364;&#29983;&#12376;&#12383;&#12363;&#12289;&#38556;&#23475;&#12364;&#30330;&#29983;&#12375;&#12383;&#12371;&#12392;&#12364;&#30906;&#35469;&#12373;&#12428;&#12383;&#22580;&#21512;&#12395;&#12289;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#30331;&#37682;&#28168;&#12514;&#12472;&#12517;&#12540;&#12523;&#12395;&#36890;&#30693;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12463;&#12521;&#12473;&#12479;&#12539;&#12513;&#12531;&#12496;&#12540;&#38291;&#12391;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#36865;&#21463;&#20449;&#12377;&#12427;&#27231;&#33021;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#22793;&#26356;&#12377;&#12427;&#12463;&#12521;&#12473;&#12479;&#12398;&#27083;&#25104;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#27083;&#25104;&#12398;&#12494;&#12540;&#12489;&#12391;&#12289;&#12300;&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26368;&#22823;&#12495;&#12540;&#12488;&#12499;&#12540;&#12488;&#21930;&#22833;&#22238;&#25968;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#38556;&#23475;&#12398;&#30097;&#12356;&#12364;&#12354;&#12427;&#12371;&#12392;&#12434;GMS&#12364;&#30906;&#35469;&#12377;&#12427;&#12414;&#12391;&#12398;&#12513;&#12531;&#12496;&#12540;&#12398;&#26368;&#22823;&#12495;&#12540;&#12488;&#12499;&#12540;&#12488;&#21930;&#22833;&#22238;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;3&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12495;&#12540;&#12488;&#12499;&#12540;&#12488;&#12398;&#38971;&#24230;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12464;&#12523;&#12540;&#12503;&#12539;&#12513;&#12531;&#12496;&#12540;&#12398;&#12495;&#12540;&#12488;&#12499;&#12540;&#12488;&#12398;&#36899;&#32154;&#12375;&#12383;&#12502;&#12525;&#12540;&#12489;&#12461;&#12515;&#12473;&#12488;&#38291;&#38548;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;2000&#12511;&#12522;&#31186;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12464;&#12523;&#12540;&#12503;&#26908;&#20986;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;GMS&#12364;&#20182;&#12398;&#12463;&#12521;&#12473;&#12479;&#12539;&#12513;&#12531;&#12496;&#12540;&#12398;&#26908;&#20986;&#12434;&#24453;&#27231;&#12377;&#12427;&#26178;&#38291;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;5000&#12511;&#12522;&#31186;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#38556;&#23475;&#26908;&#35388;&#24453;&#27231;&#26178;&#38291;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#38556;&#23475;&#30330;&#29983;&#12398;&#30097;&#12356;&#12398;&#12354;&#12427;&#12513;&#12531;&#12496;&#12540;&#12434;&#38556;&#23475;&#30330;&#29983;&#12513;&#12531;&#12496;&#12540;&#12392;&#12375;&#12390;&#22577;&#21578;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#30906;&#35469;&#12377;&#12427;&#21069;&#12395;&#24453;&#27231;&#12377;&#12427;&#26178;&#38291;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;1500&#12511;&#12522;&#31186;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12395;&#25147;&#12377;&#12395;&#12399;&#12289;&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12489;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#12289;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#34920;&#31034;&#12373;&#12428;&#12427;&#31354;&#30333;&#34892;&#12391;&#12289;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#21517;&#12434;&#20837;&#21147;&#12375;&#12289;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;&#12289;&#12381;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#32232;&#38598;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;&#12289;&#21066;&#38500;&#12377;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12398;&#24038;&#20596;&#12395;&#12354;&#12427;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21066;&#38500;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref223" name="sthref223"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-gmsenable.html">&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-gmscluster.html">&#12463;&#12521;&#12473;&#12479;&#12398;&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
