<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-change-clustered-instance-ports" name="task-change-clustered-instance-ports"></a></p>

<h4><a id="sthref95" name="sthref95"></a><a id="sthref96" name="sthref96"></a><a id="sthref97" name="sthref97"></a>&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12509;&#12540;&#12488;&#30058;&#21495;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12509;&#12540;&#12488;&#30058;&#21495;&#12399;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#12381;&#12398;&#35242;&#12463;&#12521;&#12473;&#12479;&#12363;&#12425;&#32153;&#25215;&#12377;&#12427;&#27083;&#25104;&#12391;&#21021;&#26399;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;2&#12388;&#12398;&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#21516;&#12376;&#12507;&#12473;&#12488;&#19978;&#12395;&#23384;&#22312;&#12377;&#12427;&#22580;&#21512;&#12394;&#12393;&#12399;&#12289;&#12371;&#12428;&#12425;&#12398;&#12509;&#12540;&#12488;&#30058;&#21495;&#12434;&#22793;&#26356;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12424;&#12358;&#12394;&#29366;&#27841;&#12391;&#12399;&#12289;&#20001;&#26041;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#21516;&#12376;&#27083;&#25104;&#12434;&#20849;&#26377;&#12377;&#12427;&#12383;&#12417;&#12289;&#19968;&#26041;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12509;&#12540;&#12488;&#30058;&#21495;&#12434;&#22793;&#26356;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12509;&#12540;&#12488;&#30058;&#21495;&#12399;&#12289;Java&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12392;&#12375;&#12390;&#20445;&#23384;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;GlassFish Server&#12398;&#36215;&#21205;&#26178;&#12395;Java&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12521;&#12531;&#12481;&#12515;&#12398;<code>-D</code>&#12458;&#12503;&#12471;&#12519;&#12531;&#12395;&#12424;&#12387;&#12390;&#12289;Java&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12521;&#12531;&#12481;&#12515;&#12395;&#28193;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#12463;&#12521;&#12473;&#12479;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#23637;&#38283;&#12375;&#12383;&#12300;&#12463;&#12521;&#12473;&#12479;&#12301;&#12494;&#12540;&#12489;&#12391;&#12289;&#12463;&#12521;&#12473;&#12479;&#12398;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12463;&#12521;&#12473;&#12479;&#12398;&#12300;&#19968;&#33324;&#24773;&#22577;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#19968;&#33324;&#24773;&#22577;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12301;&#12479;&#12502;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12463;&#12521;&#12473;&#12479;&#12398;&#12300;&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12509;&#12540;&#12488;&#30058;&#21495;&#12434;&#22793;&#26356;&#12377;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12300;&#19968;&#33324;&#24773;&#22577;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#19968;&#33324;&#24773;&#22577;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12479;&#12502;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12539;&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#27425;&#12398;&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#29694;&#22312;&#12398;&#20516;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p><a href="../../../common/en/help/ref-predefinedconfigsysproperties.html">&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#27083;&#25104;&#12391;&#23450;&#32681;&#12373;&#12428;&#12383;&#12509;&#12540;&#12488;&#30058;&#21495;</a></p>
</li>
<li>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#23550;&#12375;&#12390;&#23450;&#32681;&#12373;&#12428;&#12390;&#12356;&#12427;&#12459;&#12473;&#12479;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;(&#23384;&#22312;&#12377;&#12427;&#22580;&#21512;)</p>
</li>
</ul>
</li>
<li>
<p>&#22793;&#26356;&#12377;&#12427;&#26082;&#23384;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12372;&#12392;&#12395;&#12289;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#26032;&#12375;&#12356;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#24517;&#35201;&#12394;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<ol type="a">
<li>
<p>&#12300;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#34920;&#12391;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#36861;&#21152;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12398;&#34920;&#12395;&#34892;&#12364;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#22793;&#25968;&#21517;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#21517;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref98" name="sthref98"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-create-clustered-instance.html">GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#12463;&#12521;&#12473;&#12479;&#12395;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-delete-clustered-instances.html">&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-start-clustered-instances.html">&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36215;&#21205;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-stop-clustered-instances.html">&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20572;&#27490;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-view-logs-clustered-instance.html">&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-recovertransactions.html">&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#12522;&#12459;&#12496;&#12522;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-set-props-clustered-instance.html">&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;Instance-Only&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-mon-app-clustered-instance.html">&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-mon-server-clustered-instance.html">&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-mon-resource-clustered-instance.html">&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12522;&#12477;&#12540;&#12473;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
