<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-create-standalone-instance" name="task-create-standalone-instance"></a></p>

<h4><a id="sthref122" name="sthref122"></a><a id="sthref123" name="sthref123"></a><a id="sthref124" name="sthref124"></a>&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12398;&#22522;&#30990;&#12434;&#24418;&#25104;&#12375;&#12414;&#12377;&#12290;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#12463;&#12521;&#12473;&#12479;&#12398;&#12513;&#12531;&#12496;&#12540;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#21508;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;1&#12388;&#12398;&#12489;&#12513;&#12452;&#12531;&#12395;&#23646;&#12375;&#12289;&#12381;&#12428;&#12382;&#12428;&#12395;&#22266;&#26377;&#12398;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#27083;&#36896;&#12289;&#27083;&#25104;&#12289;&#12362;&#12424;&#12403;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;&#21508;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12399;Java Platform, Enterprise Edition (Java EE) Web&#12467;&#12531;&#12486;&#12490;&#12392;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;JavaBeans&#12486;&#12463;&#12494;&#12525;&#12472;(EJB&#12486;&#12463;&#12494;&#12525;&#12472;)&#12467;&#12531;&#12486;&#12490;&#12418;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;&#12377;&#12409;&#12390;&#12398;&#26032;&#35215;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#37197;&#32622;&#12373;&#12428;&#12427;&#12507;&#12473;&#12488;&#12434;&#23450;&#32681;&#12377;&#12427;&#12494;&#12540;&#12489;&#12408;&#12398;&#21442;&#29031;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
&#12522;&#12514;&#12540;&#12488;&#12539;&#12507;&#12473;&#12488;&#12434;&#34920;&#12377;&#12300;CONFIG&#12301;&#12479;&#12452;&#12503;&#12398;&#12494;&#12540;&#12489;&#12395;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00044"><code>create-local-instance</code>(1)</a>&#12469;&#12502;&#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#29992;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#30446;&#30340;&#12391;&#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
<hr>

<a id="sthref125" name="sthref125"></a>
<h5>&#38283;&#22987;&#21069;</h5>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#37197;&#32622;&#12373;&#12428;&#12427;&#12494;&#12540;&#12489;&#12364;&#23384;&#22312;&#12377;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12414;&#12377;&#12290;&#35443;&#32048;&#12399;&#12289;<a href="task-createnode.html">&#12494;&#12540;&#12489;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;&#26032;&#35215;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26032;&#35215;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#21517;&#21069;&#12399;&#27425;&#12398;&#35201;&#20214;&#12434;&#28288;&#12383;&#12377;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;:</p>
<ul>
<li>
<p>&#21517;&#21069;&#12395;&#12399;ASCII&#25991;&#23383;&#12398;&#12415;&#12434;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#21517;&#21069;&#12399;&#33521;&#25968;&#23383;&#12414;&#12383;&#12399;&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#12391;&#22987;&#12417;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#21517;&#21069;&#12395;&#21547;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12398;&#12399;&#27425;&#12398;&#25991;&#23383;&#12398;&#12415;&#12391;&#12377;:</p>
<ul>
<li>
<p>&#23567;&#25991;&#23383;</p>
</li>
<li>
<p>&#22823;&#25991;&#23383;</p>
</li>
<li>
<p>&#25968;&#20516;</p>
</li>
<li>
<p>&#12495;&#12452;&#12501;&#12531;</p>
</li>
<li>
<p>&#12500;&#12522;&#12458;&#12489;</p>
</li>
<li>
<p>&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;</p>
</li>
</ul>
</li>
<li>
<p>&#21517;&#21069;&#12399;&#12489;&#12513;&#12452;&#12531;&#20869;&#12391;&#19968;&#24847;&#12395;&#12375;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;&#21029;&#12398;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12289;&#12463;&#12521;&#12473;&#12479;&#12289;&#21517;&#21069;&#20184;&#12365;&#27083;&#25104;&#12289;&#12414;&#12383;&#12399;&#12494;&#12540;&#12489;&#12398;&#21517;&#21069;&#12395;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p><code>&#12489;&#12513;&#12452;&#12531;</code>&#12289;<code>&#12469;&#12540;&#12496;&#12540;</code>&#12289;&#12414;&#12383;&#12399;GlassFish Server&#12391;&#20104;&#32004;&#12373;&#12428;&#12390;&#12356;&#12427;&#20182;&#12398;&#12461;&#12540;&#12527;&#12540;&#12489;&#12434;&#21517;&#21069;&#12395;&#20351;&#29992;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#12494;&#12540;&#12489;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12391;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#37197;&#32622;&#12373;&#12428;&#12427;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#27083;&#25104;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12391;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20351;&#29992;&#12377;&#12427;&#21517;&#21069;&#20184;&#12365;&#27083;&#25104;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
&#12300;<code>default-config</code>&#12301;&#12434;&#36984;&#25246;&#12375;&#12383;&#22580;&#21512;&#12399;&#12289;&#27083;&#25104;&#12434;&#20849;&#26377;<i>&#12375;&#12394;&#12356;</i>&#12371;&#12392;&#12434;&#27425;&#12398;&#12473;&#12486;&#12483;&#12503;&#12391;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12300;<code>default-config</code>&#12301;&#27083;&#25104;&#12399;&#20849;&#26377;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
<hr>

</li>
<li>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20351;&#29992;&#12377;&#12427;&#27083;&#25104;&#12434;&#20849;&#26377;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#27083;&#25104;&#12434;&#20849;&#26377;&#12375;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12300;&#36984;&#25246;&#12375;&#12390;&#12356;&#12427;&#27083;&#25104;&#12398;&#12467;&#12500;&#12540;&#12434;&#20316;&#25104;&#12377;&#12427;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12375;&#12383;&#12414;&#12414;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20316;&#25104;&#12373;&#12428;&#12427;&#12392;&#12289;&#36984;&#25246;&#12375;&#12383;&#27083;&#25104;&#12364;&#12467;&#12500;&#12540;&#12373;&#12428;&#12414;&#12377;&#12290;&#27083;&#25104;&#12398;&#12467;&#12500;&#12540;&#12395;&#12399;&#12289;<i>instance-name</i><code>-config</code>(<i>instance-name</i>&#12399;&#20316;&#25104;&#12375;&#12390;&#12356;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#21517;&#21069;)&#12392;&#12356;&#12358;&#21517;&#21069;&#12364;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#27083;&#25104;&#12434;&#20849;&#26377;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12300;&#36984;&#25246;&#12375;&#12390;&#12356;&#12427;&#27083;&#25104;&#12434;&#21442;&#29031;&#12377;&#12427;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#12289;&#25351;&#23450;&#12375;&#12383;&#26082;&#23384;&#12398;&#21517;&#21069;&#20184;&#12365;&#27083;&#25104;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;OK&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref126" name="sthref126"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-delete-standalone-instances.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-start-standalone-instances.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36215;&#21205;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-stop-standalone-instances.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20572;&#27490;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-view-logs-standalone-instance.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-recovertransactions-standalone-instance.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#12522;&#12459;&#12496;&#12522;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-deploy.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-list.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12390;&#12356;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-undeploy.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12363;&#12425;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12450;&#12531;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-remove.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12363;&#12425;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#38500;&#21435;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-edit.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-enable-disable.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12414;&#12383;&#12399;&#28961;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-lb-enable-disable.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12525;&#12540;&#12489;&#12539;&#12496;&#12521;&#12531;&#12471;&#12531;&#12464;&#12434;&#26377;&#21177;&#12414;&#12383;&#12399;&#28961;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-create.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12522;&#12477;&#12540;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-display.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12522;&#12477;&#12540;&#12473;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-enable-disable.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12522;&#12477;&#12540;&#12473;&#12434;&#26377;&#21177;&#12414;&#12383;&#12399;&#28961;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-edit.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12522;&#12477;&#12540;&#12473;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-change-standalone-instance-ports.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12509;&#12540;&#12488;&#30058;&#21495;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-set-props-standalone-instance.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;Instance-Only&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-mon-app-standalone-instance.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-mon-server-standalone-instance.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-mon-resource-standalone-instance.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12522;&#12477;&#12540;&#12473;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
