<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-migrate-ejb-timers" name="task-migrate-ejb-timers"></a></p>

<h4><a id="sthref240" name="sthref240"></a><a id="sthref241" name="sthref241"></a><a id="sthref242" name="sthref242"></a>EJB&#12479;&#12452;&#12510;&#12540;&#12434;&#31227;&#34892;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20572;&#27490;&#12377;&#12427;&#12392;&#12289;&#12381;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12390;&#12356;&#12427;Enterprise JavaBeans (EJB)&#12486;&#12463;&#12494;&#12525;&#12472;&#12398;&#12479;&#12452;&#12510;&#12540;&#12398;&#23455;&#34892;&#12418;&#20572;&#27490;&#12375;&#12414;&#12377;&#12290;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#30064;&#24120;&#20572;&#27490;&#12414;&#12383;&#12399;&#20104;&#26399;&#12379;&#12378;&#12395;&#20572;&#27490;&#12375;&#12383;&#22580;&#21512;&#12395;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20572;&#27490;&#12375;&#12390;&#12356;&#12427;&#38291;&#12418;&#12371;&#12428;&#12425;&#12398;&#12479;&#12452;&#12510;&#12540;&#12364;&#23455;&#34892;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;&#12479;&#12452;&#12510;&#12540;&#12434;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#23455;&#34892;&#20013;&#12398;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#31227;&#34892;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#12463;&#12521;&#12473;&#12479;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12398;&#12300;&#12463;&#12521;&#12473;&#12479;&#12301;&#12494;&#12540;&#12489;&#12391;&#12289;&#12463;&#12521;&#12473;&#12479;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12463;&#12521;&#12473;&#12479;&#12398;&#12300;&#19968;&#33324;&#24773;&#22577;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#19968;&#33324;&#24773;&#22577;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;EJB&#12479;&#12452;&#12510;&#12540;&#12398;&#31227;&#34892;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;EJB&#12479;&#12452;&#12510;&#12540;&#12398;&#31227;&#34892;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#12377;&#12409;&#12390;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12300;EJB&#12479;&#12452;&#12510;&#12540;&#12398;&#31227;&#34892;&#12301;&#12508;&#12479;&#12531;&#12399;&#38750;&#12450;&#12463;&#12486;&#12451;&#12502;&#21270;&#12373;&#12428;&#12414;&#12377;&#12290;
<hr>

<p>&#12479;&#12452;&#12510;&#12540;&#12434;&#20870;&#28369;&#12395;&#31227;&#34892;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12289;&#12300;EJB&#12479;&#12452;&#12510;&#12540;&#12398;&#31227;&#34892;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#24773;&#22577;&#12434;&#25552;&#20379;&#12377;&#12427;EJB&#12479;&#12452;&#12510;&#12540;&#12398;&#34920;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12469;&#12540;&#12496;&#12540;&#21517;</dt>
<dd>
<p>&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12522;&#12473;&#12488;&#12290;</p>
</dd>
<dt>&#12479;&#12452;&#12510;&#12540;&#12539;&#12459;&#12454;&#12531;&#12488;</dt>
<dd>
<p>&#21508;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#27704;&#32154;&#12479;&#12452;&#12510;&#12540;&#12398;&#25968;&#12290;</p>
</dd>
</dl>
</li>
<li>
<p>&#12300;EJB&#12479;&#12452;&#12510;&#12540;&#12398;&#31227;&#34892;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12479;&#12452;&#12510;&#12540;&#12398;&#31227;&#34892;&#20803;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#31227;&#34892;&#20808;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<ol type="a">
<li>
<p>&#12300;&#12477;&#12540;&#12473;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#12479;&#12452;&#12510;&#12540;&#12398;&#31227;&#34892;&#20803;&#12391;&#12354;&#12427;&#20572;&#27490;&#12373;&#12428;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#23451;&#20808;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#12479;&#12452;&#12510;&#12540;&#12398;&#31227;&#34892;&#20808;&#12392;&#12394;&#12427;&#23455;&#34892;&#20013;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;OK&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
</li>
</ol>
<p>&#12477;&#12540;&#12473;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#23455;&#34892;&#20013;&#12398;&#22580;&#21512;&#12289;&#12414;&#12383;&#12399;&#23451;&#20808;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20572;&#27490;&#20013;&#12398;&#22580;&#21512;&#12399;&#12289;&#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12395;&#12456;&#12521;&#12540;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
