<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-deletenode" name="task-deletenode"></a></p>

<h4><a id="sthref228" name="sthref228"></a>&#12494;&#12540;&#12489;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12494;&#12540;&#12489;&#12434;&#21066;&#38500;&#12377;&#12427;&#12392;&#12289;&#12494;&#12540;&#12489;&#12399;&#12489;&#12513;&#12452;&#12531;&#31649;&#29702;&#12469;&#12540;&#12496;&#12540;(DAS)&#12398;&#27083;&#25104;&#12363;&#12425;&#38500;&#21435;&#12373;&#12428;&#12414;&#12377;&#12290;&#12494;&#12540;&#12489;&#12398;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12392;&#12501;&#12449;&#12452;&#12523;&#12399;&#12289;&#12494;&#12540;&#12489;&#12395;&#23384;&#22312;&#12377;&#12427;&#26368;&#24460;&#12398;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#21066;&#38500;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;&#21066;&#38500;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<p>&#12494;&#12540;&#12489;&#12398;&#21066;&#38500;&#26178;&#12395;&#12494;&#12540;&#12489;&#12539;&#12507;&#12473;&#12488;&#12363;&#12425;GlassFish Server&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12450;&#12531;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12424;&#12358;&#12395;&#36984;&#25246;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<a id="sthref229" name="sthref229"></a>
<h5>&#38283;&#22987;&#21069;</h5>
<p>GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#21066;&#38500;&#12373;&#12428;&#12427;&#12494;&#12540;&#12489;&#12395;&#23384;&#22312;&#12375;&#12394;&#12356;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12414;&#12377;&#12290;</p>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#12494;&#12540;&#12489;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12494;&#12540;&#12489;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#21066;&#38500;&#12377;&#12427;&#12494;&#12540;&#12489;&#12372;&#12392;&#12395;&#12289;&#12300;&#12494;&#12540;&#12489;&#12301;&#12398;&#34920;&#12398;&#12494;&#12540;&#12489;&#12398;&#27178;&#12395;&#12354;&#12427;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
&#23450;&#32681;&#28168;&#12494;&#12540;&#12489;<code>localhost-</code><i>domain</i>&#12399;&#21066;&#38500;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
<hr>

</li>
<li>
<p>&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12289;&#12494;&#12540;&#12489;&#12434;&#21066;&#38500;&#12289;&#12414;&#12383;&#12399;&#12494;&#12540;&#12489;&#12434;&#21066;&#38500;&#12375;&#12390;&#12494;&#12540;&#12489;&#12539;&#12507;&#12473;&#12488;&#12363;&#12425;GlassFish Server&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12450;&#12531;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>GlassFish Server&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12450;&#12531;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12379;&#12378;&#12395;&#12494;&#12540;&#12489;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#21066;&#38500;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12494;&#12540;&#12489;&#12434;&#21066;&#38500;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#30906;&#35469;&#12377;&#12427;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12494;&#12540;&#12489;&#12434;&#21066;&#38500;&#12375;&#12390;&#12494;&#12540;&#12489;&#12539;&#12507;&#12473;&#12488;&#12363;&#12425;GlassFish Server&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12450;&#12531;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#21066;&#38500;&#12392;&#12450;&#12531;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12494;&#12540;&#12489;&#12434;&#21066;&#38500;&#12375;&#12390;&#12494;&#12540;&#12489;&#12539;&#12507;&#12473;&#12488;&#12363;&#12425;GlassFish Server&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12450;&#12531;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#30906;&#35469;&#12377;&#12427;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
&#12300;CONFIG&#12301;&#12479;&#12452;&#12503;&#12398;&#12494;&#12540;&#12489;&#12364;&#34920;&#12377;&#12507;&#12473;&#12488;&#12363;&#12425;GlassFish Server&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12364;&#12450;&#12531;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12494;&#12540;&#12489;&#12398;&#12415;&#12364;&#21066;&#38500;&#12373;&#12428;&#12414;&#12377;&#12290;
<hr>

</li>
</ul>
</li>
<li>
<p>&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12289;&#12494;&#12540;&#12489;&#12434;&#21066;&#38500;&#12289;&#12414;&#12383;&#12399;&#12494;&#12540;&#12489;&#12434;&#21066;&#38500;&#12375;&#12390;&#12494;&#12540;&#12489;&#12539;&#12507;&#12473;&#12488;&#12363;&#12425;GlassFish Server&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#12450;&#12531;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12494;&#12540;&#12489;&#12364;&#21066;&#38500;&#12373;&#12428;&#12289;&#12300;&#12494;&#12540;&#12489;&#12301;&#12506;&#12540;&#12472;&#12398;&#12494;&#12540;&#12489;&#12398;&#34920;&#12363;&#12425;&#12418;&#38500;&#21435;&#12373;&#12428;&#12414;&#12377;&#12290;&#12300;&#21066;&#38500;&#12392;&#12450;&#12531;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12383;&#22580;&#21512;&#12399;&#12289;GlassFish Server&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12418;&#12494;&#12540;&#12489;&#12539;&#12507;&#12473;&#12488;&#12363;&#12425;&#12450;&#12531;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref230" name="sthref230"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-createnode.html">&#12494;&#12540;&#12489;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-listnodes.html">&#29694;&#22312;&#12398;&#12489;&#12513;&#12452;&#12531;&#20869;&#12395;&#12354;&#12427;&#12377;&#12409;&#12390;&#12398;&#12494;&#12540;&#12489;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-pingnode.html">&#12494;&#12540;&#12489;&#12395;&#21040;&#36948;&#21487;&#33021;&#12363;&#12393;&#12358;&#12363;&#12434;&#12486;&#12473;&#12488;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-editnode.html">&#12494;&#12540;&#12489;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
