<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-cluster-app-edit" name="task-cluster-app-edit"></a></p>

<h4><a id="sthref34" name="sthref34"></a><a id="sthref35" name="sthref35"></a>&#12463;&#12521;&#12473;&#12479;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#12463;&#12521;&#12473;&#12479;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#23637;&#38283;&#12375;&#12383;&#12300;&#12463;&#12521;&#12473;&#12479;&#12301;&#12494;&#12540;&#12489;&#12391;&#12289;&#12463;&#12521;&#12473;&#12479;&#12398;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12463;&#12521;&#12473;&#12479;&#12398;&#12300;&#19968;&#33324;&#24773;&#22577;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#19968;&#33324;&#24773;&#22577;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12301;&#12479;&#12502;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12463;&#12521;&#12473;&#12479;&#12398;&#12300;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12301;&#12506;&#12540;&#12472;&#12398;&#12300;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12301;&#12398;&#34920;&#12391;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#21517;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#38306;&#12377;&#12427;&#24517;&#35201;&#12394;&#24773;&#22577;&#12434;&#20837;&#21147;&#12375;&#12289;&#22793;&#26356;&#12434;&#20445;&#23384;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#35443;&#32048;&#12399;&#12289;&#12300;<a href="../../../common/en/help/ref-appedit.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#32232;&#38598;</a>&#12301;&#12458;&#12531;&#12521;&#12452;&#12531;&#12539;&#12504;&#12523;&#12503;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
</ol>
<a id="sthref36" name="sthref36"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-create-cluster.html">&#12463;&#12521;&#12473;&#12479;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-delete-cluster.html">&#12463;&#12521;&#12473;&#12479;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-availabilityservice.html">&#12463;&#12521;&#12473;&#12479;&#12398;&#21487;&#29992;&#24615;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-start-cluster.html">&#12463;&#12521;&#12473;&#12479;&#12434;&#36215;&#21205;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-stop-cluster.html">&#12463;&#12521;&#12473;&#12479;&#12434;&#20572;&#27490;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-modify-cluster-config.html">&#12463;&#12521;&#12473;&#12479;&#12398;&#27083;&#25104;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-app-deploy.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12463;&#12521;&#12473;&#12479;&#12395;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-app-list.html">&#12463;&#12521;&#12473;&#12479;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12390;&#12356;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-app-undeploy.html">&#12463;&#12521;&#12473;&#12479;&#12363;&#12425;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12450;&#12531;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-app-remove.html">&#12463;&#12521;&#12473;&#12479;&#12363;&#12425;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#38500;&#21435;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-app-enable-disable.html">&#12463;&#12521;&#12473;&#12479;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12414;&#12383;&#12399;&#28961;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-app-lb-enable-disable.html">&#12463;&#12521;&#12473;&#12479;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12525;&#12540;&#12489;&#12539;&#12496;&#12521;&#12531;&#12471;&#12531;&#12464;&#12434;&#26377;&#21177;&#12414;&#12383;&#12399;&#28961;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-create.html">&#12463;&#12521;&#12473;&#12479;&#12398;&#12522;&#12477;&#12540;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-display.html">&#12463;&#12521;&#12473;&#12479;&#12398;&#12522;&#12477;&#12540;&#12473;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-enable-disable.html">&#12522;&#12477;&#12540;&#12473;&#12434;&#12464;&#12525;&#12540;&#12496;&#12523;&#12395;&#26377;&#21177;&#12414;&#12383;&#12399;&#28961;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-edit.html">&#12463;&#12521;&#12473;&#12479;&#12398;&#12522;&#12477;&#12540;&#12473;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-upgrade-components.html">&#12469;&#12540;&#12499;&#12473;&#12434;&#22833;&#12358;&#12371;&#12392;&#12394;&#12367;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
