<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-gmsenable" name="task-gmsenable"></a></p>

<h4><a id="sthref217" name="sthref217"></a><a id="sthref218" name="sthref218"></a>&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;(GMS)&#12399;&#12289;&#12463;&#12521;&#12473;&#12479;&#12398;&#12514;&#12491;&#12479;&#12540;&#12289;&#12463;&#12521;&#12473;&#12479;&#12398;&#12513;&#12531;&#12496;&#12540;&#12471;&#12483;&#12503;&#12289;&#12362;&#12424;&#12403;&#12464;&#12523;&#12540;&#12503;&#36890;&#20449;&#12398;&#21508;&#12469;&#12540;&#12499;&#12473;&#12434;&#25552;&#20379;&#12377;&#12427;&#12452;&#12531;&#12503;&#12525;&#12475;&#12473;&#12539;&#12469;&#12540;&#12499;&#12473;&#12391;&#12377;&#12290;GMS&#12399;&#27425;&#12398;&#27231;&#33021;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12513;&#12531;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#12463;&#12521;&#12473;&#12479;&#12395;&#36861;&#21152;&#12373;&#12428;&#12427;&#12363;&#12289;&#12463;&#12521;&#12473;&#12479;&#12363;&#12425;&#38500;&#21435;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;&#12354;&#12427;&#12356;&#12399;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12513;&#12531;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#38556;&#23475;&#12364;&#30330;&#29983;&#12375;&#12383;&#30097;&#12356;&#12364;&#29983;&#12376;&#12383;&#12363;&#12289;&#38556;&#23475;&#12364;&#30330;&#29983;&#12375;&#12383;&#12371;&#12392;&#12364;&#30906;&#35469;&#12373;&#12428;&#12383;&#22580;&#21512;&#12395;&#12289;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#30331;&#37682;&#28168;&#12514;&#12472;&#12517;&#12540;&#12523;&#12395;&#36890;&#30693;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12463;&#12521;&#12473;&#12479;&#12539;&#12513;&#12531;&#12496;&#12540;&#38291;&#12391;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#36865;&#21463;&#20449;&#12377;&#12427;&#27231;&#33021;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#12463;&#12521;&#12473;&#12479;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;(GMS)&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12463;&#12521;&#12473;&#12479;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12463;&#12521;&#12473;&#12479;&#12398;&#12300;&#19968;&#33324;&#24773;&#22577;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;GMS&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#12463;&#12521;&#12473;&#12479;&#12395;&#23550;&#12375;&#12390;GMS&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12463;&#12521;&#12473;&#12479;&#12395;&#23550;&#12375;&#12390;GMS&#12434;&#28961;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;GMS&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12398;&#36984;&#25246;&#12434;&#35299;&#38500;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#26377;&#21177;&#12395;&#12377;&#12427;&#12392;&#12289;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#21508;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#12489;&#12513;&#12452;&#12531;&#31649;&#29702;&#12469;&#12540;&#12496;&#12540;(DAS)&#12391;&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;&#12364;&#38283;&#22987;&#12373;&#12428;&#12414;&#12377;&#12290;DAS&#12399;&#12289;GMS&#12364;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#21508;&#12463;&#12521;&#12473;&#12479;&#12395;&#21442;&#21152;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref219" name="sthref219"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-gmscluster.html">&#12463;&#12521;&#12473;&#12479;&#12398;&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-gms.html">&#12464;&#12523;&#12540;&#12503;&#31649;&#29702;&#12469;&#12540;&#12499;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
