<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-nodenewdcom" name="task-nodenewdcom"></a></p>
<!-- infolevel="all" infotype="General" -->
<h4>DCOM&#12494;&#12540;&#12489;&#12398;&#20316;&#25104;&#12434;&#32066;&#20102;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12371;&#12398;&#12479;&#12473;&#12463;&#12399;&#12289;<a href="task-createnode.html">&#12494;&#12540;&#12489;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a>&#12398;DCOM&#12494;&#12540;&#12489;&#12395;&#23550;&#12377;&#12427;&#32154;&#12365;&#12391;&#12377;&#12290;</p>
<ol>
<li>
<p>GlassFish Server&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;DAS&#12477;&#12501;&#12488;&#12363;&#12425;&#12494;&#12540;&#12489;&#12539;&#12507;&#12473;&#12488;&#12395;&#12467;&#12500;&#12540;&#12377;&#12427;&#12395;&#12399;&#12289;GlassFish Server&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12494;&#12540;&#12489;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12398;&#26908;&#35388;&#12395;&#22833;&#25943;&#12375;&#12383;&#22580;&#21512;&#12395;&#12489;&#12513;&#12452;&#12531;&#31649;&#29702;&#12469;&#12540;&#12496;&#12540;(DAS)&#12398;&#27083;&#25104;&#12391;&#12494;&#12540;&#12489;&#12364;&#24375;&#21046;&#30340;&#12395;&#20316;&#25104;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#24375;&#21046;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12494;&#12540;&#12489;&#12434;&#20316;&#25104;&#12377;&#12427;&#21069;&#12395;&#12289;GlassFish Server&#12391;&#12494;&#12540;&#12489;&#12539;&#12507;&#12473;&#12488;&#12408;&#12398;DCOM&#32076;&#30001;&#12398;&#25509;&#32154;&#12434;&#12486;&#12473;&#12488;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;&#27425;&#12398;&#12473;&#12486;&#12483;&#12503;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;</p>
<ol type="a">
<li>
<p>&#12300;DCOM&#12398;&#26908;&#35388;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12522;&#12514;&#12540;&#12488;&#12539;&#12486;&#12473;&#12488;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;GlassFish Server&#12395;&#12424;&#12387;&#12390;&#20316;&#25104;&#12373;&#12428;&#12427;&#12289;&#25509;&#32154;&#12434;&#12486;&#12473;&#12488;&#12377;&#12427;&#12383;&#12417;&#12398;&#12501;&#12449;&#12452;&#12523;&#12398;&#26684;&#32013;&#20808;&#12522;&#12514;&#12540;&#12488;&#12539;&#12507;&#12473;&#12488;&#12398;&#12501;&#12457;&#12523;&#12480;&#21517;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
</li>
<li>
<p>&#12300;Windows&#12489;&#12513;&#12452;&#12531;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12300;Windows&#12518;&#12540;&#12470;&#12540;&#21517;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#25351;&#23450;&#12377;&#12427;&#12518;&#12540;&#12470;&#12540;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;Windows&#12489;&#12513;&#12452;&#12531;&#12398;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;Windows&#12518;&#12540;&#12470;&#12540;&#21517;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12507;&#12473;&#12488;&#12395;DCOM&#32076;&#30001;&#12391;&#25509;&#32154;&#12377;&#12427;&#12383;&#12417;&#12398;&#12503;&#12525;&#12475;&#12473;&#12434;&#23455;&#34892;&#12377;&#12427;&#12289;&#12371;&#12398;&#12494;&#12540;&#12489;&#12398;&#12507;&#12473;&#12488;&#12398;&#12518;&#12540;&#12470;&#12540;&#12398;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12371;&#12398;&#12494;&#12540;&#12489;&#12398;&#12507;&#12473;&#12488;&#12408;&#12398;&#12525;&#12464;&#12452;&#12531;&#26178;&#12395;Windows&#12518;&#12540;&#12470;&#12540;&#12434;&#35469;&#35388;&#12377;&#12427;&#26041;&#27861;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
GlassFish Server&#12391;&#12399;&#12289;&#12497;&#12473;&#12527;&#12540;&#12489;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;<code>AS_ADMIN_WINDOWSPASSWORD</code>&#12456;&#12531;&#12488;&#12522;&#12434;&#20351;&#29992;&#12375;&#12383;&#12497;&#12473;&#12527;&#12540;&#12489;&#35469;&#35388;&#12418;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12414;&#12377;&#12290;&#12497;&#12473;&#12527;&#12540;&#12489;&#12539;&#12501;&#12449;&#12452;&#12523;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00263"><code>asadmin</code>(1)</a>&#12518;&#12540;&#12486;&#12451;&#12522;&#12486;&#12451;&#12398;<code>--paswordfile</code>&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;
<hr>

<ol type="a">
<li>
<p>DAS&#27083;&#25104;&#12395;&#26684;&#32013;&#12373;&#12428;&#12390;&#12356;&#12427;&#12497;&#12473;&#12527;&#12540;&#12489;&#12395;&#12424;&#12427;&#35469;&#35388;&#12434;&#25351;&#23450;&#12377;&#12427;&#12395;&#12399;&#12289;&#27425;&#12398;&#12473;&#12486;&#12483;&#12503;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
&#12371;&#12398;&#12497;&#12473;&#12527;&#12540;&#12489;&#12399;&#12289;DAS&#27083;&#25104;&#12395;&#12463;&#12522;&#12450;&#12539;&#12486;&#12461;&#12473;&#12488;&#12391;&#26684;&#32013;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#24375;&#21270;&#12398;&#12383;&#12417;&#12289;&#12497;&#12473;&#12527;&#12540;&#12489;&#12539;&#12456;&#12452;&#12522;&#12450;&#12473;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;
<hr>

<ol>
<li>
<p>&#12300;Windows&#12518;&#12540;&#12470;&#12540;&#35469;&#35388;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12300;&#12497;&#12473;&#12527;&#12540;&#12489;&#12301;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;Windows&#12518;&#12540;&#12470;&#12540;&#12539;&#12497;&#12473;&#12527;&#12540;&#12489;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12371;&#12398;&#12494;&#12540;&#12489;&#12398;&#12507;&#12473;&#12488;&#12408;&#12398;&#12525;&#12464;&#12452;&#12531;&#26178;&#12395;Windows&#12518;&#12540;&#12470;&#12540;&#12364;&#20351;&#29992;&#12377;&#12427;&#12497;&#12473;&#12527;&#12540;&#12489;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
</li>
<li>
<p>&#12497;&#12473;&#12527;&#12540;&#12489;&#12539;&#12456;&#12452;&#12522;&#12450;&#12473;&#12395;&#12424;&#12427;&#35469;&#35388;&#12434;&#25351;&#23450;&#12377;&#12427;&#12395;&#12399;&#12289;&#27425;&#12398;&#12473;&#12486;&#12483;&#12503;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;</p>
<ol>
<li>
<p>&#12300;Windows&#12518;&#12540;&#12470;&#12540;&#35469;&#35388;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12300;&#12497;&#12473;&#12527;&#12540;&#12489;&#12539;&#12456;&#12452;&#12522;&#12450;&#12473;&#12301;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12497;&#12473;&#12527;&#12540;&#12489;&#12539;&#12456;&#12452;&#12522;&#12450;&#12473;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#26082;&#23384;&#12398;&#12456;&#12452;&#12522;&#12450;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
</li>
</ol>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref226" name="sthref226"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<p><a href="task-createnode.html">&#12494;&#12540;&#12489;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
