<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-create-cluster" name="task-create-cluster"></a></p>

<h4><a id="sthref2" name="sthref2"></a>&#12463;&#12521;&#12473;&#12479;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12463;&#12521;&#12473;&#12479;&#12399;&#12289;&#21516;&#12376;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12289;&#12522;&#12477;&#12540;&#12473;&#12289;&#12362;&#12424;&#12403;&#27083;&#25104;&#24773;&#22577;&#12434;&#20849;&#26377;&#12377;&#12427;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#38598;&#12414;&#12426;&#12395;&#21517;&#21069;&#12434;&#20184;&#12369;&#12383;&#12418;&#12398;&#12391;&#12377;&#12290;</p>
<p>&#12463;&#12521;&#12473;&#12479;&#12399;&#12289;&#12473;&#12465;&#12540;&#12521;&#12499;&#12522;&#12486;&#12451;&#12289;&#12525;&#12540;&#12489;&#12539;&#12496;&#12521;&#12531;&#12471;&#12531;&#12464;&#12289;&#12362;&#12424;&#12403;&#38556;&#23475;&#20445;&#35703;&#12395;&#12424;&#12387;&#12390;&#39640;&#21487;&#29992;&#24615;&#12434;&#23455;&#29694;&#12375;&#12414;&#12377;&#12290;&#12354;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12414;&#12383;&#12399;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#12354;&#12427;&#12507;&#12473;&#12488;&#12395;&#38556;&#23475;&#12364;&#36215;&#12365;&#12427;&#12392;&#12289;GlassFish Server&#12399;&#38556;&#23475;&#12434;&#26908;&#20986;&#12375;&#12289;&#38556;&#23475;&#12398;&#36215;&#12365;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12363;&#12425;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#20182;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;&#12375;&#12289;&#12518;&#12540;&#12470;&#12540;&#12539;&#12475;&#12483;&#12471;&#12519;&#12531;&#12398;&#29366;&#24907;&#12434;&#12522;&#12459;&#12496;&#12522;&#12375;&#12414;&#12377;&#12290;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#12377;&#12409;&#12390;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#19978;&#12395;&#12399;&#21516;&#19968;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12392;&#12522;&#12477;&#12540;&#12473;&#12364;&#12354;&#12427;&#12383;&#12417;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#20182;&#12398;&#12393;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12418;&#20966;&#29702;&#12434;&#32153;&#32154;&#12373;&#12379;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<p>GlassFish Server&#12391;&#12399;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#23384;&#22312;&#12377;&#12427;&#22580;&#25152;&#12364;&#21516;&#12376;&#12507;&#12473;&#12488;&#12363;&#30064;&#12394;&#12427;&#12507;&#12473;&#12488;&#12363;&#12395;&#38306;&#20418;&#12394;&#12367;&#12289;1&#12388;&#12398;&#12507;&#12473;&#12488;&#12398;1&#12388;&#12398;&#12518;&#12491;&#12483;&#12488;&#12392;&#12375;&#12390;&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#12377;&#12409;&#12390;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#31649;&#29702;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<a id="sthref3" name="sthref3"></a>
<h5>&#38283;&#22987;&#21069;</h5>
<p>&#20316;&#25104;&#20013;&#12398;&#12463;&#12521;&#12473;&#12479;&#12395;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36861;&#21152;&#12377;&#12427;&#20104;&#23450;&#12364;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;&#12381;&#12428;&#12425;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36861;&#21152;&#12377;&#12427;&#12494;&#12540;&#12489;&#12364;&#23384;&#22312;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12414;&#12377;&#12290;</p>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#12463;&#12521;&#12473;&#12479;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12463;&#12521;&#12473;&#12479;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12463;&#12521;&#12473;&#12479;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;&#26032;&#35215;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26032;&#35215;&#12463;&#12521;&#12473;&#12479;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12463;&#12521;&#12473;&#12479;&#21517;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12463;&#12521;&#12473;&#12479;&#12398;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#21517;&#21069;&#12399;&#27425;&#12398;&#35201;&#20214;&#12434;&#28288;&#12383;&#12377;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;:</p>
<ul>
<li>
<p>&#21517;&#21069;&#12395;&#12399;ASCII&#25991;&#23383;&#12398;&#12415;&#12434;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#21517;&#21069;&#12399;&#33521;&#25968;&#23383;&#12414;&#12383;&#12399;&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#12391;&#22987;&#12417;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#21517;&#21069;&#12395;&#21547;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12398;&#12399;&#27425;&#12398;&#25991;&#23383;&#12398;&#12415;&#12391;&#12377;:</p>
<ul>
<li>
<p>&#23567;&#25991;&#23383;</p>
</li>
<li>
<p>&#22823;&#25991;&#23383;</p>
</li>
<li>
<p>&#25968;&#20516;</p>
</li>
<li>
<p>&#12495;&#12452;&#12501;&#12531;</p>
</li>
<li>
<p>&#12500;&#12522;&#12458;&#12489;</p>
</li>
<li>
<p>&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;</p>
</li>
</ul>
</li>
<li>
<p>&#21517;&#21069;&#12399;&#12489;&#12513;&#12452;&#12531;&#20869;&#12391;&#19968;&#24847;&#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12289;&#21029;&#12398;&#12463;&#12521;&#12473;&#12479;&#12289;&#21517;&#21069;&#20184;&#12365;&#27083;&#25104;&#12289;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12289;&#12414;&#12383;&#12399;&#12494;&#12540;&#12489;&#12398;&#21517;&#21069;&#12395;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p><code>&#12489;&#12513;&#12452;&#12531;</code>&#12289;<code>&#12469;&#12540;&#12496;&#12540;</code>&#12289;&#12414;&#12383;&#12399;GlassFish Server&#12391;&#20104;&#32004;&#12373;&#12428;&#12390;&#12356;&#12427;&#20182;&#12398;&#12461;&#12540;&#12527;&#12540;&#12489;&#12434;&#21517;&#21069;&#12395;&#20351;&#29992;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#27083;&#25104;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12391;&#12289;&#12463;&#12521;&#12473;&#12479;&#12364;&#20351;&#29992;&#12377;&#12427;&#21517;&#21069;&#20184;&#12365;&#27083;&#25104;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
&#12300;<code>default-config</code>&#12301;&#12434;&#36984;&#25246;&#12375;&#12383;&#22580;&#21512;&#12399;&#12289;&#27083;&#25104;&#12434;&#20849;&#26377;<i>&#12375;&#12394;&#12356;</i>&#12371;&#12392;&#12434;&#27425;&#12398;&#12473;&#12486;&#12483;&#12503;&#12391;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12300;<code>default-config</code>&#12301;&#27083;&#25104;&#12399;&#20849;&#26377;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
<hr>

</li>
<li>
<p>&#12463;&#12521;&#12473;&#12479;&#12364;&#20351;&#29992;&#12377;&#12427;&#27083;&#25104;&#12434;&#20849;&#26377;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#27083;&#25104;&#12434;&#20849;&#26377;&#12375;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12300;&#36984;&#25246;&#12375;&#12390;&#12356;&#12427;&#27083;&#25104;&#12398;&#12467;&#12500;&#12540;&#12434;&#20316;&#25104;&#12377;&#12427;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12375;&#12383;&#12414;&#12414;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12463;&#12521;&#12473;&#12479;&#12364;&#20316;&#25104;&#12373;&#12428;&#12427;&#12392;&#12289;&#36984;&#25246;&#12375;&#12383;&#27083;&#25104;&#12364;&#12467;&#12500;&#12540;&#12373;&#12428;&#12414;&#12377;&#12290;&#27083;&#25104;&#12398;&#12467;&#12500;&#12540;&#12395;&#12399;&#12289;<i>cluster-name</i><code>-config</code>(<i>cluster-name</i>&#12399;&#20316;&#25104;&#12375;&#12390;&#12356;&#12427;&#12463;&#12521;&#12473;&#12479;&#12398;&#21517;&#21069;)&#12392;&#12356;&#12358;&#21517;&#21069;&#12364;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#27083;&#25104;&#12434;&#20849;&#26377;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12300;&#36984;&#25246;&#12375;&#12390;&#12356;&#12427;&#27083;&#25104;&#12434;&#21442;&#29031;&#12377;&#12427;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12463;&#12521;&#12473;&#12479;&#12399;&#12289;&#25351;&#23450;&#12375;&#12383;&#26082;&#23384;&#12398;&#21517;&#21069;&#20184;&#12365;&#27083;&#25104;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p><a id="sthref4" name="sthref4"></a>GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#12463;&#12521;&#12473;&#12479;&#12395;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
&#12522;&#12514;&#12540;&#12488;&#12539;&#12507;&#12473;&#12488;&#12434;&#34920;&#12377;&#12300;CONFIG&#12301;&#12479;&#12452;&#12503;&#12398;&#12494;&#12540;&#12489;&#12395;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00044"><code>create-local-instance</code>(1)</a>&#12469;&#12502;&#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#29992;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#30446;&#30340;&#12391;&#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
<hr>

<p><a href="task-create-clustered-instance.html">GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#12463;&#12521;&#12473;&#12479;&#12395;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;</a>&#12391;&#35500;&#26126;&#12373;&#12428;&#12390;&#12356;&#12427;&#12424;&#12358;&#12395;&#12289;&#12463;&#12521;&#12473;&#12479;&#20316;&#25104;&#24460;&#12395;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36861;&#21152;&#12377;&#12427;&#12371;&#12392;&#12418;&#21487;&#33021;&#12391;&#12377;&#12290;</p>
<p>&#21508;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#27425;&#12398;&#12424;&#12358;&#12395;&#36861;&#21152;&#12375;&#12414;&#12377;&#12290;</p>
<ol type="a">
<li>
<p>&#12300;&#20316;&#25104;&#12377;&#12427;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12301;&#38936;&#22495;&#12391;&#12289;&#12300;&#36861;&#21152;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12463;&#12521;&#12473;&#12479;&#20869;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#34920;&#12395;&#34892;&#12364;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21517;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#37325;&#12415;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12525;&#12540;&#12489;&#12496;&#12521;&#12531;&#12471;&#12531;&#12464;&#12398;&#37325;&#12415;&#12434;&#34920;&#12377;&#25972;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12525;&#12540;&#12489;&#12496;&#12521;&#12531;&#12471;&#12531;&#12464;&#12398;&#37325;&#12415;&#12399;&#12289;&#12463;&#12521;&#12473;&#12479;&#12395;&#23550;&#12377;&#12427;&#12377;&#12409;&#12390;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12398;&#12358;&#12385;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20966;&#29702;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#21106;&#21512;&#12434;&#27770;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12383;&#12392;&#12360;&#12400;&#12289;2&#12388;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#27083;&#25104;&#12373;&#12428;&#12427;&#12463;&#12521;&#12473;&#12479;&#12391;&#12289;&#19968;&#26041;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;4&#12388;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12398;&#12358;&#12385;&#12398;1&#12388;&#12434;&#20966;&#29702;&#12375;&#12289;&#12418;&#12358;&#19968;&#26041;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#27531;&#12426;&#12398;3&#12388;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#20966;&#29702;&#12377;&#12427;&#12371;&#12392;&#12364;&#24517;&#35201;&#12395;&#12394;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#22580;&#21512;&#12289;4&#12388;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12398;&#12358;&#12385;&#12398;1&#12388;&#12434;&#20966;&#29702;&#12377;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#37325;&#12415;&#12434;1&#12395;&#35373;&#23450;&#12375;&#12289;&#12418;&#12358;&#19968;&#26041;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#37325;&#12415;&#12434;3&#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#12497;&#12540;&#12475;&#12531;&#12488;&#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#37325;&#12415;&#12434;&#12381;&#12428;&#12382;&#12428;25&#12392;75&#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#37325;&#12415;&#12399;100&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12494;&#12540;&#12489;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12391;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#37197;&#32622;&#12373;&#12428;&#12427;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
</li>
<li>
<p>&#12300;OK&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12463;&#12521;&#12473;&#12479;&#12301;&#12506;&#12540;&#12472;&#12395;&#25147;&#12426;&#12414;&#12377;&#12290;&#12506;&#12540;&#12472;&#12398;&#12463;&#12521;&#12473;&#12479;&#12398;&#34920;&#12395;&#12463;&#12521;&#12473;&#12479;&#12364;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref5" name="sthref5"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-delete-cluster.html">&#12463;&#12521;&#12473;&#12479;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-availabilityservice.html">&#12463;&#12521;&#12473;&#12479;&#12398;&#21487;&#29992;&#24615;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-start-cluster.html">&#12463;&#12521;&#12473;&#12479;&#12434;&#36215;&#21205;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-stop-cluster.html">&#12463;&#12521;&#12473;&#12479;&#12434;&#20572;&#27490;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-modify-cluster-config.html">&#12463;&#12521;&#12473;&#12479;&#12398;&#27083;&#25104;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-app-deploy.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12463;&#12521;&#12473;&#12479;&#12395;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-app-list.html">&#12463;&#12521;&#12473;&#12479;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12390;&#12356;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-app-undeploy.html">&#12463;&#12521;&#12473;&#12479;&#12363;&#12425;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12450;&#12531;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-app-remove.html">&#12463;&#12521;&#12473;&#12479;&#12363;&#12425;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#38500;&#21435;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-app-edit.html">&#12463;&#12521;&#12473;&#12479;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-app-enable-disable.html">&#12463;&#12521;&#12473;&#12479;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12414;&#12383;&#12399;&#28961;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-app-lb-enable-disable.html">&#12463;&#12521;&#12473;&#12479;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12525;&#12540;&#12489;&#12539;&#12496;&#12521;&#12531;&#12471;&#12531;&#12464;&#12434;&#26377;&#21177;&#12414;&#12383;&#12399;&#28961;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-create.html">&#12463;&#12521;&#12473;&#12479;&#12398;&#12522;&#12477;&#12540;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-display.html">&#12463;&#12521;&#12473;&#12479;&#12398;&#12522;&#12477;&#12540;&#12473;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-enable-disable.html">&#12522;&#12477;&#12540;&#12473;&#12434;&#12464;&#12525;&#12540;&#12496;&#12523;&#12395;&#26377;&#21177;&#12414;&#12383;&#12399;&#28961;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-edit.html">&#12463;&#12521;&#12473;&#12479;&#12398;&#12522;&#12477;&#12540;&#12473;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-upgrade-components.html">&#12469;&#12540;&#12499;&#12473;&#12434;&#22833;&#12358;&#12371;&#12392;&#12394;&#12367;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#12450;&#12483;&#12503;&#12464;&#12524;&#12540;&#12489;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
