<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-standalone-instance-resource-display" name="task-standalone-instance-resource-display"></a><a id="GHCLU00070" name="GHCLU00070"></a></p>

<h4><a id="sthref179" name="sthref179"></a><a id="sthref180" name="sthref180"></a>&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12522;&#12477;&#12540;&#12473;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12300;&#19968;&#33324;&#24773;&#22577;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#19968;&#33324;&#24773;&#22577;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;&#12522;&#12477;&#12540;&#12473;&#12301;&#12479;&#12502;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12300;&#12522;&#12477;&#12540;&#12473;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#29305;&#23450;&#12398;&#12479;&#12452;&#12503;&#12398;&#12522;&#12477;&#12540;&#12473;&#12398;&#12415;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12501;&#12451;&#12523;&#12479;&#12301;&#12503;&#12523;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#34920;&#31034;&#12377;&#12427;&#12522;&#12477;&#12540;&#12473;&#12398;&#12479;&#12452;&#12503;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref181" name="sthref181"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-create-standalone-instance.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-delete-standalone-instances.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-start-standalone-instances.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36215;&#21205;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-stop-standalone-instances.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20572;&#27490;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-view-logs-standalone-instance.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-recovertransactions-standalone-instance.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#12522;&#12459;&#12496;&#12522;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-deploy.html">&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-list.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12390;&#12356;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-undeploy.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12363;&#12425;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12450;&#12531;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-remove.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12363;&#12425;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#38500;&#21435;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-edit.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-enable-disable.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12414;&#12383;&#12399;&#28961;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-lb-enable-disable.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12525;&#12540;&#12489;&#12539;&#12496;&#12521;&#12531;&#12471;&#12531;&#12464;&#12434;&#26377;&#21177;&#12414;&#12383;&#12399;&#28961;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-create.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12522;&#12477;&#12540;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-enable-disable.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12522;&#12477;&#12540;&#12473;&#12434;&#26377;&#21177;&#12414;&#12383;&#12399;&#28961;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-edit.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12522;&#12477;&#12540;&#12473;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-change-standalone-instance-ports.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12509;&#12540;&#12488;&#30058;&#21495;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-set-props-standalone-instance.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;Instance-Only&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-mon-app-standalone-instance.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-mon-server-standalone-instance.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-mon-resource-standalone-instance.html">&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12522;&#12477;&#12540;&#12473;&#12398;&#12514;&#12491;&#12479;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
