<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jaccprovidernew" name="ref-jaccprovidernew"></a><a id="GHCOM00115" name="GHCOM00115"></a></p>

<h4><a id="sthref394" name="sthref394"></a>&#49352; JACC &#51228;&#44277;&#51088;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#49352; JACC &#51228;&#44277;&#51088;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; GlassFish Server&#50640;&#49436; &#49892;&#54665; &#51473;&#51064; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51032; &#53440;&#49324; &#44428;&#54620; &#48512;&#50668; &#47784;&#46280;&#50640;&#49436; &#49324;&#50857;&#54624; &#49688; &#51080;&#45716; JSR-115/196 &#54840;&#54872; JACC(Java Authorization Contract for Containers) &#51228;&#44277;&#51088;&#47484; &#49352;&#47196; &#49373;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. JACC &#51228;&#44277;&#51088;&#45716; &#46020;&#47700;&#51064;&#51032; <code>domain.xml</code> &#54028;&#51068;&#50640;&#49436; <code>security-service</code> &#50836;&#49548; &#45236;&#50640; <code>jacc-provider</code> &#50836;&#49548;&#47196; &#49373;&#49457;&#46121;&#45768;&#45796;.</p>
<p>&#44592;&#48376; GlassFish Server &#49444;&#52824;&#50640;&#45716; <code>default</code>&#50752; <code>simple</code>&#51060;&#46972;&#45716; &#46160; &#44060;&#51032; JACC &#51228;&#44277;&#51088;&#44032; &#54252;&#54632;&#46121;&#45768;&#45796;. &#51060;&#47084;&#54620; &#46160; &#44060;&#51032; &#44592;&#48376; &#51228;&#44277;&#51088; &#50808;&#50640;&#46020; &#49352;&#47196; &#49373;&#49457;&#54620; &#47784;&#46304; JACC &#51228;&#44277;&#51088;&#44032; &#54252;&#54632;&#46121;&#45768;&#45796;. &#44592;&#48376; GlassFish Server JACC &#51228;&#44277;&#51088;&#45716; JACC &#49324;&#50577;&#51012; &#51456;&#49688;&#54616;&#45716; &#44036;&#45800;&#54620; &#54028;&#51068; &#44592;&#48152; &#44428;&#54620; &#48512;&#50668; &#50644;&#51652;&#51012; &#44396;&#54788;&#54633;&#45768;&#45796;.</p>
<p>&#47784;&#46304; GlassFish Server JACC &#51228;&#44277;&#51088;&#45716; JAAS(Java Authentication and Authorization Service) API&#47484; &#49324;&#50857;&#54644;&#50556; &#54633;&#45768;&#45796;. JAAS&#47484; &#49324;&#50857;&#54616;&#47732; &#49436;&#48708;&#49828;&#50640;&#49436; &#49324;&#50857;&#51088;&#50640; &#46384;&#46972; &#50529;&#49464;&#49828; &#51228;&#50612;&#47484; &#51064;&#51613;&#54616;&#44256; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. JAAS&#45716; &#54364;&#51456; PAM(Pluggable Authentication Module) &#54532;&#47112;&#51076;&#50892;&#53356;&#51032; &#44592;&#49696; &#48260;&#51204;&#51012; &#44396;&#54788;&#54633;&#45768;&#45796;.</p>
<p>JSR 196&#51012; &#49324;&#50857;&#54616;&#50668; &#45796;&#47480; &#44228;&#52789;&#50640;&#49436; &#54540;&#47084;&#44536;&#51064;&#51012; &#44060;&#48156;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. <code>AuthConfigProvider</code> &#48143; <code>AuthConfigFactory</code>&#50752; &#44057;&#51008; &#49352; &#51064;&#51613; &#48169;&#49885;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;&#51012; &#48320;&#44221;&#54616;&#45716; &#54540;&#47084;&#44536;&#51064;&#51012; &#51221;&#51032;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#46608;&#54620; <code>ServerAuthModule</code> &#48143; <code>ClientAuthModule</code>&#44284; &#44057;&#51008; &#49352; &#51064;&#51613; &#48169;&#49885;&#51012; &#51221;&#51032;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>[&#49352; JACC &#51228;&#44277;&#51088;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44396;&#49457; &#51060;&#47492;</dt>
<dd>
<p>&#51060; &#54168;&#51060;&#51648;&#51032; &#49444;&#51221;&#51060; &#51201;&#50857;&#46104;&#45716; &#44396;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51060;&#47492;</dt>
<dd>
<p>JACC &#51228;&#44277;&#51088;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#51060;&#47492;&#51008; <code>domain.xml</code>&#51032; <code>jacc-provider</code> &#50836;&#49548;&#47484; &#52280;&#51312;&#54616;&#45716; &#45936; &#49324;&#50857;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#51221;&#52293; &#44396;&#49457;</dt>
<dd>
<p>&#51228;&#44277;&#51088;&#48324; <code>javax.security.jacc.PolicyConfigurationFactory</code>&#47484; &#44396;&#54788;&#54616;&#45716; <code>javax.security.jacc.PolicyConfigurationFactory.provider</code>&#50640; &#45824;&#54620; &#51221;&#44508;&#54868;&#46108; &#53364;&#47000;&#49828; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51221;&#52293; &#51228;&#44277;&#51088;</dt>
<dd>
<p><code>java.security.Policy</code>&#47484; &#44396;&#54788;&#54616;&#45716; <code>javax.security.jacc.policy.provider</code>&#50640; &#45824;&#54620; &#51221;&#44508;&#54868;&#46108; &#53364;&#47000;&#49828; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52628;&#44032; &#49549;&#49457;</dt>
<dd>
<p>JACC &#51228;&#44277;&#51088;&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51077;&#45768;&#45796;. JACC &#51228;&#44277;&#51088;&#50640; &#49324;&#50857; &#44032;&#45733;&#54620; &#52628;&#44032; &#49549;&#49457;&#50640; &#45824;&#54620; &#49444;&#47749;&#51008; <a href="ref-jaccproviderprop.html">JACC &#51228;&#44277;&#51088; &#44288;&#47144; &#49549;&#49457;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</dd>
</dl>
<a id="sthref395" name="sthref395"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-jaccprovidernew.html">JACC &#51228;&#44277;&#51088;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jaccprovideredit.html">JACC &#51228;&#44277;&#51088;&#47484; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jaccproviderdelete.html">JACC &#51228;&#44277;&#51088;&#47484; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref396" name="sthref396"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00034"><code>create-jacc-provider</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00086"><code>delete-jacc-provider</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00171"><code>list-jacc-providers</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
