<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-editfile-adminrealm" name="ref-editfile-adminrealm"></a></p>

<h4><a id="sthref201" name="sthref201"></a><a id="sthref202" name="sthref202"></a><code>FileRealm</code> &#53364;&#47000;&#49828; &#44288;&#47144; &#49549;&#49457;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p><code>file</code> &#50689;&#50669;&#51032; &#44221;&#50864; &#45796;&#51020; &#49549;&#49457;&#51060; &#54596;&#50836;&#54633;&#45768;&#45796;.</p>
<dl>
<dt>JAAS &#52968;&#53581;&#49828;&#53944;</dt>
<dd>
<p>JAAS(Java Authentication and Authorization Service) &#52968;&#53581;&#49828;&#53944;&#45716; &#51060; &#50689;&#50669;&#50640;&#49436; &#49324;&#50857;&#54624; &#47196;&#44536;&#51064; &#47784;&#46280;&#51032; &#49885;&#48324;&#51088;&#51077;&#45768;&#45796;. &#50976;&#51068;&#54616;&#44172; &#51201;&#54633;&#54620; &#44050;&#51008; <code>fileRealm</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#53412; &#54028;&#51068;</dt>
<dd>
<p>&#49436;&#48260;&#44032; &#51060; &#50689;&#50669;&#50640; &#45824;&#54644; &#49324;&#50857;&#51088;, &#44536;&#47353; &#48143; &#48708;&#48128;&#48264;&#54840; &#51221;&#48372;&#47484; &#51200;&#51109;&#54616;&#45716; &#54028;&#51068;&#51032; &#51204;&#52404; &#44221;&#47196; &#48143; &#51060;&#47492;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>file</code> &#50689;&#50669;&#51032; &#44221;&#50864; domain-dir<code>/config/keyfile</code>&#51060;&#44256;, <code>admin-realm</code> &#50689;&#50669;&#51032; &#44221;&#50864; domain-dir<code>/config/admin-keyfile</code>&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
<p><code>file</code> &#50689;&#50669;&#51032; &#53412; &#54028;&#51068;&#51008; &#52376;&#51020;&#50640; &#48708;&#50612; &#51080;&#51004;&#48064;&#47196; &#49324;&#50857;&#51088;&#44032; <code>file</code> &#50689;&#50669;&#51012; &#49324;&#50857;&#54616;&#44592; &#51204;&#50640; <a href="ref-managefilerealm.html">&#54028;&#51068; &#49324;&#50857;&#51088;</a> &#54168;&#51060;&#51648;&#50640;&#49436; &#52628;&#44032;&#54644;&#50556; &#54633;&#45768;&#45796;.</p>
<p>&#52376;&#51020;&#50640; <code>admin-realm</code> &#50689;&#50669;&#51032; &#53412; &#54028;&#51068;&#50640;&#45716; &#50516;&#54840;&#54868;&#46108; &#54805;&#49885;&#51032; &#44288;&#47532;&#51088; &#51060;&#47492;, &#44288;&#47532;&#51088; &#48708;&#48128;&#48264;&#54840; &#48143; &#51060; &#49324;&#50857;&#51088;&#44032; &#49549;&#54620; &#44536;&#47353;(&#44592;&#48376;&#51201;&#51004;&#47196; <code>asadmin</code>)&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;. <code>admin-realm</code>&#50640; &#49324;&#50857;&#51088;&#47484; &#52628;&#44032;&#54616;&#45716; &#48169;&#48277;&#51008; <a href="task-accessadmintools.html">&#44288;&#47532; &#53812;&#50640; &#50529;&#49464;&#49828; &#44428;&#54620;&#51012; &#48512;&#50668;&#54616;&#45716; &#48169;&#48277;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>

<hr>
<p><b>&#51452;:</b></p>
<code>admin-realm</code>&#51032; <code>asadmin</code> &#44536;&#47353;&#50640; &#49549;&#54620; &#49324;&#50857;&#51088;&#45716; &#44288;&#47532; &#53080;&#49556; &#48143; <code>asadmin</code> &#46020;&#44396;&#47484; &#49324;&#50857;&#54624; &#49688; &#51080;&#45716; &#44428;&#54620;&#51060; &#48512;&#50668;&#46121;&#45768;&#45796;. &#51060; &#44536;&#47353;&#50640;&#45716; &#49436;&#48260; &#44288;&#47532; &#44428;&#54620;&#51012; &#44032;&#51652; &#49324;&#50857;&#51088;&#47564; &#52628;&#44032;&#54616;&#49901;&#49884;&#50724;.
<hr>

<p><code>file</code> &#50689;&#50669;&#51032; &#44221;&#50864; &#45796;&#51020;&#44284; &#44057;&#51008; &#49440;&#53469;&#51201; &#49549;&#49457;&#51012; &#49324;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44536;&#47353; &#51648;&#51221;</dt>
<dd>
<p>&#49788;&#54364;&#47196; &#44396;&#48516;&#46108; &#44536;&#47353; &#51060;&#47492; &#47785;&#47197;&#51077;&#45768;&#45796;. &#51201;&#54633;&#54620; &#51064;&#51613;&#49436;&#47484; &#51228;&#44277;&#54616;&#45716; &#47784;&#46304; &#53364;&#46972;&#51060;&#50616;&#53944;&#44032; &#51060;&#47084;&#54620; &#44536;&#47353;&#50640; &#51648;&#51221;&#46121;&#45768;&#45796;. &#50696;&#47484; &#46308;&#50612; <code>employee,manager</code>&#45716; &#49324;&#50857;&#51088; &#44536;&#47353;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
