<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-securityadmin" name="ref-securityadmin"></a><a id="GHCOM00060" name="GHCOM00060"></a></p>

<h4>&#48372;&#50504; &#44288;&#47532;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#48372;&#50504; &#44288;&#47532;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#48372;&#50504; &#44288;&#47532;&#47484; &#49324;&#50857; &#46608;&#45716; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#48372;&#50504; &#44288;&#47532;&#44032; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864;:</p>
<ul>
<li>
<p>&#46020;&#47700;&#51064;&#51032; &#51064;&#49828;&#53556;&#49828; &#48143; DAS&#44032; SSL &#51064;&#51613;&#49436;&#47484; &#49324;&#50857;&#54616;&#50668; &#49436;&#47196;&#50640;&#44172; &#48372;&#45236;&#45716; &#47700;&#49884;&#51648;&#47484; &#50516;&#54840;&#54868;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>DAS&#45716; &#50896;&#44201; &#44288;&#47532; &#53364;&#46972;&#51060;&#50616;&#53944;(&#50696;: asadmin &#50976;&#54008;&#47532;&#54000; &#48143; IDE)&#50640;&#49436; &#48372;&#45236;&#45716; &#44288;&#47532; &#47700;&#49884;&#51648;&#47484; &#54728;&#50857;&#54633;&#45768;&#45796;.</p>
</li>
</ul>
<p>[&#48372;&#50504; &#44288;&#47532;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#51221;&#48372;&#44032; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#48372;&#50504; &#44288;&#47532; &#49324;&#50857;</dt>
<dd>
<p>&#48372;&#50504; &#44288;&#47532;&#47484; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#51060; &#45800;&#52628;&#45716; &#48372;&#50504; &#44288;&#47532;&#44032; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#51648; &#50506;&#51008; &#44221;&#50864;&#50640;&#47564; &#45208;&#53440;&#45225;&#45768;&#45796;.</p>

<hr>
<p><b>&#51452;:</b></p>
&#46020;&#47700;&#51064;&#51032; &#44288;&#47532; &#49324;&#50857;&#51088;&#44032; &#48712; &#48708;&#48128;&#48264;&#54840;&#47484; &#49324;&#50857;&#54616;&#45716; &#44221;&#50864; &#48372;&#50504; &#44288;&#47532;&#47484; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.
<hr>

</dd>
<dt>&#48372;&#50504; &#44288;&#47532; &#49324;&#50857; &#50504;&#54632;</dt>
<dd>
<p>&#48372;&#50504; &#44288;&#47532;&#47484; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#51060; &#45800;&#52628;&#45716; &#48372;&#50504; &#44288;&#47532;&#44032; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864;&#50640;&#47564; &#45208;&#53440;&#45225;&#45768;&#45796;.</p>
</dd>
<dt>&#44288;&#47532; &#48324;&#52845;</dt>
<dd>
<p>DAS&#51032; SSL/TLS &#51064;&#51613;&#49436;&#47484; &#45208;&#53440;&#45236;&#45716; &#48324;&#52845;&#51077;&#45768;&#45796;. &#51060; &#48324;&#52845;&#51008; &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54644; DAS&#47484; &#49885;&#48324;&#54616;&#45716; &#45936; &#49324;&#50857;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>s1as</code>&#51077;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#48372;&#50504; &#44288;&#47532;&#44032; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#51648; &#50506;&#51008; &#44221;&#50864;&#50640;&#47564; &#45208;&#53440;&#45225;&#45768;&#45796;.</p>
</dd>
<dt>&#51064;&#49828;&#53556;&#49828; &#48324;&#52845;</dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#51032; SSL/TLS &#51064;&#51613;&#49436;&#47484; &#45208;&#53440;&#45236;&#45716; &#48324;&#52845;&#51077;&#45768;&#45796;. &#51060; &#48324;&#52845;&#51008; DAS&#50640; &#45824;&#54644; &#51064;&#49828;&#53556;&#49828;&#47484; &#49885;&#48324;&#54616;&#45716; &#45936; &#49324;&#50857;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>glassfish-instance</code>&#51077;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#48372;&#50504; &#44288;&#47532;&#44032; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#51648; &#50506;&#51008; &#44221;&#50864;&#50640;&#47564; &#45208;&#53440;&#45225;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref244" name="sthref244"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-enable-secure-admin.html">&#48372;&#50504; &#44288;&#47532;&#47484; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-disable-secure-admin.html">&#48372;&#50504; &#44288;&#47532;&#47484; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref245" name="sthref245"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00129"><code>enable-secure-admin</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00121"><code>disable-secure-admin</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
