<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-serverinstjvmgeneral" name="ref-serverinstjvmgeneral"></a></p>

<h4><a id="sthref325" name="sthref325"></a>JVM &#51068;&#48152; &#49444;&#51221;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>JVM(Java Virtual Machine)&#51012; &#53685;&#54644; Java &#48148;&#51060;&#53944; &#53076;&#46300;&#47484; &#47932;&#47532;&#51201; &#49884;&#49828;&#53596;&#50640;&#49436; &#49892;&#54665;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. JVM &#49444;&#51221;&#51012; &#51312;&#51221;&#54616;&#50668; &#49457;&#45733;&#51012; &#54693;&#49345;&#49884;&#53412;&#44256; &#47700;&#47784;&#47532; &#54624;&#45817; &#50724;&#47448;&#47484; &#48169;&#51648;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>Java Virtual Machine&#51008; GlassFish Server&#50640; &#54596;&#50836;&#54620; Java Platform, Standard Edition(Java SE &#54540;&#47019;&#54268;)&#50640; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;. JVM &#49444;&#51221;&#51060; &#50732;&#48148;&#47476;&#51648; &#50506;&#51004;&#47732; &#49436;&#48260;&#44032; &#49892;&#54665;&#46104;&#51648; &#50506;&#51004;&#48064;&#47196; &#51060; &#49444;&#51221;&#51012; &#48320;&#44221;&#54624; &#46412; &#51452;&#51032;&#54644;&#50556; &#54633;&#45768;&#45796;.</p>

<hr>
<p><b>&#51452;:</b></p>
"Java Virtual Machine"&#44284; "JVM"&#51008; Java &#54540;&#47019;&#54268;&#50857; &#44032;&#49345; &#49884;&#49828;&#53596;&#51012; &#51032;&#48120;&#54633;&#45768;&#45796;.
<hr>

<p>[JVM &#51068;&#48152; &#49444;&#51221;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44592;&#48376;&#44050; &#47196;&#46300;</dt>
<dd>
<p>&#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#45716; &#49444;&#51221;&#51012; &#44592;&#48376;&#44050;&#51004;&#47196; &#48373;&#50896;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#49444;&#51221;&#51008; &#48320;&#44221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#44396;&#49457; &#51060;&#47492;</dt>
<dd>
<p>&#51060; &#54168;&#51060;&#51648;&#51032; &#49444;&#51221;&#51060; &#51201;&#50857;&#46104;&#45716; &#44396;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>Java &#54856;</dt>
<dd>
<p>GlassFish Server&#47484; &#49892;&#54665;&#54616;&#45716; &#45936; &#54596;&#50836;&#54620; Java SE &#49548;&#54532;&#53944;&#50920;&#50612;&#51032; &#49444;&#52824; &#46356;&#47113;&#53664;&#47532; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51648;&#51221;&#54620; Java SE &#49548;&#54532;&#53944;&#50920;&#50612; &#48260;&#51204;&#51060; &#51060; &#47540;&#47532;&#49828;&#50640;&#49436; &#51648;&#50896;&#46104;&#45716;&#51648; &#54869;&#51064;&#54616;&#47140;&#47732; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRLN"><i>Oracle GlassFish Server &#47540;&#47532;&#49828; &#45432;&#53944;</i></a>&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;. &#51316;&#51116;&#54616;&#51648; &#50506;&#45716; &#46356;&#47113;&#53664;&#47532; &#51060;&#47492;&#51012; &#51077;&#47141;&#54616;&#44144;&#45208; &#51648;&#50896;&#46104;&#51648; &#50506;&#45716; Java SE &#49548;&#54532;&#53944;&#50920;&#50612; &#48260;&#51204;&#51032; &#46356;&#47113;&#53664;&#47532;&#47484; &#51077;&#47141;&#54616;&#47732; GlassFish Server&#44032; &#49884;&#51089;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>Javac &#50741;&#49496;</dt>
<dd>
<p>Java &#54532;&#47196;&#44536;&#47000;&#48141; &#50616;&#50612; &#52980;&#54028;&#51068;&#47084;&#50640; &#45824;&#54620; &#47749;&#47161;&#54665; &#50741;&#49496;&#51077;&#45768;&#45796;. EJB(Enterprise JavaBeans) &#44396;&#49457; &#50836;&#49548;&#44032; &#48176;&#52824;&#46104;&#47732; GlassFish Server&#50640;&#49436; &#52980;&#54028;&#51068;&#47084;&#44032; &#49892;&#54665;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#46356;&#48260;&#44536;</dt>
<dd>
<p>JPDA(Java Platform Debugger Architecture)&#47196; &#46356;&#48260;&#44613;&#54624; &#49688; &#51080;&#46020;&#47197; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
<p>JPDA&#45716; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#44060;&#48156;&#51088;&#44032; &#49324;&#50857;&#54633;&#45768;&#45796;. &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDVG"><i>Oracle GlassFish Server Application Development Guide</i></a>&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</dd>
<dt>&#46356;&#48260;&#44536; &#50741;&#49496;</dt>
<dd>
<p>&#46356;&#48260;&#44613;&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; JVM&#50640; &#51204;&#45804;&#46104;&#45716; JPDA &#50741;&#49496;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>RMI &#52980;&#54028;&#51068; &#50741;&#49496;</dt>
<dd>
<p><code>rmic</code> &#52980;&#54028;&#51068;&#47084;&#50640; &#45824;&#54620; &#47749;&#47161;&#54665; &#50741;&#49496;&#51077;&#45768;&#45796;. EJB &#44396;&#49457; &#50836;&#49548;&#44032; &#48176;&#52824;&#46104;&#47732; GlassFish Server&#44032; <code>rmic</code> &#52980;&#54028;&#51068;&#47084;&#47484; &#49892;&#54665;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#48148;&#51060;&#53944; &#53076;&#46300; &#49440;&#54665; &#54532;&#47196;&#49464;&#49436;</dt>
<dd>
<p>&#48148;&#51060;&#53944; &#53076;&#46300; &#49440;&#54665; &#52376;&#47532;&#47484; &#50948;&#54620; &#53364;&#47000;&#49828;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#53364;&#47000;&#49828; &#51060;&#47492;&#51012; &#44396;&#48516;&#54616;&#47140;&#47732; &#53092;&#47560;&#47484; &#49324;&#50857;&#54633;&#45768;&#45796;. &#53364;&#47000;&#49828;&#47560;&#45796; com.sun.appserv.BytecodePreprocessor &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#44396;&#54788;&#54644;&#50556; &#54633;&#45768;&#45796;. &#51648;&#51221;&#54620; &#49692;&#49436;&#45824;&#47196; &#53364;&#47000;&#49828;&#44032; &#54840;&#52636;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#52628;&#44032; &#49549;&#49457;</dt>
<dd>
<p>JVM&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51077;&#45768;&#45796;. GlassFish Server&#50640;&#49436;&#45716; JVM&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51012; &#51221;&#51032;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref326" name="sthref326"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-jvmsettings.html">JVM &#51068;&#48152; &#49444;&#51221;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jvmpathsettings.html">JVM &#44221;&#47196; &#49444;&#51221;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jvmoptions.html">JVM &#50741;&#49496;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-securitymanagerdisable.html">&#48372;&#50504; &#44288;&#47532;&#51088;&#47484; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jvmprofilersettings.html">JVM &#54532;&#47196;&#54028;&#51068;&#47084; &#49444;&#51221;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref327" name="sthref327"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<p>&#50630;&#51020;</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
