<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-lifecyclemodules" name="ref-lifecyclemodules"></a><a id="GHCOM00079" name="GHCOM00079"></a></p>

<h4><a id="sthref311" name="sthref311"></a>&#49688;&#47749; &#51452;&#44592; &#47784;&#46280;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#49688;&#47749; &#51452;&#44592; &#47784;&#46280;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#49688;&#47749; &#51452;&#44592; &#47784;&#46280;&#51012; &#44396;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#49688;&#47749; &#51452;&#44592; &#47784;&#46280;&#51008; &#49436;&#48260;&#51032; &#49688;&#47749; &#51452;&#44592;&#50640;&#49436; &#54620; &#44060; &#51060;&#49345;&#51032; &#51060;&#48292;&#53944;&#47196; &#49892;&#54665;&#46104;&#47732; &#51089;&#50629;&#51012; &#49688;&#54665;&#54633;&#45768;&#45796;. &#48156;&#49373;&#54624; &#49688; &#51080;&#45716; &#53944;&#47532;&#44144; &#49436;&#48260; &#51060;&#48292;&#53944;&#50640;&#45716; &#52488;&#44592;&#54868;, &#49884;&#51089;, &#50836;&#52397; &#49436;&#48708;&#49828; &#51456;&#48708; &#48143; &#51333;&#47308; &#46321;&#51060; &#51080;&#49845;&#45768;&#45796;. &#49688;&#47749; &#51452;&#44592; &#47784;&#46280;&#51008; Java EE &#49324;&#50577;&#51032; &#51068;&#48512;&#44032; &#50500;&#45768;&#51648;&#47564; GlassFish Server&#51032; &#44060;&#49440; &#49324;&#54637;&#51077;&#45768;&#45796;.</p>
<p>&#44033; &#49688;&#47749; &#51452;&#44592; &#47784;&#46280;&#50640; &#45824;&#54644; &#51228;&#44277;&#46104;&#45716; &#51221;&#48372;&#45716; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#51060;&#47492;</dt>
<dd>
<p>&#49688;&#47749; &#51452;&#44592; &#47784;&#46280;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49324;&#50857; &#46608;&#45716; &#49345;&#53468;</dt>
<dd>
<p>&#44592;&#48376; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;(<code>server</code>)&#47564; &#51080;&#45716; &#44221;&#50864; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#47732; &#49440;&#53469; &#54364;&#49884;&#44032; &#45208;&#53440;&#45208;&#44256; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#47732; X &#54364;&#49884;&#44032; &#45208;&#53440;&#45225;&#45768;&#45796;.</p>
<p>&#53364;&#47084;&#49828;&#53552; &#46608;&#45716; &#45796;&#47480; &#46021;&#47549;&#54805; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#44032; &#51080;&#45716; &#44221;&#50864; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#48176;&#52824;&#46104;&#45716; &#45824;&#49345;&#51012; &#48372;&#47140;&#47732; &#47784;&#46304; &#45824;&#49345;&#50640;&#49436; &#49324;&#50857;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#47196;&#46300; &#49692;&#49436;</dt>
<dd>
<p>&#49688;&#47749; &#51452;&#44592; &#47784;&#46280;&#51012; &#47196;&#46300;&#54644;&#50556; &#54624; &#49345;&#45824;&#51201; &#49692;&#49436;&#47484; &#51648;&#51221;&#54616;&#45716; &#44050;&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
<p>&#49688;&#47749; &#51452;&#44592; &#47784;&#46280; &#53580;&#51060;&#48660;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#46020; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#49352;&#47196; &#47564;&#46308;&#44592;</dt>
<dd>
<p>&#49352; &#49688;&#47749; &#51452;&#44592; &#47784;&#46280;&#51012; &#49373;&#49457;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49325;&#51228;</dt>
<dd>
<p>&#49440;&#53469;&#54620; &#49688;&#47749; &#51452;&#44592; &#47784;&#46280;&#51012; &#54616;&#45208; &#51060;&#49345; &#49325;&#51228;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49324;&#50857;</dt>
<dd>
<p>&#49440;&#53469;&#54620; &#54616;&#45208; &#51060;&#49345;&#51032; &#49688;&#47749; &#51452;&#44592; &#47784;&#46280;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#44592;&#48376; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;(<code>server</code>)&#47564; &#51080;&#45716; &#44221;&#50864;&#50640; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#49324;&#50857; &#50504;&#54632;</dt>
<dd>
<p>&#49440;&#53469;&#54620; &#54616;&#45208; &#51060;&#49345;&#51032; &#49688;&#47749; &#51452;&#44592; &#47784;&#46280;&#51012; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#44592;&#48376; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;(<code>server</code>)&#47564; &#51080;&#45716; &#44221;&#50864;&#50640; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref312" name="sthref312"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-lifecyclemodulenew.html">&#49688;&#47749; &#51452;&#44592; &#47784;&#46280;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-lifecyclemoduleedit.html">&#49688;&#47749; &#51452;&#44592; &#47784;&#46280;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-lifecyclemoduledelete.html">&#49688;&#47749; &#51452;&#44592; &#47784;&#46280;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref313" name="sthref313"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00043"><code>create-lifecycle-module</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00181"><code>list-lifecycle-modules</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00095"><code>delete-lifecycle-module</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
