<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-messagesecurityproviderconfigedit" name="ref-messagesecurityproviderconfigedit"></a><a id="GHCOM00124" name="GHCOM00124"></a></p>

<h4><a id="sthref419" name="sthref419"></a>&#51228;&#44277;&#51088; &#44396;&#49457; &#54200;&#51665;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#51228;&#44277;&#51088; &#44396;&#49457; &#54200;&#51665;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#47700;&#49884;&#51648; &#48372;&#50504; &#51228;&#44277;&#51088; &#44396;&#49457;&#51012; &#49688;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>[&#51228;&#44277;&#51088; &#44396;&#49457; &#54200;&#51665;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44396;&#49457; &#51060;&#47492;</dt>
<dd>
<p>&#51060; &#54168;&#51060;&#51648;&#51032; &#49444;&#51221;&#51060; &#51201;&#50857;&#46104;&#45716; &#44396;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51064;&#51613; &#44228;&#52789;</dt>
<dd>
<p>&#51060; &#51228;&#44277;&#51088; &#44396;&#49457;&#51060; &#49373;&#49457;&#46108; &#51064;&#51613; &#44228;&#52789;(SOAP &#46608;&#45716; HttpServlet)&#51077;&#45768;&#45796;. &#51069;&#44592; &#51204;&#50857; &#54596;&#46300;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51228;&#44277;&#51088; ID</dt>
<dd>
<p>&#47700;&#49884;&#51648; &#48372;&#50504; &#51228;&#44277;&#51088; &#44396;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51069;&#44592; &#51204;&#50857; &#54596;&#46300;&#51077;&#45768;&#45796;. &#49352; &#47700;&#49884;&#51648; &#48372;&#50504; &#51228;&#44277;&#51088; &#44396;&#49457;&#51012; &#49373;&#49457;&#54624; &#46412;&#47564; &#51228;&#44277;&#51088; ID&#47484; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#44592;&#48376; &#51228;&#44277;&#51088;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; &#51060; &#51228;&#44277;&#51088;&#44032; &#44592;&#48376; &#51228;&#44277;&#51088;&#44032; &#46121;&#45768;&#45796;. &#44592;&#48376; &#51228;&#44277;&#51088;&#45716; &#53945;&#51221; &#51228;&#44277;&#51088;&#47484; &#49885;&#48324;&#54616;&#51648; &#50506;&#45716; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#54840;&#52636;&#46121;&#45768;&#45796;. &#51228;&#44277;&#51088;&#44032; &#44592;&#48376; &#53364;&#46972;&#51060;&#50616;&#53944; &#51228;&#44277;&#51088;&#45208; &#44592;&#48376; &#49436;&#48260; &#51228;&#44277;&#51088;&#51064;&#51648; &#46608;&#45716; &#46168; &#45796;&#51064;&#51648;&#45716; &#51228;&#44277;&#51088; &#50976;&#54805;&#51004;&#47196; &#44208;&#51221;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#51228;&#44277;&#51088; &#50976;&#54805;</dt>
<dd>
<p>&#51228;&#44277;&#51088;&#51032; &#50976;&#54805;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. &#49324;&#50857; &#44032;&#45733;&#54620; &#49440;&#53469; &#54637;&#47785;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt><code>client</code></dt>
<dd>
<p>&#51228;&#44277;&#51088;&#44032; &#53364;&#46972;&#51060;&#50616;&#53944; &#51064;&#51613; &#51228;&#44277;&#51088;&#51076;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
</dd>
<dt><code>server</code></dt>
<dd>
<p>&#51228;&#44277;&#51088;&#44032; &#49436;&#48260; &#51064;&#51613; &#51228;&#44277;&#51088;&#51076;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
</dd>
<dt><code>client-server</code></dt>
<dd>
<p>&#51228;&#44277;&#51088;&#44032; &#53364;&#46972;&#51060;&#50616;&#53944; &#48143; &#49436;&#48260; &#51064;&#51613; &#51228;&#44277;&#51088;&#51076;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
</dd>
</dl>
</dd>
<dt>&#53364;&#47000;&#49828; &#51060;&#47492;</dt>
<dd>
<p>&#51228;&#44277;&#51088;&#51032; Java &#44396;&#54788; &#53364;&#47000;&#49828;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#53364;&#46972;&#51060;&#50616;&#53944; &#51064;&#51613; &#51228;&#44277;&#51088;&#45716; <code>com.sun.enterprise.security.jauth.ClientAuthModule</code> &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#44396;&#54788;&#54644;&#50556; &#54633;&#45768;&#45796;. &#49436;&#48260;&#52769; &#51228;&#44277;&#51088;&#45716; <code>com.sun.enterprise.security.jauth.ServerAuthModule</code> &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#44396;&#54788;&#54644;&#50556; &#54633;&#45768;&#45796;. &#53364;&#46972;&#51060;&#50616;&#53944;-&#49436;&#48260; &#51228;&#44277;&#51088;&#45716; &#46160; &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#47784;&#46160; &#44396;&#54788;&#54644;&#50556; &#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#49548;&#49828; &#51064;&#51613;(&#50836;&#52397; &#51221;&#52293;&#50857;)</dt>
<dd>
<p>&#50836;&#52397; &#51221;&#52293;&#50640; &#45824;&#54620; &#54596;&#49688; &#51064;&#51613;&#51032; &#50976;&#54805;&#51077;&#45768;&#45796;. &#50836;&#52397; &#51221;&#52293;&#51008; &#51064;&#51613; &#51228;&#44277;&#51088;&#44032; &#49688;&#54665;&#54616;&#45716; &#50836;&#52397; &#52376;&#47532;&#47484; &#44208;&#51221;&#54633;&#45768;&#45796;. &#50836;&#52397; &#51221;&#52293; &#54596;&#46300;&#45716; &#49440;&#53469; &#49324;&#54637;&#51060;&#51648;&#47564; &#51060;&#47484; &#51648;&#51221;&#54616;&#51648; &#50506;&#51012; &#44221;&#50864; &#51064;&#51613; &#51228;&#44277;&#51088;&#44032; &#50836;&#52397; &#47700;&#49884;&#51648;&#47484; &#51064;&#51613;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
<p><code>sender</code>&#47484; &#49440;&#53469;&#54616;&#47732; &#50836;&#52397; &#47700;&#49884;&#51648;&#50640; &#45824;&#54620; &#47700;&#49884;&#51648; &#44228;&#52789;&#51032; &#48372;&#45236;&#45716; &#49324;&#46988; &#51064;&#51613;(&#50696;: &#49324;&#50857;&#51088; &#51060;&#47492; &#48143; &#48708;&#48128;&#48264;&#54840;)&#51012; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. <code>content</code>&#47484; &#49440;&#53469;&#54616;&#47732; &#50836;&#52397; &#47700;&#49884;&#51648;&#50640; &#45824;&#54620; &#45236;&#50857; &#51064;&#51613;(&#50696;: &#46356;&#51648;&#53560; &#49436;&#47749;)&#51012; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#50836;&#52397;&#51032; &#49548;&#49828;&#47484; &#51064;&#51613;&#54616;&#51648; &#50506;&#51004;&#47140;&#47732; &#54596;&#46300;&#47484; &#48708;&#50892;&#46177;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; &#51064;&#51613; &#50976;&#54805;&#51008; &#49440;&#53469;&#46104;&#50612; &#51080;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
<p>SOAP &#47700;&#49884;&#51648; &#48372;&#50504; &#51228;&#44277;&#51088;&#44032; &#49688;&#54665;&#54616;&#45716; &#51089;&#50629;&#50640; &#45824;&#54620; &#49444;&#47749;&#51008; <a href="ref-configreq-respolicy.html">&#50836;&#52397; &#48143; &#51025;&#45813; &#51221;&#52293; &#44396;&#49457;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</dd>
<dt>&#49688;&#49888;&#51088; &#51064;&#51613;(&#50836;&#52397; &#51221;&#52293;&#50857;)</dt>
<dd>
<p>&#49688;&#49888;&#51088; &#51064;&#51613;&#51012; &#50836;&#52397; &#51221;&#52293;&#50640; &#45824;&#54620; &#45236;&#50857; &#51064;&#51613; &#51060;&#51204;&#50640; &#49688;&#54665;&#54624;&#51648; &#51060;&#54980;&#50640; &#49688;&#54665;&#54624;&#51648; &#50668;&#48512;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<p><code>before-content</code> &#46608;&#45716; <code>after-content</code>&#47484; &#49440;&#53469;&#54616;&#50668; &#48372;&#45236;&#45716; &#49324;&#46988;&#51032; &#50836;&#52397; &#47700;&#49884;&#51648; &#49688;&#49888;&#51088;&#50640; &#45824;&#54620; &#47700;&#49884;&#51648; &#44228;&#52789; &#51064;&#51613;&#51012; &#50836;&#44396;&#54633;&#45768;&#45796;(XML &#50516;&#54840;&#54868;). &#44050;&#51012; &#51648;&#51221;&#54616;&#51648; &#50506;&#51004;&#47732; &#44592;&#48376;&#44050;&#51008; <code>after-content</code>&#51077;&#45768;&#45796;. &#51221;&#52293;&#51008; &#47700;&#49884;&#51648; &#48372;&#45236;&#45716; &#49324;&#46988;&#51032; &#49692;&#49436;&#47196; &#54364;&#49884;&#46104;&#48064;&#47196; <code>after-content</code>&#45716; &#47700;&#49884;&#51648; &#49688;&#49888;&#51088;&#44032; &#49436;&#47749;&#51012; &#44160;&#51613;&#54616;&#44592; &#51204;&#50640; &#47700;&#49884;&#51648;&#47484; &#54644;&#46021;&#54620;&#45796;&#45716; &#44163;&#51012; &#51032;&#48120;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#49548;&#49828; &#51064;&#51613;(&#51025;&#45813; &#51221;&#52293;&#50857;)</dt>
<dd>
<p>&#51025;&#45813; &#51221;&#52293;&#50640; &#45824;&#54620; &#54596;&#49688; &#51064;&#51613;&#51032; &#50976;&#54805;&#51077;&#45768;&#45796;. &#51025;&#45813; &#51221;&#52293;&#51008; &#51064;&#51613; &#51228;&#44277;&#51088;&#44032; &#49688;&#54665;&#54616;&#45716; &#51025;&#45813; &#52376;&#47532;&#47484; &#44208;&#51221;&#54633;&#45768;&#45796;. &#51025;&#45813; &#51221;&#52293; &#54596;&#46300;&#45716; &#49440;&#53469; &#49324;&#54637;&#51060;&#51648;&#47564; &#51060;&#47484; &#51648;&#51221;&#54616;&#51648; &#50506;&#45716; &#44221;&#50864; &#51025;&#45813; &#47700;&#49884;&#51648;&#50640; &#51064;&#51613;&#51060; &#51201;&#50857;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
<p><code>sender</code>&#47484; &#49440;&#53469;&#54616;&#47732; &#51025;&#45813; &#47700;&#49884;&#51648;&#50640; &#45824;&#54620; &#47700;&#49884;&#51648; &#44228;&#52789;&#51032; &#48372;&#45236;&#45716; &#49324;&#46988; &#51064;&#51613;(&#50696;: &#49324;&#50857;&#51088; &#48708;&#48128;&#48264;&#54840;)&#51012; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. <code>content</code>&#47484; &#49440;&#53469;&#54616;&#47732; &#51025;&#45813; &#47700;&#49884;&#51648;&#50640; &#45824;&#54620; &#45236;&#50857; &#51064;&#51613;(&#50696;: &#46356;&#51648;&#53560; &#49436;&#47749;)&#51012; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51025;&#45813; &#49548;&#49828;&#47484; &#51064;&#51613;&#54616;&#51648; &#50506;&#51004;&#47140;&#47732; &#54596;&#46300;&#47484; &#48708;&#50892;&#46177;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; &#51064;&#51613; &#50976;&#54805;&#51008; &#49440;&#53469;&#46104;&#50612; &#51080;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
<p>SOAP &#47700;&#49884;&#51648; &#48372;&#50504; &#51228;&#44277;&#51088;&#44032; &#49688;&#54665;&#54616;&#45716; &#51089;&#50629;&#50640; &#45824;&#54620; &#49444;&#47749;&#51008; <a href="ref-configreq-respolicy.html">&#50836;&#52397; &#48143; &#51025;&#45813; &#51221;&#52293; &#44396;&#49457;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</dd>
<dt>&#49688;&#49888;&#51088; &#51064;&#51613;(&#51025;&#45813; &#51221;&#52293;&#50857;)</dt>
<dd>
<p>&#49688;&#49888;&#51088; &#51064;&#51613;&#51012; &#51025;&#45813; &#51221;&#52293;&#50640; &#45824;&#54620; &#45236;&#50857; &#51064;&#51613; &#51060;&#51204;&#50640; &#49688;&#54665;&#54624;&#51648; &#51060;&#54980;&#50640; &#49688;&#54665;&#54624;&#51648; &#50668;&#48512;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<p><code>before-content</code> &#46608;&#45716; <code>after-content</code>&#47484; &#49440;&#53469;&#54616;&#50668; &#48372;&#45236;&#45716; &#49324;&#46988;&#51032; &#51025;&#45813; &#47700;&#49884;&#51648; &#49688;&#49888;&#51088;&#50640; &#45824;&#54620; &#47700;&#49884;&#51648; &#44228;&#52789; &#51064;&#51613;&#51032; &#50836;&#44396; &#49324;&#54637;&#51012; &#51221;&#51032;&#54633;&#45768;&#45796;(XML &#50516;&#54840;&#54868;). &#44050;&#51012; &#51648;&#51221;&#54616;&#51648; &#50506;&#51004;&#47732; &#44592;&#48376;&#44050;&#51008; <code>after-content</code>&#51077;&#45768;&#45796;. &#51221;&#52293;&#51008; &#47700;&#49884;&#51648; &#48372;&#45236;&#45716; &#49324;&#46988;&#51032; &#49692;&#49436;&#47196; &#54364;&#49884;&#46104;&#48064;&#47196; <code>after-content</code>&#45716; &#47700;&#49884;&#51648; &#49688;&#49888;&#51088;&#44032; &#49436;&#47749;&#51012; &#44160;&#51613;&#54616;&#44592; &#51204;&#50640; &#47700;&#49884;&#51648;&#47484; &#54644;&#46021;&#54620;&#45796;&#45716; &#44163;&#51012; &#51032;&#48120;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#52628;&#44032; &#49549;&#49457;</dt>
<dd>
<p>&#47700;&#49884;&#51648; &#48372;&#50504; &#51228;&#44277;&#51088; &#44396;&#49457;&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51077;&#45768;&#45796;. &#51228;&#44277;&#51088; &#44396;&#49457;&#50640; &#49324;&#50857; &#44032;&#45733;&#54620; &#52628;&#44032; &#49549;&#49457;&#50640; &#45824;&#54620; &#49444;&#47749;&#51008; <a href="ref-messagesecurityproviderconfigprops.html">&#47700;&#49884;&#51648; &#48372;&#50504; &#51228;&#44277;&#51088; &#44396;&#49457; &#44288;&#47144; &#49549;&#49457;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</dd>
</dl>
<a id="sthref420" name="sthref420"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">&#47700;&#49884;&#51648; &#48372;&#50504; &#51228;&#44277;&#51088;&#44032; &#49324;&#50857;&#54616;&#46020;&#47197; GlassFish Server &#44592;&#45733;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">&#47700;&#49884;&#51648; &#48372;&#50504; &#44396;&#49457;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">&#47700;&#49884;&#51648; &#48372;&#50504; &#44396;&#49457;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">&#47700;&#49884;&#51648; &#48372;&#50504; &#44396;&#49457;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">&#47700;&#49884;&#51648; &#48372;&#50504; &#51228;&#44277;&#51088; &#44396;&#49457;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">&#47700;&#49884;&#51648; &#48372;&#50504; &#51228;&#44277;&#51088; &#44396;&#49457;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">&#47700;&#49884;&#51648; &#48372;&#50504; &#51228;&#44277;&#51088; &#44396;&#49457;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#53364;&#46972;&#51060;&#50616;&#53944;&#50640; &#45824;&#54644; &#47700;&#49884;&#51648; &#48372;&#50504;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref421" name="sthref421"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00045"><code>create-message-security-provider</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00184"><code>list-message-security-providers</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00097"><code>delete-message-security-provider</code>(1)</a></p>
</li>
</ul>
<p>&#46608;&#54620; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00226"><code>set</code>(1)</a> &#47749;&#47161;&#51012; &#49324;&#50857;&#54616;&#50668; &#50836;&#52397; &#48143; &#51025;&#45813; &#51221;&#52293;&#51012; &#49688;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#51025;&#45813; &#51221;&#52293;&#51012; &#49444;&#51221;&#54616;&#47140;&#47732; &#45796;&#51020; &#47749;&#47161;&#51032; <code>request</code> &#45800;&#50612;&#47484; <code>response</code>&#47196; &#48148;&#45001;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#50836;&#52397; &#51221;&#52293;&#51012; &#53364;&#46972;&#51060;&#50616;&#53944;&#50640; &#52628;&#44032;&#54616;&#44256; &#51064;&#51613; &#49548;&#49828;&#47484; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
<pre>
asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
provider-config.ClientProvider.request-policy.auth_source=
sender | content
</pre></li>
<li>
<p>&#50836;&#52397; &#51221;&#52293;&#51012; &#49436;&#48260;&#50640; &#52628;&#44032;&#54616;&#44256; &#51064;&#51613; &#49548;&#49828;&#47484; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
<pre>
asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
provider-config.ServerProvider.request-policy.auth_source=
sender | content
</pre></li>
<li>
<p>&#50836;&#52397; &#51221;&#52293;&#51012; &#53364;&#46972;&#51060;&#50616;&#53944;&#50640; &#52628;&#44032;&#54616;&#44256; &#51064;&#51613; &#49688;&#49888;&#51088;&#47484; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
<pre>
asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
provider-config.ClientProvider.request-policy.auth_recipient=
before-content | after-content
</pre></li>
<li>
<p>&#50836;&#52397; &#51221;&#52293;&#51012; &#49436;&#48260;&#50640; &#52628;&#44032;&#54616;&#44256; &#51064;&#51613; &#49688;&#49888;&#51088;&#47484; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
<pre>
asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
provider-config.ServerProvider.request-policy.auth_recipient=
before-content | after-content
</pre></li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
