<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-uc-config" name="ref-uc-config"></a></p>

<h4><a id="sthref259" name="sthref259"></a>&#50629;&#45936;&#51060;&#53944; &#46020;&#44396; &#44396;&#49457;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#44396;&#49457;] &#54168;&#51060;&#51648;&#45716; &#50629;&#45936;&#51060;&#53944; &#46020;&#44396;&#50640; &#45824;&#54620; &#44396;&#49457; &#51221;&#48372;&#47484; &#51228;&#44277;&#54616;&#48064;&#47196; &#51060; &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#50629;&#45936;&#51060;&#53944; &#46020;&#44396;&#50640;&#49436; &#51064;&#53552;&#45367;&#50640; &#51217;&#49549;&#54616;&#45716; &#48169;&#48277;&#51012; &#48320;&#44221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#50629;&#45936;&#51060;&#53944; &#46020;&#44396; &#44396;&#49457;&#51032; &#45796;&#47480; &#48512;&#48516;&#51012; &#48320;&#44221;&#54616;&#47140;&#47732; as-install-parent<code>/bin</code>&#50640; &#51080;&#45716; &#46021;&#47549;&#54805; <code>updatetool</code> &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#49324;&#50857;&#54633;&#45768;&#45796;.</p>
<p>&#50629;&#45936;&#51060;&#53944; &#46020;&#44396; &#44396;&#49457; &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#49444;&#52824; &#44221;&#47196;</dt>
<dd>
<p>&#49444;&#52824; &#51060;&#48120;&#51648;&#51032; &#47336;&#53944; &#46608;&#45716; &#52572;&#49345;&#50948; &#47112;&#48296; &#46356;&#47113;&#53664;&#47532;&#50640; &#45824;&#54620; &#54028;&#51068; &#49884;&#49828;&#53596; &#44221;&#47196;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#44592;&#48376; &#51200;&#51109;&#49548;</dt>
<dd>
<p>&#51060; &#49444;&#52824; &#51060;&#48120;&#51648;&#50752; &#50672;&#44288;&#46108; &#44592;&#48376; &#45348;&#53944;&#50892;&#53356; &#51200;&#51109;&#49548;&#51032; &#51060;&#47492;(&#50696;: <code>glassfish.org</code>)&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51064;&#53552;&#45367; &#51217;&#49549;</dt>
<dd>
<p>&#51064;&#53552;&#45367;&#50640; GlassFish Server &#51217;&#49549; &#48169;&#48277;:</p>
<dl>
<dt>&#51649;&#51217; &#51217;&#49549;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; GlassFish Server&#44032; &#51064;&#53552;&#45367;&#50640; &#51649;&#51217; &#51217;&#49549;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#54532;&#47197;&#49884;&#47484; &#53685;&#54644;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; GlassFish Server&#44032; &#54532;&#47197;&#49884; &#49436;&#48260;&#47484; &#53685;&#54644; &#51064;&#53552;&#45367;&#50640; &#51217;&#49549;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; [&#54532;&#47197;&#49884; &#54840;&#49828;&#53944;] &#54596;&#46300; &#48143; [&#54532;&#47197;&#49884; &#54252;&#53944;] &#54596;&#46300;&#44032; &#51060; &#54168;&#51060;&#51648;&#50640; &#52628;&#44032;&#46121;&#45768;&#45796;.</p>
</dd>
</dl>
</dd>
<dt>&#54532;&#47197;&#49884; &#54840;&#49828;&#53944;</dt>
<dd>
<p>GlassFish Server&#44032; &#49892;&#54665; &#51473;&#51064; &#49884;&#49828;&#53596;&#50640; &#45824;&#54620; &#54532;&#47197;&#49884; &#49436;&#48260;&#51032; &#54840;&#49828;&#53944; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
<p>&#51060; &#54596;&#46300;&#45716; GlassFish Server&#44032; &#49892;&#54665; &#51473;&#51064; &#49884;&#49828;&#53596;&#51060; &#54532;&#47197;&#49884; &#49436;&#48260;&#47484; &#53685;&#54644; &#51064;&#53552;&#45367;&#50640; &#51217;&#49549;&#46104;&#45716; &#44221;&#50864;&#50640;&#47564; &#51201;&#50857;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#54532;&#47197;&#49884; &#54252;&#53944;</dt>
<dd>
<p>GlassFish Server&#44032; &#49892;&#54665; &#51473;&#51064; &#49884;&#49828;&#53596;&#50640; &#45824;&#54620; &#54532;&#47197;&#49884; &#49436;&#48260;&#51032; &#54252;&#53944; &#48264;&#54840;&#51077;&#45768;&#45796;.</p>
<p>&#51060; &#54596;&#46300;&#45716; GlassFish Server&#44032; &#49892;&#54665; &#51473;&#51064; &#49884;&#49828;&#53596;&#51060; &#54532;&#47197;&#49884; &#49436;&#48260;&#47484; &#53685;&#54644; &#51064;&#53552;&#45367;&#50640; &#51217;&#49549;&#46104;&#45716; &#44221;&#50864;&#50640;&#47564; &#51201;&#50857;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#51200;&#51109;&#49548;</dt>
<dd>
<p>&#51060; &#53580;&#51060;&#48660;&#51008; &#51060; &#49444;&#52824; &#51060;&#48120;&#51648;&#50752; &#50672;&#44288;&#46108; &#44033; &#45348;&#53944;&#50892;&#53356; &#51200;&#51109;&#49548;&#50640; &#45824;&#54644; &#45796;&#51020; &#51221;&#48372;&#47484; &#51228;&#44277;&#54633;&#45768;&#45796;.</p>
<dl>
<dt>&#51200;&#51109;&#49548;</dt>
<dd>
<p>&#50696;&#47484; &#46308;&#50612; <code>dev.glassfish.org</code>&#50752; &#44057;&#51008; &#51200;&#51109;&#49548;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
</dd>
</dl>
<a id="GHCOM495" name="GHCOM495"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<p><a href="task-uc-set-proxy.html">&#45348;&#53944;&#50892;&#53356; &#51200;&#51109;&#49548;&#50640; &#50529;&#49464;&#49828;&#54624; &#49688; &#51080;&#46020;&#47197; &#45348;&#53944;&#50892;&#53356; &#54532;&#47197;&#49884; &#49444;&#51221;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
<a id="GHCOM496" name="GHCOM496"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<p>&#50630;&#51020;</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
