<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-security" name="ref-security"></a></p>

<h4><a id="sthref344" name="sthref344"></a><a id="sthref345" name="sthref345"></a>&#48372;&#50504;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#48372;&#50504;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#49440;&#53469;&#54620; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#45208; &#53364;&#47084;&#49828;&#53552;&#50640; &#45824;&#54620; &#48372;&#50504; &#49549;&#49457;&#51012; &#49444;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>[&#48372;&#50504;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44396;&#49457; &#51060;&#47492;</dt>
<dd>
<p>&#51060; &#54168;&#51060;&#51648;&#51032; &#49444;&#51221;&#51060; &#51201;&#50857;&#46104;&#45716; &#44396;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#48372;&#50504; &#44288;&#47532;&#51088;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; &#46020;&#47700;&#51064;&#51032; &#48372;&#50504; &#44288;&#47532;&#51088;&#44032; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; JVM &#50741;&#49496; <code>-Djava.security.manager</code>&#44032; GlassFish Server&#51032; JVM &#49444;&#51221;&#50640; &#52628;&#44032;&#46121;&#45768;&#45796;. <a href="task-jvmoptions.html">JVM &#50741;&#49496;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;. &#51060; &#48320;&#44221; &#49324;&#54637;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47140;&#47732; &#49436;&#48260;&#47484; &#51116;&#49884;&#51089;&#54644;&#50556; &#54633;&#45768;&#45796;.</p>
<p>&#47784;&#46304; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#50732;&#48148;&#47480; &#44428;&#54620; &#49444;&#51221;&#51012; &#48512;&#50668;&#54664;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;. &#49457;&#45733; &#54693;&#49345;&#51012; &#50948;&#54644; &#48372;&#50504; &#44288;&#47532;&#51088;&#47484; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#44048;&#49324; &#47196;&#44613;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; &#44048;&#49324; &#47784;&#46280; &#47785;&#47197;&#50640;&#49436; &#51648;&#51221;&#54620; &#47784;&#46304; &#44048;&#49324; &#47784;&#46280;&#51012; &#49436;&#48260;&#50640;&#49436; &#47196;&#46300;&#54616;&#50668; &#49892;&#54665;&#54633;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51060; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#49436;&#48260;&#44032; &#44048;&#49324; &#47784;&#46280;&#50640; &#50529;&#49464;&#49828;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#44592;&#48376; &#50689;&#50669;</dt>
<dd>
<p>&#49436;&#48260;&#44032; &#51064;&#51613;&#50640; &#49324;&#50857;&#54616;&#45716; &#54876;&#49457;(&#44592;&#48376;) &#50689;&#50669;&#51077;&#45768;&#45796;. &#48176;&#52824; &#44592;&#49696;&#51088;&#44032; &#45796;&#47480; &#50689;&#50669;&#51012; &#51648;&#51221;&#54616;&#51648; &#50506;&#45716; &#54620; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51008; &#51060; &#50689;&#50669;&#51012; &#49324;&#50857;&#54633;&#45768;&#45796;. &#44396;&#49457;&#46108; &#47784;&#46304; &#50689;&#50669;&#51060; &#47785;&#47197;&#50640; &#54364;&#49884;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>file</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#44592;&#48376; &#51452;&#52404;</dt>
<dd>
<p>&#44592;&#48376; &#49324;&#50857;&#51088; &#51060;&#47492;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. &#45796;&#47480; &#51452;&#52404;&#47484; &#51228;&#44277;&#54616;&#51648; &#50506;&#51012; &#44221;&#50864; &#49436;&#48260;&#45716; &#51060; &#49324;&#50857;&#51088; &#51060;&#47492;&#51012; &#49324;&#50857;&#54633;&#45768;&#45796;. &#51060; &#54596;&#46300;&#50640; &#44050;&#51012; &#51077;&#47141;&#54616;&#45716; &#44221;&#50864;&#50640;&#45716; [&#44592;&#48376; &#51452;&#52404; &#48708;&#48128;&#48264;&#54840;] &#54596;&#46300;&#50640; &#54644;&#45817; &#48708;&#48128;&#48264;&#54840;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#51221;&#49345;&#51201;&#51064; &#49436;&#48260; &#51089;&#50629;&#50640;&#45716; &#44592;&#48376; &#51452;&#52404;&#44032; &#54596;&#50836;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#44592;&#48376; &#51452;&#52404; &#48708;&#48128;&#48264;&#54840;</dt>
<dd>
<p>[&#44592;&#48376; &#51452;&#52404;] &#54596;&#46300;&#50640; &#51648;&#51221;&#54620; &#44592;&#48376; &#51452;&#52404;&#51032; &#48708;&#48128;&#48264;&#54840;&#51077;&#45768;&#45796;. &#51221;&#49345;&#51201;&#51064; &#49436;&#48260; &#51089;&#50629;&#50640;&#45716; &#44592;&#48376; &#51452;&#52404;&#44032; &#54596;&#50836;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>JACC</dt>
<dd>
<p>&#44396;&#49457;&#46108; JACC &#51228;&#44277;&#51088;&#51032; &#53364;&#47000;&#49828; &#51060;&#47492;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>default</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#44048;&#49324; &#47784;&#46280;</dt>
<dd>
<p>&#44048;&#49324; &#47196;&#44613;&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#44048;&#49324; &#54616;&#50948; &#49884;&#49828;&#53596;&#51060; &#49324;&#50857;&#54624; &#44048;&#49324; &#51228;&#44277;&#51088; &#47784;&#46280;&#51077;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; &#49436;&#48260;&#45716; &#51060;&#47492;&#51060; <code>default</code>&#51064; &#44048;&#49324; &#47784;&#46280;&#51012; &#49324;&#50857;&#54633;&#45768;&#45796;. &#49352; &#44048;&#49324; &#47784;&#46280; &#49373;&#49457;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="task-auditmodulenew.html">&#44048;&#49324; &#47784;&#46280;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</dd>
<dt>&#47204; &#47588;&#54609;&#50640; &#45824;&#54620; &#44592;&#48376; &#51452;&#52404; &#49324;&#50857; &#44032;&#45733;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; &#47204; &#47588;&#54609;&#50640; &#45824;&#54620; &#44592;&#48376; &#51452;&#52404;&#44032; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#44288;&#47144; &#47588;&#54609;&#51060; &#50630;&#45716; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#51201;&#50857;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#47588;&#54609;&#46108; &#51452;&#52404; &#53364;&#47000;&#49828;</dt>
<dd>
<p>&#51452;&#52404;&#50752; &#47204; &#49324;&#51060;&#51032; &#51452;&#52404; &#47588;&#54609;&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#51452;&#52404;&#50752; &#50896;&#52825; &#49324;&#51060;&#51032; &#47588;&#54609;&#50640; &#49324;&#50857;&#46104;&#45716; <code>java.security.Principal</code> &#53364;&#47000;&#49828;&#51032; &#49324;&#50857;&#51088; &#51221;&#51032; &#44396;&#54788;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#52628;&#44032; &#49549;&#49457;</dt>
<dd>
<p>&#49436;&#48260;&#51032; &#52628;&#44032; &#48372;&#50504; &#49549;&#49457;&#51077;&#45768;&#45796;.</p>
<p>&#51201;&#54633;&#54620; &#49549;&#49457;&#51008; [&#44592;&#48376; &#50689;&#50669;] &#54596;&#46300;&#50640;&#49436; &#49440;&#53469;&#54620; &#50689;&#50669;&#51032; &#50976;&#54805;&#50640; &#46384;&#46972; &#45804;&#46972;&#51648;&#47728; &#51068;&#48152;&#51201;&#51004;&#47196; &#50689;&#50669;&#51012; &#54200;&#51665;&#54624; &#46412; &#51648;&#51221;&#46121;&#45768;&#45796;. &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; &#45796;&#51020; &#54637;&#47785;&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
<ul>
<li>
<p><a href="ref-editfile-adminrealm.html"><code>FileRealm</code> &#53364;&#47000;&#49828; &#44288;&#47144; &#49549;&#49457;</a></p>
</li>
<li>
<p><a href="ref-editcertrealm.html"><code>CertificateRealm</code> &#53364;&#47000;&#49828; &#44288;&#47144; &#49549;&#49457;</a></p>
</li>
<li>
<p><a href="ref-editjdbcrealm.html"><code>JDBCRealm</code> &#53364;&#47000;&#49828; &#44288;&#47144; &#49549;&#49457;</a></p>
</li>
<li>
<p><a href="ref-ldaprealmprop.html"><code>LDAPRealm</code> &#53364;&#47000;&#49828; &#44288;&#47144; &#49549;&#49457;</a></p>
</li>
<li>
<p><a href="ref-solarisrealmprop.html"><code>SolarisRealm</code> &#53364;&#47000;&#49828; &#44288;&#47144; &#49549;&#49457;</a></p>
</li>
<li>
<p><a href="ref-pamrealmprop.html"><code>PamRealm</code> &#53364;&#47000;&#49828; &#44288;&#47144; &#49549;&#49457;</a></p>
</li>
</ul>
</dd>
</dl>
<a id="sthref346" name="sthref346"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-securitysettings.html">&#48372;&#50504; &#49444;&#51221;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-auditmodulenew.html">&#44048;&#49324; &#47784;&#46280;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-changeadminpasswd.html">&#44288;&#47532; &#50689;&#50669;&#50640;&#49436; &#49324;&#50857;&#51088; &#48708;&#48128;&#48264;&#54840;&#47484; &#48320;&#44221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-accessadmintools.html">&#44288;&#47532; &#53812;&#50640; &#50529;&#49464;&#49828; &#44428;&#54620;&#51012; &#48512;&#50668;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref347" name="sthref347"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00004"><code>change-admin-password</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00015"><code>create-auth-realm</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00024"><code>create-file-user</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00034"><code>create-jacc-provider</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00049"><code>create-password-alias</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00066"><code>delete-auth-realm</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00076"><code>delete-file-user</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00086"><code>delete-jacc-provider</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00101"><code>delete-password-alias</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00150"><code>list-auth-realms</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00164"><code>list-file-groups</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00165"><code>list-file-users</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00171"><code>list-jacc-providers</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00190"><code>list-password-aliases</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00254"><code>update-file-user</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00257"><code>update-password-alias</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
