<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-uc-concepts" name="ref-uc-concepts"></a></p>

<h4><a id="sthref449" name="sthref449"></a>&#50629;&#45936;&#51060;&#53944; &#46020;&#44396; &#51452;&#50836; &#44060;&#45392;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#50629;&#45936;&#51060;&#53944; &#46020;&#44396;&#45716; &#54644;&#45817; &#49884;&#49828;&#53596;&#50640;&#49436; &#45800;&#51068; &#54028;&#51068; &#49884;&#49828;&#53596; &#46356;&#47113;&#53664;&#47532; &#50500;&#47000; &#54252;&#54632;&#46108; GlassFish Server &#49548;&#54532;&#53944;&#50920;&#50612; &#44396;&#49457; &#50836;&#49548;&#51032; &#49444;&#52824;&#47484; &#44288;&#47532;&#54633;&#45768;&#45796;.</p>
<p>&#50629;&#45936;&#51060;&#53944; &#46020;&#44396;&#51032; &#44288;&#47532; &#53080;&#49556; &#48260;&#51204;&#50640;&#49436;&#45716; &#45796;&#51020;&#51012; &#49688;&#54665;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#52628;&#44032; &#44592;&#45733; &#44396;&#49457; &#50836;&#49548; &#49444;&#52824;</p>
</li>
<li>
<p>&#49444;&#52824;&#46108; &#44396;&#49457; &#50836;&#49548;&#50640; &#45824;&#54620; &#50629;&#45936;&#51060;&#53944; &#48372;&#44592;</p>
</li>
<li>
<p>&#49444;&#52824;&#46108; &#44396;&#49457; &#50836;&#49548; &#48372;&#44592;</p>
</li>
</ul>
<p>&#49444;&#52824;&#46108; &#44396;&#49457; &#50836;&#49548;&#47484; &#50629;&#45936;&#51060;&#53944; &#46608;&#45716; &#51228;&#44144;&#54616;&#47140;&#47732; GlassFish Server &#46020;&#47700;&#51064;&#51012; &#51221;&#51648;&#54620; &#54980; &#45796;&#51020; &#47749;&#47161; &#51473; &#54616;&#45208;&#47484; &#49324;&#50857;&#54644;&#50556; &#54633;&#45768;&#45796;.</p>
<ul>
<li>
<p>as-install-parent<code>/bin/updatetool</code> - &#50629;&#45936;&#51060;&#53944; &#46020;&#44396; &#44536;&#47000;&#54589; &#50976;&#54008;&#47532;&#54000;&#47484; &#49884;&#51089;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>as-install-parent<code>/bin/pkg</code> - &#50629;&#45936;&#51060;&#53944; &#46020;&#44396;&#51032; &#47749;&#47161;&#54665; &#48260;&#51204;&#51077;&#45768;&#45796;.</p>
</li>
</ul>
<p>&#45796;&#51020; &#51208;&#50640;&#49436; &#50629;&#45936;&#51060;&#53944; &#46020;&#44396;&#51032; &#51452;&#50836; &#44060;&#45392;&#50640; &#45824;&#54644; &#49444;&#47749;&#54633;&#45768;&#45796;.</p>
<a id="ref-uc-about-component" name="ref-uc-about-component"></a>
<h5>&#44396;&#49457; &#50836;&#49548;</h5>
<p>&#44396;&#49457; &#50836;&#49548;&#45716; &#50629;&#45936;&#51060;&#53944; &#46020;&#44396;&#44032; &#44288;&#47532;&#54616;&#45716; &#49444;&#52824; &#44032;&#45733;&#54620; &#45800;&#50948;&#51077;&#45768;&#45796;. &#44396;&#49457; &#50836;&#49548;&#45716; &#49444;&#52824; &#51060;&#48120;&#51648; &#45236;&#51032; &#49884;&#49828;&#53596;&#50640;&#49436; &#45800;&#50948;&#47196; &#49444;&#52824;&#46104;&#45716; &#54028;&#51068;&#47196; &#44396;&#49457;&#46121;&#45768;&#45796;.</p>
<a id="ref-uc-about-image" name="ref-uc-about-image"></a>
<h5>&#49444;&#52824; &#51060;&#48120;&#51648;</h5>
<p>&#49444;&#52824; &#51060;&#48120;&#51648;&#45716; &#46356;&#47113;&#53664;&#47532;&#51032; &#45236;&#50857;&#51012; &#54252;&#54632;&#54616;&#50668; &#49548;&#54532;&#53944;&#50920;&#50612; &#44396;&#49457; &#50836;&#49548;&#44032; &#54252;&#54632;&#46108; &#46356;&#47113;&#53664;&#47532;&#51077;&#45768;&#45796;. &#49444;&#52824; &#51060;&#48120;&#51648;&#45716; GlassFish Server &#49548;&#54532;&#53944;&#50920;&#50612;&#47484; &#45796;&#50868;&#47196;&#46300;&#54616;&#50668; &#49444;&#52824;&#54620; &#54980; &#50629;&#45936;&#51060;&#53944; &#46020;&#44396;&#50640; &#52628;&#44032;&#46121;&#45768;&#45796;. GlassFish Server &#49548;&#54532;&#53944;&#50920;&#50612; &#44396;&#49457; &#50836;&#49548;&#51032; &#52628;&#44032; &#48143; &#50629;&#45936;&#51060;&#53944;&#47484; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#44592; &#50948;&#54644; &#44033; &#49444;&#52824; &#51060;&#48120;&#51648;&#50640; &#44396;&#49457; &#50836;&#49548; &#49444;&#52824;&#50640; &#45824;&#54620; &#51221;&#48372;&#44032; &#54252;&#54632;&#46121;&#45768;&#45796;.</p>
<a id="ref-uc-about-repository" name="ref-uc-about-repository"></a>
<h5>&#45348;&#53944;&#50892;&#53356; &#51200;&#51109;&#49548;</h5>
<p>&#45348;&#53944;&#50892;&#53356; &#51200;&#51109;&#49548;&#50640;&#45716; &#45796;&#51020; &#54637;&#47785;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#49444;&#52824; &#51060;&#48120;&#51648;&#50640; &#52628;&#44032;&#54624; &#49688; &#51080;&#45716; &#44396;&#49457; &#50836;&#49548;</p>
</li>
<li>
<p>&#49444;&#52824; &#51060;&#48120;&#51648;&#51032; &#44592;&#51316; &#44396;&#49457; &#50836;&#49548;&#50640; &#45824;&#54620; &#50629;&#45936;&#51060;&#53944;</p>
</li>
</ul>
<p>&#49444;&#52824; &#51060;&#48120;&#51648;&#45716; &#54616;&#45208; &#51060;&#49345;&#51032; &#45348;&#53944;&#50892;&#53356; &#51200;&#51109;&#49548;&#50752; &#50672;&#44208;&#46121;&#45768;&#45796;. &#44033; &#45348;&#53944;&#50892;&#53356; &#51200;&#51109;&#49548;&#45716; &#51060;&#47492; &#48143; &#50672;&#44288;&#46108; URL&#50640; &#51032;&#54644; &#54364;&#49884;&#46121;&#45768;&#45796;. &#51200;&#51109;&#49548; &#51060;&#47492;&#51008; &#44033; &#49444;&#52824; &#51060;&#48120;&#51648;&#50640; &#45824;&#54644; &#44256;&#50976;&#54616;&#47728;, &#51200;&#51109;&#49548; &#48143; &#51201;&#51208;&#54616;&#44172; &#51221;&#51032;&#46108; &#45236;&#50857; &#48276;&#50948;&#47484; &#44288;&#47532;&#54616;&#45716; &#51312;&#51649; &#46608;&#45716; &#54532;&#47196;&#51229;&#53944; &#47784;&#46160;&#47484; &#54364;&#49884;&#54633;&#45768;&#45796;. GlassFish Server&#50640; &#45824;&#54644; &#48120;&#47532; &#44396;&#49457;&#46108; &#45348;&#53944;&#50892;&#53356; &#51200;&#51109;&#49548;&#50640; &#45824;&#54644; &#50508;&#50500;&#48372;&#47140;&#47732; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSADG00569"><i>Oracle GlassFish Server Administration Guide</i>&#51032; <i>Preconfigured Repositories for GlassFish Server</i></a>&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
<a id="ref-uc-about-addon" name="ref-uc-about-addon"></a>
<h5>&#52628;&#44032; &#44592;&#45733; &#44396;&#49457; &#50836;&#49548;</h5>
<p>&#52628;&#44032; &#44592;&#45733; &#44396;&#49457; &#50836;&#49548;&#45716; &#50500;&#51649; &#49444;&#52824;&#46104;&#51648; &#50506;&#51008; &#49444;&#52824; &#51060;&#48120;&#51648;&#51032; &#44396;&#49457; &#50836;&#49548;&#51077;&#45768;&#45796;.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
