<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-ldaprealmprop" name="ref-ldaprealmprop"></a></p>

<h4><a id="sthref207" name="sthref207"></a><a id="sthref208" name="sthref208"></a><code>LDAPRealm</code> &#53364;&#47000;&#49828; &#44288;&#47144; &#49549;&#49457;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>LDAP &#50689;&#50669;&#51032; &#44221;&#50864; &#45796;&#51020; &#49549;&#49457;&#51060; &#54596;&#50836;&#54633;&#45768;&#45796;.</p>
<dl>
<dt>JAAS &#52968;&#53581;&#49828;&#53944;</dt>
<dd>
<p>JAAS(Java Authentication and Authorization Service) &#52968;&#53581;&#49828;&#53944;&#45716; &#51060; &#50689;&#50669;&#50640;&#49436; &#49324;&#50857;&#54624; &#47196;&#44536;&#51064; &#47784;&#46280;&#51032; &#49885;&#48324;&#51088;&#51077;&#45768;&#45796;. &#50976;&#51068;&#54616;&#44172; &#51201;&#54633;&#54620; &#44050;&#51008; <code>solarisRealm</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#46356;&#47113;&#53664;&#47532;</dt>
<dd>
<p>&#49436;&#48260;&#51032; LDAP URL&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#44592;&#48376; DN</dt>
<dd>
<p>&#49324;&#50857;&#51088; &#45936;&#51060;&#53552; &#50948;&#52824;&#51032; LDAP &#44592;&#48376; DN(&#49885;&#48324; &#51060;&#47492;)&#51077;&#45768;&#45796;. &#53944;&#47532; &#48276;&#50948;&#51032; &#44160;&#49353;&#51060; &#49688;&#54665;&#46104;&#48064;&#47196; &#51060; &#44592;&#48376; DN&#51008; &#49324;&#50857;&#51088; &#45936;&#51060;&#53552; &#47112;&#48296;&#48372;&#45796; &#45458;&#51008; &#47112;&#48296;&#51060;&#47732; &#50612;&#46500; &#44163;&#51060;&#46304; &#46112; &#49688; &#51080;&#49845;&#45768;&#45796;. &#44160;&#49353; &#53944;&#47532;&#44032; &#51089;&#51012;&#49688;&#47197; &#49457;&#45733;&#51060; &#51339;&#50500;&#51665;&#45768;&#45796;.</p>
</dd>
</dl>
<p>LDAP &#50689;&#50669;&#51032; &#44221;&#50864; &#45796;&#51020;&#44284; &#44057;&#51008; &#49440;&#53469;&#51201; &#49549;&#49457;&#51012; &#49324;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44536;&#47353; &#51648;&#51221;</dt>
<dd>
<p>&#49788;&#54364;&#47196; &#44396;&#48516;&#46108; &#44536;&#47353; &#51060;&#47492; &#47785;&#47197;&#51077;&#45768;&#45796;. &#51201;&#54633;&#54620; &#51064;&#51613;&#49436;&#47484; &#51228;&#44277;&#54616;&#45716; &#47784;&#46304; &#53364;&#46972;&#51060;&#50616;&#53944;&#44032; &#51060;&#47084;&#54620; &#44536;&#47353;&#50640; &#51648;&#51221;&#46121;&#45768;&#45796;. &#50696;&#47484; &#46308;&#50612; <code>employee,manager</code>&#45716; &#49324;&#50857;&#51088; &#44536;&#47353;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
<p>LDAP &#50689;&#50669;&#50640; &#49324;&#50857;&#54624; &#49688; &#51080;&#45716; &#52628;&#44032; &#49549;&#49457;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt><code>search-filter</code></dt>
<dd>
<p>&#49324;&#50857;&#51088;&#47484; &#52286;&#51012; &#46412; &#49324;&#50857;&#54616;&#45716; &#44160;&#49353; &#54596;&#53552;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>uid=%s</code>(<code>%s</code>&#45716; &#51452;&#52404; &#51060;&#47492;&#51004;&#47196; &#54869;&#51109;&#46120;)&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>group-base-dn</code></dt>
<dd>
<p>&#44536;&#47353; &#45936;&#51060;&#53552; &#50948;&#52824;&#51032; &#44592;&#48376; DN&#51077;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; &#44592;&#48376; DN &#44050;&#44284; &#44057;&#51648;&#47564; &#54596;&#50836;&#54620; &#44221;&#50864;&#50640;&#45716; &#51312;&#51221;&#54624; &#49688;&#46020; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt><code>group-search-filter</code></dt>
<dd>
<p>&#49324;&#50857;&#51088;&#51032; &#44536;&#47353; &#47716;&#48260;&#49789;&#51012; &#52286;&#51012; &#46412; &#49324;&#50857;&#54616;&#45716; &#44160;&#49353; &#54596;&#53552;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>uniquemember=%d</code>(<code>%d</code>&#45716; &#49324;&#50857;&#51088; &#50836;&#49548; DN&#51004;&#47196; &#54869;&#51109;&#46120;)&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>group-target</code></dt>
<dd>
<p>&#44536;&#47353; &#51060;&#47492; &#54637;&#47785;&#51012; &#54252;&#54632;&#54616;&#45716; LDAP &#49549;&#49457; &#51060;&#47492;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>CN</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>search-bind-dn</code></dt>
<dd>
<p><code>search-filter</code> &#51312;&#54924;&#47484; &#49688;&#54665;&#54616;&#44592; &#50948;&#54644; &#46356;&#47113;&#53664;&#47532; &#51064;&#51613; &#49884; &#49324;&#50857;&#46104;&#45716; &#49440;&#53469;&#51201; DN&#51077;&#45768;&#45796;. &#51061;&#47749; &#44160;&#49353;&#51060; &#54728;&#50857;&#46104;&#51648; &#50506;&#45716; &#46356;&#47113;&#53664;&#47532;&#50640; &#45824;&#54644;&#49436;&#47564; &#54596;&#50836;&#54633;&#45768;&#45796;.</p>
</dd>
<dt><code>search-bind-password</code></dt>
<dd>
<p><code>search-bind-dn</code>&#50640; &#51648;&#51221;&#46108; DN&#51032; LDAP &#48708;&#48128;&#48264;&#54840;&#51077;&#45768;&#45796;.</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
