<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-serverinstappsconfig" name="ref-serverinstappsconfig"></a></p>

<h4><a id="sthref214" name="sthref214"></a><a id="sthref215" name="sthref215"></a><a id="sthref216" name="sthref216"></a><a id="sthref217" name="sthref217"></a><a id="sthref218" name="sthref218"></a>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#44396;&#49457;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#44396;&#49457;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#45824;&#54620; &#48320;&#44221; &#49324;&#54637;&#51012; &#44048;&#51648;&#54616;&#44256; &#49688;&#51221;&#46108; &#53364;&#47000;&#49828;&#47484; &#45796;&#49884; &#47196;&#46300;&#54616;&#46020;&#47197; &#46020;&#50752;&#51452;&#45716; &#49549;&#49457;&#51012; &#49444;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>[&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#44396;&#49457;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44592;&#48376;&#44050; &#47196;&#46300;</dt>
<dd>
<p>&#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#45716; &#49444;&#51221;&#51012; &#44592;&#48376;&#44050;&#51004;&#47196; &#48373;&#50896;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#49444;&#51221;&#51008; &#48320;&#44221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#45796;&#49884; &#47196;&#46300;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; &#49688;&#51221;&#46108; &#53364;&#47000;&#49828;&#44032; &#46041;&#51201;&#51004;&#47196; &#45796;&#49884; &#47196;&#46300;&#46121;&#45768;&#45796;. &#49436;&#48260;&#45716; &#48176;&#52824; &#46356;&#47113;&#53664;&#47532;&#50640;&#49436; &#48320;&#44221; &#49324;&#54637;&#51012; &#51221;&#44592;&#51201;&#51004;&#47196; &#54869;&#51064;&#54616;&#50668; &#48320;&#44221; &#49324;&#54637;&#51060; &#51201;&#50857;&#46104;&#46020;&#47197; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#46041;&#51201;&#51004;&#47196; &#44536;&#47532;&#44256; &#51088;&#46041;&#51004;&#47196; &#51116;&#48176;&#52824;&#54633;&#45768;&#45796;. &#51060; &#44592;&#45733;&#51008; &#53076;&#46300; &#48320;&#44221;&#51012; &#48736;&#47476;&#44172; &#53580;&#49828;&#53944;&#54624; &#49688; &#51080;&#44592; &#46412;&#47928;&#50640; &#44060;&#48156; &#54872;&#44221;&#50640;&#49436; &#50976;&#50857;&#54633;&#45768;&#45796;. &#44536;&#47084;&#45208; &#50868;&#50857; &#54872;&#44221;&#50640;&#49436;&#45716; &#46041;&#51201; &#45796;&#49884; &#47196;&#46300;&#47196; &#51064;&#54644; &#49457;&#45733;&#51060; &#51200;&#54616;&#46112; &#49688; &#51080;&#49845;&#45768;&#45796;. &#46608;&#54620; &#45796;&#49884; &#47196;&#46300;&#44032; &#49688;&#54665;&#46112; &#46412;&#47560;&#45796; &#54644;&#45817; &#51204;&#49569; &#49884;&#44036;&#51032; &#49464;&#49496;&#51060; &#48512;&#51201;&#54633;&#54644;&#51665;&#45768;&#45796;. &#53364;&#46972;&#51060;&#50616;&#53944;&#50640;&#49436; &#49464;&#49496;&#51012; &#51116;&#49884;&#51089;&#54644;&#50556; &#54633;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#45796;&#49884; &#47196;&#46300; &#54260;&#47553; &#44036;&#44201;</dt>
<dd>
<p>&#49436;&#48260;&#50640;&#49436; &#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#48143; &#47784;&#46280;&#51032; &#53076;&#46300; &#48320;&#44221; &#49324;&#54637;&#51012; &#54869;&#51064;&#54616;&#45716; &#48712;&#46020;&#47484; &#49885;&#48324;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 2&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#44288;&#47532; &#49464;&#49496; &#49884;&#44036; &#52488;&#44284;</dt>
<dd>
<p>&#44288;&#47532; &#53080;&#49556;&#51032; &#49884;&#44036;&#51060; &#52488;&#44284;&#46104;&#50612; &#45796;&#49884; &#47196;&#44536;&#51064;&#54616;&#44592;&#44620;&#51648;&#51032; &#48708;&#54876;&#49457; &#49884;&#44036;(&#48516;)&#51012; &#49885;&#48324;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 60&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51088;&#46041; &#48176;&#52824;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; &#51088;&#46041; &#48176;&#52824; &#46356;&#47113;&#53664;&#47532;&#51032; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#51088;&#46041;&#51004;&#47196; &#48176;&#52824;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#51088;&#46041; &#48176;&#52824; &#54260;&#47553; &#44036;&#44201;</dt>
<dd>
<p>&#49436;&#48260;&#44032; &#51088;&#46041; &#48176;&#52824; &#46356;&#47113;&#53664;&#47532;&#50640; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#46608;&#45716; &#47784;&#46280; &#48320;&#44221; &#49324;&#54637;&#51060; &#51080;&#45716;&#51648; &#54869;&#51064;&#54616;&#45716; &#48712;&#46020;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;. &#54260;&#47553; &#44036;&#44201;&#51012; &#48320;&#44221;&#54644;&#46020; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#46608;&#45716; &#47784;&#46280; &#48176;&#52824;&#50640; &#44152;&#47532;&#45716; &#49884;&#44036;&#51008; &#50689;&#54693;&#51012; &#48155;&#51648; &#50506;&#49845;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 2&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51088;&#46041; &#48176;&#52824; &#51116;&#49884;&#46020; &#49884;&#44036; &#52488;&#44284;</dt>
<dd>
<p>&#48512;&#48516;&#51201;&#51004;&#47196; &#48373;&#49324;&#46108; &#54028;&#51068;&#51060; &#50724;&#47448; &#48156;&#49373; &#50630;&#51060; &#53356;&#44592;&#44032; &#48320;&#44221;&#46104;&#51648; &#50506;&#44256; &#44536;&#45824;&#47196; &#50976;&#51648;&#46112; &#49688; &#51080;&#45716; &#49884;&#44036;(&#52488;)&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 4&#51077;&#45768;&#45796;.</p>
<p>&#54028;&#51068;&#51060; &#51088;&#46041; &#48176;&#52824; &#46356;&#47113;&#53664;&#47532;&#47196; &#45712;&#47532;&#44172; &#48373;&#49324;&#46104;&#45716; &#44221;&#50864; &#54028;&#51068;&#51060; &#50756;&#51204;&#55176; &#48373;&#49324;&#46104;&#44592; &#51204;&#50640; &#54364;&#49884;&#46112; &#49688; &#51080;&#49845;&#45768;&#45796;. &#46384;&#46972;&#49436; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#51088;&#46041;&#51004;&#47196; &#48176;&#52824;&#54616;&#47140;&#44256; &#54616;&#47732; &#49892;&#54056;&#54633;&#45768;&#45796;. &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51032; &#51088;&#46041; &#48176;&#52824; &#49884;&#46020;&#44032; &#51060;&#47088; &#51060;&#50976;&#47196; &#49892;&#54056;&#54616;&#47732; GlassFish Server&#50640;&#49436; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#45796;&#49884; &#48176;&#52824;&#54616;&#47140;&#44256; &#54633;&#45768;&#45796;. &#48512;&#48516;&#51201;&#51004;&#47196; &#48373;&#49324;&#46108; &#54028;&#51068;&#51032; &#53356;&#44592;&#44032; &#51648;&#51221;&#46108; &#44592;&#44036; &#46041;&#50504; &#48320;&#44221;&#46104;&#51648; &#50506;&#44256; &#50976;&#51648;&#46104;&#47732; &#50724;&#47448;&#44032; &#48156;&#49373;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#51088;&#46041; &#48176;&#52824; &#46356;&#47113;&#53664;&#47532;</dt>
<dd>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#51088;&#46041; &#48176;&#52824; &#49884; &#47784;&#45768;&#53552;&#47553;&#54624; &#46356;&#47113;&#53664;&#47532;&#47484; &#49885;&#48324;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; domain-dir<code>/autodeploy</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>XML &#44160;&#51613;</dt>
<dd>
<p>&#54364;&#51456; &#48143; GlassFish Server &#48176;&#52824; &#44592;&#49696;&#51088;&#50640;&#49436; &#49688;&#54665;&#46112; XML &#44160;&#51613;&#51032; &#50976;&#54805;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. &#45796;&#51020;&#44284; &#44057;&#51008; &#50976;&#54805;&#51012; &#49324;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#51204;&#52404;</dt>
<dd>
<p>XML &#44160;&#51613;&#50640; &#49892;&#54056;&#54616;&#47732; &#48176;&#52824;&#44032; &#49892;&#54056;&#54633;&#45768;&#45796;. &#51060; &#44050;&#51008; &#44592;&#48376;&#44050;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#44396;&#47928; &#48516;&#49437;</dt>
<dd>
<p>XML &#44160;&#51613; &#50724;&#47448;&#44032; &#48372;&#44256;&#46104;&#51648;&#47564; &#48176;&#52824;&#45716; &#49688;&#54665;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#50630;&#51020;</dt>
<dd>
<p>XML &#44160;&#51613;&#51012; &#49688;&#54665;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
</dl>
</dd>
<dt>&#44160;&#51613;&#51088;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; &#51088;&#46041; &#48176;&#52824; &#51204;&#50640; &#44160;&#51613;&#51088;&#44032; &#49892;&#54665;&#46121;&#45768;&#45796;. &#44160;&#51613;&#50640; &#49892;&#54056;&#54616;&#47732; &#48176;&#52824;&#44032; &#49688;&#54665;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;. &#44160;&#51613;&#51088;&#45716; &#54028;&#51068;&#51032; &#44396;&#51312;&#50752; &#45236;&#50857;&#51012; &#44160;&#49324;&#54633;&#45768;&#45796;. &#53360; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51032; &#44160;&#51613;&#50640;&#45716; &#47566;&#51008; &#49884;&#44036;&#51060; &#44152;&#47540; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#49324;&#51204; &#52980;&#54028;&#51068;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; JSP(JavaServer Pages) &#54028;&#51068;&#51060; &#49324;&#51204; &#52980;&#54028;&#51068;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51012; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; JSP &#54028;&#51068;&#51008; &#52376;&#51020; &#50529;&#49464;&#49828;&#46112; &#46412; &#47088;&#53440;&#51076; &#49884; &#52980;&#54028;&#51068;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#52628;&#44032; &#49549;&#49457;</dt>
<dd>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51077;&#45768;&#45796;. GlassFish Server&#50640;&#49436;&#45716; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51012; &#51221;&#51032;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref219" name="sthref219"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-setadvanceappconfig.html">&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#44396;&#49457;&#51012; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-setadvancedomainattributes.html">&#46020;&#47700;&#51064; &#49549;&#49457;&#51012; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
