<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-managefilerealm" name="ref-managefilerealm"></a></p>

<h4><a id="sthref213" name="sthref213"></a>&#54028;&#51068; &#49324;&#50857;&#51088;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#54028;&#51068; &#49324;&#50857;&#51088;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; <code>file</code> &#50689;&#50669; &#49324;&#50857;&#51088;&#47484; &#44288;&#47532;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. <code>file</code> &#50689;&#50669;&#51032; &#49324;&#50857;&#51088; &#48143; &#44536;&#47353;&#51008; &#53412; &#54028;&#51068;&#50640; &#45208;&#50676;&#46104;&#47728;, &#53412; &#54028;&#51068;&#51032; &#50948;&#52824;&#45716; <code>file</code> &#49549;&#49457;&#50640; &#51648;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<p><code>file</code> &#50689;&#50669;&#51032; &#49324;&#50857;&#51088;&#45716; &#44277;&#53685;&#46108; &#53945;&#49457;&#51004;&#47196; &#48516;&#47448;&#46108; &#49324;&#50857;&#51088; &#48276;&#51452;&#51064; <i>Java &#44536;&#47353;</i>&#50640; &#49549;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#50696;&#47484; &#46308;&#50612;, &#51204;&#51088; &#49345;&#44144;&#47000; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#49324;&#50857;&#51088;&#45716; <code>CUSTOMER</code> &#44536;&#47353;&#50640; &#49549;&#54624; &#49688; &#51080;&#51648;&#47564;, &#45824;&#47049; &#49548;&#48708;&#51088;&#45716; <code>PREFERRED</code> &#44536;&#47353;&#50640; &#49549;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#49324;&#50857;&#51088;&#47484; &#44536;&#47353;&#51004;&#47196; &#48276;&#51452;&#54868;&#54616;&#47732; &#47566;&#51008; &#49688;&#51032; &#49324;&#50857;&#51088; &#50529;&#49464;&#49828;&#47484; &#45908; &#49789;&#44172; &#51228;&#50612;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>GlassFish Server &#49444;&#52824; &#54980; &#52376;&#51020;&#50640;&#45716; &#49444;&#52824; &#49884; &#51077;&#47141;&#54620; &#44288;&#47532;&#51088;&#47564; &#50976;&#51068;&#54620; &#49324;&#50857;&#51088;&#51077;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; &#51060; &#49324;&#50857;&#51088;&#45716; GlassFish Server&#47484; &#49688;&#51221;&#54624; &#49688; &#51080;&#45716; &#44428;&#54620;&#51012; &#48512;&#50668;&#54616;&#45716; <code>admin-realm</code> &#50689;&#50669;&#51032; <code>asadmin</code> &#44536;&#47353;&#50640; &#49549;&#54633;&#45768;&#45796;. &#51060; &#44536;&#47353;&#50640; &#51648;&#51221;&#46108; &#49324;&#50857;&#51088;&#45716; &#44288;&#47532;&#51088; &#44428;&#54620;&#51012; &#44054;&#49845;&#45768;&#45796;. &#51593;, <code>asadmin</code> &#46020;&#44396; &#48143; &#44288;&#47532; &#53080;&#49556;&#50640; &#50529;&#49464;&#49828;&#54624; &#49688; &#51080;&#45716; &#44428;&#54620;&#51012; &#48512;&#50668;&#48155;&#49845;&#45768;&#45796;.</p>
<p>[&#54028;&#51068; &#49324;&#50857;&#51088;] &#54168;&#51060;&#51648;&#50640;&#45716; &#49440;&#53469;&#54620; &#50689;&#50669;&#51032; &#49324;&#50857;&#51088; &#47785;&#47197;&#51060; &#54364;&#49884;&#46121;&#45768;&#45796;. &#44033; &#49324;&#50857;&#51088;&#50640; &#45824;&#54644; &#51228;&#44277;&#46104;&#45716; &#51221;&#48372;&#45716; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#49324;&#50857;&#51088; ID</dt>
<dd>
<p>&#49324;&#50857;&#51088; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#44536;&#47353; &#47785;&#47197;</dt>
<dd>
<p>&#49324;&#50857;&#51088;&#44032; &#49549;&#54620; &#44536;&#47353;&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
<p>&#54028;&#51068; &#49324;&#50857;&#51088; &#53580;&#51060;&#48660;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#46020; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#49352;&#47196; &#47564;&#46308;&#44592;</dt>
<dd>
<p>&#49352; &#49324;&#50857;&#51088;&#47484; &#49373;&#49457;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49325;&#51228;</dt>
<dd>
<p>&#49440;&#53469;&#54620; &#49324;&#50857;&#51088;&#47484; &#54616;&#45208; &#51060;&#49345; &#49325;&#51228;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="GHCOM435" name="GHCOM435"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-fileuserscreate.html">&#54028;&#51068; &#50689;&#50669;&#50640; &#49324;&#50857;&#51088;&#47484; &#52628;&#44032;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-fileusersedit.html">&#54028;&#51068; &#50689;&#50669; &#49324;&#50857;&#51088; &#51221;&#48372;&#47484; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-fileusersdelete.html">&#54028;&#51068; &#50689;&#50669;&#50640;&#49436; &#49324;&#50857;&#51088;&#47484; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="GHCOM436" name="GHCOM436"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00165"><code>list-file-users</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00024"><code>create-file-user</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00254"><code>update-file-user</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00076"><code>delete-file-user</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
