<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-editjdbcrealm" name="ref-editjdbcrealm"></a></p>

<h4><a id="sthref205" name="sthref205"></a><a id="sthref206" name="sthref206"></a><code>JDBCRealm</code> &#53364;&#47000;&#49828; &#44288;&#47144; &#49549;&#49457;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#50937; &#54168;&#51060;&#51648; &#46608;&#45716; &#50937; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#48372;&#54840;&#54616;&#47140;&#47732; &#46321;&#47197;&#46108; &#49324;&#50857;&#51088;&#47564; &#50529;&#49464;&#49828;&#54624; &#49688; &#51080;&#46020;&#47197; &#48372;&#50504;&#51012; &#49444;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#44592;&#45733;&#51012; &#51064;&#51613; &#44592;&#45733;&#51060;&#46972;&#44256; &#54633;&#45768;&#45796;. &#51060; &#50689;&#50669; &#50976;&#54805;&#51008; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#50640; &#49324;&#50857;&#51088; &#51064;&#51613;&#49436;&#47484; &#51200;&#51109;&#54616;&#45716; &#44163;&#44284; &#44288;&#47144;&#46121;&#45768;&#45796;. GlassFish Server&#51008;(&#45716;) &#44396;&#49457; &#54028;&#51068;&#50640;&#49436; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#51221;&#48372; &#48143; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46108; JDBC &#50689;&#50669; &#50741;&#49496;&#51012; &#49324;&#50857;&#54633;&#45768;&#45796;.</p>
<p>JDBC &#50689;&#50669;&#51032; &#44221;&#50864; &#45796;&#51020; &#49549;&#49457;&#51060; &#54596;&#50836;&#54633;&#45768;&#45796;.</p>
<dl>
<dt>JAAS &#52968;&#53581;&#49828;&#53944;</dt>
<dd>
<p>JAAS(Java Authentication and Authorization Service) &#52968;&#53581;&#49828;&#53944;&#45716; &#51060; &#50689;&#50669;&#50640;&#49436; &#49324;&#50857;&#54624; &#47196;&#44536;&#51064; &#47784;&#46280;&#51032; &#49885;&#48324;&#51088;&#51077;&#45768;&#45796;. &#50976;&#51068;&#54616;&#44172; &#51201;&#54633;&#54620; &#44050;&#51008; <code>jdbcRealm</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>JNDI</dt>
<dd>
<p>&#51060; &#50689;&#50669;&#51032; JNDI &#51060;&#47492;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>jdbc/security</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49324;&#50857;&#51088; &#53580;&#51060;&#48660;</dt>
<dd>
<p>&#51060; &#50689;&#50669;&#50640; &#45824;&#54644; &#51064;&#51613;&#46108; &#49324;&#50857;&#51088;&#51032; &#47785;&#47197;&#51060; &#46308;&#50612; &#51080;&#45716; &#53580;&#51060;&#48660;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>usertable</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49324;&#50857;&#51088; &#51060;&#47492; &#50676;</dt>
<dd>
<p>&#49324;&#50857;&#51088; &#53580;&#51060;&#48660;&#50640;&#49436; &#49324;&#50857;&#51088; &#47785;&#47197;&#51060; &#54252;&#54632;&#46108; &#50676; &#51060;&#47492;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>userid</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#48708;&#48128;&#48264;&#54840; &#50676;</dt>
<dd>
<p>&#49324;&#50857;&#51088; &#53580;&#51060;&#48660;&#50640;&#49436; &#44033; &#49324;&#50857;&#51088;&#51032; &#48708;&#48128;&#48264;&#54840;&#44032; &#54252;&#54632;&#46108; &#50676; &#51060;&#47492;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>password</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#44536;&#47353; &#53580;&#51060;&#48660;</dt>
<dd>
<p>&#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#50640; &#51080;&#45716; &#44536;&#47353; &#53580;&#51060;&#48660;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>grouptable</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#44536;&#47353; &#51060;&#47492; &#50676;</dt>
<dd>
<p>&#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#51032; &#44536;&#47353; &#53580;&#51060;&#48660;&#50640; &#51080;&#45716; &#44536;&#47353; &#51060;&#47492; &#50676;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>groupid</code>&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
<p>JDBC &#50689;&#50669;&#51032; &#44221;&#50864; &#45796;&#51020;&#44284; &#44057;&#51008; &#49440;&#53469;&#51201; &#49549;&#49457;&#51012; &#49324;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44536;&#47353; &#51648;&#51221;</dt>
<dd>
<p>&#49788;&#54364;&#47196; &#44396;&#48516;&#46108; &#44536;&#47353; &#51060;&#47492; &#47785;&#47197;&#51077;&#45768;&#45796;. &#51201;&#54633;&#54620; &#51064;&#51613;&#49436;&#47484; &#51228;&#44277;&#54616;&#45716; &#47784;&#46304; &#53364;&#46972;&#51060;&#50616;&#53944;&#44032; &#51060;&#47084;&#54620; &#44536;&#47353;&#50640; &#51648;&#51221;&#46121;&#45768;&#45796;. &#50696;&#47484; &#46308;&#50612; <code>employee,manager</code>&#45716; &#49324;&#50857;&#51088; &#44536;&#47353;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#49324;&#50857;&#51088;</dt>
<dd>
<p><code>jdbc-connection-pool</code> &#45824;&#49888; &#50689;&#50669;&#50640;&#49436; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#49324;&#50857;&#51088; &#51060;&#47492;&#51012; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060;&#47111;&#44172; &#54616;&#47732; &#45796;&#47480; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640;&#49436; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#47484; &#44160;&#49353;&#54616;&#44144;&#45208;, &#51217;&#49549;&#54616;&#44144;&#45208;, &#49324;&#50857;&#51088; &#53580;&#51060;&#48660;&#51012; &#52286;&#50500;&#48380; &#49688; &#50630;&#49845;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; <code>jdbc-connection-pool</code> &#44396;&#49457;&#51060; &#49324;&#50857;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#48708;&#48128;&#48264;&#54840;</dt>
<dd>
<p><code>jdbc-connection-pool</code> &#45824;&#49888; &#50689;&#50669;&#50640;&#49436; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#48708;&#48128;&#48264;&#54840;&#47484; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060;&#47111;&#44172; &#54616;&#47732; &#45796;&#47480; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640;&#49436; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#47484; &#44160;&#49353;&#54616;&#44144;&#45208;, &#51217;&#49549;&#54616;&#44144;&#45208;, &#49324;&#50857;&#51088; &#53580;&#51060;&#48660;&#51012; &#52286;&#50500;&#48380; &#49688; &#50630;&#49845;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; <code>jdbc-connection-pool</code> &#44396;&#49457;&#51060; &#49324;&#50857;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>Digest &#50508;&#44256;&#47532;&#51608;</dt>
<dd>
<p>(&#49440;&#53469; &#49324;&#54637;) Digest &#50508;&#44256;&#47532;&#51608;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>SHA-256</code>&#51077;&#45768;&#45796;. JDK&#50640;&#49436; &#51648;&#50896;&#46104;&#45716; &#50508;&#44256;&#47532;&#51608;&#51060;&#45208; none&#51012; &#49324;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>

<hr>
<p><b>&#51452;:</b></p>
GlassFish Server 4.0 &#51060;&#51204; &#48260;&#51204;&#50640;&#49436; &#44592;&#48376; &#50508;&#44256;&#47532;&#51608;&#51008; <code>MD5</code>&#51077;&#45768;&#45796;. <code>MD5</code> &#50508;&#44256;&#47532;&#51608;&#51012; &#49324;&#50857;&#54616;&#45716; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#51080;&#51012; &#44221;&#50864; <code>asadmin set</code> &#54616;&#50948; &#47749;&#47161;&#51012; &#49324;&#50857;&#54616;&#50668; &#44592;&#48376; <code>SHA-25</code> &#50508;&#44256;&#47532;&#51608;&#51012; &#45824;&#52404;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.
<pre>
asadmin&gt; <b>set server.security-service.property.default-digest-algorithm=MD5</b>
</pre>
<p><code>asadmin get</code> &#54616;&#50948; &#47749;&#47161;&#51012; &#49324;&#50857;&#54616;&#50668; &#54788;&#51116; &#49324;&#50857; &#51473;&#51064; &#50508;&#44256;&#47532;&#51608;&#51012; &#54869;&#51064;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<pre>
asadmin&gt; <b>get server.security-service.property.default-digest-algorithm</b>
</pre>
<p>&#46608;&#54620;, &#50669;&#54840;&#54872;&#49457;&#51012; &#50976;&#51648;&#54616;&#44592; &#50948;&#54644; GlassFish Server v2.<i>x</i>&#45208; v3.0. <i>x</i>&#50640;&#49436; GlassFish Server 4.0(&#51004;)&#47196; &#50629;&#44536;&#47112;&#51060;&#46300;&#47484; &#49688;&#54665;&#54616;&#47732; Digest &#50508;&#44256;&#47532;&#51608;&#51060; &#44592;&#51316; GlassFish Server &#48260;&#51204;&#50640;&#49436; &#47749;&#49884;&#51201;&#51004;&#47196; &#49444;&#51221;&#46104;&#51648; &#50506;&#51008; &#44221;&#50864; &#44592;&#48376; &#50508;&#44256;&#47532;&#51608;&#51008; &#51088;&#46041;&#51004;&#47196; <code>MD5</code>&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;.</p>

<hr>

</dd>
<dt>&#48708;&#48128;&#48264;&#54840; &#50516;&#54840;&#54868; &#50508;&#44256;&#47532;&#51608;</dt>
<dd>
<p>&#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#50640; &#51200;&#51109;&#46108; &#48708;&#48128;&#48264;&#54840;&#47484; &#50516;&#54840;&#54868;&#54616;&#45716; &#50508;&#44256;&#47532;&#51608;&#51077;&#45768;&#45796;.</p>

<hr>
<p><b>&#51452;:</b></p>
&#48708;&#48128;&#48264;&#54840; &#50516;&#54840;&#54868; &#50508;&#44256;&#47532;&#51608;&#51012; &#51648;&#51221;&#54616;&#51648; &#50506;&#51004;&#47732; &#48372;&#50504; &#50948;&#54744;&#50640; &#45432;&#52636;&#46121;&#45768;&#45796;.
<hr>

</dd>
<dt>&#51064;&#53076;&#46377;</dt>
<dd>
<p>&#51064;&#53076;&#46377;&#51077;&#45768;&#45796;. <code>Hex</code> &#48143; <code>Base64</code> &#44050;&#51012; &#49324;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. <code>digest-algorithm</code>&#51060; &#51648;&#51221;&#46108; &#44221;&#50864;&#50640;&#45716; &#44592;&#48376;&#44050;&#51060; <code>Hex</code>&#51077;&#45768;&#45796;. <code>digest-algorithm</code>&#51060; &#51648;&#51221;&#46104;&#51648; &#50506;&#51008; &#44221;&#50864;&#50640;&#45716; &#44592;&#48376;&#51201;&#51004;&#47196; &#51064;&#53076;&#46377;&#51060; &#51648;&#51221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#47928;&#51088; &#51665;&#54633;</dt>
<dd>
<p>Digest &#50508;&#44256;&#47532;&#51608;&#51032; &#47928;&#51088; &#51665;&#54633;&#51077;&#45768;&#45796;.</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
