<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-messagesecurityconfignew" name="ref-messagesecurityconfignew"></a><a id="GHCOM00119" name="GHCOM00119"></a></p>

<h4><a id="sthref405" name="sthref405"></a>&#49352; &#47700;&#49884;&#51648; &#48372;&#50504; &#44396;&#49457;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#49352; &#47700;&#49884;&#51648; &#48372;&#50504; &#44396;&#49457;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#47700;&#49884;&#51648; &#48372;&#50504;&#50640; &#45824;&#54620; HttpServlet &#44396;&#49457;&#51012; &#49373;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>[&#49352; &#47700;&#49884;&#51648; &#48372;&#50504; &#44396;&#49457;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44396;&#49457; &#51060;&#47492;</dt>
<dd>
<p>&#51060; &#54168;&#51060;&#51648;&#51032; &#49444;&#51221;&#51060; &#51201;&#50857;&#46104;&#45716; &#44396;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51064;&#51613; &#44228;&#52789;</dt>
<dd>
<p>&#51064;&#51613;&#51060; &#49688;&#54665;&#46104;&#45716; &#47700;&#49884;&#51648; &#44228;&#52789;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. &#44050;&#51008; <code>SOAP</code> &#46608;&#45716; <code>HttpServlet</code>&#51060;&#50612;&#50556; &#54633;&#45768;&#45796;. SOAP &#44396;&#49457;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#44032;&#45733;&#54616;&#44592; &#46412;&#47928;&#50640; &#49440;&#53469; &#54637;&#47785;&#51008; <code>HttpServlet</code>&#49104;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51228;&#44277;&#51088; ID</dt>
<dd>
<p>&#51060; &#47700;&#49884;&#51648; &#48372;&#50504; &#44396;&#49457;&#50640; &#45824;&#54620; &#51228;&#44277;&#51088; &#44396;&#49457;&#51032; &#44256;&#50976; &#49885;&#48324;&#51088;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#44592;&#48376; &#51228;&#44277;&#51088;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; &#51060; &#51228;&#44277;&#51088;&#44032; &#44592;&#48376; &#51228;&#44277;&#51088;&#44032; &#46121;&#45768;&#45796;. &#44592;&#48376; &#51228;&#44277;&#51088;&#45716; &#53945;&#51221; &#51228;&#44277;&#51088;&#47484; &#49885;&#48324;&#54616;&#51648; &#50506;&#45716; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#54840;&#52636;&#46121;&#45768;&#45796;. &#51228;&#44277;&#51088;&#44032; &#44592;&#48376; &#53364;&#46972;&#51060;&#50616;&#53944; &#51228;&#44277;&#51088;&#45208; &#44592;&#48376; &#49436;&#48260; &#51228;&#44277;&#51088;&#51064;&#51648; &#46608;&#45716; &#46168; &#45796;&#51064;&#51648;&#45716; &#51228;&#44277;&#51088; &#50976;&#54805;&#51004;&#47196; &#44208;&#51221;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#51228;&#44277;&#51088; &#50976;&#54805;</dt>
<dd>
<p>&#51228;&#44277;&#51088;&#51032; &#50976;&#54805;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. &#49324;&#50857; &#44032;&#45733;&#54620; &#49440;&#53469; &#54637;&#47785;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt><code>client</code></dt>
<dd>
<p>&#51228;&#44277;&#51088;&#44032; &#53364;&#46972;&#51060;&#50616;&#53944; &#51064;&#51613; &#51228;&#44277;&#51088;&#51076;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
</dd>
<dt><code>server</code></dt>
<dd>
<p>&#51228;&#44277;&#51088;&#44032; &#49436;&#48260; &#51064;&#51613; &#51228;&#44277;&#51088;&#51076;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
</dd>
<dt><code>client-server</code></dt>
<dd>
<p>&#51228;&#44277;&#51088;&#44032; &#53364;&#46972;&#51060;&#50616;&#53944; &#48143; &#49436;&#48260; &#51064;&#51613; &#51228;&#44277;&#51088;&#51076;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
</dd>
</dl>
</dd>
<dt>&#53364;&#47000;&#49828; &#51060;&#47492;</dt>
<dd>
<p>&#51228;&#44277;&#51088;&#51032; Java &#44396;&#54788; &#53364;&#47000;&#49828;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#53364;&#46972;&#51060;&#50616;&#53944; &#51064;&#51613; &#51228;&#44277;&#51088;&#45716; <code>com.sun.enterprise.security.jauth.ClientAuthModule</code> &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#44396;&#54788;&#54644;&#50556; &#54633;&#45768;&#45796;. &#49436;&#48260;&#52769; &#51228;&#44277;&#51088;&#45716; <code>com.sun.enterprise.security.jauth.ServerAuthModule</code> &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#44396;&#54788;&#54644;&#50556; &#54633;&#45768;&#45796;. &#53364;&#46972;&#51060;&#50616;&#53944;-&#49436;&#48260; &#51228;&#44277;&#51088;&#45716; &#46160; &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#47784;&#46160; &#44396;&#54788;&#54644;&#50556; &#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#52628;&#44032; &#49549;&#49457;</dt>
<dd>
<p>&#47700;&#49884;&#51648; &#48372;&#50504; &#44396;&#49457;&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref406" name="sthref406"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">&#47700;&#49884;&#51648; &#48372;&#50504; &#51228;&#44277;&#51088;&#44032; &#49324;&#50857;&#54616;&#46020;&#47197; GlassFish Server &#44592;&#45733;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">&#47700;&#49884;&#51648; &#48372;&#50504; &#44396;&#49457;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">&#47700;&#49884;&#51648; &#48372;&#50504; &#44396;&#49457;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">&#47700;&#49884;&#51648; &#48372;&#50504; &#44396;&#49457;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">&#47700;&#49884;&#51648; &#48372;&#50504; &#51228;&#44277;&#51088; &#44396;&#49457;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">&#47700;&#49884;&#51648; &#48372;&#50504; &#51228;&#44277;&#51088; &#44396;&#49457;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">&#47700;&#49884;&#51648; &#48372;&#50504; &#51228;&#44277;&#51088; &#44396;&#49457;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#53364;&#46972;&#51060;&#50616;&#53944;&#50640; &#45824;&#54644; &#47700;&#49884;&#51648; &#48372;&#50504;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref407" name="sthref407"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<p>&#50630;&#51020;</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
