<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-configurationsystemproperties" name="ref-configurationsystemproperties"></a></p>

<h4><a id="sthref435" name="sthref435"></a><a id="sthref436" name="sthref436"></a>&#49884;&#49828;&#53596; &#49549;&#49457;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#49884;&#49828;&#53596; &#49549;&#49457; &#54168;&#51060;&#51648;&#50640;&#45716; &#49440;&#53469;&#54620; &#47749;&#47749;&#46108; &#44396;&#49457;&#50640; &#51221;&#51032;&#46108; Java &#49884;&#49828;&#53596; &#49549;&#49457; &#47785;&#47197;&#51060; &#54364;&#49884;&#46121;&#45768;&#45796;. Java &#49884;&#49828;&#53596; &#49549;&#49457;&#51008; GlassFish Server &#49884;&#51089; &#49884; Java &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#49892;&#54665;&#44592;&#51032; <code>-D</code> &#50741;&#49496;&#51012; &#53685;&#54644; Java &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#49892;&#54665;&#44592;&#47196; &#51204;&#45804;&#46121;&#45768;&#45796;.</p>
<p>&#51060;&#47084;&#54620; &#49549;&#49457;&#51008; &#44396;&#49457;&#51012; &#52280;&#51312;&#54616;&#45716; &#47784;&#46304; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54620; &#44592;&#48376; &#54252;&#53944; &#49444;&#51221; &#44050;&#51012; &#51221;&#51032;&#54633;&#45768;&#45796;.</p>
<p>&#44396;&#49457;&#51032; &#48120;&#47532; &#51221;&#51032;&#46108; &#54252;&#53944; &#49444;&#51221;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="ref-predefinedconfigsysproperties.html">&#49324;&#51204; &#51221;&#51032;&#46108; &#49884;&#49828;&#53596; &#49549;&#49457;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
<p>&#44033; &#49549;&#49457;&#50640; &#45824;&#54644; &#54364;&#49884;&#46104;&#45716; &#51221;&#48372;&#45716; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#51064;&#49828;&#53556;&#49828; &#48320;&#49688; &#51060;&#47492;</dt>
<dd>
<p>&#49884;&#49828;&#53596; &#49549;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#44592;&#48376;&#44050;</dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828;&#44032; &#52280;&#51312;&#54616;&#45716; &#47749;&#47749;&#46108; &#44396;&#49457;&#51032; &#49549;&#49457;&#50640; &#45824;&#54644; &#49444;&#51221;&#46108; &#44050;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51064;&#49828;&#53556;&#49828; &#44050;</dt>
<dd>
<p>&#49549;&#49457;&#51032; <a href="ref-sysinstancevalues.html">&#51064;&#49828;&#53556;&#49828; &#44050;</a> &#54168;&#51060;&#51648;&#50640; &#45824;&#54620; &#47553;&#53356;&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
<p>&#52628;&#44032; &#49549;&#49457; &#53580;&#51060;&#48660;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#46020; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#49549;&#49457; &#52628;&#44032;</dt>
<dd>
<p>&#49549;&#49457;&#51012; &#52628;&#44032;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#51060; &#45800;&#52628;&#47484; &#45572;&#47476;&#47732; &#52628;&#44032; &#49549;&#49457; &#53580;&#51060;&#48660;&#50640; &#54665;&#51060; &#52628;&#44032;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#49549;&#49457; &#49325;&#51228;</dt>
<dd>
<p>&#49440;&#53469;&#54620; &#49549;&#49457;&#51012; &#54616;&#45208; &#51060;&#49345; &#49325;&#51228;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#49325;&#51228;&#46108; &#49549;&#49457;&#51008; &#54644;&#45817; &#44592;&#48376;&#44050;&#51004;&#47196; &#46104;&#46028;&#47140;&#51648;&#44144;&#45208; &#44592;&#48376;&#44050;&#51060; &#49444;&#51221;&#46104;&#50612; &#51080;&#51648; &#50506;&#51008; &#44221;&#50864; &#51221;&#51032;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
</dl>
<p>[&#46608;&#54620; &#49884;&#49828;&#53596; &#49549;&#49457;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#46020; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44396;&#49457; &#51060;&#47492;</dt>
<dd>
<p>&#51060; &#54168;&#51060;&#51648;&#51032; &#49444;&#51221;&#51060; &#51201;&#50857;&#46104;&#45716; &#44396;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#46041;&#51201; &#51116;&#44396;&#49457;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#44396;&#49457; &#48320;&#44221; &#49324;&#54637;&#51008; &#51064;&#49828;&#53556;&#49828;&#47484; &#51116;&#49884;&#51089;&#54616;&#51648; &#50506;&#50500;&#46020; &#44396;&#49457;&#51012; &#52280;&#51312;&#54616;&#45716; &#51064;&#49828;&#53556;&#49828;&#50640; &#51201;&#50857;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#54644;&#45817; &#44396;&#49457;&#51012; &#49324;&#50857;&#54616;&#45716; &#53364;&#47084;&#49828;&#53552; &#48143;/&#46608;&#45716; &#51064;&#49828;&#53556;&#49828;</dt>
<dd>
<p>&#44033; &#53364;&#47084;&#49828;&#53552;&#45208; &#51064;&#49828;&#53556;&#49828; &#49892;&#54665; &#50668;&#48512; &#54364;&#49884;&#47196; &#44396;&#49457;&#51012; &#52280;&#51312;&#54616;&#45716; &#53364;&#47084;&#49828;&#53552; &#48143; &#51064;&#49828;&#53556;&#49828;&#51032; &#47785;&#47197;&#51077;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#53364;&#47084;&#49828;&#53552; &#46608;&#45716; &#51064;&#49828;&#53556;&#49828;&#44032; &#49892;&#54665; &#51473;&#51064; &#44221;&#50864; &#49440;&#53469; &#54364;&#49884; &#44592;&#54840;(&#10003;)&#44032; &#45208;&#53440;&#45225;&#45768;&#45796;.</p>
</li>
<li>
<p>&#53364;&#47084;&#49828;&#53552;&#45208; &#51064;&#49828;&#53556;&#49828;&#44032; &#51221;&#51648;&#46108; &#44221;&#50864; &#45712;&#45196;&#54364;(<code>!</code>)&#44032; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>
</li>
</ul>
</dd>
</dl>
<a id="sthref437" name="sthref437"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<p>&#44396;&#49457; &#49549;&#49457;&#51032; &#44592;&#48376;&#44050;&#51012; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</p>
<a id="sthref438" name="sthref438"></a>
<h5>&#46041;&#51068;&#54620; asadmin &#54616;&#50948; &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00059"><code>create-system-properties</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00110"><code>delete-system-property</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00203"><code>list-system-properties</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
