<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-messagesecurityproviderconfigprops" name="ref-messagesecurityproviderconfigprops"></a></p>

<h4><a id="sthref232" name="sthref232"></a><a id="sthref233" name="sthref233"></a>&#47700;&#49884;&#51648; &#48372;&#50504; &#51228;&#44277;&#51088; &#44396;&#49457; &#44288;&#47144; &#49549;&#49457;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#47700;&#49884;&#51648; &#48372;&#50504; &#51228;&#44277;&#51088;&#47484; &#44396;&#49457;&#54616;&#45716; &#45936; &#49324;&#50857;&#54624; &#49688; &#51080;&#45716; &#49549;&#49457;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt><code>server.config</code></dt>
<dd>
<p>&#49436;&#48260; &#44396;&#49457; &#51221;&#48372;&#44032; &#54252;&#54632;&#46108; XML &#54028;&#51068;&#51032; &#46356;&#47113;&#53664;&#47532; &#48143; &#54028;&#51068; &#51060;&#47492;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; domain-dir<code>/config/wss-server-config-1.0.xml</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>debug</code></dt>
<dd>
<p><code>true</code>&#51060;&#47732; &#49436;&#48260; &#51228;&#44277;&#51088; &#46356;&#48260;&#44536; &#47700;&#49884;&#51648;&#47484; &#49436;&#48260; &#47196;&#44536;&#50640; &#45924;&#54532;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>false</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>dynamic.username.password</code></dt>
<dd>
<p><code>true</code>&#51060;&#47732; &#51228;&#44277;&#51088; &#47088;&#53440;&#51076;&#50640;&#44172; &#44033; &#50836;&#52397;&#50640; &#45824;&#54644; <code>CallbackHandler</code>&#47196;&#48512;&#53552; &#49324;&#50857;&#51088; &#51060;&#47492;&#44284; &#48708;&#48128;&#48264;&#54840;&#47484; &#49688;&#51665;&#54616;&#46020;&#47197; &#49888;&#54840;&#47484; &#48372;&#45253;&#45768;&#45796;. false&#51060;&#47732; <code>wsse:UsernameToken(s)</code> &#50640; &#45824;&#54620; &#49324;&#50857;&#51088; &#51060;&#47492;&#44284; &#48708;&#48128;&#48264;&#54840;&#44032; &#47784;&#46280; &#52488;&#44592;&#54868; &#46020;&#51473; &#54620; &#48264; &#49688;&#51665;&#46121;&#45768;&#45796;. &#51060; &#49549;&#49457;&#51008; <code>ClientAuthModule</code>&#50640;&#47564; &#51201;&#50857; &#44032;&#45733;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>false</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>encryption.key.alias</code></dt>
<dd>
<p>&#51228;&#44277;&#51088;&#44032; &#49324;&#50857;&#54616;&#45716; &#50516;&#54840;&#54868; &#53412;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;. &#53412;&#45716; &#54644;&#45817; <code>keystore</code> &#48324;&#52845;&#51004;&#47196; &#49885;&#48324;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>s1as</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>signature.key.alias</code></dt>
<dd>
<p>&#51228;&#44277;&#51088;&#44032; &#49324;&#50857;&#54616;&#45716; &#49436;&#47749; &#53412;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;. &#53412;&#45716; &#54644;&#45817; <code>keystore</code> &#48324;&#52845;&#51004;&#47196; &#49885;&#48324;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>s1as</code>&#51077;&#45768;&#45796;.</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
