<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-editcertrealm" name="ref-editcertrealm"></a></p>

<h4><a id="sthref203" name="sthref203"></a><a id="sthref204" name="sthref204"></a><code>CertificateRealm</code> &#53364;&#47000;&#49828; &#44288;&#47144; &#49549;&#49457;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p><code>certificate</code> &#50689;&#50669;&#51008; SSL &#51064;&#51613;&#51012; &#51648;&#50896;&#54633;&#45768;&#45796;. &#51060; &#50689;&#50669;&#51008; GlassFish Server&#51032; &#48372;&#50504; &#52968;&#53581;&#49828;&#53944;&#50640; &#49324;&#50857;&#51088; ID&#47484; &#49444;&#51221;&#54616;&#47728;, &#48372;&#50504; &#51200;&#51109;&#49548; &#48143; &#53412; &#51200;&#51109;&#49548; &#54028;&#51068;&#50640; &#51080;&#45716; &#50516;&#54840;&#54868; &#48169;&#49885;&#51004;&#47196; &#44160;&#51613;&#46108; &#53364;&#46972;&#51060;&#50616;&#53944; &#51064;&#51613;&#49436;&#50640;&#49436; &#44032;&#51256;&#50728; &#49324;&#50857;&#51088; &#45936;&#51060;&#53552;&#47196; &#51060;&#47484; &#52292;&#50881;&#45768;&#45796;. <code>keytool</code> &#46608;&#45716; <code>certutil</code>&#51012; &#49324;&#50857;&#54616;&#50668; &#49324;&#50857;&#51088;&#47484; &#54644;&#45817; &#54028;&#51068;&#50640; &#52628;&#44032;&#54633;&#45768;&#45796;. &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="http://www.oracle.com/pls/topic/lookup?ctx=dsc&amp;id=/app/docs/doc/821-1841#gijrp"><i>Java EE 6 &#51088;&#49845;&#49436;</i>&#51032; Part&nbsp;VII, <i>Security</i></a>&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
<p>Java &#52968;&#53580;&#51060;&#45320;&#45716; <code>certificate</code> &#50689;&#50669;&#51012; &#49324;&#50857;&#54616;&#50668; &#49324;&#50857;&#51088; &#51064;&#51613;&#49436;&#50640; &#51080;&#45716; &#44033; &#49324;&#50857;&#51088;&#51032; DN(&#49885;&#48324; &#51060;&#47492;)&#51012; &#44592;&#48152;&#51004;&#47196; &#44428;&#54620; &#48512;&#50668; &#54532;&#47196;&#49464;&#49828;&#47484; &#52376;&#47532;&#54633;&#45768;&#45796;. DN&#51008; &#50644;&#54000;&#54000; &#51060;&#47492;&#51060;&#47728; &#51064;&#51613;&#49436;&#44032; &#51060; &#50644;&#54000;&#54000;&#51032; &#44277;&#50857; &#53412;&#47484; &#49885;&#48324;&#54633;&#45768;&#45796;. &#51060; &#51060;&#47492;&#51008; X.500 &#54364;&#51456;&#51012; &#49324;&#50857;&#54616;&#48064;&#47196; &#51064;&#53552;&#45367; &#49345;&#50640;&#49436; &#44256;&#50976;&#54616;&#44172; &#51648;&#51221;&#46121;&#45768;&#45796;. &#53412; &#51200;&#51109;&#49548; &#48143; &#53944;&#47084;&#49828;&#53944; &#51200;&#51109;&#49548;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; keytool &#49444;&#47749;&#49436;(<code><a href="http://java.sun.com/j2se/1.4.2/docs/tooldocs/solaris/keytool.html">http://java.sun.com/j2se/1.4.2/docs/tooldocs/solaris/keytool.html</a></code>)&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
<p><code>certificate</code> &#50689;&#50669;&#51032; &#44221;&#50864; &#45796;&#51020;&#44284; &#44057;&#51008; &#49440;&#53469;&#51201; &#49549;&#49457;&#51012; &#49324;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44536;&#47353; &#51648;&#51221;</dt>
<dd>
<p>&#49788;&#54364;&#47196; &#44396;&#48516;&#46108; &#44536;&#47353; &#51060;&#47492; &#47785;&#47197;&#51077;&#45768;&#45796;. &#51201;&#54633;&#54620; &#51064;&#51613;&#49436;&#47484; &#51228;&#44277;&#54616;&#45716; &#47784;&#46304; &#53364;&#46972;&#51060;&#50616;&#53944;&#44032; &#51060;&#47084;&#54620; &#44536;&#47353;&#50640; &#51648;&#51221;&#46121;&#45768;&#45796;. &#50696;&#47484; &#46308;&#50612; <code>employee,manager</code>&#45716; &#49324;&#50857;&#51088; &#44536;&#47353;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
