<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-messagesecurityconfigedit" name="ref-messagesecurityconfigedit"></a></p>

<h4><a id="sthref229" name="sthref229"></a>&#47700;&#49884;&#51648; &#48372;&#50504; &#44396;&#49457; &#54200;&#51665;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#47700;&#49884;&#51648; &#48372;&#50504; &#44396;&#49457; &#54200;&#51665;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#47700;&#49884;&#51648; &#48372;&#50504;&#50640; &#45824;&#54620; &#51228;&#44277;&#51088;&#47484; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>GlassFish Server&#50640; &#48176;&#52824;&#46108; &#50937; &#49436;&#48708;&#49828; &#45149;&#51216;&#50640; &#45824;&#54620; &#47700;&#49884;&#51648; &#48372;&#50504;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47140;&#47732; &#49436;&#48260;&#52769;&#50640;&#49436; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#46104;&#45716; &#51228;&#44277;&#51088;&#47484; &#51648;&#51221;&#54644;&#50556; &#54633;&#45768;&#45796;. &#47700;&#49884;&#51648; &#48372;&#50504;&#51012; &#50948;&#54620; &#44592;&#48376; &#51228;&#44277;&#51088;&#47484; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54620; &#44221;&#50864; GlassFish Server&#50640; &#48176;&#52824;&#46108; &#50937; &#49436;&#48708;&#49828;&#51032; &#53364;&#46972;&#51060;&#50616;&#53944;&#50640;&#49436; &#49324;&#50857;&#54624; &#51228;&#44277;&#51088;&#46020; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54644;&#50556; &#54633;&#45768;&#45796;. &#53364;&#46972;&#51060;&#50616;&#53944;&#50640;&#49436; &#49324;&#50857;&#54616;&#45716; &#51228;&#44277;&#51088;&#47484; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;&#51008; <a href="task-enablemesec4appclients.html">&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#53364;&#46972;&#51060;&#50616;&#53944;&#50640; &#45824;&#54644; &#47700;&#49884;&#51648; &#48372;&#50504;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
<p>&#48176;&#52824;&#46108; &#45149;&#51216;&#50640;&#49436; &#48156;&#49373;&#54620; &#50937; &#49436;&#48708;&#49828; &#54840;&#52636;&#50640; &#45824;&#54644; &#47700;&#49884;&#51648; &#48372;&#50504;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47140;&#47732; &#44592;&#48376; &#53364;&#46972;&#51060;&#50616;&#53944; &#51228;&#44277;&#51088;&#47484; &#51648;&#51221;&#54644;&#50556; &#54633;&#45768;&#45796;. GlassFish Server&#50640; &#45824;&#54620; &#44592;&#48376; &#53364;&#46972;&#51060;&#50616;&#53944; &#51228;&#44277;&#51088;&#47484; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54620; &#44221;&#50864; GlassFish Server&#50640; &#48176;&#52824;&#46108; &#45149;&#51216;&#50640;&#49436; &#54840;&#52636;&#54620; &#47784;&#46304; &#49436;&#48708;&#49828;&#44032; &#47700;&#49884;&#51648; &#44228;&#52789; &#48372;&#50504;&#44284; &#54840;&#54872; &#44032;&#45733;&#54616;&#44172; &#44396;&#49457;&#46104;&#46020;&#47197; &#54644;&#50556; &#54633;&#45768;&#45796;.</p>
<p>[&#47700;&#49884;&#51648; &#48372;&#50504; &#44396;&#49457; &#54200;&#51665;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44396;&#49457; &#51060;&#47492;</dt>
<dd>
<p>&#51060; &#54168;&#51060;&#51648;&#51032; &#49444;&#51221;&#51060; &#51201;&#50857;&#46104;&#45716; &#44396;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51064;&#51613; &#44228;&#52789;</dt>
<dd>
<p>&#51064;&#51613;&#51060; &#49688;&#54665;&#46104;&#45716; &#47700;&#49884;&#51648; &#44228;&#52789;&#51077;&#45768;&#45796;. &#51069;&#44592; &#51204;&#50857; &#54596;&#46300;&#51077;&#45768;&#45796;. &#44050;&#51008; <code>SOAP</code>(&#44592;&#48376; &#47700;&#49884;&#51648; &#48372;&#50504; &#44396;&#49457;&#51032; &#44221;&#50864;) &#46608;&#45716; <code>HttpServlet</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#44592;&#48376; &#51228;&#44277;&#51088;</dt>
<dd>
<p>&#44592;&#48376; &#49436;&#48260;-&#53364;&#46972;&#51060;&#50616;&#53944; &#51228;&#44277;&#51088;&#51077;&#45768;&#45796;(&#51080;&#45716; &#44221;&#50864;). &#44592;&#48376; &#51228;&#44277;&#51088;&#46972;&#44256;&#46020; &#54616;&#45716; &#44592;&#48376; &#49436;&#48260; &#51228;&#44277;&#51088;&#45716; &#53945;&#51221; &#49436;&#48260; &#51228;&#44277;&#51088;&#47484; &#49885;&#48324;&#54616;&#51648; &#50506;&#45716; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#45824;&#54644; &#54840;&#52636;&#46108; &#49436;&#48260; &#51228;&#44277;&#51088;&#47484; &#49885;&#48324;&#54633;&#45768;&#45796;. <code>ServerProvider</code>, <code>XWS_ServerProvider</code> &#46608;&#45716; &#50630;&#51020;&#51012; &#49440;&#53469;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; &#51228;&#44277;&#51088;&#44032; &#49440;&#53469;&#46104;&#50612; &#51080;&#51648; &#50506;&#51004;&#47728;, GlassFish Server&#50640;&#49436;&#45716; &#49436;&#48260;&#52769;&#51032; &#47700;&#49884;&#51648; &#48372;&#50504; &#51228;&#44277;&#51088;&#47484; &#54840;&#52636;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;. &#51068;&#48152;&#51201;&#51004;&#47196; <code>ServerProvider</code>&#47484; &#44592;&#48376; &#51228;&#44277;&#51088;&#47196; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#44592;&#48376; &#53364;&#46972;&#51060;&#50616;&#53944; &#51228;&#44277;&#51088;</dt>
<dd>
<p>&#44592;&#48376; &#53364;&#46972;&#51060;&#50616;&#53944; &#51228;&#44277;&#51088;&#51077;&#45768;&#45796;(&#51080;&#45716; &#44221;&#50864;). &#44592;&#48376; &#53364;&#46972;&#51060;&#50616;&#53944; &#51228;&#44277;&#51088;&#45716; &#53945;&#51221; &#53364;&#46972;&#51060;&#50616;&#53944; &#51228;&#44277;&#51088;&#47484; &#49885;&#48324;&#54616;&#51648; &#50506;&#45716; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#54840;&#52636;&#46108; &#53364;&#46972;&#51060;&#50616;&#53944; &#51228;&#44277;&#51088;&#47484; &#49885;&#48324;&#54633;&#45768;&#45796;. <code>ClientProvider</code>, <code>XWS_ClientProvider</code> &#46608;&#45716; &#50630;&#51020;&#51012; &#49440;&#53469;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; &#51228;&#44277;&#51088;&#44032; &#49440;&#53469;&#46104;&#50612; &#51080;&#51648; &#50506;&#51004;&#47728;, GlassFish Server&#50640;&#49436;&#45716; &#53364;&#46972;&#51060;&#50616;&#53944;&#52769;&#51032; &#47700;&#49884;&#51648; &#48372;&#50504; &#51228;&#44277;&#51088;&#47484; &#54840;&#52636;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;. &#51068;&#48152;&#51201;&#51004;&#47196; &#44592;&#48376; &#53364;&#46972;&#51060;&#50616;&#53944; &#51228;&#44277;&#51088;&#50640; &#45824;&#54644; [&#50630;&#51020;]&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;. <code>ClientProvider</code>&#47484; &#49440;&#53469;&#54616;&#47732; &#44592;&#48376; &#51228;&#44277;&#51088; &#48143; &#47700;&#49884;&#51648; &#48372;&#54840; &#51221;&#52293;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#50668; GlassFish Server&#50640; &#48176;&#52824;&#46108; &#50937; &#49436;&#48708;&#49828; &#45149;&#51216;&#50640;&#49436; &#48156;&#49373;&#54620; &#50937; &#49436;&#48708;&#49828; &#54840;&#52636;&#50640; &#51201;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="GHCOM461" name="GHCOM461"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">&#47700;&#49884;&#51648; &#48372;&#50504; &#51228;&#44277;&#51088;&#44032; &#49324;&#50857;&#54616;&#46020;&#47197; GlassFish Server &#44592;&#45733;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">&#47700;&#49884;&#51648; &#48372;&#50504; &#44396;&#49457;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">&#47700;&#49884;&#51648; &#48372;&#50504; &#44396;&#49457;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">&#47700;&#49884;&#51648; &#48372;&#50504; &#44396;&#49457;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">&#47700;&#49884;&#51648; &#48372;&#50504; &#51228;&#44277;&#51088; &#44396;&#49457;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">&#47700;&#49884;&#51648; &#48372;&#50504; &#51228;&#44277;&#51088; &#44396;&#49457;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">&#47700;&#49884;&#51648; &#48372;&#50504; &#51228;&#44277;&#51088; &#44396;&#49457;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#53364;&#46972;&#51060;&#50616;&#53944;&#50640; &#45824;&#54644; &#47700;&#49884;&#51648; &#48372;&#50504;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="GHCOM462" name="GHCOM462"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00226"><code>set</code>(1)</a> &#47749;&#47161;&#51012; &#49324;&#50857;&#54616;&#50668; &#47700;&#49884;&#51648; &#48372;&#50504; &#44396;&#49457;&#51012; &#49688;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#44592;&#48376; &#49436;&#48260; &#51228;&#44277;&#51088;&#47484; &#51648;&#51221;&#54616;&#47140;&#47732; &#45796;&#51020; &#51089;&#50629;&#51012; &#49688;&#54665;&#54633;&#45768;&#45796;.</p>
<pre>
asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
default_provider=ServerProvider
</pre></li>
<li>
<p>&#44592;&#48376; &#53364;&#46972;&#51060;&#50616;&#53944; &#51228;&#44277;&#51088;&#47484; &#51648;&#51221;&#54616;&#47140;&#47732; &#45796;&#51020; &#51089;&#50629;&#51012; &#49688;&#54665;&#54633;&#45768;&#45796;.</p>
<pre>
asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
default_client_provider=ClientProvider
</pre></li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
