<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmxconnectorssledit" name="ref-jmxconnectorssledit"></a><a id="GHCOM00128" name="GHCOM00128"></a></p>

<h4><a id="sthref428" name="sthref428"></a><a id="sthref429" name="sthref429"></a><a id="sthref430" name="sthref430"></a>SSL</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>SSL &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; JMX &#52964;&#45349;&#53552;&#51032; SSL &#49444;&#51221;&#51012; &#49688;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#51060; &#54168;&#51060;&#51648;&#51032; &#49444;&#51221;&#51008; [JMX &#52964;&#45349;&#53552; &#54200;&#51665;] &#54168;&#51060;&#51648;&#50640;&#49436; JMX &#52964;&#45349;&#53552;&#50640; &#45824;&#54644; &#48372;&#50504;&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864;&#50640;&#47564; &#51032;&#48120;&#44032; &#51080;&#49845;&#45768;&#45796;.</p>
<p>SSL &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44396;&#49457; &#51060;&#47492;</dt>
<dd>
<p>&#51060; &#54168;&#51060;&#51648;&#51032; &#49444;&#51221;&#51060; &#51201;&#50857;&#46104;&#45716; &#44396;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>SSL3</dt>
<dd>
<p>&#51060; &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#47732; SSL3 &#54532;&#47196;&#53664;&#53084;&#51060; JMX &#52964;&#45349;&#53552;&#50640; &#45824;&#54644; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>TLS</dt>
<dd>
<p>&#51060; &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#47732; TLS &#54532;&#47196;&#53664;&#53084;&#51060; JMX &#52964;&#45349;&#53552;&#50640; &#45824;&#54644; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#53364;&#46972;&#51060;&#50616;&#53944; &#51064;&#51613;</dt>
<dd>
<p>&#51060; &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#47732; &#53364;&#46972;&#51060;&#50616;&#53944;&#45716; &#47588; &#50836;&#52397; &#49884; &#49436;&#48260;&#50640; &#51088;&#49888;&#51012; &#49885;&#48324;&#54644;&#50556; &#54633;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#51064;&#51613;&#49436; &#48324;&#47749;</dt>
<dd>
<p>&#51064;&#51613;&#49436; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#46608;&#45716; PKCS#11 &#53664;&#53360;&#50640;&#49436; &#49436;&#48260; &#51064;&#51613;&#49436;&#51032; &#48324;&#47749;&#51077;&#45768;&#45796;. &#51064;&#51613;&#49436;&#50640;&#49436; &#51060;&#47492; &#54805;&#49885;&#51008; <i>tokenname</i><code>:</code><i>nickname</i>&#51077;&#45768;&#45796;. &#51060; &#49549;&#49457;&#50640; &#51060;&#47492;&#51032; <i>tokenname</i><code>:</code> &#48512;&#48516;&#51012; &#54252;&#54632;&#49884;&#53412;&#45716; &#44163;&#51008; &#49440;&#53469; &#49324;&#54637;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#53412; &#51200;&#51109;&#49548;</dt>
<dd>
<p>&#53412; &#51200;&#51109;&#49548; &#54028;&#51068;&#51032; &#51060;&#47492;(&#50696;: <code>keystore.jks</code> )&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#53944;&#47084;&#49828;&#53944; &#50508;&#44256;&#47532;&#51608;</dt>
<dd>
<p>&#51064;&#51613; &#44221;&#47196; &#44160;&#51613;&#50640; &#49324;&#50857;&#54624; &#53944;&#47084;&#49828;&#53944; &#44288;&#47532; &#50508;&#44256;&#47532;&#51608;(&#50696;: PKIX)&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#45824; &#51064;&#51613;&#49436; &#44600;&#51060;</dt>
<dd>
<p>&#51064;&#51613;&#49436; &#44221;&#47196;&#50640; &#51080;&#51012; &#49688; &#51080;&#45716; &#51088;&#52404; &#48156;&#54665;&#51060; &#50500;&#45772; &#51473;&#44036; &#51064;&#51613;&#49436;&#51032; &#52572;&#45824; &#49688;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; [&#53944;&#47084;&#49828;&#53944; &#50508;&#44256;&#47532;&#51608;] &#54596;&#46300;&#47484; PKIX&#47196; &#49444;&#51221;&#54620; &#44221;&#50864;&#50640;&#47564; &#49324;&#50857;&#46121;&#45768;&#45796;. &#44050;&#51060; 0&#51060;&#47732; &#44221;&#47196;&#50640; &#45800;&#51068; &#51064;&#51613;&#49436;&#47564; &#54252;&#54632;&#46112; &#49688; &#51080;&#51020;&#51012; &#51032;&#48120;&#54633;&#45768;&#45796;. &#44050;&#51060; -1&#51060;&#47732; &#44221;&#47196; &#44600;&#51060;&#44032; &#51228;&#54620;&#46104;&#51648; &#50506;&#51020;&#51012; &#51032;&#48120;&#54633;&#45768;&#45796;(&#52572;&#45824;&#44050; &#50630;&#51020;). &#44050;&#51012; -1 &#48120;&#47564;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; &#50696;&#50808; &#49324;&#54637;&#51060; &#48156;&#49373;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#53944;&#47084;&#49828;&#53944; &#51200;&#51109;&#49548;</dt>
<dd>
<p>&#53944;&#47084;&#49828;&#53944; &#51200;&#51109;&#49548; &#54028;&#51068;&#51032; &#51060;&#47492;(&#50696;: <code>cacerts.jks</code> )&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#50516;&#54840;&#54868; &#51228;&#54408;&#44400;</dt>
<dd>
<p>&#50516;&#54840;&#54868; &#51228;&#54408;&#44400;&#51012; &#52628;&#44032;&#54616;&#44144;&#45208; &#51228;&#44144;&#54624; &#49688; &#51080;&#45716; &#50689;&#50669;&#51077;&#45768;&#45796;. &#50516;&#54840;&#54868; &#51228;&#54408;&#44400;&#51012; &#52628;&#44032;&#54616;&#51648; &#50506;&#51004;&#47732; &#47784;&#46304; &#50516;&#54840;&#54868; &#51228;&#54408;&#44400;&#51060; &#49324;&#50857;&#46121;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref431" name="sthref431"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-jmxconnectoredit.html">JMX &#52964;&#45349;&#53552;&#47484; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jmxconnectorssledit.html">JMX &#52964;&#45349;&#53552;&#51032; SSL &#49444;&#51221;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
