<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-generaltab" name="ref-generaltab"></a></p>

<h4><a id="sthref234" name="sthref234"></a><a id="sthref235" name="sthref235"></a>&#51068;&#48152; &#51221;&#48372;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>GlassFish Server&#51008;(&#45716;) &#49444;&#52824; &#49884; <code>&#49436;&#48260;</code>&#46972;&#45716; &#54620; &#44060;&#51032; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#47484; &#49373;&#49457;&#54633;&#45768;&#45796;. &#50896;&#54616;&#45716; &#44221;&#50864; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#47484; &#49325;&#51228;&#54616;&#44256; &#45796;&#47480; &#51060;&#47492;&#51032; &#49352; &#51064;&#49828;&#53556;&#49828;&#47484; &#49373;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#44033; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#45716; &#44256;&#50976;&#54620; Java &#44396;&#49457;, Java &#47532;&#49548;&#49828;, &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#48176;&#52824; &#50689;&#50669; &#48143; &#49436;&#48260; &#44396;&#49457; &#49444;&#51221;&#51012; &#49324;&#50857;&#54633;&#45768;&#45796;. &#54620; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#44032; &#48320;&#44221;&#46104;&#47732; &#45796;&#47480; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#46020; &#50689;&#54693;&#51012; &#48155;&#49845;&#45768;&#45796;. &#54620; &#44288;&#47532; &#46020;&#47700;&#51064; &#45236;&#50640;&#45716; &#54620; &#44060;&#51032; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#44032; &#51080;&#51012; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#45824;&#48512;&#48516;&#51032; &#49324;&#50857;&#51088;&#50640;&#44172;&#45716; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#44032; &#54616;&#45208;&#47564; &#51080;&#51004;&#47732; &#46121;&#45768;&#45796;. &#54616;&#51648;&#47564; &#54872;&#44221;&#50640; &#46384;&#46972; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#47484; &#52628;&#44032;&#47196; &#54616;&#45208; &#51060;&#49345; &#49373;&#49457;&#54644;&#50556; &#54624; &#49688;&#46020; &#51080;&#49845;&#45768;&#45796;. &#50696;&#47484; &#46308;&#50612;, &#44060;&#48156; &#54872;&#44221;&#50640;&#49436; &#50668;&#47084; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#47484; &#49324;&#50857;&#54616;&#50668; &#45796;&#47480; GlassFish Server &#44396;&#49457;&#51012; &#53580;&#49828;&#53944;&#54616;&#44144;&#45208; &#50668;&#47084; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#48176;&#52824;&#47484; &#48708;&#44368; &#48143; &#53580;&#49828;&#53944;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#45716; &#49789;&#44172; &#52628;&#44032;&#54616;&#44144;&#45208; &#49325;&#51228;&#54624; &#49688; &#51080;&#51004;&#48064;&#47196; &#51060;&#47484; &#53685;&#54644; &#44060;&#48156; &#46020;&#51473; &#53580;&#49828;&#53944;&#54624; &#51076;&#49884; "Sandbox" &#50689;&#50669;&#51012; &#49373;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#46608;&#54620; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#47560;&#45796; &#44032;&#49345; &#49436;&#48260;&#47484; &#49373;&#49457;&#54624; &#49688;&#46020; &#51080;&#49845;&#45768;&#45796;. &#49444;&#52824;&#46108; &#54616;&#45208;&#51032; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828; &#45236;&#50640; &#54924;&#49324; &#46608;&#45716; &#44060;&#51064; &#46020;&#47700;&#51064; &#51060;&#47492;, IP &#51452;&#49548; &#48143; &#51068;&#48512; &#44288;&#47532; &#44592;&#45733;&#51012; &#51228;&#44277;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#49324;&#50857;&#51088;&#51032; &#44221;&#50864; &#51060;&#45716; &#54616;&#46300;&#50920;&#50612; &#48143; &#44592;&#48376; &#49436;&#48260; &#50976;&#51648; &#44288;&#47532; &#50630;&#51060; &#51088;&#52404; &#50937; &#49436;&#48260;&#47484; &#48372;&#50976;&#54616;&#44256; &#51080;&#45716; &#44163;&#44284; &#47560;&#52268;&#44032;&#51648;&#51077;&#45768;&#45796;. &#51060; &#44032;&#49345; &#49436;&#48260;&#45716; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#47484; &#54869;&#51109;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;. &#44032;&#49345; &#49436;&#48260;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="ref-serverinstjvmgeneral.html">JVM &#51068;&#48152; &#49444;&#51221;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
<p>&#50868;&#50689; &#48176;&#52824;&#50640;&#49436; &#45824;&#48512;&#48516;&#51032; &#44221;&#50864; &#44032;&#49345; &#49436;&#48260;&#47484; &#50668;&#47084; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828; &#45824;&#49888; &#49324;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#44536;&#47084;&#45208; &#44032;&#49345; &#49436;&#48260;&#44032; &#49324;&#50857;&#51088;&#51032; &#50836;&#44396;&#47484; &#52649;&#51313;&#54616;&#51648; &#47803;&#54624; &#44221;&#50864; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#47484; &#50668;&#47084; &#44060; &#49324;&#50857;&#54624; &#49688;&#46020; &#51080;&#49845;&#45768;&#45796;.</p>
<p>GlassFish Server &#51064;&#49828;&#53556;&#49828;&#45716; &#51088;&#46041;&#51004;&#47196; &#49884;&#51089;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;. &#51064;&#49828;&#53556;&#49828;&#45716; &#54620; &#48264; &#49884;&#51089;&#46104;&#47732; &#51221;&#51648;&#54624; &#46412;&#44620;&#51648; &#49892;&#54665;&#46121;&#45768;&#45796;. &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#47484; &#51221;&#51648;&#54616;&#47732; &#49352; &#51217;&#49549;&#51060; &#54728;&#50857;&#46104;&#51648; &#50506;&#44256; &#52376;&#47532;&#46104;&#51648; &#50506;&#51008; &#51217;&#49549;&#51060; &#47784;&#46160; &#50756;&#47308;&#46112; &#46412;&#44620;&#51648; &#44592;&#45796;&#47549;&#45768;&#45796;. &#49884;&#49828;&#53596;&#51060; &#49552;&#49345;&#46104;&#44144;&#45208; &#50724;&#54532;&#46972;&#51064;&#51064; &#44221;&#50864; &#49436;&#48260;&#44032; &#51333;&#47308;&#46104;&#44256; &#49436;&#48260;&#50640;&#49436; &#51228;&#44277;&#54616;&#45912; &#50836;&#52397;&#51060; &#49552;&#49892;&#46112; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>[&#51068;&#48152; &#51221;&#48372;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; GlassFish Server &#49444;&#51221;&#51012; &#54869;&#51064;&#54616;&#44256; Java Virtual Machine &#45936;&#51060;&#53552;&#47484; &#48380; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>[&#51068;&#48152; &#51221;&#48372;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#51221;&#48372;&#44032; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#51221;&#51648; &#45800;&#52628;</dt>
<dd>
<p>GlassFish Server&#47484; &#51221;&#51648;&#54616;&#47140;&#47732; [&#51221;&#51648;] &#45800;&#52628;&#47484; &#45572;&#47493;&#45768;&#45796;.</p>
</dd>
<dt>&#51116;&#49884;&#51089; &#45800;&#52628;</dt>
<dd>
<p>GlassFish Server&#47484; &#51116;&#49884;&#51089;&#54616;&#47140;&#47732; [&#51116;&#49884;&#51089;] &#45800;&#52628;&#47484; &#45572;&#47493;&#45768;&#45796;.</p>
</dd>
<dt>&#47196;&#44536; &#54028;&#51068; &#48372;&#44592; &#45800;&#52628;</dt>
<dd>
<p>GlassFish Server &#51064;&#49828;&#53556;&#49828;&#45208; &#53364;&#47084;&#49828;&#53552;&#50640; &#45824;&#54620; &#47196;&#44536; &#54028;&#51068;&#51012; &#48372;&#47140;&#47732; [&#47196;&#44536; &#54028;&#51068; &#48372;&#44592;] &#45800;&#52628;&#47484; &#45572;&#47493;&#45768;&#45796;.</p>
</dd>
<dt>&#47196;&#44536; &#44368;&#52404; &#45800;&#52628;</dt>
<dd>
<p>&#44288;&#47532; &#49436;&#48260;(<code>&#49436;&#48260;</code>)&#51032; &#47196;&#44536; &#54028;&#51068;&#51012; &#44368;&#52404;&#54616;&#47140;&#47732; [&#47196;&#44536; &#44368;&#52404;] &#45800;&#52628;&#47484; &#45572;&#47493;&#45768;&#45796;.</p>
</dd>
<dt>&#53944;&#47004;&#51117;&#49496; &#48373;&#44396; &#45800;&#52628;</dt>
<dd>
<p><code>&#54168;&#51060;&#51648;&#50640;&#49436; &#44288;&#47532; &#49436;&#48260;(</code>&#49436;&#48260;<a href="ref-recovertransactions.html">&#53944;&#47004;&#51117;&#49496; &#48373;&#44396;</a>)&#50640; &#45824;&#54620; &#53944;&#47004;&#51117;&#49496;&#51012; &#48373;&#44396;&#54616;&#47140;&#47732; [&#53944;&#47004;&#51117;&#49496; &#48373;&#44396;] &#45800;&#52628;&#47484; &#45572;&#47493;&#45768;&#45796;.</p>
</dd>
<dt>&#48372;&#50504; &#44288;&#47532; &#45800;&#52628;</dt>
<dd>
<p>[&#48372;&#50504; &#44288;&#47532;] &#45800;&#52628;&#47484; &#45572;&#47476;&#47732; <a href="ref-securityadmin.html">&#48372;&#50504; &#44288;&#47532;</a> &#54168;&#51060;&#51648;&#50640;&#49436; &#48372;&#50504; &#44288;&#47532;&#44032; &#49324;&#50857; &#46608;&#45716; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#51060;&#47492;</dt>
<dd>
<p>&#54788;&#51116; &#49436;&#48260;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49345;&#53468;</dt>
<dd>
<p>&#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#51032; &#54788;&#51116; &#49345;&#53468;&#51077;&#45768;&#45796;. &#49436;&#48260;&#45716; &#51221;&#51648;&#46120;, &#49884;&#51089;&#46120; &#46608;&#45716; &#49892;&#54665; &#51473; &#49345;&#53468;&#51068; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#51089;&#46041; &#49884;&#44036;</dt>
<dd>
<p>&#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#44032; &#50672;&#49549;&#51004;&#47196; &#49892;&#54665; &#51473;&#51064; &#49884;&#44036;(&#49884;:&#48516;)&#51012; &#45208;&#53440;&#45236;&#47728;, &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>HTTP &#47196;&#46300; &#48184;&#47088;&#49436;</dt>
<dd>
<p>&#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54644; &#47196;&#46300; &#48184;&#47088;&#49436;&#44032; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864;, &#47196;&#46300; &#48184;&#47088;&#49436;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>JVM</dt>
<dd>
<p>JVM &#48372;&#44256;&#49436;&#47484; &#45572;&#47476;&#47732; &#48324;&#46020;&#51032; &#52285;&#51060; &#50676;&#47532;&#44256; &#50836;&#50557; &#48372;&#44256;&#49436;, &#47700;&#47784;&#47532; &#44288;&#47532; &#48143; &#48520;&#54596;&#50836;&#54620; &#51221;&#48372; &#49688;&#51665; &#48372;&#44256;&#49436;, &#53364;&#47000;&#49828; &#47196;&#46377; &#48372;&#44256;&#49436; &#48143; &#54788;&#51116; &#49828;&#47112;&#46300; &#45924;&#54532;&#47484; &#54252;&#54632;&#54620; Java Virtual Machine&#50640; &#45824;&#54620; &#48372;&#44256;&#49436;&#44032; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#44396;&#49457; &#46356;&#47113;&#53664;&#47532;</dt>
<dd>
<p><code>domain.xml</code>&#44284; &#44057;&#51008; &#44396;&#49457; &#54028;&#51068;&#51060; &#54252;&#54632;&#46108; &#54840;&#49828;&#53944; &#49884;&#49828;&#53596;&#51032; &#46356;&#47113;&#53664;&#47532;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49444;&#52824;&#46108; &#48260;&#51204;</dt>
<dd>
<p>&#51228;&#54408; &#48260;&#51204; &#49885;&#48324;&#51088;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#48372;&#50504; &#44288;&#47532;</dt>
<dd>
<p>&#48372;&#50504; &#44288;&#47532;&#51032; &#54788;&#51116; &#49345;&#53468;&#51077;&#45768;&#45796;. &#44032;&#45733;&#54620; &#44050;&#51008; [&#49324;&#50857;] &#48143; [&#49324;&#50857; &#50504;&#54632;]&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#46356;&#48260;&#44536;</dt>
<dd>
<p>&#46356;&#48260;&#44613;&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50632;&#45716;&#51648; &#50668;&#48512;&#47484; &#49885;&#48324;&#54633;&#45768;&#45796;. &#46356;&#48260;&#44613;&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#54252;&#53944; &#48264;&#54840;&#46020; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>HTTP &#54252;&#53944;</dt>
<dd>
<p>HTTP &#50836;&#52397; &#48143; &#51025;&#45813;&#50640; &#45824;&#54644; &#54788;&#51116; &#44396;&#49457;&#46108; &#54252;&#53944;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>IIOP &#54252;&#53944;</dt>
<dd>
<p>IIOP &#50836;&#52397; &#48143; &#51025;&#45813;&#50640; &#45824;&#54644; &#54788;&#51116; &#44396;&#49457;&#46108; &#54252;&#53944;&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref236" name="sthref236"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-generaltab.html">DAS&#50640; &#45824;&#54620; &#51068;&#48152; &#51221;&#48372;&#47484; &#48372;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-logviewer.html">DAS&#50640; &#45824;&#54620; &#47196;&#44536; &#54028;&#51068;&#51012; &#48372;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
