<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-logviewer" name="ref-logviewer"></a><a id="GHCOM00059" name="GHCOM00059"></a></p>

<h4><a id="sthref237" name="sthref237"></a><a id="sthref238" name="sthref238"></a><a id="sthref239" name="sthref239"></a>&#47196;&#44536; &#48624;&#50612;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#47196;&#44536; &#48624;&#50612;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#50752; &#53364;&#47084;&#49828;&#53552;&#50640; &#45824;&#54620; &#47196;&#44536; &#54028;&#51068;&#51012; &#48372;&#44256; &#47196;&#44536; &#54364;&#49884;&#47484; &#49324;&#50857;&#51088; &#51221;&#51032;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>[&#47196;&#44536; &#48624;&#50612;] &#54168;&#51060;&#51648;&#45716; &#45796;&#51020; &#45348; &#50689;&#50669;&#51004;&#47196; &#44396;&#49457;&#46121;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#44160;&#49353; &#44592;&#51456;</p>
</li>
<li>
<p>&#44256;&#44553; &#44160;&#49353;</p>
</li>
<li>
<p>&#44160;&#49353; &#49688;&#51221;</p>
</li>
<li>
<p>&#44160;&#49353; &#44208;&#44284;</p>
</li>
</ul>
<p>[&#44160;&#49353; &#44592;&#51456;] &#50689;&#50669;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44256;&#44553; &#44160;&#49353;</dt>
<dd>
<p>&#51060; &#47553;&#53356;&#47484; &#45572;&#47476;&#47732; &#47196;&#44536; &#48624;&#50612;&#47484; &#52628;&#44032;&#51201;&#51004;&#47196; &#51312;&#51221;&#54624; &#49688; &#51080;&#45716; &#50689;&#50669;&#51060; &#50676;&#47549;&#45768;&#45796;.</p>
</dd>
<dt>&#49884;&#44036; &#44592;&#47197;</dt>
<dd>
<p>[&#44032;&#51109; &#52572;&#44540;] &#46972;&#46356;&#50724; &#45800;&#52628;&#47484; &#45572;&#47476;&#47732; &#44032;&#51109; &#52572;&#44540; &#47700;&#49884;&#51648;&#44032; &#54364;&#49884;&#46121;&#45768;&#45796;. [&#53945;&#51221; &#48276;&#50948;] &#46972;&#46356;&#50724; &#45800;&#52628;&#47484; &#45572;&#47476;&#47732; &#53945;&#51221; &#44592;&#44036;&#51032; &#47700;&#49884;&#51648;&#47564; &#48380; &#49688; &#51080;&#45716; &#49884;&#51089; &#48143; &#45149; &#54596;&#46300;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
<p>&#49884;&#44036; &#44050;&#51032; &#44221;&#50864; &#44396;&#47928;&#51008; &#45796;&#51020; &#54805;&#49885;&#51012; &#46384;&#46972;&#50556; &#54633;&#45768;&#45796;. &#50668;&#44592;&#49436; <i>SSS</i>&#45716; &#48128;&#47532;&#52488;&#47484; &#45208;&#53440;&#45253;&#45768;&#45796;.</p>
<pre>
<i>hh</i>:<i>mm</i>:<i>ss</i>.<i>SSS</i>
</pre>
<p>&#50696;&#47484; &#46308;&#47732; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<pre>
17:10:00.000
</pre>
<p>&#49884;&#51089; &#44050;&#51060; &#45149; &#44050;&#48372;&#45796; &#51060;&#54980;&#51068; &#44221;&#50864; &#50724;&#47448; &#47700;&#49884;&#51648;&#44032; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#47196;&#44536; &#47112;&#48296;</dt>
<dd>
<p>&#54596;&#53552;&#47553;&#50640; &#45824;&#54644; &#49440;&#53469;&#54620; &#47196;&#44536; &#47112;&#48296;&#51077;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; &#49440;&#53469;&#54620; &#47196;&#44536; &#47112;&#48296;&#44284; &#45908; &#49900;&#44033;&#54620; &#47112;&#48296;&#50640;&#49436; &#49436;&#48260; &#47196;&#44536;&#50640; &#54364;&#49884;&#46104;&#45716; &#47784;&#46304; &#47700;&#49884;&#51648;&#44032; &#54364;&#49884;&#46121;&#45768;&#45796;. &#47112;&#48296;&#51032; &#47700;&#49884;&#51648;&#47564; &#54364;&#49884;&#54616;&#47140;&#47732; "&#45908; &#49900;&#44033;&#54620; &#47700;&#49884;&#51648;&#45716; &#54252;&#54632; &#50504;&#54632;" &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#54869;&#51064;&#54624; &#47700;&#49884;&#51648;&#47484; &#49436;&#48260; &#47196;&#44536;&#50640; &#54364;&#49884;&#54616;&#47140;&#47732; &#47676;&#51200; &#47784;&#46280; &#47196;&#44536; &#47112;&#48296; &#54168;&#51060;&#51648;&#50640;&#49436; &#51201;&#51208;&#54620; &#47196;&#44536; &#47112;&#48296;&#51012; &#49444;&#51221;&#54633;&#45768;&#45796;. <a href="task-eelogginglevels.html">&#47196;&#44536; &#47112;&#48296;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
<p>&#47196;&#44536; &#47112;&#48296;&#51012; &#44592;&#51456;&#51004;&#47196; &#47196;&#44536; &#47700;&#49884;&#51648;&#47484; &#54596;&#53552;&#47553;&#54616;&#46020;&#47197; &#49440;&#53469;&#54620; &#44221;&#50864; &#51648;&#51221;&#54620; &#54596;&#53552; &#44592;&#51456;&#50640; &#47582;&#45716; &#47700;&#49884;&#51648;&#47564; &#54364;&#49884;&#46121;&#45768;&#45796;. &#44536;&#47084;&#45208; &#51060; &#54596;&#53552;&#47553;&#51008; &#49436;&#48260; &#47196;&#44536;&#50640; &#50612;&#46500; &#47700;&#49884;&#51648;&#47484; &#44592;&#47197;&#54624;&#51648;&#50640;&#45716; &#50689;&#54693;&#51012; &#51452;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
</dl>
<p>[&#44256;&#44553; &#44160;&#49353;] &#50689;&#50669;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#47196;&#44144;</dt>
<dd>
<p>&#47784;&#46280;&#48324;&#47196; &#54596;&#53552;&#47553;&#54624; &#47196;&#44144; &#45348;&#51076;&#49828;&#54168;&#51060;&#49828;&#51077;&#45768;&#45796;. Shift &#53412;&#45208; Ctrl &#53412;&#47484; &#49324;&#50857;&#54616;&#47732; &#45348;&#51076;&#49828;&#54168;&#51060;&#49828;&#47484; &#50668;&#47084; &#44060; &#49440;&#53469;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#45908; &#45458;&#51008; &#47112;&#48296;&#51032; &#45348;&#51076;&#49828;&#54168;&#51060;&#49828;&#47484; &#49440;&#53469;&#54616;&#47732; &#44536; &#50500;&#47000;&#50640; &#51080;&#45716; &#47784;&#46304; &#45348;&#51076;&#49828;&#54168;&#51060;&#49828;&#44032; &#49440;&#53469;&#46121;&#45768;&#45796;. &#50696;&#47484; &#46308;&#50612;, <code>javax.enterprise.system</code>&#51012; &#49440;&#53469;&#54616;&#47732; &#54644;&#45817; &#45348;&#51076;&#49828;&#54168;&#51060;&#49828; &#50500;&#47000;&#51032; &#47784;&#46304; &#47784;&#46280;(<code>javax.enterprise.system.core</code>, <code>javax.enterprise.system.tools.admin</code> &#46321;)&#50640; &#45824;&#54620; &#47196;&#44144;&#46020; &#49440;&#53469;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#49324;&#50857;&#51088; &#51221;&#51032; &#47196;&#44144;</dt>
<dd>
<p>&#54620; &#51460;&#45817; &#54616;&#45208;&#50473;&#51032; &#53945;&#51221; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#45824;&#54620; &#47196;&#44144;&#51077;&#45768;&#45796;.</p>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#50668;&#47084; &#47784;&#46280;&#51060; &#51080;&#51012; &#44221;&#50864; &#44536; &#51473; &#51068;&#48512; &#46608;&#45716; &#47784;&#46160;&#47484; &#54869;&#51064;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#50696;&#47484; &#46308;&#50612; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#45796;&#51020;&#44284; &#44057;&#51008; &#51060;&#47492;&#51032; &#47196;&#44144;&#44032; &#51080;&#45796;&#44256; &#44032;&#51221;&#54633;&#45768;&#45796;.</p>
<pre>
com.mycompany.myapp.module1
com.mycompany.myapp.module2
com.mycompany.myapp.module3
</pre>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#51080;&#45716; &#47784;&#46304; &#47784;&#46280;&#51032; &#47700;&#49884;&#51648;&#47484; &#54869;&#51064;&#54616;&#47140;&#47732; <code>com.mycompany.myapp</code>&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;. <code>module2</code>&#51032; &#47700;&#49884;&#51648;&#47564; &#54869;&#51064;&#54616;&#47140;&#47732; <code>com.mycompany.myapp.module2</code>&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#49324;&#50857;&#51088; &#51221;&#51032; &#47196;&#44144;&#47484; &#54616;&#45208; &#51060;&#49345; &#51648;&#51221;&#54620; &#44221;&#50864; &#54644;&#45817; &#47196;&#44144;&#47484; &#47196;&#44144; &#50689;&#50669;&#50640; &#47749;&#49884;&#51201;&#51004;&#47196; &#51648;&#51221;&#54644;&#50556;&#47564; GlassFish Server &#47784;&#46280;&#51032; &#47700;&#49884;&#51648;&#44032; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#54364;&#49884;</dt>
<dd>
<p>&#54620; &#48264;&#50640; &#48380; &#47700;&#49884;&#51648; &#49688;&#51077;&#45768;&#45796;. &#54364;&#49884;&#46104;&#45716; &#44592;&#48376; &#47700;&#49884;&#51648; &#49688;&#45716; 40&#51077;&#45768;&#45796;. &#44592;&#53440; &#49440;&#53469; &#54637;&#47785;&#51008; 100, 250 &#48143; 1000&#51077;&#45768;&#45796;.</p>
<p>&#49828;&#53469; &#52628;&#51201;&#51012; &#48372;&#47140;&#47732; "&#44284;&#46020;&#54616;&#44172; &#44596; &#47700;&#49884;&#51648; &#51228;&#54620;" &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469; &#54644;&#51228;&#54633;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; &#49828;&#53469; &#52628;&#51201;&#51008; &#48624;&#50612;&#50640; &#54364;&#49884;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;. &#49828;&#53469; &#52628;&#51201;&#51012; &#48372;&#47140;&#47732; &#47700;&#49884;&#51648;&#51032; <code>(&#49464;&#48512; &#49324;&#54637;)</code> &#47553;&#53356;&#47484; &#45572;&#47493;&#45768;&#45796;.</p>
</dd>
</dl>
<p>&#44160;&#49353; &#49688;&#51221; &#50689;&#50669;&#50640;&#49436; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#45208; &#53364;&#47084;&#49828;&#53552; &#48143; &#48372;&#47140;&#45716; &#50672;&#44288;&#46108; &#47196;&#44536; &#54028;&#51068;&#51032; &#51060;&#47492;&#51012; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#51064;&#49828;&#53556;&#49828;</dt>
<dd>
<p>&#47196;&#44536; &#47112;&#53076;&#46300;&#47484; &#54364;&#49884;&#54624; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#45208; &#53364;&#47084;&#49828;&#53552;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; &#49436;&#48260;&#51077;&#45768;&#45796;. &#45796;&#47480; &#49440;&#53469; &#54637;&#47785;&#51008; &#46020;&#47700;&#51064;&#50640; &#45824;&#54644; &#51221;&#51032;&#54616;&#44256; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54624; &#49688; &#51080;&#45716; &#53364;&#47084;&#49828;&#53552;&#50752; &#51064;&#49828;&#53556;&#49828;&#50640; &#46384;&#46972; &#45796;&#47493;&#45768;&#45796;.</p>
</dd>
<dt>&#47196;&#44536; &#54028;&#51068;</dt>
<dd>
<p>&#54364;&#49884;&#54624; &#47196;&#44536; &#54028;&#51068;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>server.log</code>&#51077;&#45768;&#45796;. &#45796;&#47480; &#49440;&#53469; &#54637;&#47785;&#51008; &#49440;&#53469;&#54620; &#45824;&#49345;&#51032; &#47196;&#44536; &#49444;&#51221;&#50640; &#46384;&#46972; &#45796;&#47493;&#45768;&#45796;.</p>
</dd>
</dl>
<p>[&#47196;&#44536; &#48624;&#50612; &#44208;&#44284;] &#53580;&#51060;&#48660;&#50640;&#45716; &#49436;&#48260; &#47196;&#44536; &#47700;&#49884;&#51648;&#44032; &#54364;&#49884;&#46121;&#45768;&#45796;. &#53580;&#51060;&#48660; &#47592; &#50948;&#50640; &#51080;&#45716; [&#51060;&#51204; &#47112;&#53076;&#46300;] &#48143; [&#51060;&#54980; &#47112;&#53076;&#46300;] &#45800;&#52628;&#47484; &#49324;&#50857;&#54616;&#50668; &#48372;&#47140;&#45716; &#47112;&#53076;&#46300; &#48276;&#50948;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#44033; &#47700;&#49884;&#51648;&#51032; [&#47196;&#44536; &#48624;&#50612; &#44208;&#44284;] &#53580;&#51060;&#48660;&#50640;&#45716; &#45796;&#51020; &#51221;&#48372;&#44032; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#47112;&#53076;&#46300; &#48264;&#54840;</dt>
<dd>
<p>&#49436;&#48260; &#47196;&#44536;&#50640;&#49436; &#47700;&#49884;&#51648;&#51032; &#48264;&#54840;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#47196;&#44536; &#47112;&#48296;</dt>
<dd>
<p>&#47700;&#49884;&#51648;&#51032; &#47196;&#44536; &#47112;&#48296;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#47700;&#49884;&#51648;</dt>
<dd>
<p>&#47196;&#44536; &#47700;&#49884;&#51648;&#51032; &#44036;&#47029;&#54620; &#53581;&#49828;&#53944;&#51077;&#45768;&#45796;. <code>(&#49464;&#48512; &#49324;&#54637;)</code> &#47553;&#53356;&#47484; &#45572;&#47476;&#47732; &#49436;&#49885;&#51060; &#51648;&#51221;&#46108; &#48260;&#51204;&#51032; &#47700;&#49884;&#51648;&#47484; &#48380; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#47196;&#44144;</dt>
<dd>
<p>&#47196;&#44536; &#47700;&#49884;&#51648;&#47484; &#49373;&#49457;&#54620; &#47196;&#44144; &#47784;&#46280;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49884;&#44036; &#44592;&#47197;</dt>
<dd>
<p>&#47196;&#44536; &#47700;&#49884;&#51648;&#44032; &#48156;&#54665;&#46108; &#45216;&#51676;&#50752; &#49884;&#44036;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51060;&#47492;/&#44050; &#49933;</dt>
<dd>
<p>&#47196;&#44536; &#47700;&#49884;&#51648;&#51032; &#49828;&#47112;&#46300; &#51060;&#47492; &#48143; ID&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref240" name="sthref240"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-eelogging.html">&#51068;&#48152; &#47196;&#44613; &#49444;&#51221;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-eelogginglevels.html">&#47196;&#44536; &#47112;&#48296;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-logviewer.html">DAS&#50640; &#45824;&#54620; &#47196;&#44536; &#54028;&#51068;&#51012; &#48372;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref241" name="sthref241"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<ul>
<li>
<p><code>set-log-level</code></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00224"><code>rotate-log</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
