<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-monitoringservice" name="ref-monitoringservice"></a></p>

<h4><a id="sthref242" name="sthref242"></a>&#47784;&#45768;&#53552;&#47553; &#49436;&#48708;&#49828;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#47784;&#45768;&#53552;&#47553; &#49436;&#48708;&#49828;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#44060;&#48324; &#49436;&#48260; &#44396;&#49457; &#50836;&#49548; &#46608;&#45716; &#49436;&#48708;&#49828;&#51032; &#47784;&#45768;&#53552;&#47553; &#50741;&#49496;&#51012; &#44396;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;, &#44396;&#49457; &#50836;&#49548; &#46608;&#45716; &#49436;&#48708;&#49828;&#50640; &#45824;&#54620; &#47784;&#45768;&#53552;&#47553;&#51012; &#44396;&#49457;&#54616;&#47140;&#47732; &#47676;&#51200; &#48176;&#52824;&#54644;&#50556; &#54633;&#45768;&#45796;.</p>
<p>[&#47784;&#45768;&#53552;&#47553; &#49436;&#48708;&#49828;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44396;&#49457; &#51060;&#47492;</dt>
<dd>
<p>&#51060; &#54168;&#51060;&#51648;&#51032; &#49444;&#51221;&#51060; &#51201;&#50857;&#46104;&#45716; &#44396;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#47784;&#45768;&#53552;&#47553; &#49436;&#48708;&#49828;</dt>
<dd>
<p>[&#47784;&#45768;&#53552;&#47553; &#49436;&#48708;&#49828; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#44032; &#49440;&#53469;&#46104;&#50612; &#51080;&#51004;&#47732; GlassFish Server&#50640; &#45824;&#54620; &#47784;&#45768;&#53552;&#47553;&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>MBean &#47784;&#45768;&#53552;&#47553;</dt>
<dd>
<p>[MBean &#47784;&#45768;&#53552;&#47553; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#44032; &#49440;&#53469;&#46104;&#50612; &#51080;&#51004;&#47732; &#47784;&#45768;&#53552;&#47553;&#50640; &#54596;&#50836;&#54620; &#47784;&#46304; MBean&#51060; GlassFish Server&#50640; &#48176;&#52824;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#51060; &#52404;&#53356; &#48149;&#49828;&#44032; &#49440;&#53469;&#46104;&#50612; &#51080;&#51648; &#50506;&#51004;&#47732; [&#47784;&#45768;&#53552;&#47553; &#49436;&#48708;&#49828;] &#52404;&#53356; &#48149;&#49828;&#44032; &#49440;&#53469;&#46104;&#50612; &#51080;&#50612;&#46020; &#44288;&#47532; &#53080;&#49556;&#50640;&#49436; &#47784;&#45768;&#53552;&#47553; &#45936;&#51060;&#53552;&#47484; &#48380; &#49688; &#50630;&#49845;&#45768;&#45796;. &#47784;&#45768;&#53552;&#47553; &#45936;&#51060;&#53552;&#47484; &#48372;&#47140;&#47732; &#47749;&#47161;&#54665;&#51012; &#49324;&#50857;&#54644;&#50556; &#54633;&#45768;&#45796;. &#52404;&#53356; &#48149;&#49828; &#49440;&#53469;&#51012; &#54644;&#51228;&#54616;&#47732; GlassFish Server&#51032; &#47700;&#47784;&#47532; &#48276;&#50948;&#44032; &#51460;&#50612;&#46317;&#45768;&#45796;.</p>
</dd>
<dt>DTrace</dt>
<dd>
<p>DTrace &#49324;&#50857; &#52404;&#53356; &#48149;&#49828;&#44032; &#49440;&#53469;&#46104;&#50612; &#51080;&#44256; Oracle Enterprise Manager DTrace Monitoring&#51060; &#51080;&#45716; &#44221;&#50864; Solaris DTrace &#44592;&#45733;&#51012; &#49324;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
</dl>
<p>&#49324;&#50857; &#44032;&#45733;&#54620; &#44033; &#44396;&#49457; &#50836;&#49548;&#50640; &#45824;&#54644; &#51228;&#44277;&#46104;&#45716; &#51221;&#48372;&#45716; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44396;&#49457; &#50836;&#49548;</dt>
<dd>
<p>GlassFish Server &#44396;&#49457; &#50836;&#49548;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#47784;&#45768;&#53552;&#47553; &#47112;&#48296;</dt>
<dd>
<p>&#44396;&#49457; &#50836;&#49548;&#50640; &#45824;&#54644; &#49444;&#51221;&#46108; &#47784;&#45768;&#53552;&#47553;&#51032; &#47112;&#48296;&#51077;&#45768;&#45796;. &#44033; &#44396;&#49457; &#50836;&#49548;&#50640; &#45824;&#54644; &#49324;&#50857; &#44032;&#45733;&#54620; &#47112;&#48296;&#51008; LOW, HIGH &#48143; OFF&#51077;&#45768;&#45796;. &#44592;&#48376; &#47112;&#48296;&#51008; &#54644;&#51228;&#51077;&#45768;&#45796;. &#51060; &#47540;&#47532;&#49828;&#50640;&#49436;&#45716; LOW &#48143; HIGH &#50741;&#49496;&#50640;&#49436; &#51228;&#44277;&#46104;&#45716; &#47784;&#45768;&#53552;&#47553; &#47112;&#48296; &#44036;&#50640; &#52264;&#51060;&#44032; &#50630;&#49845;&#45768;&#45796;.</p>
</dd>
</dl>
<p>&#44396;&#49457; &#50836;&#49548; &#47112;&#48296; &#49444;&#51221; &#53580;&#51060;&#48660;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#46020; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#47112;&#48296; &#48320;&#44221;</dt>
<dd>
<p>&#49440;&#53469;&#54620; &#54616;&#45208; &#51060;&#49345;&#51032; &#44396;&#49457; &#50836;&#49548;&#50640; &#45824;&#54644; &#47784;&#45768;&#53552;&#47553; &#47112;&#48296;&#51012; &#48320;&#44221;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#47112;&#48296;</dt>
<dd>
<p>&#47784;&#46304; &#49440;&#53469;&#46108; &#44396;&#49457; &#50836;&#49548;&#50640; &#51201;&#50857;&#46104;&#45716; &#47784;&#45768;&#53552;&#47553; &#47112;&#48296;&#51012; &#49440;&#53469;&#54624; &#49688; &#51080;&#45716; &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="GHCOM475" name="GHCOM475"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-confmonitor.html">&#47784;&#45768;&#53552;&#47553; &#49436;&#48708;&#49828;&#47484; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-appmonitoringdata.html">&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#47784;&#45768;&#53552;&#47553; &#45936;&#51060;&#53552;&#47484; &#48372;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-servermonitoringdata.html">&#49436;&#48260; &#47784;&#45768;&#53552;&#47553; &#45936;&#51060;&#53552;&#47484; &#48372;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-resourcemonitoringdata.html">&#47532;&#49548;&#49828; &#47784;&#45768;&#53552;&#47553; &#45936;&#51060;&#53552;&#47484; &#48372;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="GHCOM476" name="GHCOM476"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00128"><code>enable-monitoring</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00120"><code>disable-monitoring</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00212"><code>monitor</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
