<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-domainattributestab" name="ref-domainattributestab"></a></p>

<h4><a id="sthref212" name="sthref212"></a>&#46020;&#47700;&#51064; &#49549;&#49457;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#46020;&#47700;&#51064; &#49549;&#49457;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; GlassFish Server&#50640; &#45824;&#54620; &#44256;&#44553; &#46020;&#47700;&#51064; &#49549;&#49457;&#51012; &#49444;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>[&#46020;&#47700;&#51064; &#49549;&#49457;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>DAS &#49884;&#51089; &#54980; &#53080;&#49556; &#47196;&#46300;</dt>
<dd>
<p>&#45796;&#51020; &#51473;&#50640;&#49436; &#44288;&#47532; &#53080;&#49556; &#47196;&#46300; &#49884;&#44592;&#47484; &#44208;&#51221;&#54633;&#45768;&#45796;.</p>
<dl>
<dt>&#49324;&#50857;&#47049; &#44592;&#48152;</dt>
<dd>
<p>&#53080;&#49556;&#51060; &#51648;&#45212; 24&#49884;&#44036; &#45236;&#50640; &#49324;&#50857;&#46104;&#50632;&#44144;&#45208; &#45796;&#47480; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#44032; DAS(&#46020;&#47700;&#51064; &#44288;&#47532; &#49436;&#48260;)&#50752; &#48324;&#44060;&#47196; &#51316;&#51116;&#54616;&#45716; &#44221;&#50864; DAS &#49884;&#51089; &#54980; &#44288;&#47532; &#53080;&#49556;&#51060; &#47196;&#46300;&#46121;&#45768;&#45796;. &#51060; &#44050;&#51008; &#44592;&#48376;&#44050;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#54637;&#49345;</dt>
<dd>
<p>DAS &#49884;&#51089; &#54980; &#44288;&#47532; &#53080;&#49556;&#51060; &#54637;&#49345; &#47196;&#46300;&#46121;&#45768;&#45796;. &#53080;&#49556;&#51008; &#44592;&#48376; GlassFish Server &#49884;&#51089; &#49884;&#53248;&#49828;&#44032; &#50756;&#47308;&#46108; &#54980;&#50640; &#47196;&#46300;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#49324;&#50857; &#50504;&#54632;</dt>
<dd>
<p>DAS &#49884;&#51089; &#54980; &#44288;&#47532; &#53080;&#49556;&#51060; &#47196;&#46300;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;. &#53080;&#49556;&#51008; &#50529;&#49464;&#49828;&#44032; &#50836;&#52397;&#46112; &#46412; &#47196;&#46300;&#46121;&#45768;&#45796;.</p>
</dd>
</dl>
</dd>
<dt>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#47336;&#53944;</dt>
<dd>
<p>&#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#51080;&#45716; &#46356;&#47113;&#53664;&#47532;&#51032; &#51204;&#52404; &#44221;&#47196;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; domain-dir<code>/applications</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#47196;&#44536; &#47336;&#53944;</dt>
<dd>
<p>&#49436;&#48260; &#47196;&#44536; &#54028;&#51068;&#51012; &#51200;&#51109;&#54616;&#45716; &#50948;&#52824;&#47484; &#49885;&#48324;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; domain-dir<code>/logs</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#47196;&#52992;&#51068;</dt>
<dd>
<p>&#51060; &#54596;&#46300;&#47484; &#48708;&#50892; &#46160;&#47732; &#54840;&#49828;&#53944;&#51032; &#44592;&#48376; &#47196;&#52992;&#51068;&#51060; &#49324;&#50857;&#46121;&#45768;&#45796;.</p>
<p>&#47196;&#52992;&#51068;&#51008; &#50616;&#50612; &#48143; &#51648;&#50669;&#51032; &#53945;&#51221; &#51312;&#54633;&#51012; &#51648;&#51221;&#54616;&#45716; &#49885;&#48324;&#51088;&#51077;&#45768;&#45796;. &#50696;&#47484; &#46308;&#50612; &#48120;&#44397; &#50689;&#50612;&#51032; &#47196;&#52992;&#51068;&#51008; <code>en_US</code>&#51060;&#44256; &#51068;&#48376;&#50612;&#51032; &#47196;&#52992;&#51068;&#51008; <code>ja_JP</code>&#51077;&#45768;&#45796;. &#50689;&#50612;&#44032; &#50500;&#45772; &#45796;&#47480; &#47196;&#52992;&#51068;&#51012; &#49324;&#50857;&#54616;&#47140;&#47732; GlassFish Server&#47484; &#54788;&#51648;&#54868;(&#50689;&#50612;&#47484; &#45796;&#47480; &#50616;&#50612;&#47196; &#48264;&#50669;&#54616;&#45716; &#51089;&#50629;&#51060; &#54252;&#54632;&#46108; &#54532;&#47196;&#49464;&#49828;)&#54644;&#50556; &#54633;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref213" name="sthref213"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-setadvanceappconfig.html">&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#44396;&#49457;&#51012; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-setadvancedomainattributes.html">&#46020;&#47700;&#51064; &#49549;&#49457;&#51012; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
