<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-deployentapp" name="task-deployentapp"></a><a id="GHCOM00157" name="GHCOM00157"></a></p>

<h4><a id="sthref55" name="sthref55"></a><a id="sthref56" name="sthref56"></a><a id="sthref57" name="sthref57"></a>&#50644;&#53552;&#54532;&#46972;&#51060;&#51592; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#48176;&#52824;&#54616;&#45716; &#48169;&#48277;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#53456;&#49353; &#53944;&#47532;&#50640;&#49436; [&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;] &#45432;&#46300;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>[&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;] &#53580;&#51060;&#48660;&#50640;&#49436; [&#48176;&#52824;] &#45800;&#52628;&#47484; &#45572;&#47493;&#45768;&#45796;.</p>
<p>[&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#46608;&#45716; &#47784;&#46280; &#48176;&#52824;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>&#48176;&#52824;&#54624; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51032; &#50948;&#52824;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#53364;&#46972;&#51060;&#50616;&#53944; &#49884;&#49828;&#53596;&#50640; &#51080;&#44144;&#45208; &#53364;&#46972;&#51060;&#50616;&#53944; &#49884;&#49828;&#53596;&#50640;&#49436; &#50529;&#49464;&#49828; &#44032;&#45733;&#54620; &#50500;&#52852;&#51060;&#48652; &#54028;&#51068;&#51064; &#44221;&#50864; [&#49436;&#48260;&#50640; &#50629;&#47196;&#46300;&#54624; &#54056;&#53412;&#51648;&#54868;&#46108; &#54028;&#51068;] &#50741;&#49496;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#53364;&#46972;&#51060;&#50616;&#53944; &#49884;&#49828;&#53596;&#51008; &#48652;&#46972;&#50864;&#51200;&#47484; &#53685;&#54644; &#44288;&#47532; &#53080;&#49556;&#51012; &#48372;&#45716; &#54840;&#49828;&#53944;&#51077;&#45768;&#45796;.</p>
<p>[&#52286;&#50500;&#48372;&#44592;]&#47484; &#45580;&#47084; &#54028;&#51068;&#51012; &#52286;&#44144;&#45208;, &#54028;&#51068;&#51032; &#51204;&#52404; &#44221;&#47196;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#49436;&#48260; &#49884;&#49828;&#53596;&#50640; &#51080;&#45716; &#50500;&#52852;&#51060;&#48652; &#54028;&#51068;&#51060;&#44144;&#45208; &#54869;&#51109;&#46108; &#46356;&#47113;&#53664;&#47532;&#50640;&#49436; &#50517;&#52629; &#54644;&#51228;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51064; &#44221;&#50864;, [GlassFish Server&#50640;&#49436; &#50529;&#49464;&#49828;&#54624; &#49688; &#51080;&#45716; &#54056;&#53412;&#51648;&#54868;&#46108; &#47196;&#52972; &#54028;&#51068; &#46608;&#45716; &#46356;&#47113;&#53664;&#47532;] &#50741;&#49496;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#49436;&#48260; &#49884;&#49828;&#53596;&#51008; &#46020;&#47700;&#51064; &#44288;&#47532; &#49436;&#48260;(Domain Administration, DAS)&#47484; &#49892;&#54665;&#54616;&#45716; &#54840;&#49828;&#53944;&#51077;&#45768;&#45796;.</p>
<p>[&#54028;&#51068; &#52286;&#50500;&#48372;&#44592;]&#47484; &#45580;&#47084; &#54028;&#51068;&#51012; &#52286;&#50500;&#48372;&#44144;&#45208; [&#54260;&#45908; &#52286;&#50500;&#48372;&#44592;]&#47484; &#45580;&#47084; &#46356;&#47113;&#53664;&#47532;&#47484; &#52286;&#50500;&#48389;&#45768;&#45796;. &#46608;&#45716; &#54028;&#51068; &#46608;&#45716; &#46356;&#47113;&#53664;&#47532;&#51032; &#51204;&#52404; &#44221;&#47196; &#51060;&#47492;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;. &#54869;&#51109;&#46108; &#46356;&#47113;&#53664;&#47532;&#50640;&#49436; &#48176;&#52824;&#54616;&#45716; &#44163;&#51008; &#44256;&#44553; &#44060;&#48156;&#51088; &#51089;&#50629;&#51060;&#48064;&#47196; &#50868;&#50857; &#54872;&#44221;&#50640;&#45716; &#44428;&#51109;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</li>
</ul>
</li>
<li>
<p>[&#50976;&#54805;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; [&#50644;&#53552;&#54532;&#46972;&#51060;&#51592; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;]&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>[&#49436;&#48260;&#50640; &#50629;&#47196;&#46300;&#54624; &#54056;&#53412;&#51648;&#54868;&#46108; &#54028;&#51068;] &#46608;&#45716; [GlassFish Server&#50640;&#49436; &#50529;&#49464;&#49828;&#54624; &#49688; &#51080;&#45716; &#47196;&#52972; &#54056;&#53412;&#51648;&#54868;&#46108; &#54028;&#51068;]&#51012; &#51648;&#51221;&#54620; &#44221;&#50864;&#50640;&#45716; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#50976;&#54805;&#51060; &#51088;&#46041;&#51004;&#47196; &#44048;&#51648;&#46121;&#45768;&#45796;. GlassFish Server&#50640;&#49436; &#50529;&#49464;&#49828;&#54624; &#49688; &#51080;&#45716; &#46356;&#47113;&#53664;&#47532;&#47484; &#51648;&#51221;&#54620; &#44221;&#50864;&#50640;&#45716; &#50976;&#54805;&#51012; &#49688;&#46041;&#51004;&#47196; &#51648;&#51221;&#54644;&#50556; &#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#51060;&#47492;] &#54596;&#46300;&#50640; &#46356;&#47113;&#53664;&#47532; &#51060;&#47492; &#46608;&#45716; &#54028;&#51068; &#51060;&#47492;&#51032; &#51217;&#46160;&#50612;&#51064; &#44592;&#48376; &#51060;&#47492;&#51012; &#50976;&#51648;&#54616;&#44144;&#45208; &#45796;&#47480; &#51060;&#47492;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#54028;&#51068; &#50629;&#47196;&#46300;&#47484; &#49440;&#53469;&#54620; &#44221;&#50864;&#50640;&#45716; &#44592;&#48376; &#51060;&#47492;&#51060; &#45208;&#53440;&#45225;&#45768;&#45796;. &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#51060;&#47492;&#51008; &#44256;&#50976;&#54644;&#50556; &#54633;&#45768;&#45796;.</p>
<p>&#51060;&#47492;&#50640;&#45716; &#48260;&#51204; &#49885;&#48324;&#51088;(&#50741;&#49496;)&#44032; &#54252;&#54632;&#46112; &#49688; &#51080;&#51004;&#47728;, &#51060; &#49885;&#48324;&#51088;&#45716; &#51060;&#47492; &#45796;&#51020;&#50640; &#50724;&#44256; &#53084;&#47200;(<code>:</code>)&#51004;&#47196; &#51060;&#47492;&#44284; &#44396;&#48516;&#46121;&#45768;&#45796;. &#48260;&#51204; &#49885;&#48324;&#51088;&#45716; &#47928;&#51088; &#46608;&#45716; &#49707;&#51088;&#47196; &#49884;&#51089;&#54644;&#50556; &#54633;&#45768;&#45796;. &#50689;&#49707;&#51088; &#47928;&#51088;&#50752; &#48145;&#51460;(<code>_</code>), &#45824;&#49884;(<code>-</code>) &#48143; &#47560;&#52840;&#54364;(<code>.</code>) &#47928;&#51088;&#44032; &#49324;&#50857;&#46112; &#49688; &#51080;&#49845;&#45768;&#45796;. &#47784;&#46280; &#48143; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#48260;&#51204;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Oracle GlassFish Server Application Deployment Guide</i>&#51032; <i>Module and Application Versions</i></a>&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</li>
<li>
<p>[&#44032;&#49345; &#49436;&#48260;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#51060; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#44284; &#50672;&#44288;&#46112; &#44032;&#49345; &#49436;&#48260;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#44032;&#49345; &#49436;&#48260; &#50741;&#49496;&#51008; &#44592;&#48376; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;(<code>server</code>)&#47564; &#51080;&#45716; &#44221;&#50864;&#50640; &#54364;&#49884;&#46121;&#45768;&#45796;. &#53364;&#47084;&#49828;&#53552; &#46608;&#45716; &#45796;&#47480; &#46021;&#47549;&#54805; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#44032; &#51080;&#45716; &#44221;&#50864;&#50640;&#45716; &#48176;&#52824; &#54980;&#50640; &#44032;&#49345; &#49436;&#48260;&#47484; &#49440;&#53469;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. [&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#54200;&#51665;] &#54168;&#51060;&#51648;&#47196; &#51060;&#46041;&#54616;&#44256; [&#45824;&#49345;] &#53485;&#51012; &#49440;&#53469;&#54620; &#45796;&#51020; &#50896;&#54616;&#45716; &#45824;&#49345;&#50640; &#45824;&#54644; [&#44032;&#49345; &#49436;&#48260; &#44288;&#47532;]&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47140;&#47732; [&#49345;&#53468; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49440;&#53469;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51060; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#49324;&#50857;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#45824;&#54620; &#49464;&#49496; &#51648;&#49549;&#49457; &#48143; SFSB &#52404;&#53356;&#54252;&#51064;&#53944; &#51648;&#51221;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47140;&#47732; [&#44032;&#50857;&#49457; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>[&#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54620; &#44221;&#50864; &#44256;&#44032;&#50857;&#49457;&#51060; &#50937; &#49464;&#49496; &#48143; SFSB(&#49345;&#53468; &#50976;&#51648; &#49464;&#49496; Bean) &#52404;&#53356;&#54252;&#51064;&#53944; &#51648;&#51221;&#44284; &#51104;&#51116;&#51201;&#51064; &#48708;&#54876;&#49457;&#54868;&#50640; &#45824;&#54644; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;. false(&#44592;&#48376;&#44050;)&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#51648;&#51221;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#45824;&#54620; &#47784;&#46304; &#50937; &#49464;&#49496; &#51200;&#51109; &#48143; SFSB &#52404;&#53356;&#54252;&#51064;&#53944; &#51648;&#51221;&#51060; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;. true&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#51648;&#51221;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#44256;&#44032;&#50857;&#49457;&#50640; &#45824;&#54644; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;. &#49436;&#48260; &#48143; &#52968;&#53580;&#51060;&#45320; &#47112;&#48296;&#44284; &#44057;&#51008; &#48372;&#45796; &#45458;&#51008; &#47112;&#48296;&#50640;&#49436; &#44256;&#44032;&#50857;&#49457;&#51060; &#44396;&#49457;&#46104;&#44256; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864;&#50640;&#47564; &#51060; &#50741;&#49496;&#51012; true&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51008; &#44592;&#48376; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;(<code>server</code>) &#50808;&#50640; &#53364;&#47084;&#49828;&#53552;&#45208; &#46021;&#47549;&#54805; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#44032; &#51080;&#45716; &#44221;&#50864;&#50640; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#53364;&#46972;&#51060;&#50616;&#53944;&#50640; &#45824;&#54620; Java Web Start &#50529;&#49464;&#49828;&#47484; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47140;&#47732; [Java Web Start] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>JSP(JavaServer Pages) &#54028;&#51068;&#51012; &#49324;&#51204; &#52980;&#54028;&#51068;&#54616;&#47140;&#47732; [JSP &#49324;&#51204; &#52980;&#54028;&#51068;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51012; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; JSP &#54028;&#51068;&#51008; &#52376;&#51020; &#50529;&#49464;&#49828;&#46112; &#46412; &#47088;&#53440;&#51076; &#49884; &#52980;&#54028;&#51068;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>&#48176;&#52824; &#51204;&#50640; &#48176;&#52824; &#44592;&#49696;&#51088;&#47484; &#54869;&#51064;&#54616;&#47140;&#47732; [&#44160;&#51613;&#51088; &#49892;&#54665;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; &#44160;&#51613;&#50640; &#49892;&#54056;&#54616;&#45716; &#44221;&#50864; &#48176;&#52824;&#44032; &#49688;&#54665;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;. &#44160;&#51613;&#51088;&#45716; &#48176;&#52824; &#44592;&#49696;&#51088;&#51032; &#44396;&#51312;&#50752; &#45236;&#50857;&#51012; &#44160;&#49324;&#54633;&#45768;&#45796;. &#53360; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51032; &#44160;&#51613;&#50640;&#45716; &#47566;&#51008; &#49884;&#44036;&#51060; &#44152;&#47540; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#50629;&#45936;&#51060;&#53944; &#53812;&#50640;&#49436; &#44160;&#51613;&#51088; &#54056;&#53412;&#51648;&#47484; &#49444;&#52824;&#54644;&#50556; &#54633;&#45768;&#45796;. &#44536;&#47111;&#51648; &#50506;&#51004;&#47732; &#44221;&#44256;&#44032; &#44592;&#47197;&#46104;&#44256; &#51060; &#50741;&#49496;&#51060; &#47924;&#49884;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>4.0&#51012; &#54252;&#54632;&#54616;&#50668; GlassFish Server v3 &#47540;&#47532;&#49828;&#50640; &#44396;&#54788;&#46108; &#48372;&#45796; &#50628;&#44201;&#54620; Java EE 6 &#50836;&#44396; &#49324;&#54637; &#45824;&#49888; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; GlassFish Server v2 JAR &#54364;&#49884; &#50836;&#44396; &#49324;&#54637;&#51012; &#49324;&#50857;&#54616;&#47140;&#47732; [&#54840;&#54872;&#49457;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<p>JAR &#54028;&#51068;&#51012; EAR &#54028;&#51068; &#45236;&#51032; &#50668;&#47084; &#47784;&#46280;&#50640;&#49436; &#48380; &#49688; &#51080;&#45716; Java EE 6 &#54540;&#47019;&#54268; &#49324;&#50577; &#50836;&#44396; &#49324;&#54637;&#51008; Java EE 5&#48372;&#45796; &#55016;&#50476; &#50628;&#44201;&#54633;&#45768;&#45796;. &#53945;&#55176;, &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#53364;&#46972;&#51060;&#50616;&#53944;&#45716; &#52280;&#51312;&#44032; &#54364;&#51456; Java SE &#48169;&#49885;(&#50696;: &#54869;&#51109;&#51088;) &#46608;&#45716; Java EE &#46972;&#51060;&#48652;&#47084;&#47532;-&#46356;&#47113;&#53664;&#47532; &#48169;&#49885;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#51004;&#47732; EAR &#54028;&#51068; &#45236; EJB JAR &#54028;&#51068; &#46608;&#45716; &#45796;&#47480; JAR &#54028;&#51068;&#50640; &#50529;&#49464;&#49828;&#54624; &#49688; &#50630;&#50612;&#50556; &#54633;&#45768;&#45796;. &#51060; &#49345;&#51088;&#47484; &#49440;&#53469;&#54616;&#47732; &#51060;&#47084;&#54620; Java EE 6 &#51228;&#54620;&#51060; &#51228;&#44144;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#51060;&#48120; &#48176;&#52824;&#46108; &#44221;&#50864; &#44053;&#51228;&#47196; &#51116;&#48176;&#52824;&#54616;&#47140;&#47732; [&#51116;&#48176;&#52824; &#44053;&#51228; &#51201;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#51648; &#50506;&#51004;&#47732; &#51060;&#48120; &#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#45824;&#54620; &#48176;&#52824; &#49884;&#46020;&#50640;&#49436; &#50724;&#47448;&#44032; &#48156;&#49373;&#54633;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>&#50937; &#49464;&#49496;, SFSB &#51064;&#49828;&#53556;&#49828; &#48143; &#51116;&#48176;&#52824; &#44036;&#50640; &#50689;&#44396;&#51201;&#51004;&#47196; &#49373;&#49457;&#46108; EJB &#53440;&#51060;&#47672;&#47484; &#50976;&#51648;&#54616;&#47140;&#47732; [&#49345;&#53468; &#50976;&#51648;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; <code>server</code>&#46972;&#45716; &#44592;&#48376; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#50640;&#49436;&#47564; &#51648;&#50896;&#46121;&#45768;&#45796;. &#45796;&#47480; &#45824;&#49345;&#50640; &#45824;&#54644;&#49436;&#45716; &#51648;&#50896;&#46104;&#51648; &#50506;&#44256; &#47924;&#49884;&#46121;&#45768;&#45796;.</p>
<p>&#51116;&#48176;&#52824; &#44036;&#50640; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#51068;&#48512; &#48320;&#44221;&#54616;&#47732; &#51060; &#44592;&#45733;&#51060; &#51228;&#45824;&#47196; &#51089;&#46041;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;. &#50696;&#47484; &#46308;&#47732;, SFSB bean &#53364;&#47000;&#49828;&#50640;&#49436; &#51064;&#49828;&#53556;&#49828; &#48320;&#49688; &#51665;&#54633;&#51012; &#48320;&#44221;&#54616;&#51648; &#47560;&#49901;&#49884;&#50724;.</p>
<p>&#50937; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640;&#49436; &#51060; &#44592;&#45733;&#51008; <code>glassfish-web-app.xml</code> &#54028;&#51068;&#50640; &#51080;&#45716; <code>session-manager</code> &#50836;&#49548;&#51032; <code>persistence-type</code> &#49549;&#49457;&#51060; <code>file</code>&#51064; &#44221;&#50864;&#50640;&#47564; &#51201;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#49345;&#53468; &#50976;&#51648; &#49464;&#49496; Bean &#51064;&#49828;&#53556;&#49828;&#50640;&#49436; &#44256;&#44032;&#50857;&#49457;&#51060; &#50630;&#45716; &#51648;&#49549;&#49457; &#50976;&#54805;&#51060; &#49436;&#48260;&#50640;&#49436; &#49444;&#51221;&#46104;&#48064;&#47196;(SFSB &#51648;&#49549;&#49457; &#50976;&#54805; &#50741;&#49496;) &#44592;&#48376;&#44050;&#51060;&#51088; &#44428;&#51109;&#44050;&#51064; <code>file</code>&#47196; &#49444;&#51221;&#54644;&#50556; &#54633;&#45768;&#45796;.</p>
<p>&#54876;&#49457; &#50937; &#49464;&#49496;, SFSB &#51064;&#49828;&#53556;&#49828; &#46608;&#45716; EJB &#53440;&#51060;&#47672;&#47484; &#48372;&#51316; &#46608;&#45716; &#48373;&#50896;&#54616;&#51648; &#47803;&#54624; &#44221;&#50864; &#51116;&#48176;&#52824;&#44032; &#50756;&#47308;&#46112; &#46412; &#51060;&#46308;&#51012; &#47784;&#46160; &#49324;&#50857;&#54624; &#49688; <i>&#50630;&#49845;&#45768;&#45796;</i>. &#45800;, &#51116;&#48176;&#52824;&#45716; &#44228;&#49549;&#46104;&#44256; &#44221;&#44256;&#44032; &#44592;&#47197;&#46121;&#45768;&#45796;.</p>
<p>&#54876;&#49457; &#49345;&#53468; &#45936;&#51060;&#53552;&#47484; &#48372;&#51316;&#54616;&#44592; &#50948;&#54644; GlassFish Server&#51008;(&#45716;) &#45936;&#51060;&#53552;&#47484; &#51649;&#47148;&#54868;&#54616;&#50668; &#47700;&#47784;&#47532;&#50640; &#51200;&#51109;&#54633;&#45768;&#45796;. &#45936;&#51060;&#53552;&#47484; &#48373;&#50896;&#54616;&#44592; &#50948;&#54644; &#49352;&#47196; &#51116;&#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51032; &#53364;&#47000;&#49828; &#47196;&#45908;&#45716; &#51060;&#51204;&#50640; &#51200;&#51109;&#46108; &#45936;&#51060;&#53552;&#51032; &#51649;&#47148;&#54868;&#47484; &#54644;&#51228;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#48176;&#52824; &#49692;&#49436;] &#54596;&#46300;&#50640; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51032; &#48176;&#52824; &#49692;&#49436;&#47484; &#51648;&#51221;&#54616;&#45716; &#49707;&#51088;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#49436;&#48260; &#49884;&#51089; &#49884; &#45230;&#51008; &#48264;&#54840;&#51032; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#48512;&#53552; &#47196;&#46300;&#46121;&#45768;&#45796;. &#46384;&#46972;&#49436; &#48176;&#52824; &#49692;&#49436;&#44032; 102&#51064; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51008; &#48176;&#52824; &#49692;&#49436;&#44032; 110&#51064; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#48372;&#45796; &#47676;&#51200; &#47196;&#46300;&#46121;&#45768;&#45796;. &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#48176;&#52824; &#49884; &#48176;&#52824; &#49692;&#49436;&#44032; &#51648;&#51221;&#46104;&#51648; &#50506;&#51008; &#44221;&#50864; &#44592;&#48376; &#48176;&#52824; &#49692;&#49436;&#44032; 100&#51060; &#51648;&#51221;&#46121;&#45768;&#45796;. &#46160; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51032; &#48176;&#52824; &#49692;&#49436;&#44032; &#44057;&#51012; &#44221;&#50864; &#47676;&#51200; &#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#47676;&#51200; &#47196;&#46300;&#46121;&#45768;&#45796;. &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#51333;&#49549; &#54637;&#47785;&#51060; &#51080;&#44256; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#53945;&#51221; &#49692;&#49436;&#47196; &#47196;&#46300;&#54644;&#50556; &#54616;&#45716; &#44221;&#50864; &#48176;&#52824; &#49692;&#49436;&#47484; &#51648;&#51221;&#54616;&#45716; &#44163;&#51060; &#51339;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#46972;&#51060;&#48652;&#47084;&#47532;] &#54596;&#46300;&#50640; &#51060; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#44284; &#44288;&#47144;&#46108; &#46972;&#51060;&#48652;&#47084;&#47532; JAR &#54028;&#51068;&#51012; &#53092;&#47560;&#47196; &#44396;&#48516;&#54616;&#50668; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#44221;&#47196;&#45716; &#51208;&#45824; &#44221;&#47196;&#51060;&#44144;&#45208; &#49345;&#45824; &#44221;&#47196;&#51068; &#49688; &#51080;&#49845;&#45768;&#45796;. &#49345;&#45824; &#44221;&#47196;&#45716; domain-dir<code>/lib/applibs</code>&#50640; &#45824;&#54620; &#49345;&#45824; &#44221;&#47196;&#51077;&#45768;&#45796;. &#51208;&#45824; &#44221;&#47196;&#51064; &#44221;&#50864;, DAS(&#46020;&#47700;&#51064; &#44288;&#47532; &#49436;&#48260;)&#44032; &#51060; &#44221;&#47196;&#50640; &#50529;&#49464;&#49828;&#54624; &#49688; &#51080;&#50612;&#50556; &#54633;&#45768;&#45796;. &#51593;, domain-dir &#50500;&#47000;&#50640; &#51080;&#50612;&#50556; &#54633;&#45768;&#45796;. &#46972;&#51060;&#48652;&#47084;&#47532;&#45716; &#51648;&#51221;&#54620; &#49692;&#49436;&#45824;&#47196; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#49324;&#50857; &#44032;&#45733;&#54616;&#44172; &#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#49444;&#47749;] &#54596;&#46300;&#50640; &#51060; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51032; &#49444;&#47749;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#47784;&#46280;&#51060;&#45208; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#48176;&#52824;&#54624; &#45824;&#49345; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#50752; &#53364;&#47084;&#49828;&#53552;&#47484; &#52628;&#44032;&#54616;&#47140;&#47732; [&#49324;&#50857; &#44032;&#45733;&#54620; &#45824;&#49345;] &#47785;&#47197;&#50640;&#49436; &#54644;&#45817; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#50752; &#53364;&#47084;&#49828;&#53552;&#47484; &#49440;&#53469;&#54620; &#45796;&#51020; [&#52628;&#44032;] &#45800;&#52628;&#47484; &#49324;&#50857;&#54616;&#50668; [&#49440;&#53469;&#54620; &#45824;&#49345;] &#47785;&#47197;&#51004;&#47196; &#51060;&#46041;&#54633;&#45768;&#45796;.</p>
<p>[&#45824;&#49345;] &#50741;&#49496;&#51008; &#44592;&#48376; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;(<code>server</code>) &#50808;&#50640; &#53364;&#47084;&#49828;&#53552; &#46608;&#45716; &#46021;&#47549;&#54805; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#44032; &#51080;&#45716; &#44221;&#50864;&#50640; &#54364;&#49884;&#46121;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; &#47784;&#46280;&#51060;&#45208; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51008; <code>server</code>&#46972;&#45716; &#44592;&#48376; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#50640; &#48176;&#52824;&#46121;&#45768;&#45796;. &#47784;&#46304; &#45824;&#49345;&#50640; &#48176;&#52824;&#54616;&#47140;&#47732; [&#47784;&#46160; &#52628;&#44032;] &#45800;&#52628;&#47484; &#49324;&#50857;&#54633;&#45768;&#45796;. [&#49440;&#53469;&#54620; &#45824;&#49345;] &#47785;&#47197;&#50640;&#49436; &#45824;&#49345;&#51012; &#51228;&#44144;&#54616;&#47140;&#47732; [&#51228;&#44144;] &#48143; [&#47784;&#46160; &#51228;&#44144;] &#45800;&#52628;&#47484; &#49324;&#50857;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#54869;&#51064;]&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
</li>
</ol>
<a id="sthref58" name="sthref58"></a>
<h5>&#44288;&#47144; &#54637;&#47785;</h5>
<ul>
<li>
<p><a href="task-applistdeployed.html">&#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#47785;&#47197;&#51012; &#48372;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">&#50937; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#48176;&#52824;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#53364;&#46972;&#51060;&#50616;&#53944;&#47484; &#48176;&#52824;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">&#52964;&#45349;&#53552; &#47784;&#46280;&#51012; &#48176;&#52824;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">EJB Jar&#47484; &#48176;&#52824;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-appedit.html">&#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#44592;&#49696;&#51088;&#47484; &#48372;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-endpoint.html">&#50937; &#49436;&#48708;&#49828;&#50640; &#45824;&#54620; &#45149;&#51216; &#51221;&#48372;&#47484; &#48372;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-applaunch.html">&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#49892;&#54665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#53364;&#46972;&#51060;&#50616;&#53944;&#47484; &#49892;&#54665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#53364;&#46972;&#51060;&#50616;&#53944; &#49828;&#53569;&#51012; &#45796;&#50868;&#47196;&#46300;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-appredeploy.html">&#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#51116;&#48176;&#52824;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-apprestart.html">&#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#45796;&#49884; &#47196;&#46300;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#48276;&#50948; &#47532;&#49548;&#49828;&#47484; &#54869;&#51064;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#48276;&#50948; &#47532;&#49548;&#49828;&#47484; &#49688;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
