<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-eelogging" name="task-eelogging"></a><a id="GHCOM00177" name="GHCOM00177"></a></p>

<h4><a id="sthref117" name="sthref117"></a>&#51068;&#48152; &#47196;&#44613; &#49444;&#51221;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#53456;&#49353; &#53944;&#47532;&#50640;&#49436; [&#44396;&#49457;] &#45432;&#46300;&#47484; &#54869;&#51109;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#44396;&#49457;] &#45432;&#46300;&#50640;&#49436; &#47196;&#44613; &#49444;&#51221;&#51012; &#44396;&#49457;&#54624; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#45208; &#53364;&#47084;&#49828;&#53552; &#44396;&#49457;&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
<p>[&#44396;&#49457;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#44396;&#49457;] &#54168;&#51060;&#51648;&#50640;&#49436; [&#47196;&#44613; &#49444;&#51221;]&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
<p>&#49440;&#53469;&#54620; &#44396;&#49457; &#45824;&#49345;&#50640; &#45824;&#54620; [&#47196;&#44613; &#49444;&#51221;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>&#49436;&#48260; &#47196;&#44536; &#51060;&#50808;&#50640; <code>syslog</code> &#44592;&#45733;&#51004;&#47196; &#47196;&#44613; &#52636;&#47141;&#51012; &#48372;&#45236;&#47140;&#47732; [&#49884;&#49828;&#53596; &#47196;&#44536;&#50640; &#50416;&#44592; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#44592;&#45733;&#51008; Solaris &#48143; Linux &#49884;&#49828;&#53596;&#50640;&#49436;&#47564; &#49324;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>&#47196;&#44613; &#52636;&#47141;&#51012; &#49884;&#49828;&#53596; &#53080;&#49556;&#47196; &#48372;&#45236;&#47140;&#47732; [&#53080;&#49556;&#50640; &#47196;&#44536; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#49436;&#48260; &#47196;&#44536; &#54028;&#51068;&#51012; &#47588;&#51068; &#51088;&#51221;&#50640; &#44368;&#52404;&#54616;&#47140;&#47732; [&#45216;&#51676; &#48320;&#44221; &#49884; &#44368;&#52404; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#47196;&#44536; &#47700;&#49884;&#51648;&#47484; &#51069;&#44592; &#49789;&#46020;&#47197; &#54805;&#49885;&#51012; &#51648;&#51221;&#54616;&#47140;&#47732; [&#48373;&#49688; &#54665; &#47784;&#46300; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;. &#47196;&#44536; &#47700;&#49884;&#51648; &#48376;&#47928;&#51060; &#46308;&#50668;&#50416;&#44592;&#46104;&#44256; &#49352; &#54665;&#50640;&#49436; &#49884;&#51089;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#53080;&#49556; &#47196;&#44613; &#54805;&#49885;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#53080;&#49556;&#50640; &#47196;&#44613;&#54624; &#54805;&#49885;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;. &#44592;&#48376; &#50741;&#49496;&#51008; ODL(Oracle Diagnostics Logging)&#51077;&#45768;&#45796;. &#45796;&#47480; &#50741;&#49496;&#51008; ULF(UniformLogFormatter)&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#47196;&#44536; &#54028;&#51068; &#47196;&#44613; &#54805;&#49885;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#49436;&#48260; &#47196;&#44536; &#54028;&#51068;&#50640; &#47196;&#44613;&#54624; &#54805;&#49885;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;. &#44592;&#48376; &#50741;&#49496;&#51008; ODL&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#54028;&#51068; &#44368;&#52404; &#51228;&#54620;] &#54596;&#46300;&#50640; &#49436;&#48260; &#47196;&#44536; &#54028;&#51068;&#51060; &#44368;&#52404;&#46104;&#44592; &#51204;&#50640; &#46020;&#45804;&#54644;&#50556; &#54616;&#45716; &#53356;&#44592;(&#48148;&#51060;&#53944;)&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#49436;&#48260; &#47196;&#44536;&#44032; &#51648;&#51221;&#54620; &#53356;&#44592;&#50640; &#46020;&#45804;&#54616;&#47732; GlassFish Server&#50640;&#49436;&#45716; <code>server.log</code>&#46972;&#45716; &#48712; &#54028;&#51068;&#51012; &#49352;&#47196; &#49373;&#49457;&#54620; &#45796;&#51020; &#51060;&#51204; &#54028;&#51068;&#51032; &#51060;&#47492;&#51012; <code>server.log_</code><i>date</i>&#47196; &#48148;&#45001;&#45768;&#45796;. &#50668;&#44592;&#49436; <i>date</i>&#45716; &#54028;&#51068;&#51060; &#44368;&#52404;&#46108; &#45216;&#51676; &#48143; &#49884;&#44036;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 2MB&#51077;&#45768;&#45796;. &#52572;&#49548; &#51228;&#54620; &#44050;&#51008; 500KB&#51077;&#45768;&#45796;. &#51060;&#48372;&#45796; &#45908; &#45230;&#51008; &#44050;&#51012; &#51648;&#51221;&#54616;&#47732; &#54028;&#51068; &#53356;&#44592;&#44032; 500KB&#50640; &#46020;&#45804;&#54624; &#46412; &#54028;&#51068;&#51060; &#44368;&#52404;&#46121;&#45768;&#45796;. &#47196;&#44536; &#54028;&#51068; &#44368;&#52404;&#47484; &#54644;&#51228;&#54616;&#47140;&#47732; &#44050;&#51012; 0&#51004;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#54028;&#51068; &#44368;&#52404; &#49884;&#44036; &#51228;&#54620;] &#54596;&#46300;&#50640;&#49436; &#49436;&#48260; &#47196;&#44536;&#47484; &#44368;&#52404;&#54644;&#50556; &#54616;&#45716; &#49884;&#44036;(&#48516;)&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; 0&#51060;&#47728; &#51060;&#45716; &#54028;&#51068; &#53356;&#44592;&#44032; [&#54028;&#51068; &#44368;&#52404; &#51228;&#54620;] &#54596;&#46300;&#50640; &#51648;&#51221;&#46108; &#53356;&#44592;&#50640; &#46020;&#45804;&#54624; &#46412; &#54028;&#51068;&#51060; &#44368;&#52404;&#46120;&#51012; &#51032;&#48120;&#54633;&#45768;&#45796;.</p>

<hr>
<p><b>&#51452;:</b></p>
1&#48516; &#51060;&#49345;&#51012; &#51648;&#51221;&#54616;&#47732; [&#54028;&#51068; &#44368;&#52404; &#51228;&#54620;] &#54596;&#46300;&#50640; &#51648;&#51221;&#46108; &#53356;&#44592; &#51228;&#54620;&#48372;&#45796; &#49884;&#44036; &#51228;&#54620;&#51060; &#45908; &#45458;&#51008; &#50864;&#49440;&#49692;&#50948;&#47484; &#44032;&#51665;&#45768;&#45796;.
<hr>

</li>
<li>
<p>[&#48708;&#50864;&#44592; &#48712;&#46020;] &#54596;&#46300;&#50640;&#49436; &#45824;&#44592;&#50676;&#50640;&#49436; &#49436;&#48260; &#47196;&#44536;&#50640; &#54620; &#48264;&#50640; &#44592;&#47197;&#46104;&#45716; &#47700;&#49884;&#51648;&#51032; &#52572;&#45824; &#49688;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; 1&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>&#44032;&#51109; &#50724;&#47000;&#46108; &#54028;&#51068;&#51012; &#49325;&#51228;&#54616;&#44592; &#51204;&#50640; GlassFish Server&#50640; &#48372;&#51316;&#54644;&#50556; &#54616;&#45716; &#52572;&#45824; &#47196;&#44536; &#54028;&#51068; &#49688;&#47484; [&#52572;&#45824; &#45236;&#50669; &#54028;&#51068;] &#54596;&#46300;&#50640; &#51077;&#47141;&#54633;&#45768;&#45796;. &#51060; &#44050;&#51012; 0&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; GlassFish Server&#50640;&#49436; &#51060;&#51204; &#47196;&#44536; &#54028;&#51068;&#51060; &#49325;&#51228;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#47196;&#44536; &#54028;&#51068;] &#54596;&#46300;&#50640;&#49436; &#49436;&#48260; &#47196;&#44536; &#54028;&#51068;&#51032; &#45824;&#52404; &#51060;&#47492; &#46608;&#45716; &#50948;&#52824;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376; &#50948;&#52824;&#45716; <code>${com.sun.aas.instanceRoot}/logs/server.log</code>&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#47196;&#44536; &#52376;&#47532;&#44592;] &#54596;&#46300;&#50640; &#49324;&#50857;&#51088; &#51221;&#51032; &#47196;&#44536; &#52376;&#47532;&#44592;&#51032; &#51208;&#45824; &#53364;&#47000;&#49828; &#51060;&#47492;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#49324;&#50857;&#51088; &#51221;&#51032; &#47196;&#44536; &#52376;&#47532;&#44592;&#47484; &#49324;&#50857;&#54616;&#47732; &#47196;&#44536;&#47484; <code>server.log</code> &#46608;&#45716; <code>syslog</code> &#51060;&#50808;&#51032; &#45824;&#49345;&#50640; &#48372;&#45244; &#49688; &#51080;&#49845;&#45768;&#45796;. &#49324;&#50857;&#51088; &#51221;&#51032; &#52376;&#47532;&#44592;&#50640;&#49436; <code>java.util.logging.ConsoleHandler</code>(JSR 047 &#54840;&#54872; API)&#47484; &#54869;&#51109;&#54644;&#50556; &#54633;&#45768;&#45796;. GlassFish Server &#53364;&#47000;&#49828; &#44221;&#47196;&#50640; &#52376;&#47532;&#44592; &#53364;&#47000;&#49828;&#47484; &#45347;&#50612; &#49436;&#48260; &#49884;&#51089; &#49884; &#52376;&#47532;&#44592;&#44032; &#49444;&#52824;&#46104;&#46020;&#47197; &#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51200;&#51109;]&#51012; &#45572;&#47493;&#45768;&#45796;.</p>

<hr>
<p><b>&#51452;:</b></p>
&#47196;&#44613;&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46108; &#44396;&#49457;&#50640; &#46384;&#46972; &#49436;&#48260;&#47484; &#51116;&#49884;&#51089;&#54644;&#50556; &#54624; &#49688;&#46020; &#51080;&#49845;&#45768;&#45796;.
<p>&#47196;&#44536; &#54028;&#51068; &#51060;&#47492;&#51060; &#44592;&#48376; &#49444;&#51221;&#50640;&#49436; &#48320;&#44221;&#46108; &#44221;&#50864;&#50640;&#46020; &#49436;&#48260;&#47484; &#51116;&#49884;&#51089;&#54644;&#50556; &#54633;&#45768;&#45796;. &#49436;&#48260;&#47484; &#51116;&#49884;&#51089;&#54644;&#50556; &#54616;&#45716; &#44221;&#50864; &#44288;&#47532; &#53080;&#49556;&#51032; &#50724;&#47480;&#51901; &#47592; &#50948;&#50640; <code>&#51116;&#49884;&#51089;&#54644;&#50556; &#54632;</code> &#47700;&#49884;&#51648;&#44032; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>

<hr>

</li>
</ol>
<a id="sthref118" name="sthref118"></a>
<h5>&#44288;&#47144; &#54637;&#47785;</h5>
<ul>
<li>
<p><a href="task-eelogginglevels.html">&#47196;&#44536; &#47112;&#48296;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-logging-max-logfiles.html">&#44368;&#52404;&#46108; &#47196;&#44536; &#54028;&#51068; &#49688; &#51228;&#54620;&#51012; &#48320;&#44221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-logviewer.html">DAS&#50640; &#45824;&#54620; &#47196;&#44536; &#54028;&#51068;&#51012; &#48372;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-collectdomainlogs.html">&#47196;&#44536;&#47484; &#49688;&#51665; &#48143; &#45796;&#50868;&#47196;&#46300;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
