<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-logging-max-logfiles" name="task-logging-max-logfiles"></a></p>

<h4><a id="sthref75" name="sthref75"></a><a id="sthref76" name="sthref76"></a><a id="sthref77" name="sthref77"></a>&#44368;&#52404;&#46108; &#47196;&#44536; &#54028;&#51068; &#49688; &#51228;&#54620;&#51012; &#48320;&#44221;&#54616;&#45716; &#48169;&#48277;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>GlassFish Server&#50640;&#49436; &#47196;&#44536; &#54028;&#51068;&#51012; &#44368;&#52404;&#54624; &#46412; <code>server.log</code>&#46972;&#45716; &#48712; &#54028;&#51068;&#51012; &#49352;&#47196; &#49373;&#49457;&#54620; &#45796;&#51020; &#51060;&#51204; &#54028;&#51068;&#51032; &#51060;&#47492;&#51012; <code>server.log_</code> <i>date</i>&#47196; &#48148;&#45001;&#45768;&#45796;. &#50668;&#44592;&#49436; <i>date</i>&#45716; &#54028;&#51068;&#51060; &#44368;&#52404;&#46108; &#45216;&#51676; &#48143; &#49884;&#44036;&#51077;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#51201;&#51004;&#47196; GlassFish Server&#50640;&#49436;&#45716; &#44368;&#52404;&#46108; &#47196;&#44536; &#54028;&#51068; &#49688;&#47484; 10&#51004;&#47196; &#51228;&#54620;&#54633;&#45768;&#45796;. &#51060; &#51228;&#54620;&#50640; &#46020;&#45804;&#54616;&#47732; GlassFish Server&#50640;&#49436; &#45796;&#51020;&#50640; &#47196;&#44536; &#54028;&#51068;&#51012; &#44368;&#52404;&#54624; &#46412; &#44032;&#51109; &#50724;&#47000;&#46108; &#47196;&#44536; &#54028;&#51068;&#51060; &#49325;&#51228;&#46121;&#45768;&#45796;.</p>
<p>&#54596;&#50836;&#54620; &#44221;&#50864; &#44368;&#52404;&#46108; &#47196;&#44536; &#54028;&#51068;&#51032; &#49688; &#51228;&#54620;&#51012; &#48320;&#44221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#49444;&#51221;&#54616;&#45716; &#49352; &#51228;&#54620;&#51008; &#50529;&#49464;&#49828; &#47196;&#44613; &#48143; &#49436;&#48260; &#47196;&#44536;&#50640; &#45824;&#54620; &#44368;&#52404;&#46108; &#47196;&#44536; &#54028;&#51068;&#50640; &#51201;&#50857;&#46121;&#45768;&#45796;.</p>
<ol>
<li>
<p><code>com.sun.enterprise.server.logging.max_history_files</code> &#49884;&#49828;&#53596; &#49549;&#49457;&#51012; &#48372;&#51316;&#54624; &#52572;&#45824; &#44368;&#52404; &#50529;&#49464;&#49828; &#47196;&#44536; &#54028;&#51068; &#49688;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#49884;&#49828;&#53596; &#49549;&#49457;&#51012; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;&#51008; <a href="task-systemproperties.html">&#49884;&#49828;&#53596; &#49549;&#49457;&#51012; &#44288;&#47532;&#54616;&#45716; &#48169;&#48277;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
<p><code>com.sun.enterprise.server.logging.max_history_files</code> &#49884;&#49828;&#53596; &#49549;&#49457;&#51032; &#46041;&#51089;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#49549;&#49457;&#51060; &#49444;&#51221;&#46104;&#51648; &#50506;&#51008; &#44221;&#50864; GlassFish Server&#50640; &#52572;&#45824; 10&#44060;&#51032; &#44368;&#52404;&#46108; &#47196;&#44536; &#54028;&#51068;&#51060; &#48372;&#51316;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>&#49549;&#49457;&#51060; &#48512;&#51201;&#54633;&#54620; &#49688; &#46608;&#45716; &#45328;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; GlassFish Server&#50640; &#52572;&#45824; 10&#44060;&#51032; &#44368;&#52404;&#46108; &#47196;&#44536; &#54028;&#51068;&#51060; &#48372;&#51316;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>&#49549;&#49457;&#51060; 0&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; GlassFish Server&#50640; &#44368;&#52404;&#46108; &#47196;&#44536; &#54028;&#51068;&#51060; &#48372;&#51316;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</li>
</ul>
</li>
</ol>
<a id="GHCOM278" name="GHCOM278"></a>
<h5>&#44288;&#47144; &#54637;&#47785;</h5>
<ul>
<li>
<p><a href="task-eelogging.html">&#51068;&#48152; &#47196;&#44613; &#49444;&#51221;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-eelogginglevels.html">&#47196;&#44536; &#47112;&#48296;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-logviewer.html">DAS&#50640; &#45824;&#54620; &#47196;&#44536; &#54028;&#51068;&#51012; &#48372;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-collectdomainlogs.html">&#47196;&#44536;&#47484; &#49688;&#51665; &#48143; &#45796;&#50868;&#47196;&#46300;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-systemproperties.html">&#49884;&#49828;&#53596; &#49549;&#49457;&#51012; &#44288;&#47532;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
