<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-uc-set-proxy" name="task-uc-set-proxy"></a></p>

<h4><a id="sthref208" name="sthref208"></a><a id="sthref209" name="sthref209"></a><a id="sthref210" name="sthref210"></a>&#45348;&#53944;&#50892;&#53356; &#51200;&#51109;&#49548;&#50640; &#50529;&#49464;&#49828;&#54624; &#49688; &#51080;&#46020;&#47197; &#45348;&#53944;&#50892;&#53356; &#54532;&#47197;&#49884; &#49444;&#51221;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#45348;&#53944;&#50892;&#53356; &#54532;&#47197;&#49884; &#49444;&#51221;&#50640; &#46384;&#46972; GlassFish Server&#44032; &#51064;&#53552;&#45367;&#50640; &#51217;&#49549;&#54616;&#45716; &#48169;&#48277;&#51060; &#44208;&#51221;&#46121;&#45768;&#45796;. &#51064;&#53552;&#45367;&#51012; &#53685;&#54644; &#50629;&#45936;&#51060;&#53944; &#46020;&#44396;&#44032; &#45348;&#53944;&#50892;&#53356; &#51200;&#51109;&#49548;&#50640; &#50529;&#49464;&#49828;&#54624; &#49688; &#51080;&#46020;&#47197; &#54616;&#47140;&#47732; &#45348;&#53944;&#50892;&#53356; &#54532;&#47197;&#49884; &#49444;&#51221;&#51012; &#44396;&#49457;&#54633;&#45768;&#45796;.</p>
<ol>
<li>
<p>&#53456;&#49353; &#53944;&#47532;&#50640;&#49436; &#50629;&#45936;&#51060;&#53944; &#46020;&#44396; &#45432;&#46300;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>[&#49324;&#50857; &#44032;&#45733;&#54620; &#52628;&#44032; &#44592;&#45733;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#49324;&#50857; &#44032;&#45733;&#54620; &#52628;&#44032; &#44592;&#45733;] &#54168;&#51060;&#51648;&#50640;&#49436; [&#44396;&#49457;] &#53485;&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
<p>&#50629;&#45936;&#51060;&#53944; &#46020;&#44396; &#44396;&#49457; &#54168;&#51060;&#51648;&#44032; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>&#50629;&#45936;&#51060;&#53944; &#46020;&#44396; &#44396;&#49457; &#54168;&#51060;&#51648;&#50640;&#49436; GlassFish Server&#44032; &#49892;&#54665; &#51473;&#51064; &#49884;&#49828;&#53596;&#51032; &#51064;&#53552;&#45367; &#51217;&#49549; &#48169;&#49885;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#49884;&#49828;&#53596;&#51012; &#51064;&#53552;&#45367;&#50640; &#51649;&#51217; &#51217;&#49549;&#54620; &#44221;&#50864; [&#51649;&#51217; &#51217;&#49549;] &#50741;&#49496;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#49884;&#49828;&#53596;&#51060; &#54532;&#47197;&#49884;&#47484; &#53685;&#54644; &#51217;&#49549;&#46108; &#44221;&#50864; [&#54532;&#47197;&#49884;&#47484; &#53685;&#54644;] &#50741;&#49496;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</li>
</ul>
</li>
<li>
<p>GlassFish Server&#44032; &#49892;&#54665; &#51473;&#51064; &#49884;&#49828;&#53596;&#50640;&#49436; &#54532;&#47197;&#49884;&#47484; &#53685;&#54644; &#51064;&#53552;&#45367;&#50640; &#51217;&#49549;&#54616;&#45716; &#44221;&#50864;&#50640;&#45716; &#54532;&#47197;&#49884; &#54840;&#49828;&#53944; &#51060;&#47492;&#44284; &#54532;&#47197;&#49884; &#54252;&#53944; &#48264;&#54840;&#47484; &#51228;&#44277;&#54633;&#45768;&#45796;.</p>
<p>GlassFish Server&#44032; &#49892;&#54665; &#51473;&#51064; &#49884;&#49828;&#53596;&#51060; &#51064;&#53552;&#45367;&#50640; &#51649;&#51217; &#51217;&#49549;&#46108; &#44221;&#50864; &#51060; &#45800;&#44228;&#47484; &#49373;&#47029;&#54633;&#45768;&#45796;.</p>
<p>&#50937; &#48652;&#46972;&#50864;&#51200;&#50752; GlassFish Server&#44032; &#46041;&#51068;&#54620; &#49884;&#49828;&#53596;&#50640;&#49436; &#49892;&#54665; &#51473;&#51068; &#49688; &#51080;&#49845;&#45768;&#45796;. &#44536;&#47092; &#44221;&#50864; &#50937; &#48652;&#46972;&#50864;&#51200;&#50640;&#49436; &#54532;&#47197;&#49884;&#51032; &#54840;&#49828;&#53944; &#51060;&#47492;&#44284; &#54252;&#53944; &#48264;&#54840;&#47484; &#44032;&#51256;&#50732; &#49688; &#51080;&#49845;&#45768;&#45796;. &#44536;&#47111;&#51648; &#50506;&#51004;&#47732; &#49884;&#49828;&#53596; &#44288;&#47532;&#51088;&#50640;&#44172; &#51060; &#51221;&#48372;&#47484; &#47928;&#51032;&#54616;&#49901;&#49884;&#50724;.</p>
</li>
<li>
<p>[&#51200;&#51109;]&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
</li>
</ol>
<a id="sthref211" name="sthref211"></a>
<h5>&#44288;&#47144; &#54637;&#47785;</h5>
<ul>
<li>
<p><a href="task-uc-update.html">&#44396;&#49457; &#50836;&#49548;&#51032; &#49324;&#50857; &#44032;&#45733;&#54620; &#50629;&#45936;&#51060;&#53944;&#47484; &#54869;&#51064;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-uc-addon.html">&#52628;&#44032; &#44592;&#45733; &#44396;&#49457; &#50836;&#49548;&#47484; &#49444;&#52824;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-uc-installed-remove.html">&#49444;&#52824;&#46108; &#44396;&#49457; &#50836;&#49548;&#47484; &#54869;&#51064;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-uc-pkgdetails.html">&#44396;&#49457; &#50836;&#49548;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#51221;&#48372;&#47484; &#48372;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
