<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-uc-addon" name="task-uc-addon"></a></p>

<h4><a id="sthref197" name="sthref197"></a><a id="sthref198" name="sthref198"></a>&#52628;&#44032; &#44592;&#45733; &#44396;&#49457; &#50836;&#49548;&#47484; &#49444;&#52824;&#54616;&#45716; &#48169;&#48277;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#52628;&#44032; &#44592;&#45733; &#44396;&#49457; &#50836;&#49548; &#49444;&#52824;&#50640;&#45716; &#45796;&#51020; &#51089;&#50629;&#51060; &#54252;&#54632;&#46121;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#45348;&#53944;&#50892;&#53356; &#51200;&#51109;&#49548;&#50640;&#49436; &#44396;&#49457; &#50836;&#49548; &#45236;&#50857; &#48143; &#44396;&#49457; &#50836;&#49548; &#51333;&#49549;&#49457; &#51204;&#49569;</p>
</li>
<li>
<p>&#49884;&#49828;&#53596;&#51032; GlassFish Server &#49444;&#52824; &#51060;&#48120;&#51648;&#50640; &#44396;&#49457; &#50836;&#49548; &#49444;&#52824;</p>
</li>
</ul>
<p>&#44396;&#49457; &#50836;&#49548;&#44032; &#50500;&#51649; &#49444;&#52824;&#46104;&#51648; &#50506;&#51008; &#45796;&#47480; &#44396;&#49457; &#50836;&#49548;&#44032; &#54596;&#50836;&#54620; &#44221;&#50864; &#54596;&#50836;&#54620; &#44396;&#49457; &#50836;&#49548;&#46020; &#49444;&#52824;&#46121;&#45768;&#45796;.</p>
<ol>
<li>
<p>&#53456;&#49353; &#53944;&#47532;&#50640;&#49436; &#50629;&#45936;&#51060;&#53944; &#46020;&#44396; &#45432;&#46300;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>[&#49324;&#50857; &#44032;&#45733;&#54620; &#52628;&#44032; &#44592;&#45733;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#49324;&#50857; &#44032;&#45733;&#54620; &#52628;&#44032; &#44592;&#45733;] &#54168;&#51060;&#51648;&#51032; &#49324;&#50857; &#44032;&#45733;&#54620; &#52628;&#44032; &#44592;&#45733; &#44396;&#49457; &#50836;&#49548; &#53580;&#51060;&#48660;&#50640;&#49436; &#49444;&#52824;&#54624; &#44396;&#49457; &#50836;&#49548;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#52628;&#44032; &#44592;&#45733; &#44396;&#49457; &#50836;&#49548;&#47484; &#49324;&#50857;&#54624; &#49688; &#50630;&#45716; &#44221;&#50864; &#53580;&#51060;&#48660;&#51060; &#48708;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#44060;&#48324; &#44396;&#49457; &#50836;&#49548;&#47484; &#49440;&#53469;&#54616;&#47140;&#47732; &#44396;&#49457; &#50836;&#49548; &#51060;&#47492; &#50694;&#50640; &#51080;&#45716; &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#47784;&#46304; &#44396;&#49457; &#50836;&#49548;&#47484; &#49440;&#53469;&#54616;&#47140;&#47732; &#53580;&#51060;&#48660; &#54756;&#45908;&#50640;&#49436; [&#47784;&#46160; &#49440;&#53469;] &#50500;&#51060;&#53080;&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
</li>
<li>
<p>&#47784;&#46304; &#44396;&#49457; &#50836;&#49548;&#47484; &#49440;&#53469; &#54644;&#51228;&#54616;&#47140;&#47732; &#53580;&#51060;&#48660; &#54756;&#45908;&#50640;&#49436; [&#47784;&#46160; &#49440;&#53469; &#54644;&#51228;] &#50500;&#51060;&#53080;&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
</li>
</ul>
</li>
<li>
<p>[&#49444;&#52824;]&#47484; &#45572;&#47493;&#45768;&#45796;.</p>
<p>&#49440;&#53469;&#54620; &#44396;&#49457; &#50836;&#49548; &#48143; &#54596;&#50836;&#54620; &#47784;&#46304; &#44396;&#49457; &#50836;&#49548;&#47484; &#49444;&#52824;&#54644;&#50556; &#54632;&#51012; &#54869;&#51064;&#54616;&#46972;&#45716; &#45824;&#54868;&#49345;&#51088;&#44032; &#45208;&#53440;&#45225;&#45768;&#45796;.</p>
</li>
<li>
<p>&#45824;&#54868;&#49345;&#51088;&#50640;&#49436; [&#54869;&#51064;]&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
<p>&#49444;&#52824;&#54624; &#44396;&#49457; &#50836;&#49548;&#51032; &#49324;&#50857;&#44428; &#44228;&#50557;&#50640; &#46041;&#51032;&#54624; &#44163;&#51012; &#47931;&#45716; &#47700;&#49884;&#51648;&#44032; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>&#49444;&#52824;&#54624; &#44396;&#49457; &#50836;&#49548;&#51032; &#49324;&#50857;&#44428; &#44228;&#50557;&#50640; &#46041;&#51032;&#54633;&#45768;&#45796;.</p>
<p>GlassFish Server&#50640;&#49436; &#49444;&#52824; &#50756;&#47308;&#47484; &#54869;&#51064;&#54633;&#45768;&#45796;. &#44396;&#49457; &#50836;&#49548;&#44032; &#52628;&#44032; &#44592;&#45733; &#44396;&#49457; &#50836;&#49548; &#53580;&#51060;&#48660;&#50640;&#49436; &#51228;&#44144;&#46104;&#44256; [&#49444;&#52824;&#46108; &#44396;&#49457; &#50836;&#49548;] &#54168;&#51060;&#51648;&#51032; &#49444;&#52824;&#46108; &#44396;&#49457; &#50836;&#49548; &#53580;&#51060;&#48660;&#50640; &#52628;&#44032;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>&#49436;&#48260;&#47484; &#51116;&#49884;&#51089;&#54633;&#45768;&#45796;.</p>
<p>&#51088;&#49464;&#54620; &#51648;&#52840;&#51008; &#45796;&#51020; &#49444;&#47749;&#49436;&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSADG00336"><i>Oracle GlassFish Server Administration Guide</i>&#51032; <i>To Stop a Domain</i></a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSADG00335"><i>Oracle GlassFish Server Administration Guide</i>&#51032; <i>To Start a Domain</i></a></p>
</li>
</ul>
</li>
</ol>
<a id="sthref199" name="sthref199"></a>
<h5>&#44288;&#47144; &#54637;&#47785;</h5>
<ul>
<li>
<p><a href="task-uc-update.html">&#44396;&#49457; &#50836;&#49548;&#51032; &#49324;&#50857; &#44032;&#45733;&#54620; &#50629;&#45936;&#51060;&#53944;&#47484; &#54869;&#51064;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-uc-installed-remove.html">&#49444;&#52824;&#46108; &#44396;&#49457; &#50836;&#49548;&#47484; &#54869;&#51064;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-uc-pkgdetails.html">&#44396;&#49457; &#50836;&#49548;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#51221;&#48372;&#47484; &#48372;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-uc-set-proxy.html">&#45348;&#53944;&#50892;&#53356; &#51200;&#51109;&#49548;&#50640; &#50529;&#49464;&#49828;&#54624; &#49688; &#51080;&#46020;&#47197; &#45348;&#53944;&#50892;&#53356; &#54532;&#47197;&#49884; &#49444;&#51221;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
