<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmxconnectoredit" name="task-jmxconnectoredit"></a></p>

<h4><a id="sthref110" name="sthref110"></a>JMX &#52964;&#45349;&#53552;&#47484; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#44288;&#47532; &#49436;&#48708;&#49828;&#47484; &#49324;&#50857;&#54616;&#50668; JSR-160 &#54840;&#54872; &#50896;&#44201; JMX &#52964;&#45349;&#53552;&#47484; &#44396;&#49457;&#54633;&#45768;&#45796;.</p>
<p>JSR-160 &#54840;&#54872; &#50896;&#44201; JMX &#52964;&#45349;&#53552;&#45716; &#46020;&#47700;&#51064; &#44288;&#47532;&#47484; &#50948;&#54644; JConsole &#46321;&#51032; JMX &#53364;&#46972;&#51060;&#50616;&#53944;&#50752; JMX &#49436;&#48708;&#49828; &#44036;&#51032; &#53685;&#49888;&#51012; &#52376;&#47532;&#54633;&#45768;&#45796;.</p>
<ol>
<li>
<p>&#53456;&#49353; &#53944;&#47532;&#50640;&#49436; [&#44396;&#49457;] &#45432;&#46300;&#47484; &#54869;&#51109;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#44396;&#49457;] &#45432;&#46300;&#50640;&#49436; [&#44288;&#47532; &#49436;&#48708;&#49828;] &#45432;&#46300;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>[JMX &#52964;&#45349;&#53552; &#54200;&#51665;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>JMX &#53685;&#49888;&#51012; &#50516;&#54840;&#54868;&#54616;&#47140;&#47732; [&#48372;&#50504; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51452;&#49548;] &#54596;&#46300;&#50640; JMX &#52964;&#45349;&#53552; &#49436;&#48260; &#49828;&#53569;&#51060; &#46321;&#47197;&#46108; &#51060;&#47492; &#51648;&#51221; &#49436;&#48708;&#49828;&#51032; IP &#51452;&#49548;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#51060;&#45716; &#49892;&#51228; JMX &#53685;&#49888;&#51012; &#49688;&#54665;&#54616;&#45716; &#49436;&#48260; &#49548;&#53011;&#51032; &#54252;&#53944;&#44032; &#50500;&#45785;&#45768;&#45796;. RMI &#47112;&#51648;&#49828;&#53944;&#47532;&#44032; &#49884;&#51089;&#46104;&#45716; &#45348;&#53944;&#50892;&#53356; &#51064;&#53552;&#54168;&#51060;&#49828;&#51032; &#51452;&#49548;&#51077;&#45768;&#45796;. &#49884;&#49828;&#53596;&#50640; &#50668;&#47084; &#44060;&#51032; &#45348;&#53944;&#50892;&#53356; &#51064;&#53552;&#54168;&#51060;&#49828;&#44032; &#51080;&#45716; &#44221;&#50864; &#53945;&#51221; &#51064;&#53552;&#54168;&#51060;&#49828;&#47564; &#49440;&#53469;&#46104;&#46020;&#47197; &#51060; &#44050;&#51012; &#49688;&#51221;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>0.0.0.0</code>&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#54252;&#53944;] &#54596;&#46300;&#50640; &#51060;&#47492; &#51648;&#51221; &#49436;&#48708;&#49828;(RMI &#47112;&#51648;&#49828;&#53944;&#47532;)&#44032; RMI &#53364;&#46972;&#51060;&#50616;&#53944; &#51217;&#49549;&#51012; &#49688;&#49888;&#54616;&#45716; &#54252;&#53944; &#48264;&#54840;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#51060;&#47492; &#51648;&#51221; &#49436;&#48708;&#49828;&#45716; RMI &#49828;&#53569;&#51012; &#45796;&#50868;&#47196;&#46300;&#54616;&#45716; &#45936;&#47564; &#49324;&#50857;&#54633;&#45768;&#45796;. &#44592;&#48376; &#54252;&#53944;&#44032; &#49324;&#50857; &#51473;&#51064; &#44221;&#50864; &#48712; &#54252;&#53944;&#44032; &#49324;&#50857;&#46121;&#45768;&#45796;. &#50976;&#54952;&#54620; &#44050;&#51008; 1 - 65535&#51077;&#45768;&#45796;. UNIX &#49884;&#49828;&#53596;&#50640;&#49436; 1 - 1024 &#54252;&#53944;&#47484; &#49688;&#49888;&#54616;&#45716; &#49548;&#53011;&#51012; &#49373;&#49457;&#54616;&#47140;&#47732; &#49688;&#54140;&#50976;&#51200; &#44428;&#54620;&#51060; &#54596;&#50836;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 8686&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#50689;&#50669; &#51060;&#47492;] &#54596;&#46300;&#50640; &#53945;&#48324; &#44288;&#47532; &#50689;&#50669;&#51012; &#45208;&#53440;&#45236;&#45716; &#51060;&#47492;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#47784;&#46304; &#51064;&#51613;&#51060; &#51060; &#50689;&#50669;&#50640; &#51032;&#54644; &#52376;&#47532;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>admin-realm</code>&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#52628;&#44032; &#49549;&#49457;] &#49465;&#49496;&#50640;&#49436; &#52628;&#44032; &#49549;&#49457;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<p>GlassFish Server&#50640;&#49436;&#45716; &#44592;&#48376;&#51201;&#51004;&#47196; &#47751; &#44060;&#51032; &#49549;&#49457;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#49549;&#49457;&#51012; &#52628;&#44032;&#54616;&#47140;&#47732; [&#49549;&#49457; &#52628;&#44032;] &#45800;&#52628;&#47484; &#45572;&#47493;&#45768;&#45796;. &#48712; &#54665;&#51060; &#54364;&#49884;&#46104;&#47732; [&#51060;&#47492;] &#54596;&#46300;&#50640; &#49549;&#49457; &#51060;&#47492;&#51012; &#51077;&#47141;&#54616;&#44256; [&#44050;] &#54596;&#46300;&#50640; &#49549;&#49457;&#44050;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#49549;&#49457;&#51012; &#49688;&#51221;&#54616;&#47140;&#47732; &#49549;&#49457;&#51032; [&#44050;] &#54596;&#46300;&#47484; &#54200;&#51665;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#49549;&#49457;&#51012; &#49325;&#51228;&#54616;&#47140;&#47732; &#49325;&#51228;&#54624; &#49549;&#49457;&#51032; [&#51060;&#47492;] &#54596;&#46300; &#50812;&#51901;&#50640; &#51080;&#45716; &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54620; &#45796;&#51020; [&#49549;&#49457; &#49325;&#51228;] &#45800;&#52628;&#47484; &#45572;&#47493;&#45768;&#45796;.</p>
</li>
</ul>
</li>
<li>
<p>[&#51200;&#51109;]&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#48372;&#50504; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54620; &#44221;&#50864; <a href="task-jmxconnectorssledit.html">JMX &#52964;&#45349;&#53552;&#51032; SSL &#49444;&#51221;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a>&#51032; &#45800;&#44228;&#47484; &#46384;&#47493;&#45768;&#45796;.</p>
</li>
</ol>
<a id="GHCOM320" name="GHCOM320"></a>
<h5>&#44288;&#47144; &#54637;&#47785;</h5>
<p><a href="task-jmxconnectorssledit.html">JMX &#52964;&#45349;&#53552;&#51032; SSL &#49444;&#51221;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
