<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-enablemesec4appclients" name="task-enablemesec4appclients"></a></p>

<h4><a id="sthref186" name="sthref186"></a>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#53364;&#46972;&#51060;&#50616;&#53944;&#50640; &#45824;&#54644; &#47700;&#49884;&#51648; &#48372;&#50504;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#53364;&#46972;&#51060;&#50616;&#53944; &#51228;&#44277;&#51088;&#50640;&#45716; &#51060;&#50752; &#49345;&#54840; &#51089;&#50857;&#51012; &#54616;&#45716; &#49436;&#48260;&#52769; &#51228;&#44277;&#51088;&#50752; &#46041;&#51068;&#54620; &#47700;&#49884;&#51648; &#48372;&#54840; &#51221;&#52293;&#51060; &#51080;&#50612;&#50556; &#54633;&#45768;&#45796;. GlassFish Server&#44032; &#49444;&#52824;&#46112; &#46412; &#44396;&#49457;&#46104;&#50632;&#51648;&#47564; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#51648; &#50506;&#51008; &#51228;&#44277;&#51088;&#51032; &#44221;&#50864; &#51060;&#48120; &#51060; &#49345;&#53468;&#47196; &#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#53364;&#46972;&#51060;&#50616;&#53944;&#50640; &#45824;&#54620; &#47700;&#49884;&#51648; &#48372;&#50504;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47140;&#47732; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#53364;&#46972;&#51060;&#50616;&#53944; &#52968;&#53580;&#51060;&#45320;&#51032; GlassFish Server &#44288;&#47144; &#44396;&#49457;&#51012; &#49688;&#51221;&#54633;&#45768;&#45796;.</p>
<ol>
<li>
<p>&#53364;&#46972;&#51060;&#50616;&#53944; &#52968;&#53580;&#51060;&#45320; &#44592;&#49696;&#51088;&#50640; &#46384;&#47480; &#53364;&#46972;&#51060;&#50616;&#53944; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#51221;&#51648;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#53581;&#49828;&#53944; &#54200;&#51665;&#44592;&#50640;&#49436; domain-dir<code>/config/sun-acc.xml.</code>&#50640; &#51080;&#45716; Sun &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#53364;&#46972;&#51060;&#50616;&#53944; &#52968;&#53580;&#51060;&#45320; &#44592;&#49696;&#51088;&#47484; &#50685;&#45768;&#45796;.</p>
</li>
<li>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#53364;&#46972;&#51060;&#50616;&#53944;&#51032; &#44592;&#48376; &#53364;&#46972;&#51060;&#50616;&#53944; &#51228;&#44277;&#51088;&#47484; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47140;&#47732; <code>default-client-provider</code> &#49549;&#49457;&#51012; <code>message-security-config</code> &#50836;&#49548;&#50640; &#52628;&#44032;&#54633;&#45768;&#45796;.</p>
<p>&#51452;&#50948; &#53076;&#46300;&#44032; &#52968;&#53581;&#49828;&#53944;&#50640; &#54364;&#49884;&#46104;&#47728; &#51060;&#45716; &#49444;&#52824; &#49884;&#50752; &#51312;&#44552; &#45796;&#47484; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060;&#44163;&#51012; &#48320;&#44221;&#54616;&#51648; &#47560;&#49901;&#49884;&#50724;.</p>
<pre>
&lt;client-container&gt;
  &lt;target-server name="<i>your-host</i>" address="<i>your-host</i>"
      port="<i>your-port</i>"
  &lt;log-service file="" level="WARNING"
  &lt;message-security-config auth-layer="SOAP"
      <b>default-client-provider="ClientProvider"</b>&gt;
    &lt;provider-config
        class-name="com.sun.enterprise.security.jauth.ClientAuthModule"
        provider-id="clientprovider" provider-type="client"&gt;
      &lt;request-policy auth-source="sender"
      &lt;response-policy
        &lt;property name="security.config"
          value="C:/Sun/AppServer/lib/appclient/wss-client-config.xml"
    &lt;/provider-config&gt;
  &lt;/message-security-config&gt;
&lt;/client-container&gt;
</pre>
<p>&#53364;&#46972;&#51060;&#50616;&#53944; &#52968;&#53580;&#51060;&#45320;&#50640; &#44396;&#49457;&#46108; &#47700;&#49884;&#51648; &#48372;&#50504; &#51228;&#44277;&#51088;&#45716; &#51204;&#50857; &#53412;&#50752; &#49888;&#47280;&#54624; &#49688; &#51080;&#45716; &#51064;&#51613;&#49436;&#50640; &#50529;&#49464;&#49828;&#54624; &#49688; &#51080;&#50612;&#50556; &#54633;&#45768;&#45796;. &#50668;&#44592;&#50640; &#50529;&#49464;&#49828; &#44428;&#54620;&#51012; &#48512;&#50668;&#54616;&#47140;&#47732; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#53364;&#46972;&#51060;&#50616;&#53944; &#49884;&#51089; &#49828;&#53356;&#47549;&#53944;&#50640;&#49436; &#45796;&#51020; &#49884;&#49828;&#53596; &#49549;&#49457;&#44050;&#51012; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
<pre>
-Djavax.net.ssl.keyStore

-Djavax.net.ssl.trustStore
</pre></li>
</ol>
<a id="sthref187" name="sthref187"></a>
<h5>&#44288;&#47144; &#54637;&#47785;</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">&#47700;&#49884;&#51648; &#48372;&#50504; &#51228;&#44277;&#51088;&#44032; &#49324;&#50857;&#54616;&#46020;&#47197; GlassFish Server &#44592;&#45733;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">&#47700;&#49884;&#51648; &#48372;&#50504; &#44396;&#49457;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">&#47700;&#49884;&#51648; &#48372;&#50504; &#44396;&#49457;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">&#47700;&#49884;&#51648; &#48372;&#50504; &#44396;&#49457;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">&#47700;&#49884;&#51648; &#48372;&#50504; &#51228;&#44277;&#51088; &#44396;&#49457;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">&#47700;&#49884;&#51648; &#48372;&#50504; &#51228;&#44277;&#51088; &#44396;&#49457;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">&#47700;&#49884;&#51648; &#48372;&#50504; &#51228;&#44277;&#51088; &#44396;&#49457;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
