<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-appdeployclient" name="task-appdeployclient"></a></p>

<h4><a id="sthref59" name="sthref59"></a><a id="sthref60" name="sthref60"></a><a id="sthref61" name="sthref61"></a>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#53364;&#46972;&#51060;&#50616;&#53944;&#47484; &#48176;&#52824;&#54616;&#45716; &#48169;&#48277;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#53456;&#49353; &#53944;&#47532;&#50640;&#49436; [&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;] &#45432;&#46300;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>[&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;] &#53580;&#51060;&#48660;&#50640;&#49436; [&#48176;&#52824;] &#45800;&#52628;&#47484; &#45572;&#47493;&#45768;&#45796;.</p>
<p>[&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#46608;&#45716; &#47784;&#46280; &#48176;&#52824;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>&#48176;&#52824;&#54624; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51032; &#50948;&#52824;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#53364;&#46972;&#51060;&#50616;&#53944; &#49884;&#49828;&#53596;&#50640; &#51080;&#44144;&#45208; &#53364;&#46972;&#51060;&#50616;&#53944; &#49884;&#49828;&#53596;&#50640;&#49436; &#50529;&#49464;&#49828; &#44032;&#45733;&#54620; &#50500;&#52852;&#51060;&#48652; &#54028;&#51068;&#51064; &#44221;&#50864; [&#49436;&#48260;&#50640; &#50629;&#47196;&#46300;&#54624; &#54056;&#53412;&#51648;&#54868;&#46108; &#54028;&#51068;] &#50741;&#49496;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#53364;&#46972;&#51060;&#50616;&#53944; &#49884;&#49828;&#53596;&#51008; &#48652;&#46972;&#50864;&#51200;&#47484; &#53685;&#54644; &#44288;&#47532; &#53080;&#49556;&#51012; &#48372;&#45716; &#54840;&#49828;&#53944;&#51077;&#45768;&#45796;.</p>
<p>[&#52286;&#50500;&#48372;&#44592;]&#47484; &#45580;&#47084; &#54028;&#51068;&#51012; &#52286;&#44144;&#45208;, &#54028;&#51068;&#51032; &#51204;&#52404; &#44221;&#47196;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#49436;&#48260; &#49884;&#49828;&#53596;&#50640; &#51080;&#45716; &#50500;&#52852;&#51060;&#48652; &#54028;&#51068;&#51060;&#44144;&#45208; &#54869;&#51109;&#46108; &#46356;&#47113;&#53664;&#47532;&#50640;&#49436; &#50517;&#52629; &#54644;&#51228;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51064; &#44221;&#50864;, [GlassFish Server&#50640;&#49436; &#50529;&#49464;&#49828;&#54624; &#49688; &#51080;&#45716; &#54056;&#53412;&#51648;&#54868;&#46108; &#47196;&#52972; &#54028;&#51068; &#46608;&#45716; &#46356;&#47113;&#53664;&#47532;] &#50741;&#49496;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#49436;&#48260; &#49884;&#49828;&#53596;&#51008; &#46020;&#47700;&#51064; &#44288;&#47532; &#49436;&#48260;(Domain Administration, DAS)&#47484; &#49892;&#54665;&#54616;&#45716; &#54840;&#49828;&#53944;&#51077;&#45768;&#45796;.</p>
<p>[&#54028;&#51068; &#52286;&#50500;&#48372;&#44592;]&#47484; &#45580;&#47084; &#54028;&#51068;&#51012; &#52286;&#50500;&#48372;&#44144;&#45208; [&#54260;&#45908; &#52286;&#50500;&#48372;&#44592;]&#47484; &#45580;&#47084; &#46356;&#47113;&#53664;&#47532;&#47484; &#52286;&#50500;&#48389;&#45768;&#45796;. &#46608;&#45716; &#54028;&#51068; &#46608;&#45716; &#46356;&#47113;&#53664;&#47532;&#51032; &#51204;&#52404; &#44221;&#47196; &#51060;&#47492;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;. &#54869;&#51109;&#46108; &#46356;&#47113;&#53664;&#47532;&#50640;&#49436; &#48176;&#52824;&#54616;&#45716; &#44163;&#51008; &#44256;&#44553; &#44060;&#48156;&#51088; &#51089;&#50629;&#51060;&#48064;&#47196; &#50868;&#50857; &#54872;&#44221;&#50640;&#45716; &#44428;&#51109;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</li>
</ul>
</li>
<li>
<p>[&#50976;&#54805;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; [&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#53364;&#46972;&#51060;&#50616;&#53944;]&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>[&#49436;&#48260;&#50640; &#50629;&#47196;&#46300;&#54624; &#54056;&#53412;&#51648;&#54868;&#46108; &#54028;&#51068;] &#46608;&#45716; [GlassFish Server&#50640;&#49436; &#50529;&#49464;&#49828;&#54624; &#49688; &#51080;&#45716; &#47196;&#52972; &#54056;&#53412;&#51648;&#54868;&#46108; &#54028;&#51068;]&#51012; &#51648;&#51221;&#54620; &#44221;&#50864;&#50640;&#45716; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#50976;&#54805;&#51060; &#51088;&#46041;&#51004;&#47196; &#44048;&#51648;&#46121;&#45768;&#45796;. GlassFish Server&#50640;&#49436; &#50529;&#49464;&#49828;&#54624; &#49688; &#51080;&#45716; &#46356;&#47113;&#53664;&#47532;&#47484; &#51648;&#51221;&#54620; &#44221;&#50864;&#50640;&#45716; &#50976;&#54805;&#51012; &#49688;&#46041;&#51004;&#47196; &#51648;&#51221;&#54644;&#50556; &#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#51060;&#47492;] &#54596;&#46300;&#50640; &#46356;&#47113;&#53664;&#47532; &#51060;&#47492; &#46608;&#45716; &#54028;&#51068; &#51060;&#47492;&#51032; &#51217;&#46160;&#50612;&#51064; &#44592;&#48376; &#51060;&#47492;&#51012; &#50976;&#51648;&#54616;&#44144;&#45208; &#45796;&#47480; &#51060;&#47492;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#54028;&#51068; &#50629;&#47196;&#46300;&#47484; &#49440;&#53469;&#54620; &#44221;&#50864;&#50640;&#45716; &#44592;&#48376; &#51060;&#47492;&#51060; &#45208;&#53440;&#45225;&#45768;&#45796;. &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#51060;&#47492;&#51008; &#44256;&#50976;&#54644;&#50556; &#54633;&#45768;&#45796;.</p>
<p>&#51060;&#47492;&#50640;&#45716; &#48260;&#51204; &#49885;&#48324;&#51088;(&#50741;&#49496;)&#44032; &#54252;&#54632;&#46112; &#49688; &#51080;&#51004;&#47728;, &#51060; &#49885;&#48324;&#51088;&#45716; &#51060;&#47492; &#45796;&#51020;&#50640; &#50724;&#44256; &#53084;&#47200;(<code>:</code>)&#51004;&#47196; &#51060;&#47492;&#44284; &#44396;&#48516;&#46121;&#45768;&#45796;. &#48260;&#51204; &#49885;&#48324;&#51088;&#45716; &#47928;&#51088; &#46608;&#45716; &#49707;&#51088;&#47196; &#49884;&#51089;&#54644;&#50556; &#54633;&#45768;&#45796;. &#50689;&#49707;&#51088; &#47928;&#51088;&#50752; &#48145;&#51460;(<code>_</code>), &#45824;&#49884;(<code>-</code>) &#48143; &#47560;&#52840;&#54364;(<code>.</code>) &#47928;&#51088;&#44032; &#49324;&#50857;&#46112; &#49688; &#51080;&#49845;&#45768;&#45796;. &#47784;&#46280; &#48143; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#48260;&#51204;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Oracle GlassFish Server Application Deployment Guide</i>&#51032; <i>Module and Application Versions</i></a>&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</li>
<li>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#53364;&#46972;&#51060;&#50616;&#53944; &#47784;&#46280;&#50640; &#45824;&#54620; Java Web Start &#50529;&#49464;&#49828;&#47484; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47140;&#47732; [Java Web Start] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>&#48176;&#52824; &#51204;&#50640; &#48176;&#52824; &#44592;&#49696;&#51088;&#47484; &#54869;&#51064;&#54616;&#47140;&#47732; [&#44160;&#51613;&#51088; &#49892;&#54665;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; &#44160;&#51613;&#50640; &#49892;&#54056;&#54616;&#45716; &#44221;&#50864; &#48176;&#52824;&#44032; &#49688;&#54665;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;. &#44160;&#51613;&#51088;&#45716; &#48176;&#52824; &#44592;&#49696;&#51088;&#51032; &#44396;&#51312;&#50752; &#45236;&#50857;&#51012; &#44160;&#49324;&#54633;&#45768;&#45796;. &#53360; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51032; &#44160;&#51613;&#50640;&#45716; &#47566;&#51008; &#49884;&#44036;&#51060; &#44152;&#47540; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#50629;&#45936;&#51060;&#53944; &#53812;&#50640;&#49436; &#44160;&#51613;&#51088; &#54056;&#53412;&#51648;&#47484; &#49444;&#52824;&#54644;&#50556; &#54633;&#45768;&#45796;. &#44536;&#47111;&#51648; &#50506;&#51004;&#47732; &#44221;&#44256;&#44032; &#44592;&#47197;&#46104;&#44256; &#51060; &#50741;&#49496;&#51060; &#47924;&#49884;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#51060;&#48120; &#48176;&#52824;&#46108; &#44221;&#50864; &#44053;&#51228;&#47196; &#51116;&#48176;&#52824;&#54616;&#47140;&#47732; [&#51116;&#48176;&#52824; &#44053;&#51228; &#51201;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#51648; &#50506;&#51004;&#47732; &#51060;&#48120; &#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#45824;&#54620; &#48176;&#52824; &#49884;&#46020;&#50640;&#49436; &#50724;&#47448;&#44032; &#48156;&#49373;&#54633;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#48176;&#52824; &#49692;&#49436;] &#54596;&#46300;&#50640; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51032; &#48176;&#52824; &#49692;&#49436;&#47484; &#51648;&#51221;&#54616;&#45716; &#49707;&#51088;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#49436;&#48260; &#49884;&#51089; &#49884; &#45230;&#51008; &#48264;&#54840;&#51032; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#48512;&#53552; &#47196;&#46300;&#46121;&#45768;&#45796;. &#46384;&#46972;&#49436; &#48176;&#52824; &#49692;&#49436;&#44032; 102&#51064; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51008; &#48176;&#52824; &#49692;&#49436;&#44032; 110&#51064; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#48372;&#45796; &#47676;&#51200; &#47196;&#46300;&#46121;&#45768;&#45796;. &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#48176;&#52824; &#49884; &#48176;&#52824; &#49692;&#49436;&#44032; &#51648;&#51221;&#46104;&#51648; &#50506;&#51008; &#44221;&#50864; &#44592;&#48376; &#48176;&#52824; &#49692;&#49436;&#44032; 100&#51060; &#51648;&#51221;&#46121;&#45768;&#45796;. &#46160; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51032; &#48176;&#52824; &#49692;&#49436;&#44032; &#44057;&#51012; &#44221;&#50864; &#47676;&#51200; &#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#47676;&#51200; &#47196;&#46300;&#46121;&#45768;&#45796;. &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#51333;&#49549; &#54637;&#47785;&#51060; &#51080;&#44256; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#53945;&#51221; &#49692;&#49436;&#47196; &#47196;&#46300;&#54644;&#50556; &#54616;&#45716; &#44221;&#50864; &#48176;&#52824; &#49692;&#49436;&#47484; &#51648;&#51221;&#54616;&#45716; &#44163;&#51060; &#51339;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#49444;&#47749;] &#54596;&#46300;&#50640; &#51060; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51032; &#49444;&#47749;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#47784;&#46280;&#51060;&#45208; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#48176;&#52824;&#54624; &#45824;&#49345; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#50752; &#53364;&#47084;&#49828;&#53552;&#47484; &#52628;&#44032;&#54616;&#47140;&#47732; [&#49324;&#50857; &#44032;&#45733;&#54620; &#45824;&#49345;] &#47785;&#47197;&#50640;&#49436; &#54644;&#45817; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#50752; &#53364;&#47084;&#49828;&#53552;&#47484; &#49440;&#53469;&#54620; &#45796;&#51020; [&#52628;&#44032;] &#45800;&#52628;&#47484; &#49324;&#50857;&#54616;&#50668; [&#49440;&#53469;&#54620; &#45824;&#49345;] &#47785;&#47197;&#51004;&#47196; &#51060;&#46041;&#54633;&#45768;&#45796;.</p>
<p>[&#45824;&#49345;] &#50741;&#49496;&#51008; &#44592;&#48376; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;(<code>server</code>) &#50808;&#50640; &#53364;&#47084;&#49828;&#53552; &#46608;&#45716; &#46021;&#47549;&#54805; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#44032; &#51080;&#45716; &#44221;&#50864;&#50640; &#54364;&#49884;&#46121;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; &#47784;&#46280;&#51060;&#45208; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51008; <code>server</code>&#46972;&#45716; &#44592;&#48376; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#50640; &#48176;&#52824;&#46121;&#45768;&#45796;. &#47784;&#46304; &#45824;&#49345;&#50640; &#48176;&#52824;&#54616;&#47140;&#47732; [&#47784;&#46160; &#52628;&#44032;] &#45800;&#52628;&#47484; &#49324;&#50857;&#54633;&#45768;&#45796;. [&#49440;&#53469;&#54620; &#45824;&#49345;] &#47785;&#47197;&#50640;&#49436; &#45824;&#49345;&#51012; &#51228;&#44144;&#54616;&#47140;&#47732; [&#51228;&#44144;] &#48143; [&#47784;&#46160; &#51228;&#44144;] &#45800;&#52628;&#47484; &#49324;&#50857;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#54869;&#51064;]&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
</li>
</ol>
<a id="sthref62" name="sthref62"></a>
<h5>&#44288;&#47144; &#54637;&#47785;</h5>
<ul>
<li>
<p><a href="task-applistdeployed.html">&#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#47785;&#47197;&#51012; &#48372;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">&#50937; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#48176;&#52824;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">&#50644;&#53552;&#54532;&#46972;&#51060;&#51592; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#48176;&#52824;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">&#52964;&#45349;&#53552; &#47784;&#46280;&#51012; &#48176;&#52824;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">EJB Jar&#47484; &#48176;&#52824;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-appedit.html">&#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#44592;&#49696;&#51088;&#47484; &#48372;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-endpoint.html">&#50937; &#49436;&#48708;&#49828;&#50640; &#45824;&#54620; &#45149;&#51216; &#51221;&#48372;&#47484; &#48372;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-applaunch.html">&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#49892;&#54665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#53364;&#46972;&#51060;&#50616;&#53944;&#47484; &#49892;&#54665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#53364;&#46972;&#51060;&#50616;&#53944; &#49828;&#53569;&#51012; &#45796;&#50868;&#47196;&#46300;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-appredeploy.html">&#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#51116;&#48176;&#52824;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-apprestart.html">&#48176;&#52824;&#46108; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#45796;&#49884; &#47196;&#46300;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#48276;&#50948; &#47532;&#49548;&#49828;&#47484; &#54869;&#51064;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#48276;&#50948; &#47532;&#49548;&#49828;&#47484; &#49688;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
