<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-confmonitor" name="task-confmonitor"></a></p>

<h4><a id="sthref114" name="sthref114"></a>&#47784;&#45768;&#53552;&#47553; &#49436;&#48708;&#49828;&#47484; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>[&#47784;&#45768;&#53552;&#47553; &#49436;&#48708;&#49828;] &#54168;&#51060;&#51648;&#47484; &#50676;&#47140;&#47732; &#45796;&#51020; &#51473; &#54616;&#45208;&#47484; &#49688;&#54665;&#54633;&#45768;&#45796;.</p>
<ul>
<li>
<p>[&#47784;&#45768;&#53552;&#47553; &#45936;&#51060;&#53552;] &#45432;&#46300;&#47484; &#49440;&#53469;&#54620; &#45796;&#51020; &#47784;&#45768;&#53552;&#47553;&#51012; &#44396;&#49457;&#54624; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54620; [&#47784;&#45768;&#53552;&#47553; &#44396;&#49457;] &#47553;&#53356;&#47484; &#45572;&#47493;&#45768;&#45796;. &#53364;&#47084;&#49828;&#53552;&#50640; &#45824;&#54620; &#47784;&#45768;&#53552;&#47553;&#51012; &#44396;&#49457;&#54616;&#47140;&#47732; &#53364;&#47084;&#49828;&#53552;&#50640; &#51080;&#45716; &#51064;&#49828;&#53556;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</li>
</ul>
<ul>
<li>
<p>[&#44396;&#49457;] &#45432;&#46300;&#50640;&#49436; &#47784;&#45768;&#53552;&#47553;&#51012; &#44396;&#49457;&#54624; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#45208; &#53364;&#47084;&#49828;&#53552; &#44396;&#49457;&#51012; &#54869;&#51109;&#54620; &#45796;&#51020; [&#47784;&#45768;&#53552;&#47553;] &#45432;&#46300;&#47484; &#54869;&#51109;&#54633;&#45768;&#45796;.</p>
</li>
</ul>
<p>[&#47784;&#45768;&#53552;&#47553; &#49436;&#48708;&#49828;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#47784;&#45768;&#53552;&#47553; &#49436;&#48708;&#49828; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#50668; GlassFish Server&#50640; &#45824;&#54620; &#47784;&#45768;&#53552;&#47553;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#44144;&#45208;, &#51060; &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469; &#54644;&#51228;&#54616;&#50668; &#47784;&#45768;&#53552;&#47553;&#51012; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[MBean &#47784;&#45768;&#53552;&#47553; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#50668; &#47784;&#45768;&#53552;&#47553;&#50640; &#54596;&#50836;&#54620; &#47784;&#46304; MBean&#51012; &#48176;&#52824;&#54616;&#44144;&#45208;, &#51060; &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469; &#54644;&#51228;&#54616;&#50668; &#51060; MBean&#51032; &#48176;&#52824;&#47484; &#52712;&#49548;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#51060; &#52404;&#53356; &#48149;&#49828;&#44032; &#49440;&#53469;&#46104;&#50612; &#51080;&#51648; &#50506;&#51004;&#47732; [&#47784;&#45768;&#53552;&#47553; &#49436;&#48708;&#49828;] &#52404;&#53356; &#48149;&#49828;&#44032; &#49440;&#53469;&#46104;&#50612; &#51080;&#50612;&#46020; &#44288;&#47532; &#53080;&#49556;&#50640;&#49436; &#47784;&#45768;&#53552;&#47553; &#45936;&#51060;&#53552;&#47484; &#48380; &#49688; &#50630;&#49845;&#45768;&#45796;. &#47784;&#45768;&#53552;&#47553; &#45936;&#51060;&#53552;&#47484; &#48372;&#47140;&#47732; &#47749;&#47161;&#54665;&#51012; &#49324;&#50857;&#54644;&#50556; &#54633;&#45768;&#45796;. &#52404;&#53356; &#48149;&#49828; &#49440;&#53469;&#51012; &#54644;&#51228;&#54616;&#47732; GlassFish Server&#51032; &#47700;&#47784;&#47532; &#48276;&#50948;&#44032; &#51460;&#50612;&#46317;&#45768;&#45796;.</p>
</li>
<li>
<p>Solaris DTrace &#44592;&#45733;&#51012; &#49324;&#50857;&#54616;&#46020;&#47197; &#49444;&#51221;&#54616;&#47140;&#47732; [DTrace &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>Solaris DTrace &#44592;&#45733;&#51012; &#49324;&#50857;&#54616;&#47140;&#47732; Oracle Enterprise Manager DTrace Monitoring&#46020; &#51080;&#50612;&#50556; &#54633;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>&#53580;&#51060;&#48660;&#50640;&#49436; &#45796;&#51020; &#51089;&#50629; &#51473; &#54616;&#45208;&#47484; &#49688;&#54665;&#54633;&#45768;&#45796;.</p>
<ul>
<li>
<p>[&#47784;&#45768;&#53552;&#47553; &#47112;&#48296;] &#50676;&#50640;&#49436; &#44396;&#49457; &#50836;&#49548; &#50676;&#51032; &#54616;&#45208; &#51060;&#49345;&#51032; &#44396;&#49457; &#50836;&#49548;&#50640; &#45824;&#54620; &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; LOW &#46608;&#45716; HIGH&#47484; &#49440;&#53469;&#54616;&#50668; &#54644;&#45817; &#44396;&#49457; &#50836;&#49548;&#50640; &#45824;&#54620; &#47784;&#45768;&#53552;&#47553;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#54616;&#45208; &#51060;&#49345;&#51032; &#44396;&#49457; &#50836;&#49548; &#50694;&#50640; &#51080;&#45716; &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54620; &#45796;&#51020; &#53580;&#51060;&#48660; &#47592; &#50948;&#51032; &#47112;&#48296; &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; LOW &#46608;&#45716; HIGH&#47484; &#49440;&#53469;&#54616;&#44256; [&#47112;&#48296; &#48320;&#44221;] &#45800;&#52628;&#47484; &#45580;&#47084; &#54644;&#45817; &#44396;&#49457; &#50836;&#49548; &#47784;&#46160;&#50640; &#45824;&#54644; &#47784;&#45768;&#53552;&#47553; &#47112;&#48296;&#51012; &#51060; &#44050;&#51004;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
</li>
</ul>
<p>&#51060; &#47540;&#47532;&#49828;&#50640;&#49436;&#45716; LOW &#48143; HIGH &#50741;&#49496;&#50640;&#49436; &#51228;&#44277;&#46104;&#45716; &#47784;&#45768;&#53552;&#47553; &#47112;&#48296; &#44036;&#50640; &#52264;&#51060;&#44032; &#50630;&#49845;&#45768;&#45796;. &#54616;&#45208; &#51060;&#49345;&#51032; &#44396;&#49457; &#50836;&#49548;&#50640; &#45824;&#54620; &#47784;&#45768;&#53552;&#47553;&#51012; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54616;&#47140;&#47732; OFF&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; OFF&#51077;&#45768;&#45796;.</p>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;, &#44396;&#49457; &#50836;&#49548; &#46608;&#45716; &#49436;&#48708;&#49828;&#50640; &#45824;&#54620; &#47784;&#45768;&#53552;&#47553;&#51012; &#44396;&#49457;&#54616;&#47140;&#47732; &#47676;&#51200; &#48176;&#52824;&#54644;&#50556; &#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51200;&#51109;]&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
</li>
</ol>
<a id="GHCOM324" name="GHCOM324"></a>
<h5>&#44288;&#47144; &#54637;&#47785;</h5>
<ul>
<li>
<p><a href="task-appmonitoringdata.html">&#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#47784;&#45768;&#53552;&#47553; &#45936;&#51060;&#53552;&#47484; &#48372;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-servermonitoringdata.html">&#49436;&#48260; &#47784;&#45768;&#53552;&#47553; &#45936;&#51060;&#53552;&#47484; &#48372;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-resourcemonitoringdata.html">&#47532;&#49548;&#49828; &#47784;&#45768;&#53552;&#47553; &#45936;&#51060;&#53552;&#47484; &#48372;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
