<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-accessadmintools" name="task-accessadmintools"></a></p>

<h4><a id="sthref129" name="sthref129"></a>&#44288;&#47532; &#53812;&#50640; &#50529;&#49464;&#49828; &#44428;&#54620;&#51012; &#48512;&#50668;&#54616;&#45716; &#48169;&#48277;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p><code>asadmin</code> &#44536;&#47353;&#51032; &#49324;&#50857;&#51088;&#47564; &#44288;&#47532; &#53080;&#49556; &#48143; <code>asadmin</code> &#47749;&#47161;&#54665; &#50976;&#54008;&#47532;&#54000;&#50640; &#50529;&#49464;&#49828;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#44288;&#47532; &#53812;&#50640; &#45824;&#54620; &#49324;&#50857;&#51088; &#50529;&#49464;&#49828;&#47484; &#54728;&#50857;&#54616;&#47140;&#47732; &#49324;&#50857;&#51088;&#47484; <code>admin-realm</code>&#51032; <code>asadmin</code> &#44536;&#47353;&#50640; &#52628;&#44032;&#54633;&#45768;&#45796;.</p>
<ol>
<li>
<p>[&#44396;&#49457;] &#45432;&#46300;&#50640;&#49436; &#44288;&#47532; &#44428;&#54620;&#51012; &#44396;&#49457;&#54624; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#45208; &#53364;&#47084;&#49828;&#53552; &#44396;&#49457;&#51012; &#54869;&#51109;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#48372;&#50504;] &#45432;&#46300;&#47484; &#54869;&#51109;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#50689;&#50669;] &#45432;&#46300;&#47484; &#54869;&#51109;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p><code>admin-realm</code> &#45432;&#46300;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>[&#50689;&#50669; &#54200;&#51665;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#50689;&#50669; &#54200;&#51665;] &#54168;&#51060;&#51648;&#50640;&#49436; [&#49324;&#50857;&#51088; &#44288;&#47532;] &#45800;&#52628;&#47484; &#45572;&#47493;&#45768;&#45796;.</p>
<p>[&#44288;&#47532; &#49324;&#50857;&#51088;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
<p>&#49444;&#52824; &#54980; &#52376;&#51020;&#50640;&#45716; &#49444;&#52824; &#49884; &#51077;&#47141;&#54620; &#44288;&#47532;&#51088; &#51060;&#47492; &#48143; &#48708;&#48128;&#48264;&#54840;&#44032; <code>admin-keyfile</code> &#54028;&#51068;&#50640; &#45208;&#50676;&#46121;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; &#51060; &#49324;&#50857;&#51088;&#45716; GlassFish Server&#47484; &#49688;&#51221;&#54624; &#49688; &#51080;&#45716; &#44428;&#54620;&#51012; &#48512;&#50668;&#54616;&#45716; <code>asadmin</code> &#44536;&#47353;&#50640; &#49549;&#54633;&#45768;&#45796;. &#49324;&#50857;&#51088;&#50640;&#44172; &#49440;&#53469;&#54620; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#45208; &#53364;&#47084;&#49828;&#53552;&#50640; &#45824;&#54620; &#44288;&#47532;&#51088; &#44428;&#54620;&#51012; &#48512;&#50668;&#54616;&#47140;&#45716; &#44221;&#50864;&#50640;&#47564; &#54644;&#45817; &#49324;&#50857;&#51088;&#47484; &#51060; &#44536;&#47353;&#50640; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<p><code>admin-realm</code> &#50689;&#50669;&#50640; &#49324;&#50857;&#51088;&#47484; &#52628;&#44032;&#54616;&#50688;&#51648;&#47564; &#49324;&#50857;&#51088;&#47484; <code>asadmin</code> &#51060;&#50808;&#51032; &#44536;&#47353;&#50640; &#51648;&#51221;&#54620; &#44221;&#50864;&#50640;&#45716; &#49324;&#50857;&#51088; &#51221;&#48372;&#44032; <code>admin-keyfile</code> &#54028;&#51068;&#50640; &#44536;&#45824;&#47196; &#50976;&#51648;&#46104;&#51648;&#47564; &#49324;&#50857;&#51088;&#50640;&#45716; &#44288;&#47532; &#53812; &#46608;&#45716; <code>file</code> &#50689;&#50669;&#50640; &#51080;&#45716; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#45824;&#54620; &#50529;&#49464;&#49828;&#44032; &#48512;&#50668;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#44288;&#47532; &#49324;&#50857;&#51088;] &#54168;&#51060;&#51648;&#50640;&#49436; [&#49352;&#47196; &#47564;&#46308;&#44592;]&#47484; &#45580;&#47084; &#49352; &#49324;&#50857;&#51088;&#47484; <code>admin-realm</code> &#50689;&#50669;&#50640; &#52628;&#44032;&#54633;&#45768;&#45796;.</p>
<p>[&#49352; &#54028;&#51068; &#50689;&#50669; &#49324;&#50857;&#51088;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#49324;&#50857;&#51088; ID] &#54596;&#46300;&#50640; &#49352; &#49324;&#50857;&#51088; &#51060;&#47492;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#44536;&#47353; &#47785;&#47197;] &#54596;&#46300;&#50640; &#49324;&#50857;&#51088;&#44032; &#49549;&#54620; &#44536;&#47353;&#51032; &#51060;&#47492;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#49324;&#50857;&#51088;&#50640;&#44172; GlassFish Server&#47484; &#49688;&#51221;&#54624; &#49688; &#51080;&#45716; &#44428;&#54620;&#51012; &#48512;&#50668;&#54616;&#47140;&#47732; &#44536;&#47353; &#47785;&#47197;&#50640; <code>asadmin</code> &#44536;&#47353;&#51012; &#54252;&#54632;&#49884;&#53429;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#49352; &#48708;&#48128;&#48264;&#54840;] &#48143; [&#49352; &#48708;&#48128;&#48264;&#54840; &#54869;&#51064;] &#54596;&#46300;&#50640; &#49352; &#49324;&#50857;&#51088;&#51032; &#48708;&#48128;&#48264;&#54840;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#54869;&#51064;]&#51012; &#45580;&#47084; &#51060; &#49324;&#50857;&#51088;&#47484; <code>admin-realm</code> &#50689;&#50669;&#50640; &#52628;&#44032;&#54616;&#44144;&#45208; &#52712;&#49548;&#47484; &#45580;&#47084; &#51200;&#51109;&#54616;&#51648; &#50506;&#44256; &#51333;&#47308;&#54633;&#45768;&#45796;.</p>
</li>
</ol>
<a id="sthref130" name="sthref130"></a>
<h5>&#44288;&#47144; &#54637;&#47785;</h5>
<ul>
<li>
<p><a href="task-securitysettings.html">&#48372;&#50504; &#49444;&#51221;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-changeadminpasswd.html">&#44288;&#47532; &#50689;&#50669;&#50640;&#49436; &#49324;&#50857;&#51088; &#48708;&#48128;&#48264;&#54840;&#47484; &#48320;&#44221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
