<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-securitysettings" name="task-securitysettings"></a><a id="GHCOM00181" name="GHCOM00181"></a></p>

<h4><a id="sthref126" name="sthref126"></a><a id="sthref127" name="sthref127"></a>&#48372;&#50504; &#49444;&#51221;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#44288;&#47532; &#53080;&#49556;&#50640;&#49436;&#45716; &#45796;&#50577;&#54620; &#49884;&#49828;&#53596; &#52264;&#50896;&#51032; &#48372;&#50504; &#49444;&#51221;&#51012; &#44396;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<ol>
<li>
<p>&#53456;&#49353; &#53944;&#47532;&#50640;&#49436; [&#44396;&#49457;] &#45432;&#46300;&#47484; &#54869;&#51109;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#44396;&#49457;] &#45432;&#46300;&#50640;&#49436; &#48372;&#50504; &#49444;&#51221;&#51012; &#44396;&#49457;&#54624; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#45208; &#53364;&#47084;&#49828;&#53552; &#44396;&#49457;&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
<p>[&#44396;&#49457;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#44396;&#49457;] &#54168;&#51060;&#51648;&#50640;&#49436; [&#48372;&#50504;]&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
<p>&#49440;&#53469;&#54620; &#44396;&#49457; &#45824;&#49345;&#50640; &#45824;&#54620; [&#48372;&#50504;] &#49444;&#51221; &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#48372;&#50504; &#44288;&#47532;&#51088; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#50668; &#48372;&#50504; &#44288;&#47532;&#51088;&#47484; &#53037;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; JVM &#50741;&#49496; <code>Djava.security.manager</code>&#44032; GlassFish Server&#51032; JVM &#49444;&#51221;&#50640; &#52628;&#44032;&#46121;&#45768;&#45796;. <a href="task-jvmoptions.html">JVM &#50741;&#49496;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;. &#51060; &#48320;&#44221; &#49324;&#54637;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47140;&#47732; &#49436;&#48260;&#47484; &#51116;&#49884;&#51089;&#54644;&#50556; &#54633;&#45768;&#45796;.</p>
<p>&#47784;&#46304; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#50732;&#48148;&#47480; &#44428;&#54620; &#49444;&#51221;&#51012; &#48512;&#50668;&#54664;&#45716;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;. &#49457;&#45733; &#54693;&#49345;&#51012; &#50948;&#54644; &#48372;&#50504; &#44288;&#47532;&#51088;&#47484; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>&#44048;&#49324; &#47196;&#44613;&#51012; &#53020;&#47140;&#47732; [&#44048;&#49324; &#47196;&#44613; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; &#49436;&#48260;&#44032; [&#44048;&#49324; &#47784;&#46280;] &#47785;&#47197;&#50640;&#49436; &#49440;&#53469;&#54620; &#47784;&#46304; &#44048;&#49324; &#47784;&#46280;&#51012; &#47196;&#46300; &#48143; &#49892;&#54665;&#54633;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51060; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#49436;&#48260;&#44032; &#44048;&#49324; &#47784;&#46280;&#50640; &#50529;&#49464;&#49828;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#44592;&#48376; &#50689;&#50669;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#49436;&#48260;&#44032; &#51064;&#51613;&#51012; &#50948;&#54644; &#49324;&#50857;&#54616;&#45716; &#54876;&#49457; &#50689;&#50669;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#48176;&#52824; &#44592;&#49696;&#51088;&#44032; &#45796;&#47480; &#50689;&#50669;&#51012; &#51648;&#51221;&#54616;&#51648; &#50506;&#45716; &#54620; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51008; &#51060; &#50689;&#50669;&#51012; &#49324;&#50857;&#54633;&#45768;&#45796;. &#44396;&#49457;&#46108; &#47784;&#46304; &#50689;&#50669;&#51060; &#47785;&#47197;&#50640; &#54364;&#49884;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>file</code>&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>&#44592;&#48376; &#51452;&#52404; &#51221;&#48372;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<ol type="a">
<li>
<p>[&#44592;&#48376; &#51452;&#52404;] &#54596;&#46300;&#50640; &#44592;&#48376; &#49324;&#50857;&#51088; &#51060;&#47492;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#45796;&#47480; &#51452;&#52404;&#47484; &#51228;&#44277;&#54616;&#51648; &#50506;&#51012; &#44221;&#50864; &#49436;&#48260;&#45716; &#51060; &#49324;&#50857;&#51088; &#51060;&#47492;&#51012; &#49324;&#50857;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#44592;&#48376; &#51452;&#52404;] &#54596;&#46300;&#50640; &#51648;&#51221;&#46108; &#44592;&#48376; &#51452;&#52404;&#51032; &#48708;&#48128;&#48264;&#54840;&#47484; [&#44592;&#48376; &#51452;&#52404; &#48708;&#48128;&#48264;&#54840;] &#54596;&#46300;&#50640; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
</li>
</ol>
<p>&#51221;&#49345;&#51201;&#51064; &#49436;&#48260; &#51089;&#50629;&#50640;&#45716; &#44592;&#48376; &#51452;&#52404;&#44032; &#54596;&#50836;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>JACC &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#44396;&#49457;&#46108; JACC &#51228;&#44277;&#51088;&#51032; &#51060;&#47492;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376; &#49440;&#53469; &#54637;&#47785;&#51008; <code>default</code> &#48143; <code>simple</code>&#51077;&#45768;&#45796;. &#44592;&#48376; &#50741;&#49496;&#51008; <code>default</code>&#51077;&#45768;&#45796;. &#49352; JACC &#51228;&#44277;&#51088; &#49373;&#49457;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; ***&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</li>
<li>
<p>[&#44048;&#49324; &#47784;&#46280;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#44048;&#49324; &#47196;&#44613;&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#44048;&#49324; &#54616;&#50948; &#49884;&#49828;&#53596;&#51060; &#49324;&#50857;&#54624; &#44048;&#49324; &#51228;&#44277;&#51088; &#47784;&#46280;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#51201;&#51004;&#47196; &#49436;&#48260;&#45716; &#51060;&#47492;&#51060; <code>default</code>&#51064; &#44048;&#49324; &#47784;&#46280;&#51012; &#49324;&#50857;&#54633;&#45768;&#45796;. &#49352; &#44048;&#49324; &#47784;&#46280; &#49373;&#49457;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="task-auditmodulenew.html">&#44048;&#49324; &#47784;&#46280;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</li>
<li>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#48324; &#47588;&#54609;&#51060; &#50630;&#45716; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#51452;&#52404;&#50752; &#47204; &#49324;&#51060;&#51032; &#51452;&#52404; &#47588;&#54609;&#51012; &#51201;&#50857;&#54616;&#47140;&#47732; [&#47204; &#47588;&#54609;&#50640; &#45824;&#54620; &#44592;&#48376; &#51452;&#52404; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#51452;&#52404;&#50752; &#47204; &#49324;&#51060;&#51032; &#51452;&#52404; &#47588;&#54609;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54620; &#44221;&#50864; &#47588;&#54609;&#46108; &#51452;&#52404; &#53364;&#47000;&#49828; &#54596;&#46300;&#50640; &#51452;&#52404;&#50752; &#47204; &#49324;&#51060;&#51032; &#51452;&#52404; &#47588;&#54609;&#50640; &#49324;&#50857;&#46112; &#49324;&#50857;&#51088; &#51221;&#51032;&#46108; <code>java.security.Principal</code> &#44396;&#54788; &#53364;&#47000;&#49828;&#51032; &#51060;&#47492;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#52628;&#44032; &#49549;&#49457;] &#49465;&#49496;&#50640;&#49436; &#52628;&#44032; &#49549;&#49457;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#51201;&#54633;&#54620; &#49549;&#49457;&#51008; &#44592;&#48376; &#50689;&#50669; &#54596;&#46300;&#50640;&#49436; &#49440;&#53469;&#54620; &#50689;&#50669; &#50976;&#54805;&#50640; &#46384;&#46972; &#45804;&#46972;&#51665;&#45768;&#45796;. &#44396;&#49457;&#54624; &#50689;&#50669; &#50976;&#54805;&#50640; &#45824;&#54620; &#45796;&#51020; &#47785;&#47197;&#50640;&#49436; &#54644;&#45817; &#54637;&#47785;&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
<ul>
<li>
<p><a href="ref-editfile-adminrealm.html"><code>FileRealm</code> &#53364;&#47000;&#49828; &#44288;&#47144; &#49549;&#49457;</a></p>
</li>
<li>
<p><a href="ref-editcertrealm.html"><code>CertificateRealm</code> &#53364;&#47000;&#49828; &#44288;&#47144; &#49549;&#49457;</a></p>
</li>
<li>
<p><a href="ref-editjdbcrealm.html"><code>JDBCRealm</code> &#53364;&#47000;&#49828; &#44288;&#47144; &#49549;&#49457;</a></p>
</li>
<li>
<p><a href="ref-ldaprealmprop.html"><code>LDAPRealm</code> &#53364;&#47000;&#49828; &#44288;&#47144; &#49549;&#49457;</a></p>
</li>
<li>
<p><a href="ref-solarisrealmprop.html"><code>SolarisRealm</code> &#53364;&#47000;&#49828; &#44288;&#47144; &#49549;&#49457;</a></p>
</li>
<li>
<p><a href="ref-pamrealmprop.html"><code>PamRealm</code> &#53364;&#47000;&#49828; &#44288;&#47144; &#49549;&#49457;</a></p>
</li>
</ul>
<ul>
<li>
<p>&#49549;&#49457;&#51012; &#52628;&#44032;&#54616;&#47140;&#47732; [&#49549;&#49457; &#52628;&#44032;] &#45800;&#52628;&#47484; &#45572;&#47493;&#45768;&#45796;. &#48712; &#54665;&#51060; &#54364;&#49884;&#46104;&#47732; [&#51060;&#47492;] &#54596;&#46300;&#50640; &#49549;&#49457; &#51060;&#47492;&#51012; &#51077;&#47141;&#54616;&#44256; [&#44050;] &#54596;&#46300;&#50640; &#49549;&#49457;&#44050;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#49549;&#49457;&#51012; &#49688;&#51221;&#54616;&#47140;&#47732; &#49549;&#49457;&#51032; [&#44050;] &#54596;&#46300;&#47484; &#54200;&#51665;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#49549;&#49457;&#51012; &#49325;&#51228;&#54616;&#47140;&#47732; &#49325;&#51228;&#54624; &#49549;&#49457;&#51032; [&#51060;&#47492;] &#54596;&#46300; &#50812;&#51901;&#50640; &#51080;&#45716; &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54620; &#45796;&#51020; [&#49549;&#49457; &#49325;&#51228;] &#45800;&#52628;&#47484; &#45572;&#47493;&#45768;&#45796;.</p>
</li>
</ul>
</li>
<li>
<p>[&#51200;&#51109;]&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
</li>
</ol>
<a id="sthref128" name="sthref128"></a>
<h5>&#44288;&#47144; &#54637;&#47785;</h5>
<ul>
<li>
<p><a href="task-accessadmintools.html">&#44288;&#47532; &#53812;&#50640; &#50529;&#49464;&#49828; &#44428;&#54620;&#51012; &#48512;&#50668;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-changeadminpasswd.html">&#44288;&#47532; &#50689;&#50669;&#50640;&#49436; &#49324;&#50857;&#51088; &#48708;&#48128;&#48264;&#54840;&#47484; &#48320;&#44221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
