<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-transactionservice" name="ref-transactionservice"></a></p>

<h4><a id="sthref14" name="sthref14"></a>Transaktionsservice</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Auf der Seite "Transaktionsservice" k&ouml;nnen Sie Transaktions-Recovery, Timeouts und Logging konfigurieren.</p>
<p>Die Seite "Transaktionsservice" umfasst die folgenden Optionen.</p>
<dl>
<dt>Standardeinstellungen laden</dt>
<dd>
<p>Schaltfl&auml;che zur Wiederherstellung der Standardwerte von Einstellungen, die Standardwerte haben. Einstellungen, die keine Standardwerte haben, werden nicht ge&auml;ndert.</p>
</dd>
<dt>Name der Konfiguration</dt>
<dd>
<p>Der Name der Konfiguration, f&uuml;r die die Einstellungen auf dieser Seite angewendet werden. Dieses Feld ist schreibgesch&uuml;tzt.</p>
</dd>
<dt>Beim Neustart</dt>
<dd>
<p>Wenn das Kontrollk&auml;stchen "Aktiviert" gew&auml;hlt ist, versucht GlassFish Server unvollst&auml;ndige Transaktionen wiederherzustellen, sobald der Server neu gestartet wird. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>Transaktionstimeout</dt>
<dd>
<p>Der Zeitraum (in Sekunden), die der Server wartet, bevor er eine unvollst&auml;ndige Transaktion zur&uuml;cksetzt. Der Standardwert ist 0; das bedeutet, dass es von Seiten des Servers keine Zeitbeschr&auml;nkung f&uuml;r den Abschluss einer Transaktion gibt.</p>
</dd>
<dt>Wiederholungstimeout</dt>
<dd>
<p>Der Zeitraum (in Sekunden), in dem GlassFish Server versucht, eine Verbindung zu einem nicht erreichbaren Server herzustellen. Der Standardwert ist 600 (10 Minuten).</p>
</dd>
<dt>Verzeichnis des Transaktionslogs</dt>
<dd>
<p>Das Verzeichnis, in dem die Serverlogs gespeichert sind. Transaktionslogs werden im Unterverzeichnis <code>tx</code> des Verzeichnisses gespeichert, das in diesem Feld angegeben ist. Der Standardwert ist das Verzeichnis, das auf der Seite "Domainattribute" im Feld "Log-Root" angegeben ist, das sich im Knoten GlassFish Server in der Registerkarte "Erweitert" befindet.</p>
</dd>
<dt>Heuristische Entscheidung</dt>
<dd>
<p>Die Entscheidung, ob Transaktionen, die nicht erreichbare Server betreffen, festgeschrieben oder zur&uuml;ckgesetzt werden. Der Standardwert ist "Zur&uuml;cksetzen". Das Festschreiben unbestimmter Transaktionen kann die Datenintegrit&auml;t Ihrer Anwendung gef&auml;hrden.</p>
</dd>
<dt>Schl&uuml;sselpunktintervall</dt>
<dd>
<p>Die Anzahl der Transaktionen zwischen Schl&uuml;sselpunktvorg&auml;ngen, die die Transaktionslogdatei komprimieren. Der Standardwert ist 65.536.</p>
</dd>
<dt>Weitere Eigenschaften</dt>
<dd>
<p>Weitere Eigenschaften f&uuml;r den Transaktionsservice.</p>
<p>Eine Beschreibung der verf&uuml;gbaren Eigenschaften finden Sie unter <a href="ref-transactionsvcproperties.html">F&uuml;r den Transaktionsservice spezifische Eigenschaften</a>.</p>
</dd>
</dl>
<a id="sthref15" name="sthref15"></a>
<h5>Verwandte Aufgaben</h5>
<ul>
<li>
<p><a href="task-configtransservice.html">So wird der Transaktionsservice konfiguriert</a></p>
</li>
<li>
<p><a href="task-configtransrecovery.html">So wird konfiguriert, wie GlassFish Server Transaktionen wiederherstellt</a></p>
</li>
<li>
<p><a href="task-settranstimeout.html">So wird ein Wert f&uuml;r das Transaktionstimeout festgelegt</a></p>
</li>
<li>
<p><a href="task-settranslog.html">So wird das Verzeichnis der Transaktionslogs festgelegt</a></p>
</li>
<li>
<p><a href="task-setkeyptinterval.html">So wird das Schl&uuml;sselpunktintervall festgelegt</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
