<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-configtransrecovery" name="task-configtransrecovery"></a></p>

<h4><a id="sthref4" name="sthref4"></a>So wird konfiguriert, wie GlassFish Server Transaktionen wiederherstellt</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>M&ouml;glicherweise sind die Transaktionen unvollst&auml;ndig, weil der Server oder ein Ressourcenmanager zwischen den Phasen eines Two-Phase Commits abgest&uuml;rzt ist. Es ist wichtig, diese unterbrochenen Transaktionen vollst&auml;ndig auszuf&uuml;hren und wiederherzustellen. GlassFish Server ist so konzipiert, dass Transaktionen beim Serverstart wiederhergestellt und vollst&auml;ndig ausgef&uuml;hrt werden.</p>
<p>Stellen Sie vor dem Recovery sicher, dass alle einbezogenen Ressourcen hochgefahren sind und ausgef&uuml;hrt werden.</p>
<p>Wenn Transaktionen auf mehreren Servern ausgef&uuml;hrt werden, kann der Server, auf dem die Transaktion gestartet wurde, eine Verbindung mit den anderen Servern herstellen, um das Ergebnis der Transaktionen abzurufen. Wenn keine Kommunikation mit den anderen Servern m&ouml;glich ist, verwendet die Transaktion zum Ermitteln des Ergebnisses das Feld "Heuristische Entscheidung".</p>
<ol>
<li>
<p>Blenden Sie in der Navigationsbaumstruktur den Knoten "Konfiguration" ein.</p>
</li>
<li>
<p>W&auml;hlen Sie die zu konfigurierende Instanz:</p>
<ul>
<li>
<p>Um eine bestimmte Instanz zu konfigurieren, w&auml;hlen Sie den Konfigurationsknoten der Instanz. Beispiel: F&uuml;r die Standardinstanz <code>server</code> w&auml;hlen Sie den Knoten <code>server-config</code>.</p>
</li>
<li>
<p>Um die Standardeinstellungen f&uuml;r alle Instanzen zu konfigurieren, w&auml;hlen Sie den Knoten <code>default-config</code>.</p>
</li>
</ul>
</li>
<li>
<p>W&auml;hlen Sie den Knoten "Transaktionsservice".</p>
<p>Die Seite "Transaktionsservice" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Aktivieren Sie auf der Seite "Transaktionsservice" das Kontrollk&auml;stchen "Beim Neustart aktiviert", um das Recovery unvollst&auml;ndiger Transaktionen zu aktivieren.</p>
<p>Standardm&auml;&szlig;ig ist das Kontrollk&auml;stchen "Aktiviert" nicht markiert.</p>
</li>
<li>
<p>Geben Sie im Feld "Wiederholungstimeout" den Zeitraum in Sekunden ein, in dem GlassFish Server versucht, eine Verbindung zu einem nicht erreichbaren Server herzustellen.</p>
<p>Der Standardwert ist 600 (10 Minuten).</p>
</li>
<li>
<p>W&auml;hlen Sie aus der Dropdown-Liste "Heuristische Entscheidung" die Policy daf&uuml;r, wie bei Transaktionen mit nicht erreichbaren Servern verfahren wird.</p>
<p>Wenn es keinen wichtigen Grund daf&uuml;r gibt, "Commit" zu w&auml;hlen, behalten Sie die Einstellung "Zur&uuml;cksetzen" (die Standardeinstellung) f&uuml;r "Heuristische Entscheidung" bei. Das Festschreiben unbestimmter Transaktionen kann die Datenintegrit&auml;t Ihrer Anwendung gef&auml;hrden.</p>
</li>
<li>
<p>Klicken Sie auf "Speichern".</p>
</li>
<li>
<p>Starten Sie GlassFish Server neu.</p>
</li>
</ol>
<a id="sthref5" name="sthref5"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-configtransservice.html">So wird der Transaktionsservice konfiguriert</a></p>
</li>
<li>
<p><a href="task-settranstimeout.html">So wird ein Wert f&uuml;r das Transaktionstimeout festgelegt</a></p>
</li>
<li>
<p><a href="task-settranslog.html">So wird das Verzeichnis der Transaktionslogs festgelegt</a></p>
</li>
<li>
<p><a href="task-setkeyptinterval.html">So wird das Schl&uuml;sselpunktintervall festgelegt</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
