<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-configtransservice" name="task-configtransservice"></a></p>

<h4><a id="sthref2" name="sthref2"></a>So wird der Transaktionsservice konfiguriert</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Blenden Sie in der Navigationsbaumstruktur den Knoten "Konfiguration" ein.</p>
</li>
<li>
<p>W&auml;hlen Sie die zu konfigurierende Instanz:</p>
<ul>
<li>
<p>Um eine bestimmte Instanz zu konfigurieren, w&auml;hlen Sie den Konfigurationsknoten der Instanz. Beispiel: F&uuml;r die Standardinstanz <code>server</code> w&auml;hlen Sie den Knoten <code>server-config</code>.</p>
</li>
<li>
<p>Um die Standardeinstellungen f&uuml;r alle Instanzen zu konfigurieren, w&auml;hlen Sie den Knoten <code>default-config</code>.</p>
</li>
</ul>
</li>
<li>
<p>W&auml;hlen Sie den Knoten "Transaktionsservice".</p>
<p>Die Seite "Transaktionsservice" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Aktivieren Sie auf der Seite "Transaktionsservice" das Kontrollk&auml;stchen "Beim Neustart aktiviert", um das Recovery unvollst&auml;ndiger Transaktionen zu aktivieren, wenn der Server neu gestartet wird.</p>
<p>Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Geben Sie im Feld "Transaktionstimeout" an, wie lange der Server wartet, bevor er eine unvollst&auml;ndige Transaktion zur&uuml;cksetzt (Angabe in Sekunden).</p>
<p>Durch einen Wert von 0 werden Transaktionstimeouts deaktiviert. Der Standardwert ist 0; das bedeutet, dass es von Seiten des Servers keine Zeitbeschr&auml;nkung f&uuml;r den Abschluss einer Transaktion gibt.</p>
</li>
<li>
<p>Geben Sie im Feld "Wiederholungstimeout" den Zeitraum in Sekunden ein, in dem GlassFish Server versucht, eine Verbindung zu einem nicht erreichbaren Server herzustellen.</p>
<p>Der Standardwert ist 600 (10 Minuten).</p>
</li>
<li>
<p>Geben Sie im Feld "Verzeichnis des Transaktionslogs" das Verzeichnis ein, in dem Serverlogs gespeichert werden sollen.</p>
<p>Transaktionslogs werden im Unterverzeichnis <code>tx</code> des Verzeichnisses gespeichert, das in diesem Feld angegeben ist. Der Standardwert ist das Verzeichnis, das auf der Seite "Domainattribute" im Feld "Log-Root" angegeben ist, das sich im Knoten GlassFish Server in der Registerkarte "Erweitert" befindet.</p>
</li>
<li>
<p>W&auml;hlen Sie aus der Dropdown-Liste "Heuristische Entscheidung" die Policy, die die Verfahrensweise bestimmt, wenn das Ergebnis einer verteilten Transaktion nicht festgestellt werden kann, da andere Teilnehmer nicht erreichbar sind.</p>
<p>Wenn es keinen wichtigen Grund daf&uuml;r gibt, "Commit" zu w&auml;hlen, behalten Sie die Einstellung "Zur&uuml;cksetzen" (die Standardeinstellung) f&uuml;r "Heuristische Entscheidung" bei. Das Festschreiben unbestimmter Transaktionen kann die Datenintegrit&auml;t Ihrer Anwendung gef&auml;hrden.</p>
</li>
<li>
<p>Geben Sie im Feld "Schl&uuml;sselpunktintervall" die Anzahl der Transaktionen zwischen Schl&uuml;sselpunktvorg&auml;ngen ein.</p>
<p>Schl&uuml;sselpunktvorg&auml;nge komprimieren die Transaktionslogdatei. Der Standardwert ist 65.536.</p>
</li>
<li>
<p>Geben Sie im Abschnitt "Weitere Eigenschaften" weitere Eigenschaften an.</p>
<p>Eine Beschreibung der verf&uuml;gbaren Eigenschaften finden Sie unter <a href="ref-transactionsvcproperties.html">F&uuml;r den Transaktionsservice spezifische Eigenschaften</a>.</p>
<ul>
<li>
<p>Um eine Eigenschaft hinzuzuf&uuml;gen, klicken Sie auf die Schaltfl&auml;che "Eigenschaft hinzuf&uuml;gen". Geben Sie in die daraufhin angezeigte leere Zeile den Eigenschaftsnamen in das Feld "Name" und den Eigenschaftswert in das Feld "Wert" ein.</p>
</li>
<li>
<p>Um eine Eigenschaft zu &auml;ndern, bearbeiten Sie das Feld "Wert" dieser Eigenschaft.</p>
</li>
<li>
<p>Um eine Eigenschaft zu l&ouml;schen, aktivieren Sie das Kontrollk&auml;stchen links neben dem Feld "Name" der zu l&ouml;schenden Eigenschaft und klicken anschlie&szlig;end auf die Schaltfl&auml;che "Eigenschaften l&ouml;schen".</p>
</li>
</ul>
</li>
<li>
<p>Klicken Sie auf "Speichern".</p>

<hr>
<p><b>Tipp:</b></p>
Um zu den Standardeinstellungen zur&uuml;ckzukehren, klicken Sie auf die Schaltfl&auml;che "Standardwerte laden" und anschlie&szlig;end auf "Speichern".
<hr>

</li>
<li>
<p>Starten Sie GlassFish Server neu.</p>
</li>
</ol>
<a id="sthref3" name="sthref3"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-configtransrecovery.html">So wird konfiguriert, wie GlassFish Server Transaktionen wiederherstellt</a></p>
</li>
<li>
<p><a href="task-settranstimeout.html">So wird ein Wert f&uuml;r das Transaktionstimeout festgelegt</a></p>
</li>
<li>
<p><a href="task-settranslog.html">So wird das Verzeichnis der Transaktionslogs festgelegt</a></p>
</li>
<li>
<p><a href="task-setkeyptinterval.html">So wird das Schl&uuml;sselpunktintervall festgelegt</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
