<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-setkeyptinterval" name="task-setkeyptinterval"></a><a id="GHJTS00008" name="GHJTS00008"></a></p>

<h4><a id="sthref11" name="sthref11"></a><a id="sthref12" name="sthref12"></a>So wird das Schl&uuml;sselpunktintervall festgelegt</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Schl&uuml;sselpunktvorg&auml;nge komprimieren die Transaktionslogdatei. Das Schl&uuml;sselpunktintervall entspricht der Anzahl von Transaktionen zwischen Schl&uuml;sselpunktvorg&auml;ngen, die f&uuml;r das Log durchgef&uuml;hrt werden. Schl&uuml;sselpunktvorg&auml;nge k&ouml;nnen die Gr&ouml;&szlig;e der Transaktionslogdateien verringern. Ein hoher Wert f&uuml;r Schl&uuml;sselpunktintervalle f&uuml;hrt zu gr&ouml;&szlig;eren Transaktionslogdateien, einer geringeren Anzahl von Schl&uuml;sselpunktvorg&auml;ngen sowie m&ouml;glicherweise einer besseren Performance. Ein kleinerer Wert f&uuml;r Schl&uuml;sselpunktintervalle (z.B. 256) f&uuml;hrt zu kleineren Logdateien, jedoch aufgrund h&auml;ufigerer Schl&uuml;sselpunktvorg&auml;nge zu einer beeintr&auml;chtigten Performance.</p>
<ol>
<li>
<p>Blenden Sie in der Navigationsbaumstruktur den Knoten "Konfiguration" ein.</p>
</li>
<li>
<p>W&auml;hlen Sie die zu konfigurierende Instanz:</p>
<ul>
<li>
<p>Um eine bestimmte Instanz zu konfigurieren, w&auml;hlen Sie den Konfigurationsknoten der Instanz. Beispiel: F&uuml;r die Standardinstanz <code>server</code> w&auml;hlen Sie den Knoten <code>server-config</code>.</p>
</li>
<li>
<p>Um die Standardeinstellungen f&uuml;r alle Instanzen zu konfigurieren, w&auml;hlen Sie den Knoten <code>default-config</code>.</p>
</li>
</ul>
</li>
<li>
<p>W&auml;hlen Sie den Knoten "Transaktionsservice".</p>
<p>Die Seite "Transaktionsservice" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Geben Sie im Feld "Schl&uuml;sselpunktintervall" die Anzahl der Transaktionen zwischen Schl&uuml;sselpunktvorg&auml;ngen ein.</p>
<p>Der Standardwert ist 65.536.</p>
</li>
<li>
<p>Klicken Sie auf "Speichern".</p>
</li>
</ol>
<a id="sthref13" name="sthref13"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-configtransservice.html">So wird der Transaktionsservice konfiguriert</a></p>
</li>
<li>
<p><a href="task-configtransrecovery.html">So wird konfiguriert, wie GlassFish Server Transaktionen wiederherstellt</a></p>
</li>
<li>
<p><a href="task-settranstimeout.html">So wird ein Wert f&uuml;r das Transaktionstimeout festgelegt</a></p>
</li>
<li>
<p><a href="task-settranslog.html">So wird das Verzeichnis der Transaktionslogs festgelegt</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
