<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-ejbcontaineravailability" name="ref-ejbcontaineravailability"></a><a id="GHEJB00001" name="GHEJB00001"></a></p>

<h4><a id="sthref12" name="sthref12"></a><a id="sthref13" name="sthref13"></a>EJB &#52968;&#53580;&#51060;&#45320; &#44032;&#50857;&#49457;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[EJB &#52968;&#53580;&#51060;&#45320; &#44032;&#50857;&#49457;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; EJB &#52968;&#53580;&#51060;&#45320; &#44032;&#50857;&#49457; &#49444;&#51221;&#51012; &#44396;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>[EJB &#52968;&#53580;&#51060;&#45320; &#44032;&#50857;&#49457;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44592;&#48376;&#44050; &#47196;&#46300;</dt>
<dd>
<p>&#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#45716; &#49444;&#51221;&#51012; &#44592;&#48376;&#44050;&#51004;&#47196; &#48373;&#50896;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#49444;&#51221;&#51008; &#48320;&#44221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#44396;&#49457; &#51060;&#47492;</dt>
<dd>
<p>&#51060; &#54168;&#51060;&#51648;&#51032; &#49444;&#51221;&#51060; &#51201;&#50857;&#46104;&#45716; &#44396;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#44032;&#50857;&#49457; &#49436;&#48708;&#49828;</dt>
<dd>
<p>[&#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#47732; EJB &#52968;&#53580;&#51060;&#45320;&#50640; &#45824;&#54644; &#44032;&#50857;&#49457;&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>HA &#51648;&#49549;&#49457; &#50976;&#54805;</dt>
<dd>
<p>&#51060; &#51648;&#49549;&#49457; &#48169;&#49885;&#51008; [&#44032;&#50857;&#49457; &#49436;&#48708;&#49828; &#49324;&#50857;]&#51012; &#49440;&#53469;&#54620; &#44221;&#50864;&#50640; &#49324;&#50857;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>replicated</code>&#51060;&#47728;, &#51060; &#44050;&#51008; &#53364;&#47084;&#49828;&#53552;&#51032; &#48373;&#44396;&#47484; &#44592;&#51456;&#51004;&#47196; &#51648;&#49549;&#49457;&#51012; &#51228;&#44277;&#54633;&#45768;&#45796;. &#51060; &#44050;&#51012; &#48320;&#44221;&#54616;&#51648; &#47560;&#49901;&#49884;&#50724;.</p>
</dd>
<dt>SFSB &#51648;&#49549;&#49457; &#50976;&#54805;</dt>
<dd>
<p>&#51060; &#51648;&#49549;&#49457; &#48169;&#49885;&#51008; [&#44032;&#50857;&#49457; &#49436;&#48708;&#49828; &#49324;&#50857;]&#51012; &#49440;&#53469;&#54616;&#51648; <i>&#50506;&#51008;</i> &#44221;&#50864;&#50640; &#49324;&#50857;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>file</code>&#51060;&#47728;, &#51060; &#44050;&#51008; &#54028;&#51068; &#49884;&#49828;&#53596;&#51012; &#44592;&#51456;&#51004;&#47196; &#51648;&#49549;&#49457;&#51012; &#51228;&#44277;&#54633;&#45768;&#45796;. &#51060; &#44050;&#51012; &#48320;&#44221;&#54616;&#51648; &#47560;&#49901;&#49884;&#50724;.</p>
<p>[&#49464;&#49496; &#51200;&#51109; &#50948;&#52824;] &#54596;&#46300;&#45716; SFSB &#52404;&#53356;&#54252;&#51064;&#53944; &#49345;&#53468;&#44032; &#51648;&#49549;&#46104;&#45716; &#50948;&#52824;&#47484; &#44208;&#51221;&#54633;&#45768;&#45796;. &#49464;&#49496; &#51200;&#51109; &#50948;&#52824;&#47484; &#49444;&#51221;&#54616;&#47140;&#47732; <a href="../../../ejb-lite/en/help/task-ejbgeneral.html">EJB &#49444;&#51221;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</dd>
<dt>&#52628;&#44032; &#49549;&#49457;</dt>
<dd>
<p>EJB &#52968;&#53580;&#51060;&#45320; &#44032;&#50857;&#49457;&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51077;&#45768;&#45796;.</p>
<p>GlassFish Server&#50640;&#49436;&#45716; &#52628;&#44032; EJB &#52968;&#53580;&#51060;&#45320; &#44032;&#50857;&#49457; &#49549;&#49457;&#51012; &#51221;&#51032;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref14" name="sthref14"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-ejbcontaineravailability.html">EJB &#52968;&#53580;&#51060;&#45320; &#44032;&#50857;&#49457; &#49444;&#51221;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="../../../ejb-lite/en/help/task-ejbgeneral.html">EJB &#49444;&#51221;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
