<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-ejbtimerservice" name="ref-ejbtimerservice"></a></p>

<h4><a id="sthref23" name="sthref23"></a><a id="sthref24" name="sthref24"></a><a id="sthref25" name="sthref25"></a>EJB &#53440;&#51060;&#47672; &#49436;&#48708;&#49828;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[EJB &#53440;&#51060;&#47672; &#49436;&#48708;&#49828;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; EJB &#53440;&#51060;&#47672; &#49436;&#48708;&#49828;&#47484; &#44396;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#53440;&#51060;&#47672; &#49436;&#48708;&#49828;&#45716; &#50644;&#53552;&#54532;&#46972;&#51060;&#51592; Bean &#52968;&#53580;&#51060;&#45320;&#50640;&#49436; &#51228;&#44277;&#54616;&#47728; &#50644;&#53552;&#54532;&#46972;&#51060;&#51592; Bean&#50640;&#49436; &#49324;&#50857;&#54616;&#45716; &#50508;&#47548;&#51060;&#45208; &#51060;&#48292;&#53944;&#51032; &#51068;&#51221;&#51012; &#51105;&#45716; &#45936; &#49324;&#50857;&#54616;&#45716; &#50689;&#44396;&#51201;&#51064; &#53944;&#47004;&#51117;&#49496; &#50508;&#47548; &#49436;&#48708;&#49828;&#51077;&#45768;&#45796;. Stateful Session Bean&#51012; &#51228;&#50808;&#54620; &#47784;&#46304; &#50644;&#53552;&#54532;&#46972;&#51060;&#51592; Bean&#50640;&#49436;&#45716; &#53440;&#51060;&#47672; &#49436;&#48708;&#49828;&#47196;&#48512;&#53552; &#50508;&#47548;&#51012; &#49688;&#49888;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#49436;&#48708;&#49828;&#50640; &#51032;&#54644; &#49444;&#51221;&#46108; &#50689;&#44396; &#53440;&#51060;&#47672;&#45716; &#49436;&#48260;&#44032; &#51333;&#47308;&#46104;&#44144;&#45208; &#51116;&#49884;&#51089;&#46104;&#50612;&#46020; &#49325;&#51228;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
<p>[EJB &#53440;&#51060;&#47672; &#49436;&#48708;&#49828;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44592;&#48376;&#44050; &#47196;&#46300;</dt>
<dd>
<p>&#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#45716; &#49444;&#51221;&#51012; &#44592;&#48376;&#44050;&#51004;&#47196; &#48373;&#50896;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#49444;&#51221;&#51008; &#48320;&#44221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#44396;&#49457; &#51060;&#47492;</dt>
<dd>
<p>&#51060; &#54168;&#51060;&#51648;&#51032; &#49444;&#51221;&#51060; &#51201;&#50857;&#46104;&#45716; &#44396;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#49548; &#51204;&#45804; &#44036;&#44201;</dt>
<dd>
<p>&#53945;&#51221; &#53440;&#51060;&#47672;&#50640; &#45824;&#54620; &#45796;&#51020; &#53440;&#51060;&#47672; &#47564;&#47308;&#44032; &#48156;&#49373;&#54616;&#44592; &#51204;&#50640; &#54728;&#50857;&#46104;&#45716; &#52572;&#49548; &#49884;&#44036;(&#48128;&#47532;&#52488;)&#51077;&#45768;&#45796;. &#51060; &#44036;&#44201;&#51012; &#45320;&#47924; &#45230;&#44172; &#49444;&#51221;&#54616;&#47732; &#49436;&#48260; &#50724;&#48260;&#54756;&#46300;&#44032; &#48156;&#49373;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 1000&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#45824; &#51116;&#51204;&#49569;</dt>
<dd>
<p>&#53440;&#51060;&#47672; &#49436;&#48708;&#49828;&#44032; &#50696;&#50808; &#49324;&#54637; &#46608;&#45716; &#47204;&#48177;&#50640; &#45824;&#54620; &#53440;&#51060;&#47672; &#47564;&#47308; &#44592;&#54620;&#51012; &#51204;&#45804;&#54616;&#44592; &#50948;&#54644; &#49884;&#46020;&#54616;&#45716; &#52572;&#45824; &#54943;&#49688;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 1&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51116;&#51204;&#49569; &#44036;&#44201;</dt>
<dd>
<p>&#51116;&#51204;&#49569; &#49884;&#46020; &#44036;&#44201;(&#48128;&#47532;&#52488;)&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 5000&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#53440;&#51060;&#47672; &#45936;&#51060;&#53552; &#49548;&#49828;</dt>
<dd>
<p>&#53440;&#51060;&#47672; &#45936;&#51060;&#53552; &#49548;&#49828;&#47196; &#49324;&#50857;&#46112; JDBC &#47532;&#49548;&#49828;&#51032; JNDI &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#44050;&#51012; &#51648;&#51221;&#54616;&#47732; &#53440;&#51060;&#47672; &#49436;&#48708;&#49828; &#49884;&#49828;&#53596; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#45824;&#54620; &#44592;&#48376;&#44050;&#51064; <code>jdbc/__TimerPool</code>&#51012; &#45824;&#52404;&#54633;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref26" name="sthref26"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-ejbtimerservice.html">EJB &#53440;&#51060;&#47672; &#49436;&#48708;&#49828; &#44396;&#49457;</a></p>
</li>
<li>
<p><a href="../../../ejb-lite/en/help/task-ejbgeneral.html">EJB &#49444;&#51221;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-ejbmdbpoolsettings.html">MDB &#54400; &#49444;&#51221;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref27" name="sthref27"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00205"><code>list-timers</code>(1)</a></p>





<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
