<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-accesslog" name="ref-accesslog"></a><a id="GHWEB00008" name="GHWEB00008"></a></p>

<h4><a id="sthref104" name="sthref104"></a><a id="sthref105" name="sthref105"></a>Service HTTP</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Service HTTP permet de sp&eacute;cifier la r&egrave;gle g&eacute;n&eacute;rale de journal des acc&egrave;s pour les applications Web.</p>
<p>Le service HTTP offre des fonctions de d&eacute;ploiement des applications Web et permettant aux clients HTTP d'acc&eacute;der aux applications Web d&eacute;ploy&eacute;es, ainsi qu'aux serveurs virtuels, pools de threads et &agrave; la fonction de configuration r&eacute;seau.</p>
<p>GlassFish Server utilise le journal des acc&egrave;s du service HTTP pour activer et configurer la rotation des journaux des acc&egrave;s pour les serveurs virtuels. Ces journaux sont situ&eacute;s dans le r&eacute;pertoire domain-dir<code>/logs/access</code> et sont nomm&eacute;s comme suit : <i>virtual_server_name</i><code>_access_log.</code><i>yyyyMMdd</i><code>-</code><i>HH</i><code>h</code><i>mm</i><code>m</code><i>ss</i><code>s.txt</code></p>
<p>La page Service HTTP contient les options suivantes :</p>
<dl>
<dt>Charger les valeurs par d&eacute;faut</dt>
<dd>
<p>Bouton permettant de restaurer les valeurs par d&eacute;faut des param&egrave;tres qui en ont. Les param&egrave;tres qui n'ont pas de valeurs par d&eacute;faut ne sont pas modifi&eacute;s.</p>
</dd>
<dt>Nom de configuration</dt>
<dd>
<p>Nom de la configuration &agrave; laquelle s'appliquent les param&egrave;tres de cette page. Ce champ est en lecture seule.</p>
</dd>
<dt>SSO</dt>
<dd>
<p>D&eacute;termine si la connexion unique est activ&eacute;e par d&eacute;faut pour l'ensemble des applications Web sur tous les serveurs virtuels de ce serveur qui sont configur&eacute;s pour le m&ecirc;me domaine. Si cette option n'est pas activ&eacute;e, la connexion unique est d&eacute;sactiv&eacute;e par d&eacute;faut pour tous les serveurs virtuels et les utilisateurs doivent &ecirc;tre authentifi&eacute;s s&eacute;par&eacute;ment pour toutes les applications sur chaque serveur virtuel. Vous pouvez remplacer ce param&egrave;tre pour un serveur virtuel. SSO peut &ecirc;tre activ&eacute; ou d&eacute;sactiv&eacute;. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Journalisation des acc&egrave;s</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, la journalisation des acc&egrave;s est activ&eacute;e pour tous les sous-&eacute;l&eacute;ments de serveur virtuel qui ne sp&eacute;cifient pas cette propri&eacute;t&eacute;. Si cette option n'est pas s&eacute;lectionn&eacute;e, la journalisation des acc&egrave;s est d&eacute;sactiv&eacute;e pour tous les sous-&eacute;l&eacute;ments de serveur virtuel qui ne sp&eacute;cifient pas cette propri&eacute;t&eacute;. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Rotation</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, la rotation de fichier journal est activ&eacute;e. Cette option est activ&eacute;e par d&eacute;faut.</p>
</dd>
<dt>R&egrave;gle de rotation</dt>
<dd>
<p>La seule r&egrave;gle de rotation disponible est <code>time</code>.</p>
</dd>
<dt>Intervalle de rotation</dt>
<dd>
<p>Nombre de minutes entre les rotations du journal des acc&egrave;s. Ce champ est valide uniquement si la r&egrave;gle de rotation est <code>time</code>. La valeur par d&eacute;faut est 1 440 minutes (24 heures).</p>
</dd>
<dt>Suffixe de rotation</dt>
<dd>
<p>Valeur de cha&icirc;ne &agrave; ajouter &agrave; la fin du nom du fichier journal apr&egrave;s la rotation. La valeur par d&eacute;faut est <code>yyyy-MM-dd</code>.</p>
<p>Assurez-vous que le suffixe de rotation contient suffisamment de valeurs pour cr&eacute;er un suffixe unique pour chaque rotation de journal. Par exemple, si le journal des acc&egrave;s change plusieurs fois par jour, ajoutez l'heure dans le suffixe de rotation.</p>
<p>Le suffixe doit &ecirc;tre unique pour s'assurer que le fichier journal des acc&egrave;s change chaque fois que l'intervalle de rotation arrive &agrave; son terme. Si le suffixe de rotation du nouveau fichier journal des acc&egrave;s est le m&ecirc;me que celui du fichier existant, aucune rotation n'est appliqu&eacute;e au fichier.</p>
</dd>
<dt>Nombre max. de fichiers</dt>
<dd>
<p>Nombre maximal de fichiers journaux des acc&egrave;s chang&eacute;s &agrave; conserver. Une valeur n&eacute;gative signifie que le nombre de fichiers est illimit&eacute;. La valeur par d&eacute;faut est -1.</p>
</dd>
<dt>Taille du tampon</dt>
<dd>
<p>Taille, en octets, du tampon de journal des acc&egrave;s, ou valeur inf&eacute;rieure ou &eacute;gale &agrave; 0 pour les journaux des acc&egrave;s non plac&eacute;s en m&eacute;moire tampon. La valeur par d&eacute;faut est 32 768.</p>
</dd>
<dt>Intervalle d'&eacute;criture</dt>
<dd>
<p>Nombre de secondes &eacute;coul&eacute;es avant l'&eacute;criture du journal sur le disque. Le journal des acc&egrave;s est &eacute;crit lorsque la m&eacute;moire tampon est pleine ou que l'intervalle expire. Si la valeur est inf&eacute;rieure ou &eacute;gale &agrave; 0, l'&eacute;criture continue dans la m&eacute;moire tampon m&ecirc;me si elle n'est pas pleine. Autrement dit, chaque fois qu'un utilisateur acc&egrave;de au serveur, le message de journal est directement stock&eacute; dans le fichier. La valeur par d&eacute;faut est 300.</p>
</dd>
<dt>Format</dt>
<dd>
<p>Valeur de cha&icirc;ne qui pr&eacute;cise les informations &agrave; capturer dans le journal des acc&egrave;s et l'ordre de capture. La valeur par d&eacute;faut est la suivante :</p>
<pre>
%client.name% %auth-user-name% %datetime% %request% %status% %response.length%
</pre>
<p>Les valeurs suivantes peuvent &ecirc;tre incluses dans la cha&icirc;ne de format :</p>
<dl>
<dt><code>%attribute.</code><i>name</i><code>%</code></dt>
<dd>
<p>Journalise la valeur (en appelant la m&eacute;thode <code>toString</code> associ&eacute;e) de l'attribut de demande avec le <i>nom</i> sp&eacute;cifi&eacute;.</p>
</dd>
<dt><code>%auth-user-name%</code></dt>
<dd>
<p>Nom de l'utilisateur autoris&eacute;</p>
</dd>
<dt><code>%client.name%</code></dt>
<dd>
<p>Nom de l'h&ocirc;te client</p>
</dd>
<dt><code>%client.dns%</code></dt>
<dd>
<p>DNS client</p>
</dd>
<dt><code>%cookie.</code><i>name</i><code>%</code></dt>
<dd>
<p>Valeur du cookie de demande portant le <i>nom</i> sp&eacute;cifi&eacute;</p>
</dd>
<dt><code>%cookie.value%</code></dt>
<dd>
<p>Valeur du premier cookie d&eacute;tect&eacute; dans la demande</p>
</dd>
<dt><code>%datetime%</code></dt>
<dd>
<p>Date du syst&egrave;me</p>
</dd>
<dt><code>%request%</code></dt>
<dd>
<p>Ligne de demande HTTP compl&egrave;te</p>
</dd>
<dt><code>%status%</code></dt>
<dd>
<p>Statut</p>
</dd>
<dt><code>%response.length%</code></dt>
<dd>
<p>Longueur du contenu de la r&eacute;ponse</p>
</dd>
<dt><code>%header.referer%</code></dt>
<dd>
<p>En-t&ecirc;te de source du renvoi</p>
</dd>
<dt><code>%header.user-agent%</code></dt>
<dd>
<p>En-t&ecirc;te d'agent utilisateur</p>
</dd>
<dt><code>%http-method%</code></dt>
<dd>
<p>M&eacute;thode HTTP</p>
</dd>
<dt><code>%http-uri%</code></dt>
<dd>
<p>URI HTTP</p>
</dd>
<dt><code>%query-str%</code></dt>
<dd>
<p>Cha&icirc;ne de requ&ecirc;te HTTP</p>
</dd>
<dt><code>%http-version%</code></dt>
<dd>
<p>Version du protocole HTTP</p>
</dd>
<dt><code>%header.accept%</code></dt>
<dd>
<p>En-t&ecirc;te d'acceptation</p>
</dd>
<dt><code>%header.date%</code></dt>
<dd>
<p>En-t&ecirc;te de date</p>
</dd>
<dt><code>%header.if-mod-since%</code></dt>
<dd>
<p>En-t&ecirc;te If-Modified-Since</p>
</dd>
<dt><code>%header.auth%</code></dt>
<dd>
<p>En-t&ecirc;te d'autorisation</p>
</dd>
<dt><code>%header.</code><i>any</i><code>%</code></dt>
<dd>
<p>Toute valeur d'en-t&ecirc;te HTTP valide d&eacute;finie dans le document RFC 2616 (<code>any</code> est &eacute;galement une valeur d'en-t&ecirc;te valide, qui est indiqu&eacute;e ici en tant que variable)</p>
</dd>
<dt><code>%session.</code><i>name</i><code>%</code></dt>
<dd>
<p>Valeur de l'attribut de session portant le nom <i>name</i>, ou <code>NULL-SESSION-ATTRIBUTE-</code><i>name</i> si l'attribut sp&eacute;cifi&eacute; n'existe pas dans la session, ou encore <code>NULL-SESSION</code> s'il n'existe aucune session.</p>
</dd>
<dt><code>%time-taken%</code></dt>
<dd>
<p>Dur&eacute;e (en millisecondes) de traitement de chaque demande</p>
</dd>
<dt><code>%vs.id%</code></dt>
<dd>
<p>ID de serveur virtuel</p>
</dd>
</dl>
</dd>
<dt>Autres propri&eacute;t&eacute;s</dt>
<dd>
<p>Propri&eacute;t&eacute;s suppl&eacute;mentaires du service HTTP. Pour obtenir une description des propri&eacute;t&eacute;s disponibles, reportez-vous &agrave; <a href="ref-httpserviceprops.html">Propri&eacute;t&eacute;s propres au service HTTP</a>.</p>
</dd>
</dl>
<a id="sthref106" name="sthref106"></a>
<h5>T&acirc;ches connexes</h5>
<p><a href="task-accesslog.html">Configuration du service HTTP</a></p>
<a id="sthref107" name="sthref107"></a>
<h5>Commandes asadmin connexes</h5>
<p>Aucune.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
