<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-webcontaineravailability" name="ref-webcontaineravailability"></a></p>

<h4><a id="sthref79" name="sthref79"></a><a id="sthref80" name="sthref80"></a>Disponibilit&eacute; du conteneur Web</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Disponibilit&eacute; du conteneur Web permet de configurer les param&egrave;tres correspondants.</p>
<p>Elle contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Charger les valeurs par d&eacute;faut</dt>
<dd>
<p>Bouton permettant de restaurer les valeurs par d&eacute;faut des param&egrave;tres qui en ont. Les param&egrave;tres qui n'ont pas de valeurs par d&eacute;faut ne sont pas modifi&eacute;s.</p>
</dd>
<dt>Nom de configuration</dt>
<dd>
<p>Nom de la configuration &agrave; laquelle s'appliquent les param&egrave;tres de cette page. Ce champ est en lecture seule.</p>
</dd>
<dt>Service de disponibilit&eacute;</dt>
<dd>
<p>Si la case Activ&eacute; est coch&eacute;e, la disponibilit&eacute; du conteneur Web est activ&eacute;e.</p>
</dd>
<dt>Type de persistance</dt>
<dd>
<p>M&eacute;canisme de persistance utilis&eacute;.</p>
<ul>
<li>
<p>Si le service de disponibilit&eacute; n'est <i>pas</i> activ&eacute;, s&eacute;lectionnez l'un des &eacute;l&eacute;ments suivants :</p>
<ul>
<li>
<p><code>memory</code> pour n'utiliser aucune persistance de session</p>
</li>
<li>
<p><code>file</code> pour utiliser une persistance de session bas&eacute;e sur le syst&egrave;me de fichiers n'&eacute;tant pas hautement disponible</p>
</li>
</ul>
</li>
<li>
<p>Si le service de disponibilit&eacute; est activ&eacute;, s&eacute;lectionnez <code>replicated</code> pour utiliser la persistance de session bas&eacute;e sur le basculement apr&egrave;s incident du cluster hautement disponible.</p>
</li>
</ul>
</dd>
<dt>Fr&eacute;quence de la persistance</dt>
<dd>
<p>Fr&eacute;quence de stockage de la session HTTP :</p>
<ul>
<li>
<p><code>web-method :</code> l'&eacute;tat de la session est stock&eacute; &agrave; la fin de chaque demande Web avant l'envoi d'une r&eacute;ponse au client. Ce mode constitue la meilleure garantie que l'&eacute;tat de la session sera enti&egrave;rement mis &agrave; jour en cas d'&eacute;chec. Il s'agit de la valeur par d&eacute;faut.</p>
</li>
</ul>
</dd>
<dt>Port&eacute;e de la persistance</dt>
<dd>
<p>Port&eacute;e des modifications de session HTTP requises pour le stockage :</p>
<ul>
<li>
<p><code>session :</code> l'&eacute;tat de la session est stock&eacute; int&eacute;gralement &agrave; chaque fois. Ce mode constitue la meilleure garantie que vos donn&eacute;es de session seront correctement stock&eacute;es, quelle que soit l'application Web distribuable.</p>
</li>
<li>
<p><code>modified-session :</code> l'&eacute;tat de la session est stock&eacute; int&eacute;gralement s'il a &eacute;t&eacute; modifi&eacute;. Une session est consid&eacute;r&eacute;e comme ayant &eacute;t&eacute; modifi&eacute;e si <code>HttpSession.setAttribute()</code> ou <code>HttpSession.removeAttribute()</code> a &eacute;t&eacute; appel&eacute;. Vous devez vous assurer que <code>setAttribute()</code> est appel&eacute; chaque fois qu'un attribut est modifi&eacute;. Cette exigence n'est pas requise par la sp&eacute;cification Java EE, mais elle est n&eacute;cessaire pour que ce mode fonctionne correctement.</p>
</li>
<li>
<p><code>modified-attribute :</code> seuls les attributs de session modifi&eacute;s sont stock&eacute;s. Pour que ce mode fonctionne correctement, suivez les lignes directrices ci-dessous :</p>
<ul>
<li>
<p>Appelez <code>setAttribute()</code> &agrave; chaque modification de l'&eacute;tat de la session.</p>
</li>
<li>
<p>Veillez &agrave; ce qu'il n'y ait pas de r&eacute;f&eacute;rences crois&eacute;es entre les attributs. Le graphique d'objet sous chaque cl&eacute; d'attribut distincte est s&eacute;rialis&eacute; et stock&eacute; s&eacute;par&eacute;ment. S'il existe des r&eacute;f&eacute;rences crois&eacute;es entre les objets situ&eacute;s sous chaque cl&eacute;, ceux-ci ne seront pas s&eacute;rialis&eacute;s ni d&eacute;s&eacute;rialis&eacute;s correctement.</p>
</li>
<li>
<p>Distribuez l'&eacute;tat de session entre plusieurs attributs, ou au moins entre un attribut en lecture seule et un attribut modifiable.</p>
</li>
</ul>
</li>
</ul>
</dd>
<dt>Etat SSO</dt>
<dd>
<p>Si la case Activ&eacute; est coch&eacute;e, l'&eacute;tat de connexion unique est disponible pour le basculement apr&egrave;s incident.</p>
</dd>
<dt>Autres propri&eacute;t&eacute;s</dt>
<dd>
<p>Propri&eacute;t&eacute;s suppl&eacute;mentaires de disponibilit&eacute; du conteneur Web.</p>
<p>GlassFish Server ne d&eacute;finit aucune autre propri&eacute;t&eacute; de disponibilit&eacute; du conteneur Web.</p>
</dd>
</dl>
<a id="sthref81" name="sthref81"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-webcontainergeneral.html">Configuration des propri&eacute;t&eacute;s g&eacute;n&eacute;rales pour le conteneur Web</a></p>
</li>
<li>
<p><a href="task-webcontainersessiontimeout.html">Configuration des propri&eacute;t&eacute;s de session pour le conteneur Web</a></p>
</li>
<li>
<p><a href="task-webcontainermanagerprops.html">Configuration des propri&eacute;t&eacute;s de gestionnaire pour le conteneur Web</a></p>
</li>
<li>
<p><a href="task-webcontainerstoreprops.html">Configuration des propri&eacute;t&eacute;s de stockage pour le conteneur Web</a></p>
</li>
<li>
<p><a href="task-webcontaineravailability.html">Configuration des param&egrave;tres de disponibilit&eacute; du conteneur Web</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
