<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-transportnew" name="ref-transportnew"></a></p>

<h4><a id="sthref163" name="sthref163"></a>Nouveau transport</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilisez la page Nouveau transport pour cr&eacute;er un transport.</p>
<p>Il est rare qu'un autre transport que celui par d&eacute;faut (<code>tcp</code>) soit n&eacute;cessaire.</p>
<p>La page Nouveau transport contient les options suivantes :</p>
<dl>
<dt>Nom de configuration</dt>
<dd>
<p>Nom de la configuration &agrave; laquelle s'appliquent les param&egrave;tres de cette page. Ce champ est en lecture seule.</p>
</dd>
<dt>Nom du transport</dt>
<dd>
<p>Nom unique du transport.</p>
</dd>
<dt>Nom de la classe</dt>
<dd>
<p>Nom de classe de l'impl&eacute;mentation de transport. La valeur par d&eacute;faut est <code>com.sun.grizzly.TCPSelectorHandler</code>.</p>
</dd>
<dt>Gestionnaire de cl&eacute; de s&eacute;lection</dt>
<dd>
<p>Nom de classe du gestionnaire de cl&eacute; de s&eacute;lection. Le gestionnaire de cl&eacute; de s&eacute;lection est une classe abstraite qui g&egrave;re le cycle de vie des cl&eacute;s de s&eacute;lection. Si vous ne sp&eacute;cifiez pas de valeur, une impl&eacute;mentation par d&eacute;faut est utilis&eacute;e.</p>
</dd>
<dt>Type de tampon d'octet</dt>
<dd>
<p>Type <code>ByteBuffer</code> &agrave; utiliser. Les choix disponibles sont <code>HEAP</code> et <code>DIRECT</code>. La valeur par d&eacute;faut est <code>HEAP</code>.</p>
</dd>
<dt>Threads d'accepteur</dt>
<dd>
<p>Nombre de processeurs de l'ordinateur. La valeur -1 indique que Grizzly calculera lui-m&ecirc;me le nombre de threads d'accepteur, en fonction du nombre de processeurs de l'ordinateur. La valeur par d&eacute;faut est 1.</p>
<p>Pour d&eacute;finir le nombre de threads de traitement des demandes, d&eacute;finissez la taille maximale du pool de threads utilis&eacute; par un processus d'&eacute;coute r&eacute;seau qui emploie ce transport.</p>
</dd>
<dt>Nombre max. de connexions</dt>
<dd>
<p>Nombre maximal de connexions en attente sur un processus d'&eacute;coute r&eacute;seau qui utilise ce transport. La valeur par d&eacute;faut est 4 096.</p>
</dd>
<dt>Taille du tampon</dt>
<dd>
<p>Taille (en octets) de la m&eacute;moire tampon &agrave; fournir pour les flux d'entr&eacute;e cr&eacute;&eacute;s par un processus d'&eacute;coute r&eacute;seau qui utilise ce transport. La valeur par d&eacute;faut est 8 192.</p>
</dd>
<dt>Expiration de cl&eacute; d'inactivit&eacute;</dt>
<dd>
<p>D&eacute;lai (en secondes) apr&egrave;s lequel la cl&eacute; d'inactivit&eacute; sera annul&eacute;e et le canal ferm&eacute;. La valeur par d&eacute;faut est 30.</p>
</dd>
<dt>Expiration de la lecture</dt>
<dd>
<p>D&eacute;lai d'attente (en millisecondes) de GlassFish Server lors de la phase d'analyse de l'en-t&ecirc;te et du corps d'une op&eacute;ration de lecture. La valeur par d&eacute;faut est 30 000.</p>
</dd>
<dt>Expiration de l'interrogation du s&eacute;lecteur</dt>
<dd>
<p>Dur&eacute;e (en millisecondes) de blocage d'un s&eacute;lecteur NIO en attente d'&eacute;v&eacute;nements (demandes utilisateur). La valeur par d&eacute;faut est 1000.</p>
</dd>
<dt>Expiration de l'&eacute;criture</dt>
<dd>
<p>D&eacute;lai d'attente (en millisecondes) de GlassFish Server avant qu'il ne consid&egrave;re que le client distant est d&eacute;connect&eacute; lors de l'&eacute;criture de la r&eacute;ponse. La valeur par d&eacute;faut est 30 000.</p>
</dd>
<dt>Configuration de l'affichage</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, la configuration interne de Grizzly est vid&eacute;e vers les journaux du serveur. Cette option peut fournir des informations int&eacute;ressantes pour le d&eacute;bogage. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Surveillance du trafic</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, les informations de demande/r&eacute;ponse sont vid&eacute;es vers le journal du serveur. Cette option peut fournir des informations int&eacute;ressantes pour le d&eacute;bogage, mais risque de r&eacute;duire consid&eacute;rablement les performances. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Aucun d&eacute;lai TCP</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, TCP_NODELAY (&eacute;galement appel&eacute; algorithme de Nagle) est activ&eacute;. Cette option est activ&eacute;e par d&eacute;faut.</p>
</dd>
</dl>
<a id="sthref164" name="sthref164"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-transportnew.html">Cr&eacute;ation d'un transport</a></p>
</li>
<li>
<p><a href="task-transportedit.html">Modification d'un transport</a></p>
</li>
<li>
<p><a href="task-transportdelete.html">Suppression d'un transport</a></p>
</li>
</ul>
<a id="sthref165" name="sthref165"></a>
<h5>Commandes asadmin connexes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00061"><code>create-transport</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00206"><code>list-transports</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00112"><code>delete-transport</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
