<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-protocolhttpedit" name="ref-protocolhttpedit"></a></p>

<h4><a id="sthref152" name="sthref152"></a><a id="sthref153" name="sthref153"></a>HTTP</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilisez la page HTTP pour modifier les param&egrave;tres HTTP d'un protocole r&eacute;seau.</p>
<p>La page HTTP contient les options suivantes :</p>
<dl>
<dt>Charger les valeurs par d&eacute;faut</dt>
<dd>
<p>Bouton permettant de restaurer les valeurs par d&eacute;faut des param&egrave;tres qui en ont. Les param&egrave;tres qui n'ont pas de valeurs par d&eacute;faut ne sont pas modifi&eacute;s.</p>
</dd>
<dt>Nom de configuration</dt>
<dd>
<p>Nom de la configuration &agrave; laquelle s'appliquent les param&egrave;tres de cette page. Ce champ est en lecture seule.</p>
</dd>
<dt>Nom du protocole</dt>
<dd>
<p>Nom du protocole. Le champ Nom du protocole est en lecture seule. Vous ne pouvez sp&eacute;cifier le nom qu'&agrave; la cr&eacute;ation du protocole.</p>
</dd>
<dt>Nom du serveur</dt>
<dd>
<p>Nom d'h&ocirc;te &agrave; utiliser dans les URL envoy&eacute;es par le serveur au client. Ce nom correspond &agrave; l'alias si votre serveur en utilise un. Si votre serveur n'utilise aucun alias, laissez ce champ vide.</p>
</dd>
<dt>Serveur virtuel par d&eacute;faut</dt>
<dd>
<p>Serveur virtuel &agrave; associer au protocole. La page Serveurs virtuels permet de d&eacute;finir des serveurs virtuels.</p>
</dd>
<dt>Port de redirection</dt>
<dd>
<p>Valeur de port qui r&eacute;achemine une demande vers un autre port. GlassFish Server r&eacute;achemine automatiquement la demande si les deux conditions suivantes sont remplies :</p>
<ul>
<li>
<p>Ce protocole prend en charge les demandes non SSL.</p>
</li>
<li>
<p>Une demande est re&ccedil;ue. Une contrainte de s&eacute;curit&eacute; correspondante requiert le transport SSL.</p>
</li>
</ul>
<p>Si aucun port de redirection n'est sp&eacute;cifi&eacute;, GlassFish Server utilise le num&eacute;ro de port sp&eacute;cifi&eacute; dans la demande d'origine.</p>
</dd>
<dt>Nombre max. de connexions</dt>
<dd>
<p>Nombre maximal de connexions persistantes &agrave; maintenir. Le sous-syst&egrave;me de maintien des connexions interroge p&eacute;riodiquement les connexions inactives. La valeur par d&eacute;faut est 256.</p>
</dd>
<dt>Expiration</dt>
<dd>
<p>Temps maximal (en secondes) pendant lequel une connexion peut &ecirc;tre consid&eacute;r&eacute;e comme inactive et maintenue. Une valeur inf&eacute;rieure ou &eacute;gale &agrave; 0 signifie que les connexions maintenues restent ouvertes ind&eacute;finiment. La valeur par d&eacute;faut est de 30 secondes.</p>
<p>La valeur -1 d&eacute;sactive la temporisation.</p>
</dd>
<dt>Expiration des chargements</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, la connexion d'un servlet qui lit les octets lentement est ferm&eacute;e une fois que le d&eacute;lai de temporisation du chargement de la connexion est atteint. Si cette option est d&eacute;sactiv&eacute;e, les connexions de servlet ne font pas l'objet de temporisations. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Expiration du chargement de la connexion</dt>
<dd>
<p>Temporisation des chargements, en millisecondes. Ce champ n'est applicable que si la case Activ&eacute; de l'option Expiration des chargements est coch&eacute;e. La valeur par d&eacute;faut est 300 000 millisecondes.</p>
<p>La valeur -1 d&eacute;sactive la temporisation.</p>
</dd>
<dt>Expiration des demandes</dt>
<dd>
<p>D&eacute;lai (en secondes) avant l'expiration de la demande. Si la demande n'est pas trait&eacute;e avant que la valeur de temporisation soit atteinte, la demande n'est pas prise en compte. La valeur par d&eacute;faut est de 30 secondes.</p>
<p>La valeur -1 d&eacute;sactive la temporisation.</p>
</dd>
<dt>Taille du tampon d'envoi</dt>
<dd>
<p>Taille (en octets) de la m&eacute;moire tampon d'envoi. La valeur par d&eacute;faut est 8 192 octets.</p>
</dd>
<dt>Longueur du tampon d'en-t&ecirc;te</dt>
<dd>
<p>Taille (en octets) de la m&eacute;moire tampon utilis&eacute;e par la demande traitant les threads pour lire les donn&eacute;es de la demande. La valeur par d&eacute;faut est 8 192 octets.</p>
</dd>
<dt>Taille max. des actions POST</dt>
<dd>
<p>Taille maximale, en octets, des actions POST qui utilisent application/x-www-form-urlencoded. La valeur par d&eacute;faut est 2 097 152 octets.</p>
</dd>
<dt>Codage d'URI</dt>
<dd>
<p>Nom du jeu de caract&egrave;res utilis&eacute; pour d&eacute;coder les URI de demande re&ccedil;us. La valeur doit &ecirc;tre un nom de jeu de caract&egrave;res IANA valide. La valeur par d&eacute;faut est UTF-8.</p>
</dd>
<dt>Version</dt>
<dd>
<p>Version du protocole HTTP utilis&eacute;e. La valeur par d&eacute;faut est HTTP/1.1.</p>
</dd>
<dt>Compression</dt>
<dd>
<p>Sp&eacute;cifie l'utilisation de la compression HTTP/1.1 GZIP pour enregistrer la bande passante du serveur. Les choix disponibles sont les suivants :</p>
<dl>
<dt><code>on</code></dt>
<dd>
<p>Compresse les donn&eacute;es.</p>
</dd>
<dt><code>off</code></dt>
<dd>
<p>D&eacute;sactive la compression.</p>
</dd>
<dt><code>force</code></dt>
<dd>
<p>Force la compression des donn&eacute;es dans tous les cas.</p>
</dd>
</dl>
<p>La valeur par d&eacute;faut est <code>off</code>.</p>
</dd>
<dt>Type MIME compressible</dt>
<dd>
<p>Liste s&eacute;par&eacute;e par des virgules de types MIME pour lesquels la compression HTTP est utilis&eacute;e. La valeur par d&eacute;faut est <code>text/html,text/xml,text/plain</code>.</p>
</dd>
<dt>Taille minimale de compression</dt>
<dd>
<p>Taille minimale d'un fichier lorsque la compression est appliqu&eacute;e. Cette valeur doit &ecirc;tre configur&eacute;e si la compression est d&eacute;finie sur <code>on</code> ou <code>force</code>. La valeur par d&eacute;faut est 2 048 octets.</p>
</dd>
<dt>Agents utilisateur sans compression</dt>
<dd>
<p>Liste d'expressions r&eacute;guli&egrave;res, s&eacute;par&eacute;es par des virgules, correspondant &agrave; des agents utilisateur de clients HTTP pour lesquels la compression ne doit pas &ecirc;tre utilis&eacute;e. Par d&eacute;faut, cette valeur est une cha&icirc;ne vide.</p>
</dd>
<dt>Agent utilisateur limit&eacute;</dt>
<dd>
<p>Liste des agents utilisateur limit&eacute;s sur lesquels la compression HTTP est appliqu&eacute;e. Si aucun agent utilisateur n'est sp&eacute;cifi&eacute;, la compression HTTP est appliqu&eacute;e &agrave; tous les agents utilisateur. Par d&eacute;faut, aucun agent utilisateur n'est sp&eacute;cifi&eacute;.</p>
</dd>
<dt>Type de r&eacute;ponse par d&eacute;faut</dt>
<dd>
<p>Cha&icirc;ne qui sp&eacute;cifie le type de r&eacute;ponse par d&eacute;faut. Le format est une cha&icirc;ne d'&eacute;l&eacute;ments, s&eacute;par&eacute;s par des points-virgules, pr&eacute;sentant le type de contenu, l'encodage, la langue et le jeu de caract&egrave;res. La valeur par d&eacute;faut est <code>text/html; charset=iso-8859-1</code>.</p>
</dd>
<dt>Type de r&eacute;ponse forc&eacute;e</dt>
<dd>
<p>Cha&icirc;ne qui sp&eacute;cifie le type de demande utilis&eacute; si aucun mapping MIME correspondant &agrave; l'extension du fichier n'est disponible. Le format est une cha&icirc;ne d'&eacute;l&eacute;ments, s&eacute;par&eacute;s par des points-virgules, pr&eacute;sentant le type de contenu, l'encodage, la langue et le jeu de caract&egrave;res. La valeur par d&eacute;faut est <code>text/html; charset=iso-8859-1</code>.</p>
</dd>
<dt>Adaptateur</dt>
<dd>
<p>Nom de classe de l'adaptateur de ressources statique. La valeur par d&eacute;faut est <code>com.sun.grizzly.tcp.StaticResourcesAdapter</code>.</p>
</dd>
<dt>Support Comet</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, le support Comet est activ&eacute; pour le protocole. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Recherche DNS</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, la recherche DNS est activ&eacute;e. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Prise en charge de RCM</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, RCM est activ&eacute;. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Trace</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, l'op&eacute;ration TRACE est activ&eacute;e. Si cette option est d&eacute;sactiv&eacute;e, GlassFish Server est moins expos&eacute; &agrave; des attaques de scripts entre sites. Cette option est activ&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Pass-through d'auth.</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, le processus d'&eacute;coute r&eacute;seau qui utilise ce protocole re&ccedil;oit le trafic d'un serveur proxy &agrave; terminaison SSL. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Segmentation</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, la segmentation des r&eacute;ponses HTTP est activ&eacute;e. Cette option est activ&eacute;e par d&eacute;faut.</p>
</dd>
<dt>XPowered By</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, GlassFish Server utilise les en-t&ecirc;tes <code>X-Powered-By</code> en fonction des sp&eacute;cifications Java Servlet 3.0 et Java Server Pages 2.0. Cette option est activ&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Barre oblique encod&eacute;e</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, les URI peuvent contenir des barres obliques encod&eacute;es. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Prise en charge Websockets</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, le protocole WebSockets est pris en charge. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
</dl>
<a id="sthref154" name="sthref154"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-protocolnew.html">Cr&eacute;ation d'un protocole</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">Modification d'un protocole</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">Modification des param&egrave;tres SSL pour un protocole</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">Modification des param&egrave;tres HTTP pour un protocole</a></p>
</li>
<li>
<p><a href="task-protocolfilecacheedit.html">Modification des param&egrave;tres de cache de fichiers pour un protocole</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">Suppression d'un protocole</a></p>
</li>
</ul>
<a id="sthref155" name="sthref155"></a>
<h5>Commandes asadmin connexes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00051"><code>create-protocol</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00195"><code>list-protocols</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00103"><code>delete-protocol</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
