<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-httpserviceprops" name="ref-httpserviceprops"></a></p>

<h4><a id="sthref108" name="sthref108"></a><a id="sthref109" name="sthref109"></a>Propri&eacute;t&eacute;s propres au service HTTP</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Les propri&eacute;t&eacute;s suppl&eacute;mentaires suivantes sont disponibles pour le service HTTP. Si vous sp&eacute;cifiez ces propri&eacute;t&eacute;s, elles s'appliquent &agrave; tous les &eacute;l&eacute;ments <a href="ref-group-networklisteners.html">Processus d'&eacute;coute r&eacute;seau</a>.</p>
<dl>
<dt><code>ssl-cache-entriese</code></dt>
<dd>
<p>Nombre de sessions SSL &agrave; mettre en m&eacute;moire cache. La valeur par d&eacute;faut est 10 000.</p>
</dd>
<dt><code>ssl3-session-timeout</code></dt>
<dd>
<p>Intervalle de mise en m&eacute;moire cache des sessions SSL3. La valeur par d&eacute;faut est 86 400.</p>
</dd>
<dt><code>ssl-session-timeout</code></dt>
<dd>
<p>Intervalle de mise en m&eacute;moire cache des sessions SSL2. La valeur par d&eacute;faut est 100.</p>
</dd>
<dt><code>proxyHandler</code></dt>
<dd>
<p>Nom de classe qualifi&eacute; complet d'une impl&eacute;mentation personnalis&eacute;e de la classe abstraite <code>com.sun.appserv.ProxyHandler</code>, permettant &agrave; une instance GlassFish Server back-end d'extraire des informations sur la demande client d'origine qui a &eacute;t&eacute; intercept&eacute;e par un serveur proxy &agrave; terminaison SSL (un &eacute;quilibreur de charge, par exemple). Une impl&eacute;mentation de cette classe abstraite recherche dans une demande donn&eacute;e les en-t&ecirc;tes de demande personnalis&eacute;s via lesquels le serveur proxy transmet les informations sur la demande client d'origine &agrave; l'instance Enterprise Server, puis renvoie ces informations &agrave; l'appelant.</p>
<p>L'impl&eacute;mentation par d&eacute;faut lit l'adresse IP du client &agrave; partir d'un en-t&ecirc;te de demande HTTP appel&eacute; <code>Proxy-ip</code>, la valeur <code>keysize</code> SSL &agrave; partir d'un en-t&ecirc;te de demande HTTP appel&eacute; <code>Proxy-keysize</code> et la cha&icirc;ne de certificats client SSL &agrave; partir d'un en-t&ecirc;te de demande HTTP appel&eacute; <code>Proxy-auth-cert</code>. La valeur <code>Proxy-auth-cert</code> doit contenir la cha&icirc;ne de certificats client encod&eacute;e en BASE-64 sans les limites <code>BEGIN CERTIFICATE</code> et <code>END CERTIFICATE</code> et avec <code>\n</code> remplac&eacute; par <code>% d% a</code>.</p>
<p>Ce param&egrave;tre est utilis&eacute; uniquement si la valeur Pass-through d'auth. de la page HTTP du protocole de processus d'&eacute;coute r&eacute;seau est True.</p>
</dd>
<dt><code>connectionTimeout</code></dt>
<dd>
<p>Sp&eacute;cifie le nombre de secondes pendant lesquelles les processus d'&eacute;coute r&eacute;seau attendent que la ligne d'URI de demande soit pr&eacute;sent&eacute;e, apr&egrave;s avoir accept&eacute; une connexion. La valeur par d&eacute;faut est 30.</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
