<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-storeproptab" name="ref-storeproptab"></a><a id="GHWEB00007" name="GHWEB00007"></a></p>

<h4><a id="sthref99" name="sthref99"></a><a id="sthref100" name="sthref100"></a><a id="sthref101" name="sthref101"></a>Propri&eacute;t&eacute;s de stockage</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Propri&eacute;t&eacute;s de stockage permet d'ajouter ou de modifier les propri&eacute;t&eacute;s de persistance (stockage) de session pour le conteneur Web.</p>
<p>La page Propri&eacute;t&eacute;s de stockage contient les options suivantes :</p>
<dl>
<dt>Nom de configuration</dt>
<dd>
<p>Nom de la configuration &agrave; laquelle s'appliquent les param&egrave;tres de cette page. Ce champ est en lecture seule.</p>
</dd>
<dt>R&eacute;pertoire</dt>
<dd>
<p>Chemin absolu ou relatif du r&eacute;pertoire dans lequel les fichiers des sessions individuelles sont &eacute;crits. La valeur par d&eacute;faut est domain-dir<code>/generated/jsp/j2ee-apps/</code><i>appname</i><code>/</code><i>appname</i><code>_war</code>. Un chemin relatif est relatif au r&eacute;pertoire de travail temporaire pour cette application Web.</p>
</dd>
<dt>Autres propri&eacute;t&eacute;s</dt>
<dd>
<p>Autres propri&eacute;t&eacute;s du stockage. GlassFish Server ne d&eacute;finit aucune autre propri&eacute;t&eacute; pour le stockage.</p>
</dd>
</dl>
<a id="sthref102" name="sthref102"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-webcontainergeneral.html">Configuration des propri&eacute;t&eacute;s g&eacute;n&eacute;rales pour le conteneur Web</a></p>
</li>
<li>
<p><a href="task-webcontainersessiontimeout.html">Configuration des propri&eacute;t&eacute;s de session pour le conteneur Web</a></p>
</li>
<li>
<p><a href="task-webcontainermanagerprops.html">Configuration des propri&eacute;t&eacute;s de gestionnaire pour le conteneur Web</a></p>
</li>
<li>
<p><a href="task-webcontainerstoreprops.html">Configuration des propri&eacute;t&eacute;s de stockage pour le conteneur Web</a></p>
</li>
<li>
<p><a href="task-webcontaineravailability.html">Configuration des param&egrave;tres de disponibilit&eacute; du conteneur Web</a></p>
</li>
</ul>
<a id="sthref103" name="sthref103"></a>
<h5>Commandes asadmin connexes</h5>
<p>Aucune.</p>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
