<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-protocolfilecacheedit" name="ref-protocolfilecacheedit"></a><a id="GHWEB00023" name="GHWEB00023"></a></p>

<h4><a id="sthref156" name="sthref156"></a><a id="sthref157" name="sthref157"></a>Cache de fichiers</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilisez la page Cache de fichiers pour modifier les param&egrave;tres du cache de fichiers d'un protocole r&eacute;seau.</p>
<p>Elle contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Charger les valeurs par d&eacute;faut</dt>
<dd>
<p>Bouton permettant de restaurer les valeurs par d&eacute;faut des param&egrave;tres qui en ont. Les param&egrave;tres qui n'ont pas de valeurs par d&eacute;faut ne sont pas modifi&eacute;s.</p>
</dd>
<dt>Nom de configuration</dt>
<dd>
<p>Nom de la configuration &agrave; laquelle s'appliquent les param&egrave;tres de cette page. Ce champ est en lecture seule.</p>
</dd>
<dt>Nom du protocole</dt>
<dd>
<p>Nom du protocole. Le champ Nom du protocole est en lecture seule. Vous ne pouvez sp&eacute;cifier le nom qu'&agrave; la cr&eacute;ation du protocole.</p>
</dd>
<dt>Statut</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, le statut du cache de fichiers est activ&eacute;. Cette option est s&eacute;lectionn&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Age max.</dt>
<dd>
<p>Age maximal, en secondes, d'une entr&eacute;e de cache valide.</p>
<p>Ce param&egrave;tre d&eacute;termine combien de temps les informations en m&eacute;moire cache sont utilis&eacute;es apr&egrave;s la mise en m&eacute;moire cache d'un fichier. Une entr&eacute;e ant&eacute;rieure &agrave; l'&acirc;ge maximal est remplac&eacute;e par une nouvelle entr&eacute;e pour le m&ecirc;me fichier. Si le contenu change rarement, augmentez cette valeur pour am&eacute;liorer les performances.</p>
<p>L'&acirc;ge maximal optimal d&eacute;pend de la fr&eacute;quence &agrave; laquelle les fichiers existants sont modifi&eacute;s. Par exemple, si les fichiers sont modifi&eacute;s quatre fois par jour &agrave; intervalles r&eacute;guliers, vous pouvez d&eacute;finir l'&acirc;ge maximal sur 21 600 secondes (6 heures). Sinon, vous pouvez d&eacute;finir l'&acirc;ge maximal sur la p&eacute;riode la plus longue durant laquelle vous acceptez d'utiliser la version pr&eacute;c&eacute;dente d'un fichier apr&egrave;s sa modification.</p>
<p>La valeur par d&eacute;faut est 30.</p>
</dd>
<dt>Taille max. du cache</dt>
<dd>
<p>Taille totale maximale (en octets) du cache de fichiers sur le disque. La valeur par d&eacute;faut est 10 485 760.</p>
</dd>
<dt>Nombre max. de fichiers</dt>
<dd>
<p>Nombre maximal de fichiers pouvant &ecirc;tre stock&eacute;s dans le cache de fichiers.</p>
<p>Si la valeur est trop &eacute;lev&eacute;e, le serveur met en m&eacute;moire cache les fichiers peu utiles qui consomment de la m&eacute;moire. Si elle est trop faible, vous perdez l'avantage de la mise en m&eacute;moire cache. Testez diff&eacute;rentes valeurs de cet attribut pour rechercher la solution optimale pour des applications sp&eacute;cifiques.</p>
<p>La valeur par d&eacute;faut est 1024.</p>
</dd>
</dl>
<a id="sthref158" name="sthref158"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-protocolnew.html">Cr&eacute;ation d'un protocole</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">Modification d'un protocole</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">Modification des param&egrave;tres SSL pour un protocole</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">Modification des param&egrave;tres HTTP pour un protocole</a></p>
</li>
<li>
<p><a href="task-protocolfilecacheedit.html">Modification des param&egrave;tres de cache de fichiers pour un protocole</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">Suppression d'un protocole</a></p>
</li>
</ul>
<a id="sthref159" name="sthref159"></a>
<h5>Commandes asadmin connexes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00051"><code>create-protocol</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00195"><code>list-protocols</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00103"><code>delete-protocol</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
