<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-sessionproptab" name="ref-sessionproptab"></a><a id="GHWEB00004" name="GHWEB00004"></a></p>

<h4><a id="sthref87" name="sthref87"></a><a id="sthref88" name="sthref88"></a><a id="sthref89" name="sthref89"></a>Propri&eacute;t&eacute;s de session</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Propri&eacute;t&eacute;s de la session permet d'ajouter ou de modifier les propri&eacute;t&eacute;s de la session de conteneur Web.</p>
<p>La page Propri&eacute;t&eacute;s de la session contient les options suivantes :</p>
<dl>
<dt>Charger les valeurs par d&eacute;faut</dt>
<dd>
<p>Bouton permettant de restaurer les valeurs par d&eacute;faut des param&egrave;tres qui en ont. Les param&egrave;tres qui n'ont pas de valeurs par d&eacute;faut ne sont pas modifi&eacute;s.</p>
</dd>
<dt>Nom de configuration</dt>
<dd>
<p>Nom de la configuration &agrave; laquelle s'appliquent les param&egrave;tres de cette page. Ce champ est en lecture seule.</p>
</dd>
<dt>D&eacute;lai d'expiration de session</dt>
<dd>
<p>Sp&eacute;cifie le nombre maximal de secondes pendant lesquelles une session inactive reste valide. Si la valeur est d&eacute;finie sur 0 ou moins, les sessions n'expirent jamais. La valeur par d&eacute;faut est 1 800.</p>
</dd>
<dt>Autres propri&eacute;t&eacute;s</dt>
<dd>
<p>Autres propri&eacute;t&eacute;s pour les sessions de conteneur Web. Pour obtenir une description des propri&eacute;t&eacute;s disponibles, reportez-vous &agrave; <a href="ref-websessionproperties.html">Propri&eacute;t&eacute;s propres aux sessions de conteneur Web</a>.</p>
</dd>
</dl>
<a id="sthref90" name="sthref90"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-webcontainergeneral.html">Configuration des propri&eacute;t&eacute;s g&eacute;n&eacute;rales pour le conteneur Web</a></p>
</li>
<li>
<p><a href="task-webcontainersessiontimeout.html">Configuration des propri&eacute;t&eacute;s de session pour le conteneur Web</a></p>
</li>
<li>
<p><a href="task-webcontainermanagerprops.html">Configuration des propri&eacute;t&eacute;s de gestionnaire pour le conteneur Web</a></p>
</li>
<li>
<p><a href="task-webcontainerstoreprops.html">Configuration des propri&eacute;t&eacute;s de stockage pour le conteneur Web</a></p>
</li>
<li>
<p><a href="task-webcontaineravailability.html">Configuration des param&egrave;tres de disponibilit&eacute; du conteneur Web</a></p>
</li>
</ul>
<a id="sthref91" name="sthref91"></a>
<h5>Commandes asadmin connexes</h5>
<p>Aucune.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
