<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-managerproptab" name="ref-managerproptab"></a></p>

<h4><a id="sthref95" name="sthref95"></a><a id="sthref96" name="sthref96"></a>Propri&eacute;t&eacute;s du gestionnaire</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Le gestionnaire de sessions permet de d&eacute;terminer le processus de cr&eacute;ation et de suppression des sessions, l'emplacement de stockage de l'&eacute;tat des sessions, ainsi que le nombre maximal de sessions disponibles.</p>
<p>La page Propri&eacute;t&eacute;s du gestionnaire permet d'ajouter ou de modifier les propri&eacute;t&eacute;s du gestionnaire de sessions pour le conteneur Web.</p>
<p>La page Propri&eacute;t&eacute;s du gestionnaire contient les options suivantes :</p>
<dl>
<dt>Charger les valeurs par d&eacute;faut</dt>
<dd>
<p>Bouton permettant de restaurer les valeurs par d&eacute;faut des param&egrave;tres qui en ont. Les param&egrave;tres qui n'ont pas de valeurs par d&eacute;faut ne sont pas modifi&eacute;s.</p>
</dd>
<dt>Nom de configuration</dt>
<dd>
<p>Nom de la configuration &agrave; laquelle s'appliquent les param&egrave;tres de cette page. Ce champ est en lecture seule.</p>
</dd>
<dt>Intervalle de r&eacute;cup&eacute;ration</dt>
<dd>
<p>Nombre de secondes devant s'&eacute;couler avant que les donn&eacute;es de la session inactive soient supprim&eacute;es. La valeur par d&eacute;faut est 60.</p>
<p>Cette valeur doit &ecirc;tre inf&eacute;rieure &agrave; la fr&eacute;quence &agrave; laquelle les donn&eacute;es de session sont modifi&eacute;es. Par exemple, elle doit &ecirc;tre la plus faible possible (1 seconde) pour un servlet de compteur de r&eacute;sultats sur un site Web auquel l'acc&egrave;s est fr&eacute;quent ; dans le cas contraire, vous risquez de perdre les derniers r&eacute;sultats trouv&eacute;s &agrave; chaque fois que vous red&eacute;marrez le serveur.</p>
</dd>
<dt>Nombre maximal de sessions</dt>
<dd>
<p>Nombre maximal de sessions pouvant &ecirc;tre pr&eacute;sentes dans le cache. La valeur -1 indique que le nombre de sessions est illimit&eacute;. La valeur par d&eacute;faut est -1.</p>
<p>Une fois la limite atteinte, toute tentative de cr&eacute;ation d'une session provoque l'&eacute;mission d'une exception <code>IllegalStateException</code>.</p>
</dd>
<dt>Nom du fichier de session</dt>
<dd>
<p>Chemin absolu ou relatif du r&eacute;pertoire dans lequel l'&eacute;tat de la session est conserv&eacute; entre les red&eacute;marrages d'application, si la conservation de l'&eacute;tat est possible. Si ce chemin n'est pas d&eacute;fini, l'&eacute;tat de la session n'est pas conserv&eacute;. Par d&eacute;faut, ce chemin n'est pas d&eacute;fini.</p>
<p>Un chemin relatif est relatif au r&eacute;pertoire temporaire pour cette application Web.</p>
</dd>
<dt>Nom de classe du g&eacute;n&eacute;rateur d'ID de session</dt>
<dd>
<p>Classe personnalis&eacute;e pour la g&eacute;n&eacute;ration d'ID de session uniques. Une seule classe de g&eacute;n&eacute;rateur d'ID de session par serveur d'instance est autoris&eacute;e et toutes les instances dans un cluster doivent utiliser le m&ecirc;me g&eacute;n&eacute;rateur d'ID de session pour &eacute;viter la collision des cl&eacute;s de session. Cette classe doit se trouver dans la variable d'environnement CLASSPATH du serveur d'applications. Par d&eacute;faut, aucune classe personnalis&eacute;e n'est d&eacute;finie.</p>
</dd>
<dt>Autres propri&eacute;t&eacute;s</dt>
<dd>
<p>Propri&eacute;t&eacute;s suppl&eacute;mentaires du gestionnaire de sessions. GlassFish Server ne d&eacute;finit aucune autre propri&eacute;t&eacute; pour le gestionnaire de sessions.</p>
</dd>
</dl>
<a id="sthref97" name="sthref97"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-webcontainergeneral.html">Configuration des propri&eacute;t&eacute;s g&eacute;n&eacute;rales pour le conteneur Web</a></p>
</li>
<li>
<p><a href="task-webcontainersessiontimeout.html">Configuration des propri&eacute;t&eacute;s de session pour le conteneur Web</a></p>
</li>
<li>
<p><a href="task-webcontainermanagerprops.html">Configuration des propri&eacute;t&eacute;s de gestionnaire pour le conteneur Web</a></p>
</li>
<li>
<p><a href="task-webcontainerstoreprops.html">Configuration des propri&eacute;t&eacute;s de stockage pour le conteneur Web</a></p>
</li>
<li>
<p><a href="task-webcontaineravailability.html">Configuration des param&egrave;tres de disponibilit&eacute; du conteneur Web</a></p>
</li>
</ul>
<a id="sthref98" name="sthref98"></a>
<h5>Commandes asadmin connexes</h5>
<p>Aucune.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
