<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-virtualserverprops" name="ref-virtualserverprops"></a></p>

<h4><a id="sthref125" name="sthref125"></a><a id="sthref126" name="sthref126"></a>Propri&eacute;t&eacute;s propres aux serveurs virtuels</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Les autres propri&eacute;t&eacute;s suivantes sont disponibles pour un serveur virtuel.</p>
<dl>
<dt><code>sso-max-inactive-seconds</code></dt>
<dd>
<p>Indique le d&eacute;lai (en secondes) au-del&agrave; duquel l'enregistrement de connexion unique d'un utilisateur peut &ecirc;tre purg&eacute; si aucune activit&eacute; client n'est d&eacute;tect&eacute;e. Etant donn&eacute; que la connexion unique s'applique &agrave; plusieurs applications sur le m&ecirc;me serveur virtuel, le fait d'acc&eacute;der &agrave; une application permet de garder l'enregistrement de connexion unique actif.</p>
<p>La valeur par d&eacute;faut est de 300 secondes (5 minutes). Des valeurs sup&eacute;rieures offrent aux utilisateurs une persistance de connexion unique sup&eacute;rieure, mais avec une plus grande consommation de m&eacute;moire sur le serveur.</p>
</dd>
<dt><code>sso-reap-interval-seconds</code></dt>
<dd>
<p>Indique le nombre de secondes entre les purges des enregistrements de connexion unique arriv&eacute;s &agrave; expiration.</p>
<p>La valeur par d&eacute;faut est 60.</p>
</dd>
<dt><code>ssoCookieSecure</code></dt>
<dd>
<p>D&eacute;finit l'attribut <code>Secure</code> de tous les cookies <code>JSESSIONIDSSO</code> associ&eacute;s aux applications Web d&eacute;ploy&eacute;es sur ce serveur virtuel. Cette propri&eacute;t&eacute; s'applique uniquement si la fonction de connexion unique est activ&eacute;e. Les valeurs autoris&eacute;es sont les suivantes :</p>
<dl>
<dt><code>True</code></dt>
<dd>
<p>Attribue la valeur True &agrave; l'attribut <code>Secure</code>.</p>
</dd>
<dt><code>False</code></dt>
<dd>
<p>Attribue la valeur False &agrave; l'attribut <code>Secure</code>.</p>
</dd>
<dt><code>dynamic</code></dt>
<dd>
<p>Le cookie <code>JSESSIONIDSSO</code> h&eacute;rite du param&egrave;tre <code>Secure</code> de la premi&egrave;re session participant &agrave; la connexion unique.</p>
</dd>
</dl>
<p>Pour d&eacute;finir l'attribut Secure d'un cookie <code>JSESSIONID</code>, utilisez la propri&eacute;t&eacute; <code>cookieSecure</code> <code>cookie-properties</code> dans le fichier <code>sun-web.xml</code>. Pour plus d'informations, reportez vous &agrave; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00130"><i>cookie-properties</i> dans le manuel <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt><code>setCacheControl</code></dt>
<dd>
<p>Fournit la liste des directives de r&eacute;ponse <code>Cache-Control</code> s&eacute;par&eacute;es par des virgules. Pour obtenir la liste des directives valides, reportez-vous &agrave; la section 14.9 du document disponible &agrave; l'adresse http://www.ietf.org/rfc/rfc2616.txt (<code><a href="http://www.ietf.org/rfc/rfc2616.txt">http://www.ietf.org/rfc/rfc2616.txt</a></code>).</p>
</dd>
<dt><code>accessLogBufferSize</code></dt>
<dd>
<p>Indique la taille (en octets) du tampon dans lequel sont stock&eacute;s les appels du journal des acc&egrave;s. Si la valeur est inf&eacute;rieure &agrave; 5 120, un message d'avertissement est &eacute;mis et la valeur est d&eacute;finie sur 5 120. La valeur par d&eacute;faut est 32 768.</p>
</dd>
<dt><code>accessLogWriterInterval</code></dt>
<dd>
<p>Sp&eacute;cifie le d&eacute;lai (en secondes) avant l'&eacute;criture du journal sur le disque. Le journal des acc&egrave;s est &eacute;crit lorsque la m&eacute;moire tampon est pleine ou que l'intervalle expire. Si la valeur est &eacute;gale &agrave; z&eacute;ro, l'&eacute;criture continue dans la m&eacute;moire tampon m&ecirc;me si elle n'est pas pleine. Autrement dit, chaque fois qu'un utilisateur acc&egrave;de au serveur, le message de journal est directement stock&eacute; dans le fichier. La valeur par d&eacute;faut est 300.</p>
</dd>
<dt><code>allowRemoteAddress</code></dt>
<dd>
<p>Fournit une liste de mod&egrave;les d'expression r&eacute;guli&egrave;re (s&eacute;par&eacute;s par des virgules) auxquels l'adresse IP du client distant est compar&eacute;e. Si cette propri&eacute;t&eacute; est sp&eacute;cifi&eacute;e, l'adresse distante <i>doit</i> correspondre pour que cette demande soit accept&eacute;e. Si cette propri&eacute;t&eacute; n'est pas sp&eacute;cifi&eacute;e, toutes les demandes sont accept&eacute;es <i>&agrave; moins que</i> l'adresse distante ne corresponde au mod&egrave;le <code>denyRemoteAddress</code>.</p>
</dd>
<dt><code>denyRemoteAddress</code></dt>
<dd>
<p>Fournit une liste de mod&egrave;les d'expression r&eacute;guli&egrave;re (s&eacute;par&eacute;s par des virgules) auxquels l'adresse IP du client distant est compar&eacute;e. Si cette propri&eacute;t&eacute; est sp&eacute;cifi&eacute;e, l'adresse distante ne doit <i>pas</i> correspondre pour que cette demande soit accept&eacute;e. Si cette propri&eacute;t&eacute; n'est pas sp&eacute;cifi&eacute;e, l'acceptation de la demande est r&eacute;gie uniquement par la propri&eacute;t&eacute; <code>allowRemoteAddress</code>.</p>
</dd>
<dt><code>allowRemoteHost</code></dt>
<dd>
<p>Fournit une liste de mod&egrave;les d'expression r&eacute;guli&egrave;re (s&eacute;par&eacute;s par des virgules) auxquels le nom d'h&ocirc;te du client distant (tel que renvoy&eacute; par <code>[java.net.]Socket.getInetAddress().getHostName()</code>) est compar&eacute;. Si cette propri&eacute;t&eacute; est sp&eacute;cifi&eacute;e, le nom d'h&ocirc;te distant <i>doit</i> correspondre pour que cette demande soit accept&eacute;e. Si cette propri&eacute;t&eacute; n'est pas sp&eacute;cifi&eacute;e, toutes les demandes sont accept&eacute;es <i>&agrave; moins que</i> le nom d'h&ocirc;te distant ne corresponde au mod&egrave;le <code>denyRemoteHost</code>.</p>
</dd>
<dt><code>denyRemoteHost</code></dt>
<dd>
<p>Fournit une liste de mod&egrave;les d'expression r&eacute;guli&egrave;re (s&eacute;par&eacute;s par des virgules) auxquels le nom d'h&ocirc;te du client distant (tel que renvoy&eacute; par <code>[java.net.]Socket.getInetAddress().getHostName()</code>) est compar&eacute;. Si cette propri&eacute;t&eacute; est sp&eacute;cifi&eacute;e, le nom d'h&ocirc;te distant ne doit <i>pas</i> correspondre pour que cette demande soit accept&eacute;e. Si cette propri&eacute;t&eacute; n'est pas sp&eacute;cifi&eacute;e, l'acceptation de la demande est r&eacute;gie uniquement par la propri&eacute;t&eacute; <code>allowRemoteHost</code>.</p>
<p>La d&eacute;finition de cette propri&eacute;t&eacute; n'a aucun effet si l'acc&egrave;s au domaine GlassFish Server est effectu&eacute; par l'interm&eacute;diaire d'un processus d'&eacute;coute r&eacute;seau avec l'option Processus d'&eacute;coute JK activ&eacute;e.</p>
</dd>
<dt><code>authRealm</code></dt>
<dd>
<p>Sp&eacute;cifie le nom d'un domaine d'authentification, qui remplace le domaine par d&eacute;faut de l'instance du serveur pour les applications Web autonomes d&eacute;ploy&eacute;es sur ce serveur virtuel. Un domaine d&eacute;fini dans le fichier <code>web.xml</code> d'une application Web autonome remplace le domaine du serveur virtuel. Pour plus d'informations, reportez-vous &agrave; <a href="../../../common/en/help/ref-realms.html">Domaines</a>.</p>
</dd>
<dt><code>securePagesWithPragma</code></dt>
<dd>
<p>Attribuez la valeur <code>false</code> &agrave; cette propri&eacute;t&eacute; afin de vous assurer que, pour toutes les applications Web de ce serveur virtuel, les t&eacute;l&eacute;chargements de fichier via SSL fonctionnent correctement dans Internet Explorer.</p>
<p>Les applications Web individuelles peuvent remplacer ce param&egrave;tre en utilisant l'&eacute;l&eacute;ment <code>sun-web-app</code> du fichier <code>sun-web.xml</code>. Pour plus d'informations, reportez-vous &agrave; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>glassfish-web-app</i> dans le manuel <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
<p>La valeur par d&eacute;faut est <code>true</code>.</p>
</dd>
<dt><code>alternatedocroot_</code><i>n</i></dt>
<dd>
<p>Indique une autre racine de document (docroot), o&ugrave; <i>n</i> est un entier positif qui permet de sp&eacute;cifier plusieurs racines. Les autres racines de document permettent aux applications Web de traiter les demandes de certaines ressources en dehors de leur propre racine de document, selon que ces demandes correspondent &agrave; des mod&egrave;les d'URI des autres racines de document de l'application Web.</p>
<p>Si une demande correspond au mod&egrave;le d'URI d'une autre racine de document, elle est mapp&eacute;e avec cette autre racine en ajoutant l'URI de demande (moins la racine de contexte de l'application Web) &agrave; la fin de l'emplacement physique (r&eacute;pertoire) de l'autre racine de document. Si une demande correspond &agrave; plusieurs mod&egrave;les d'URI, l'autre racine de document est d&eacute;termin&eacute;e en fonction de l'ordre de priorit&eacute; suivant :</p>
<ul>
<li>
<p>Correspondance exacte</p>
</li>
<li>
<p>Correspondance du chemin le plus long</p>
</li>
<li>
<p>Correspondance d'extension</p>
</li>
</ul>
<p>Par exemple, les propri&eacute;t&eacute;s suivantes sp&eacute;cifient trois autres racines de document. Le mod&egrave;le d'URI de la premi&egrave;re autre racine de document utilise une correspondance exacte, tandis que les mod&egrave;les d'URI des deuxi&egrave;me et troisi&egrave;me racines de document utilisent des correspondances d'extension et de pr&eacute;fixe de chemin le plus long, respectivement.</p>
<pre>
&lt;property name="alternatedocroot_1" 
   value="from=/my.jpg dir=/srv/images/jpg"
&lt;property name="alternatedocroot_2" 
   value="from=*.jpg dir=/srv/images/jpg"
&lt;property name="alternatedocroot_3" 
   value="from=/jpg/* dir=/src/images"
</pre>
<p>La <code>valeur</code> de chacune de ces racines de document dispose de deux composants : le premier composant, <code>from</code>, sp&eacute;cifie le mod&egrave;le d'URI de la racine de document et le second, <code>dir</code>, en sp&eacute;cifie l'emplacement physique (r&eacute;pertoire). Les espaces sont autoris&eacute;s dans le composant <code>dir</code>.</p>
<p>Les applications Web individuelles peuvent remplacer ce param&egrave;tre en utilisant l'&eacute;l&eacute;ment <code>sun-web-app</code> du fichier <code>sun-web.xml</code>. Pour plus d'informations, reportez-vous &agrave; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>glassfish-web-app</i> dans le manuel <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt><code>contextXmlDefault</code></dt>
<dd>
<p>Indique l'emplacement relatif au r&eacute;pertoire domain-dir du fichier <code>context.xml</code> pour ce serveur virtuel, le cas &eacute;ch&eacute;ant. Pour plus d'informations sur le fichier <code>context.xml</code>, reportez-vous au document The Context Container (<code><a href="http://tomcat.apache.org/tomcat-5.5-doc/config/context.html">http://tomcat.apache.org/tomcat-5.5-doc/config/context.html</a></code>).</p>
</dd>
<dt><code>allowLinking</code></dt>
<dd>
<p>Si la valeur est <code>true</code>, les ressources repr&eacute;sentant des liens symboliques seront utilis&eacute;es pour toutes les applications Web d&eacute;ploy&eacute;es sur ce serveur virtuel. Les applications Web individuelles peuvent remplacer ce param&egrave;tre en utilisant la propri&eacute;t&eacute; <code>sun-web-app</code> <code>allowLinking</code> du fichier <code>sun-web.xml</code> :</p>
<pre>
&lt;sun-web-app&gt;
   &lt;property name="allowLinking" 
      value="{true|false}"
&lt;/sun-web-app&gt;
</pre>
<p>Pour plus d'informations, reportez-vous &agrave; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>glassfish-web-app</i> dans le manuel <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
<p>La valeur par d&eacute;faut est <code>false</code>.</p>

<hr>
<p><b>Attention:</b></p>
Sous Windows, si vous attribuez la valeur True &agrave; cette propri&eacute;t&eacute;, le code source JSP devient visible.
<hr>

</dd>
<dt><code>send-error_</code><i>n</i></dt>
<dd>
<p>Sp&eacute;cifie les mappings de page d'erreur personnalis&eacute;e pour le serveur virtuel, qui sont h&eacute;rit&eacute;s par toutes les applications Web d&eacute;ploy&eacute;es sur ce serveur virtuel. Une application Web peut remplacer ces mappings de page d'erreur personnalis&eacute;e dans son descripteur de d&eacute;ploiement <code>web.xml</code>. La valeur de chaque propri&eacute;t&eacute; <code>send-error_</code><i>n</i> comporte trois composants, qui peuvent &ecirc;tre sp&eacute;cifi&eacute;s dans n'importe quel ordre :</p>
<ul>
<li>
<p>Le premier composant, <code>code</code>, sp&eacute;cifie le code de statut de la r&eacute;ponse HTTP &agrave; trois chiffres pour lequel la page d'erreur personnalis&eacute;e doit &ecirc;tre renvoy&eacute;e dans la r&eacute;ponse.</p>
</li>
<li>
<p>Le deuxi&egrave;me composant, <code>path</code>, sp&eacute;cifie le chemin absolu ou relatif du syst&egrave;me de fichiers pour la page d'erreur personnalis&eacute;e. Un chemin relatif de syst&egrave;me de fichiers relatif est interpr&eacute;t&eacute; comme &eacute;tant relatif au r&eacute;pertoire domain-dir<code>/config</code></p>
</li>
<li>
<p>Le troisi&egrave;me composant, <code>reason</code>, est facultatif et sp&eacute;cifie le texte de la cha&icirc;ne de motif (comme <code>Unauthorized</code> ou <code>Forbidden</code>) &agrave; renvoyer.</p>
</li>
</ul>
<p>Exemple :</p>
<pre>
&lt;property name="send-error_1"
   value="code=401 path=/myhost/401.html reason=MY-401-REASON"
</pre>
<p>Cet exemple de d&eacute;finition de propri&eacute;t&eacute; entra&icirc;ne le renvoi du contenu de <code>/myhost/401.html</code> avec les r&eacute;ponses 401, ainsi que la ligne de r&eacute;ponse suivante :</p>
<pre>
HTTP/1.1 401 MY-401-REASON
</pre></dd>
<dt><code>redirect_</code><i>n</i></dt>
<dd>
<p>Sp&eacute;cifie qu'une demande d'ancienne URL est trait&eacute;e comme une demande de nouvelle URL. Toutes les applications Web d&eacute;ploy&eacute;es sur le serveur virtuel h&eacute;ritent de ces propri&eacute;t&eacute;s. La valeur de chaque propri&eacute;t&eacute; <code>redirect_</code><i>n</i> comporte deux composants, qui peuvent &ecirc;tre sp&eacute;cifi&eacute;s dans n'importe quel ordre :</p>
<ul>
<li>
<p>Le premier composant, <code>from</code>, sp&eacute;cifie le pr&eacute;fixe de l'URI demand&eacute; &agrave; associer.</p>
</li>
<li>
<p>Le second composant, <code>url-prefix</code>, sp&eacute;cifie le nouveau pr&eacute;fixe d'URL &agrave; renvoyer au client. Le pr&eacute;fixe <code>from</code> est simplement remplac&eacute; par ce pr&eacute;fixe d'URL.</p>
</li>
</ul>
<p>Exemple :</p>
<pre>
&lt;property name="redirect_1" 
  value="from=/dummy url-prefix=http://etude"
</pre></dd>
<dt><code>valve_</code><i>n</i></dt>
<dd>
<p>Sp&eacute;cifie le nom de classe qualifi&eacute; complet d'une valve personnalis&eacute;e, o&ugrave; <i>n</i> est un entier positif qui permet d'en sp&eacute;cifier plusieurs. La classe de valve doit impl&eacute;menter l'interface <code>org.apache.catalina.Valve</code> depuis Tomcat ou des versions pr&eacute;c&eacute;dentes de GlassFish Server ou l'interface <code>org.glassfish.web.valve.GlassFishValve</code> &agrave; partir de la version en cours de GlassFish Server. Exemple :</p>
<pre>
&lt;property name="valve_1"
value="org.glassfish.extension.Valve"
</pre>
<p>Vous pouvez d&eacute;finir cette propri&eacute;t&eacute; pour une application Web sp&eacute;cifique. Pour plus d'informations, reportez-vous &agrave; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>glassfish-web-app</i> dans le manuel <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt><code>listener_</code><i>n</i></dt>
<dd>
<p>Sp&eacute;cifie le nom de classe qualifi&eacute; complet d'un processus d'&eacute;coute Catalina personnalis&eacute;, o&ugrave; <i>n</i> correspond &agrave; un entier positif qui permet d'en sp&eacute;cifier plusieurs. La classe de processus d'&eacute;coute doit impl&eacute;menter l'interface <code>org.apache.catalina.ContainerListener</code> ou <code>org.apache.catalina.LifecycleListener</code>. Exemple :</p>
<pre>
&lt;property name="listener_1"
value="org.glassfish.extension.MyLifecycleListener"
</pre>
<p>Vous pouvez d&eacute;finir cette propri&eacute;t&eacute; pour une application Web sp&eacute;cifique. Pour plus d'informations, reportez-vous &agrave; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>glassfish-web-app</i> dans le manuel <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt><code>errorReportValve</code></dt>
<dd>
<p>Sp&eacute;cifie le nom de classe qualifi&eacute; complet d'une valve personnalis&eacute;e produisant des pages d'erreur par d&eacute;faut pour les applications sur ce serveur virtuel. Sp&eacute;cifiez une cha&icirc;ne vide pour d&eacute;sactiver le m&eacute;canisme de page d'erreur par d&eacute;faut pour ce serveur virtuel.</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
