<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-virtualserveredit" name="ref-virtualserveredit"></a><a id="GHWEB00013" name="GHWEB00013"></a></p>

<h4><a id="sthref127" name="sthref127"></a>Modifier un serveur virtuel</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Modifier un serveur virtuel permet de modifier les param&egrave;tres d'un serveur virtuel.</p>
<p>La page Modifier un serveur virtuel contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Charger les valeurs par d&eacute;faut</dt>
<dd>
<p>Bouton permettant de restaurer les valeurs par d&eacute;faut des param&egrave;tres qui en ont. Les param&egrave;tres qui n'ont pas de valeurs par d&eacute;faut ne sont pas modifi&eacute;s.</p>
</dd>
<dt>Nom de configuration</dt>
<dd>
<p>Nom de la configuration &agrave; laquelle s'appliquent les param&egrave;tres de cette page. Ce champ est en lecture seule.</p>
</dd>
<dt>ID</dt>
<dd>
<p>Identificateur de serveur virtuel visible en interne. Il n'est pas visible par les clients HTTP. Les noms d'h&ocirc;te visibles par les clients HTTP doivent &ecirc;tre sp&eacute;cifi&eacute;s dans le champ H&ocirc;tes.</p>
</dd>
<dt>H&ocirc;tes</dt>
<dd>
<p>Noms d'h&ocirc;te de l'ordinateur sur lequel le serveur est ex&eacute;cut&eacute;. Utilisez des noms d'h&ocirc;te r&eacute;els ou virtuels inscrits sur le serveur DNS pour votre r&eacute;seau (et, sous UNIX, dans le fichier <code>/etc/hosts</code>). La valeur par d&eacute;faut correspond &agrave; la valeur de propri&eacute;t&eacute; syst&egrave;me <code>${com.sun.aas.hostName}</code>.</p>
</dd>
<dt>Etat</dt>
<dd>
<p>Etat souhait&eacute; du serveur. Les valeurs possibles sont les suivantes :</p>
<dl>
<dt>Activ&eacute;</dt>
<dd>
<p>Le serveur virtuel est actif. Il s'agit de la valeur par d&eacute;faut.</p>
</dd>
<dt>D&eacute;sactiv&eacute;</dt>
<dd>
<p>Le serveur virtuel est inactif. Les tentatives d'acc&egrave;s au serveur renvoient le code d'erreur 404 (ressource non disponible).</p>
</dd>
<dt>D&eacute;sactiv&eacute;</dt>
<dd>
<p>Le serveur virtuel est d&eacute;sactiv&eacute;. Les tentatives d'acc&egrave;s au serveur renvoient le code d'erreur 403 (refus d'ex&eacute;cuter la demande).</p>
</dd>
</dl>
</dd>
<dt>SSO</dt>
<dd>
<p>Sp&eacute;cifie si le comportement de connexion unique est h&eacute;rit&eacute; du service HTTP, activ&eacute; ou d&eacute;sactiv&eacute;. Par d&eacute;faut, il est h&eacute;rit&eacute; du service HTTP. Si cette option est activ&eacute;e, la connexion unique est activ&eacute;e pour les applications Web sur ce serveur virtuel qui sont configur&eacute;es pour le m&ecirc;me domaine. Si cette option est d&eacute;sactiv&eacute;e, la connexion unique est d&eacute;sactiv&eacute;e pour ce serveur virtuel et les utilisateurs doivent &ecirc;tre authentifi&eacute;s s&eacute;par&eacute;ment pour chaque application sur le serveur virtuel.</p>
</dd>
<dt>Processus d'&eacute;coute r&eacute;seau</dt>
<dd>
<p>Processus d'&eacute;coute r&eacute;seau associ&eacute;s &agrave; ce serveur.</p>
</dd>
<dt>Module Web par d&eacute;faut</dt>
<dd>
<p>Module Web d&eacute;ploy&eacute; (le cas &eacute;ch&eacute;ant) qui doit r&eacute;pondre &agrave; toutes les demandes ne pouvant pas &ecirc;tre mapp&eacute;es avec d'autres modules Web d&eacute;ploy&eacute;s sur le serveur virtuel. Si aucun module Web par d&eacute;faut n'est sp&eacute;cifi&eacute;, le module Web qui poss&egrave;de une racine de contexte vide est utilis&eacute;. S'il n'existe aucun module Web avec une racine de contexte vide, un module Web syst&egrave;me par d&eacute;faut est cr&eacute;&eacute; et utilis&eacute;.</p>
</dd>
<dt>Fichier journal</dt>
<dd>
<p>Nom de chemin du fichier dans lequel les messages de journalisation provenant de ce serveur virtuel appara&icirc;tront. Par d&eacute;faut, les messages de journalisation apparaissent dans domain-dir<code>/logs/server.log</code>.</p>
</dd>
<dt>Racine doc.</dt>
<dd>
<p>Chemin absolu du r&eacute;pertoire de documents racine pour le serveur. La valeur par d&eacute;faut est domain-dir<code>/docroot</code>.</p>
</dd>
<dt>Journalisation des acc&egrave;s</dt>
<dd>
<p>Sp&eacute;cifie si la journalisation des acc&egrave;s est h&eacute;rit&eacute;e du service HTTP, activ&eacute;e ou d&eacute;sactiv&eacute;e. Par d&eacute;faut, il est h&eacute;rit&eacute; du service HTTP.</p>
</dd>
<dt>R&eacute;pertoire</dt>
<dd>
<p>Chemin de r&eacute;pertoire absolu des journaux des acc&egrave;s du serveur. La valeur par d&eacute;faut est domain-dir<code>/logs/access</code>.</p>
</dd>
<dt>Autres propri&eacute;t&eacute;s</dt>
<dd>
<p>Autres propri&eacute;t&eacute;s du serveur virtuel.</p>
<p>Pour plus d'informations sur les propri&eacute;t&eacute;s disponibles, reportez-vous &agrave; <a href="ref-virtualserverprops.html">Propri&eacute;t&eacute;s propres aux serveurs virtuels</a>.</p>
</dd>
</dl>
<a id="sthref128" name="sthref128"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-virtualservercreate.html">Cr&eacute;ation d'un serveur virtuel</a></p>
</li>
<li>
<p><a href="task-virtualserveredit.html">Modification d'un serveur virtuel</a></p>
</li>
<li>
<p><a href="task-virtualserverdelete.html">Suppression d'un serveur virtuel</a></p>
</li>
</ul>
<a id="sthref129" name="sthref129"></a>
<h5>Commandes asadmin connexes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00062"><code>create-virtual-server</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00207"><code>list-virtual-servers</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00113"><code>delete-virtual-server</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
