<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-webcontainermanagerprops" name="task-webcontainermanagerprops"></a><a id="GHWEB00032" name="GHWEB00032"></a></p>

<h4><a id="sthref8" name="sthref8"></a><a id="sthref9" name="sthref9"></a><a id="sthref10" name="sthref10"></a>Configuration des propri&eacute;t&eacute;s de gestionnaire pour le conteneur Web</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Le gestionnaire de sessions permet de d&eacute;terminer le processus de cr&eacute;ation et de suppression des sessions, l'emplacement de stockage de l'&eacute;tat des sessions, ainsi que le nombre maximal de sessions disponibles.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Configuration.</p>
</li>
<li>
<p>S&eacute;lectionnez la configuration &agrave; modifier.</p>
</li>
<li>
<p>Sous le noeud Configuration, s&eacute;lectionnez le noeud Conteneur Web.</p>
<p>La page Propri&eacute;t&eacute;s g&eacute;n&eacute;rales appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Propri&eacute;t&eacute;s g&eacute;n&eacute;rales, cliquez sur l'onglet Propri&eacute;t&eacute;s du gestionnaire.</p>
<p>La page Propri&eacute;t&eacute;s du gestionnaire appara&icirc;t.</p>
</li>
<li>
<p>Dans le champ Intervalle de r&eacute;cup&eacute;ration, indiquez apr&egrave;s combien de temps (en secondes) les donn&eacute;es de sessions inactives sont supprim&eacute;es du stockage.</p>
<p>La valeur par d&eacute;faut est 60.</p>
<p>Cette valeur doit &ecirc;tre inf&eacute;rieure &agrave; la fr&eacute;quence &agrave; laquelle les donn&eacute;es de session sont modifi&eacute;es. Par exemple, elle doit &ecirc;tre la plus faible possible (1 seconde) pour un servlet de compteur de r&eacute;sultats sur un site Web auquel l'acc&egrave;s est fr&eacute;quent ; dans le cas contraire, vous risquez de perdre les derniers r&eacute;sultats trouv&eacute;s &agrave; chaque fois que vous red&eacute;marrez le serveur.</p>
</li>
<li>
<p>Dans le champ Nombre max. de sessions, saisissez le nombre maximal de sessions pouvant &ecirc;tre mises en m&eacute;moire cache.</p>
<p>La valeur -1 indique que le nombre de sessions est illimit&eacute;. La valeur par d&eacute;faut est -1.</p>
<p>Une fois la limite atteinte, toute tentative de cr&eacute;ation d'une session provoque l'&eacute;mission d'une exception <code>IllegalStateException</code>.</p>
</li>
<li>
<p>Dans le champ Nom de fichier de session, saisissez le chemin absolu ou relatif du r&eacute;pertoire dans lequel l'&eacute;tat de la session est conserv&eacute; entre les red&eacute;marrages de l'application, si la conservation de l'&eacute;tat est possible.</p>
<p>Si ce chemin n'est pas d&eacute;fini, l'&eacute;tat de la session n'est pas conserv&eacute;. Par d&eacute;faut, ce chemin n'est pas d&eacute;fini.</p>
<p>Un chemin relatif est relatif au r&eacute;pertoire temporaire pour cette application Web.</p>
<p>Ce param&egrave;tre n'est applicable que si le type de persistance est <code>memory</code>. Pour d&eacute;finir le type de persistance, reportez-vous &agrave; <a href="task-webcontaineravailability.html">Configuration des param&egrave;tres de disponibilit&eacute; du conteneur Web</a>.</p>
</li>
<li>
<p>Dans la section Autres propri&eacute;t&eacute;s, sp&eacute;cifiez les propri&eacute;t&eacute;s suppl&eacute;mentaires.</p>
<p>GlassFish Server ne d&eacute;finit aucune autre propri&eacute;t&eacute; pour le gestionnaire de sessions.</p>
<ul>
<li>
<p>Pour ajouter une propri&eacute;t&eacute;, cliquez sur le bouton Ajouter une propri&eacute;t&eacute;. Sur la ligne vide qui appara&icirc;t, saisissez le nom de la propri&eacute;t&eacute; dans le champ Nom et la valeur de la propri&eacute;t&eacute; dans le champ Valeur.</p>
</li>
<li>
<p>Pour modifier une propri&eacute;t&eacute;, modifiez le champ Valeur de cette propri&eacute;t&eacute;.</p>
</li>
<li>
<p>Pour supprimer une propri&eacute;t&eacute;, s&eacute;lectionnez la case situ&eacute;e &agrave; gauche du champ Nom de la propri&eacute;t&eacute; &agrave; supprimer, puis cliquez sur le bouton Supprimer des propri&eacute;t&eacute;s.</p>
</li>
</ul>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>

<hr>
<p><b>Conseil:</b></p>
Pour revenir aux param&egrave;tres par d&eacute;faut, cliquez sur le bouton Charger les valeurs par d&eacute;faut, puis sur Enregistrer.
<hr>

</li>
</ol>
<a id="sthref11" name="sthref11"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-webcontainergeneral.html">Configuration des propri&eacute;t&eacute;s g&eacute;n&eacute;rales pour le conteneur Web</a></p>
</li>
<li>
<p><a href="task-webcontainersessiontimeout.html">Configuration des propri&eacute;t&eacute;s de session pour le conteneur Web</a></p>
</li>
<li>
<p><a href="task-webcontainerstoreprops.html">Configuration des propri&eacute;t&eacute;s de stockage pour le conteneur Web</a></p>
</li>
<li>
<p><a href="task-webcontaineravailability.html">Configuration des param&egrave;tres de disponibilit&eacute; du conteneur Web</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
