<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-threadpooledit" name="task-threadpooledit"></a></p>

<h4><a id="sthref75" name="sthref75"></a>Modification d'un pool de threads</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Configuration.</p>
</li>
<li>
<p>Sous le noeud Configuration, s&eacute;lectionnez le noeud Pools de threads.</p>
<p>La page Pools de threads appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Pools de threads, cliquez sur le nom du pool de threads &agrave; modifier.</p>
<p>La page Modifier un pool de threads appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Modifier un pool de threads, dans le champ Nom de classe, saisissez le nom qualifi&eacute; complet de la classe qui impl&eacute;mente le pool de threads.</p>
<p>La valeur par d&eacute;faut est <code>com.sun.grizzly.http.StatsThreadPool</code>.</p>
</li>
<li>
<p>Dans le champ Taille max. de la file d'attente, saisissez le nombre maximal de messages pouvant &ecirc;tre mis en file d'attente jusqu'&agrave; ce que des threads soient disponibles pour les traiter.</p>
<p>La valeur -1 signifie que la taille de la file d'attente est illimit&eacute;e. La valeur par d&eacute;faut est 4 096.</p>
</li>
<li>
<p>Dans le champ Taille max. du pool de threads, saisissez le nombre maximal de threads pouvant figurer dans le pool de threads.</p>
<p>La valeur par d&eacute;faut est 5. Il s'agit de la valeur recommand&eacute;e pour les pools de threads de processus d'&eacute;coute r&eacute;seau.</p>
</li>
<li>
<p>Dans le champ Taille min. du pool de threads, saisissez le nombre minimal de threads pouvant figurer dans le pool de threads.</p>
<p>Ces threads sont cr&eacute;&eacute;s lors de l'instanciation du pool de threads. La valeur par d&eacute;faut est 2.</p>
</li>
<li>
<p>Dans le champ Expiration de thread inactif, saisissez la dur&eacute;e maximale, en secondes, pendant laquelle un thread peut demeurer inactif dans le pool.</p>
<p>Une fois ce d&eacute;lai expir&eacute;, le thread est enlev&eacute; du pool. La valeur par d&eacute;faut est 900.</p>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>

<hr>
<p><b>Conseil:</b></p>
Pour revenir aux param&egrave;tres par d&eacute;faut, cliquez sur le bouton Charger les valeurs par d&eacute;faut, puis sur Enregistrer.
<hr>

</li>
</ol>
<a id="sthref76" name="sthref76"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-threadpoolnew.html">Cr&eacute;ation d'un pool de threads</a></p>
</li>
<li>
<p><a href="task-threadpooldelete.html">Suppression d'un pool de threads</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
