<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-webcontainersessiontimeout" name="task-webcontainersessiontimeout"></a><a id="GHWEB00031" name="GHWEB00031"></a></p>

<h4><a id="sthref4" name="sthref4"></a><a id="sthref5" name="sthref5"></a><a id="sthref6" name="sthref6"></a>Configuration des propri&eacute;t&eacute;s de session pour le conteneur Web</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Configuration.</p>
</li>
<li>
<p>S&eacute;lectionnez la configuration &agrave; modifier.</p>
</li>
<li>
<p>Sous le noeud Configuration, s&eacute;lectionnez le noeud Conteneur Web.</p>
<p>La page Propri&eacute;t&eacute;s g&eacute;n&eacute;rales appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Propri&eacute;t&eacute;s g&eacute;n&eacute;rales, cliquez sur l'onglet Propri&eacute;t&eacute;s de la session.</p>
<p>La page Propri&eacute;t&eacute;s de la session appara&icirc;t.</p>
</li>
<li>
<p>Dans le champ D&eacute;lai d'expiration de session, indiquez la dur&eacute;e maximale (en secondes) de validit&eacute; d'une session inactive.</p>
<p>La valeur par d&eacute;faut est 1 800. Si la valeur est d&eacute;finie sur 0 ou moins, les sessions n'expirent jamais.</p>
</li>
<li>
<p>Dans la section Autres propri&eacute;t&eacute;s, sp&eacute;cifiez les propri&eacute;t&eacute;s suppl&eacute;mentaires.</p>
<p>Pour obtenir une description des propri&eacute;t&eacute;s disponibles, reportez-vous &agrave; <a href="ref-websessionproperties.html">Propri&eacute;t&eacute;s propres aux sessions de conteneur Web</a>.</p>
<ul>
<li>
<p>Pour ajouter une propri&eacute;t&eacute;, cliquez sur le bouton Ajouter une propri&eacute;t&eacute;. Sur la ligne vide qui appara&icirc;t, saisissez le nom de la propri&eacute;t&eacute; dans le champ Nom et la valeur de la propri&eacute;t&eacute; dans le champ Valeur.</p>
</li>
<li>
<p>Pour modifier une propri&eacute;t&eacute;, modifiez le champ Valeur de cette propri&eacute;t&eacute;.</p>
</li>
<li>
<p>Pour supprimer une propri&eacute;t&eacute;, s&eacute;lectionnez la case situ&eacute;e &agrave; gauche du champ Nom de la propri&eacute;t&eacute; &agrave; supprimer, puis cliquez sur le bouton Supprimer des propri&eacute;t&eacute;s.</p>
</li>
</ul>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>

<hr>
<p><b>Conseil:</b></p>
Pour revenir aux param&egrave;tres par d&eacute;faut, cliquez sur le bouton Charger les valeurs par d&eacute;faut, puis sur Enregistrer.
<hr>

</li>
</ol>
<a id="sthref7" name="sthref7"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-webcontainergeneral.html">Configuration des propri&eacute;t&eacute;s g&eacute;n&eacute;rales pour le conteneur Web</a></p>
</li>
<li>
<p><a href="task-webcontainermanagerprops.html">Configuration des propri&eacute;t&eacute;s de gestionnaire pour le conteneur Web</a></p>
</li>
<li>
<p><a href="task-webcontainerstoreprops.html">Configuration des propri&eacute;t&eacute;s de stockage pour le conteneur Web</a></p>
</li>
<li>
<p><a href="task-webcontaineravailability.html">Configuration des param&egrave;tres de disponibilit&eacute; du conteneur Web</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
