<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-accesslog" name="task-accesslog"></a><a id="GHWEB00035" name="GHWEB00035"></a></p>

<h4><a id="sthref21" name="sthref21"></a><a id="sthref22" name="sthref22"></a>Configuration du service HTTP</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Configuration.</p>
</li>
<li>
<p>S&eacute;lectionnez la configuration &agrave; modifier.</p>
</li>
<li>
<p>Sous le noeud Configuration, s&eacute;lectionnez le noeud Service HTTP.</p>
<p>La page Service HTTP appara&icirc;t.</p>
</li>
<li>
<p>Cochez la case Activ&eacute; de l'option SSO pour activer la connexion unique par d&eacute;faut pour l'ensemble des applications Web sur tous les serveurs virtuels de ce serveur qui sont configur&eacute;s pour le m&ecirc;me domaine.</p>
<p>Vous pouvez remplacer ce param&egrave;tre pour un serveur virtuel. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Cochez la case Activ&eacute; pour Journalisation des acc&egrave;s afin d'activer la journalisation des acc&egrave;s pour tous les sous-&eacute;l&eacute;ments de serveur virtuel qui ne sp&eacute;cifient pas cette propri&eacute;t&eacute;.</p>
<p>Si la case Activ&eacute; pour Journalisation des acc&egrave;s n'est pas coch&eacute;e, la journalisation des acc&egrave;s est d&eacute;sactiv&eacute;e pour tous les sous-&eacute;l&eacute;ments de serveur virtuel qui ne sp&eacute;cifient pas cette propri&eacute;t&eacute;. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Cochez la case Rotation activ&eacute;e pour activer la rotation des fichiers journaux.</p>
<p>Cette option est activ&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante R&egrave;gle de rotation, s&eacute;lectionnez une r&egrave;gle de rotation.</p>
<p>La seule r&egrave;gle de rotation disponible est <code>time</code>.</p>
</li>
<li>
<p>Dans le champ Intervalle de rotation, entrez le nombre de minutes entre les rotations du journal des acc&egrave;s.</p>
<p>Ce champ est valide uniquement si la r&egrave;gle de rotation est <code>time</code>. La valeur par d&eacute;faut est 1 440 minutes (24 heures).</p>
</li>
<li>
<p>Dans le champ Suffixe de rotation, entrez la valeur de cha&icirc;ne &agrave; ajouter &agrave; la fin du nom du fichier journal apr&egrave;s la rotation.</p>
<p>La valeur par d&eacute;faut est <code>yyyy-MM-dd</code>.</p>
<p>Assurez-vous que le suffixe de rotation contient suffisamment de valeurs pour cr&eacute;er un suffixe unique pour chaque rotation de journal. Par exemple, si le journal des acc&egrave;s change plusieurs fois par jour, ajoutez l'heure dans le suffixe de rotation.</p>
<p>Le suffixe doit &ecirc;tre unique pour s'assurer que le fichier journal des acc&egrave;s change chaque fois que l'intervalle de rotation arrive &agrave; son terme. Si le suffixe de rotation du nouveau fichier journal des acc&egrave;s est le m&ecirc;me que celui du fichier existant, aucune rotation n'est appliqu&eacute;e au fichier.</p>
</li>
<li>
<p>Dans le champ Nombre max. de fichiers, entrez le nombre maximal de fichiers journaux d'acc&egrave;s d&eacute;plac&eacute;s &agrave; conserver.</p>
<p>Une valeur n&eacute;gative signifie que le nombre de fichiers est illimit&eacute;. La valeur par d&eacute;faut est -1.</p>
</li>
<li>
<p>Dans le champ Taille du tampon, saisissez la taille (en octets) du tampon de journal des acc&egrave;s.</p>
<p>Une valeur inf&eacute;rieure ou &eacute;gale &agrave; 0 d&eacute;sactive la mise en m&eacute;moire tampon du journal des acc&egrave;s. La valeur par d&eacute;faut est 32 768.</p>
</li>
<li>
<p>Dans le champ Intervalle d'&eacute;criture, saisissez le nombre de secondes avant que le journal ne soit &eacute;crit sur le disque.</p>
<p>Le journal des acc&egrave;s est &eacute;crit lorsque la m&eacute;moire tampon est pleine ou que l'intervalle expire. Si la valeur est inf&eacute;rieure ou &eacute;gale &agrave; 0, l'&eacute;criture continue dans la m&eacute;moire tampon m&ecirc;me si elle n'est pas pleine. Autrement dit, chaque fois qu'un utilisateur acc&egrave;de au serveur, le message de journal est directement stock&eacute; dans le fichier. La valeur par d&eacute;faut est 300.</p>
</li>
<li>
<p>Dans le champ Format, entrez une valeur de cha&icirc;ne pour sp&eacute;cifier les propri&eacute;t&eacute;s suivantes du journal des acc&egrave;s :</p>
<ul>
<li>
<p>Informations &agrave; capturer dans le journal des acc&egrave;s</p>
</li>
<li>
<p>Ordre dans lequel les informations sont captur&eacute;es</p>
</li>
</ul>
<p>La valeur par d&eacute;faut est la suivante :</p>
<pre>
%client.name% %auth-user-name% %datetime% %request% %status% %response.length%
</pre>
<p>Les valeurs suivantes peuvent &ecirc;tre incluses dans la cha&icirc;ne de format :</p>
<dl>
<dt><code>%attribute.</code><i>name</i><code>%</code></dt>
<dd>
<p>Journalise la valeur (en appelant la m&eacute;thode <code>toString</code> associ&eacute;e) de l'attribut de demande avec le <i>nom</i> sp&eacute;cifi&eacute;.</p>
</dd>
<dt><code>%auth-user-name%</code></dt>
<dd>
<p>Nom de l'utilisateur autoris&eacute;</p>
</dd>
<dt><code>%client.name%</code></dt>
<dd>
<p>Nom de l'h&ocirc;te client</p>
</dd>
<dt><code>%client.dns%</code></dt>
<dd>
<p>DNS client</p>
</dd>
<dt><code>%cookie.</code><i>name</i><code>%</code></dt>
<dd>
<p>Valeur du cookie de demande portant le <i>nom</i> sp&eacute;cifi&eacute;</p>
</dd>
<dt><code>%cookie.value%</code></dt>
<dd>
<p>Valeur du premier cookie d&eacute;tect&eacute; dans la demande</p>
</dd>
<dt><code>%datetime%</code></dt>
<dd>
<p>Date du syst&egrave;me</p>
</dd>
<dt><code>%request%</code></dt>
<dd>
<p>Ligne de demande HTTP compl&egrave;te</p>
</dd>
<dt><code>%status%</code></dt>
<dd>
<p>Statut</p>
</dd>
<dt><code>%response.length%</code></dt>
<dd>
<p>Longueur du contenu de la r&eacute;ponse</p>
</dd>
<dt><code>%header.referer%</code></dt>
<dd>
<p>En-t&ecirc;te de source du renvoi</p>
</dd>
<dt><code>%header.user-agent%</code></dt>
<dd>
<p>En-t&ecirc;te d'agent utilisateur</p>
</dd>
<dt><code>%http-method%</code></dt>
<dd>
<p>M&eacute;thode HTTP</p>
</dd>
<dt><code>%http-uri%</code></dt>
<dd>
<p>URI HTTP</p>
</dd>
<dt><code>%query-str%</code></dt>
<dd>
<p>Cha&icirc;ne de requ&ecirc;te HTTP</p>
</dd>
<dt><code>%http-version%</code></dt>
<dd>
<p>Version du protocole HTTP</p>
</dd>
<dt><code>%header.accept%</code></dt>
<dd>
<p>En-t&ecirc;te d'acceptation</p>
</dd>
<dt><code>%header.date%</code></dt>
<dd>
<p>En-t&ecirc;te de date</p>
</dd>
<dt><code>%header.if-mod-since%</code></dt>
<dd>
<p>En-t&ecirc;te If-Modified-Since</p>
</dd>
<dt><code>%header.auth%</code></dt>
<dd>
<p>En-t&ecirc;te d'autorisation</p>
</dd>
<dt><code>%header.</code><i>any</i><code>%</code></dt>
<dd>
<p>Toute valeur d'en-t&ecirc;te HTTP valide d&eacute;finie dans le document RFC 2616 (<code>any</code> est &eacute;galement une valeur d'en-t&ecirc;te valide, qui est indiqu&eacute;e ici en tant que variable)</p>
</dd>
<dt><code>%session.</code><i>name</i><code>%</code></dt>
<dd>
<p>Valeur de l'attribut de session portant le nom <i>name</i>, ou <code>NULL-SESSION-ATTRIBUTE-</code><i>name</i> si l'attribut sp&eacute;cifi&eacute; n'existe pas dans la session, ou encore <code>NULL-SESSION</code> s'il n'existe aucune session.</p>
</dd>
<dt><code>%time-taken%</code></dt>
<dd>
<p>Dur&eacute;e (en millisecondes) de traitement de chaque demande</p>
</dd>
<dt><code>%vs.id%</code></dt>
<dd>
<p>ID de serveur virtuel</p>
</dd>
</dl>
</li>
<li>
<p>Dans la section Autres propri&eacute;t&eacute;s, sp&eacute;cifiez les propri&eacute;t&eacute;s suppl&eacute;mentaires.</p>
<p>Pour obtenir une description des propri&eacute;t&eacute;s disponibles, reportez-vous &agrave; <a href="ref-httpserviceprops.html">Propri&eacute;t&eacute;s propres au service HTTP</a>.</p>
<ul>
<li>
<p>Pour ajouter une propri&eacute;t&eacute;, cliquez sur le bouton Ajouter une propri&eacute;t&eacute;. Sur la ligne vide qui appara&icirc;t, saisissez le nom de la propri&eacute;t&eacute; dans le champ Nom et la valeur de la propri&eacute;t&eacute; dans le champ Valeur.</p>
</li>
<li>
<p>Pour modifier une propri&eacute;t&eacute;, modifiez le champ Valeur de cette propri&eacute;t&eacute;.</p>
</li>
<li>
<p>Pour supprimer une propri&eacute;t&eacute;, s&eacute;lectionnez la case situ&eacute;e &agrave; gauche du champ Nom de la propri&eacute;t&eacute; &agrave; supprimer, puis cliquez sur le bouton Supprimer des propri&eacute;t&eacute;s.</p>
</li>
</ul>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>

<hr>
<p><b>Conseil:</b></p>
Pour revenir aux param&egrave;tres par d&eacute;faut, cliquez sur le bouton Charger les valeurs par d&eacute;faut, puis sur Enregistrer.
<hr>

</li>
</ol>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
