<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-protocolnew" name="task-protocolnew"></a></p>

<h4><a id="sthref50" name="sthref50"></a>Cr&eacute;ation d'un protocole</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Configuration.</p>
</li>
<li>
<p>Sous le noeud Configuration, d&eacute;veloppez le noeud Configuration r&eacute;seau.</p>
</li>
<li>
<p>Sous le noeud Configuration r&eacute;seau, d&eacute;veloppez le noeud Protocoles.</p>
<p>La page Protocoles appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Protocoles, cliquez sur Nouveau.</p>
<p>La page Nouveau protocole appara&icirc;t.</p>
</li>
<li>
<p>Dans le champ Nom, saisissez un nom unique pour le protocole.</p>
</li>
<li>
<p>Cochez la case S&eacute;curit&eacute; activ&eacute;e pour activer la s&eacute;curit&eacute; du protocole.</p>
<p>Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut. Si vous activez la s&eacute;curit&eacute;, vous pouvez utiliser l'onglet SSL de la page Modifier un protocole pour modifier les param&egrave;tres de s&eacute;curit&eacute;.</p>
</li>
<li>
<p>Cochez la case Activ&eacute; de l'option Statut pour activer le cache de fichiers.</p>
<p>Cette option est activ&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Dans le champ Age max., entrez la dur&eacute;e de vie maximale, en secondes, d'une entr&eacute;e de cache valide.</p>
<p>Ce param&egrave;tre d&eacute;termine combien de temps les informations en m&eacute;moire cache sont utilis&eacute;es apr&egrave;s la mise en m&eacute;moire cache d'un fichier. Une entr&eacute;e ant&eacute;rieure &agrave; l'&acirc;ge maximal est remplac&eacute;e par une nouvelle entr&eacute;e pour le m&ecirc;me fichier. Si le contenu change rarement, augmentez cette valeur pour am&eacute;liorer les performances.</p>
<p>L'&acirc;ge maximal optimal d&eacute;pend de la fr&eacute;quence &agrave; laquelle les fichiers existants sont modifi&eacute;s. Par exemple, si les fichiers sont modifi&eacute;s quatre fois par jour &agrave; intervalles r&eacute;guliers, vous pouvez d&eacute;finir l'&acirc;ge maximal sur 21 600 secondes (6 heures). Sinon, vous pouvez d&eacute;finir l'&acirc;ge maximal sur la p&eacute;riode la plus longue durant laquelle vous acceptez d'utiliser la version pr&eacute;c&eacute;dente d'un fichier apr&egrave;s sa modification.</p>
<p>La valeur par d&eacute;faut est 30.</p>
</li>
<li>
<p>Dans le champ Taille max. du cache, saisissez la taille totale maximale (en octets) du cache de fichiers sur le disque.</p>
<p>La valeur par d&eacute;faut est 10 485 760.</p>
</li>
<li>
<p>Dans le champ Nombre max. de fichiers, saisissez le nombre maximal de fichiers pouvant &ecirc;tre stock&eacute;s dans le cache de fichiers.</p>
<p>Si la valeur est trop &eacute;lev&eacute;e, le serveur met en m&eacute;moire cache les fichiers peu utiles qui consomment de la m&eacute;moire. Si elle est trop faible, vous perdez l'avantage de la mise en m&eacute;moire cache. Testez diff&eacute;rentes valeurs de cet attribut pour rechercher la solution optimale pour des applications sp&eacute;cifiques.</p>
<p>La valeur par d&eacute;faut est 1024.</p>
</li>
<li>
<p>Dans le champ Nom du serveur, saisissez le nom d'h&ocirc;te &agrave; utiliser dans les URL envoy&eacute;es au client par le serveur.</p>
<p>Ce nom correspond &agrave; l'alias si votre serveur en utilise un. Si votre serveur n'utilise aucun alias, laissez ce champ vide.</p>
<p>Cette valeur a une influence sur les URL que le serveur g&eacute;n&egrave;re automatiquement ; elle n'a aucun impact sur les URL des r&eacute;pertoires et des fichiers stock&eacute;s sur le serveur Ce nom correspond au nom de l'alias si votre serveur en utilise un. Si vous ajoutez le signe deux-points et un num&eacute;ro de port &agrave; la fin, ce port sera utilis&eacute; dans les URL que le serveur envoie au client.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Serveur virtuel par d&eacute;faut, s&eacute;lectionnez le serveur virtuel &agrave; associer &agrave; ce protocole.</p>
<p>La page Serveurs virtuels permet de d&eacute;finir des serveurs virtuels.</p>
</li>
<li>
<p>Dans le champ Port de redirection, saisissez la valeur de port &agrave; utiliser pour rediriger une demande vers un autre port.</p>
<p>GlassFish Server r&eacute;achemine automatiquement la demande si les deux conditions suivantes sont remplies :</p>
<ul>
<li>
<p>Le processus d'&eacute;coute r&eacute;seau qui r&eacute;f&eacute;rence ce protocole prend en charge les demandes non SSL.</p>
</li>
<li>
<p>Une demande est re&ccedil;ue. Une contrainte de s&eacute;curit&eacute; correspondante requiert le transport SSL.</p>
</li>
</ul>
<p>Si aucun port de redirection n'est sp&eacute;cifi&eacute;, GlassFish Server utilise le num&eacute;ro de port sp&eacute;cifi&eacute; dans la demande d'origine. Par d&eacute;faut, aucun port n'est sp&eacute;cifi&eacute;.</p>
</li>
<li>
<p>Dans le champ Nombre max. de connexions, entrez le nombre maximal de demandes pouvant &ecirc;tre envoy&eacute;es en flux continu jusqu'&agrave; la fermeture de la connexion par le serveur.</p>
<p>Le sous-syst&egrave;me de maintien des connexions interroge p&eacute;riodiquement les connexions inactives. La valeur par d&eacute;faut est 256.</p>
<p>D&eacute;finissez cette propri&eacute;t&eacute; sur 1 pour d&eacute;sactiver le maintien des connexions HTTP/1.0, ainsi que le maintien des connexions HTTP/1.1 et l'envoi en flux continu. La valeur 0 signifie que les demandes sont toujours rejet&eacute;es. La valeur -1 indique que le nombre de connexions maintenues est illimit&eacute;.</p>
</li>
<li>
<p>Dans le champ Expiration, entrez la dur&eacute;e maximale (en secondes) pendant laquelle une connexion peut &ecirc;tre consid&eacute;r&eacute;e comme inactive et maintenue.</p>
<p>Une valeur inf&eacute;rieure ou &eacute;gale &agrave; 0 signifie que les connexions maintenues restent ouvertes ind&eacute;finiment. La valeur par d&eacute;faut est de 30 secondes.</p>
</li>
<li>
<p>Cochez la case Activ&eacute; de l'option Expiration des chargements pour activer la fermeture de la connexion pour un servlet qui lit les octets lentement une fois le d&eacute;lai de temporisation du chargement de la connexion d&eacute;pass&eacute;.</p>
<p>Si cette option est d&eacute;sactiv&eacute;e, les connexions de servlet ne font pas l'objet de temporisations. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Dans le champ Expiration du chargement de la connexion, entrez la valeur de temporisation des chargements, en millisecondes.</p>
<p>Ce champ n'est applicable que si la case D&eacute;sactiv&eacute; de l'option Expiration des chargements est coch&eacute;e. La valeur par d&eacute;faut est 300 000 millisecondes.</p>
</li>
<li>
<p>Dans le champ Expiration des demandes, saisissez le nombre de secondes au bout desquelles une demande expire.</p>
<p>Si la demande n'est pas trait&eacute;e avant que la valeur de temporisation soit atteinte, la demande n'est pas prise en compte. La valeur par d&eacute;faut est de 30 secondes.</p>
</li>
<li>
<p>Dans le champ Taille du tampon d'envoi, saisissez la taille (en octets) du tampon d'envoi.</p>
<p>La valeur par d&eacute;faut est 8 192 octets.</p>
</li>
<li>
<p>Dans le champ Longueur du tampon d'en-t&ecirc;te, saisissez la taille (en octets) du tampon utilis&eacute; par les threads de traitement de demande pour lire les donn&eacute;es de la demande.</p>
<p>La valeur par d&eacute;faut est 8 192 octets.</p>
</li>
<li>
<p>Dans le champ Taille max. des actions POST, saisissez la taille maximale (en octets) des actions POST.</p>
<p>La valeur par d&eacute;faut est 2 097 152 octets.</p>
</li>
<li>
<p>Dans le champ Codage d'URI, saisissez le nom du jeu de caract&egrave;res utilis&eacute; pour d&eacute;coder les URI de demande re&ccedil;us.</p>
<p>La valeur doit &ecirc;tre un nom de jeu de caract&egrave;res IANA valide. La valeur par d&eacute;faut est UTF-8.</p>
</li>
<li>
<p>Dans le champ Version, saisissez la version du protocole HTTP utilis&eacute;.</p>
<p>La valeur par d&eacute;faut est HTTP/1.1.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Compression, s&eacute;lectionnez l'utilisation de la compression GZIP HTTP/1.1 pour enregistrer la bande passante du serveur.</p>
<p>Les choix disponibles sont les suivants :</p>
<dl>
<dt><code>on</code></dt>
<dd>
<p>Compresse les donn&eacute;es.</p>
</dd>
<dt><code>off</code></dt>
<dd>
<p>D&eacute;sactive la compression.</p>
</dd>
<dt><code>force</code></dt>
<dd>
<p>Force la compression des donn&eacute;es dans tous les cas.</p>
</dd>
</dl>
<p>La valeur par d&eacute;faut est <code>off</code>.</p>
</li>
<li>
<p>Dans le champ Types MIME compressibles, entrez une liste de types MIME (s&eacute;par&eacute;s par des virgules) pour lesquels la compression HTTP est utilis&eacute;e.</p>
<p>La valeur par d&eacute;faut est <code>text/html,text/xml,text/plain</code>.</p>
</li>
<li>
<p>Dans le champ Taille minimale de compression, saisissez la taille minimale d'un fichier lorsque la compression est appliqu&eacute;e.</p>
<p>Cette valeur doit &ecirc;tre configur&eacute;e si la compression est d&eacute;finie sur <code>on</code> ou <code>force</code>. La valeur par d&eacute;faut est 2 048 octets.</p>
</li>
<li>
<p>Dans le champ Agents utilisateur sans compression, saisissez une liste d'expressions r&eacute;guli&egrave;res (s&eacute;par&eacute;es par des virgules) correspondant aux agents utilisateur de clients HTTP pour lesquels la compression ne doit pas &ecirc;tre utilis&eacute;e.</p>
<p>Par d&eacute;faut, cette valeur est une cha&icirc;ne vide.</p>
</li>
<li>
<p>Dans le champ Agent utilisateur limit&eacute;, entrez la liste des agents utilisateur limit&eacute;s sur lesquels la compression HTTP est appliqu&eacute;e.</p>
<p>Si aucun agent utilisateur n'est sp&eacute;cifi&eacute;, la compression HTTP est appliqu&eacute;e &agrave; tous les agents utilisateur. Par d&eacute;faut, aucun agent utilisateur n'est sp&eacute;cifi&eacute;.</p>
</li>
<li>
<p>Dans le champ Type de r&eacute;ponse par d&eacute;faut, saisissez une cha&icirc;ne qui sp&eacute;cifie le type de r&eacute;ponse par d&eacute;faut.</p>
<p>Le format est une cha&icirc;ne d'&eacute;l&eacute;ments, s&eacute;par&eacute;s par des points-virgules, pr&eacute;sentant le type de contenu, l'encodage, la langue et le jeu de caract&egrave;res. La valeur par d&eacute;faut est <code>text/html; charset=iso-8859-1</code>.</p>
</li>
<li>
<p>Dans le champ Type de r&eacute;ponse forc&eacute;e, entrez une cha&icirc;ne qui sp&eacute;cifie le type de demande utilis&eacute; si aucun mapping MIME ne correspond &agrave; l'extension du fichier.</p>
<p>Le format est une cha&icirc;ne d'&eacute;l&eacute;ments, s&eacute;par&eacute;s par des points-virgules, pr&eacute;sentant le type de contenu, l'encodage, la langue et le jeu de caract&egrave;res. La valeur par d&eacute;faut est <code>text/html; charset=iso-8859-1</code>.</p>
</li>
<li>
<p>Dans le champ Adaptateur, entrez le nom de classe de l'adaptateur de ressources statique.</p>
<p>La valeur par d&eacute;faut est <code>com.sun.grizzly.tcp.StaticResourcesAdapter</code>.</p>
</li>
<li>
<p>Cochez la case Activ&eacute; de l'option Support Comet pour activer le support Comet pour le processus d'&eacute;coute r&eacute;seau qui r&eacute;f&eacute;rence ce protocole.</p>
<p>Par d&eacute;faut, cette option est d&eacute;sactiv&eacute;e. Si votre servlet ou votre page JSP utilise la technologie Comet, assurez-vous qu'il est initialis&eacute; lorsque GlassFish Server d&eacute;marre en ajoutant l'&eacute;l&eacute;ment <code>load-on-startup</code> &agrave; votre fichier <code>web.xml</code>. Exemple :</p>
<pre>
&lt;servlet&gt;
&lt;servlet-name&gt;CheckIn&lt;/servlet-name&gt;
&lt;servlet-class&gt;CheckInServlet&lt;/servlet-class&gt;
&lt;load-on-startup&gt;0&lt;/load-on-startup&gt;
&lt;/servlet&gt;
</pre></li>
<li>
<p>Cochez la case Activ&eacute; de l'option Recherche DNS pour activer la recherche DNS.</p>
<p>Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Cochez la case Activ&eacute; de l'option Prise en charge de RCM pour activer RCM (Resource Configuration Management).</p>
<p>Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Cochez la case Activ&eacute; de l'option Trace pour activer l'op&eacute;ration TRACE.</p>
<p>Si cette option est d&eacute;sactiv&eacute;e, GlassFish Server est moins expos&eacute; &agrave; des attaques de scripts entre sites. Cette option est activ&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>S&eacute;lectionnez la case Activ&eacute; de l'option Pass-through d'auth. pour indiquer que le processus d'&eacute;coute r&eacute;seau qui utilise ce protocole re&ccedil;oit le trafic d'un serveur proxy &agrave; terminaison SSL.</p>
<p>Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Cochez la case Activ&eacute; de l'option Segmentation pour activer la segmentation des r&eacute;ponses HTTP.</p>
<p>Cette option est activ&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Cochez la case Activ&eacute; de l'option XPowered By pour indiquer &agrave; GlassFish Server d'utiliser les en-t&ecirc;tes <code>X-Powered-By</code> selon les sp&eacute;cifications Java Servlet 3.0 et Java Server Pages 2.0.</p>
<p>Cette option est activ&eacute;e par d&eacute;faut.</p>
</li>
</ol>
<a id="sthref51" name="sthref51"></a>
<h5>Etapes suivantes</h5>
<p>Apr&egrave;s avoir cr&eacute;&eacute; un protocole, vous pouvez cr&eacute;er un processus d'&eacute;coute r&eacute;seau qui utilise ce protocole.</p>
<a id="sthref52" name="sthref52"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-networklistenernew.html">Cr&eacute;ation d'un processus d'&eacute;coute r&eacute;seau</a></p>
</li>
<li>
<p><a href="task-networklisteneredit.html">Modification d'un processus d'&eacute;coute r&eacute;seau</a></p>
</li>
<li>
<p><a href="task-networklistenerdelete.html">Suppression d'un processus d'&eacute;coute r&eacute;seau</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">Modification d'un protocole</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">Modification des param&egrave;tres SSL pour un protocole</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">Modification des param&egrave;tres HTTP pour un protocole</a></p>
</li>
<li>
<p><a href="task-protocolfilecacheedit.html">Modification des param&egrave;tres de cache de fichiers pour un protocole</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">Suppression d'un protocole</a></p>
</li>
<li>
<p><a href="task-transportnew.html">Cr&eacute;ation d'un transport</a></p>
</li>
<li>
<p><a href="task-transportedit.html">Modification d'un transport</a></p>
</li>
<li>
<p><a href="task-transportdelete.html">Suppression d'un transport</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
