<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-webcontaineravailability" name="task-webcontaineravailability"></a></p>

<h4><a id="sthref16" name="sthref16"></a><a id="sthref17" name="sthref17"></a><a id="sthref18" name="sthref18"></a><a id="sthref19" name="sthref19"></a>Configuration des param&egrave;tres de disponibilit&eacute; du conteneur Web</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Configuration.</p>
</li>
<li>
<p>S&eacute;lectionnez la configuration &agrave; modifier.</p>
</li>
<li>
<p>Sous le noeud Configuration, s&eacute;lectionnez le noeud Service de disponibilit&eacute;.</p>
<p>La page Service de disponibilit&eacute; appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Service de disponibilit&eacute;, cliquez sur l'onglet Disponibilit&eacute; du conteneur Web.</p>
<p>La page Disponibilit&eacute; du conteneur Web appara&icirc;t.</p>
</li>
<li>
<p>Dans le champ Service de disponibilit&eacute;, cochez la case Activ&eacute; pour activer la disponibilit&eacute; du conteneur Web.</p>
<p>Pour d&eacute;sactiver la disponibilit&eacute;, d&eacute;s&eacute;lectionnez la case Activ&eacute; du champ Service de disponibilit&eacute;.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Type de persistance, s&eacute;lectionnez le m&eacute;canisme de persistance.</p>
<ul>
<li>
<p>Si le service de disponibilit&eacute; n'est <i>pas</i> activ&eacute;, s&eacute;lectionnez l'un des &eacute;l&eacute;ments suivants :</p>
<ul>
<li>
<p><code>memory</code> pour n'utiliser aucune persistance de session</p>
</li>
<li>
<p><code>file</code> pour utiliser une persistance de session bas&eacute;e sur le syst&egrave;me de fichiers n'&eacute;tant pas hautement disponible</p>
</li>
</ul>
</li>
<li>
<p>Si le service de disponibilit&eacute; est activ&eacute;, s&eacute;lectionnez <code>replicated</code> pour utiliser la persistance de session bas&eacute;e sur le basculement apr&egrave;s incident du cluster hautement disponible.</p>
</li>
</ul>
</li>
<li>
<p>Dans la liste d&eacute;roulante Fr&eacute;quence de la persistance, s&eacute;lectionnez la fr&eacute;quence de stockage de la session HTTP :</p>
<ul>
<li>
<p><code>web-method :</code> l'&eacute;tat de la session est stock&eacute; &agrave; la fin de chaque demande Web avant l'envoi d'une r&eacute;ponse au client. Ce mode constitue la meilleure garantie que l'&eacute;tat de la session sera enti&egrave;rement mis &agrave; jour en cas d'&eacute;chec. Il s'agit de la valeur par d&eacute;faut.</p>
</li>
</ul>
<p>L'option Fr&eacute;quence de la persistance n'est applicable que si le type de persistance est <code>replicated</code>.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Port&eacute;e de la persistance, s&eacute;lectionnez la port&eacute;e des modifications de session HTTP requises pour le stockage :</p>
<ul>
<li>
<p><code>session :</code> l'&eacute;tat de la session est stock&eacute; int&eacute;gralement &agrave; chaque fois. Ce mode constitue la meilleure garantie que vos donn&eacute;es de session seront correctement stock&eacute;es, quelle que soit l'application Web distribuable.</p>
</li>
<li>
<p><code>modified-session :</code> l'&eacute;tat de la session est stock&eacute; int&eacute;gralement s'il a &eacute;t&eacute; modifi&eacute;. Une session est consid&eacute;r&eacute;e comme ayant &eacute;t&eacute; modifi&eacute;e si <code>HttpSession.setAttribute()</code> ou <code>HttpSession.removeAttribute()</code> a &eacute;t&eacute; appel&eacute;. Vous devez vous assurer que <code>setAttribute()</code> est appel&eacute; chaque fois qu'un attribut est modifi&eacute;. Cette exigence n'est pas requise par la sp&eacute;cification Java EE, mais elle est n&eacute;cessaire pour que ce mode fonctionne correctement.</p>
</li>
<li>
<p><code>modified-attribute :</code> seuls les attributs de session modifi&eacute;s sont stock&eacute;s. Pour que ce mode fonctionne correctement, suivez les lignes directrices ci-dessous :</p>
<ul>
<li>
<p>Appelez <code>setAttribute()</code> &agrave; chaque modification de l'&eacute;tat de la session.</p>
</li>
<li>
<p>Veillez &agrave; ce qu'il n'y ait pas de r&eacute;f&eacute;rences crois&eacute;es entre les attributs. Le graphique d'objet sous chaque cl&eacute; d'attribut distincte est s&eacute;rialis&eacute; et stock&eacute; s&eacute;par&eacute;ment. S'il existe des r&eacute;f&eacute;rences crois&eacute;es entre les objets situ&eacute;s sous chaque cl&eacute;, ceux-ci ne seront pas s&eacute;rialis&eacute;s ni d&eacute;s&eacute;rialis&eacute;s correctement.</p>
</li>
<li>
<p>Distribuez l'&eacute;tat de session entre plusieurs attributs, ou au moins entre un attribut en lecture seule et un attribut modifiable.</p>
</li>
</ul>
</li>
</ul>
<p>L'option Port&eacute;e de la persistance n'est applicable que si le type de persistance est <code>replicated</code>.</p>
</li>
<li>
<p>Dans le champ Etat SSO, cochez la case Activ&eacute; pour rendre l'&eacute;tat de connexion unique disponible pour le basculement en cas d'incident.</p>
<p>Pour rendre l'&eacute;tat de connexion unique indisponible pour le basculement en cas d'incident, d&eacute;s&eacute;lectionnez la case Activ&eacute; du champ Etat SSO.</p>
</li>
<li>
<p>Pour restaurer les valeurs par d&eacute;faut de tous les param&egrave;tres, cliquez sur le bouton Charger les valeurs par d&eacute;faut.</p>
</li>
<li>
<p>Dans la section Autres propri&eacute;t&eacute;s, sp&eacute;cifiez les propri&eacute;t&eacute;s suppl&eacute;mentaires.</p>
<p>GlassFish Server ne d&eacute;finit aucune autre propri&eacute;t&eacute; de disponibilit&eacute; du conteneur Web.</p>
<ul>
<li>
<p>Pour ajouter une propri&eacute;t&eacute;, cliquez sur le bouton Ajouter une propri&eacute;t&eacute;. Sur la ligne vide qui appara&icirc;t, saisissez le nom de la propri&eacute;t&eacute; dans le champ Nom et la valeur de la propri&eacute;t&eacute; dans le champ Valeur.</p>
</li>
<li>
<p>Pour modifier une propri&eacute;t&eacute;, modifiez le champ Valeur de cette propri&eacute;t&eacute;.</p>
</li>
<li>
<p>Pour supprimer une propri&eacute;t&eacute;, s&eacute;lectionnez la case situ&eacute;e &agrave; gauche du champ Nom de la propri&eacute;t&eacute; &agrave; supprimer, puis cliquez sur le bouton Supprimer des propri&eacute;t&eacute;s.</p>
</li>
</ul>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>
</li>
</ol>
<a id="sthref20" name="sthref20"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-webcontainergeneral.html">Configuration des propri&eacute;t&eacute;s g&eacute;n&eacute;rales pour le conteneur Web</a></p>
</li>
<li>
<p><a href="task-webcontainersessiontimeout.html">Configuration des propri&eacute;t&eacute;s de session pour le conteneur Web</a></p>
</li>
<li>
<p><a href="task-webcontainermanagerprops.html">Configuration des propri&eacute;t&eacute;s de gestionnaire pour le conteneur Web</a></p>
</li>
<li>
<p><a href="task-webcontainerstoreprops.html">Configuration des propri&eacute;t&eacute;s de stockage pour le conteneur Web</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
