<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-httplistenernew" name="task-httplistenernew"></a></p>

<h4><a id="sthref23" name="sthref23"></a>Cr&eacute;ation d'un processus d'&eacute;coute HTTP</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Configuration.</p>
</li>
<li>
<p>Sous le noeud Configuration, d&eacute;veloppez le noeud Service HTTP.</p>
</li>
<li>
<p>Sous le noeud Configuration r&eacute;seau, s&eacute;lectionnez le noeud Processus d'&eacute;coute HTTP.</p>
<p>La page Processus d'&eacute;coute HTTP appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Processus d'&eacute;coute HTTP, cliquez sur Nouveau.</p>
<p>La page Nouveau processus d'&eacute;coute HTTP appara&icirc;t.</p>
</li>
<li>
<p>Dans le champ Nom, saisissez le nom du processus d'&eacute;coute HTTP.</p>
<p>Le nom d'un processus d'&eacute;coute HTTP ne peut pas commencer par un chiffre.</p>
</li>
<li>
<p>Dans le champ Port, saisissez le num&eacute;ro de port sur lequel le processus d'&eacute;coute HTTP va &eacute;couter.</p>
<p>Les valeurs autoris&eacute;es sont comprises entre 1 et 65535. Sur un syst&egrave;me UNIX, la cr&eacute;ation de sockets &eacute;coutant sur les ports 1 &agrave; 1024 requiert des privil&egrave;ges de superutilisateur.</p>
</li>
<li>
<p>Cochez la case Activ&eacute; de l'option Statut pour activer le processus d'&eacute;coute HTTP.</p>
<p>Cette option est activ&eacute;e par d&eacute;faut. Si le processus d'&eacute;coute est d&eacute;sactiv&eacute;, toute tentative de connexion au processus d'&eacute;coute a pour r&eacute;sultat une exception de socket (<code>java.net.ConnectException</code>).</p>
<p>Dans les versions ant&eacute;rieures &agrave; la version 9.1 de GlassFish Server, un processus d'&eacute;coute dont la valeur d'attribut activ&eacute; &eacute;tait False renvoyait un code de r&eacute;ponse 404 pour toute demande qui lui &eacute;tait envoy&eacute;e. Pour obtenir ce comportement dans la version en cours de GlassFish Server, activez le processus d'&eacute;coute et d&eacute;finissez l'&eacute;tat de chaque serveur virtuel associ&eacute; sur OFF. Un serveur virtuel r&eacute;pertorie les processus d'&eacute;coute qui lui sont associ&eacute;s dans la liste d&eacute;roulante Processus d'&eacute;coute r&eacute;seau correspondante (un processus d'&eacute;coute HTTP est un type de processus d'&eacute;coute r&eacute;seau).</p>
</li>
<li>
<p>Cochez la case S&eacute;curit&eacute; activ&eacute;e pour activer la s&eacute;curit&eacute; pour le processus d'&eacute;coute HTTP.</p>
<p>Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
<p>Si vous configurez <code>admin-listener</code> pour le serveur d'administration de domaine (DAS), qui utilise la configuration <code>server-config</code>, cette option est en lecture seule. Pour activer la s&eacute;curit&eacute; sur ce processus d'&eacute;coute, vous devez activer l'administration s&eacute;curis&eacute;e. Reportez-vous &agrave; <a href="../../../common/en/help/ref-securityadmin.html">Administration s&eacute;curis&eacute;e</a>.</p>
</li>
<li>
<p>Cochez la case Activ&eacute; de Processus d'&eacute;coute JK pour indiquer que le processus d'&eacute;coute prend en charge le protocole <code>mod-jk</code> Apache.</p>
<p>Le protocole <code>mod-jk</code> est un protocole communication/r&eacute;seau propri&eacute;taire entre le serveur Web <code>httpd</code> Apache et une instance back-end de GlassFish Server. Si le processus d'&eacute;coute prend en charge ce protocole, <code>httpd</code> est cens&eacute; g&eacute;rer tout le contenu statique, tandis que les demandes de ressource dynamique (c'est-&agrave;-dire de servlets et de JSP) sont achemin&eacute;es vers le processus d'&eacute;coute HTTP activ&eacute; <code>mod-jk</code> de GlassFish Server, &agrave; l'aide du protocole <code>mod-jk</code>. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Dans le champ Adresse, saisissez l'adresse IP sur laquelle le processus d'&eacute;coute HTTP va &eacute;couter.</p>
<p>L'adresse peut pr&eacute;senter une notation IPv6 ou des paires de chiffres s&eacute;par&eacute;es par des points. Elle peut &ecirc;tre d&eacute;finie sur <code>any</code> (pour <code>INADDR_ANY</code>) pour &eacute;couter sur toutes les adresses IP. Il peut s'agir d'un nom d'h&ocirc;te.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Serveur virtuel par d&eacute;faut, s&eacute;lectionnez le serveur virtuel &agrave; associer avec ce processus d'&eacute;coute HTTP.</p>
<p>La page Serveurs virtuels permet de d&eacute;finir des serveurs virtuels.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Pool de threads, s&eacute;lectionnez le pool de threads &agrave; associer au processus d'&eacute;coute HTTP.</p>
<p>Normalement, vous devez s&eacute;lectionner l'un des deux pools de threads qui sont configur&eacute;s lorsque vous installez GlassFish Server.</p>
</li>
<li>
<p>Dans le champ Nom du serveur, saisissez le nom d'h&ocirc;te &agrave; utiliser dans les URL envoy&eacute;es au client par le serveur.</p>
<p>Ce nom correspond &agrave; l'alias si votre serveur en utilise un. Si votre serveur n'utilise aucun alias, laissez ce champ vide.</p>
<p>Cette valeur a une influence sur les URL que le serveur g&eacute;n&egrave;re automatiquement ; elle n'a aucun impact sur les URL des r&eacute;pertoires et des fichiers stock&eacute;s sur le serveur Ce nom correspond au nom de l'alias si votre serveur en utilise un. Si vous ajoutez le signe deux-points et un num&eacute;ro de port &agrave; la fin, ce port sera utilis&eacute; dans les URL que le serveur envoie au client.</p>
</li>
<li>
<p>Cliquez sur OK.</p>
</li>
</ol>
<a id="sthref24" name="sthref24"></a>
<h5>Etapes suivantes</h5>
<p>Si vous avez activ&eacute; la s&eacute;curit&eacute; pour le processus d'&eacute;coute HTTP, vous pouvez utiliser l'onglet SSL pour modifier les param&egrave;tres SSL du processus d'&eacute;coute HTTP.</p>
<p>Un processus d'&eacute;coute HTTP est un type de processus d'&eacute;coute r&eacute;seau. Pour acc&eacute;der aux fonctionnalit&eacute;s avanc&eacute;es, vous pouvez modifier un processus d'&eacute;coute HTTP &agrave; l'aide des pages Processus d'&eacute;coute r&eacute;seau.</p>
<a id="sthref25" name="sthref25"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-httplisteneredit.html">Modification d'un processus d'&eacute;coute HTTP</a></p>
</li>
<li>
<p><a href="task-httplistenerdelete.html">Suppression d'un processus d'&eacute;coute HTTP</a></p>
</li>
<li>
<p><a href="task-httplistenerssl.html">Modification des param&egrave;tres SSL pour un processus d'&eacute;coute HTTP</a></p>
</li>
<li>
<p><a href="task-virtualservercreate.html">Cr&eacute;ation d'un serveur virtuel</a></p>
</li>
<li>
<p><a href="task-networklistenernew.html">Cr&eacute;ation d'un processus d'&eacute;coute r&eacute;seau</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">Modification des param&egrave;tres HTTP pour un protocole</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
