<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-protocolfilecacheedit" name="task-protocolfilecacheedit"></a></p>

<h4><a id="sthref62" name="sthref62"></a><a id="sthref63" name="sthref63"></a>Modification des param&egrave;tres de cache de fichiers pour un protocole</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Configuration.</p>
</li>
<li>
<p>Sous le noeud Configuration, d&eacute;veloppez le noeud Configuration r&eacute;seau.</p>
</li>
<li>
<p>Sous le noeud Configuration r&eacute;seau, d&eacute;veloppez le noeud Protocoles.</p>
<p>La page Protocoles appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Protocoles, cliquez sur le nom du protocole que vous modifiez.</p>
<p>La page Modifier un protocole appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Modifier un protocole, cliquez sur l'onglet Cache de fichiers.</p>
<p>La page Cache de fichiers appara&icirc;t.</p>
</li>
<li>
<p>Cochez la case Activ&eacute; de l'option Statut pour activer le cache de fichiers.</p>
<p>Cette option est s&eacute;lectionn&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Dans le champ Age max., entrez la dur&eacute;e de vie maximale, en secondes, d'une entr&eacute;e de cache valide.</p>
<p>Ce param&egrave;tre d&eacute;termine combien de temps les informations en m&eacute;moire cache sont utilis&eacute;es apr&egrave;s la mise en m&eacute;moire cache d'un fichier. Une entr&eacute;e ant&eacute;rieure &agrave; l'&acirc;ge maximal est remplac&eacute;e par une nouvelle entr&eacute;e pour le m&ecirc;me fichier. Si le contenu change rarement, augmentez cette valeur pour am&eacute;liorer les performances.</p>
<p>L'&acirc;ge maximal optimal d&eacute;pend de la fr&eacute;quence &agrave; laquelle les fichiers existants sont modifi&eacute;s. Par exemple, si les fichiers sont modifi&eacute;s quatre fois par jour &agrave; intervalles r&eacute;guliers, vous pouvez d&eacute;finir l'&acirc;ge maximal sur 21 600 secondes (6 heures). Sinon, vous pouvez d&eacute;finir l'&acirc;ge maximal sur la p&eacute;riode la plus longue durant laquelle vous acceptez d'utiliser la version pr&eacute;c&eacute;dente d'un fichier apr&egrave;s sa modification.</p>
<p>La valeur par d&eacute;faut est 30.</p>
</li>
<li>
<p>Dans le champ Taille max. du cache, saisissez la taille totale maximale (en octets) du cache de fichiers sur le disque.</p>
<p>La valeur par d&eacute;faut est 10 485 760.</p>
</li>
<li>
<p>Dans le champ Nombre max. de fichiers, saisissez le nombre maximal de fichiers pouvant &ecirc;tre stock&eacute;s dans le cache de fichiers.</p>
<p>Si la valeur est trop &eacute;lev&eacute;e, le serveur met en m&eacute;moire cache les fichiers peu utiles qui consomment de la m&eacute;moire. Si elle est trop faible, vous perdez l'avantage de la mise en m&eacute;moire cache. Testez diff&eacute;rentes valeurs de cet attribut pour rechercher la solution optimale pour des applications sp&eacute;cifiques.</p>
<p>La valeur par d&eacute;faut est 1024.</p>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>

<hr>
<p><b>Conseil:</b></p>
Pour revenir aux param&egrave;tres par d&eacute;faut, cliquez sur le bouton Charger les valeurs par d&eacute;faut, puis sur Enregistrer.
<hr>

</li>
</ol>
<a id="sthref64" name="sthref64"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-networklistenernew.html">Cr&eacute;ation d'un processus d'&eacute;coute r&eacute;seau</a></p>
</li>
<li>
<p><a href="task-networklisteneredit.html">Modification d'un processus d'&eacute;coute r&eacute;seau</a></p>
</li>
<li>
<p><a href="task-networklistenerdelete.html">Suppression d'un processus d'&eacute;coute r&eacute;seau</a></p>
</li>
<li>
<p><a href="task-protocolnew.html">Cr&eacute;ation d'un protocole</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">Modification d'un protocole</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">Modification des param&egrave;tres SSL pour un protocole</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">Modification des param&egrave;tres HTTP pour un protocole</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">Suppression d'un protocole</a></p>
</li>
<li>
<p><a href="task-transportnew.html">Cr&eacute;ation d'un transport</a></p>
</li>
<li>
<p><a href="task-transportedit.html">Modification d'un transport</a></p>
</li>
<li>
<p><a href="task-transportdelete.html">Suppression d'un transport</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
