<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-transportedit" name="task-transportedit"></a></p>

<h4><a id="sthref69" name="sthref69"></a>Modification d'un transport</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Configuration.</p>
</li>
<li>
<p>Sous le noeud Configuration, d&eacute;veloppez le noeud Configuration r&eacute;seau.</p>
</li>
<li>
<p>Sous le noeud Configuration r&eacute;seau, s&eacute;lectionnez le noeud Transports.</p>
<p>La page Transports appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Transports, cliquez sur le nom du transport que vous modifiez.</p>
<p>La page Modifier le transport appara&icirc;t.</p>
</li>
<li>
<p>Dans le champ Nom de classe, saisissez le nom de classe de l'impl&eacute;mentation de transport.</p>
<p>La valeur par d&eacute;faut est <code>com.sun.grizzly.TCPSelectorHandler</code>.</p>
</li>
<li>
<p>Dans le champ Gestionnaires de cl&eacute; de s&eacute;lection, saisissez le nom de classe du gestionnaire de cl&eacute; de s&eacute;lection.</p>
<p>Nom de classe du gestionnaire de cl&eacute; de s&eacute;lection. Le gestionnaire de cl&eacute; de s&eacute;lection est une classe abstraite qui g&egrave;re le cycle de vie des cl&eacute;s de s&eacute;lection. Si vous ne sp&eacute;cifiez pas de valeur, une impl&eacute;mentation par d&eacute;faut est utilis&eacute;e.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Type de tampon d'octet, s&eacute;lectionnez le type <code>ByteBuffer</code> &agrave; utiliser.</p>
<p>Les choix disponibles sont <code>HEAP</code> et <code>DIRECT</code>. La valeur par d&eacute;faut est <code>HEAP</code>.</p>
</li>
<li>
<p>Dans le champ Threads accepteur, saisissez le nombre de processeurs de l'ordinateur.</p>
<p>La valeur -1 indique que Grizzly calculera lui-m&ecirc;me le nombre de threads d'accepteur, en fonction du nombre de processeurs de l'ordinateur. La valeur par d&eacute;faut est 1.</p>
<p>Pour d&eacute;finir le nombre de threads de traitement des demandes, d&eacute;finissez la taille maximale du pool de threads utilis&eacute; par un processus d'&eacute;coute r&eacute;seau qui emploie ce transport.</p>
</li>
<li>
<p>Dans le champ Nombre max. de connexions, saisissez le nombre maximal de connexions en attente sur un processus d'&eacute;coute r&eacute;seau qui utilise ce transport.</p>
<p>La valeur par d&eacute;faut est 4 096.</p>
</li>
<li>
<p>Dans le champ Taille du tampon, saisissez (en octets) la taille du tampon &agrave; fournir pour les flux d'entr&eacute;e cr&eacute;&eacute;s par un processus d'&eacute;coute r&eacute;seau qui utilise ce transport.</p>
<p>La valeur par d&eacute;faut est 8 192.</p>
</li>
<li>
<p>Dans le champ Expiration de cl&eacute; d'inactivit&eacute;, entrez le nombre de secondes au-del&agrave; duquel la cl&eacute; d'inactivit&eacute; sera annul&eacute;e et le canal ferm&eacute;.</p>
<p>La valeur par d&eacute;faut est 30.</p>
</li>
<li>
<p>Dans le champ Expiration de la lecture, saisissez le d&eacute;lai d'attente (en millisecondes) de GlassFish Server lors de la phase d'analyse de l'en-t&ecirc;te et du corps d'une op&eacute;ration de lecture.</p>
<p>La valeur par d&eacute;faut est 30 000.</p>
</li>
<li>
<p>Dans le champ Expiration de l'interrogation du s&eacute;lecteur, entrez la dur&eacute;e (en millisecondes) de blocage d'un s&eacute;lecteur NIO en attente d'&eacute;v&eacute;nements (demandes utilisateur).</p>
<p>La valeur par d&eacute;faut est 1000.</p>
</li>
<li>
<p>Dans le champ Expiration de l'&eacute;criture, saisissez le d&eacute;lai d'attente (en millisecondes) de GlassFish Server avant qu'il ne consid&egrave;re que le client distant est d&eacute;connect&eacute; lors de l'&eacute;criture de la r&eacute;ponse.</p>
<p>La valeur par d&eacute;faut est 30 000.</p>
</li>
<li>
<p>Cochez la case Activ&eacute; de l'option Configuration de l'affichage pour vider la configuration interne de Grizzly vers les journaux du serveur.</p>
<p>Cette option peut fournir des informations int&eacute;ressantes pour le d&eacute;bogage. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Cochez la case Activ&eacute; de l'option Surveillance du trafic afin de vider les informations de demande/r&eacute;ponse vers le journal du serveur.</p>
<p>Cette option peut fournir des informations int&eacute;ressantes pour le d&eacute;bogage, mais risque de r&eacute;duire consid&eacute;rablement les performances. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Cochez la case Aucun d&eacute;lai TCP pour activer TCP_NODELAY (&eacute;galement appel&eacute; algorithme de Nagle).</p>
<p>Cette option est activ&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>

<hr>
<p><b>Conseil:</b></p>
Pour revenir aux param&egrave;tres par d&eacute;faut, cliquez sur le bouton Charger les valeurs par d&eacute;faut, puis sur Enregistrer.
<hr>

</li>
</ol>
<a id="sthref70" name="sthref70"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-networklistenernew.html">Cr&eacute;ation d'un processus d'&eacute;coute r&eacute;seau</a></p>
</li>
<li>
<p><a href="task-networklisteneredit.html">Modification d'un processus d'&eacute;coute r&eacute;seau</a></p>
</li>
<li>
<p><a href="task-networklistenerdelete.html">Suppression d'un processus d'&eacute;coute r&eacute;seau</a></p>
</li>
<li>
<p><a href="task-protocolnew.html">Cr&eacute;ation d'un protocole</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">Modification d'un protocole</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">Modification des param&egrave;tres SSL pour un protocole</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">Modification des param&egrave;tres HTTP pour un protocole</a></p>
</li>
<li>
<p><a href="task-protocolfilecacheedit.html">Modification des param&egrave;tres de cache de fichiers pour un protocole</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">Suppression d'un protocole</a></p>
</li>
<li>
<p><a href="task-transportnew.html">Cr&eacute;ation d'un transport</a></p>
</li>
<li>
<p><a href="task-transportdelete.html">Suppression d'un transport</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
