<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-virtualservercreate" name="task-virtualservercreate"></a><a id="GHWEB00036" name="GHWEB00036"></a></p>

<h4><a id="sthref35" name="sthref35"></a>Cr&eacute;ation d'un serveur virtuel</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Configuration.</p>
</li>
<li>
<p>S&eacute;lectionnez la configuration &agrave; modifier.</p>
</li>
<li>
<p>Sous le noeud Configuration, s&eacute;lectionnez le noeud Serveurs virtuels.</p>
<p>La page Serveurs virtuels appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Serveurs virtuels, cliquez sur Nouveau.</p>
<p>La page Nouveau serveur virtuel appara&icirc;t.</p>
</li>
<li>
<p>Dans le champ ID, entrez une valeur identifiant le serveur virtuel en interne.</p>
<p>Cette valeur n'est pas visible par les clients HTTP. Les noms d'h&ocirc;te visibles par les clients HTTP doivent &ecirc;tre sp&eacute;cifi&eacute;s dans le champ H&ocirc;tes.</p>
</li>
<li>
<p>Dans le champ H&ocirc;tes, entrez les noms d'h&ocirc;te ou les adresses IP de l'ordinateur sur lequel le serveur est ex&eacute;cut&eacute;.</p>
<p>Utilisez des noms d'h&ocirc;te r&eacute;els ou virtuels inscrits sur le serveur DNS pour votre r&eacute;seau (et, sous UNIX, dans le fichier <code>/etc/hosts</code>).</p>
<p>La valeur par d&eacute;faut correspond &agrave; la valeur de propri&eacute;t&eacute; syst&egrave;me <code>${com.sun.aas.hostName}</code>.</p>
</li>
<li>
<p>S&eacute;lectionnez l'option Etat pour le nouveau serveur virtuel.</p>
<p>Le serveur virtuel peut &ecirc;tre d&eacute;fini sur Actif, Inactif ou D&eacute;sactiv&eacute;. La valeur par d&eacute;faut est Actif.</p>
</li>
<li>
<p>S&eacute;lectionnez une option SSO pour le nouveau serveur virtuel.</p>
<p>Par d&eacute;faut, un serveur virtuel h&eacute;rite du param&egrave;tre de connexion unique (SSO) du service HTTP. S&eacute;lectionnez Activ&eacute; ou D&eacute;sactiv&eacute; pour annuler le param&egrave;tre du service HTTP en activant ou en d&eacute;sactivant la connexion unique pour ce serveur virtuel.</p>
<p>La connexion unique sur l'ensemble des applications de GlassFish Server est prise en charge par les servlets et les fichiers JSP. Cette fonctionnalit&eacute; permet &agrave; plusieurs applications exigeant les m&ecirc;mes informations de connexion utilisateur de partager ces derni&egrave;res au lieu de contraindre l'utilisateur &agrave; s'authentifier s&eacute;par&eacute;ment pour chaque application.</p>
</li>
<li>
<p>Dans la liste Processus d'&eacute;coute r&eacute;seau, s&eacute;lectionnez au moins un processus d'&eacute;coute r&eacute;seau ou laissez le champ vide.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Module Web par d&eacute;faut, s&eacute;lectionnez le module devant r&eacute;pondre &agrave; toutes les demandes qui ne peuvent pas &ecirc;tre mapp&eacute;es avec les autres modules Web d&eacute;ploy&eacute;s sur le serveur virtuel.</p>
<p>Si aucun module Web par d&eacute;faut n'est sp&eacute;cifi&eacute;, le module Web qui poss&egrave;de une racine de contexte vide est utilis&eacute;. S'il n'existe aucun module Web avec une racine de contexte vide, un module Web syst&egrave;me par d&eacute;faut est cr&eacute;&eacute; et utilis&eacute;.</p>
</li>
<li>
<p>Dans le champ Fichier journal, saisissez le nom de chemin du fichier dans lequel les messages de journalisation provenant de ce serveur virtuel appara&icirc;tront.</p>
<p>Par d&eacute;faut, les messages de journalisation sont envoy&eacute;s au journal de serveur par d&eacute;faut, domain-dir<code>/logs/server.log</code>.</p>
</li>
<li>
<p>Dans le champ Racine doc., entrez le chemin absolu du r&eacute;pertoire racine de documents sur le serveur.</p>
<p>Si ce champ est vide, domain-dir<code>/docroot</code> est utilis&eacute;.</p>
</li>
<li>
<p>S&eacute;lectionnez l'option Journalisation des acc&egrave;s pour activer ou d&eacute;sactiver la journalisation des acc&egrave;s.</p>
<p>Vous pouvez &eacute;galement indiquer si la journalisation des acc&egrave;s est h&eacute;rit&eacute;e du service HTTP. Par d&eacute;faut, il est h&eacute;rit&eacute; du service HTTP.</p>
</li>
<li>
<p>Dans le champ R&eacute;pertoire, entrez le chemin absolu des journaux des acc&egrave;s du serveur.</p>
<p>La valeur par d&eacute;faut est domain-dir<code>/logs/access</code>.</p>
</li>
<li>
<p>Dans la section Autres propri&eacute;t&eacute;s, sp&eacute;cifiez les autres propri&eacute;t&eacute;s du serveur virtuel.</p>
<p>Pour plus d'informations sur les propri&eacute;t&eacute;s disponibles, reportez-vous &agrave; <a href="ref-virtualserverprops.html">Propri&eacute;t&eacute;s propres aux serveurs virtuels</a>.</p>
<p>Pour ajouter une propri&eacute;t&eacute;, cliquez sur le bouton Ajouter une propri&eacute;t&eacute;. Sur la ligne vide qui appara&icirc;t, saisissez le nom de la propri&eacute;t&eacute; dans le champ Nom et la valeur de la propri&eacute;t&eacute; dans le champ Valeur.</p>
</li>
<li>
<p>Cliquez sur OK.</p>
</li>
</ol>
<a id="sthref36" name="sthref36"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-virtualserveredit.html">Modification d'un serveur virtuel</a></p>
</li>
<li>
<p><a href="task-virtualserverdelete.html">Suppression d'un serveur virtuel</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
