<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-threadpoolnew" name="task-threadpoolnew"></a><a id="GHWEB00051" name="GHWEB00051"></a></p>

<h4><a id="sthref73" name="sthref73"></a>Cr&eacute;ation d'un pool de threads</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Les pools de threads sont utilis&eacute;s par les processus d'&eacute;coute r&eacute;seau ainsi que par l'ORB. G&eacute;n&eacute;ralement, un processus d'&eacute;coute r&eacute;seau utilise l'un des deux pools de threads cr&eacute;&eacute;s lors de l'installation de GlassFish Server, et l'ORB utilise l'autre. Vous pouvez modifier l'un ou l'autre des pools de threads par d&eacute;faut afin de sp&eacute;cifier des param&egrave;tres propres &agrave; vos applications ou &agrave; vos syst&egrave;mes mat&eacute;riels, ou vous pouvez cr&eacute;er et utiliser un pool de threads avec ces param&egrave;tres.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Configuration.</p>
</li>
<li>
<p>Sous le noeud Configuration, s&eacute;lectionnez le noeud Pools de threads.</p>
<p>La page Pools de threads appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Pools de threads, cliquez sur Nouveau.</p>
<p>La page Nouveau pool de threads appara&icirc;t.</p>
</li>
<li>
<p>Dans le champ Nom, saisissez le nom du pool de threads.</p>
</li>
<li>
<p>Dans le champ Nom de classe, saisissez le nom qualifi&eacute; complet de la classe qui impl&eacute;mente le pool de threads.</p>
<p>La valeur par d&eacute;faut est <code>com.sun.grizzly.http.StatsThreadPool</code>.</p>
</li>
<li>
<p>Dans le champ Taille max. de la file d'attente, saisissez le nombre maximal de messages pouvant &ecirc;tre mis en file d'attente jusqu'&agrave; ce que des threads soient disponibles pour les traiter.</p>
<p>La valeur -1 signifie que la taille de la file d'attente est illimit&eacute;e. La valeur par d&eacute;faut est 4 096.</p>
</li>
<li>
<p>Dans le champ Taille max. du pool de threads, saisissez le nombre maximal de threads pouvant figurer dans le pool de threads.</p>
<p>La valeur par d&eacute;faut est 5. Il s'agit de la valeur recommand&eacute;e pour les pools de threads de processus d'&eacute;coute r&eacute;seau.</p>
</li>
<li>
<p>Dans le champ Taille min. du pool de threads, saisissez le nombre minimal de threads pouvant figurer dans le pool de threads.</p>
<p>Ces threads sont cr&eacute;&eacute;s lors de l'instanciation du pool de threads. La valeur par d&eacute;faut est 2.</p>
</li>
<li>
<p>Dans le champ Expiration de thread inactif, saisissez la dur&eacute;e maximale, en secondes, pendant laquelle un thread peut demeurer inactif dans le pool.</p>
<p>Une fois ce d&eacute;lai expir&eacute;, le thread est enlev&eacute; du pool. La valeur par d&eacute;faut est 900.</p>
</li>
<li>
<p>Cliquez sur OK.</p>
</li>
</ol>
<a id="sthref74" name="sthref74"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-threadpooledit.html">Modification d'un pool de threads</a></p>
</li>
<li>
<p><a href="task-threadpooldelete.html">Suppression d'un pool de threads</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
