<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-threadfactoryedit" name="ref-threadfactoryedit"></a></p>

<h4>Editar f&aacute;brica de threads gestionada<a id="sthref40" name="sthref40"></a></h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Editar f&aacute;brica de threads gestionada para editar un recurso de la f&aacute;brica de threads gestionada.</p>
<p>La p&aacute;gina Editar f&aacute;brica de threads gestionada contiene las siguientes opciones.</p>
<dl>
<dt>Cargar Valores por Defecto</dt>
<dd>
<p>Bot&oacute;n para restaurar configuraci&oacute;n que tiene valores por defecto a sus valores por defecto. Las configuraciones que no tienen valores por defecto no se modifican.</p>
</dd>
<dt>Nombre JNDI</dt>
<dd>
<p>Nombre &uacute;nico que identifica el recurso. El nombre JNDI es un campo de s&oacute;lo lectura. S&oacute;lo puede especificar el nombre JNDI al crear un nuevo recurso.</p>
</dd>
<dt>Nombre de JNDI l&oacute;gico</dt>
<dd>
<p>Nombre de JNDI l&oacute;gico para el recurso. Se trata de un nombre est&aacute;ndar de Java EE a trav&eacute;s del que se puede acceder al recurso. El nombre de JNDI l&oacute;gico es un campo de s&oacute;lo lectura. Consulte <a href="../../../common/en/help/ref-logicaljndinames.html">Nombres de JNDI l&oacute;gicos</a> para obtener m&aacute;s informaci&oacute;n.</p>
</dd>
<dt>Informaci&oacute;n de contexto</dt>
<dd>
<p>Contextos que se propagar&aacute;n a los threads: Classloader, JNDI, seguridad o &aacute;rea de trabajo. La propagaci&oacute;n de contexto se puede activar o desactivar. Si est&aacute; activada, se propagan los contextos seleccionados. Si est&aacute; desactivada, no se propaga ninguno de los contextos, aunque est&eacute;n seleccionados. El valor por defecto es Activado, con los cuatro contextos seleccionados.</p>
</dd>
<dt>Estado</dt>
<dd>
<p>Indica si el recurso est&aacute; disponible en el tiempo de ejecuci&oacute;n.</p>
<p>Si s&oacute;lo existe la instancia de servidor por defecto, <code>server</code> en el dominio, la disponibilidad en tiempo de ejecuci&oacute;n del recurso puede estar activada o desactivada. La disponibilidad en tiempo de ejecuci&oacute;n est&aacute; activa por defecto.</p>
<p>Si se ha creado alg&uacute;n cluster o alguna instancia independiente en el dominio, utilice el separador Destino para controlar la disponibilidad del recurso en tiempo de ejecuci&oacute;n en sus destinos.</p>
</dd>
<dt>Prioridad de threads</dt>
<dd>
<p>Prioridad que se asignar&aacute; a los threads creados. El valor por defecto es 5.</p>
</dd>
<dt>Orden de despliegue</dt>
<dd>
<p>Orden de despliegue de este recurso. Los recursos con los n&uacute;meros m&aacute;s bajos se cargan primero al iniciar el servidor. El valor por defecto es 100.</p>
</dd>
<dt>Descripci&oacute;n</dt>
<dd>
<p>Descripci&oacute;n de este recurso.</p>
</dd>
<dt>Propiedades Adicionales</dt>
<dd>
<p>Propiedades adicionales del recurso. GlassFish Server no define ninguna propiedad adicional para este tipo de recurso. Adem&aacute;s, este tipo de recurso no utiliza actualmente ninguna propiedad adicional.</p>
</dd>
</dl>
<a id="sthref41" name="sthref41"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-managedthreadfactorynew.html">Para crear una f&aacute;brica de threads gestionada</a></p>
</li>
<li>
<p><a href="task-managedthreadfactoryedit.html">Para editar una f&aacute;brica de threads gestionada</a></p>
</li>
<li>
<p><a href="task-managedthreadfactorydelete.html">Para suprimir una f&aacute;brica de threads gestionada</a></p>
</li>
</ul>
<a id="GHCON158" name="GHCON158"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM842"><code>create-managed-thread-factory</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM875"><code>list-managed-thread-factories</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM852"><code>delete-managed-thread-factory</code>(1)</a></p>
</li>
</ul>






<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
