<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-threadfactorynew" name="ref-threadfactorynew"></a></p>

<h4>Nueva f&aacute;brica de threads gestionada<a id="sthref38" name="sthref38"></a></h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Nueva f&aacute;brica de threads gestionada para crear un recurso de la f&aacute;brica de threads gestionada.</p>
<p>La p&aacute;gina Nueva f&aacute;brica de threads gestionada contiene las siguientes opciones.</p>
<dl>
<dt>Nombre JNDI</dt>
<dd>
<p>Nombre de JNDI &uacute;nico que identifica el recurso. Por convenci&oacute;n, el nombre empieza por un indicador de tipo de recurso y una barra invertida, por ejemplo, concurrent/, jdbc/ o jms/.</p>
</dd>
<dt>Informaci&oacute;n de contexto</dt>
<dd>
<p>Contextos que se propagar&aacute;n a los threads: Classloader, JNDI, seguridad o &aacute;rea de trabajo. La propagaci&oacute;n de contexto se puede activar o desactivar. Si est&aacute; activada, se propagan los contextos seleccionados. Si est&aacute; desactivada, no se propaga ninguno de los contextos, aunque est&eacute;n seleccionados. El valor por defecto es Activado, con los cuatro contextos seleccionados.</p>
</dd>
<dt>Estado</dt>
<dd>
<p>Estado del recurso. El recurso se puede activar o desactivar. El valor por defecto es Activado.</p>
</dd>
<dt>Prioridad de threads</dt>
<dd>
<p>Prioridad que se asignar&aacute; a los threads creados. El valor por defecto es 5.</p>
</dd>
<dt>Descripci&oacute;n</dt>
<dd>
<p>Descripci&oacute;n de este recurso.</p>
</dd>
<dt>Propiedades Adicionales</dt>
<dd>
<p>Propiedades adicionales del recurso. GlassFish Server no define ninguna propiedad adicional para este tipo de recurso. Adem&aacute;s, este tipo de recurso no utiliza actualmente ninguna propiedad adicional.</p>
</dd>
<dt>Destinos</dt>
<dd>
<p>(Esta opci&oacute;n s&oacute;lo se muestra si en el dominio se ha creado alg&uacute;n cluster o instancia independiente).</p>
<p>Clusters e instancias independientes para el recurso. Mueva los destinos seleccionados a la columna Destinos Seleccionados mediante los botones Agregar y Agregar Todos. Mueva los destinos que no necesite a la columna Destinos Disponibles mediante los botones Eliminar y Eliminar Todos.</p>
</dd>
</dl>
<a id="sthref39" name="sthref39"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-managedthreadfactorynew.html">Para crear una f&aacute;brica de threads gestionada</a></p>
</li>
<li>
<p><a href="task-managedthreadfactoryedit.html">Para editar una f&aacute;brica de threads gestionada</a></p>
</li>
<li>
<p><a href="task-managedthreadfactorydelete.html">Para suprimir una f&aacute;brica de threads gestionada</a></p>
</li>
</ul>
<a id="GHCON156" name="GHCON156"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM842"><code>create-managed-thread-factory</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM875"><code>list-managed-thread-factories</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM852"><code>delete-managed-thread-factory</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
