<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-contextservices" name="ref-contextservices"></a></p>

<h4>Servicios de contexto<a id="sthref14" name="sthref14"></a><a id="sthref15" name="sthref15"></a></h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Los servicios de contexto se utilizan para crear objetos de proxy din&aacute;micos que capturan el contexto de un contenedor y permiten ejecutar las aplicaciones en ese contexto posteriormente. El contexto del contenedor se propaga al thread que ejecuta la tarea.</p>
<p>Utilice la p&aacute;gina Servicios de contexto para configurar los recursos del servicio de contexto.</p>
<p>Para cada recurso del servicio de contexto, aparece la siguiente informaci&oacute;n.</p>
<dl>
<dt>Nombre JNDI</dt>
<dd>
<p>Nombre &uacute;nico que identifica el recurso.</p>
</dd>
<dt>Nombre de JNDI l&oacute;gico</dt>
<dd>
<p>Nombre de JNDI l&oacute;gico para el recurso. Consulte <a href="../../../common/en/help/ref-logicaljndinames.html">Nombres de JNDI l&oacute;gicos</a> para obtener m&aacute;s informaci&oacute;n.</p>
</dd>
<dt>Activado</dt>
<dd>
<p>(Esta columna s&oacute;lo se muestra si la instancia del servidor por defecto, <code>server</code>, existe en el dominio).</p>
<p>Una marca de control si el recurso est&aacute; activado, o una X si est&aacute; desactivado.</p>
</dd>
<dt>Estado</dt>
<dd>
<p>(Esta columna s&oacute;lo se muestra si en el dominio se ha creado alg&uacute;n cluster o instancia independiente).</p>
<p>N&uacute;mero de clusters e instancias independientes a los que se dirige el recurso y el n&uacute;mero de estos destinos en los que el recurso est&aacute; activado. Por ejemplo, "Activado en 2 de 4 de destinos" significa que el recurso se dirige a cuatro clusters e instancias independientes y que est&aacute; activado en dos de estos cuatro destinos.</p>
</dd>
<dt>Informaci&oacute;n de contexto</dt>
<dd>
<p>Contextos de contenedor propagados a los threads.</p>
</dd>
<dt>Descripci&oacute;n</dt>
<dd>
<p>Descripci&oacute;n del recurso.</p>
</dd>
</dl>
<p>La tabla Servicios de contexto tambi&eacute;n contiene las opciones siguientes.</p>
<dl>
<dt>Nuevo</dt>
<dd>
<p>Bot&oacute;n para crear un nuevo recurso.</p>
</dd>
<dt>Suprimir</dt>
<dd>
<p>Bot&oacute;n para suprimir uno o varios recursos seleccionados.</p>
</dd>
<dt>Activar</dt>
<dd>
<p>Bot&oacute;n para activar uno o varios recursos seleccionados.</p>
</dd>
<dt>Desactivar</dt>
<dd>
<p>Bot&oacute;n para desactivar uno o varios recursos seleccionados.</p>
</dd>
</dl>
<a id="sthref16" name="sthref16"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-contextservicecreate.html">Para crear un servicio de contexto</a></p>
</li>
<li>
<p><a href="task-contextserviceedit.html">Para editar un servicio de contexto</a></p>
</li>
<li>
<p><a href="task-contextservicedelete.html">Para suprimir un servicio de contexto</a></p>
</li>
</ul>
<a id="GHCON133" name="GHCON133"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM838"><code>create-context-service</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM865"><code>list-context-services</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM846"><code>delete-context-service</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
