<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-contextservicecreate" name="task-contextservicecreate"></a></p>

<h4>Para crear un servicio de contexto<a id="sthref2" name="sthref2"></a></h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Un servicio de contexto se utiliza para crear objetos de proxy din&aacute;micos que capturan el contexto de un contenedor y permiten ejecutar las aplicaciones en ese contexto posteriormente. El contexto del contenedor se propaga al thread que ejecuta la tarea.</p>
<p>En GlassFish Server, puede configurar un recurso de servicio de contexto y ponerlo a disposici&oacute;n de componentes de aplicaci&oacute;n, como servlets y EJB.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Recursos.</p>
</li>
<li>
<p>En el nodo Recursos, ampl&iacute;e el nodo Recursos simult&aacute;neos.</p>
</li>
<li>
<p>En el nodo Recursos simult&aacute;neos, seleccione Servicios de contexto.</p>
<p>Se abrir&aacute; la p&aacute;gina Servicios de contexto.</p>
</li>
<li>
<p>En la p&aacute;gina Servicios de contexto, haga clic en Nuevo.</p>
<p>Se abrir&aacute; la p&aacute;gina Nuevo servicio de contexto.</p>
</li>
<li>
<p>En el campo Nombre de JNDI, introduzca un nombre &uacute;nico para identificar el recurso.</p>
<p>El nombre de JNDI se registra en el servicio de nomenclatura de JNDI y lo utilizan las aplicaciones para consultar el recurso. Utilice el formato <code>concurrent/</code><i>nombre</i>. Por ejemplo, <code>concurrent/miServicioContextual</code>. El nombre puede contener &uacute;nicamente caracteres alfanum&eacute;ricos, guiones bajos, rayas y puntos.</p>
</li>
<li>
<p>Active la casilla de control Informaci&oacute;n de contexto activada para propagar contextos a los threads y seleccione los contextos que desea propagar.</p>
<p>Esta opci&oacute;n est&aacute; activada y todos los contextos est&aacute;n seleccionados por defecto. Utilice la tecla May&uacute;s o la tecla Ctrl y haga clic para seleccionar varios contextos. Si esta opci&oacute;n est&aacute; desactivada, los contextos no se propagan, aunque est&eacute;n seleccionados.</p>
</li>
<li>
<p>En el campo Descripci&oacute;n, introduzca una breve descripci&oacute;n del recurso.</p>
<p>Esta descripci&oacute;n es un valor de cadena y puede incluir un m&aacute;ximo de 250 caracteres.</p>
</li>
<li>
<p>Active la casilla de control Estado activado para activar el recurso.</p>
<p>Esta opci&oacute;n est&aacute; activada por defecto, lo que significa que el recurso est&aacute; disponible inmediatamente despu&eacute;s de crearlo.</p>
</li>
<li>
<p>En la secci&oacute;n Propiedades adicionales, no agregue ninguna propiedad adicional.</p>
<p>GlassFish Server no define ninguna propiedad adicional para este tipo de recurso. Adem&aacute;s, este tipo de recurso no utiliza actualmente ninguna propiedad adicional.</p>
</li>
<li>
<p>Haga clic en Aceptar.</p>
</li>
</ol>
<a id="GHCON104" name="GHCON104"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-contextserviceedit.html">Para editar un servicio de contexto</a></p>
</li>
<li>
<p><a href="task-contextservicedelete.html">Para suprimir un servicio de contexto</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
