<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-contextserviceedit" name="task-contextserviceedit"></a></p>

<h4>Para editar un servicio de contexto<a id="sthref3" name="sthref3"></a></h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Recursos.</p>
</li>
<li>
<p>En el nodo Recursos, ampl&iacute;e el nodo Recursos simult&aacute;neos.</p>
</li>
<li>
<p>En el nodo Recursos simult&aacute;neos, seleccione Servicios de contexto.</p>
<p>Se abrir&aacute; la p&aacute;gina Servicios de contexto.</p>
</li>
<li>
<p>En la p&aacute;gina Servicios de contexto, haga clic en el nombre del recurso que desee editar.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar servicio de contexto.</p>

<hr>
<p><b>Nota:</b></p>
El nombre JNDI es un campo de s&oacute;lo lectura. S&oacute;lo puede especificar el nombre JNDI al crear un nuevo recurso. El nombre de JNDI l&oacute;gico es tambi&eacute;n un campo de s&oacute;lo lectura.
<hr>

</li>
<li>
<p>Active la casilla de control Informaci&oacute;n de contexto activada para propagar contextos a los threads y seleccione los contextos que desea propagar.</p>
<p>Esta opci&oacute;n est&aacute; activada y todos los contextos est&aacute;n seleccionados por defecto. Utilice la tecla May&uacute;s o la tecla Ctrl y haga clic para seleccionar varios contextos. Si esta opci&oacute;n est&aacute; desactivada, los contextos no se propagan, aunque est&eacute;n seleccionados.</p>
</li>
<li>
<p>En el campo Orden de despliegue, escriba un n&uacute;mero para especificar el orden de despliegue del recurso.</p>
<p>Los recursos con los n&uacute;meros m&aacute;s bajos se cargan primero al iniciar el servidor. El valor por defecto es 100.</p>
</li>
<li>
<p>En el campo Descripci&oacute;n, introduzca una breve descripci&oacute;n del recurso.</p>
<p>Esta descripci&oacute;n es un valor de cadena y puede incluir un m&aacute;ximo de 250 caracteres.</p>
</li>
<li>
<p>Active la casilla de control Estado activado para activar el recurso.</p>
</li>
<li>
<p>En la secci&oacute;n Propiedades adicionales, no agregue ninguna propiedad adicional.</p>
<p>GlassFish Server no define ninguna propiedad adicional para este tipo de recurso. Adem&aacute;s, este tipo de recurso no utiliza actualmente ninguna propiedad adicional.</p>
</li>
<li>
<p>Haga clic en Guardar.</p>
</li>
</ol>
<a id="GHCON106" name="GHCON106"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-contextservicecreate.html">Para crear un servicio de contexto</a></p>
</li>
<li>
<p><a href="task-contextservicedelete.html">Para suprimir un servicio de contexto</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
