<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-managedexecutorservicecreate" name="task-managedexecutorservicecreate"></a></p>

<h4>Para crear un servicio del ejecutor gestionado<a id="sthref5" name="sthref5"></a></h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Las aplicaciones utilizan un servicio de ejecutor gestionado para ejecutar las tareas enviadas de forma as&iacute;ncrona. Las tareas se ejecutan en threads que inicia y gestiona el contenedor. El contexto del contenedor se propaga al thread que ejecuta la tarea.</p>
<p>En GlassFish Server, puede configurar un recurso de servicio de ejecutor de contexto y ponerlo a disposici&oacute;n de componentes de aplicaci&oacute;n, como servlets y EJB.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Recursos.</p>
</li>
<li>
<p>En el nodo Recursos, ampl&iacute;e el nodo Recursos simult&aacute;neos.</p>
</li>
<li>
<p>En el nodo Recursos simult&aacute;neos, seleccione Servicios de ejecutor gestionados.</p>
<p>Se abrir&aacute; la p&aacute;gina Servicios del ejecutor gestionados.</p>
</li>
<li>
<p>En la p&aacute;gina Servicios de ejecutor gestionados, haga clic en Nuevo.</p>
<p>Se abrir&aacute; la p&aacute;gina Servicio de ejecutor gestionado.</p>
</li>
<li>
<p>En el campo Nombre de JNDI, introduzca un nombre &uacute;nico para identificar el recurso.</p>
<p>El nombre de JNDI se registra en el servicio de nomenclatura de JNDI y lo utilizan las aplicaciones para consultar el recurso. Utilice el formato <code>concurrent/</code><i>nombre</i>. Por ejemplo, <code>concurrent/miServicioEjecutorGestionado</code>. El nombre puede contener &uacute;nicamente caracteres alfanum&eacute;ricos, guiones bajos, rayas y puntos.</p>
</li>
<li>
<p>Active la casilla de control Informaci&oacute;n de contexto activada para propagar contextos a los threads y seleccione los contextos que desea propagar.</p>
<p>Esta opci&oacute;n est&aacute; activada y todos los contextos est&aacute;n seleccionados por defecto. Utilice la tecla May&uacute;s o la tecla Ctrl y haga clic para seleccionar varios contextos. Si esta opci&oacute;n est&aacute; desactivada, los contextos no se propagan, aunque est&eacute;n seleccionados.</p>
</li>
<li>
<p>Active la casilla de control Estado activado para activar el recurso.</p>
<p>Esta opci&oacute;n est&aacute; activada por defecto, lo que significa que el recurso est&aacute; disponible inmediatamente despu&eacute;s de crearlo.</p>
</li>
<li>
<p>En el campo Prioridad de threads, introduzca la prioridad que desea asignar a los threads creados.</p>
<p>El valor por defecto es 5.</p>
</li>
<li>
<p>Active la casilla de control Tareas de larga ejecuci&oacute;n activadas para utilizar el recurso para ejecutar tareas de larga ejecuci&oacute;n.</p>
<p>Si est&aacute; activada, las tareas de larga ejecuci&oacute;n no se incluir&aacute;n en el informe como paradas. Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>En el campo Bloquear despu&eacute;s de, introduzca el n&uacute;mero de segundos que se pueden ejecutar las tareas antes de que se considere que no responden.</p>
<p>El valor por defecto es 0, lo que significa que nunca se considera que las tareas no responden.</p>
</li>
<li>
<p>En el campo Descripci&oacute;n, introduzca una breve descripci&oacute;n del recurso.</p>
<p>Esta descripci&oacute;n es un valor de cadena y puede incluir un m&aacute;ximo de 250 caracteres.</p>
</li>
<li>
<p>En el campo Tama&ntilde;o principal, introduzca el n&uacute;mero de threads que se deben mantener en un pool de threads, incluso si est&aacute;n inactivos.</p>
<p>Cuando se env&iacute;a una nueva tarea y el n&uacute;mero de threads en ejecuci&oacute;n es menor que el tama&ntilde;o principal, se crea un nuevo thread para gestionar la solicitud. El valor por defecto es 0, lo que significa que nunca se crean nuevos threads a menos que la cola de tareas est&eacute; llena o que el recurso utilice la funci&oacute;n de introducci&oacute;n directa en cola. La introducci&oacute;n directa en cola se produce cuando la capacidad de la cola de tareas es 0, o cuando la capacidad de la cola de tareas es 2147483647 y el tama&ntilde;o principal es 0.</p>
</li>
<li>
<p>En el campo Tama&ntilde;o de pool m&aacute;ximo, introduzca el n&uacute;mero m&aacute;ximo de threads que un pool de threads puede contener.</p>
<p>El valor por defecto es 2147483647, lo que significa b&aacute;sicamente que el pool de threads no est&aacute; enlazado y puede contener cualquier cantidad de threads.</p>
</li>
<li>
<p>En el campo Mantenimiento de conexiones, introduzca el n&uacute;mero de segundos que los threads puede permanecer inactivos cuando el n&uacute;mero de threads es mayor que el tama&ntilde;o principal.</p>
<p>El valor por defecto es 60.</p>
</li>
<li>
<p>En el campo Duraci&oacute;n de threads, introduzca el n&uacute;mero de segundos que los threads pueden permanecer en el pool de threads antes de que se depuren, independientemente de si el n&uacute;mero de threads es mayor que el tama&ntilde;o principal o si est&aacute;n inactivos.</p>
<p>El valor por defecto es 0, lo que significa que los threads nunca se depuran.</p>
</li>
<li>
<p>En el campo Capacidad de cola de tareas, introduzca el n&uacute;mero de tareas enviadas que se pueden almacenar en la cola de tareas en espera de ejecuci&oacute;n.</p>
<p>El valor por defecto es 2147483647, lo que significa b&aacute;sicamente que la cola de tareas no est&aacute; enlazada y puede almacenar cualquier cantidad de tareas enviadas.</p>
</li>
<li>
<p>En la secci&oacute;n Propiedades adicionales, no agregue ninguna propiedad adicional.</p>
<p>GlassFish Server no define ninguna propiedad adicional para este tipo de recurso. Adem&aacute;s, este tipo de recurso no utiliza actualmente ninguna propiedad adicional.</p>
</li>
<li>
<p>Haga clic en Aceptar.</p>
</li>
</ol>
<a id="GHCON110" name="GHCON110"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-managedexecutorserviceedit.html">Para editar un servicio de ejecutor gestionado</a></p>
</li>
<li>
<p><a href="task-managedexecutorservicedelete.html">Para suprimir un servicio de ejecutor gestionado</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
