<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-managedscheduledexecutorserviceedit" name="task-managedscheduledexecutorserviceedit"></a></p>

<h4>Para editar un servicio de ejecutor programado gestionado</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Recursos.</p>
</li>
<li>
<p>En el nodo Recursos, ampl&iacute;e el nodo Recursos simult&aacute;neos.</p>
</li>
<li>
<p>En el nodo Recursos simult&aacute;neos, seleccione Servicios de ejecutor programados gestionados.</p>
<p>Se abrir&aacute; la p&aacute;gina Servicios de ejecutor programados gestionados.</p>
</li>
<li>
<p>En la p&aacute;gina Servicios de ejecutor programado gestionado, haga clic en el nombre del recurso que desee editar.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar servicio de ejecutor programado gestionado.</p>

<hr>
<p><b>Nota:</b></p>
El nombre JNDI es un campo de s&oacute;lo lectura. S&oacute;lo puede especificar el nombre JNDI al crear un nuevo recurso.
<hr>

</li>
<li>
<p>XXX</p>
</li>
<li>
<p>En el campo Descripci&oacute;n, introduzca una breve descripci&oacute;n del recurso.</p>
<p>Esta descripci&oacute;n es un valor de cadena y puede incluir un m&aacute;ximo de 250 caracteres.</p>
</li>
<li>
<p>Active la casilla de control Estado activado para activar el recurso.</p>
</li>
<li>
<p>En la secci&oacute;n Propiedades adicionales, especifique propiedades adicionales del recurso.</p>
<p>GlassFish Server no define ninguna propiedad adicional para los recursos del servicio de ejecutor programado gestionado.</p>
<ul>
<li>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, introduzca el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
</li>
<li>
<p>Para modificar una propiedad, edite el campo Valor.</p>
</li>
<li>
<p>Para suprimir una propiedad, active la casilla de control situada a la izquierda del campo Nombre de la propiedad que est&aacute; suprimiendo y, a continuaci&oacute;n, haga clic en Suprimir propiedades.</p>
</li>
</ul>
</li>
<li>
<p>Haga clic en Guardar.</p>
</li>
</ol>
<a id="GHCON118" name="GHCON118"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-managedscheduledexecutorservicecreate.html">Para crear un servicio de ejecutor programado gestionado</a></p>
</li>
<li>
<p><a href="task-managedscheduledexecutorservicedelete.html">Para suprimir un servicio de ejecutor programado gestionado</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
