<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-threadpools" name="ref-threadpools"></a><a id="GHWEB00027" name="GHWEB00027"></a></p>

<h4><a id="sthref168" name="sthref168"></a><a id="sthref169" name="sthref169"></a>&#32363;&#32218;&#38598;&#21312;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&#12300;&#32363;&#32218;&#38598;&#21312;&#12301;&#38913;&#38754;&#21487;&#32068;&#24907;&#32363;&#32218;&#38598;&#21312;&#12290;</p>
<p>&#20351;&#29992;&#32363;&#32218;&#38598;&#21312;&#21487;&#23559;&#26381;&#21209;&#38480;&#21046;&#22312;&#29305;&#23450;&#25976;&#30446;&#30340;&#20006;&#34892;&#36939;&#20316;&#32363;&#32218;&#12290;</p>
<p>&#30070;&#24744;&#31532;&#19968;&#27425;&#23433;&#35037; GlassFish Server &#26178;&#65292;&#38928;&#35373;&#24050;&#23384;&#22312;&#20841;&#20491;&#32363;&#32218;&#38598;&#21312;&#12290;&#21517;&#31281;&#28858; <code>http-thread-pool</code> &#30340;&#32363;&#32218;&#38598;&#21312;&#26159;&#28858;&#20379;&#32178;&#36335;&#30435;&#32893;&#31243;&#24335;&#20351;&#29992;&#32780;&#32068;&#24907;&#65292;&#32780; <code>thread-pool-1</code> &#26159;&#28858;&#20379; ORB &#37341;&#23565; RMI/IIOP &#35531;&#27714;&#20351;&#29992;&#32780;&#32068;&#24907;&#12290;&#24744;&#21487;&#33021;&#38656;&#35201;&#24314;&#31435;&#20855;&#26377;&#19981;&#21516;&#35373;&#23450;&#30340;&#32363;&#32218;&#38598;&#21312;&#65292;&#20197;&#20379;&#29305;&#23450;&#31278;&#39006;&#25033;&#29992;&#31243;&#24335;&#21644;&#29305;&#23450;&#30828;&#39636;&#31995;&#32113;&#20351;&#29992;&#65292;&#25110;&#35222;&#24744;&#30340;&#38656;&#35201;&#35519;&#26657;&#38928;&#35373;&#32363;&#32218;&#38598;&#21312;&#12290;</p>
<p>Java &#34395;&#25836;&#27231;&#22120; (JVM) &#21487;&#20197;&#25903;&#25588;&#19968;&#27425;&#22519;&#34892;&#22810;&#20491;&#32363;&#32218;&#12290;&#28858;&#20102;&#25552;&#26119;&#25928;&#33021;&#65292;GlassFish Server &#21487;&#32173;&#35703;&#19968;&#20491;&#25110;&#22810;&#20491;&#32363;&#32218;&#38598;&#21312;&#12290;&#24744;&#21487;&#20197;&#23559;&#29305;&#23450;&#30340;&#32363;&#32218;&#38598;&#21312;&#25351;&#23450;&#32102;&#29305;&#23450;&#30340;&#26381;&#21209;&#12290;</p>
<p>&#19968;&#20491;&#32363;&#32218;&#38598;&#21312;&#21487;&#20379;&#22810;&#20491;&#26381;&#21209;&#20351;&#29992;&#12290;&#35531;&#27714;&#32363;&#32218;&#26371;&#34389;&#29702;&#20351;&#29992;&#32773;&#35531;&#27714;&#12290;&#20282;&#26381;&#22120;&#25910;&#21040;&#35531;&#27714;&#26178;&#65292;&#23427;&#26371;&#23559;&#35442;&#35531;&#27714;&#25351;&#23450;&#32102;&#32363;&#32218;&#38598;&#21312;&#20013;&#30340;&#31354;&#38289;&#32363;&#32218;&#12290;&#32363;&#32218;&#26371;&#22519;&#34892;&#24478;&#23660;&#31471;&#35531;&#27714;&#65292;&#20006;&#20659;&#22238;&#32080;&#26524;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#35531;&#27714;&#38656;&#35201;&#20351;&#29992;&#30446;&#21069;&#34987;&#20308;&#29992;&#30340;&#31995;&#32113;&#36039;&#28304;&#65292;&#21063;&#27492;&#32363;&#32218;&#23559;&#31561;&#24453;&#65292;&#30452;&#33267;&#27492;&#36039;&#28304;&#21487;&#29992;&#26178;&#65292;&#25165;&#20801;&#35377;&#35531;&#27714;&#20351;&#29992;&#27492;&#36039;&#28304;&#12290;</p>
<p>&#25351;&#23450;&#20445;&#30041;&#32102;&#35531;&#27714;&#30340;&#26368;&#22823;&#32363;&#32218;&#25976;&#21644;&#26368;&#23567;&#32363;&#32218;&#25976;&#12290;&#21487;&#20197;&#22312;&#36889;&#20841;&#20491;&#20540;&#20043;&#38291;&#65292;&#21205;&#24907;&#35519;&#25972;&#32363;&#32218;&#38598;&#21312;&#12290;&#25351;&#23450;&#30340;&#26368;&#23567;&#32363;&#32218;&#38598;&#21312;&#22823;&#23567;&#65292;&#23559;&#35201;&#27714;&#20282;&#26381;&#22120;&#37197;&#32622;&#33267;&#23569;&#36889;&#20491;&#25976;&#37327;&#30340;&#20445;&#30041;&#32363;&#32218;&#32102;&#35531;&#27714;&#12290;&#35442;&#25976;&#30446;&#21487;&#20197;&#22686;&#21152;&#21040;&#25152;&#25351;&#23450;&#30340;&#26368;&#22823;&#32363;&#32218;&#38598;&#21312;&#22823;&#23567;&#12290;</p>
<p>&#22686;&#21152;&#34389;&#29702;&#20316;&#26989;&#21487;&#29992;&#30340;&#32363;&#32218;&#25976;&#30446;&#65292;&#21487;&#35731;&#34389;&#29702;&#20316;&#26989;&#21516;&#26178;&#22238;&#25033;&#26356;&#22810;&#30340;&#35531;&#27714;&#12290;</p>
<p>&#23565;&#26044;&#27599;&#20491;&#32363;&#32218;&#38598;&#21312;&#65292;&#22343;&#25552;&#20379;&#20197;&#19979;&#36039;&#35338;&#12290;</p>
<dl>
<dt>&#32363;&#32218;&#38598;&#21312; ID</dt>
<dd>
<p>&#32363;&#32218;&#38598;&#21312;&#30340;&#21517;&#31281;&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#32363;&#32218;&#38598;&#21312;&#22823;&#23567;</dt>
<dd>
<p>&#32363;&#32218;&#38598;&#21312;&#20013;&#32363;&#32218;&#30340;&#26368;&#22823;&#25976;&#30446;&#12290;</p>
</dd>
<dt>&#26368;&#23567;&#32363;&#32218;&#38598;&#21312;&#22823;&#23567;</dt>
<dd>
<p>&#32363;&#32218;&#38598;&#21312;&#20013;&#32363;&#32218;&#30340;&#26368;&#23567;&#25976;&#30446;&#12290;&#36889;&#20123;&#32363;&#32218;&#26159;&#22312;&#23526;&#20363;&#21270;&#32363;&#32218;&#38598;&#21312;&#26178;&#24314;&#31435;&#30340;&#12290;</p>
</dd>
<dt>&#20295;&#21015;&#26368;&#22823;&#22823;&#23567;</dt>
<dd>
<p>&#22312;&#26377;&#32363;&#32218;&#21487;&#34389;&#29702;&#35338;&#24687;&#20043;&#21069;&#65292;&#21487;&#25490;&#20837;&#20295;&#21015;&#30340;&#26368;&#22823;&#35338;&#24687;&#25976;&#30446;&#12290;</p>
</dd>
<dt>&#38290;&#32622;&#32363;&#32218;&#36926;&#26178;</dt>
<dd>
<p>&#24478;&#38598;&#21312;&#20013;&#31227;&#38500;&#38290;&#32622;&#32363;&#32218;&#20043;&#21069;&#32147;&#36942;&#30340;&#26178;&#38291; (&#20197;&#31186;&#28858;&#21934;&#20301;)&#12290;</p>
</dd>
</dl>
<p>&#32363;&#32218;&#38598;&#21312;&#34920;&#20063;&#21253;&#21547;&#19979;&#21015;&#36984;&#38917;&#12290;</p>
<dl>
<dt>&#26032;&#24314;</dt>
<dd>
<p>&#24314;&#31435;&#26032;&#32363;&#32218;&#38598;&#21312;&#30340;&#25353;&#37397;&#12290;</p>
</dd>
<dt>&#21034;&#38500;</dt>
<dd>
<p>&#21034;&#38500;&#19968;&#25110;&#22810;&#20491;&#36984;&#21462;&#32363;&#32218;&#38598;&#21312;&#30340;&#25353;&#37397;&#12290;</p>
</dd>
</dl>
<a id="sthref170" name="sthref170"></a>
<h5>&#30456;&#38364;&#20316;&#26989;</h5>
<ul>
<li>
<p><a href="task-threadpoolnew.html">&#24314;&#31435;&#32363;&#32218;&#38598;&#21312;</a></p>
</li>
<li>
<p><a href="task-threadpooledit.html">&#32232;&#36655;&#32363;&#32218;&#38598;&#21312;</a></p>
</li>
<li>
<p><a href="task-threadpooldelete.html">&#21034;&#38500;&#32363;&#32218;&#38598;&#21312;</a></p>
</li>
</ul>
<a id="sthref171" name="sthref171"></a>
<h5>&#30456;&#38364;&#30340; asadmin &#21629;&#20196;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00060"><code>create-threadpool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00204"><code>list-threadpools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00111"><code>delete-threadpool</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
