<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-virtualserveredit" name="ref-virtualserveredit"></a><a id="GHWEB00013" name="GHWEB00013"></a></p>

<h4><a id="sthref126" name="sthref126"></a>&#32232;&#36655;&#34395;&#25836;&#20282;&#26381;&#22120;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&#12300;&#32232;&#36655;&#34395;&#25836;&#20282;&#26381;&#22120;&#12301;&#38913;&#38754;&#21487;&#20462;&#25913;&#34395;&#25836;&#20282;&#26381;&#22120;&#30340;&#35373;&#23450;&#12290;</p>
<p>&#12300;&#32232;&#36655;&#34395;&#25836;&#20282;&#26381;&#22120;&#12301;&#38913;&#38754;&#21253;&#21547;&#19979;&#21015;&#36984;&#38917;&#12290;</p>
<dl>
<dt>&#36617;&#20837;&#38928;&#35373;&#20540;</dt>
<dd>
<p>&#29992;&#26044;&#23559;&#20855;&#26377;&#38928;&#35373;&#20540;&#30340;&#35373;&#23450;&#24489;&#21407;&#28858;&#35373;&#23450;&#20540;&#30340;&#25353;&#37397;&#12290;&#27794;&#26377;&#38928;&#35373;&#20540;&#30340;&#35373;&#23450;&#21063;&#20445;&#25345;&#19981;&#35722;&#12290;</p>
</dd>
<dt>&#32068;&#24907;&#21517;&#31281;</dt>
<dd>
<p>&#22871;&#29992;&#27492;&#38913;&#38754;&#19978;&#20043;&#35373;&#23450;&#30340;&#32068;&#24907;&#21517;&#31281;&#12290;&#26412;&#27396;&#20301;&#26159;&#21807;&#35712;&#30340;&#12290;</p>
</dd>
<dt>ID</dt>
<dd>
<p>&#20839;&#37096;&#39023;&#31034;&#30340;&#34395;&#25836;&#20282;&#26381;&#22120;&#35672;&#21029;&#30908;&#12290;&#32780;&#19981;&#26371;&#25552;&#20379;&#32102; HTTP &#24478;&#23660;&#31471;&#12290;&#25552;&#20379;&#32102; HTTP &#24478;&#23660;&#31471;&#30340;&#20027;&#27231;&#21517;&#31281;&#24517;&#38920;&#22312;&#12300;&#20027;&#27231;&#12301;&#27396;&#20301;&#20013;&#25351;&#23450;&#12290;</p>
</dd>
<dt>&#20027;&#27231;</dt>
<dd>
<p>&#19968;&#25110;&#22810;&#20491;&#22519;&#34892;&#20282;&#26381;&#22120;&#30340;&#27231;&#22120;&#20043;&#20027;&#27231;&#21517;&#31281;&#12290;&#20351;&#29992;&#24050;&#22312;&#32178;&#36335;&#20043; DNS &#20282;&#26381;&#22120;&#35387;&#20874; (&#23565;&#26044; UNIX &#31995;&#32113;&#65292;&#21063;&#26159;&#24050;&#22312; <code>/etc/hosts</code> &#27284;&#26696;&#20013;&#35387;&#20874;) &#30340;&#23526;&#38555;&#20027;&#27231;&#21517;&#31281;&#25110;&#34395;&#25836;&#20027;&#27231;&#21517;&#31281;&#12290;&#38928;&#35373;&#20540;&#28858;&#31995;&#32113;&#29305;&#24615;&#20540; <code>${com.sun.aas.hostName}</code>&#12290;</p>
</dd>
<dt>&#29376;&#24907;</dt>
<dd>
<p>&#20282;&#26381;&#22120;&#25152;&#38656;&#30340;&#29376;&#24907;&#12290;&#20540;&#21487;&#33021;&#28858;&#19979;&#21015;&#20854;&#20013;&#20043;&#19968;&#65306;</p>
<dl>
<dt>&#38283;</dt>
<dd>
<p>&#34395;&#25836;&#20282;&#26381;&#22120;&#34389;&#26044;&#20351;&#29992;&#20013;&#29376;&#24907;&#12290;&#27492;&#28858;&#38928;&#35373;&#20540;&#12290;</p>
</dd>
<dt>&#38364;</dt>
<dd>
<p>&#34395;&#25836;&#20282;&#26381;&#22120;&#34389;&#26044;&#38750;&#20351;&#29992;&#20013;&#29376;&#24907;&#12290;&#33509;&#22039;&#35430;&#23384;&#21462;&#20282;&#26381;&#22120;&#21063;&#20659;&#22238;&#37679;&#35492;&#30908; 404 (&#36039;&#28304;&#28961;&#27861;&#20351;&#29992;)&#12290;</p>
</dd>
<dt>&#24050;&#20572;&#29992;</dt>
<dd>
<p>&#34395;&#25836;&#20282;&#26381;&#22120;&#24050;&#20572;&#29992;&#12290;&#33509;&#22039;&#35430;&#23384;&#21462;&#20282;&#26381;&#22120;&#21063;&#20659;&#22238;&#37679;&#35492;&#30908; 403 (&#25298;&#32085;&#22519;&#34892;&#35531;&#27714;)&#12290;</p>
</dd>
</dl>
</dd>
<dt>SSO</dt>
<dd>
<p>&#25351;&#23450; Single Sign-On &#36939;&#20316;&#26041;&#24335;&#26159;&#21542;&#32380;&#25215;&#33258; HTTP &#26381;&#21209; (&#24050;&#21855;&#29992;&#25110;&#24050;&#20572;&#29992;)&#12290;&#20381;&#38928;&#35373;&#65292;&#26371;&#32380;&#25215;&#33258; HTTP &#26381;&#21209;&#12290;&#33509;&#21855;&#29992;&#27492;&#36984;&#38917;&#65292;&#26371;&#37341;&#23565;&#27492;&#34395;&#25836;&#20282;&#26381;&#22120;&#19978;&#28858;&#30456;&#21516;&#31684;&#22285;&#32068;&#24907;&#30340; Web &#25033;&#29992;&#31243;&#24335;&#21855;&#29992; Single Sign-On&#12290;&#33509;&#20572;&#29992;&#27492;&#36984;&#38917;&#65292;&#21063;&#26371;&#37341;&#23565;&#27492;&#34395;&#25836;&#20282;&#26381;&#22120;&#20572;&#29992; Single Sign-On&#65292;&#19988;&#20351;&#29992;&#32773;&#24517;&#38920;&#22312;&#20351;&#29992;&#34395;&#25836;&#20282;&#26381;&#22120;&#19978;&#30340;&#27599;&#20491;&#25033;&#29992;&#31243;&#24335;&#26178;&#36914;&#34892;&#20998;&#21029;&#35469;&#35657;&#12290;</p>
</dd>
<dt>&#32178;&#36335;&#30435;&#32893;&#22120;</dt>
<dd>
<p>&#33287;&#27492;&#20282;&#26381;&#22120;&#38364;&#32879;&#30340;&#19968;&#25110;&#22810;&#20491;&#32178;&#36335;&#30435;&#32893;&#22120;&#12290;</p>
</dd>
<dt>&#38928;&#35373; Web &#27169;&#32068;</dt>
<dd>
<p>&#24050;&#24314;&#32622;&#30340; Web &#27169;&#32068; (&#22914;&#26524;&#26377;)&#65292;&#27492;&#27169;&#32068;&#23559;&#22238;&#25033;&#25152;&#26377;&#28961;&#27861;&#23565;&#25033;&#33267;&#20854;&#20182; Web &#27169;&#32068; (&#24050;&#24314;&#32622;&#21040;&#34395;&#25836;&#20282;&#26381;&#22120;) &#30340;&#35531;&#27714;&#12290;&#22914;&#26524;&#26410;&#25351;&#23450;&#38928;&#35373; Web &#27169;&#32068;&#65292;&#21063;&#20351;&#29992;&#20855;&#26377;&#31354;&#29872;&#22659;&#26681;&#30446;&#37636;&#30340; Web &#27169;&#32068;&#12290;&#22914;&#26524;&#27794;&#26377;&#29872;&#22659;&#26681;&#30446;&#37636;&#28858;&#31354;&#30340; Web &#27169;&#32068;&#65292;&#21063;&#26371;&#24314;&#31435;&#21644;&#20351;&#29992;&#31995;&#32113;&#38928;&#35373;&#30340; Web &#27169;&#32068;&#12290;</p>
</dd>
<dt>&#26085;&#35468;&#27284;</dt>
<dd>
<p>&#23559;&#39023;&#31034;&#27492;&#34395;&#25836;&#20282;&#26381;&#22120;&#26085;&#35468;&#35338;&#24687;&#25152;&#22312;&#30340;&#27284;&#26696;&#20043;&#36335;&#24465;&#21517;&#31281;&#12290;&#20381;&#38928;&#35373;&#65292;&#35352;&#37636;&#26085;&#35468;&#35338;&#24687;&#26371;&#39023;&#31034;&#22312; domain-dir<code>/logs/server.log</code> &#20013;&#12290;</p>
</dd>
<dt>&#25991;&#20214;&#26681;</dt>
<dd>
<p>&#20282;&#26381;&#22120;&#26681;&#25991;&#20214;&#30446;&#37636;&#30340;&#32085;&#23565;&#36335;&#24465;&#12290;&#38928;&#35373;&#20540;&#28858; domain-dir<code>/docroot</code>&#12290;</p>
</dd>
<dt>&#23384;&#21462;&#35352;&#37636;&#26085;&#35468;</dt>
<dd>
<p>&#25351;&#23450;&#23384;&#21462;&#35352;&#37636;&#26085;&#35468;&#26159;&#21542;&#32380;&#25215;&#33258; HTTP &#26381;&#21209; (&#24050;&#21855;&#29992;&#25110;&#24050;&#20572;&#29992;)&#12290;&#20381;&#38928;&#35373;&#65292;&#26371;&#32380;&#25215;&#33258; HTTP &#26381;&#21209;&#12290;</p>
</dd>
<dt>&#30446;&#37636;</dt>
<dd>
<p>&#20282;&#26381;&#22120;&#23384;&#21462;&#26085;&#35468;&#30340;&#32085;&#23565;&#30446;&#37636;&#36335;&#24465;&#12290;&#38928;&#35373;&#20540;&#28858; domain-dir<code>/logs/access</code>&#12290;</p>
</dd>
<dt>&#20854;&#20182;&#29305;&#24615;</dt>
<dd>
<p>&#34395;&#25836;&#20282;&#26381;&#22120;&#30340;&#20854;&#20182;&#29305;&#24615;&#12290;</p>
<p>&#22914;&#38656;&#21487;&#29992;&#29305;&#24615;&#30340;&#30456;&#38364;&#36039;&#35338;&#65292;&#35531;&#21443;&#38321;<a href="ref-virtualserverprops.html">&#34395;&#25836;&#20282;&#26381;&#22120;&#29305;&#23450;&#30340;&#29305;&#24615;</a>&#12290;</p>
</dd>
</dl>
<a id="sthref127" name="sthref127"></a>
<h5>&#30456;&#38364;&#20316;&#26989;</h5>
<ul>
<li>
<p><a href="task-virtualservercreate.html">&#24314;&#31435;&#34395;&#25836;&#20282;&#26381;&#22120;</a></p>
</li>
<li>
<p><a href="task-virtualserveredit.html">&#32232;&#36655;&#34395;&#25836;&#20282;&#26381;&#22120;</a></p>
</li>
<li>
<p><a href="task-virtualserverdelete.html">&#21034;&#38500;&#34395;&#25836;&#20282;&#26381;&#22120;</a></p>
</li>
</ul>
<a id="sthref128" name="sthref128"></a>
<h5>&#30456;&#38364;&#30340; asadmin &#21629;&#20196;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00062"><code>create-virtual-server</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00207"><code>list-virtual-servers</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00113"><code>delete-virtual-server</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
