<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-webcontaineravailability" name="ref-webcontaineravailability"></a></p>

<h4><a id="sthref79" name="sthref79"></a><a id="sthref80" name="sthref80"></a>Web &#23481;&#22120;&#21487;&#29992;&#24615;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&#12300;Web &#23481;&#22120;&#21487;&#29992;&#24615;&#12301;&#38913;&#38754;&#21487;&#32068;&#24907; Web &#23481;&#22120;&#30340;&#21487;&#29992;&#24615;&#35373;&#23450;&#12290;</p>
<p>&#12300;Web &#23481;&#22120;&#21487;&#29992;&#24615;&#12301;&#38913;&#38754;&#21253;&#21547;&#19979;&#21015;&#36984;&#38917;&#12290;</p>
<dl>
<dt>&#36617;&#20837;&#38928;&#35373;&#20540;</dt>
<dd>
<p>&#29992;&#26044;&#23559;&#20855;&#26377;&#38928;&#35373;&#20540;&#30340;&#35373;&#23450;&#24489;&#21407;&#28858;&#35373;&#23450;&#20540;&#30340;&#25353;&#37397;&#12290;&#27794;&#26377;&#38928;&#35373;&#20540;&#30340;&#35373;&#23450;&#21063;&#20445;&#25345;&#19981;&#35722;&#12290;</p>
</dd>
<dt>&#32068;&#24907;&#21517;&#31281;</dt>
<dd>
<p>&#22871;&#29992;&#27492;&#38913;&#38754;&#19978;&#20043;&#35373;&#23450;&#30340;&#32068;&#24907;&#21517;&#31281;&#12290;&#26412;&#27396;&#20301;&#26159;&#21807;&#35712;&#30340;&#12290;</p>
</dd>
<dt>&#21487;&#29992;&#24615;&#26381;&#21209;</dt>
<dd>
<p>&#22914;&#26524;&#36984;&#21462;&#12300;&#24050;&#21855;&#29992;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#21063;&#26371;&#28858; Web &#23481;&#22120;&#21855;&#29992;&#21487;&#29992;&#24615;&#12290;</p>
</dd>
<dt>&#25345;&#32396;&#24615;&#39006;&#22411;</dt>
<dd>
<p>&#25152;&#20351;&#29992;&#30340;&#25345;&#32396;&#24615;&#27231;&#21046;&#12290;</p>
<ul>
<li>
<p>&#22914;&#26524;<i>&#26410;</i>&#21246;&#36984;&#12300;&#21487;&#29992;&#24615;&#26381;&#21209;&#12301;&#30340;&#12300;&#24050;&#21855;&#29992;&#12301;&#26041;&#22602;&#65292;&#35531;&#36984;&#21462;&#19979;&#21015;&#20854;&#20013;&#19968;&#38917;&#65306;</p>
<ul>
<li>
<p><code>memory</code>&#65292;&#29992;&#26044;&#27794;&#26377;&#38542;&#27573;&#20316;&#26989;&#25345;&#32396;&#24615;&#30340;&#24773;&#27841;</p>
</li>
<li>
<p><code>file</code>&#65292;&#29992;&#26044;&#26681;&#25818;&#38750;&#39640;&#21487;&#29992;&#24615;&#27284;&#26696;&#31995;&#32113;&#30340;&#38542;&#27573;&#20316;&#26989;&#25345;&#32396;&#24615;</p>
</li>
</ul>
</li>
<li>
<p>&#33509;&#21246;&#36984;&#12300;&#21487;&#29992;&#24615;&#26381;&#21209;&#12301;&#30340;&#12300;&#24050;&#21855;&#29992;&#12301;&#26041;&#22602;&#65292;&#35531;&#36984;&#21462; <code>replicated</code>&#65292;&#29992;&#26044;&#26681;&#25818;&#39640;&#21487;&#29992;&#24615;&#21474;&#38598;&#23481;&#37679;&#31227;&#36681;&#30340;&#38542;&#27573;&#20316;&#26989;&#25345;&#32396;&#24615;&#12290;</p>
</li>
</ul>
</dd>
<dt>&#25345;&#32396;&#24615;&#38971;&#29575;</dt>
<dd>
<p>&#20786;&#23384; HTTP &#38542;&#27573;&#20316;&#26989;&#30340;&#38971;&#29575;&#65306;</p>
<ul>
<li>
<p><code>web-method</code> &mdash; &#22312;&#27599;&#20491; Web &#35531;&#27714;&#32080;&#26463;&#19988;&#23559;&#22238;&#25033;&#20659;&#36865;&#22238;&#24478;&#23660;&#31471;&#20043;&#21069;&#65292;&#20786;&#23384;&#38542;&#27573;&#20316;&#26989;&#29376;&#24907;&#12290;&#27492;&#27169;&#24335;&#28858;&#30332;&#29983;&#25925;&#38556;&#26178;&#23436;&#20840;&#26356;&#26032;&#38542;&#27573;&#20316;&#26989;&#29376;&#24907;&#25552;&#20379;&#20102;&#26368;&#22909;&#30340;&#20445;&#35657;&#12290;&#27492;&#28858;&#38928;&#35373;&#20540;&#12290;</p>
</li>
</ul>
</dd>
<dt>&#25345;&#32396;&#24615;&#31684;&#22285;</dt>
<dd>
<p>&#35201;&#36914;&#34892;&#20786;&#23384;&#25152;&#38656;&#30340; HTTP &#38542;&#27573;&#20316;&#26989;&#35722;&#26356;&#31684;&#22285;&#65306;</p>
<ul>
<li>
<p><code>session</code> &mdash; &#27599;&#27425;&#37117;&#20786;&#23384;&#25972;&#20491;&#38542;&#27573;&#20316;&#26989;&#29376;&#24907;&#12290;&#27492;&#27169;&#24335;&#28858;&#27491;&#30906;&#20786;&#23384;&#20219;&#20309;&#21487;&#20998;&#25955; Web &#25033;&#29992;&#31243;&#24335;&#30340;&#38542;&#27573;&#20316;&#26989;&#36039;&#26009;&#25552;&#20379;&#20102;&#26368;&#22909;&#30340;&#20445;&#35657;&#12290;</p>
</li>
<li>
<p><code>modified-session</code> &mdash; &#22914;&#26524;&#38542;&#27573;&#20316;&#26989;&#29376;&#24907;&#24050;&#20462;&#25913;&#65292;&#21063;&#20786;&#23384;&#25972;&#20491;&#38542;&#27573;&#20316;&#26989;&#29376;&#24907;&#12290;&#22914;&#26524;&#21628;&#21483;&#20102; <code>HttpSession.setAttribute()</code> &#25110; <code>HttpSession.removeAttribute()</code>&#65292;&#21063;&#31995;&#32113;&#23559;&#35469;&#28858;&#38542;&#27573;&#20316;&#26989;&#24050;&#36973;&#20462;&#25913;&#12290;&#24517;&#38920;&#20445;&#35657;&#27599;&#27425;&#35722;&#26356;&#23660;&#24615;&#26178;&#37117;&#21628;&#21483; <code>setAttribute()</code>&#12290;&#36889;&#19981;&#26159; Java EE &#35215;&#26684;&#30340;&#38656;&#27714;&#65292;&#20294;&#26159;&#27492;&#27169;&#24335;&#38656;&#35201;&#36889;&#27171;&#20570;&#25165;&#33021;&#27491;&#24120;&#24037;&#20316;&#12290;</p>
</li>
<li>
<p><code>modified-attribute</code> &mdash; &#20677;&#20786;&#23384;&#20462;&#25913;&#30340;&#38542;&#27573;&#20316;&#26989;&#23660;&#24615;&#12290;&#33509;&#35201;&#20351;&#27492;&#27169;&#24335;&#27491;&#24120;&#36939;&#20316;&#65292;&#24744;&#24517;&#38920;&#36981;&#24490;&#20197;&#19979;&#20351;&#29992;&#28310;&#21063;&#65306;</p>
<ul>
<li>
<p>&#27599;&#27425;&#20462;&#25913;&#38542;&#27573;&#20316;&#26989;&#29376;&#24907;&#26178;&#22343;&#21628;&#21483; <code>setAttribute()</code>&#12290;</p>
</li>
<li>
<p>&#30906;&#23450;&#21508;&#23660;&#24615;&#20043;&#38291;&#27794;&#26377;&#20132;&#21449;&#21443;&#29031;&#12290;&#31995;&#32113;&#23559;&#23565;&#27599;&#20491;&#19981;&#21516;&#23660;&#24615;&#38364;&#37749;&#23383;&#19979;&#30340;&#29289;&#20214;&#22294;&#24418;&#21934;&#29544;&#36914;&#34892;&#20018;&#21015;&#21270;&#20006;&#21934;&#29544;&#20786;&#23384;&#12290;&#22914;&#26524;&#27599;&#20491;&#21934;&#29544;&#30340;&#38364;&#37749;&#23383;&#19979;&#30340;&#29289;&#20214;&#20043;&#38291;&#23384;&#22312;&#29289;&#20214;&#20132;&#21449;&#21443;&#29031;&#65292;&#21063;&#23427;&#20497;&#23559;&#19981;&#26371;&#36914;&#34892;&#27491;&#30906;&#20018;&#21015;&#21270;&#21644;&#21453;&#20018;&#21015;&#21270;&#12290;</p>
</li>
<li>
<p>&#22312;&#22810;&#20491;&#23660;&#24615;&#20043;&#38291;&#20998;&#24067;&#38542;&#27573;&#20316;&#26989;&#29376;&#24907;&#65292;&#25110;&#32773;&#33267;&#23569;&#22312;&#21807;&#35712;&#23660;&#24615;&#21644;&#21487;&#20462;&#25913;&#23660;&#24615;&#20043;&#38291;&#20998;&#24067;&#38542;&#27573;&#20316;&#26989;&#29376;&#24907;&#12290;</p>
</li>
</ul>
</li>
</ul>
</dd>
<dt>Single-Sign-On &#29376;&#24907;</dt>
<dd>
<p>&#22312;&#36984;&#21462;&#12300;&#24050;&#21855;&#29992;&#12301;&#26680;&#21462;&#26041;&#22602;&#24460;&#65292;&#21487;&#29992;&#26044;&#23481;&#37679;&#31227;&#36681;&#30340; Single Sign-On &#29376;&#24907;&#12290;</p>
</dd>
<dt>&#20854;&#20182;&#29305;&#24615;</dt>
<dd>
<p>Web &#23481;&#22120;&#21487;&#29992;&#24615;&#30340;&#20854;&#20182;&#29305;&#24615;&#12290;</p>
<p>GlassFish Server &#26410;&#23450;&#32681;&#20219;&#20309;&#20854;&#20182; Web &#23481;&#22120;&#21487;&#29992;&#24615;&#29305;&#24615;&#12290;</p>
</dd>
</dl>
<a id="sthref81" name="sthref81"></a>
<h5>&#30456;&#38364;&#20316;&#26989;</h5>
<ul>
<li>
<p><a href="task-webcontainergeneral.html">&#32068;&#24907; Web &#23481;&#22120;&#30340;&#19968;&#33324;&#29305;&#24615;</a></p>
</li>
<li>
<p><a href="task-webcontainersessiontimeout.html">&#32068;&#24907; Web &#23481;&#22120;&#30340;&#38542;&#27573;&#20316;&#26989;&#29305;&#24615;</a></p>
</li>
<li>
<p><a href="task-webcontainermanagerprops.html">&#32068;&#24907; Web &#23481;&#22120;&#30340;&#31649;&#29702;&#31243;&#24335;&#29305;&#24615;</a></p>
</li>
<li>
<p><a href="task-webcontainerstoreprops.html">&#32068;&#24907; Web &#23481;&#22120;&#30340;&#20786;&#23384;&#29305;&#24615;</a></p>
</li>
<li>
<p><a href="task-webcontaineravailability.html">&#32068;&#24907; Web &#23481;&#22120;&#30340;&#21487;&#29992;&#24615;&#35373;&#23450;</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
