<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-protocolnew" name="ref-protocolnew"></a></p>

<h4><a id="sthref141" name="sthref141"></a>&#26032;&#24314;&#21332;&#23450;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&#12300;&#26032;&#22686;&#21332;&#23450;&#12301;&#38913;&#38754;&#21487;&#24314;&#31435;&#26032;&#30340;&#32178;&#36335;&#21332;&#23450;&#12290;</p>
<p>&#24314;&#31435;&#21332;&#23450;&#24460;&#65292;&#19968;&#33324;&#26371;&#24314;&#31435;&#20855;&#26377;&#30456;&#21516;&#21517;&#31281;&#30340;&#32178;&#36335;&#30435;&#32893;&#22120;&#65292;&#28982;&#24460;&#23559;&#32178;&#36335;&#30435;&#32893;&#22120;&#33287;&#21332;&#23450;&#30456;&#38364;&#32879;&#12290;&#24744;&#20063;&#21487;&#20197;&#24314;&#31435;&#32178;&#36335;&#30435;&#32893;&#22120;&#65292;&#21516;&#26178;&#24314;&#31435;&#20351;&#29992;&#38928;&#35373;&#35373;&#23450;&#30340;&#21332;&#23450;&#12290;</p>
<p>&#12300;&#26032;&#22686;&#21332;&#23450;&#12301;&#38913;&#38754;&#21253;&#21547;&#19979;&#21015;&#36984;&#38917;&#12290;</p>
<dl>
<dt>&#32068;&#24907;&#21517;&#31281;</dt>
<dd>
<p>&#22871;&#29992;&#27492;&#38913;&#38754;&#19978;&#20043;&#35373;&#23450;&#30340;&#32068;&#24907;&#21517;&#31281;&#12290;&#26412;&#27396;&#20301;&#26159;&#21807;&#35712;&#30340;&#12290;</p>
</dd>
<dt>&#21517;&#31281;</dt>
<dd>
<p>&#21332;&#23450;&#30340;&#21807;&#19968;&#21517;&#31281;&#12290;&#21332;&#23450;&#21517;&#31281;&#19981;&#33021;&#20197;&#25976;&#23383;&#28858;&#38283;&#38957;&#12290;</p>
</dd>
<dt>&#23433;&#20840;&#24615;</dt>
<dd>
<p>&#22914;&#26524;&#36984;&#21462;&#27492;&#36984;&#38917;&#65292;&#21063;&#21855;&#29992;&#21332;&#23450;&#30340;&#23433;&#20840;&#24615;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;&#22914;&#26524;&#24744;&#21855;&#29992;&#23433;&#20840;&#24615;&#65292;&#24744;&#21487;&#20197;&#20351;&#29992;&#12300;&#32232;&#36655;&#21332;&#23450;&#12301;&#38913;&#38754;&#30340;&#12300;SSL&#12301;&#27161;&#31844;&#20462;&#25913;&#23433;&#20840;&#24615;&#35373;&#23450;&#12290;</p>
</dd>
<dt>&#29376;&#24907;</dt>
<dd>
<p>&#22914;&#26524;&#36984;&#21462;&#27492;&#36984;&#38917;&#65292;&#21063;&#26371;&#21855;&#29992;&#27284;&#26696;&#24555;&#21462;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#21855;&#29992;&#12290;</p>
</dd>
<dt>&#26368;&#38263;&#23384;&#22312;&#26178;&#38291;</dt>
<dd>
<p>&#26377;&#25928;&#24555;&#21462;&#38917;&#30446;&#30340;&#26368;&#38263;&#23384;&#22312;&#26178;&#38291; (&#20197;&#31186;&#28858;&#21934;&#20301;) &#12290;</p>
<p>&#35442;&#21443;&#25976;&#21487;&#25511;&#21046;&#22312;&#24555;&#21462;&#27284;&#26696;&#20043;&#24460;&#65292;&#24555;&#21462;&#30340;&#36039;&#35338;&#30340;&#20351;&#29992;&#26178;&#38291;&#12290;&#23565;&#26044;&#36229;&#36942;&#26368;&#38263;&#23384;&#22312;&#26178;&#38291;&#30340;&#38917;&#30446;&#65292;&#23559;&#30001;&#21516;&#19968;&#27284;&#26696;&#30340;&#26032;&#38917;&#30446;&#21462;&#20195;&#12290;&#22914;&#26524;&#20839;&#23481;&#19981;&#32147;&#24120;&#35722;&#26356;&#65292;&#35531;&#22686;&#22823;&#35442;&#20540;&#20197;&#25552;&#26119;&#25928;&#33021;&#12290;</p>
<p>&#29702;&#24819;&#30340;&#26368;&#38263;&#23384;&#22312;&#26178;&#38291;&#21462;&#27770;&#26044;&#26159;&#21542;&#26371;&#23450;&#26399;&#20462;&#25913;&#29694;&#26377;&#27284;&#26696;&#12290;&#20363;&#22914;&#65292;&#33509;&#27599;&#22825;&#20381;&#22266;&#23450;&#38291;&#38548;&#20462;&#25913;&#27284;&#26696;&#22235;&#27425;&#65292;&#35531;&#32771;&#24942;&#23559;&#26368;&#38263;&#23384;&#22312;&#26178;&#38291;&#35373;&#23450;&#28858; 21600 &#31186; (6 &#23567;&#26178;)&#12290;&#21542;&#21063;&#65292;&#35531;&#32771;&#24942;&#23559;&#26368;&#38263;&#23384;&#22312;&#26178;&#38291;&#35373;&#23450;&#28858;&#27284;&#26696;&#20462;&#25913;&#24460;&#65292;&#24744;&#39000;&#24847;&#25552;&#20379;&#33290;&#29256;&#20839;&#23481;&#27284;&#26696;&#30340;&#26368;&#38263;&#26178;&#38291;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 30&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#24555;&#21462;&#22823;&#23567;</dt>
<dd>
<p>&#30913;&#30879;&#19978;&#27284;&#26696;&#24555;&#21462;&#30340;&#26368;&#22823;&#32317;&#35336;&#22823;&#23567; (&#20301;&#20803;&#32068;)&#12290;&#38928;&#35373;&#20540;&#28858; 10485760&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#27284;&#26696;&#35336;&#25976;</dt>
<dd>
<p>&#27284;&#26696;&#24555;&#21462;&#20013;&#21487;&#20786;&#23384;&#30340;&#26368;&#22823;&#27284;&#26696;&#25976;&#12290;</p>
<p>&#22914;&#26524;&#20540;&#36942;&#22823;&#65292;&#21063;&#20282;&#26381;&#22120;&#26371;&#24555;&#21462;&#37027;&#20123;&#28040;&#32791;&#35352;&#25014;&#39636;&#19988;&#19981;&#22826;&#38656;&#35201;&#30340;&#27284;&#26696;&#12290;&#22914;&#26524;&#20540;&#36942;&#23567;&#65292;&#21063;&#26371;&#22833;&#21435;&#24555;&#21462;&#30340;&#20778;&#40670;&#12290;&#35531;&#37341;&#23565;&#35442;&#23660;&#24615;&#22039;&#35430;&#20351;&#29992;&#19981;&#21516;&#30340;&#20540;&#65292;&#20197;&#20415;&#25214;&#21040;&#29992;&#26044;&#29305;&#23450;&#25033;&#29992;&#31243;&#24335;&#30340;&#26368;&#20339;&#35299;&#27770;&#26041;&#26696;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 1024&#12290;</p>
</dd>
<dt>&#20282;&#26381;&#22120;&#21517;&#31281;</dt>
<dd>
<p>&#35201;&#22312;&#20282;&#26381;&#22120;&#20659;&#36865;&#32102;&#24478;&#23660;&#31471;&#30340; URL &#20013;&#20351;&#29992;&#30340;&#20027;&#27231;&#21517;&#31281;&#12290;&#22914;&#26524;&#20282;&#26381;&#22120;&#20351;&#29992;&#21029;&#21517;&#65292;&#21063;&#35442;&#21517;&#31281;&#25033;&#28858;&#27492;&#21029;&#21517;&#12290;&#22914;&#26524;&#20282;&#26381;&#22120;&#26410;&#20351;&#29992;&#21029;&#21517;&#65292;&#35531;&#23559;&#27492;&#27396;&#20301;&#20445;&#30041;&#28858;&#31354;&#30333;&#12290;</p>
<p>&#27492;&#20540;&#26371;&#24433;&#38911;&#20282;&#26381;&#22120;&#33258;&#21205;&#29986;&#29983;&#30340; URL&#65307;&#20294;&#19981;&#26371;&#24433;&#38911;&#20786;&#23384;&#22312;&#20282;&#26381;&#22120;&#20013;&#30446;&#37636;&#21644;&#27284;&#26696;&#30340; URL&#12290;&#22914;&#26524;&#24744;&#30340;&#20282;&#26381;&#22120;&#20351;&#29992;&#21029;&#21517;&#65292;&#20282;&#26381;&#22120;&#21517;&#31281;&#25033;&#28858;&#27492;&#21029;&#21517;&#12290;&#22914;&#26524;&#38468;&#21152;&#20102;&#20882;&#34399;&#21644;&#36899;&#25509;&#22496;&#34399;&#30908;&#65292;&#21063;&#35442;&#36899;&#25509;&#22496;&#26371;&#29992;&#26044;&#20282;&#26381;&#22120;&#20659;&#36865;&#21040;&#24478;&#23660;&#31471;&#30340; URL&#12290;</p>
</dd>
<dt>&#38928;&#35373;&#34395;&#25836;&#20282;&#26381;&#22120;</dt>
<dd>
<p>&#35201;&#33287;&#27492;&#21332;&#23450;&#38364;&#32879;&#30340;&#34395;&#25836;&#20282;&#26381;&#22120;&#12290;&#20351;&#29992;&#12300;&#34395;&#25836;&#20282;&#26381;&#22120;&#12301;&#38913;&#38754;&#21487;&#23450;&#32681;&#34395;&#25836;&#20282;&#26381;&#22120;&#12290;</p>
</dd>
<dt>&#37325;&#26032;&#23566;&#21521;&#36899;&#25509;&#22496;</dt>
<dd>
<p>&#23559;&#35531;&#27714;&#37325;&#26032;&#23566;&#21521;&#33267;&#21478;&#19968;&#20491;&#36899;&#25509;&#22496;&#30340;&#36899;&#25509;&#22496;&#20540;&#12290;&#22914;&#26524;&#28415;&#36275;&#20197;&#19979;&#20841;&#20491;&#26781;&#20214;&#65292;GlassFish Server &#23559;&#33258;&#21205;&#37325;&#26032;&#23566;&#21521;&#35531;&#27714;&#65306;</p>
<ul>
<li>
<p>&#21443;&#29031;&#27492;&#21332;&#23450;&#30340;&#32178;&#36335;&#30435;&#32893;&#22120;&#25903;&#25588;&#38750; SSL &#35531;&#27714;&#12290;</p>
</li>
<li>
<p>&#25509;&#25910;&#20102;&#31526;&#21512;&#23433;&#20840;&#24615;&#38480;&#21046;&#38656;&#35201; SSL &#20659;&#36664;&#30340;&#35531;&#27714;&#12290;</p>
</li>
</ul>
<p>&#22914;&#26524;&#26410;&#25351;&#23450;&#37325;&#26032;&#23566;&#21521;&#36899;&#25509;&#22496;&#65292;&#21063; GlassFish Server &#26371;&#20351;&#29992;&#21407;&#22987;&#35531;&#27714;&#20013;&#25152;&#25351;&#23450;&#30340;&#36899;&#25509;&#22496;&#34399;&#30908;&#12290;&#20381;&#38928;&#35373;&#65292;&#19981;&#26371;&#25351;&#23450;&#36899;&#25509;&#22496;&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#36899;&#32218;&#25976;</dt>
<dd>
<p>&#25351;&#23450;&#22312;&#20282;&#26381;&#22120;&#38364;&#38281;&#36899;&#32218;&#20043;&#21069;&#21487;&#20197;&#20659;&#36664;&#30340;&#35531;&#27714;&#30340;&#26368;&#22823;&#25976;&#30446;&#12290;&#12300;&#25345;&#32396;&#20316;&#29992;&#12301;&#23376;&#31995;&#32113;&#26371;&#23450;&#26399;&#36650;&#35426;&#38290;&#32622;&#30340;&#36899;&#32218;&#12290;&#38928;&#35373;&#20540;&#28858; 256&#12290;</p>
<p>&#23559;&#35442;&#29305;&#24615;&#35373;&#23450;&#28858; 1 &#21487;&#20572;&#29992; HTTP/1.0 &#25345;&#32396;&#20316;&#29992;&#12289;HTTP/1.1 &#25345;&#32396;&#20316;&#29992;&#20197;&#21450;&#31649;&#32218;&#25805;&#20316;&#12290;0 &#20540;&#34920;&#31034;&#26371;&#27704;&#36960;&#25298;&#32085;&#35531;&#27714;&#12290;-1 &#20540;&#34920;&#31034;&#25345;&#32396;&#20316;&#29992;&#36899;&#32218;&#25976;&#30446;&#27794;&#26377;&#38480;&#21046;&#12290;</p>
</dd>
<dt>&#36926;&#26178;</dt>
<dd>
<p>&#23559;&#36899;&#32218;&#35222;&#28858;&#38290;&#32622;&#20006;&#20445;&#25345;&#22312;&#25345;&#32396;&#20316;&#29992;&#29376;&#24907;&#30340;&#26368;&#38263;&#26178;&#38291; (&#20197;&#31186;&#28858;&#21934;&#20301;)&#12290;&#22914;&#26524;&#20540;&#23567;&#26044;&#25110;&#31561;&#26044; 0&#65292;&#21063;&#34920;&#31034;&#25345;&#32396;&#20316;&#29992;&#36899;&#32218;&#26371;&#28961;&#38480;&#26399;&#20445;&#25345;&#38283;&#21855;&#12290;&#38928;&#35373;&#20540;&#28858; 30 &#31186;&#12290;</p>
</dd>
<dt>&#19978;&#20659;&#36926;&#26178;</dt>
<dd>
<p>&#33509;&#36984;&#21462;&#27492;&#36984;&#38917;&#65292;&#35712;&#21462;&#20301;&#20803;&#32068;&#36611;&#24930;&#30340; Servlet &#36899;&#32218;&#26371;&#22312;&#36899;&#32218;&#19978;&#20659;&#36926;&#26178;&#38480;&#21046;&#21040;&#36948;&#24460;&#38364;&#38281;&#12290;&#22914;&#26524;&#20572;&#29992;&#27492;&#36984;&#38917;&#65292;&#21063; Servlet &#36899;&#32218;&#19981;&#26371;&#36926;&#26178;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</dd>
<dt>&#36899;&#32218;&#19978;&#20659;&#36926;&#26178;</dt>
<dd>
<p>&#19978;&#20659;&#30340;&#36926;&#26178; (&#20197;&#27627;&#31186;&#28858;&#21934;&#20301;)&#12290;&#20677;&#30070;&#36984;&#21462;&#12300;&#21855;&#29992;&#19978;&#20659;&#36926;&#26178;&#12301;&#26680;&#21462;&#26041;&#22602;&#26178;&#65292;&#27492;&#27396;&#20301;&#25165;&#36969;&#29992;&#12290;&#38928;&#35373;&#20540;&#28858; 300000 &#27627;&#31186;&#12290;</p>
</dd>
<dt>&#35531;&#27714;&#36926;&#26178;</dt>
<dd>
<p>&#35531;&#27714;&#36926;&#26178;&#20043;&#21069;&#30340;&#31186;&#25976;&#12290;&#22914;&#26524;&#22312;&#21040;&#36948;&#36926;&#26178;&#20540;&#20043;&#21069;&#27794;&#26377;&#34389;&#29702;&#35531;&#27714;&#65292;&#21063;&#26371;&#24573;&#30053;&#35531;&#27714;&#12290;&#38928;&#35373;&#20540;&#28858; 30 &#31186;&#12290;</p>
</dd>
<dt>&#20659;&#36865;&#32233;&#34909;&#21312;&#22823;&#23567;</dt>
<dd>
<p>&#20659;&#36865;&#32233;&#34909;&#21312;&#30340;&#22823;&#23567; (&#21934;&#20301;&#28858;&#20301;&#20803;&#32068;)&#12290;&#38928;&#35373;&#20540;&#28858; 8192 &#20301;&#20803;&#32068;&#12290;</p>
</dd>
<dt>&#27161;&#38957;&#32233;&#34909;&#21312;&#38263;&#24230;</dt>
<dd>
<p>&#35531;&#27714;&#34389;&#29702;&#32363;&#32218;&#29992;&#26044;&#35712;&#21462;&#35531;&#27714;&#36039;&#26009;&#30340;&#32233;&#34909;&#21312;&#30340;&#22823;&#23567; (&#20197;&#20301;&#20803;&#32068;&#28858;&#21934;&#20301;)&#12290;&#38928;&#35373;&#20540;&#28858; 8192 &#20301;&#20803;&#32068;&#12290;</p>
</dd>
<dt>&#26368;&#22823; Post &#22823;&#23567;</dt>
<dd>
<p>POST &#21205;&#20316;&#30340;&#26368;&#22823;&#22823;&#23567; (&#20197;&#20301;&#20803;&#32068;&#28858;&#21934;&#20301;)&#12290;&#38928;&#35373;&#20540;&#28858; 2097152 &#20301;&#20803;&#32068;&#12290;</p>
</dd>
<dt>URI &#32232;&#30908;</dt>
<dd>
<p>&#29992;&#20358;&#35299;&#30908;&#25509;&#25910;&#30340;&#35531;&#27714; URI &#30340;&#23383;&#20803;&#38598;&#21517;&#31281;&#12290;&#20540;&#24517;&#38920;&#28858;&#26377;&#25928;&#30340; IANA &#23383;&#20803;&#38598;&#21517;&#31281;&#12290;&#38928;&#35373;&#20540;&#28858; UTF-8&#12290;</p>
</dd>
<dt>&#29256;&#26412;</dt>
<dd>
<p>&#20351;&#29992;&#30340; HTTP &#21332;&#23450;&#29256;&#26412;&#12290;&#38928;&#35373;&#20540;&#28858; HTTP/1.1&#12290;</p>
</dd>
<dt>&#22739;&#32302;</dt>
<dd>
<p>&#25351;&#23450;&#20351;&#29992; HTTP/1.1 GZIP &#22739;&#32302;&#65292;&#20197;&#31680;&#30465;&#20282;&#26381;&#22120;&#38971;&#23532;&#12290;&#21487;&#29992;&#30340;&#36984;&#38917;&#21253;&#25324;&#65306;</p>
<dl>
<dt><code>on</code></dt>
<dd>
<p>&#22739;&#32302;&#36039;&#26009;&#12290;</p>
</dd>
<dt><code>off</code></dt>
<dd>
<p>Disables compression.</p>
</dd>
<dt><code>force</code></dt>
<dd>
<p>&#24375;&#21046;&#19968;&#24459;&#36039;&#26009;&#22739;&#32302;&#12290;</p>
</dd>
</dl>
<p>&#38928;&#35373;&#20540;&#28858; <code>off</code>&#12290;</p>
</dd>
<dt>&#21487;&#22739;&#32302;&#30340; MIME &#39006;&#22411;</dt>
<dd>
<p>&#20351;&#29992; HTTP &#22739;&#32302;&#30340; MIME &#39006;&#22411;&#28165;&#21934; (&#20197;&#36887;&#34399;&#20998;&#38548;)&#12290;&#38928;&#35373;&#20540;&#28858; <code>text/html,text/xml,text/plain</code>&#12290;</p>
</dd>
<dt>&#26368;&#23567;&#22739;&#32302;&#22823;&#23567;</dt>
<dd>
<p>&#27284;&#26696;&#22871;&#29992;&#22739;&#32302;&#26178;&#30340;&#26368;&#23567;&#22823;&#23567;&#12290;&#22914;&#26524;&#23559;&#12300;&#22739;&#32302;&#12301;&#35373;&#23450;&#28858; <code>on</code> &#25110; <code>force</code> &#65292;&#21063;&#24517;&#38920;&#35373;&#23450;&#27492;&#20540;&#12290;&#38928;&#35373;&#20540;&#28858; 2048 &#20301;&#20803;&#32068;&#12290;</p>
</dd>
<dt>&#19981;&#22739;&#32302;&#20351;&#29992;&#32773;&#20195;&#29702;&#31243;&#24335;</dt>
<dd>
<p>&#31526;&#21512;&#19981;&#25033;&#20351;&#29992;&#22739;&#32302;&#30340; HTTP &#24478;&#23660;&#31471;&#20351;&#29992;&#32773;&#20195;&#29702;&#31243;&#24335;&#20043;&#27491;&#35215;&#34920;&#31034;&#24335;&#28165;&#21934; (&#20197;&#36887;&#34399;&#20998;&#38548;)&#12290;&#20381;&#38928;&#35373;&#65292;&#27492;&#20540;&#26159;&#31354;&#23383;&#20018;&#12290;</p>
</dd>
<dt>&#21463;&#38480;&#21046;&#30340;&#20351;&#29992;&#32773;&#20195;&#29702;&#31243;&#24335;</dt>
<dd>
<p>&#22871;&#29992; HTTP &#22739;&#32302;&#20043;&#21463;&#38480;&#21046;&#30340;&#20351;&#29992;&#32773;&#20195;&#29702;&#31243;&#24335;&#28165;&#21934;&#12290;&#22914;&#26524;&#27794;&#26377;&#25351;&#23450;&#20351;&#29992;&#32773;&#20195;&#29702;&#31243;&#24335;&#65292;&#21063;&#26371;&#23559; HTTP &#22739;&#32302;&#22871;&#29992;&#21040;&#25152;&#26377;&#20351;&#29992;&#32773;&#20195;&#29702;&#31243;&#24335;&#12290;&#20381;&#38928;&#35373;&#65292;&#19981;&#26371;&#25351;&#23450;&#20351;&#29992;&#32773;&#20195;&#29702;&#31243;&#24335;&#12290;</p>
</dd>
<dt>&#38928;&#35373;&#22238;&#25033;&#39006;&#22411;</dt>
<dd>
<p>&#25351;&#23450;&#38928;&#35373;&#22238;&#25033;&#39006;&#22411;&#30340;&#23383;&#20018;&#12290;&#35442;&#26684;&#24335;&#26159;&#20197;&#20998;&#34399;&#20998;&#38548;&#30340;&#23383;&#20018;&#65292;&#30001;&#20839;&#23481;&#39006;&#22411;&#12289;&#32232;&#30908;&#12289;&#35486;&#35328;&#21644;&#23383;&#20803;&#38598;&#32068;&#25104;&#12290;&#38928;&#35373;&#20540;&#28858; <code>text/html; charset=iso-8859-1</code>&#12290;</p>
</dd>
<dt>&#24050;&#24375;&#21046;&#22238;&#25033;&#39006;&#22411;</dt>
<dd>
<p>&#25351;&#23450;&#22312;&#27794;&#26377;&#31526;&#21512;&#27284;&#26696;&#21103;&#27284;&#21517;&#30340; MIME &#23565;&#25033;&#21487;&#29992;&#26178;&#25152;&#20351;&#29992;&#20043;&#35531;&#27714;&#39006;&#22411;&#30340;&#23383;&#20018;&#12290;&#35442;&#26684;&#24335;&#26159;&#20197;&#20998;&#34399;&#20998;&#38548;&#30340;&#23383;&#20018;&#65292;&#30001;&#20839;&#23481;&#39006;&#22411;&#12289;&#32232;&#30908;&#12289;&#35486;&#35328;&#21644;&#23383;&#20803;&#38598;&#32068;&#25104;&#12290;&#38928;&#35373;&#20540;&#28858; <code>text/html; charset=iso-8859-1</code>&#12290;</p>
</dd>
<dt>&#36681;&#25509;&#22120;</dt>
<dd>
<p>&#38748;&#24907;&#36039;&#28304;&#36681;&#25509;&#22120;&#30340;&#39006;&#21029;&#21517;&#31281;&#12290;&#38928;&#35373;&#20540;&#28858; <code>com.sun.grizzly.tcp.StaticResourcesAdapter</code>&#12290;</p>
</dd>
<dt>Comet &#25903;&#25588;</dt>
<dd>
<p>&#33509;&#36984;&#21462;&#27492;&#36984;&#38917;&#65292;&#21063;&#26371;&#37341;&#23565;&#21443;&#29031;&#27492;&#21332;&#23450;&#30340;&#32178;&#36335;&#30435;&#32893;&#22120;&#21855;&#29992; Comet &#25903;&#25588;&#12290;&#20381;&#38928;&#35373;&#65292;&#26371;&#20572;&#29992;&#27492;&#36984;&#38917;&#12290;&#22914;&#26524;&#24744;&#30340; Servlet &#25110; JSP &#38913;&#38754;&#20351;&#29992; Comet &#25216;&#34899;&#65292;&#35531;&#23559; <code>load-on-startup</code> &#20803;&#32032;&#22686;&#21152;&#21040;&#24744;&#30340; <code>web.xml</code> &#27284;&#26696;&#20013;&#65292;&#20197;&#30906;&#20445;&#35442;&#25216;&#34899;&#26044; GlassFish Server &#21855;&#21205;&#26178;&#24050;&#21021;&#22987;&#21270;&#12290;&#20363;&#22914;&#65072;</p>
<pre>
&lt;servlet&gt;
&lt;servlet-name&gt;CheckIn&lt;/servlet-name&gt;
&lt;servlet-class&gt;CheckInServlet&lt;/servlet-class&gt;
&lt;load-on-startup&gt;0&lt;/load-on-startup&gt;
&lt;/servlet&gt;
</pre></dd>
<dt>DNS &#26597;&#35426;</dt>
<dd>
<p>&#33509;&#36984;&#21462;&#27492;&#36984;&#38917;&#65292;&#21063;&#26371;&#21855;&#29992; DNS &#26597;&#35426;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</dd>
<dt>DNS &#26597;&#35426;</dt>
<dd>
<p>&#33509;&#36984;&#21462;&#27492;&#36984;&#38917;&#65292;&#21063;&#26371;&#21855;&#29992; DNS &#26597;&#35426;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</dd>
<dt>RCM &#25903;&#25588;</dt>
<dd>
<p>&#33509;&#36984;&#21462;&#27492;&#36984;&#38917;&#65292;&#21063;&#26371;&#21855;&#29992;&#36039;&#28304;&#32068;&#24907;&#31649;&#29702; (RCM)&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</dd>
<dt>&#36861;&#36452;</dt>
<dd>
<p>&#33509;&#36984;&#21462;&#27492;&#36984;&#38917;&#65292;&#21063;&#26371;&#21855;&#29992;&#36861;&#36452;&#20316;&#26989;&#12290;&#33509;&#20572;&#29992;&#27492;&#36984;&#38917;&#65292;GlassFish Server &#26371;&#36611;&#19981;&#26131;&#21463;&#21040;&#36328;&#32178;&#31449;&#25351;&#20196;&#30908;&#25915;&#25802;&#30340;&#24433;&#38911;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#21855;&#29992;&#12290;</p>
</dd>
<dt>&#35469;&#35657;&#20659;&#36865;</dt>
<dd>
<p>&#33509;&#36984;&#21462;&#27492;&#36984;&#38917;&#65292;&#20195;&#34920;&#20351;&#29992;&#27492;&#21332;&#23450;&#30340;&#32178;&#36335;&#30435;&#32893;&#22120;&#26371;&#24478;&#32066;&#27490; SSL &#30340;&#20195;&#29702;&#20282;&#26381;&#22120;&#25509;&#25910;&#27969;&#37327;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</dd>
<dt>&#21312;&#22602;</dt>
<dd>
<p>&#33509;&#36984;&#21462;&#27492;&#36984;&#38917;&#65292;&#26371;&#21855;&#29992; HTTP &#22238;&#25033;&#21312;&#22602;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#21855;&#29992;&#12290;</p>
</dd>
<dt>XPowered By</dt>
<dd>
<p>&#33509;&#36984;&#21462;&#27492;&#36984;&#38917;&#65292;&#26371;&#26681;&#25818; Java Servlet 3.0 &#21644; Java Server Pages 2.0 &#35215;&#26684;&#20351;&#29992; <code>X-Powered-By</code> &#27161;&#38957;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#21855;&#29992;&#12290;</p>
</dd>
<dt>&#32147;&#36942;&#32232;&#30908;&#30340;&#26012;&#32218;</dt>
<dd>
<p>&#33509;&#36984;&#21462;&#27492;&#36984;&#38917;&#65292;&#21487;&#20801;&#35377; URI &#21253;&#21547;&#32147;&#36942;&#32232;&#30908;&#30340;&#26012;&#32218;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</dd>
<dt>Websocket &#25903;&#25588;</dt>
<dd>
<p>&#33509;&#36984;&#21462;&#27492;&#36984;&#38917;&#65292;&#21063;&#25903;&#25588; WebSocket &#21332;&#23450;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</dd>
</dl>
<a id="sthref142" name="sthref142"></a>
<h5>&#30456;&#38364;&#20316;&#26989;</h5>
<ul>
<li>
<p><a href="task-protocolnew.html">&#24314;&#31435;&#21332;&#23450;</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">&#32232;&#36655;&#21332;&#23450;</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">&#32232;&#36655;&#21332;&#23450;&#30340; SSL &#35373;&#23450;</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">&#32232;&#36655;&#21332;&#23450;&#30340; HTTP &#35373;&#23450;</a></p>
</li>
<li>
<p><a href="task-protocolfilecacheedit.html">&#32232;&#36655;&#21332;&#23450;&#30340;&#27284;&#26696;&#24555;&#21462;&#35373;&#23450;</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">&#21034;&#38500;&#21332;&#23450;</a></p>
</li>
</ul>
<a id="sthref143" name="sthref143"></a>
<h5>&#30456;&#38364;&#30340; asadmin &#21629;&#20196;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00051"><code>create-protocol</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00195"><code>list-protocols</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00103"><code>delete-protocol</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
