<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-webcontainermanagerprops" name="task-webcontainermanagerprops"></a><a id="GHWEB00032" name="GHWEB00032"></a></p>

<h4><a id="sthref7" name="sthref7"></a><a id="sthref8" name="sthref8"></a><a id="sthref9" name="sthref9"></a>&#32068;&#24907; Web &#23481;&#22120;&#30340;&#31649;&#29702;&#31243;&#24335;&#29305;&#24615;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#38542;&#27573;&#20316;&#26989;&#31649;&#29702;&#21729;&#25552;&#20379;&#21508;&#24335;&#26041;&#27861;&#65292;&#20197;&#32068;&#24907;&#24314;&#31435;&#33287;&#37559;&#27584;&#38542;&#27573;&#20316;&#26989;&#30340;&#26041;&#24335;&#12289;&#38542;&#27573;&#20316;&#26989;&#29376;&#24907;&#30340;&#20786;&#23384;&#20301;&#32622;&#65292;&#20197;&#21450;&#21487;&#29992;&#30340;&#26368;&#22823;&#38542;&#27573;&#20316;&#26989;&#25976;&#12290;</p>
<ol>
<li>
<p>&#22312;&#28687;&#35261;&#27193;&#29376;&#32080;&#27083;&#20013;&#65292;&#23637;&#38283;&#12300;&#32068;&#24907;&#12301;&#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#24744;&#35201;&#35722;&#26356;&#30340;&#32068;&#24907;&#12290;</p>
</li>
<li>
<p>&#22312;&#32068;&#24907;&#30340;&#31680;&#40670;&#19979;&#65292;&#36984;&#21462;&#12300;Web &#23481;&#22120;&#12301;&#31680;&#40670;&#12290;</p>
<p>&#12300;&#19968;&#33324;&#29305;&#24615;&#12301;&#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#19968;&#33324;&#29305;&#24615;&#12301;&#38913;&#38754;&#19978;&#65292;&#25353;&#19968;&#19979;&#12300;&#31649;&#29702;&#21729;&#29305;&#24615;&#12301;&#27161;&#31844;&#12290;</p>
<p>&#12300;&#31649;&#29702;&#21729;&#29305;&#24615;&#12301;&#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#28165;&#38500;&#38291;&#38548;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#22312;&#21034;&#38500;&#23384;&#25918;&#21312;&#20839;&#38750;&#20351;&#29992;&#20013;&#30340;&#38542;&#27573;&#20316;&#26989;&#36039;&#26009;&#20043;&#21069;&#65292;&#38656;&#31561;&#24453;&#30340;&#31186;&#25976;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 60&#12290;</p>
<p>&#23559;&#27492;&#20540;&#35373;&#28858;&#20302;&#26044;&#38542;&#27573;&#20316;&#26989;&#36039;&#26009;&#35722;&#26356;&#30340;&#38971;&#29575;&#12290;&#20363;&#22914;&#65292;&#22312;&#32147;&#24120;&#23384;&#21462;&#30340;&#32178;&#31449;&#19978;&#65292;&#25033;&#23559;&#31526;&#21512;&#38917;&#30446;&#35336;&#25976;&#22120; Servlet &#30340;&#27492;&#20540;&#20760;&#21487;&#33021;&#35373;&#24471;&#36611;&#20302; (1 &#31186;)&#65307;&#21542;&#21063;&#24744;&#21487;&#33021;&#26371;&#22312;&#27599;&#27425;&#37325;&#26032;&#21855;&#21205;&#20282;&#26381;&#22120;&#26178;&#36986;&#22833;&#26368;&#24460;&#25976;&#20491;&#31526;&#21512;&#38917;&#30446;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#26368;&#22823;&#38542;&#27573;&#20316;&#26989;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#21487;&#20197;&#24555;&#21462;&#30340;&#26368;&#22823;&#38542;&#27573;&#20316;&#26989;&#25976;&#30446;&#12290;</p>
<p>&#20540; -1 &#34920;&#31034;&#38542;&#27573;&#20316;&#26989;&#25976;&#30446;&#27794;&#26377;&#38480;&#21046;&#12290;&#38928;&#35373;&#20540;&#28858; -1&#12290;</p>
<p>&#21040;&#36948;&#38480;&#21046;&#24460;&#65292;&#22039;&#35430;&#24314;&#31435;&#26032;&#30340;&#38542;&#27573;&#20316;&#26989;&#26371;&#23566;&#33268;&#19999;&#20986; <code>IllegalStateException</code>&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#38542;&#27573;&#20316;&#26989;&#27284;&#26696;&#21517;&#31281;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#26044;&#25033;&#29992;&#31243;&#24335;&#37325;&#26032;&#21855;&#21205;&#20043;&#38291;&#20445;&#30041;&#38542;&#27573;&#20316;&#26989;&#29376;&#24907;&#20043;&#30446;&#37636;&#30340;&#32085;&#23565;&#25110;&#30456;&#23565;&#36335;&#24465; (&#22914;&#26524;&#21487;&#33021;&#20445;&#30041;&#29376;&#24907;&#30340;&#35441;)&#12290;</p>
<p>&#33509;&#27794;&#26377;&#35373;&#23450;&#27492;&#36335;&#24465;&#65292;&#21063;&#19981;&#26371;&#20445;&#30041;&#38542;&#27573;&#20316;&#26989;&#29376;&#24907;&#12290;&#20381;&#38928;&#35373;&#65292;&#19981;&#26371;&#35373;&#23450;&#27492;&#36335;&#24465;&#12290;</p>
<p>&#30456;&#23565;&#36335;&#24465;&#26159;&#30456;&#23565;&#26044;&#27492; Web &#25033;&#29992;&#31243;&#24335;&#26283;&#23384;&#30446;&#37636;&#30340;&#36335;&#24465;&#12290;</p>
<p>&#21482;&#26377;&#22312;&#12300;&#25345;&#32396;&#24615;&#39006;&#22411;&#12301;&#28858; <code>memory</code> &#26178;&#65292;&#27492;&#35373;&#23450;&#25165;&#36969;&#29992;&#12290;&#33509;&#35201;&#35373;&#23450;&#12300;&#25345;&#32396;&#24615;&#39006;&#22411;&#12301;&#65292;&#35531;&#21443;&#38321;<a href="task-webcontaineravailability.html">&#32068;&#24907; Web &#23481;&#22120;&#30340;&#21487;&#29992;&#24615;&#35373;&#23450;</a>&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#20854;&#20182;&#29305;&#24615;&#12301;&#21312;&#27573;&#20013;&#65292;&#25351;&#23450;&#20854;&#20182;&#29305;&#24615;&#12290;</p>
<p>GlassFish Server &#26410;&#23450;&#32681;&#38542;&#27573;&#20316;&#26989;&#31649;&#29702;&#21729;&#30340;&#20219;&#20309;&#20854;&#20182;&#29305;&#24615;&#12290;</p>
<ul>
<li>
<p>&#33509;&#35201;&#22686;&#21152;&#29305;&#24615;&#65292;&#35531;&#25353;&#19968;&#19979;&#12300;&#22686;&#21152;&#29305;&#24615;&#12301;&#25353;&#37397;&#12290;&#22312;&#20986;&#29694;&#30340;&#31354;&#30333;&#21015;&#20013;&#65292;&#26044;&#12300;&#21517;&#31281;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#21517;&#31281;&#65292;&#28982;&#24460;&#22312;&#12300;&#20540;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#20540;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#20462;&#25913;&#29305;&#24615;&#65292;&#35531;&#32232;&#36655;&#29305;&#24615;&#30340;&#12300;&#20540;&#12301;&#27396;&#20301;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#21034;&#38500;&#29305;&#24615;&#65292;&#35531;&#36984;&#21462;&#24744;&#35201;&#21034;&#38500;&#20043;&#29305;&#24615;&#12300;&#21517;&#31281;&#12301;&#27396;&#20301;&#24038;&#20596;&#30340;&#26680;&#21462;&#26041;&#22602;&#65292;&#28982;&#24460;&#25353;&#19968;&#19979;&#12300;&#21034;&#38500;&#29305;&#24615;&#12301;&#25353;&#37397;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#25353;&#19968;&#19979;&#12300;&#20786;&#23384;&#12301;&#12290;</p>

<hr>
<p><b>&#25552;&#31034;:</b></p>
&#33509;&#35201;&#22238;&#21040;&#38928;&#35373;&#35373;&#23450;&#65292;&#35531;&#25353;&#19968;&#19979;&#12300;&#36617;&#20837;&#38928;&#35373;&#20540;&#12301;&#25353;&#37397;&#65292;&#28982;&#24460;&#25353;&#19968;&#19979;&#12300;&#20786;&#23384;&#12301;&#12290;<br />
<hr>

</li>
</ol>
<a id="sthref10" name="sthref10"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-webcontainergeneral.html">&#32068;&#24907; Web &#23481;&#22120;&#30340;&#19968;&#33324;&#29305;&#24615;</a></p>
</li>
<li>
<p><a href="task-webcontainersessiontimeout.html">&#32068;&#24907; Web &#23481;&#22120;&#30340;&#38542;&#27573;&#20316;&#26989;&#29305;&#24615;</a></p>
</li>
<li>
<p><a href="task-webcontainerstoreprops.html">&#32068;&#24907; Web &#23481;&#22120;&#30340;&#20786;&#23384;&#29305;&#24615;</a></p>
</li>
<li>
<p><a href="task-webcontaineravailability.html">&#32068;&#24907; Web &#23481;&#22120;&#30340;&#21487;&#29992;&#24615;&#35373;&#23450;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
