<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-accesslog" name="task-accesslog"></a><a id="GHWEB00035" name="GHWEB00035"></a></p>

<h4><a id="sthref20" name="sthref20"></a><a id="sthref21" name="sthref21"></a>&#32068;&#24907; HTTP &#26381;&#21209;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#28687;&#35261;&#27193;&#29376;&#32080;&#27083;&#20013;&#65292;&#23637;&#38283;&#12300;&#32068;&#24907;&#12301;&#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#24744;&#35201;&#35722;&#26356;&#30340;&#32068;&#24907;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#32068;&#24907;&#12301;&#31680;&#40670;&#19979;&#65292;&#36984;&#21462;&#12300;HTTP &#26381;&#21209;&#12301;&#31680;&#40670;&#12290;</p>
<p>&#12300;HTTP &#26381;&#21209;&#12301;&#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#21855;&#29992; SSO&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#21487;&#23559;&#27492;&#20282;&#26381;&#22120;&#19978;&#25152;&#26377;&#37341;&#23565;&#30456;&#21516;&#31684;&#22285;&#32068;&#24907;&#30340;&#34395;&#25836;&#20282;&#26381;&#22120;&#19978;&#30340;&#25152;&#26377; Web &#25033;&#29992;&#31243;&#24335;&#38928;&#35373;&#28858;&#21855;&#29992; Single Sign-On&#12290;</p>
<p>&#24744;&#21487;&#20197;&#37341;&#23565;&#20491;&#21029;&#30340;&#34395;&#25836;&#20282;&#26381;&#22120;&#32622;&#25563;&#27492;&#35373;&#23450;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#21855;&#29992;&#23384;&#21462;&#35352;&#37636;&#26085;&#35468;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#37341;&#23565;&#23578;&#26410;&#25351;&#23450;&#27492;&#29305;&#24615;&#30340;&#25152;&#26377;&#34395;&#25836;&#20282;&#26381;&#22120;&#23376;&#20803;&#32032;&#65292;&#21855;&#29992;&#23384;&#21462;&#35352;&#37636;&#26085;&#35468;&#21151;&#33021;&#12290;</p>
<p>&#22914;&#26524;&#21462;&#28040;&#36984;&#21462;&#12300;&#21855;&#29992;&#23384;&#21462;&#35352;&#37636;&#26085;&#35468;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#21063;&#26371;&#37341;&#23565;&#23578;&#26410;&#25351;&#23450;&#27492;&#29305;&#24615;&#30340;&#25152;&#26377;&#34395;&#25836;&#20282;&#26381;&#22120;&#23376;&#20803;&#32032;&#65292;&#20572;&#29992;&#23384;&#21462;&#35352;&#37636;&#26085;&#35468;&#21151;&#33021;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#21855;&#29992;&#24490;&#29872;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#20197;&#21855;&#29992;&#24490;&#29872;&#26085;&#35468;&#27284;&#12290;</p>
<p>&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#21855;&#29992;&#12290;</p>
</li>
<li>
<p>&#24478;&#12300;&#24490;&#29872;&#21407;&#21063;&#12301;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#12300;&#24490;&#29872;&#21407;&#21063;&#12301;&#12290;</p>
<p>&#21807;&#19968;&#21487;&#29992;&#30340;&#24490;&#29872;&#21407;&#21063;&#26159; <code>time</code>&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#24490;&#29872;&#38291;&#38548;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#23384;&#21462;&#26085;&#35468;&#30340;&#24490;&#29872;&#38291;&#38548;&#20998;&#37912;&#25976;&#12290;</p>
<p>&#20677;&#30070;&#24490;&#29872;&#21407;&#21063;&#28858; <code>time</code> &#26178;&#65292;&#27492;&#27396;&#20301;&#25165;&#26377;&#25928;&#12290;&#38928;&#35373;&#20540;&#28858; 1,440 &#20998;&#37912; (24 &#23567;&#26178;)&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#24490;&#29872;&#23383;&#23614;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#35201;&#22312;&#24490;&#29872;&#24460;&#22686;&#21152;&#33267;&#26085;&#35468;&#27284;&#21517;&#31281;&#32080;&#23614;&#30340;&#23383;&#20018;&#20540;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; <code>yyyy-MM-dd</code>&#12290;</p>
<p>&#35531;&#30906;&#20445;&#24490;&#29872;&#23383;&#23614;&#21253;&#21547;&#36275;&#22816;&#30340;&#20540;&#65292;&#20197;&#28858;&#27599;&#20491;&#26085;&#35468;&#24490;&#29872;&#24314;&#31435;&#21807;&#19968;&#30340;&#23383;&#23614;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#23384;&#21462;&#26085;&#35468;&#30340;&#24490;&#29872;&#38291;&#38548;&#27604;&#27599;&#22825;&#19968;&#27425;&#26356;&#38971;&#32321;&#65292;&#35531;&#23559;&#27599;&#26085;&#26178;&#38291;&#32013;&#20837;&#24490;&#29872;&#23383;&#23614;&#12290;</p>
<p>&#33509;&#35201;&#30906;&#20445;&#22312;&#27599;&#27425;&#32147;&#36942;&#24490;&#29872;&#38291;&#38548;&#26178;&#38291;&#24460;&#65292;&#21363;&#24490;&#29872;&#23384;&#21462;&#26085;&#35468;&#27284;&#65292;&#21063;&#38656;&#35201;&#26377;&#21807;&#19968;&#30340;&#23383;&#23614;&#12290;&#22914;&#26524;&#26032;&#30340;&#23384;&#21462;&#26085;&#35468;&#27284;&#20043;&#24490;&#29872;&#23383;&#23614;&#33287;&#29694;&#26377;&#23384;&#21462;&#26085;&#35468;&#27284;&#30340;&#24490;&#29872;&#23383;&#23614;&#30456;&#21516;&#65292;&#21063;&#19981;&#26371;&#24490;&#29872;&#27284;&#26696;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#26368;&#22823;&#27284;&#26696;&#35336;&#25976;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#35201;&#20445;&#30041;&#30340;&#24490;&#29872;&#23384;&#21462;&#26085;&#35468;&#27284;&#26368;&#22823;&#25976;&#30446;&#12290;</p>
<p>&#36000;&#20540;&#20195;&#34920;&#27284;&#26696;&#25976;&#27794;&#26377;&#38480;&#21046;&#12290;&#38928;&#35373;&#20540;&#28858; -1&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#32233;&#34909;&#21312;&#22823;&#23567;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#23384;&#21462;&#26085;&#35468;&#32233;&#34909;&#21312;&#30340;&#22823;&#23567; (&#20197;&#20301;&#20803;&#32068;&#28858;&#21934;&#20301;)&#12290;</p>
<p>&#22914;&#26524;&#20540;&#23567;&#26044;&#25110;&#31561;&#26044; 0&#65292;&#23559;&#26371;&#20572;&#29992;&#23384;&#21462;&#26085;&#35468;&#32233;&#34909;&#12290;&#38928;&#35373;&#20540;&#28858; 32768&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#23531;&#20837;&#38291;&#38548;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#23559;&#26085;&#35468;&#23531;&#20837;&#30913;&#30879;&#21069;&#31561;&#24453;&#30340;&#31186;&#25976;&#12290;</p>
<p>&#30070;&#32233;&#34909;&#21312;&#24050;&#28415;&#25110;&#38291;&#38548;&#36942;&#26399;&#26178;&#65292;&#23384;&#21462;&#26085;&#35468;&#26371;&#34987;&#23531;&#20837;&#12290;&#22914;&#26524;&#20540;&#23567;&#26044;&#25110;&#31561;&#26044; 0&#65292;&#21063;&#21363;&#20351;&#32233;&#34909;&#21312;&#26410;&#28415;&#65292;&#20063;&#26371;&#19968;&#30452;&#22519;&#34892;&#23531;&#20837;&#12290;&#36889;&#24847;&#21619;&#33879;&#27599;&#27425;&#23384;&#21462;&#20282;&#26381;&#22120;&#26178;&#65292;&#26371;&#23559;&#26085;&#35468;&#35338;&#24687;&#30452;&#25509;&#20786;&#23384;&#33267;&#27284;&#26696;&#20013;&#12290;&#38928;&#35373;&#20540;&#28858; 300&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#26684;&#24335;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#23383;&#20018;&#20540;&#20197;&#25351;&#23450;&#19979;&#21015;&#23384;&#21462;&#26085;&#35468;&#29305;&#24615;&#65306;</p>
<ul>
<li>
<p>&#35201;&#22312;&#23384;&#21462;&#26085;&#35468;&#20013;&#25847;&#21462;&#30340;&#36039;&#35338;</p>
</li>
<li>
<p>&#25847;&#21462;&#36039;&#35338;&#30340;&#38918;&#24207;</p>
</li>
</ul>
<p>&#38928;&#35373;&#20540;&#22914;&#19979;&#65306;</p>
<pre>
%client.name% %auth-user-name% %datetime% %request% %status% %response.length%
</pre>
<p>&#26684;&#24335;&#23383;&#20018;&#20013;&#21253;&#21547;&#19979;&#21015;&#21487;&#29992;&#20540;&#65306;</p>
<dl>
<dt><code>%attribute.</code><i>name</i><code>%</code></dt>
<dd>
<p>&#35352;&#37636;&#20855;&#26377;&#25351;&#23450; <i>name</i> &#30340;&#35531;&#27714;&#23660;&#24615;&#30340;&#20540; (&#36879;&#36942;&#21628;&#21483;&#20854; <code>toString</code> &#26041;&#27861;)</p>
</dd>
<dt><code>%auth-user-name%</code></dt>
<dd>
<p>&#25480;&#27402;&#20351;&#29992;&#32773;&#30340;&#21517;&#31281;</p>
</dd>
<dt><code>%client.name%</code></dt>
<dd>
<p>&#24478;&#23660;&#31471;&#20027;&#27231;&#21517;&#31281;</p>
</dd>
<dt><code>%client.dns%</code></dt>
<dd>
<p>&#24478;&#23660;&#31471; DNS</p>
</dd>
<dt><code>%cookie.</code><i>name</i><code>%</code></dt>
<dd>
<p>&#20855;&#26377;&#25351;&#23450; <i>name</i> &#30340;&#35531;&#27714; cookie &#30340;&#20540;</p>
</dd>
<dt><code>%cookie.value%</code></dt>
<dd>
<p>&#22312;&#35531;&#27714;&#20013;&#25214;&#21040;&#30340;&#31532;&#19968;&#20491; cookie &#30340;&#20540;</p>
</dd>
<dt><code>%datetime%</code></dt>
<dd>
<p>&#31995;&#32113;&#26085;&#26399;</p>
</dd>
<dt><code>%request%</code></dt>
<dd>
<p>&#23436;&#25972;&#30340; HTTP &#35531;&#27714;&#34892;</p>
</dd>
<dt><code>%status%</code></dt>
<dd>
<p>&#29376;&#24907;</p>
</dd>
<dt><code>%response.length%</code></dt>
<dd>
<p>&#22238;&#25033;&#20839;&#23481;&#38263;&#24230;</p>
</dd>
<dt><code>%header.referer%</code></dt>
<dd>
<p>&#25512;&#34214;&#32773;&#27161;&#38957;</p>
</dd>
<dt><code>%header.user-agent%</code></dt>
<dd>
<p>&#20351;&#29992;&#32773;&#20195;&#29702;&#31243;&#24335;&#27161;&#38957;</p>
</dd>
<dt><code>%http-method%</code></dt>
<dd>
<p>HTTP &#26041;&#27861;</p>
</dd>
<dt><code>%http-uri%</code></dt>
<dd>
<p>HTTP URI</p>
</dd>
<dt><code>%query-str%</code></dt>
<dd>
<p>HTTP &#26597;&#35426;&#23383;&#20018;</p>
</dd>
<dt><code>%http-version%</code></dt>
<dd>
<p>HTTP &#21332;&#23450;&#29256;&#26412;</p>
</dd>
<dt><code>%header.accept%</code></dt>
<dd>
<p>&#25509;&#21463;&#27161;&#38957;</p>
</dd>
<dt><code>%header.date%</code></dt>
<dd>
<p>&#26085;&#26399;&#27161;&#38957;</p>
</dd>
<dt><code>%header.if-mod-since%</code></dt>
<dd>
<p>&#20462;&#25913;&#26085;&#26399;&#27161;&#38957;</p>
</dd>
<dt><code>%header.auth%</code></dt>
<dd>
<p>&#25480;&#27402;&#27161;&#38957;</p>
</dd>
<dt><code>%header.</code><i>any</i><code>%</code></dt>
<dd>
<p>RFC 2616 &#20013;&#23450;&#32681;&#30340;&#20219;&#20309;&#26377;&#25928; HTTP &#27161;&#38957; (<code>any</code> &#20063;&#26159;&#26377;&#25928;&#30340;&#27161;&#38957;&#20540;&#65307;&#27492;&#34389;&#23559;&#20854;&#25351;&#23450;&#28858;&#35722;&#25976;)</p>
</dd>
<dt><code>%session.</code><i>name</i><code>%</code></dt>
<dd>
<p>&#20855;&#26377;&#21517;&#31281; <i>name</i> &#30340;&#38542;&#27573;&#20316;&#26989;&#23660;&#24615;&#20540;&#65292;&#25110;&#26159; <code>NULL-SESSION-ATTRIBUTE-</code>name (&#22914;&#26524;&#21629;&#21517;&#30340;&#23660;&#24615;&#19981;&#23384;&#22312;&#38542;&#27573;&#20316;&#26989;&#20013;)&#65292;&#21448;&#25110;&#26159; <code>NULL-SESSION</code> (&#22914;&#26524;&#27794;&#26377;&#38542;&#27573;&#20316;&#26989;&#23384;&#22312;)</p>
</dd>
<dt><code>%time-taken%</code></dt>
<dd>
<p>&#34389;&#29702;&#27599;&#20491;&#35531;&#27714;&#25152;&#33457;&#30340;&#26178;&#38291; (&#20197;&#27627;&#31186;&#28858;&#21934;&#20301;)</p>
</dd>
<dt><code>%vs.id%</code></dt>
<dd>
<p>&#34395;&#25836;&#20282;&#26381;&#22120;&#35672;&#21029;&#30908;</p>
</dd>
</dl>
</li>
<li>
<p>&#22312;&#12300;&#20854;&#20182;&#29305;&#24615;&#12301;&#21312;&#27573;&#20013;&#65292;&#25351;&#23450;&#20854;&#20182;&#29305;&#24615;&#12290;</p>
<p>&#22914;&#38656;&#21487;&#29992;&#29305;&#24615;&#30340;&#25551;&#36848;&#65292;&#35531;&#21443;&#38321;<a href="ref-httpserviceprops.html">HTTP &#26381;&#21209;&#29305;&#23450;&#30340;&#29305;&#24615;</a>&#12290;</p>
<ul>
<li>
<p>&#33509;&#35201;&#22686;&#21152;&#29305;&#24615;&#65292;&#35531;&#25353;&#19968;&#19979;&#12300;&#22686;&#21152;&#29305;&#24615;&#12301;&#25353;&#37397;&#12290;&#22312;&#20986;&#29694;&#30340;&#31354;&#30333;&#21015;&#20013;&#65292;&#26044;&#12300;&#21517;&#31281;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#21517;&#31281;&#65292;&#28982;&#24460;&#22312;&#12300;&#20540;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#20540;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#20462;&#25913;&#29305;&#24615;&#65292;&#35531;&#32232;&#36655;&#29305;&#24615;&#30340;&#12300;&#20540;&#12301;&#27396;&#20301;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#21034;&#38500;&#29305;&#24615;&#65292;&#35531;&#36984;&#21462;&#24744;&#35201;&#21034;&#38500;&#20043;&#29305;&#24615;&#12300;&#21517;&#31281;&#12301;&#27396;&#20301;&#24038;&#20596;&#30340;&#26680;&#21462;&#26041;&#22602;&#65292;&#28982;&#24460;&#25353;&#19968;&#19979;&#12300;&#21034;&#38500;&#29305;&#24615;&#12301;&#25353;&#37397;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#25353;&#19968;&#19979;&#12300;&#20786;&#23384;&#12301;&#12290;</p>

<hr>
<p><b>&#25552;&#31034;:</b></p>
&#33509;&#35201;&#22238;&#21040;&#38928;&#35373;&#35373;&#23450;&#65292;&#35531;&#25353;&#19968;&#19979;&#12300;&#36617;&#20837;&#38928;&#35373;&#20540;&#12301;&#25353;&#37397;&#65292;&#28982;&#24460;&#25353;&#19968;&#19979;&#12300;&#20786;&#23384;&#12301;&#12290;<br />
<hr>

</li>
</ol>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
