<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-virtualserveredit" name="task-virtualserveredit"></a></p>

<h4><a id="sthref36" name="sthref36"></a>&#32232;&#36655;&#34395;&#25836;&#20282;&#26381;&#22120;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#28687;&#35261;&#27193;&#29376;&#32080;&#27083;&#20013;&#65292;&#23637;&#38283;&#12300;&#32068;&#24907;&#12301;&#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#24744;&#35201;&#35722;&#26356;&#30340;&#32068;&#24907;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#32068;&#24907;&#12301;&#31680;&#40670;&#19979;&#65292;&#36984;&#21462;&#12300;&#34395;&#25836;&#20282;&#26381;&#22120;&#12301;&#31680;&#40670;&#12290;</p>
<p>&#12300;&#34395;&#25836;&#20282;&#26381;&#22120;&#12301;&#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#34395;&#25836;&#20282;&#26381;&#22120;&#12301;&#38913;&#38754;&#19978;&#65292;&#25353;&#19968;&#19979;&#24744;&#35201;&#32232;&#36655;&#30340;&#34395;&#25836;&#20282;&#26381;&#22120;&#21517;&#31281;&#12290;</p>
<p>&#12300;&#32232;&#36655;&#34395;&#25836;&#20282;&#26381;&#22120;&#12301;&#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#20027;&#27231;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#22519;&#34892;&#20282;&#26381;&#22120;&#30340;&#27231;&#22120;&#20027;&#27231;&#21517;&#31281;&#25110; IP &#20301;&#22336;&#12290;</p>
<p>&#20351;&#29992;&#24050;&#22312;&#32178;&#36335;&#20043; DNS &#20282;&#26381;&#22120;&#35387;&#20874; (&#23565;&#26044; UNIX &#31995;&#32113;&#65292;&#21063;&#26159;&#24050;&#22312; <code>/etc/hosts</code> &#27284;&#26696;&#20013;&#35387;&#20874;) &#30340;&#23526;&#38555;&#20027;&#27231;&#21517;&#31281;&#25110;&#34395;&#25836;&#20027;&#27231;&#21517;&#31281;&#12290;&#38928;&#35373;&#20540;&#28858;&#31995;&#32113;&#29305;&#24615;&#20540; <code>${com.sun.aas.hostName}</code>&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#34395;&#25836;&#20282;&#26381;&#22120;&#30340;&#12300;&#29376;&#24907;&#12301;&#36984;&#38917;&#12290;</p>
<p>&#20540;&#21487;&#33021;&#28858;&#19979;&#21015;&#20854;&#20013;&#20043;&#19968;&#65306;</p>
<dl>
<dt>&#38283;</dt>
<dd>
<p>&#34395;&#25836;&#20282;&#26381;&#22120;&#34389;&#26044;&#20351;&#29992;&#20013;&#29376;&#24907;&#12290;&#27492;&#28858;&#38928;&#35373;&#20540;&#12290;</p>
</dd>
<dt>&#38364;</dt>
<dd>
<p>&#34395;&#25836;&#20282;&#26381;&#22120;&#34389;&#26044;&#38750;&#20351;&#29992;&#20013;&#29376;&#24907;&#12290;&#33509;&#22039;&#35430;&#23384;&#21462;&#20282;&#26381;&#22120;&#21063;&#20659;&#22238;&#37679;&#35492;&#30908; 404 (&#36039;&#28304;&#28961;&#27861;&#20351;&#29992;)&#12290;</p>
</dd>
<dt>&#24050;&#20572;&#29992;</dt>
<dd>
<p>&#34395;&#25836;&#20282;&#26381;&#22120;&#24050;&#20572;&#29992;&#12290;&#33509;&#22039;&#35430;&#23384;&#21462;&#20282;&#26381;&#22120;&#21063;&#20659;&#22238;&#37679;&#35492;&#30908; 403 (&#25298;&#32085;&#22519;&#34892;&#35531;&#27714;)&#12290;</p>
</dd>
</dl>
</li>
<li>
<p>&#36984;&#21462;&#26032;&#34395;&#25836;&#20282;&#26381;&#22120;&#30340;&#12300;SSO&#12301;&#36984;&#38917;&#12290;</p>
<p>&#20381;&#38928;&#35373;&#65292;&#34395;&#25836;&#20282;&#26381;&#22120;&#26371;&#32380;&#25215; HTTP &#26381;&#21209;&#30340; Single Sign-On (SSO) &#35373;&#23450;&#12290;&#36984;&#21462;&#12300;&#24050;&#21855;&#29992;&#12301;&#25110;&#12300;&#24050;&#20572;&#29992;&#12301;&#65292;&#36879;&#36942;&#21855;&#29992;&#25110;&#20572;&#29992;&#27492;&#34395;&#25836;&#20282;&#26381;&#22120;&#30340; Single Sign-On &#20197;&#32622;&#25563; HTTP &#26381;&#21209;&#35373;&#23450;&#12290;</p>
<p>Servlet &#21644; JSP &#27284;&#26696;&#25903;&#25588;&#22312; GlassFish Server &#19978;&#36328;&#25033;&#29992;&#31243;&#24335;&#30340; Single Sign-On&#12290;&#27492;&#21151;&#33021;&#20801;&#35377;&#38656;&#35201;&#30456;&#21516;&#20351;&#29992;&#32773;&#30331;&#20837;&#36039;&#35338;&#30340;&#22810;&#20491;&#25033;&#29992;&#31243;&#24335;&#20849;&#29992;&#35442;&#36039;&#35338;&#65292;&#20351;&#29992;&#32773;&#19981;&#24517;&#22312;&#20351;&#29992;&#27599;&#20491;&#25033;&#29992;&#31243;&#24335;&#26178;&#20998;&#21029;&#36914;&#34892;&#30331;&#20837;&#12290;</p>
</li>
<li>
<p>&#24478;&#12300;&#32178;&#36335;&#30435;&#32893;&#22120;&#12301;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#36984;&#21462;&#19968;&#25110;&#22810;&#20491;&#32178;&#36335;&#30435;&#32893;&#22120;&#65292;&#25110;&#20445;&#25345;&#27396;&#20301;&#31354;&#30333;&#12290;</p>
</li>
<li>
<p>&#24478;&#12300;&#38928;&#35373; Web &#27169;&#32068;&#12301;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#36984;&#21462;&#27169;&#32068;&#65292;&#35442;&#27169;&#32068;&#23559;&#26371;&#22238;&#25033;&#25152;&#26377;&#28961;&#27861;&#23565;&#25033;&#33267;&#20854;&#20182; Web &#27169;&#32068; (&#24050;&#24314;&#32622;&#21040;&#34395;&#25836;&#20282;&#26381;&#22120;) &#30340;&#35531;&#27714;&#12290;</p>
<p>&#22914;&#26524;&#26410;&#25351;&#23450;&#38928;&#35373; Web &#27169;&#32068;&#65292;&#21063;&#20351;&#29992;&#20855;&#26377;&#31354;&#29872;&#22659;&#26681;&#30446;&#37636;&#30340; Web &#27169;&#32068;&#12290;&#22914;&#26524;&#27794;&#26377;&#29872;&#22659;&#26681;&#30446;&#37636;&#28858;&#31354;&#30340; Web &#27169;&#32068;&#65292;&#21063;&#26371;&#24314;&#31435;&#21644;&#20351;&#29992;&#31995;&#32113;&#38928;&#35373;&#30340; Web &#27169;&#32068;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#26085;&#35468;&#27284;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#23559;&#39023;&#31034;&#35442;&#34395;&#25836;&#20282;&#26381;&#22120;&#26085;&#35468;&#35338;&#24687;&#20043;&#27284;&#26696;&#30340;&#36335;&#24465;&#21517;&#31281;&#12290;</p>
<p>&#20381;&#38928;&#35373;&#65292;&#35352;&#37636;&#26085;&#35468;&#35338;&#24687;&#23559;&#26371;&#20659;&#36865;&#33267;&#38928;&#35373;&#20282;&#26381;&#22120;&#26085;&#35468; domain-dir<code>/logs/server.log</code>&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#25991;&#20214;&#26681;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#20282;&#26381;&#22120;&#26681;&#25991;&#20214;&#30446;&#37636;&#30340;&#32085;&#23565;&#36335;&#24465;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; domain-dir<code>/docroot</code>&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#23384;&#21462;&#35352;&#37636;&#26085;&#35468;&#12301;&#36984;&#38917;&#65292;&#21487;&#21855;&#29992;&#25110;&#20572;&#29992;&#23384;&#21462;&#35352;&#37636;&#26085;&#35468;&#12290;</p>
<p>&#20381;&#38928;&#35373;&#65292;&#34395;&#25836;&#20282;&#26381;&#22120;&#26371;&#32380;&#25215; HTTP &#26381;&#21209;&#30340;&#23384;&#21462;&#35352;&#37636;&#26085;&#35468;&#35373;&#23450;&#12290;&#36984;&#21462;&#12300;&#24050;&#21855;&#29992;&#12301;&#25110;&#12300;&#24050;&#20572;&#29992;&#12301;&#65292;&#36879;&#36942;&#21855;&#29992;&#25110;&#20572;&#29992;&#27492;&#34395;&#25836;&#20282;&#26381;&#22120;&#30340;&#23384;&#21462;&#35352;&#37636;&#26085;&#35468;&#65292;&#32622;&#25563; HTTP &#26381;&#21209;&#35373;&#23450;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#30446;&#37636;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#20282;&#26381;&#22120;&#23384;&#21462;&#26085;&#35468;&#30340;&#32085;&#23565;&#30446;&#37636;&#36335;&#24465;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; domain-dir<code>/logs/access</code>&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#20854;&#20182;&#29305;&#24615;&#12301;&#21312;&#27573;&#20013;&#65292;&#25351;&#23450;&#34395;&#25836;&#20282;&#26381;&#22120;&#30340;&#20854;&#20182;&#29305;&#24615;&#12290;</p>
<p>&#22914;&#38656;&#21487;&#29992;&#29305;&#24615;&#30340;&#30456;&#38364;&#36039;&#35338;&#65292;&#35531;&#21443;&#38321;<a href="ref-virtualserverprops.html">&#34395;&#25836;&#20282;&#26381;&#22120;&#29305;&#23450;&#30340;&#29305;&#24615;</a>&#12290;</p>
<ul>
<li>
<p>&#33509;&#35201;&#22686;&#21152;&#29305;&#24615;&#65292;&#35531;&#25353;&#19968;&#19979;&#12300;&#22686;&#21152;&#29305;&#24615;&#12301;&#25353;&#37397;&#12290;&#22312;&#20986;&#29694;&#30340;&#31354;&#30333;&#21015;&#20013;&#65292;&#26044;&#12300;&#21517;&#31281;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#21517;&#31281;&#65292;&#28982;&#24460;&#22312;&#12300;&#20540;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#20540;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#20462;&#25913;&#29305;&#24615;&#65292;&#35531;&#32232;&#36655;&#29305;&#24615;&#30340;&#12300;&#20540;&#12301;&#27396;&#20301;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#21034;&#38500;&#29305;&#24615;&#65292;&#35531;&#36984;&#21462;&#24744;&#35201;&#21034;&#38500;&#20043;&#29305;&#24615;&#12300;&#21517;&#31281;&#12301;&#27396;&#20301;&#24038;&#20596;&#30340;&#26680;&#21462;&#26041;&#22602;&#65292;&#28982;&#24460;&#25353;&#19968;&#19979;&#12300;&#21034;&#38500;&#29305;&#24615;&#12301;&#25353;&#37397;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#25353;&#19968;&#19979;&#12300;&#20786;&#23384;&#12301;&#12290;</p>

<hr>
<p><b>&#25552;&#31034;:</b></p>
&#33509;&#35201;&#22238;&#21040;&#38928;&#35373;&#35373;&#23450;&#65292;&#35531;&#25353;&#19968;&#19979;&#12300;&#36617;&#20837;&#38928;&#35373;&#20540;&#12301;&#25353;&#37397;&#65292;&#28982;&#24460;&#25353;&#19968;&#19979;&#12300;&#20786;&#23384;&#12301;&#12290;<br />
<hr>

</li>
</ol>
<a id="sthref37" name="sthref37"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-virtualservercreate.html">&#24314;&#31435;&#34395;&#25836;&#20282;&#26381;&#22120;</a></p>
</li>
<li>
<p><a href="task-virtualserverdelete.html">&#21034;&#38500;&#34395;&#25836;&#20282;&#26381;&#22120;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
