<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-networklistenernew" name="task-networklistenernew"></a></p>

<h4><a id="sthref40" name="sthref40"></a>&#24314;&#31435;&#32178;&#36335;&#30435;&#32893;&#31243;&#24335;</h4>
<a name="BEGIN" id="BEGIN"></a><a id="sthref41" name="sthref41"></a>
<h5>&#38283;&#22987;&#21069;</h5>
<p>&#30070;&#24744;&#24314;&#31435;&#32178;&#36335;&#30435;&#32893;&#22120;&#26178;&#65292;&#24744;&#21487;&#20197;&#21516;&#27493;&#24314;&#31435;&#20379;&#32178;&#36335;&#30435;&#32893;&#22120;&#20351;&#29992;&#30340;&#21332;&#23450;&#65292;&#25110;&#20351;&#29992;&#26368;&#21021;&#24314;&#31435;&#30340;&#21332;&#23450;&#12290;&#32178;&#36335;&#30435;&#32893;&#22120;&#21450;&#20854;&#30456;&#38364;&#32879;&#30340;&#21332;&#23450;&#38291;&#36890;&#24120;&#23384;&#22312;&#19968;&#23565;&#19968;&#30340;&#38364;&#20418;&#65292;&#20294;&#20006;&#19981;&#26159;&#24517;&#38920;&#30340;&#12290;</p>
<ol>
<li>
<p>&#22312;&#28687;&#35261;&#27193;&#29376;&#32080;&#27083;&#20013;&#65292;&#23637;&#38283;&#12300;&#32068;&#24907;&#12301;&#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#32068;&#24907;&#12301;&#31680;&#40670;&#19979;&#65292;&#23637;&#38283;&#12300;&#32178;&#36335;&#32068;&#24907;&#12301;&#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#32178;&#36335;&#32068;&#24907;&#12301;&#31680;&#40670;&#19979;&#65292;&#36984;&#21462;&#12300;&#32178;&#36335;&#30435;&#32893;&#22120;&#12301;&#31680;&#40670;&#12290;</p>
<p>&#12300;&#32178;&#36335;&#30435;&#32893;&#22120;&#12301;&#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#32178;&#36335;&#30435;&#32893;&#22120;&#12301;&#38913;&#38754;&#19978;&#65292;&#25353;&#19968;&#19979;&#12300;&#26032;&#24314;&#12301;&#12290;</p>
<p>&#12300;&#26032;&#24314;&#32178;&#36335;&#30435;&#32893;&#22120;&#12301;&#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#21517;&#31281;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#32178;&#36335;&#30435;&#32893;&#22120;&#30340;&#21517;&#31281;&#12290;</p>
<p>&#32178;&#36335;&#30435;&#32893;&#22120;&#21517;&#31281;&#19981;&#33021;&#20197;&#25976;&#23383;&#28858;&#38283;&#38957;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#21332;&#23450;&#12301;&#27396;&#20301;&#20013;&#65292;&#25351;&#23450;&#35201;&#33287;&#32178;&#36335;&#30435;&#32893;&#22120;&#38364;&#32879;&#30340;&#21332;&#23450;&#12290;</p>
<ul>
<li>
<p>&#36984;&#21462;&#12300;&#24314;&#31435;&#26032;&#30340;&#21332;&#23450;&#12301;&#65292;&#20197;&#38928;&#35373;&#35373;&#23450;&#24314;&#31435;&#26032;&#30340;&#21332;&#23450;&#12290;&#27492;&#22806;&#65292;&#24478;&#12300;&#34395;&#25836;&#20282;&#26381;&#22120;&#12301;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#35201;&#33287;&#27492;&#21332;&#23450;&#38364;&#32879;&#30340;&#34395;&#25836;&#20282;&#26381;&#22120;&#12290;</p>
<p>&#21332;&#23450;&#30340;&#38928;&#35373;&#21517;&#31281;&#28858;&#32178;&#36335;&#30435;&#32893;&#22120;&#21517;&#31281;&#21152;&#19978; <code>-protocol</code>&#65292;&#20294;&#24744;&#21487;&#20197;&#32232;&#36655;&#27492;&#20540;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#20351;&#29992;&#29694;&#26377;&#21332;&#23450;&#12301;&#65292;&#28982;&#24460;&#24478;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#36984;&#21462;&#21332;&#23450;&#12290;&#33509;&#35201;&#21855;&#29992;&#32178;&#36335;&#30435;&#32893;&#22120;&#30340;&#23433;&#20840;&#24615;&#65292;&#35531;&#36984;&#25799;&#24050;&#21855;&#29992;&#23433;&#20840;&#24615;&#30340;&#21332;&#23450;&#12290;</p>
<p>&#22914;&#26524;&#24744;&#36984;&#21462;&#20102;&#27492;&#36984;&#38917;&#65292;&#36890;&#24120;&#26371;&#38928;&#20808;&#28858;&#27492;&#30435;&#32893;&#22120;&#24314;&#31435;&#21332;&#23450;&#12290;</p>
</li>
</ul>
<p>&#24744;&#20677;&#33021;&#22312;&#24314;&#31435;&#32178;&#36335;&#30435;&#32893;&#22120;&#26178;&#25351;&#23450;&#21332;&#23450;&#12290;&#20043;&#24460;&#24744;&#23559;&#28961;&#27861;&#35722;&#26356;&#38364;&#32879;&#30340;&#21332;&#23450;&#12290;&#21332;&#23450;&#26371;&#27770;&#23450;&#26159;&#21542;&#28858;&#32178;&#36335;&#30435;&#32893;&#22120;&#21855;&#29992;&#23433;&#20840;&#24615;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#29376;&#24907;&#12301;&#30340;&#12300;&#24050;&#21855;&#29992;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#20197;&#21855;&#29992;&#32178;&#36335;&#30435;&#32893;&#22120;&#12290;</p>
<p>&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#21855;&#29992;&#12290;&#22914;&#26524;&#20572;&#29992;&#30435;&#32893;&#22120;&#65292;&#22039;&#35430;&#36899;&#32218;&#33267;&#30435;&#32893;&#22120;&#26178;&#30342;&#26371;&#30332;&#29983;&#36890;&#35338;&#31471;&#30064;&#24120; (<code>java.net.ConnectException</code>)&#12290;</p>
<p>&#22312; GlassFish Server 9.1 &#20043;&#21069;&#30340;&#29256;&#26412;&#20013;&#65292;&#33509;&#23559;&#30435;&#32893;&#22120;&#24050;&#21855;&#29992;&#30340;&#23660;&#24615;&#35373;&#28858; False&#65292;&#30435;&#32893;&#22120;&#26371;&#37341;&#23565;&#20219;&#20309;&#20659;&#36865;&#32102;&#23427;&#30340;&#35531;&#27714;&#20659;&#22238; 404 &#22238;&#25033;&#30908;&#12290;&#33509;&#35201;&#22312;&#30446;&#21069;&#30340; GlassFish Server &#29256;&#26412;&#20013;&#23526;&#29694;&#27492;&#36939;&#20316;&#26041;&#24335;&#65292;&#35531;&#23559;&#30435;&#32893;&#22120;&#30340;&#29376;&#24907;&#35373;&#28858;&#24050;&#21855;&#29992;&#65292;&#20006;&#23559;&#27599;&#20491;&#38364;&#32879;&#30340;&#34395;&#25836;&#20282;&#26381;&#22120;&#29376;&#24907;&#35373;&#28858;&#38364;&#38281;&#12290;&#34395;&#25836;&#20282;&#26381;&#22120;&#26371;&#22312;&#20854;&#12300;&#32178;&#36335;&#30435;&#32893;&#22120;&#12301;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#21015;&#20986;&#20854;&#38364;&#32879;&#30340;&#30435;&#32893;&#22120;&#12290;</p>
</li>
<li>
<p>&#21807;&#35712;&#30340;&#12300;&#21855;&#29992;&#23433;&#20840;&#24615;&#12301;&#26680;&#21462;&#26041;&#22602;&#26371;&#25351;&#31034;&#26159;&#21542;&#24050;&#28858;&#32178;&#36335;&#30435;&#32893;&#22120;&#20351;&#29992;&#30340;&#21332;&#23450;&#21855;&#29992;&#23433;&#20840;&#24615;&#12290;</p>
<p>&#22914;&#26524;&#24744;&#27491;&#22312;&#32068;&#24907;&#20351;&#29992; <code>server-config</code> &#32068;&#24907;&#30340;&#32178;&#22495;&#31649;&#29702;&#20282;&#26381;&#22120; (DAS) <code>admin-listener</code>&#65292;&#27492;&#36984;&#38917;&#26371;&#26159;&#21807;&#35712;&#30340;&#12290;&#22914;&#26524;&#35201;&#28858;&#27492;&#30435;&#32893;&#22120;&#21855;&#29992;&#23433;&#20840;&#24615;&#65292;&#24744;&#24517;&#38920;&#21855;&#29992;&#23433;&#20840;&#31649;&#29702;&#12290;&#35531;&#21443;&#38321; <a href="../../../common/en/help/ref-securityadmin.html">Secure Administration</a>&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;JK &#30435;&#32893;&#22120;&#12301;&#30340;&#12300;&#24050;&#21855;&#29992;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#25351;&#23450;&#30435;&#32893;&#22120;&#25903;&#25588; Apache &#30340; <code>mod-jk</code> &#21332;&#23450;&#12290;</p>
<p><code>mod-jk</code> &#21332;&#23450;&#26159; Apache &#30340; <code>httpd</code> (Web &#20282;&#26381;&#22120;) &#21644; GlassFish Server &#24460;&#31471;&#22519;&#34892;&#34389;&#29702;&#20043;&#38291;&#30340;&#23560;&#29992;&#36890;&#35338;/&#32178;&#36335;&#21332;&#23450;&#12290;&#22914;&#26524;&#30435;&#32893;&#22120;&#25903;&#25588;&#27492;&#21332;&#23450;&#65292;<code>httpd</code> &#25033;&#26371;&#34389;&#29702;&#25152;&#26377;&#38748;&#24907;&#20839;&#23481;&#65292;&#32780;&#20219;&#20309;&#23565;&#21205;&#24907;&#36039;&#28304; (&#20134;&#21363; Servlet &#21644; JSP) &#30340;&#35531;&#27714;&#37117;&#26371;&#20351;&#29992; <code>mod-jk</code> &#21332;&#23450;&#36335;&#30001;&#33267; GlassFish Server &#24050;&#21855;&#29992; <code>mod-jk</code> &#30340;&#32178;&#36335;&#30435;&#32893;&#22120;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#36899;&#25509;&#22496;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#32178;&#36335;&#30435;&#32893;&#22120;&#23559;&#30435;&#32893;&#30340;&#36899;&#25509;&#22496;&#34399;&#30908;&#12290;</p>
<p>&#21512;&#27861;&#20540;&#28858; 1 - 65535&#12290;&#22312; UNIX &#31995;&#32113;&#19978;&#65292;&#24314;&#31435;&#30435;&#32893;&#36899;&#25509;&#22496; 1 - 1024 &#30340;&#36890;&#35338;&#31471;&#38656;&#35201;&#36229;&#32026;&#20351;&#29992;&#32773;&#27402;&#38480;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#20301;&#22336;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#32178;&#36335;&#30435;&#32893;&#22120;&#23559;&#30435;&#32893;&#30340; IP &#20301;&#22336;&#12290;</p>
<p>&#27492;&#20301;&#22336;&#21487;&#20197;&#29992;&#12300;&#40670;&#23565;&#12301;&#25110; IPv6 &#34920;&#31034;&#27861;&#12290;&#23427;&#21487;&#20197;&#34920;&#31034;&#28858; <code>any</code> (&#29992;&#26044; <code>INADDR_ANY</code>) &#20197;&#30435;&#32893;&#25152;&#26377; IP &#20301;&#22336;&#12290;&#23427;&#21487;&#20197;&#26159;&#20027;&#27231;&#21517;&#31281;&#12290;</p>
</li>
<li>
<p>&#24478;&#12300;&#32363;&#32218;&#38598;&#21312;&#12301;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#35201;&#33287;&#32178;&#36335;&#30435;&#32893;&#22120;&#38364;&#32879;&#30340;&#32363;&#32218;&#38598;&#21312;&#12290;</p>
<p>&#19968;&#33324;&#32780;&#35328;&#65292;&#24744;&#38656;&#35201;&#22312;&#23433;&#35037; GlassFish Server &#26178;&#25152;&#32068;&#24907;&#30340;&#20841;&#20491;&#32363;&#32218;&#38598;&#21312;&#20013;&#36984;&#25799;&#20854;&#19968;&#12290;</p>
</li>
<li>
<p>&#24478;&#12300;&#20659;&#36664;&#12301;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#32178;&#36335;&#30435;&#32893;&#22120;&#25152;&#35201;&#20351;&#29992;&#30340;&#20659;&#36664;&#39006;&#22411;&#12290;</p>
<p>&#20381;&#38928;&#35373;&#65292;&#21807;&#19968;&#30340;&#36984;&#25799;&#26159; <code>tcp</code>&#12290;</p>
</li>
<li>
<p>&#25353;&#19968;&#19979;&#12300;&#30906;&#23450;&#12301;&#12290;</p>
</li>
</ol>
<a id="sthref42" name="sthref42"></a>
<h5>&#25509;&#19979;&#20358;&#30340;&#27493;&#39519;</h5>
<p>&#22914;&#26524;&#24744;&#37341;&#23565;&#32178;&#36335;&#30435;&#32893;&#22120;&#20351;&#29992;&#30340;&#21332;&#23450;&#21855;&#29992;&#20102;&#23433;&#20840;&#24615;&#65292;&#20415;&#21487;&#20197;&#20351;&#29992;&#12300;SSL&#12301;&#27161;&#31844;&#20358;&#32232;&#36655;&#21332;&#23450;&#30340; SSL &#35373;&#23450;&#12290;</p>
<a id="sthref43" name="sthref43"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-networklisteneredit.html">&#32232;&#36655;&#32178;&#36335;&#30435;&#32893;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-networklistenerdelete.html">&#21034;&#38500;&#32178;&#36335;&#30435;&#32893;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-protocolnew.html">&#24314;&#31435;&#21332;&#23450;</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">&#32232;&#36655;&#21332;&#23450;</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">&#32232;&#36655;&#21332;&#23450;&#30340; SSL &#35373;&#23450;</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">&#32232;&#36655;&#21332;&#23450;&#30340; HTTP &#35373;&#23450;</a></p>
</li>
<li>
<p><a href="task-protocolfilecacheedit.html">&#32232;&#36655;&#21332;&#23450;&#30340;&#27284;&#26696;&#24555;&#21462;&#35373;&#23450;</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">&#21034;&#38500;&#21332;&#23450;</a></p>
</li>
<li>
<p><a href="task-transportnew.html">&#24314;&#31435;&#20659;&#36664;</a></p>
</li>
<li>
<p><a href="task-transportedit.html">&#32232;&#36655;&#20659;&#36664;</a></p>
</li>
<li>
<p><a href="task-transportdelete.html">&#21034;&#38500;&#20659;&#36664;</a></p>
</li>
<li>
<p><a href="task-virtualservercreate.html">&#24314;&#31435;&#34395;&#25836;&#20282;&#26381;&#22120;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
