<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-webcontaineravailability" name="task-webcontaineravailability"></a></p>

<h4><a id="sthref16" name="sthref16"></a><a id="sthref17" name="sthref17"></a><a id="sthref18" name="sthref18"></a><a id="sthref19" name="sthref19"></a>&#32068;&#24907; Web &#23481;&#22120;&#30340;&#21487;&#29992;&#24615;&#35373;&#23450;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#28687;&#35261;&#27193;&#29376;&#32080;&#27083;&#20013;&#65292;&#23637;&#38283;&#12300;&#32068;&#24907;&#12301;&#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#24744;&#35201;&#35722;&#26356;&#30340;&#32068;&#24907;&#12290;</p>
</li>
<li>
<p>&#22312;&#32068;&#24907;&#30340;&#31680;&#40670;&#19979;&#65292;&#36984;&#21462;&#12300;&#21487;&#29992;&#24615;&#26381;&#21209;&#12301;&#31680;&#40670;&#12290;</p>
<p>&#27492;&#26178;&#23559;&#38283;&#21855;&#12300;&#21487;&#29992;&#24615;&#26381;&#21209;&#12301;&#38913;&#38754;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#21487;&#29992;&#24615;&#26381;&#21209;&#12301;&#38913;&#38754;&#19978;&#65292;&#25353;&#19968;&#19979;&#12300;Web &#23481;&#22120;&#21487;&#29992;&#24615;&#12301;&#27161;&#31844;&#12290;</p>
<p>&#12300;Web &#23481;&#22120;&#21487;&#29992;&#24615;&#12301;&#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#21487;&#29992;&#24615;&#26381;&#21209;&#12301;&#27396;&#20301;&#20013;&#65292;&#21246;&#36984;&#12300;&#24050;&#21855;&#29992;&#12301;&#26041;&#22602;&#20197;&#21855;&#29992; Web &#23481;&#22120;&#30340;&#21487;&#29992;&#24615;&#12290;</p>
<p>&#33509;&#35201;&#20572;&#29992;&#21487;&#29992;&#24615;&#65292;&#35531;&#21462;&#28040;&#21246;&#36984;&#12300;&#21487;&#29992;&#24615;&#26381;&#21209;&#12301;&#30340;&#12300;&#24050;&#21855;&#29992;&#12301;&#26041;&#22602;&#12290;</p>
</li>
<li>
<p>&#24478;&#12300;&#25345;&#32396;&#24615;&#39006;&#22411;&#12301;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#36984;&#21462;&#25345;&#32396;&#24615;&#27231;&#21046;&#12290;</p>
<ul>
<li>
<p>&#22914;&#26524;<i>&#26410;</i>&#21246;&#36984;&#12300;&#21487;&#29992;&#24615;&#26381;&#21209;&#12301;&#30340;&#12300;&#24050;&#21855;&#29992;&#12301;&#26041;&#22602;&#65292;&#35531;&#36984;&#21462;&#19979;&#21015;&#20854;&#20013;&#19968;&#38917;&#65306;</p>
<ul>
<li>
<p><code>memory</code>&#65292;&#29992;&#26044;&#27794;&#26377;&#38542;&#27573;&#20316;&#26989;&#25345;&#32396;&#24615;&#30340;&#24773;&#27841;</p>
</li>
<li>
<p><code>file</code>&#65292;&#29992;&#26044;&#26681;&#25818;&#38750;&#39640;&#21487;&#29992;&#24615;&#27284;&#26696;&#31995;&#32113;&#30340;&#38542;&#27573;&#20316;&#26989;&#25345;&#32396;&#24615;</p>
</li>
</ul>
</li>
<li>
<p>&#33509;&#21246;&#36984;&#12300;&#21487;&#29992;&#24615;&#26381;&#21209;&#12301;&#30340;&#12300;&#24050;&#21855;&#29992;&#12301;&#26041;&#22602;&#65292;&#35531;&#36984;&#21462; <code>replicated</code>&#65292;&#29992;&#26044;&#26681;&#25818;&#39640;&#21487;&#29992;&#24615;&#21474;&#38598;&#23481;&#37679;&#31227;&#36681;&#30340;&#38542;&#27573;&#20316;&#26989;&#25345;&#32396;&#24615;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#24478;&#12300;&#25345;&#32396;&#24615;&#38971;&#29575;&#12301;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#36984;&#21462;&#20786;&#23384; HTTP &#38542;&#27573;&#20316;&#26989;&#30340;&#38971;&#29575;&#12290;</p>
<ul>
<li>
<p><code>web-method</code> &mdash; &#22312;&#27599;&#20491; Web &#35531;&#27714;&#32080;&#26463;&#19988;&#23559;&#22238;&#25033;&#20659;&#36865;&#22238;&#24478;&#23660;&#31471;&#20043;&#21069;&#65292;&#20786;&#23384;&#38542;&#27573;&#20316;&#26989;&#29376;&#24907;&#12290;&#27492;&#27169;&#24335;&#28858;&#30332;&#29983;&#25925;&#38556;&#26178;&#23436;&#20840;&#26356;&#26032;&#38542;&#27573;&#20316;&#26989;&#29376;&#24907;&#25552;&#20379;&#20102;&#26368;&#22909;&#30340;&#20445;&#35657;&#12290;&#27492;&#28858;&#38928;&#35373;&#20540;&#12290;</p>
</li>
</ul>
<p>&#21482;&#26377;&#22312;&#12300;&#25345;&#32396;&#24615;&#39006;&#22411;&#12301;&#28858; <code>replicated</code> &#26178;&#65292;&#12300;&#25345;&#32396;&#24615;&#38971;&#29575;&#12301;&#25165;&#36969;&#29992;&#12290;</p>
</li>
<li>
<p>&#24478;&#12300;&#25345;&#32396;&#24615;&#31684;&#22285;&#12301;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#35201;&#36914;&#34892;&#20786;&#23384;&#25152;&#38656;&#30340; HTTP &#38542;&#27573;&#20316;&#26989;&#35722;&#26356;&#31684;&#22285;&#12290;</p>
<ul>
<li>
<p><code>session</code> &mdash; &#27599;&#27425;&#37117;&#20786;&#23384;&#25972;&#20491;&#38542;&#27573;&#20316;&#26989;&#29376;&#24907;&#12290;&#27492;&#27169;&#24335;&#28858;&#27491;&#30906;&#20786;&#23384;&#20219;&#20309;&#21487;&#20998;&#25955; Web &#25033;&#29992;&#31243;&#24335;&#30340;&#38542;&#27573;&#20316;&#26989;&#36039;&#26009;&#25552;&#20379;&#20102;&#26368;&#22909;&#30340;&#20445;&#35657;&#12290;</p>
</li>
<li>
<p><code>modified-session</code> &mdash; &#22914;&#26524;&#38542;&#27573;&#20316;&#26989;&#29376;&#24907;&#24050;&#20462;&#25913;&#65292;&#21063;&#20786;&#23384;&#25972;&#20491;&#38542;&#27573;&#20316;&#26989;&#29376;&#24907;&#12290;&#22914;&#26524;&#21628;&#21483;&#20102; <code>HttpSession.setAttribute()</code> &#25110; <code>HttpSession.removeAttribute()</code>&#65292;&#21063;&#31995;&#32113;&#23559;&#35469;&#28858;&#38542;&#27573;&#20316;&#26989;&#24050;&#36973;&#20462;&#25913;&#12290;&#24517;&#38920;&#20445;&#35657;&#27599;&#27425;&#35722;&#26356;&#23660;&#24615;&#26178;&#37117;&#21628;&#21483; <code>setAttribute()</code>&#12290;&#36889;&#19981;&#26159; Java EE &#35215;&#26684;&#30340;&#38656;&#27714;&#65292;&#20294;&#26159;&#27492;&#27169;&#24335;&#38656;&#35201;&#36889;&#27171;&#20570;&#25165;&#33021;&#27491;&#24120;&#24037;&#20316;&#12290;</p>
</li>
<li>
<p><code>modified-attribute</code> &mdash; &#20677;&#20786;&#23384;&#20462;&#25913;&#30340;&#38542;&#27573;&#20316;&#26989;&#23660;&#24615;&#12290;&#33509;&#35201;&#20351;&#27492;&#27169;&#24335;&#27491;&#24120;&#36939;&#20316;&#65292;&#24744;&#24517;&#38920;&#36981;&#24490;&#20197;&#19979;&#20351;&#29992;&#28310;&#21063;&#65306;</p>
<ul>
<li>
<p>&#27599;&#27425;&#20462;&#25913;&#38542;&#27573;&#20316;&#26989;&#29376;&#24907;&#26178;&#22343;&#21628;&#21483; <code>setAttribute()</code>&#12290;</p>
</li>
<li>
<p>&#30906;&#23450;&#21508;&#23660;&#24615;&#20043;&#38291;&#27794;&#26377;&#20132;&#21449;&#21443;&#29031;&#12290;&#31995;&#32113;&#23559;&#23565;&#27599;&#20491;&#19981;&#21516;&#23660;&#24615;&#38364;&#37749;&#23383;&#19979;&#30340;&#29289;&#20214;&#22294;&#24418;&#21934;&#29544;&#36914;&#34892;&#20018;&#21015;&#21270;&#20006;&#21934;&#29544;&#20786;&#23384;&#12290;&#22914;&#26524;&#27599;&#20491;&#21934;&#29544;&#30340;&#38364;&#37749;&#23383;&#19979;&#30340;&#29289;&#20214;&#20043;&#38291;&#23384;&#22312;&#29289;&#20214;&#20132;&#21449;&#21443;&#29031;&#65292;&#21063;&#23427;&#20497;&#23559;&#19981;&#26371;&#36914;&#34892;&#27491;&#30906;&#20018;&#21015;&#21270;&#21644;&#21453;&#20018;&#21015;&#21270;&#12290;</p>
</li>
<li>
<p>&#22312;&#22810;&#20491;&#23660;&#24615;&#20043;&#38291;&#20998;&#24067;&#38542;&#27573;&#20316;&#26989;&#29376;&#24907;&#65292;&#25110;&#32773;&#33267;&#23569;&#22312;&#21807;&#35712;&#23660;&#24615;&#21644;&#21487;&#20462;&#25913;&#23660;&#24615;&#20043;&#38291;&#20998;&#24067;&#38542;&#27573;&#20316;&#26989;&#29376;&#24907;&#12290;</p>
</li>
</ul>
</li>
</ul>
<p>&#21482;&#26377;&#22312;&#12300;&#25345;&#32396;&#24615;&#39006;&#22411;&#12301;&#28858; <code>replicated</code> &#26178;&#65292;&#12300;&#25345;&#32396;&#24615;&#31684;&#22285;&#12301;&#25165;&#36969;&#29992;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300; Single Sign-On &#29376;&#24907;&#12301;&#27396;&#20301;&#20013;&#65292;&#21246;&#36984;&#12300;&#24050;&#21855;&#29992;&#12301;&#26041;&#22602;&#65292;&#35731; Single Sign-On &#29376;&#24907;&#21487;&#29992;&#26044;&#23481;&#37679;&#31227;&#36681;&#12290;</p>
<p>&#33509;&#35201;&#35731; Single Sign-On &#29376;&#24907;&#19981;&#21487;&#29992;&#26044;&#23481;&#37679;&#31227;&#36681;&#65292;&#35531;&#31227;&#38500;&#12300;&#21855;&#29992; Single Sign-On &#29376;&#24907;&#12301;&#26041;&#22602;&#20013;&#30340;&#21246;&#36984;&#35352;&#34399;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#24489;&#21407;&#25152;&#26377;&#35373;&#23450;&#30340;&#38928;&#35373;&#20540;&#65292;&#35531;&#25353;&#19968;&#19979;&#12300;&#36617;&#20837;&#38928;&#35373;&#20540;&#12301;&#25353;&#37397;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#20854;&#20182;&#29305;&#24615;&#12301;&#21312;&#27573;&#20013;&#65292;&#25351;&#23450;&#20854;&#20182;&#29305;&#24615;&#12290;</p>
<p>GlassFish Server &#26410;&#23450;&#32681; Web &#23481;&#22120;&#21487;&#29992;&#24615;&#30340;&#20219;&#20309;&#20854;&#20182;&#29305;&#24615;&#12290;</p>
<ul>
<li>
<p>&#33509;&#35201;&#22686;&#21152;&#29305;&#24615;&#65292;&#35531;&#25353;&#19968;&#19979;&#12300;&#22686;&#21152;&#29305;&#24615;&#12301;&#25353;&#37397;&#12290;&#22312;&#20986;&#29694;&#30340;&#31354;&#30333;&#21015;&#20013;&#65292;&#26044;&#12300;&#21517;&#31281;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#21517;&#31281;&#65292;&#28982;&#24460;&#22312;&#12300;&#20540;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#20540;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#20462;&#25913;&#29305;&#24615;&#65292;&#35531;&#32232;&#36655;&#29305;&#24615;&#30340;&#12300;&#20540;&#12301;&#27396;&#20301;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#21034;&#38500;&#29305;&#24615;&#65292;&#35531;&#36984;&#21462;&#24744;&#35201;&#21034;&#38500;&#20043;&#29305;&#24615;&#12300;&#21517;&#31281;&#12301;&#27396;&#20301;&#24038;&#20596;&#30340;&#26680;&#21462;&#26041;&#22602;&#65292;&#28982;&#24460;&#25353;&#19968;&#19979;&#12300;&#21034;&#38500;&#29305;&#24615;&#12301;&#25353;&#37397;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#25353;&#19968;&#19979;&#12300;&#20786;&#23384;&#12301;&#12290;</p>
</li>
</ol>
<a id="sthref20" name="sthref20"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-webcontainergeneral.html">&#32068;&#24907; Web &#23481;&#22120;&#30340;&#19968;&#33324;&#29305;&#24615;</a></p>
</li>
<li>
<p><a href="task-webcontainersessiontimeout.html">&#32068;&#24907; Web &#23481;&#22120;&#30340;&#38542;&#27573;&#20316;&#26989;&#29305;&#24615;</a></p>
</li>
<li>
<p><a href="task-webcontainermanagerprops.html">&#32068;&#24907; Web &#23481;&#22120;&#30340;&#31649;&#29702;&#31243;&#24335;&#29305;&#24615;</a></p>
</li>
<li>
<p><a href="task-webcontainerstoreprops.html">&#32068;&#24907; Web &#23481;&#22120;&#30340;&#20786;&#23384;&#29305;&#24615;</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
