<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-transportedit" name="ref-transportedit"></a><a id="GHWEB00026" name="GHWEB00026"></a></p>

<h4><a id="sthref165" name="sthref165"></a>&#51204;&#49569; &#54200;&#51665;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#51204;&#49569; &#54200;&#51665;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#44592;&#51316; &#51204;&#49569;&#51032; &#49444;&#51221;&#51012; &#49688;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>[&#51204;&#49569; &#54200;&#51665;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44592;&#48376;&#44050; &#47196;&#46300;</dt>
<dd>
<p>&#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#45716; &#49444;&#51221;&#51012; &#44592;&#48376;&#44050;&#51004;&#47196; &#48373;&#50896;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#49444;&#51221;&#51008; &#48320;&#44221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#44396;&#49457; &#51060;&#47492;</dt>
<dd>
<p>&#51060; &#54168;&#51060;&#51648;&#51032; &#49444;&#51221;&#51060; &#51201;&#50857;&#46104;&#45716; &#44396;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51060;&#47492;</dt>
<dd>
<p>&#51204;&#49569;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060;&#47492;&#51008; &#51069;&#44592; &#51204;&#50857; &#54596;&#46300;&#51077;&#45768;&#45796;. &#49352; &#51204;&#49569;&#51012; &#49373;&#49457;&#54624; &#46412;&#47564; &#51060;&#47492;&#51012; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#53364;&#47000;&#49828; &#51060;&#47492;</dt>
<dd>
<p>&#51204;&#49569; &#44396;&#54788;&#51032; &#53364;&#47000;&#49828; &#51060;&#47492;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>com.sun.grizzly.TCPSelectorHandler</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49440;&#53469; &#53412; &#52376;&#47532;&#44592;</dt>
<dd>
<p>&#49440;&#53469; &#53412; &#52376;&#47532;&#44592;&#51032; &#53364;&#47000;&#49828; &#51060;&#47492;&#51077;&#45768;&#45796;. &#49440;&#53469; &#53412; &#52376;&#47532;&#44592;&#45716; &#49440;&#53469; &#53412;&#51032; &#49688;&#47749; &#51452;&#44592;&#47484; &#44288;&#47532;&#54616;&#45716; &#52628;&#49345; &#53364;&#47000;&#49828;&#51077;&#45768;&#45796;. &#44050;&#51012; &#51648;&#51221;&#54616;&#51648; &#50506;&#51004;&#47732; &#44592;&#48376; &#44396;&#54788;&#51060; &#49324;&#50857;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#48148;&#51060;&#53944; &#48260;&#54140; &#50976;&#54805;</dt>
<dd>
<p>&#49324;&#50857;&#54624; <code>ByteBuffer</code>&#51032; &#50976;&#54805;&#51077;&#45768;&#45796;. &#49324;&#50857; &#44032;&#45733;&#54620; &#49440;&#53469; &#54637;&#47785;&#51008; <code>HEAP</code> &#48143; <code>DIRECT</code>&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>HEAP</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49688;&#46973;&#51088; &#49828;&#47112;&#46300;</dt>
<dd>
<p>&#49884;&#49828;&#53596;&#50640; &#51080;&#45716; &#54532;&#47196;&#49464;&#49436;&#51032; &#49688;&#51077;&#45768;&#45796;. &#44050;&#51060; &ndash;1&#51060;&#47732; Grizzly&#50640;&#49436; &#49884;&#49828;&#53596;&#50640; &#51080;&#45716; &#54532;&#47196;&#49464;&#49436; &#49688;&#47484; &#44592;&#51456;&#51004;&#47196; &#49688;&#46973;&#51088; &#49828;&#47112;&#46300; &#49688;&#47484; &#44228;&#49328;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 1&#51077;&#45768;&#45796;.</p>
<p>&#50836;&#52397; &#52376;&#47532; &#49828;&#47112;&#46300; &#49688;&#47484; &#49444;&#51221;&#54616;&#47140;&#47732; &#51060; &#51204;&#49569;&#51012; &#49324;&#50857;&#54616;&#45716; &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#50640;&#49436; &#49324;&#50857;&#46104;&#45716; &#49828;&#47112;&#46300; &#54400;&#51032; &#52572;&#45824; &#49828;&#47112;&#46300; &#54400; &#53356;&#44592; &#44050;&#51012; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#45824; &#51217;&#49549; &#49688;</dt>
<dd>
<p>&#51060; &#51204;&#49569;&#51012; &#49324;&#50857;&#54616;&#45716; &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#50640;&#49436; &#48372;&#47448; &#51473;&#51064; &#52572;&#45824; &#51217;&#49549; &#49688;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 4096&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#48260;&#54140; &#53356;&#44592;</dt>
<dd>
<p>&#51060; &#51204;&#49569;&#51012; &#49324;&#50857;&#54616;&#45716; &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#50640;&#49436; &#49373;&#49457;&#54620; &#51077;&#47141; &#49828;&#53944;&#47548;&#50640; &#51228;&#44277;&#54624; &#48260;&#54140;&#51032; &#53356;&#44592;(&#48148;&#51060;&#53944;)&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 8192&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#50976;&#55092; &#53412; &#49884;&#44036; &#52488;&#44284;</dt>
<dd>
<p>&#50976;&#55092; &#53412;&#44032; &#52712;&#49548;&#46104;&#44256; &#52292;&#45328;&#51060; &#45803;&#55176;&#44592; &#51204;&#44620;&#51648;&#51032; &#49884;&#44036;(&#52488;)&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 30&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51069;&#44592; &#49884;&#44036; &#52488;&#44284;</dt>
<dd>
<p>&#51069;&#44592; &#51089;&#50629;&#51032; &#54756;&#45908; &#48143; &#48376;&#47928; &#44396;&#47928; &#48516;&#49437; &#45800;&#44228; &#46041;&#50504; GlassFish Server&#44032; &#45824;&#44592;&#54616;&#45716; &#49884;&#44036;(&#48128;&#47532;&#52488;)&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 30,000&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49440;&#53469;&#44592; &#54260; &#49884;&#44036; &#52488;&#44284;</dt>
<dd>
<p>NIO &#49440;&#53469;&#44592;&#44032; &#51060;&#48292;&#53944;(&#49324;&#50857;&#51088; &#50836;&#52397;) &#45824;&#44592;&#47484; &#52264;&#45800;&#54624; &#49884;&#44036;(&#48128;&#47532;&#52488;)&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 1000&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#50416;&#44592; &#49884;&#44036; &#52488;&#44284;</dt>
<dd>
<p>&#51025;&#45813;&#51012; &#50424; &#46412; &#50896;&#44201; &#53364;&#46972;&#51060;&#50616;&#53944;&#51032; &#51217;&#49549;&#51060; &#54644;&#51228;&#46108; &#44163;&#51004;&#47196; &#44036;&#51452;&#54616;&#44592; &#51204;&#50640; GlassFish Server&#44032; &#45824;&#44592;&#54616;&#45716; &#49884;&#44036;(&#48128;&#47532;&#52488;)&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 30,000&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#54364;&#49884; &#44396;&#49457;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; Grizzly&#51032; &#45236;&#48512; &#44396;&#49457;&#51060; &#49436;&#48260; &#47196;&#44536;&#47196; &#48708;&#50892;&#51665;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#46356;&#48260;&#44613;&#51012; &#50948;&#54620; &#50976;&#50857;&#54620; &#51221;&#48372;&#47484; &#51228;&#44277;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#49828;&#45572;&#54532;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; &#50836;&#52397;/&#51025;&#45813; &#51221;&#48372;&#44032; &#49436;&#48260; &#47196;&#44536;&#50640; &#45924;&#54532;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#46356;&#48260;&#44613;&#51012; &#50948;&#54620; &#50976;&#50857;&#54620; &#51221;&#48372;&#47484; &#51228;&#44277;&#54624; &#49688; &#51080;&#51648;&#47564; &#49457;&#45733;&#51012; &#54788;&#51200;&#55176; &#44048;&#49548;&#49884;&#53429;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>TCP &#51648;&#50672; &#50630;&#51020;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; TCP_NODELAY(Nagle&#51032; &#50508;&#44256;&#47532;&#51608;&#51060;&#46972;&#44256;&#46020; &#54632;)&#44032; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref166" name="sthref166"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-transportnew.html">&#51204;&#49569;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-transportedit.html">&#51204;&#49569;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-transportdelete.html">&#51204;&#49569;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref167" name="sthref167"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<ul>
<li>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00061"><code>create-transport</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00206"><code>list-transports</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00112"><code>delete-transport</code>(1)</a></p>
</li>
</ul>
</li>
</ul>




<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
