<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-accesslog" name="ref-accesslog"></a></p>

<h4><a id="sthref104" name="sthref104"></a><a id="sthref105" name="sthref105"></a>HTTP &#49436;&#48708;&#49828;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[HTTP &#49436;&#48708;&#49828;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#50937; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51032; &#51068;&#48152; &#50529;&#49464;&#49828; &#47196;&#44536; &#51221;&#52293;&#51012; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>HTTP &#49436;&#48708;&#49828;&#47484; &#49324;&#50857;&#54616;&#47732; &#50937; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51012; &#48176;&#52824;&#54616;&#44256; &#44032;&#49345; &#49436;&#48260;, &#49828;&#47112;&#46300; &#54400;, &#45348;&#53944;&#50892;&#53356; &#44396;&#49457; &#44592;&#45733;&#44284; &#54632;&#44760; HTTP &#53364;&#46972;&#51060;&#50616;&#53944;&#50640;&#49436; &#48176;&#52824;&#46108; &#50937; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#50529;&#49464;&#49828;&#54624; &#49688; &#51080;&#45716; &#44592;&#45733;&#51012; &#51228;&#44277;&#54633;&#45768;&#45796;.</p>
<p>GlassFish Server&#50640;&#49436;&#45716; HTTP &#49436;&#48708;&#49828; &#50529;&#49464;&#49828; &#47196;&#44536;&#47484; &#49324;&#50857;&#54616;&#50668; &#44032;&#49345; &#49436;&#48260;&#51032; &#50529;&#49464;&#49828; &#47196;&#44536;&#50640; &#45824;&#54620; &#44368;&#52404;&#47484; &#44396;&#49457;&#54616;&#44144;&#45208; &#49324;&#50857;&#54616;&#46020;&#47197; &#49444;&#51221;&#54633;&#45768;&#45796;. &#51060; &#47196;&#44536;&#45716; domain-dir<code>/logs/access</code> &#46356;&#47113;&#53664;&#47532;&#50640; &#51080;&#51004;&#47728;, <i>virtual_server_name</i><code>_access_log.</code><i>yyyyMMdd</i><code>-</code><i>HH</i><code>h</code><i>mm</i><code>m</code><i>ss</i><code>s.txt</code>&#50752; &#44057;&#51060; &#51060;&#47492;&#51060; &#51648;&#51221;&#46121;&#45768;&#45796;.</p>
<p>[HTTP &#49436;&#48708;&#49828;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44592;&#48376;&#44050; &#47196;&#46300;</dt>
<dd>
<p>&#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#45716; &#49444;&#51221;&#51012; &#44592;&#48376;&#44050;&#51004;&#47196; &#48373;&#50896;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#49444;&#51221;&#51008; &#48320;&#44221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#44396;&#49457; &#51060;&#47492;</dt>
<dd>
<p>&#51060; &#54168;&#51060;&#51648;&#51032; &#49444;&#51221;&#51060; &#51201;&#50857;&#46104;&#45716; &#44396;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>SSO</dt>
<dd>
<p>&#51060; &#49436;&#48260;&#51032; &#47784;&#46304; &#44032;&#49345; &#49436;&#48260;&#50640;&#49436; &#46041;&#51068;&#54620; &#50689;&#50669;&#50640; &#45824;&#54644; &#44396;&#49457;&#46108; &#47784;&#46304; &#50937; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#45824;&#54644; Single Sign-On&#51012; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#54624;&#51648; &#50668;&#48512;&#47484; &#49885;&#48324;&#54633;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#51648; &#50506;&#51004;&#47732; &#47784;&#46304; &#44032;&#49345; &#49436;&#48260;&#50640; &#45824;&#54644; Single Sign-On&#51060; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#47728; &#49324;&#50857;&#51088;&#45716; &#44033; &#44032;&#49345; &#49436;&#48260;&#51032; &#47784;&#46304; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#44060;&#48324;&#51201;&#51004;&#47196; &#51064;&#51613;&#54644;&#50556; &#54633;&#45768;&#45796;. &#44060;&#48324; &#44032;&#49345; &#49436;&#48260;&#50640; &#45824;&#54644; &#51060; &#49444;&#51221;&#51012; &#51116;&#51221;&#51032;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51593;, SSO&#47484; &#49324;&#50857; &#46608;&#45716; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#50529;&#49464;&#49828; &#47196;&#44613;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51060; &#49440;&#53469;&#46104;&#50612; &#51080;&#51004;&#47732; &#51060; &#49549;&#49457;&#51012; &#51648;&#51221;&#54616;&#51648; &#50506;&#51008; &#47784;&#46304; &#44032;&#49345; &#49436;&#48260; &#54616;&#50948; &#50836;&#49548;&#50640; &#45824;&#54644; &#50529;&#49464;&#49828; &#47196;&#44613;&#51060; &#49324;&#50857;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#51648; &#50506;&#51004;&#47732; &#51060; &#49549;&#49457;&#51012; &#51648;&#51221;&#54616;&#51648; &#50506;&#51008; &#47784;&#46304; &#44032;&#49345; &#49436;&#48260; &#54616;&#50948; &#50836;&#49548;&#50640; &#45824;&#54620; &#50529;&#49464;&#49828; &#47196;&#44613;&#51060; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#44368;&#52404;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; &#47196;&#44536; &#54028;&#51068; &#44368;&#52404;&#44032; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#44368;&#52404; &#51221;&#52293;</dt>
<dd>
<p>&#49324;&#50857; &#44032;&#45733;&#54620; &#50976;&#51068;&#54620; &#44368;&#52404; &#51221;&#52293;&#51008; <code>time</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#44368;&#52404; &#44036;&#44201;</dt>
<dd>
<p>&#50529;&#49464;&#49828; &#47196;&#44536; &#44368;&#52404; &#44036;&#44201;(&#48516;)&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#44368;&#52404; &#51221;&#52293;&#51060; <code>time</code>&#51064; &#44221;&#50864;&#50640;&#47564; &#51201;&#54633;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 1,440&#48516;(24&#49884;&#44036;)&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#44368;&#52404; &#51217;&#48120;&#50612;</dt>
<dd>
<p>&#44368;&#52404; &#51060;&#54980; &#47196;&#44536; &#54028;&#51068; &#51060;&#47492; &#45149;&#50640; &#52628;&#44032;&#54624; &#47928;&#51088;&#50676; &#44050;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>yyyy-MM-dd</code>&#51077;&#45768;&#45796;.</p>
<p>&#44368;&#52404; &#51217;&#48120;&#50612;&#50640; &#47784;&#46304; &#47196;&#44536; &#44368;&#52404;&#50640; &#45824;&#54644; &#44256;&#50976;&#54620; &#51217;&#48120;&#50612;&#47484; &#49373;&#49457;&#54616;&#44592; &#50948;&#54620; &#52649;&#48516;&#54620; &#44050;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#45716;&#51648; &#54869;&#51064;&#54633;&#45768;&#45796;. &#50696;&#47484; &#46308;&#50612; &#50529;&#49464;&#49828; &#47196;&#44536;&#44032; &#47588;&#51068; 2&#54924; &#51060;&#49345; &#48712;&#48264;&#54616;&#44172; &#44368;&#52404;&#46104;&#45716; &#44221;&#50864; &#44368;&#52404; &#51217;&#48120;&#50612;&#50640; &#49884;&#44036;&#51012; &#54252;&#54632;&#54633;&#45768;&#45796;.</p>
<p>&#50529;&#49464;&#49828; &#47196;&#44536; &#54028;&#51068;&#51060; &#44368;&#52404; &#44036;&#44201;&#51060; &#44221;&#44284;&#54624; &#46412;&#47560;&#45796; &#44368;&#52404;&#46104;&#45716;&#51648; &#54869;&#51064;&#54616;&#47140;&#47732; &#44256;&#50976;&#54620; &#51217;&#48120;&#50612;&#44032; &#54596;&#50836;&#54633;&#45768;&#45796;. &#49352; &#50529;&#49464;&#49828; &#47196;&#44536; &#54028;&#51068;&#51032; &#44368;&#52404; &#51217;&#48120;&#50612;&#44032; &#44592;&#51316; &#50529;&#49464;&#49828; &#47196;&#44536; &#54028;&#51068;&#51032; &#44368;&#52404; &#51217;&#48120;&#50612;&#50752; &#46041;&#51068;&#54620; &#44221;&#50864; &#54028;&#51068;&#51060; &#44368;&#52404;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#45824; &#54028;&#51068; &#49688;</dt>
<dd>
<p>&#48372;&#44288;&#54624; &#44368;&#52404; &#50529;&#49464;&#49828; &#47196;&#44536; &#54028;&#51068;&#51032; &#52572;&#45824; &#49688;&#51077;&#45768;&#45796;. &#51020;&#49688; &#44050;&#51008; &#54028;&#51068; &#49688;&#50640; &#51228;&#54620;&#51060; &#50630;&#51020;&#51012; &#45208;&#53440;&#45253;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; -1&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#48260;&#54140; &#53356;&#44592;</dt>
<dd>
<p>&#50529;&#49464;&#49828; &#47196;&#44536; &#48260;&#54140;&#51032; &#53356;&#44592;(&#48148;&#51060;&#53944;) &#46608;&#45716; &#48260;&#54140;&#47553;&#46104;&#51648; &#50506;&#51008; &#50529;&#49464;&#49828; &#47196;&#44536;&#51032; &#44221;&#50864; 0&#48372;&#45796; &#51089;&#44144;&#45208; &#44057;&#51008; &#44050;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 32768&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#50416;&#44592; &#44036;&#44201;</dt>
<dd>
<p>&#47196;&#44536;&#44032; &#46356;&#49828;&#53356;&#50640; &#44592;&#47197;&#46104;&#44592; &#51204;&#44620;&#51648;&#51032; &#49884;&#44036;(&#52488; &#45800;&#50948;)&#51077;&#45768;&#45796;. &#50529;&#49464;&#49828; &#47196;&#44536;&#45716; &#48260;&#54140;&#44032; &#44032;&#46301; &#52264;&#44144;&#45208; &#44036;&#44201;&#51060; &#47564;&#47308;&#46104;&#47732; &#44592;&#47197;&#46121;&#45768;&#45796;. &#44050;&#51060; 0&#48372;&#45796; &#51089;&#44144;&#45208; &#44057;&#51004;&#47732; &#48260;&#54140;&#45716; &#44032;&#46301; &#52264;&#51648; &#50506;&#45908;&#46972;&#46020; &#54637;&#49345; &#44592;&#47197;&#46121;&#45768;&#45796;. &#51593;, &#49436;&#48260;&#50640; &#50529;&#49464;&#49828;&#54624; &#46412;&#47560;&#45796; &#47196;&#44536; &#47700;&#49884;&#51648;&#44032; &#51649;&#51217; &#54028;&#51068;&#50640; &#51200;&#51109;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 300&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#54805;&#49885;</dt>
<dd>
<p>&#50529;&#49464;&#49828; &#47196;&#44536;&#50640;&#49436; &#52897;&#52376;&#54624; &#51221;&#48372; &#48143; &#52897;&#52376;&#46104;&#45716; &#49692;&#49436;&#47484; &#51648;&#51221;&#54616;&#45716; &#47928;&#51088;&#50676; &#44050;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<pre>
%client.name% %auth-user-name% %datetime% %request% %status% %response.length%
</pre>
<p>&#54805;&#49885; &#47928;&#51088;&#50676;&#50640; &#54252;&#54632;&#54616;&#44592; &#50948;&#54644; &#49324;&#50857; &#44032;&#45733;&#54620; &#44050;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt><code>%attribute.</code><i>name</i><code>%</code></dt>
<dd>
<p><code>toString</code> &#47700;&#49548;&#46300;&#47484; &#54840;&#52636;&#54616;&#50668; &#51648;&#51221;&#46108; <i>name</i>&#51012; &#44054;&#45716; &#50836;&#52397; &#49549;&#49457;&#51032; &#44050;&#51012; &#44592;&#47197;&#54633;&#45768;&#45796;.</p>
</dd>
<dt><code>%auth-user-name%</code></dt>
<dd>
<p>&#51064;&#51613;&#46108; &#49324;&#50857;&#51088;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>%client.name%</code></dt>
<dd>
<p>&#53364;&#46972;&#51060;&#50616;&#53944; &#54840;&#49828;&#53944; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>%client.dns%</code></dt>
<dd>
<p>&#53364;&#46972;&#51060;&#50616;&#53944; DNS&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>%cookie.</code><i>name</i><code>%</code></dt>
<dd>
<p>&#51648;&#51221;&#46108; <i>name</i>&#51012; &#44054;&#45716; &#50836;&#52397; &#53216;&#53412;&#51032; &#44050;&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>%cookie.value%</code></dt>
<dd>
<p>&#50836;&#52397;&#50640; &#51080;&#45716; &#52395;&#48264;&#51704; &#53216;&#53412;&#51032; &#44050;&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>%datetime%</code></dt>
<dd>
<p>&#49884;&#49828;&#53596; &#45216;&#51676;</p>
</dd>
<dt><code>%request%</code></dt>
<dd>
<p>&#51204;&#52404; HTTP &#50836;&#52397; &#54665;&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>%status%</code></dt>
<dd>
<p>&#49345;&#53468;&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>%response.length%</code></dt>
<dd>
<p>&#51025;&#45813; &#45236;&#50857; &#44600;&#51060;&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>%header.referer%</code></dt>
<dd>
<p>&#52280;&#51312;&#51088; &#54756;&#45908;&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>%header.user-agent%</code></dt>
<dd>
<p>&#49324;&#50857;&#51088; &#50640;&#51060;&#51204;&#53944; &#54756;&#45908;&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>%http-method%</code></dt>
<dd>
<p>HTTP &#47700;&#49548;&#46300;&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>%http-uri%</code></dt>
<dd>
<p>HTTP URI&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>%query-str%</code></dt>
<dd>
<p>HTTP &#51656;&#51032; &#47928;&#51088;&#50676;&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>%http-version%</code></dt>
<dd>
<p>HTTP &#54532;&#47196;&#53664;&#53084; &#48260;&#51204;&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>%header.accept%</code></dt>
<dd>
<p>&#49849;&#51064; &#54756;&#45908;&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>%header.date%</code></dt>
<dd>
<p>&#45216;&#51676; &#54756;&#45908;&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>%header.if-mod-since%</code></dt>
<dd>
<p>If-Modified-Since &#54756;&#45908;&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>%header.auth%</code></dt>
<dd>
<p>&#51064;&#51613; &#54756;&#45908;&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>%header.</code><i>any</i><code>%</code></dt>
<dd>
<p>RFC 2616&#50640; &#51221;&#51032;&#46108; &#47784;&#46304; &#51201;&#54633;&#54620; HTTP &#54756;&#45908; &#44050;&#51077;&#45768;&#45796;(&#46608;&#54620; <code>any</code>&#44032; &#51201;&#54633;&#54620; &#54756;&#45908; &#44050;&#51060;&#47728;, &#51060;&#44163;&#51008; &#50668;&#44592;&#49436; &#48320;&#49688;&#47196; &#51648;&#51221;&#46120;).</p>
</dd>
<dt><code>%session.</code><i>name</i><code>%</code></dt>
<dd>
<p>&#51060;&#47492;&#51060; <i>name</i>&#51064; &#49464;&#49496; &#49549;&#49457;&#51032; &#44050;, <code>NULL-SESSION-ATTRIBUTE-</code>name(&#47749;&#47749;&#46108; &#49549;&#49457;&#51060; &#49464;&#49496;&#50640; &#50630;&#45716; &#44221;&#50864;) &#46608;&#45716; <code>NULL-SESSION</code>(&#49464;&#49496;&#51060; &#50630;&#45716; &#44221;&#50864;)&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>%time-taken%</code></dt>
<dd>
<p>&#44033; &#50836;&#52397;&#51012; &#52376;&#47532;&#54616;&#45716; &#45936; &#44152;&#47536; &#49884;&#44036;(&#48128;&#47532;&#52488;)&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>%vs.id%</code></dt>
<dd>
<p>&#44032;&#49345; &#49436;&#48260; ID</p>
</dd>
</dl>
</dd>
<dt>&#52628;&#44032; &#49549;&#49457;</dt>
<dd>
<p>HTTP &#49436;&#48708;&#49828;&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51077;&#45768;&#45796;. &#49324;&#50857; &#44032;&#45733;&#54620; &#49549;&#49457;&#50640; &#45824;&#54620; &#49444;&#47749;&#51008; <a href="ref-httpserviceprops.html">HTTP &#49436;&#48708;&#49828; &#44288;&#47144; &#49549;&#49457;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</dd>
</dl>
<a id="sthref106" name="sthref106"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<p><a href="task-accesslog.html">HTTP &#49436;&#48708;&#49828;&#47484; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
<a id="sthref107" name="sthref107"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<p>&#50630;&#51020;</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
