<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-protocolnew" name="ref-protocolnew"></a><a id="GHWEB00019" name="GHWEB00019"></a></p>

<h4><a id="sthref141" name="sthref141"></a>&#49352; &#54532;&#47196;&#53664;&#53084;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#49352; &#54532;&#47196;&#53664;&#53084;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#49352; &#45348;&#53944;&#50892;&#53356; &#54532;&#47196;&#53664;&#53084;&#51012; &#49373;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#54532;&#47196;&#53664;&#53084;&#51012; &#49373;&#49457;&#54620; &#54980; &#51068;&#48152;&#51201;&#51004;&#47196; &#46041;&#51068;&#54620; &#51060;&#47492;&#51004;&#47196; &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#47484; &#49373;&#49457;&#54616;&#44256; &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#50752; &#54532;&#47196;&#53664;&#53084;&#51012; &#50672;&#44208;&#54633;&#45768;&#45796;. &#46608;&#45716; &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#47484; &#49373;&#49457;&#54616;&#47732; &#46041;&#49884;&#50640; &#44592;&#48376; &#49444;&#51221;&#51012; &#44054;&#45716; &#54532;&#47196;&#53664;&#53084;&#51060; &#51088;&#46041;&#51004;&#47196; &#49373;&#49457;&#46121;&#45768;&#45796;.</p>
<p>[&#49352; &#54532;&#47196;&#53664;&#53084;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44396;&#49457; &#51060;&#47492;</dt>
<dd>
<p>&#51060; &#54168;&#51060;&#51648;&#51032; &#49444;&#51221;&#51060; &#51201;&#50857;&#46104;&#45716; &#44396;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51060;&#47492;</dt>
<dd>
<p>&#54532;&#47196;&#53664;&#53084;&#51032; &#44256;&#50976;&#54620; &#51060;&#47492;&#51077;&#45768;&#45796;. &#54532;&#47196;&#53664;&#53084; &#51060;&#47492;&#51008; &#49707;&#51088;&#47196; &#49884;&#51089;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#48372;&#50504;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; &#54532;&#47196;&#53664;&#53084;&#50640; &#45824;&#54644; &#48372;&#50504;&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;. &#48372;&#50504;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; [&#54532;&#47196;&#53664;&#53084; &#54200;&#51665;] &#54168;&#51060;&#51648;&#51032; SSL &#53485;&#51012; &#49324;&#50857;&#54616;&#50668; &#48372;&#50504; &#49444;&#51221;&#51012; &#49688;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#49345;&#53468;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; &#54028;&#51068; &#52880;&#49884;&#44032; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#45824; &#49324;&#50857; &#44592;&#44036;</dt>
<dd>
<p>&#51201;&#54633;&#54620; &#52880;&#49884; &#54637;&#47785;&#50640; &#45824;&#54620; &#52572;&#45824; &#49324;&#50857; &#44592;&#44036;(&#52488;)&#51077;&#45768;&#45796;.</p>
<p>&#51060; &#47588;&#44060;&#48320;&#49688;&#45716; &#54028;&#51068;&#51060; &#52880;&#49884;&#46108; &#54980; &#52880;&#49884;&#46108; &#51221;&#48372;&#44032; &#49324;&#50857;&#46104;&#45716; &#44592;&#44036;&#51012; &#51228;&#50612;&#54633;&#45768;&#45796;. &#52572;&#45824; &#49324;&#50857; &#44592;&#44036;&#48372;&#45796; &#50724;&#47000;&#46108; &#54637;&#47785;&#51008; &#44057;&#51008; &#54028;&#51068;&#50640; &#45824;&#54620; &#49352; &#54637;&#47785;&#51004;&#47196; &#45824;&#52404;&#46121;&#45768;&#45796;. &#45236;&#50857;&#51060; &#51088;&#51452; &#48320;&#44221;&#46104;&#51648; &#50506;&#45716; &#44221;&#50864;&#50640;&#45716; &#49457;&#45733; &#54693;&#49345;&#51012; &#50948;&#54644; &#51060; &#44050;&#51012; &#45720;&#47532;&#49901;&#49884;&#50724;.</p>
<p>&#52572;&#51201;&#51032; &#52572;&#45824; &#49324;&#50857; &#44592;&#44036;&#51008; &#44592;&#51316; &#54028;&#51068;&#51060; &#51221;&#44592;&#51201;&#51004;&#47196; &#49688;&#51221;&#46104;&#45716;&#51648; &#50668;&#48512;&#50640; &#46384;&#46972; &#45796;&#47493;&#45768;&#45796;. &#50696;&#47484; &#46308;&#50612; &#54028;&#51068;&#51060; &#54616;&#47336;&#50640; &#45348; &#48264; &#51221;&#44592;&#51201;&#51064; &#44036;&#44201;&#51004;&#47196; &#49688;&#51221;&#46104;&#45716; &#44221;&#50864; &#52572;&#45824; &#49324;&#50857; &#44592;&#44036;&#51012; 21600&#52488;(6&#49884;&#44036;)&#47196; &#49444;&#51221;&#54616;&#45716; &#44163;&#51060; &#51339;&#49845;&#45768;&#45796;. &#44536;&#47111;&#51648; &#50506;&#51008; &#44221;&#50864;&#50640;&#45716; &#54028;&#51068;&#51060; &#49688;&#51221;&#46108; &#54980; &#54028;&#51068;&#51032; &#51060;&#51204; &#48260;&#51204;&#51012; &#49436;&#48708;&#49828;&#54616;&#47140;&#44256; &#54616;&#45716; &#44032;&#51109; &#44596; &#49884;&#44036;&#51004;&#47196; &#52572;&#45824; &#49324;&#50857; &#44592;&#44036;&#51012; &#49444;&#51221;&#54616;&#45716; &#44163;&#51012; &#44256;&#47140;&#54644; &#48372;&#49901;&#49884;&#50724;.</p>
<p>&#44592;&#48376;&#44050;&#51008; 30&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#45824; &#52880;&#49884; &#53356;&#44592;</dt>
<dd>
<p>&#46356;&#49828;&#53356;&#50640; &#51080;&#45716; &#54028;&#51068; &#52880;&#49884;&#51032; &#52572;&#45824; &#51204;&#52404; &#53356;&#44592;(&#48148;&#51060;&#53944;)&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 10485760&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#45824; &#54028;&#51068; &#49688;</dt>
<dd>
<p>&#54028;&#51068; &#52880;&#49884;&#50640; &#51200;&#51109;&#54624; &#49688; &#51080;&#45716; &#54028;&#51068;&#51032; &#52572;&#45824; &#49688;&#51077;&#45768;&#45796;.</p>
<p>&#44050;&#51060; &#45320;&#47924; &#53356;&#47732; &#49436;&#48260;&#44032; &#51088;&#51452; &#49324;&#50857;&#46104;&#51648; &#50506;&#51008; &#54028;&#51068;&#44620;&#51648; &#52880;&#49884;&#54616;&#48064;&#47196; &#47700;&#47784;&#47532;&#44032; &#45229;&#48708;&#46121;&#45768;&#45796;. &#44050;&#51060; &#45320;&#47924; &#51089;&#51004;&#47732; &#52880;&#49905;&#51032; &#51109;&#51216;&#51060; &#49324;&#46972;&#51656; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#49549;&#49457;&#50640; &#50668;&#47084; &#44050;&#51012; &#53580;&#49828;&#53944;&#54616;&#50668; &#53945;&#51221; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#47582;&#45716; &#52572;&#51201;&#51032; &#49556;&#47336;&#49496;&#51012; &#52286;&#51004;&#49901;&#49884;&#50724;.</p>
<p>&#44592;&#48376;&#44050;&#51008; 1024&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49436;&#48260; &#51060;&#47492;</dt>
<dd>
<p>&#49436;&#48260;&#44032; &#53364;&#46972;&#51060;&#50616;&#53944;&#50640; &#51204;&#49569;&#54616;&#45716; URL&#50640; &#49324;&#50857;&#46112; &#54840;&#49828;&#53944; &#51060;&#47492;&#51077;&#45768;&#45796;. &#49436;&#48260;&#44032; &#48324;&#52845;&#51012; &#49324;&#50857;&#54616;&#45716; &#44221;&#50864; &#51060; &#51060;&#47492;&#51008; &#48324;&#52845; &#51060;&#47492;&#51077;&#45768;&#45796;. &#49436;&#48260;&#44032; &#48324;&#52845;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#44221;&#50864;&#50640;&#45716; &#51060; &#54596;&#46300;&#47484; &#48708;&#50892; &#46160;&#49901;&#49884;&#50724;.</p>
<p>&#51060; &#44050;&#51008; &#49436;&#48260;&#50640;&#49436; &#51088;&#46041;&#51004;&#47196; &#49373;&#49457;&#54616;&#45716; URL&#50640; &#50689;&#54693;&#51012; &#51452;&#51648;&#47564;, &#49436;&#48260;&#50640; &#51200;&#51109;&#46108; &#46356;&#47113;&#53664;&#47532; &#48143; &#54028;&#51068;&#51032; URL&#50640;&#45716; &#50689;&#54693;&#51012; &#51452;&#51648; &#50506;&#49845;&#45768;&#45796;. &#49436;&#48260;&#50640;&#49436; &#48324;&#52845;&#51012; &#49324;&#50857;&#54616;&#45716; &#44221;&#50864; &#49436;&#48260; &#51060;&#47492;&#51060; &#48324;&#52845; &#51060;&#47492;&#51060;&#50612;&#50556; &#54633;&#45768;&#45796;. &#53084;&#47200;&#44284; &#54252;&#53944; &#48264;&#54840;&#47484; &#52628;&#44032;&#54616;&#47732; &#49436;&#48260;&#50640;&#49436; &#53364;&#46972;&#51060;&#50616;&#53944;&#50640; &#51204;&#49569;&#54616;&#45716; URL&#50640; &#54644;&#45817; &#54252;&#53944;&#44032; &#49324;&#50857;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#44592;&#48376; &#44032;&#49345; &#49436;&#48260;</dt>
<dd>
<p>&#51060; &#54532;&#47196;&#53664;&#53084;&#44284; &#50672;&#44288;&#46108; &#44032;&#49345; &#49436;&#48260;&#51077;&#45768;&#45796;. [&#44032;&#49345; &#49436;&#48260;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#44032;&#49345; &#49436;&#48260;&#47484; &#51221;&#51032;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#54252;&#53944; &#51116;&#51648;&#51221;</dt>
<dd>
<p>&#50836;&#52397;&#51012; &#45796;&#47480; &#54252;&#53944;&#47196; &#51116;&#51648;&#51221;&#54616;&#45716; &#54252;&#53944; &#44050;&#51077;&#45768;&#45796;. &#45796;&#51020; &#46160; &#51312;&#44148;&#51060; &#51316;&#51116;&#54616;&#47732; GlassFish Server&#50640;&#49436; &#51088;&#46041;&#51004;&#47196; &#50836;&#52397;&#51012; &#51116;&#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#51060; &#54532;&#47196;&#53664;&#53084;&#51012; &#52280;&#51312;&#54616;&#45716; &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#45716; &#48708;SSL &#50836;&#52397;&#51012; &#51648;&#50896;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>SSL &#51204;&#49569;&#51060; &#54596;&#50836;&#54620; &#51068;&#52824;&#54616;&#45716; &#48372;&#50504; &#51228;&#50557; &#51312;&#44148;&#50640; &#45824;&#54620; &#50836;&#52397;&#51060; &#49688;&#49888;&#46108; &#44221;&#50864;</p>
</li>
</ul>
<p>&#51116;&#51648;&#51221; &#54252;&#53944;&#44032; &#51648;&#51221;&#46104;&#51648; &#50506;&#51008; &#44221;&#50864;&#50640;&#45716; GlassFish Server&#50640;&#49436; &#50896;&#47000; &#50836;&#52397;&#50640; &#51648;&#51221;&#46108; &#54252;&#53944; &#48264;&#54840;&#47484; &#49324;&#50857;&#54633;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; &#54252;&#53944;&#44032; &#51648;&#51221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#45824; &#51217;&#49549; &#49688;</dt>
<dd>
<p>&#49436;&#48260;&#50640;&#49436; &#51217;&#49549;&#51012; &#45803;&#51012; &#46412;&#44620;&#51648; &#54028;&#51060;&#54532;&#46972;&#51064;&#46112; &#49688; &#51080;&#45716; &#52572;&#45824; &#50836;&#52397; &#49688;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;. &#51217;&#49549; &#50976;&#51648; &#54616;&#50948; &#49884;&#49828;&#53596;&#51008; &#51221;&#44592;&#51201;&#51004;&#47196; &#50976;&#55092; &#51217;&#49549;&#51012; &#54260;&#47553;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 256&#51077;&#45768;&#45796;.</p>
<p>&#51060; &#49549;&#49457;&#51012; HTTP/1.0 &#51217;&#49549; &#50976;&#51648;&#50752; HTTP/1.1 &#51217;&#49549; &#50976;&#51648; &#48143; &#54028;&#51060;&#54532;&#46972;&#51064; &#52376;&#47532;&#47484; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54616;&#47140;&#47732; 1&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;. &#44050;&#51060; 0&#51060;&#47732; &#50836;&#52397;&#51060; &#54637;&#49345; &#44144;&#48512;&#46121;&#45768;&#45796;. &#44050;&#51060; &ndash;1&#51060;&#47732; &#51217;&#49549; &#50976;&#51648; &#51217;&#49549; &#49688;&#50640; &#51228;&#54620;&#51060; &#50630;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#49884;&#44036; &#52488;&#44284;</dt>
<dd>
<p>&#51217;&#49549;&#51060; &#50976;&#55092; &#49345;&#53468;&#47196; &#44036;&#51452;&#46104;&#44256; &#51217;&#49549; &#50976;&#51648; &#49345;&#53468;&#47196; &#50976;&#51648;&#46104;&#45716; &#52572;&#45824; &#49884;&#44036;(&#52488;)&#51077;&#45768;&#45796;. &#44050;&#51060; 0&#48372;&#45796; &#51089;&#44144;&#45208; &#44057;&#51004;&#47732; &#51217;&#49549; &#50976;&#51648; &#51217;&#49549;&#51060; &#47924;&#44592;&#54620; &#50676;&#47536; &#49345;&#53468;&#47196; &#50976;&#51648;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 30&#52488;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#50629;&#47196;&#46300; &#49884;&#44036; &#52488;&#44284;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; &#51217;&#49549; &#50629;&#47196;&#46300; &#49884;&#44036; &#52488;&#44284; &#51228;&#54620;&#50640; &#46020;&#45804;&#54620; &#54980;&#50640; &#48148;&#51060;&#53944;&#47484; &#45712;&#47532;&#44172; &#51069;&#45716; &#49436;&#48660;&#47551;&#50640; &#45824;&#54620; &#51217;&#49549;&#51060; &#45803;&#55193;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51012; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; &#49436;&#48660;&#47551; &#51217;&#49549;&#51060; &#49884;&#44036; &#52488;&#44284;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#51217;&#49549; &#50629;&#47196;&#46300; &#49884;&#44036; &#52488;&#44284;</dt>
<dd>
<p>&#50629;&#47196;&#46300;&#50640; &#45824;&#54620; &#49884;&#44036; &#52488;&#44284;(&#48128;&#47532;&#52488;)&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; [&#50629;&#47196;&#46300; &#49884;&#44036; &#52488;&#44284; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54620; &#44221;&#50864;&#50640;&#47564; &#51201;&#50857;&#46112; &#49688; &#51080;&#49845;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 300000&#48128;&#47532;&#52488;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#50836;&#52397; &#49884;&#44036; &#52488;&#44284;</dt>
<dd>
<p>&#50836;&#52397;&#51060; &#49884;&#44036; &#52488;&#44284;&#46104;&#44592; &#51204;&#51032; &#49884;&#44036;(&#52488;)&#51077;&#45768;&#45796;. &#49884;&#44036; &#52488;&#44284; &#44050;&#50640; &#46020;&#45804;&#54616;&#44592; &#51204;&#50640; &#50836;&#52397;&#51060; &#52376;&#47532;&#46104;&#51648; &#50506;&#51004;&#47732; &#50836;&#52397;&#51060; &#47924;&#49884;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 30&#52488;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51204;&#49569; &#48260;&#54140; &#53356;&#44592;</dt>
<dd>
<p>&#51204;&#49569; &#48260;&#54140;&#51032; &#53356;&#44592;(&#48148;&#51060;&#53944;)&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 8192&#48148;&#51060;&#53944;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#54756;&#45908; &#48260;&#54140; &#44600;&#51060;</dt>
<dd>
<p>&#50836;&#52397; &#52376;&#47532; &#49828;&#47112;&#46300;&#44032; &#50836;&#52397; &#45936;&#51060;&#53552;&#47484; &#51069;&#44592; &#50948;&#54644; &#49324;&#50857;&#54616;&#45716; &#48260;&#54140;&#51032; &#53356;&#44592;(&#48148;&#51060;&#53944;)&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 8192&#48148;&#51060;&#53944;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#45824; &#44172;&#49884; &#53356;&#44592;</dt>
<dd>
<p>POST &#51089;&#50629;&#51032; &#52572;&#45824; &#53356;&#44592;(&#48148;&#51060;&#53944;)&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 2097152&#48148;&#51060;&#53944;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>URI &#51064;&#53076;&#46377;</dt>
<dd>
<p>&#49688;&#49888;&#46108; &#50836;&#52397; URI&#47484; &#46356;&#53076;&#46377;&#54616;&#45716; &#45936; &#49324;&#50857;&#46104;&#45716; &#47928;&#51088; &#51665;&#54633;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#44050;&#51008; &#51201;&#54633;&#54620; IANA &#47928;&#51088; &#51665;&#54633; &#51060;&#47492;&#51060;&#50612;&#50556; &#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; UTF-8&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#48260;&#51204;</dt>
<dd>
<p>&#49324;&#50857;&#46104;&#45716; HTTP &#54532;&#47196;&#53664;&#53084;&#51032; &#48260;&#51204;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; HTTP/1.1&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#50517;&#52629;</dt>
<dd>
<p>HTTP/1.1 GZIP &#50517;&#52629; &#49324;&#50857;&#51012; &#51648;&#51221;&#54616;&#50668; &#49436;&#48260; &#45824;&#50669;&#54253;&#51012; &#51200;&#51109;&#54633;&#45768;&#45796;. &#49324;&#50857; &#44032;&#45733;&#54620; &#49440;&#53469; &#54637;&#47785;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt><code>on</code></dt>
<dd>
<p>&#45936;&#51060;&#53552;&#47484; &#50517;&#52629;&#54633;&#45768;&#45796;.</p>
</dd>
<dt><code>off</code></dt>
<dd>
<p>&#50517;&#52629;&#51012; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
</dd>
<dt><code>force</code></dt>
<dd>
<p>&#47784;&#46304; &#44221;&#50864; &#45936;&#51060;&#53552; &#50517;&#52629;&#51012; &#51201;&#50857;&#54633;&#45768;&#45796;.</p>
</dd>
</dl>
<p>&#44592;&#48376;&#44050;&#51008; <code>off</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#50517;&#52629; &#44032;&#45733;&#54620; MIME &#50976;&#54805;</dt>
<dd>
<p>HTTP &#50517;&#52629;&#51060; &#49324;&#50857;&#46104;&#45716; MIME &#50976;&#54805;&#51032; &#53092;&#47560;&#47196; &#44396;&#48516;&#46108; &#47785;&#47197;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>text/html,text/xml,text/plain</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#50517;&#52629; &#52572;&#49548; &#53356;&#44592;</dt>
<dd>
<p>&#50517;&#52629;&#51060; &#51201;&#50857;&#46112; &#46412; &#54028;&#51068;&#51032; &#52572;&#49548; &#53356;&#44592;&#51077;&#45768;&#45796;. &#50517;&#52629;&#51060; <code>on</code> &#46608;&#45716; <code>force</code>&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#51004;&#47732; &#51060; &#44050;&#51012; &#49444;&#51221;&#54644;&#50556; &#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 2048&#48148;&#51060;&#53944;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#48708;&#50517;&#52629; &#49324;&#50857;&#51088; &#50640;&#51060;&#51204;&#53944;</dt>
<dd>
<p>&#50517;&#52629;&#51012; &#49324;&#50857;&#54644;&#49436;&#45716; &#50504;&#46104;&#45716; HTTP &#53364;&#46972;&#51060;&#50616;&#53944;&#51032; &#49324;&#50857;&#51088; &#50640;&#51060;&#51204;&#53944;&#50752; &#51068;&#52824;&#54616;&#45716; &#51221;&#44508; &#54364;&#54788;&#49885;&#51032; &#53092;&#47560;&#47196; &#44396;&#48516;&#46108; &#47785;&#47197;&#51077;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; &#51060; &#44050;&#51008; &#48712; &#47928;&#51088;&#50676;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51228;&#54620;&#46108; &#49324;&#50857;&#51088; &#50640;&#51060;&#51204;&#53944;</dt>
<dd>
<p>HTTP &#50517;&#52629;&#51060; &#51201;&#50857;&#46104;&#45716; &#51228;&#54620;&#46108; &#49324;&#50857;&#51088; &#50640;&#51060;&#51204;&#53944; &#47785;&#47197;&#51077;&#45768;&#45796;. &#49324;&#50857;&#51088; &#50640;&#51060;&#51204;&#53944;&#47484; &#51648;&#51221;&#54616;&#51648; &#50506;&#51004;&#47732; &#47784;&#46304; &#49324;&#50857;&#51088; &#50640;&#51060;&#51204;&#53944;&#50640; HTTP &#50517;&#52629;&#51060; &#51201;&#50857;&#46121;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51088; &#50640;&#51060;&#51204;&#53944;&#44032; &#51648;&#51221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#44592;&#48376; &#51025;&#45813; &#50976;&#54805;</dt>
<dd>
<p>&#44592;&#48376; &#51025;&#45813; &#50976;&#54805;&#51012; &#51648;&#51221;&#54616;&#45716; &#47928;&#51088;&#50676;&#51077;&#45768;&#45796;. &#54805;&#49885;&#51008; &#45236;&#50857; &#50976;&#54805;, &#51064;&#53076;&#46377;, &#50616;&#50612; &#48143; &#47928;&#51088; &#51665;&#54633;&#51060; &#49464;&#48120;&#53084;&#47200;&#51004;&#47196; &#44396;&#48516;&#46108; &#47928;&#51088;&#50676;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>text/html; charset=iso-8859-1</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#44053;&#51228; &#51025;&#45813; &#50976;&#54805;</dt>
<dd>
<p>&#54028;&#51068; &#54869;&#51109;&#47749;&#44284; &#51068;&#52824;&#54616;&#45716; MIME &#47588;&#54609;&#51012; &#49324;&#50857;&#54624; &#49688; &#50630;&#45716; &#44221;&#50864; &#49324;&#50857;&#46104;&#45716; &#50836;&#52397; &#50976;&#54805;&#51012; &#51648;&#51221;&#54616;&#45716; &#47928;&#51088;&#50676;&#51077;&#45768;&#45796;. &#54805;&#49885;&#51008; &#45236;&#50857; &#50976;&#54805;, &#51064;&#53076;&#46377;, &#50616;&#50612; &#48143; &#47928;&#51088; &#51665;&#54633;&#51060; &#49464;&#48120;&#53084;&#47200;&#51004;&#47196; &#44396;&#48516;&#46108; &#47928;&#51088;&#50676;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>text/html; charset=iso-8859-1</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#50612;&#45841;&#53552;</dt>
<dd>
<p>&#51221;&#51201; &#47532;&#49548;&#49828; &#50612;&#45841;&#53552;&#51032; &#53364;&#47000;&#49828; &#51060;&#47492;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>com.sun.grizzly.tcp.StaticResourcesAdapter</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>Comet &#51648;&#50896;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; &#51060; &#54532;&#47196;&#53664;&#53084;&#51012; &#52280;&#51312;&#54616;&#45716; &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#50640; &#45824;&#54644; Comet &#51648;&#50896;&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; &#51060; &#50741;&#49496;&#51008; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;. &#49436;&#48660;&#47551; &#46608;&#45716; JSP &#54168;&#51060;&#51648;&#50640;&#49436; Comet &#44592;&#49696;&#51012; &#49324;&#50857;&#54616;&#45716; &#44221;&#50864; <code>web.xml</code> &#54028;&#51068;&#50640; <code>load-on-startup</code> &#50836;&#49548;&#47484; &#52628;&#44032;&#54616;&#50668; GlassFish Server&#44032; &#49884;&#51089;&#46112; &#46412; Comet &#44592;&#49696;&#51060; &#52488;&#44592;&#54868;&#46104;&#46020;&#47197; &#54633;&#45768;&#45796;. &#50696;&#47484; &#46308;&#47732; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<pre>
&lt;servlet&gt;
&lt;servlet-name&gt;CheckIn&lt;/servlet-name&gt;
&lt;servlet-class&gt;CheckInServlet&lt;/servlet-class&gt;
&lt;load-on-startup&gt;0&lt;/load-on-startup&gt;
&lt;/servlet&gt;
</pre></dd>
<dt>DNS &#51312;&#54924;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; DNS &#51312;&#54924;&#44032; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>DNS &#51312;&#54924;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; DNS &#51312;&#54924;&#44032; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>RCM &#51648;&#50896;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; RCM(Resource Configuration Management)&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#52628;&#51201;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; TRACE &#51089;&#50629;&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51060; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; GlassFish Server&#50640;&#49436; &#49324;&#51060;&#53944; &#44036; &#49828;&#53356;&#47549;&#54021; &#44277;&#44201;&#51012; &#48155;&#51012; &#44032;&#45733;&#49457;&#51060; &#45230;&#50500;&#51665;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#51064;&#51613; &#53685;&#44284;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; &#51060; &#54532;&#47196;&#53664;&#53084;&#51012; &#49324;&#50857;&#54616;&#45716; &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#44032; SSL &#51333;&#47308; &#54532;&#47197;&#49884; &#49436;&#48260;&#50640;&#49436; &#53944;&#47000;&#54589;&#51012; &#49688;&#49888;&#54633;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#52397;&#53356;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; HTTP &#51025;&#45813; &#52397;&#53356;&#44032; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>XPowered By</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; Java Servlet 3.0 &#48143; Java Server Pages 2.0 &#49324;&#50577;&#50640; &#46384;&#46972; <code>X-Powered-By</code> &#54756;&#45908;&#44032; &#49324;&#50857;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#51064;&#53076;&#46377;&#46108; &#49836;&#47000;&#49884;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; URI&#50640; &#51064;&#53076;&#46377;&#46108; &#49836;&#47000;&#49884;&#44032; &#54252;&#54632;&#46112; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#50937; &#49548;&#53011; &#51648;&#50896;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; &#50937; &#49548;&#53011; &#54532;&#47196;&#53664;&#53084;&#51060; &#51648;&#50896;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref142" name="sthref142"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-protocolnew.html">&#54532;&#47196;&#53664;&#53084;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">&#54532;&#47196;&#53664;&#53084;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">&#54532;&#47196;&#53664;&#53084;&#51032; SSL &#49444;&#51221;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">&#54532;&#47196;&#53664;&#53084;&#51032; HTTP &#49444;&#51221;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-protocolfilecacheedit.html">&#54532;&#47196;&#53664;&#53084;&#51032; &#54028;&#51068; &#52880;&#49884; &#49444;&#51221;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">&#54532;&#47196;&#53664;&#53084;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref143" name="sthref143"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00051"><code>create-protocol</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00195"><code>list-protocols</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00103"><code>delete-protocol</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
