<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-managerproptab" name="ref-managerproptab"></a></p>

<h4><a id="sthref95" name="sthref95"></a><a id="sthref96" name="sthref96"></a>&#44288;&#47532;&#51088; &#49549;&#49457;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#49464;&#49496; &#44288;&#47532;&#51088;&#45716; &#49464;&#49496;&#51012; &#49373;&#49457;&#54616;&#44256; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;, &#49464;&#49496; &#49345;&#53468; &#51200;&#51109; &#50948;&#52824; &#48143; &#49324;&#50857; &#44032;&#45733;&#54620; &#52572;&#45824; &#49464;&#49496; &#49688;&#47484; &#44396;&#49457;&#54624; &#49688; &#51080;&#45716; &#48169;&#48277;&#51012; &#51228;&#44277;&#54633;&#45768;&#45796;.</p>
<p>[&#44288;&#47532;&#51088; &#49549;&#49457;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#50937; &#52968;&#53580;&#51060;&#45320;&#51032; &#49464;&#49496; &#44288;&#47532;&#51088; &#49549;&#49457;&#51012; &#52628;&#44032;&#54616;&#44144;&#45208; &#49688;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>[&#44288;&#47532;&#51088; &#49549;&#49457;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44592;&#48376;&#44050; &#47196;&#46300;</dt>
<dd>
<p>&#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#45716; &#49444;&#51221;&#51012; &#44592;&#48376;&#44050;&#51004;&#47196; &#48373;&#50896;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#49444;&#51221;&#51008; &#48320;&#44221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#44396;&#49457; &#51060;&#47492;</dt>
<dd>
<p>&#51060; &#54168;&#51060;&#51648;&#51032; &#49444;&#51221;&#51060; &#51201;&#50857;&#46104;&#45716; &#44396;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#47532;&#54532; &#44036;&#44201;</dt>
<dd>
<p>&#48708;&#54876;&#49457; &#49464;&#49496; &#45936;&#51060;&#53552;&#44032; &#51200;&#51109;&#49548;&#50640;&#49436; &#49325;&#51228;&#46104;&#44592;&#44620;&#51648;&#51032; &#49884;&#44036;(&#52488;)&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 60&#51077;&#45768;&#45796;.</p>
<p>&#51060; &#44050;&#51012; &#49464;&#49496; &#45936;&#51060;&#53552;&#44032; &#48320;&#44221;&#46104;&#45716; &#48712;&#46020;&#48372;&#45796; &#45230;&#44172; &#49444;&#51221;&#54633;&#45768;&#45796;. &#50696;&#47484; &#46308;&#50612; &#51088;&#51452; &#50529;&#49464;&#49828;&#54616;&#45716; &#50937; &#49324;&#51060;&#53944;&#51032; &#51201;&#51473; &#54943;&#49688; &#49436;&#48660;&#47551;&#50640; &#45824;&#54644;&#49436;&#45716; &#51060; &#44050;&#51012; &#44032;&#45733;&#54620; &#54620; &#45230;&#44172;(1&#52488;) &#49444;&#51221;&#54644;&#50556; &#54633;&#45768;&#45796;.&#44536;&#47111;&#51648; &#50506;&#51004;&#47732; &#49436;&#48260;&#47484; &#51116;&#49884;&#51089;&#54624; &#46412;&#47560;&#45796; &#47560;&#51648;&#47561; &#47751; &#44060;&#51032; &#51201;&#51473; &#54637;&#47785;&#51060; &#49552;&#49892;&#46112; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#45824; &#49464;&#49496;</dt>
<dd>
<p>&#52880;&#49884;&#50640; &#51080;&#51012; &#49688; &#51080;&#45716; &#52572;&#45824; &#49464;&#49496; &#49688;&#51077;&#45768;&#45796;. &#44050;&#51060; &ndash;1&#51060;&#47732; &#49464;&#49496; &#49688;&#50640; &#51228;&#54620;&#51060; &#50630;&#49845;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; -1&#51077;&#45768;&#45796;.</p>
<p>&#51228;&#54620;&#50640; &#46020;&#45804;&#54620; &#54980;&#50640; &#49352; &#49464;&#49496;&#51012; &#49373;&#49457;&#54616;&#47140;&#44256; &#49884;&#46020;&#54616;&#47732; <code>IllegalStateException</code>&#51060; &#48156;&#49373;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#49464;&#49496; &#54028;&#51068; &#51060;&#47492;</dt>
<dd>
<p>&#49345;&#53468;&#47484; &#48372;&#51316;&#54624; &#49688; &#51080;&#45716; &#44221;&#50864; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#51116;&#49884;&#51089;&#46104;&#45716; &#49324;&#51060;&#50640; &#49464;&#49496; &#49345;&#53468;&#44032; &#48372;&#51316;&#46104;&#45716; &#46356;&#47113;&#53664;&#47532;&#51032; &#51208;&#45824; &#46608;&#45716; &#49345;&#45824; &#44221;&#47196;&#51077;&#45768;&#45796;. &#51060; &#44221;&#47196;&#47484; &#49444;&#51221;&#54616;&#51648; &#50506;&#51004;&#47732; &#49464;&#49496; &#49345;&#53468;&#44032; &#48372;&#51316;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; &#51060; &#44221;&#47196;&#45716; &#49444;&#51221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
<p>&#49345;&#45824; &#44221;&#47196;&#45716; &#51060; &#50937; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51032; &#51076;&#49884; &#46356;&#47113;&#53664;&#47532;&#50640; &#49345;&#45824;&#51201;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49464;&#49496; ID &#49373;&#49457;&#44592; &#53364;&#47000;&#49828; &#51060;&#47492;</dt>
<dd>
<p>&#44256;&#50976;&#54620; &#49464;&#49496; ID&#47484; &#49373;&#49457;&#54616;&#44592; &#50948;&#54620; &#49324;&#50857;&#51088; &#51221;&#51032; &#53364;&#47000;&#49828;&#51077;&#45768;&#45796;. &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#45817; &#54616;&#45208;&#51032; &#49464;&#49496; ID &#49373;&#49457;&#44592; &#53364;&#47000;&#49828;&#47564; &#54728;&#50857;&#46104;&#47728;, &#53364;&#47084;&#49828;&#53552;&#51032; &#47784;&#46304; &#51064;&#49828;&#53556;&#49828;&#45716; &#49464;&#49496; &#53412; &#52649;&#46028;&#51060; &#48156;&#49373;&#54616;&#51648; &#50506;&#46020;&#47197; &#46041;&#51068;&#54620; &#49464;&#49496; ID &#49373;&#49457;&#44592;&#47484; &#49324;&#50857;&#54644;&#50556; &#54633;&#45768;&#45796;. &#51060; &#53364;&#47000;&#49828;&#45716; &#50528;&#54540;&#47532;&#52992;&#51060;&#49496; &#49436;&#48260;&#51032; &#53364;&#47000;&#49828; &#44221;&#47196;&#50640; &#51080;&#50612;&#50556; &#54633;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51088; &#51221;&#51032; &#53364;&#47000;&#49828;&#45716; &#49444;&#51221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#52628;&#44032; &#49549;&#49457;</dt>
<dd>
<p>&#49464;&#49496; &#44288;&#47532;&#51088;&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51077;&#45768;&#45796;. GlassFish Server&#50640;&#49436;&#45716; &#49464;&#49496; &#44288;&#47532;&#51088;&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51012; &#51221;&#51032;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref97" name="sthref97"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-webcontainergeneral.html">&#50937; &#52968;&#53580;&#51060;&#45320;&#51032; &#51068;&#48152; &#49549;&#49457;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-webcontainersessiontimeout.html">&#50937; &#52968;&#53580;&#51060;&#45320;&#51032; &#49464;&#49496; &#49549;&#49457;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-webcontainermanagerprops.html">&#50937; &#52968;&#53580;&#51060;&#45320;&#51032; &#44288;&#47532;&#51088; &#49549;&#49457;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-webcontainerstoreprops.html">&#50937; &#52968;&#53580;&#51060;&#45320;&#51032; &#51200;&#51109;&#49548; &#49549;&#49457;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-webcontaineravailability.html">&#50937; &#52968;&#53580;&#51060;&#45320; &#44032;&#50857;&#49457; &#49444;&#51221;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref98" name="sthref98"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<p>&#50630;&#51020;</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
