<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-virtualserveredit" name="ref-virtualserveredit"></a></p>

<h4><a id="sthref127" name="sthref127"></a>&#44032;&#49345; &#49436;&#48260; &#54200;&#51665;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#44032;&#49345; &#49436;&#48260; &#54200;&#51665;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#44032;&#49345; &#49436;&#48260;&#51032; &#49444;&#51221;&#51012; &#49688;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>[&#44032;&#49345; &#49436;&#48260; &#54200;&#51665;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44592;&#48376;&#44050; &#47196;&#46300;</dt>
<dd>
<p>&#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#45716; &#49444;&#51221;&#51012; &#44592;&#48376;&#44050;&#51004;&#47196; &#48373;&#50896;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#49444;&#51221;&#51008; &#48320;&#44221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#44396;&#49457; &#51060;&#47492;</dt>
<dd>
<p>&#51060; &#54168;&#51060;&#51648;&#51032; &#49444;&#51221;&#51060; &#51201;&#50857;&#46104;&#45716; &#44396;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>ID</dt>
<dd>
<p>&#45236;&#48512;&#51201;&#51004;&#47196; &#54364;&#49884;&#46104;&#45716; &#44032;&#49345; &#49436;&#48260; &#49885;&#48324;&#51088;&#51077;&#45768;&#45796;. HTTP &#53364;&#46972;&#51060;&#50616;&#53944;&#50640;&#45716; &#45432;&#52636;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;. HTTP &#53364;&#46972;&#51060;&#50616;&#53944;&#50640; &#45432;&#52636;&#46104;&#45716; &#54840;&#49828;&#53944; &#51060;&#47492;&#51008; [&#54840;&#49828;&#53944;] &#54596;&#46300;&#50640;&#49436; &#51648;&#51221;&#54644;&#50556; &#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#54840;&#49828;&#53944;</dt>
<dd>
<p>&#49436;&#48260;&#44032; &#49892;&#54665;&#46104;&#44256; &#51080;&#45716; &#49884;&#49828;&#53596;&#51032; &#54840;&#49828;&#53944; &#51060;&#47492;&#51077;&#45768;&#45796;. &#45348;&#53944;&#50892;&#53356;&#51032; DNS &#49436;&#48260;(UNIX &#49884;&#49828;&#53596;&#51032; &#44221;&#50864; <code>/etc/hosts</code> &#54028;&#51068;)&#50640; &#46321;&#47197;&#46108; &#49892;&#51228; &#46608;&#45716; &#44032;&#49345; &#54840;&#49828;&#53944; &#51060;&#47492;&#51012; &#49324;&#50857;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; &#49884;&#49828;&#53596; &#49549;&#49457;&#44050; <code>${com.sun.aas.hostName}</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49345;&#53468;</dt>
<dd>
<p>&#49436;&#48260;&#50640; &#45824;&#54644; &#50896;&#54616;&#45716; &#49345;&#53468;&#51077;&#45768;&#45796;. &#45796;&#51020;&#44284; &#44057;&#51008; &#44050;&#51012; &#49324;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#53020;&#44592;</dt>
<dd>
<p>&#44032;&#49345; &#49436;&#48260;&#44032; &#54876;&#49457;&#54868;&#46121;&#45768;&#45796;. &#51060; &#44050;&#51008; &#44592;&#48376;&#44050;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#45124;&#44592;</dt>
<dd>
<p>&#44032;&#49345; &#49436;&#48260;&#44032; &#48708;&#54876;&#49457;&#54868;&#46121;&#45768;&#45796;. &#49436;&#48260;&#50640; &#50529;&#49464;&#49828;&#54616;&#47140; &#54616;&#47732; &#50724;&#47448; &#53076;&#46300; 404(&#49324;&#50857; &#44032;&#45733;&#54620; &#47532;&#49548;&#49828; &#50630;&#51020;)&#44032; &#48152;&#54872;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#49324;&#50857; &#50504;&#54632;</dt>
<dd>
<p>&#44032;&#49345; &#49436;&#48260;&#44032; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;. &#49436;&#48260;&#50640; &#50529;&#49464;&#49828;&#54616;&#47140; &#54616;&#47732; &#50724;&#47448; &#53076;&#46300; 403(&#50836;&#52397; &#49688;&#54665; &#44144;&#48512;)&#51060; &#48152;&#54872;&#46121;&#45768;&#45796;.</p>
</dd>
</dl>
</dd>
<dt>SSO</dt>
<dd>
<p>Single Sign-On &#46041;&#51089;&#51060; HTTP &#49436;&#48708;&#49828;&#50640;&#49436; &#49345;&#49549;&#46104;&#45716;&#51648; &#50668;&#48512;(&#49324;&#50857;/&#49324;&#50857; &#50504;&#54632;)&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; &#47196;&#44613;&#51008; HTTP &#49436;&#48708;&#49828;&#50640;&#49436; &#49345;&#49549;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; &#46041;&#51068;&#54620; &#50689;&#50669;&#50640; &#45824;&#54644; &#44396;&#49457;&#46108; &#51060; &#44032;&#49345; &#49436;&#48260;&#51032; &#50937; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#45824;&#54644; Single Sign-On&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51060; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#51060; &#44032;&#49345; &#49436;&#48260;&#50640; &#45824;&#54644; Single Sign-On&#51060; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#44256; &#49324;&#50857;&#51088;&#45716; &#44032;&#49345; &#49436;&#48260;&#51032; &#47784;&#46304; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#44060;&#48324;&#51201;&#51004;&#47196; &#51064;&#51613;&#54644;&#50556; &#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;</dt>
<dd>
<p>&#51060; &#49436;&#48260;&#50752; &#50672;&#44288;&#46108; &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#44592;&#48376; &#50937; &#47784;&#46280;</dt>
<dd>
<p>&#44032;&#49345; &#49436;&#48260;&#50640; &#48176;&#52824;&#46108; &#45796;&#47480; &#50937; &#47784;&#46280;&#50640; &#47588;&#54609;&#46112; &#49688; &#50630;&#45716; &#47784;&#46304; &#50836;&#52397;&#50640; &#51025;&#45813;&#54624; &#48176;&#52824;&#46108; &#50937; &#47784;&#46280;(&#51080;&#45716; &#44221;&#50864;)&#51077;&#45768;&#45796;. &#44592;&#48376; &#50937; &#47784;&#46280;&#51060; &#51648;&#51221;&#46104;&#51648; &#50506;&#51008; &#44221;&#50864; &#48712; &#52968;&#53581;&#49828;&#53944; &#47336;&#53944;&#44032; &#51080;&#45716; &#50937; &#47784;&#46280;&#51060; &#49324;&#50857;&#46121;&#45768;&#45796;. &#48712; &#52968;&#53581;&#49828;&#53944; &#47336;&#53944;&#44032; &#51080;&#45716; &#50937; &#47784;&#46280;&#51060; &#50630;&#51012; &#46412;&#45716; &#49884;&#49828;&#53596; &#44592;&#48376; &#50937; &#47784;&#46280;&#51060; &#49373;&#49457;&#46104;&#50612; &#49324;&#50857;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#47196;&#44536; &#54028;&#51068;</dt>
<dd>
<p>&#51060; &#44032;&#49345; &#49436;&#48260;&#47196;&#48512;&#53552;&#51032; &#47196;&#44613; &#47700;&#49884;&#51648;&#44032; &#45208;&#53440;&#45216; &#54028;&#51068;&#51032; &#44221;&#47196; &#51060;&#47492;&#51077;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; &#47196;&#44613; &#47700;&#49884;&#51648;&#45716; domain-dir<code>/logs/server.log</code>&#50640; &#45208;&#53440;&#45225;&#45768;&#45796;.</p>
</dd>
<dt>Docroot</dt>
<dd>
<p>&#49436;&#48260;&#50640; &#45824;&#54620; &#47336;&#53944; &#47928;&#49436; &#46356;&#47113;&#53664;&#47532;&#51032; &#51208;&#45824; &#44221;&#47196;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; domain-dir<code>/docroot</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#50529;&#49464;&#49828; &#47196;&#44613;</dt>
<dd>
<p>&#50529;&#49464;&#49828; &#47196;&#44613;&#51060; HTTP &#49436;&#48708;&#49828;&#50640;&#49436; &#49345;&#49549;&#46104;&#45716;&#51648; &#50668;&#48512;(&#49324;&#50857;/&#49324;&#50857; &#50504;&#54632;)&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; &#47196;&#44613;&#51008; HTTP &#49436;&#48708;&#49828;&#50640;&#49436; &#49345;&#49549;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#46356;&#47113;&#53664;&#47532;</dt>
<dd>
<p>&#49436;&#48260; &#50529;&#49464;&#49828; &#47196;&#44536;&#51032; &#51208;&#45824; &#46356;&#47113;&#53664;&#47532; &#44221;&#47196;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; domain-dir<code>/logs/access</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52628;&#44032; &#49549;&#49457;</dt>
<dd>
<p>&#44032;&#49345; &#49436;&#48260;&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51077;&#45768;&#45796;.</p>
<p>&#49324;&#50857; &#44032;&#45733;&#54620; &#49549;&#49457;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="ref-virtualserverprops.html">&#44032;&#49345; &#49436;&#48260; &#44288;&#47144; &#49549;&#49457;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</dd>
</dl>
<a id="sthref128" name="sthref128"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-virtualservercreate.html">&#44032;&#49345; &#49436;&#48260;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-virtualserveredit.html">&#44032;&#49345; &#49436;&#48260;&#47484; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-virtualserverdelete.html">&#44032;&#49345; &#49436;&#48260;&#47484; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref129" name="sthref129"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00062"><code>create-virtual-server</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00207"><code>list-virtual-servers</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00113"><code>delete-virtual-server</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
