<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-virtualserverprops" name="ref-virtualserverprops"></a></p>

<h4><a id="sthref125" name="sthref125"></a><a id="sthref126" name="sthref126"></a>&#44032;&#49345; &#49436;&#48260; &#44288;&#47144; &#49549;&#49457;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#44032;&#49345; &#49436;&#48260;&#50640; &#49324;&#50857;&#54624; &#49688; &#51080;&#45716; &#52628;&#44032; &#49549;&#49457;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt><code>sso-max-inactive-seconds</code></dt>
<dd>
<p>&#53364;&#46972;&#51060;&#50616;&#53944; &#51089;&#50629;&#51060; &#49688;&#49888;&#46104;&#51648; &#50506;&#51012; &#44221;&#50864; &#49324;&#50857;&#51088;&#51032; Single Sign-On &#47112;&#53076;&#46300;&#47484; &#51228;&#44144;&#54624; &#49688; &#51080;&#45716; &#44221;&#44284; &#49884;&#44036;(&#52488; &#45800;&#50948;)&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. Single Sign-On&#51008; &#44057;&#51008; &#44032;&#49345; &#49436;&#48260;&#50640; &#51080;&#45716; &#50668;&#47084; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#51201;&#50857;&#46104;&#48064;&#47196; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#51473; &#54616;&#45208;&#50640; &#50529;&#49464;&#49828;&#54616;&#47732; Single Sign-On &#47112;&#53076;&#46300;&#44032; &#54876;&#49457; &#49345;&#53468;&#47484; &#50976;&#51648;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; 300&#52488;(5&#48516;)&#51077;&#45768;&#45796;. &#51060; &#44050;&#51060; &#45458;&#51012;&#49688;&#47197; &#49324;&#50857;&#51088;&#50640; &#45824;&#54620; Single Sign-On &#51648;&#49549; &#49884;&#44036;&#51060; &#44600;&#50612;&#51648;&#51648;&#47564; &#49436;&#48260;&#51032; &#47700;&#47784;&#47532; &#49324;&#50857;&#47049;&#51008; &#47566;&#50500;&#51665;&#45768;&#45796;.</p>
</dd>
<dt><code>sso-reap-interval-seconds</code></dt>
<dd>
<p>&#47564;&#47308;&#46108; Single Sign-On &#47112;&#53076;&#46300;&#51032; &#51228;&#44144; &#44036;&#44201;(&#52488; &#45800;&#50948;)&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; 60&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>ssoCookieSecure</code></dt>
<dd>
<p>&#51060; &#44032;&#49345; &#49436;&#48260;&#50640; &#48176;&#52824;&#46108; &#50937; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#44284; &#50672;&#44288;&#46108; <code>JSESSIONIDSSO</code> &#53216;&#53412;&#51032; <code>Secure</code> &#49549;&#49457;&#51012; &#49444;&#51221;&#54633;&#45768;&#45796;. &#51060; &#49549;&#49457;&#51008; Single Sign-On&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54620; &#44221;&#50864;&#50640;&#47564; &#51201;&#50857;&#46121;&#45768;&#45796;. &#54728;&#50857;&#46104;&#45716; &#44050;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt><code>true</code></dt>
<dd>
<p><code>Secure</code>&#47484; true&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
</dd>
<dt><code>false</code></dt>
<dd>
<p><code>Secure</code>&#47484; false&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
</dd>
<dt><code>dynamic</code></dt>
<dd>
<p><code>JSESSIONIDSSO</code> &#53216;&#53412;&#45716; SSO&#50640; &#52280;&#50668;&#54616;&#45716; &#52395;&#48264;&#51704; &#49464;&#49496;&#51032; <code>Secure</code> &#49444;&#51221;&#51012; &#49345;&#49549;&#54633;&#45768;&#45796;.</p>
</dd>
</dl>
<p><code>JSESSIONID</code> &#53216;&#53412;&#51032; Secure &#49549;&#49457;&#51012; &#49444;&#51221;&#54616;&#47140;&#47732; <code>sun-web.xml</code> &#54028;&#51068;&#50640;&#49436; <code>cookieSecure</code> <code>cookie-properties</code> &#49549;&#49457;&#51012; &#49324;&#50857;&#54633;&#45768;&#45796;. &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00130"><i>Oracle GlassFish Server Application Deployment Guide</i>&#51032; <i>cookie-properties</i></a>&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</dd>
<dt><code>setCacheControl</code></dt>
<dd>
<p><code>Cache-Control</code> &#51025;&#45813; &#51648;&#49884;&#50612;&#51032; &#53092;&#47560;&#47196; &#44396;&#48516;&#46108; &#47785;&#47197;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. &#51201;&#54633;&#54620; &#51648;&#49884;&#50612; &#47785;&#47197;&#51008; http://www.ietf.org/rfc/rfc2616.txt (<code><a href="http://www.ietf.org/rfc/rfc2616.txt">http://www.ietf.org/rfc/rfc2616.txt</a></code>)&#50640; &#51080;&#45716; &#47928;&#49436;&#51032; Section 14.9&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</dd>
<dt><code>accessLogBufferSize</code></dt>
<dd>
<p>&#50529;&#49464;&#49828; &#47196;&#44536; &#54840;&#52636;&#51060; &#51200;&#51109;&#46104;&#45716; &#48260;&#54140;&#51032; &#53356;&#44592;(&#48148;&#51060;&#53944;)&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;. &#44050;&#51060; 5120&#48372;&#45796; &#51089;&#51004;&#47732; &#44221;&#44256; &#47700;&#49884;&#51648;&#44032; &#54364;&#49884;&#46104;&#44256; &#44050;&#51060; 5120&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 32768&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>accessLogWriterInterval</code></dt>
<dd>
<p>&#47196;&#44536;&#44032; &#46356;&#49828;&#53356;&#50640; &#44592;&#47197;&#46104;&#44592; &#51204;&#44620;&#51648;&#51032; &#49884;&#44036;(&#52488;)&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. &#50529;&#49464;&#49828; &#47196;&#44536;&#45716; &#48260;&#54140;&#44032; &#44032;&#46301; &#52264;&#44144;&#45208; &#44036;&#44201;&#51060; &#47564;&#47308;&#46104;&#47732; &#44592;&#47197;&#46121;&#45768;&#45796;. &#44050;&#51060; 0&#51060;&#47732; &#48260;&#54140;&#44032; &#44032;&#46301; &#52264;&#51648; &#50506;&#45908;&#46972;&#46020; &#54637;&#49345; &#44592;&#47197;&#46121;&#45768;&#45796;. &#51593;, &#49436;&#48260;&#50640; &#50529;&#49464;&#49828;&#54624; &#46412;&#47560;&#45796; &#47196;&#44536; &#47700;&#49884;&#51648;&#44032; &#51649;&#51217; &#54028;&#51068;&#50640; &#51200;&#51109;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 300&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>allowRemoteAddress</code></dt>
<dd>
<p>&#50896;&#44201; &#53364;&#46972;&#51060;&#50616;&#53944;&#51032; IP &#51452;&#49548;&#47484; &#48708;&#44368;&#54616;&#45716; &#51221;&#44508; &#54364;&#54788;&#49885; &#54056;&#53556;&#51032; &#53092;&#47560;&#47196; &#44396;&#48516;&#46108; &#47785;&#47197;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. &#51060; &#49549;&#49457;&#51060; &#51648;&#51221;&#46108; &#44221;&#50864; &#50836;&#52397;&#51060; &#49849;&#51064;&#46104;&#47140;&#47732; &#50896;&#44201; &#51452;&#49548;&#44032; <i>&#48152;&#46300;&#49884;</i> &#51068;&#52824;&#54644;&#50556; &#54633;&#45768;&#45796;. &#51060; &#49549;&#49457;&#51060; &#51648;&#51221;&#46104;&#51648; &#50506;&#51008; &#44221;&#50864;&#50640;&#45716; &#50896;&#44201; &#51452;&#49548;&#44032; <code>denyRemoteAddress</code> &#54056;&#53556;&#44284; &#51068;&#52824;&#54616;&#51648; <i>&#50506;&#45716; &#54620;</i> &#47784;&#46304; &#50836;&#52397;&#51060; &#49849;&#51064;&#46121;&#45768;&#45796;.</p>
</dd>
<dt><code>denyRemoteAddress</code></dt>
<dd>
<p>&#50896;&#44201; &#53364;&#46972;&#51060;&#50616;&#53944;&#51032; IP &#51452;&#49548;&#47484; &#48708;&#44368;&#54616;&#45716; &#51221;&#44508; &#54364;&#54788;&#49885; &#54056;&#53556;&#51032; &#53092;&#47560;&#47196; &#44396;&#48516;&#46108; &#47785;&#47197;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. &#51060; &#49549;&#49457;&#51060; &#51648;&#51221;&#46108; &#44221;&#50864; &#50836;&#52397;&#51060; &#49849;&#51064;&#46104;&#47140;&#47732; &#50896;&#44201; &#51452;&#49548;&#44032; &#51060; &#50836;&#52397;&#44284; &#51068;&#52824;&#54616;&#51648; <i>&#50506;&#50500;&#50556;</i> &#54633;&#45768;&#45796;. &#49549;&#49457;&#51060; &#51648;&#51221;&#46104;&#51648; &#50506;&#51008; &#44221;&#50864;&#50640;&#45716; <code>allowRemoteAddress</code> &#49549;&#49457;&#50640; &#46384;&#46972;&#49436;&#47564; &#50836;&#52397; &#49849;&#51064; &#50668;&#48512;&#44032; &#44208;&#51221;&#46121;&#45768;&#45796;.</p>
</dd>
<dt><code>allowRemoteHost</code></dt>
<dd>
<p>&#50896;&#44201; &#53364;&#46972;&#51060;&#50616;&#53944;&#51032; &#54840;&#49828;&#53944; &#51060;&#47492;(<code>[java.net.]Socket.getInetAddress().getHostName()</code>&#50640;&#49436; &#48152;&#54872;&#46120;)&#44284; &#48708;&#44368;&#46112; &#53092;&#47560;&#47196; &#44396;&#48516;&#46108; &#51221;&#44508; &#54364;&#54788;&#49885; &#54056;&#53556; &#47785;&#47197;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. &#51060; &#49549;&#49457;&#51060; &#51648;&#51221;&#46108; &#44221;&#50864; &#50836;&#52397;&#51060; &#49849;&#51064;&#46104;&#47140;&#47732; &#50896;&#44201; &#54840;&#49828;&#53944; &#51060;&#47492;&#51060; <i>&#48152;&#46300;&#49884;</i> &#51068;&#52824;&#54644;&#50556; &#54633;&#45768;&#45796;. &#51060; &#49549;&#49457;&#51060; &#51648;&#51221;&#46104;&#51648; &#50506;&#51008; &#44221;&#50864;&#50640;&#45716; &#50896;&#44201; &#54840;&#49828;&#53944; &#51060;&#47492;&#51060; <code>denyRemoteHost</code> &#54056;&#53556;&#44284; &#51068;&#52824;&#54616;&#51648; <i>&#50506;&#45716; &#54620;</i> &#47784;&#46304; &#50836;&#52397;&#51060; &#49849;&#51064;&#46121;&#45768;&#45796;.</p>
</dd>
<dt><code>denyRemoteHost</code></dt>
<dd>
<p>&#50896;&#44201; &#53364;&#46972;&#51060;&#50616;&#53944;&#51032; &#54840;&#49828;&#53944; &#51060;&#47492;(<code>[java.net.]Socket.getInetAddress().getHostName()</code>&#50640;&#49436; &#48152;&#54872;&#46120;)&#44284; &#48708;&#44368;&#46112; &#53092;&#47560;&#47196; &#44396;&#48516;&#46108; &#51221;&#44508; &#54364;&#54788;&#49885; &#54056;&#53556; &#47785;&#47197;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. &#51060; &#49549;&#49457;&#51060; &#51648;&#51221;&#46108; &#44221;&#50864; &#50836;&#52397;&#51060; &#49849;&#51064;&#46104;&#47140;&#47732; &#50896;&#44201; &#54840;&#49828;&#53944; &#51060;&#47492;&#51060; &#51060; &#50836;&#52397;&#44284; &#51068;&#52824;&#54616;&#51648; <i>&#50506;&#50500;&#50556;</i> &#54633;&#45768;&#45796;. &#49549;&#49457;&#51060; &#51648;&#51221;&#46104;&#51648; &#50506;&#51008; &#44221;&#50864;&#50640;&#45716; <code>allowRemoteHost</code> &#49549;&#49457;&#50640; &#46384;&#46972;&#49436;&#47564; &#50836;&#52397; &#49849;&#51064; &#50668;&#48512;&#44032; &#44208;&#51221;&#46121;&#45768;&#45796;.</p>
<p>JK &#47532;&#49828;&#45320; &#50741;&#49496;&#51012; &#49324;&#50857;&#54616;&#45716; &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#47484; &#53685;&#54644; GlassFish Server &#46020;&#47700;&#51064;&#50640; &#50529;&#49464;&#49828;&#54616;&#45716; &#44221;&#50864;&#50640;&#45716; &#51060; &#49549;&#49457;&#51012; &#49444;&#51221;&#54644;&#46020; &#54952;&#44284;&#44032; &#50630;&#49845;&#45768;&#45796;.</p>
</dd>
<dt><code>authRealm</code></dt>
<dd>
<p>&#51060; &#44032;&#49345; &#49436;&#48260;&#50640; &#48176;&#52824;&#46108; &#46021;&#47549;&#54805; &#50937; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51032; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828; &#44592;&#48376; &#50689;&#50669;&#51012; &#45824;&#52404;&#54616;&#45716; &#51064;&#51613; &#50689;&#50669;&#51032; &#51060;&#47492;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. &#46021;&#47549;&#54805; &#50937; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51032; <code>web.xml</code> &#54028;&#51068;&#50640; &#51221;&#51032;&#46108; &#50689;&#50669;&#51008; &#44032;&#49345; &#49436;&#48260;&#51032; &#50689;&#50669;&#51012; &#45824;&#52404;&#54633;&#45768;&#45796;. &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="../../../common/en/help/ref-realms.html">&#50689;&#50669;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</dd>
<dt><code>securePagesWithPragma</code></dt>
<dd>
<p>&#51060; &#44032;&#49345; &#49436;&#48260;&#50640; &#51080;&#45716; &#47784;&#46304; &#50937; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; Internet Explorer&#50640;&#49436; SSL&#51012; &#53685;&#54644; &#51228;&#45824;&#47196; &#45796;&#50868;&#47196;&#46300;&#46104;&#44172; &#54616;&#47140;&#47732; &#51060; &#49549;&#49457;&#51012; <code>false</code>&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#44060;&#48324; &#50937; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640;&#49436;&#45716; <code>sun-web.xml</code> &#54028;&#51068;&#51032; <code>sun-web-app</code> &#50836;&#49548;&#47484; &#49324;&#50857;&#54616;&#50668; &#51060; &#49444;&#51221;&#51012; &#45824;&#52404;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>Oracle GlassFish Server Application Deployment Guide</i>&#51032; <i>glassfish-web-app</i></a>&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
<p>&#44592;&#48376;&#44050;&#51008; <code>true</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>alternatedocroot_</code><i>n</i></dt>
<dd>
<p>&#45824;&#52404; &#47928;&#49436; &#47336;&#53944;(docroot)&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;. &#50668;&#44592;&#49436; <i>n</i>&#51008; &#44050;&#51012; &#46160; &#44060; &#51060;&#49345; &#51648;&#51221;&#54624; &#49688; &#51080;&#44172; &#54644; &#51452;&#45716; &#50577;&#51032; &#51221;&#49688;&#51077;&#45768;&#45796;. &#45824;&#52404; docroot&#47484; &#49324;&#50857;&#54616;&#47732; &#50937; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51032; &#45824;&#52404; docroot&#50640; &#51080;&#45716; URI &#54056;&#53556; &#54616;&#45208; &#51060;&#49345;&#44284; &#50836;&#52397;&#51060; &#51068;&#52824;&#54616;&#45716;&#51648; &#50668;&#48512;&#50640; &#46384;&#46972; docroot &#50808;&#48512;&#50640;&#49436; &#50724;&#45716; &#47751;&#47751; &#47532;&#49548;&#49828; &#50836;&#52397;&#51012; &#52376;&#47532;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#50836;&#52397;&#51060; &#45824;&#52404; docroot&#51032; URI &#54056;&#53556;&#44284; &#51068;&#52824;&#54616;&#47732; &#45824;&#52404; docroot&#51032; &#49892;&#51228; &#50948;&#52824;(&#46356;&#47113;&#53664;&#47532;)&#50640; &#50836;&#52397; URI(&#50937; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51032; &#52968;&#53581;&#49828;&#53944; &#47336;&#53944;&#45716; &#51228;&#50808;)&#47484; &#52628;&#44032;&#54616;&#50668; &#45824;&#52404; docroot&#50640; &#47588;&#54609;&#46121;&#45768;&#45796;. &#50836;&#52397;&#51060; &#50668;&#47084; URI &#54056;&#53556;&#44284; &#51068;&#52824;&#54616;&#45716; &#44221;&#50864;&#50640;&#45716; &#45796;&#51020;&#44284; &#44057;&#51008; &#50864;&#49440;&#49692;&#50948;&#50640; &#46384;&#46972; &#45824;&#52404; docroot&#44032; &#44208;&#51221;&#46121;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#51221;&#54869;&#54616;&#44172; &#51068;&#52824;</p>
</li>
<li>
<p>&#44032;&#51109; &#44596; &#44221;&#47196; &#51068;&#52824;</p>
</li>
<li>
<p>&#54869;&#51109;&#51088; &#51068;&#52824;</p>
</li>
</ul>
<p>&#50696;&#47484; &#46308;&#50612; &#45796;&#51020; &#49549;&#49457;&#51008; &#49464; &#44060;&#51032; &#45824;&#52404; docroot&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;. &#52395;&#48264;&#51704; &#45824;&#52404; docroot&#51032; URI &#54056;&#53556;&#50640;&#49436;&#45716; &#51221;&#54869;&#54616;&#44172; &#51068;&#52824;&#47484; &#49324;&#50857;&#54616;&#44256;, &#46160;&#48264;&#51704; &#48143; &#49464;&#48264;&#51704; &#45824;&#52404; docroot&#51032; URI &#54056;&#53556;&#50640;&#49436;&#45716; &#54869;&#51109;&#51088;&#50752; &#44032;&#51109; &#44596; &#44221;&#47196; &#51068;&#52824;&#47484; &#44033;&#44033; &#49324;&#50857;&#54633;&#45768;&#45796;.</p>
<pre>
&lt;property name="alternatedocroot_1" 
   value="from=/my.jpg dir=/srv/images/jpg"
&lt;property name="alternatedocroot_2" 
   value="from=*.jpg dir=/srv/images/jpg"
&lt;property name="alternatedocroot_3" 
   value="from=/jpg/* dir=/src/images"
</pre>
<p>&#44033; &#45824;&#52404; docroot&#51032; <code>value</code>&#50640;&#45716; &#46160; &#44032;&#51648; &#44396;&#49457; &#50836;&#49548;&#44032; &#51080;&#49845;&#45768;&#45796;. &#52395;&#48264;&#51704; &#44396;&#49457; &#50836;&#49548;&#51064; <code>from</code>&#51008; &#45824;&#52404; docroot&#51032; URI &#54056;&#53556;&#51012; &#51648;&#51221;&#54616;&#44256; &#46160;&#48264;&#51704; &#44396;&#49457; &#50836;&#49548;&#51064; <code>dir</code>&#51008; &#45824;&#52404; docroot&#51032; &#49892;&#51228; &#50948;&#52824;(&#46356;&#47113;&#53664;&#47532;)&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;. <code>dir</code> &#44396;&#49457; &#50836;&#49548;&#50640;&#45716; &#44277;&#48177;&#51012; &#49324;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#44060;&#48324; &#50937; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640;&#49436;&#45716; <code>sun-web.xml</code> &#54028;&#51068;&#51032; <code>sun-web-app</code> &#50836;&#49548;&#47484; &#49324;&#50857;&#54616;&#50668; &#51060; &#49444;&#51221;&#51012; &#45824;&#52404;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>Oracle GlassFish Server Application Deployment Guide</i>&#51032; <i>glassfish-web-app</i></a>&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</dd>
<dt><code>contextXmlDefault</code></dt>
<dd>
<p>&#51060; &#44032;&#49345; &#49436;&#48260;&#50640; &#45824;&#54644; <code>context.xml</code> &#54028;&#51068;&#51012; &#49324;&#50857;&#54616;&#45716; &#44221;&#50864; domain-dir&#50640; &#45824;&#54620; &#49345;&#45824; &#50948;&#52824;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;. <code>context.xml</code> &#54028;&#51068;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; The Context Container(<code><a href="http://tomcat.apache.org/tomcat-5.5-doc/config/context.html">http://tomcat.apache.org/tomcat-5.5-doc/config/context.html</a></code>)&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</dd>
<dt><code>allowLinking</code></dt>
<dd>
<p><code>true</code>&#51060;&#47732; &#44592;&#54840; &#47553;&#53356;&#51064; &#47532;&#49548;&#49828;&#44032; &#51060; &#44032;&#49345; &#49436;&#48260;&#50640; &#48176;&#52824;&#46108; &#47784;&#46304; &#50937; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#45824;&#54644; &#51089;&#46041;&#54633;&#45768;&#45796;. <code>sun-web.xml</code> &#54028;&#51068;&#51032; <code>sun-web-app</code> &#49549;&#49457; <code>allowLinking</code>&#51012; &#49324;&#50857;&#54616;&#50668; &#44060;&#48324; &#50937; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#51060; &#49444;&#51221;&#51012; &#45824;&#52404;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<pre>
&lt;sun-web-app&gt;
   &lt;property name="allowLinking" 
      value="{true|false}"
&lt;/sun-web-app&gt;
</pre>
<p>&#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>Oracle GlassFish Server Application Deployment Guide</i>&#51032; <i>glassfish-web-app</i></a>&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
<p>&#44592;&#48376;&#44050;&#51008; <code>false</code>&#51077;&#45768;&#45796;.</p>

<hr>
<p><b>&#51452;&#51032;:</b></p>
Windows &#49884;&#49828;&#53596;&#50640;&#49436; &#51060; &#49549;&#49457;&#51012; true&#47196; &#49444;&#51221;&#54616;&#47732; JSP &#49548;&#49828; &#53076;&#46300;&#44032; &#45432;&#52636;&#46121;&#45768;&#45796;.
<hr>

</dd>
<dt><code>send-error_</code><i>n</i></dt>
<dd>
<p>&#44032;&#49345; &#49436;&#48260;&#50640; &#48176;&#52824;&#46108; &#47784;&#46304; &#50937; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640;&#49436; &#49345;&#49549;&#54616;&#45716; &#44032;&#49345; &#49436;&#48260;&#51032; &#49324;&#50857;&#51088; &#51221;&#51032; &#50724;&#47448; &#54168;&#51060;&#51648; &#47588;&#54609;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. &#50937; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640;&#49436;&#45716; <code>web.xml</code> &#48176;&#52824; &#44592;&#49696;&#51088;&#50640;&#49436; &#51060;&#47084;&#54620; &#49324;&#50857;&#51088; &#51221;&#51032; &#50724;&#47448; &#54168;&#51060;&#51648; &#47588;&#54609;&#51012; &#45824;&#52404;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#44033; <code>send-error_</code><i>n</i> &#49549;&#49457;&#51032; &#44050;&#50640;&#45716; &#49464; &#44032;&#51648; &#44396;&#49457; &#50836;&#49548;&#44032; &#51080;&#51004;&#47728; &#44033;&#44033; &#50612;&#46500; &#49692;&#49436;&#47196;&#46304; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#52395;&#48264;&#51704; &#44396;&#49457; &#50836;&#49548;&#51064; <code>code</code>&#45716; &#51025;&#45813;&#50640; &#49324;&#50857;&#51088; &#51221;&#51032; &#50724;&#47448; &#54168;&#51060;&#51648;&#47484; &#48152;&#54872;&#54616;&#45716; &#49464; &#44032;&#51648; HTTP &#51025;&#45813; &#49345;&#53468; &#53076;&#46300;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#46160;&#48264;&#51704; &#44396;&#49457; &#50836;&#49548;&#51064; <code>path</code>&#45716; &#49324;&#50857;&#51088; &#51221;&#51032; &#50724;&#47448; &#54168;&#51060;&#51648;&#51032; &#51208;&#45824; &#46608;&#45716; &#49345;&#45824; &#54028;&#51068; &#49884;&#49828;&#53596; &#44221;&#47196;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;. &#49345;&#45824; &#54028;&#51068; &#49884;&#49828;&#53596; &#44221;&#47196;&#45716; domain-dir<code>/config</code> &#46356;&#47113;&#53664;&#47532;&#50640; &#49345;&#45824;&#51201;&#51064; &#44050;&#51004;&#47196; &#54644;&#49437;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>&#49464;&#48264;&#51704; &#44396;&#49457; &#50836;&#49548;&#51064; <code>reason</code>&#51008; &#49440;&#53469;&#51201;&#51060;&#47728; <code>Unauthorized</code> &#46608;&#45716; <code>Forbidden</code>&#44284; &#44057;&#51060; &#48152;&#54872;&#46104;&#45716; &#51060;&#50976; &#47928;&#51088;&#50676;&#51032; &#53581;&#49828;&#53944;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
</li>
</ul>
<p>&#50696;&#47484; &#46308;&#47732; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<pre>
&lt;property name="send-error_1"
   value="code=401 path=/myhost/401.html reason=MY-401-REASON"
</pre>
<p>&#51060; &#50696;&#51228; &#49549;&#49457; &#51221;&#51032;&#50640;&#49436;&#45716; &#45796;&#51020; &#51025;&#45813; &#54665;&#44284; &#54632;&#44760; 401 &#51025;&#45813;&#44284; <code>/myhost/401.html</code>&#51032; &#45236;&#50857;&#51060; &#48152;&#54872;&#46104;&#44172; &#47564;&#46317;&#45768;&#45796;.</p>
<pre>
HTTP/1.1 401 MY-401-REASON
</pre></dd>
<dt><code>redirect_</code><i>n</i></dt>
<dd>
<p>&#51060;&#51204; URL&#50640; &#45824;&#54620; &#50836;&#52397;&#51060; &#49352; URL&#50640; &#45824;&#54620; &#50836;&#52397;&#51004;&#47196; &#52376;&#47532;&#46104;&#46020;&#47197; &#51648;&#51221;&#54633;&#45768;&#45796;. &#44032;&#49345; &#49436;&#48260;&#50640; &#48176;&#52824;&#46104;&#45716; &#47784;&#46304; &#50937; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640;&#49436; &#51060; &#49549;&#49457;&#51012; &#49345;&#49549;&#54633;&#45768;&#45796;. &#44033; <code>redirect_</code><i>n</i> &#49549;&#49457;&#51032; &#44050;&#50640;&#45716; &#46160; &#44032;&#51648; &#44396;&#49457; &#50836;&#49548;&#44032; &#51080;&#51004;&#47728; &#44033;&#44033; &#50612;&#46500; &#49692;&#49436;&#47196;&#46304; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#52395;&#48264;&#51704; &#44396;&#49457; &#50836;&#49548;&#51064; <code>from</code>&#51008; &#51068;&#52824;&#49884;&#53420; &#50836;&#52397;&#54620; URI&#51032; &#51217;&#46160;&#50612;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#46160;&#48264;&#51704; &#44396;&#49457; &#50836;&#49548;&#51064; <code>url-prefix</code>&#45716; &#53364;&#46972;&#51060;&#50616;&#53944;&#50640; &#48152;&#54872;&#54624; &#49352; URL &#51217;&#46160;&#50612;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;. <code>from</code> &#51217;&#46160;&#50612;&#45716; &#51060; URL &#51217;&#46160;&#50612;&#47196; &#45824;&#52404;&#46121;&#45768;&#45796;.</p>
</li>
</ul>
<p>&#50696;&#47484; &#46308;&#47732; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<pre>
&lt;property name="redirect_1" 
  value="from=/dummy url-prefix=http://etude"
</pre></dd>
<dt><code>valve_</code><i>n</i></dt>
<dd>
<p>&#49324;&#50857;&#51088; &#51221;&#51032; &#48184;&#48652;&#51032; &#51221;&#44508;&#54868;&#46108; &#53364;&#47000;&#49828; &#51060;&#47492;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. &#50668;&#44592;&#49436; <i>n</i>&#51008; &#46168; &#51060;&#49345;&#51032; &#49324;&#50577;&#51012; &#54728;&#50857;&#54616;&#45716; &#50577;&#51032; &#51221;&#49688;&#51077;&#45768;&#45796;. &#48184;&#48652; &#53364;&#47000;&#49828;&#45716; Tomcat &#46608;&#45716; &#51060;&#51204; GlassFish Server &#47540;&#47532;&#49828;&#51032; <code>org.apache.catalina.Valve</code> &#51064;&#53552;&#54168;&#51060;&#49828; &#46608;&#45716; &#54788;&#51116; GlassFish Server &#47540;&#47532;&#49828;&#51032; <code>org.glassfish.web.valve.GlassFishValve</code> &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#44396;&#54788;&#54644;&#50556; &#54633;&#45768;&#45796;. &#50696;&#47484; &#46308;&#47732; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<pre>
&lt;property name="valve_1"
value="org.glassfish.extension.Valve"
</pre>
<p>&#53945;&#51221; &#50937; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#45824;&#54644; &#51060; &#49549;&#49457;&#51012; &#49444;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>Oracle GlassFish Server Application Deployment Guide</i>&#51032; <i>glassfish-web-app</i></a>&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</dd>
<dt><code>listener_</code><i>n</i></dt>
<dd>
<p>&#49324;&#50857;&#51088; &#51221;&#51032; Catalina &#47532;&#49828;&#45320;&#51032; &#51221;&#44508;&#54868;&#46108; &#53364;&#47000;&#49828; &#51060;&#47492;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. &#50668;&#44592;&#49436; <i>n</i>&#51008; &#46168; &#51060;&#49345;&#51032; &#49324;&#50577;&#51012; &#54728;&#50857;&#54616;&#45716; &#50577;&#51032; &#51221;&#49688;&#51077;&#45768;&#45796;. &#47532;&#49828;&#45320; &#53364;&#47000;&#49828;&#45716; <code>org.apache.catalina.ContainerListener</code> &#46608;&#45716; <code>org.apache.catalina.LifecycleListener</code> &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#44396;&#54788;&#54644;&#50556; &#54633;&#45768;&#45796;. &#50696;&#47484; &#46308;&#47732; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<pre>
&lt;property name="listener_1"
value="org.glassfish.extension.MyLifecycleListener"
</pre>
<p>&#53945;&#51221; &#50937; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#45824;&#54644; &#51060; &#49549;&#49457;&#51012; &#49444;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>Oracle GlassFish Server Application Deployment Guide</i>&#51032; <i>glassfish-web-app</i></a>&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</dd>
<dt><code>errorReportValve</code></dt>
<dd>
<p>&#44032;&#49345; &#49436;&#48260;&#50640;&#49436; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#45824;&#54620; &#44592;&#48376; &#50724;&#47448; &#54168;&#51060;&#51648;&#47484; &#49373;&#49457;&#54616;&#45716; &#49324;&#50857;&#51088; &#51648;&#51221; &#48184;&#48652;&#51032; &#51221;&#44508;&#54868;&#46108; &#53364;&#47000;&#49828; &#51060;&#47492;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. &#48712; &#47928;&#51088;&#50676;&#51012; &#51648;&#51221;&#54616;&#50668; &#51060; &#44032;&#49345; &#49436;&#48260;&#50640; &#45824;&#54620; &#44592;&#48376; &#50724;&#47448; &#54168;&#51060;&#51648; &#48169;&#49885;&#51012; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
