<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-webcontaineravailability" name="ref-webcontaineravailability"></a></p>

<h4><a id="sthref78" name="sthref78"></a><a id="sthref79" name="sthref79"></a>&#50937; &#52968;&#53580;&#51060;&#45320; &#44032;&#50857;&#49457;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#50937; &#52968;&#53580;&#51060;&#45320; &#44032;&#50857;&#49457;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#50937; &#52968;&#53580;&#51060;&#45320; &#44032;&#50857;&#49457; &#49444;&#51221;&#51012; &#44396;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>[&#50937; &#52968;&#53580;&#51060;&#45320; &#44032;&#50857;&#49457;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44592;&#48376;&#44050; &#47196;&#46300;</dt>
<dd>
<p>&#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#45716; &#49444;&#51221;&#51012; &#44592;&#48376;&#44050;&#51004;&#47196; &#48373;&#50896;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#49444;&#51221;&#51008; &#48320;&#44221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#44396;&#49457; &#51060;&#47492;</dt>
<dd>
<p>&#51060; &#54168;&#51060;&#51648;&#51032; &#49444;&#51221;&#51060; &#51201;&#50857;&#46104;&#45716; &#44396;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#44032;&#50857;&#49457; &#49436;&#48708;&#49828;</dt>
<dd>
<p>[&#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#47732; &#50937; &#52968;&#53580;&#51060;&#45320;&#50640; &#45824;&#54644; &#44032;&#50857;&#49457;&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#51648;&#49549;&#49457; &#50976;&#54805;</dt>
<dd>
<p>&#51648;&#49549;&#49457; &#48169;&#49885;&#51060; &#49324;&#50857;&#46121;&#45768;&#45796;.</p>
<ul>
<li>
<p>[&#44032;&#50857;&#49457; &#49436;&#48708;&#49828; &#49324;&#50857;]&#51012; &#49440;&#53469;&#54616;&#51648; <i>&#50506;&#51008;</i> &#44221;&#50864;&#50640;&#45716; &#45796;&#51020; &#51473; &#54616;&#45208;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<ul>
<li>
<p><code>&#47700;&#47784;&#47532;</code> - &#49464;&#49496; &#51648;&#49549;&#49457;&#51060; &#50630;&#45716; &#44221;&#50864;</p>
</li>
<li>
<p><code>&#54028;&#51068;</code> - &#54637;&#49345; &#49324;&#50857; &#44032;&#45733;&#54616;&#51648; &#50506;&#51008; &#54028;&#51068; &#49884;&#49828;&#53596;&#51012; &#44592;&#48152;&#51004;&#47196; &#54620; &#49464;&#49496; &#51648;&#49549;&#49457;&#51032; &#44221;&#50864;</p>
</li>
</ul>
</li>
<li>
<p>[&#44032;&#50857;&#49457; &#49436;&#48708;&#49828; &#49324;&#50857;]&#51012; &#49440;&#53469;&#54620; &#44221;&#50864;&#50640;&#45716; &#44032;&#50857;&#49457;&#51060; &#45458;&#51008; &#53364;&#47084;&#49828;&#53552; &#48373;&#44396;&#47484; &#44592;&#48152;&#51004;&#47196; &#54620; &#49464;&#49496; &#51648;&#49549;&#49457;&#50640; &#45824;&#54644; <code>&#48373;&#51228;&#46120;</code>&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</li>
</ul>
</dd>
<dt>&#51648;&#49549;&#49457; &#48712;&#46020;</dt>
<dd>
<p>HTTP &#49464;&#49496;&#51012; &#51200;&#51109;&#54616;&#45716; &#48712;&#46020;&#45716; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<ul>
<li>
<p><code>web-method</code> &mdash; &#53364;&#46972;&#51060;&#50616;&#53944;&#50640; &#51025;&#45813;&#51012; &#45796;&#49884; &#51204;&#49569;&#54616;&#44592; &#51204;&#50640; &#44033; &#50937; &#50836;&#52397; &#45149;&#50640; &#49464;&#49496; &#49345;&#53468;&#44032; &#51200;&#51109;&#46121;&#45768;&#45796;. &#51060; &#47784;&#46300;&#45716; &#50724;&#47448; &#49884; &#49464;&#49496; &#49345;&#53468;&#51032; &#50756;&#48317;&#54620; &#50629;&#45936;&#51060;&#53944;&#47484; &#44032;&#51109; &#54869;&#49892;&#54616;&#44172; &#48372;&#51109;&#54633;&#45768;&#45796;. &#51060; &#44050;&#51008; &#44592;&#48376;&#44050;&#51077;&#45768;&#45796;.</p>
</li>
</ul>
</dd>
<dt>&#51648;&#49549;&#49457; &#48276;&#50948;</dt>
<dd>
<p>&#51200;&#51109;&#54616;&#45716; &#45936; &#54596;&#50836;&#54620; HTTP &#49464;&#49496; &#48320;&#44221; &#49324;&#54637;&#51032; &#48276;&#50948;&#45716; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<ul>
<li>
<p><code>session</code> &mdash; &#54637;&#49345; &#51204;&#52404; &#49464;&#49496; &#49345;&#53468;&#44032; &#51200;&#51109;&#46121;&#45768;&#45796;. &#51060; &#47784;&#46300;&#45716; &#48516;&#49328; &#44032;&#45733;&#54620; &#50937; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51032; &#44221;&#50864; &#49464;&#49496; &#45936;&#51060;&#53552;&#51032; &#51221;&#54869;&#54620; &#51200;&#51109;&#51012; &#44032;&#51109; &#54869;&#49892;&#54616;&#44172; &#48372;&#51109;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p><code>modified-session</code> &mdash; &#49688;&#51221;&#46108; &#44221;&#50864; &#51204;&#52404; &#49464;&#49496; &#49345;&#53468;&#44032; &#51200;&#51109;&#46121;&#45768;&#45796;. <code>HttpSession.setAttribute()</code> &#46608;&#45716; <code>HttpSession.removeAttribute()</code>&#47484; &#54840;&#52636;&#54620; &#44221;&#50864; &#49464;&#49496;&#51060; &#49688;&#51221;&#46108; &#44163;&#51004;&#47196; &#44036;&#51452;&#46121;&#45768;&#45796;. &#49549;&#49457;&#51012; &#48320;&#44221;&#54624; &#46412;&#47560;&#45796; <code>setAttribute()</code>&#47484; &#54840;&#52636;&#54616;&#46020;&#47197; &#54644;&#50556; &#54633;&#45768;&#45796;. &#51060;&#45716; Java EE &#49324;&#50577; &#50836;&#44396; &#49324;&#54637;&#51008; &#50500;&#45768;&#51648;&#47564; &#51060; &#47784;&#46300;&#44032; &#51228;&#45824;&#47196; &#51089;&#46041;&#54616;&#47140;&#47732; &#54596;&#50836;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p><code>modified-attribute</code> &mdash; &#49688;&#51221;&#46108; &#49464;&#49496; &#49549;&#49457;&#47564; &#51200;&#51109;&#46121;&#45768;&#45796;. &#51060; &#47784;&#46300;&#44032; &#51228;&#45824;&#47196; &#51089;&#46041;&#54616;&#47140;&#47732; &#45796;&#51020; &#51648;&#52840;&#51012; &#49688;&#54665;&#54644;&#50556; &#54633;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#49464;&#49496; &#49345;&#53468;&#44032; &#49688;&#51221;&#46112; &#46412;&#47560;&#45796; <code>setAttribute()</code>&#47484; &#54840;&#52636;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#49549;&#49457; &#44036;&#50640;&#45716; &#49345;&#54840; &#52280;&#51312;&#44032; &#50630;&#50612;&#50556; &#54633;&#45768;&#45796;. &#48324;&#44060; &#49549;&#49457; &#53412;&#51032; &#44061;&#52404; &#44536;&#47000;&#54532;&#45716; &#48324;&#46020;&#47196; &#51068;&#47144;&#54868; &#48143; &#51200;&#51109;&#46121;&#45768;&#45796;. &#48324;&#46020; &#53412;&#51032; &#44061;&#52404; &#44036;&#50640; &#44061;&#52404; &#49345;&#54840; &#52280;&#51312;&#44032; &#51080;&#51012; &#44221;&#50864; &#51228;&#45824;&#47196; &#51068;&#47144;&#54868; &#48143; &#51068;&#47144;&#54868; &#54644;&#51228;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>&#50668;&#47084; &#49549;&#49457;&#50640;&#49436; &#49464;&#49496; &#49345;&#53468;&#47484; &#48516;&#48176;&#54616;&#44144;&#45208; &#52572;&#49548;&#54620; &#51069;&#44592; &#51204;&#50857; &#49549;&#49457; &#48143; &#49688;&#51221; &#44032;&#45733;&#54620; &#49549;&#49457; &#44036;&#50640; &#49464;&#49496; &#49345;&#53468;&#47484; &#48516;&#48176;&#54633;&#45768;&#45796;.</p>
</li>
</ul>
</li>
</ul>
</dd>
<dt>Single Sign-On &#49345;&#53468;</dt>
<dd>
<p>[&#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#47732; &#48373;&#44396;&#50640; Single Sign-On &#49345;&#53468;&#47484; &#49324;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#52628;&#44032; &#49549;&#49457;</dt>
<dd>
<p>&#50937; &#52968;&#53580;&#51060;&#45320; &#44032;&#50857;&#49457;&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51077;&#45768;&#45796;.</p>
<p>GlassFish Server&#50640;&#49436;&#45716; &#52628;&#44032; &#50937; &#52968;&#53580;&#51060;&#45320; &#44032;&#50857;&#49457; &#49549;&#49457;&#51012; &#51221;&#51032;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref80" name="sthref80"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-webcontainergeneral.html">&#50937; &#52968;&#53580;&#51060;&#45320;&#51032; &#51068;&#48152; &#49549;&#49457;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-webcontainersessiontimeout.html">&#50937; &#52968;&#53580;&#51060;&#45320;&#51032; &#49464;&#49496; &#49549;&#49457;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-webcontainermanagerprops.html">&#50937; &#52968;&#53580;&#51060;&#45320;&#51032; &#44288;&#47532;&#51088; &#49549;&#49457;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-webcontainerstoreprops.html">&#50937; &#52968;&#53580;&#51060;&#45320;&#51032; &#51200;&#51109;&#49548; &#49549;&#49457;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-webcontaineravailability.html">&#50937; &#52968;&#53580;&#51060;&#45320; &#44032;&#50857;&#49457; &#49444;&#51221;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
