<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-threadpools" name="ref-threadpools"></a></p>

<h4><a id="sthref168" name="sthref168"></a><a id="sthref169" name="sthref169"></a>&#49828;&#47112;&#46300; &#54400;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#49828;&#47112;&#46300; &#54400;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#49828;&#47112;&#46300; &#54400;&#51012; &#44396;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#49828;&#47112;&#46300; &#54400;&#51012; &#49324;&#50857;&#54616;&#50668; &#49436;&#48708;&#49828;&#47484; &#46041;&#49884;&#50640; &#53945;&#51221; &#49688;&#51032; &#49828;&#47112;&#46300;&#47196; &#51228;&#54620;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>GlassFish Server&#47484; &#52376;&#51020; &#49444;&#52824;&#54616;&#47732; &#44592;&#48376;&#51201;&#51004;&#47196; &#49828;&#47112;&#46300; &#54400;&#51060; &#46160; &#44060; &#51080;&#49845;&#45768;&#45796;. <code>http-thread-pool</code> &#49828;&#47112;&#46300; &#54400;&#51008; &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#50640;&#49436; &#49324;&#50857;&#54616;&#46020;&#47197; &#44396;&#49457;&#46104;&#44256;, <code>thread-pool-1</code> &#49828;&#47112;&#46300; &#54400;&#51008; ORB&#50640;&#49436; RMI/IIOP &#50836;&#52397;&#50640; &#49324;&#50857;&#54616;&#46020;&#47197; &#44396;&#49457;&#46121;&#45768;&#45796;. &#53945;&#51221; &#51333;&#47448;&#51032; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#49324;&#50857;&#54616;&#46020;&#47197; &#53945;&#51221; &#54616;&#46300;&#50920;&#50612; &#49884;&#49828;&#53596;&#50640; &#45824;&#54644; &#50668;&#47084; &#49444;&#51221;&#51012; &#49324;&#50857;&#54616;&#50668; &#49828;&#47112;&#46300; &#54400;&#51012; &#49373;&#49457;&#54616;&#44144;&#45208;, &#54596;&#50836;&#50640; &#47582;&#44172; &#44592;&#48376; &#49828;&#47112;&#46300; &#54400;&#51012; &#51312;&#51221;&#54644;&#50556; &#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>JVM(Java Virtual Machine)&#50640;&#49436;&#45716; &#54620; &#48264;&#50640; &#50668;&#47084; &#49828;&#47112;&#46300; &#49892;&#54665;&#51012; &#51648;&#50896;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#49457;&#45733; &#54693;&#49345;&#51012; &#50948;&#54644; GlassFish Server&#50640;&#49436;&#45716; &#54616;&#45208; &#51060;&#49345;&#51032; &#49828;&#47112;&#46300; &#54400;&#51012; &#50976;&#51648;&#54633;&#45768;&#45796;. &#53945;&#51221; &#49436;&#48708;&#49828;&#50640; &#45824;&#54644; &#53945;&#51221; &#49828;&#47112;&#46300; &#54400;&#51012; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#54620; &#49828;&#47112;&#46300; &#54400;&#51060; &#50668;&#47084; &#49436;&#48708;&#49828;&#50640; &#49324;&#50857;&#46112; &#49688;&#46020; &#51080;&#49845;&#45768;&#45796;. &#50836;&#52397; &#49828;&#47112;&#46300;&#45716; &#49324;&#50857;&#51088; &#50836;&#52397;&#51012; &#52376;&#47532;&#54633;&#45768;&#45796;. &#49436;&#48260;&#45716; &#50836;&#52397;&#51012; &#48155;&#51004;&#47732; &#50836;&#52397;&#51012; &#49828;&#47112;&#46300; &#54400;&#51032; &#50668;&#50976; &#49828;&#47112;&#46300;&#50640; &#51648;&#51221;&#54633;&#45768;&#45796;. &#49828;&#47112;&#46300;&#45716; &#53364;&#46972;&#51060;&#50616;&#53944;&#51032; &#50836;&#52397;&#51012; &#49892;&#54665;&#54616;&#50668; &#44208;&#44284;&#47484; &#48152;&#54872;&#54633;&#45768;&#45796;. &#50696;&#47484; &#46308;&#50612;, &#50836;&#52397;&#51060; &#54788;&#51116; &#51089;&#50629; &#51473;&#51064; &#49884;&#49828;&#53596; &#47532;&#49548;&#49828;&#47484; &#49324;&#50857;&#54644;&#50556; &#54616;&#45716; &#44221;&#50864; &#49828;&#47112;&#46300;&#45716; &#47532;&#49548;&#49828;&#51032; &#51089;&#50629;&#51060; &#45149;&#45216; &#46412;&#44620;&#51648; &#44592;&#45796;&#47536; &#54980; &#50836;&#52397;&#51060; &#54644;&#45817; &#47532;&#49548;&#49828;&#47484; &#49324;&#50857;&#54624; &#49688; &#51080;&#46020;&#47197; &#54633;&#45768;&#45796;.</p>
<p>&#50836;&#52397;&#50640; &#50696;&#50557;&#46108; &#49828;&#47112;&#46300;&#51032; &#52572;&#49548; &#49688;&#50752; &#52572;&#45824; &#49688;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;. &#49828;&#47112;&#46300; &#54400;&#51008; &#51060;&#47084;&#54620; &#46160; &#44050; &#49324;&#51060;&#50640;&#49436; &#46041;&#51201;&#51004;&#47196; &#51312;&#51208;&#46121;&#45768;&#45796;. &#51648;&#51221;&#54620; &#52572;&#49548; &#49828;&#47112;&#46300; &#54400; &#53356;&#44592;&#45716; &#50836;&#52397;&#50640; &#45824;&#54620; &#50696;&#50557;&#51060; &#51201;&#50612;&#46020; &#44536; &#49688;&#47564;&#53372;&#51032; &#49828;&#47112;&#46300;&#47484; &#54624;&#45817;&#54616;&#46972;&#45716; &#49888;&#54840;&#47484; &#49436;&#48260;&#50640; &#48372;&#45253;&#45768;&#45796;. &#51060; &#49688;&#45716; &#51648;&#51221;&#54620; &#52572;&#45824; &#49828;&#47112;&#46300; &#54400; &#53356;&#44592;&#47564;&#53372; &#51613;&#44032;&#54633;&#45768;&#45796;.</p>
<p>&#54532;&#47196;&#49464;&#49828;&#44032; &#49324;&#50857;&#54624; &#49688; &#51080;&#45716; &#49828;&#47112;&#46300;&#51032; &#49688;&#47484; &#45720;&#47532;&#47732; &#54532;&#47196;&#49464;&#49828;&#45716; &#45908; &#47566;&#51008; &#50836;&#52397;&#50640; &#46041;&#49884;&#50640; &#51025;&#45813;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#44033; &#49828;&#47112;&#46300; &#54400;&#50640; &#45824;&#54644; &#51228;&#44277;&#46104;&#45716; &#51221;&#48372;&#45716; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#49828;&#47112;&#46300; &#54400; ID</dt>
<dd>
<p>&#49828;&#47112;&#46300; &#54400;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#45824; &#49828;&#47112;&#46300; &#54400; &#53356;&#44592;</dt>
<dd>
<p>&#49828;&#47112;&#46300; &#54400;&#50640; &#51080;&#45716; &#49828;&#47112;&#46300;&#51032; &#52572;&#45824; &#49688;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#49548; &#49828;&#47112;&#46300; &#54400; &#53356;&#44592;</dt>
<dd>
<p>&#49828;&#47112;&#46300; &#54400;&#50640; &#51080;&#45716; &#49828;&#47112;&#46300;&#51032; &#52572;&#49548; &#49688;&#51077;&#45768;&#45796;. &#49828;&#47112;&#46300; &#54400;&#51012; &#51064;&#49828;&#53556;&#49828;&#54868;&#54624; &#44221;&#50864; &#51060; &#49828;&#47112;&#46300;&#44032; &#49373;&#49457;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#45824; &#45824;&#44592;&#50676; &#53356;&#44592;</dt>
<dd>
<p>&#49828;&#47112;&#46300;&#50640;&#49436; &#47700;&#49884;&#51648;&#47484; &#52376;&#47532;&#54624; &#49688; &#51080;&#51012; &#46412;&#44620;&#51648; &#45824;&#44592;&#50676;&#50640; &#51080;&#51012; &#49688; &#51080;&#45716; &#52572;&#45824; &#47700;&#49884;&#51648; &#49688;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#50976;&#55092; &#49828;&#47112;&#46300; &#49884;&#44036; &#52488;&#44284;</dt>
<dd>
<p>&#54400;&#50640;&#49436; &#50976;&#55092; &#49828;&#47112;&#46300;&#44032; &#51228;&#44144;&#46104;&#44592; &#51204;&#44620;&#51648;&#51032; &#49884;&#44036;(&#52488;)&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
<p>&#49828;&#47112;&#46300; &#54400; &#53580;&#51060;&#48660;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#46020; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#49352;&#47196; &#47564;&#46308;&#44592;</dt>
<dd>
<p>&#49352; &#49828;&#47112;&#46300; &#54400;&#51012; &#49373;&#49457;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49325;&#51228;</dt>
<dd>
<p>&#49440;&#53469;&#54620; &#49828;&#47112;&#46300; &#54400;&#51012; &#54616;&#45208; &#51060;&#49345; &#49325;&#51228;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref170" name="sthref170"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-threadpoolnew.html">&#49828;&#47112;&#46300; &#54400;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-threadpooledit.html">&#49828;&#47112;&#46300; &#54400;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-threadpooldelete.html">&#49828;&#47112;&#46300; &#54400;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref171" name="sthref171"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00060"><code>create-threadpool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00204"><code>list-threadpools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00111"><code>delete-threadpool</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
