<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-httpserviceprops" name="ref-httpserviceprops"></a><a id="GHWEB00009" name="GHWEB00009"></a></p>

<h4><a id="sthref107" name="sthref107"></a><a id="sthref108" name="sthref108"></a>HTTP &#49436;&#48708;&#49828; &#44288;&#47144; &#49549;&#49457;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>HTTP &#49436;&#48708;&#49828;&#50640; &#49324;&#50857;&#54624; &#49688; &#51080;&#45716; &#52628;&#44032; &#49549;&#49457;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;. &#51060;&#47084;&#54620; &#49549;&#49457;&#51012; &#51648;&#51221;&#54616;&#47732; &#47784;&#46304; <a href="ref-group-networklisteners.html">&#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;</a>&#50640; &#51201;&#50857;&#46121;&#45768;&#45796;.</p>
<dl>
<dt><code>ssl-cache-entriese</code></dt>
<dd>
<p>&#52880;&#49884;&#54624; SSL &#49464;&#49496;&#51032; &#49688;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 10,000&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>ssl3-session-timeout</code></dt>
<dd>
<p>SSL3 &#49464;&#49496;&#51060; &#52880;&#49884;&#46104;&#45716; &#44036;&#44201;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 86,400&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>ssl-session-timeout</code></dt>
<dd>
<p>SSL2 &#49464;&#49496;&#51060; &#52880;&#49884;&#46104;&#45716; &#44036;&#44201;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 100&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>proxyHandler</code></dt>
<dd>
<p>SSL &#51333;&#47308; &#54532;&#47197;&#49884; &#49436;&#48260;(&#50696;: &#47196;&#46300; &#48184;&#47088;&#49436;)&#44032; &#44032;&#47196;&#52296; &#50896;&#47000; &#53364;&#46972;&#51060;&#50616;&#53944; &#50836;&#52397;&#50640; &#45824;&#54620; &#51221;&#48372;&#47484; &#48177;&#50644;&#46300; GlassFish Server &#51064;&#49828;&#53556;&#49828;&#44032; &#44160;&#49353;&#54624; &#49688; &#51080;&#46020;&#47197; &#54616;&#45716; <code>com.sun.appserv.ProxyHandler</code> &#52628;&#49345; &#53364;&#47000;&#49828;&#51032; &#49324;&#50857;&#51088; &#51221;&#51032; &#44396;&#54788;&#50640; &#45824;&#54620; &#51221;&#44508;&#54868;&#46108; &#53364;&#47000;&#49828; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#52628;&#49345; &#53364;&#47000;&#49828; &#44396;&#54788;&#51008; &#51648;&#51221;&#46108; &#50836;&#52397;&#50640;&#49436; &#49324;&#50857;&#51088; &#51221;&#51032; &#50836;&#52397; &#54756;&#45908;&#47484; &#44160;&#49324;&#54633;&#45768;&#45796;.&#49324;&#50857;&#51088; &#51221;&#51032; &#50836;&#52397; &#54756;&#45908;&#47484; &#53685;&#54644; &#54532;&#47197;&#49884; &#49436;&#48260;&#45716; &#50896;&#47000; &#53364;&#46972;&#51060;&#50616;&#53944; &#50836;&#52397;&#50640; &#45824;&#54620; &#51221;&#48372;&#47484; Enterprise Server &#51064;&#49828;&#53556;&#49828;&#50640; &#51204;&#45804;&#54616;&#44256; &#54644;&#45817; &#51221;&#48372;&#47484; &#54840;&#52636;&#51088;&#50640;&#44172; &#48152;&#54872;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376; &#44396;&#54788;&#51008; <code>Proxy-ip</code>&#46972;&#45716; HTTP &#50836;&#52397; &#54756;&#45908;&#50640;&#49436; &#53364;&#46972;&#51060;&#50616;&#53944; IP &#51452;&#49548;&#47484;, <code>Proxy-keysize</code>&#46972;&#45716; HTTP &#50836;&#52397; &#54756;&#45908;&#50640;&#49436; SSL <code>keysize</code>&#47484;, <code>Proxy-auth-cert</code>&#46972;&#45716; HTTP &#50836;&#52397; &#54756;&#45908;&#50640;&#49436; SSL &#53364;&#46972;&#51060;&#50616;&#53944; &#51064;&#51613;&#49436; &#52404;&#51064;&#51012; &#51069;&#49845;&#45768;&#45796;. <code>Proxy-auth-cert</code> &#44050;&#51008; <code>BEGIN CERTIFICATE</code> &#48143; <code>END CERTIFICATE</code> &#44221;&#44228;&#44032; &#50630;&#44256; <code>\n</code>&#51060; <code>% d% a</code>&#47196; &#48148;&#45068;&#45716; BASE-64 &#51064;&#53076;&#46377; &#53364;&#46972;&#51060;&#50616;&#53944; &#51064;&#51613;&#49436; &#52404;&#51064;&#51012; &#54252;&#54632;&#54644;&#50556; &#54633;&#45768;&#45796;.</p>
<p>&#51060; &#49444;&#51221;&#51008; &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320; &#54532;&#47196;&#53664;&#53084;&#51032; HTTP &#54168;&#51060;&#51648;&#50640; &#45824;&#54620; [&#51064;&#51613; &#53685;&#44284;] &#52404;&#53356; &#48149;&#49828;&#44032; true&#47196; &#49444;&#51221;&#46108; &#44221;&#50864;&#50640;&#47564; &#49324;&#50857;&#46121;&#45768;&#45796;.</p>
</dd>
<dt><code>connectionTimeout</code></dt>
<dd>
<p>&#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#44032; &#51217;&#49549;&#51012; &#49849;&#51064;&#54620; &#54980; &#50836;&#52397; URI &#54665;&#51060; &#51228;&#52636;&#46112; &#46412;&#44620;&#51648; &#44592;&#45796;&#47532;&#45716; &#49884;&#44036;(&#52488;)&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 30&#51077;&#45768;&#45796;.</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
