<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-protocolfilecacheedit" name="ref-protocolfilecacheedit"></a><a id="GHWEB00023" name="GHWEB00023"></a></p>

<h4><a id="sthref155" name="sthref155"></a><a id="sthref156" name="sthref156"></a>&#54028;&#51068; &#52880;&#49884;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#54028;&#51068; &#52880;&#49884;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#45348;&#53944;&#50892;&#53356; &#54532;&#47196;&#53664;&#53084;&#50640; &#45824;&#54620; &#54028;&#51068; &#52880;&#49884; &#49444;&#51221;&#51012; &#49688;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>[&#54028;&#51068; &#52880;&#49884;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44592;&#48376;&#44050; &#47196;&#46300;</dt>
<dd>
<p>&#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#45716; &#49444;&#51221;&#51012; &#44592;&#48376;&#44050;&#51004;&#47196; &#48373;&#50896;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#49444;&#51221;&#51008; &#48320;&#44221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#44396;&#49457; &#51060;&#47492;</dt>
<dd>
<p>&#51060; &#54168;&#51060;&#51648;&#51032; &#49444;&#51221;&#51060; &#51201;&#50857;&#46104;&#45716; &#44396;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#54532;&#47196;&#53664;&#53084; &#51060;&#47492;</dt>
<dd>
<p>&#54532;&#47196;&#53664;&#53084;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. [&#54532;&#47196;&#53664;&#53084; &#51060;&#47492;] &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857; &#54596;&#46300;&#51077;&#45768;&#45796;. &#49352; &#54532;&#47196;&#53664;&#53084;&#51012; &#49373;&#49457;&#54624; &#46412;&#47564; &#51060;&#47492;&#51012; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#49345;&#53468;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; &#54028;&#51068; &#52880;&#49884; &#49345;&#53468;&#44032; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49440;&#53469;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#45824; &#49324;&#50857; &#44592;&#44036;</dt>
<dd>
<p>&#51201;&#54633;&#54620; &#52880;&#49884; &#54637;&#47785;&#50640; &#45824;&#54620; &#52572;&#45824; &#49324;&#50857; &#44592;&#44036;(&#52488;)&#51077;&#45768;&#45796;.</p>
<p>&#51060; &#47588;&#44060;&#48320;&#49688;&#45716; &#54028;&#51068;&#51060; &#52880;&#49884;&#46108; &#54980; &#52880;&#49884;&#46108; &#51221;&#48372;&#44032; &#49324;&#50857;&#46104;&#45716; &#44592;&#44036;&#51012; &#51228;&#50612;&#54633;&#45768;&#45796;. &#52572;&#45824; &#49324;&#50857; &#44592;&#44036;&#48372;&#45796; &#50724;&#47000;&#46108; &#54637;&#47785;&#51008; &#44057;&#51008; &#54028;&#51068;&#50640; &#45824;&#54620; &#49352; &#54637;&#47785;&#51004;&#47196; &#45824;&#52404;&#46121;&#45768;&#45796;. &#45236;&#50857;&#51060; &#51088;&#51452; &#48320;&#44221;&#46104;&#51648; &#50506;&#45716; &#44221;&#50864;&#50640;&#45716; &#49457;&#45733; &#54693;&#49345;&#51012; &#50948;&#54644; &#51060; &#44050;&#51012; &#45720;&#47532;&#49901;&#49884;&#50724;.</p>
<p>&#52572;&#51201;&#51032; &#52572;&#45824; &#49324;&#50857; &#44592;&#44036;&#51008; &#44592;&#51316; &#54028;&#51068;&#51060; &#51221;&#44592;&#51201;&#51004;&#47196; &#49688;&#51221;&#46104;&#45716;&#51648; &#50668;&#48512;&#50640; &#46384;&#46972; &#45796;&#47493;&#45768;&#45796;. &#50696;&#47484; &#46308;&#50612; &#54028;&#51068;&#51060; &#54616;&#47336;&#50640; &#45348; &#48264; &#51221;&#44592;&#51201;&#51064; &#44036;&#44201;&#51004;&#47196; &#49688;&#51221;&#46104;&#45716; &#44221;&#50864; &#52572;&#45824; &#49324;&#50857; &#44592;&#44036;&#51012; 21600&#52488;(6&#49884;&#44036;)&#47196; &#49444;&#51221;&#54616;&#45716; &#44163;&#51060; &#51339;&#49845;&#45768;&#45796;. &#44536;&#47111;&#51648; &#50506;&#51008; &#44221;&#50864;&#50640;&#45716; &#54028;&#51068;&#51060; &#49688;&#51221;&#46108; &#54980; &#54028;&#51068;&#51032; &#51060;&#51204; &#48260;&#51204;&#51012; &#49436;&#48708;&#49828;&#54616;&#47140;&#44256; &#54616;&#45716; &#44032;&#51109; &#44596; &#49884;&#44036;&#51004;&#47196; &#52572;&#45824; &#49324;&#50857; &#44592;&#44036;&#51012; &#49444;&#51221;&#54616;&#45716; &#44163;&#51012; &#44256;&#47140;&#54644; &#48372;&#49901;&#49884;&#50724;.</p>
<p>&#44592;&#48376;&#44050;&#51008; 30&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#45824; &#52880;&#49884; &#53356;&#44592;</dt>
<dd>
<p>&#46356;&#49828;&#53356;&#50640; &#51080;&#45716; &#54028;&#51068; &#52880;&#49884;&#51032; &#52572;&#45824; &#51204;&#52404; &#53356;&#44592;(&#48148;&#51060;&#53944;)&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 10485760&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#45824; &#54028;&#51068; &#49688;</dt>
<dd>
<p>&#54028;&#51068; &#52880;&#49884;&#50640; &#51200;&#51109;&#54624; &#49688; &#51080;&#45716; &#54028;&#51068;&#51032; &#52572;&#45824; &#49688;&#51077;&#45768;&#45796;.</p>
<p>&#44050;&#51060; &#45320;&#47924; &#53356;&#47732; &#49436;&#48260;&#44032; &#51088;&#51452; &#49324;&#50857;&#46104;&#51648; &#50506;&#51008; &#54028;&#51068;&#44620;&#51648; &#52880;&#49884;&#54616;&#48064;&#47196; &#47700;&#47784;&#47532;&#44032; &#45229;&#48708;&#46121;&#45768;&#45796;. &#44050;&#51060; &#45320;&#47924; &#51089;&#51004;&#47732; &#52880;&#49905;&#51032; &#51109;&#51216;&#51060; &#49324;&#46972;&#51656; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#49549;&#49457;&#50640; &#50668;&#47084; &#44050;&#51012; &#53580;&#49828;&#53944;&#54616;&#50668; &#53945;&#51221; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#47582;&#45716; &#52572;&#51201;&#51032; &#49556;&#47336;&#49496;&#51012; &#52286;&#51004;&#49901;&#49884;&#50724;.</p>
<p>&#44592;&#48376;&#44050;&#51008; 1024&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref157" name="sthref157"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-protocolnew.html">&#54532;&#47196;&#53664;&#53084;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">&#54532;&#47196;&#53664;&#53084;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">&#54532;&#47196;&#53664;&#53084;&#51032; SSL &#49444;&#51221;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">&#54532;&#47196;&#53664;&#53084;&#51032; HTTP &#49444;&#51221;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-protocolfilecacheedit.html">&#54532;&#47196;&#53664;&#53084;&#51032; &#54028;&#51068; &#52880;&#49884; &#49444;&#51221;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">&#54532;&#47196;&#53664;&#53084;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref158" name="sthref158"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00051"><code>create-protocol</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00195"><code>list-protocols</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00103"><code>delete-protocol</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
