<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-httplisteneredit" name="task-httplisteneredit"></a></p>

<h4><a id="sthref25" name="sthref25"></a>HTTP &#47532;&#49828;&#45320;&#47484; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#53456;&#49353; &#53944;&#47532;&#50640;&#49436; [&#44396;&#49457;] &#45432;&#46300;&#47484; &#54869;&#51109;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#44396;&#49457;] &#45432;&#46300;&#50640;&#49436; [HTTP &#49436;&#48708;&#49828;] &#45432;&#46300;&#47484; &#54869;&#51109;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#45348;&#53944;&#50892;&#53356; &#44396;&#49457;] &#45432;&#46300;&#50640;&#49436; [HTTP &#47532;&#49828;&#45320;] &#45432;&#46300;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>[HTTP &#47532;&#49828;&#45320;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[HTTP &#47532;&#49828;&#45320;] &#54168;&#51060;&#51648;&#50640;&#49436; &#54200;&#51665;&#54624; HTTP &#47532;&#49828;&#45320;&#51032; &#51060;&#47492;&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
<p>[HTTP &#47532;&#49828;&#45320; &#54200;&#51665;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#54252;&#53944;] &#54596;&#46300;&#50640; HTTP &#47532;&#49828;&#45320;&#50640;&#49436; &#49688;&#49888;&#54624; &#54252;&#53944; &#48264;&#54840;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#50976;&#54952;&#54620; &#44050;&#51008; 1 - 65535&#51077;&#45768;&#45796;. UNIX &#49884;&#49828;&#53596;&#50640;&#49436; 1 - 1024 &#54252;&#53944;&#47484; &#49688;&#49888;&#54616;&#45716; &#49548;&#53011;&#51012; &#49373;&#49457;&#54616;&#47140;&#47732; &#49688;&#54140;&#50976;&#51200; &#44428;&#54620;&#51060; &#54596;&#50836;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>HTTP &#47532;&#49828;&#45320;&#51032; &#49345;&#53468;&#47484; &#48320;&#44221;&#54616;&#47140;&#47732; [&#49345;&#53468; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#44144;&#45208; &#49440;&#53469; &#54644;&#51228;&#54633;&#45768;&#45796;.</p>
<p>&#47532;&#49828;&#45320;&#45716; &#49324;&#50857; &#46608;&#45716; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;. &#47532;&#49828;&#45320;&#44032; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#47532;&#49828;&#45320;&#50640; &#51217;&#49549;&#54616;&#47140;&#44256; &#54616;&#47732; &#49548;&#53011; &#50696;&#50808; &#49324;&#54637;(<code>java.net.ConnectException</code>)&#51060; &#48156;&#49373;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>HTTP &#47532;&#49828;&#45320;&#50640; &#45824;&#54644; &#48372;&#50504;&#51012; &#49324;&#50857;&#54616;&#47140;&#47732; [&#48372;&#50504; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<p>DAS(&#46020;&#47700;&#51064; &#44288;&#47532; &#49436;&#48260;)&#50640; &#45824;&#54644; <code>admin-listener</code>&#47484; &#44396;&#49457;&#54616;&#50668; <code>server-config</code> &#44396;&#49457;&#51012; &#49324;&#50857;&#54616;&#45716; &#44221;&#50864;, &#51060; &#50741;&#49496;&#51008; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;. &#51060; &#47532;&#49828;&#45320;&#50640; &#45824;&#54644; &#48372;&#50504;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47140;&#47732; &#48372;&#50504; &#44288;&#47532;&#47484; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54644;&#50556; &#54633;&#45768;&#45796;. <a href="../../../common/en/help/ref-securityadmin.html">&#48372;&#50504; &#44288;&#47532;</a>&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</li>
<li>
<p>[JK &#47532;&#49828;&#45320; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#50668; &#47532;&#49828;&#45320;&#44032; Apache&#51032; <code>mod-jk</code> &#54532;&#47196;&#53664;&#53084;&#51012; &#51648;&#50896;&#54616;&#46020;&#47197; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<p><code>mod-jk</code> &#54532;&#47196;&#53664;&#53084;&#51008; Apache <code>httpd</code>(&#50937; &#49436;&#48260;)&#50752; GlassFish Server &#48177;&#50644;&#46300; &#51064;&#49828;&#53556;&#49828; &#44036; &#51204;&#50857; &#53685;&#49888;/&#45348;&#53944;&#50892;&#53356; &#54532;&#47196;&#53664;&#53084;&#51077;&#45768;&#45796;. &#47532;&#49828;&#45320;&#50640;&#49436; &#51060; &#54532;&#47196;&#53664;&#53084;&#51012; &#51648;&#50896;&#54616;&#45716; &#44221;&#50864; <code>httpd</code>&#44032; &#47784;&#46304; &#51221;&#51201; &#53080;&#53584;&#52768;&#47484; &#52376;&#47532;&#54616;&#51648;&#47564;, &#46041;&#51201; &#47532;&#49548;&#49828;(&#51593;, &#49436;&#48660;&#47551; &#48143; JSP)&#50640; &#45824;&#54620; &#50836;&#52397;&#51008; <code>mod-jk</code> &#54532;&#47196;&#53664;&#53084;&#51012; &#53685;&#54644; GlassFish Server&#51032; <code>mod-jk</code> &#51648;&#50896; HTTP &#47532;&#49828;&#45320;&#47196; &#46972;&#50864;&#54021;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51452;&#49548;] &#54596;&#46300;&#50640; &#45348;&#53944;&#50892;&#53356; HTTP &#47532;&#49828;&#45320;&#50640;&#49436; &#49688;&#49888;&#54624; IP &#51452;&#49548;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#51452;&#49548;&#45716; &#51216;&#51004;&#47196; &#46108; &#49933;&#51060;&#44144;&#45208; IPv6 &#54364;&#44592; &#54805;&#49885;&#51068; &#49688; &#51080;&#49845;&#45768;&#45796;. &#47784;&#46304; IP &#51452;&#49548;&#47484; &#49688;&#49888;&#54616;&#47140;&#47732; <code>any</code>(<code>INADDR_ANY</code>&#51032; &#44221;&#50864;)&#51068; &#49688; &#51080;&#49845;&#45768;&#45796;. &#54840;&#49828;&#53944; &#51060;&#47492;&#51068; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#44592;&#48376; &#44032;&#49345; &#49436;&#48260;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#51060; HTTP &#47532;&#49828;&#45320;&#50752; &#50672;&#44288;&#46112; &#44032;&#49345; &#49436;&#48260;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>[&#44032;&#49345; &#49436;&#48260;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#44032;&#49345; &#49436;&#48260;&#47484; &#51221;&#51032;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#49828;&#47112;&#46300; &#54400;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; HTTP &#47532;&#49828;&#45320;&#50752; &#50672;&#44288;&#46112; &#49828;&#47112;&#46300; &#54400;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#51068;&#48152;&#51201;&#51004;&#47196; GlassFish Server&#47484; &#49444;&#52824;&#54624; &#46412; &#44396;&#49457;&#46104;&#45716; &#46160; &#44060;&#51032; &#49828;&#47112;&#46300; &#54400; &#51473; &#54616;&#45208;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#49436;&#48260;&#44032; &#53364;&#46972;&#51060;&#50616;&#53944;&#50640; &#48372;&#45236;&#45716; URL&#50640; &#49324;&#50857;&#54624; &#54840;&#49828;&#53944; &#51060;&#47492;&#51012; [&#49436;&#48260; &#51060;&#47492;] &#54596;&#46300;&#50640; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#49436;&#48260;&#44032; &#48324;&#52845;&#51012; &#49324;&#50857;&#54616;&#45716; &#44221;&#50864; &#51060; &#51060;&#47492;&#51008; &#48324;&#52845; &#51060;&#47492;&#51077;&#45768;&#45796;. &#49436;&#48260;&#44032; &#48324;&#52845;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#44221;&#50864;&#50640;&#45716; &#51060; &#54596;&#46300;&#47484; &#48708;&#50892; &#46160;&#49901;&#49884;&#50724;.</p>
<p>&#51060; &#44050;&#51008; &#49436;&#48260;&#50640;&#49436; &#51088;&#46041;&#51004;&#47196; &#49373;&#49457;&#54616;&#45716; URL&#50640; &#50689;&#54693;&#51012; &#51452;&#51648;&#47564;, &#49436;&#48260;&#50640; &#51200;&#51109;&#46108; &#46356;&#47113;&#53664;&#47532; &#48143; &#54028;&#51068;&#51032; URL&#50640;&#45716; &#50689;&#54693;&#51012; &#51452;&#51648; &#50506;&#49845;&#45768;&#45796;. &#49436;&#48260;&#50640;&#49436; &#48324;&#52845;&#51012; &#49324;&#50857;&#54616;&#45716; &#44221;&#50864; &#49436;&#48260; &#51060;&#47492;&#51060; &#48324;&#52845; &#51060;&#47492;&#51060;&#50612;&#50556; &#54633;&#45768;&#45796;. &#53084;&#47200;&#44284; &#54252;&#53944; &#48264;&#54840;&#47484; &#52628;&#44032;&#54616;&#47732; &#49436;&#48260;&#50640;&#49436; &#53364;&#46972;&#51060;&#50616;&#53944;&#50640; &#51204;&#49569;&#54616;&#45716; URL&#50640; &#54644;&#45817; &#54252;&#53944;&#44032; &#49324;&#50857;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51200;&#51109;]&#51012; &#45572;&#47493;&#45768;&#45796;.</p>

<hr>
<p><b>&#54017;:</b></p>
&#44592;&#48376; &#49444;&#51221;&#51004;&#47196; &#46028;&#50500;&#44032;&#47140;&#47732; [&#44592;&#48376;&#44050; &#47196;&#46300;] &#45800;&#52628;&#47484; &#45572;&#47480; &#45796;&#51020; [&#51200;&#51109;]&#51012; &#45572;&#47493;&#45768;&#45796;.
<hr>

</li>
</ol>
<a id="sthref26" name="sthref26"></a>
<h5>&#45796;&#51020; &#45800;&#44228;</h5>
<p>HTTP &#47532;&#49828;&#45320;&#50640; &#45824;&#54644; &#48372;&#50504;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54620; &#44221;&#50864; SSL &#53485;&#50640;&#49436; HTTP &#47532;&#49828;&#45320;&#51032; SSL &#49444;&#51221;&#51012; &#54200;&#51665;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>HTTP &#47532;&#49828;&#45320;&#45716; &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#51032; &#54620; &#50976;&#54805;&#51077;&#45768;&#45796;. [&#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;] &#54168;&#51060;&#51648;&#50640;&#49436; HTTP &#47532;&#49828;&#45320;&#47484; &#54200;&#51665;&#54616;&#47732; &#44256;&#44553; &#44592;&#45733;&#50640; &#50529;&#49464;&#49828;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<a id="sthref27" name="sthref27"></a>
<h5>&#44288;&#47144; &#54637;&#47785;</h5>
<ul>
<li>
<p><a href="task-httplistenernew.html">HTTP &#47532;&#49828;&#45320;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-httplistenerdelete.html">HTTP &#47532;&#49828;&#45320;&#47484; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-httplistenerssl.html">HTTP &#47532;&#49828;&#45320;&#51032; SSL &#49444;&#51221;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-virtualservercreate.html">&#44032;&#49345; &#49436;&#48260;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-networklistenernew.html">&#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">&#54532;&#47196;&#53664;&#53084;&#51032; HTTP &#49444;&#51221;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
