<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-virtualserveredit" name="task-virtualserveredit"></a><a id="GHWEB00037" name="GHWEB00037"></a></p>

<h4><a id="sthref36" name="sthref36"></a>&#44032;&#49345; &#49436;&#48260;&#47484; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#53456;&#49353; &#53944;&#47532;&#50640;&#49436; [&#44396;&#49457;] &#45432;&#46300;&#47484; &#54869;&#51109;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#48320;&#44221; &#51473;&#51064; &#44396;&#49457;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#44396;&#49457;] &#45432;&#46300;&#50640;&#49436; [&#44032;&#49345; &#49436;&#48260;] &#45432;&#46300;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>[&#44032;&#49345; &#49436;&#48260;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#44032;&#49345; &#49436;&#48260;] &#54168;&#51060;&#51648;&#50640;&#49436; &#54200;&#51665;&#54624; &#44032;&#49345; &#49436;&#48260;&#51032; &#51060;&#47492;&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
<p>[&#44032;&#49345; &#49436;&#48260; &#54200;&#51665;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#54840;&#49828;&#53944;] &#54596;&#46300;&#50640; &#49436;&#48260;&#44032; &#49892;&#54665;&#46104;&#44256; &#51080;&#45716; &#49884;&#49828;&#53596;&#51032; &#54840;&#49828;&#53944; &#51060;&#47492; &#46608;&#45716; IP &#51452;&#49548;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#45348;&#53944;&#50892;&#53356;&#51032; DNS &#49436;&#48260;(UNIX &#49884;&#49828;&#53596;&#51032; &#44221;&#50864; <code>/etc/hosts</code> &#54028;&#51068;)&#50640; &#46321;&#47197;&#46108; &#49892;&#51228; &#46608;&#45716; &#44032;&#49345; &#54840;&#49828;&#53944; &#51060;&#47492;&#51012; &#49324;&#50857;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; &#49884;&#49828;&#53596; &#49549;&#49457;&#44050; <code>${com.sun.aas.hostName}</code>&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>&#44032;&#49345; &#49436;&#48260;&#50640; &#45824;&#54620; &#49345;&#53468; &#50741;&#49496;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#45796;&#51020;&#44284; &#44057;&#51008; &#44050;&#51012; &#49324;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#53020;&#44592;</dt>
<dd>
<p>&#44032;&#49345; &#49436;&#48260;&#44032; &#54876;&#49457;&#54868;&#46121;&#45768;&#45796;. &#51060; &#44050;&#51008; &#44592;&#48376;&#44050;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#45124;&#44592;</dt>
<dd>
<p>&#44032;&#49345; &#49436;&#48260;&#44032; &#48708;&#54876;&#49457;&#54868;&#46121;&#45768;&#45796;. &#49436;&#48260;&#50640; &#50529;&#49464;&#49828;&#54616;&#47140; &#54616;&#47732; &#50724;&#47448; &#53076;&#46300; 404(&#49324;&#50857; &#44032;&#45733;&#54620; &#47532;&#49548;&#49828; &#50630;&#51020;)&#44032; &#48152;&#54872;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#49324;&#50857; &#50504;&#54632;</dt>
<dd>
<p>&#44032;&#49345; &#49436;&#48260;&#44032; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;. &#49436;&#48260;&#50640; &#50529;&#49464;&#49828;&#54616;&#47140; &#54616;&#47732; &#50724;&#47448; &#53076;&#46300; 403(&#50836;&#52397; &#49688;&#54665; &#44144;&#48512;)&#51060; &#48152;&#54872;&#46121;&#45768;&#45796;.</p>
</dd>
</dl>
</li>
<li>
<p>&#49352; &#44032;&#49345; &#49436;&#48260;&#50640; &#45824;&#54620; SSO &#50741;&#49496;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#51201;&#51004;&#47196; &#44032;&#49345; &#49436;&#48260;&#45716; HTTP &#49436;&#48708;&#49828;&#51032; SSO(Single Sign-On) &#49444;&#51221;&#51012; &#49345;&#49549;&#54633;&#45768;&#45796;. [&#49324;&#50857;] &#46608;&#45716; [&#49324;&#50857; &#50504;&#54632;]&#51012; &#49440;&#53469;&#54616;&#50668; &#51060; &#44032;&#49345; &#49436;&#48260;&#50640; &#45824;&#54620; Single Sign-On&#51012; &#49324;&#50857; &#46608;&#45716; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54632;&#51004;&#47196;&#50024; HTTP &#49436;&#48708;&#49828; &#49444;&#51221;&#51012; &#45824;&#52404;&#54633;&#45768;&#45796;.</p>
<p>GlassFish Server&#51032; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#45824;&#54620; Single Sign-On&#51008; &#49436;&#48660;&#47551; &#48143; JSP &#54028;&#51068;&#50640;&#49436; &#51648;&#50896;&#46121;&#45768;&#45796;. &#51060; &#44592;&#45733;&#51012; &#53685;&#54644; &#49324;&#50857;&#51088;&#44032; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#47560;&#45796; &#46384;&#47196; &#49324;&#51064;&#50728;&#54616;&#45716; &#44163;&#51060; &#50500;&#45768;&#46972; &#44057;&#51008; &#49324;&#50857;&#51088; &#49324;&#51064;&#50728; &#51221;&#48372;&#44032; &#54596;&#50836;&#54620; &#50668;&#47084; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#51060; &#51221;&#48372;&#47484; &#44277;&#50976;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#54616;&#45208; &#51060;&#49345;&#51032; &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#47484; &#49440;&#53469;&#54616;&#44144;&#45208; &#54596;&#46300;&#47484; &#48708;&#50892; &#46177;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#44592;&#48376; &#50937; &#47784;&#46280;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#44032;&#49345; &#49436;&#48260;&#50640; &#48176;&#52824;&#46108; &#45796;&#47480; &#50937; &#47784;&#46280;&#50640; &#47588;&#54609;&#54624; &#49688; &#50630;&#45716; &#47784;&#46304; &#50836;&#52397;&#50640; &#51025;&#45813;&#54624; &#47784;&#46280;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376; &#50937; &#47784;&#46280;&#51060; &#51648;&#51221;&#46104;&#51648; &#50506;&#51008; &#44221;&#50864; &#48712; &#52968;&#53581;&#49828;&#53944; &#47336;&#53944;&#44032; &#51080;&#45716; &#50937; &#47784;&#46280;&#51060; &#49324;&#50857;&#46121;&#45768;&#45796;. &#48712; &#52968;&#53581;&#49828;&#53944; &#47336;&#53944;&#44032; &#51080;&#45716; &#50937; &#47784;&#46280;&#51060; &#50630;&#51012; &#46412;&#45716; &#49884;&#49828;&#53596; &#44592;&#48376; &#50937; &#47784;&#46280;&#51060; &#49373;&#49457;&#46104;&#50612; &#49324;&#50857;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#47196;&#44536; &#54028;&#51068;] &#54596;&#46300;&#50640; &#51060; &#44032;&#49345; &#49436;&#48260;&#47196;&#48512;&#53552;&#51032; &#47196;&#44613; &#47700;&#49884;&#51648;&#44032; &#45208;&#53440;&#45216; &#54028;&#51068;&#51032; &#44221;&#47196; &#51060;&#47492;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#51201;&#51004;&#47196; &#47196;&#44613; &#47700;&#49884;&#51648;&#45716; &#44592;&#48376; &#49436;&#48260; &#47196;&#44536; domain-dir<code>/logs/server.log</code>&#47196; &#51204;&#49569;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>Docroot &#54596;&#46300;&#50640; &#49436;&#48260;&#51032; &#47336;&#53944; &#47928;&#49436; &#46356;&#47113;&#53664;&#47532;&#50640; &#45824;&#54620; &#51208;&#45824; &#44221;&#47196;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; domain-dir<code>/docroot</code>&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>&#50529;&#49464;&#49828; &#47196;&#44613;&#51012; &#49324;&#50857; &#46608;&#45716; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54616;&#47140;&#47732; [&#50529;&#49464;&#49828; &#47196;&#44613;] &#50741;&#49496;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#51201;&#51004;&#47196; &#44032;&#49345; &#49436;&#48260;&#45716; HTTP &#49436;&#48708;&#49828;&#51032; &#50529;&#49464;&#49828; &#47196;&#44613; &#49444;&#51221;&#51012; &#49345;&#49549;&#54633;&#45768;&#45796;. [&#49324;&#50857;] &#46608;&#45716; [&#49324;&#50857; &#50504;&#54632;]&#51012; &#49440;&#53469;&#54616;&#50668; &#51060; &#44032;&#49345; &#49436;&#48260;&#50640; &#45824;&#54620; &#50529;&#49464;&#49828; &#47196;&#44613;&#51012; &#49324;&#50857; &#46608;&#45716; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54632;&#51004;&#47196;&#50024; HTTP &#49436;&#48708;&#49828; &#49444;&#51221;&#51012; &#45824;&#52404;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#46356;&#47113;&#53664;&#47532;] &#54596;&#46300;&#50640; &#49436;&#48260; &#50529;&#49464;&#49828; &#47196;&#44536;&#51032; &#51208;&#45824; &#46356;&#47113;&#53664;&#47532; &#44221;&#47196;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; domain-dir<code>/logs/access</code>&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#52628;&#44032; &#49549;&#49457;] &#49465;&#49496;&#50640; &#44032;&#49345; &#49436;&#48260;&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#49324;&#50857; &#44032;&#45733;&#54620; &#49549;&#49457;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="ref-virtualserverprops.html">&#44032;&#49345; &#49436;&#48260; &#44288;&#47144; &#49549;&#49457;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
<ul>
<li>
<p>&#49549;&#49457;&#51012; &#52628;&#44032;&#54616;&#47140;&#47732; [&#49549;&#49457; &#52628;&#44032;] &#45800;&#52628;&#47484; &#45572;&#47493;&#45768;&#45796;. &#48712; &#54665;&#51060; &#54364;&#49884;&#46104;&#47732; [&#51060;&#47492;] &#54596;&#46300;&#50640; &#49549;&#49457; &#51060;&#47492;&#51012; &#51077;&#47141;&#54616;&#44256; [&#44050;] &#54596;&#46300;&#50640; &#49549;&#49457;&#44050;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#49549;&#49457;&#51012; &#49688;&#51221;&#54616;&#47140;&#47732; &#49549;&#49457;&#51032; [&#44050;] &#54596;&#46300;&#47484; &#54200;&#51665;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#49549;&#49457;&#51012; &#49325;&#51228;&#54616;&#47140;&#47732; &#49325;&#51228;&#54624; &#49549;&#49457;&#51032; [&#51060;&#47492;] &#54596;&#46300; &#50812;&#51901;&#50640; &#51080;&#45716; &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54620; &#45796;&#51020; [&#49549;&#49457; &#49325;&#51228;] &#45800;&#52628;&#47484; &#45572;&#47493;&#45768;&#45796;.</p>
</li>
</ul>
</li>
<li>
<p>[&#51200;&#51109;]&#51012; &#45572;&#47493;&#45768;&#45796;.</p>

<hr>
<p><b>&#54017;:</b></p>
&#44592;&#48376; &#49444;&#51221;&#51004;&#47196; &#46028;&#50500;&#44032;&#47140;&#47732; [&#44592;&#48376;&#44050; &#47196;&#46300;] &#45800;&#52628;&#47484; &#45572;&#47480; &#45796;&#51020; [&#51200;&#51109;]&#51012; &#45572;&#47493;&#45768;&#45796;.
<hr>

</li>
</ol>
<a id="sthref37" name="sthref37"></a>
<h5>&#44288;&#47144; &#54637;&#47785;</h5>
<ul>
<li>
<p><a href="task-virtualservercreate.html">&#44032;&#49345; &#49436;&#48260;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-virtualserverdelete.html">&#44032;&#49345; &#49436;&#48260;&#47484; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
