<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-threadpoolnew" name="task-threadpoolnew"></a></p>

<h4><a id="sthref72" name="sthref72"></a>&#49828;&#47112;&#46300; &#54400;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#49828;&#47112;&#46300; &#54400;&#51008; &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320; &#48143; ORB&#50640;&#49436; &#49324;&#50857;&#54633;&#45768;&#45796;. &#51068;&#48152;&#51201;&#51004;&#47196; &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#45716; GlassFish Server&#47484; &#49444;&#52824;&#54624; &#46412; &#49373;&#49457;&#46104;&#45716; &#46160; &#44060;&#51032; &#49828;&#47112;&#46300; &#54400; &#51473; &#54616;&#45208;&#47484; &#49324;&#50857;&#54616;&#44256;, ORB&#45716; &#45796;&#47480; &#49828;&#47112;&#46300; &#54400;&#51012; &#49324;&#50857;&#54633;&#45768;&#45796;. &#51060;&#47084;&#54620; &#44592;&#48376; &#49828;&#47112;&#46300; &#54400; &#51473; &#54616;&#45208;&#47484; &#54200;&#51665;&#54616;&#50668; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#46608;&#45716; &#54616;&#46300;&#50920;&#50612; &#49884;&#49828;&#53596;&#50640; &#51201;&#54633;&#54620; &#49444;&#51221;&#51012; &#51648;&#51221;&#54616;&#44144;&#45208;, &#51060;&#47084;&#54620; &#49444;&#51221;&#51012; &#44054;&#45716; &#49828;&#47112;&#46300; &#54400;&#51012; &#49373;&#49457;&#46104;&#50612; &#49324;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<ol>
<li>
<p>&#53456;&#49353; &#53944;&#47532;&#50640;&#49436; [&#44396;&#49457;] &#45432;&#46300;&#47484; &#54869;&#51109;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#44396;&#49457;] &#45432;&#46300;&#50640;&#49436; [&#49828;&#47112;&#46300; &#54400;] &#45432;&#46300;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>[&#49828;&#47112;&#46300; &#54400;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#49828;&#47112;&#46300; &#54400;] &#54168;&#51060;&#51648;&#50640;&#49436; [&#49352;&#47196; &#47564;&#46308;&#44592;]&#47484; &#45572;&#47493;&#45768;&#45796;.</p>
<p>[&#49352; &#49828;&#47112;&#46300; &#54400;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51060;&#47492;] &#54596;&#46300;&#50640; &#49828;&#47112;&#46300; &#54400;&#51032; &#51060;&#47492;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#53364;&#47000;&#49828; &#51060;&#47492;] &#54596;&#46300;&#50640; &#49828;&#47112;&#46300; &#54400;&#51012; &#44396;&#54788;&#54616;&#45716; &#53364;&#47000;&#49828;&#51032; &#51204;&#52404; &#51060;&#47492;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; <code>com.sun.grizzly.http.StatsThreadPool</code>&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#52572;&#45824; &#45824;&#44592;&#50676; &#53356;&#44592;] &#54596;&#46300;&#50640; &#49828;&#47112;&#46300;&#50640;&#49436; &#47700;&#49884;&#51648;&#47484; &#52376;&#47532;&#54624; &#49688; &#51080;&#51012; &#46412;&#44620;&#51648; &#45824;&#44592;&#50676;&#50640; &#51080;&#51012; &#49688; &#51080;&#45716; &#52572;&#45824; &#47700;&#49884;&#51648; &#49688;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#44050;&#51060; &ndash;1&#51060;&#47732; &#45824;&#44592;&#50676; &#53356;&#44592;&#50640; &#51228;&#54620;&#51060; &#50630;&#49845;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 4096&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>&#49828;&#47112;&#46300; &#54400;&#50640; &#46308;&#50612;&#44040; &#49688; &#51080;&#45716; &#52572;&#45824; &#49828;&#47112;&#46300; &#49688;&#47484; [&#52572;&#45824; &#49828;&#47112;&#46300; &#54400; &#53356;&#44592;] &#54596;&#46300;&#50640; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; 5&#51077;&#45768;&#45796;. &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320; &#49828;&#47112;&#46300; &#54400;&#50640;&#45716; &#51060; &#44050;&#51012; &#49324;&#50857;&#54616;&#45716; &#44163;&#51060; &#51339;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>&#49828;&#47112;&#46300; &#54400;&#50640; &#46308;&#50612;&#44040; &#49688; &#51080;&#45716; &#52572;&#49548; &#49828;&#47112;&#46300; &#49688;&#47484; [&#52572;&#49548; &#49828;&#47112;&#46300; &#54400; &#53356;&#44592;] &#54596;&#46300;&#50640; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#49828;&#47112;&#46300; &#54400;&#51012; &#51064;&#49828;&#53556;&#49828;&#54868;&#54624; &#44221;&#50864; &#51060; &#49828;&#47112;&#46300;&#44032; &#49373;&#49457;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 2&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#50976;&#55092; &#49828;&#47112;&#46300; &#49884;&#44036; &#52488;&#44284;] &#54596;&#46300;&#50640; &#54400;&#50640;&#49436; &#49828;&#47112;&#46300;&#44032; &#50976;&#55092; &#49345;&#53468;&#47196; &#50976;&#51648;&#46112; &#49688; &#51080;&#45716; &#52572;&#45824; &#49884;&#44036;(&#52488;)&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#49884;&#44036;&#51060; &#47564;&#47308;&#46104;&#47732; &#49828;&#47112;&#46300;&#44032; &#54400;&#50640;&#49436; &#51228;&#44144;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 900&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#54869;&#51064;]&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
</li>
</ol>
<a id="sthref73" name="sthref73"></a>
<h5>&#44288;&#47144; &#54637;&#47785;</h5>
<ul>
<li>
<p><a href="task-threadpooledit.html">&#49828;&#47112;&#46300; &#54400;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-threadpooldelete.html">&#49828;&#47112;&#46300; &#54400;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
