<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-networklistenernew" name="task-networklistenernew"></a></p>

<h4><a id="sthref40" name="sthref40"></a>&#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</h4>
<a name="BEGIN" id="BEGIN"></a><a id="sthref41" name="sthref41"></a>
<h5>&#49884;&#51089;&#54616;&#44592; &#51204;&#50640;</h5>
<p>&#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#47484; &#49373;&#49457;&#54624; &#46412; &#46041;&#49884;&#50640; &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#50640;&#49436; &#49324;&#50857;&#54624; &#54532;&#47196;&#53664;&#53084;&#51012; &#49373;&#49457;&#54616;&#44144;&#45208; &#47676;&#51200; &#49373;&#49457;&#54620; &#54532;&#47196;&#53664;&#53084;&#51012; &#49324;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51068;&#48152;&#51201;&#51004;&#47196; &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#50752; &#44288;&#47144; &#54532;&#47196;&#53664;&#53084; &#49324;&#51060;&#45716; &#51068;&#45824;&#51068; &#44288;&#44228;&#51060;&#51648;&#47564; &#54596;&#49688; &#49324;&#54637;&#51008; &#50500;&#45785;&#45768;&#45796;.</p>
<ol>
<li>
<p>&#53456;&#49353; &#53944;&#47532;&#50640;&#49436; [&#44396;&#49457;] &#45432;&#46300;&#47484; &#54869;&#51109;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#44396;&#49457;] &#45432;&#46300;&#50640;&#49436; [&#45348;&#53944;&#50892;&#53356; &#44396;&#49457;] &#45432;&#46300;&#47484; &#54869;&#51109;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#45348;&#53944;&#50892;&#53356; &#44396;&#49457;] &#45432;&#46300;&#50640;&#49436; [&#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;] &#45432;&#46300;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>[&#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;] &#54168;&#51060;&#51648;&#50640;&#49436; [&#49352;&#47196; &#47564;&#46308;&#44592;]&#47484; &#45572;&#47493;&#45768;&#45796;.</p>
<p>[&#49352; &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51060;&#47492;] &#54596;&#46300;&#50640; &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#51032; &#51060;&#47492;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320; &#51060;&#47492;&#51008; &#49707;&#51088;&#47196; &#49884;&#51089;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#54532;&#47196;&#53664;&#53084;] &#54596;&#46300;&#50640;&#49436; &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#50752; &#50672;&#44208;&#54624; &#54532;&#47196;&#53664;&#53084;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<ul>
<li>
<p>[&#49352; &#54532;&#47196;&#53664;&#53084; &#49373;&#49457;]&#51012; &#49440;&#53469;&#54616;&#50668; &#44592;&#48376; &#49444;&#51221;&#51004;&#47196; &#49352; &#54532;&#47196;&#53664;&#53084;&#51012; &#49373;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#46608;&#54620; [&#44032;&#49345; &#49436;&#48260;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#54532;&#47196;&#53664;&#53084;&#44284; &#50672;&#44288;&#46112; &#44032;&#49345; &#49436;&#48260;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#54532;&#47196;&#53664;&#53084;&#51032; &#44592;&#48376; &#51060;&#47492;&#51008; &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320; &#51060;&#47492;&#50640; <code>-protocol</code>&#51012; &#52628;&#44032;&#54616;&#50668; &#51648;&#51221;&#46121;&#45768;&#45796;. &#51060; &#44050;&#51008; &#54200;&#51665;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#44592;&#51316; &#54532;&#47196;&#53664;&#53084; &#49324;&#50857;]&#51012; &#49440;&#53469;&#54620; &#45796;&#51020; &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#54532;&#47196;&#53664;&#53084;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;. &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#50640; &#45824;&#54644; &#48372;&#50504;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47140;&#47732; &#48372;&#50504;&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46108; &#54532;&#47196;&#53664;&#53084;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#45716; &#44221;&#50864; &#51068;&#48152;&#51201;&#51004;&#47196; &#51060; &#47532;&#49828;&#45320;&#50640; &#45824;&#54620; &#54532;&#47196;&#53664;&#53084;&#51012; &#51060;&#48120; &#49373;&#49457;&#54664;&#49845;&#45768;&#45796;.</p>
</li>
</ul>
<p>&#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#47484; &#49373;&#49457;&#54624; &#46412;&#47564; &#54532;&#47196;&#53664;&#53084;&#51012; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#50672;&#44288;&#46108; &#54532;&#47196;&#53664;&#53084;&#51008; &#45208;&#51473;&#50640; &#48320;&#44221;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#54532;&#47196;&#53664;&#53084;&#50640; &#46384;&#46972; &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#50640; &#45824;&#54620; &#48372;&#50504;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54624;&#51648; &#50668;&#48512;&#44032; &#44208;&#51221;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>&#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#47484; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47140;&#47732; [&#49345;&#53468; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;. &#47532;&#49828;&#45320;&#44032; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#47532;&#49828;&#45320;&#50640; &#51217;&#49549;&#54616;&#47140;&#44256; &#54616;&#47732; &#49548;&#53011; &#50696;&#50808; &#49324;&#54637;(<code>java.net.ConnectException</code>)&#51060; &#48156;&#49373;&#54633;&#45768;&#45796;.</p>
<p>GlassFish Server 9.1 &#51060;&#51204; &#48260;&#51204;&#50640;&#49436;&#45716; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46108; &#49549;&#49457;&#51060; false&#47196; &#49444;&#51221;&#46108; &#47532;&#49828;&#45320;&#45716; &#54644;&#45817; &#47532;&#49828;&#45320;&#47196; &#51204;&#49569;&#46108; &#47784;&#46304; &#50836;&#52397;&#50640; &#45824;&#54644; 404 &#51025;&#45813; &#53076;&#46300;&#47484; &#48152;&#54872;&#54664;&#49845;&#45768;&#45796;. &#54788;&#51116; GlassFish Server &#48260;&#51204;&#50640;&#49436; &#51060; &#46041;&#51089;&#51012; &#49688;&#54665;&#54616;&#47140;&#47732; &#47532;&#49828;&#45320;&#51032; &#49345;&#53468;&#47484; &#49324;&#50857; &#44032;&#45733;&#51004;&#47196; &#49444;&#51221;&#54616;&#44256; &#50672;&#44288;&#46108; &#47784;&#46304; &#44032;&#49345; &#49436;&#48260;&#51032; &#49345;&#53468;&#47484; OFF&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;. &#44032;&#49345; &#49436;&#48260;&#51032; &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320; &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#45716; &#54644;&#45817; &#44032;&#49345; &#49436;&#48260;&#50752; &#50672;&#44288;&#46108; &#47532;&#49828;&#45320;&#44032; &#45208;&#50676;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>&#51069;&#44592; &#51204;&#50857; [&#48372;&#50504; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#45716; &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#50640;&#49436; &#49324;&#50857;&#54616;&#45716; &#54532;&#47196;&#53664;&#53084;&#50640; &#45824;&#54644; &#48372;&#50504;&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50632;&#45716;&#51648; &#50668;&#48512;&#47484; &#45208;&#53440;&#45253;&#45768;&#45796;.</p>
<p>DAS(&#46020;&#47700;&#51064; &#44288;&#47532; &#49436;&#48260;)&#50640; &#45824;&#54644; <code>admin-listener</code>&#47484; &#44396;&#49457;&#54616;&#50668; <code>server-config</code> &#44396;&#49457;&#51012; &#49324;&#50857;&#54616;&#45716; &#44221;&#50864;, &#51060; &#50741;&#49496;&#51008; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;. &#51060; &#47532;&#49828;&#45320;&#50640; &#45824;&#54644; &#48372;&#50504;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47140;&#47732; &#48372;&#50504; &#44288;&#47532;&#47484; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54644;&#50556; &#54633;&#45768;&#45796;. <a href="../../../common/en/help/ref-securityadmin.html">&#48372;&#50504; &#44288;&#47532;</a>&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</li>
<li>
<p>[JK &#47532;&#49828;&#45320; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#50668; &#47532;&#49828;&#45320;&#44032; Apache&#51032; <code>mod-jk</code> &#54532;&#47196;&#53664;&#53084;&#51012; &#51648;&#50896;&#54616;&#46020;&#47197; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<p><code>mod-jk</code> &#54532;&#47196;&#53664;&#53084;&#51008; Apache <code>httpd</code>(&#50937; &#49436;&#48260;)&#50752; GlassFish Server &#48177;&#50644;&#46300; &#51064;&#49828;&#53556;&#49828; &#44036; &#51204;&#50857; &#53685;&#49888;/&#45348;&#53944;&#50892;&#53356; &#54532;&#47196;&#53664;&#53084;&#51077;&#45768;&#45796;. &#47532;&#49828;&#45320;&#50640;&#49436; &#51060; &#54532;&#47196;&#53664;&#53084;&#51012; &#51648;&#50896;&#54616;&#45716; &#44221;&#50864; <code>httpd</code>&#50640;&#49436; &#47784;&#46304; &#51221;&#51201; &#45236;&#50857;&#51012; &#52376;&#47532;&#54616;&#45716; &#44163;&#51004;&#47196; &#44036;&#51452;&#46104;&#51648;&#47564;, &#46041;&#51201; &#47532;&#49548;&#49828;(&#51593;, &#49436;&#48660;&#47551; &#48143; JSP)&#50640; &#45824;&#54620; &#50836;&#52397;&#51008; <code>mod-jk</code> &#54532;&#47196;&#53664;&#53084;&#51012; &#53685;&#54644; GlassFish Server&#51032; <code>mod-jk</code> &#49324;&#50857; &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#50640; &#46972;&#50864;&#54021;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#54252;&#53944;] &#54596;&#46300;&#50640; &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#50640;&#49436; &#49688;&#49888;&#54624; &#54252;&#53944; &#48264;&#54840;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#50976;&#54952;&#54620; &#44050;&#51008; 1 - 65535&#51077;&#45768;&#45796;. UNIX &#49884;&#49828;&#53596;&#50640;&#49436; 1 - 1024 &#54252;&#53944;&#47484; &#49688;&#49888;&#54616;&#45716; &#49548;&#53011;&#51012; &#49373;&#49457;&#54616;&#47140;&#47732; &#49688;&#54140;&#50976;&#51200; &#44428;&#54620;&#51060; &#54596;&#50836;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51452;&#49548;] &#54596;&#46300;&#50640; &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#50640;&#49436; &#49688;&#49888;&#54624; IP &#51452;&#49548;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#51452;&#49548;&#45716; &#51216;&#51004;&#47196; &#46108; &#49933;&#51060;&#44144;&#45208; IPv6 &#54364;&#44592; &#54805;&#49885;&#51068; &#49688; &#51080;&#49845;&#45768;&#45796;. &#47784;&#46304; IP &#51452;&#49548;&#47484; &#49688;&#49888;&#54616;&#47140;&#47732; <code>any</code>(<code>INADDR_ANY</code>&#51032; &#44221;&#50864;)&#51068; &#49688; &#51080;&#49845;&#45768;&#45796;. &#54840;&#49828;&#53944; &#51060;&#47492;&#51068; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#49828;&#47112;&#46300; &#54400;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#50752; &#50672;&#44288;&#46112; &#49828;&#47112;&#46300; &#54400;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#51068;&#48152;&#51201;&#51004;&#47196; GlassFish Server&#47484; &#49444;&#52824;&#54624; &#46412; &#44396;&#49457;&#46104;&#45716; &#46160; &#44060;&#51032; &#49828;&#47112;&#46300; &#54400; &#51473; &#54616;&#45208;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51204;&#49569;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#50640; &#49324;&#50857;&#54624; &#51204;&#49569; &#50976;&#54805;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#51201;&#51004;&#47196; &#50976;&#51068;&#54620; &#49440;&#53469; &#54637;&#47785;&#51008; <code>tcp</code>&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#54869;&#51064;]&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
</li>
</ol>
<a id="sthref42" name="sthref42"></a>
<h5>&#45796;&#51020; &#45800;&#44228;</h5>
<p>&#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#50640;&#49436; &#49324;&#50857;&#54616;&#45716; &#54532;&#47196;&#53664;&#53084;&#50640; &#45824;&#54644; &#48372;&#50504;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54620; &#44221;&#50864; SSL &#53485;&#50640;&#49436; &#54532;&#47196;&#53664;&#53084;&#51032; SSL &#49444;&#51221;&#51012; &#54200;&#51665;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<a id="sthref43" name="sthref43"></a>
<h5>&#44288;&#47144; &#54637;&#47785;</h5>
<ul>
<li>
<p><a href="task-networklisteneredit.html">&#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#47484; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-networklistenerdelete.html">&#45348;&#53944;&#50892;&#53356; &#47532;&#49828;&#45320;&#47484; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-protocolnew.html">&#54532;&#47196;&#53664;&#53084;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">&#54532;&#47196;&#53664;&#53084;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">&#54532;&#47196;&#53664;&#53084;&#51032; SSL &#49444;&#51221;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">&#54532;&#47196;&#53664;&#53084;&#51032; HTTP &#49444;&#51221;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-protocolfilecacheedit.html">&#54532;&#47196;&#53664;&#53084;&#51032; &#54028;&#51068; &#52880;&#49884; &#49444;&#51221;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">&#54532;&#47196;&#53664;&#53084;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-transportnew.html">&#51204;&#49569;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-transportedit.html">&#51204;&#49569;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-transportdelete.html">&#51204;&#49569;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-virtualservercreate.html">&#44032;&#49345; &#49436;&#48260;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
