<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jdbcconnectionpooledittab" name="ref-jdbcconnectionpooledittab"></a><a id="GHJDB00026" name="GHJDB00026"></a></p>

<h4><a id="sthref44" name="sthref44"></a>Editar Pool de Conex&otilde;es</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Editar Pool de Conex&otilde;es para editar as propriedades gerais de um pool de conex&otilde;es JDBC.</p>
<p>A p&aacute;gina Editar Pool de Conex&otilde;es cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Carregar Defaults</dt>
<dd>
<p>Bot&atilde;o para restaurar defini&ccedil;&otilde;es para seus valores default. Defini&ccedil;&otilde;es que n&atilde;o tiveram seus valores default alterados.</p>
</dd>
<dt>Esvaziar</dt>
<dd>
<p>Bot&atilde;o para reinicializar as conex&otilde;es no pool de conex&otilde;es. Clicar nesse bot&atilde;o destr&oacute;i quaisquer conex&otilde;es existentes, recria as conex&otilde;es estabelecidas para o pool e restaura o pool para seu tamanho inicial e m&iacute;nimo.</p>
</dd>
<dt>Ping</dt>
<dd>
<p>Bot&atilde;o utilizado para verificar se o pool de conex&otilde;es &eacute; utiliz&aacute;vel. Se uma mensagem de erro for exibida quando voc&ecirc; clica nesse bot&atilde;o, verifique se o servidor de banco de dados foi iniciado.</p>
</dd>
<dt>Nome do Pool</dt>
<dd>
<p>O nome do pool de conex&otilde;es. Este &eacute; um campo somente para leitura. Voc&ecirc; s&oacute; poder&aacute; especificar o nome do pool quando criar um pool de conex&otilde;es JDBC.</p>
</dd>
<dt>Tipo de Recurso</dt>
<dd>
<p>Op&ccedil;&otilde;es incluem javax.sql.XADataSource (transa&ccedil;&otilde;es globais), java.sql.ConnectionPoolDataSource (transa&ccedil;&otilde;es locais, poss&iacute;veis melhoras no desempenho), javax.sql.DataSource (somente transa&ccedil;&otilde;es locais), e <code>java.sql.Driver</code>.</p>
</dd>
<dt>Nome de Classe da Fonte de Dados</dt>
<dd>
<p>O nome de classe espec&iacute;fico do fornecedor que implementa a fonte de dados.</p>
</dd>
<dt>Nome de Classe do Driver</dt>
<dd>
<p>O nome da classe do driver JDBC fornecido pelo fornecedor. Se voc&ecirc; selecionou o tipo de recursos java.sql.Driver, esse campo normalmente &eacute; preenchido automaticamente com o nome da classe associado ao driver e ao fornecedor do banco de dados escolhido. Se voc&ecirc; selecionou um dos tipos de recursos de fonte de dados, esse campo &eacute; desativado.</p>
</dd>
<dt>Ping</dt>
<dd>
<p>Se essa op&ccedil;&atilde;o for selecionada, ser&aacute; efetuado o ping autom&aacute;tico no pool durante a cria&ccedil;&atilde;o ou reconfigura&ccedil;&atilde;o, para identificar e avisar sobre valores de atributos com erros. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Descri&ccedil;&atilde;o</dt>
<dd>
<p>Uma breve descri&ccedil;&atilde;o do pool de conex&otilde;es.</p>
</dd>
<dt>Tamanho Inicial e M&iacute;nimo do Pool</dt>
<dd>
<p>O n&uacute;mero m&iacute;nimo de conex&otilde;es no pool. Esse valor tamb&eacute;m determina o n&uacute;mero de conex&otilde;es colocadas no pool quando o pool &eacute; criado ou quando o GlassFish Server &eacute; iniciado. O valor default &eacute; 8.</p>
</dd>
<dt>Tamanho M&aacute;ximo do Pool</dt>
<dd>
<p>O n&uacute;mero m&aacute;ximo de conex&otilde;es no pool. O valor default &eacute; 32.</p>
</dd>
<dt>Quantidade de Redimensionamento do Pool</dt>
<dd>
<p>Quando o pool aumenta e diminui em rela&ccedil;&atilde;o aos tamanhos m&aacute;ximo e m&iacute;nimo, respectivamente, o pool &eacute; redimensionado em batches. Esse valor determina o n&uacute;mero de conex&otilde;es do batch. A defini&ccedil;&atilde;o de um valor muito alto torna demorado o processo de cria&ccedil;&atilde;o e reciclagem de conex&otilde;es; um valor muito baixo compromete a efici&ecirc;ncia. O valor default &eacute; 2.</p>
</dd>
<dt>Time-out para Ociosidade</dt>
<dd>
<p>A quantidade m&aacute;xima de tempo, em segundos, que uma conex&atilde;o pode permanecer inativa no pool. Ap&oacute;s esse per&iacute;odo, a conex&atilde;o ser&aacute; removida do pool. O valor default &eacute; 300.</p>
</dd>
<dt>Tempo M&aacute;ximo de Espera</dt>
<dd>
<p>O tempo m&aacute;ximo, em milissegundos, que a aplica&ccedil;&atilde;o solicitante da conex&atilde;o aguardar&aacute; at&eacute; obter um time-out. O valor default &eacute; 60.000.</p>
</dd>
<dt>Conex&otilde;es N&atilde;o Transacionais</dt>
<dd>
<p>Se essa op&ccedil;&atilde;o for ativada, as conex&otilde;es n&atilde;o transacionais ser&atilde;o retornadas. Por default, essa op&ccedil;&atilde;o n&atilde;o &eacute; especificada.</p>
</dd>
<dt>Isolamento de Transa&ccedil;&atilde;o</dt>
<dd>
<p>Se um n&iacute;vel de isolamento de transa&ccedil;&atilde;o for especificado, as conex&otilde;es desse pool funcionar&atilde;o no n&iacute;vel especificado. Caso contr&aacute;rio, as conex&otilde;es funcionar&atilde;o com os n&iacute;veis de isolamento default, fornecidos pelo driver JDBC. Por default, essa op&ccedil;&atilde;o n&atilde;o &eacute; especificada.</p>
</dd>
<dt>N&iacute;vel de Isolamento</dt>
<dd>
<p>Se a caixa de sele&ccedil;&atilde;o Garantido for marcada, todas as conex&otilde;es obtidas no pool ter&atilde;o o mesmo n&iacute;vel de isolamento. Por exemplo, se o n&iacute;vel de isolamento da conex&atilde;o for alterado via programa&ccedil;&atilde;o (com <code>con.setTransactionIsolation</code>), durante a &uacute;ltima utiliza&ccedil;&atilde;o, esse mecanismo alterar&aacute; o status para o n&iacute;vel de isolamento especificado.</p>
<p>Esse campo somente &eacute; aplic&aacute;vel se um n&iacute;vel de isolamento de transa&ccedil;&atilde;o for especificado.</p>
</dd>
</dl>
<a id="sthref45" name="sthref45"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">Para Configurar Acesso ao Banco de Dados</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">Para Integrar um Driver JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">Para Criar um Pool de Conex&otilde;es do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">Para Editar Defini&ccedil;&otilde;es Gerais do Pool de Conex&otilde;es do JDBC</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">Para Verificar as Defini&ccedil;&otilde;es do Pool de Conex&otilde;es</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">Editar Atributos Avan&ccedil;ados do Pool de Conex&otilde;es do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">Editar Propriedades do Pool de Conex&otilde;es do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">Para Deletar um Pool de Conex&otilde;es JDBC</a></p>
</li>
</ul>
<a id="sthref46" name="sthref46"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00001"><code>add-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00036"><code>create-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00088"><code>delete-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00135"><code>flush-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00173"><code>list-jdbc-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00214"><code>ping-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00234"><code>start-database</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00239"><code>stop-database</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
