<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jdbc-properties" name="ref-jdbc-properties"></a></p>

<h4><a id="sthref56" name="sthref56"></a><a id="sthref57" name="sthref57"></a>Propriedades Espec&iacute;ficas para os Pools de Conex&otilde;es JDBC</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>A maioria dos drivers JDBC permitem o uso de listas de propriedades padr&atilde;o para especificar usu&aacute;rio, senha e outras informa&ccedil;&otilde;es de configura&ccedil;&atilde;o de recursos. Embora as propriedades sejam opcionais no GlassFish Server, algumas delas podem ser necess&aacute;rias para a maioria dos bancos de dados. Para obter detalhes, consulte a API JDBC 4.0 Standard Extension.</p>
<p>A altera&ccedil;&atilde;o de propriedades do driver JDBC exige que o servidor seja reiniciado.</p>
<p>As seguintes propriedades padr&atilde;o s&atilde;o comuns a muitos fornecedores de JDBC. Para obter informa&ccedil;&otilde;es sobre as propriedades dispon&iacute;veis para o seu driver JDBC, consulte a documenta&ccedil;&atilde;o do fornecedor.</p>
<dl>
<dt><code>user</code></dt>
<dd>
<p>Especifica o nome de usu&aacute;rio para conex&atilde;o ao banco de dados.</p>
</dd>
<dt><code>password</code></dt>
<dd>
<p>Especifica a senha para conex&atilde;o ao banco de dados.</p>
</dd>
<dt><code>databaseName</code></dt>
<dd>
<p>Especifica o banco de dados para esse pool de conex&otilde;es.</p>
</dd>
<dt><code>serverName</code></dt>
<dd>
<p>Especifica o servidor de banco de dados para esse pool de conex&otilde;es.</p>
</dd>
<dt><code>port</code></dt>
<dd>
<p>Especifica a porta em que o servidor de banco de dados receber&aacute; as solicita&ccedil;&otilde;es.</p>
</dd>
<dt><code>networkProtocol</code></dt>
<dd>
<p>Especifica o protocolo de comunica&ccedil;&atilde;o.</p>
</dd>
<dt><code>roleName</code></dt>
<dd>
<p>Especifica o nome da atribui&ccedil;&atilde;o SQL inicial.</p>
</dd>
<dt><code>datasourceName</code></dt>
<dd>
<p>Especifica um <code>XADataSource</code> adjacentes ou um <code>ConnectionPoolDataSource</code> se o pool de conex&otilde;es estiver conclu&iacute;do.</p>
</dd>
<dt><code>description</code></dt>
<dd>
<p>Especifica uma descri&ccedil;&atilde;o de texto.</p>
</dd>
<dt><code>url</code></dt>
<dd>
<p>Especifica o URL para esse pool de conex&otilde;es. Embora essa n&atilde;o seja uma propriedade padr&atilde;o, ela &eacute; de uso comum.</p>
</dd>
</dl>






<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
