<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jdbcconnpooladvanceattrtab" name="ref-jdbcconnpooladvanceattrtab"></a><a id="GHJDB00027" name="GHJDB00027"></a></p>

<h4><a id="sthref47" name="sthref47"></a>Editar Atributos Avan&ccedil;ados do Pool de Conex&otilde;es</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Editar Atributos Avan&ccedil;ados do Pool de Conex&otilde;es para especificar atributos que ajudam a diagnosticar perdas de conex&atilde;o e a melhorar a facilidade de uso.</p>
<p>A p&aacute;gina Editar Atributos Avan&ccedil;ados do Pool de Conex&otilde;es cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Carregar Defaults</dt>
<dd>
<p>Bot&atilde;o para restaurar defini&ccedil;&otilde;es para seus valores default. Defini&ccedil;&otilde;es que n&atilde;o tiveram seus valores default alterados.</p>
</dd>
<dt>Nome do Pool</dt>
<dd>
<p>O nome do pool de conex&otilde;es. O nome &eacute; um campo somente para leitura. Voc&ecirc; s&oacute; poder&aacute; especificar o nome do pool de conex&otilde;es quando criar um novo pool de conex&otilde;es JDBC.</p>
</dd>
<dt>Time-out da Instru&ccedil;&atilde;o</dt>
<dd>
<p>Per&iacute;odo em segundos, ap&oacute;s o qual as consultas de execu&ccedil;&atilde;o anormalmente longa ser&atilde;o encerradas. O GlassFish Server define o <code>Time-out para Consulta</code> nas instru&ccedil;&otilde;es criadas. Um valor de -1 significa que a op&ccedil;&atilde;o est&aacute; desativada. O valor default &eacute; -1.</p>
</dd>
<dt>Tamanho do Cache de Instru&ccedil;&atilde;o</dt>
<dd>
<p>O n&uacute;mero de instru&ccedil;&otilde;es a serem colocadas no cache usando o mecanismo de cache LRU (Menos Usado Recentemente). Um valor de 0 desativa o armazenamento no cache de instru&ccedil;&otilde;es. O valor default &eacute; 0.</p>
</dd>
<dt>SQL Inicial</dt>
<dd>
<p>Uma string SQL a ser executada sempre que uma conex&atilde;o &eacute; criada (n&atilde;o reutilizada) no pool. A execu&ccedil;&atilde;o dessa string inicializa o estado da conex&atilde;o.</p>
</dd>
<dt>Listeners de Rastreamento de SQL</dt>
<dd>
<p>Uma lista separada por v&iacute;rgulas de nomes de classes de implementa&ccedil;&atilde;o do listener, que especifica que as instru&ccedil;&otilde;es SQL executadas por aplica&ccedil;&otilde;es ser&atilde;o rastreadas. As classes do listener devem implementar a interface <code>org.glassfish.api.jdbc.SQLTraceListener</code>. O uso de listeners permite a f&aacute;cil filtragem de registros de mensagens para as instru&ccedil;&otilde;es SQL e ajuda os administradores a analisarem as instru&ccedil;&otilde;es.</p>
</dd>
<dt>Ajustar Objetos do JDBC</dt>
<dd>
<p>Se essa op&ccedil;&atilde;o estiver ativada, as aplica&ccedil;&otilde;es obter&atilde;o objetos encapsulados em JDBC para Statement, PreparedStatement, CallableStatement, ResultSet, DatabaseMetaData. Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</dd>
<dt>Agrupamento</dt>
<dd>
<p>Permite agrupamento de conex&otilde;es para o pool. Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</dd>
<dt>Validar no M&aacute;ximo uma Vez</dt>
<dd>
<p>Especifica o intervalo de tempo, em segundos, entre sucessivas solicita&ccedil;&otilde;es para validar uma conex&atilde;o no m&aacute;ximo uma vez. A defini&ccedil;&atilde;o desse atributo para um valor apropriado minimiza o n&uacute;mero de solicita&ccedil;&otilde;es de valida&ccedil;&atilde;o feitos por uma conex&atilde;o. O valor default &eacute; 0, o que significa que o atributo n&atilde;o est&aacute; ativado.</p>
</dd>
<dt>Time-out para Perda de Conex&atilde;o</dt>
<dd>
<p>Per&iacute;odo em segundos para rastrear as perdas de conex&atilde;o em um pool de conex&otilde;es. Use esse campo para detectar potenciais perdas de conex&atilde;o pela aplica&ccedil;&atilde;o. Uma conex&atilde;o que n&atilde;o &eacute; retornada para o pool pela aplica&ccedil;&atilde;o dentro do per&iacute;odo especificado &eacute; assumida como tendo uma perda potencial, e um rastreamento de pilha do chamador &eacute; registrado. Um valor de 0 que o rastreamento de perda da conex&atilde;o est&aacute; desativado. O valor default &eacute; 0.</p>
<p>Use esse campo junto com Reclama&ccedil;&atilde;o para Perda, para evitar potenciais perdas de conex&atilde;o pela aplica&ccedil;&atilde;o.</p>
</dd>
<dt>Reclama&ccedil;&atilde;o para Perda de Conex&atilde;o</dt>
<dd>
<p>Se essa op&ccedil;&atilde;o est&aacute; ativada, as conex&otilde;es perdidas ser&atilde;o restauradas no pool ap&oacute;s a conclus&atilde;o do rastreamento de perda da conex&atilde;o. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Time-out para Perda de Instru&ccedil;&atilde;o</dt>
<dd>
<p>O tempo, em segundos, do rastreamento de perda de instru&ccedil;&otilde;es em um pool de conex&otilde;es. Use esse campo para detectar poss&iacute;veis perdas de instru&ccedil;&otilde;es na aplica&ccedil;&atilde;o. Considera-se que uma instru&ccedil;&atilde;o que n&atilde;o &eacute; retornada para o pool pela aplica&ccedil;&atilde;o no per&iacute;odo especificado tenha perdas, e um rastreamento de pilha do chamador &eacute; conectado. Um valor de 0 significa que o rastreamento de perda de instru&ccedil;&otilde;es est&aacute; desativado. O valor default &eacute; 0.</p>
<p>Use esse campo junto da Reclama&ccedil;&atilde;o para Perda de Instru&ccedil;&atilde;o para evitar poss&iacute;veis perdas da conex&atilde;o da aplica&ccedil;&atilde;o.</p>
</dd>
<dt>Reclama&ccedil;&atilde;o para Perda de Instru&ccedil;&atilde;o</dt>
<dd>
<p>Se essa op&ccedil;&atilde;o for ativada, instru&ccedil;&otilde;es perdidas ser&atilde;o restauradas para o pool depois que o rastreamento de perda de instru&ccedil;&atilde;o seja conclu&iacute;do. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Novas Tentativas de Cria&ccedil;&atilde;o</dt>
<dd>
<p>O n&uacute;mero de tentativas a serem feitas se houver uma falha na cria&ccedil;&atilde;o de uma nova conex&atilde;o. O valor de 0 significa que nenhuma tentativa ser&aacute; feita para criar a conex&atilde;o novamente. O valor default &eacute; 0.</p>
</dd>
<dt>Intervalo para Nova Tentativa</dt>
<dd>
<p>O intervalo de tempo, em segundos, entre duas tentativas de criar uma conex&atilde;o. O valor default &eacute; 10. Esse atributo s&oacute; ser&aacute; usado se o valor Novas Tentativas de Cria&ccedil;&atilde;o for maior que 0.</p>
</dd>
<dt>Associa&ccedil;&atilde;o Lenta</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o estiver ativada, uma conex&atilde;o f&iacute;sica s&oacute; ser&aacute; associada a um conjunto l&oacute;gico quando a conex&atilde;o for usada. As conex&otilde;es ser&atilde;o desassociadas quando a transa&ccedil;&atilde;o for conclu&iacute;da e um m&eacute;todo de componente for finalizado, o que ajuda a reutilizar as conex&otilde;es f&iacute;sicas. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Aloca&ccedil;&atilde;o para Conex&atilde;o Lenta</dt>
<dd>
<p>Se essa op&ccedil;&atilde;o est&aacute; ativada, um recurso para a transa&ccedil;&atilde;o ser&aacute; inscrito somente quando a transa&ccedil;&atilde;o for realmente usada em um m&eacute;todo. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Associar a Thread</dt>
<dd>
<p>Se essa op&ccedil;&atilde;o est&aacute; ativada, uma associa&ccedil;&atilde;o ser&aacute; estabelecida entre uma conex&atilde;o com o thread, para quando o mesmo thread for necess&aacute;rio &agrave; uma conex&atilde;o, a conex&atilde;o j&aacute; associada ao thread poder&aacute; ser reutilizada, n&atilde;o incorrendo, portanto, na sobrecarga para obten&ccedil;&atilde;o de uma conex&atilde;o no pool. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Correspond&ecirc;ncia de Conex&otilde;es</dt>
<dd>
<p>Se essa op&ccedil;&atilde;o est&aacute; ativada, uma conex&atilde;o que &eacute; selecionada do pool deveria ser correspondida com as conex&otilde;es que t&ecirc;m determinadas credenciais. Essa op&ccedil;&atilde;o precisar&aacute; ser ativada se o pool de conex&otilde;es for usado por aplica&ccedil;&otilde;es que tiverem v&aacute;rias credenciais de usu&aacute;rio. Essa op&ccedil;&atilde;o poder&aacute; ser desativada com seguran&ccedil;a se o administrador souber que as conex&otilde;es no pool ser&atilde;o sempre homog&ecirc;neas e, portanto, uma conex&atilde;o selecionada no pool n&atilde;o precisar&aacute; coincidir com o adaptador de recurso. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Utiliza&ccedil;&atilde;o M&aacute;xima da Conex&atilde;o</dt>
<dd>
<p>O n&uacute;mero de vezes que uma conex&atilde;o deve ser reutilizada pelo pool. Depois que uma conex&atilde;o &eacute; reutilizada por um n&uacute;mero especificado de vezes, ela ser&aacute; fechada. Ao limitar o n&uacute;mero de vezes que uma conex&atilde;o pode ser reutilizada, voc&ecirc; poder&aacute; evitar perdas de instru&ccedil;&otilde;es, caso uma aplica&ccedil;&atilde;o n&atilde;o feche as instru&ccedil;&otilde;es. Um valor de 0 significa que este atributo est&aacute; desativado. O valor default &eacute; 0.</p>
</dd>
<dt>Valida&ccedil;&atilde;o da Conex&atilde;o</dt>
<dd>
<p>Se essa op&ccedil;&atilde;o for ativada, a valida&ccedil;&atilde;o de conex&atilde;o ser&aacute; necess&aacute;ria, permitindo que o servidor se reconecte em caso de falha.</p>
</dd>
<dt>M&eacute;todo de Valida&ccedil;&atilde;o</dt>
<dd>
<p>O GlassFish Server pode validar as conex&otilde;es ao banco de dados nas seguintes formas.</p>
<dl>
<dt><code>confirma&ccedil;&atilde;o autom&aacute;tica</code> e <code>metadados</code></dt>
<dd>
<p>O GlassFish Server valida a conex&atilde;o ao chamar o m&eacute;todo <code>con.getAutoCommit</code> ou <code>con.getMetaData</code>.</p>

<hr>
<p><b>Observa&ccedil;&atilde;o:</b></p>
Muitos drivers JDBC armazenam no cache os resultados dessas chamadas. Como resultado, o uso dessas chamadas nem sempre fornece valida&ccedil;&otilde;es confi&aacute;veis. Verifique com o fornecedor do driver para determinar se essas chamadas s&atilde;o ou n&atilde;o armazenadas no cache.
<hr>

</dd>
<dt><code>custom-validation</code></dt>
<dd>
<p>O GlassFish Server usa um mecanismo de valida&ccedil;&atilde;o definido pelo usu&aacute;rio especificado pela classe de implementa&ccedil;&atilde;o personalizada no campo Nome da Classe de Valida&ccedil;&atilde;o.</p>
</dd>
<dt><code>table</code></dt>
<dd>
<p>A aplica&ccedil;&atilde;o consulta a tabela de banco de dados especificada. A tabela deve existir e estar acess&iacute;vel, mas n&atilde;o precisa conter linhas. N&atilde;o use uma tabela existente que tenha um n&uacute;mero grande de linhas, nem uma tabela que seja acessada com frequ&ecirc;ncia.</p>
</dd>
</dl>
</dd>
<dt>Nome da Tabela</dt>
<dd>
<p>Nome da tabela de banco de dados para valida&ccedil;&atilde;o. Esse campo s&oacute; ser&aacute; aplic&aacute;vel se o M&eacute;todo de Valida&ccedil;&atilde;o tiver sido definido como <code>table</code>. Voc&ecirc; pode selecionar o nome da lista drop-down ou digit&aacute;-lo.</p>
</dd>
<dt>Nome da Classe de Valida&ccedil;&atilde;o</dt>
<dd>
<p>O nome da classe de implementa&ccedil;&atilde;o de valida&ccedil;&atilde;o personalizada. Esse campo s&oacute; ser&aacute; aplic&aacute;vel se o M&eacute;todo de Valida&ccedil;&atilde;o tiver sido definido como <code>custom-validation</code>. O nome da classe fornecido precisa estar acess&iacute;vel ao GlassFish Server. A classe especificada deve implementar a interface <code>org.glassfish.api.jdbc.ConnectionValidation</code>. Voc&ecirc; pode selecionar o nome da lista drop-down ou digit&aacute;-lo.</p>
</dd>
<dt>Em Caso de Falha</dt>
<dd>
<p>Se essa op&ccedil;&atilde;o for ativada, o GlassFish Server fechar&aacute; todas as conex&otilde;es do pool e as restabelecer&aacute; quando alguma conex&atilde;o falhar. Se a op&ccedil;&atilde;o for desativada, cada conex&atilde;o individual somente ser&aacute; restabelecida quando for usada. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Permitir Chamadores que n&atilde;o Sejam Componentes</dt>
<dd>
<p>Se essa op&ccedil;&atilde;o for ativada, o pool poder&aacute; ser usado pelos chamadores n&atilde;o de componentes; por exemplo; filtros de servlet gerenciadores de persist&ecirc;ncia de terceiros. As conex&otilde;es obtidas por chamadores n&atilde;o de componente n&atilde;o s&atilde;o automaticamente fechadas no final de uma transa&ccedil;&atilde;o pelo cont&ecirc;iner. Elas precisam ser explicitamente fechadas pelo chamador. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
</dl>
<a id="sthref48" name="sthref48"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">Para Configurar Acesso ao Banco de Dados</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">Para Integrar um Driver JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">Para Criar um Pool de Conex&otilde;es do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">Para Editar Defini&ccedil;&otilde;es Gerais do Pool de Conex&otilde;es do JDBC</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">Para Verificar as Defini&ccedil;&otilde;es do Pool de Conex&otilde;es</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">Editar Atributos Avan&ccedil;ados do Pool de Conex&otilde;es do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">Editar Propriedades do Pool de Conex&otilde;es do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">Para Deletar um Pool de Conex&otilde;es JDBC</a></p>
</li>
</ul>
<a id="sthref49" name="sthref49"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00001"><code>add-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00036"><code>create-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00088"><code>delete-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00135"><code>flush-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00173"><code>list-jdbc-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00214"><code>ping-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00234"><code>start-database</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00239"><code>stop-database</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
