<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jdbcresources" name="ref-jdbcresources"></a></p>

<h4><a id="sthref29" name="sthref29"></a>Recursos JDBC</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Um recurso de Java DataBase Connectivity (fonte de dados) fornece aplica&ccedil;&otilde;es com todos os meios para conectar-se a um banco de dados. Em geral, o administrador cria um recurso JDBC para cada banco de dados acessado pelas aplica&ccedil;&otilde;es implantadas em um dom&iacute;nio; entretanto, &eacute; poss&iacute;vel criar mais de um recurso JDBC para um banco de dados.</p>
<p>As aplica&ccedil;&otilde;es obt&ecirc;m uma conex&atilde;o do banco de dados de um pool de conex&otilde;es, pesquisando por uma fonte de dados na &aacute;rvore API de Java Naming and Directory Interface (JNDI) e solicitando uma conex&atilde;o. O pool de conex&otilde;es associado &agrave; fonte de dados prov&ecirc; a conex&atilde;o com a aplica&ccedil;&atilde;o.</p>
<p>Use a p&aacute;gina Recursos JDBC para configurar os recursos JDBC.</p>
<p>Para cada recurso, as informa&ccedil;&otilde;es a seguir s&atilde;o fornecidas.</p>
<dl>
<dt>Nome JNDI</dt>
<dd>
<p>Um nome exclusivo que identifica o recurso JDBC.</p>
</dd>
<dt>Nome L&oacute;gico JNDI</dt>
<dd>
<p>O nome l&oacute;gico JNDI para o recurso. Consulte <a href="../../../common/en/help/ref-logicaljndinames.html">Nomes L&oacute;gicos JNDI</a> para obter mais informa&ccedil;&otilde;es.</p>
</dd>
<dt>Ativado</dt>
<dd>
<p>(Esta coluna s&oacute; ser&aacute; exibida se a inst&acirc;ncia do servidor default, <code>server</code>, existir no dom&iacute;nio.)</p>
<p>Exibe uma marca de sele&ccedil;&atilde;o se o recurso estiver ativado ou um X se o recurso estiver desativado.</p>
</dd>
<dt>Status</dt>
<dd>
<p>(Esta coluna s&oacute; ser&aacute; exibida se os clusters ou inst&acirc;ncias standalone tiverem sido criadas no dom&iacute;nio.)</p>
<p>O n&uacute;mero de clusters e inst&acirc;ncias independentes ao qual o recurso est&aacute; direcionado e em quantos desses o recurso est&aacute; ativado. Por exemplo, "Ativado em 2 de 4 Alvos" significa que o recurso est&aacute; direcionado para quatro clusters e inst&acirc;ncias standalone e que est&aacute; ativado em dois desses quatro alvos.</p>
</dd>
<dt>Pool de Conex&otilde;es</dt>
<dd>
<p>O pool de conex&otilde;es JDBC associado ao recurso.</p>
</dd>
<dt>Descri&ccedil;&atilde;o</dt>
<dd>
<p>Uma breve descri&ccedil;&atilde;o do recurso.</p>
</dd>
</dl>
<p>A tabela Recursos tamb&eacute;m cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Novo</dt>
<dd>
<p>Bot&atilde;o utilizado para criar um novo recurso.</p>
</dd>
<dt>Deletar</dt>
<dd>
<p>Bot&atilde;o utilizado para deletar um ou mais recursos selecionados.</p>
</dd>
<dt>Ativar</dt>
<dd>
<p>Bot&atilde;o utilizado para ativar um ou mais recursos selecionados.</p>
</dd>
<dt>Desativar</dt>
<dd>
<p>Bot&atilde;o utilizado para desativar um ou mais recursos selecionados.</p>
</dd>
</dl>
<a id="sthref30" name="sthref30"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">Para Configurar Acesso ao Banco de Dados</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">Para Integrar um Driver JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcenew.html">Para Criar um Recurso do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesedit.html">Para Editar um Recurso do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesdelete.html">Para Deletar um Recurso do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">Para Criar um Pool de Conex&otilde;es do JDBC</a></p>
</li>
</ul>
<a id="sthref31" name="sthref31"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00001"><code>add-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00037"><code>create-jdbc-resource</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00089"><code>delete-jdbc-resource</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00174"><code>list-jdbc-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00036"><code>create-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00234"><code>start-database</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00239"><code>stop-database</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
