<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jdbcconnectionpooledit" name="task-jdbcconnectionpooledit"></a></p>

<h4><a id="sthref14" name="sthref14"></a>Para Editar Defini&ccedil;&otilde;es Gerais do Pool de Conex&otilde;es do JDBC</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Recursos.</p>
</li>
<li>
<p>No n&oacute; Recursos, expanda o n&oacute; JDBC.</p>
</li>
<li>
<p>No n&oacute; JDBC, selecione o n&oacute; Pools de Conex&otilde;es.</p>
<p>A p&aacute;gina Pools de Conex&otilde;es ser&aacute; aberta.</p>
</li>
<li>
<p>Clique no nome do pool de conex&otilde;es a ser editado.</p>
<p>A p&aacute;gina Editar Pool de Conex&otilde;es ser&aacute; aberta.</p>
</li>
<li>
<p>Na lista drop-down Tipo de Recurso, selecione um tipo de recurso.</p>
<p>As op&ccedil;&otilde;es incluem <code>javax.sql.DataSource</code> (somente transa&ccedil;&otilde;es locais), <code>javax.sql.XADataSource</code> (transa&ccedil;&otilde;es globais) e <code>java.sql.ConnectionPoolDataSource</code> (transa&ccedil;&otilde;es locais; poss&iacute;veis melhorias de desempenho).</p>
</li>
<li>
<p>No campo Nome da classe da fonte de dados, digite o nome da classe espec&iacute;fica do fornecedor que implementa a API <code>DataSource</code>, <code>ConnectionPoolDataSource</code> ou <code>XADataSource</code>.</p>
<p>Se voc&ecirc; selecionou um dos tipos de recursos da fonte de dados, esse campo &eacute; normalmente preenchido automaticamente com o nome da classe associado ao tipo de recursos e com o fornecedor do banco de dados de sua escolha. Se voc&ecirc; selecionou o tipo de recurso<code>java.sql.Driver</code>, esse campo ser&aacute; desativado.</p>
</li>
<li>
<p>No campo Nome da Classe do Driver, digite o nome da classe espec&iacute;fica do fornecedor que implementa a API <code>java.sql.Driver</code>.</p>
<p>Se voc&ecirc; selecionou o tipo de recurso <code>java.sql.Driver</code>, normalmente esse campo &eacute; automaticamente preenchido com o nome da classe associado ao driver do fornecedor de banco de dados de sua escolha. Se voc&ecirc; selecionou um dos tipos de recursos de fonte de dados, esse campo &eacute; desativado.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Ping Ativado para efetuar o ping autom&aacute;tico no pool durante a cria&ccedil;&atilde;o ou reconfigura&ccedil;&atilde;o, para identificar e avisar sobre valores de atributos com erros.</p>
<p>Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>No campo Descri&ccedil;&atilde;o, digite uma descri&ccedil;&atilde;o breve do pool de conex&otilde;es.</p>
</li>
<li>
<p>No campo Tamanho Inicial e M&iacute;nimo do Pool, digite o n&uacute;mero m&iacute;nimo de conex&otilde;es nesse pool.</p>
<p>Esse valor tamb&eacute;m determina o n&uacute;mero de conex&otilde;es colocadas no pool quando o pool &eacute; criado ou quando o GlassFish Server &eacute; iniciado. O valor default &eacute; 8.</p>
</li>
<li>
<p>No campo Tamanho M&aacute;ximo do Pool, digite o n&uacute;mero m&aacute;ximo de conex&otilde;es nesse Pool.</p>
<p>O valor default &eacute; 32.</p>
</li>
<li>
<p>No campo Quantidade de Redimensionamento do Pool, digite o n&uacute;mero de conex&otilde;es por batch de redimensionamento do pool.</p>
<p>Quando o pool aumenta e diminui em rela&ccedil;&atilde;o aos tamanhos m&aacute;ximo e m&iacute;nimo, respectivamente, o pool &eacute; redimensionado em batches. Esse valor determina o n&uacute;mero de conex&otilde;es do batch. A defini&ccedil;&atilde;o de um valor muito alto torna demorado o processo de cria&ccedil;&atilde;o e reciclagem de conex&otilde;es; um valor muito baixo compromete a efici&ecirc;ncia. O valor default &eacute; 2.</p>
</li>
<li>
<p>No campo Time-out para Ociosidade, digite o tempo m&aacute;ximo, em segundos, para que uma conex&atilde;o permane&ccedil;a ociosa no pool.</p>
<p>Ap&oacute;s esse per&iacute;odo, a conex&atilde;o ser&aacute; removida do pool. O valor default &eacute; 300.</p>
</li>
<li>
<p>No campo Tempo M&aacute;ximo de Espera, digite o tempo m&aacute;ximo, em milissegundos, que a aplica&ccedil;&atilde;o solicitante da conex&atilde;o aguardar&aacute; at&eacute; obter um time-out.</p>
<p>O valor default &eacute; 60.000.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Conex&otilde;es N&atilde;o Transacionais Ativadas para retornar conex&otilde;es n&atilde;o transacionais.</p>
<p>Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>Na lista drop-down, selecione o n&iacute;vel de Isolamento de Transa&ccedil;&atilde;o para o pool de conex&otilde;es.</p>
<p>Se n&atilde;o especificado, as conex&otilde;es funcionar&atilde;o com os n&iacute;veis de isolamento default, fornecidos pelo driver JDBC. Por default, essa op&ccedil;&atilde;o n&atilde;o &eacute; especificada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o N&iacute;vel de Isolamento Garantido para que todas as conex&otilde;es obtidas no pool tenham o mesmo n&iacute;vel de isolamento.</p>
<p>Por exemplo, se o n&iacute;vel de isolamento da conex&atilde;o for alterado via programa&ccedil;&atilde;o (com <code>con.setTransactionIsolation</code>), durante a &uacute;ltima utiliza&ccedil;&atilde;o, esse mecanismo alterar&aacute; o status para o n&iacute;vel de isolamento especificado.</p>
<p>Essa defini&ccedil;&atilde;o s&oacute; ser&aacute; aplic&aacute;vel se um n&iacute;vel de isolamento de transa&ccedil;&atilde;o for especificado.</p>
</li>
<li>
<p>Clique no bot&atilde;o Ping para verificar a conex&atilde;o ao banco de dados.</p>
<p>O Console de Administra&ccedil;&atilde;o tenta se conectar ao banco de dados. Se uma mensagem de erro for exibida, verifique se o servidor de banco de dados foi iniciado.</p>
</li>
<li>
<p>Clique no bot&atilde;o Esvaziar para redefinir o pool de conex&otilde;es ao seu estado inicial.</p>
<p>Quaisquer conex&otilde;es ativas existentes s&atilde;o destru&iacute;das, o que significa que as transa&ccedil;&otilde;es associadas com essas conex&otilde;es ser&atilde;o perdidas. O subcomando ent&atilde;o recria as conex&otilde;es iniciais para o pool e restaura o pool a seu tamanho est&aacute;vel.</p>
</li>
<li>
<p>Clique em Salvar.</p>

<hr>
<p><b>Dica:</b></p>
Para voltar &agrave;s defini&ccedil;&otilde;es default, clique no bot&atilde;o Carregar Defaults e depois em Salvar.
<hr>

</li>
</ol>
<a id="sthref15" name="sthref15"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">Para Configurar Acesso ao Banco de Dados</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">Para Integrar um Driver JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcenew.html">Para Criar um Recurso do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesedit.html">Para Editar um Recurso do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcetargets.html">Para Editar Alvos do Recurso do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesdelete.html">Para Deletar um Recurso do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">Para Criar um Pool de Conex&otilde;es do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">Editar Atributos Avan&ccedil;ados do Pool de Conex&otilde;es do JDBC</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">Para Verificar as Defini&ccedil;&otilde;es do Pool de Conex&otilde;es</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">Editar Propriedades do Pool de Conex&otilde;es do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">Para Deletar um Pool de Conex&otilde;es JDBC</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
