<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jdbcconnectionpoolnew" name="task-jdbcconnectionpoolnew"></a></p>

<h4><a id="sthref14" name="sthref14"></a>Para Criar um Pool de Conex&otilde;es do JDBC</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Ao criar um pool de conex&otilde;es com a Console de Administra&ccedil;&atilde;o, voc&ecirc; define os aspectos de uma conex&atilde;o para um banco de dados espec&iacute;fico.</p>
<a id="sthref15" name="sthref15"></a>
<h5>Antes de Come&ccedil;ar</h5>
<p>Para criar um pool de conex&otilde;es, primeiro voc&ecirc; deve instalar e integrar um driver que suporte a API da JDBC (driver JDBC). Consulte <a href="task-integratejdbcdriver.html">Para Integrar um Driver JDBC</a>.</p>
<p>As seguintes informa&ccedil;&otilde;es s&atilde;o necess&aacute;rias &agrave; cria&ccedil;&atilde;o do pool de conex&otilde;es JDBC. Colete essas informa&ccedil;&otilde;es antes de continuar:</p>
<ul>
<li>
<p>Nome do fornecedor do driver de banco de dados</p>
</li>
<li>
<p>Tipo de recurso, por exemplo, <code>javax.sql.DataSource</code> (somente transa&ccedil;&otilde;es locais), <code>java.sql.ConnectionPoolDataSource</code> (transa&ccedil;&otilde;es locais; poss&iacute;veis melhorias de desempenho) e <code>javax.sql.XADataSource</code> (transa&ccedil;&otilde;es globais) <code>java.sql.Driver</code>.</p>
</li>
<li>
<p>Nome de classe da fonte de dados</p>
</li>
<li>
<p>Propriedades necess&aacute;rias; por exemplo, nome do banco de dados (URL), nome de usu&aacute;rio e senha</p>
</li>
</ul>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, selecione o n&oacute; Tarefas Comuns.</p>
<p>A p&aacute;gina Tarefas Comuns ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Tarefas Comuns, clique no bot&atilde;o Criar Novo Pool de Conex&otilde;es JDBC.</p>
<p>A p&aacute;gina Novo Pool de Conex&otilde;es JDBC (Etapa 1 de 2) ser&aacute; aberta.</p>

<hr>
<p><b>Observa&ccedil;&atilde;o:</b></p>
Tamb&eacute;m &eacute; poss&iacute;vel acessar a p&aacute;gina Novo Pool de Conex&otilde;es JDBC via expans&atilde;o do n&oacute; Recursos e do n&oacute; JDBC, selecionando ent&atilde;o o n&oacute; Pools de Conex&otilde;es. Na p&aacute;gina Pools de Conex&otilde;es, clique em Novo para criar um novo pool de conex&otilde;es.
<hr>

</li>
<li>
<p>No campo Nome do Pool, digite o nome do novo pool de conex&otilde;es.</p>
<p>Esse campo &eacute; obrigat&oacute;rio.</p>
</li>
<li>
<p>Na lista drop-down Tipo de Recurso, selecione um tipo de recurso.</p>
<p>As op&ccedil;&otilde;es incluem <code>javax.sql.XADataSource</code> (transa&ccedil;&otilde;es globais), <code>java.sql.ConnectionPoolDataSource</code> (transa&ccedil;&otilde;es locais, poss&iacute;veis melhorias de desempenho) e <code>javax.sql.DataSource</code> (somente transa&ccedil;&otilde;es locais)<code>java.sql.Driver</code>.</p>
</li>
<li>
<p>Especifique um fornecedor de banco de dados:</p>
<ol type="a">
<li>
<p>Na lista drop-down Fornecedor do Driver de Banco de Dados, selecione um fornecedor de banco de dados.</p>
</li>
<li>
<p>Se o fornecedor de banco de dados n&atilde;o aparecer na lista, digite o nome do fornecedor no campo de texto Fornecedor do Driver de Banco de Dados.</p>
</li>
</ol>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Omiss&atilde;o Ativada para efetuar a omiss&atilde;o do driver do banco de dados com base no Tipo de Recurso e no Fornecedor do Driver do Banco de Dados.</p>
<p>Para que a omiss&atilde;o funcione, o driver JDBC deve estar dispon&iacute;vel para GlassFish Server. Consulte <a href="task-integratejdbcdriver.html">Para Integrar um Driver JDBC</a>.</p>
</li>
<li>
<p>Clique em Pr&oacute;ximo.</p>
<p>A p&aacute;gina Novo Pool de Conex&otilde;es JDBC (Etapa 2 de 2) ser&aacute; aberta.</p>
</li>
<li>
<p>No campo Nome da classe da fonte de dados, digite o nome da classe espec&iacute;fica do fornecedor que implementa a API <code>DataSource</code>, <code>ConnectionPoolDataSource</code> ou <code>XADataSource</code>.</p>
<p>Se voc&ecirc; tiver selecionado Omiss&atilde;o Ativada e um dos tipos de recursos da fonte de dados, esse campo ser&aacute; preenchido automaticamente com o nome da classe associado ao tipo de recurso e com o fornecedor do banco de dados de sua escolha. Se voc&ecirc; selecionou o tipo de recurso<code>java.sql.Driver</code>, esse campo ser&aacute; desativado.</p>
</li>
<li>
<p>No campo Nome da Classe do Driver, digite o nome da classe espec&iacute;fica do fornecedor que implementa a API <code>java.sql.Driver</code>.</p>
<p>Se voc&ecirc; tiver selecionado Omiss&atilde;o Ativada ou o tipo de recurso <code>java.sql.Driver</code>, esse campo ser&aacute; automaticamente preenchido com o nome da classe associado ao driver e ao fornecedor de banco de dados de sua escolha. Se voc&ecirc; selecionou um dos tipos de recursos de fonte de dados, esse campo &eacute; desativado.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Ping Ativado para efetuar o ping autom&aacute;tico no pool durante a cria&ccedil;&atilde;o ou reconfigura&ccedil;&atilde;o, para identificar e avisar sobre valores de atributos com erros.</p>
<p>Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>No campo Descri&ccedil;&atilde;o, digite uma descri&ccedil;&atilde;o breve do pool de conex&otilde;es.</p>
</li>
<li>
<p>No campo Tamanho Inicial e M&iacute;nimo do Pool, digite o n&uacute;mero m&iacute;nimo de conex&otilde;es para esse pool.</p>
<p>Esse valor tamb&eacute;m determina o n&uacute;mero de conex&otilde;es colocadas no pool quando o pool &eacute; criado pela primeira vez ou quando o GlassFish Server &eacute; iniciado. O valor default &eacute; 8.</p>
</li>
<li>
<p>No campo Tamanho M&aacute;ximo do Pool, digite o n&uacute;mero m&aacute;ximo de conex&otilde;es para esse Pool.</p>
<p>O valor default &eacute; 32.</p>
</li>
<li>
<p>No campo Quantidade de Redimensionamento do Pool, digite o n&uacute;mero de conex&otilde;es por batch de redimensionamento do pool.</p>
<p>Quando o pool aumenta e diminui em rela&ccedil;&atilde;o aos tamanhos m&aacute;ximo e m&iacute;nimo, respectivamente, o pool &eacute; redimensionado em batches. Esse valor determina o n&uacute;mero de conex&otilde;es do batch. A defini&ccedil;&atilde;o de um valor muito alto torna demorado o processo de cria&ccedil;&atilde;o e reciclagem de conex&otilde;es; um valor muito baixo compromete a efici&ecirc;ncia. O valor default &eacute; 2.</p>
</li>
<li>
<p>No campo Time-out para Ociosidade, digite a quantidade m&aacute;xima de tempo, em segundos, para que uma conex&atilde;o permane&ccedil;a ociosa no pool.</p>
<p>Ap&oacute;s esse per&iacute;odo, a conex&atilde;o ser&aacute; removida do pool. O valor default &eacute; 300.</p>
</li>
<li>
<p>No campo Tempo M&aacute;ximo de Espera, digite o tempo m&aacute;ximo, em milissegundos, que a aplica&ccedil;&atilde;o solicitante da conex&atilde;o aguardar&aacute; at&eacute; obter um time-out.</p>
<p>O valor default &eacute; 60.000.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Conex&otilde;es N&atilde;o Transacionais Ativadas para retornar conex&otilde;es n&atilde;o transacionais.</p>
<p>Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>Na lista drop-down N&iacute;vel de Isolamento de Transa&ccedil;&atilde;o, selecione um n&iacute;vel de isolamento de transa&ccedil;&atilde;o para o pool de conex&otilde;es.</p>
<p>Se n&atilde;o especificado, as conex&otilde;es funcionar&atilde;o com os n&iacute;veis de isolamento default, fornecidos pelo driver JDBC. Por default, essa op&ccedil;&atilde;o n&atilde;o &eacute; especificada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o N&iacute;vel de Isolamento Garantido, para que todas as conex&otilde;es obtidas no pool tenham o mesmo n&iacute;vel de isolamento.</p>
<p>Por exemplo, se o n&iacute;vel de isolamento da conex&atilde;o for alterado via programa&ccedil;&atilde;o (com <code>con.setTransactionIsolation</code>), durante a &uacute;ltima utiliza&ccedil;&atilde;o, esse mecanismo alterar&aacute; o status para o n&iacute;vel de isolamento especificado. Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
<p>Essa defini&ccedil;&atilde;o s&oacute; ser&aacute; aplic&aacute;vel se um n&iacute;vel de isolamento de transa&ccedil;&atilde;o for especificado.</p>
</li>
<li>
<p>Na se&ccedil;&atilde;o Propriedades Adicionais, especifique as propriedades adicionais.</p>
<p>Exemplos de propriedades necess&aacute;rias incluem nome do banco de dados (URL), nome de usu&aacute;rio e senha. A tabela normalmente cont&eacute;m propriedades usadas pelo fornecedor do banco de dados. Para obter informa&ccedil;&otilde;es sobre algumas das propriedades dispon&iacute;veis, consulte<a href="ref-jdbc-properties.html">Propriedades Espec&iacute;ficas para os Pools de Conex&otilde;es JDBC</a>.</p>
<p>Se voc&ecirc; n&atilde;o especificar um valor para uma propriedade, ela ser&aacute; removida da tabela quando voc&ecirc; finalizar a cria&ccedil;&atilde;o do pool de conex&otilde;es. Caso n&atilde;o deseje definir agora um valor para uma propriedade, mas deseja que a propriedade permane&ccedil;a na tabela, para que o valor possa ser definido em outro momento, digite um conjunto de par&ecirc;nteses vazios no campo Valor:</p>
<pre>
()
</pre>
<ul>
<li>
<p>Para adicionar uma propriedade, clique no bot&atilde;o Adicionar Propriedade. Na linha em branco que for exibida, digite o nome da propriedade no campo Nome e digite o valor da propriedade no campo Valor.</p>
</li>
<li>
<p>Para modificar uma propriedade, edite o campo Valor da propriedade.</p>
</li>
<li>
<p>Para deletar uma propriedade, marque a caixa de sele&ccedil;&atilde;o &agrave; esquerda do campo Nome da Propriedade a ser deletada. Clique no bot&atilde;o Deletar Propriedades.</p>
</li>
</ul>
</li>
<li>
<p>Clique em Finalizar.</p>
</li>
</ol>
<a id="sthref16" name="sthref16"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">Para Configurar Acesso ao Banco de Dados</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">Para Integrar um Driver JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcenew.html">Para Criar um Recurso do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesedit.html">Para Editar um Recurso do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcetargets.html">Para Editar Alvos do Recurso do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesdelete.html">Para Deletar um Recurso do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">Para Editar Defini&ccedil;&otilde;es Gerais do Pool de Conex&otilde;es do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">Editar Atributos Avan&ccedil;ados do Pool de Conex&otilde;es do JDBC</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">Para Verificar as Defini&ccedil;&otilde;es do Pool de Conex&otilde;es</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">Editar Propriedades do Pool de Conex&otilde;es do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">Para Deletar um Pool de Conex&otilde;es JDBC</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
