<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-setdbaccess" name="task-setdbaccess"></a></p>

<h4><a id="sthref2" name="sthref2"></a>Para Configurar Acesso ao Banco de Dados</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Para armazenar, organizar e recuperar dados, a maioria das aplica&ccedil;&otilde;es usa bancos de dados relacionais.</p>
<p>O GlassFish Server inclui uma c&oacute;pia do banco de dados Java DB e &eacute; pr&eacute;-configurado com a capacidade de acessar esse banco de dados.</p>
<ol>
<li>
<p>Instale um produto de banco de dados compat&iacute;vel.</p>
<p>Para obter uma lista de bancos de dados suportados, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRLN"><i>Notas de Release do Oracle GlassFish Server</i></a>.</p>
</li>
<li>
<p>Instale um driver que suporte a API da JDBC (driver JDBC) do banco de dados.</p>
<p>Verifique se o driver a ser utilizado para criar as conex&otilde;es com bancos de dados est&aacute; instalado em todos os servidores em que a fonte de dados ser&aacute; implantada.</p>
</li>
<li>
<p>Certifique-se de o arquivo JAR do driver esteja acess&iacute;vel &agrave; inst&acirc;ncia do servidor do dom&iacute;nio.</p>
<p>Consulte <a href="task-integratejdbcdriver.html">Para Integrar um Driver JDBC</a>.</p>
</li>
<li>
<p>Crie o banco de dados.</p>
<p>Em geral, o provedor da aplica&ccedil;&atilde;o disponibiliza scripts para cria&ccedil;&atilde;o e preenchimento do banco de dados.</p>
</li>
<li>
<p>Crie um pool de conex&otilde;es para o banco de dados.</p>
<p>Consulte <a href="task-jdbcconnectionpoolnew.html">Para Criar um Pool de Conex&otilde;es do JDBC</a>.</p>
</li>
<li>
<p>Crie um recurso JDBC que aponte para o pool de conex&otilde;es.</p>
<p>Consulte <a href="task-jdbcresourcenew.html">Para Criar um Recurso do JDBC</a>.</p>
</li>
</ol>
<a id="sthref3" name="sthref3"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-integratejdbcdriver.html">Para Integrar um Driver JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcenew.html">Para Criar um Recurso do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesedit.html">Para Editar um Recurso do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesdelete.html">Para Deletar um Recurso do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">Para Criar um Pool de Conex&otilde;es do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">Para Editar Defini&ccedil;&otilde;es Gerais do Pool de Conex&otilde;es do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">Editar Atributos Avan&ccedil;ados do Pool de Conex&otilde;es do JDBC</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">Para Verificar as Defini&ccedil;&otilde;es do Pool de Conex&otilde;es</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">Editar Propriedades do Pool de Conex&otilde;es do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">Para Deletar um Pool de Conex&otilde;es JDBC</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
