<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jdbcresourcesedit" name="task-jdbcresourcesedit"></a></p>

<h4><a id="sthref8" name="sthref8"></a>Para Editar um Recurso do JDBC</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Recursos.</p>
</li>
<li>
<p>No n&oacute; Recursos, expanda o n&oacute; JDBC.</p>
</li>
<li>
<p>No n&oacute; JDBC, selecione o n&oacute; Recursos JDBC.</p>
<p>A p&aacute;gina Recursos JDBC ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Recursos do JDBC, clique no nome do recurso a ser editado.</p>
<p>A p&aacute;gina Editar Recurso do JDBC ser&aacute; aberta.</p>
</li>
<li>
<p>Na lista drop-down Nome do Pool, selecione um pool de conex&otilde;es a ser associado ao recurso do JDBC.</p>
</li>
<li>
<p>No campo Descri&ccedil;&atilde;o, digite uma descri&ccedil;&atilde;o breve do recurso do JDBC.</p>
</li>
<li>
<p>Na se&ccedil;&atilde;o Propriedades Adicionais, especifique as propriedades adicionais.</p>
<p>O GlassFish Server n&atilde;o define nenhuma propriedade adicional para os recursos JDBC.</p>
<ul>
<li>
<p>Para adicionar uma propriedade, clique no bot&atilde;o Adicionar Propriedade. Na linha em branco que for exibida, digite o nome da propriedade no campo Nome e digite o valor da propriedade no campo Valor.</p>
</li>
<li>
<p>Para modificar uma propriedade, edite o campo Valor da propriedade.</p>
</li>
<li>
<p>Para deletar uma propriedade, marque a caixa de sele&ccedil;&atilde;o &agrave; esquerda do campo Nome da Propriedade a ser deletada. Clique no bot&atilde;o Deletar Propriedades.</p>
</li>
</ul>
</li>
<li>
<p>Clique na guia Alvo para gerenciar os alvos do recurso.</p>
<ol type="a">
<li>
<p>Ative ou desative os alvos definidos para o recurso, conforme desejado.</p>
</li>
<li>
<p>Clique no bot&atilde;o Gerenciar Alvos para adicionar ou remover alvos do recurso.</p>
</li>
</ol>
<p>Consulte <a href="task-jdbcresourcetargets.html">Para Editar Alvos do Recurso do JDBC</a> para obter mais informa&ccedil;&otilde;es.</p>
</li>
<li>
<p>Clique na guia Geral para voltar &agrave; p&aacute;gina Editar Recurso do JDBC.</p>
</li>
<li>
<p>Clique em Salvar.</p>
</li>
</ol>
<a id="sthref9" name="sthref9"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">Para Configurar Acesso ao Banco de Dados</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">Para Integrar um Driver JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcenew.html">Para Criar um Recurso do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcetargets.html">Para Editar Alvos do Recurso do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesdelete.html">Para Deletar um Recurso do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">Para Criar um Pool de Conex&otilde;es do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">Para Editar Defini&ccedil;&otilde;es Gerais do Pool de Conex&otilde;es do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">Editar Atributos Avan&ccedil;ados do Pool de Conex&otilde;es do JDBC</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">Para Verificar as Defini&ccedil;&otilde;es do Pool de Conex&otilde;es</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">Editar Propriedades do Pool de Conex&otilde;es do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">Para Deletar um Pool de Conex&otilde;es JDBC</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
