<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jdbcconnectionpooladvance" name="task-jdbcconnectionpooladvance"></a></p>

<h4><a id="sthref16" name="sthref16"></a>Editar Atributos Avan&ccedil;ados do Pool de Conex&otilde;es do JDBC</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Recursos.</p>
</li>
<li>
<p>No n&oacute; Recursos, selecione o n&oacute; JDBC.</p>
</li>
<li>
<p>No n&oacute; JDBC, selecione o n&oacute; Pools de Conex&otilde;es.</p>
<p>A p&aacute;gina Pools de Conex&otilde;es ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Pools de Conex&otilde;es, clique no nome do pool a ser editado.</p>
<p>A p&aacute;gina Editar Pool de Conex&otilde;es ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Editar Pool de Conex&otilde;es, clique na guia Avan&ccedil;ado.</p>
<p>A p&aacute;gina Editar Atributos Avan&ccedil;ados do Pool de Conex&otilde;es ser&aacute; aberta.</p>
</li>
<li>
<p>No campo Time-out da Instru&ccedil;&atilde;o, digite o per&iacute;odo, em segundos, ap&oacute;s o qual as consultas de execu&ccedil;&atilde;o anormalmente longas ser&atilde;o finalizadas.</p>
<p>O GlassFish Server define o <code>Time-out para Consulta</code> nas instru&ccedil;&otilde;es criadas. Defina o valor como -1 para desativar essa op&ccedil;&atilde;o. O valor default &eacute; -1.</p>
</li>
<li>
<p>No campo Tamanho do Cache de Instru&ccedil;&atilde;o, digite o n&uacute;mero de instru&ccedil;&otilde;es a serem colocadas no cache usando o mecanismo de cache LRU (Menos Usado Recentemente).</p>
<p>Para desativar o armazenamento em cache da instru&ccedil;&atilde;o, especifique um valor de 0. O valor default &eacute; 0.</p>
</li>
<li>
<p>No campo SQL Inicial, digite uma string SQL a ser executada sempre que uma conex&atilde;o for criada (n&atilde;o reutilizada) no pool.</p>
<p>A execu&ccedil;&atilde;o dessa string inicializa o estado da conex&atilde;o.</p>
</li>
<li>
<p>No campo Listeners de Rastreamento de SQL, digite uma lista separada por v&iacute;rgulas de nomes de classes de implementa&ccedil;&atilde;o do listener, que especifica que as instru&ccedil;&otilde;es SQL executadas por aplica&ccedil;&otilde;es ser&atilde;o rastreadas.</p>
<p>As classes do listener devem implementar a interface <code>org.glassfish.api.jdbc.SQLTraceListener</code>. O uso de listeners permite a f&aacute;cil filtragem de registros de mensagens para as instru&ccedil;&otilde;es SQL e ajuda os administradores a analisarem as instru&ccedil;&otilde;es.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Ajustar Objetos do JDBC, para que as aplica&ccedil;&otilde;es ajustem objetos JDBC para <code>Statement</code>, <code>PreparedStatement</code> , <code>CallableStatement</code>, <code>ResultSet</code>, <code>DatabaseMetaData</code>.</p>
<p>Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Agrupamento para ativar o agrupamento de conex&otilde;es para o pool.</p>
<p>Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</li>
<li>
<p>No campo Validar no M&aacute;ximo uma Vez, digite o per&iacute;odo, em segundos, ap&oacute;s o qual uma conex&atilde;o ser&aacute; validada no m&aacute;ximo uma vez.</p>
<p>A defini&ccedil;&atilde;o desse atributo para um valor apropriado minimiza o n&uacute;mero de solicita&ccedil;&otilde;es de valida&ccedil;&atilde;o feitos por uma conex&atilde;o. O valor default &eacute; 0, o que significa que o atributo n&atilde;o est&aacute; ativado.</p>
</li>
<li>
<p>No campo Time-out para Perda de Conex&atilde;o, digite o tempo, em segundos, necess&aacute;rio para rastrear perdas de conex&atilde;o em um pool de conex&otilde;es.</p>
<p>Use esse campo para detectar potenciais perdas de conex&atilde;o pela aplica&ccedil;&atilde;o. Uma conex&atilde;o que n&atilde;o &eacute; retornada para o pool pela aplica&ccedil;&atilde;o dentro do per&iacute;odo especificado &eacute; assumida como tendo uma perda potencial, e um rastreamento de pilha do chamador &eacute; registrado. Defina o valor como 0 para desativar o rastreamento de perda de conex&atilde;o. O valor default &eacute; 0.</p>
<p>Use esse campo junto com Reclama&ccedil;&atilde;o para Perda de Conex&atilde;o para evitar poss&iacute;veis perdas da conex&atilde;o da aplica&ccedil;&atilde;o.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Reclama&ccedil;&atilde;o para Perda de Conex&atilde;o para restaurar conex&otilde;es vazadas no pool ap&oacute;s a conclus&atilde;o do rastreamento da conex&atilde;o.</p>
<p>Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>No campo Time-out para Perda de Instru&ccedil;&atilde;o, digite o tempo, em segundos, necess&aacute;rio para rastrear perdas de instru&ccedil;&atilde;o em um pool de conex&otilde;es.</p>
<p>Use esse campo para detectar poss&iacute;veis perdas de instru&ccedil;&otilde;es na aplica&ccedil;&atilde;o. Considera-se que uma instru&ccedil;&atilde;o que n&atilde;o &eacute; retornada para o pool pela aplica&ccedil;&atilde;o no per&iacute;odo especificado tenha perdas, e um rastreamento de pilha do chamador &eacute; conectado. Defina o valor como 0 para desativar o rastreamento de perda de instru&ccedil;&atilde;o. O valor default &eacute; 0.</p>
<p>Use esse campo junto com Reclama&ccedil;&atilde;o para Perda de Instru&ccedil;&atilde;o para evitar poss&iacute;veis perdas da instru&ccedil;&atilde;o da aplica&ccedil;&atilde;o.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Reclama&ccedil;&atilde;o para Perda de Instru&ccedil;&atilde;o para restaurar instru&ccedil;&otilde;es vazadas no pool ap&oacute;s a conclus&atilde;o do rastreamento da instru&ccedil;&atilde;o.</p>
<p>Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>No campo Novas Tentativas de Cria&ccedil;&atilde;o, digite o n&uacute;mero de tentativas a serem feitas se houver uma falha ao criar uma nova conex&atilde;o.</p>
<p>Defina o valor como 0 para que nenhuma tentativa seja feita para criar novamente a conex&atilde;o. O valor default &eacute; 0.</p>
</li>
<li>
<p>No campo Intervalo para Nova Tentativa, digite o intervalo, em segundos, entre duas tentativas de criar uma conex&atilde;o.</p>
<p>O valor default &eacute; 10. Esse atributo s&oacute; ser&aacute; usado se o valor Novas Tentativas de Cria&ccedil;&atilde;o for maior que 0.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Associa&ccedil;&atilde;o Lenta Ativada para associar uma conex&atilde;o f&iacute;sica com um conjunto l&oacute;gico somente quando uma conex&atilde;o for usada.</p>
<p>As conex&otilde;es ser&atilde;o desassociadas quando a transa&ccedil;&atilde;o for conclu&iacute;da e um m&eacute;todo de componente for finalizado, o que ajuda a reutilizar as conex&otilde;es f&iacute;sicas. Se essa op&ccedil;&atilde;o est&aacute; desativada, uma conex&atilde;o f&iacute;sica &eacute; associada &agrave; cole&ccedil;&atilde;o l&oacute;gica mesmo antes de ser usada. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Aloca&ccedil;&atilde;o para Conex&atilde;o Lenta Ativada para inscrever um recurso para a transa&ccedil;&atilde;o somente quando ele for efetivamente utilizado em um m&eacute;todo.</p>
<p>Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Associar a Thread Ativado para criar associa&ccedil;&otilde;es entre conex&otilde;es e threads.</p>
<p>Quando o mesmo thread for necess&aacute;rio a uma conex&atilde;o, a conex&atilde;o j&aacute; associada ao thread poder&aacute; ser reutilizada, n&atilde;o incorrendo, portanto, a sobrecarga para obten&ccedil;&atilde;o de outra conex&atilde;o no pool. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Correspond&ecirc;ncia de Conex&otilde;es Ativada para ativar a correspond&ecirc;ncia de conex&atilde;o para o pool.</p>
<p>Se essa op&ccedil;&atilde;o est&aacute; ativada, uma conex&atilde;o que &eacute; selecionada do pool deveria ser correspondida com as conex&otilde;es que t&ecirc;m determinadas credenciais. Essa op&ccedil;&atilde;o precisar&aacute; ser ativada se o pool de conex&otilde;es for usado por aplica&ccedil;&otilde;es que tiverem v&aacute;rias credenciais de usu&aacute;rio. Essa op&ccedil;&atilde;o poder&aacute; ser desativada se o administrador souber que as conex&otilde;es no pool ser&atilde;o sempre homog&ecirc;neas e, portanto, uma conex&atilde;o selecionada no pool n&atilde;o precisar&aacute; coincidir com o adaptador de recurso. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>No campo Uso M&aacute;x. de Conex&atilde;o, digite o n&uacute;mero de vezes que uma conex&atilde;o deve ser reutilizada pelo pool.</p>
<p>Depois que uma conex&atilde;o &eacute; reutilizada por um n&uacute;mero especificado de vezes, ela ser&aacute; fechada. Ao limitar o n&uacute;mero de vezes que uma conex&atilde;o pode ser reutilizada, voc&ecirc; poder&aacute; evitar perdas de instru&ccedil;&otilde;es, caso uma aplica&ccedil;&atilde;o n&atilde;o feche as instru&ccedil;&otilde;es. Defina o valor como 0 para desativar esse atributo. O valor default &eacute; 0.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Valida&ccedil;&atilde;o de Conex&atilde;o Obrigat&oacute;ria para ativar a valida&ccedil;&atilde;o de conex&atilde;o.</p>
<p>A valida&ccedil;&atilde;o de conex&atilde;o permite que o servidor se reconecte em caso de falha.</p>
</li>
<li>
<p>Na lista drop-down M&eacute;todo de Valida&ccedil;&atilde;o, selecione um m&eacute;todo de valida&ccedil;&atilde;o.</p>
<p>O GlassFish Server pode validar as conex&otilde;es ao banco de dados nas seguintes formas.</p>
<dl>
<dt><code>confirma&ccedil;&atilde;o autom&aacute;tica</code> e <code>metadados</code></dt>
<dd>
<p>O GlassFish Server valida uma conex&atilde;o ao chamar os m&eacute;todos <code>con.getAutoCommit</code> e <code>con.getMetaData</code>.</p>

<hr>
<p><b>Observa&ccedil;&atilde;o:</b></p>
Muitos drivers JDBC armazenam no cache os resultados dessas chamadas. Como resultado, o uso dessas chamadas nem sempre fornece valida&ccedil;&otilde;es confi&aacute;veis. Verifique com o fornecedor do driver para determinar se essas chamadas s&atilde;o ou n&atilde;o armazenadas no cache.
<hr>

</dd>
<dt><code>custom-validation</code></dt>
<dd>
<p>O GlassFish Server usa um mecanismo de valida&ccedil;&atilde;o definido pelo usu&aacute;rio especificado pela classe de implementa&ccedil;&atilde;o personalizada no campo Nome da Classe de Valida&ccedil;&atilde;o.</p>
</dd>
<dt><code>table</code></dt>
<dd>
<p>A aplica&ccedil;&atilde;o consulta a tabela de banco de dados especificada. A tabela deve existir e estar acess&iacute;vel, mas n&atilde;o precisa conter linhas. N&atilde;o use uma tabela existente que tenha um n&uacute;mero grande de linhas, nem uma tabela que seja acessada com frequ&ecirc;ncia.</p>
</dd>
</dl>
</li>
<li>
<p>Caso voc&ecirc; tenha selecionado <code>table</code> na lista drop-down M&eacute;todo de Valida&ccedil;&atilde;o, digite o nome da tabela de banco de dados ou selecione-o na lista drop-down Nome da Tabela.</p>
</li>
<li>
<p>Caso voc&ecirc; tenha selecionado <code>custom-validation</code> na lista drop-down M&eacute;todo de Valida&ccedil;&atilde;o, digite o nome da classe de implementa&ccedil;&atilde;o da valida&ccedil;&atilde;o personalizada ou selecione-o na lista drop-down Nome da Classe de Valida&ccedil;&atilde;o.</p>
<p>O nome da classe fornecido precisa estar acess&iacute;vel ao GlassFish Server. A classe especificada deve implementar a interface <code>org.glassfish.api.jdbc.ConnectionValidation</code>.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Em Caso de Falha, Fechar Todas as Conex&otilde;es, para fazer com que o servidor feche e restabele&ccedil;a todas as conex&otilde;es do pool em caso de falha de conex&atilde;o.</p>
<p>Se a op&ccedil;&atilde;o for desativada, cada conex&atilde;o individual somente ser&aacute; restabelecida quando for usada. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Permitir Chamadores que n&atilde;o Sejam Componentes Ativado para permitir que o pool seja usado por chamadores n&atilde;o de componentes; por exemplo, filtros de servlet e gerenciadores de persist&ecirc;ncia de terceiros.</p>
<p>As conex&otilde;es obtidas por chamadores n&atilde;o de componente n&atilde;o s&atilde;o automaticamente fechadas no final de uma transa&ccedil;&atilde;o pelo cont&ecirc;iner. Elas precisam ser explicitamente fechadas pelo chamador. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>Clique no bot&atilde;o Esvaziar na guia Geral para descarregar todas as conex&otilde;es do pool.</p>
<p>Clicar no bot&atilde;o Esvaziar destr&oacute;i quaisquer conex&otilde;es existentes, recria as conex&otilde;es estabelecidas para o pool e restaura o pool para seu tamanho inicial e m&iacute;nimo.</p>
</li>
<li>
<p>Clique em Salvar.</p>

<hr>
<p><b>Dica:</b></p>
Para voltar &agrave;s defini&ccedil;&otilde;es default, clique no bot&atilde;o Carregar Defaults e depois em Salvar.
<hr>

</li>
</ol>
<a id="sthref17" name="sthref17"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">Para Configurar Acesso ao Banco de Dados</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">Para Integrar um Driver JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcenew.html">Para Criar um Recurso do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesedit.html">Para Editar um Recurso do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcetargets.html">Para Editar Alvos do Recurso do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesdelete.html">Para Deletar um Recurso do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">Para Criar um Pool de Conex&otilde;es do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">Para Editar Defini&ccedil;&otilde;es Gerais do Pool de Conex&otilde;es do JDBC</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">Para Verificar as Defini&ccedil;&otilde;es do Pool de Conex&otilde;es</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">Editar Propriedades do Pool de Conex&otilde;es do JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">Para Deletar um Pool de Conex&otilde;es JDBC</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
