<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jdbcconnpooladvanceattrtab" name="ref-jdbcconnpooladvanceattrtab"></a><a id="GHJDB00027" name="GHJDB00027"></a></p>

<h4><a id="sthref48" name="sthref48"></a>Editar atributos avanzados del pool de conexiones</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Editar atributos avanzados del pool de conexiones para especificar los atributos que ayudan en el diagn&oacute;stico de p&eacute;rdidas de conexiones y facilitan el uso.</p>
<p>La p&aacute;gina Editar atributos avanzados del pool de conexiones incluye las siguientes opciones.</p>
<dl>
<dt>Cargar Valores por Defecto</dt>
<dd>
<p>Bot&oacute;n para restaurar configuraci&oacute;n que tiene valores por defecto a sus valores por defecto. Las configuraciones que no tienen valores por defecto no se modifican.</p>
</dd>
<dt>Nombre de pool</dt>
<dd>
<p>Nombre del pool de conexiones. Este campo es de s&oacute;lo lectura. S&oacute;lo puede especificar el nombre del pool de conexiones al crear un nuevo pool de conexiones JDBC.</p>
</dd>
<dt>Timeout de sentencia</dt>
<dd>
<p>Duraci&oacute;n de tiempo, en segundos, tras la que se terminar&aacute;n las consultas que se ejecuten anormalmente durante mucho tiempo. GlassFish Server definir&aacute; <code>QueryTimeout</code> en las sentencias creadas. Un valor de -1 significa que la opci&oacute;n est&aacute; desactivada. El valor por defecto es -1.</p>
</dd>
<dt>Tama&ntilde;o de la cach&eacute; de sentencias</dt>
<dd>
<p>N&uacute;mero de sentencias que desea almacenar en la cach&eacute; mediante el mecanismo de almacenamiento en cach&eacute; de uso menos reciente (LRU) El valor 0 desactiva el almacenamiento de sentencias en cach&eacute;. El valor por defecto es 0.</p>
</dd>
<dt>Inicializar SQL</dt>
<dd>
<p>Cadena SQL que se debe ejecutar cada vez que se crea (no se reutiliza) una conexi&oacute;n en el pool. La ejecuci&oacute;n de esta cadena inicia el estado de la conexi&oacute;n.</p>
</dd>
<dt>Listeners de rastreo SQL:</dt>
<dd>
<p>Una lista separada por comas compuesta por nombres de clases de implantaciones de listeners que especifica que se realizar&aacute; un seguimiento de las sentencias SQL ejecutadas por las aplicaciones. Las clases de listener deben implantar la interfaz <code>org.glassfish.api.jdbc.SQLTraceListener</code>. El uso de listeners permite filtrar f&aacute;cilmente los mensajes de log de las sentencias SQL y ayuda a los administradores analizar las sentencias.</p>
</dd>
<dt>Envolver objetos JDBC:</dt>
<dd>
<p>Si se activa esta opci&oacute;n, las aplicaciones obtendr&aacute;n objetos JDBC envueltos para Statement, PreparedStatement, CallableStatement, ResultSet y DatabaseMetaData. Esta opci&oacute;n se encuentra activada por defecto.</p>
</dd>
<dt>Pool</dt>
<dd>
<p>Permite crear pool de conexiones en el pool. Esta opci&oacute;n se encuentra activada por defecto.</p>
</dd>
<dt>Validar como m&aacute;ximo una vez</dt>
<dd>
<p>Especifica el intervalo de tiempo, en segundos, entre solicitudes consecutivas para validar una conexi&oacute;n como m&aacute;ximo una vez. Si se define este atributo con un valor apropiado se minimiza el n&uacute;mero de solicitudes de validaci&oacute;n por conexi&oacute;n. El valor por defecto es 0, lo que significa que el atributo no est&aacute; activado.</p>
</dd>
<dt>Timeout de P&eacute;rdida de Conexi&oacute;n</dt>
<dd>
<p>Duraci&oacute;n de tiempo, en segundos, para realizar un seguimiento de las p&eacute;rdidas de conexi&oacute;n en un pool de conexiones. Use este campo para detectar p&eacute;rdidas en la conexi&oacute;n potenciales por parte de la aplicaci&oacute;n. En caso de que la aplicaci&oacute;n no devuelva la conexi&oacute;n al pool de conexiones dentro del per&iacute;odo especificado, se considerar&aacute; que existen p&eacute;rdidas potenciales y se registrar&aacute; un rastreo de la pila del emisor de la llamada. Un valor de 0 significa que el seguimiento de p&eacute;rdidas de conexi&oacute;n est&aacute; desactivado. El valor por defecto es 0.</p>
<p>Utilice este campo junto con la Recuperaci&oacute;n de p&eacute;rdida para evitar p&eacute;rdidas potenciales de conexi&oacute;n de la aplicaci&oacute;n.</p>
</dd>
<dt>Reclamaci&oacute;n de p&eacute;rdida de conexi&oacute;n:</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; activada, las conexiones perdidas se restablecer&aacute;n en el pool tras completar un seguimiento de la p&eacute;rdidas de conexi&oacute;n Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Timeout de P&eacute;rdida de Sentencia</dt>
<dd>
<p>Duraci&oacute;n de tiempo, en segundos, para realizar un seguimiento de las p&eacute;rdidas de sentencias en un pool de conexiones. Use este campo para detectar p&eacute;rdidas potenciales de sentencias potenciales por parte de la aplicaci&oacute;n. En caso de que la aplicaci&oacute;n no devuelva una sentencia al pool dentro del per&iacute;odo especificado, se considerar&aacute; que existen p&eacute;rdidas potenciales, y se registrar&aacute; un rastreo de pila del emisor de la llamada. Un valor de 0 significa que el rastreo de p&eacute;rdidas de sentencias est&aacute; desactivado. El valor por defecto es 0.</p>
<p>Utilice este campo junto con la reclamaci&oacute;n de p&eacute;rdidas de sentencias para evitar p&eacute;rdidas potenciales de conexi&oacute;n desde la aplicaci&oacute;n.</p>
</dd>
<dt>Reclamaci&oacute;n de P&eacute;rdida de Sentencia</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; activada, las sentencias perdidas se restauran en el pool tras completar un rastreo de las p&eacute;rdidas de sentencias. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Reintentos de creaci&oacute;n</dt>
<dd>
<p>N&uacute;mero de intentos que se realizar&aacute;n si se produce un fallo al crear una nueva conexi&oacute;n. El valor 0 significa que no se realizar&aacute;n intentos para volver a crear la conexi&oacute;n. El valor por defecto es 0.</p>
</dd>
<dt>Intervalo de reintento</dt>
<dd>
<p>Intervalo de tiempo, en segundos, entre dos intentos para crear una conexi&oacute;n. El valor por defecto es 10. Este atributo se utiliza s&oacute;lo si el valor de Intentos de creaci&oacute;n es mayor que 0.</p>
</dd>
<dt>Asociaci&oacute;n lenta</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; activada, se asociar&aacute; una conexi&oacute;n f&iacute;sica a una recopilaci&oacute;n l&oacute;gica s&oacute;lo cuando se use la conexi&oacute;n. Las conexiones se disocian cuando la transacci&oacute;n se completa y un m&eacute;todo de componentes finaliza, lo que ayuda a reutilizar las conexiones f&iacute;sicas. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Inscripci&oacute;n lenta de conexiones</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; activada, se inscribe un recurso en la transacci&oacute;n s&oacute;lo cuando realmente se use en un m&eacute;todo. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Asociar a thread</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; activada, se realizar&aacute; una asociaci&oacute;n entre una conexi&oacute;n y un thread de manera que cuando el mismo thread necesite una conexi&oacute;n, podr&aacute; volver a utilizar la conexi&oacute;n ya asociada a ese thread y, por tanto, no incurrir&aacute; en la sobrecarga para conseguir una conexi&oacute;n del pool. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Conexiones coincidentes</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; activada, las conexiones que se seleccionen en el pool deber&iacute;an coincidir con las conexiones que tienen determinadas credenciales. Esta opci&oacute;n debe estar activada si el pool de conexiones lo utilizan aplicaciones que tienen varias credenciales de usuario. Esta opci&oacute;n se puede desactivar con total seguridad si el administrador sabe que las conexiones del pool siempre ser&aacute;n homog&eacute;neas y, por tanto, el adaptador de recursos no necesitar&aacute; buscar una coincidencia de una conexi&oacute;n seleccionada del pool. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Uso m&aacute;ximo de conexiones</dt>
<dd>
<p>N&uacute;mero de veces que el pool debe reutilizar una conexi&oacute;n. La conexi&oacute;n se cerrar&aacute; una vez reutilizada durante un n&uacute;mero espec&iacute;fico de veces. Al limitar el n&uacute;mero de veces que una conexi&oacute;n se puede reutilizar, puede evitar p&eacute;rdidas de sentencia si una aplicaci&oacute;n no las cierra. Un valor de -0 significa que este atributo est&aacute; desactivado. El valor por defecto es 0.</p>
</dd>
<dt>Validaci&oacute;n de la conexi&oacute;n</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; activada, ser&aacute; necesario validar la conexi&oacute;n, lo que permitir&aacute; al servidor volver a conectarse en caso de fallo.</p>
</dd>
<dt>M&eacute;todo de validaci&oacute;n</dt>
<dd>
<p>GlassFish Server puede validar las conexiones de la base de datos de las siguientes maneras.</p>
<dl>
<dt><code>auto-commit</code> y <code>metadata</code></dt>
<dd>
<p>GlassFish Server valida una conexi&oacute;n llamando a los m&eacute;todos <code>con.getAutoCommit</code> o <code>con.getMetaData</code>.</p>

<hr>
<p><b>Nota:</b></p>
Muchos controladores JDBC guardan en cach&eacute; los resultados de estas llamadas. Como resultado, al utilizar estas llamadas es posible que no siempre se obtengan validaciones fiables. Compruebe con el proveedor del controlador para determinar si estas llamadas est&aacute;n guardadas en la cach&eacute; o no.
<hr>

</dd>
<dt><code>custom-validation</code></dt>
<dd>
<p>GlassFish Server utiliza un mecanismo de validaci&oacute;n definido por el usuario especificado en la clase de implantaci&oacute;n personalizada, dentro del campo Nombre de clase de validaci&oacute;n.</p>
</dd>
<dt><code>table</code></dt>
<dd>
<p>La aplicaci&oacute;n consulta la tabla de la base de datos especificada. La tabla debe existir y estar accesible, aunque no requiere ninguna fila. No utilice una tabla existente que tenga un gran n&uacute;mero de filas, o una tabla a la que ya se accede con frecuencia.</p>
</dd>
</dl>
</dd>
<dt>Nombre de la tabla</dt>
<dd>
<p>Nombre de la tabla de la base de datos que se va a validar. Este campo es aplicable s&oacute;lo si el m&eacute;todo de validaci&oacute;n se ha definido en <code>table</code>. Puede seleccionar el nombre de la lista desplegable o escribirlo.</p>
</dd>
<dt>Nombre de Clase de Validaci&oacute;n</dt>
<dd>
<p>Nombre de clase de implantaci&oacute;n de la validaci&oacute;n personalizada. Este campo es aplicable s&oacute;lo si el m&eacute;todo de validaci&oacute;n se ha definido en <code>custom-validation</code>. El nombre de clase proporcionado debe ser accesible para GlassFish Server. La clase especificada debe implantar la interfaz <code>org.glassfish.api.jdbc.ConnectionValidation</code>. Puede seleccionar el nombre de la lista desplegable o escribirlo.</p>
</dd>
<dt>Ante cualquier fallo</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; activada, GlassFish Server cierra todas las conexiones del pool y las restablece cuando falla cualquier conexi&oacute;n. Si esta opci&oacute;n est&aacute; desactivada, las conexiones individuales s&oacute;lo se restablecer&aacute;n cuando se utilicen. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Permitir emisores de llamada que no sean de componentes:</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; activada, los emisores que no son componentes, tales como filtros del servlet y gestores de persistencia de terceros, pueden usar el pool. Las conexiones obtenidas por emisores que no son componentes no se cierran autom&aacute;ticamente al final de una transacci&oacute;n realizada por el contenedor. El emisor de llamada debe cerrarlas. Esta opci&oacute;n se activada por defecto.</p>
</dd>
</dl>
<a id="sthref49" name="sthref49"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">Para configurar base de datos de acceso</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">Para integrar una controlador JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">Para crear un pool de conexiones JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">Para editar la configuraci&oacute;n general del pool de conexiones JDBC</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">Para verificar la configuraci&oacute;n de pool de conexiones</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">Para editar atributos avanzados del pool de conexiones JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">Para editar propiedades de pool de conexiones JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">Para suprimir un pool de conexiones JDBC</a></p>
</li>
</ul>
<a id="sthref50" name="sthref50"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00001"><code>add-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00036"><code>create-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00088"><code>delete-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00135"><code>flush-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00173"><code>list-jdbc-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00214"><code>ping-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00234"><code>start-database</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00239"><code>stop-database</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
