<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jdbcconnectionpoolnew2" name="ref-jdbcconnectionpoolnew2"></a></p>

<h4><a id="sthref42" name="sthref42"></a>Nuevo pool de conexiones JDBC (paso 2 de 2)</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Nuevo pool de conexiones JDBC (Paso 2 de 2) para crear un nuevo pool de conexiones JDBC.</p>
<p>La p&aacute;gina Nuevo pool de conexiones JDBC (paso 2 de 2) contiene las siguientes opciones.</p>
<dl>
<dt>Nombre de clase de origen de datos</dt>
<dd>
<p>Nombre de clase espec&iacute;fico del proveedor que implanta las API <code>DataSource</code><code>ConnectionPoolDataSource</code> o <code>XADataSource</code>. Si ha activado la opci&oacute;n de introspecci&oacute;n y seleccionado uno de los tipos de recursos de origen de datos, este campo se rellenar&aacute; autom&aacute;ticamente con el nombre de clase asociada al tipo de recurso y al proveedor de bases de datos que haya seleccionado. Si ha seleccionado el tipo de recurso <code>java.sql.Driver</code>, este campo est&aacute; desactivado.</p>
</dd>
<dt>Nombre de clase del controlador</dt>
<dd>
<p>Nombre de clase del controlador JDBC suministrado por el proveedor. Si ha activado la opci&oacute;n de introspecci&oacute;n y seleccionado el tipo de recurso <code>java.sql.Driver</code>, este campo se rellenar&aacute; autom&aacute;ticamente con el nombre de clase asociada al controlador y al proveedor de bases de datos que haya seleccionado. Si ha seleccionado uno de los tipos de recursos de origen de datos, este campo est&aacute; desactivado.</p>
</dd>
<dt>Ping</dt>
<dd>
<p>Si se selecciona esta opci&oacute;n, se har&aacute; ping autom&aacute;ticamente en el pool de conexiones durante la creaci&oacute;n o reconfiguraci&oacute;n del pool y para identificar y avisarle de cualquier valor de atributo incorrecto. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Descripci&oacute;n</dt>
<dd>
<p>Breve descripci&oacute;n del pool de conexiones.</p>
</dd>
<dt>Tama&ntilde;o de pool inicial y m&iacute;nimo:</dt>
<dd>
<p>N&uacute;mero m&iacute;nimo de conexiones del pool. Este valor tambi&eacute;n determina el n&uacute;mero de conexiones incluidas en el pool cuando se crea el pool por primera vez o cuando se inicia GlassFish Server. El valor por defecto es 8.</p>
</dd>
<dt>Tama&ntilde;o de Pool M&aacute;ximo</dt>
<dd>
<p>N&uacute;mero m&aacute;ximo de conexiones del pool. El valor por defecto es 32.</p>
</dd>
<dt>Cantidad de Cambio de Tama&ntilde;o del Pool</dt>
<dd>
<p>Cuando el pool se ampl&iacute;a y reduce hacia el tama&ntilde;o m&aacute;ximo y m&iacute;nimo respectivamente, se cambia el tama&ntilde;o en lotes. Este valor determina el n&uacute;mero de conexiones en el lote. Si este valor es demasiado grande, se retrasar&aacute; la creaci&oacute;n y el reciclado de las conexiones y, si es demasiado peque&ntilde;o, el proceso perder&aacute; eficacia. El valor por defecto es 2.</p>
</dd>
<dt>Timeout de Inactividad</dt>
<dd>
<p>Duraci&oacute;n m&aacute;xima de tiempo, en segundos, que una conexi&oacute;n puede permanecer inactiva en el pool. Una vez vencido el tiempo, se elimina la conexi&oacute;n del pool. El valor por defecto es 300.</p>
</dd>
<dt>Tiempo de Espera M&aacute;ximo</dt>
<dd>
<p>Duraci&oacute;n m&aacute;xima de tiempo, en milisegundos, que esperar&aacute; la aplicaci&oacute;n que solicita una conexi&oacute;n antes de obtener un timeout de la conexi&oacute;n. El valor por defecto es 60.000.</p>
</dd>
<dt>Conexiones no transaccionales</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; activada, se devolver&aacute;n las conexiones no transaccionales.</p>
</dd>
<dt>Aislamiento de transacci&oacute;n</dt>
<dd>
<p>Si se especifica un nivel de aislamiento de transacci&oacute;n, las conexiones de este pool funcionar&aacute;n en el nivel especificado. De lo contrario, las conexiones funcionar&aacute;n con los niveles de aislamiento por defecto proporcionados por el controlador JDBC. Por defecto, no se especifica esta opci&oacute;n.</p>
</dd>
<dt>Nivel de aislamiento</dt>
<dd>
<p>Si est&aacute; activada la casilla de control Garantizado, todas las conexiones que se han obtenido del pool tendr&aacute;n el mismo nivel de aislamiento. Por ejemplo, si el nivel de aislamiento de la conexi&oacute;n se cambia de manera program&aacute;tica (con <code>con.setTransactionIsolation</code> ) cuando se utiliza por &uacute;ltima vez, este mecanismo devolver&aacute; el estado al nivel de aislamiento especificado. Esta opci&oacute;n se encuentra activada por defecto.</p>
<p>Esta configuraci&oacute;n s&oacute;lo es aplicable si se ha especificado un nivel de aislamiento de transacci&oacute;n.</p>
</dd>
<dt>Propiedades Adicionales</dt>
<dd>
<p>Propiedades adicionales del pool de conexiones JDBC. Estas propiedades pueden incluir el nombre de la base de datos (URL), el nombre de usuario y la contrase&ntilde;a. La tabla suele contener las propiedades utilizadas por el proveedor de la base de datos.</p>
<p>Para obtener una descripci&oacute;n de algunas de las propiedades disponibles, consulte <a href="ref-jdbc-properties.html">Propiedades espec&iacute;ficas de JDBC pools de conexiones</a>.</p>
<p>Si no especifica un valor para una propiedad, &eacute;ste se eliminar&aacute; de la tabla cuando acabe de crear el pool de conexiones. Si no desea definir un valor para una propiedad ahora, pero desea que la propiedad permanezca en la tabla para que el valor se pueda definir m&aacute;s adelante, introduzca un juego de par&eacute;ntesis vac&iacute;o en el campo Valor:</p>
<pre>
()
</pre></dd>
</dl>
<a id="sthref43" name="sthref43"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">Para configurar base de datos de acceso</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">Para integrar una controlador JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">Para crear un pool de conexiones JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">Para editar la configuraci&oacute;n general del pool de conexiones JDBC</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">Para verificar la configuraci&oacute;n de pool de conexiones</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">Para editar atributos avanzados del pool de conexiones JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">Para editar propiedades de pool de conexiones JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">Para suprimir un pool de conexiones JDBC</a></p>
</li>
</ul>
<a id="sthref44" name="sthref44"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00001"><code>add-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00036"><code>create-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00088"><code>delete-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00135"><code>flush-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00173"><code>list-jdbc-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00214"><code>ping-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00234"><code>start-database</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00239"><code>stop-database</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
