<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jdbcresourcesedit" name="task-jdbcresourcesedit"></a><a id="GHJDB00033" name="GHJDB00033"></a></p>

<h4><a id="sthref9" name="sthref9"></a>Para editar un recurso JDBC</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Recursos.</p>
</li>
<li>
<p>En el nodo Recursos, ampl&iacute;e el nodo JDBC.</p>
</li>
<li>
<p>En el nodo JDBC, seleccione el nodo Recursos JDBC.</p>
<p>Se abrir&aacute; la p&aacute;gina Recursos de JDBC.</p>
</li>
<li>
<p>En la p&aacute;gina Recursos JDBC, haga clic en el nombre del recurso que desee editar.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar recurso JDBC.</p>
</li>
<li>
<p>En la lista desplegable Nombre de pool, seleccione un pool de conexiones para asociarlo al recurso JDBC.</p>
</li>
<li>
<p>En el campo Descripci&oacute;n, introduzca una breve descripci&oacute;n del recurso JDBC.</p>
</li>
<li>
<p>En la secci&oacute;n Propiedades Adicionales, especifique las propiedades adicionales.</p>
<p>GlassFish Server no define ninguna propiedad adicional para recursos JDBC.</p>
<ul>
<li>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, introduzca el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
</li>
<li>
<p>Para modificar una propiedad, edite el campo Valor.</p>
</li>
<li>
<p>Para suprimir una propiedad, active la casilla de control a la izquierda del campo Nombre de la propiedad que est&aacute; suprimiendo y, a continuaci&oacute;n, haga clic en el bot&oacute;n Suprimir Propiedades.</p>
</li>
</ul>
</li>
<li>
<p>Haga clic en el separador Destino para gestionar los destinos de recurso.</p>
<ol type="a">
<li>
<p>Active o desactive los destinos definidos para el recurso, seg&uacute;n desee.</p>
</li>
<li>
<p>Haga clic en el bot&oacute;n Gestionar destinos para agregar o eliminar destinos para el recurso.</p>
</li>
</ol>
<p>Consulte <a href="task-jdbcresourcetargets.html">Para editar destinos de recurso JDBC</a> para obtener m&aacute;s informaci&oacute;n.</p>
</li>
<li>
<p>Haga clic en el separador General para volver a la p&aacute;gina Editar recurso JDBC.</p>
</li>
<li>
<p>Haga clic en Guardar.</p>
</li>
</ol>
<a id="sthref10" name="sthref10"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">Para configurar base de datos de acceso</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">Para integrar una controlador JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcenew.html">Para crear un recurso JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcetargets.html">Para editar destinos de recurso JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesdelete.html">Para suprimir un recurso JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">Para crear un pool de conexiones JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">Para editar la configuraci&oacute;n general del pool de conexiones JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">Para editar atributos avanzados del pool de conexiones JDBC</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">Para verificar la configuraci&oacute;n de pool de conexiones</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">Para editar propiedades de pool de conexiones JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">Para suprimir un pool de conexiones JDBC</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
