<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jdbcconnectionpooladvance" name="task-jdbcconnectionpooladvance"></a></p>

<h4><a id="sthref17" name="sthref17"></a>Para editar atributos avanzados del pool de conexiones JDBC</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Recursos.</p>
</li>
<li>
<p>En el nodo Recursos, seleccione el nodo JDBC.</p>
</li>
<li>
<p>En el nodo JDBC, seleccione el nodo Pools de conexiones.</p>
<p>Se abrir&aacute; la p&aacute;gina Pools de conexiones.</p>
</li>
<li>
<p>En la p&aacute;gina Pools de conexiones, haga clic en el nombre del pool que desea editar.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar pool de conexiones.</p>
</li>
<li>
<p>En la p&aacute;gina Editar pool de conexiones, haga clic en el separador Avanzado.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar atributos avanzados del pool de conexiones.</p>
</li>
<li>
<p>En el campo Timeout de sentencia, introduzca el per&iacute;odo de tiempo, en segundos, tras el que finalizar&aacute;n las consultas que duren demasiado.</p>
<p>GlassFish Server definir&aacute; <code>QueryTimeout</code> en las sentencias creadas. Defina el valor en -1 para desactivar esta opci&oacute;n. El valor por defecto es -1.</p>
</li>
<li>
<p>En el campo Tama&ntilde;o de la cach&eacute; de sentencias, introduzca el n&uacute;mero de las sentencias que almacenar en la cach&eacute; utilizando el mecanismo de almacenamiento en cach&eacute; de uso menos reciente (LRU)</p>
<p>Para desactivar el almacenamiento en cach&eacute; de sentencias, especifique un valor de 0. El valor por defecto es 0.</p>
</li>
<li>
<p>En el campo Inicializar SQL, introduzca la cadena SQL que se debe ejecutar cada vez que se crea (no se reutiliza) una conexi&oacute;n en el pool.</p>
<p>La ejecuci&oacute;n de esta cadena inicia el estado de la conexi&oacute;n.</p>
</li>
<li>
<p>En el campo Listeners de rastreo SQL, escriba una lista separada por comas de los nombres de clases de implantaciones de listener para especificar que se realizar&aacute; un seguimiento de las sentencias SQL ejecutadas por las aplicaciones.</p>
<p>Las clases de listener deben implantar la interfaz <code>org.glassfish.api.jdbc.SQLTraceListener</code>. El uso de listeners permite filtrar f&aacute;cilmente los mensajes de log de las sentencias SQL y ayuda a los administradores analizar las sentencias.</p>
</li>
<li>
<p>Active la casilla de control de activaci&oacute;n de ajustes de objetos JDBC para que las aplicaciones obtengan objetos JDBC ajustados para <code>Statement</code>, <code>PreparedStatement</code> , <code>CallableStatement</code>, <code>ResultSet</code>, <code>DatabaseMetaData</code>.</p>
<p>Esta opci&oacute;n se encuentra activada por defecto.</p>
</li>
<li>
<p>Active la casilla de control Pool para activar pool de conexiones para el pool.</p>
<p>Esta opci&oacute;n se encuentra activada por defecto.</p>
</li>
<li>
<p>En el campo Validar al menos una vez, introduzca el tiempo, en segundos, tras el cual se valida una conexi&oacute;n al menos una vez.</p>
<p>Si se define este atributo con un valor apropiado se minimiza el n&uacute;mero de solicitudes de validaci&oacute;n por conexi&oacute;n. El valor por defecto es 0, lo que significa que el atributo no est&aacute; activado.</p>
</li>
<li>
<p>En el campo Timeout de p&eacute;rdida de conexi&oacute;n, introduzca el tiempo, en segundos, para realizar un seguimiento de las p&eacute;rdidas de conexi&oacute;n de un pool de conexiones.</p>
<p>Use este campo para detectar p&eacute;rdidas en la conexi&oacute;n potenciales por parte de la aplicaci&oacute;n. En caso de que la aplicaci&oacute;n no devuelva la conexi&oacute;n al pool de conexiones dentro del per&iacute;odo especificado, se considerar&aacute; que existen p&eacute;rdidas potenciales y se registrar&aacute; un rastreo de la pila del emisor de la llamada. Defina el valor en 0 para desactivar el seguimiento de las p&eacute;rdidas de conexi&oacute;n. El valor por defecto es 0.</p>
<p>Utilice este campo junto con la Recuperaci&oacute;n de p&eacute;rdida de conexi&oacute;n para evitar p&eacute;rdidas potenciales de conexi&oacute;n de la aplicaci&oacute;n.</p>
</li>
<li>
<p>Active la casilla de control Reclamaci&oacute;n de P&eacute;rdida de Conexi&oacute;n para restaurar las conexiones perdidas en el pool una vez haya finalizado el rastreo de conexiones p&eacute;rdidas.</p>
<p>Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>En el campo Timeout de P&eacute;rdida de Sentencia, introduzca el tiempo, en segundos, para realizar un rastreo de las p&eacute;rdidas de sentencias de un pool de conexiones.</p>
<p>Use este campo para detectar p&eacute;rdidas potenciales de sentencias potenciales por parte de la aplicaci&oacute;n. En caso de que la aplicaci&oacute;n no devuelva una sentencia al pool dentro del per&iacute;odo especificado, se considerar&aacute; que existen p&eacute;rdidas potenciales, y se registrar&aacute; un rastreo de pila del emisor de la llamada. Defina el valor en 0 para desactivar el rastreo de las p&eacute;rdidas de sentencias. El valor por defecto es 0.</p>
<p>Utilice este campo junto con la reclamaci&oacute;n de p&eacute;rdida de sentencia para evitar p&eacute;rdidas potenciales de sentencias desde la aplicaci&oacute;n.</p>
</li>
<li>
<p>Active la casilla de control Reclamaci&oacute;n de P&eacute;rdida de Sentencia para restaurar las sentencias perdidas en el pool una vez haya finalizado el rastreo de sentencias de p&eacute;rdidas.</p>
<p>Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>En el campo Reintentos de creaci&oacute;n, introduzca el n&uacute;mero de intentos que se realizar&aacute;n si se produjera un fallo al crear una conexi&oacute;n nueva.</p>
<p>Defina el valor en 0 para que no se intente crear de nuevo una conexi&oacute;n. El valor por defecto es 0.</p>
</li>
<li>
<p>En el campo Intervalo de reintentos, introduzca el intervalo, en segundos, que hay entre dos intentos de creaci&oacute;n de una conexi&oacute;n.</p>
<p>El valor por defecto es 10. Este atributo se utiliza s&oacute;lo si el valor de Intentos de creaci&oacute;n es mayor que 0.</p>
</li>
<li>
<p>Active la casilla de control de activaci&oacute;n de asociaci&oacute;n lenta para asociar una conexi&oacute;n f&iacute;sica a una recopilaci&oacute;n l&oacute;gica s&oacute;lo cuando se use la conexi&oacute;n.</p>
<p>Las conexiones se disocian cuando la transacci&oacute;n se completa y un m&eacute;todo de componentes finaliza, lo que ayuda a reutilizar las conexiones f&iacute;sicas. Si esta opci&oacute;n est&aacute; desactivada, una conexi&oacute;n f&iacute;sica se asocia con una conexi&oacute;n l&oacute;gica s&oacute;lo incluso antes de usar la conexi&oacute;n. Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>Active la casilla de control de activaci&oacute;n de inscripci&oacute;n lenta de conexiones para inscribir un recurso a la transacci&oacute;n s&oacute;lo cuando realmente se est&eacute; utilizando por un m&eacute;todo.</p>
<p>Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>Active la casilla control de activaci&oacute;n de asociaci&oacute;n a thread para crear asociaciones entre las conexiones y los threads.</p>
<p>Cuando otra conexi&oacute;n necesita el mismo thread, puede volver a utilizar la conexi&oacute;n que ya est&aacute; asociada a ese thread, sin necesidad de incurrir en la sobrecarga de obtener otra conexi&oacute;n del pool. Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>Active la casilla de control de activaci&oacute;n de conexiones coincidentes para activar la coincidencia de conexi&oacute;n para el pool.</p>
<p>Si esta opci&oacute;n est&aacute; activada, las conexiones que se seleccionen en el pool deber&iacute;an coincidir con las conexiones que tienen determinadas credenciales. Esta opci&oacute;n debe estar activada si el pool de conexiones lo utilizan aplicaciones que tienen varias credenciales de usuario. Esta opci&oacute;n se puede desactivar si el administrador sabe que las conexiones del pool siempre ser&aacute;n homog&eacute;neas y, por tanto, el adaptador de recursos no necesitar&aacute; buscar una coincidencia de una conexi&oacute;n seleccionada del pool. Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>En el campo Uso M&aacute;ximo de Conexi&oacute;n, introduzca el n&uacute;mero de veces que el pool debe utilizar una conexi&oacute;n.</p>
<p>La conexi&oacute;n se cerrar&aacute; una vez reutilizada durante un n&uacute;mero espec&iacute;fico de veces. Al limitar el n&uacute;mero de veces que una conexi&oacute;n se puede reutilizar, puede evitar p&eacute;rdidas de sentencia si una aplicaci&oacute;n no las cierra. Defina el valor en 0 para desactivar este atributo. El valor por defecto es 0.</p>
</li>
<li>
<p>Active la casilla de control Validaci&oacute;n de conexi&oacute;n necesaria para activar la validaci&oacute;n de la conexi&oacute;n.</p>
<p>La validaci&oacute;n de conexi&oacute;n permite al servidor volver a conectarse en caso de fallo.</p>
</li>
<li>
<p>En la lista desplegable M&eacute;todo de validaci&oacute;n, seleccione un m&eacute;todo de validaci&oacute;n.</p>
<p>GlassFish Server puede validar las conexiones de la base de datos de las siguientes maneras.</p>
<dl>
<dt><code>auto-commit</code> y <code>metadata</code></dt>
<dd>
<p>GlassFish Server valida una conexi&oacute;n llamando a los m&eacute;todos <code>con.getAutoCommit</code> y <code>con.getMetaData</code>.</p>

<hr>
<p><b>Nota:</b></p>
Muchos controladores JDBC guardan en cach&eacute; los resultados de estas llamadas. Como resultado, al utilizar estas llamadas es posible que no siempre se obtengan validaciones fiables. Compruebe con el proveedor del controlador para determinar si estas llamadas est&aacute;n guardadas en la cach&eacute; o no.
<hr>

</dd>
<dt><code>custom-validation</code></dt>
<dd>
<p>GlassFish Server utiliza un mecanismo de validaci&oacute;n definido por el usuario especificado en la clase de implantaci&oacute;n personalizada, dentro del campo Nombre de clase de validaci&oacute;n.</p>
</dd>
<dt><code>table</code></dt>
<dd>
<p>La aplicaci&oacute;n consulta la tabla de la base de datos especificada. La tabla debe existir y estar accesible, aunque no requiere ninguna fila. No utilice una tabla existente que tenga un gran n&uacute;mero de filas, o una tabla a la que ya se accede con frecuencia.</p>
</dd>
</dl>
</li>
<li>
<p>Si ha seleccionado <code>table</code> en la lista desplegable M&eacute;todo de validaci&oacute;n, introduzca el nombre de la tabla de base de datos en la lista desplegable Nombre de tabla.</p>
</li>
<li>
<p>Si ha seleccionado <code>custom-validation</code> en la lista desplegable M&eacute;todo de Validaci&oacute;n, escriba el nombre de clase de la implantaci&oacute;n de validaci&oacute;n personalizada o selecci&oacute;nelo en la lista desplegable Nombre de Clase de Validaci&oacute;n.</p>
<p>El nombre de clase proporcionado debe ser accesible para GlassFish Server. La clase especificada debe implantar la interfaz <code>org.glassfish.api.jdbc.ConnectionValidation</code>.</p>
</li>
<li>
<p>Active la casilla de control Cerrar todas las conexiones ante cualquier fallo para cerrar el servidor y volver a establecer todas las conexiones en pool cuando no se realice correctamente una conexi&oacute;n &uacute;nica.</p>
<p>Si esta opci&oacute;n est&aacute; desactivada, las conexiones individuales s&oacute;lo se restablecer&aacute;n cuando se utilicen. Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>Active la casilla de control Permitir emisores de llamada que no sean de componentes para que los solicitantes que no sean componentes, como los filtros de servlet y los gestores de persistencia de terceros, puedan utilizar el pool.</p>
<p>Las conexiones obtenidas por emisores que no son componentes no se cierran autom&aacute;ticamente al final de una transacci&oacute;n realizada por el contenedor. El emisor de llamada debe cerrarlas. Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>Haga clic en el bot&oacute;n Vaciar en el separador General para vaciar todas las conexiones del pool.</p>
<p>Al hacer clic en este bot&oacute;n se destruyen todas las conexiones existentes, se vuelven a crear las conexiones establecidas para el pool y se restaura el tama&ntilde;o de pool inicial y m&iacute;nimo.</p>
</li>
<li>
<p>Haga clic en Guardar.</p>

<hr>
<p><b>Sugerencia:</b></p>
Para volver a la configuraci&oacute;n por defecto, haga clic en el bot&oacute;n Cargar Valores por Defecto y, a continuaci&oacute;n, en Guardar.
<hr>

</li>
</ol>
<a id="sthref18" name="sthref18"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">Para configurar base de datos de acceso</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">Para integrar una controlador JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcenew.html">Para crear un recurso JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesedit.html">Para editar un recurso JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcetargets.html">Para editar destinos de recurso JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesdelete.html">Para suprimir un recurso JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">Para crear un pool de conexiones JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">Para editar la configuraci&oacute;n general del pool de conexiones JDBC</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">Para verificar la configuraci&oacute;n de pool de conexiones</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">Para editar propiedades de pool de conexiones JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">Para suprimir un pool de conexiones JDBC</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
