<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jdbcconnectionpoolproperty" name="task-jdbcconnectionpoolproperty"></a><a id="GHJDB00040" name="GHJDB00040"></a></p>

<h4><a id="sthref22" name="sthref22"></a>Para editar propiedades de pool de conexiones JDBC</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Recursos.</p>
</li>
<li>
<p>En el nodo Recursos, ampl&iacute;e el nodo JDBC.</p>
</li>
<li>
<p>En el nodo JDBC, seleccione el nodo Pools de conexiones.</p>
<p>Se abrir&aacute; la p&aacute;gina Pools de conexiones.</p>
</li>
<li>
<p>Haga clic en el nombre del pool de conexiones que est&aacute; editando.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar pool de conexiones.</p>
</li>
<li>
<p>En la p&aacute;gina Editar Pool de Conexiones, haga clic en el separador Propiedades Adicionales.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar propiedades del pool de conexiones.</p>
</li>
<li>
<p>En la secci&oacute;n Propiedades Adicionales, especifique las propiedades adicionales.</p>
<p>Entre los ejemplos de propiedades necesarias, se incluyen el nombre de la base de datos (URL), el nombre de usuario y la contrase&ntilde;a. Para obtener m&aacute;s informaci&oacute;n sobre las propiedades disponibles, consulte <a href="ref-jdbc-properties.html">Propiedades espec&iacute;ficas de JDBC pools de conexiones</a>.</p>
<p>Si no especifica un valor para una propiedad, &eacute;sta se elimina de la tabla al finalizar la edici&oacute;n del pool de conexiones. Si no desea definir un valor para una propiedad ahora, pero desea que la propiedad permanezca en la tabla para que el valor se pueda definir m&aacute;s adelante, introduzca un juego de par&eacute;ntesis vac&iacute;o en el campo Valor:</p>
<pre>
()
</pre>
<ul>
<li>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, introduzca el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
</li>
<li>
<p>Para modificar una propiedad, edite el campo Valor.</p>
</li>
<li>
<p>Para suprimir una propiedad, active la casilla de control a la izquierda del campo Nombre de la propiedad que est&aacute; suprimiendo y, a continuaci&oacute;n, haga clic en el bot&oacute;n Suprimir Propiedades.</p>
</li>
</ul>
</li>
<li>
<p>Haga clic en Guardar.</p>
</li>
</ol>
<a id="sthref23" name="sthref23"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">Para configurar base de datos de acceso</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">Para integrar una controlador JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcenew.html">Para crear un recurso JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesedit.html">Para editar un recurso JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcetargets.html">Para editar destinos de recurso JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesdelete.html">Para suprimir un recurso JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">Para crear un pool de conexiones JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">Para editar la configuraci&oacute;n general del pool de conexiones JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">Para editar atributos avanzados del pool de conexiones JDBC</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">Para verificar la configuraci&oacute;n de pool de conexiones</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">Para suprimir un pool de conexiones JDBC</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
