<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jdbcconnectionpoolnew" name="task-jdbcconnectionpoolnew"></a></p>

<h4><a id="sthref14" name="sthref14"></a>Para crear un pool de conexiones JDBC</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Cuando se crea un pool de conexiones con la Consola de administraci&oacute;n, est&aacute; definiendo los aspectos de una conexi&oacute;n con una base de datos espec&iacute;fica.</p>
<a id="sthref15" name="sthref15"></a>
<h5>Antes de Empezar</h5>
<p>Para crear un pool de conexiones, en primer lugar debe instalar e integrar un controlador que soporte la API de JDBC (controlador JDBC). Consulte <a href="task-integratejdbcdriver.html">Para integrar una controlador JDBC</a>.</p>
<p>La siguiente informaci&oacute;n es necesaria a la hora de crear el pool de conexiones JDBC. Recopile esta informaci&oacute;n antes de continuar:</p>
<ul>
<li>
<p>Nombre de proveedor del controlador de la base de datos</p>
</li>
<li>
<p>Tipo de recurso, como <code>javax.sql.DataSource</code> (s&oacute;lo transacciones locales), <code>java.sql.ConnectionPoolDataSource</code> (transacciones locales, posibles mejoras de rendimiento), <code>javax.sql.XADataSource</code> (transacciones globales) y <code>java.sql.Driver</code></p>
</li>
<li>
<p>Nombre de clase de origen de datos</p>
</li>
<li>
<p>Propiedades obligatorias, como el nombre de la base de datos (URL), nombre de usuario y la contrase&ntilde;a.</p>
</li>
</ul>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, seleccione el nodo Tareas comunes.</p>
<p>Se abrir&aacute; la p&aacute;gina Tareas comunes.</p>
</li>
<li>
<p>En la p&aacute;gina Tareas comunes, haga clic en el bot&oacute;n Crear nuevo pool de conexiones JDBC</p>
<p>Se abrir&aacute; la p&aacute;gina Nuevo pool de conexiones JDBC (paso 1 de 2)</p>

<hr>
<p><b>Nota:</b></p>
Tambi&eacute;n puede acceder a la p&aacute;gina Nuevo pool de conexiones JDBC si ampl&iacute;a los nodos Recursos y JDBC, y despu&eacute;s selecciona el nodo Pools de conexiones. A continuaci&oacute;n, en la p&aacute;gina Pools de conexiones, haga clic en Nuevo para crear un pool de conexiones.
<hr>

</li>
<li>
<p>En el campo Nombre de pool, asigne un nombre al nuevo pool de conexiones.</p>
<p>Se trata de un campo obligatorio.</p>
</li>
<li>
<p>En la lista desplegable Tipo de recurso, seleccione un tipo de recurso.</p>
<p>Entre las opciones se incluyen <code>javax.sql.XADataSource</code> (transacciones globales), <code>java.sql.ConnectionPoolDataSource</code> (transacciones locales, posibles mejoras del rendimiento), <code>javax.sql.DataSource</code> (s&oacute;lo transacciones locales) y <code>java.sql.Driver</code>.</p>
</li>
<li>
<p>Especifique un proveedor de base de datos:</p>
<ol type="a">
<li>
<p>En la lista desplegable Proveedor de Controladores de la Base de Datos, seleccione un proveedor de base de datos.</p>
</li>
<li>
<p>Si el proveedor de base de datos no aparece en la lista, escriba el nombre del proveedor en el campo de texto Proveedor de Controladores de la Base de Datos.</p>
</li>
</ol>
</li>
<li>
<p>Active la casilla de control de activaci&oacute;n de introspecci&oacute;n para realizar la introspecci&oacute;n del controlador de la base de datos en funci&oacute;n del tipo de recurso y del proveedor del controlador de la base de datos.</p>
<p>Para que la introspecci&oacute;n funcione correctamente, el controlador JDBC debe estar disponible para GlassFish Server. Consulte <a href="task-integratejdbcdriver.html">Para integrar una controlador JDBC</a>.</p>
</li>
<li>
<p>Haga clic en Siguiente.</p>
<p>Se abrir&aacute; la p&aacute;gina Nuevo pool de conexiones JDBC (paso 2 de 2)</p>
</li>
<li>
<p>En el campo Nombre de Clase de Origen de Datos, introduzca el nombre de la clase espec&iacute;fica del proveedor que implanta las API <code>DataSource</code>, <code>ConnectionPoolDataSource</code> o <code>XADataSource</code> .</p>
<p>Si ha activado la introspecci&oacute;n y seleccionado uno de los tipos de recursos de origen de datos, este campo se rellenar&aacute; autom&aacute;ticamente con el nombre de clase asociada al tipo de recurso y al proveedor de bases de datos que haya seleccionado. Si ha seleccionado el tipo de recurso <code>java.sql.Driver</code>, este campo est&aacute; desactivado.</p>
</li>
<li>
<p>En el campo Nombre de clase del controlador, escriba la clase espec&iacute;fica del proveedor que implanta la API <code>java.sql.Driver</code>.</p>
<p>Si ha activado la introspecci&oacute;n o seleccionado el tipo de recurso <code>java.sql.Driver</code>, este campo se rellenar&aacute; autom&aacute;ticamente con el nombre de clase asociada al controlador y al proveedor de bases de datos que haya seleccionado. Si ha seleccionado uno de los tipos de recursos de origen de datos, este campo est&aacute; desactivado.</p>
</li>
<li>
<p>Active la casilla de control de activaci&oacute;n de ping para hacer ping autom&aacute;ticamente en el pool de conexiones durante la creaci&oacute;n o reconfiguraci&oacute;n del pool para identificar y avisarle de cualquier valor de atributo incorrecto.</p>
<p>Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>En el campo Descripci&oacute;n, introduzca una breve descripci&oacute;n del pool de conexiones.</p>
</li>
<li>
<p>En el campo Tama&ntilde;o de pool inicial y m&iacute;nimo:, introduzca el n&uacute;mero m&iacute;nimo de conexiones de este pool.</p>
<p>Este valor tambi&eacute;n determina el n&uacute;mero de conexiones incluidas en el pool cuando se crea el pool por primera vez o cuando se inicia GlassFish Server. El valor por defecto es 8.</p>
</li>
<li>
<p>En el campo Tama&ntilde;o de pool m&aacute;ximo, introduzca el n&uacute;mero m&aacute;ximo de conexiones de este pool.</p>
<p>El valor por defecto es 32.</p>
</li>
<li>
<p>En el campo Cantidad de cambio de tama&ntilde;o de pool, introduzca el n&uacute;mero de conexiones por lote de cambio de tama&ntilde;o de pool.</p>
<p>Cuando el pool se ampl&iacute;a y reduce hacia el tama&ntilde;o m&aacute;ximo y m&iacute;nimo respectivamente, se cambia el tama&ntilde;o en lotes. Este valor determina el n&uacute;mero de conexiones en el lote. Si este valor es demasiado grande, se retrasar&aacute; la creaci&oacute;n y el reciclado de las conexiones y, si es demasiado peque&ntilde;o, el proceso perder&aacute; eficacia. El valor por defecto es 2.</p>
</li>
<li>
<p>En el campo Timeout de inactividad, introduzca el tiempo m&aacute;ximo, en segundos, que una conexi&oacute;n puede permanecer inactiva en el pool.</p>
<p>Una vez vencido el tiempo, se elimina la conexi&oacute;n del pool. El valor por defecto es 300.</p>
</li>
<li>
<p>En el campo Tiempo de espera m&aacute;ximo, introduzca el tiempo m&aacute;ximo, en mil&eacute;simas de segundo, que la aplicaci&oacute;n que solicita una conexi&oacute;n esperar&aacute; antes de obtener un timeout de conexi&oacute;n.</p>
<p>El valor por defecto es 60.000.</p>
</li>
<li>
<p>Active la casilla de control de activaci&oacute;n de conexiones no transaccionales activadas para devolver conexiones no transaccionales.</p>
<p>Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>En la lista desplegable Nivel de aislamiento de transacci&oacute;n, seleccione un nivel de aislamiento de transacci&oacute;n para este pool de conexiones.</p>
<p>Si no se especifica nada, las conexiones funcionan con los niveles de aislamiento por defecto que proporciona el controlador JDBC. Por defecto, no se especifica esta opci&oacute;n.</p>
</li>
<li>
<p>Active la casilla de control Nivel garantizado para asegurarse de que todas las conexiones que se han obtenido del pool tengan el mismo nivel de aislamiento.</p>
<p>Por ejemplo, si el nivel de aislamiento para la conexi&oacute;n se cambia de forma programada (con <code>con.setTransactionIsolation</code> ) cuando se utiliza por &uacute;ltima vez, este mecanismo devuelve el estado al nivel de aislamiento especificado. Esta opci&oacute;n se encuentra activada por defecto.</p>
<p>Esta configuraci&oacute;n s&oacute;lo es aplicable si se ha especificado un nivel de aislamiento de transacci&oacute;n.</p>
</li>
<li>
<p>En la secci&oacute;n Propiedades Adicionales, especifique las propiedades adicionales.</p>
<p>Entre los ejemplos de propiedades necesarias, se incluyen el nombre de la base de datos (URL), el nombre de usuario y la contrase&ntilde;a. La tabla suele contener las propiedades utilizadas por el proveedor de la base de datos. Para obtener informaci&oacute;n sobre algunas de las propiedades disponibles, consulte <a href="ref-jdbc-properties.html">Propiedades espec&iacute;ficas de JDBC pools de conexiones</a>.</p>
<p>Si no especifica un valor para una propiedad, &eacute;ste se eliminar&aacute; de la tabla cuando acabe de crear el pool de conexiones. Si no desea definir un valor para una propiedad ahora, pero desea que la propiedad permanezca en la tabla para que el valor se pueda definir m&aacute;s adelante, introduzca un juego de par&eacute;ntesis vac&iacute;o en el campo Valor:</p>
<pre>
()
</pre>
<ul>
<li>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, introduzca el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
</li>
<li>
<p>Para modificar una propiedad, edite el campo Valor.</p>
</li>
<li>
<p>Para suprimir una propiedad, active la casilla de control a la izquierda del campo Nombre de la propiedad que est&aacute; suprimiendo y, a continuaci&oacute;n, haga clic en el bot&oacute;n Suprimir Propiedades.</p>
</li>
</ul>
</li>
<li>
<p>Haga clic en Finalizar.</p>
</li>
</ol>
<a id="sthref16" name="sthref16"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">Para configurar base de datos de acceso</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">Para integrar una controlador JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcenew.html">Para crear un recurso JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesedit.html">Para editar un recurso JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcetargets.html">Para editar destinos de recurso JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesdelete.html">Para suprimir un recurso JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">Para editar la configuraci&oacute;n general del pool de conexiones JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">Para editar atributos avanzados del pool de conexiones JDBC</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">Para verificar la configuraci&oacute;n de pool de conexiones</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">Para editar propiedades de pool de conexiones JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">Para suprimir un pool de conexiones JDBC</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
