<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-orb" name="ref-orb"></a></p>

<h4><a id="sthref14" name="sthref14"></a><a id="sthref15" name="sthref15"></a>ORB</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Object Request Broker&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;ORB&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>ORB&#12399;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#35672;&#21029;&#12392;&#26908;&#32034;&#12289;&#25509;&#32154;&#31649;&#29702;&#12289;&#12487;&#12540;&#12479;&#12398;&#37197;&#20449;&#12362;&#12424;&#12403;&#12522;&#36890;&#20449;&#12463;&#12456;&#12473;&#12488;&#12395;&#24517;&#35201;&#12394;&#12452;&#12531;&#12501;&#12521;&#12473;&#12488;&#12521;&#12463;&#12481;&#12515;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;Bean (EJB&#12514;&#12472;&#12517;&#12540;&#12523;)&#12398;&#12522;&#12514;&#12540;&#12488;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12399;&#12289;ORB&#12434;&#20351;&#29992;&#12375;&#12390;GlassFish Server&#12392;&#36890;&#20449;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;ORB&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12489;</dt>
<dd>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12354;&#12427;&#35373;&#23450;&#12434;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12395;&#24489;&#20803;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12394;&#12356;&#35373;&#23450;&#12399;&#22793;&#26356;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>&#27083;&#25104;&#21517;</dt>
<dd>
<p>&#12371;&#12398;&#12506;&#12540;&#12472;&#12398;&#35373;&#23450;&#12364;&#36969;&#29992;&#12373;&#12428;&#12427;&#27083;&#25104;&#12398;&#21517;&#21069;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;ID</dt>
<dd>
<p>ORB&#12364;&#20351;&#29992;&#12377;&#12427;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12290;ORB&#12399;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;Bean&#12398;&#12522;&#12514;&#12540;&#12488;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12362;&#12424;&#12403;RMI-IIOP&#12434;&#20351;&#29992;&#12375;&#12390;&#36890;&#20449;&#12377;&#12427;&#20182;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12363;&#12425;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12395;&#24540;&#31572;&#12375;&#12414;&#12377;&#12290;ORB&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12399;<code>thread-pool-1</code>&#12391;&#12377;&#12290;&#12371;&#12398;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12399;&#12289;RMI/IIOP&#12522;&#12463;&#12456;&#12473;&#12488;&#12395;&#36969;&#20999;&#12394;&#12487;&#12501;&#12457;&#12523;&#12488;&#35373;&#23450;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12501;&#12521;&#12464;&#12513;&#12531;&#12488;&#12539;&#12469;&#12452;&#12474;</dt>
<dd>
<p>IIOP&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#26368;&#22823;&#12501;&#12521;&#12464;&#12513;&#12531;&#12488;&#12539;&#12469;&#12452;&#12474;&#12290;&#12371;&#12398;&#12469;&#12452;&#12474;&#12424;&#12426;&#22823;&#12365;&#12356;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#20998;&#21106;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;1024&#12496;&#12452;&#12488;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#21512;&#35336;&#25509;&#32154;&#25968;</dt>
<dd>
<p>&#12377;&#12409;&#12390;&#12398;IIOP&#12522;&#12473;&#12490;&#12540;&#12398;&#21463;&#20449;&#25509;&#32154;&#12398;&#26368;&#22823;&#25968;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;1024&#12391;&#12377;&#12290;</p>
</dd>
<dt>IIOP&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#35469;&#35388;</dt>
<dd>
<p>&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12469;&#12540;&#12496;&#12540;&#12399;&#35469;&#35388;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#25298;&#21542;&#12375;&#12289;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12395;&#36865;&#20449;&#12373;&#12428;&#12383;Interoperable Object Reference (IOR)&#12395;&#35469;&#35388;&#24517;&#38920;&#12398;&#12499;&#12483;&#12488;&#12434;&#25407;&#20837;&#12375;&#12414;&#12377;&#12290;IIOP&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#35469;&#35388;&#12399;&#26377;&#21177;&#12414;&#12383;&#12399;&#28961;&#21177;&#12395;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;</dt>
<dd>
<p>ORB&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12290;GlassFish Server&#12399;ORB&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#23450;&#32681;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
</dl>
<a id="sthref16" name="sthref16"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-orb.html">ORB&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-iioplistenernew.html">IIOP&#12522;&#12473;&#12490;&#12540;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-iioplisteneredit.html">IIOP&#12522;&#12473;&#12490;&#12540;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-editiiopssl.html">&#12477;&#12540;&#12473;IIOP&#12522;&#12473;&#12490;&#12540;&#29992;&#12395;SSL&#35373;&#23450;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-iioplistenerdelete.html">IIOP&#12522;&#12473;&#12490;&#12540;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref17" name="sthref17"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00032"><code>create-iiop-listener</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00169"><code>list-iiop-listeners</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00084"><code>delete-iiop-listener</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00058"><code>create-ssl</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00109"><code>delete-ssl</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
