<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-orb" name="task-orb"></a></p>

<h4><a id="sthref2" name="sthref2"></a><a id="sthref3" name="sthref3"></a>ORB&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#12484;&#12522;&#12540;&#12539;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12391;&#12289;&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#27083;&#25104;&#12377;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;:</p>
<ul>
<li>
<p>&#29305;&#23450;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12381;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#27083;&#25104;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;<code>server</code>&#12398;&#22580;&#21512;&#12399;&#12289;<code>server-config</code>&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p><code>default-config</code>&#12398;&#12467;&#12500;&#12540;&#12434;&#20351;&#29992;&#12377;&#12427;&#23558;&#26469;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12383;&#12417;&#12395;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#35373;&#23450;&#20516;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;<code>default-config</code>&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;ORB&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;ORB&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;ID&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;ORB&#12364;&#20351;&#29992;&#12377;&#12427;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>ORB&#12399;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;Bean&#12398;&#12522;&#12514;&#12540;&#12488;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12362;&#12424;&#12403;RMI-IIOP&#12434;&#20351;&#29992;&#12375;&#12390;&#36890;&#20449;&#12377;&#12427;&#20182;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12363;&#12425;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12395;&#24540;&#31572;&#12375;&#12414;&#12377;&#12290;ORB&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12399;<code>thread-pool-1</code>&#12391;&#12377;&#12290;&#12371;&#12398;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12399;&#12289;RMI/IIOP&#12522;&#12463;&#12456;&#12473;&#12488;&#12395;&#36969;&#20999;&#12394;&#12487;&#12501;&#12457;&#12523;&#12488;&#35373;&#23450;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#35443;&#32048;&#12399;&#12289;&#12300;<a href="../../../web/en/help/ref-threadpools.html">&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;</a>&#12301;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
<li>
<p>&#12300;&#26368;&#22823;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12501;&#12521;&#12464;&#12513;&#12531;&#12488;&#12539;&#12469;&#12452;&#12474;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;IIOP&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#26368;&#22823;&#12501;&#12521;&#12464;&#12513;&#12531;&#12488;&#12539;&#12469;&#12452;&#12474;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12469;&#12452;&#12474;&#12424;&#12426;&#22823;&#12365;&#12356;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#20998;&#21106;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;1024&#12496;&#12452;&#12488;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#21512;&#35336;&#25509;&#32154;&#25968;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12377;&#12409;&#12390;&#12398;IIOP&#12522;&#12473;&#12490;&#12540;&#12398;&#21463;&#20449;&#25509;&#32154;&#12398;&#26368;&#22823;&#25968;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;1024&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;IIOP&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#35469;&#35388;&#12301;&#12398;&#12300;&#24517;&#38920;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;IIOP&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#35469;&#35388;&#12364;&#24517;&#35201;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>IIOP&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#35469;&#35388;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12289;&#12469;&#12540;&#12496;&#12540;&#12399;&#35469;&#35388;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#25298;&#21542;&#12375;&#12289;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12395;&#36865;&#20449;&#12373;&#12428;&#12383;Interoperable Object Reference (IOR)&#12395;&#35469;&#35388;&#24517;&#38920;&#12398;&#12499;&#12483;&#12488;&#12434;&#25407;&#20837;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#38936;&#22495;&#12395;&#12289;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>GlassFish Server&#12399;ORB&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#23450;&#32681;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
<ul>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#34920;&#31034;&#12373;&#12428;&#12427;&#31354;&#30333;&#34892;&#12391;&#12289;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#21517;&#12434;&#20837;&#21147;&#12375;&#12289;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;&#12289;&#12381;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#32232;&#38598;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;&#12289;&#21066;&#38500;&#12377;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12398;&#24038;&#20596;&#12395;&#12354;&#12427;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21066;&#38500;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#12498;&#12531;&#12488;:</b></p>
&#12487;&#12501;&#12457;&#12523;&#12488;&#35373;&#23450;&#12395;&#36820;&#12377;&#12395;&#12399;&#12289;&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12489;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12289;&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;<br />
<hr>

</li>
<li>
<p>GlassFish Server&#12434;&#20877;&#36215;&#21205;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref4" name="sthref4"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-iioplistenernew.html">IIOP&#12522;&#12473;&#12490;&#12540;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-iioplisteneredit.html">IIOP&#12522;&#12473;&#12490;&#12540;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-editiiopssl.html">&#12477;&#12540;&#12473;IIOP&#12522;&#12473;&#12490;&#12540;&#29992;&#12395;SSL&#35373;&#23450;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-iioplistenerdelete.html">IIOP&#12522;&#12473;&#12490;&#12540;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
