<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-transactionservice" name="ref-transactionservice"></a></p>

<h4><a id="sthref14" name="sthref14"></a>Servicio de Transacci&oacute;n</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Servicio de Transacci&oacute;n para configurar la recuperaci&oacute;n, timeouts y registro de la transacci&oacute;n.</p>
<p>La p&aacute;gina Servicio de Transacci&oacute;n contiene las siguientes opciones.</p>
<dl>
<dt>Cargar Valores por Defecto</dt>
<dd>
<p>Bot&oacute;n para restaurar configuraci&oacute;n que tiene valores por defecto a sus valores por defecto. Las configuraciones que no tienen valores por defecto no se modifican.</p>
</dd>
<dt>Nombre de Configuraci&oacute;n</dt>
<dd>
<p>Nombre de la configuraci&oacute;n a la que se aplican los valores de esta p&aacute;gina. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>Al Reiniciar</dt>
<dd>
<p>Si se activa la casilla de control Activado, GlassFish Server intenta recuperar las transacciones incompletas cuando se reinicia el servidor. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Timeout de Transacci&oacute;n</dt>
<dd>
<p>N&uacute;mero se segundos que espera un servidor antes realizar un rollback de una transacci&oacute;n que no se haya terminado. El valor por defecto es cero, lo que supone que el servidor espera indefinidamente para que se complete la transacci&oacute;n.</p>
</dd>
<dt>Timeout de Reintentos</dt>
<dd>
<p>N&uacute;mero de segundos durante los cuales GlassFish Server intenta conectarse a un servidor inaccesible. El valor por defecto es 600 (10 minutos).</p>
</dd>
<dt>Ubicaci&oacute;n de Log de Transacciones</dt>
<dd>
<p>Directorio en el que se mantienen los logs del servidor. Los logs de transacciones se guardan en el subdirectorio <code>tx</code> del directorio especificado en este campo. El valor por defecto es el directorio especificado en el campo Ra&iacute;z de Log de la p&aacute;gina Atributos de Dominio, que est&aacute; ubicada en el separador Avanzado del nodo GlassFish Server.</p>
</dd>
<dt>Decisi&oacute;n Heur&iacute;stica</dt>
<dd>
<p>Si las transacciones que implican servidores inaccesibles se confirman o se les realiza un rollback. El valor por defecto es Realizar Rollback. La confirmaci&oacute;n de transacciones indeterminadas puede poner en peligro la integridad de los datos de la aplicaci&oacute;n.</p>
</dd>
<dt>Intervalo de Punto Clave</dt>
<dd>
<p>N&uacute;mero de transacciones entre las operaciones de puntos clave, que comprimen la transacci&oacute;n del archivo log. El valor por defecto es 65536.</p>
</dd>
<dt>Propiedades Adicionales</dt>
<dd>
<p>Propiedades adicionales del servicio de transacci&oacute;n.</p>
<p>Para obtener una descripci&oacute;n de las propiedades disponibles, consulte <a href="ref-transactionsvcproperties.html">Propiedades espec&iacute;ficas para el servicio de transacci&oacute;n</a>.</p>
</dd>
</dl>
<a id="sthref15" name="sthref15"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-configtransservice.html">Para configurar el servicio de transacci&oacute;n</a></p>
</li>
<li>
<p><a href="task-configtransrecovery.html">Para configurar la forma en que GlassFish Server recupera las transacciones</a></p>
</li>
<li>
<p><a href="task-settranstimeout.html">Para definir un valor de timeout de transacci&oacute;n</a></p>
</li>
<li>
<p><a href="task-settranslog.html">Para definir la ubicaci&oacute;n de los logs de transacci&oacute;n</a></p>
</li>
<li>
<p><a href="task-setkeyptinterval.html">Para definir el intervalo de punto clave</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
