<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-transactionsvcproperties" name="ref-transactionsvcproperties"></a><a id="GHJTS00003" name="GHJTS00003"></a></p>

<h4><a id="sthref16" name="sthref16"></a><a id="sthref17" name="sthref17"></a>Propiedades espec&iacute;ficas para el servicio de transacci&oacute;n</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Las siguientes propiedades adicionales est&aacute;n disponibles para configurar el servicio de transacci&oacute;n.</p>
<dl>
<dt><code>oracle-xa-recovery-workaround</code></dt>
<dd>
<p>Si se define en <code>true</code>, se utiliza la soluci&oacute;n alternativa del recurso Oracle XA en la recuperaci&oacute;n de transacci&oacute;n. El valor por defecto es <code>true</code>.</p>
</dd>
<dt><code>disable-distributed-transaction-logging</code></dt>
<dd>
<p>Si se define como <code>true</code>, se desactiva el registro de transacciones, que puede mejorar el rendimiento. Si la casilla de control Al Reiniciar est&aacute; activada, esta propiedad se ignora. El valor por defecto es <code>false</code>.</p>
</dd>
<dt><code>xaresource-txn-timeout</code></dt>
<dd>
<p>Cambia el timeout de <code>XAResource</code>. En algunos casos, el timeout por defecto de <code>XAResource</code> puede hacer que se aborten las transacciones, as&iacute; que es aconsejable cambiarlo. El valor por defecto es espec&iacute;fico del <code>XAResource</code> utilizado.</p>
</dd>
<dt><code>pending-txn-cleanup-interval</code></dt>
<dd>
<p>Especifica el intervalo en segundos en el que un thread as&iacute;ncrono comprueba las transacciones pendientes y las completa. Si no se especifica esta propiedad, no existe ning&uacute;n valor por defecto. Si esta propiedad est&aacute; presente pero no tiene ning&uacute;n valor, el valor por defecto es 60.</p>
</dd>
<dt><code>use-last-agent-optimization</code></dt>
<dd>
<p>Si se define como <code>true</code>, se activa el &uacute;ltimo agente de optimizaci&oacute;n, que mejora el rendimiento de las transacciones. Si se utiliza uno de los recursos no-XA junto con recursos XA en la misma transacci&oacute;n, el recurso no-XA es el &uacute;ltimo agente. El valor por defecto es <code>true</code>.</p>
</dd>
<dt><code>delegated-recovery</code></dt>
<dd>
<p>Si se define como <code>true</code>, se activa la recuperaci&oacute;n delegada en todo el cluster. El valor por defecto es false.</p>
</dd>
<dt><code>wait-time-before-recovery-insec</code></dt>
<dd>
<p>Especifica el tiempo de espera en segundos, despu&eacute;s del cual una instancia inicia la recuperaci&oacute;n de una instancia inoperativa.</p>
</dd>
<dt><code>db-logging-resource</code></dt>
<dd>
<p>Especifica el nombre JNDI del recurso JDBC para la base de datos en la que se registran las transacciones. Para obtener m&aacute;s informaci&oacute;n, consulte el <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDVG00018">Cap&iacute;tulo 17 sobre <i>c&oacute;mo utilizar el servicio de transacci&oacute;n</i> de <i>Oracle GlassFish Server Application Development Guide</i></a>. No hay ning&uacute;n valor por defecto.</p>
</dd>
<dt><code>xa-servername</code></dt>
<dd>
<p>Especifica el nombre de host que utiliza el servicio de transacci&oacute;n para identificar las transacciones gestionadas por el GlassFish Server instalado. A veces, esto puede ser &uacute;til para recuperar transacciones del archivo log que se hab&iacute;a creado en un host diferente que ejecute GlassFish Server.</p>
</dd>
</dl>




<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
