<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-configtransrecovery" name="task-configtransrecovery"></a><a id="GHJTS00005" name="GHJTS00005"></a></p>

<h4><a id="sthref4" name="sthref4"></a>Para configurar la forma en que GlassFish Server recupera las transacciones</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Las transacciones pueden no completarse por bloqueo del servidor o por bloqueo del gestor de recursos entre las fases de una confirmaci&oacute;n de dos fases. Es esencial completar estas transacciones derivadas y solucionar el fallo. GlassFish Server est&aacute; dise&ntilde;ado para recuperarse de estos fallos y completar la transacci&oacute;n al iniciar el servidor.</p>
<p>Antes de realizar la recuperaci&oacute;n, aseg&uacute;rese de que todos los recursos implicados est&aacute;n activos y en ejeccuci&oacute;n.</p>
<p>Cuando la transacci&oacute;n abarca varios servidores, el servidor que inici&oacute; la transacci&oacute;n puede contactar con los dem&aacute;s servidores para obtener el resultado de las transacciones. Si los dem&aacute;s servidores no son accesibles, la transacci&oacute;n utilizar&aacute; el campo Decisi&oacute;n Heur&iacute;stica para determinar el resultado.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Configuraci&oacute;n.</p>
</li>
<li>
<p>Seleccione la instancia que va a configurar:</p>
<ul>
<li>
<p>Para configurar una instancia determinada, seleccione el nodo de configuraci&oacute;n de la instancia. Por ejemplo, para la instancia por defecto <code>server</code>, seleccione el nodo <code>server-config</code>.</p>
</li>
<li>
<p>Para configurar los valores por defecto para todas las instancias, seleccione el nodo <code>default-config</code>.</p>
</li>
</ul>
</li>
<li>
<p>Seleccione el nodo Servicio de Transacci&oacute;n.</p>
<p>Se abrir&aacute; la p&aacute;gina Servicio de Transacci&oacute;n.</p>
</li>
<li>
<p>En la p&aacute;gina Servicio de Transacci&oacute;n, active la casilla de control Al Reiniciar para activar la recuperaci&oacute;n de transacciones incompletas.</p>
<p>Por defecto, no se activa la casilla de control Activado.</p>
</li>
<li>
<p>En el campo Timeout de Reintentos, introduzca el n&uacute;mero de segundos que GlassFish Server intenta conectarse a un servidor inaccesible.</p>
<p>El valor por defecto es 600 (10 minutos).</p>
</li>
<li>
<p>En la lista desplegable Decisi&oacute;n Heur&iacute;stica, seleccione la pol&iacute;tica de servidores inaccesibles de una transacci&oacute;n.</p>
<p>A menos que exista una buena raz&oacute;n para seleccionar Confirmar, deje la opci&oacute;n Decisi&oacute;n Heur&iacute;stica en Realizar Rollback (el valor por defecto). La confirmaci&oacute;n de transacciones indeterminadas puede poner en peligro la integridad de los datos de la aplicaci&oacute;n.</p>
</li>
<li>
<p>Haga clic en Guardar.</p>
</li>
<li>
<p>Reinicie GlassFish Server.</p>
</li>
</ol>
<a id="sthref5" name="sthref5"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-configtransservice.html">Para configurar el servicio de transacci&oacute;n</a></p>
</li>
<li>
<p><a href="task-settranstimeout.html">Para definir un valor de timeout de transacci&oacute;n</a></p>
</li>
<li>
<p><a href="task-settranslog.html">Para definir la ubicaci&oacute;n de los logs de transacci&oacute;n</a></p>
</li>
<li>
<p><a href="task-setkeyptinterval.html">Para definir el intervalo de punto clave</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
