<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-setkeyptinterval" name="task-setkeyptinterval"></a><a id="GHJTS00008" name="GHJTS00008"></a></p>

<h4><a id="sthref11" name="sthref11"></a><a id="sthref12" name="sthref12"></a>Para definir el intervalo de punto clave</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Las operaciones de puntos clave comprimen el archivo log de transacciones. El intervalo de punto clave es el n&uacute;mero de transacciones entre las operaciones de puntos clave en el log. Las operaciones de punto clave pueden reducir el tama&ntilde;o de los archivos log de transacciones. Un n&uacute;mero elevado de intervalos de puntos clave puede tener como resultado archivos log de transacciones mayores pero menos operaciones de puntos clave y potencialmente un rendimiento mejor. Un intervalo de punto clave m&aacute;s peque&ntilde;o (por ejemplo, 256) originar&aacute; archivos log m&aacute;s peque&ntilde;os, pero se ver&aacute; afectado el rendimiento debido a la mayor frecuencia de operaciones de puntos clave.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Configuraci&oacute;n.</p>
</li>
<li>
<p>Seleccione la instancia que va a configurar:</p>
<ul>
<li>
<p>Para configurar una instancia determinada, seleccione el nodo de configuraci&oacute;n de la instancia. Por ejemplo, para la instancia por defecto <code>server</code>, seleccione el nodo <code>server-config</code>.</p>
</li>
<li>
<p>Para configurar los valores por defecto para todas las instancias, seleccione el nodo <code>default-config</code>.</p>
</li>
</ul>
</li>
<li>
<p>Seleccione el nodo Servicio de Transacci&oacute;n.</p>
<p>Se abrir&aacute; la p&aacute;gina Servicio de Transacci&oacute;n.</p>
</li>
<li>
<p>En el campo Intervalo de Punto Clave, escriba el n&uacute;mero de transacciones entre las operaciones de puntos clave.</p>
<p>El valor por defecto es 65536.</p>
</li>
<li>
<p>Haga clic en Guardar.</p>
</li>
</ol>
<a id="sthref13" name="sthref13"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-configtransservice.html">Para configurar el servicio de transacci&oacute;n</a></p>
</li>
<li>
<p><a href="task-configtransrecovery.html">Para configurar la forma en que GlassFish Server recupera las transacciones</a></p>
</li>
<li>
<p><a href="task-settranstimeout.html">Para definir un valor de timeout de transacci&oacute;n</a></p>
</li>
<li>
<p><a href="task-settranslog.html">Para definir la ubicaci&oacute;n de los logs de transacci&oacute;n</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
