<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsconnectionnew" name="ref-jmsconnectionnew"></a><a id="GHJMS00003" name="GHJMS00003"></a></p>

<h4><a id="sthref49" name="sthref49"></a><a id="sthref50" name="sthref50"></a>&#26032;&#24314; JMS &#36899;&#32218;&#24037;&#24288;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&#12300;&#26032;&#24314; JMS &#36899;&#32218;&#24037;&#24288;&#12301;&#38913;&#38754;&#21487;&#24314;&#31435;&#26032;&#30340; JMS &#36899;&#32218;&#24037;&#24288;&#12290;</p>
<p>&#12300;&#26032;&#24314; JMS &#36899;&#32218;&#24037;&#24288;&#12301;&#38913;&#38754;&#21253;&#21547;&#19979;&#21015;&#36984;&#38917;&#12290;</p>
<dl>
<dt>&#38598;&#21312;&#21517;&#31281;</dt>
<dd>
<p>&#21487;&#35672;&#21029;&#36899;&#32218;&#24037;&#24288;&#30340;&#21807;&#19968;&#21517;&#31281;&#12290;GlassFish Server &#26371;&#23559;&#36899;&#32218;&#24037;&#24288;&#30340; JNDI &#21517;&#31281;&#35373;&#28858;&#27492;&#20540;&#12290;</p>
</dd>
<dt>&#36039;&#28304;&#39006;&#22411;</dt>
<dd>
<p>&#36899;&#32218;&#24037;&#24288;&#30340;&#39006;&#22411;&#12290;&#21487;&#29992;&#30340;&#36984;&#38917;&#21253;&#25324; <code>javax.jms.ConnectionFactory</code>&#12289;<code>javax.jms.QueueConnectionFactory</code> &#21644; <code>javax.jms.TopicConnectionFactory</code>&#12290;</p>
</dd>
<dt>&#25551;&#36848;</dt>
<dd>
<p>&#36899;&#32218;&#24037;&#24288;&#30340;&#25551;&#36848;&#12290;</p>
</dd>
<dt>&#29376;&#24907;</dt>
<dd>
<p>&#36899;&#32218;&#24037;&#24288;&#30340;&#29376;&#24907;&#12290;&#24744;&#21487;&#21855;&#29992;&#25110;&#20572;&#29992;&#36899;&#32218;&#24037;&#24288;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#21855;&#29992;&#12290;</p>
</dd>
<dt>&#38598;&#21312;&#30340;&#21021;&#22987;&#22823;&#23567;&#21644;&#26368;&#23567;&#22823;&#23567;</dt>
<dd>
<p>&#36899;&#32218;&#24037;&#24288;&#30340;&#38598;&#21312;&#20013;&#26368;&#23567;&#30340;&#36899;&#32218;&#25976;&#30446;&#12290;&#38928;&#35373;&#20540;&#28858; 8&#12290;</p>
</dd>
<dt>&#38598;&#21312;&#30340;&#26368;&#22823;&#22823;&#23567;</dt>
<dd>
<p>&#36899;&#32218;&#24037;&#24288;&#30340;&#38598;&#21312;&#20013;&#26368;&#22823;&#30340;&#36899;&#32218;&#25976;&#30446;&#12290;&#38928;&#35373;&#20540;&#28858; 32&#12290;</p>
</dd>
<dt>&#38598;&#21312;&#35373;&#23450;&#22823;&#23567;&#25976;&#37327;</dt>
<dd>
<p>&#38598;&#21312;&#30340;&#38290;&#32622;&#36926;&#26178;&#36942;&#26399;&#26178;&#35201;&#31227;&#38500;&#30340;&#36899;&#32218;&#25976;&#30446;&#12290;&#38928;&#35373;&#20540;&#28858; 2&#12290;</p>
</dd>
<dt>&#38290;&#32622;&#36926;&#26178;</dt>
<dd>
<p>&#36899;&#32218;&#21487;&#20197;&#22312;&#20786;&#23384;&#21312;&#20013;&#38290;&#32622;&#30340;&#26368;&#38263;&#26178;&#38291; (&#20197;&#31186;&#34920;&#31034;)&#12290;&#38928;&#35373;&#20540;&#28858; 300&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#31561;&#24453;&#26178;&#38291;</dt>
<dd>
<p>&#35531;&#27714;&#36899;&#32218;&#30340;&#25033;&#29992;&#31243;&#24335;&#22312;&#36948;&#21040;&#36899;&#32218;&#36926;&#26178;&#20043;&#21069;&#31561;&#24453;&#30340;&#26178;&#38291;&#12290;&#38928;&#35373;&#20540;&#28858; 60000&#12290;</p>
</dd>
<dt>&#19968;&#26086;&#22833;&#25943;</dt>
<dd>
<p>&#33509;&#36984;&#21462;&#20102;&#12300;&#38364;&#38281;&#25152;&#26377;&#36899;&#32218;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;GlassFish Server &#23559;&#26371;&#22312;&#20219;&#20309;&#19968;&#20491;&#36899;&#32218;&#22833;&#25943;&#26178;&#65292;&#38364;&#38281;&#38598;&#21312;&#20013;&#30340;&#25152;&#26377;&#36899;&#32218;&#20006;&#37325;&#26032;&#24314;&#31435;&#36899;&#32218;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</dd>
<dt>&#20316;&#26989;&#20107;&#20214;&#25903;&#25588;</dt>
<dd>
<p>&#36984;&#25799;&#30340;&#20316;&#26989;&#20107;&#20214;&#25903;&#25588;&#20197;&#21521;&#19979;&#30456;&#23481;&#26041;&#24335;&#32622;&#25563;&#33287;&#27492;&#36899;&#32218;&#38598;&#21312;&#38364;&#32879;&#30340;&#36039;&#28304;&#20171;&#38754;&#20013;&#30340;&#20316;&#26989;&#20107;&#20214;&#25903;&#25588;&#23660;&#24615;&#12290;&#20063;&#23601;&#26159;&#35498;&#65292;&#23427;&#21487;&#20197;&#25903;&#25588;&#27604;&#36039;&#28304;&#36681;&#25509;&#22120;&#20013;&#25351;&#23450;&#30340;&#20316;&#26989;&#20107;&#20214;&#23652;&#32026;&#20302;&#25110;&#33287;&#20854;&#30456;&#21516;&#30340;&#20316;&#26989;&#20107;&#20214;&#23652;&#32026;&#65292;&#20294;&#23427;&#19981;&#33021;&#25351;&#23450;&#26356;&#39640;&#30340;&#23652;&#32026;&#12290;</p>
<p>&#20540;&#21487;&#33021;&#28858;&#19979;&#21015;&#20854;&#20013;&#20043;&#19968;&#65306;</p>
<dl>
<dt>XATransaction</dt>
<dd>
<p>&#21487;&#20379;&#28041;&#21450;&#22312;&#20316;&#26989;&#20107;&#20214;&#31684;&#22285;&#20839;&#20351;&#29992;&#22810;&#20491;&#36039;&#28304;&#30340;&#20316;&#26989;&#20107;&#20214;&#20351;&#29992;&#30340;&#36039;&#28304;&#12290;&#23565;&#26044; JMS &#36899;&#32218;&#24037;&#24288;&#32780;&#35328;&#65292;&#27492;&#20540;&#28858;&#38928;&#35373;&#20540;&#12290;</p>
<p>&#20363;&#22914;&#65292;&#20316;&#26989;&#20107;&#20214;&#21487;&#33021;&#28041;&#21450;&#27492;&#36039;&#28304;&#21152;&#19978; JDBC &#36039;&#28304;&#12289;&#36899;&#32218;&#22120;&#36039;&#28304;&#25110;&#20854;&#20182; JMS &#36899;&#32218;&#24037;&#24288;&#36039;&#28304;&#12290;&#35442;&#20540;&#20855;&#26377;&#26368;&#22823;&#30340;&#38728;&#27963;&#24615;&#12290;&#32068;&#24907;&#28858; XATransaction &#30340;&#36039;&#28304;&#23559;&#21443;&#33287;&#20841;&#38542;&#27573;&#30340;&#30906;&#35469;&#20316;&#26989;&#12290;</p>
</dd>
<dt>LocalTransaction</dt>
<dd>
<p>&#21487;&#29992;&#26044;&#20677;&#28041;&#21450;&#20351;&#29992;&#20316;&#26989;&#20107;&#20214;&#31684;&#22285;&#20839;&#19968;&#20491;&#36039;&#28304;&#30340;&#20316;&#26989;&#20107;&#20214;&#30340;&#36039;&#28304;&#65292;&#25110;&#29992;&#20570;&#28041;&#21450;&#22810;&#20491; XA &#36039;&#28304;&#30340;&#20998;&#25955;&#24335;&#20316;&#26989;&#20107;&#20214;&#20013;&#26368;&#24460;&#19968;&#20491;&#20195;&#29702;&#31243;&#24335;&#30340;&#36039;&#28304;&#12290;</p>
<p>&#20351;&#29992;&#35442;&#20540;&#21487;&#20197;&#29554;&#24471;&#26356;&#22909;&#30340;&#25928;&#33021;&#12290;&#32068;&#24907;&#28858; LocalTransaction &#30340;&#36039;&#28304;&#19981;&#26371;&#29992;&#26044;&#20841;&#38542;&#27573;&#30340;&#30906;&#35469;&#20316;&#26989;&#12290;</p>
</dd>
<dt>NoTransaction</dt>
<dd>
<p>&#27492;&#36039;&#28304;&#27704;&#36960;&#19981;&#33021;&#21443;&#33287;&#20316;&#26989;&#20107;&#20214;&#12290;&#35442;&#35373;&#23450;&#22312; JMS &#25033;&#29992;&#31243;&#24335;&#20013;&#30340;&#20351;&#29992;&#26377;&#38480;&#12290;</p>
</dd>
</dl>
</dd>
<dt>&#36899;&#32218;&#39511;&#35657;</dt>
<dd>
<p>&#33509;&#36984;&#21462;&#20102;&#12300;&#38656;&#35201;&#36899;&#32218;&#39511;&#35657;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#25351;&#23450;&#36899;&#32218;&#32102;&#25033;&#29992;&#31243;&#24335;&#20043;&#21069;&#26371;&#20808;&#39511;&#35657;&#12290;&#33509;&#36039;&#28304;&#30340;&#39511;&#35657;&#22833;&#25943;&#65292;&#21063;&#26371;&#37559;&#27584;&#35442;&#36039;&#28304;&#65292;&#28982;&#24460;&#24314;&#31435;&#20006;&#20659;&#22238;&#26032;&#30340;&#36039;&#28304;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</dd>
<dt>&#20854;&#20182;&#29305;&#24615;</dt>
<dd>
<p>&#36899;&#32218;&#24037;&#24288;&#30340;&#20854;&#20182;&#29305;&#24615;&#12290;</p>
<p>&#22914;&#38656;&#21487;&#29992;&#29305;&#24615;&#30340;&#30456;&#38364;&#36039;&#35338;&#65292;&#35531;&#21443;&#38321;<a href="ref-jmsconnectionproperties.html">JMS &#36899;&#32218;&#24037;&#24288;&#29305;&#23450;&#30340;&#29305;&#24615;</a>&#12290;</p>
</dd>
<dt>&#30446;&#27161;</dt>
<dd>
<p>&#36899;&#32218;&#24037;&#24288;&#30340;&#21474;&#38598;&#33287;&#29544;&#31435;&#22519;&#34892;&#34389;&#29702;&#12290;&#21487;&#20351;&#29992;&#12300;&#22686;&#21152;&#12301;&#33287;&#12300;&#20840;&#37096;&#26032;&#22686;&#12301;&#25353;&#37397;&#65292;&#23559;&#25152;&#38656;&#30340;&#30446;&#27161;&#31227;&#33267;&#12300;&#36984;&#21462;&#30340;&#30446;&#27161;&#12301;&#27396;&#12290;&#21487;&#20351;&#29992;&#12300;&#31227;&#38500;&#12301;&#33287;&#12300;&#20840;&#37096;&#31227;&#38500;&#12301;&#25353;&#37397;&#65292;&#23559;&#20219;&#20309;&#19981;&#38656;&#35201;&#30340;&#30446;&#27161;&#31227;&#33267;&#12300;&#21487;&#29992;&#30340;&#30446;&#27161;&#12301;&#27396;&#12290;</p>
<p>&#21807;&#26377;&#32178;&#22495;&#20013;&#24050;&#24314;&#31435;&#21474;&#38598;&#25110;&#29544;&#31435;&#22519;&#34892;&#34389;&#29702;&#26178;&#65292;&#25165;&#26371;&#39023;&#31034;&#27492;&#36984;&#38917;&#12290;</p>
</dd>
</dl>
<a id="sthref51" name="sthref51"></a>
<h5>&#30456;&#38364;&#20316;&#26989;</h5>
<ul>
<li>
<p><a href="task-jmsconnectionnew.html">&#24314;&#31435; JMS &#36899;&#32218;&#24037;&#24288;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-jmsconnectionedit.html">&#32232;&#36655; JMS &#36899;&#32218;&#24037;&#24288;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">&#21034;&#38500; JMS &#36899;&#32218;&#24037;&#24288;&#36039;&#28304;</a></p>
</li>
</ul>
<a id="sthref52" name="sthref52"></a>
<h5>&#30456;&#38364;&#30340; asadmin &#21629;&#20196;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00040"><code>create-jms-resource</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00177"><code>list-jms-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00092"><code>delete-jms-resource</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
