<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsavailability" name="ref-jmsavailability"></a></p>

<h4><a id="sthref71" name="sthref71"></a><a id="sthref72" name="sthref72"></a>JMS &#21487;&#29992;&#24615;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&#12300;JMS &#21487;&#29992;&#24615;&#12301;&#38913;&#38754;&#21487;&#32068;&#24907; Message Queue &#20195;&#29702;&#31243;&#24335;&#21474;&#38598;&#20197;&#34389;&#29702; GlassFish Server &#21474;&#38598;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
&#20351;&#29992;&#12300;JMS &#21487;&#29992;&#24615;&#12301;&#38913;&#38754;&#37325;&#26032;&#32068;&#24907;&#29694;&#26377;&#21474;&#38598;&#20043;&#21069;&#65292;&#24517;&#38920;&#20381;&#29031;&#29305;&#27530;&#31243;&#24207;&#36983;&#31227;&#33267;&#21478;&#19968;&#31278;&#39006;&#22411;&#30340;&#20195;&#29702;&#31243;&#24335;&#21474;&#38598;&#65292;&#22914; <i>Oracle GlassFish Server High Availability Administration Guide</i> &#20013;&#30340; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSHAG00158">To Migrate Between Types of Embedded or Local Conventional Broker Clusters</a> &#25152;&#36848;&#12290;&#33509;&#26410;&#22519;&#34892;&#36889;&#20123;&#29305;&#27530;&#31243;&#24207;&#65292;&#21487;&#33021;&#26371;&#23566;&#33268;&#36039;&#26009;&#36986;&#22833;&#25110;&#25613;&#27584;&#65292;&#29978;&#33267;&#35731;&#24744;&#30340;&#35373;&#23450;&#28961;&#27861;&#20351;&#29992; (&#35222;&#24744;&#22312;&#29694;&#26377;&#21474;&#38598;&#19978;&#22519;&#34892;&#30340; JMS &#20316;&#26989;&#32780;&#23450;)&#12290;
<hr>

<p>&#12300;JMS &#21487;&#29992;&#24615;&#12301;&#38913;&#38754;&#21253;&#21547;&#19979;&#21015;&#36984;&#38917;&#12290;</p>

<hr>
<p><b>&#20633;&#35387;:</b></p>
&#33509;&#26377;&#20219;&#19968;&#20491;&#20351;&#29992;&#32068;&#24907;&#30340;&#22519;&#34892;&#34389;&#29702;&#27491;&#22312;&#22519;&#34892;&#65292;&#12300;JMS &#21487;&#29992;&#24615;&#12301;&#38913;&#38754;&#26371;&#39023;&#31034;&#35686;&#21578;&#12289;&#23559;&#25152;&#26377;&#36984;&#38917;&#35373;&#28858;&#21807;&#35712;&#65292;&#20006;&#20572;&#29992;&#12300;&#20786;&#23384;&#12301;&#25353;&#37397;&#12290;
<hr>

<dl>
<dt>JMS &#26381;&#21209;&#39006;&#22411;</dt>
<dd>
<p>&#35201;&#29992;&#26044;&#20195;&#29702;&#31243;&#24335;&#21474;&#38598;&#20013;&#30340;&#20195;&#29702;&#31243;&#24335;&#39006;&#22411; (&#22312; GlassFish Server &#20013;&#31281;&#28858; JMS &#20027;&#27231;)&#12290;&#36984;&#25799;&#30340;&#39006;&#22411;&#26371;&#27770;&#23450;&#21487;&#29992;&#30340;&#20195;&#29702;&#31243;&#24335;&#21474;&#38598;&#39006;&#22411;&#12290;&#20195;&#29702;&#31243;&#24335;&#39006;&#22411;&#22914;&#19979;&#65306;</p>
<dl>
<dt>&#20839;&#23884;</dt>
<dd>
<p>&#20195;&#29702;&#31243;&#24335;&#32068;&#24907;&#33287;&#29983;&#21629;&#36913;&#26399;&#30001; GlassFish Server &#25152;&#31649;&#29702;&#12290;&#27599;&#20491; GlassFish &#21474;&#38598;&#22519;&#34892;&#34389;&#29702;&#22343;&#30001;&#33287;&#22519;&#34892;&#34389;&#29702;&#22312;&#21516;&#19968;&#20491; JVM &#20013;&#22519;&#34892;&#30340;&#20195;&#29702;&#31243;&#24335;&#25552;&#20379;&#26381;&#21209;&#12290;</p>
<p>&#22914;&#26524;&#12300;JMS &#26381;&#21209;&#39006;&#22411;&#12301;&#36984;&#38917;&#35373;&#28858;&#12300;&#20839;&#23884;&#12301;&#65292;&#21063;&#20677;&#25903;&#25588;&#20659;&#32113;&#30340; Message Queue &#20195;&#29702;&#31243;&#24335;&#21474;&#38598;&#12290;&#31995;&#32113;&#26371;&#39023;&#31034;&#32068;&#24907;&#20659;&#32113;&#21474;&#38598;&#30340;&#36984;&#38917;&#12290;</p>
</dd>
<dt>&#26412;&#27231;</dt>
<dd>
<p>&#20195;&#29702;&#31243;&#24335;&#32068;&#24907;&#33287;&#29983;&#21629;&#36913;&#26399;&#30001; GlassFish Server &#25152;&#31649;&#29702;&#12290;&#27599;&#20491; GlassFish &#21474;&#38598;&#22519;&#34892;&#34389;&#29702;&#22343;&#30001;&#33287;&#22519;&#34892;&#34389;&#29702;&#22312;&#21516;&#19968;&#20027;&#27231;&#30340;&#19981;&#21516; JVM &#20013;&#22519;&#34892;&#30340;&#20195;&#29702;&#31243;&#24335;&#25552;&#20379;&#26381;&#21209;&#12290;</p>
<p>&#22914;&#26524;&#12300;JMS &#26381;&#21209;&#39006;&#22411;&#12301;&#36984;&#38917;&#35373;&#28858;&#12300;&#26412;&#27231;&#12301;&#65292;&#21063;&#25903;&#25588;&#20659;&#32113;&#33287;&#22686;&#24375;&#30340; (&#39640;&#21487;&#29992;&#24615;) Message Queue &#20195;&#29702;&#31243;&#24335;&#21474;&#38598;&#12290;&#31995;&#32113;&#26371;&#39023;&#31034;&#36984;&#21462;&#21474;&#38598;&#39006;&#22411;&#33287;&#32068;&#24907;&#21474;&#38598;&#30340;&#36984;&#38917;&#12290;</p>
</dd>
<dt>&#36960;&#31471;</dt>
<dd>
<p>&#20195;&#29702;&#31243;&#24335;&#33287;&#20195;&#29702;&#31243;&#24335;&#21474;&#38598;&#30340;&#32068;&#24907;&#21644;&#29983;&#21629;&#36913;&#26399;&#26159;&#20351;&#29992; Message Queue &#31649;&#29702;&#24037;&#20855;&#25152;&#31649;&#29702;&#30340;&#12290;</p>
<p>&#22914;&#26524;&#12300;JMS &#26381;&#21209;&#39006;&#22411;&#12301;&#36984;&#38917;&#35373;&#28858;&#12300;&#36960;&#31471;&#12301;&#65292;&#21063;&#19981;&#26371;&#39023;&#31034;&#20854;&#20182;&#36984;&#38917;&#12290;</p>
</dd>
</dl>
</dd>
<dt>JMS &#21474;&#38598;&#39006;&#22411;</dt>
<dd>
<p>&#35201;&#20351;&#29992;&#26044; GlassFish Server &#21474;&#38598;&#30340; Message Queue &#20195;&#29702;&#31243;&#24335;&#21474;&#38598;&#39006;&#22411;&#12290;</p>
<p>&#22914;&#26524;&#12300;JMS &#21474;&#38598;&#39006;&#22411;&#12301;&#36984;&#38917;&#35373;&#28858;&#12300;&#20659;&#32113;&#12301;&#65292;&#26371;&#39023;&#31034;&#19979;&#21015;&#36984;&#38917;&#12290;</p>
<dl>
<dt>JMS &#32068;&#24907;&#23384;&#25918;&#21312;&#39006;&#22411;</dt>
<dd>
<p>&#35201;&#29992;&#26044;&#20659;&#32113;&#21474;&#38598;&#20043;&#32068;&#24907;&#36039;&#26009;&#30340;&#36039;&#26009;&#23384;&#25918;&#21312;&#39006;&#22411;&#12290;&#22914;&#26524;&#27492;&#36984;&#38917;&#35373;&#28858;&#12300;&#20027;&#20195;&#29702;&#31243;&#24335;&#12301;&#65292;&#26371;&#23559;&#21474;&#38598;&#20013;&#30340;&#26576;&#20491;&#20195;&#29702;&#31243;&#24335;&#25351;&#23450;&#28858;&#20027;&#20195;&#29702;&#31243;&#24335;&#65292;&#20006;&#30001;&#20854;&#20786;&#23384;&#32068;&#24907;&#36039;&#26009;&#12290;&#22914;&#26524;&#27492;&#36984;&#38917;&#35373;&#28858;&#12300;&#20849;&#29992;&#30340;&#36039;&#26009;&#24235;&#12301;&#65292;&#21063;&#32068;&#24907;&#36039;&#26009;&#26371;&#20786;&#23384;&#22312;&#25152;&#26377;&#20195;&#29702;&#31243;&#24335;&#21487;&#23384;&#21462;&#30340; JDBC &#36039;&#26009;&#23384;&#25918;&#21312;&#20013;&#12290;&#22312;&#27492;&#24773;&#27841;&#19979;&#65292;&#26371;&#39023;&#31034;&#33287;&#36039;&#26009;&#24235;&#30456;&#38364;&#30340;&#36984;&#38917;&#12290;</p>
</dd>
<dt>JMS &#35338;&#24687;&#23384;&#25918;&#21312;&#39006;&#22411;</dt>
<dd>
<p>&#27599;&#20491;&#20195;&#29702;&#31243;&#24335;&#29992;&#20358;&#20786;&#23384;&#20854;&#35338;&#24687;&#36039;&#26009;&#30340;&#36039;&#26009;&#23384;&#25918;&#21312;&#39006;&#22411;&#12290;&#22914;&#26524;&#27492;&#36984;&#38917;&#35373;&#28858;&#12300;&#27284;&#26696;&#12301;&#65292;&#27599;&#20491;&#20195;&#29702;&#31243;&#24335;&#26371;&#23559;&#20854;&#35338;&#24687;&#36039;&#26009;&#20786;&#23384;&#22312;&#27284;&#26696;&#22411;&#30340;&#36039;&#26009;&#23384;&#25918;&#21312;&#12290;&#22914;&#26524;&#27492;&#36984;&#38917;&#35373;&#28858; JDBC&#65292;&#27599;&#20491;&#20195;&#29702;&#31243;&#24335;&#26371;&#23559;&#20854;&#35338;&#24687;&#36039;&#26009;&#20786;&#23384;&#22312; JDBC &#36039;&#26009;&#23384;&#25918;&#21312;&#12290;</p>
</dd>
</dl>
<p>&#22914;&#26524;&#12300;JMS &#21474;&#38598;&#39006;&#22411;&#12301;&#36984;&#38917;&#35373;&#28858;&#12300;&#22686;&#24375; (HA)&#12301;&#65292;&#26371;&#39023;&#31034;&#33287;&#36039;&#26009;&#24235;&#30456;&#38364;&#30340;&#36984;&#38917;&#12290;</p>
</dd>
<dt>&#36039;&#26009;&#24235;&#20379;&#25033;&#21830;</dt>
<dt>&#36039;&#26009;&#24235; URL</dt>
<dt>&#36039;&#26009;&#24235;&#20351;&#29992;&#32773;</dt>
<dd>
<p>&#35201;&#22312;&#20197;&#19979;&#20219;&#19968;&#24773;&#24418;&#20351;&#29992;&#20043; JDBC &#36039;&#26009;&#24235;&#30340;&#36039;&#26009;&#24235;&#20379;&#25033;&#21830;&#12289;&#23384;&#21462; URL &#20197;&#21450;&#20351;&#29992;&#32773;&#65306;</p>
<ul>
<li>
<p>&#30070;&#20659;&#32113;&#21474;&#38598;&#30340;&#32068;&#24907;&#23384;&#25918;&#21312;&#39006;&#22411;&#35373;&#28858;&#12300;&#20849;&#29992;&#36039;&#26009;&#24235;&#12301;&#26178;</p>
</li>
<li>
<p>&#30070;&#20659;&#32113;&#21474;&#38598;&#30340;&#35338;&#24687;&#23384;&#25918;&#21312;&#39006;&#22411;&#35373;&#28858; JDBC &#26178;</p>
</li>
<li>
<p>&#30070;&#21474;&#38598;&#39006;&#22411;&#35373;&#28858;&#12300;&#22686;&#24375; (HA)&#12301;&#26178;</p>
</li>
</ul>
<p>&#22914;&#38656;&#26377;&#38364;&#25903;&#25588;&#20379;&#25033;&#21830;&#21450;&#21508;&#20379;&#25033;&#21830;&#23384;&#21462; URL &#26684;&#24335;&#30340;&#30456;&#38364;&#36039;&#35338;&#65292;&#35531;&#21443;&#38321; <i>Oracle GlassFish Server Message Queue Administration Guide</i> &#20013;&#30340; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GMADG00244">JDBC-Based Persistence</a>&#12290;</p>
</dd>
<dt>&#36039;&#26009;&#24235;&#35469;&#35657;</dt>
<dt>&#36039;&#26009;&#24235;&#23494;&#30908;</dt>
<dt>&#23494;&#30908;&#21029;&#21517;</dt>
<dd>
<p>&#22312;&#12300;&#36039;&#26009;&#24235;&#20351;&#29992;&#32773;&#12301;&#20013;&#25351;&#23450;&#30340; JDBC &#36039;&#26009;&#24235;&#20351;&#29992;&#32773;&#30340;&#23494;&#30908;&#36039;&#35338;&#12290;</p>
<p>&#22914;&#26524;&#12300;&#36039;&#26009;&#24235;&#35469;&#35657;&#12301;&#35373;&#28858;&#12300;&#23494;&#30908;&#12301;&#65292;&#26371;&#39023;&#31034;&#12300;&#36039;&#26009;&#24235;&#23494;&#30908;&#12301;&#36984;&#38917;&#12290;&#22914;&#26524;&#12300;&#36039;&#26009;&#24235;&#35469;&#35657;&#12301;&#35373;&#28858;&#12300;&#23494;&#30908;&#21029;&#21517;&#12301;&#65292;&#26371;&#39023;&#31034;&#12300;&#23494;&#30908;&#21029;&#21517;&#12301;&#36984;&#38917;&#12290;</p>
</dd>
<dt>&#20854;&#20182;&#29305;&#24615;</dt>
<dd>
<p>JMS &#21487;&#29992;&#24615;&#30340;&#20854;&#20182;&#29305;&#24615;&#12290;</p>
<p>GlassFish Server &#26410;&#38928;&#20808;&#23450;&#32681;&#20219;&#20309;&#20854;&#20182; JMS &#21487;&#29992;&#24615;&#29305;&#24615;&#12290;</p>
</dd>
</dl>
<a id="sthref73" name="sthref73"></a>
<h5>&#30456;&#38364;&#20316;&#26989;</h5>
<p><a href="task-jmsservice.html">&#32068;&#24907; JMS &#26381;&#21209;</a></p>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
