<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsconnectionproperties" name="ref-jmsconnectionproperties"></a></p>

<h4><a id="sthref57" name="sthref57"></a><a id="sthref58" name="sthref58"></a>JMS &#36899;&#32218;&#24037;&#24288;&#29305;&#23450;&#30340;&#29305;&#24615;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20197;&#19979;&#30340;&#20854;&#20182;&#29305;&#24615;&#36969;&#29992;&#26044; JMS &#36899;&#32218;&#24037;&#24288;&#12290;</p>
<dl>
<dt><code>ClientId</code></dt>
<dd>
<p>&#28858;&#38263;&#26399;&#35330;&#38321;&#32773;&#23559;&#35201;&#20351;&#29992;&#30340;&#36899;&#32218;&#24037;&#24288;&#25351;&#23450;&#24478;&#23660;&#31471; ID&#12290;</p>
</dd>
<dt><code>AddressList</code></dt>
<dd>
<p>&#25351;&#23450;&#35201;&#33287;&#25033;&#29992;&#31243;&#24335;&#36890;&#35338;&#30340;&#35338;&#24687;&#20195;&#29702;&#31243;&#24335;&#22519;&#34892;&#34389;&#29702;&#30340;&#21517;&#31281; (&#20063;&#21487;&#20197;&#26159;&#36899;&#25509;&#22496;&#34399;)&#12290;&#28165;&#21934;&#20013;&#30340;&#27599;&#20491;&#20301;&#22336;&#37117;&#25351;&#23450;&#20102;&#35201;&#36899;&#32218;&#30340;&#20027;&#27231;&#21517;&#31281; (&#36996;&#21487;&#20197;&#36984;&#25799;&#24615;&#22320;&#25351;&#23450;&#20027;&#27231;&#36899;&#25509;&#22496;&#33287;&#36899;&#32218;&#26381;&#21209;)&#12290;&#20363;&#22914;&#65292;&#35442;&#20540;&#21487;&#33021;&#28858; <code>earth</code> &#25110; <code>earth:7677</code>&#12290;&#30070;&#35338;&#24687;&#20195;&#29702;&#31243;&#24335;&#22312;&#38928;&#35373;&#36899;&#25509;&#22496; (7676) &#20197;&#22806;&#30340;&#36899;&#25509;&#22496;&#19978;&#22519;&#34892;&#26178;&#65292;&#35531;&#25351;&#23450;&#36899;&#25509;&#22496;&#34399;&#12290;&#22914;&#26524;&#29305;&#24615;&#35373;&#23450;&#22312;&#21474;&#38598;&#29872;&#22659;&#20013;&#25351;&#23450;&#20102;&#22810;&#20491;&#20027;&#27231;&#21644;&#36899;&#25509;&#22496;&#65292;&#21063;&#23559;&#20351;&#29992;&#35442;&#28165;&#21934;&#20013;&#30340;&#31532;&#19968;&#20491;&#21487;&#29992;&#20027;&#27231; (&#38500;&#38750;&#23559; <code>AddressListBehavior</code> &#29305;&#24615;&#35373;&#23450;&#28858; <code>RANDOM</code>)&#12290;</p>
<p>&#22914;&#38656;&#35443;&#32048;&#36039;&#35338;&#65292;&#35531;&#21443;&#38321; <i>Message Queue Developer's Guide for Java Clients</i>&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858;&#26412;&#22320;&#20027;&#27231;&#21644;&#38928;&#35373;&#36899;&#25509;&#22496;&#34399;&#30908; (7676)&#12290;&#24478;&#23660;&#31471;&#23559;&#22039;&#35430;&#36899;&#32218;&#33267;&#20301;&#26044;&#26412;&#22320;&#20027;&#27231;&#36899;&#25509;&#22496; 7676 &#19978;&#30340;&#20195;&#29702;&#31243;&#24335;&#12290;</p>
</dd>
<dt><code>UserName</code></dt>
<dd>
<p>&#36899;&#32218;&#24037;&#24288;&#30340;&#20351;&#29992;&#32773;&#21517;&#31281;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; <code>guest</code>&#12290;</p>
</dd>
<dt><code>Password</code></dt>
<dd>
<p>&#36899;&#32218;&#24037;&#24288;&#30340;&#23494;&#30908;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; <code>guest</code>&#12290;</p>
</dd>
<dt><code>ReconnectEnabled</code></dt>
<dd>
<p>&#33509;&#35373;&#28858; <code>true</code>&#65292;&#21063;&#25351;&#23450;&#24478;&#23660;&#31471;&#22519;&#34892;&#38542;&#27573;&#26371;&#22312;&#36986;&#22833;&#36899;&#32218;&#26178;&#22039;&#35430;&#37325;&#26032;&#36899;&#32218;&#33267;&#35338;&#24687;&#20282;&#26381;&#22120; (&#25110; <code>AddressList</code> &#20013;&#30340;&#20301;&#22336;&#28165;&#21934;)&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; <code>true</code>&#12290;</p>
</dd>
<dt><code>ReconnectAttempts</code></dt>
<dd>
<p>&#25351;&#23450;&#24478;&#23660;&#31471;&#22519;&#34892;&#38542;&#27573;&#22039;&#35430;&#36899;&#32218; (&#25110;&#37325;&#26032;&#36899;&#32218;) <code>AddressList</code> &#28165;&#21934;&#20013;&#27599;&#20491;&#20301;&#22336;&#30340;&#27425;&#25976;&#12290;&#21040;&#36948;&#36889;&#20491;&#20540;&#24460;&#65292;&#24478;&#23660;&#31471;&#22519;&#34892;&#38542;&#27573;&#23559;&#22039;&#35430;&#36899;&#32218;&#28165;&#21934;&#20013;&#30340;&#19979;&#19968;&#20491;&#20301;&#22336;&#12290;&#20540; -1 &#34920;&#31034;&#37325;&#26032;&#36899;&#32218;&#22039;&#35430;&#27425;&#25976;&#27794;&#26377;&#38480;&#21046; (&#24478;&#23660;&#31471;&#22519;&#34892;&#38542;&#27573;&#23559;&#19968;&#30452;&#22039;&#35430;&#36899;&#32218;&#33267;&#31532;&#19968;&#20491;&#20301;&#22336;&#65292;&#30452;&#21040;&#36899;&#32218;&#25104;&#21151;)&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 3&#12290;</p>
</dd>
<dt><code>ReconnectInterval</code></dt>
<dd>
<p>&#25351;&#23450;&#20841;&#27425;&#37325;&#26032;&#36899;&#32218;&#22039;&#35430;&#20043;&#38291;&#30340;&#38291;&#38548; (&#20197;&#27627;&#31186;&#28858;&#21934;&#20301;)&#12290;&#35442;&#29305;&#24615;&#36969;&#29992;&#26044;&#23565; <code>AddressList</code> &#20013;&#27599;&#20491;&#20301;&#22336;&#30340;&#37325;&#26032;&#36899;&#32218;&#22039;&#35430;&#65292;&#21450;&#23565;&#35442;&#28165;&#21934;&#20013;&#36899;&#32396;&#20301;&#22336;&#30340;&#37325;&#26032;&#36899;&#32218;&#22039;&#35430;&#12290;&#22914;&#26524;&#38291;&#38548;&#22826;&#30701;&#65292;&#20195;&#29702;&#31243;&#24335;&#20415;&#27794;&#26377;&#26178;&#38291;&#24489;&#21407;&#12290;&#22914;&#26524;&#35442;&#38291;&#38548;&#22826;&#38263;&#65292;&#21063;&#37325;&#26032;&#36899;&#32218;&#26371;&#35722;&#24471;&#36978;&#32233;&#65292;&#20197;&#33267;&#26044;&#35731;&#20154;&#28961;&#27861;&#25509;&#21463;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 30000&#12290;</p>
</dd>
<dt><code>AddressListBehavior</code></dt>
<dd>
<p>&#25351;&#23450;&#26159;&#25353; <code>AddressList</code> &#23660;&#24615;&#20013;&#30340;&#20301;&#22336;&#38918;&#24207; (<code>PRIORITY</code>) &#36996;&#26159;&#25353;&#38568;&#27231;&#38918;&#24207; (<code>RANDOM</code>) &#22039;&#35430;&#36899;&#32218;&#12290;</p>
<p><code>RANDOM</code> &#34920;&#31034;&#37325;&#26032;&#36899;&#32218;&#23559;&#24478; <code>AddressList</code> &#20013;&#38568;&#27231;&#36984;&#25799;&#20301;&#22336;&#12290;&#22914;&#26524;&#35377;&#22810;&#24478;&#23660;&#31471;&#22039;&#35430;&#20351;&#29992;&#21516;&#19968;&#20491;&#36899;&#32218;&#24037;&#24288;&#20358;&#36914;&#34892;&#36899;&#32218;&#65292;&#21063;&#20351;&#29992;&#35442;&#20540;&#21487;&#20197;&#38459;&#27490;&#23427;&#20497;&#20840;&#37096;&#36899;&#32218;&#33267;&#21516;&#19968;&#20491;&#20301;&#22336;&#12290;</p>
<p><code>PRIORITY</code> &#34920;&#31034;&#37325;&#26032;&#36899;&#32218;&#26178;&#22987;&#32066;&#22039;&#35430;&#36899;&#32218;&#33267; <code>AddressList</code> &#20013;&#30340;&#31532;&#19968;&#20491;&#20282;&#26381;&#22120;&#20301;&#22336;&#65292;&#32780;&#20677;&#22312;&#31532;&#19968;&#20491;&#20195;&#29702;&#31243;&#24335;&#19981;&#21487;&#29992;&#26178;&#25165;&#20351;&#29992;&#20854;&#20182;&#20301;&#22336;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; <code>RANDOM</code>&#12290;</p>
</dd>
<dt><code>AddressListIterations</code></dt>
<dd>
<p>&#25351;&#23450;&#24478;&#23660;&#31471;&#22519;&#34892;&#38542;&#27573;&#24314;&#31435; (&#25110;&#37325;&#26032;&#24314;&#31435;) &#36899;&#32218;&#26178;&#65292;&#22312; <code>AddressList</code> &#20013;&#21453;&#35206;&#36939;&#31639;&#30340;&#27425;&#25976;&#12290;&#20540; -1 &#34920;&#31034;&#22039;&#35430;&#27425;&#25976;&#27794;&#26377;&#38480;&#21046;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 3&#12290;</p>
</dd>
</dl>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
