<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsconnectionedit" name="task-jmsconnectionedit"></a><a id="GHJMS00021" name="GHJMS00021"></a></p>

<h4><a id="sthref5" name="sthref5"></a><a id="sthref6" name="sthref6"></a>&#32232;&#36655; JMS &#36899;&#32218;&#24037;&#24288;&#36039;&#28304;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#28687;&#35261;&#27193;&#29376;&#32080;&#27083;&#20013;&#65292;&#23637;&#38283;&#12300;&#36039;&#28304;&#12301;&#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#36039;&#28304;&#12301;&#31680;&#40670;&#19979;&#65292;&#23637;&#38283;&#12300;JMS &#36039;&#28304;&#12301;&#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;JMS &#36039;&#28304;&#12301;&#31680;&#40670;&#19979;&#65292;&#36984;&#21462;&#12300;JMS &#36899;&#32218;&#24037;&#24288;&#12301;&#31680;&#40670;&#12290;</p>
<p>&#23559;&#38283;&#21855;&#12300;JMS &#36899;&#32218;&#24037;&#24288;&#12301;&#38913;&#38754;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;JMS &#36899;&#32218;&#24037;&#24288;&#12301;&#38913;&#38754;&#19978;&#65292;&#25353;&#19968;&#19979;&#24744;&#35201;&#32232;&#36655;&#30340;&#36899;&#32218;&#24037;&#24288;&#21517;&#31281;&#12290;</p>
<p>&#23559;&#38283;&#21855;&#12300;&#32232;&#36655; JMS &#36899;&#32218;&#24037;&#24288;&#12301;&#38913;&#38754;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#25551;&#36848;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#36899;&#32218;&#24037;&#24288;&#30340;&#25551;&#36848;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#21855;&#29992;&#29376;&#24907;&#12301;&#26680;&#21462;&#26041;&#22602;&#20197;&#22312;&#22519;&#34892;&#38542;&#27573;&#21855;&#29992;&#35442;&#36039;&#28304;&#12290;</p>
<p>&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#21855;&#29992;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#38598;&#21312;&#30340;&#21021;&#22987;&#22823;&#23567;&#21644;&#26368;&#23567;&#22823;&#23567;&#12301;&#27396;&#20301;&#20013;&#65292;&#25351;&#23450;&#38598;&#21312;&#20013;&#30340;&#26368;&#23567;&#36899;&#32218;&#25976;&#30446;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 8&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#38598;&#21312;&#30340;&#26368;&#22823;&#22823;&#23567;&#12301;&#27396;&#20301;&#20013;&#65292;&#25351;&#23450;&#38598;&#21312;&#20013;&#30340;&#26368;&#22823;&#36899;&#32218;&#25976;&#30446;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 32&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#38598;&#21312;&#35373;&#23450;&#22823;&#23567;&#25976;&#37327;&#12301;&#27396;&#20301;&#20013;&#65292;&#25351;&#23450;&#38598;&#21312;&#30340;&#38290;&#32622;&#36926;&#26178;&#36942;&#26399;&#26178;&#35201;&#31227;&#38500;&#30340;&#36899;&#32218;&#25976;&#30446;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 2&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#38290;&#32622;&#36926;&#26178;&#12301;&#27396;&#20301;&#20013;&#65292;&#25351;&#23450;&#36899;&#32218;&#21487;&#20197;&#22312;&#38598;&#21312;&#20013;&#38290;&#32622;&#30340;&#26368;&#38263;&#26178;&#38291; (&#20197;&#31186;&#28858;&#21934;&#20301;)&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 300&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#26368;&#22823;&#31561;&#24453;&#26178;&#38291;&#12301;&#27396;&#20301;&#20013;&#65292;&#25351;&#23450;&#35531;&#27714;&#36899;&#32218;&#30340;&#25033;&#29992;&#31243;&#24335;&#22312;&#36899;&#32218;&#36926;&#26178;&#21069;&#31561;&#24453;&#30340;&#26178;&#38291;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 60000&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#19968;&#26086;&#22833;&#25943;&#20415;&#38364;&#38281;&#25152;&#26377;&#36899;&#32218;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#21487;&#35731; GlassFish Server &#22312;&#20219;&#20309;&#19968;&#20491;&#36899;&#32218;&#22833;&#25943;&#26178;&#65292;&#38364;&#38281;&#38598;&#21312;&#20013;&#30340;&#25152;&#26377;&#36899;&#32218;&#20006;&#37325;&#26032;&#24314;&#31435;&#36899;&#32218;&#12290;</p>
<p>&#22914;&#26524;&#26410;&#36984;&#21462;&#27492;&#26680;&#21462;&#26041;&#22602;&#65292;&#21063;&#20677;&#22312;&#20351;&#29992;&#20491;&#21029;&#36899;&#32218;&#26178;&#25165;&#26371;&#37325;&#26032;&#24314;&#31435;&#36889;&#20123;&#36899;&#32218;&#12290;</p>
</li>
<li>
<p>&#37341;&#23565; JMS &#36899;&#32218;&#24037;&#24288;&#36039;&#28304;&#65292;&#25351;&#23450;&#12300;&#20316;&#26989;&#20107;&#20214;&#25903;&#25588;&#12301;&#20540;&#65292;&#22914;&#19979;&#25152;&#31034;&#65306;</p>
<ul>
<li>
<p>&#28858;&#21487;&#29992;&#26044;&#28041;&#21450;&#20351;&#29992;&#20316;&#26989;&#20107;&#20214;&#31684;&#22285;&#20839;&#22810;&#20491;&#36039;&#28304;&#30340;&#20316;&#26989;&#20107;&#20214;&#30340;&#36039;&#28304;&#25351;&#23450; <code>XATransaction</code> (&#38928;&#35373;&#20540;)&#12290;</p>
<p>&#20363;&#22914;&#65292;&#35442;&#36039;&#28304;&#21152;&#19978; JDBC &#36039;&#28304;&#12289;&#36899;&#32218;&#22120;&#36039;&#28304;&#25110;&#20854;&#20182; JMS &#36899;&#32218;&#24037;&#24288;&#36039;&#28304;&#12290;&#35442;&#20540;&#20855;&#26377;&#26368;&#22823;&#30340;&#38728;&#27963;&#24615;&#12290;&#32068;&#24907;&#28858; <code>XATransaction</code> &#30340;&#36039;&#28304;&#23559;&#21443;&#33287;&#20841;&#38542;&#27573;&#30340;&#30906;&#35469;&#20316;&#26989;&#12290;</p>
</li>
<li>
<p>&#28858;&#21487;&#29992;&#26044;&#20677;&#28041;&#21450;&#20351;&#29992;&#20316;&#26989;&#20107;&#20214;&#31684;&#22285;&#20839;&#19968;&#20491;&#36039;&#28304;&#30340;&#20316;&#26989;&#20107;&#20214;&#30340;&#36039;&#28304;&#65292;&#25110;&#29992;&#20570;&#28041;&#21450;&#22810;&#20491; XA &#36039;&#28304;&#30340;&#20998;&#25955;&#24335;&#20316;&#26989;&#20107;&#20214;&#20013;&#26368;&#24460;&#19968;&#20491;&#20195;&#29702;&#31243;&#24335;&#30340;&#36039;&#28304;&#25351;&#23450; <code>LocalTransaction</code>&#12290;</p>
<p>&#20351;&#29992;&#35442;&#20540;&#21487;&#20197;&#29554;&#24471;&#26356;&#22909;&#30340;&#25928;&#33021;&#12290;&#32068;&#24907;&#28858; <code>LocalTransaction</code> &#30340;&#36039;&#28304;&#19981;&#26371;&#34987;&#29992;&#26044;&#20998;&#28858;&#20841;&#20491;&#38542;&#27573;&#30340;&#30906;&#35469;&#20316;&#26989;&#12290;</p>
</li>
<li>
<p>&#28858;&#27704;&#19981;&#21443;&#33287;&#20316;&#26989;&#20107;&#20214;&#30340;&#36039;&#28304;&#25351;&#23450; <code>NoTransaction</code>&#12290;</p>
<p>&#35442;&#35373;&#23450;&#22312; JMS &#25033;&#29992;&#31243;&#24335;&#20013;&#30340;&#20351;&#29992;&#26377;&#38480;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#36899;&#32218;&#39511;&#35657;&#12301;&#26680;&#21462;&#26041;&#22602;&#20197;&#21855;&#29992;&#36899;&#32218;&#39511;&#35657;&#12290;</p>
<p>&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#20854;&#20182;&#29305;&#24615;&#12301;&#34920;&#26684;&#20013;&#65292;&#25351;&#23450;&#36899;&#32218;&#24037;&#24288;&#30340;&#20854;&#20182;&#29305;&#24615;&#12290;</p>
<p>&#22914;&#38656;&#21487;&#29992;&#29305;&#24615;&#30340;&#30456;&#38364;&#36039;&#35338;&#65292;&#35531;&#21443;&#38321;<a href="ref-jmsconnectionproperties.html">JMS &#36899;&#32218;&#24037;&#24288;&#29305;&#23450;&#30340;&#29305;&#24615;</a>&#12290;</p>
<ul>
<li>
<p>&#33509;&#35201;&#22686;&#21152;&#29305;&#24615;&#65292;&#35531;&#25353;&#19968;&#19979;&#12300;&#22686;&#21152;&#29305;&#24615;&#12301;&#25353;&#37397;&#12290;&#22312;&#20986;&#29694;&#30340;&#31354;&#30333;&#21015;&#20013;&#65292;&#26044;&#12300;&#21517;&#31281;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#21517;&#31281;&#65292;&#28982;&#24460;&#22312;&#12300;&#20540;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#20540;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#20462;&#25913;&#29305;&#24615;&#65292;&#35531;&#32232;&#36655;&#29305;&#24615;&#30340;&#12300;&#20540;&#12301;&#27396;&#20301;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#21034;&#38500;&#29305;&#24615;&#65292;&#35531;&#36984;&#21462;&#24744;&#35201;&#21034;&#38500;&#20043;&#29305;&#24615;&#12300;&#21517;&#31281;&#12301;&#27396;&#20301;&#24038;&#20596;&#30340;&#26680;&#21462;&#26041;&#22602;&#65292;&#28982;&#24460;&#25353;&#19968;&#19979;&#12300;&#21034;&#38500;&#29305;&#24615;&#12301;&#25353;&#37397;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#25110;&#32773;&#65292;&#25353;&#19968;&#19979;&#12300;&#30446;&#27161;&#12301;&#27161;&#31844;&#20197;&#31227;&#33267;&#12300;JMS &#36899;&#32218;&#24037;&#24288;&#36039;&#28304;&#30446;&#27161;&#12301;&#38913;&#38754;&#12290;&#22312;&#27492;&#38913;&#38754;&#20013;&#65292;&#22519;&#34892;&#19979;&#21015;&#21205;&#20316;&#65306;</p>
<ol type="a">
<li>
<p>&#25353;&#19968;&#19979;&#12300;&#31649;&#29702;&#30446;&#27161;&#12301;&#20197;&#38283;&#21855;&#12300;&#31649;&#29702;&#36039;&#28304;&#30446;&#27161;&#12301;&#38913;&#38754;&#12290;</p>
<p>&#22312;&#27492;&#38913;&#38754;&#30340;&#12300;&#21487;&#29992;&#12301;&#27396;&#33287;&#12300;&#24050;&#36984;&#21462;&#12301;&#27396;&#20043;&#38291;&#31227;&#21205;&#30446;&#27161;&#12290;&#30906;&#23450;&#24050;&#22312;&#12300;&#24050;&#36984;&#21462;&#12301;&#27396;&#20013;&#25918;&#32622;&#23559;&#24314;&#32622;&#20351;&#29992;&#36039;&#28304;&#20043;&#25033;&#29992;&#31243;&#24335;&#30340;&#19968;&#25110;&#22810;&#20491;&#30446;&#27161;&#12290;&#21487;&#29992;&#30340;&#30446;&#27161;&#21253;&#21547;&#21487;&#29992;&#30340;&#21474;&#38598;&#33287;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#65292;&#20197;&#21450;&#38928;&#35373;&#30340;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702; <code>server</code>&#12290;&#25353;&#19968;&#19979;&#12300;&#30906;&#23450;&#12301;&#20786;&#23384;&#35722;&#26356;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#30446;&#27161;&#30340;&#26680;&#21462;&#26041;&#22602;&#65292;&#28982;&#24460;&#25353;&#19968;&#19979;&#12300;&#21855;&#29992;&#12301;&#25110;&#12300;&#20572;&#29992;&#12301;&#20197;&#21855;&#29992;&#25110;&#20572;&#29992;&#35442;&#30446;&#27161;&#30340;&#36039;&#28304;&#12290;</p>
</li>
</ol>
</li>
<li>
<p>&#25353;&#19968;&#19979;&#12300;&#20786;&#23384;&#12301;&#12290;</p>

<hr>
<p><b>&#25552;&#31034;:</b></p>
&#33509;&#35201;&#22238;&#21040;&#38928;&#35373;&#35373;&#23450;&#65292;&#35531;&#25353;&#19968;&#19979;&#12300;&#36617;&#20837;&#38928;&#35373;&#20540;&#12301;&#25353;&#37397;&#65292;&#28982;&#24460;&#25353;&#19968;&#19979;&#12300;&#20786;&#23384;&#12301;&#12290;<br />
<hr>

</li>
</ol>
<a id="sthref7" name="sthref7"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-jmsconnectionnew.html">&#24314;&#31435; JMS &#36899;&#32218;&#24037;&#24288;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">&#21034;&#38500; JMS &#36899;&#32218;&#24037;&#24288;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-jmsdestinationnew.html">&#24314;&#31435; JMS &#30446;&#30340;&#22320;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-jmsdestinationedit.html">&#32232;&#36655; JMS &#30446;&#30340;&#22320;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-jmsdestinationdelete.html">&#21034;&#38500; JMS &#30446;&#30340;&#22320;&#36039;&#28304;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
