<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsconnectionnew" name="task-jmsconnectionnew"></a><a id="GHJMS00020" name="GHJMS00020"></a></p>

<h4><a id="sthref2" name="sthref2"></a><a id="sthref3" name="sthref3"></a>&#24314;&#31435; JMS &#36899;&#32218;&#24037;&#24288;&#36039;&#28304;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#30070;&#24744;&#24314;&#31435; JMS &#36899;&#32218;&#24037;&#24288;&#26178;&#65292;GlassFish Server &#26371;&#37341;&#23565;&#36899;&#32218;&#24037;&#24288;&#24314;&#31435;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#21644;&#36899;&#32218;&#22120;&#36039;&#28304;&#12290;&#24744;&#21487;&#20197;&#22312;&#12300;&#36899;&#32218;&#22120;&#12301;&#31680;&#40670;&#19979;&#27298;&#35222;&#36889;&#20123;&#29289;&#20214;&#12290;</p>
<ol>
<li>
<p>&#22312;&#28687;&#35261;&#27193;&#29376;&#32080;&#27083;&#20013;&#65292;&#23637;&#38283;&#12300;&#36039;&#28304;&#12301;&#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#36039;&#28304;&#12301;&#31680;&#40670;&#19979;&#65292;&#23637;&#38283;&#12300;JMS &#36039;&#28304;&#12301;&#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;JMS &#36039;&#28304;&#12301;&#31680;&#40670;&#19979;&#65292;&#36984;&#21462;&#12300;JMS &#36899;&#32218;&#24037;&#24288;&#12301;&#31680;&#40670;&#12290;</p>
<p>&#23559;&#38283;&#21855;&#12300;JMS &#36899;&#32218;&#24037;&#24288;&#12301;&#38913;&#38754;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;JMS &#36899;&#32218;&#24037;&#24288;&#12301;&#38913;&#38754;&#19978;&#65292;&#25353;&#19968;&#19979;&#12300;&#26032;&#24314;&#12301;&#12290;</p>
<p>&#23559;&#39023;&#31034;&#12300;&#26032;&#24314; JMS &#36899;&#32218;&#24037;&#24288;&#12301;&#38913;&#38754;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#38598;&#21312;&#21517;&#31281;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#36899;&#32218;&#24037;&#24288;&#30340;&#21807;&#19968;&#21517;&#31281;&#12290;</p>
<p>GlassFish Server &#26371;&#23559;&#36899;&#32218;&#24037;&#24288;&#30340; JNDI &#21517;&#31281;&#35373;&#28858;&#27492;&#20540;&#12290;</p>
</li>
<li>
<p>&#24478;&#12300;&#36039;&#28304;&#39006;&#22411;&#12301;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#25799;&#12300;<code>javax.jms.ConnectionFactory</code>&#12301;&#12289;&#12300;<code>javax.jms.QueueConnectionFactory</code>&#12301;&#25110;&#12300;<code>javax.jms.TopicConnectionFactory</code>&#12301;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#25551;&#36848;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#36899;&#32218;&#24037;&#24288;&#30340;&#25551;&#36848;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#21855;&#29992;&#29376;&#24907;&#12301;&#26680;&#21462;&#26041;&#22602;&#20197;&#22312;&#22519;&#34892;&#38542;&#27573;&#21855;&#29992;&#35442;&#36039;&#28304;&#12290;</p>
<p>&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#21855;&#29992;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#38598;&#21312;&#30340;&#21021;&#22987;&#22823;&#23567;&#21644;&#26368;&#23567;&#22823;&#23567;&#12301;&#27396;&#20301;&#20013;&#65292;&#25351;&#23450;&#38598;&#21312;&#20013;&#30340;&#26368;&#23567;&#36899;&#32218;&#25976;&#30446;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 8&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#38598;&#21312;&#30340;&#26368;&#22823;&#22823;&#23567;&#12301;&#27396;&#20301;&#20013;&#65292;&#25351;&#23450;&#38598;&#21312;&#20013;&#30340;&#26368;&#22823;&#36899;&#32218;&#25976;&#30446;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 32&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#38598;&#21312;&#35373;&#23450;&#22823;&#23567;&#25976;&#37327;&#12301;&#27396;&#20301;&#20013;&#65292;&#25351;&#23450;&#38598;&#21312;&#30340;&#38290;&#32622;&#36926;&#26178;&#36942;&#26399;&#26178;&#35201;&#31227;&#38500;&#30340;&#36899;&#32218;&#25976;&#30446;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 2&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#38290;&#32622;&#36926;&#26178;&#12301;&#27396;&#20301;&#20013;&#65292;&#25351;&#23450;&#36899;&#32218;&#21487;&#20197;&#22312;&#38598;&#21312;&#20013;&#38290;&#32622;&#30340;&#26368;&#38263;&#26178;&#38291; (&#20197;&#31186;&#28858;&#21934;&#20301;)&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 300&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#26368;&#22823;&#31561;&#24453;&#26178;&#38291;&#12301;&#27396;&#20301;&#20013;&#65292;&#25351;&#23450;&#35531;&#27714;&#36899;&#32218;&#30340;&#25033;&#29992;&#31243;&#24335;&#22312;&#36899;&#32218;&#36926;&#26178;&#21069;&#31561;&#24453;&#30340;&#26178;&#38291;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 60000&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#19968;&#26086;&#22833;&#25943;&#20415;&#38364;&#38281;&#25152;&#26377;&#36899;&#32218;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#21487;&#35731; GlassFish Server &#22312;&#20219;&#20309;&#19968;&#20491;&#36899;&#32218;&#22833;&#25943;&#26178;&#65292;&#38364;&#38281;&#38598;&#21312;&#20013;&#30340;&#25152;&#26377;&#36899;&#32218;&#20006;&#37325;&#26032;&#24314;&#31435;&#36899;&#32218;&#12290;</p>
<p>&#22914;&#26524;&#26410;&#36984;&#21462;&#27492;&#26680;&#21462;&#26041;&#22602;&#65292;&#21063;&#20677;&#22312;&#20351;&#29992;&#20491;&#21029;&#36899;&#32218;&#26178;&#25165;&#26371;&#37325;&#26032;&#24314;&#31435;&#36889;&#20123;&#36899;&#32218;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</li>
<li>
<p>&#37341;&#23565; JMS &#36899;&#32218;&#24037;&#24288;&#36039;&#28304;&#65292;&#36984;&#21462;&#12300;&#20316;&#26989;&#20107;&#20214;&#25903;&#25588;&#12301;&#30340;&#23652;&#32026;&#12290;</p>
<p>&#36984;&#21462;&#30340;&#20540;&#26371;&#20197;&#21521;&#19979;&#30456;&#23481;&#30340;&#24418;&#24335;&#35206;&#23531;&#36039;&#28304;&#36681;&#25509;&#22120;&#20013;&#30340;&#20316;&#26989;&#20107;&#20214;&#25903;&#25588;&#23660;&#24615;&#12290;</p>
<ul>
<li>
<p>&#28858;&#21487;&#29992;&#26044;&#28041;&#21450;&#20351;&#29992;&#20316;&#26989;&#20107;&#20214;&#31684;&#22285;&#20839;&#22810;&#20491;&#36039;&#28304;&#30340;&#20316;&#26989;&#20107;&#20214;&#30340;&#36039;&#28304;&#36984;&#21462;&#12300;XATransaction&#12301;(JMS &#36039;&#28304;&#36681;&#25509;&#22120;&#30340;&#38928;&#35373;&#20540;)&#12290;</p>
<p>&#20363;&#22914;&#65292;&#20316;&#26989;&#20107;&#20214;&#21487;&#33021;&#28041;&#21450;&#27492;&#36039;&#28304;&#21152;&#19978; JDBC &#36039;&#28304;&#12289;&#36899;&#32218;&#22120;&#36039;&#28304;&#25110;&#20854;&#20182; JMS &#36899;&#32218;&#24037;&#24288;&#36039;&#28304;&#12290;&#35442;&#20540;&#20855;&#26377;&#26368;&#22823;&#30340;&#38728;&#27963;&#24615;&#12290;&#32068;&#24907;&#28858; XATransaction &#30340;&#36039;&#28304;&#23559;&#21443;&#33287;&#20841;&#38542;&#27573;&#30340;&#30906;&#35469;&#20316;&#26989;&#12290;</p>
</li>
<li>
<p>&#28858;&#21487;&#29992;&#26044;&#20677;&#28041;&#21450;&#20351;&#29992;&#20316;&#26989;&#20107;&#20214;&#31684;&#22285;&#20839;&#19968;&#20491;&#36039;&#28304;&#30340;&#20316;&#26989;&#20107;&#20214;&#30340;&#36039;&#28304;&#65292;&#25110;&#29992;&#20570;&#28041;&#21450;&#22810;&#20491; XA &#36039;&#28304;&#30340;&#20998;&#25955;&#24335;&#20316;&#26989;&#20107;&#20214;&#20013;&#26368;&#24460;&#19968;&#20491;&#20195;&#29702;&#31243;&#24335;&#30340;&#36039;&#28304;&#36984;&#21462;&#12300;LocalTransaction&#12301;&#12290;</p>
<p>&#20351;&#29992;&#35442;&#20540;&#21487;&#20197;&#29554;&#24471;&#26356;&#22909;&#30340;&#25928;&#33021;&#12290;&#32068;&#24907;&#28858; LocalTransaction &#30340;&#36039;&#28304;&#19981;&#26371;&#29992;&#26044;&#20841;&#38542;&#27573;&#30340;&#30906;&#35469;&#20316;&#26989;&#12290;</p>
</li>
<li>
<p>&#28858;&#27704;&#19981;&#21443;&#33287;&#20316;&#26989;&#20107;&#20214;&#30340;&#36039;&#28304;&#36984;&#21462;&#12300;NoTransaction&#12301;&#12290;</p>
<p>&#35442;&#35373;&#23450;&#22312; JMS &#25033;&#29992;&#31243;&#24335;&#20013;&#30340;&#20351;&#29992;&#26377;&#38480;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#38656;&#35201;&#36899;&#32218;&#39511;&#35657;&#12301;&#26680;&#21462;&#26041;&#22602;&#20197;&#21855;&#29992;&#36899;&#32218;&#39511;&#35657;&#12290;</p>
<p>&#33509;&#36984;&#21462;&#20102;&#27492;&#36984;&#38917;&#65292;&#25351;&#23450;&#36899;&#32218;&#32102;&#25033;&#29992;&#31243;&#24335;&#20043;&#21069;&#26371;&#20808;&#39511;&#35657;&#12290;&#33509;&#36039;&#28304;&#30340;&#39511;&#35657;&#22833;&#25943;&#65292;&#21063;&#26371;&#37559;&#27584;&#35442;&#36039;&#28304;&#65292;&#28982;&#24460;&#24314;&#31435;&#20006;&#20659;&#22238;&#26032;&#30340;&#36039;&#28304;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#20854;&#20182;&#29305;&#24615;&#12301;&#21312;&#27573;&#20013;&#65292;&#25351;&#23450;&#36899;&#32218;&#24037;&#24288;&#30340;&#20854;&#20182;&#29305;&#24615;&#12290;</p>
<p>&#22914;&#38656;&#21487;&#29992;&#29305;&#24615;&#30340;&#30456;&#38364;&#36039;&#35338;&#65292;&#35531;&#21443;&#38321;<a href="ref-jmsconnectionproperties.html">JMS &#36899;&#32218;&#24037;&#24288;&#29305;&#23450;&#30340;&#29305;&#24615;</a>&#12290;</p>
<p>&#33509;&#35201;&#22686;&#21152;&#29305;&#24615;&#65292;&#35531;&#25353;&#19968;&#19979;&#12300;&#22686;&#21152;&#29305;&#24615;&#12301;&#25353;&#37397;&#12290;&#22312;&#20986;&#29694;&#30340;&#31354;&#30333;&#21015;&#20013;&#65292;&#26044;&#12300;&#21517;&#31281;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#21517;&#31281;&#65292;&#28982;&#24460;&#22312;&#12300;&#20540;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#20540;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#30446;&#27161;&#12301;&#21312;&#22495;&#20013;&#65292;&#22519;&#34892;&#19979;&#21015;&#21205;&#20316;&#65306;</p>
<ol type="a">
<li>
<p>&#24478;&#12300;&#21487;&#29992;&#12301;&#27396;&#20013;&#65292;&#36984;&#21462;&#19968;&#25110;&#22810;&#20491;&#30446;&#27161;&#20197;&#24314;&#32622;&#20351;&#29992;&#36039;&#28304;&#30340;&#25033;&#29992;&#31243;&#24335;&#12290;</p>
<p>&#21487;&#29992;&#30340;&#30446;&#27161;&#21253;&#21547;&#21487;&#29992;&#30340;&#21474;&#38598;&#33287;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#65292;&#20197;&#21450;&#38928;&#35373;&#30340;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702; <code>server</code>&#12290;</p>
</li>
<li>
<p>&#25353;&#19968;&#19979;&#12300;&#22686;&#21152;&#12301;&#65292;&#23559;&#30446;&#27161;&#31227;&#33267;&#12300;&#24050;&#36984;&#21462;&#12301;&#27396;&#12290;</p>
</li>
</ol>
</li>
<li>
<p>&#25353;&#19968;&#19979;&#12300;&#30906;&#23450;&#12301;&#12290;</p>
</li>
</ol>
<a id="sthref4" name="sthref4"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-jmsconnectionedit.html">&#32232;&#36655; JMS &#36899;&#32218;&#24037;&#24288;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">&#21034;&#38500; JMS &#36899;&#32218;&#24037;&#24288;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-jmsdestinationnew.html">&#24314;&#31435; JMS &#30446;&#30340;&#22320;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-jmsdestinationedit.html">&#32232;&#36655; JMS &#30446;&#30340;&#22320;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-jmsdestinationdelete.html">&#21034;&#38500; JMS &#30446;&#30340;&#22320;&#36039;&#28304;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
