<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsphysicaldestnew" name="task-jmsphysicaldestnew"></a></p>

<h4><a id="sthref30" name="sthref30"></a><a id="sthref31" name="sthref31"></a>&#24314;&#31435; JMS &#23526;&#39636;&#30446;&#30340;&#22320;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#24744;&#36890;&#24120;&#19981;&#38656;&#35201;&#24314;&#31435;&#23526;&#39636;&#30446;&#30340;&#22320;&#65292;&#22240;&#28858;&#24744;&#21487;&#20197;&#22312;&#24314;&#31435; JMS &#30446;&#30340;&#22320;&#36039;&#28304;&#26178;&#25351;&#23450;&#23526;&#39636;&#30446;&#30340;&#22320;&#21517;&#31281;&#65292;&#32780; GlassFish Server &#26371;&#22312;&#38656;&#35201;&#26178;&#33258;&#21205;&#24314;&#31435;&#23526;&#39636;&#30446;&#30340;&#22320;&#12290;</p>
<ol>
<li>
<p>&#22312;&#28687;&#35261;&#27193;&#29376;&#32080;&#27083;&#20013;&#65292;&#23637;&#38283;&#12300;&#32068;&#24907;&#12301;&#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#35201;&#32068;&#24907;&#30340;&#22519;&#34892;&#34389;&#29702;&#65306;</p>
<ul>
<li>
<p>&#33509;&#35201;&#32068;&#24907;&#29305;&#23450;&#30340;&#22519;&#34892;&#34389;&#29702;&#65292;&#35531;&#36984;&#21462;&#35442;&#22519;&#34892;&#34389;&#29702;&#30340;&#32068;&#24907;&#31680;&#40670;&#12290;&#20363;&#22914;&#65292;&#23565;&#26044;&#38928;&#35373;&#22519;&#34892;&#34389;&#29702; <code>server</code>&#65292;&#35531;&#36984;&#21462; <code>server-config</code> &#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#32068;&#24907;&#20351;&#29992; <code>default-config</code> &#21103;&#26412;&#20043;&#26410;&#20358;&#22519;&#34892;&#34389;&#29702;&#30340;&#38928;&#35373;&#35373;&#23450;&#65292;&#35531;&#36984;&#21462; <code>default-config</code> &#31680;&#40670;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#22312;&#12300;&#32068;&#24907;&#12301;&#31680;&#40670;&#19979;&#65292;&#23637;&#38283;&#12300;Java &#35338;&#24687;&#26381;&#21209;&#12301;&#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;Java &#35338;&#24687;&#26381;&#21209;&#12301;&#31680;&#40670;&#19979;&#65292;&#36984;&#21462;&#12300;&#23526;&#39636;&#30446;&#30340;&#22320;&#12301;&#31680;&#40670;&#12290;</p>
<p>&#23559;&#38283;&#21855;&#12300;&#23526;&#39636;&#30446;&#30340;&#22320;&#12301;&#38913;&#38754;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#23526;&#39636;&#30446;&#30340;&#22320;&#12301;&#38913;&#38754;&#19978;&#65292;&#25353;&#19968;&#19979;&#12300;&#26032;&#24314;&#12301;&#12290;</p>
<p>&#23559;&#38283;&#21855;&#12300;&#26032;&#24314;&#23526;&#39636;&#30446;&#30340;&#22320;&#12301;&#38913;&#38754;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#21517;&#31281;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#23526;&#39636;&#30446;&#30340;&#22320;&#30340;&#21517;&#31281;&#12290;</p>
</li>
<li>
<p>&#24478;&#12300;&#39006;&#22411;&#12301;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#12300;<code>javax.jms.Topic</code>&#12301;&#25110;&#12300;<code>javax.jms.Queue</code>&#12301;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#26368;&#22823;&#26410;&#20351;&#29992;&#35338;&#24687;&#25976;&#30446;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#30446;&#30340;&#22320;&#25152;&#20801;&#35377;&#30340;&#26368;&#22823;&#26410;&#20351;&#29992;&#35338;&#24687;&#25976;&#30446;&#12290;</p>
<p>&#20540; -1 &#34920;&#31034;&#26410;&#20351;&#29992;&#35338;&#24687;&#30340;&#25976;&#30446;&#27794;&#26377;&#38480;&#21046;&#12290;&#38928;&#35373;&#20540;&#28858; -1&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#26368;&#22823;&#35338;&#24687;&#22823;&#23567;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#20219;&#20309;&#21934;&#19968;&#35338;&#24687;&#30340;&#26368;&#22823;&#22823;&#23567; (&#20197;&#20301;&#20803;&#32068;&#28858;&#21934;&#20301;)&#12290;</p>
<p>&#20540; -1 &#34920;&#31034;&#35338;&#24687;&#22823;&#23567;&#27794;&#26377;&#38480;&#21046;&#12290;&#38928;&#35373;&#20540;&#28858; -1&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#26368;&#22823;&#35352;&#25014;&#39636;&#32317;&#23481;&#37327;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#26410;&#20351;&#29992;&#35338;&#24687;&#30340;&#26368;&#22823;&#35352;&#25014;&#39636;&#32317;&#23481;&#37327; (&#20197;&#20301;&#20803;&#32068;&#28858;&#21934;&#20301;)&#12290;</p>
<p>&#20540; -1 &#34920;&#31034;&#26410;&#20351;&#29992;&#35338;&#24687;&#30340;&#35352;&#25014;&#39636;&#22823;&#23567;&#27794;&#26377;&#38480;&#21046;&#12290;&#38928;&#35373;&#20540;&#28858; -1&#12290;</p>
</li>
<li>
<p>&#24478;&#12300;&#33256;&#30028;&#20540;&#38480;&#21046;&#36939;&#20316;&#26041;&#24335;&#12301;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#21040;&#36948;&#35352;&#25014;&#39636;&#38480;&#21046;&#33256;&#30028;&#20540;&#26178;&#20195;&#29702;&#31243;&#24335;&#38656;&#36981;&#24490;&#30340;&#36939;&#20316;&#26041;&#24335;&#12290;</p>
<ul>
<li>
<p><code>&#25298;&#32085;&#26368;&#26032;&#35338;&#24687;</code>&#26371;&#35201;&#27714;&#20195;&#29702;&#31243;&#24335;&#20677;&#22312;&#35338;&#24687;&#25345;&#32396;&#20986;&#29694;&#26178;&#65292;&#25298;&#32085;&#26368;&#26032;&#30340;&#35338;&#24687;&#20006;&#19999;&#20986;&#30064;&#24120;&#20197;&#36890;&#30693;&#29986;&#29983;&#35338;&#24687;&#30340;&#24478;&#23660;&#31471;&#12290;</p>
<p><code>&#25298;&#32085;&#26368;&#26032;&#35338;&#24687;</code>&#28858;&#38928;&#35373;&#20540;&#12290;</p>
</li>
<li>
<p><code>&#28187;&#32233;&#29986;&#29983;&#22120;</code>&#26371;&#35201;&#27714;&#20195;&#29702;&#31243;&#24335;&#28187;&#24930;&#35338;&#24687;&#29986;&#29983;&#22120;&#20659;&#36865;&#35338;&#24687;&#30340;&#36895;&#24230;&#12290;</p>
</li>
<li>
<p><code>&#19999;&#20986;&#26368;&#33290;</code>&#26371;&#35201;&#27714;&#20195;&#29702;&#31243;&#24335;&#25448;&#26820;&#26368;&#33290;&#30340;&#35338;&#24687;&#12290;</p>
</li>
<li>
<p><code>&#19999;&#20986;&#26368;&#20302;&#20778;&#20808;&#38918;&#24207;&#30340;&#35338;&#24687;</code>&#26371;&#35201;&#27714;&#20195;&#29702;&#31243;&#24335;&#25448;&#26820;&#20778;&#20808;&#27402;&#26368;&#20302;&#30340;&#35338;&#24687;&#12290;</p>
</li>
</ul>
<p>&#22914;&#26524;&#20540;&#28858;<code>&#19999;&#20986;&#26368;&#33290;</code>&#25110;<code>&#19999;&#20986;&#20778;&#20808;&#27402;&#26368;&#20302;&#30340;&#35338;&#24687;</code>&#65292;&#19988;&#12300;&#20351;&#29992;&#20572;&#29992;&#30340;&#35338;&#24687;&#20295;&#21015;&#12301;&#35373;&#28858; True&#65292;&#21063;&#22810;&#20986;&#30340;&#35338;&#24687;&#26371;&#31227;&#33267;&#20572;&#29992;&#30340;&#35338;&#24687;&#20295;&#21015;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#26368;&#22823;&#29986;&#29983;&#22120;&#25976;&#30446;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#21487;&#20197;&#33287;&#27492;&#23526;&#39636;&#30446;&#30340;&#22320;&#38364;&#32879;&#30340;&#35338;&#24687;&#29986;&#29983;&#22120;&#26368;&#22823;&#25976;&#30446;&#12290;</p>
<p>&#21040;&#36948;&#27492;&#38480;&#21046;&#26178;&#65292;&#21063;&#28961;&#27861;&#20877;&#24314;&#31435;&#26032;&#30340;&#29986;&#29983;&#22120;&#12290;&#20540; -1 &#34920;&#31034;&#29986;&#29983;&#22120;&#30340;&#25976;&#30446;&#27794;&#26377;&#38480;&#21046;&#12290;&#38928;&#35373;&#20540;&#28858; 100&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#25209;&#27425;&#20659;&#36865;&#26368;&#22823;&#35338;&#24687;&#35336;&#25976;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#21487;&#22312;&#21934;&#19968;&#25209;&#27425;&#20013;&#20659;&#36865;&#32102;&#29992;&#25142;&#30340;&#26368;&#22823;&#35338;&#24687;&#25976;&#30446;&#12290;</p>
<p>&#20540; -1 &#34920;&#31034;&#35338;&#24687;&#30340;&#25976;&#30446;&#27794;&#26377;&#38480;&#21046;&#12290;&#38928;&#35373;&#20540;&#28858; 1000&#12290;</p>
</li>
<li>
<p>&#24478;&#12300;&#20351;&#29992;&#20572;&#29992;&#30340;&#35338;&#24687;&#20295;&#21015;&#12301;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#12300;True&#12301;&#65292;&#20572;&#29992;&#30340;&#35338;&#24687;&#26371;&#32622;&#26044;&#20572;&#29992;&#30340;&#35338;&#24687;&#20295;&#21015;&#12290;</p>
<p>&#22914;&#26524;&#20540;&#35373;&#28858; False&#65292;&#21063;&#26371;&#25448;&#26820;&#20572;&#29992;&#30340;&#35338;&#24687;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#26371;&#35373;&#28858; True&#12290;</p>
</li>
<li>
<p>&#24478;&#12300;&#21855;&#29992;&#39511;&#35657; XML &#32177;&#35201;&#12301;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#12300;True&#12301;&#65292;&#37341;&#23565;&#30446;&#30340;&#22320;&#21855;&#29992; XML &#32177;&#35201;&#39511;&#35657;&#12290;</p>
<p>&#22914;&#26524;&#20540;&#35373;&#28858; True&#65292;Message Queue &#24478;&#23660;&#31471;&#22519;&#34892;&#38542;&#27573;&#26371;&#22312;&#23559; XML &#35338;&#24687;&#20659;&#36865;&#32102;&#20195;&#29702;&#31243;&#24335;&#20043;&#21069;&#65292;&#20381;&#25818;&#25351;&#23450;&#30340; XML &#32177;&#35201;&#23450;&#32681; (&#33509;&#27794;&#26377;&#25351;&#23450; XSD&#65292;&#21063;&#20381;&#25818; DTD) &#22039;&#35430;&#39511;&#35657;&#35442;&#35338;&#24687;&#12290;&#22914;&#26524;&#25214;&#19981;&#21040;&#25351;&#23450;&#30340;&#32177;&#35201;&#25110;&#28961;&#27861;&#39511;&#35657;&#35338;&#24687;&#65292;&#21063;&#19981;&#26371;&#20659;&#36865;&#35338;&#24687;&#65292;&#20006;&#26371;&#19999;&#20986;&#30064;&#24120;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#26371;&#35373;&#28858; False&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;XML &#32177;&#35201; URI &#28165;&#21934;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#20197;&#31354;&#26684;&#20998;&#38548;&#30340; XML &#32177;&#35201;&#23450;&#32681; (XSD) URI &#23383;&#20018;&#28165;&#21934;&#12290;</p>
<p>&#22914;&#26524;&#21855;&#29992;&#20102; XML &#32177;&#35201;&#39511;&#35657;&#65292;URI &#26371;&#25351;&#21521;&#29992;&#26044; XML &#32177;&#35201;&#39511;&#35657;&#30340;&#19968;&#25110;&#22810;&#20491; XSD &#30340;&#20301;&#32622;&#12290;</p>
</li>
</ol>
<a id="sthref32" name="sthref32"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-jmsservice.html">&#32068;&#24907; JMS &#26381;&#21209;</a></p>
</li>
<li>
<p><a href="task-jmshostnew.html">&#24314;&#31435; JMS &#20027;&#27231;</a></p>
</li>
<li>
<p><a href="task-jmshostedit.html">&#32232;&#36655; JMS &#20027;&#27231;</a></p>
</li>
<li>
<p><a href="task-jmshostdelete.html">&#21034;&#38500; JMS &#20027;&#27231;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestedit.html">&#32232;&#36655; JMS &#23526;&#39636;&#30446;&#30340;&#22320;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestdelete.html">&#21034;&#38500; JMS &#23526;&#39636;&#30446;&#30340;&#22320;</a></p>
</li>
<li>
<p><a href="task-jmsflushmessages.html">&#24478; JMS &#23526;&#39636;&#30446;&#30340;&#22320;&#31227;&#38500;&#35338;&#24687;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldeststats.html">&#27298;&#35222; JMS &#23526;&#39636;&#30446;&#30340;&#22320;&#30340;&#32113;&#35336;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
