<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsdestinationedit" name="task-jmsdestinationedit"></a></p>

<h4><a id="sthref14" name="sthref14"></a><a id="sthref15" name="sthref15"></a>&#32232;&#36655; JMS &#30446;&#30340;&#22320;&#36039;&#28304;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#28687;&#35261;&#27193;&#29376;&#32080;&#27083;&#20013;&#65292;&#23637;&#38283;&#12300;&#36039;&#28304;&#12301;&#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#36039;&#28304;&#12301;&#31680;&#40670;&#19979;&#65292;&#23637;&#38283;&#12300;JMS &#36039;&#28304;&#12301;&#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;JMS &#36039;&#28304;&#12301;&#31680;&#40670;&#19979;&#65292;&#36984;&#21462;&#12300;JMS &#30446;&#30340;&#22320;&#36039;&#28304;&#12301;&#31680;&#40670;&#12290;</p>
<p>&#23559;&#38283;&#21855;&#12300;JMS &#30446;&#30340;&#22320;&#36039;&#28304;&#12301;&#38913;&#38754;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;JMS &#30446;&#30340;&#22320;&#36039;&#28304;&#12301;&#38913;&#38754;&#20013;&#65292;&#25353;&#19968;&#19979;&#24744;&#35201;&#32232;&#36655;&#30340;&#30446;&#30340;&#22320;&#36039;&#28304;&#21517;&#31281;&#12290;</p>
<p>&#23559;&#38283;&#21855;&#12300;&#32232;&#36655; JMS &#30446;&#30340;&#22320;&#36039;&#28304;&#12301;&#38913;&#38754;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#23526;&#39636;&#30446;&#30340;&#22320;&#21517;&#31281;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#35201;&#33287;&#27492;&#36039;&#28304;&#38364;&#32879;&#30340;&#23526;&#39636;&#30446;&#30340;&#22320;&#21517;&#31281;&#12290;</p>
<p>GlassFish Server &#26371;&#22312;&#38656;&#35201;&#26178;&#33258;&#21205;&#24314;&#31435;&#23526;&#39636;&#30446;&#30340;&#22320;&#65292;&#20006;&#22312;&#24744;&#21034;&#38500;&#30446;&#30340;&#22320;&#36039;&#28304;&#26178;&#23559;&#20854;&#21034;&#38500;&#12290;</p>
</li>
<li>
<p>&#24478;&#12300;&#36039;&#28304;&#39006;&#22411;&#12301;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#12300;<code>javax.jms.Topic</code>&#12301;&#25110;&#12300;<code>javax.jms.Queue</code>&#12301;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#25551;&#36848;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#30446;&#30340;&#22320;&#36039;&#28304;&#30340;&#25551;&#36848;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#21855;&#29992;&#29376;&#24907;&#12301;&#26680;&#21462;&#26041;&#22602;&#20197;&#22312;&#22519;&#34892;&#38542;&#27573;&#21855;&#29992;&#35442;&#36039;&#28304;&#12290;</p>
<p>&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#21855;&#29992;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#20854;&#20182;&#29305;&#24615;&#12301;&#21312;&#22495;&#20013;&#65292;&#25351;&#23450;&#30446;&#30340;&#22320;&#36039;&#28304;&#30340;&#20854;&#20182;&#29305;&#24615;&#12290;</p>
<p>GlassFish Server &#26410;&#23450;&#32681; JMS &#30446;&#30340;&#22320;&#36039;&#28304;&#30340;&#20219;&#20309;&#20854;&#20182;&#29305;&#24615;&#12290;</p>
<ul>
<li>
<p>&#33509;&#35201;&#22686;&#21152;&#29305;&#24615;&#65292;&#35531;&#25353;&#19968;&#19979;&#12300;&#22686;&#21152;&#29305;&#24615;&#12301;&#25353;&#37397;&#12290;&#22312;&#20986;&#29694;&#30340;&#31354;&#30333;&#21015;&#20013;&#65292;&#26044;&#12300;&#21517;&#31281;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#21517;&#31281;&#65292;&#28982;&#24460;&#22312;&#12300;&#20540;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#20540;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#20462;&#25913;&#29305;&#24615;&#65292;&#35531;&#32232;&#36655;&#29305;&#24615;&#30340;&#12300;&#20540;&#12301;&#27396;&#20301;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#21034;&#38500;&#29305;&#24615;&#65292;&#35531;&#36984;&#21462;&#24744;&#35201;&#21034;&#38500;&#20043;&#29305;&#24615;&#12300;&#21517;&#31281;&#12301;&#27396;&#20301;&#24038;&#20596;&#30340;&#26680;&#21462;&#26041;&#22602;&#65292;&#28982;&#24460;&#25353;&#19968;&#19979;&#12300;&#21034;&#38500;&#29305;&#24615;&#12301;&#25353;&#37397;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#25353;&#19968;&#19979;&#12300;&#20786;&#23384;&#12301;&#12290;</p>

<hr>
<p><b>&#25552;&#31034;:</b></p>
&#33509;&#35201;&#22238;&#21040;&#38928;&#35373;&#35373;&#23450;&#65292;&#35531;&#25353;&#19968;&#19979;&#12300;&#36617;&#20837;&#38928;&#35373;&#20540;&#12301;&#25353;&#37397;&#65292;&#28982;&#24460;&#25353;&#19968;&#19979;&#12300;&#20786;&#23384;&#12301;&#12290;<br />
<hr>

</li>
<li>
<p>&#25110;&#32773;&#65292;&#25353;&#19968;&#19979;&#12300;&#30446;&#27161;&#12301;&#27161;&#31844;&#20197;&#31227;&#33267;&#12300;JMS &#30446;&#30340;&#22320;&#36039;&#28304;&#30446;&#30340;&#22320;&#12301;&#38913;&#38754;&#12290;&#22312;&#27492;&#38913;&#38754;&#20013;&#65292;&#22519;&#34892;&#19979;&#21015;&#21205;&#20316;&#65306;</p>
<ol type="a">
<li>
<p>&#25353;&#19968;&#19979;&#12300;&#31649;&#29702;&#30446;&#27161;&#12301;&#20197;&#38283;&#21855;&#12300;&#31649;&#29702;&#36039;&#28304;&#30446;&#27161;&#12301;&#38913;&#38754;&#12290;</p>
<p>&#22312;&#27492;&#38913;&#38754;&#30340;&#12300;&#21487;&#29992;&#12301;&#27396;&#33287;&#12300;&#24050;&#36984;&#21462;&#12301;&#27396;&#20043;&#38291;&#31227;&#21205;&#30446;&#27161;&#12290;&#30906;&#23450;&#24050;&#22312;&#12300;&#24050;&#36984;&#21462;&#12301;&#27396;&#20013;&#25918;&#32622;&#23559;&#24314;&#32622;&#20351;&#29992;&#36039;&#28304;&#20043;&#25033;&#29992;&#31243;&#24335;&#30340;&#19968;&#25110;&#22810;&#20491;&#30446;&#27161;&#12290;&#21487;&#29992;&#30340;&#30446;&#27161;&#21253;&#21547;&#21487;&#29992;&#30340;&#21474;&#38598;&#33287;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#65292;&#20197;&#21450;&#38928;&#35373;&#30340;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702; <code>server</code>&#12290;&#25353;&#19968;&#19979;&#12300;&#30906;&#23450;&#12301;&#20786;&#23384;&#35722;&#26356;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#30446;&#27161;&#30340;&#26680;&#21462;&#26041;&#22602;&#65292;&#28982;&#24460;&#25353;&#19968;&#19979;&#12300;&#21855;&#29992;&#12301;&#25110;&#12300;&#20572;&#29992;&#12301;&#20197;&#21855;&#29992;&#25110;&#20572;&#29992;&#35442;&#30446;&#27161;&#30340;&#36039;&#28304;&#12290;</p>
</li>
</ol>
</li>
</ol>
<a id="sthref16" name="sthref16"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-jmsconnectionnew.html">&#24314;&#31435; JMS &#36899;&#32218;&#24037;&#24288;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-jmsconnectionedit.html">&#32232;&#36655; JMS &#36899;&#32218;&#24037;&#24288;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">&#21034;&#38500; JMS &#36899;&#32218;&#24037;&#24288;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-jmsdestinationnew.html">&#24314;&#31435; JMS &#30446;&#30340;&#22320;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-jmsdestinationdelete.html">&#21034;&#38500; JMS &#30446;&#30340;&#22320;&#36039;&#28304;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
