<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-ejbcontaineravailability" name="task-ejbcontaineravailability"></a></p>

<h4><a id="sthref10" name="sthref10"></a><a id="sthref11" name="sthref11"></a><a id="sthref12" name="sthref12"></a><a id="sthref13" name="sthref13"></a>Per configurare le impostazioni di disponibilit&agrave; per il contenitore EJB</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Espandere il nodo Configurazione nell'albero di navigazione.</p>
</li>
<li>
<p>Selezionare la configurazione da modificare.</p>
</li>
<li>
<p>Nel nodo della configurazione, selezionare il nodo Servizio disponibilit&agrave;.</p>
<p>Viene visualizzata la pagina Servizio disponibilit&agrave;.</p>
</li>
<li>
<p>Nella pagina Servizio disponibilit&agrave; fare clic sulla scheda Disponibilit&agrave; contenitore EJB.</p>
<p>Viene visualizzata la pagina Disponibilit&agrave; contenitore EJB.</p>
</li>
<li>
<p>Selezionare la casella Abilitato dell'opzione Servizio disponibilit&agrave; per abilitare la disponibilit&agrave; per il contenitore EJB.</p>
<p>Per disabilitare la disponibilit&agrave;, rimuovere il segno di spunta dalla casella Servizio disponibilit&agrave; abilitato.</p>
</li>
<li>
<p>Il tipo di persistenza HA &egrave; <code>replicated</code>.</p>
<p>Si tratta del meccanismo di persistenza utilizzato quando la casella di controllo Abilitato dell'opzione Servizio disponibilit&agrave; &egrave; selezionata. La persistenza si basa sul failover in un cluster. Non modificare questo valore.</p>
</li>
<li>
<p>Il tipo di persistenza SFSB &egrave; <code>file</code>.</p>
<p>Si tratta del meccanismo di persistenza utilizzato quando la casella di controllo Abilitato dell'opzione Servizio disponibilit&agrave; <i>non</i> &egrave; selezionata. La persistenza si basa sul file system. Non modificare questo valore.</p>
<p>Il campo Posizione di memorizzazione sessione determina la posizione in cui gli stati dei checkpoint SFSB vengono resi persistenti. Per impostare il campo Posizione di memorizzazione sessione, vedere <a href="../../../ejb-lite/en/help/task-ejbgeneral.html">Per configurare le impostazioni EJB</a>.</p>
</li>
<li>
<p>Per ripristinare i valori predefiniti, fare clic sul pulsante Carica impostazioni predefinite.</p>
</li>
<li>
<p>Nella sezione Propriet&agrave; aggiuntive, specificare le propriet&agrave; aggiuntive.</p>
<p>GlassFish Server non definisce alcuna propriet&agrave; aggiuntiva per la disponibilit&agrave; del contenitore EJB.</p>
<ul>
<li>
<p>Per aggiungere una propriet&agrave;, fare clic sul pulsante Aggiungi propriet&agrave;. Nella riga vuota visualizzata, digitare il nome della propriet&agrave; nel campo Nome e il valore della propriet&agrave; nel campo Valore.</p>
</li>
<li>
<p>Per modificare una propriet&agrave;, &egrave; necessario modificare il valore del campo Valore della propriet&agrave;.</p>
</li>
<li>
<p>Per eliminare una propriet&agrave;, selezionare la casella di controllo a sinistra del campo Nome corrispondente alla propriet&agrave; da eliminare, quindi fare clic sul pulsante Elimina propriet&agrave;.</p>
</li>
</ul>
</li>
<li>
<p>Fare clic su Salva.</p>
</li>
</ol>
<a id="sthref14" name="sthref14"></a>
<h5>Vedere anche</h5>
<ul>
<li>
<p><a href="../../../ejb-lite/en/help/task-ejbgeneral.html">Per configurare le impostazioni EJB</a></p>
</li>
<li>
<p><a href="task-ejbmdbpoolsettings.html">Per configurare le impostazioni del pool MDB</a></p>
</li>
<li>
<p><a href="task-ejbtimerservice.html">Per configurare il servizio timer EJB</a></p>
</li>
</ul>




<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
