<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-ejbcontaineravailability" name="ref-ejbcontaineravailability"></a></p>

<h4><a id="sthref15" name="sthref15"></a><a id="sthref16" name="sthref16"></a>EJB&#12467;&#12531;&#12486;&#12490;&#12398;&#21487;&#29992;&#24615;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>EJB&#12467;&#12531;&#12486;&#12490;&#12398;&#21487;&#29992;&#24615;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;EJB&#12467;&#12531;&#12486;&#12490;&#12398;&#21487;&#29992;&#24615;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;EJB&#12467;&#12531;&#12486;&#12490;&#12398;&#21487;&#29992;&#24615;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12489;</dt>
<dd>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12354;&#12427;&#35373;&#23450;&#12434;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12395;&#24489;&#20803;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12394;&#12356;&#35373;&#23450;&#12399;&#22793;&#26356;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>&#27083;&#25104;&#21517;</dt>
<dd>
<p>&#12371;&#12398;&#12506;&#12540;&#12472;&#12398;&#35373;&#23450;&#12364;&#36969;&#29992;&#12373;&#12428;&#12427;&#27083;&#25104;&#12398;&#21517;&#21069;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#21487;&#29992;&#24615;&#12469;&#12540;&#12499;&#12473;</dt>
<dd>
<p>&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;EJB&#12467;&#12531;&#12486;&#12490;&#12391;&#21487;&#29992;&#24615;&#12364;&#26377;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
</dd>
<dt>HA&#27704;&#32154;&#24615;&#12398;&#12479;&#12452;&#12503;</dt>
<dd>
<p>&#12300;&#21487;&#29992;&#24615;&#12469;&#12540;&#12499;&#12473;&#12301;&#12391;&#12300;&#26377;&#21177;&#12301;&#12364;&#36984;&#25246;&#12373;&#12428;&#12383;&#22580;&#21512;&#12395;&#20351;&#29992;&#12373;&#12428;&#12427;&#27704;&#32154;&#24615;&#12513;&#12459;&#12491;&#12474;&#12512;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;<code>replicated</code>&#12391;&#12289;&#12463;&#12521;&#12473;&#12479;&#12398;&#12501;&#12455;&#12452;&#12523;&#12458;&#12540;&#12496;&#12540;&#12395;&#22522;&#12389;&#12356;&#12390;&#27704;&#32154;&#24615;&#12364;&#25552;&#20379;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#20516;&#12399;&#22793;&#26356;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</dd>
<dt>SFSB&#27704;&#32154;&#24615;&#12398;&#12479;&#12452;&#12503;</dt>
<dd>
<p>&#12300;&#21487;&#29992;&#24615;&#12469;&#12540;&#12499;&#12473;&#12301;&#12391;&#12300;&#26377;&#21177;&#12301;&#12364;&#36984;&#25246;<i>&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;</i>&#22580;&#21512;&#12395;&#20351;&#29992;&#12373;&#12428;&#12427;&#27704;&#32154;&#24615;&#12513;&#12459;&#12491;&#12474;&#12512;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;<code>file</code>&#12391;&#12289;&#12501;&#12449;&#12452;&#12523;&#12539;&#12471;&#12473;&#12486;&#12512;&#12395;&#22522;&#12389;&#12356;&#12390;&#27704;&#32154;&#24615;&#12364;&#25552;&#20379;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#20516;&#12399;&#22793;&#26356;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>SFSB&#12481;&#12455;&#12483;&#12463;&#12509;&#12452;&#12531;&#12488;&#12398;&#29366;&#24907;&#12364;&#20445;&#25345;&#12373;&#12428;&#12427;&#22580;&#25152;&#12399;&#12289;&#12300;&#12475;&#12483;&#12471;&#12519;&#12531;&#26684;&#32013;&#20301;&#32622;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12424;&#12387;&#12390;&#27770;&#12414;&#12426;&#12414;&#12377;&#12290;&#12300;&#12475;&#12483;&#12471;&#12519;&#12531;&#26684;&#32013;&#20301;&#32622;&#12301;&#12398;&#35373;&#23450;&#26041;&#27861;&#12399;&#12289;&#12300;<a href="../../../ejb-lite/en/help/task-ejbgeneral.html">EJB&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a>&#12301;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</dd>
<dt>&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;</dt>
<dd>
<p>EJB&#12467;&#12531;&#12486;&#12490;&#12398;&#21487;&#29992;&#24615;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12290;</p>
<p>GlassFish Server&#12399;EJB&#12467;&#12531;&#12486;&#12490;&#12398;&#21487;&#29992;&#24615;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#23450;&#32681;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
</dl>
<a id="sthref17" name="sthref17"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-ejbcontaineravailability.html">EJB&#12467;&#12531;&#12486;&#12490;&#12398;&#21487;&#29992;&#24615;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="../../../ejb-lite/en/help/task-ejbgeneral.html">EJB&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
