<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-ejbtimerservice" name="task-ejbtimerservice"></a></p>

<h4><a id="sthref6" name="sthref6"></a><a id="sthref7" name="sthref7"></a><a id="sthref8" name="sthref8"></a>EJB&#12479;&#12452;&#12510;&#12540;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12479;&#12452;&#12510;&#12540;&#12539;&#12469;&#12540;&#12499;&#12473;&#12399;&#12289;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;Bean&#12467;&#12531;&#12486;&#12490;&#12395;&#12424;&#12387;&#12390;&#25552;&#20379;&#12373;&#12428;&#12289;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;Bean&#12364;&#20351;&#29992;&#12377;&#12427;&#36890;&#30693;&#12420;&#12452;&#12505;&#12531;&#12488;&#12398;&#12473;&#12465;&#12472;&#12517;&#12540;&#12523;&#12395;&#20351;&#29992;&#12373;&#12428;&#12427;&#12289;&#27704;&#32154;&#30340;&#12394;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#36890;&#30693;&#12469;&#12540;&#12499;&#12473;&#12391;&#12377;&#12290;&#12473;&#12486;&#12540;&#12488;&#12501;&#12523;&#12539;&#12475;&#12483;&#12471;&#12519;&#12531;Beans&#20197;&#22806;&#12398;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;Beans&#12399;&#12377;&#12409;&#12390;&#12289;&#12479;&#12452;&#12510;&#12540;&#12539;&#12469;&#12540;&#12499;&#12473;&#12363;&#12425;&#12398;&#36890;&#30693;&#12434;&#21463;&#20449;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#12469;&#12540;&#12499;&#12473;&#12395;&#12424;&#12387;&#12390;&#35373;&#23450;&#12373;&#12428;&#12383;&#27704;&#32154;&#12479;&#12452;&#12510;&#12540;&#12399;&#12289;&#12469;&#12540;&#12496;&#12540;&#12398;&#20572;&#27490;&#12420;&#20877;&#36215;&#21205;&#12391;&#12399;&#30772;&#26820;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;EJB&#12467;&#12531;&#12486;&#12490;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;Enterprise Java Beans (EJB)&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;EJB&#12479;&#12452;&#12510;&#12540;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12479;&#12502;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;EJB&#12479;&#12452;&#12510;&#12540;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26368;&#23567;&#37197;&#20449;&#38291;&#38548;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#27425;&#12398;&#12479;&#12452;&#12510;&#12540;&#12398;&#26377;&#21177;&#26399;&#38480;&#12364;&#20999;&#12428;&#12390;&#29305;&#23450;&#12398;&#12479;&#12452;&#12510;&#12540;&#12398;&#30330;&#29983;&#12364;&#21487;&#33021;&#12395;&#12394;&#12427;&#12414;&#12391;&#12398;&#26368;&#30701;&#26178;&#38291;&#12434;&#12511;&#12522;&#31186;&#21336;&#20301;&#12391;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#38291;&#38548;&#12398;&#35373;&#23450;&#12364;&#30701;&#12377;&#12366;&#12427;&#12392;&#12289;&#12469;&#12540;&#12496;&#12540;&#12364;&#12458;&#12540;&#12496;&#12540;&#12525;&#12540;&#12489;&#12377;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;1000&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26368;&#22823;&#20877;&#37197;&#20449;&#22238;&#25968;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#20363;&#22806;&#12414;&#12383;&#12399;&#12525;&#12540;&#12523;&#12539;&#12496;&#12483;&#12463;&#12395;&#12424;&#12427;&#12479;&#12452;&#12510;&#12540;&#12398;&#26377;&#21177;&#26399;&#38480;&#20999;&#12428;&#12398;&#37197;&#20449;&#12434;&#12289;&#12479;&#12452;&#12510;&#12540;&#12539;&#12469;&#12540;&#12499;&#12473;&#12364;&#35430;&#34892;&#12377;&#12427;&#26368;&#22823;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;1&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20877;&#37197;&#20449;&#38291;&#38548;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#20877;&#37197;&#20449;&#12434;&#23455;&#34892;&#12377;&#12427;&#38291;&#38548;&#12434;&#12511;&#12522;&#31186;&#21336;&#20301;&#12391;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;5000&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12479;&#12452;&#12510;&#12540;&#12539;&#12487;&#12540;&#12479;&#12477;&#12540;&#12473;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12479;&#12452;&#12510;&#12540;&#12539;&#12487;&#12540;&#12479;&#12477;&#12540;&#12473;&#12392;&#12375;&#12390;&#20351;&#29992;&#12377;&#12427;JDBC&#12522;&#12477;&#12540;&#12473;&#12398;JNDI&#21517;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12371;&#12398;&#20516;&#12399;&#12479;&#12452;&#12510;&#12540;&#12539;&#12469;&#12540;&#12499;&#12473;&#12539;&#12471;&#12473;&#12486;&#12512;&#12539;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;<code>jdbc/__TimerPool</code>&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12434;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#12498;&#12531;&#12488;:</b></p>
&#12487;&#12501;&#12457;&#12523;&#12488;&#35373;&#23450;&#12395;&#36820;&#12377;&#12395;&#12399;&#12289;&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12489;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12289;&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;<br />
<hr>

</li>
<li>
<p>GlassFish Server&#12434;&#20877;&#36215;&#21205;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref9" name="sthref9"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="../../../ejb-lite/en/help/task-ejbgeneral.html">EJB&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-ejbmdbpoolsettings.html">MDB&#12503;&#12540;&#12523;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-ejbcontaineravailability.html">EJB&#12467;&#12531;&#12486;&#12490;&#12398;&#21487;&#29992;&#24615;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
