<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-ejbmdbpoolsettings" name="task-ejbmdbpoolsettings"></a></p>

<h4><a id="sthref2" name="sthref2"></a><a id="sthref3" name="sthref3"></a><a id="sthref4" name="sthref4"></a>MDB&#12503;&#12540;&#12523;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12513;&#12483;&#12475;&#12540;&#12472;&#12489;&#12522;&#12502;&#12531;Beans&#12398;&#12503;&#12540;&#12523;&#12399;&#12289;&#12475;&#12483;&#12471;&#12519;&#12531;Beans&#12398;&#12503;&#12540;&#12523;&#12392;&#21516;&#27096;&#12391;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12289;&#12467;&#12531;&#12486;&#12490;&#12399;&#12513;&#12483;&#12475;&#12540;&#12472;&#12489;&#12522;&#12502;&#12531;Bean&#12398;&#12503;&#12540;&#12523;&#12434;&#20445;&#25345;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12503;&#12540;&#12523;&#12398;&#27083;&#25104;&#12434;&#35519;&#25972;&#12377;&#12427;&#12395;&#12399;&#12289;&#27425;&#12398;&#12473;&#12486;&#12483;&#12503;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;</p>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;EJB&#12467;&#12531;&#12486;&#12490;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;Enterprise Java Beans (EJB)&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;MDB&#35373;&#23450;&#12301;&#12479;&#12502;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;MDB&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12503;&#12540;&#12523;&#35373;&#23450;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#21021;&#26399;&#12362;&#12424;&#12403;&#26368;&#23567;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12503;&#12540;&#12523;&#12395;&#20445;&#25345;&#12373;&#12428;&#12427;&#12513;&#12483;&#12475;&#12540;&#12472;Bean&#12398;&#26368;&#23567;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;0&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26368;&#22823;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12467;&#12531;&#12486;&#12490;&#12364;&#12503;&#12540;&#12523;&#12395;&#19968;&#24230;&#12395;&#20445;&#25345;&#12391;&#12365;&#12427;Bean&#12398;&#26368;&#22823;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;32&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;&#22793;&#26356;&#37327;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12450;&#12452;&#12489;&#12523;&#29366;&#24907;&#12398;&#32153;&#32154;&#26178;&#38291;&#12364;&#12300;&#12503;&#12540;&#12523;&#12539;&#12450;&#12452;&#12489;&#12523;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#25351;&#23450;&#12375;&#12383;&#26178;&#38291;&#12434;&#36229;&#12360;&#12383;&#22580;&#21512;&#12395;&#12289;&#12503;&#12540;&#12523;&#12363;&#12425;&#38500;&#21435;&#12373;&#12428;&#12427;Bean&#12398;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#20516;&#12399;0&#20197;&#19978;&#12391;&#12289;&#12300;&#26368;&#22823;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;&#12301;&#12398;&#20516;&#26410;&#28288;&#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;8&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12503;&#12540;&#12523;&#12539;&#12450;&#12452;&#12489;&#12523;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12503;&#12540;&#12523;&#20869;&#12398;Bean&#12364;&#12503;&#12540;&#12523;&#12363;&#12425;&#38500;&#21435;&#12373;&#12428;&#12427;&#12414;&#12391;&#12395;&#12289;&#12450;&#12452;&#12489;&#12523;&#29366;&#24907;&#12434;&#32173;&#25345;&#12391;&#12365;&#12427;&#26178;&#38291;&#12434;&#31186;&#21336;&#20301;&#12391;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#26178;&#38291;&#12364;&#32076;&#36942;&#12377;&#12427;&#12392;&#12289;Bean&#12399;&#30772;&#26820;&#12373;&#12428;&#12414;&#12377;&#12290;0&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;Bean&#12399;&#21046;&#38480;&#12394;&#12367;&#12450;&#12452;&#12489;&#12523;&#29366;&#24907;&#12434;&#32173;&#25345;&#12391;&#12365;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;600&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#12289;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>GlassFish Server&#12399;MDB&#12503;&#12540;&#12523;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#23450;&#32681;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
<ul>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#34920;&#31034;&#12373;&#12428;&#12427;&#31354;&#30333;&#34892;&#12391;&#12289;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#21517;&#12434;&#20837;&#21147;&#12375;&#12289;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;&#12289;&#12381;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#32232;&#38598;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;&#12289;&#21066;&#38500;&#12377;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12398;&#24038;&#20596;&#12395;&#12354;&#12427;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21066;&#38500;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#12498;&#12531;&#12488;:</b></p>
&#12487;&#12501;&#12457;&#12523;&#12488;&#35373;&#23450;&#12395;&#36820;&#12377;&#12395;&#12399;&#12289;&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12489;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12289;&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;<br />
<hr>

</li>
<li>
<p>GlassFish Server&#12434;&#20877;&#36215;&#21205;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref5" name="sthref5"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="../../../ejb-lite/en/help/task-ejbgeneral.html">EJB&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-ejbtimerservice.html">EJB&#12479;&#12452;&#12510;&#12540;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-ejbcontaineravailability.html">EJB&#12467;&#12531;&#12486;&#12490;&#12398;&#21487;&#29992;&#24615;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
