<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-iioplisteneredit" name="ref-iioplisteneredit"></a></p>

<h4><a id="sthref24" name="sthref24"></a>IIOP &#47532;&#49828;&#45320; &#54200;&#51665;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>IIOP &#47532;&#49828;&#45320; &#54200;&#51665; &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; IIOP &#47532;&#49828;&#45320;&#50640; &#45824;&#54620; &#49444;&#51221;&#51012; &#49688;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>[IIOP &#47532;&#49828;&#45320; &#54200;&#51665;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44592;&#48376;&#44050; &#47196;&#46300;</dt>
<dd>
<p>&#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#45716; &#49444;&#51221;&#51012; &#44592;&#48376;&#44050;&#51004;&#47196; &#48373;&#50896;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#49444;&#51221;&#51008; &#48320;&#44221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#44396;&#49457; &#51060;&#47492;</dt>
<dd>
<p>&#51060; &#54168;&#51060;&#51648;&#51032; &#49444;&#51221;&#51060; &#51201;&#50857;&#46104;&#45716; &#44396;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51060;&#47492;</dt>
<dd>
<p>IIOP &#47532;&#49828;&#45320;&#47484; &#49885;&#48324;&#54616;&#45716; &#44256;&#50976;&#54620; &#51060;&#47492;&#51077;&#45768;&#45796;. [&#51060;&#47492;] &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857; &#54596;&#46300;&#51077;&#45768;&#45796;. IIOP &#47532;&#49828;&#45320;&#47484; &#49373;&#49457;&#54624; &#46412;&#47564; &#51060;&#47492;&#51012; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#45348;&#53944;&#50892;&#53356; &#51452;&#49548;</dt>
<dd>
<p>IIOP &#47532;&#49828;&#45320;&#51032; &#45348;&#53944;&#50892;&#53356; &#51452;&#49548;&#51077;&#45768;&#45796;. &#45348;&#53944;&#50892;&#53356; &#51452;&#49548;&#45716; IP &#51452;&#49548; &#46608;&#45716; DNS&#50640;&#49436; &#54869;&#51064; &#44032;&#45733;&#54620; &#54840;&#49828;&#53944; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#47532;&#49828;&#45320; &#54252;&#53944;</dt>
<dd>
<p>IIOP &#47532;&#49828;&#45320;&#51032; &#49688;&#49888; &#50948;&#52824;&#50640; &#54644;&#45817;&#54616;&#45716; &#54252;&#53944; &#48264;&#54840;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#47532;&#49828;&#45320;</dt>
<dd>
<p>&#47532;&#49828;&#45320;&#51032; &#49345;&#53468;&#51077;&#45768;&#45796;. [&#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#47732; GlassFish Server&#50640; &#45824;&#54620; ORB IIOP &#51064;&#48148;&#50868;&#46300; &#51217;&#49549;&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#48372;&#50504;</dt>
<dd>
<p>[&#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#47732; IIOP &#47532;&#49828;&#45320;&#50640; &#45824;&#54644; SSL&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#52628;&#44032; &#49549;&#49457;</dt>
<dd>
<p>IIOP &#47532;&#49828;&#45320;&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51077;&#45768;&#45796;. GlassFish Server&#50640;&#49436;&#45716; IIOP &#47532;&#49828;&#45320;&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51012; &#51221;&#51032;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref25" name="sthref25"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-iioplistenernew.html">IIOP &#47532;&#49828;&#45320;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-iioplisteneredit.html">IIOP &#47532;&#49828;&#45320;&#47484; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-editiiopssl.html">&#48372;&#50504; IIOP &#47532;&#49828;&#45320;&#51032; SSL &#49444;&#51221;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-iioplistenerdelete.html">IIOP &#47532;&#49828;&#45320;&#47484; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref26" name="sthref26"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00032"><code>create-iiop-listener</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00169"><code>list-iiop-listeners</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00084"><code>delete-iiop-listener</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00058"><code>create-ssl</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00109"><code>delete-ssl</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
