<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-orb" name="ref-orb"></a><a id="GHCOR00001" name="GHCOR00001"></a></p>

<h4><a id="sthref14" name="sthref14"></a><a id="sthref15" name="sthref15"></a>ORB</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>ORB &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; ORB(Object Request Broker)&#47484; &#44396;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>ORB&#45716; &#44061;&#52404;&#47484; &#49885;&#48324;&#54616;&#50668; &#52286;&#44256; &#51217;&#49549; &#44288;&#47532;&#47484; &#52376;&#47532;&#54616;&#47728; &#45936;&#51060;&#53552;&#47484; &#51204;&#45804;&#54616;&#44256; &#53685;&#49888;&#51012; &#50836;&#52397;&#54616;&#45716; &#45936; &#54596;&#50836;&#54620; &#44592;&#48152; &#44396;&#51312;&#47484; &#51228;&#44277;&#54633;&#45768;&#45796;. &#50644;&#53552;&#54532;&#46972;&#51060;&#51592; Bean(EJB &#47784;&#46280;)&#51032; &#50896;&#44201; &#53364;&#46972;&#51060;&#50616;&#53944;&#45716; ORB&#47484; &#49324;&#50857;&#54616;&#50668; GlassFish Server&#44284;(&#50752;) &#53685;&#49888;&#54633;&#45768;&#45796;.</p>
<p>ORB &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44592;&#48376;&#44050; &#47196;&#46300;</dt>
<dd>
<p>&#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#45716; &#49444;&#51221;&#51012; &#44592;&#48376;&#44050;&#51004;&#47196; &#48373;&#50896;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#49444;&#51221;&#51008; &#48320;&#44221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#44396;&#49457; &#51060;&#47492;</dt>
<dd>
<p>&#51060; &#54168;&#51060;&#51648;&#51032; &#49444;&#51221;&#51060; &#51201;&#50857;&#46104;&#45716; &#44396;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49828;&#47112;&#46300; &#54400; ID</dt>
<dd>
<p>ORB&#50640;&#49436; &#49324;&#50857;&#54616;&#45716; &#49828;&#47112;&#46300; &#54400;&#51077;&#45768;&#45796;. ORB&#45716; &#49828;&#47112;&#46300; &#54400;&#51012; &#49324;&#50857;&#54616;&#50668; RMI-IIOP&#47484; &#49324;&#50857;&#54616;&#50668; &#53685;&#49888;&#54616;&#45716; &#45796;&#47480; &#53364;&#46972;&#51060;&#50616;&#53944;&#50752; &#50644;&#53552;&#54532;&#46972;&#51060;&#51592; Bean&#51032; &#50896;&#44201; &#53364;&#46972;&#51060;&#50616;&#53944;&#50640;&#49436; &#46308;&#50612;&#50724;&#45716; &#50836;&#52397;&#50640; &#51025;&#45813;&#54633;&#45768;&#45796;. ORB&#51032; &#44592;&#48376; &#49828;&#47112;&#46300; &#54400;&#51008; <code>thread-pool-1</code>&#51060;&#47728;, &#51060; &#54400;&#51008; RMI/IIOP &#50836;&#52397;&#50640; &#54644;&#45817;&#54616;&#45716; &#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#45824; &#47700;&#49884;&#51648; &#45800;&#54200; &#53356;&#44592;</dt>
<dd>
<p>IIOP &#47700;&#49884;&#51648;&#50640; &#45824;&#54620; &#52572;&#45824; &#45800;&#54200; &#53356;&#44592;&#51077;&#45768;&#45796;. &#51060; &#53356;&#44592;&#48372;&#45796; &#53360; &#47700;&#49884;&#51648;&#45716; &#45800;&#54200;&#54868;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 1024&#48148;&#51060;&#53944;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52509; &#51217;&#49549; &#49688;</dt>
<dd>
<p>&#47784;&#46304; IIOP &#47532;&#49828;&#45320;&#50640; &#46308;&#50612;&#50724;&#45716; &#52572;&#45824; &#51217;&#49549; &#49688;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 1024&#51077;&#45768;&#45796;.</p>
</dd>
<dt>IIOP &#53364;&#46972;&#51060;&#50616;&#53944; &#51064;&#51613;</dt>
<dd>
<p>[&#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#47732; &#49436;&#48260;&#44032; &#51064;&#51613;&#46104;&#51648; &#50506;&#51008; &#50836;&#52397;&#51012; &#44144;&#48512;&#54616;&#44256; &#53364;&#46972;&#51060;&#50616;&#53944;&#50640;&#44172; &#51204;&#49569;&#46108; IOR(Interoperable Object Reference)&#50640; &#51064;&#51613; &#50836;&#52397; &#48708;&#53944;&#47484; &#49341;&#51077;&#54633;&#45768;&#45796;. IIOP &#53364;&#46972;&#51060;&#50616;&#53944; &#51064;&#51613;&#51008; &#49324;&#50857; &#46608;&#45716; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#52628;&#44032; &#49549;&#49457;</dt>
<dd>
<p>ORB&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51077;&#45768;&#45796;. GlassFish Server&#50640;&#49436;&#45716; ORB&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51012; &#51221;&#51032;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref16" name="sthref16"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-orb.html">ORB&#47484; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-iioplistenernew.html">IIOP &#47532;&#49828;&#45320;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-iioplisteneredit.html">IIOP &#47532;&#49828;&#45320;&#47484; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-editiiopssl.html">&#48372;&#50504; IIOP &#47532;&#49828;&#45320;&#51032; SSL &#49444;&#51221;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-iioplistenerdelete.html">IIOP &#47532;&#49828;&#45320;&#47484; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref17" name="sthref17"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00032"><code>create-iiop-listener</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00169"><code>list-iiop-listeners</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00084"><code>delete-iiop-listener</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00058"><code>create-ssl</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00109"><code>delete-ssl</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
