<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-orb" name="ref-orb"></a></p>

<h4><a id="sthref14" name="sthref14"></a><a id="sthref15" name="sthref15"></a>ORB</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page ORB permet de configurer l'ORB (Object Request Broker).</p>
<p>L'ORB fournit l'interface requise pour identifier et localiser des objets, g&eacute;rer les connexions, fournir des donn&eacute;es et demander des communications. Les clients distants d'Enterprise Beans (modules EJB) communiquent avec GlassFish Server &agrave; l'aide de l'ORB.</p>
<p>La page ORB contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Charger les valeurs par d&eacute;faut</dt>
<dd>
<p>Bouton permettant de restaurer les valeurs par d&eacute;faut des param&egrave;tres qui en ont. Les param&egrave;tres qui n'ont pas de valeurs par d&eacute;faut ne sont pas modifi&eacute;s.</p>
</dd>
<dt>Nom de configuration</dt>
<dd>
<p>Nom de la configuration &agrave; laquelle s'appliquent les param&egrave;tres de cette page. Ce champ est en lecture seule.</p>
</dd>
<dt>ID du pool de threads</dt>
<dd>
<p>Pool de threads utilis&eacute; par l'ORB. L'ORB utilise des pools de threads pour r&eacute;pondre aux demandes des clients distants d'Enterprise Beans et d'autres clients qui communiquent via le protocole RMI-IIOP. Le pool de threads par d&eacute;faut de l'ORB est <code>thread-pool-1</code> qui utilise les valeurs par d&eacute;faut appropri&eacute;es aux demandes RMI/IIOP.</p>
</dd>
<dt>Taille max. du fragment de message</dt>
<dd>
<p>Taille maximale du fragment des messages IIOP. Les messages d&eacute;passant cette taille sont fragment&eacute;s. La valeur par d&eacute;faut est 1 024 octets.</p>
</dd>
<dt>Nombre total de connexions</dt>
<dd>
<p>Nombre maximal de connexions entrantes pour l'ensemble des processus d'&eacute;coute IIOP. La valeur par d&eacute;faut est 1024.</p>
</dd>
<dt>Authentification client IIOP</dt>
<dd>
<p>Si la case Activ&eacute; est coch&eacute;e, le serveur rejette les demandes non authentifi&eacute;es et ins&egrave;re un bit de demande d'authentification dans les r&eacute;f&eacute;rences IOR (Interoperable Object Reference) envoy&eacute;es aux clients. L'authentification client IIOP peut &ecirc;tre activ&eacute;e ou d&eacute;sactiv&eacute;e. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Autres propri&eacute;t&eacute;s</dt>
<dd>
<p>Propri&eacute;t&eacute;s suppl&eacute;mentaires de l'ORB. GlassFish Server ne d&eacute;finit aucune autre propri&eacute;t&eacute; pour l'ORB.</p>
</dd>
</dl>
<a id="sthref16" name="sthref16"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-orb.html">Configuration de l'ORB</a></p>
</li>
<li>
<p><a href="task-iioplistenernew.html">Cr&eacute;ation d'un processus d'&eacute;coute IIOP</a></p>
</li>
<li>
<p><a href="task-iioplisteneredit.html">Modification d'un processus d'&eacute;coute IIOP</a></p>
</li>
<li>
<p><a href="task-editiiopssl.html">Modification des param&egrave;tres SSL pour un processus d'&eacute;coute IIOP s&eacute;curis&eacute;</a></p>
</li>
<li>
<p><a href="task-iioplistenerdelete.html">Suppression d'un processus d'&eacute;coute IIOP</a></p>
</li>
</ul>
<a id="sthref17" name="sthref17"></a>
<h5>Commandes asadmin connexes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00032"><code>create-iiop-listener</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00169"><code>list-iiop-listeners</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00084"><code>delete-iiop-listener</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00058"><code>create-ssl</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00109"><code>delete-ssl</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
