<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsphysicaldestnew" name="ref-jmsphysicaldestnew"></a><a id="GHJMS00017" name="GHJMS00017"></a></p>

<h4><a id="sthref92" name="sthref92"></a><a id="sthref93" name="sthref93"></a>Nuova destinazione fisica JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilizzare la pagina Nuova destinazione fisica JMS per creare una nuova destinazione fisica JMS.</p>
<p>Di norma non &egrave; necessario creare destinazioni fisiche in quanto al momento della creazione di una risorsa di destinazione JMS &egrave; necessario specificare il nome di una destinazione fisica. Se necessaria, la destinazione fisica viene creata in modo automatico.</p>
<p>La pagina Nuova destinazione fisica JMS contiene le opzioni riportate di seguito.</p>
<dl>
<dt>Nome</dt>
<dd>
<p>Il nome della destinazione fisica.</p>
</dd>
<dt>Tipo</dt>
<dd>
<p>Il tipo della destinazione fisica. Le scelte disponibili sono <code>javax.jms.Topic</code> e <code>javax.jms.Queue</code>.</p>
</dd>
<dt>Numero massimo di messaggi non utilizzati</dt>
<dd>
<p>Il numero massimo di messaggi non utilizzati consentiti per la destinazione. Il valore -1 indica un numero illimitato di messaggi non utilizzati. Il valore predefinito &egrave; -1.</p>
</dd>
<dt>Dimensione massima messaggio</dt>
<dd>
<p>La dimensione massima, in byte, di un singolo messaggio qualsiasi. Il valore -1 indica una dimensione di messaggio illimitata. Il valore predefinito &egrave; -1.</p>
</dd>
<dt>Memoria totale massima</dt>
<dd>
<p>La memoria totale massima, in byte, per i messaggi non utilizzati. Il valore -1 indica l'assenza di limiti per la dimensione della memoria dei messaggi non utilizzati. Il valore predefinito &egrave; -1.</p>
</dd>
<dt>Funzionamento limite soglia</dt>
<dd>
<p>Il funzionamento del broker quando viene raggiunta la soglia del limite di memoria. Di seguito sono riportate le scelte disponibili.</p>
<dl>
<dt>Rifiuta i messaggi pi&ugrave; recenti</dt>
<dd>
<p>Consente di rifiutare i messaggi pi&ugrave; recenti e di avvertire il client di produzione con un'eccezione solo se il messaggio &egrave; persistente. Questo &egrave; il valore predefinito.</p>
</dd>
<dt>Rallenta producer</dt>
<dd>
<p>Consente di ridurre la velocit&agrave; alla quale i producer inviano messaggi.</p>
</dd>
<dt>Elimina i meno recenti</dt>
<dd>
<p>Consente di eliminare i messaggi meno recenti.</p>
</dd>
<dt>Elimina i messaggi con la priorit&agrave; pi&ugrave; bassa</dt>
<dd>
<p>Consente di eliminare i messaggi con la priorit&agrave; pi&ugrave; bassa.</p>
</dd>
</dl>
<p>Se il valore &egrave; Elimina i meno recenti o Elimina i messaggi con la priorit&agrave; pi&ugrave; bassa e Usa coda dei messaggi bloccati &egrave; impostato su True, i messaggi in eccesso vengono spostati nella coda dei messaggi bloccati.</p>
</dd>
<dt>Numero massimo di producer</dt>
<dd>
<p>Il numero massimo di producer di messaggi che &egrave; possibile associare a questa destinazione fisica. Una volta raggiunto questo limite, non &egrave; possibile creare nuovi producer. Il valore -1 indica un numero illimitato di producer. Il valore predefinito &egrave; 100.</p>
</dd>
<dt>Numero massimo messaggi per consegna batch</dt>
<dd>
<p>Il numero massimo di messaggi che &egrave; possibile consegnare ai consumer in un singolo batch. Il valore -1 indica un numero illimitato di messaggi. Il valore predefinito &egrave; 1000.</p>
</dd>
<dt>Usa coda dei messaggi bloccati</dt>
<dd>
<p>Se il valore &egrave; impostato su True, i messaggi bloccati vengono inseriti nella coda di messaggi bloccati. Se il valore &egrave; impostato su False, i messaggi bloccati vengono eliminati. Questa opzione &egrave; impostata su True per impostazione predefinita.</p>
</dd>
<dt>Convalida schema XML</dt>
<dd>
<p>Se il valore &egrave; impostato su True, prima dell'invio di un messaggio XML al broker, il runtime del client Message Queue tenter&agrave; di convalidarlo in base alle XSD (XML Schema Definition) specificate o, se non &egrave; specificata alcuna XSD, in base al DTD. Se non &egrave; possibile individuare lo schema specificato o convalidare il messaggio, quest'ultimo non viene inviato e viene restituita un'eccezione. Questa opzione &egrave; impostata su False per impostazione predefinita.</p>
</dd>
<dt>Lista URI schema XML</dt>
<dd>
<p>Lista separata da spazi di stringhe URI per XSD (XML Schema Definition). Se &egrave; abilitata la convalida dello schema XML, gli URI puntano alla posizione di una o pi&ugrave; XSD da utilizzare per tale convalida.</p>
</dd>
</dl>
<a id="sthref94" name="sthref94"></a>
<h5>Task correlati</h5>
<ul>
<li>
<p><a href="task-jmsservice.html">Per configurare il servizio JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestnew.html">Per creare una destinazione fisica JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestedit.html">Per modificare una destinazione fisica JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestdelete.html">Per eliminare una destinazione fisica JMS</a></p>
</li>
<li>
<p><a href="task-jmsflushmessages.html">Per rimuovere i messaggi da una destinazione fisica JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldeststats.html">Per visualizzare le statistiche per una destinazione fisica JMS</a></p>
</li>
</ul>
<a id="sthref95" name="sthref95"></a>
<h5>Comandi asadmin correlati</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00038"><code>create-jmsdest</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00175"><code>list-jmsdest</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00090"><code>delete-jmsdest</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00136"><code>flush-jmsdest</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00144"><code>jms-ping</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
