<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsconnectionedit" name="ref-jmsconnectionedit"></a></p>

<h4><a id="sthref53" name="sthref53"></a><a id="sthref54" name="sthref54"></a>Modifica Connection Factory JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilizzare la pagina Modifica Connection Factory JMS per modificare le impostazioni per un Connection Factory JMS.</p>
<p>La pagina Modifica Connection Factory JMS contiene le opzioni riportate di seguito.</p>
<dl>
<dt>Carica impostazioni predefinite</dt>
<dd>
<p>Pulsante per ripristinare i valori predefiniti delle impostazioni che dispongono di valori predefiniti. Le impostazioni che non dispongono di valori predefiniti non vengono modificate.</p>
</dd>
<dt>Nome pool</dt>
<dd>
<p>Il nome univoco del connection pool del connettore creato per il Connection Factory. Questo nome corrisponde inoltre al nome JNDI del Connection Factory. Il campo del nome del pool &egrave; di sola lettura.</p>
</dd>
<dt>Tipo di risorsa</dt>
<dd>
<p>Il tipo di Connection Factory. Il campo Tipo di risorsa &egrave; di sola lettura. &Egrave; possibile specificare il tipo di risorsa solo quando si crea un nuovo Connection Factory JMS.</p>
</dd>
<dt>Descrizione</dt>
<dd>
<p>La descrizione del Connection Factory.</p>
</dd>
<dt>Stato</dt>
<dd>
<p>Lo stato del Connection Factory. Il Connection Factory pu&ograve; essere abilitato o disabilitato. Questa opzione &egrave; abilitata per impostazione predefinita.</p>
</dd>
<dt>Dimensione pool iniziale e minima</dt>
<dd>
<p>Il numero minimo di connessioni nel pool per il Connection Factory. Il valore predefinito &egrave; 8.</p>
</dd>
<dt>Dimensione massima pool</dt>
<dd>
<p>Il numero massimo di connessioni nel pool. Il valore predefinito &egrave; 32.</p>
</dd>
<dt>Quantit&agrave; di ridimensionamento pool</dt>
<dd>
<p>Il numero di connessioni da rimuovere allo scadere del timeout di inattivit&agrave; del pool. Il valore predefinito &egrave; 2.</p>
</dd>
<dt>Timeout inattivit&agrave;</dt>
<dd>
<p>Il periodo di tempo massimo, in secondi, durante il quale una connessione pu&ograve; rimanere inattiva nel pool. Il valore predefinito &egrave; 300.</p>
</dd>
<dt>Tempo massimo di attesa</dt>
<dd>
<p>Il periodo di tempo durante il quale l'applicazione che richiede una connessione rimarr&agrave; in attesa prima che si verifichi il timeout della connessione. Il valore predefinito &egrave; 60000.</p>
</dd>
<dt>In caso di qualsiasi errore</dt>
<dd>
<p>Se la casella di controllo Chiudi tutte le connessioni &egrave; selezionata, GlassFish Server chiude tutte le connessioni nel pool e le ristabilisce se una singola connessione non riesce. Questa opzione &egrave; disabilitata per impostazione predefinita.</p>
</dd>
<dt>Supporto transazioni</dt>
<dd>
<p>Il valore pu&ograve; essere uno di quelli riportati di seguito.</p>
<dl>
<dt>XATransaction</dt>
<dd>
<p>La risorsa pu&ograve; essere utilizzata per le transazioni che implicano l'uso di pi&ugrave; risorse nell'ambito della transazione. Questo &egrave; il valore predefinito per un Connection Factory JMS.</p>
<p>Ad esempio, &egrave; possibile che in una transazione sia necessario utilizzare questa risorsa insieme a una risorsa JDBC, a una risorsa connettore o a un'altra risorsa Connection Factory JMS. Questo valore offre la massima flessibilit&agrave;. Una risorsa configurata come XATransaction verr&agrave; utilizzata nelle operazioni di commit a due fasi.</p>
</dd>
<dt>LocalTransaction</dt>
<dd>
<p>La risorsa pu&ograve; essere utilizzata per le transazioni che implicano l'uso di una sola risorsa nell'ambito della transazione oppure come ultimo agente in una transazione distribuita che prevede l'uso di pi&ugrave; risorse XA.</p>
<p>Questo valore offre prestazioni decisamente migliori. Una risorsa configurata come LocalTransaction non verr&agrave; utilizzata nelle operazioni di commit a due fasi.</p>
</dd>
<dt>NoTransaction</dt>
<dd>
<p>La risorsa non pu&ograve; mai essere utilizzata nelle transazioni. Questa impostazione viene utilizzata raramente nelle applicazioni JMS.</p>
</dd>
</dl>
</dd>
<dt>Convalida connessione</dt>
<dd>
<p>Se la casella di controllo Obbligatorio &egrave; selezionata, le connessioni vengono convalidate prima di essere fornite all'applicazione. Se la convalida di una risorsa non riesce, la risorsa viene eliminata e viene creata e restituita una nuova risorsa. Questa opzione &egrave; disabilitata per impostazione predefinita.</p>
</dd>
<dt>Propriet&agrave; aggiuntive</dt>
<dd>
<p>Propriet&agrave; aggiuntive per il Connection Factory.</p>
<p>Per informazioni sulle propriet&agrave; disponibili, vedere <a href="ref-jmsconnectionproperties.html">Propriet&agrave; specifiche dei connection factory JMS</a>.</p>
</dd>
</dl>
<a id="sthref55" name="sthref55"></a>
<h5>Task correlati</h5>
<ul>
<li>
<p><a href="task-jmsconnectionnew.html">Per creare una risorsa Connection Factory JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectionedit.html">Per modificare una risorsa Connection Factory JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">Per eliminare una risorsa Connection Factory JMS</a></p>
</li>
</ul>
<a id="sthref56" name="sthref56"></a>
<h5>Comandi asadmin correlati</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00040"><code>create-jms-resource</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00177"><code>list-jms-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00092"><code>delete-jms-resource</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
