<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-messagesecurityproviderconfigprops" name="ref-messagesecurityproviderconfigprops"></a><a id="GHCOM00123" name="GHCOM00123"></a></p>

<h4><a id="sthref415" name="sthref415"></a><a id="sthref416" name="sthref416"></a>Propriedades Espec&iacute;ficas para Configura&ccedil;&otilde;es do Provedor de Seguran&ccedil;a da Mensagem</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>As propriedades a seguir est&atilde;o dispon&iacute;veis para uma configura&ccedil;&atilde;o do provedor de seguran&ccedil;a da mensagem</p>
<dl>
<dt><code>server.config</code></dt>
<dd>
<p>O diret&oacute;rio e o nome de um arquivo XML que cont&eacute;m as informa&ccedil;&otilde;es de configura&ccedil;&atilde;o do servidor. O valor default &eacute; domain-dir<code>/config/wss-server-config-1.0.xml</code>.</p>
</dd>
<dt><code>debug</code></dt>
<dd>
<p>Se <code>true</code>, ativa o dump das mensagens de depura&ccedil;&atilde;o do provedor do servidor para o log do servidor. O valor default &eacute; <code>false</code>.</p>
</dd>
<dt><code>dynamic.username.password</code></dt>
<dd>
<p>Se <code>true</code>, assinala o runtime do provedor para coletar o nome de usu&aacute;rio e a senha do<code>CallbackHandler</code> para cada solicita&ccedil;&atilde;o. Se falso, o nome de usu&aacute;rio e a senha de <code>wsse:UsernameToken(s)</code> s&atilde;o coletados uma vez, durante a inicializa&ccedil;&atilde;o do m&oacute;dulo. Essa propriedade s&oacute; &eacute; aplic&aacute;vel para um <code>ClientAuthModule</code>. O valor default &eacute; <code>false</code>.</p>
</dd>
<dt><code>encryption.key.alias</code></dt>
<dd>
<p>Especifica a chave de criptografia usada pelo provedor. A chave &eacute; identificada por seu alias <code>keystore</code>. O valor default &eacute; <code>s1as</code>.</p>
</dd>
<dt><code>signature.key.alias</code></dt>
<dd>
<p>Especifica a chave de assinatura usada pelo provedor. A chave &eacute; identificada por seu alias <code>keystore</code>. O valor default &eacute; <code>s1as</code>.</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
