<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-redeploy" name="ref-redeploy"></a></p>

<h4><a id="sthref303" name="sthref303"></a><a id="sthref304" name="sthref304"></a>Reimplantar Aplica&ccedil;&otilde;es ou M&oacute;dulos</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Reimplantar Aplica&ccedil;&otilde;es ou M&oacute;dulos para reimplantar uma aplica&ccedil;&atilde;o implantada anteriormente.</p>
<p>A p&aacute;gina Reimplantar Aplica&ccedil;&otilde;es ou M&oacute;dulos cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Local</dt>
<dd>
<p>A localiza&ccedil;&atilde;o do novo arquivo compactado da aplica&ccedil;&atilde;o que est&aacute; sendo reimplantada.</p>
<p>As seguintes op&ccedil;&otilde;es especificam de onde o arquivo compactado &eacute; acessado e se &eacute; um arquivo ou um diret&oacute;rio.</p>
<dl>
<dt>Arquivo Encapsulado Cujo Upload Ser&aacute; Feito para o Servidor</dt>
<dd>
<p>O arquivo compactado reside ou &eacute; acessado no computador cliente.</p>
<p>O computador cliente &eacute; o host em que voc&ecirc; exibe o Console de Administra&ccedil;&atilde;o por meio de um browser.</p>
</dd>
<dt>Arquivo Encapsulado ou Diret&oacute;rio Local Acess&iacute;vel no GlassFish Server</dt>
<dd>
<p>O arquivo compactado &eacute; um arquivo que reside no computador servidor ou &eacute; uma aplica&ccedil;&atilde;o n&atilde;o encapsulada, em um diret&oacute;rio explodido.</p>
<p>O computador servidor &eacute; o host que executa o servidor de administra&ccedil;&atilde;o de dom&iacute;nios do GlassFish Server.</p>
</dd>
</dl>
</dd>
<dt>Nome da Aplica&ccedil;&atilde;o</dt>
<dd>
<p>Campo somente para leitura que exibe o nome da aplica&ccedil;&atilde;o que est&aacute; sendo reimplantada.</p>
<p>O nome pode incluir um identificador de vers&atilde;o opcional, que segue o nome e &eacute; separado do nome por dois-pontos (<code>:</code>). Para obter mais informa&ccedil;&otilde;es sobre vers&otilde;es modulares ou da aplica&ccedil;&atilde;o, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> em <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt>Disponibilidade</dt>
<dd>
<p>Se a caixa de sele&ccedil;&atilde;o Ativado estiver selecionada, a alta disponibilidade ser&aacute; ativada para sess&otilde;es Web e para checkpoint e, potencialmente, a passiva&ccedil;&atilde;o do bean da sess&atilde;o stateful (SFSB). Se esta op&ccedil;&atilde;o estiver definida como falsa (default), todo os salvamentos de sess&atilde;o Web e checkpoints SFSB ser&atilde;o desativados para a aplica&ccedil;&atilde;o, a aplica&ccedil;&atilde;o Web ou o m&oacute;dulo EJB especificado. Se esta op&ccedil;&atilde;o estiver definida como verdadeira, a aplica&ccedil;&atilde;o ou o m&oacute;dulo especificado ser&aacute; ativado para alta disponibilidade. Defina essa op&ccedil;&atilde;o como verdadeira apenas se a alta disponibilidade estiver configurada e ativada em n&iacute;veis mais altos, como os n&iacute;veis do servidor e cont&ecirc;iner.</p>
<p>Esta op&ccedil;&atilde;o aparece se clusters ou inst&acirc;ncias de servidores standalone, al&eacute;m da inst&acirc;ncia default do servidor (<code>server</code>), existirem.</p>
</dd>
<dt>Precompilar JSPs</dt>
<dd>
<p>Se essa op&ccedil;&atilde;o for selecionada, arquivos JavaServer Pages (JSP) ser&atilde;o pr&eacute;-compilados. Se esta op&ccedil;&atilde;o for desativada, os arquivos JSP ser&atilde;o compilados durante o runtime, quando forem acessados pela primeira vez. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Executar Verificador</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o for selecionada, os descritores de implanta&ccedil;&atilde;o ser&atilde;o verificados antes da implanta&ccedil;&atilde;o. Se a verifica&ccedil;&atilde;o falhar, a implanta&ccedil;&atilde;o n&atilde;o ser&aacute; realizada. O verificador examina a estrutura e o conte&uacute;do dos descritores de implanta&ccedil;&atilde;o. A verifica&ccedil;&atilde;o de aplica&ccedil;&otilde;es grandes geralmente consome muito tempo. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
<p>Os pacotes do verificador devem ser instalados a partir da Ferramenta de Atualiza&ccedil;&atilde;o, ou uma advert&ecirc;ncia ser&aacute; registrada e esta op&ccedil;&atilde;o ser&aacute; ignorada.</p>
</dd>
<dt>Java Web Start</dt>
<dd>
<p>Se essa op&ccedil;&atilde;o for selecionada, o acesso ao Java Web Start ser&aacute; permitido para um m&oacute;dulo cliente de aplica&ccedil;&atilde;o. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Manter Estado</dt>
<dd>
<p>Essa op&ccedil;&atilde;o controla se as sess&otilde;es Web, as inst&acirc;ncias SFSB e os timers EJB criados persistentemente s&atilde;o retidos entre as reimplanta&ccedil;&otilde;es.</p>
<p>Por default, essa op&ccedil;&atilde;o est&aacute; desativada. Esta op&ccedil;&atilde;o somente &eacute; suportada na inst&acirc;ncia do servidor default, com o nome <code>server</code>. N&atilde;o &eacute; suportada e ignorada em nenhum outro alvo.</p>
<p>Algumas altera&ccedil;&otilde;es em uma aplica&ccedil;&atilde;o entre as reimplanta&ccedil;&otilde;es impedem que este recurso funcione apropriadamente. Por exemplo, n&atilde;o altere o conjunto de vari&aacute;veis da inst&acirc;ncia na classe do bean SFSB.</p>
<p>Para aplica&ccedil;&otilde;es Web, este recurso somente &eacute; aplic&aacute;vel se no arquivo <code>glassfish-web-app.xml</code> o atributo <code>persistence-type</code> do elemento <code>session-manager</code> for <code>file</code>.</p>
<p>Em inst&acirc;ncias do bean de sess&atilde;o stateful, o tipo de persist&ecirc;ncia sem alta disponibilidade est&aacute; definido no servidor (a op&ccedil;&atilde;o Tipo de persist&ecirc;ncia SFSB) e deve estar definido como <code>file</code>, que &eacute; o valor default e recomendado.</p>
<p>Se qualquer sess&atilde;o Web ativa, inst&acirc;ncia SFSB ou timer EJB falhar em ser preservado ou restaurado, <i>nenhum</i> deles estar&aacute; dispon&iacute;vel quando a reimplanta&ccedil;&atilde;o tiver sido conclu&iacute;da. Entretanto, a reimplanta&ccedil;&atilde;o continuar&aacute; e uma advert&ecirc;ncia ser&aacute; registrada em log.</p>
<p>Para preservar dados do estado ativo, o GlassFish Server serializa os dados e os salva na mem&oacute;ria. Para restaurar os dados, o carregador de classe da aplica&ccedil;&atilde;o rec&eacute;m-reimplantada desserializa todos os dados salvos anteriormente.</p>
</dd>
<dt>Preservar Recursos no Escopo da Aplica&ccedil;&atilde;o</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o estiver marcada, os recursos no escopo da aplica&ccedil;&atilde;o ser&atilde;o preservados e restaurados durante a reimplanta&ccedil;&atilde;o. Por default, esta op&ccedil;&atilde;o n&atilde;o est&aacute; marcada.</p>
</dd>
</dl>
<a id="sthref305" name="sthref305"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-appredeploy.html">Para Reimplantar uma Aplica&ccedil;&atilde;o Implantada</a></p>
</li>
<li>
<p><a href="task-applistdeployed.html">Para Exibir uma Lista de Aplica&ccedil;&otilde;es Implantadas</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">Para Implantar uma Aplica&ccedil;&atilde;o Web</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">Para Implantar uma Aplica&ccedil;&atilde;o Enterprise</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">Para Implantar um Cliente da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">Para Implantar um M&oacute;dulo Conector</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">Para Implantar um EJB Jar</a></p>
</li>
<li>
<p><a href="task-appedit.html">Para Editar uma Aplica&ccedil;&atilde;o Implantada</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">Para Exibir Descritores de uma Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-endpoint.html">Para Exibir Informa&ccedil;&otilde;es do Ponto Final de um Web Service</a></p>
</li>
<li>
<p><a href="task-applaunch.html">Para Ativar uma Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">Para Acionar um Cliente da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">Para Fazer Download de Stubs do Cliente da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-apprestart.html">Para Recarregar uma Aplica&ccedil;&atilde;o Implantada</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">Para Exibir Recursos do Escopo da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">Para Modificar Recursos do Escopo da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbcontaineravailability.html">Para Configurar as Defini&ccedil;&otilde;es de Disponibilidade do Cont&ecirc;iner EJB</a></p>
</li>
</ul>
<a id="sthref306" name="sthref306"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00114"><code>implantar</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00217"><code>redeploy</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00148"><code>list-applications</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00185"><code>list-modules</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
