<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-editcertrealm" name="ref-editcertrealm"></a></p>

<h4><a id="sthref357" name="sthref357"></a><a id="sthref358" name="sthref358"></a>Propriedades Espec&iacute;ficas para a Classe <code>CertificateRealm</code></h4>
<a name="BEGIN" id="BEGIN"></a>
<p>O realm <code>certificado</code> suporta autentica&ccedil;&atilde;o SSL. Este realm configura a identidade do usu&aacute;rio no contexto de seguran&ccedil;a GlassFish Server e o preenche com dados de usu&aacute;rio obtidos de certificados do cliente verificados de forma criptografada nos arquivos de armazenamento de confian&ccedil;a e de armazenamento de chaves. Adicione usu&aacute;rios a esses arquivos, usando <code>keytool</code> ou <code>certutil</code>. Para mais informa&ccedil;&otilde;es, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=dsc&amp;id=/app/docs/doc/821-1841#gijrp">Part&nbsp;VII, <i>Security,</i> no <i>The Java EE 6 Tutorial</i></a> .</p>
<p>Com o realm <code>certificate</code>, os cont&ecirc;ineres Java tratam de processamento de autoriza&ccedil;&atilde;o com base no DN (Distinguished Name) do certificado de cada usu&aacute;rio. O DN &eacute; o nome da entidade cuja chave p&uacute;blica &eacute; identificada no certificado. Esse nome usa o padr&atilde;o X.500, portanto, deve ser &uacute;nico na Internet. Para obter mais informa&ccedil;&otilde;es sobre armazenamentos de chaves e armazenamentos confi&aacute;veis, consulte a documenta&ccedil;&atilde;o da ferramenta de chaves (<code><a href="http://java.sun.com/j2se/1.4.2/docs/tooldocs/solaris/keytool.html">http://java.sun.com/j2se/1.4.2/docs/tooldocs/solaris/keytool.html</a></code>).</p>
<p>A propriedade opcional a seguir est&aacute; dispon&iacute;vel no realm <code>certificate</code>.</p>
<dl>
<dt>Designar Grupos</dt>
<dd>
<p>Uma lista de nomes de grupos, separados por v&iacute;rgulas. Todos os clientes que apresentarem certificados v&aacute;lidos ser&atilde;o designados a esses grupos; por exemplo, <code>funcion&aacute;rio, gerente</code>, onde esses forem os nomes de grupos de usu&aacute;rios.</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
