<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-messagesecurityconfigedit" name="ref-messagesecurityconfigedit"></a></p>

<h4><a id="sthref229" name="sthref229"></a>Editar Configura&ccedil;&atilde;o de Seguran&ccedil;a de Mensagem</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Edit Message Security Configuration para ativar a seguran&ccedil;a de mensagens nos provedores.</p>
<p>Para ativar a seguran&ccedil;a de mensagens para pontos finais de Web services implantados no GlassFish Server, voc&ecirc; deve especificar um provedor a ser usado por default no servidor. Se voc&ecirc; ativar a seguran&ccedil;a de mensagens de um provedor default, tamb&eacute;m ser&aacute; necess&aacute;rio permitir que os provedores sejam usados por clientes dos Web Services implantados no GlassFish Server. Informa&ccedil;&otilde;es sobre como ativar os provedores usados pelos clientes s&atilde;o discutidas em <a href="task-enablemesec4appclients.html">Para Ativar a Seguran&ccedil;a de Mensagem para Clientes da Aplica&ccedil;&atilde;o</a>.</p>
<p>Para ativar a seguran&ccedil;a de mensagens de chamadas de Web Services de pontos finais implantados, voc&ecirc; deve especificar um provedor de cliente default. Se voc&ecirc; tiver ativado um provedor cliente default para GlassFish Server, dever&aacute; assegurar que quaisquer servi&ccedil;os chamados de pontos de extremidades implantados no GlassFish Server estejam compativelmente configurados para seguran&ccedil;a de camada de mensagens.</p>
<p>A p&aacute;gina Editar Configura&ccedil;&atilde;o de Seguran&ccedil;a de Mensagem cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Camada de Autentica&ccedil;&atilde;o</dt>
<dd>
<p>A camada de mensagens na qual a autentica&ccedil;&atilde;o &eacute; realizada. Este &eacute; um campo somente para leitura. O valor &eacute; <code>SOAP</code> (da configura&ccedil;&atilde;o de seguran&ccedil;a de mensagem default) ou <code>HttpServlet</code>.</p>
</dd>
<dt>Provedor Default</dt>
<dd>
<p>O provedor do servidor default, se houver. O provedor do servidor default, tamb&eacute;m chamado de provedor default, identifica o provedor do servidor chamado para uma aplica&ccedil;&atilde;o que n&atilde;o identifica um provedor do servidor espec&iacute;fico. As op&ccedil;&otilde;es dispon&iacute;veis s&atilde;o <code>ServerProvider</code>, <code>XWS_ServerProvider</code>, ou nenhuma. Por default, nenhum provedor &eacute; selecionado, de forma que o GlassFish Server n&atilde;o ir&aacute; chamar um provedor de seguran&ccedil;a de mensagens no servidor. Geralmente, o <code>ServerProvider</code> &eacute; selecionado como provedor default.</p>
</dd>
<dt>Provedor Cliente Default</dt>
<dd>
<p>O provedor de cliente default, se houver. O provedor do cliente default identifica o provedor de cliente chamado por uma aplica&ccedil;&atilde;o que n&atilde;o identifica um provedor de cliente espec&iacute;fico. As op&ccedil;&otilde;es dispon&iacute;veis s&atilde;o <code>ClientProvider</code>, <code>XWS_ClientProvider</code>, ou nenhuma. Por default, nenhum provedor &eacute; selecionado, de forma que o GlassFish Server n&atilde;o ir&aacute; chamar um provedor de seguran&ccedil;a de mensagens no cliente. Geralmente, nenhum &eacute; selecionado para o provedor de cliente default. Selecione o <code>ClientProvider</code> para ativar um provedor default e a pol&iacute;tica de prote&ccedil;&atilde;o de mensagens a ser aplicada &agrave;s chamadas dos Web Services que se originam de pontos finais de Web Services implantados no GlassFish Server.</p>
</dd>
</dl>
<a id="GHCOM461" name="GHCOM461"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">Para Configurar os Recursos de GlassFish Server Para Usar pelos Provedores de Seguran&ccedil;a da Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">Para Criar uma Configura&ccedil;&atilde;o de Seguran&ccedil;a de Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">Para Editar uma Configura&ccedil;&atilde;o de Seguran&ccedil;a de Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">Para Deletar uma Configura&ccedil;&atilde;o de Seguran&ccedil;a de Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">Para Criar uma Configura&ccedil;&atilde;o de Seguran&ccedil;a de Provedor</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">Para Editar uma Configura&ccedil;&atilde;o do Provedor de Seguran&ccedil;a da Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">Para Deletar uma Configura&ccedil;&atilde;o do Provedor de Seguran&ccedil;a de Mensagem</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">Para Ativar a Seguran&ccedil;a de Mensagem para Clientes da Aplica&ccedil;&atilde;o</a></p>
</li>
</ul>
<a id="GHCOM462" name="GHCOM462"></a>
<h5>Comandos asadmin Relacionados</h5>
<p>Use o comando <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00226"><code>set</code>(1)</a> para alterar uma configura&ccedil;&atilde;o de seguran&ccedil;a da mensagem.</p>
<ul>
<li>
<p>Para especificar o provedor do servidor default:</p>
<pre>
asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
default_provider=ServerProvider
</pre></li>
<li>
<p>Para especificar o provedor do cliente default:</p>
<pre>
asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
default_client_provider=ClientProvider
</pre></li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
