<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmxconnectoredit" name="ref-jmxconnectoredit"></a></p>

<h4><a id="sthref423" name="sthref423"></a>Editar Conector JMX</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Editar Conector JMX para editar o conector JMX compat&iacute;vel com JSR 360.</p>
<p>A p&aacute;gina Editar Conector JMX cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Nome</dt>
<dd>
<p>O nome do conector JMX. Este &eacute; um campo somente para leitura.</p>
</dd>
<dt>Protocolo JMX</dt>
<dd>
<p>O nome do protocolo que este conector JMX suporta. Este &eacute; um campo somente para leitura.</p>
</dd>
<dt>JMXServiceURL</dt>
<dd>
<p>O URL de Servi&ccedil;o JMX. Este &eacute; um campo somente para leitura.</p>
</dd>
<dt>Seguran&ccedil;a</dt>
<dd>
<p>Se a caixa de sele&ccedil;&atilde;o Ativado for selecionada, a comunica&ccedil;&atilde;o JMX &eacute; criptografada. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Endere&ccedil;o</dt>
<dd>
<p>O endere&ccedil;o IP do servi&ccedil;o de atribui&ccedil;&atilde;o de nomes no qual o stub do servidor do conector JMX est&aacute; registrado. Esta n&atilde;o &eacute; a porta do soquete do servidor que faz a comunica&ccedil;&atilde;o JMX real. Este &eacute; o endere&ccedil;o da interface de rede onde o registro do RMI foi iniciado. Se o seu sistema tem m&uacute;ltiplas interfaces de rede, modifique esse valor para que apenas uma determinada interface seja selecionada. O valor default &eacute; <code>0.0.0.0</code>.</p>
</dd>
<dt>Porta</dt>
<dd>
<p>O n&uacute;mero da porta na qual o servi&ccedil;o de atribui&ccedil;&atilde;o de nomes (registro RMI) fazem de listening de conex&otilde;es do cliente RMI. O &uacute;nico uso deste servi&ccedil;o de atribui&ccedil;&atilde;o de nomes &eacute; fazer download para os stubs de RMI. Se a porta default estiver ocupada, uma porta livre ser&aacute; usada. Os valores legais s&atilde;o 1- 65535. Em sistemas UNIX, criar sockets que fazem listening nas portas 1 - 1024 exige privil&eacute;gios de superusu&aacute;rios. O valor default &eacute; 8686.</p>
</dd>
<dt>Nome do Realm</dt>
<dd>
<p>O nome que representa o realm administrativo especial. Todas as autentica&ccedil;&otilde;es s&atilde;o manuseadas por este realm. O valor default &eacute; <code>admin-realm</code>.</p>
</dd>
<dt>Propriedades Adicionais</dt>
<dd>
<p>Propriedade adicional para o Conector JMX. Diversas propriedades s&atilde;o especificadas por default.</p>
</dd>
</dl>
<a id="sthref424" name="sthref424"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-jmxconnectoredit.html">Para Editar o Conector JMX</a></p>
</li>
<li>
<p><a href="task-jmxconnectorssledit.html">Para Editar as Defini&ccedil;&otilde;es de SSL para o Conector JMX</a></p>
</li>
</ul>
<a id="sthref425" name="sthref425"></a>
<h5>Comandos asadmin Relacionados</h5>
<p>Nenhum.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
