<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jaccprovidernew" name="ref-jaccprovidernew"></a><a id="GHCOM00115" name="GHCOM00115"></a></p>

<h4><a id="sthref392" name="sthref392"></a>Novo Provedor JACC</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina de Novo Provedor de JACC para criar um novo provedor de JSR-115/196 compat&iacute;vel que possa ser usado por m&oacute;dulos de autoriza&ccedil;&atilde;o de terceiros para aplica&ccedil;&otilde;es que estejam sendo executadas no GlassFish Server. O provedor de JACC &eacute; criado como um elemento <code>jacc-provider</code> dentro do elemento <code>security-service</code> no arquivo <code>domain.xml</code> do dom&iacute;nio.</p>
<p>A instala&ccedil;&atilde;o default do &amp;ProductName inclui dois provedores de JACC, com o nome <code>default</code> e <code>simple</code>. Todos os novos provedores de JACC criados s&atilde;o somados a estes dois provedores default. Os provedores de JACC do GlassFish Server default implementam um mecanismo simples de autoriza&ccedil;&atilde;o baseado em arquivo que est&aacute; em conformidade com a especifica&ccedil;&atilde;o JACC.</p>
<p>Todos os provedores de JACC do GlassFish Server devem usar a Autentica&ccedil;&atilde;o Java e APIs de JAAS. O JAAS ativa os servi&ccedil;os para autenticar e fazer cumprir os controles de acesso dos usu&aacute;rios. O JASS implementa a vers&atilde;o de tecnologia Java do framework Pluggable Authentication Module (PAM) padr&atilde;o.</p>
<p>O JSR 196 permite desenvolver plug-ins em camadas diferentes. &Eacute; poss&iacute;vel definir plug-ins que alterem a forma como o novo mecanismo de autentica&ccedil;&atilde;o &eacute; configurado, como <code>AuthConfigProvider</code> e <code>AuthConfigFactory</code>. Tamb&eacute;m &eacute; poss&iacute;vel definir os novos mecanismos de autentica&ccedil;&atilde;o, como <code>ServerAuthModule</code> e <code>ClientAuthModule</code>.</p>
<p>A p&aacute;gina Novo Provedor JACC cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Nome</dt>
<dd>
<p>O nome do provedor JACC. Este nome &eacute; utilizado para fazer refer&ecirc;ncia ao elemento <code>jacc-provider</code> no <code>domain.xml</code>.</p>
</dd>
<dt>Configura&ccedil;&atilde;o da Pol&iacute;tica</dt>
<dd>
<p>Nome de classe totalmente qualificado do <code>javax.security.jacc.PolicyConfigurationFactory.provider</code> que implementa o <code>javax.security.jacc.PolicyConfigurationFactory</code> espec&iacute;fico do provedor.</p>
</dd>
<dt>Provedor de Pol&iacute;tica</dt>
<dd>
<p>Nome de classe totalmente qualificado do <code>javax.security.jacc.policy.provider</code> que implementa o <code>java.security.Policy</code>.</p>
</dd>
<dt>Propriedades Adicionais</dt>
<dd>
<p>Propriedades adicionais do provedor JACC. Para obter uma descri&ccedil;&atilde;o das propriedades adicionais que est&atilde;o dispon&iacute;veis para provedores JACC, consulte <a href="ref-jaccproviderprop.html">Propriedades Espec&iacute;ficas para Provedores JACC</a>.</p>
</dd>
</dl>
<a id="sthref393" name="sthref393"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-jaccprovidernew.html">Para Criar um Provedor JACC</a></p>
</li>
<li>
<p><a href="task-jaccprovideredit.html">Para Editar um Provedor JACC</a></p>
</li>
<li>
<p><a href="task-jaccproviderdelete.html">Para Deletar um Provedor JACC</a></p>
</li>
</ul>
<a id="sthref394" name="sthref394"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00034"><code>create-jacc-provider</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00086"><code>delete-jacc-provider</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00171"><code>list-jacc-providers</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
