<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-generaltab" name="ref-generaltab"></a><a id="GHCOM00058" name="GHCOM00058"></a></p>

<h4><a id="sthref232" name="sthref232"></a><a id="sthref233" name="sthref233"></a>Informa&ccedil;&otilde;es Gerais</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>O GlassFish Server cria uma inst&acirc;ncia de servidor de aplica&ccedil;&otilde;es chamada <code>server</code> no momento da instala&ccedil;&atilde;o. &Eacute; poss&iacute;vel deletar a inst&acirc;ncia de servidor e criar uma nova inst&acirc;ncia com um nome diferente, se voc&ecirc; preferir.</p>
<p>Cada inst&acirc;ncia de GlassFish Server tem sua pr&oacute;pria configura&ccedil;&atilde;o Java, recursos Java, &aacute;reas de implanta&ccedil;&atilde;o de aplica&ccedil;&otilde;es e defini&ccedil;&otilde;es de configura&ccedil;&atilde;o do servidor. As altera&ccedil;&otilde;es em uma inst&acirc;ncia do servidor de aplica&ccedil;&otilde;es n&atilde;o t&ecirc;m efeito em outras inst&acirc;ncias do servidor de aplica&ccedil;&otilde;es. &Eacute; poss&iacute;vel ter uma inst&acirc;ncia do servidor de aplica&ccedil;&otilde;es dentro de um dom&iacute;nio administrativo.</p>
<p>Para muitos usu&aacute;rios, uma inst&acirc;ncia do servidor de aplica&ccedil;&otilde;es &eacute; suficiente para atender &agrave;s suas necessidades. Entretanto, dependendo do seu ambiente, &eacute; poss&iacute;vel criar uma ou mais inst&acirc;ncias do servidor de aplica&ccedil;&otilde;es. Por exemplo, em um ambiente de desenvolvimento, &eacute; poss&iacute;vel utilizar diferentes inst&acirc;ncias do servidor de aplica&ccedil;&otilde;es para testar diferentes configura&ccedil;&otilde;es do GlassFish Server ou para comparar e testar diferentes implanta&ccedil;&otilde;es de aplica&ccedil;&otilde;es. Como &eacute; poss&iacute;vel adicionar ou deletar facilmente uma inst&acirc;ncia do servidor de aplica&ccedil;&otilde;es, voc&ecirc; pode utiliz&aacute;-las para criar &aacute;reas tempor&aacute;rias de "sandbox" para experimenta&ccedil;&atilde;o durante o desenvolvimento.</p>
<p>Al&eacute;m disso, para cada inst&acirc;ncia do servidor de aplica&ccedil;&otilde;es, voc&ecirc; pode tamb&eacute;m criar servidores virtuais. Dentro de uma &uacute;nica inst&acirc;ncia do servidor de aplica&ccedil;&otilde;es instalada, voc&ecirc; pode oferecer nomes de dom&iacute;nio, Endere&ccedil;os IP e alguns recursos de administra&ccedil;&atilde;o a empresas ou indiv&iacute;duos. Para os usu&aacute;rios, &eacute; quase como se tivessem seu pr&oacute;prio servidor web, sem o hardware e a manuten&ccedil;&atilde;o b&aacute;sica do servidor. Esses servidores virtuais n&atilde;o ultrapassam inst&acirc;ncias do servidor de aplica&ccedil;&otilde;es. Para obter mais informa&ccedil;&otilde;es sobre servidores virtuais, consulte <a href="ref-serverinstjvmgeneral.html">Defini&ccedil;&otilde;es Gerais de JVM</a>.</p>
<p>Em implanta&ccedil;&otilde;es operacionais, para diversas finalidades, voc&ecirc; pode usar servidores virtuais em vez de v&aacute;rias inst&acirc;ncias do servidor de aplica&ccedil;&otilde;es. No entanto, se os servidores virtuais n&atilde;o atenderem &agrave;s suas necessidades, voc&ecirc; tamb&eacute;m poder&aacute; usar v&aacute;rias inst&acirc;ncias do servidor de aplica&ccedil;&otilde;es.</p>
<p>Uma inst&acirc;ncia de GlassFish Server n&atilde;o &eacute; iniciada automaticamente. Depois que voc&ecirc; iniciar uma inst&acirc;ncia, ela ser&aacute; executada at&eacute; que voc&ecirc; a interrompa. Quando voc&ecirc; interrompe uma inst&acirc;ncia do servidor de aplica&ccedil;&otilde;es, ela para de aceitar novas conex&otilde;es e, em seguida, aguarda a conclus&atilde;o de todas as conex&otilde;es pendentes. Se sua m&aacute;quina falhar ou ficar off-line, o servidor &eacute; fechado e quaisquer solicita&ccedil;&otilde;es que ele estivesse atendendo poder&atilde;o ser perdidas.</p>
<p>Use a p&aacute;gina Informa&ccedil;&otilde;es Gerais para verificar as defini&ccedil;&otilde;es do GlassFish Server e para exibir os dados do Java Virtual Machine.</p>
<p>A p&aacute;gina Informa&ccedil;&otilde;es Gerais cont&eacute;m as seguintes informa&ccedil;&otilde;es.</p>
<dl>
<dt>Bot&atilde;o Interromper</dt>
<dd>
<p>Clique no bot&atilde;o Interromper para interromper o GlassFish Server.</p>
</dd>
<dt>Bot&atilde;o Reiniciar</dt>
<dd>
<p>Clique no bot&atilde;o Reiniciar para iniciar novamente o GlassFish Server.</p>
</dd>
<dt>Bot&atilde;o Exibir Arquivos de Log.</dt>
<dd>
<p>Clique no bot&atilde;o Visualizar Arquivos de Log para exibir arquivos de log para um GlassFish Server inst&acirc;ncia ou cluster.</p>
</dd>
<dt>Bot&atilde;o Rotacionar Log</dt>
<dd>
<p>Clique no bot&atilde;o Rotacionar Log para realizar a rota&ccedil;&atilde;o do arquivo de log do Servidor de Administra&ccedil;&atilde;o (com o nome <code>server</code>).</p>
</dd>
<dt>Bot&atilde;o Recuperar Transa&ccedil;&atilde;o</dt>
<dd>
<p>Clique no bot&atilde;o Recuperar Transa&ccedil;&atilde;o para recuperar transa&ccedil;&otilde;es para o Servidor de Administra&ccedil;&atilde;o (com o nome <code>server</code>) na p&aacute;gina <a href="ref-recovertransactions.html">Recuperar Transa&ccedil;&otilde;es</a>.</p>
</dd>
<dt>Bot&atilde;o Administra&ccedil;&atilde;o Segura</dt>
<dd>
<p>Clique no bot&atilde;o de Administra&ccedil;&atilde;o Segura para ativar ou desativar a administra&ccedil;&atilde;o segura na p&aacute;gina <a href="ref-securityadmin.html">Administra&ccedil;&atilde;o Segura</a>.</p>
</dd>
<dt>Nome</dt>
<dd>
<p>O nome do servidor atual.</p>
</dd>
<dt>Status</dt>
<dd>
<p>O status atual da inst&acirc;ncia do servidor. O servidor pode estar interrompido, iniciado ou em execu&ccedil;&atilde;o.</p>
</dd>
<dt>Tempo de Funcionamento</dt>
<dd>
<p>O n&uacute;mero de horas e minutos que a inst&acirc;ncia do servidor est&aacute; em execu&ccedil;&atilde;o continuamente. Esse &eacute; somente para leitura.</p>
</dd>
<dt>Balanceador de Carga HTTP</dt>
<dd>
<p>O nome do balanceador de carga, se estiver ativado para a inst&acirc;ncia do servidor.</p>
</dd>
<dt>JVM</dt>
<dd>
<p>Se voc&ecirc; clicar em Relat&oacute;rio da JVM, ser&aacute; aberta uma janela separada que exibe relat&oacute;rios sobre a Java Virtual Machine, incluindo um relat&oacute;rio de resumo, um relat&oacute;rio de gerenciamento de mem&oacute;ria e de coleta de erros,um relat&oacute;rio de carregamento de classe e um dump de threads atuais.</p>
</dd>
<dt>Diret&oacute;rio de Configura&ccedil;&atilde;o</dt>
<dd>
<p>O diret&oacute;rio localizado na m&aacute;quina host, que cont&eacute;m arquivos de configura&ccedil;&atilde;o; por exemplo, <code>domain.xml</code>.</p>
</dd>
<dt>Vers&atilde;o Instalada</dt>
<dd>
<p>O identificador da vers&atilde;o do produto.</p>
</dd>
<dt>Administra&ccedil;&atilde;o Segura</dt>
<dd>
<p>O status atual da administra&ccedil;&atilde;o segura. Valores poss&iacute;veis s&atilde;o Ativado ou N&atilde;o-Ativado</p>
</dd>
<dt>Depura&ccedil;&atilde;o</dt>
<dd>
<p>Identifica se a depura&ccedil;&atilde;o est&aacute; ativada. Se a depura&ccedil;&atilde;o estiver ativada, o n&uacute;mero de porta tamb&eacute;m ser&aacute; exibido.</p>
</dd>
<dt>Porta(s) HTTP</dt>
<dd>
<p>As portas configuradas atualmente para solicita&ccedil;&otilde;es e respostas HTTP.</p>
</dd>
<dt>Porta(s) IIOP</dt>
<dd>
<p>As portas configuradas atualmente para solicita&ccedil;&otilde;es e respostas IIOP.</p>
</dd>
</dl>
<a id="sthref234" name="sthref234"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-generaltab.html">Para Exibir Informa&ccedil;&otilde;es Gerais do DAS</a></p>
</li>
<li>
<p><a href="task-logviewer.html">Para Exibir Arquivos de Log do DAS</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
