<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-monitoring" name="ref-monitoring"></a></p>

<h4><a id="sthref188" name="sthref188"></a>Monitoramento</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Monitoramento para configurar o monitoramento e exibir dados de monitoramento para inst&acirc;ncias do servidor clusterizadas e n&atilde;o clusterizadas.</p>
<p>Para cada inst&acirc;ncia do servidor, as seguintes informa&ccedil;&otilde;es s&atilde;o fornecidas.</p>
<dl>
<dt>Nome da Inst&acirc;ncia</dt>
<dd>
<p>O nome da inst&acirc;ncia do servidor. Clique no nome da inst&acirc;ncia para ir para a p&aacute;gina Informa&ccedil;&otilde;es Gerais para a inst&acirc;ncia.</p>
</dd>
<dt>Nome do Cluster</dt>
<dd>
<p>O nome do cluster ao qual a inst&acirc;ncia do servi&ccedil;o pertence, se for uma inst&acirc;ncia clusterizada. Clique no nome do cluster para ir para a p&aacute;gina Informa&ccedil;&otilde;es Gerais para o cluster.</p>
</dd>
<dt>A&ccedil;&atilde;o</dt>
<dd>
<p>Links que permitem executar as seguintes opera&ccedil;&otilde;es nas inst&acirc;ncias do servidor.</p>
<dl>
<dt>Configurar Monitoramento</dt>
<dd>
<p>Exibe a p&aacute;gina de Servi&ccedil;o de Monitoramento para a configura&ccedil;&atilde;o do cluster ou da inst&acirc;ncia standalone.</p>
</dd>
</dl>
</dd>
<dt>Exibir Dados de Monitoramento</dt>
<dd>
<p>Links que permitem exibir os seguintes tipos de dados de monitoramento para inst&acirc;ncias do servidor.</p>
<dl>
<dt>Aplica&ccedil;&atilde;o</dt>
<dd>
<p>Exibe a p&aacute;gina Monitoramento da Aplica&ccedil;&atilde;o para a inst&acirc;ncia do servidor.</p>
</dd>
<dt>Servidor</dt>
<dd>
<p>Exibe a p&aacute;gina de Monitoramento de Servidor para a inst&acirc;ncia do servidor.</p>
</dd>
<dt>Recursos</dt>
<dd>
<p>Exibe a p&aacute;gina de Monitoramento de Recursos para a inst&acirc;ncia do servidor.</p>
</dd>
</dl>
</dd>
</dl>
<a id="GHCOM399" name="GHCOM399"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-confmonitor.html">Para Configurar o Servi&ccedil;o de Monitoramento</a></p>
</li>
<li>
<p><a href="task-appmonitoringdata.html">Para Exibir Dados de Monitoramento da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-servermonitoringdata.html">Para Exibir Dados de Monitoramento do Servidor</a></p>
</li>
<li>
<p><a href="task-resourcemonitoringdata.html">Para Exibir Dados de Monitoramento do Recurso</a></p>
</li>
</ul>
<a id="GHCOM400" name="GHCOM400"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00128"><code>enable-monitoring</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00120"><code>disable-monitoring</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00212"><code>monitor</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
