<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-serverinstappsconfig" name="ref-serverinstappsconfig"></a><a id="GHCOM00053" name="GHCOM00053"></a></p>

<h4><a id="sthref212" name="sthref212"></a><a id="sthref213" name="sthref213"></a><a id="sthref214" name="sthref214"></a><a id="sthref215" name="sthref215"></a><a id="sthref216" name="sthref216"></a>Configura&ccedil;&atilde;o das Aplica&ccedil;&otilde;es</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Configura&ccedil;&atilde;o de Aplica&ccedil;&otilde;es para definir as propriedades que ajudar&atilde;o a garantir que as altera&ccedil;&otilde;es em aplica&ccedil;&otilde;es implantadas ser&atilde;o detectadas e que as classes modificadas ser&atilde;o recarregadas.</p>
<p>A p&aacute;gina Configura&ccedil;&atilde;o de Aplica&ccedil;&otilde;es cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Carregar Defaults</dt>
<dd>
<p>Bot&atilde;o para restaurar defini&ccedil;&otilde;es para seus valores default. Defini&ccedil;&otilde;es que n&atilde;o tiveram seus valores default alterados.</p>
</dd>
<dt>Recarregar</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o estiver ativada, as classes modificadas ser&atilde;o recarregadas dinamicamente. O servidor verifica periodicamente se h&aacute; altera&ccedil;&otilde;es no diret&oacute;rio de implanta&ccedil;&atilde;o e reimplanta a aplica&ccedil;&atilde;o, autom&aacute;tica e dinamicamente, com as altera&ccedil;&otilde;es. Isso &eacute; &uacute;til em um ambiente de desenvolvimento, pois permite testar rapidamente as altera&ccedil;&otilde;es de c&oacute;digos. Em um ambiente de produ&ccedil;&atilde;o, no entanto, o recarregamento din&acirc;mico pode prejudicar o desempenho. Al&eacute;m disso, sempre que ocorre um recarregamento, as sess&otilde;es nesse tempo de transi&ccedil;&atilde;o se tornam inv&aacute;lidas. O cliente deve reiniciar a sess&atilde;o. Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</dd>
<dt>Intervalo de Sondagem de Recarga</dt>
<dd>
<p>Identifica com que frequ&ecirc;ncia o servidor deve verificar altera&ccedil;&otilde;es de c&oacute;digo nos m&oacute;dulos e aplica&ccedil;&otilde;es implantados. O valor default &eacute; 2.</p>
</dd>
<dt>Time-out para Sess&atilde;o de Admin</dt>
<dd>
<p>Identifica o n&uacute;mero de minutos de inatividade que antecede o time-out do Console de Administra&ccedil;&atilde;o, e voc&ecirc; precisa fazer log-in novamente. O valor default &eacute; 60.</p>
</dd>
<dt>Implanta&ccedil;&atilde;o Autom&aacute;tica</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o estiver ativada, as aplica&ccedil;&otilde;es no diret&oacute;rio de implanta&ccedil;&atilde;o autom&aacute;tica ser&atilde;o implantadas dessa forma. Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</dd>
<dt>Intervalo de Sondagem para Implanta&ccedil;&atilde;o Autom&aacute;tica</dt>
<dd>
<p>Especifica com que frequ&ecirc;ncia o servidor deve verificar o diret&oacute;rio de implanta&ccedil;&atilde;o autom&aacute;tica quanto a altera&ccedil;&otilde;es em aplica&ccedil;&otilde;es ou m&oacute;dulos. A altera&ccedil;&atilde;o do intervalo de sondagem n&atilde;o afeta o tempo destinado &agrave; implanta&ccedil;&atilde;o de uma aplica&ccedil;&atilde;o ou m&oacute;dulo. O valor default &eacute; 2.</p>
</dd>
<dt>Time-out para Tentar Novamente a Implanta&ccedil;&atilde;o Autom&aacute;tica</dt>
<dd>
<p>Especifica o n&uacute;mero de segundos que um arquivo parcialmente copiado pode permanecer inalterado em termos de tamanho antes que ocorra um erro. O valor default &eacute; 4.</p>
<p>Se um arquivo for copiado lentamente no diret&oacute;rio de implanta&ccedil;&atilde;o autom&aacute;tica, esse arquivo poder&aacute; ser exibido antes que todo o arquivo seja copiado. Como resultado, a tentativa de implant&aacute;-lo automaticamente falhar&aacute;. Se uma tentativa de implanta&ccedil;&atilde;o autom&aacute;tica de uma aplica&ccedil;&atilde;o falhar por esse motivo, o GlassFish Server tentar&aacute; implantar a aplica&ccedil;&atilde;o novamente. Se o tamanho do arquivo parcialmente copiado permanecer inalterado durante o per&iacute;odo especificado, ocorrer&aacute; um erro.</p>
</dd>
<dt>Diret&oacute;rio de Implanta&ccedil;&atilde;o Autom&aacute;tica</dt>
<dd>
<p>Identifica o diret&oacute;rio para monitorar a implanta&ccedil;&atilde;o autom&aacute;tica de aplica&ccedil;&otilde;es. O valor default &eacute; domain-dir<code>/autodeploy</code>.</p>
</dd>
<dt>Valida&ccedil;&atilde;o do XML</dt>
<dd>
<p>Especifica o tipo de valida&ccedil;&atilde;o do XML a ser realizada nos descritores de implanta&ccedil;&atilde;o padr&atilde;o e do GlassFish Server. O tipo pode ser qualquer um dos seguintes:</p>
<dl>
<dt>Completo</dt>
<dd>
<p>Se a valida&ccedil;&atilde;o do XML falhar, a implanta&ccedil;&atilde;o falhar&aacute;. Esse &eacute; o valor default.</p>
</dd>
<dt>Fazendo Parsing</dt>
<dd>
<p>A implanta&ccedil;&atilde;o ocorreu, apesar dos erros de valida&ccedil;&atilde;o do XML relatados.</p>
</dd>
<dt>Nenhum</dt>
<dd>
<p>N&atilde;o foi realizada nenhuma valida&ccedil;&atilde;o do XML.</p>
</dd>
</dl>
</dd>
<dt>Verificador</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o estiver ativada, o verificador ser&aacute; executado antes da implanta&ccedil;&atilde;o autom&aacute;tica. Se a verifica&ccedil;&atilde;o falhar, a implanta&ccedil;&atilde;o n&atilde;o ser&aacute; realizada. O verificador examina a estrutura e o conte&uacute;do do arquivo. A verifica&ccedil;&atilde;o de aplica&ccedil;&otilde;es grandes geralmente consome muito tempo. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Pr&eacute;-compilar</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o estiver ativada, arquivos do JavaServer Pages (JSP) ser&atilde;o pr&eacute;-compilados. Se esta op&ccedil;&atilde;o for desativada, os arquivos JSP ser&atilde;o compilados durante o runtime, quando forem acessados pela primeira vez. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Propriedades Adicionais</dt>
<dd>
<p>Propriedades adicionais das aplica&ccedil;&otilde;es. O GlassFish Server n&atilde;o define nenhuma propriedade adicional para as aplica&ccedil;&otilde;es.</p>
</dd>
</dl>
<a id="sthref217" name="sthref217"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-setadvanceappconfig.html">Para Definir a Configura&ccedil;&atilde;o de Aplica&ccedil;&otilde;es</a></p>
</li>
<li>
<p><a href="task-setadvancedomainattributes.html">Para Definir os Atributos de Dom&iacute;nio</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
