<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-serverinstjvmpathsettings" name="ref-serverinstjvmpathsettings"></a></p>

<h4><a id="sthref326" name="sthref326"></a>Defini&ccedil;&otilde;es de Caminho da JVM</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Defini&ccedil;&otilde;es de Caminho da JVM para configurar o caminho da biblioteca nativa. O caminho da biblioteca nativa &eacute; uma concatena&ccedil;&atilde;o dos seguintes caminhos:</p>
<ul>
<li>
<p>O prefixo do caminho da biblioteca nativa</p>
</li>
<li>
<p>O caminho do servidor para suas bibliotecas nativas (ou seja, as-install<code>/lib</code>)</p>
</li>
<li>
<p>Os diret&oacute;rios da biblioteca nativa de 64-bit, se for aplic&aacute;vel</p>
</li>
<li>
<p>O valor da vari&aacute;vel <code>java.library.path</code> para a JVM, usada para iniciar o GlassFish Server (isso &eacute; diferente entre os sistemas operacionais)</p>
</li>
<li>
<p>Qualquer caminho especificado na <a href="ref-serverinstjvmprofiler.html">Defini&ccedil;&otilde;es do Gerador de Perfil JVM</a> p&aacute;gina, se o gerador de perfis estiver ativado</p>
</li>
<li>
<p>O sufixo do caminho da biblioteca nativa</p>
</li>
</ul>
<p>Outras defini&ccedil;&otilde;es s&atilde;o mostradas como valores somente para leitura para dom&iacute;nios que tiveram upgrade de uma vers&atilde;o anterior do GlassFish Server. Elas n&atilde;o s&atilde;o suportadas na release v3.</p>
<p>A p&aacute;gina Defini&ccedil;&otilde;es de Caminho da JVM cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Classpath do Ambiente</dt>
<dd>
<p>Se a caixa de sele&ccedil;&atilde;o Ignorar estiver marcada, a vari&aacute;vel de ambiente <code>CLASSPATH</code> ser&aacute; ignorada. A vari&aacute;vel de ambiente <code>CLASSPATH</code> &eacute; conveniente para tutoriais b&aacute;sicos de programa&ccedil;&atilde;o, mas n&atilde;o &eacute; recomendada para ambientes empresariais. Este &eacute; um campo somente para leitura.</p>
</dd>
<dt>Classpath do Sistema</dt>
<dd>
<p>O caminho para as classes em seu sistema. Este &eacute; um campo somente para leitura.</p>
</dd>
<dt>Prefixo de Classpath</dt>
<dd>
<p>Caminhos completos para os arquivos JAR a serem colocados no in&iacute;cio do classpath do servidor, um por linha. Este &eacute; um campo somente para leitura.</p>
</dd>
<dt>Sufixo de Classpath</dt>
<dd>
<p>Caminhos completos para os arquivos JAR a serem acrescentados ao caminho de classe do servidor, um por linha. Este &eacute; um campo somente para leitura.</p>
</dd>
<dt>Prefixo de Caminho da Biblioteca Nativa</dt>
<dd>
<p>Caminhos completos para os arquivos JAR a serem colocados no in&iacute;cio do caminho da biblioteca nativa, um por linha.</p>
</dd>
<dt>Sufixo do Caminho da Biblioteca Nativa</dt>
<dd>
<p>Caminhos completos para os arquivos JAR a serem acrescentados ao caminho da biblioteca nativa, um por linha.</p>
</dd>
</dl>
<a id="sthref327" name="sthref327"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-jvmsettings.html">Para Configurar as Defini&ccedil;&otilde;es Gerais da JVM</a></p>
</li>
<li>
<p><a href="task-jvmpathsettings.html">Para Configurar as Defini&ccedil;&otilde;es de Caminho de JVM</a></p>
</li>
<li>
<p><a href="task-jvmoptions.html">Para Configurar as Op&ccedil;&otilde;es JVM</a></p>
</li>
<li>
<p><a href="task-securitymanagerdisable.html">Para Desativar o Gerenciador de Seguran&ccedil;a</a></p>
</li>
<li>
<p><a href="task-jvmprofilersettings.html">Para Configurar as Defini&ccedil;&otilde;es do Gerador de Perfil JVM</a></p>
</li>
</ul>
<a id="sthref328" name="sthref328"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00042"><code>create-jvm-options</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00094"><code>delete-jvm-options</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00180"><code>list-jvm-options</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00050"><code>create-profiler</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00102"><code>delete-profiler</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
