<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmxconnectorssledit" name="ref-jmxconnectorssledit"></a></p>

<h4><a id="sthref426" name="sthref426"></a><a id="sthref427" name="sthref427"></a><a id="sthref428" name="sthref428"></a>SSL</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina SSL para modificar as defini&ccedil;&otilde;es SSL do conector JMX.</p>
<p>As defini&ccedil;&otilde;es nesta p&aacute;gina tem significado apenas se a seguran&ccedil;a estiver ativada para o conector JMX na p&aacute;gina Editar Conector JMX.</p>
<p>A p&aacute;gina SSL cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>SSL3</dt>
<dd>
<p>Se a caixa de sele&ccedil;&atilde;o estiver marcada, o protocolo SSL3 estar&aacute; dispon&iacute;vel para o conector JMX. Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</dd>
<dt>TLS</dt>
<dd>
<p>Se a caixa de sele&ccedil;&atilde;o estiver marcada, o protocolo TLS estar&aacute; dispon&iacute;vel para o conector JMX. Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</dd>
<dt>Autentica&ccedil;&atilde;o do Cliente</dt>
<dd>
<p>Se a caixa de sele&ccedil;&atilde;o estiver marcada, os clientes dever&atilde;o identificar-se para o servidor a cada solicita&ccedil;&atilde;o. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Apelido do Certificado</dt>
<dd>
<p>O apelido do certificado do servidor no banco de dados de certificado ou o token PKCS#11. No certificado, o formato de nome &eacute;<i>tokenname</i><code>:</code><i>nickname</i>. Inclusive o <i>tokenname</i><code>:</code> parte do nome neste atributo &eacute; opcional.</p>
</dd>
<dt>Armazenamento de Chave</dt>
<dd>
<p>O nome do arquivo de armazenamento de chave (por exemplo, <code>keystore.jks</code>).</p>
</dd>
<dt>Algoritmo de Confiabilidade</dt>
<dd>
<p>O nome do algoritmo de gerenciamento confi&aacute;vel (por exemplo, PKIX) a ser utilizado para valida&ccedil;&atilde;o do caminho de certifica&ccedil;&atilde;o.</p>
</dd>
<dt>Tamanho M&aacute;ximo do Certificado</dt>
<dd>
<p>O n&uacute;mero m&aacute;ximo de certificados intermedi&aacute;rios n&atilde;o emitidos automaticamente que podem existir em um caminho de certifica&ccedil;&atilde;o. Esse campo &eacute; usado apenas se o campo Algoritmo de Confiabilidade estiver definido como PKIX. O valor 0 indica que o caminho pode conter somente um certificado. O valor -1 indica que o comprimento do caminho n&atilde;o &eacute; restrito (n&atilde;o existe m&aacute;ximo). A defini&ccedil;&atilde;o de um valor menor que -1 gera uma exce&ccedil;&atilde;o.</p>
</dd>
<dt>Armazenamento Confi&aacute;vel</dt>
<dd>
<p>O nome do arquivo de armazenamento confi&aacute;vel (por exemplo, <code>cacerts.jks</code>).</p>
</dd>
<dt>Conjuntos Criptogr&aacute;ficos</dt>
<dd>
<p>Uma &aacute;rea onde &eacute; poss&iacute;vel adicionar ou remover conjuntos criptogr&aacute;ficos. Se voc&ecirc; n&atilde;o adicionar conjuntos criptogr&aacute;ficos, todos os conjuntos criptogr&aacute;ficos ser&atilde;o usados.</p>
</dd>
</dl>
<a id="sthref429" name="sthref429"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-jmxconnectoredit.html">Para Editar o Conector JMX</a></p>
</li>
<li>
<p><a href="task-jmxconnectorssledit.html">Para Editar as Defini&ccedil;&otilde;es de SSL para o Conector JMX</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
