<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-appedit" name="ref-appedit"></a><a id="GHCOM00069" name="GHCOM00069"></a></p>

<h4><a id="sthref267" name="sthref267"></a>Editar Aplica&ccedil;&atilde;o</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Editar Aplica&ccedil;&atilde;o para modificar uma aplica&ccedil;&atilde;o existente.</p>
<p>A p&aacute;gina Editar Aplica&ccedil;&atilde;o cont&eacute;m algumas ou todas as seguintes op&ccedil;&otilde;es, dependendo do tipo de aplica&ccedil;&atilde;o.</p>
<dl>
<dt>Nome</dt>
<dd>
<p>Campo somente para leitura que exibe o nome da aplica&ccedil;&atilde;o em edi&ccedil;&atilde;o.</p>
<p>O nome pode incluir um identificador de vers&atilde;o opcional, que segue o nome e &eacute; separado do nome por dois-pontos (<code>:</code>). Para obter mais informa&ccedil;&otilde;es sobre vers&otilde;es modulares ou da aplica&ccedil;&atilde;o, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> em <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt>Status</dt>
<dd>
<p>Se a caixa de sele&ccedil;&atilde;o Ativado estiver marcada, a aplica&ccedil;&atilde;o est&aacute; ativada. Por default, essa op&ccedil;&atilde;o est&aacute; selecionada.</p>
</dd>
<dt>Raiz de Contexto</dt>
<dd>
<p>Para aplica&ccedil;&otilde;es Web, especifica o caminho da aplica&ccedil;&atilde;o. No URL da aplica&ccedil;&atilde;o web, a raiz do contexto segue imediatamente o n&uacute;mero da porta (<code>http://</code><i>host</i><code>:</code><i>porta</i><code>/</code><i>context-root</i><code>/</code>). A raiz do contexto deve come&ccedil;ar com uma barra &agrave; direita, por exemplo, <code>/hello</code>.</p>
</dd>
<dt>Disponibilidade</dt>
<dd>
<p>Se a caixa de sele&ccedil;&atilde;o Ativado estiver selecionada, a alta disponibilidade ser&aacute; ativada para sess&otilde;es Web e para checkpoint e, potencialmente, a passiva&ccedil;&atilde;o do bean da sess&atilde;o stateful (SFSB). Se esta op&ccedil;&atilde;o estiver definida como falsa (default), todo os salvamentos de sess&atilde;o Web e checkpoints SFSB ser&atilde;o desativados para a aplica&ccedil;&atilde;o, a aplica&ccedil;&atilde;o Web ou o m&oacute;dulo EJB especificado. Se esta op&ccedil;&atilde;o estiver definida como verdadeira, a aplica&ccedil;&atilde;o ou o m&oacute;dulo especificado ser&aacute; ativado para alta disponibilidade. Defina essa op&ccedil;&atilde;o como verdadeira apenas se a alta disponibilidade estiver configurada e ativada em n&iacute;veis mais altos, como os n&iacute;veis do servidor e cont&ecirc;iner.</p>
<p>Esta op&ccedil;&atilde;o aparece se clusters ou inst&acirc;ncias de servidores standalone, al&eacute;m da inst&acirc;ncia default do servidor (<code>server</code>), existirem.</p>
</dd>
<dt>Servidores Virtuais</dt>
<dd>
<p>Os servidores virtuais associados a esta aplica&ccedil;&atilde;o.</p>
<p>A op&ccedil;&atilde;o Servidores Virtuais aparece somente se a inst&acirc;ncia default do servidor, <code>server</code>, existir. Se os clusters ou outras inst&acirc;ncias de servidores standalone existirem, &eacute; poss&iacute;vel selecionar os servidores virtuais depois da implanta&ccedil;&atilde;o. V&aacute; &agrave; p&aacute;gina Editar Aplica&ccedil;&atilde;o, selecione a guia Alvo e selecione Gerenciar Servidores Virtuais para o alvo desejado.</p>
</dd>
<dt>Java Web Start</dt>
<dd>
<p>(Para alguns tipos de aplica&ccedil;&otilde;es) Se a caixa de sele&ccedil;&atilde;o Ativado estiver selecionada, a aplica&ccedil;&atilde;o usar&aacute; o software Java Web Start. O Java Web Start fornece uma maneira independente de browser de implantar aplica&ccedil;&otilde;es Java a serem executadas em uma M&aacute;quina Virtual Java dedicada.</p>
</dd>
<dt>Descri&ccedil;&atilde;o</dt>
<dd>
<p>Uma breve descri&ccedil;&atilde;o da aplica&ccedil;&atilde;o.</p>
</dd>
<dt>Local</dt>
<dd>
<p>O local da aplica&ccedil;&atilde;o implantada. Este &eacute; um campo somente para leitura.</p>
</dd>
<dt>Ordem de Implanta&ccedil;&atilde;o</dt>
<dd>
<p>A ordem de implanta&ccedil;&atilde;o da aplica&ccedil;&atilde;o.</p>
<p>Aplica&ccedil;&otilde;es com um n&uacute;mero mais baixo s&atilde;o carregadas primeiro na inicializa&ccedil;&atilde;o do servidor. Um aplica&ccedil;&atilde;o com uma ordem de implanta&ccedil;&atilde;o de 102 &eacute; carregada antes de uma de 110. Se uma ordem de implanta&ccedil;&atilde;o n&atilde;o for especificada no tempo uma aplica&ccedil;&atilde;o ser&aacute; implantada, a ordem de implanta&ccedil;&atilde;o default de 100 ser&aacute; designada. Se duas aplica&ccedil;&otilde;es tiverem a mesma ordem de implanta&ccedil;&atilde;o, a aplica&ccedil;&atilde;o que foi implantada primeiro ser&aacute; carregada primeiro. Especificar uma ordem de implanta&ccedil;&atilde;o &eacute; &uacute;til se a aplica&ccedil;&atilde;o tiver depend&ecirc;ncias e deve ser carregada em uma determinada ordem.</p>
</dd>
<dt>Bibliotecas</dt>
<dd>
<p>Os arquivos JAR da biblioteca exigidos pela aplica&ccedil;&atilde;o. Este &eacute; um campo somente para leitura.</p>
</dd>
<dt>M&oacute;dulos e Componentes</dt>
<dd>
<p>Tabela que exibe os nomes dos m&oacute;dulos da aplica&ccedil;&atilde;o e seus respectivos mecanismos. Em um ponto final de Web service, &eacute; poss&iacute;vel selecionar Exibir Ponto Final para exibir a p&aacute;gina Informa&ccedil;&otilde;es do Ponto Final de Web Service. Para um cliente da aplica&ccedil;&atilde;o, voc&ecirc; pode selecionar Acionar para exibir a p&aacute;gina Acionar Cliente da Aplica&ccedil;&atilde;o ou para Fazer Download de Stubs do Cliente para fazer download de stubs do cliente.</p>
</dd>
</dl>
<a id="sthref268" name="sthref268"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-appedit.html">Para Editar uma Aplica&ccedil;&atilde;o Implantada</a></p>
</li>
<li>
<p><a href="task-applistdeployed.html">Para Exibir uma Lista de Aplica&ccedil;&otilde;es Implantadas</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">Para Implantar uma Aplica&ccedil;&atilde;o Web</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">Para Implantar uma Aplica&ccedil;&atilde;o Enterprise</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">Para Implantar um Cliente da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">Para Implantar um M&oacute;dulo Conector</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">Para Implantar um EJB Jar</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">Para Exibir Descritores de uma Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appviewtargets.html">Para Exibir Alvos da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-endpoint.html">Para Exibir Informa&ccedil;&otilde;es do Ponto Final de um Web Service</a></p>
</li>
<li>
<p><a href="task-applaunch.html">Para Ativar uma Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">Para Acionar um Cliente da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">Para Fazer Download de Stubs do Cliente da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appredeploy.html">Para Reimplantar uma Aplica&ccedil;&atilde;o Implantada</a></p>
</li>
<li>
<p><a href="task-apprestart.html">Para Recarregar uma Aplica&ccedil;&atilde;o Implantada</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">Para Exibir Recursos do Escopo da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">Para Modificar Recursos do Escopo da Aplica&ccedil;&atilde;o</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
