<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-configurationsystemproperties" name="ref-configurationsystemproperties"></a></p>

<h4><a id="sthref243" name="sthref243"></a><a id="sthref244" name="sthref244"></a>Propriedades do Sistema</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>A p&aacute;gina Propriedades do Sistema exibe uma lista das propriedades do sistema Java que est&atilde;o definidas na configura&ccedil;&atilde;o nomeada selecionada. Propriedades do sistema Java s&atilde;o especificadas para o acionador da aplica&ccedil;&atilde;o Java por meio da op&ccedil;&atilde;o <code>-D</code> do acionador da aplica&ccedil;&atilde;o Java quando GlassFish Server for iniciado</p>
<p>Estas propriedades definem os valores default das defini&ccedil;&otilde;es da porta de todas as inst&acirc;ncias do GlassFish Server que fazem refer&ecirc;ncia &agrave; configura&ccedil;&atilde;o.</p>
<p>Para obter informa&ccedil;&otilde;es sobre defini&ccedil;&otilde;es de porta predefinida em uma configura&ccedil;&atilde;o, consulte <a href="ref-predefinedconfigsysproperties.html">Propriedades Predefinidas do Sistema</a>.</p>
<p>S&atilde;o exibidas as seguintes informa&ccedil;&otilde;es para cada propriedade:</p>
<dl>
<dt>Nome da Vari&aacute;vel da Inst&acirc;ncia</dt>
<dd>
<p>O nome da propriedade do sistema.</p>
</dd>
<dt>Valor Default</dt>
<dd>
<p>Valor definido para a propriedade na configura&ccedil;&atilde;o nomeada que a inst&acirc;ncia faz refer&ecirc;ncia. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Valores da Inst&acirc;ncia</dt>
<dd>
<p>Um link para a p&aacute;gina <a href="ref-sysinstancevalues.html">Valores da Inst&acirc;ncia</a> para a propriedade.</p>
</dd>
</dl>
<p>A tabela Propriedades Adicionais tamb&eacute;m cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Adicionar Propriedade</dt>
<dd>
<p>Bot&atilde;o para adicionar uma propriedade. Clicar neste bot&atilde;o adiciona uma linha &agrave; tabela Propriedades Adicionais.</p>
</dd>
<dt>Deletar Propriedades</dt>
<dd>
<p>Bot&atilde;o para deletar uma ou mais propriedades selecionadas. Qualquer propriedade deletada retorna ao seu valor default ou, se nenhum valor tiver sido definido, fica com valor indefinido.</p>
</dd>
</dl>
<p>A p&aacute;gina Propriedades do Sistema tamb&eacute;m cont&eacute;m as seguintes op&ccedil;&otilde;es:</p>
<dl>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Reconfigura&ccedil;&atilde;o Din&acirc;mica</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o for ativada, s&atilde;o aplicadas altera&ccedil;&otilde;es na configura&ccedil;&atilde;o das inst&acirc;ncias que fazem refer&ecirc;ncia &agrave; configura&ccedil;&atilde;o sem a necessidade de reiniciar as inst&acirc;ncias.</p>
</dd>
<dt>Clusters e/ou Inst&acirc;ncias Usando esta Configura&ccedil;&atilde;o</dt>
<dd>
<p>Lista dos clusters e das inst&acirc;ncias que fazem refer&ecirc;ncia &agrave; configura&ccedil;&atilde;o com uma indica&ccedil;&atilde;o se cada cluster ou inst&acirc;ncia est&aacute; em execu&ccedil;&atilde;o:</p>
<ul>
<li>
<p>Se o cluster ou a inst&acirc;ncia estiver em execu&ccedil;&atilde;o, uma marca de verifica&ccedil;&atilde;o (&#10003;) ser&aacute; exibida.</p>
</li>
<li>
<p>Se a inst&acirc;ncia ou o cluster for interrompido, um ponto de exclama&ccedil;&atilde;o (<code>!</code>) ser&aacute; exibido.</p>
</li>
</ul>
</dd>
</dl>
<a id="GHCOM478" name="GHCOM478"></a>
<h5>Tarefas Relacionadas</h5>
<p>Para Definir os Valores Default das Propriedades de Configura&ccedil;&atilde;o</p>
<a id="GHCOM479" name="GHCOM479"></a>
<h5>Subcomandos asadmin Equivalentes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00059"><code>create-system-properties</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00110"><code>delete-system-property</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00203"><code>list-system-properties</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
