<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-lifecyclemodulenew" name="ref-lifecyclemodulenew"></a></p>

<h4><a id="sthref312" name="sthref312"></a>Novo M&oacute;dulo do Ciclo de Vida</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Novo M&oacute;dulo do Ciclo de Vida para definir um novo m&oacute;dulo do ciclo de vida.</p>
<p>A p&aacute;gina Novo M&oacute;dulo do Ciclo de Vida cont&eacute;m estas op&ccedil;&otilde;es.</p>
<dl>
<dt>Nome</dt>
<dd>
<p>O nome do m&oacute;dulo do ciclo de vida.</p>
</dd>
<dt>Nome da Classe</dt>
<dd>
<p>O nome totalmente qualificado do arquivo de classes do m&oacute;dulo do ciclo de vida. A classe deve implementar a interface <code>com.sun.appserv.server.LifecycleListener</code>.</p>
</dd>
<dt>Classpath</dt>
<dd>
<p>O classpath do m&oacute;dulo do ciclo de vida. O classpath especifica onde o m&oacute;dulo do ciclo de vida est&aacute; localizado. O valor default &eacute; domain-dir<code>/applications</code>. Se o m&oacute;dulo j&aacute; estiver neste diret&oacute;rio (isto &eacute;, no classpath do servidor), esse campo poder&aacute; ser deixado em branco.</p>
</dd>
<dt>Ordem de Carga</dt>
<dd>
<p>A ordem na qual este m&oacute;dulo do ciclo de vida deve ser carregado na inicializa&ccedil;&atilde;o. Os m&oacute;dulos com valores inteiros menores de ordem de carga s&atilde;o carregados antes. O valor pode variar de 101 at&eacute; o <code>MAXINT</code> do sistema operacional. Valores de 1 a 100 s&atilde;o reservados.</p>
</dd>
<dt>Descri&ccedil;&atilde;o</dt>
<dd>
<p>Uma descri&ccedil;&atilde;o do m&oacute;dulo do ciclo de vida.</p>
</dd>
<dt>Status</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o for selecionada, o m&oacute;dulo do ciclo de vida ser&aacute; ativado. Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</dd>
<dt>No Caso de Falha ao Carregar</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o estiver selecionada, o servidor ser&aacute; submetido a shutdown se o m&oacute;dulo do ciclo de vida n&atilde;o for carregado. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Alvos</dt>
<dd>
<p>Clusters e inst&acirc;ncias standalone do m&oacute;dulo do ciclo de vida. Mova os alvos desejados para a coluna Alvos Selecionados utilizando os bot&otilde;es Adicionar e Adicionar Tudo. Mova os alvos desnecess&aacute;rios para a coluna Alvos Dispon&iacute;veis utilizando os bot&otilde;es Remover e Remover Tudo.</p>
<p>Esta op&ccedil;&atilde;o &eacute; exibida somente se os clusters ou inst&acirc;ncias standalone tiverem sido criados no dom&iacute;nio.</p>
</dd>
</dl>
<a id="sthref313" name="sthref313"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-lifecyclemodulenew.html">Para Criar um M&oacute;dulo do Ciclo de Vida</a></p>
</li>
<li>
<p><a href="task-lifecyclemoduleedit.html">Para Editar um M&oacute;dulo do Ciclo de Vida</a></p>
</li>
<li>
<p><a href="task-lifecyclemoduledelete.html">Para Deletar um M&oacute;dulo de Ciclo de Vida</a></p>
</li>
</ul>
<a id="sthref314" name="sthref314"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00043"><code>create-lifecycle-module</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00181"><code>list-lifecycle-modules</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00095"><code>delete-lifecycle-module</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
