<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-applications" name="ref-applications"></a><a id="GHCOM00068" name="GHCOM00068"></a></p>

<h4><a id="sthref265" name="sthref265"></a>Aplica&ccedil;&otilde;es</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>A p&aacute;gina Aplica&ccedil;&otilde;es exibe uma lista das aplica&ccedil;&otilde;es que est&atilde;o implantadas no GlassFish Server. &Eacute; poss&iacute;vel exibir e gerenciar as aplica&ccedil;&otilde;es implantadas, e voc&ecirc; pode implantar mais aplica&ccedil;&otilde;es.</p>
<p>Para cada aplica&ccedil;&atilde;o, as informa&ccedil;&otilde;es a seguir s&atilde;o mostradas.</p>
<dl>
<dt>Nome</dt>
<dd>
<p>O nome da aplica&ccedil;&atilde;o.</p>
<p>O nome pode incluir um identificador de vers&atilde;o opcional, que segue o nome e &eacute; separado do nome por dois-pontos (<code>:</code>). Para obter mais informa&ccedil;&otilde;es sobre vers&otilde;es modulares ou da aplica&ccedil;&atilde;o, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> em <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt>Ordem de Implanta&ccedil;&atilde;o</dt>
<dd>
<p>A ordem de implanta&ccedil;&atilde;o da aplica&ccedil;&atilde;o.</p>
<p>Aplica&ccedil;&otilde;es com um n&uacute;mero mais baixo s&atilde;o carregadas primeiro na inicializa&ccedil;&atilde;o do servidor. Um aplica&ccedil;&atilde;o com uma ordem de implanta&ccedil;&atilde;o de 102 &eacute; carregada antes de uma de 110. Se uma ordem de implanta&ccedil;&atilde;o n&atilde;o for especificada no tempo uma aplica&ccedil;&atilde;o ser&aacute; implantada, a ordem de implanta&ccedil;&atilde;o default de 100 ser&aacute; designada. Se duas aplica&ccedil;&otilde;es tiverem a mesma ordem de implanta&ccedil;&atilde;o, a aplica&ccedil;&atilde;o que foi implantada primeiro ser&aacute; carregada primeiro. Especificar uma ordem de implanta&ccedil;&atilde;o &eacute; &uacute;til se a aplica&ccedil;&atilde;o tiver depend&ecirc;ncias e deve ser carregada em uma determinada ordem.</p>
</dd>
<dt>Ativado ou Status</dt>
<dd>
<p>Uma marca de sele&ccedil;&atilde;o se a aplica&ccedil;&atilde;o for ativada ou um X se a aplica&ccedil;&atilde;o for desativada, se existir somente a inst&acirc;ncia do servidor default, <code>server</code>.</p>
<p>Se existirem clusters ou outras inst&acirc;ncias de servidores standalone, selecione Ativado em Alvos para exibir os alvos nos quais a aplica&ccedil;&atilde;o est&aacute; implantada.</p>
</dd>
<dt>Mecanismos</dt>
<dd>
<p>Os tipos de cont&ecirc;ineres usados pela aplica&ccedil;&atilde;o. Os tipos de cont&ecirc;ineres podem ser:</p>
<ul>
<li>
<p><code>web</code></p>
</li>
<li>
<p><code>webservices</code></p>
</li>
<li>
<p><code>ejb</code></p>
</li>
<li>
<p><code>connector</code></p>
</li>
<li>
<p><code>appclient</code></p>
</li>
<li>
<p><code>weld</code> (o cont&ecirc;iner para Contextos e Inje&ccedil;&atilde;o de Depend&ecirc;ncia para aplica&ccedil;&otilde;es da Plataforma Java EE)</p>
</li>
</ul>
</dd>
<dt>A&ccedil;&atilde;o</dt>
<dd>
<p>Links para as a&ccedil;&otilde;es que voc&ecirc; pode realizar no componente depois de implant&aacute;-lo: Reimplantar e Recarregar para todos os componentes, Acionar para aplica&ccedil;&otilde;es Web e clientes de aplica&ccedil;&otilde;es e Fazer download de stubs para clientes da aplica&ccedil;&atilde;o;</p>
</dd>
</dl>
<p>A tabela Aplica&ccedil;&otilde;es Implantadas tamb&eacute;m cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Implantar</dt>
<dd>
<p>Bot&atilde;o para implantar uma aplica&ccedil;&atilde;o.</p>
</dd>
<dt>Cancelar Implanta&ccedil;&atilde;o</dt>
<dd>
<p>Bot&atilde;o para cancelar a implanta&ccedil;&atilde;o de uma ou mais aplica&ccedil;&otilde;es selecionadas.</p>
</dd>
<dt>Ativar</dt>
<dd>
<p>Bot&atilde;o para ativar uma ou mais aplica&ccedil;&otilde;es selecionadas, somente se a inst&acirc;ncia default do servidor, <code>server</code>, existir.</p>
</dd>
<dt>Desativar</dt>
<dd>
<p>Bot&atilde;o para desativar um ou mais aplica&ccedil;&otilde;es selecionadas, somente se a inst&acirc;ncia default do servidor, <code>server</code>, existir.</p>
</dd>
<dt>Filtro</dt>
<dd>
<p>Lista drop-down que filtra as aplica&ccedil;&otilde;es por mecanismo.</p>
</dd>
</dl>
<a id="sthref266" name="sthref266"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-applistdeployed.html">Para Exibir uma Lista de Aplica&ccedil;&otilde;es Implantadas</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">Para Implantar uma Aplica&ccedil;&atilde;o Web</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">Para Implantar uma Aplica&ccedil;&atilde;o Enterprise</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">Para Implantar um Cliente da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">Para Implantar um M&oacute;dulo Conector</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">Para Implantar um EJB Jar</a></p>
</li>
<li>
<p><a href="task-appedit.html">Para Editar uma Aplica&ccedil;&atilde;o Implantada</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">Para Exibir Descritores de uma Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appviewtargets.html">Para Exibir Alvos da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-endpoint.html">Para Exibir Informa&ccedil;&otilde;es do Ponto Final de um Web Service</a></p>
</li>
<li>
<p><a href="task-applaunch.html">Para Ativar uma Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">Para Acionar um Cliente da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">Para Fazer Download de Stubs do Cliente da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appredeploy.html">Para Reimplantar uma Aplica&ccedil;&atilde;o Implantada</a></p>
</li>
<li>
<p><a href="task-apprestart.html">Para Recarregar uma Aplica&ccedil;&atilde;o Implantada</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">Para Exibir Recursos do Escopo da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">Para Modificar Recursos do Escopo da Aplica&ccedil;&atilde;o</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
