<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-uc-pkgdetails" name="ref-uc-pkgdetails"></a><a id="GHCOM00137" name="GHCOM00137"></a></p>

<h4><a id="sthref458" name="sthref458"></a>Detalhes do Componente</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>A p&aacute;gina Detalhes do Componente fornece informa&ccedil;&otilde;es detalhadas sobre um componente.</p>
<p>A p&aacute;gina Detalhes do Componente cont&eacute;m estas op&ccedil;&otilde;es:</p>
<dl>
<dt>Voltar</dt>
<dd>
<p>Este bot&atilde;o permite voltar &agrave; p&aacute;gina em que voc&ecirc; selecionou o componente cujos detalhes est&aacute; visualizando.</p>
</dd>
<dt>Nome do Pacote</dt>
<dd>
<p>O nome do pacote em que o componente foi fornecido.</p>
</dd>
<dt>Identificador Exclusivo</dt>
<dd>
<p>O identificador totalmente qualificado do componente, tal como apresentado no reposit&oacute;rio.</p>
</dd>
<dt>Categoria</dt>
<dd>
<p>A categoria de software que &eacute; associada ao componente; por exemplo, Servidores de Aplica&ccedil;&otilde;es, Ferramentas do Sistema e Bancos de Dados. A categoria &eacute; designada pelo autor do componente quando o componente &eacute; criado.</p>
</dd>
<dt>Vers&atilde;o</dt>
<dd>
<p>O n&uacute;mero de vers&atilde;o do pacote em que o componente foi fornecido.</p>
</dd>
<dt>Data da Publica&ccedil;&atilde;o</dt>
<dd>
<p>A data e a hora em que a vers&atilde;o do componente foi publicada no reposit&oacute;rio. Essa data <i>n&atilde;o</i> &eacute; a data e hora em que o componente foi instalado na imagem de instala&ccedil;&atilde;o.</p>
</dd>
<dt>Tamanho Instalado</dt>
<dd>
<p>A quantidade de espa&ccedil;o em disco que a instala&ccedil;&atilde;o do componente consome.</p>
</dd>
<dt>Origem</dt>
<dd>
<p>Para um componente instalado, o nome de <a href="ref-uc-concepts.html#ref-uc-about-repository">Reposit&oacute;rio de Rede</a> de onde o componente foi obtido.</p>
<p>Para um componente add-on ou para uma atualiza&ccedil;&atilde;o, o nome do reposit&oacute;rio de rede de onde o componente deve ser obtido.</p>
</dd>
<dt>Descri&ccedil;&atilde;o</dt>
<dd>
<p>Uma vis&atilde;o geral do componente.</p>
</dd>
</dl>
<a id="sthref459" name="sthref459"></a>
<h5>Tarefas Relacionadas</h5>
<p><a href="task-uc-pkgdetails.html">Para Exibir Informa&ccedil;&otilde;es Detalhadas sobre um Componente</a></p>
<a id="sthref460" name="sthref460"></a>
<h5>Comandos asadmin Relacionados</h5>
<p>Nenhum.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
