<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-messagesecurityproviderconfignew" name="ref-messagesecurityproviderconfignew"></a></p>

<h4><a id="sthref231" name="sthref231"></a>Nova Configura&ccedil;&atilde;o do Provedor</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Nova Configura&ccedil;&atilde;o do Provedor para criar uma nova configura&ccedil;&atilde;o do provedor de seguran&ccedil;a de mensagens.</p>
<p>A p&aacute;gina Nova Configura&ccedil;&atilde;o do Provedor cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>ID do Provedor</dt>
<dd>
<p>O nome do provedor de seguran&ccedil;a de mensagens.</p>
</dd>
<dt>Provedor Default</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o for selecionada, este provedor ser&aacute; o provedor default. O provedor default ser&aacute; chamado para qualquer aplica&ccedil;&atilde;o que n&atilde;o identifique um provedor espec&iacute;fico. Se o provedor for o provedor de cliente default, o provedor de servidor default, ou de ambos, &eacute; determinado pelo Tipo de Provedor.</p>
</dd>
<dt>Tipo de Provedor</dt>
<dd>
<p>Especifica o tipo do provedor. As op&ccedil;&otilde;es dispon&iacute;veis s&atilde;o:</p>
<dl>
<dt><code>client</code></dt>
<dd>
<p>Especifica que o provedor &eacute; o provedor de autentica&ccedil;&atilde;o do cliente.</p>
</dd>
<dt><code>server</code></dt>
<dd>
<p>Especifica que o provedor &eacute; o provedor de autentica&ccedil;&atilde;o do servidor.</p>
</dd>
<dt><code>client-server</code></dt>
<dd>
<p>Especifica que o provedor &eacute; um provedor de autentica&ccedil;&atilde;o do cliente e do servidor.</p>
</dd>
</dl>
</dd>
<dt>Nome da Classe</dt>
<dd>
<p>O nome da classe de implementa&ccedil;&atilde;o Java do provedor. Provedores de autentica&ccedil;&atilde;o do cliente devem implementar a interface <code>com.sun.enterprise.security.jauth.ClientAuthModule</code>. Provedores do servidor devem implementar a interface <code>com.sun.enterprise.security.jauth.ServerAuthModule</code>. Os provedores de cliente-servidor devem implementar as duas interfaces.</p>
</dd>
<dt>Autenticar Origem (para Pol&iacute;tica de Solicita&ccedil;&atilde;o)</dt>
<dd>
<p>O tipo da autentica&ccedil;&atilde;o necess&aacute;ria para a pol&iacute;tica de solicita&ccedil;&atilde;o. A pol&iacute;tica de solicita&ccedil;&atilde;o determina o processamento da solicita&ccedil;&atilde;o que o provedor de autentica&ccedil;&atilde;o realiza. Os campos da pol&iacute;tica de solicita&ccedil;&atilde;o s&atilde;o opcionais, mas se eles n&atilde;o forem especificados, o provedor de autentica&ccedil;&atilde;o n&atilde;o autentica as mensagens solicitadas.</p>
<p>Selecione <code>remetente</code> para especificar a autentica&ccedil;&atilde;o do remetente da camada de mensagens (por exemplo, nome de usu&aacute;rio e senha) das mensagens solicitadas. Selecione <code>conte&uacute;do</code> para especificar autentica&ccedil;&atilde;o de conte&uacute;do (por exemplo, assinatura digital) das mensagens solicitadas. Deixe o campo vazio para n&atilde;o autenticar a origem das solicita&ccedil;&otilde;es. Por default, nenhum tipo de autentica&ccedil;&atilde;o &eacute; selecionado.</p>
<p>Para obter uma descri&ccedil;&atilde;o das a&ccedil;&otilde;es executadas pelos provedores de seguran&ccedil;a da mensagem de SOAP, consulte <a href="ref-configreq-respolicy.html">Configura&ccedil;&otilde;es da Pol&iacute;tica de Solicita&ccedil;&atilde;o e Resposta</a>.</p>
</dd>
<dt>Autenticar Destinat&aacute;rio (para Pol&iacute;tica de Solicita&ccedil;&atilde;o)</dt>
<dd>
<p>Especifica se a autentica&ccedil;&atilde;o do destinat&aacute;rio ocorre antes ou ap&oacute;s a autentica&ccedil;&atilde;o de conte&uacute;do da pol&iacute;tica de solicita&ccedil;&atilde;o.</p>
<p>Selecione <code>before-content</code> ou <code>after-content</code> para solicitar autentica&ccedil;&atilde;o de camada da mensagem do destinat&aacute;rio da mensagem solicitada ao seu remetente (por criptografia XML). Se o valor n&atilde;o for especificado, o default ser&aacute; <code>after-content</code>. As Pol&iacute;ticas s&atilde;o expressas no pedido do remetente da mensagem, portanto <code>after-content</code> significa que o destinat&aacute;rio da mensagem descriptografa a mensagem antes de validar a assinatura.</p>
</dd>
<dt>Autenticar Origem (para Pol&iacute;tica de Resposta)</dt>
<dd>
<p>O tipo da autentica&ccedil;&atilde;o necess&aacute;ria para a pol&iacute;tica de resposta. A pol&iacute;tica de resposta determina o processamento da resposta que o provedor de autentica&ccedil;&atilde;o realiza. Os campos da pol&iacute;tica de resposta s&atilde;o opcionais, mas se eles n&atilde;o forem especificados, nenhuma autentica&ccedil;&atilde;o ser&aacute; aplicada &agrave;s mensagens de resposta.</p>
<p>Selecione <code>remetente</code> para especificar a autentica&ccedil;&atilde;o do remetente da camada de mensagens (por exemplo, nome de usu&aacute;rio e senha) das mensagens de resposta. Selecione <code>conte&uacute;do</code> para especificar autentica&ccedil;&atilde;o de conte&uacute;do (por exemplo, assinatura digital) das mensagens de resposta. Deixe o campo em branco para n&atilde;o autenticar as origens de resposta. Por default, nenhum tipo de autentica&ccedil;&atilde;o &eacute; selecionado.</p>
<p>Para obter uma descri&ccedil;&atilde;o das a&ccedil;&otilde;es executadas pelos provedores de seguran&ccedil;a da mensagem de SOAP, consulte <a href="ref-configreq-respolicy.html">Configura&ccedil;&otilde;es da Pol&iacute;tica de Solicita&ccedil;&atilde;o e Resposta</a>.</p>
</dd>
<dt>Autenticar Destinat&aacute;rio (para Pol&iacute;tica de Resposta)</dt>
<dd>
<p>Especifica se a autentica&ccedil;&atilde;o do destinat&aacute;rio ocorre antes ou ap&oacute;s a autentica&ccedil;&atilde;o de conte&uacute;do da pol&iacute;tica de resposta.</p>
<p>Selecione <code>before-content</code> ou <code>after-content</code> para definir a autentica&ccedil;&atilde;o de camada da mensagem do destinat&aacute;rio da mensagem de resposta ao seu remetente (por criptografia XML). Se o valor n&atilde;o for especificado, o default ser&aacute; <code>after-content</code>. As Pol&iacute;ticas s&atilde;o expressas no pedido do remetente da mensagem, portanto <code>after-content</code> significa que o destinat&aacute;rio da mensagem descriptografa a mensagem antes de validar a assinatura.</p>
</dd>
<dt>Propriedades Adicionais</dt>
<dd>
<p>Propriedades adicionais para configura&ccedil;&atilde;o do provedor de seguran&ccedil;a de mensagens. Para obter uma descri&ccedil;&atilde;o das propriedades adicionais dispon&iacute;veis para configura&ccedil;&otilde;es do provedor, consulte <a href="ref-messagesecurityproviderconfigprops.html">Propriedades Espec&iacute;ficas para Configura&ccedil;&otilde;es do Provedor de Seguran&ccedil;a da Mensagem</a>.</p>
</dd>
</dl>
<a id="GHCOM465" name="GHCOM465"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">Para Configurar os Recursos de GlassFish Server Para Usar pelos Provedores de Seguran&ccedil;a da Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">Para Criar uma Configura&ccedil;&atilde;o de Seguran&ccedil;a de Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">Para Editar uma Configura&ccedil;&atilde;o de Seguran&ccedil;a de Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">Para Deletar uma Configura&ccedil;&atilde;o de Seguran&ccedil;a de Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">Para Criar uma Configura&ccedil;&atilde;o de Seguran&ccedil;a de Provedor</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">Para Editar uma Configura&ccedil;&atilde;o do Provedor de Seguran&ccedil;a da Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">Para Deletar uma Configura&ccedil;&atilde;o do Provedor de Seguran&ccedil;a de Mensagem</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">Para Ativar a Seguran&ccedil;a de Mensagem para Clientes da Aplica&ccedil;&atilde;o</a></p>
</li>
</ul>
<a id="GHCOM466" name="GHCOM466"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00045"><code>create-message-security-provider</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00184"><code>list-message-security-providers</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00097"><code>delete-message-security-provider</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
