<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-serverinstjvmgeneral" name="ref-serverinstjvmgeneral"></a></p>

<h4><a id="sthref189" name="sthref189"></a>Defini&ccedil;&otilde;es Gerais de JVM</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>O Java Virtual Machine (JVM) possibilita que c&oacute;digos de bytes de Java sejam executados em uma m&aacute;quina f&iacute;sica. O ajuste das defini&ccedil;&otilde;es de JVM melhora o desempenho e evita erros de aloca&ccedil;&atilde;o de mem&oacute;ria.</p>
<p>O Java Virtual Machine est&aacute; inclu&iacute;do na Java Platform, Standard Edition (plataforma Java SE), que &eacute; exigida pelo GlassFish Server. Defini&ccedil;&otilde;es de JVM incorretas impedir&atilde;o que o servidor seja executado, portanto, tenha cuidado ao alterar essas configura&ccedil;&otilde;es.</p>

<hr>
<p><b>Observa&ccedil;&atilde;o:</b></p>
Os termos "Java Virtual Machine" e "JVM" significam uma M&aacute;quina Virtual para a plataforma Java.
<hr>

<p>A p&aacute;gina Defini&ccedil;&otilde;es Gerais de JVM cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Carregar Defaults</dt>
<dd>
<p>Bot&atilde;o para restaurar defini&ccedil;&otilde;es para seus valores default. Defini&ccedil;&otilde;es que n&atilde;o tiveram seus valores default alterados.</p>
</dd>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Home Java</dt>
<dd>
<p>O nome do diret&oacute;rio de instala&ccedil;&atilde;o do software Java SE, que &eacute; exigido para que &amp;ProductName; seja executado. Para verificar se a vers&atilde;o do software Java SE especificado &eacute; suportada nesta release, consulte o <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRLN"><i>Notas de Release do Oracle GlassFish Server</i></a>. Se voc&ecirc; especificar um nome de diret&oacute;rio inexistente ou se a vers&atilde;o do diret&oacute;rio n&atilde;o for compat&iacute;vel com o software Java SE, o GlassFish Server n&atilde;o ser&aacute; iniciado.</p>
</dd>
<dt>Op&ccedil;&otilde;es Javac</dt>
<dd>
<p>As op&ccedil;&otilde;es de linha de comando do compilador da linguagem de programa&ccedil;&atilde;o Java. O GlassFish Server executa o compilador quando componentes Enterprise JavaBeans (EJB) s&atilde;o implantados.</p>
</dd>
<dt>Depura&ccedil;&atilde;o</dt>
<dd>
<p>Ativa a depura&ccedil;&atilde;o com o Java Platform Debugger Architecture (JPDA).</p>
<p>O JPDA &eacute; utilizado pelos desenvolvedores de aplica&ccedil;&otilde;es. Para obter mais informa&ccedil;&otilde;es, consulte o <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDVG"><i>Oracle GlassFish Server Application Development Guide</i></a>.</p>
</dd>
<dt>Op&ccedil;&otilde;es de Depura&ccedil;&atilde;o</dt>
<dd>
<p>Especifica as op&ccedil;&otilde;es do JPDA passadas &agrave; JVM quando a depura&ccedil;&atilde;o est&aacute; ativada.</p>
</dd>
<dt>Op&ccedil;&otilde;es de Compila&ccedil;&atilde;o RMI</dt>
<dd>
<p>As op&ccedil;&otilde;es de linha de comando do compilador <code>rmic</code>. O GlassFish Server executa o compilador <code>rmic</code> quando os componentes EJB s&atilde;o implantados.</p>
</dd>
<dt>Pr&eacute;-processador de C&oacute;digo de Bytes</dt>
<dd>
<p>Nomes de classes para pr&eacute;-processamento de c&oacute;digos de bytes. Use v&iacute;rgulas para separar os nomes de classes. Cada classe deve implementar a interface com.sun.appserv.BytecodePreprocessor. As classes s&atilde;o chamadas na ordem especificada.</p>
</dd>
<dt>Propriedades Adicionais</dt>
<dd>
<p>Propriedades adicionais da JVM. O GlassFish Server n&atilde;o define propriedades adicionais para a JVM.</p>
</dd>
</dl>
<a id="GHCOM412" name="GHCOM412"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-jvmsettings.html">Para Configurar as Defini&ccedil;&otilde;es Gerais da JVM</a></p>
</li>
<li>
<p><a href="task-jvmpathsettings.html">Para Configurar as Defini&ccedil;&otilde;es de Caminho de JVM</a></p>
</li>
<li>
<p><a href="task-jvmoptions.html">Para Configurar as Op&ccedil;&otilde;es JVM</a></p>
</li>
<li>
<p><a href="task-securitymanagerdisable.html">Para Desativar o Gerenciador de Seguran&ccedil;a</a></p>
</li>
<li>
<p><a href="task-jvmprofilersettings.html">Para Configurar as Defini&ccedil;&otilde;es do Gerador de Perfil JVM</a></p>
</li>
</ul>
<a id="GHCOM413" name="GHCOM413"></a>
<h5>Comandos asadmin Relacionados</h5>
<p>Nenhum.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
