<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-editfile-adminrealm" name="ref-editfile-adminrealm"></a></p>

<h4><a id="sthref201" name="sthref201"></a><a id="sthref202" name="sthref202"></a>Propriedades Espec&iacute;ficas para a Classe <code>FileRealm</code></h4>
<a name="BEGIN" id="BEGIN"></a>
<p>As propriedades a seguir s&atilde;o necess&aacute;rias a um realm <code>file</code>.</p>
<dl>
<dt>Contexto JAAS</dt>
<dd>
<p>O contexto JAAS (Java Authentication and Authorization Service) (o identificador do m&oacute;dulo de log-in para usar este realm). O &uacute;nico valor v&aacute;lido &eacute; <code>fileRealm</code>.</p>
</dd>
<dt>Arquivo de Chave</dt>
<dd>
<p>Caminho completo e nome do arquivo em que o servidor armazenar&aacute; todas as informa&ccedil;&otilde;es de usu&aacute;rio, grupo e senha para esse realm. O valor default &eacute; domain-dir<code>/config/keyfile</code> para o realm <code>file</code> e domain-dir<code>/config/admin-keyfile</code> para o realm <code>admin-realm</code>.</p>
</dd>
</dl>
<p>O arquivo de chave para o realm <code>file</code> inicialmente &eacute; vazio, dessa forma, os usu&aacute;rios devem ser adicionados na <a href="ref-managefilerealm.html">Usu&aacute;rios do Arquivo</a> p&aacute;gina antes que o realm <code>file</code> seja usado.</p>
<p>O arquivo de chaves do realm <code>admin-realm</code> inicialmente cont&eacute;m o nome de usu&aacute;rio do administrador, a senha do administrador em um formato criptografado e o grupo ao qual este usu&aacute;rio pertence (<code>asadmin</code>, por default). Para obter mais informa&ccedil;&otilde;es sobre como adicionar usu&aacute;rios ao <code>admin-realm</code>, consulte<a href="task-accessadmintools.html">Para Conceder Acesso &agrave;s Ferramentas de Administra&ccedil;&atilde;o</a>.</p>

<hr>
<p><b>Observa&ccedil;&atilde;o:</b></p>
Os usu&aacute;rios do grupo <code>asadmin</code> no <code>admin-realm</code> s&atilde;o autorizados a usar o Console de Administra&ccedil;&atilde;o e as ferramentas de <code>asadmin</code>. Adicione, a esse grupo, somente usu&aacute;rios com privil&eacute;gios administrativos de servidor.
<hr>

<p>A propriedade opcional a seguir est&aacute; dispon&iacute;vel no realm <code>file</code>.</p>
<dl>
<dt>Designar Grupos</dt>
<dd>
<p>Uma lista de nomes de grupos, separados por v&iacute;rgulas. Todos os clientes que apresentarem certificados v&aacute;lidos ser&atilde;o designados a esses grupos; por exemplo, <code>funcion&aacute;rio, gerente</code>, onde esses forem os nomes de grupos de usu&aacute;rios.</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
