<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-securityadmin" name="ref-securityadmin"></a><a id="GHCOM00060" name="GHCOM00060"></a></p>

<h4>Administra&ccedil;&atilde;o Segura</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Administra&ccedil;&atilde;o Segura para ativar ou desativar a administra&ccedil;&atilde;o segura.</p>
<p>Quando a administra&ccedil;&atilde;o segura estiver ativada:</p>
<ul>
<li>
<p>O DAS e as inst&acirc;ncias no dom&iacute;nio usam certificados de SSL para criptografar as mensagens que trocam entre si.</p>
</li>
<li>
<p>O DAS aceita mensagens de administra&ccedil;&atilde;o de clientes admin remotos, como os recursos do asadmin e IDES.</p>
</li>
</ul>
<p>A p&aacute;gina Administra&ccedil;&atilde;o Segura cont&eacute;m as seguintes informa&ccedil;&otilde;es.</p>
<dl>
<dt>Ativar Admin Segura</dt>
<dd>
<p>Bot&atilde;o para ativar administra&ccedil;&atilde;o segura. Este bot&atilde;o aparece somente quando a administra&ccedil;&atilde;o segura n&atilde;o est&aacute; ativada.</p>

<hr>
<p><b>Observa&ccedil;&atilde;o:</b></p>
Se algum usu&aacute;rio administrativo no dom&iacute;nio tiver uma senha vazia, tentativas de ativar administra&ccedil;&atilde;o segura ir&atilde;o falhar.
<hr>

</dd>
<dt>Desativar Admin Segura</dt>
<dd>
<p>Bot&atilde;o para desativar administra&ccedil;&atilde;o segura. Este bot&atilde;o aparece somente quando a administra&ccedil;&atilde;o segura est&aacute; ativada.</p>
</dd>
<dt>Alias de Administra&ccedil;&atilde;o</dt>
<dd>
<p>O alias que se refere ao certificado SSL/TLS no DAS. Esse alias &eacute; usado pelo DAS para identificar-se para inst&acirc;ncias. O valor default &eacute; <code>s1as</code>. Este bot&atilde;o aparece somente quando a administra&ccedil;&atilde;o segura n&atilde;o est&aacute; ativada.</p>
</dd>
<dt>Alias da Inst&acirc;ncia</dt>
<dd>
<p>O alias que se refere ao certificado SSL/TLS nas inst&acirc;ncias. Esse alias &eacute; usado pelas inst&acirc;ncias para identificar-se para o DAS. O valor default &eacute; <code>glassfish-instance</code>. Este bot&atilde;o aparece somente quando a administra&ccedil;&atilde;o segura n&atilde;o est&aacute; ativada.</p>
</dd>
</dl>
<a id="sthref242" name="sthref242"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-enable-secure-admin.html">Para Ativar a Administra&ccedil;&atilde;o Segura</a></p>
</li>
<li>
<p><a href="task-disable-secure-admin.html">Para Desativar a Administra&ccedil;&atilde;o Segura</a></p>
</li>
</ul>
<a id="sthref243" name="sthref243"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00129"><code>enable-secure-admin</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00121"><code>disable-secure-admin</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
