<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-eelogging" name="ref-eelogging"></a><a id="GHCOM00094" name="GHCOM00094"></a></p>

<h4><a id="sthref335" name="sthref335"></a>Defini&ccedil;&otilde;es do Logger</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilize a p&aacute;gina Defini&ccedil;&otilde;es de Logger para configurar o log do cluster ou inst&acirc;ncia selecionada do GlassFish Server.</p>
<p>A p&aacute;gina Defini&ccedil;&otilde;es de Logger cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Gravar no Log do Sistema</dt>
<dd>
<p>Quando ativado, a sa&iacute;da de log ser&aacute; enviada para o <code>syslog</code> de facilidade em adi&ccedil;&atilde;o no log do servidor. Esse recurso est&aacute; dispon&iacute;vel apenas nos sistemas Solaris e Linux. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Log para Console</dt>
<dd>
<p>Quando essa op&ccedil;&atilde;o &eacute; ativada, a sa&iacute;da de log &eacute; enviada &agrave; console do sistema.</p>
</dd>
<dt>Rota&ccedil;&atilde;o na Altera&ccedil;&atilde;o da Data</dt>
<dd>
<p>Quando essa op&ccedil;&atilde;o &eacute; ativada, o GlassFish Server rotaciona arquivos de log a cada dia, &agrave; meia-noite.</p>
</dd>
<dt>Modo com V&aacute;rias Linhas</dt>
<dd>
<p>Quando essa op&ccedil;&atilde;o &eacute; ativada, as mensagens de log s&atilde;o formatadas de uma forma que ficam mais f&aacute;ceis de serem lidas. O corpo da mensagem de log &eacute; recuado e come&ccedil;a em uma nova linha.</p>
</dd>
<dt>Formato de Log da Console</dt>
<dd>
<p>O formato de log para registro na console. As op&ccedil;&otilde;es dispon&iacute;veis s&atilde;o ULF (UniformLogFormatter) e ODL (Oracle Diagnostics Logging). O default &eacute; ODL.</p>
</dd>
<dt>Formato de Log do Arquivo de Log</dt>
<dd>
<p>O formato de log para registro no arquivo de log do servidor. As op&ccedil;&otilde;es dispon&iacute;veis s&atilde;o ULF e ODL. O default &eacute; ODL.</p>
</dd>
<dt>Limite de Rota&ccedil;&atilde;o de Arquivo</dt>
<dd>
<p>O tamanho em bytes que o arquivo do log do servidor deve alcan&ccedil;ar antes de ser rotacionado. Quando o log do servidor alcan&ccedil;ar o tamanho especificado, o GlassFish Server cria um novo arquivo vazio denominado<code>server.log</code> e renomeia o arquivo antigo <code>server.log_</code><i>data</i>, onde <i>data</i> &eacute; a data e a hora em que o arquivo foi rotacionado. O valor default &eacute; 2 megabytes. O valor m&iacute;nimo para o limite &eacute; de 500 quilobytes; se voc&ecirc; especificar um valor menor, o arquivo ser&aacute; rotacionado quando alcan&ccedil;ar 500 KB. Para desativar a rota&ccedil;&atilde;o de arquivos de log, defina o valor para 0.</p>
</dd>
<dt>Limite de Tempo para Rota&ccedil;&atilde;o de Arquivos</dt>
<dd>
<p>O n&uacute;mero de minutos ap&oacute;s o qual o log do servidor deve ser rotacionado. O valor default &eacute; 0, o que significa que o arquivo &eacute; rotacionado quando ele alcan&ccedil;a o tamanho especificado no campo Limite de Rota&ccedil;&atilde;o de Arquivo. Se voc&ecirc; especificar um ou mais minutos, o limite de tempo tem preced&ecirc;ncia sobre o limite de tamanho especificado pelo campo Limite de Rota&ccedil;&atilde;o de Arquivo.</p>
</dd>
<dt>Frequ&ecirc;ncia de Esvaziamento</dt>
<dd>
<p>O n&uacute;mero m&aacute;ximo de mensagens a serem escritas de cada vez da fila para o log do servidor. O valor default &eacute; 1.</p>
</dd>
<dt>M&aacute;ximo de Arquivos de Hist&oacute;rico</dt>
<dd>
<p>O n&uacute;mero m&aacute;ximo de arquivos de log que o GlassFish Server mant&eacute;m antes de deletar o arquivo mais antigo. Se voc&ecirc; definir este valor como zero (0), o GlassFish Server n&atilde;o deletar&aacute; os antigos arquivos.</p>
</dd>
<dt>Arquivo de Log</dt>
<dd>
<p>Um nome alternativo ou local do arquivo do log do servidor. O valor default &eacute; domain-dir<code>/logs/server.log</code>.</p>
</dd>
<dt>Handler de Log</dt>
<dd>
<p>O nome da classe absoluta de um handler de log personalizado. Um handler de log personalizado permite que voc&ecirc; envie logs para um destino diferente de <code>server.log</code> ou <code>syslog</code> O handler personalizado deve estender a classe <code>java.util.logging.Handler</code> (uma API compat&iacute;vel com JSR 047). Coloque a classe do handler no caminho da classe do GlassFish Server, para que o handler seja instalado durante a inicializa&ccedil;&atilde;o do servidor.</p>
</dd>
</dl>
<a id="sthref336" name="sthref336"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-eelogging.html">Para Configurar Defini&ccedil;&otilde;es Gerais de Log</a></p>
</li>
<li>
<p><a href="task-eelogginglevels.html">Para Configurar N&iacute;veis do Log</a></p>
</li>
<li>
<p><a href="task-logviewer.html">Para Exibir Arquivos de Log do DAS</a></p>
</li>
</ul>
<a id="sthref337" name="sthref337"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00007"><code>collect-log-files</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00183"><code>list-log-levels</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00224"><code>rotate-log</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00228"><code>set-log-levels</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
