<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-logviewer" name="ref-logviewer"></a></p>

<h4><a id="sthref139" name="sthref139"></a><a id="sthref140" name="sthref140"></a><a id="sthref141" name="sthref141"></a>Visualizador de Log</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Visualizador de Log para exibir os arquivos de log de inst&acirc;ncias e clusters GlassFish Server e para personalizar a exibi&ccedil;&atilde;o do log.</p>
<p>A p&aacute;gina Visualizador de Logs cont&eacute;m quatro &aacute;reas:</p>
<ul>
<li>
<p>Crit&eacute;rios de Pesquisa</p>
</li>
<li>
<p>Pesquisa Avan&ccedil;ada</p>
</li>
<li>
<p>Modificar Pesquisa</p>
</li>
<li>
<p>Resultados da Pesquisa</p>
</li>
</ul>
<p>A &aacute;rea Crit&eacute;rios de Pesquisa cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Pesquisa Avan&ccedil;ada</dt>
<dd>
<p>Clicar neste link abre uma &aacute;rea que permite fazer ajustes adicionais ao visualizador de logs.</p>
</dd>
<dt>Timestamp</dt>
<dd>
<p>O bot&atilde;o de op&ccedil;&atilde;o Mais Recente exibe as mensagens mais recentes. O bot&atilde;o de op&ccedil;&atilde;o Faixa Espec&iacute;fica abre os campos De e Para que permite exibir mensagens apenas de um determinado per&iacute;odo de tempo.</p>
<p>Para o valor Tempo, a sintaxe deve considerar que esta forma (<i>SSS</i> significa milissegundos):</p>
<pre>
<i>hh</i>:<i>mm</i>:<i>ss</i>.<i>SSS</i>
</pre>
<p>Por exemplo:</p>
<pre>
17:10:00.000
</pre>
<p>Se o valor De for posterior ao valor Para, aparecer&aacute; uma mensagem de erro.</p>
</dd>
<dt>N&iacute;vel de Log</dt>
<dd>
<p>O n&iacute;vel de log selecionado para filtragem. Por default, a exibi&ccedil;&atilde;o inclui todas as mensagens que aparecem no log do servidor, no n&iacute;vel de log escolhido e nos n&iacute;veis mais graves. Marque a caixa de sele&ccedil;&atilde;o de nome "N&atilde;o incluir mais mensagens severas" para exibir mensagens somente no n&iacute;vel escolhido.</p>
<p>Para assegurar que as mensagens que voc&ecirc; deseja exibir apare&ccedil;am no log do servidor, primeiro defina os n&iacute;veis de log apropriados na p&aacute;gina N&iacute;veis de Log do M&oacute;dulo. Consulte <a href="task-eelogginglevels.html">Para Configurar N&iacute;veis do Log</a>.</p>
<p>Se voc&ecirc; escolher filtrar as mensagens de log com base no n&iacute;vel de log, apenas as mensagens que correspondem aos crit&eacute;rios de filtro espec&iacute;ficos ser&atilde;o mostradas. Contudo, essa filtragem n&atilde;o afeta quais mensagens s&atilde;o registradas no log do servidor.</p>
</dd>
</dl>
<p>A &aacute;rea Pesquisa Avan&ccedil;ada cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Logger</dt>
<dd>
<p>Namespaces do logger a serem filtrados por m&oacute;dulo. Use shift-click ou control-click para escolher m&uacute;ltiplos namespaces.</p>
<p>Selecionar um namespace em um n&iacute;vel mais elevado seleciona todos os namespaces abaixo dele. Por exemplo, selecionar <code>javax.enterprise.system</code> tamb&eacute;m seleciona os loggers de todos os m&oacute;dulos naquele namespace: <code>javax.enterprise.system.core</code> , <code>javax.enterprise.system.tools.admin</code> e assim por diante.</p>
</dd>
<dt>Logger Personalizado</dt>
<dd>
<p>Os loggers espec&iacute;ficos de determinada aplica&ccedil;&atilde;o, um por linha.</p>
<p>Se a aplica&ccedil;&atilde;o tiver diversos m&oacute;dulos, voc&ecirc; poder&aacute; exibir qualquer um deles. Por exemplo, suponha que a aplica&ccedil;&atilde;o tenha loggers com os seguintes nomes:</p>
<pre>
com.mycompany.myapp.module1
com.mycompany.myapp.module2
com.mycompany.myapp.module3
</pre>
<p>Para exibir as mensagens de todos os m&oacute;dulos na aplica&ccedil;&atilde;o, digite <code>com.mycompany.myapp</code> . Para exibir apenas mensagens do <code>module2</code>, digite <code>com.mycompany.myapp.module2</code>.</p>
<p>Quando voc&ecirc; especifica um ou mais loggers, as mensagens dos m&oacute;dulos do GlassFish Server aparecem apenas se voc&ecirc; as especificar explicitamente na &aacute;rea do Logger.</p>
</dd>
<dt>Exibir</dt>
<dd>
<p>O n&uacute;mero de mensagens a exibir por vez. O n&uacute;mero default de mensagens exibidas &eacute; 40. Outras op&ccedil;&otilde;es s&atilde;o 100, 250 e 1.000.</p>
<p>Para exibir rastreamentos de pilha, desmarque a caixa de sele&ccedil;&atilde;o "Limitar mensagens muito longas". Por default, os rastreamentos de pilha n&atilde;o aparecem no visualizador; para exibi-las, clique no link <code>(detalhes)</code> para obter uma mensagem.</p>
</dd>
</dl>
<p>A &aacute;rea Modificar Pesquisa permite especificar o cluster ou a inst&acirc;ncia do servidor e o nome de uma arquivo de log associado para exibi&ccedil;&atilde;o.</p>
<dl>
<dt>Inst&acirc;ncia</dt>
<dd>
<p>A inst&acirc;ncia do servidor ou cluster para o qual os registros de log ser&atilde;o exibidos. O default &eacute; servidor. As outras op&ccedil;&otilde;es dependem dos clusters e inst&acirc;ncias que podem ser definidos e ativados para o dom&iacute;nio.</p>
</dd>
<dt>Arquivo de Log</dt>
<dd>
<p>Nome do arquivo de log que deseja exibir. O default &eacute; <code>server.log</code>. As outras op&ccedil;&otilde;es dependem das defini&ccedil;&otilde;es do log no alvo selecionado.</p>
</dd>
</dl>
<p>A tabela Resultados do Visualizador de Log exibe as mensagens de log do servidor. Utilize bot&otilde;es Registros antes de e Registros depois de na parte superior da tabela para selecionar a faixa de registros que deseja exibir.</p>
<p>Em cada mensagem, a tabela Resultados do Visualizador de Log cont&eacute;m as seguintes informa&ccedil;&otilde;es.</p>
<dl>
<dt>N&uacute;mero do Registro</dt>
<dd>
<p>O n&uacute;mero da mensagem no log do servidor.</p>
</dd>
<dt>N&iacute;vel de Log</dt>
<dd>
<p>O n&iacute;vel do log da mensagem.</p>
</dd>
<dt>Mensagem</dt>
<dd>
<p>O texto breve da mensagem de log. Clique no link <code>(detalhes)</code> para exibir uma vers&atilde;o formatada de uma mensagem.</p>
</dd>
<dt>Logger</dt>
<dd>
<p>O m&oacute;dulo do logger que gerou a mensagem de log.</p>
</dd>
<dt>Timestamp</dt>
<dd>
<p>A data e a hora em que a mensagem de log foi emitida.</p>
</dd>
<dt>Pares de Nome/Valor</dt>
<dd>
<p>O nome e o ID do thread da mensagem de log.</p>
</dd>
</dl>
<a id="GHCOM354" name="GHCOM354"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-eelogging.html">Para Configurar Defini&ccedil;&otilde;es Gerais de Log</a></p>
</li>
<li>
<p><a href="task-eelogginglevels.html">Para Configurar N&iacute;veis do Log</a></p>
</li>
<li>
<p><a href="task-logviewer.html">Para Exibir Arquivos de Log do DAS</a></p>
</li>
</ul>
<a id="GHCOM355" name="GHCOM355"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><code>set-log-level</code></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00224"><code>rotate-log</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
