<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-managefilerealm" name="ref-managefilerealm"></a></p>

<h4><a id="sthref213" name="sthref213"></a>Usu&aacute;rios do Arquivo</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Usu&aacute;rios do Arquivo para gerenciar os usu&aacute;rios do realm <code>file</code>. Usu&aacute;rios e grupos do realm <code>file</code> s&atilde;o listados no arquivo de chave, cuja localiza&ccedil;&atilde;o est&aacute; especificada na propriedade <code>file</code>.</p>
<p>Um usu&aacute;rio do realm <code>file</code> pode pertencer a um <i>grupo Java</i>, uma categoria de usu&aacute;rios classificada por caracter&iacute;sticas comuns. Por exemplo, os clientes de uma aplica&ccedil;&atilde;o de e-commerce podem pertencer ao grupo <code>CUSTOMER</code>, mas os grandes consumidores podem pertencer ao grupo <code>PREFERRED</code>. A classifica&ccedil;&atilde;o de usu&aacute;rios em grupos facilita ainda mais o controle do acesso de um grande n&uacute;mero de usu&aacute;rios.</p>
<p>Inicialmente, ap&oacute;s a instala&ccedil;&atilde;o do GlassFish Server, o &uacute;nico usu&aacute;rio &eacute; o administrador especificado durante a instala&ccedil;&atilde;o. Por default, esse usu&aacute;rio pertence ao grupo <code>asadmin</code>, no <code>realm admin</code>, o que lhe direitos para modificar o GlassFish Server. Todos os usu&aacute;rios designados a esse grupo ter&atilde;o privil&eacute;gios de administrador, ou seja, eles ter&atilde;o acesso &agrave; ferramenta <code>asadmin</code> e ao Console de Administra&ccedil;&atilde;o.</p>
<p>A p&aacute;gina Usu&aacute;rios do Arquivo exibe uma lista de usu&aacute;rios do realm selecionado. Para cada usu&aacute;rio, as seguintes informa&ccedil;&otilde;es s&atilde;o fornecidas:</p>
<dl>
<dt>ID do Usu&aacute;rio</dt>
<dd>
<p>O nome de usu&aacute;rio.</p>
</dd>
<dt>Lista de Grupos</dt>
<dd>
<p>Os grupos aos quais o usu&aacute;rio pertence.</p>
</dd>
</dl>
<p>A tabela Usu&aacute;rios do Arquivo tamb&eacute;m cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Novo</dt>
<dd>
<p>Bot&atilde;o para criar um novo usu&aacute;rio.</p>
</dd>
<dt>Deletar</dt>
<dd>
<p>Bot&atilde;o para deletar um ou mais usu&aacute;rios selecionados.</p>
</dd>
</dl>
<a id="GHCOM435" name="GHCOM435"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-fileuserscreate.html">Para Adicionar um Usu&aacute;rio ao Realm do Arquivo</a></p>
</li>
<li>
<p><a href="task-fileusersedit.html">Para Editar Informa&ccedil;&otilde;es de Usu&aacute;rio de Realm de Arquivos</a></p>
</li>
<li>
<p><a href="task-fileusersdelete.html">Para Deletar um Usu&aacute;rio do Realm do Arquivo</a></p>
</li>
</ul>
<a id="GHCOM436" name="GHCOM436"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00165"><code>list-file-users</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00024"><code>create-file-user</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00254"><code>update-file-user</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00076"><code>delete-file-user</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
