<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-uc-installed" name="ref-uc-installed"></a><a id="GHCOM00136" name="GHCOM00136"></a></p>

<h4><a id="sthref455" name="sthref455"></a>Componentes Instalados</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>A p&aacute;gina de Componentes Instalados fornece informa&ccedil;&otilde;es sobre componentes da imagem de instala&ccedil;&atilde;o que ainda n&atilde;o foi instalada.</p>
<p>Para desinstalar quaisquer componentes instalados, interrompa primeiro o dom&iacute;nio do GlassFish Server. A seguir, use um destes comandos:</p>
<ul>
<li>
<p><code>glassfish3/bin/updatetool</code>, que come&ccedil;a com o recurso gr&aacute;fico da Ferramenta de Atualiza&ccedil;&atilde;o</p>
</li>
<li>
<p><code>glassfish3/bin/pkg</code>, uma vers&atilde;o da linha de comandos da Ferramenta de Atualiza&ccedil;&atilde;o</p>
</li>
</ul>
<p>Para obter mais informa&ccedil;&otilde;es sobre o uso do comando <code>pkg</code>, consulte o <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSADG00014">Cap&iacute;tulo 11, <i>Extending and Updating GlassFish Server,</i> no <i>Oracle GlassFish Server Administration Guide</i></a>. O utilit&aacute;rio Ferramenta de Atualiza&ccedil;&atilde;o tem sua pr&oacute;pria ajuda on-line.</p>
<p>Reinicie o servidor ap&oacute;s ter finalizado a desinstala&ccedil;&atilde;o dos componentes.</p>
<p>A p&aacute;gina Componentes Instalados cont&eacute;m estas op&ccedil;&otilde;es:</p>
<dl>
<dt>Caminho da Instala&ccedil;&atilde;o</dt>
<dd>
<p>O caminho do sistema de arquivos do diret&oacute;rio-raiz ou de n&iacute;vel superior da imagem de instala&ccedil;&atilde;o.</p>
</dd>
<dt>Componentes Instalados</dt>
<dd>
<p>Para cada componente instalado, esta tabela fornece as seguintes informa&ccedil;&otilde;es.</p>
<dl>
<dt>Componente</dt>
<dd>
<p>O nome do componente.</p>
</dd>
<dt>Categoria</dt>
<dd>
<p>A categoria de software que &eacute; associada ao componente; por exemplo, Servidores de Aplica&ccedil;&otilde;es, Ferramentas do Sistema e Bancos de Dados. A categoria &eacute; designada pelo autor do componente quando o componente &eacute; criado.</p>
</dd>
<dt>Vers&atilde;o</dt>
<dd>
<p>O n&uacute;mero de vers&atilde;o do pacote em que o componente foi fornecido.</p>
</dd>
<dt>Tamanho Instalado</dt>
<dd>
<p>A quantidade de espa&ccedil;o em disco que a instala&ccedil;&atilde;o do componente consome.</p>
</dd>
<dt>Origem</dt>
<dd>
<p>O nome do <a href="ref-uc-concepts.html#ref-uc-about-repository">Reposit&oacute;rio de Rede</a> de onde o componente pode ser obtido.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref456" name="sthref456"></a>
<h5>Tarefas Relacionadas</h5>
<p><a href="task-uc-installed-remove.html">Para Exibir Componentes Instalados</a></p>
<a id="sthref457" name="sthref457"></a>
<h5>Comandos asadmin Relacionados</h5>
<p>Nenhum.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
