<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-lifecyclemodules" name="ref-lifecyclemodules"></a></p>

<h4><a id="sthref185" name="sthref185"></a>M&oacute;dulos do Ciclo de Vida</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina M&oacute;dulos do Ciclo de Vida para configurar os m&oacute;dulos do ciclo de vida.</p>
<p>Um m&oacute;dulo do ciclo de vida realiza tarefas quando ele &eacute; acionado por um ou mais eventos no ciclo de vida do servidor. Os poss&iacute;veis eventos acionadores do servidor s&atilde;o: inicializa&ccedil;&atilde;o, pronto para solicita&ccedil;&otilde;es de servi&ccedil;o e shutdown. Os m&oacute;dulos do ciclo de vida n&atilde;o fazem parte da especifica&ccedil;&atilde;o Java EE, mas s&atilde;o um aprimoramento do GlassFish Server.</p>
<p>Para cada m&oacute;dulo do ciclo de vida, as informa&ccedil;&otilde;es a seguir s&atilde;o fornecidas.</p>
<dl>
<dt>Nome</dt>
<dd>
<p>O nome do m&oacute;dulo do ciclo de vida.</p>
</dd>
<dt>Ativado ou Status</dt>
<dd>
<p>Uma marca de sele&ccedil;&atilde;o se a aplica&ccedil;&atilde;o for ativada ou um X se a aplica&ccedil;&atilde;o for desativada, se existir somente a inst&acirc;ncia do servidor default, <code>server</code>.</p>
<p>Se existirem clusters ou outras inst&acirc;ncias de servidores standalone, selecione Ativado em Todos os Destinos para exibir os alvos nos quais a aplica&ccedil;&atilde;o est&aacute; implantada.</p>
</dd>
<dt>Ordem de Carga</dt>
<dd>
<p>O valor que especifica a ordem relativa na qual o m&oacute;dulo do ciclo de vida deve ser carregado.</p>
</dd>
</dl>
<p>A tabela M&oacute;dulos do Ciclo de Vida tamb&eacute;m cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Novo</dt>
<dd>
<p>Bot&atilde;o para criar um novo m&oacute;dulo do ciclo de vida.</p>
</dd>
<dt>Deletar</dt>
<dd>
<p>Bot&atilde;o para deletar um ou mais m&oacute;dulos do ciclo de vida selecionados.</p>
</dd>
<dt>Ativar</dt>
<dd>
<p>Bot&atilde;o para ativar um ou mais m&oacute;dulos do ciclo de vida selecionados. Presente somente se a inst&acirc;ncia default do servidor, <code>server</code>, existir.</p>
</dd>
<dt>Desativar</dt>
<dd>
<p>Bot&atilde;o para desativar um ou mais m&oacute;dulos do ciclo de vida selecionados. Presente somente se a inst&acirc;ncia default do servidor, <code>server</code>, existir.</p>
</dd>
</dl>
<a id="GHCOM391" name="GHCOM391"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-lifecyclemodulenew.html">Para Criar um M&oacute;dulo do Ciclo de Vida</a></p>
</li>
<li>
<p><a href="task-lifecyclemoduleedit.html">Para Editar um M&oacute;dulo do Ciclo de Vida</a></p>
</li>
<li>
<p><a href="task-lifecyclemoduledelete.html">Para Deletar um M&oacute;dulo de Ciclo de Vida</a></p>
</li>
</ul>
<a id="GHCOM392" name="GHCOM392"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00043"><code>create-lifecycle-module</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00181"><code>list-lifecycle-modules</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00095"><code>delete-lifecycle-module</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
