<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-messagesecurityconfignew" name="ref-messagesecurityconfignew"></a></p>

<h4><a id="sthref228" name="sthref228"></a>Configura&ccedil;&atilde;o de Seguran&ccedil;a de Nova Mensagem</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Configura&ccedil;&atilde;o de Seguran&ccedil;a de Nova Mensagem para criar uma configura&ccedil;&atilde;o HttpServlet de seguran&ccedil;a de mensagem.</p>
<p>A p&aacute;gina Configura&ccedil;&atilde;o de Seguran&ccedil;a de Nova Mensagem cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Camada de Autentica&ccedil;&atilde;o</dt>
<dd>
<p>Especifica a camada de mensagens na qual a autentica&ccedil;&atilde;o &eacute; realizada. O valor deve ser <code>SOAP</code> ou <code>HttpServlet</code>. Como uma configura&ccedil;&atilde;o SOAP est&aacute; dispon&iacute;vel por default, a &uacute;nica op&ccedil;&atilde;o &eacute; <code>HttpServlet</code>.</p>
</dd>
<dt>ID do Provedor</dt>
<dd>
<p>O identificador exclusivo da configura&ccedil;&atilde;o do provedor desta configura&ccedil;&atilde;o de seguran&ccedil;a de mensagem.</p>
</dd>
<dt>Provedor Default</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o for selecionada, este provedor ser&aacute; o provedor default. O provedor default ser&aacute; chamado para qualquer aplica&ccedil;&atilde;o que n&atilde;o identifique um provedor espec&iacute;fico. Se o provedor for o provedor de cliente default, o provedor de servidor default, ou de ambos, &eacute; determinado pelo Tipo de Provedor.</p>
</dd>
<dt>Tipo de Provedor</dt>
<dd>
<p>Especifica o tipo do provedor. As op&ccedil;&otilde;es dispon&iacute;veis s&atilde;o:</p>
<dl>
<dt><code>client</code></dt>
<dd>
<p>Especifica que o provedor &eacute; o provedor de autentica&ccedil;&atilde;o do cliente.</p>
</dd>
<dt><code>server</code></dt>
<dd>
<p>Especifica que o provedor &eacute; o provedor de autentica&ccedil;&atilde;o do servidor.</p>
</dd>
<dt><code>client-server</code></dt>
<dd>
<p>Especifica que o provedor &eacute; um provedor de autentica&ccedil;&atilde;o do cliente e do servidor.</p>
</dd>
</dl>
</dd>
<dt>Nome da Classe</dt>
<dd>
<p>O nome da classe de implementa&ccedil;&atilde;o Java do provedor. Provedores de autentica&ccedil;&atilde;o do cliente devem implementar a interface <code>com.sun.enterprise.security.jauth.ClientAuthModule</code>. Provedores do servidor devem implementar a interface <code>com.sun.enterprise.security.jauth.ServerAuthModule</code>. Os provedores de cliente-servidor devem implementar as duas interfaces.</p>
</dd>
<dt>Propriedades Adicionais</dt>
<dd>
<p>Propriedades adicionais para configura&ccedil;&atilde;o de seguran&ccedil;a de mensagem.</p>
</dd>
</dl>
<a id="GHCOM459" name="GHCOM459"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">Para Configurar os Recursos de GlassFish Server Para Usar pelos Provedores de Seguran&ccedil;a da Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">Para Criar uma Configura&ccedil;&atilde;o de Seguran&ccedil;a de Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">Para Editar uma Configura&ccedil;&atilde;o de Seguran&ccedil;a de Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">Para Deletar uma Configura&ccedil;&atilde;o de Seguran&ccedil;a de Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">Para Criar uma Configura&ccedil;&atilde;o de Seguran&ccedil;a de Provedor</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">Para Editar uma Configura&ccedil;&atilde;o do Provedor de Seguran&ccedil;a da Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">Para Deletar uma Configura&ccedil;&atilde;o do Provedor de Seguran&ccedil;a de Mensagem</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">Para Ativar a Seguran&ccedil;a de Mensagem para Clientes da Aplica&ccedil;&atilde;o</a></p>
</li>
</ul>
<a id="GHCOM460" name="GHCOM460"></a>
<h5>Comandos asadmin Relacionados</h5>
<p>Nenhum.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
