<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-domainattributestab" name="ref-domainattributestab"></a></p>

<h4><a id="sthref210" name="sthref210"></a>Atributos de Dom&iacute;nio</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Atributos de Dom&iacute;nio para configurar atributos de dom&iacute;nio avan&ccedil;ados para o GlassFish Server.</p>
<p>A p&aacute;gina Atributos de Dom&iacute;nio cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Carregar Console Ap&oacute;s Inicializa&ccedil;&atilde;o do DAS</dt>
<dd>
<p>Determina quando carregar a Console de Administra&ccedil;&atilde;o:</p>
<dl>
<dt>Baseado em Uso</dt>
<dd>
<p>Carrega a Console de Administra&ccedil;&atilde;o ap&oacute;s o Servidor de Administra&ccedil;&atilde;o de Dom&iacute;nios (DAS) se a console tiver sido usada nas &uacute;ltimas 24 horas ou se outras inst&acirc;ncias do servidor existirem al&eacute;m do DAS. Esse &eacute; o default.</p>
</dd>
<dt>Sempre</dt>
<dd>
<p>Sempre carrega a Console de Administra&ccedil;&atilde;o ap&oacute;s o DAS. A console ser&aacute; carregada depois que a sequ&ecirc;ncia de inicializa&ccedil;&atilde;o principal do GlassFish Server tiver sido conclu&iacute;da.</p>
</dd>
<dt>Nunca</dt>
<dd>
<p>Nunca carrega a Console de Administra&ccedil;&atilde;o ap&oacute;s o DAS. A console &eacute; carregada quando &eacute; solicitado acesso a ela.</p>
</dd>
</dl>
</dd>
<dt>Raiz da Aplica&ccedil;&atilde;o</dt>
<dd>
<p>O caminho completo do diret&oacute;rio em que residem as aplica&ccedil;&otilde;es implantadas. O valor default &eacute; domain-dir<code>/applications</code>.</p>
</dd>
<dt>Raiz de Log</dt>
<dd>
<p>Identifica onde o arquivos de log do servidor s&atilde;o mantidos. O valor default &eacute; domain-dir<code>/logs</code>.</p>
</dd>
<dt>Configura&ccedil;&atilde;o Regional</dt>
<dd>
<p>Se este campo for deixado em branco, as configura&ccedil;&otilde;es regionais do host ser&atilde;o utilizadas.</p>
<p>Uma configura&ccedil;&atilde;o regional &eacute; um identificador que especifica uma determinada combina&ccedil;&atilde;o de idioma e regi&atilde;o. Por exemplo, a &aacute;rea geogr&aacute;fica do Ingl&ecirc;s Americano &eacute; <code>en_US</code>, e do Japon&ecirc;s &eacute; <code>ja_JP</code>. Para usar uma configura&ccedil;&atilde;o regional que n&atilde;o seja o ingl&ecirc;s, o GlassFish Server deve ser localizado, um processo que inclui a tradu&ccedil;&atilde;o de ingl&ecirc;s para outro idioma.</p>
</dd>
</dl>
<a id="sthref211" name="sthref211"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-setadvanceappconfig.html">Para Definir a Configura&ccedil;&atilde;o de Aplica&ccedil;&otilde;es</a></p>
</li>
<li>
<p><a href="task-setadvancedomainattributes.html">Para Definir os Atributos de Dom&iacute;nio</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
