<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-monitoringservice" name="ref-monitoringservice"></a></p>

<h4><a id="sthref430" name="sthref430"></a>Servi&ccedil;o de Monitoramento</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Servi&ccedil;o de Monitoramento para configurar as op&ccedil;&otilde;es de monitoramento para componentes ou servi&ccedil;os individuais.</p>
<p>&Eacute; preciso implantar uma aplica&ccedil;&atilde;o, componente ou servi&ccedil;o, antes de configurar o monitoramento para o mesmo.</p>
<p>A p&aacute;gina Servi&ccedil;o de Monitoramento cont&eacute;m estas op&ccedil;&otilde;es:</p>
<dl>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Servi&ccedil;o de Monitoramento</dt>
<dd>
<p>Se a caixa de sele&ccedil;&atilde;o Servi&ccedil;o de Monitoramento Ativado estiver selecionada, o monitoramento ser&aacute; ativado para o GlassFish Server. Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</dd>
<dt>MBeans de Monitoramento</dt>
<dd>
<p>Se a caixa de sele&ccedil;&atilde;o MBeans de Monitoramento Ativados estiver selecionada, todos os MBeans necess&aacute;rios para o monitoramento ser&atilde;o implantados no GlassFish Server. Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
<p>Se a caixa de sele&ccedil;&atilde;o n&atilde;o estiver marcada, n&atilde;o ser&aacute; poss&iacute;vel exibir os dados de monitoramento no Console de Administra&ccedil;&atilde;o, mesmo se a caixa de sele&ccedil;&atilde;o Servi&ccedil;o de Monitoramento estiver selecionada. Em vez disso, use a linha de comando para exibir os dados de monitoramento. Se voc&ecirc; desmarcar a caixa de sele&ccedil;&atilde;o, a mem&oacute;ria do GlassFish Server ser&aacute; reduzida.</p>
</dd>
<dt>DTrace</dt>
<dd>
<p>Se a caixa de sele&ccedil;&atilde;o DTrace Ativado for selecionada e voc&ecirc; tiver Monitoramento de DTrace do Enterprise Manager do Oracle, voc&ecirc; pode usar o recurso Solaris DTrace. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
</dl>
<p>Para cada componente dispon&iacute;vel, as seguintes informa&ccedil;&otilde;es s&atilde;o fornecidas.</p>
<dl>
<dt>Componente</dt>
<dd>
<p>O nome do componente do GlassFish Server.</p>
</dd>
<dt>N&iacute;vel de Monitoramento</dt>
<dd>
<p>O n&iacute;vel de monitoramento definido pelo componente. Para componente, os n&iacute;veis dispon&iacute;veis s&atilde;o LOW, HIGH e OFF. O n&iacute;vel default &eacute; OFF. N&atilde;o h&aacute; diferen&ccedil;as entre os n&iacute;veis de monitoramento oferecidos pelas op&ccedil;&otilde;es LOW e HIGH, nesta vers&atilde;o.</p>
</dd>
</dl>
<p>A tabela Defini&ccedil;&otilde;es no N&iacute;vel de Componente tamb&eacute;m cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Alterar N&iacute;vel</dt>
<dd>
<p>Bot&atilde;o para alterar o n&iacute;vel de monitoramento para um ou mais componentes selecionados.</p>
</dd>
<dt>N&iacute;vel</dt>
<dd>
<p>Lista drop-down a partir da qual &eacute; poss&iacute;vel selecionar um n&iacute;vel de monitoramento a ser aplicado em todos os componentes selecionados.</p>
</dd>
</dl>
<a id="sthref431" name="sthref431"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-confmonitor.html">Para Configurar o Servi&ccedil;o de Monitoramento</a></p>
</li>
<li>
<p><a href="task-appmonitoringdata.html">Para Exibir Dados de Monitoramento da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-servermonitoringdata.html">Para Exibir Dados de Monitoramento do Servidor</a></p>
</li>
<li>
<p><a href="task-resourcemonitoringdata.html">Para Exibir Dados de Monitoramento do Recurso</a></p>
</li>
</ul>
<a id="sthref432" name="sthref432"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00128"><code>enable-monitoring</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00120"><code>disable-monitoring</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00212"><code>monitor</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
