<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-uc-concepts" name="ref-uc-concepts"></a></p>

<h4><a id="sthref447" name="sthref447"></a>Ferramenta de Atualiza&ccedil;&atilde;o Conceitos-Chave</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>O Ferramenta de Atualiza&ccedil;&atilde;o gerencia as instala&ccedil;&otilde;es de componentes de software do GlassFish Server que est&atilde;o contidos em um &uacute;nico diret&oacute;rio do sistema de arquivos do seu sistema.</p>
<p>A vers&atilde;o Console de Administra&ccedil;&atilde;o do Ferramenta de Atualiza&ccedil;&atilde;o permite efetuar o seguinte:</p>
<ul>
<li>
<p>Instalar componentes add-on</p>
</li>
<li>
<p>Exibir as atualiza&ccedil;&otilde;es para os componentes instalados</p>
</li>
<li>
<p>Exibir os componentes instalados</p>
</li>
</ul>
<p>Para atualizar ou remover os componentes instalados, &eacute; preciso parar o dom&iacute;nio do GlassFish Server, e a seguir usar um dos seguintes comandos:</p>
<ul>
<li>
<p>as-install-parent<code>/bin/updatetool</code>, que inicia o utilit&aacute;rio gr&aacute;fico da Ferramenta de Atualiza&ccedil;&atilde;o</p>
</li>
<li>
<p>as-install-parent<code>/bin/pkg</code>, uma vers&atilde;o da linha de comandos da Ferramenta de Atualiza&ccedil;&atilde;o</p>
</li>
</ul>
<p>Os principais conceitos do Ferramenta de Atualiza&ccedil;&atilde;o est&atilde;o descritos nas se&ccedil;&otilde;es a seguir.</p>
<a id="ref-uc-about-component" name="ref-uc-about-component"></a>
<h5>Componente</h5>
<p>Um componente &eacute; a unidade que pode ser instalada que Ferramenta de Atualiza&ccedil;&atilde;o gerencia. Um componente consiste em arquivos que s&atilde;o instalados como uma unidade no sistema, em uma imagem de instala&ccedil;&atilde;o.</p>
<a id="ref-uc-about-image" name="ref-uc-about-image"></a>
<h5>Imagem de Instala&ccedil;&atilde;o</h5>
<p>Uma imagem da instala&ccedil;&atilde;o &eacute; o diret&oacute;rio que cont&eacute;m os componentes do software, incluindo o conte&uacute;do do diret&oacute;rio. A imagem de instala&ccedil;&atilde;o &eacute; adicionada ao Ferramenta de Atualiza&ccedil;&atilde;o como resultado do download e da instala&ccedil;&atilde;o do software GlassFish Server. Para ativar a adi&ccedil;&atilde;o e a atualiza&ccedil;&atilde;o dos componentes de software do GlassFish Server, cada imagem de instala&ccedil;&atilde;o cont&eacute;m informa&ccedil;&otilde;es sobre a instala&ccedil;&atilde;o de componentes.</p>
<a id="ref-uc-about-repository" name="ref-uc-about-repository"></a>
<h5>Reposit&oacute;rio de Rede</h5>
<p>Um reposit&oacute;rio da rede cont&eacute;m os seguintes itens:</p>
<ul>
<li>
<p>Componentes que podem ser adicionados a uma imagem de instala&ccedil;&atilde;o</p>
</li>
<li>
<p>Atualiza&ccedil;&otilde;es para componentes existentes em uma imagem de instala&ccedil;&atilde;o</p>
</li>
</ul>
<p>Uma imagem de instala&ccedil;&atilde;o &eacute; associada a um ou mais reposit&oacute;rios de rede. Cada reposit&oacute;rio de rede &eacute; representado por um nome e um URL associado. Um nome de reposit&oacute;rio &eacute; exclusivo para cada imagem de instala&ccedil;&atilde;o e representa a organiza&ccedil;&atilde;o ou o projeto que gerencia o reposit&oacute;rio e um escopo bem definido de conte&uacute;do. Para saber mais sobre os reposit&oacute;rios de rede preconfigurados para GlassFish Server, consulte<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSADG00569"><i>Preconfigured Repositories for GlassFish Server</i> <i>no &amp;DSADG;</i></a>.</p>
<a id="ref-uc-about-addon" name="ref-uc-about-addon"></a>
<h5>Componente Add-on</h5>
<p>Um componente add-on &eacute; um componente da imagem de instala&ccedil;&atilde;o que ainda n&atilde;o foi instalada.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
