<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-eelogginglevels" name="task-eelogginglevels"></a></p>

<h4><a id="sthref118" name="sthref118"></a><a id="sthref119" name="sthref119"></a>Para Configurar N&iacute;veis do Log</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&otilde;es.</p>
</li>
<li>
<p>No n&oacute; Configura&ccedil;&atilde;o, clique na configura&ccedil;&atilde;o de cluster ou inst&acirc;ncia de servidor na qual deseja configurar as Defini&ccedil;&otilde;es do Logger.</p>
<p>A p&aacute;gina Configura&ccedil;&atilde;o ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Configura&ccedil;&atilde;o, clique em Defini&ccedil;&otilde;es do Logger.</p>
<p>A p&aacute;gina Defini&ccedil;&otilde;es do Logger da configura&ccedil;&atilde;o selecionada ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Defini&ccedil;&otilde;es do Logger, clique na guia N&iacute;veis de Log.</p>
<p>A p&aacute;gina N&iacute;veis de Log do M&oacute;dulo ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina N&iacute;veis de Log do M&oacute;dulo, altere os n&iacute;veis de log de um ou mais m&oacute;dulos, como a seguir.</p>
<ul>
<li>
<p>Para alterar o n&iacute;vel de log de um m&oacute;dulo individual, selecione um novo valor da lista drop-down, oposta ao m&oacute;dulo cujo n&iacute;vel de log voc&ecirc; deseja alterar.</p>
</li>
<li>
<p>Para alterar o n&iacute;vel de log de um grupo de m&oacute;dulos:</p>
<ol type="a">
<li>
<p>Marque as caixas de sele&ccedil;&atilde;o pr&oacute;ximas aos nomes dos m&oacute;dulos cujos n&iacute;veis de log voc&ecirc; deseja alterar.</p>
</li>
<li>
<p>Selecione um valor na lista drop-down na parte superior da tabela.</p>
</li>
<li>
<p>Clique no bot&atilde;o Alterar N&iacute;vel.</p>
</li>
</ol>
</li>
</ul>
<p>As mensagens do n&iacute;vel selecionado ou superiores aparecer&atilde;o no log. Escolha qualquer um dos valores a seguir (listados do maior para o menor).</p>
<ul>
<li>
<p><code>SEVERE</code></p>
</li>
<li>
<p><code>WARNING</code></p>
</li>
<li>
<p><code>INFO</code></p>
</li>
<li>
<p><code>CONFIG</code></p>
</li>
<li>
<p><code>FINE</code></p>
</li>
<li>
<p><code>FINER</code></p>
</li>
<li>
<p><code>FINEST</code></p>
</li>
<li>
<p><code>OFF</code></p>
</li>
</ul>
<p>Para obter detalhes sobre os significados dos n&iacute;veis de log, consulte <a href="ref-eelogginglevels.html">N&iacute;veis de Log do M&oacute;dulo</a>. O n&iacute;vel default &eacute; <code>INFO</code>, portanto, por default, o log conter&aacute; as mensagens dos n&iacute;veis <code>INFO</code>, <code>WARNING</code> ou <code>SEVERE</code>.</p>
</li>
<li>
<p>Clique em Salvar.</p>
<p>As altera&ccedil;&otilde;es das defini&ccedil;&otilde;es do N&iacute;vel de Log t&ecirc;m efeito imediato. Elas tamb&eacute;m s&atilde;o salvas para uso quando o servidor &eacute; reiniciado.</p>
</li>
</ol>
<a id="sthref120" name="sthref120"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-eelogging.html">Para Configurar Defini&ccedil;&otilde;es Gerais de Log</a></p>
</li>
<li>
<p><a href="task-logging-max-logfiles.html">Para Alterar o Limite do N&uacute;mero de Arquivos de Log Rotacionados</a></p>
</li>
<li>
<p><a href="task-logviewer.html">Para Exibir Arquivos de Log do DAS</a></p>
</li>
<li>
<p><a href="task-collectdomainlogs.html">Para Coletar e Fazer Download de Logs do Dom&iacute;nio</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
