<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-setadvancedomainattributes" name="task-setadvancedomainattributes"></a></p>

<h4><a id="sthref5" name="sthref5"></a>Para Definir os Atributos de Dom&iacute;nio</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, selecione o n&oacute; Dom&iacute;nio.</p>
<p>A p&aacute;gina Atributos do Dom&iacute;nio ser&aacute; aberta.</p>
</li>
<li>
<p>No campo Console de Carga ap&oacute;s a Inicializa&ccedil;&atilde;o DAS, selecione uma das seguintes op&ccedil;&otilde;es na lista drop-down:</p>
<dl>
<dt>Baseado em Uso</dt>
<dd>
<p>Carrega a Console de Administra&ccedil;&atilde;o ap&oacute;s o Servidor de Administra&ccedil;&atilde;o de Dom&iacute;nios (DAS) se a console tiver sido usada nas &uacute;ltimas 24 horas ou se outras inst&acirc;ncias do servidor existirem al&eacute;m do DAS. Esse &eacute; o default.</p>
</dd>
<dt>Sempre</dt>
<dd>
<p>Sempre carrega a Console de Administra&ccedil;&atilde;o ap&oacute;s o DAS. A console ser&aacute; carregada depois que a sequ&ecirc;ncia de inicializa&ccedil;&atilde;o principal do GlassFish Server tiver sido conclu&iacute;da.</p>
</dd>
<dt>Nunca</dt>
<dd>
<p>Nunca carrega a Console de Administra&ccedil;&atilde;o ap&oacute;s o DAS. A console &eacute; carregada quando &eacute; solicitado acesso a ela.</p>
</dd>
</dl>
</li>
<li>
<p>No campo Raiz da Aplica&ccedil;&atilde;o, digite o caminho completo do diret&oacute;rio em que as aplica&ccedil;&otilde;es implantadas residem.</p>
<p>O valor default &eacute; domain-dir<code>/applications</code>.</p>
</li>
<li>
<p>No campo Raiz de Log, digite o caminho completo do diret&oacute;rio onde os arquivos de log de servidor ser&atilde;o mantidos.</p>
<p>O valor default &eacute; domain-dir<code>/logs</code>.</p>
</li>
<li>
<p>Deixe o campo Configura&ccedil;&otilde;es Regionais em branco para usar as configura&ccedil;&otilde;es regionais default do host.</p>
<p>Uma configura&ccedil;&atilde;o regional &eacute; um identificador que especifica uma determinada combina&ccedil;&atilde;o de idioma e regi&atilde;o. Por exemplo, a &aacute;rea geogr&aacute;fica do Ingl&ecirc;s Americano &eacute; <code>en_US</code>, e do Japon&ecirc;s &eacute; <code>ja_JP</code>. Para usar uma configura&ccedil;&atilde;o regional que n&atilde;o seja o ingl&ecirc;s, o GlassFish Server deve ser localizado, um processo que inclui a tradu&ccedil;&atilde;o de ingl&ecirc;s para outro idioma.</p>
</li>
<li>
<p>Clique em Salvar.</p>
</li>
<li>
<p>Reinicie o servidor.</p>
</li>
</ol>
<a id="sthref6" name="sthref6"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-generaltab.html">Para Exibir Informa&ccedil;&otilde;es Gerais do DAS</a></p>
</li>
<li>
<p><a href="task-logviewer.html">Para Exibir Arquivos de Log do DAS</a></p>
</li>
<li>
<p><a href="task-filter-logs.html">Para Filtrar Registros de Log Exibidos</a></p>
</li>
<li>
<p><a href="task-setadvanceappconfig.html">Para Definir a Configura&ccedil;&atilde;o de Aplica&ccedil;&otilde;es</a></p>
</li>
<li>
<p><a href="task-collectdomainlogs.html">Para Coletar e Fazer Download de Logs do Dom&iacute;nio</a></p>
</li>
<li>
<p><a href="task-setadminpassword.html">Para Alterar a Senha do Administrador</a></p>
</li>
<li>
<p><a href="task-systemproperties.html">Para Gerenciar Propriedades do Sistema</a></p>
</li>
<li>
<p><a href="task-appmonitoringdata.html">Para Exibir Dados de Monitoramento da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-servermonitoringdata.html">Para Exibir Dados de Monitoramento do Servidor</a></p>
</li>
<li>
<p><a href="task-resourcemonitoringdata.html">Para Exibir Dados de Monitoramento do Recurso</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
