<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-securitysettings" name="task-securitysettings"></a></p>

<h4><a id="sthref78" name="sthref78"></a><a id="sthref79" name="sthref79"></a>Para Configurar as Defini&ccedil;&otilde;es de Seguran&ccedil;a</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>O Console de Administra&ccedil;&atilde;o permite que voc&ecirc; defina uma variedade de defini&ccedil;&otilde;es de seguran&ccedil;a em todo o sistema.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&otilde;es.</p>
</li>
<li>
<p>No n&oacute; Configura&ccedil;&otilde;es, clique na configura&ccedil;&atilde;o de cluster ou inst&acirc;ncia de servidor na qual deseja configurar as defini&ccedil;&otilde;es de Seguran&ccedil;a.</p>
<p>A p&aacute;gina Configura&ccedil;&atilde;o ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Configura&ccedil;&atilde;o, clique em Seguran&ccedil;a.</p>
<p>A p&aacute;gina Defini&ccedil;&otilde;es de seguran&ccedil;a do alvo da configura&ccedil;&atilde;o selecionada ser&aacute; aberta.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Gerenciador de Seguran&ccedil;a Ativado para ativar o gerenciador de seguran&ccedil;a.</p>
<p>Se essa op&ccedil;&atilde;o estiver ativada, uma op&ccedil;&atilde;o da JVM, <code>-Djava.security.manager</code>, ser&aacute; adicionada &agrave;s defini&ccedil;&otilde;es da JVM do GlassFish Server. Consulte <a href="task-jvmoptions.html">Para Configurar as Op&ccedil;&otilde;es JVM</a>. &Eacute; preciso reiniciar o servidor para ativar a altera&ccedil;&atilde;o.</p>
<p>Verifique se voc&ecirc; tem as permiss&otilde;es corretas para todas as aplica&ccedil;&otilde;es. Para melhorar o desempenho, desative o gerenciador de seguran&ccedil;a. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Log de Auditoria Ativado para ativar o log de auditoria.</p>
<p>Se essa op&ccedil;&atilde;o for ativada, o servidor carregar&aacute; e executar&aacute; todos os m&oacute;dulos de auditoria selecionados na lista M&oacute;dulos de Auditoria. Se essa op&ccedil;&atilde;o for desativada, o servidor n&atilde;o acessar&aacute; os m&oacute;dulos de auditoria. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>Na lista drop-down Realm Default, selecione um realm ativo que o servidor usar&aacute; para a autentica&ccedil;&atilde;o.</p>
<p>As aplica&ccedil;&otilde;es ir&atilde;o usar esse realm, a menos que o descritor de implanta&ccedil;&atilde;o especifique outro realm. Todos os realms configurados s&atilde;o exibidos na lista. O valor default &eacute; <code>file</code>.</p>
</li>
<li>
<p>Especifique a Informa&ccedil;&atilde;o do Principal Default.</p>
<ol type="a">
<li>
<p>No campo Principal Default, digite o nome de usu&aacute;rio default.</p>
<p>O servidor usa esse nome de usu&aacute;rio quando nenhum outro principal &eacute; fornecido.</p>
</li>
<li>
<p>No campo Senha do Principal Default, digite a senha do principal default especificado no campo Principal Default.</p>
</li>
</ol>
<p>Um principal default n&atilde;o &eacute; exigido para opera&ccedil;&atilde;o normal do servidor.</p>
</li>
<li>
<p>Na lista drop-down do JACC, selecione o nome de um provedor de JACC configurado.</p>
<p>As op&ccedil;&otilde;es default s&atilde;o <code>default</code> e <code>simple</code>. A op&ccedil;&atilde;o default &eacute; <code>default</code>. Para obter informa&ccedil;&otilde;es sobre a cria&ccedil;&atilde;o de novos provedores de JACC, consulte ***.</p>
</li>
<li>
<p>Na lista drop-down M&oacute;dulos de Auditoria, selecione os m&oacute;dulos do provedor de auditoria que ser&atilde;o usados pelo subsistema de auditoria, se o log de auditoria estiver ativado.</p>
<p>Por default, o servidor usa um m&oacute;dulo de auditoria chamado <code>default</code>. Para obter informa&ccedil;&otilde;es sobre como criar novos m&oacute;dulos de auditoria, consulte <a href="task-auditmodulenew.html">Para Criar um M&oacute;dulo de Auditoria</a>.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Mapeamento Ativado de Principal Default para Atribui&ccedil;&atilde;o para aplicar um mapeamento de principal default para atribui&ccedil;&atilde;o nas aplica&ccedil;&otilde;es que n&atilde;o t&ecirc;m um mapeamento espec&iacute;fico de aplica&ccedil;&atilde;o.</p>
</li>
<li>
<p>Se voc&ecirc; tiver ativado o mapeamento principal para atribui&ccedil;&atilde;o default, no campo Classe Principal Mapeada, digite o nome de uma classe de implementa&ccedil;&atilde;o <code>java.security.Principal</code> personalizada a ser usada no mapeamento principal para atribui&ccedil;&atilde;o default.</p>
</li>
<li>
<p>Na se&ccedil;&atilde;o Propriedades Adicionais, especifique as propriedades adicionais.</p>
<p>As propriedades v&aacute;lidas s&atilde;o dependentes do tipo de realm selecionado no campo Realm Default. Consulte a entrada apropriada na lista seguinte para obter o tipo de realm que deseja configurar.</p>
<ul>
<li>
<p><a href="ref-editfile-adminrealm.html">Propriedades Espec&iacute;ficas para a Classe <code>FileRealm</code></a></p>
</li>
<li>
<p><a href="ref-editcertrealm.html">Propriedades Espec&iacute;ficas para a Classe <code>CertificateRealm</code></a></p>
</li>
<li>
<p><a href="ref-editjdbcrealm.html">Propriedades Espec&iacute;ficas para a Classe <code>JDBCRealm</code></a></p>
</li>
<li>
<p><a href="ref-ldaprealmprop.html">Propriedades Espec&iacute;ficas para a Classe <code>LDAPRealm</code></a></p>
</li>
<li>
<p><a href="ref-solarisrealmprop.html">Propriedades Espec&iacute;ficas para a Classe <code>SolarisRealm</code></a></p>
</li>
<li>
<p><a href="ref-pamrealmprop.html">Propriedades Espec&iacute;ficas para a Classe <code>PamRealm</code></a></p>
</li>
</ul>
<ul>
<li>
<p>Para adicionar uma propriedade, clique no bot&atilde;o Adicionar Propriedade. Na linha em branco que for exibida, digite o nome da propriedade no campo Nome e digite o valor da propriedade no campo Valor.</p>
</li>
<li>
<p>Para modificar uma propriedade, edite o campo Valor da propriedade.</p>
</li>
<li>
<p>Para deletar uma propriedade, marque a caixa de sele&ccedil;&atilde;o &agrave; esquerda do campo Nome da Propriedade a ser deletada. Clique no bot&atilde;o Deletar Propriedades.</p>
</li>
</ul>
</li>
<li>
<p>Clique em Salvar.</p>
</li>
</ol>
<a id="GHCOM280" name="GHCOM280"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-accessadmintools.html">Para Conceder Acesso &agrave;s Ferramentas de Administra&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-changeadminpasswd.html">Para Alterar a Senha de um Usu&aacute;rio no Realm Admin</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
