<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-uc-update" name="task-uc-update"></a><a id="GHCOM00215" name="GHCOM00215"></a></p>

<h4><a id="sthref198" name="sthref198"></a>Para Exibir as Atualiza&ccedil;&otilde;es Dispon&iacute;veis para os Componentes</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>A p&aacute;gina Atualiza&ccedil;&otilde;es Dispon&iacute;veis fornece informa&ccedil;&otilde;es sobre as vers&otilde;es mais recentes de componentes da imagem da instala&ccedil;&atilde;o que s&atilde;o instalados.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, selecione o n&oacute; Ferramenta de Atualiza&ccedil;&atilde;o.</p>
<p>&Eacute; aberta a p&aacute;gina Add-ons Dispon&iacute;veis.</p>
</li>
<li>
<p>Na p&aacute;gina Add-ons Dispon&iacute;veis, clique na guia Atualiza&ccedil;&otilde;es Dispon&iacute;veis.</p>
<p>&Eacute; aberta a p&aacute;gina Atualiza&ccedil;&otilde;es Dispon&iacute;veis. Se n&atilde;o houver atualiza&ccedil;&otilde;es dispon&iacute;veis, a tabela estar&aacute; vazia.</p>
</li>
</ol>
<a id="sthref199" name="sthref199"></a>
<h5>Pr&oacute;ximas Etapas</h5>
<p>Para instalar as atualiza&ccedil;&otilde;es dispon&iacute;veis, interrompa primeiro o dom&iacute;nio do GlassFish Server. A seguir, use um destes comandos:</p>
<ul>
<li>
<p>as-install-parent<code>/bin/updatetool</code>, que inicia o utilit&aacute;rio gr&aacute;fico da Ferramenta de Atualiza&ccedil;&atilde;o</p>
</li>
<li>
<p>as-install-parent<code>/bin/pkg</code>, uma vers&atilde;o da linha de comandos da Ferramenta de Atualiza&ccedil;&atilde;o</p>
</li>
</ul>
<p>Para obter mais informa&ccedil;&otilde;es sobre o uso do comando <code>pkg</code>, consulte o <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSADG00014">Cap&iacute;tulo 11, <i>Extending and Updating GlassFish Server,</i> no <i>Oracle GlassFish Server Administration Guide</i></a>. O utilit&aacute;rio Ferramenta de Atualiza&ccedil;&atilde;o tem sua pr&oacute;pria ajuda on-line.</p>
<p>Reinicie o servidor ap&oacute;s ter finalizado a instala&ccedil;&atilde;o das atualiza&ccedil;&otilde;es.</p>
<a id="sthref200" name="sthref200"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-uc-addon.html">Para Instalar Componentes Add-On</a></p>
</li>
<li>
<p><a href="task-uc-installed-remove.html">Para Exibir Componentes Instalados</a></p>
</li>
<li>
<p><a href="task-uc-pkgdetails.html">Para Exibir Informa&ccedil;&otilde;es Detalhadas sobre um Componente</a></p>
</li>
<li>
<p><a href="task-uc-set-proxy.html">Para Configurar as Defini&ccedil;&otilde;es de Proxy de Rede para Acessar os Reposit&oacute;rios de Rede</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
