<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jaccprovideredit" name="task-jaccprovideredit"></a><a id="GHCOM00201" name="GHCOM00201"></a></p>

<h4><a id="sthref163" name="sthref163"></a>Para Editar um Provedor JACC</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>No n&oacute; Configura&ccedil;&otilde;es da &aacute;rvore de navega&ccedil;&atilde;o, expanda a inst&acirc;ncia ou cluster do GlassFish Server cujo provedor de JACC voc&ecirc; deseja criar.</p>
<p>Para criar um provedor que estar&aacute; dispon&iacute;vel para todas as inst&acirc;ncias e clusters, selecione o n&oacute; <code>default-config</code>.</p>
</li>
<li>
<p>No n&oacute; de configura&ccedil;&atilde;o da inst&acirc;ncia ou cluster, expanda o n&oacute; Seguran&ccedil;a.</p>
</li>
<li>
<p>Sob o n&oacute; Seguran&ccedil;a, selecione o n&oacute; Provedores de JACC.</p>
<p>A p&aacute;gina Provedores de JACC ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Provedores de JACC, clique no nome do provedor de JACC a ser editado.</p>
<p>A p&aacute;gina Editar Provedor de JACC ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Editar Provedor de JACC, no campo Configura&ccedil;&atilde;o da Pol&iacute;tica, digite o nome da classe que implementa a f&aacute;brica de configura&ccedil;&atilde;o da pol&iacute;tica.</p>
</li>
<li>
<p>No campo Provedor de Pol&iacute;ticas, digite o nome da classe que implementa a f&aacute;brica de pol&iacute;ticas.</p>
</li>
<li>
<p>Na se&ccedil;&atilde;o Propriedades Adicionais, especifique as propriedades adicionais.</p>
<p>Para obter uma descri&ccedil;&atilde;o da propriedade adicional que est&aacute; dispon&iacute;vel para provedores de JACC, consulte <a href="ref-jaccproviderprop.html">Propriedades Espec&iacute;ficas para Provedores JACC</a>.</p>
<ul>
<li>
<p>Para adicionar uma propriedade, clique no bot&atilde;o Adicionar Propriedade. Na linha em branco que for exibida, digite o nome da propriedade no campo Nome e digite o valor da propriedade no campo Valor.</p>
</li>
<li>
<p>Para modificar uma propriedade, edite o campo Valor da propriedade.</p>
</li>
<li>
<p>Para deletar uma propriedade, marque a caixa de sele&ccedil;&atilde;o &agrave; esquerda do campo Nome da Propriedade a ser deletada. Clique no bot&atilde;o Deletar Propriedades.</p>
</li>
</ul>
</li>
<li>
<p>Clique em Salvar.</p>
</li>
</ol>
<a id="sthref164" name="sthref164"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-jaccprovidernew.html">Para Criar um Provedor JACC</a></p>
</li>
<li>
<p><a href="task-jaccproviderdelete.html">Para Deletar um Provedor JACC</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
