<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-appviewtargets" name="task-appviewtargets"></a><a id="GHCOM00164" name="GHCOM00164"></a></p>

<h4>Para Exibir Alvos da Aplica&ccedil;&atilde;o</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, selecione o n&oacute; Aplica&ccedil;&otilde;es.</p>
<p>A p&aacute;gina Aplica&ccedil;&otilde;es ser&aacute; aberta.</p>
</li>
<li>
<p>Selecione uma aplica&ccedil;&atilde;o para a qual voc&ecirc; deseja exibir os alvos.</p>
<p>O nome da aplica&ccedil;&atilde;o pode incluir um identificador de vers&atilde;o opcional, que segue o nome e &eacute; separado do nome por dois-pontos (<code>:</code>). Para obter mais informa&ccedil;&otilde;es sobre vers&otilde;es modulares ou da aplica&ccedil;&atilde;o, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> em <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
<p>A p&aacute;gina da aplica&ccedil;&atilde;o se abre.</p>
</li>
<li>
<p>Selecione a guia Alvo.</p>
<p>A p&aacute;gina Alvos da Aplica&ccedil;&atilde;o se abre e os alvos atualmente especificados para a aplica&ccedil;&atilde;o s&atilde;o exibidos.</p>
</li>
<li>
<p>Para ativar ou desativar uma aplica&ccedil;&atilde;o em uma inst&acirc;ncia ou cluster de alvo espec&iacute;fico, clique na caixa de sele&ccedil;&atilde;o ao lado do alvo e selecione Ativar ou Desativar no menu drop-down A&ccedil;&otilde;es.</p>
</li>
<li>
<p>Para ativar o balanceamento de carga de um alvo em uma inst&acirc;ncia ou cluster do alvo espec&iacute;fico, clique na caixa de sele&ccedil;&atilde;o ao lado do alvo e selecione Ativar Balanceador de Carga ou Desativar Balanceador de Carga no menu drop-down Mais A&ccedil;&otilde;es.</p>
</li>
<li>
<p>Para associar uma aplica&ccedil;&atilde;o a servidores virtuais espec&iacute;ficos, selecione Gerenciar Servidores Virtuais na inst&acirc;ncia ou cluster do alvo.</p>
<p>A p&aacute;gina Alvos do Servidor Virtual ser&aacute; aberta.</p>
<p>Para adicionar servidores virtuais do alvo, selecione-os na lista Alvos Dispon&iacute;veis e utilize o bot&atilde;o Adicionar para mov&ecirc;-los para a lista Alvos Selecionados.</p>
<p>Por default, o m&oacute;dulo ou aplica&ccedil;&atilde;o est&aacute; associado ao servidor virtual default, com o nome <code>server</code>. Utilize a bot&atilde;o Adicionar Tudo para adicionar todos os alvos. Utilize os bot&otilde;es Remover e Remover Tudo para remover os alvos da lista Alvos Selecionados.</p>
<p>Selecione Salvar para voltar &agrave; p&aacute;gina Alvos da Aplica&ccedil;&atilde;o.</p>
</li>
<li>
<p>Para adicionar ou deletar inst&acirc;ncias ou clusters do alvo da aplica&ccedil;&atilde;o, selecione Gerenciar Alvos.</p>
<p>A p&aacute;gina Gerenciar Alvos ser&aacute; aberta.</p>
<p>Para adicionar alvos, selecione-os na lista Alvos Dispon&iacute;veis e utilize o bot&atilde;o Adicionar para mov&ecirc;-los para a lista Alvos Selecionados.</p>
<p>Utilize a bot&atilde;o Adicionar Tudo para adicionar todos os alvos. Utilize os bot&otilde;es Remover e Remover Tudo para remover os alvos da lista Alvos Selecionados.</p>
<p>Selecione Salvar para voltar &agrave; p&aacute;gina Alvos da Aplica&ccedil;&atilde;o.</p>
</li>
<li>
<p>Clique em Salvar.</p>
<p>A aplica&ccedil;&atilde;o est&aacute; agora dispon&iacute;vel na lista de alvos alterada.</p>
</li>
</ol>
<a id="sthref80" name="sthref80"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-appedit.html">Para Editar uma Aplica&ccedil;&atilde;o Implantada</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">Para Exibir Descritores de uma Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-applaunch.html">Para Ativar uma Aplica&ccedil;&atilde;o</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
