<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-uc-set-proxy" name="task-uc-set-proxy"></a></p>

<h4><a id="sthref121" name="sthref121"></a><a id="sthref122" name="sthref122"></a><a id="sthref123" name="sthref123"></a>Para Configurar as Defini&ccedil;&otilde;es de Proxy de Rede para Acessar os Reposit&oacute;rios de Rede</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>As defini&ccedil;&otilde;es de proxy de rede determinam como o GlassFish Server conecta-se com a Internet. Para ativar o Ferramenta de Atualiza&ccedil;&atilde;o a fim de acessar os reposit&oacute;rios da rede por meio da Internet, configure as defini&ccedil;&otilde;es do proxy da sua rede.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, selecione o n&oacute; Ferramenta de Atualiza&ccedil;&atilde;o.</p>
<p>&Eacute; aberta a p&aacute;gina Add-ons Dispon&iacute;veis.</p>
</li>
<li>
<p>Na p&aacute;gina Add-ons Dispon&iacute;veis, clique na guia Configura&ccedil;&atilde;o.</p>
<p>&Eacute; exibida a p&aacute;gina Configura&ccedil;&atilde;o Ferramenta de Atualiza&ccedil;&atilde;o.</p>
</li>
<li>
<p>Na p&aacute;gina Configura&ccedil;&atilde;o Ferramenta de Atualiza&ccedil;&atilde;o, especifique como a m&aacute;quina na qual GlassFish Server est&aacute; sendo executado se conecta com a Internet.</p>
<ul>
<li>
<p>Se a m&aacute;quina se conecta com a Internet diretamente, selecione a op&ccedil;&atilde;o Conex&atilde;o Direta.</p>
</li>
<li>
<p>Se a m&aacute;quina se conecta com a Internet por meio de um proxy, selecione a op&ccedil;&atilde;o Por Proxy.</p>
</li>
</ul>
</li>
<li>
<p>Se a m&aacute;quina na qual o GlassFish Server est&aacute; sendo executado se conectar com a Internet por meio de um proxy, forne&ccedil;a o nome do Host do Proxy e o n&uacute;mero da Porta do Proxy.</p>
<p>Se a m&aacute;quina na qual o GlassFish Server est&aacute; sendo executado se conectar com a Internet diretamente, omita esta etapa.</p>
<p>Um Web browser pode estar sendo executado na m&aacute;quina na qual est&aacute; sendo executado o GlassFish Server. Nesta situa&ccedil;&atilde;o, voc&ecirc; pode obter o nome do host e o n&uacute;mero da porta do proxy do Web browser. Voc&ecirc; tamb&eacute;m pode solicitar essa informa&ccedil;&atilde;o ao administrador do sistema.</p>
</li>
<li>
<p>Clique em Salvar.</p>
</li>
</ol>
<a id="GHCOM334" name="GHCOM334"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-uc-update.html">Para Exibir as Atualiza&ccedil;&otilde;es Dispon&iacute;veis para os Componentes</a></p>
</li>
<li>
<p><a href="task-uc-addon.html">Para Instalar Componentes Add-On</a></p>
</li>
<li>
<p><a href="task-uc-installed-remove.html">Para Exibir Componentes Instalados</a></p>
</li>
<li>
<p><a href="task-uc-pkgdetails.html">Para Exibir Informa&ccedil;&otilde;es Detalhadas sobre um Componente</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
