<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-accessadmintools" name="task-accessadmintools"></a></p>

<h4><a id="sthref80" name="sthref80"></a>Para Conceder Acesso &agrave;s Ferramentas de Administra&ccedil;&atilde;o</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Somente usu&aacute;rios do grupo <code>asadmin</code> podem acessar o Console de Administra&ccedil;&atilde;o e o utilit&aacute;rio da linha de comando <code>asadmin</code>. Para dar aos usu&aacute;rios acesso a essas ferramentas de administra&ccedil;&atilde;o, adicione-as ao grupo <code>asadmin</code> no <code>admin-realm</code>.</p>
<ol>
<li>
<p>No n&oacute; Configura&ccedil;&otilde;es, expanda a configura&ccedil;&atilde;o de cluster ou inst&acirc;ncia de servidor na qual deseja configurar os privil&eacute;gios de acesso de administra&ccedil;&atilde;o.</p>
</li>
<li>
<p>Expanda o n&oacute; Seguran&ccedil;a.</p>
</li>
<li>
<p>Expanda o n&oacute; Realms.</p>
</li>
<li>
<p>Selecione o n&oacute; <code>admin-realm</code>.</p>
<p>A p&aacute;gina Editar Realm ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Editar Realm, clique no bot&atilde;o Gerenciar Usu&aacute;rios.</p>
<p>A p&aacute;gina Usu&aacute;rios Admin ser&aacute; aberta.</p>
<p>Inicialmente, depois da instala&ccedil;&atilde;o, o nome de usu&aacute;rio e senha do administrador inseridos na instala&ccedil;&atilde;o s&atilde;o listados em um arquivo com o nome <code>admin-keyfile</code>. Por default, esse usu&aacute;rio pertence ao grupo <code>asadmin</code>, que d&aacute; direitos para modificar o GlassFish Server. Designe usu&aacute;rios a esse grupo somente se quiser dar a eles privil&eacute;gios de administrador para o cluster ou inst&acirc;ncia selecionada do GlassFish Server.</p>
<p>Se voc&ecirc; adicionar usu&aacute;rios ao realm <code>admin-realm</code>, mas designar o usu&aacute;rio a um grupo diferente do <code>asadmin</code>, as informa&ccedil;&otilde;es de usu&aacute;rios ainda ser&atilde;o gravadas no arquivo denominado <code>admin-keyfile</code>, por&eacute;m os usu&aacute;rios n&atilde;o ter&atilde;o acesso &agrave;s ferramentas administrativas ou a aplica&ccedil;&otilde;es no realm <code>file</code>.</p>
</li>
<li>
<p>Na p&aacute;gina Usu&aacute;rios Admin, clique em Novo, para adicionar um novo usu&aacute;rio ao realm <code>admin-realm</code>.</p>
<p>A p&aacute;gina Novo Usu&aacute;rio de Realm de Arquivos ser&aacute; aberta.</p>
</li>
<li>
<p>No campo ID de Usu&aacute;rio, digite o nome do novo usu&aacute;rio.</p>
</li>
<li>
<p>No campo Lista de Grupos, digite os nomes dos grupos aos quais o usu&aacute;rio vai pertencer.</p>
<p>Para autorizar um usu&aacute;rio a fazer modifica&ccedil;&otilde;es no GlassFish Server, inclua o grupo <code>asadmin</code> na Lista de Grupos.</p>
</li>
<li>
<p>Nos campos Nova Senha e Confirmar Nova Senha, digite a senha do novo usu&aacute;rio.</p>
</li>
<li>
<p>Clique em OK para adicionar esse usu&aacute;rio ao realm <code>admin-realm</code> ou clique em Cancelar para sair sem salvar.</p>
</li>
</ol>
<a id="GHCOM281" name="GHCOM281"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-securitysettings.html">Para Configurar as Defini&ccedil;&otilde;es de Seguran&ccedil;a</a></p>
</li>
<li>
<p><a href="task-changeadminpasswd.html">Para Alterar a Senha de um Usu&aacute;rio no Realm Admin</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
