<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-generaltab" name="task-generaltab"></a><a id="GHCOM00146" name="GHCOM00146"></a></p>

<h4><a id="sthref19" name="sthref19"></a><a id="sthref20" name="sthref20"></a>Para Exibir Informa&ccedil;&otilde;es Gerais do DAS</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, selecione o n&oacute; do servidor (Servidor Admin).</p>
<p>A p&aacute;gina Informa&ccedil;&otilde;es Gerais ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Informa&ccedil;&otilde;es Gerais, execute qualquer uma das etapas a seguir.</p>
<ul>
<li>
<p>Observe a exibi&ccedil;&atilde;o de Status somente para leitura para ver se o servidor est&aacute; em execu&ccedil;&atilde;o.</p>
</li>
<li>
<p>Observe a exibi&ccedil;&atilde;o de Per&iacute;odo de Disponibilidade somente para leitura para ver o n&uacute;mero de horas e minutos durante os quais o servidor esteve em execu&ccedil;&atilde;o cont&iacute;nua.</p>
</li>
<li>
<p>Clique no bot&atilde;o Interromper para interromper o GlassFish Server.</p>
</li>
<li>
<p>Clique no bot&atilde;o Reiniciar para interromper e reiniciar o GlassFish Server.</p>
</li>
<li>
<p>Clique no bot&atilde;o Exibir Arquivos de Log para exibir arquivos de log de inst&acirc;ncias ou clusters do GlassFish Server.</p>
<p>Consulte <a href="task-logviewer.html">Para Exibir Arquivos de Log do DAS</a> para obter detalhes.</p>
</li>
<li>
<p>Clique no Relat&oacute;rio JVM para abrir uma janela separada que lhe permite exibir relat&oacute;rios no Java Virtual Machine, incluindo um relat&oacute;rio de resumo, um relat&oacute;rio de gerenciamento de mem&oacute;ria, um relat&oacute;rio de carregamento de classes e um dump de threads atuais.</p>
</li>
</ul>
</li>
</ol>
<a id="sthref21" name="sthref21"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-logviewer.html">Para Exibir Arquivos de Log do DAS</a></p>
</li>
<li>
<p><a href="task-filter-logs.html">Para Filtrar Registros de Log Exibidos</a></p>
</li>
<li>
<p><a href="task-setadvanceappconfig.html">Para Definir a Configura&ccedil;&atilde;o de Aplica&ccedil;&otilde;es</a></p>
</li>
<li>
<p><a href="task-setadvancedomainattributes.html">Para Definir os Atributos de Dom&iacute;nio</a></p>
</li>
<li>
<p><a href="task-setadminpassword.html">Para Alterar a Senha do Administrador</a></p>
</li>
<li>
<p><a href="task-systemproperties.html">Para Gerenciar Propriedades do Sistema</a></p>
</li>
<li>
<p><a href="task-appmonitoringdata.html">Para Exibir Dados de Monitoramento da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-servermonitoringdata.html">Para Exibir Dados de Monitoramento do Servidor</a></p>
</li>
<li>
<p><a href="task-resourcemonitoringdata.html">Para Exibir Dados de Monitoramento do Recurso</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
