<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-usedefaultauditmod" name="task-usedefaultauditmod"></a><a id="GHCOM00199" name="GHCOM00199"></a></p>

<h4><a id="sthref160" name="sthref160"></a>Para Usar o M&oacute;dulo de Auditoria Default</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>O m&oacute;dulo de auditoria <code>default</code> registra as solicita&ccedil;&otilde;es de autentica&ccedil;&atilde;o e de autoriza&ccedil;&atilde;o no arquivo de log do servidor. Para obter informa&ccedil;&otilde;es sobre a altera&ccedil;&atilde;o da localiza&ccedil;&atilde;o do arquivo de log, consulte <a href="task-eelogging.html">Para Configurar Defini&ccedil;&otilde;es Gerais de Log</a>.</p>
<p>As entradas de log de autentica&ccedil;&atilde;o incluem estas informa&ccedil;&otilde;es:</p>
<ul>
<li>
<p>Nomes do usu&aacute;rios que tentaram se autenticar</p>
</li>
<li>
<p>O realm que processou a solicita&ccedil;&atilde;o de acesso</p>
</li>
<li>
<p>Componente URI ou EJB do m&oacute;dulo Web solicitado</p>
</li>
<li>
<p>&Ecirc;xito ou falha da solicita&ccedil;&atilde;o</p>
</li>
</ul>
<p>Independentemente de o modo de log de auditoria estar ou n&atilde;o ativado, o GlassFish Server registra em log todos os eventos de autentica&ccedil;&atilde;o recusados.</p>
<p>As entradas de log de autoriza&ccedil;&atilde;o incluem estas informa&ccedil;&otilde;es:</p>
<ul>
<li>
<p>Nomes de usu&aacute;rios autenticados, se houver</p>
</li>
<li>
<p>Componente URI ou EJB da Web solicitada</p>
</li>
<li>
<p>&Ecirc;xito ou falha das solicita&ccedil;&otilde;es</p>
</li>
</ul>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&atilde;o.</p>
</li>
<li>
<p>Selecione a inst&acirc;ncia que ser&aacute; configurada:</p>
<ul>
<li>
<p>Para configurar uma inst&acirc;ncia em particular, expanda o n&oacute; de configura&ccedil;&atilde;o da inst&acirc;ncia. Por exemplo, na inst&acirc;ncia default, <code>server</code>, expanda o n&oacute; <code>server-config</code>.</p>
</li>
<li>
<p>Para definir as defini&ccedil;&otilde;es default de todas as inst&acirc;ncias, expanda o n&oacute; <code>default-config</code>.</p>
</li>
</ul>
</li>
<li>
<p>Sob o n&oacute; Configura&ccedil;&atilde;o, selecione o n&oacute; Seguran&ccedil;a.</p>
<p>A p&aacute;gina Seguran&ccedil;a ser&aacute; aberta.</p>
</li>
<li>
<p>Na lista drop-down M&oacute;dulos de Auditoria, selecione o m&oacute;dulo de auditoria denominado <code>default</code>.</p>
</li>
<li>
<p>Clique em Salvar.</p>
</li>
</ol>
<a id="sthref161" name="sthref161"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-auditmodulenew.html">Para Criar um M&oacute;dulo de Auditoria</a></p>
</li>
<li>
<p><a href="task-auditmoduleedit.html">Para Editar um M&oacute;dulo de Auditoria</a></p>
</li>
<li>
<p><a href="task-auditmoduledelete.html">Para Deletar um M&oacute;dulo de Auditoria</a></p>
</li>
<li>
<p><a href="task-enabledisableauditmod.html">Para Ativar ou Desativar o Log de Auditoria</a></p>
</li>
<li>
<p><a href="task-setactiveauditmod.html">Para Definir o M&oacute;dulo de Auditoria Ativo</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
