<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-enablemesec4appclients" name="task-enablemesec4appclients"></a></p>

<h4><a id="sthref184" name="sthref184"></a>Para Ativar a Seguran&ccedil;a de Mensagem para Clientes da Aplica&ccedil;&atilde;o</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Os provedores clientes devem ter as mesmas pol&iacute;ticas de prote&ccedil;&atilde;o de mensagens que os provedores do servidor com que eles interagem. Esse j&aacute; &eacute; o caso dos provedores configurados (mas n&atilde;o ativados) quando o GlassFish Server &eacute; instalado.</p>
<p>Para ativar a seguran&ccedil;a de mensagens para clientes de aplica&ccedil;&otilde;es, modifique a configura&ccedil;&atilde;o espec&iacute;fica do GlassFish Server para o cont&ecirc;iner do cliente de aplica&ccedil;&atilde;o.</p>
<ol>
<li>
<p>Interrompa quaisquer aplica&ccedil;&otilde;es clientes que dependam do descritor do cont&ecirc;iner do cliente.</p>
</li>
<li>
<p>Em um editor de texto, abra o descritor do cont&ecirc;iner cliente de aplica&ccedil;&atilde;o da Sun, localizado em domain-dir<code>/config/sun-acc.xml.</code></p>
</li>
<li>
<p>Para ativar o provedor do cliente default no cliente de aplica&ccedil;&atilde;o, adicione o atributo <code>default-client-provider</code> ao elemento, ao elemento <code>message-security-config</code>.</p>
<p>O c&oacute;digo ao redor &eacute; mostrado para contexto e pode diferir um pouco em sua instala&ccedil;&atilde;o. N&atilde;o altere-o.</p>
<pre>
&lt;client-container&gt;
  &lt;target-server name="<i>your-host</i>" address="<i>your-host</i>"
      port="<i>your-port</i>"
  &lt;log-service file="" level="WARNING"
  &lt;message-security-config auth-layer="SOAP"
      <b>default-client-provider="ClientProvider"</b>&gt;
    &lt;provider-config
        class-name="com.sun.enterprise.security.jauth.ClientAuthModule"
        provider-id="clientprovider" provider-type="client"&gt;
      &lt;request-policy auth-source="sender"
      &lt;response-policy
        &lt;property name="security.config"
          value="C:/Sun/AppServer/lib/appclient/wss-client-config.xml"
    &lt;/provider-config&gt;
  &lt;/message-security-config&gt;
&lt;/client-container&gt;
</pre>
<p>O provedor de seguran&ccedil;a de mensagens configurado no cont&ecirc;iner do cliente deve ter acesso a chaves particulares e a certificados confi&aacute;veis. Para fornecer-lhe acesso, defina os valores das propriedades do sistema a seguir no script de inicializa&ccedil;&atilde;o do cliente de aplica&ccedil;&atilde;o:</p>
<pre>
-Djavax.net.ssl.keyStore

-Djavax.net.ssl.trustStore
</pre></li>
</ol>
<a id="sthref185" name="sthref185"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">Para Configurar os Recursos de GlassFish Server Para Usar pelos Provedores de Seguran&ccedil;a da Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">Para Criar uma Configura&ccedil;&atilde;o de Seguran&ccedil;a de Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">Para Editar uma Configura&ccedil;&atilde;o de Seguran&ccedil;a de Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">Para Deletar uma Configura&ccedil;&atilde;o de Seguran&ccedil;a de Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">Para Criar uma Configura&ccedil;&atilde;o de Seguran&ccedil;a de Provedor</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">Para Editar uma Configura&ccedil;&atilde;o do Provedor de Seguran&ccedil;a da Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">Para Deletar uma Configura&ccedil;&atilde;o do Provedor de Seguran&ccedil;a de Mensagem</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
