<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-confmonitor" name="task-confmonitor"></a></p>

<h4><a id="sthref192" name="sthref192"></a>Para Configurar o Servi&ccedil;o de Monitoramento</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Para abrir a p&aacute;gina Servi&ccedil;o de Monitoramento, proceda de uma das formas a seguir:</p>
<ul>
<li>
<p>Selecione o n&oacute; Dados de Monitoramento e clique no link Configurar Monitoramento relativo &agrave; inst&acirc;ncia do servidor cujo monitoramento voc&ecirc; deseja configurar. Para configurar o monitoramento de um cluster, escolha qualquer inst&acirc;ncia do cluster.</p>
</li>
</ul>
<ul>
<li>
<p>Sob o n&oacute; Configura&ccedil;&otilde;es, expanda a configura&ccedil;&atilde;o da inst&acirc;ncia ou cluster do servidor cujo monitoramento voc&ecirc; deseja configurar e expanda o n&oacute; Monitoramento.</p>
</li>
</ul>
<p>A p&aacute;gina Servi&ccedil;o de Monitoramento ser&aacute; aberta.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Servi&ccedil;o de Monitoramento Ativado, para ativar o monitoramento para o GlassFish Server, ou cancele a sele&ccedil;&atilde;o da caixa de sele&ccedil;&atilde;o para desativar o monitoramento.</p>
<p>Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Monitoramento MBeans Ativado, para implantar todos os MBeans necess&aacute;rios para o monitoramento, ou cancele a sele&ccedil;&atilde;o da caixa de sele&ccedil;&atilde;o para cancelar a implanta&ccedil;&atilde;o destes MBeans.</p>
<p>Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
<p>Se a caixa de sele&ccedil;&atilde;o n&atilde;o estiver marcada, n&atilde;o ser&aacute; poss&iacute;vel exibir os dados de monitoramento no Console de Administra&ccedil;&atilde;o, mesmo se a caixa de sele&ccedil;&atilde;o Servi&ccedil;o de Monitoramento estiver selecionada. Em vez disso, use a linha de comando para exibir os dados de monitoramento. Se voc&ecirc; desmarcar a caixa de sele&ccedil;&atilde;o, a mem&oacute;ria do GlassFish Server ser&aacute; reduzida.</p>
</li>
<li>
<p>Marque a caixa DTrace Ativado para ativar o uso do recurso Solaris DTrace.</p>
<p>Para usar o recurso Solaris DTrace, voc&ecirc; tamb&eacute;m precisa ter o Oracle Enterprise Manager DTrace Monitoring. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>Na tabela, execute uma das seguintes a&ccedil;&otilde;es:</p>
<ul>
<li>
<p>Na coluna N&iacute;vel de Monitoramento, selecione LOW ou HIGH na lista drop-down, para um ou mais componentes na coluna Componente, para ativar o monitoramento para esses componentes.</p>
</li>
<li>
<p>Marque as caixas de sele&ccedil;&atilde;o ao lado de um ou mais componentes, depois selecione LOW ou HIGH na lista drop-down N&iacute;vel na parte superior da tabela e clique no bot&atilde;o Alterar N&iacute;vel, para definir o n&iacute;vel de monitoramento para aquele valor , para todos esses componentes.</p>
</li>
</ul>
<p>N&atilde;o h&aacute; diferen&ccedil;as entre os n&iacute;veis de monitoramento oferecidos pelas op&ccedil;&otilde;es LOW e HIGH, nesta vers&atilde;o. Para desativar o monitoramento de um ou mais componentes, selecione OFF. O valor default &eacute; OFF.</p>
<p>&Eacute; preciso implantar uma aplica&ccedil;&atilde;o, componente ou servi&ccedil;o, antes de configurar o monitoramento para o mesmo.</p>
</li>
<li>
<p>Clique em Salvar.</p>
</li>
</ol>
<a id="sthref193" name="sthref193"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-appmonitoringdata.html">Para Exibir Dados de Monitoramento da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-servermonitoringdata.html">Para Exibir Dados de Monitoramento do Servidor</a></p>
</li>
<li>
<p><a href="task-resourcemonitoringdata.html">Para Exibir Dados de Monitoramento do Recurso</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
