<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-endpoint" name="task-endpoint"></a><a id="GHCOM00163" name="GHCOM00163"></a></p>

<h4><a id="sthref76" name="sthref76"></a><a id="sthref77" name="sthref77"></a><a id="sthref78" name="sthref78"></a>Para Exibir Informa&ccedil;&otilde;es do Ponto Final de um Web Service</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, selecione o n&oacute; Aplica&ccedil;&otilde;es.</p>
<p>A p&aacute;gina Aplica&ccedil;&otilde;es ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Aplica&ccedil;&otilde;es, clique no nome do Web Service cujas informa&ccedil;&otilde;es do ponto final voc&ecirc; est&aacute; exibindo.</p>
<p>O nome pode incluir um identificador de vers&atilde;o opcional, que segue o nome e &eacute; separado do nome por dois-pontos (<code>:</code>). Para obter mais informa&ccedil;&otilde;es sobre vers&otilde;es modulares ou da aplica&ccedil;&atilde;o, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> em <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
<p>A p&aacute;gina Editar Aplica&ccedil;&atilde;o ser&aacute; aberta.</p>
</li>
<li>
<p>Na tabela M&oacute;dulos e Componentes, clique no link Exibir Ponto Final para o subcomponente.</p>
<p>A p&aacute;gina Informa&ccedil;&otilde;es do Ponto Final dos Web Services ser&aacute; aberta.</p>
</li>
<li>
<p>Se o link do Testador estiver vis&iacute;vel, clique neste link para exibir uma p&aacute;gina que permite fornecer par&acirc;metros para testar os m&eacute;todos do Web Service.</p>
<p>O link do Testador ficar&aacute; vis&iacute;vel se o Tipo de Implanta&ccedil;&atilde;o n&atilde;o for RI (por exemplo, se for 109). A p&aacute;gina Testador ser&aacute; aberta em uma nova janela ou guia do browser.</p>
</li>
<li>
<p>Clique no link WSDL para exibir o arquivo WSDL (Web Services Definition Language) do ponto final.</p>
<p>O arquivo WSDL &eacute; aberto em uma nova janela ou guia do browser.</p>
<p>Observe que alguns Web browsers tentam interpretar o c&oacute;digo-fonte WSDL quando voc&ecirc; clica no link WSDL e exibem uma p&aacute;gina em branco. Nesses browsers, utilize o comando Exibir c&oacute;digo-fonte na p&aacute;gina em branco para exibir o c&oacute;digo-fonte WSDL.</p>
</li>
<li>
<p>Clique no link Nome da Aplica&ccedil;&atilde;o ou no bot&atilde;o Voltar para retornar &agrave; p&aacute;gina Editar Aplica&ccedil;&atilde;o.</p>
</li>
</ol>
<a id="sthref79" name="sthref79"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-applistdeployed.html">Para Exibir uma Lista de Aplica&ccedil;&otilde;es Implantadas</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">Para Implantar uma Aplica&ccedil;&atilde;o Web</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">Para Implantar uma Aplica&ccedil;&atilde;o Enterprise</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">Para Implantar um Cliente da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">Para Implantar um M&oacute;dulo Conector</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">Para Implantar um EJB Jar</a></p>
</li>
<li>
<p><a href="task-appedit.html">Para Editar uma Aplica&ccedil;&atilde;o Implantada</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">Para Exibir Descritores de uma Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-applaunch.html">Para Ativar uma Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">Para Acionar um Cliente da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">Para Fazer Download de Stubs do Cliente da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appredeploy.html">Para Reimplantar uma Aplica&ccedil;&atilde;o Implantada</a></p>
</li>
<li>
<p><a href="task-apprestart.html">Para Recarregar uma Aplica&ccedil;&atilde;o Implantada</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">Para Exibir Recursos do Escopo da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">Para Modificar Recursos do Escopo da Aplica&ccedil;&atilde;o</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
