<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-messagesecurityconfigedit" name="task-messagesecurityconfigedit"></a><a id="GHCOM00205" name="GHCOM00205"></a></p>

<h4><a id="sthref172" name="sthref172"></a>Para Editar uma Configura&ccedil;&atilde;o de Seguran&ccedil;a de Mensagem</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Para ativar a seguran&ccedil;a de mensagens para pontos finais de Web services implantados no GlassFish Server, voc&ecirc; deve especificar um provedor a ser usado por default no servidor. Se voc&ecirc; ativar a seguran&ccedil;a de mensagens de um provedor default, tamb&eacute;m ser&aacute; necess&aacute;rio permitir que os provedores sejam usados por clientes dos Web Services implantados no GlassFish Server. Informa&ccedil;&otilde;es sobre como ativar os provedores usados pelos clientes s&atilde;o discutidas em <a href="task-enablemesec4appclients.html">Para Ativar a Seguran&ccedil;a de Mensagem para Clientes da Aplica&ccedil;&atilde;o</a>.</p>
<p>Para ativar a seguran&ccedil;a de mensagens de chamadas de Web Services de pontos finais implantados, voc&ecirc; deve especificar um provedor de cliente default. Se voc&ecirc; tiver ativado um provedor cliente default para GlassFish Server, dever&aacute; assegurar que quaisquer servi&ccedil;os chamados de pontos de extremidades implantados no GlassFish Server estejam compativelmente configurados para seguran&ccedil;a de camada de mensagens.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&atilde;o.</p>
</li>
<li>
<p>Expanda o n&oacute; Seguran&ccedil;a.</p>
</li>
<li>
<p>Selecione o n&oacute; Seguran&ccedil;a de Mensagem.</p>
<p>A p&aacute;gina Configura&ccedil;&otilde;es de Seguran&ccedil;a de Mensagem ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Configura&ccedil;&otilde;es de Seguran&ccedil;a de Mensagem, clique no nome da Camada de Autentica&ccedil;&atilde;o da configura&ccedil;&atilde;o que voc&ecirc; est&aacute; editando.</p>
<p>Por default, a &uacute;nica configura&ccedil;&atilde;o de seguran&ccedil;a de mensagem definida &eacute; SOAP.</p>
<p>A p&aacute;gina Editar Configura&ccedil;&atilde;o de Seguran&ccedil;a de Mensagem ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Editar Configura&ccedil;&atilde;o de Seguran&ccedil;a de Mensagem, da lista drop-down Provedor Default, selecione um provedor do servidor.</p>
<p>O provedor do servidor default, tamb&eacute;m chamado de provedor default, identifica o provedor do servidor chamado para uma aplica&ccedil;&atilde;o que n&atilde;o identifica um provedor do servidor espec&iacute;fico. As op&ccedil;&otilde;es dispon&iacute;veis s&atilde;o <code>ServerProvider</code>, <code>XWS_ServerProvider</code>, ou nenhuma. Por default, nenhum provedor &eacute; selecionado, de forma que o GlassFish Server n&atilde;o ir&aacute; chamar um provedor de seguran&ccedil;a de mensagens no servidor. Geralmente, o <code>ServerProvider</code> &eacute; selecionado como provedor default.</p>
</li>
<li>
<p>Na lista drop-down Provedor Cliente Default, selecione um provedor de cliente.</p>
<p>O provedor do cliente default identifica o provedor de cliente chamado por uma aplica&ccedil;&atilde;o que n&atilde;o identifica um provedor de cliente espec&iacute;fico. As op&ccedil;&otilde;es dispon&iacute;veis s&atilde;o <code>ClientProvider</code>, <code>XWS_ClientProvider</code>, ou nenhuma. Por default, nenhum provedor &eacute; selecionado, de forma que o GlassFish Server n&atilde;o ir&aacute; chamar um provedor de seguran&ccedil;a de mensagens no cliente. Geralmente, nenhum &eacute; selecionado para o provedor de cliente default. Selecione o <code>ClientProvider</code> para ativar um provedor default e a pol&iacute;tica de prote&ccedil;&atilde;o de mensagens a ser aplicada &agrave;s chamadas dos Web Services que se originam de pontos finais de Web Services implantados no GlassFish Server.</p>
</li>
<li>
<p>Clique em Salvar.</p>
</li>
<li>
<p>Para obter instru&ccedil;&otilde;es sobre como modificar pol&iacute;ticas de prote&ccedil;&atilde;o de mensagens de provedores de cliente ou servidor ativados, consulte <a href="task-messagesecurityproviderconfigedit.html">Para Editar uma Configura&ccedil;&atilde;o do Provedor de Seguran&ccedil;a da Mensagem</a>.</p>
</li>
</ol>
<a id="sthref173" name="sthref173"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">Para Configurar os Recursos de GlassFish Server Para Usar pelos Provedores de Seguran&ccedil;a da Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">Para Criar uma Configura&ccedil;&atilde;o de Seguran&ccedil;a de Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">Para Deletar uma Configura&ccedil;&atilde;o de Seguran&ccedil;a de Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">Para Criar uma Configura&ccedil;&atilde;o de Seguran&ccedil;a de Provedor</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">Para Editar uma Configura&ccedil;&atilde;o do Provedor de Seguran&ccedil;a da Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">Para Deletar uma Configura&ccedil;&atilde;o do Provedor de Seguran&ccedil;a de Mensagem</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">Para Ativar a Seguran&ccedil;a de Mensagem para Clientes da Aplica&ccedil;&atilde;o</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
