<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-eelogging" name="task-eelogging"></a><a id="GHCOM00177" name="GHCOM00177"></a></p>

<h4><a id="sthref116" name="sthref116"></a>Para Configurar Defini&ccedil;&otilde;es Gerais de Log</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&otilde;es.</p>
</li>
<li>
<p>No n&oacute; Configura&ccedil;&otilde;es, clique na configura&ccedil;&atilde;o de cluster ou inst&acirc;ncia de servidor na qual deseja configurar as Defini&ccedil;&otilde;es do Logger.</p>
<p>A p&aacute;gina Configura&ccedil;&atilde;o ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Configura&ccedil;&atilde;o, clique em Defini&ccedil;&otilde;es do Logger.</p>
<p>A p&aacute;gina Defini&ccedil;&otilde;es do Logger da configura&ccedil;&atilde;o selecionada ser&aacute; aberta.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Gravar no Log do Sistema Ativado para enviar a sa&iacute;da de log para o recurso <code>syslog</code>, al&eacute;m do log do servidor.</p>
<p>Esse recurso est&aacute; dispon&iacute;vel apenas nos sistemas Solaris e Linux. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Registrar na Console para enviar a sa&iacute;da do registro para a console do sistema.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Rota&ccedil;&atilde;o na Altera&ccedil;&atilde;o da Data para rotacionar os arquivos de log do servidor todo dia &agrave; meia-noite.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Modo de V&aacute;rias Linhas Ativado para formatar mensagens de log de forma que elas se tornem mais f&aacute;ceis de ler. O corpo da mensagem de log &eacute; recuado e come&ccedil;a em uma nova linha.</p>
</li>
<li>
<p>Na lista drop-down Formato de Log da Console, selecione o formato de log para a console. A op&ccedil;&atilde;o default &eacute; ODL (Oracle Diagnostics Logging). A outra op&ccedil;&atilde;o &eacute; ULF (UniformLogFormatter).</p>
</li>
<li>
<p>Da lista drop-down Formato de Registro do Arquivo de Log, selecione o formato de log para o arquivo de log do servidor. A op&ccedil;&atilde;o default &eacute; ODL.</p>
</li>
<li>
<p>No campo Limite de Rota&ccedil;&atilde;o de Arquivo, digite o tamanho em bytes que o arquivo de log do servidor deve alcan&ccedil;ar antes de ser rotacionado.</p>
<p>Quando o log do servidor alcan&ccedil;ar o tamanho especificado, o GlassFish Server cria um novo arquivo vazio denominado<code>server.log</code> e renomeia o arquivo antigo <code>server.log_</code><i>data</i>, onde <i>data</i> &eacute; a data e a hora em que o arquivo foi rotacionado. O valor default &eacute; 2 megabytes. O valor m&iacute;nimo para o limite &eacute; de 500 quilobytes; se voc&ecirc; especificar um valor menor, o arquivo ser&aacute; rotacionado quando alcan&ccedil;ar 500 KB. Para desativar a rota&ccedil;&atilde;o de arquivos de log, defina o valor para 0.</p>
</li>
<li>
<p>No campo Limite de Tempo de Rota&ccedil;&atilde;o de Arquivo, digite o n&uacute;mero de minutos ap&oacute;s o qual o log do servidor deve ser rotacionado.</p>
<p>O valor default &eacute; 0, o que significa que o arquivo &eacute; rotacionado quando ele alcan&ccedil;a o tamanho especificado no campo Limite de Rota&ccedil;&atilde;o de Arquivo.</p>

<hr>
<p><b>Observa&ccedil;&atilde;o:</b></p>
Se voc&ecirc; especificar um ou mais minutos, o limite de tempo tem preced&ecirc;ncia sobre o limite de tamanho especificado pelo campo Limite de Rota&ccedil;&atilde;o de Arquivo.
<hr>

</li>
<li>
<p>No campo Frequ&ecirc;ncia de Esvaziamento, digite o n&uacute;mero m&aacute;ximo de mensagens a serem escritas de cada vez a partir da fila para o log do servidor.</p>
<p>O valor default &eacute; 1.</p>
</li>
<li>
<p>No campo M&aacute;ximo de Arquivos de Hist&oacute;rico, digite o n&uacute;mero m&aacute;ximo de arquivos de log que o GlassFish Server deve manter antes de deletar o arquivo mais antigo. Se voc&ecirc; definir este valor como zero (0), o GlassFish Server n&atilde;o deletar&aacute; os antigos arquivos.</p>
</li>
<li>
<p>No campo Arquivo de Log, digite um nome alternativo ou local para o arquivo de log do servidor.</p>
<p>A localiza&ccedil;&atilde;o default &eacute; <code>${com.sun.aas.instanceRoot}/logs/server.log</code>.</p>
</li>
<li>
<p>No campo Handler de Log, digite o nome da classe absoluta de um handler de log personalizado.</p>
<p>Um handler de log personalizado permite que voc&ecirc; envie logs para um destino diferente de <code>server.log</code> ou <code>syslog</code> O handler personalizado deve estender a classe <code>java.util.logging.ConsoleHandler</code> (uma API compat&iacute;vel com JSR 047). Coloque a classe do handler no caminho da classe do GlassFish Server, para que o handler seja instalado durante a inicializa&ccedil;&atilde;o do servidor.</p>
</li>
<li>
<p>Clique em Salvar.</p>

<hr>
<p><b>Observa&ccedil;&atilde;o:</b></p>
Dependendo da configura&ccedil;&atilde;o para a qual o log foi ativado, pode ser necess&aacute;rio reiniciar o servidor.
<p>Tamb&eacute;m pode ser necess&aacute;rio reiniciar o servidor se o nome do arquivo de log estiver alterado na defini&ccedil;&atilde;o default. Ser&aacute; exibida a mensagem <code>Reinicializa&ccedil;&atilde;o necess&aacute;ria</code> no canto superior direito do Console de Administra&ccedil;&atilde;o caso seja necess&aacute;rio reiniciar o servidor.</p>

<hr>

</li>
</ol>
<a id="sthref117" name="sthref117"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-eelogginglevels.html">Para Configurar N&iacute;veis do Log</a></p>
</li>
<li>
<p><a href="task-logging-max-logfiles.html">Para Alterar o Limite do N&uacute;mero de Arquivos de Log Rotacionados</a></p>
</li>
<li>
<p><a href="task-logviewer.html">Para Exibir Arquivos de Log do DAS</a></p>
</li>
<li>
<p><a href="task-collectdomainlogs.html">Para Coletar e Fazer Download de Logs do Dom&iacute;nio</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
