<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-lifecyclemodulenew" name="task-lifecyclemodulenew"></a><a id="GHCOM00169" name="GHCOM00169"></a></p>

<h4><a id="sthref100" name="sthref100"></a>Para Criar um M&oacute;dulo do Ciclo de Vida</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, selecione o n&oacute; M&oacute;dulos de Ciclo de Vida.</p>
<p>A p&aacute;gina M&oacute;dulos de Ciclo de Vida ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina M&oacute;dulos de Ciclo de Vida, clique em Novo.</p>
<p>A p&aacute;gina Novo M&oacute;dulo de Ciclo de Vida ser&aacute; aberta.</p>
</li>
<li>
<p>No campo Nome, digite um nome para o m&oacute;dulo de ciclo de vida.</p>
</li>
<li>
<p>No campo Nome da Classe, digite o nome totalmente qualificado do arquivo de classe do m&oacute;dulo de ciclo de vida.</p>
<p>A classe deve implementar a interface <code>com.sun.appserv.server.LifecycleListener</code>.</p>
</li>
<li>
<p>No campo Classpath, digite o classpath do m&oacute;dulo do ciclo de vida.</p>
<p>O classpath especifica onde o m&oacute;dulo do ciclo de vida est&aacute; localizado. O valor default &eacute; domain-dir<code>/applications</code>. Se o m&oacute;dulo j&aacute; estiver neste diret&oacute;rio (isto &eacute;, no classpath do servidor), esse campo poder&aacute; ser deixado em branco.</p>
</li>
<li>
<p>No campo Ordem de Carga, digite um valor especificando a ordem na qual esse m&oacute;dulo do ciclo de vida deve ser carregado na inicializa&ccedil;&atilde;o.</p>
<p>Os m&oacute;dulos com valores inteiros menores de ordem de carga s&atilde;o carregados antes. O valor pode variar de 101 at&eacute; o <code>MAXINT</code> do sistema operacional. Valores de 1 a 100 s&atilde;o reservados.</p>
</li>
<li>
<p>No campo Descri&ccedil;&atilde;o, digite uma descri&ccedil;&atilde;o do m&oacute;dulo de ciclo de vida.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Status Ativado para ativar o m&oacute;dulo de ciclo de vida.</p>
<p>Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Inicializa&ccedil;&atilde;o de Inst&acirc;ncia de Preven&ccedil;&atilde;o no Caso de Falha ao Carregar para especificar que o servidor seja submetido a shutdown em caso de falha ao carregar o m&oacute;dulo do ciclo de vida.</p>
<p>Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>Para adicionar inst&acirc;ncias de servidor e clusters do alvo nos quais ser&atilde;o implantados o m&oacute;dulo do ciclo de vida, selecione-os na lista Alvos dispon&iacute;veis e utilize o bot&atilde;o Adicionar para mov&ecirc;-los para a lista Alvos selecionados.</p>
<p>A op&ccedil;&atilde;o Alvo aparece se clusters ou inst&acirc;ncias de servidores standalone, al&eacute;m da inst&acirc;ncia default do servidor (<code>server</code>), existirem. Por default, o m&oacute;dulo do ciclo de vida est&aacute; ativado na inst&acirc;ncia default do servidor, com o nome <code>server</code>. Utilize a bot&atilde;o Adicionar Tudo para implantar em todos os alvos. Utilize os bot&otilde;es Remover e Remover Tudo para remover os alvos da lista Alvos Selecionados.</p>
</li>
<li>
<p>Clique em OK.</p>
</li>
</ol>
<a id="sthref101" name="sthref101"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-lifecyclemoduleedit.html">Para Editar um M&oacute;dulo do Ciclo de Vida</a></p>
</li>
<li>
<p><a href="task-lifecyclemoduledelete.html">Para Deletar um M&oacute;dulo de Ciclo de Vida</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
