<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-logging-max-logfiles" name="task-logging-max-logfiles"></a><a id="GHCOM00179" name="GHCOM00179"></a></p>

<h4><a id="sthref121" name="sthref121"></a><a id="sthref122" name="sthref122"></a><a id="sthref123" name="sthref123"></a>Para Alterar o Limite do N&uacute;mero de Arquivos de Log Rotacionados</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Quando o GlassFish Server rotaciona um arquivo de log, ele cria um arquivo novo e vazio com o nome <code>server.log</code> e renomeia o arquivo antigo <code>server.log</code><i>date</i>, em que <i>date</i> representa a data e o hor&aacute;rio em que o arquivo foi rotacionado.</p>
<p>Por default, o GlassFish Server limita o n&uacute;mero de arquivos do log rotacionados para 10. Quando esse limite for alcan&ccedil;ado, o arquivo do log mais antigo ser&aacute; deletado da pr&oacute;xima vez em que o GlassFish Server rotacionar um arquivo de log.</p>
<p>Se necess&aacute;rio, &eacute; poss&iacute;vel alterar o limite do n&uacute;mero de arquivos do log rotacionados. Os novos limites definidos se aplicam aos arquivos de log rotacionados para o log de acesso e o log do servidor.</p>
<ol>
<li>
<p>Defina a propriedade de sistema <code>com.sun.enterprise.server.logging.max_history_files</code> para o n&uacute;mero m&aacute;ximo permitido para a manuten&ccedil;&atilde;o de arquivos de log rotacionados.</p>
<p>Para obter informa&ccedil;&otilde;es sobre como definir uma propriedade de sistema, consulte <a href="task-systemproperties.html">Para Gerenciar Propriedades do Sistema</a>.</p>
<p>O comportamento da propriedade de sistema the <code>com.sun.enterprise.server.logging.max_history_files</code> &eacute; como se segue:</p>
<ul>
<li>
<p>Se a propriedade n&atilde;o estiver definida, o GlassFish Server mant&eacute;m um n&uacute;mero m&aacute;ximo de 10 arquivos do log rotacionados.</p>
</li>
<li>
<p>Se a propriedade estiver definida como um n&uacute;mero inv&aacute;lido ou nulo, o GlassFish Server mant&eacute;m um n&uacute;mero m&aacute;ximo de 10 arquivos do log rotacionados.</p>
</li>
<li>
<p>Se a propriedade estiver definida como 0, o GlassFish Server n&atilde;o mant&eacute;m arquivos do log rotacionados.</p>
</li>
</ul>
</li>
</ol>
<a id="sthref124" name="sthref124"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-eelogging.html">Para Configurar Defini&ccedil;&otilde;es Gerais de Log</a></p>
</li>
<li>
<p><a href="task-eelogginglevels.html">Para Configurar N&iacute;veis do Log</a></p>
</li>
<li>
<p><a href="task-logviewer.html">Para Exibir Arquivos de Log do DAS</a></p>
</li>
<li>
<p><a href="task-collectdomainlogs.html">Para Coletar e Fazer Download de Logs do Dom&iacute;nio</a></p>
</li>
<li>
<p><a href="task-systemproperties.html">Para Gerenciar Propriedades do Sistema</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
