<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-messagesecurityconfigdelete" name="task-messagesecurityconfigdelete"></a><a id="GHCOM00206" name="GHCOM00206"></a></p>

<h4><a id="sthref174" name="sthref174"></a>Para Deletar uma Configura&ccedil;&atilde;o de Seguran&ccedil;a de Mensagem</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&atilde;o.</p>
</li>
<li>
<p>Expanda o n&oacute; Seguran&ccedil;a.</p>
</li>
<li>
<p>Selecione o n&oacute; Seguran&ccedil;a de Mensagem.</p>
<p>A p&aacute;gina Configura&ccedil;&otilde;es de Seguran&ccedil;a de Mensagem ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Configura&ccedil;&otilde;es de Seguran&ccedil;a de Mensagem, marque a caixa de sele&ccedil;&atilde;o &agrave; esquerda da Configura&ccedil;&atilde;o de Seguran&ccedil;a de Mensagens que voc&ecirc; est&aacute; deletando.</p>

<hr>
<p><b>Observa&ccedil;&atilde;o:</b></p>
&Eacute; poss&iacute;vel criar ou deletar os provedores de seguran&ccedil;a de mensagem da configura&ccedil;&atilde;o <code>server-config</code> default. Os &uacute;nicos provedores de seguran&ccedil;a de mensagem que s&atilde;o suportados no <code>server-config</code> default s&atilde;o SOAP e HttpServlet. Como estes dois provedores de mensagem j&aacute; s&atilde;o criados por default quando o GlassFish Server &eacute; instalado, o bot&atilde;o Deletar n&atilde;o &eacute; exibido na p&aacute;gina Configura&ccedil;&otilde;es de Seguran&ccedil;a de Mensagem no <code>server-config</code> default.
<hr>

</li>
<li>
<p>Clique em Deletar.</p>
</li>
</ol>
<a id="sthref175" name="sthref175"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">Para Configurar os Recursos de GlassFish Server Para Usar pelos Provedores de Seguran&ccedil;a da Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">Para Criar uma Configura&ccedil;&atilde;o de Seguran&ccedil;a de Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">Para Editar uma Configura&ccedil;&atilde;o de Seguran&ccedil;a de Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">Para Criar uma Configura&ccedil;&atilde;o de Seguran&ccedil;a de Provedor</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">Para Editar uma Configura&ccedil;&atilde;o do Provedor de Seguran&ccedil;a da Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">Para Deletar uma Configura&ccedil;&atilde;o do Provedor de Seguran&ccedil;a de Mensagem</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">Para Ativar a Seguran&ccedil;a de Mensagem para Clientes da Aplica&ccedil;&atilde;o</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
