<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-filter-logs" name="task-filter-logs"></a></p>

<h4>Para Filtrar Registros de Log Exibidos</h4>
<a name="BEGIN" id="BEGIN"></a><a id="sthref26" name="sthref26"></a>
<h5>Antes de Come&ccedil;ar</h5>
<p>Certifique-se de estar exibindo os arquivos de log do servi&ccedil;o de administra&ccedil;&atilde;o de dom&iacute;nios (DAS), uma inst&acirc;ncia clusterizada do GlassFish Server ou uma inst&acirc;ncia standalone. Para obter mais informa&ccedil;&otilde;es, consulte os seguintes t&oacute;picos:</p>
<ul>
<li>
<p><a href="task-logviewer.html">Para Exibir Arquivos de Log do DAS</a></p>
</li>
<li>
<p><a href="../../../cluster/en/help/task-view-logs-clustered-instance.html">Para&nbsp;Exibir Arquivos de Log de &nbsp;uma Inst&acirc;ncia Clusterizada do GlassFish Server</a></p>
</li>
<li>
<p><a href="../../../cluster/en/help/task-view-logs-standalone-instance.html">Para&nbsp;Exibir Arquivos de Log de &nbsp;uma Inst&acirc;ncia Standalone do GlassFish Server</a></p>
</li>
</ul>
<ol>
<li>
<p>Na &aacute;rea Crit&eacute;rio de Pesquisa, filtre os registros por conte&uacute;do, per&iacute;odo de tempo e n&iacute;vel de log.</p>
<ol type="a">
<li>
<p>Para exibir somente os registros que cont&ecirc;m o texto espec&iacute;fico, na caixa Pesquisa do Texto, digite o texto.</p>
<p>A pesquisa faz distin&ccedil;&atilde;o entre mai&uacute;sculas e min&uacute;sculas.</p>
</li>
<li>
<p>Para selecionar o per&iacute;odo de tempo cujos registros de log s&atilde;o exibidos, utilize a op&ccedil;&atilde;o Timestamp.</p>
<ul>
<li>
<p>Para exibir as mensagens mais recentes, selecione Mais Recente (default).</p>
</li>
<li>
<p>Para exibir as mensagens apenas de um determinado per&iacute;odo de tempo, selecione Faixa Espec&iacute;fica e digite os valores de data e hora nos campos De e At&eacute; que aparecem.</p>
<p>O valor Data deve ter o seguinte formato:</p>
<pre>
<i>MM</i>/<i>DD</i>/<i>YY</i>
</pre>
<p><code><i>MM</i></code> &eacute; um n&uacute;mero inteiro na faixa de 1-12 relativo ao n&uacute;mero do m&ecirc;s, por exemplo: 1 para janeiro ou 10 para outubro. <code><i>DD</i></code> &eacute; um n&uacute;mero inteiro na faixa de 1-31 relativo ao dia do m&ecirc;s. <code><i>YY</i></code> s&atilde;o os &uacute;ltimos dois d&iacute;gitos do ano, por exemplo: 11 para o ano de 2011.</p>
<p>Por exemplo, para especificar a data 1 de fevereiro de 2011, digite <code>2/1/11</code> no campo Data.</p>
<p>O valor Hora deve ter o seguinte formato:</p>
<pre>
<i>hh</i>:<i>mm</i>:<i>ss</i>.<i>SSS</i>
</pre>
<p><code><i>hh</i></code> &eacute; um n&uacute;mero inteiro na faixa de 0-23 que representa a hora. Para representar as horas do per&iacute;odo da tarde, use n&uacute;meros inteiros na faixa de 12-23, por exemplo: 14 para representar 2 horas da tarde. <code><i>mm</i></code> &eacute; um n&uacute;mero inteiro na faixa de 0-59 que representa o n&uacute;mero de minutos passados em rela&ccedil;&atilde;o &agrave; hora. <code><i>ss</i></code> &eacute; um n&uacute;mero inteiro na faixa de 0-59 que representa o n&uacute;mero de segundos. <code><i>SSS</i></code> &eacute; um n&uacute;mero inteiro de tr&ecirc;s d&iacute;gitos, com zeros &agrave; esquerda, se necess&aacute;rio, na faixa de 000-999, que representa o n&uacute;mero de milissegundos.</p>
<p>Por exemplo, para especificar a hora de 5:10 PM, digite <code>17:10:00.000</code> no campo Hora.</p>
<p>Se o valor De for posterior ao valor Para, aparecer&aacute; uma mensagem de erro.</p>
</li>
</ul>
</li>
<li>
<p>Filtrar mensagens pelo n&iacute;vel de log.</p>
<p>Para garantir que as mensagens que voc&ecirc; deseja exibir apare&ccedil;am no log do servidor, primeiro defina os n&iacute;veis apropriados de log na p&aacute;gina N&iacute;veis de Log do M&oacute;dulo. Consulte <a href="task-eelogginglevels.html">Para Configurar N&iacute;veis do Log</a> para obter instru&ccedil;&otilde;es.</p>
<p>Se optar por filtrar as mensagens de log pelo n&iacute;vel de log, apenas as mensagens que correspondam aos crit&eacute;rios de filtro especificados ser&atilde;o mostradas. Contudo, essa filtragem n&atilde;o afeta quais mensagens s&atilde;o registradas no log do servidor.</p>
<ol>
<li>
<p>Na lista drop-down N&iacute;vel de Log, selecione o n&iacute;vel de log.</p>
</li>
<li>
<p>Para exibir mensagens somente no n&iacute;vel selecionado, selecione a op&ccedil;&atilde;o N&atilde;o Incluir Mais Mensagens Graves</p>
<p>Por default, s&atilde;o exibidas todas as mensagens no log do servidor no n&iacute;vel de log escolhido e nos n&iacute;veis mais graves.</p>
</li>
</ol>
</li>
</ol>
</li>
<li>
<p>Na &aacute;rea Pesquisa Avan&ccedil;ada, filtre registros pelo namespace do logger e selecione a quantidade de informa&ccedil;&otilde;es que ser&aacute; exibida.</p>
<ol type="a">
<li>
<p>Clique no link Pesquisa Avan&ccedil;ada.</p>
<p>A &aacute;rea Pesquisa Avan&ccedil;ada &eacute; adicionada &agrave; janela Visualizador de Log.</p>
</li>
<li>
<p>Para filtrar por m&oacute;dulo, na lista drop-down Logger, selecione um ou mais namespaces.</p>
<p>Utilize Shift-click ou Control-click para escolher v&aacute;rios namespaces.</p>
<p>Selecionar um namespace em um n&iacute;vel mais elevado seleciona todos os namespaces abaixo dele. Por exemplo, se <code>javax.enterprise.system</code> for selecionado, os loggers de todos os m&oacute;dulos naquele namespace s&atilde;o selecionados: <code>javax.enterprise.system.core</code> , <code>javax.enterprise.system.tools.admin</code> e assim por diante.</p>
</li>
<li>
<p>Para exibir mensagens dos loggers de uma aplica&ccedil;&atilde;o espec&iacute;fica, no campo Logger Personalizado, digite o nome de Logger em uma linha separada.</p>
<p>Se a aplica&ccedil;&atilde;o tiver diversos m&oacute;dulos, voc&ecirc; poder&aacute; exibir qualquer m&oacute;dulo ou todos os m&oacute;dulos. Por exemplo, uma aplica&ccedil;&atilde;o pode ter os seguintes loggers:</p>
<pre>
com.example.myapp.module1
com.example.myapp.module2
com.example.myapp.module3
</pre>
<p>Para exibir as mensagens de todos os m&oacute;dulos na aplica&ccedil;&atilde;o, digite <code>com.mycompany.myapp</code> . Para exibir apenas mensagens do <code>module2</code>, digite <code>com.example.myapp.module2</code>.</p>
<p>Quando voc&ecirc; especifica um ou mais loggers, as mensagens dos m&oacute;dulos do GlassFish Server aparecem apenas se voc&ecirc; as especificar explicitamente na &aacute;rea do Logger.</p>
</li>
<li>
<p>Na lista drop-down Exibir, selecione o n&uacute;mero de mensagens que ser&aacute; exibido.</p>
<p>O n&uacute;mero default de mensagens exibidas &eacute; 40. Outras op&ccedil;&otilde;es s&atilde;o 100, 250 e 1.000.</p>
</li>
<li>
<p>Para exibir os rastreamentos de pilha, desmarque a op&ccedil;&atilde;o Limitar Mensagens Excessivamente Longas.</p>
<p>Por default, os rastreamentos de pilha n&atilde;o aparecem no visualizador. Para exibi-los, clique no link (detalhes) para obter uma mensagem.</p>
</li>
<li>
<p>Para ocultar a &aacute;rea Pesquisa Avan&ccedil;ada, clique no link Pesquisa B&aacute;sica.</p>
</li>
</ol>
</li>
<li>
<p>Para especificar a inst&acirc;ncia e o arquivo de log associado que deseja exibir, utilize a &aacute;rea Modificar Pesquisa.</p>
<ul>
<li>
<p>Na lista drop-down Inst&acirc;ncia, selecione a inst&acirc;ncia.</p>
<p>O default &eacute; a inst&acirc;ncia inicialmente selecionada para exibir os arquivos de log. Se tiver optado por exibir os arquivos de log do servidor de administra&ccedil;&atilde;o de dom&iacute;nios (DAS), o default ser&aacute; o servidor, o qual representa o DAS.</p>
</li>
<li>
<p>Na lista drop-down Arquivo de Log, selecione o arquivo de log.</p>
<p>O default &eacute; <code>server.log</code>. As outras op&ccedil;&otilde;es dependem das defini&ccedil;&otilde;es do log no alvo selecionado.</p>
</li>
</ul>
</li>
<li>
<p>Na &aacute;rea Resultados da Pesquisa, personalize a exibi&ccedil;&atilde;o das mensagens de log.</p>
<p>A &aacute;rea Resultados da Pesquisa exibe as 40 entradas mais recentes no log do servidor, com as Defini&ccedil;&otilde;es nas p&aacute;ginas Defini&ccedil;&otilde;es de Log e N&iacute;veis de Log.</p>
<ul>
<li>
<p>Para ordenar as mensagens de outro modo, clique nas setas das colunas.</p>
</li>
<li>
<p>Para exibir a vers&atilde;o formatada de uma mensagem, clique no link (detalhes) da mensagem.</p>
<p>A janela Detalhes da Entrada do Log se abre, a qual cont&eacute;m uma vers&atilde;o formatada da mensagem.</p>
</li>
<li>
<p>Para exibir entradas anteriores e posteriores no arquivo de log, clique em Registros Antes de e Registros Depois de na parte superior da tabela.</p>
</li>
</ul>
</li>
</ol>
<a id="sthref27" name="sthref27"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-eelogging.html">Para Configurar Defini&ccedil;&otilde;es Gerais de Log</a></p>
</li>
<li>
<p><a href="task-eelogginglevels.html">Para Configurar N&iacute;veis do Log</a></p>
</li>
<li>
<p><a href="task-logviewer.html">Para Exibir Arquivos de Log do DAS</a></p>
</li>
<li>
<p><a href="../../../cluster/en/help/task-view-logs-clustered-instance.html">Para&nbsp;Exibir Arquivos de Log de &nbsp;uma Inst&acirc;ncia Clusterizada do GlassFish Server</a></p>
</li>
<li>
<p><a href="../../../cluster/en/help/task-view-logs-standalone-instance.html">Para&nbsp;Exibir Arquivos de Log de &nbsp;uma Inst&acirc;ncia Standalone do GlassFish Server</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
