<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-messagesecurityproviderconfignew" name="task-messagesecurityproviderconfignew"></a></p>

<h4><a id="sthref106" name="sthref106"></a>Para Criar uma Configura&ccedil;&atilde;o de Seguran&ccedil;a de Provedor</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Para criar uma nova configura&ccedil;&atilde;o de provedor de seguran&ccedil;a de mensagem, siga estas etapas:</p>
<a id="GHCOM313" name="GHCOM313"></a>
<h5>Antes de Come&ccedil;ar</h5>
<p>&Eacute; poss&iacute;vel criar ou deletar os provedores de seguran&ccedil;a de mensagem da configura&ccedil;&atilde;o <code>server-config</code> default. Os &uacute;nicos provedores de seguran&ccedil;a de mensagem que s&atilde;o suportados no <code>server-config</code> default s&atilde;o SOAP e HttpServlet. Como estes dois provedores de mensagem j&aacute; s&atilde;o criados por default quando o GlassFish Server &eacute; instalado, o bot&atilde;o Novo fica desativado na p&aacute;gina Configura&ccedil;&otilde;es de Seguran&ccedil;a de Mensagem no <code>server-config</code> default.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&atilde;o.</p>
</li>
<li>
<p>Expanda o n&oacute; Seguran&ccedil;a.</p>
</li>
<li>
<p>Selecione o n&oacute; Seguran&ccedil;a de Mensagem.</p>
<p>A p&aacute;gina Configura&ccedil;&otilde;es de Seguran&ccedil;a de Mensagem ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Configura&ccedil;&otilde;es de Seguran&ccedil;a de Mensagem, clique no nome da Camada de Autentica&ccedil;&atilde;o da configura&ccedil;&atilde;o que voc&ecirc; est&aacute; editando.</p>
<p>Por default, a &uacute;nica configura&ccedil;&atilde;o de seguran&ccedil;a de mensagem definida &eacute; SOAP.</p>
<p>A p&aacute;gina Editar Configura&ccedil;&atilde;o de Seguran&ccedil;a de Mensagem ser&aacute; aberta.</p>
</li>
<li>
<p>Clique na guia Provedores.</p>
<p>A p&aacute;gina Configura&ccedil;&otilde;es do Provedor ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Configura&ccedil;&otilde;es do Provedor, clique em Novo.</p>
<p>A p&aacute;gina Nova Configura&ccedil;&atilde;o do Provedor ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Nova Configura&ccedil;&atilde;o do Provedor, no campo ID do Provedor, digite um nome exclusivo para a configura&ccedil;&atilde;o do provedor.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o do Provedor Default para tornar esse provedor o provedor default.</p>
<p>O provedor default ser&aacute; chamado para qualquer aplica&ccedil;&atilde;o que n&atilde;o identifique um provedor espec&iacute;fico. Se o provedor for o provedor de cliente default, o provedor de servidor default, ou de ambos, &eacute; determinado pelo Tipo de Provedor.</p>
</li>
<li>
<p>Na lista drop-down Tipo de Provedor, selecione o tipo de provedor.</p>
<p>As op&ccedil;&otilde;es dispon&iacute;veis s&atilde;o:</p>
<dl>
<dt><code>client</code></dt>
<dd>
<p>Especifica que o provedor &eacute; o provedor de autentica&ccedil;&atilde;o do cliente.</p>
</dd>
<dt><code>server</code></dt>
<dd>
<p>Especifica que o provedor &eacute; o provedor de autentica&ccedil;&atilde;o do servidor.</p>
</dd>
<dt><code>client-server</code></dt>
<dd>
<p>Especifica que o provedor &eacute; um provedor de autentica&ccedil;&atilde;o do cliente e do servidor.</p>
</dd>
</dl>
</li>
<li>
<p>No campo Nome da Classe, digite o nome da classe de Implementa&ccedil;&atilde;o Java do provedor.</p>
<p>Provedores de autentica&ccedil;&atilde;o do cliente devem implementar a interface <code>com.sun.enterprise.security.jauth.ClientAuthModule</code>. Provedores do servidor devem implementar a interface <code>com.sun.enterprise.security.jauth.ServerAuthModule</code>. Os provedores de cliente-servidor devem implementar as duas interfaces.</p>
</li>
<li>
<p>Na &aacute;rea Pol&iacute;tica de Solicita&ccedil;&atilde;o, na lista Autenticar Origem, selecione o tipo da autentica&ccedil;&atilde;o exigida para a pol&iacute;tica de solicita&ccedil;&atilde;o.</p>
<p>A pol&iacute;tica de solicita&ccedil;&atilde;o determina o processamento da solicita&ccedil;&atilde;o que o provedor de autentica&ccedil;&atilde;o realiza. Os campos da pol&iacute;tica de solicita&ccedil;&atilde;o s&atilde;o opcionais, mas se eles n&atilde;o forem especificados, o provedor de autentica&ccedil;&atilde;o n&atilde;o autentica as mensagens solicitadas.</p>
<p>Selecione <code>remetente</code> para especificar a autentica&ccedil;&atilde;o do remetente da camada de mensagens (por exemplo, nome de usu&aacute;rio e senha) das mensagens solicitadas. Selecione <code>conte&uacute;do</code> para especificar autentica&ccedil;&atilde;o de conte&uacute;do (por exemplo, assinatura digital) das mensagens solicitadas. Deixe o campo vazio para n&atilde;o autenticar a origem das solicita&ccedil;&otilde;es. Por default, nenhum tipo de autentica&ccedil;&atilde;o &eacute; selecionado.</p>
<p>Para obter uma descri&ccedil;&atilde;o das a&ccedil;&otilde;es executadas pelos provedores de seguran&ccedil;a da mensagem de SOAP, consulte <a href="ref-configreq-respolicy.html">Configura&ccedil;&otilde;es da Pol&iacute;tica de Solicita&ccedil;&atilde;o e Resposta</a>.</p>
</li>
<li>
<p>Na lista drop-down Autenticar Destinat&aacute;rio, selecione se a autentica&ccedil;&atilde;o de destinat&aacute;rio ocorre antes ou depois da autentica&ccedil;&atilde;o de conte&uacute;do da pol&iacute;tica de solicita&ccedil;&atilde;o.</p>
<p>Selecione <code>before-content</code> ou <code>after-content</code> para solicitar autentica&ccedil;&atilde;o de camada da mensagem do destinat&aacute;rio da mensagem solicitada ao seu remetente (por criptografia XML). Se o valor n&atilde;o for especificado, o default ser&aacute; <code>after-content</code>. As Pol&iacute;ticas s&atilde;o expressas no pedido do remetente da mensagem, portanto <code>after-content</code> significa que o destinat&aacute;rio da mensagem descriptografa a mensagem antes de validar a assinatura.</p>
</li>
<li>
<p>Na &aacute;rea Pol&iacute;tica de Resposta, na lista Autenticar Origem, selecione o tipo da autentica&ccedil;&atilde;o exigida para a pol&iacute;tica de resposta.</p>
<p>A pol&iacute;tica de resposta determina o processamento da resposta que o provedor de autentica&ccedil;&atilde;o realiza. Os campos da pol&iacute;tica de resposta s&atilde;o opcionais, mas se eles n&atilde;o forem especificados, nenhuma autentica&ccedil;&atilde;o ser&aacute; aplicada &agrave;s mensagens de resposta.</p>
<p>Selecione <code>remetente</code> para especificar a autentica&ccedil;&atilde;o do remetente da camada de mensagens (por exemplo, nome de usu&aacute;rio e senha) das mensagens de resposta. Selecione <code>conte&uacute;do</code> para especificar autentica&ccedil;&atilde;o de conte&uacute;do (por exemplo, assinatura digital) das mensagens de resposta. Deixe o campo em branco para n&atilde;o autenticar as origens de resposta. Por default, nenhum tipo de autentica&ccedil;&atilde;o &eacute; selecionado.</p>
<p>Para obter uma descri&ccedil;&atilde;o das a&ccedil;&otilde;es executadas pelos provedores de seguran&ccedil;a da mensagem de SOAP, consulte <a href="ref-configreq-respolicy.html">Configura&ccedil;&otilde;es da Pol&iacute;tica de Solicita&ccedil;&atilde;o e Resposta</a>.</p>
</li>
<li>
<p>Na lista drop-down Autenticar Destinat&aacute;rio, selecione se a autentica&ccedil;&atilde;o de destinat&aacute;rio ocorre antes ou depois da autentica&ccedil;&atilde;o de conte&uacute;do da pol&iacute;tica de resposta.</p>
<p>Selecione <code>before-content</code> ou <code>after-content</code> para definir a autentica&ccedil;&atilde;o de camada da mensagem do destinat&aacute;rio da mensagem de resposta ao seu remetente (por criptografia XML). Se o valor n&atilde;o for especificado, o default ser&aacute; <code>after-content</code>. As Pol&iacute;ticas s&atilde;o expressas no pedido do remetente da mensagem, portanto <code>after-content</code> significa que o destinat&aacute;rio da mensagem descriptografa a mensagem antes de validar a assinatura.</p>
</li>
<li>
<p>Na se&ccedil;&atilde;o Propriedades Adicionais, especifique as propriedades adicionais.</p>
<p>Para adicionar uma propriedade, clique no bot&atilde;o Adicionar Propriedade. Na linha em branco que for exibida, digite o nome da propriedade no campo Nome e digite o valor da propriedade no campo Valor.</p>
<p>Para obter uma descri&ccedil;&atilde;o das propriedades adicionais dispon&iacute;veis para configura&ccedil;&otilde;es do provedor, consulte <a href="ref-messagesecurityproviderconfigprops.html">Propriedades Espec&iacute;ficas para Configura&ccedil;&otilde;es do Provedor de Seguran&ccedil;a da Mensagem</a>.</p>
</li>
<li>
<p>Clique em OK.</p>
</li>
</ol>
<a id="GHCOM314" name="GHCOM314"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">Para Configurar os Recursos de GlassFish Server Para Usar pelos Provedores de Seguran&ccedil;a da Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">Para Criar uma Configura&ccedil;&atilde;o de Seguran&ccedil;a de Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">Para Editar uma Configura&ccedil;&atilde;o de Seguran&ccedil;a de Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">Para Deletar uma Configura&ccedil;&atilde;o de Seguran&ccedil;a de Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">Para Editar uma Configura&ccedil;&atilde;o do Provedor de Seguran&ccedil;a da Mensagem</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">Para Deletar uma Configura&ccedil;&atilde;o do Provedor de Seguran&ccedil;a de Mensagem</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">Para Ativar a Seguran&ccedil;a de Mensagem para Clientes da Aplica&ccedil;&atilde;o</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
