<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jaccprovidernew" name="task-jaccprovidernew"></a><a id="GHCOM00200" name="GHCOM00200"></a></p>
<a name="BEGIN" id="BEGIN"></a>


<p>A instala&ccedil;&atilde;o default do &amp;ProductName inclui dois provedores de JACC, com o nome <code>default</code> e <code>simple</code>. Todos os novos provedores de JACC criados s&atilde;o somados a estes dois provedores default. Os provedores de JACC do GlassFish Server default implementam um mecanismo simples de autoriza&ccedil;&atilde;o baseado em arquivo que est&aacute; em conformidade com a especifica&ccedil;&atilde;o JACC.</p>
<p>Para obter mais informa&ccedil;&otilde;es sobre como gravar as classes de implementa&ccedil;&atilde;o para um provedor JACC, consulte a especifica&ccedil;&atilde;o do JACC em <code><a href="http://jcp.org/en/jsr/detail?id=115">http://jcp.org/en/jsr/detail?id=115</a></code>.</p>
<ol>
<li>
<p>No n&oacute; Configura&ccedil;&otilde;es da &aacute;rvore de navega&ccedil;&atilde;o, expanda a inst&acirc;ncia ou cluster do GlassFish Server cujo provedor de JACC voc&ecirc; deseja criar.</p>
<p>Para criar um provedor que estar&aacute; dispon&iacute;vel para todas as inst&acirc;ncias e clusters, selecione o n&oacute; <code>default-config</code>.</p>
</li>
<li>
<p>No n&oacute; de configura&ccedil;&atilde;o da inst&acirc;ncia ou cluster, expanda o n&oacute; Seguran&ccedil;a.</p>
</li>
<li>
<p>Sob o n&oacute; Seguran&ccedil;a, selecione o n&oacute; Provedores de JACC.</p>
<p>A p&aacute;gina Provedores de JACC ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Provedores de JACC, clique em Novo.</p>
<p>A p&aacute;gina Novo Provedor de JACC ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Novo Provedor de JACC, no campo Nome, digite o nome que ir&aacute; identificar este provedor.</p>
<p>Este nome &eacute; utilizado para fazer refer&ecirc;ncia ao elemento <code>jacc-provider</code> no <code>domain.xml</code>.</p>
</li>
<li>
<p>No campo Configura&ccedil;&atilde;o da Pol&iacute;tica, digite o nome da classe que implementa a f&aacute;brica de configura&ccedil;&otilde;es de pol&iacute;ticas.</p>
<p>O provedor <code>default</code> usa <code>com.sun.enterprise.security.provider.PolicyConfigurationFactoryImpl</code> . O provedor <code>simples</code> usa <code>com.sun.enterprise.security.jacc.provider.SimplePolicyConfigurationFactory</code> .</p>
</li>
<li>
<p>No campo Provedor de Pol&iacute;ticas, digite o nome da classe que implementa a f&aacute;brica de pol&iacute;ticas.</p>
<p>O provedor <code>default</code> usa <code>com.sun.enterprise.security.provider.PolicyWrapper</code>. O provedor <code>simples</code> usa <code>com.sun.enterprise.security.jacc.provider.SimplePolicyProvider</code> .</p>
</li>
<li>
<p>Na se&ccedil;&atilde;o Propriedades Adicionais, especifique as propriedades adicionais.</p>
<p>Para adicionar uma propriedade, clique no bot&atilde;o Adicionar Propriedade. Na linha em branco que for exibida, digite o nome da propriedade no campo Nome e digite o valor da propriedade no campo Valor.</p>
<p>Para obter uma descri&ccedil;&atilde;o das propriedades adicionais que est&atilde;o dispon&iacute;veis para provedores de JACC, consulte <a href="ref-jaccproviderprop.html">Propriedades Espec&iacute;ficas para Provedores JACC</a>.</p>
</li>
<li>
<p>Clique em OK.</p>
</li>
</ol>
<p><a id="sthref162" name="sthref162"></a></p>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-jaccprovideredit.html">Para Editar um Provedor JACC</a></p>
</li>
<li>
<p><a href="task-jaccproviderdelete.html">Para Deletar um Provedor JACC</a></p>
</li>
</ul>
<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
