<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-appredeploy" name="task-appredeploy"></a></p>

<h4><a id="sthref91" name="sthref91"></a><a id="sthref92" name="sthref92"></a>Para Reimplantar uma Aplica&ccedil;&atilde;o Implantada</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>A reimplanta&ccedil;&atilde;o de uma aplica&ccedil;&atilde;o implanta uma nova vers&atilde;o da aplica&ccedil;&atilde;o, embora preserve as defini&ccedil;&otilde;es e outras op&ccedil;&otilde;es da aplica&ccedil;&atilde;o implantada originalmente.</p>
<a id="sthref93" name="sthref93"></a>
<h5>Antes de Come&ccedil;ar</h5>
<p>Verifique se a aplica&ccedil;&atilde;o a ser reimplantada j&aacute; est&aacute; implantada.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, selecione o n&oacute; Aplica&ccedil;&otilde;es.</p>
<p>A p&aacute;gina Aplica&ccedil;&otilde;es ser&aacute; aberta.</p>
</li>
<li>
<p>Na tabela Aplica&ccedil;&otilde;es Implantadas, clique em Reimplantar na linha da aplica&ccedil;&atilde;o a ser reimplantada.</p>
<p>O nome da aplica&ccedil;&atilde;o pode incluir um identificador de vers&atilde;o opcional, que segue o nome e &eacute; separado do nome por dois-pontos (<code>:</code>). Para obter mais informa&ccedil;&otilde;es sobre vers&otilde;es modulares ou da aplica&ccedil;&atilde;o, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> em <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
<p>A p&aacute;gina Reimplantar Aplica&ccedil;&otilde;es ou M&oacute;dulos ser&aacute; aberta.</p>
</li>
<li>
<p>Especifique a localiza&ccedil;&atilde;o da aplica&ccedil;&atilde;o a ser reimplantada.</p>
<ul>
<li>
<p>Se a aplica&ccedil;&atilde;o for um arquivo compactado que reside na m&aacute;quina cliente ou que pode ser acessado a partir dela, selecione a op&ccedil;&atilde;o Arquivo Encapsulado Cujo Upload Ser&aacute; Feito para o Servidor.</p>
<p>O computador cliente &eacute; o host em que voc&ecirc; exibe o Console de Administra&ccedil;&atilde;o por meio de um browser.</p>
<p>Clique em Procurar para localizar o arquivo ou digite o caminho completo para o arquivo.</p>
</li>
<li>
<p>Se a aplica&ccedil;&atilde;o for um arquivo compactado que reside na m&aacute;quina servidora ou se for uma aplica&ccedil;&atilde;o n&atilde;o encapsulada de um diret&oacute;rio explodido, selecione a op&ccedil;&atilde;o Arquivo Encapsulado ou Diret&oacute;rio Local Acess&iacute;vel no GlassFish Server.</p>
<p>O computador servidor &eacute; o host que executa o servidor de administra&ccedil;&atilde;o de dom&iacute;nios (DAS).</p>
<p>Clique em Procurar Arquivos para localizar um arquivo ou clique em Procurar Pastas para localizar um diret&oacute;rio. Como alternativa, digite o caminho completo para o arquivo ou diret&oacute;rio. A implanta&ccedil;&atilde;o com base em um diret&oacute;rio explodido destina-se a desenvolvedores avan&ccedil;ados e n&atilde;o &eacute; recomendada para ambientes de produ&ccedil;&atilde;o.</p>
</li>
</ul>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Disponibilidade Ativada para ativar a persist&ecirc;ncia de sess&atilde;o e o checkpoint SFSB da aplica&ccedil;&atilde;o.</p>
<p>Se a caixa de sele&ccedil;&atilde;o Ativado estiver selecionada, a alta disponibilidade ser&aacute; ativada para sess&otilde;es Web e para checkpoint e, potencialmente, a passiva&ccedil;&atilde;o do bean da sess&atilde;o stateful (SFSB). Se esta op&ccedil;&atilde;o estiver definida como falsa (default), todos os salvamentos de sess&otilde;es Web e checkpoints SFSB ser&atilde;o desativados para a aplica&ccedil;&atilde;o especificada. Se definida como verdadeira, a aplica&ccedil;&atilde;o especificado ser&aacute; ativada para alta disponibilidade. Defina essa op&ccedil;&atilde;o como verdadeira apenas se a alta disponibilidade estiver configurada e ativada em n&iacute;veis mais altos, como os n&iacute;veis do servidor e cont&ecirc;iner.</p>
<p>Esta op&ccedil;&atilde;o aparece se clusters ou inst&acirc;ncias de servidores standalone, al&eacute;m da inst&acirc;ncia default do servidor (<code>server</code>), existirem.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Precompilar JSPs para precompilar arquivos JSP (JavaServer Pages).</p>
<p>Se esta op&ccedil;&atilde;o for desativada, os arquivos JSP ser&atilde;o compilados durante o runtime, quando forem acessados pela primeira vez. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Executar Verificador para verificar o descritor de implanta&ccedil;&atilde;o antes da reimplanta&ccedil;&atilde;o.</p>
<p>Se essa op&ccedil;&atilde;o for selecionada e a verifica&ccedil;&atilde;o falhar, a reimplanta&ccedil;&atilde;o n&atilde;o ser&aacute; realizada. O verificador examina a estrutura e o conte&uacute;do dos descritores de implanta&ccedil;&atilde;o. A verifica&ccedil;&atilde;o de aplica&ccedil;&otilde;es grandes geralmente consome muito tempo. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
<p>Os pacotes do verificador devem ser instalados a partir da Ferramenta de Atualiza&ccedil;&atilde;o, ou uma advert&ecirc;ncia ser&aacute; registrada e esta op&ccedil;&atilde;o ser&aacute; ignorada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Java Web Start para ativar o acesso ao Java Web Start para um m&oacute;dulo de cliente da aplica&ccedil;&atilde;o.</p>
<p>Esta op&ccedil;&atilde;o est&aacute; ativada ou desativada por default, de acordo com a defini&ccedil;&atilde;o no momento da implanta&ccedil;&atilde;o original.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Manter Estado para conservar as sess&otilde;es Web, as inst&acirc;ncias SFSB e os timers EJB criados persistentemente entre as reimplanta&ccedil;&otilde;es.</p>
<p>Por default, essa op&ccedil;&atilde;o est&aacute; desativada. Esta op&ccedil;&atilde;o somente &eacute; suportada na inst&acirc;ncia do servidor default, com o nome <code>server</code>. N&atilde;o &eacute; suportada e ignorada em nenhum outro alvo.</p>
<p>Algumas altera&ccedil;&otilde;es em uma aplica&ccedil;&atilde;o entre as reimplanta&ccedil;&otilde;es impedem que este recurso funcione apropriadamente. Por exemplo, n&atilde;o altere o conjunto de vari&aacute;veis da inst&acirc;ncia na classe do bean SFSB.</p>
<p>Para aplica&ccedil;&otilde;es Web, este recurso somente &eacute; aplic&aacute;vel se no arquivo <code>glassfish-web-app.xml</code> o atributo <code>persistence-type</code> do elemento <code>session-manager</code> for <code>file</code>.</p>
<p>Em inst&acirc;ncias do bean de sess&atilde;o stateful, o tipo de persist&ecirc;ncia sem alta disponibilidade est&aacute; definido no servidor (a op&ccedil;&atilde;o Tipo de persist&ecirc;ncia SFSB) e deve estar definido como <code>file</code>, que &eacute; o valor default e recomendado.</p>
<p>Se qualquer sess&atilde;o Web ativa, inst&acirc;ncia SFSB ou timer EJB falhar em ser preservado ou restaurado, <i>nenhum</i> deles estar&aacute; dispon&iacute;vel quando a reimplanta&ccedil;&atilde;o tiver sido conclu&iacute;da. Entretanto, a reimplanta&ccedil;&atilde;o continuar&aacute; e uma advert&ecirc;ncia ser&aacute; registrada em log.</p>
<p>Para preservar dados do estado ativo, o GlassFish Server serializa os dados e os salva na mem&oacute;ria. Para restaurar os dados, o carregador de classe da aplica&ccedil;&atilde;o rec&eacute;m-reimplantada desserializa todos os dados salvos anteriormente.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Preservar Recursos no Escopo da Aplica&ccedil;&atilde;o para preservar os recursos no escopo da aplica&ccedil;&atilde;o e restaur&aacute;-los durante a reimplanta&ccedil;&atilde;o.</p>
<p>Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>Clique em OK.</p>
</li>
</ol>
<a id="sthref94" name="sthref94"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-applistdeployed.html">Para Exibir uma Lista de Aplica&ccedil;&otilde;es Implantadas</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">Para Implantar uma Aplica&ccedil;&atilde;o Web</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">Para Implantar uma Aplica&ccedil;&atilde;o Enterprise</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">Para Implantar um Cliente da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">Para Implantar um M&oacute;dulo Conector</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">Para Implantar um EJB Jar</a></p>
</li>
<li>
<p><a href="task-appedit.html">Para Editar uma Aplica&ccedil;&atilde;o Implantada</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">Para Exibir Descritores de uma Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appviewtargets.html">Para Exibir Alvos da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-endpoint.html">Para Exibir Informa&ccedil;&otilde;es do Ponto Final de um Web Service</a></p>
</li>
<li>
<p><a href="task-applaunch.html">Para Ativar uma Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">Para Acionar um Cliente da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">Para Fazer Download de Stubs do Cliente da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-apprestart.html">Para Recarregar uma Aplica&ccedil;&atilde;o Implantada</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">Para Exibir Recursos do Escopo da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">Para Modificar Recursos do Escopo da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbcontaineravailability.html">Para Configurar as Defini&ccedil;&otilde;es de Disponibilidade do Cont&ecirc;iner EJB</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
