<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-uc-addon" name="task-uc-addon"></a><a id="GHCOM00214" name="GHCOM00214"></a></p>

<h4><a id="sthref195" name="sthref195"></a><a id="sthref196" name="sthref196"></a>Para Instalar Componentes Add-On</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Instalar um componente add-on envolve as opera&ccedil;&otilde;es a seguir:</p>
<ul>
<li>
<p>Transferir o conte&uacute;do do componente e as respectivas depend&ecirc;ncias de um reposit&oacute;rio da rede</p>
</li>
<li>
<p>Instalar o componente sob a imagem de instala&ccedil;&atilde;o do GlassFish Server no seu sistema</p>
</li>
</ul>
<p>Se um componente precisar de qualquer outro componente ainda n&atilde;o instalado, os componentes necess&aacute;rios tamb&eacute;m ser&atilde;o instalados.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, selecione o n&oacute; Ferramenta de Atualiza&ccedil;&atilde;o.</p>
<p>&Eacute; aberta a p&aacute;gina Add-ons Dispon&iacute;veis.</p>
</li>
<li>
<p>Na p&aacute;gina Add-ons Dispon&iacute;veis, na tabela de componentes add-on dispon&iacute;veis, selecione os componentes que est&atilde;o sendo instalados.</p>
<p>Se n&atilde;o houver componentes add-on, a tabela estar&aacute; vazia.</p>
<ul>
<li>
<p>Para selecionar um componente individual, marque a caixa de sele&ccedil;&atilde;o adjacente ao nome do componente.</p>
</li>
<li>
<p>Para selecionar todos os componentes, clique no &iacute;cone Selecionar Todos, no cabe&ccedil;alho da tabela.</p>
</li>
<li>
<p>Para desmarcar todos os componentes, clique no &iacute;cone Selecionar Todos, no cabe&ccedil;alho da tabela Desmarcar Tudo.</p>
</li>
</ul>
</li>
<li>
<p>Clique em Instalar.</p>
<p>Uma caixa de di&aacute;logo pede que voc&ecirc; confirme se devem ser instalados os componentes selecionados e qualquer outro componente necess&aacute;rio.</p>
</li>
<li>
<p>Na caixa de di&aacute;logo, clique em OK.</p>
<p>Ser&aacute; solicitado que voc&ecirc; aceite os contratos de licen&ccedil;a dos componentes que estiver instalando.</p>
</li>
<li>
<p>Aceite os contratos de licen&ccedil;a dos componentes que est&aacute; instalando.</p>
<p>O GlassFish Server confirma que a instala&ccedil;&atilde;o est&aacute; conclu&iacute;da. Os componentes s&atilde;o removidos da tabela de componentes add-on e adicionados &agrave; tabela de componentes instalados na p&aacute;gina Componentes Instalados.</p>
</li>
<li>
<p>Reinicie o servidor.</p>
<p>Para obter instru&ccedil;&otilde;es detalhadas, consulte a seguinte documenta&ccedil;&atilde;o:</p>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSADG00336"><i>To Stop a Domain</i> no <i>Oracle GlassFish Server Administration Guide</i></a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSADG00335"><i>To Start a Domain</i> no <i>Oracle GlassFish Server Administration Guide</i></a></p>
</li>
</ul>
</li>
</ol>
<a id="sthref197" name="sthref197"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-uc-update.html">Para Exibir as Atualiza&ccedil;&otilde;es Dispon&iacute;veis para os Componentes</a></p>
</li>
<li>
<p><a href="task-uc-installed-remove.html">Para Exibir Componentes Instalados</a></p>
</li>
<li>
<p><a href="task-uc-pkgdetails.html">Para Exibir Informa&ccedil;&otilde;es Detalhadas sobre um Componente</a></p>
</li>
<li>
<p><a href="task-uc-set-proxy.html">Para Configurar as Defini&ccedil;&otilde;es de Proxy de Rede para Acessar os Reposit&oacute;rios de Rede</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
