<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-appdeployconn" name="task-appdeployconn"></a></p>

<h4><a id="sthref63" name="sthref63"></a><a id="sthref64" name="sthref64"></a><a id="sthref65" name="sthref65"></a>Para Implantar um M&oacute;dulo Conector</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, selecione o n&oacute; Aplica&ccedil;&otilde;es.</p>
<p>A p&aacute;gina Aplica&ccedil;&otilde;es ser&aacute; aberta.</p>
</li>
<li>
<p>Na tabela Aplica&ccedil;&otilde;es Implantadas, clique no bot&atilde;o Implantar.</p>
<p>A p&aacute;gina Implantar Aplica&ccedil;&otilde;es ou M&oacute;dulos ser&aacute; exibida.</p>
</li>
<li>
<p>Especifique o local da aplica&ccedil;&atilde;o a ser implantada.</p>
<ul>
<li>
<p>Se a aplica&ccedil;&atilde;o for um arquivo compactado que reside na m&aacute;quina cliente ou que pode ser acessado a partir dela, selecione a op&ccedil;&atilde;o Arquivo Encapsulado Cujo Upload Ser&aacute; Feito para o Servidor.</p>
<p>O computador cliente &eacute; o host em que voc&ecirc; exibe o Console de Administra&ccedil;&atilde;o por meio de um browser.</p>
<p>Clique em Procurar para localizar o arquivo ou digite o caminho completo para o arquivo.</p>
</li>
<li>
<p>Se a aplica&ccedil;&atilde;o for um arquivo compactado que reside na m&aacute;quina servidora ou se for uma aplica&ccedil;&atilde;o n&atilde;o encapsulada de um diret&oacute;rio explodido, selecione a op&ccedil;&atilde;o Arquivo Encapsulado ou Diret&oacute;rio Local Acess&iacute;vel no GlassFish Server.</p>
<p>O computador servidor &eacute; o host que executa o servidor de administra&ccedil;&atilde;o de dom&iacute;nios (DAS).</p>
<p>Clique em Procurar Arquivos para localizar um arquivo ou clique em Procurar Pastas para localizar um diret&oacute;rio. Como alternativa, digite o caminho completo para o arquivo ou diret&oacute;rio. A implanta&ccedil;&atilde;o com base em um diret&oacute;rio explodido destina-se a desenvolvedores avan&ccedil;ados e n&atilde;o &eacute; recomendada para ambientes de produ&ccedil;&atilde;o.</p>
</li>
</ul>
</li>
<li>
<p>Na lista drop-down Tipo, selecione M&oacute;dulo Conector.</p>
<p>Se voc&ecirc; tiver especificado um Arquivo Encapsulado Cujo Upload Ser&aacute; Feito para o Servidor ou um Arquivo Encapsulado Local Acess&iacute;vel no GlassFish Server, o tipo da aplica&ccedil;&atilde;o ser&aacute; detectado automaticamente. Se voc&ecirc; tiver especificado um Diret&oacute;rio Acessado do GlassFish Server, voc&ecirc; deve especificar o tipo manualmente.</p>
</li>
<li>
<p>No campo Nome da Aplica&ccedil;&atilde;o, preserve o nome default, que &eacute; o nome do diret&oacute;rio ou o prefixo do nome do arquivo, ou digite outro nome.</p>
<p>O nome default ser&aacute; exibido se voc&ecirc; optar por fazer upload de um arquivo. O nome da aplica&ccedil;&atilde;o deve ser exclusivo.</p>
<p>O nome pode incluir um identificador de vers&atilde;o opcional, que segue o nome e &eacute; separado do nome por dois-pontos (<code>:</code>). O identificador de vers&atilde;o deve come&ccedil;ar com uma letra ou um n&uacute;mero. Ela pode conter caracteres alfanum&eacute;ricos e sublinhado (<code>_</code>), tra&ccedil;o (<code>-</code>), e ponto (<code>.</code>). Para obter mais informa&ccedil;&otilde;es sobre vers&otilde;es modulares ou da aplica&ccedil;&atilde;o, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> em <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Status Ativado para ativar a aplica&ccedil;&atilde;o.</p>
<p>Por default, essa op&ccedil;&atilde;o est&aacute; selecionada. Esta op&ccedil;&atilde;o estiver desativada, a aplica&ccedil;&atilde;o n&atilde;o estar&aacute; dispon&iacute;vel.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Executar Verificador para verificar os descritores de implanta&ccedil;&atilde;o antes da implanta&ccedil;&atilde;o.</p>
<p>Se essa op&ccedil;&atilde;o for selecionada e a verifica&ccedil;&atilde;o falhar, a implanta&ccedil;&atilde;o n&atilde;o ser&aacute; realizada. O verificador examina a estrutura e o conte&uacute;do dos descritores de implanta&ccedil;&atilde;o. A verifica&ccedil;&atilde;o de aplica&ccedil;&otilde;es grandes geralmente consome muito tempo. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
<p>Os pacotes do verificador devem ser instalados a partir da Ferramenta de Atualiza&ccedil;&atilde;o, ou uma advert&ecirc;ncia ser&aacute; registrada e esta op&ccedil;&atilde;o ser&aacute; ignorada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o For&ccedil;ar Reimplanta&ccedil;&atilde;o para for&ccedil;ar a reimplanta&ccedil;&atilde;o, caso a aplica&ccedil;&atilde;o j&aacute; esteja implantada.</p>
<p>Se esta op&ccedil;&atilde;o n&atilde;o tiver sido selecionada, a tentativa de implantar uma aplica&ccedil;&atilde;o j&aacute; implantada resultar&aacute; em erro. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Preservar Recursos no Escopo da Aplica&ccedil;&atilde;o para preservar os recursos no escopo da aplica&ccedil;&atilde;o e restaur&aacute;-los durante a reimplanta&ccedil;&atilde;o.</p>
<p>Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>No campo Ordem de Implanta&ccedil;&atilde;o, insira um n&uacute;mero para especificar a ordem de implanta&ccedil;&atilde;o da aplica&ccedil;&atilde;o.</p>
<p>Aplica&ccedil;&otilde;es com um n&uacute;mero mais baixo s&atilde;o carregadas primeiro na inicializa&ccedil;&atilde;o do servidor. Um aplica&ccedil;&atilde;o com uma ordem de implanta&ccedil;&atilde;o de 102 &eacute; carregada antes de uma de 110. Se uma ordem de implanta&ccedil;&atilde;o n&atilde;o for especificada no tempo uma aplica&ccedil;&atilde;o ser&aacute; implantada, a ordem de implanta&ccedil;&atilde;o default de 100 ser&aacute; designada. Se duas aplica&ccedil;&otilde;es tiverem a mesma ordem de implanta&ccedil;&atilde;o, a aplica&ccedil;&atilde;o que foi implantada primeiro ser&aacute; carregada primeiro. Especificar uma ordem de implanta&ccedil;&atilde;o &eacute; &uacute;til se a aplica&ccedil;&atilde;o tiver depend&ecirc;ncias e deve ser carregada em uma determinada ordem.</p>
</li>
<li>
<p>No campo Descri&ccedil;&atilde;o, digite uma descri&ccedil;&atilde;o para esta aplica&ccedil;&atilde;o.</p>
</li>
<li>
<p>Para adicionar inst&acirc;ncias de servidor e clusters do alvo nos quais implantar o m&oacute;dulo ou aplica&ccedil;&atilde;o, selecione-os na lista Alvos Dispon&iacute;veis e utilize o bot&atilde;o Adicionar para mov&ecirc;-los para a lista Alvos Selecionados.</p>
<p>A op&ccedil;&atilde;o Alvo aparece se clusters ou inst&acirc;ncias de servidores standalone, al&eacute;m da inst&acirc;ncia default do servidor (<code>server</code>), existirem. Por default, o m&oacute;dulo ou aplica&ccedil;&atilde;o &eacute; implantado na inst&acirc;ncia default do servidor, denominado <code>server</code>. Utilize a bot&atilde;o Adicionar Tudo para implantar em todos os alvos. Utilize os bot&otilde;es Remover e Remover Tudo para remover os alvos da lista Alvos Selecionados.</p>
</li>
<li>
<p>Clique em OK.</p>
</li>
</ol>
<a id="sthref66" name="sthref66"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-applistdeployed.html">Para Exibir uma Lista de Aplica&ccedil;&otilde;es Implantadas</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">Para Implantar uma Aplica&ccedil;&atilde;o Web</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">Para Implantar uma Aplica&ccedil;&atilde;o Enterprise</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">Para Implantar um Cliente da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">Para Implantar um EJB Jar</a></p>
</li>
<li>
<p><a href="task-appedit.html">Para Editar uma Aplica&ccedil;&atilde;o Implantada</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">Para Exibir Descritores de uma Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-endpoint.html">Para Exibir Informa&ccedil;&otilde;es do Ponto Final de um Web Service</a></p>
</li>
<li>
<p><a href="task-applaunch.html">Para Ativar uma Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">Para Acionar um Cliente da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">Para Fazer Download de Stubs do Cliente da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appredeploy.html">Para Reimplantar uma Aplica&ccedil;&atilde;o Implantada</a></p>
</li>
<li>
<p><a href="task-apprestart.html">Para Recarregar uma Aplica&ccedil;&atilde;o Implantada</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">Para Exibir Recursos do Escopo da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">Para Modificar Recursos do Escopo da Aplica&ccedil;&atilde;o</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
