<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmxconnectoredit" name="task-jmxconnectoredit"></a></p>

<h4><a id="sthref110" name="sthref110"></a>Para Editar o Conector JMX</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use o Servi&ccedil;o Administrativo para configurar um conector JMX remoto compat&iacute;vel com JSR-160.</p>
<p>O conector JMX remoto compat&iacute;vel com JSR-160 lida com a comunica&ccedil;&atilde;o entre clientes JMX, como o JConsole, e o servi&ccedil;o JMX, para fins de gerenciamento de dom&iacute;nio.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&atilde;o.</p>
</li>
<li>
<p>No n&oacute; Configura&ccedil;&atilde;o, selecione o n&oacute; Servi&ccedil;o Administrativo.</p>
<p>A p&aacute;gina Editar Conector JMX ser&aacute; aberta.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Seguran&ccedil;a Ativada para que a comunica&ccedil;&atilde;o JMX seja criptografada.</p>
<p>Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>No campo Endere&ccedil;o, digite o endere&ccedil;o IP do servi&ccedil;o de atribui&ccedil;&atilde;o de nomes onde o stub do servidor do conector JMX est&aacute; registrado.</p>
<p>Esta n&atilde;o &eacute; a porta do soquete do servidor que faz a comunica&ccedil;&atilde;o JMX real. Este &eacute; o endere&ccedil;o da interface de rede onde o registro do RMI foi iniciado. Se o seu sistema tem m&uacute;ltiplas interfaces de rede, modifique esse valor para que apenas uma determinada interface seja selecionada. O valor default &eacute; <code>0.0.0.0</code>.</p>
</li>
<li>
<p>No campo Porta, digite o n&uacute;mero da porta no qual o servi&ccedil;o de atribui&ccedil;&atilde;o de nomes (registro RMI) faz listening das conex&otilde;es clientes RMI.</p>
<p>O &uacute;nico uso deste servi&ccedil;o de atribui&ccedil;&atilde;o de nomes &eacute; fazer download para os stubs de RMI. Se a porta default estiver ocupada, uma porta livre ser&aacute; usada. Os valores legais s&atilde;o 1- 65535. Em sistemas UNIX, criar sockets que fazem listening nas portas 1 - 1024 exige privil&eacute;gios de superusu&aacute;rios. O valor default &eacute; 8686.</p>
</li>
<li>
<p>No campo Nome do Realm, digite o nome que representa o realm administrativo especial.</p>
<p>Todas as autentica&ccedil;&otilde;es s&atilde;o manuseadas por este realm. O valor default &eacute; <code>admin-realm</code>.</p>
</li>
<li>
<p>Na se&ccedil;&atilde;o Propriedades Adicionais, especifique as propriedades adicionais.</p>
<p>O GlassFish Server especifica diversas propriedades por default.</p>
<ul>
<li>
<p>Para adicionar uma propriedade, clique no bot&atilde;o Adicionar Propriedade. Na linha em branco que for exibida, digite o nome da propriedade no campo Nome e digite o valor da propriedade no campo Valor.</p>
</li>
<li>
<p>Para modificar uma propriedade, edite o campo Valor da propriedade.</p>
</li>
<li>
<p>Para deletar uma propriedade, marque a caixa de sele&ccedil;&atilde;o &agrave; esquerda do campo Nome da Propriedade a ser deletada. Clique no bot&atilde;o Deletar Propriedades.</p>
</li>
</ul>
</li>
<li>
<p>Clique em Salvar.</p>
</li>
<li>
<p>Caso voc&ecirc; tenha marcado a caixa de sele&ccedil;&atilde;o Seguran&ccedil;a Ativada, siga as etapas contidas em <a href="task-jmxconnectorssledit.html">Para Editar as Defini&ccedil;&otilde;es de SSL para o Conector JMX</a>.</p>
</li>
</ol>
<a id="GHCOM320" name="GHCOM320"></a>
<h5>Consulte Tamb&eacute;m</h5>
<p><a href="task-jmxconnectorssledit.html">Para Editar as Defini&ccedil;&otilde;es de SSL para o Conector JMX</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
