<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jvmoptions" name="task-jvmoptions"></a></p>

<h4><a id="sthref110" name="sthref110"></a>Para Configurar as Op&ccedil;&otilde;es JVM</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Op&ccedil;&otilde;es de JVM para especificar as op&ccedil;&otilde;es do acionador de aplica&ccedil;&otilde;es Java (<code>java</code>) que executa o GlassFish Server. As op&ccedil;&otilde;es <code>-D</code> designam propriedades que s&atilde;o espec&iacute;ficas ao GlassFish Server.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, selecione o n&oacute; Configura&ccedil;&atilde;o.</p>
</li>
<li>
<p>Selecione a configura&ccedil;&atilde;o que est&aacute; sendo alterada.</p>
</li>
<li>
<p>No n&oacute; Configura&ccedil;&atilde;o, selecione o n&oacute; Defini&ccedil;&otilde;es de JVM.</p>
<p>A p&aacute;gina Defini&ccedil;&otilde;es Gerais de JVM ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Defini&ccedil;&otilde;es Gerais de JVM, clique na guia Op&ccedil;&otilde;es de JVM.</p>
<p>A p&aacute;gina Op&ccedil;&otilde;es de JVM ser&aacute; aberta.</p>
</li>
<li>
<p>Para modificar uma op&ccedil;&atilde;o, edite o campo Valor dessa op&ccedil;&atilde;o.</p>
</li>
<li>
<p>Para adicionar uma op&ccedil;&atilde;o:</p>
<ol type="a">
<li>
<p>Clique no bot&atilde;o Adicionar Op&ccedil;&atilde;o de JVM.</p>
</li>
<li>
<p>Na linha em branco que for exibida, digite as informa&ccedil;&otilde;es da op&ccedil;&atilde;o do campo Valor.</p>
<p>Se as informa&ccedil;&otilde;es da op&ccedil;&atilde;o contiverem um ou mais espa&ccedil;os, coloque toda a string entre aspas.</p>
</li>
</ol>
</li>
<li>
<p>Para deletar uma op&ccedil;&atilde;o:</p>
<ol type="a">
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o &agrave; esquerda do campo Valor da op&ccedil;&atilde;o a ser deletada.</p>
</li>
<li>
<p>Clique em Deletar.</p>
</li>
</ol>
</li>
<li>
<p>Clique em Salvar.</p>
</li>
<li>
<p>Reinicie o servidor.</p>
</li>
</ol>
<a id="sthref111" name="sthref111"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-jvmsettings.html">Para Configurar as Defini&ccedil;&otilde;es Gerais da JVM</a></p>
</li>
<li>
<p><a href="task-jvmpathsettings.html">Para Configurar as Defini&ccedil;&otilde;es de Caminho de JVM</a></p>
</li>
<li>
<p><a href="task-securitymanagerdisable.html">Para Desativar o Gerenciador de Seguran&ccedil;a</a></p>
</li>
<li>
<p><a href="task-jvmprofilersettings.html">Para Configurar as Defini&ccedil;&otilde;es do Gerador de Perfil JVM</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
