<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-appedit" name="task-appedit"></a></p>

<h4><a id="sthref71" name="sthref71"></a>Para Editar uma Aplica&ccedil;&atilde;o Implantada</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, selecione o n&oacute; Aplica&ccedil;&otilde;es.</p>
<p>A p&aacute;gina Aplica&ccedil;&otilde;es ser&aacute; aberta.</p>
</li>
<li>
<p>Na tabela Aplica&ccedil;&otilde;es Implantadas, clique no nome da aplica&ccedil;&atilde;o a ser editado.</p>
<p>O nome pode incluir um identificador de vers&atilde;o opcional, que segue o nome e &eacute; separado do nome por dois-pontos (<code>:</code>). Para obter mais informa&ccedil;&otilde;es sobre vers&otilde;es modulares ou da aplica&ccedil;&atilde;o, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> em <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
<p>A p&aacute;gina Editar Aplica&ccedil;&atilde;o ser&aacute; aberta.</p>
</li>
<li>
<p>Desmarque a caixa de sele&ccedil;&atilde;o Status Ativado para desativar o status da aplica&ccedil;&atilde;o, para que ele fique indispon&iacute;vel.</p>
<p>Por default, o status de uma aplica&ccedil;&atilde;o &eacute; Ativado, assim que ela &eacute; implantada.</p>
</li>
<li>
<p>Para uma aplica&ccedil;&atilde;o Web, no campo Raiz de Contexto, digite o caminho da aplica&ccedil;&atilde;o.</p>
<p>No URL da aplica&ccedil;&atilde;o web, a raiz do contexto segue imediatamente o n&uacute;mero da porta (<code>http://</code><i>host</i><code>:</code><i>porta</i><code>/</code><i>context-root</i><code>/</code>). Certifique-se de que a raiz do contexto comece com uma barra, por exemplo: <code>/hello</code>.</p>
</li>
<li>
<p>Desmarque a caixa de sele&ccedil;&atilde;o Disponibilidade Ativada para desativar a persist&ecirc;ncia de sess&atilde;o e o checkpoint SFSB da aplica&ccedil;&atilde;o.</p>
<p>Se a caixa de sele&ccedil;&atilde;o Ativado estiver selecionada, a alta disponibilidade ser&aacute; ativada para sess&otilde;es Web e para checkpoint e, potencialmente, a passiva&ccedil;&atilde;o do bean da sess&atilde;o stateful (SFSB). Se esta op&ccedil;&atilde;o estiver definida como falsa (default), todo os salvamentos de sess&atilde;o Web e checkpoints SFSB ser&atilde;o desativados para a aplica&ccedil;&atilde;o, a aplica&ccedil;&atilde;o Web ou o m&oacute;dulo EJB especificado. Se esta op&ccedil;&atilde;o estiver definida como verdadeira, a aplica&ccedil;&atilde;o ou o m&oacute;dulo especificado ser&aacute; ativado para alta disponibilidade. Defina essa op&ccedil;&atilde;o como verdadeira apenas se a alta disponibilidade estiver configurada e ativada em n&iacute;veis mais altos, como os n&iacute;veis do servidor e cont&ecirc;iner.</p>
<p>Esta op&ccedil;&atilde;o aparece se clusters ou inst&acirc;ncias de servidores standalone, al&eacute;m da inst&acirc;ncia default do servidor (<code>server</code>), existirem.</p>
</li>
<li>
<p>Na lista drop-down Servidores Virtuais, selecione o servidor virtual a ser associado &agrave; aplica&ccedil;&atilde;o.</p>
<p>A op&ccedil;&atilde;o Servidores Virtuais aparece somente se a inst&acirc;ncia default do servidor, <code>server</code>, existir. Se os clusters ou outras inst&acirc;ncias de servidores standalone existirem, &eacute; poss&iacute;vel selecionar os servidores virtuais depois da implanta&ccedil;&atilde;o. V&aacute; &agrave; p&aacute;gina Editar Aplica&ccedil;&atilde;o, selecione a guia Alvo e selecione Gerenciar Servidores Virtuais para o alvo desejado.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Java Web Start Ativado para usar o software Java Web Start na implanta&ccedil;&atilde;o da aplica&ccedil;&atilde;o.</p>
<p>Esta op&ccedil;&atilde;o est&aacute; ativada ou desativada por default, de acordo com a defini&ccedil;&atilde;o no momento da implanta&ccedil;&atilde;o original.</p>
</li>
<li>
<p>No campo Ordem de Implanta&ccedil;&atilde;o, insira um n&uacute;mero para especificar a ordem de implanta&ccedil;&atilde;o da aplica&ccedil;&atilde;o.</p>
<p>Aplica&ccedil;&otilde;es com um n&uacute;mero mais baixo s&atilde;o carregadas primeiro na inicializa&ccedil;&atilde;o do servidor. Um aplica&ccedil;&atilde;o com uma ordem de implanta&ccedil;&atilde;o de 102 &eacute; carregada antes de uma de 110. Se uma ordem de implanta&ccedil;&atilde;o n&atilde;o for especificada no tempo uma aplica&ccedil;&atilde;o ser&aacute; implantada, a ordem de implanta&ccedil;&atilde;o default de 100 ser&aacute; designada. Se duas aplica&ccedil;&otilde;es tiverem a mesma ordem de implanta&ccedil;&atilde;o, a aplica&ccedil;&atilde;o que foi implantada primeiro ser&aacute; carregada primeiro. Especificar uma ordem de implanta&ccedil;&atilde;o &eacute; &uacute;til se a aplica&ccedil;&atilde;o tiver depend&ecirc;ncias e deve ser carregada em uma determinada ordem.</p>
</li>
<li>
<p>No campo Descri&ccedil;&atilde;o, digite uma descri&ccedil;&atilde;o para esta aplica&ccedil;&atilde;o.</p>
</li>
<li>
<p>Para exibir a lista de descritores de m&oacute;dulo da aplica&ccedil;&atilde;o, clique na guia Descri&ccedil;&atilde;o. Para obter mais detalhes, consulte <a href="task-appviewdesc.html">Para Exibir Descritores de uma Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p>Por default, o Status de uma aplica&ccedil;&atilde;o est&aacute; Ativado em todos os alvos. Para exibir os alvos nos quais a aplica&ccedil;&atilde;o foi ativada, clique na guia Alvos. &Eacute; poss&iacute;vel ativar ou desativar aplica&ccedil;&otilde;es em um ou v&aacute;rios alvos. Consulte <a href="task-appviewtargets.html">Para Exibir Alvos da Aplica&ccedil;&atilde;o</a>.</p>
</li>
<li>
<p>Clique em Salvar.</p>
</li>
</ol>
<a id="sthref72" name="sthref72"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-applistdeployed.html">Para Exibir uma Lista de Aplica&ccedil;&otilde;es Implantadas</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">Para Implantar uma Aplica&ccedil;&atilde;o Web</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">Para Implantar uma Aplica&ccedil;&atilde;o Enterprise</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">Para Implantar um Cliente da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">Para Implantar um M&oacute;dulo Conector</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">Para Implantar um EJB Jar</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">Para Exibir Descritores de uma Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appviewtargets.html">Para Exibir Alvos da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-endpoint.html">Para Exibir Informa&ccedil;&otilde;es do Ponto Final de um Web Service</a></p>
</li>
<li>
<p><a href="task-applaunch.html">Para Ativar uma Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">Para Acionar um Cliente da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">Para Fazer Download de Stubs do Cliente da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appredeploy.html">Para Reimplantar uma Aplica&ccedil;&atilde;o Implantada</a></p>
</li>
<li>
<p><a href="task-apprestart.html">Para Recarregar uma Aplica&ccedil;&atilde;o Implantada</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">Para Exibir Recursos do Escopo da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">Para Modificar Recursos do Escopo da Aplica&ccedil;&atilde;o</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
