<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-setadvanceappconfig" name="task-setadvanceappconfig"></a></p>

<h4><a id="sthref7" name="sthref7"></a><a id="sthref8" name="sthref8"></a><a id="sthref9" name="sthref9"></a><a id="sthref10" name="sthref10"></a><a id="sthref11" name="sthref11"></a>Para Definir a Configura&ccedil;&atilde;o de Aplica&ccedil;&otilde;es</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Configura&ccedil;&atilde;o de Aplica&ccedil;&otilde;es para definir as propriedades que ajudar&atilde;o a garantir que as altera&ccedil;&otilde;es em aplica&ccedil;&otilde;es implantadas ser&atilde;o detectadas e que as classes modificadas ser&atilde;o recarregadas.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, selecione o n&oacute; Dom&iacute;nio.</p>
<p>A p&aacute;gina Atributos do Dom&iacute;nio ser&aacute; aberta.</p>
</li>
<li>
<p>Selecione a guia Configura&ccedil;&atilde;o de Aplica&ccedil;&otilde;es.</p>
<p>A p&aacute;gina Configura&ccedil;&atilde;o de Aplica&ccedil;&otilde;es ser&aacute; aberta.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Recarregamento Ativado para ativar o recarregamento din&acirc;mico de aplica&ccedil;&otilde;es.</p>
<p>Quando o recarregamento din&acirc;mico estiver ativado, voc&ecirc; n&atilde;o precisa reimplantar aplica&ccedil;&otilde;es ou m&oacute;dulos caso altere o respectivo c&oacute;digo ou os descritores de implanta&ccedil;&atilde;o. Tudo que voc&ecirc; tem a fazer &eacute; copiar as JavaServer Pages (JSP) ou arquivos de classe no diret&oacute;rio de implanta&ccedil;&atilde;o da aplica&ccedil;&atilde;o ou m&oacute;dulo. O servidor verifica periodicamente se h&aacute; altera&ccedil;&otilde;es no diret&oacute;rio de implanta&ccedil;&atilde;o e reimplanta a aplica&ccedil;&atilde;o, autom&aacute;tica e dinamicamente, com as altera&ccedil;&otilde;es. Isso &eacute; &uacute;til em um ambiente de desenvolvimento, pois permite testar rapidamente as altera&ccedil;&otilde;es de c&oacute;digos. Em um ambiente de produ&ccedil;&atilde;o, no entanto, o recarregamento din&acirc;mico pode prejudicar o desempenho. Al&eacute;m disso, sempre que ocorre um recarregamento, as sess&otilde;es nesse tempo de transi&ccedil;&atilde;o se tornam inv&aacute;lidas. O cliente deve reiniciar a sess&atilde;o.</p>
<p>Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</li>
<li>
<p>No campo Intervalo de Sondagem de Recarga, digite a dura&ccedil;&atilde;o, em segundos, do intervalo em que aplica&ccedil;&otilde;es e m&oacute;dulos dever&atilde;o ser verificados, para detec&ccedil;&atilde;o de altera&ccedil;&otilde;es de c&oacute;digos, e recarregados dinamicamente.</p>
<p>O valor default &eacute; 2.</p>
</li>
<li>
<p>No campo Time-out da Sess&atilde;o de Admin, digite o n&uacute;mero de minutos de inatividade, ap&oacute;s o qual a sess&atilde;o do Console de Administra&ccedil;&atilde;o ser&aacute; encerrada.</p>
<p>O valor default &eacute; 60.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Implanta&ccedil;&atilde;o Autom&aacute;tica Ativada para ativar a implanta&ccedil;&atilde;o autom&aacute;tica de aplica&ccedil;&otilde;es.</p>
<p>Se voc&ecirc; copiar um arquivo de aplica&ccedil;&atilde;o ou m&oacute;dulo (JAR, WAR, RAR ou EAR) para um diret&oacute;rio especial e depois ativar a implanta&ccedil;&atilde;o autom&aacute;tica, a aplica&ccedil;&atilde;o ou o m&oacute;dulo ser&aacute; automaticamente implantado pelo GlassFish Server. Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</li>
<li>
<p>No campo Intervalo de Sondagem para Implanta&ccedil;&atilde;o Autom&aacute;tica, digite a dura&ccedil;&atilde;o, em segundos, do intervalo em que aplica&ccedil;&otilde;es e m&oacute;dulos dever&atilde;o ser verificados, para detec&ccedil;&atilde;o de altera&ccedil;&otilde;es de c&oacute;digos, e recarregados dinamicamente.</p>
<p>O valor default &eacute; 2. A altera&ccedil;&atilde;o do intervalo de sondagem n&atilde;o afeta o tempo destinado &agrave; implanta&ccedil;&atilde;o de uma aplica&ccedil;&atilde;o ou m&oacute;dulo.</p>
</li>
<li>
<p>No campo Time-out para Tentar Novamente a Implanta&ccedil;&atilde;o Autom&aacute;tica, digite o n&uacute;mero de segundos em que o tamanho de um arquivo parcialmente copiado pode permanecer inalterado antes que ocorra um erro.</p>
<p>O valor default &eacute; 4.</p>
</li>
<li>
<p>O campo Diret&oacute;rio de Implanta&ccedil;&atilde;o Autom&aacute;tica, digite o caminho completo do diret&oacute;rio para monitorar a implanta&ccedil;&atilde;o autom&aacute;tica de aplica&ccedil;&otilde;es.</p>
<p>O valor default &eacute; domain-dir<code>/autodeploy</code>.</p>
</li>
<li>
<p>Na lista drop-down XML, selecione o tipo de valida&ccedil;&atilde;o XML a ser realizada nos descritores de implanta&ccedil;&atilde;o padr&atilde;o e do GlassFish Server.</p>
<p>O tipo pode ser qualquer um dos seguintes:</p>
<dl>
<dt><code>full</code></dt>
<dd>
<p>Se a valida&ccedil;&atilde;o do XML falhar, a implanta&ccedil;&atilde;o falhar&aacute;. Esse &eacute; o valor default.</p>
</dd>
<dt><code>parsing</code></dt>
<dd>
<p>A implanta&ccedil;&atilde;o ocorreu, apesar dos erros de valida&ccedil;&atilde;o do XML relatados.</p>
</dd>
<dt><code>none</code></dt>
<dd>
<p>N&atilde;o foi realizada nenhuma valida&ccedil;&atilde;o do XML.</p>
</dd>
</dl>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Verificador Ativado para verificar os arquivos de descritor de implanta&ccedil;&atilde;o.</p>
<p>O verificador examina a estrutura e o conte&uacute;do do arquivo antes da implanta&ccedil;&atilde;o autom&aacute;tica. Se a verifica&ccedil;&atilde;o falhar, a implanta&ccedil;&atilde;o n&atilde;o ser&aacute; realizada. A verifica&ccedil;&atilde;o de aplica&ccedil;&otilde;es grandes geralmente consome muito tempo. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Pr&eacute;-compila&ccedil;&atilde;o Ativada para pr&eacute;-compilar arquivos JSP.</p>
<p>Se esta op&ccedil;&atilde;o for desativada, os arquivos JSP ser&atilde;o compilados durante o runtime, quando forem acessados pela primeira vez. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>Na se&ccedil;&atilde;o Propriedades Adicionais, especifique as propriedades adicionais.</p>
<p>O GlassFish Server n&atilde;o define nenhuma propriedade adicional para as aplica&ccedil;&otilde;es.</p>
<ul>
<li>
<p>Para adicionar uma propriedade, clique no bot&atilde;o Adicionar Propriedade. Na linha em branco que for exibida, digite o nome da propriedade no campo Nome e digite o valor da propriedade no campo Valor.</p>
</li>
<li>
<p>Para modificar uma propriedade, edite o campo Valor da propriedade.</p>
</li>
<li>
<p>Para deletar uma propriedade, marque a caixa de sele&ccedil;&atilde;o &agrave; esquerda do campo Nome da Propriedade a ser deletada. Clique no bot&atilde;o Deletar Propriedades.</p>
</li>
</ul>
</li>
<li>
<p>Clique em Salvar.</p>

<hr>
<p><b>Dica:</b></p>
Para voltar &agrave;s defini&ccedil;&otilde;es default, clique no bot&atilde;o Carregar Defaults e depois em Salvar.
<hr>

</li>
<li>
<p>Reinicie o servidor.</p>
</li>
</ol>
<a id="sthref12" name="sthref12"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-generaltab.html">Para Exibir Informa&ccedil;&otilde;es Gerais do DAS</a></p>
</li>
<li>
<p><a href="task-logviewer.html">Para Exibir Arquivos de Log do DAS</a></p>
</li>
<li>
<p><a href="task-filter-logs.html">Para Filtrar Registros de Log Exibidos</a></p>
</li>
<li>
<p><a href="task-setadvancedomainattributes.html">Para Definir os Atributos de Dom&iacute;nio</a></p>
</li>
<li>
<p><a href="task-collectdomainlogs.html">Para Coletar e Fazer Download de Logs do Dom&iacute;nio</a></p>
</li>
<li>
<p><a href="task-setadminpassword.html">Para Alterar a Senha do Administrador</a></p>
</li>
<li>
<p><a href="task-systemproperties.html">Para Gerenciar Propriedades do Sistema</a></p>
</li>
<li>
<p><a href="task-appmonitoringdata.html">Para Exibir Dados de Monitoramento da Aplica&ccedil;&atilde;o</a></p>
</li>
<li>
<p><a href="task-servermonitoringdata.html">Para Exibir Dados de Monitoramento do Servidor</a></p>
</li>
<li>
<p><a href="task-resourcemonitoringdata.html">Para Exibir Dados de Monitoramento do Recurso</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
