<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <title>Dialogfenster &quot;Dom&auml;ne hinzuf&uuml;gen&quot;</title>
</head>
<body style="background-color: rgb(255, 255, 255);">
<h1>Dialogfenster &quot;Dom&auml;ne hinzuf&uuml;gen&quot;</h1>
<p>W&auml;hlen Sie mithilfe des Dialogfensters &quot;Dom&auml;ne hinzuf&uuml;gen&quot; den Namen der Dom&auml;ne und die Passw&ouml;rter des Quell- und Zielzertifikats.
</p>
<ol type="1" start="1">
  <a name="step1"> </a>
  <li>Klicken Sie auf das Einblendmen&uuml; der Quelldom&auml;ne und w&auml;hlen Sie die Dom&auml;ne, die die zu migrierenden Sicherheitszertifikate enth&auml;lt.</li>
  <a name="step2"> </a>
  <li>Geben Sie im Passwortfeld die erforderlichen Passw&ouml;rter ein. Je nach Quell- und Zielinstallation m&uuml;ssen entweder zwei oder drei Passw&ouml;rter eingegeben werden:
    <ul>
      <li>Geben Sie im Quell-NSS- und/oder Ziel-NSS-Feld die Passw&ouml;rter f&uuml;r die NSS-Zertifikatdateien ein, die f&uuml;r die NSS-Vertrauensdatenbank verwendet werden.</li>
      <li>Geben Sie im Feld &quot;Benutzerschl&uuml;sseldatenbank&quot; das Passwort f&uuml;r die Quell-Benutzerschl&uuml;sseldatenbank ein, die f&uuml;r die JSSE-Datei <tt>keystore.jks</tt> verwendet wird, die Benutzerschl&uuml;sselpaarzertifikate enth&auml;lt.</li>
      <li>Geben Sie im Feld &quot;Zertifikatausstellerdatenbank&quot; das Passwort f&uuml;r die Zertifikats-Berechtigungsdatenbank ein, das f&uuml;r die JSSE-Datei <tt>cacerts.jks</tt> verwendet wird, die ZA-Zertifikate enth&auml;lt. </li>
    </ul>
  </li>
  <a name="step3"> </a>
  <li>Klicken Sie auf &quot;OK&quot;, um den Vorgang abzuschlie&szlig;en. Das Fenster <a
 href="./xferCertificates.html">&quot;Sicherheitszertifikate &uuml;bertragen&quot;</a> wird ge&ouml;ffnet und zeigt die Dom&auml;ne an, die im Fenster &quot;Domains with Certificates to be Transferred&quot; (&quot;Dom&auml;nen mit zu &uuml;bertragenden Zertifikaten&quot;) hinzugef&uuml;gt wurde.</li>
</ol>
<hr>
<a href="copyright.html" target="main">Rechtliche Hinweise</a>
</body>
</html>
