<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <link rel="stylesheet" href="adminhelp.css" type="text/css">
  <title>Copyright</title>
</head>
<body>
<!-- help content --><a name="wp1022127"> </a>
<h2 class="pHeading2">Copyright
</h2>
<a name="wp1022131"> </a>
<p class="pParagraph">Sun Microsystems, Inc.<br>
4150 Network Circle<br>
Santa Clara, CA 95054 USA
</p>
<a name="wp1022132"> </a>
<p class="pParagraph">&nbsp;
</p>
<a name="wp1022134"> </a>
<p class="pParagraph">Copyright &copy; 2006 Sun Microsystems, Inc. Alle Rechte vorbehalten.
</p>
<a name="wp1022135"> </a>
<p class="pParagraph">Sun Microsystems, Inc. hat Rechte in Bezug auf geistiges Eigentum an der Technologie, die in dem in diesem Dokument beschriebenen Produkt enthalten ist. Im Besonderen und ohne Einschr&auml;nkung umfassen diese Anspr&uuml;che in Bezug auf geistiges Eigentum eines oder mehrere der unter http://www.sun.com/patents aufgelisteten Patente und eines oder mehrere Patente oder Anwendungen mit laufendem Patent in den USA und in anderen L&auml;ndern. </p>
<a name="wp1022136"> </a>
<p class="pParagraph">Unver&ouml;ffentlicht - Rechte vorbehalten gem&auml;&szlig; den Copyright-Gesetzen der Vereinigten Staaten. </p>
<a name="wp1022137"> </a>
<p class="pParagraph">DIESES PRODUKT ENTH&Auml;LT VERTRAULICHE INFORMATIONEN UND GESCH&Auml;FTSGEHEIMNISSE VON SUN MICROSYSTEMS, INC. DIE VERWENDUNG, OFFENLEGUNG ODER VERVIELF&Auml;LTIGUNG IST OHNE VORHERIGE AUSDR&Uuml;CKLICHE SCHRIFTLICHE GENEHMIGUNG VON SUN MICROSYSTEMS, INC. UNTERSAGT. </p>
<a name="wp1022138"> </a>
<p class="pParagraph">Rechte der US-Regierung - Kommerzielle Software. F&uuml;r bei der Regierung besch&auml;ftigte Benutzer gelten die Standardlizenzvereinbarung von Sun Microsystems, Inc. sowie die einschl&auml;gigen Bestimmungen des FAR und seiner Erg&auml;nzungen. </p>
<a name="wp1022139"> </a>
<p class="pParagraph">Die Verwendung unterliegt Lizenzbestimmungen. </p>
<a name="wp1022140"> </a>
<p class="pParagraph">Dieses Lieferung schlie&szlig;t m&ouml;glicherweise Materialien ein, die von Fremdanbietern entwickelt wurden. </p>
<a name="wp1022141"> </a>
<p class="pParagraph">Sun, Sun Microsystems, das Sun-Logo, Java, Jini und das Java-Kaffeetassen-Logo sind Marken bzw. eingetragene Marken von Sun Microsystems, Inc. in den USA und anderen L&auml;ndern. </p>
<a name="wp1022142"> </a>
<p class="pParagraph">UNIX ist eine eingetragene Marke in den Vereinigten Staaten und anderen L&auml;ndern und wird ausschlie&szlig;lich durch die X/Open Company Ltd. lizenziert.
</p>
<a name="wp1022143"> </a>
<p class="pParagraph">Dieses Produkt unterliegt den US-amerikanischen Exportkontrollgesetzen und kann auch in anderen L&auml;ndern Export- oder Importbestimmungen unterliegen. Die Verwendung im Zusammenhang mit Nuklear-, Raketen-, chemischen und biologischen Waffen, im nuklear-maritimen Bereich oder durch in diesem Bereich t&auml;tige Endbenutzer, direkt oder indirekt, ist strengstens untersagt. Der Export oder R&uuml;ckexport in L&auml;nder, die einem US-Embargo unterliegen, oder an Personen und K&ouml;rperschaften, die auf der US-Exportausschlussliste stehen, einschlie&szlig;lich (jedoch nicht beschr&auml;nkt auf) der Liste nicht zul&auml;ssiger Personen und speziell ausgewiesener Staatsangeh&ouml;riger, ist strengstens untersagt.
</p>
<a name="wp1022144"> </a>
<p class="pParagraph">_____________________________________
</p>
<a name="wp1022145"> </a>
<p class="pParagraph">Copyright &copy; 2006 Sun Microsystems, Inc., 4150 Network Circle, Santa Clara, California 95054, USA. Tous droits r&eacute;serv&eacute;s.
</p>
<a name="wp1022146"> </a>
<p class="pParagraph">Sun Microsystems, Inc. d&eacute;tient les droits de propri&eacute;t&eacute; intellectuels relatifs &agrave; la technologie incorpor&eacute;e dans le produit qui est d&eacute;crit dans ce document. En particulier, et ce sans limitation, ces droits de propri&eacute;t&eacute; intellectuelle peuvent inclure un ou plus des brevets am&eacute;ricains list&eacute;s &agrave; l&rsquo;adresse http://www.sun.com/patents et un ou les brevets suppl&eacute;mentaires ou les applications de brevet en attente aux Etats - Unis et dans les autres pays. </p>
<a name="wp1022147"> </a>
<p class="pParagraph">Non publie - droits r&eacute;serv&eacute;s selon la l&eacute;gislation des Etats-Unis sur le droit d&rsquo;auteur.
</p>
<a name="wp1022148"> </a>
<p class="pParagraph">CE PRODUIT CONTIENT DES INFORMATIONS CONFIDENTIELLES ET DES SECRETS COMMERCIAUX DE SUN MICROSYSTEMS, INC. SON UTILISATION, SA DIVULGATION ET SA REPRODUCTION SONT INTERDITES SANS L&rsquo;AUTORISATION EXPRESSE, ECRITE ET PREALABLE DE SUN MICROSYSTEMS, INC. </p>
<a name="wp1022149"> </a>
<p class="pParagraph">L&rsquo;utilisation est soumise aux termes de la Licence. </p>
<a name="wp1022150"> </a>
<p class="pParagraph">Cette distribution peut comprendre des composants d&eacute;velopp&eacute;s par des tierces parties. </p>
<a name="wp1022151"> </a>
<p class="pParagraph">Sun, Sun Microsystems, le logo Sun, Java, Jini et le logo Java Coffee Cup sont des marques de fabrique ou des marques d&eacute;pos&eacute;es de Sun Microsystems, Inc. aux Etats-Unis et dans d&rsquo;autres pays.
</p>
<a name="wp1022152"> </a>
<p class="pParagraph">UNIX est une marque d&eacute;pos&eacute;e aux Etats-Unis et dans d&rsquo;autres pays et licenci&eacute;e exlusivement par X/Open Company, Ltd.
</p>
<a name="wp1022153"> </a>
<p class="pParagraph">Ce produit est soumis &agrave; la l&eacute;gislation am&eacute;ricaine en mati&egrave;re de contr&ocirc;le des exportations et peut &ecirc;tre soumis &agrave; la r&egrave;glementation en vigueur dans d&rsquo;autres pays dans le domaine des exportations et importations. Les utilisations, ou utilisateurs finaux, pour des armes nucl&eacute;aires, des missiles, des armes biologiques et chimiques ou du nucl&eacute;aire maritime, directement ou indirectement, sont strictement interdites. Les exportations ou r&eacute;exportations vers les pays sous embargo am&eacute;ricain, ou vers des entit&eacute;s figurant sur les listes d&rsquo;exclusion d&rsquo;exportation am&eacute;ricaines, y compris, mais de mani&egrave;re non exhaustive, la liste de personnes qui font objet d&rsquo;un ordre de ne pas participer, d&rsquo;une fa&ccedil;on directe ou indirecte, aux exportations des produits ou des services qui sont r&eacute;gis par la l&eacute;gislation am&eacute;ricaine en mati&egrave;re de contr&ocirc;le des exportations et la liste de ressortissants sp&eacute;cifiquement d&eacute;sign&eacute;s, sont rigoureusement interdites.
</p>
<a name="wp1022129"> </a>
<p class="pParagraph"></p>
<a name="wp1022128"> </a>
<p class="pParagraph"></p>
<!-- end help content -->
<hr><a href="copyright.html" target="main">Rechtliche Hinweise</a>
</body>
</html>
