<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-scheduledexecutorservicenew" name="ref-scheduledexecutorservicenew"></a></p>

<h4>Neuer verwalteter geplanter ExecutorService</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Auf der Seite "Neuer verwalteter geplanter ExecutorService" k&ouml;nnen Sie eine geplante verwaltete ExecutorService-Ressource erstellen.</p>
<p>Die Seite "Neuer verwalteter geplanter ExecutorService" enth&auml;lt die folgenden Optionen.</p>
<dl>
<dt>JNDI-Name</dt>
<dd>
<p>Ein eindeutiger Name, der die Ressource identifiziert.</p>
</dd>
<dt>Kontextinformation</dt>
<dd>
<p>Der Kontext der Ressource: Classloader, JNDI, Security oder WorkArea.</p>
</dd>
<dt>Status</dt>
<dd>
<p>Der Status der Ressource. Die Ressource kann aktiviert oder deaktiviert sein. Der Standardwert ist "Aktiviert".</p>
</dd>
<dt>Threadpriorit&auml;t</dt>
<dd>
<p>Die Priorit&auml;t der Threads, die f&uuml;r die verwaltete geplante ExecutorService-Instanz erstellt werden m&uuml;ssen. Der Standardwert ist 5.</p>
</dd>
<dt>Tasks mit langer Ausf&uuml;hrungsdauer</dt>
<dd>
<p>XXX.</p>
</dd>
<dt>Blockiert nach</dt>
<dd>
<p>Die Zeit in Sekunden, die eine Task ausgef&uuml;hrt werden kann, bevor sie als blockiert betrachtet wird.</p>
</dd>
<dt>Core-Gr&ouml;&szlig;e</dt>
<dd>
<p>Die Anzahl von Threads, die in einem Threadpool beibehalten werden sollen. Der Standardwert ist 0.</p>
</dd>
<dt>Maximale Poolgr&ouml;&szlig;e</dt>
<dd>
<p>Die maximale Anzahl von Threads, die im Pool enthalten sein k&ouml;nnen. Der Standardwert ist 2147483647.</p>
</dd>
<dt>Keep-Alive</dt>
<dd>
<p>Die Zeit in Sekunden, die Threads inaktiv bleiben k&ouml;nnen, wenn die Anzahl von Threads gr&ouml;&szlig;er ist als die Core-Gr&ouml;&szlig;e. Der Standardwert ist 60.</p>
</dd>
<dt>Threadg&uuml;ltigkeitsdauer</dt>
<dd>
<p>Die Zeit in Sekunden, die jeder Thread in einem Threadpool bleibt, bevor er gel&ouml;scht wird, unabh&auml;ngig davon, ob die Anzahl von Threads gr&ouml;&szlig;er ist als die Core-Gr&ouml;&szlig;e oder ob der Thread inaktiv ist.</p>
</dd>
<dt>Taskqueuekapazit&auml;t</dt>
<dd>
<p>Die Gr&ouml;&szlig;e der Queue, die weitergeleitete Tasks enth&auml;lt, die auf Ausf&uuml;hrung warten. Der Standardwert ist 2147483647.</p>
</dd>
<dt>Beschreibung</dt>
<dd>
<p>Eine Beschreibung dieser Ressource.</p>
</dd>
<dt>Weitere Eigenschaften</dt>
<dd>
<p>Weitere Eigenschaften f&uuml;r die Ressource. In GlassFish Server werden keine weiteren Eigenschaften f&uuml;r verwaltete geplante ExecutorService-Ressourcen definiert.</p>
</dd>
</dl>
<a id="GHCON149" name="GHCON149"></a>
<h5>Zugeh&ouml;rige asadmin-Befehle</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00022"><code>create-XXX</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00162"><code>list-XXX</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00074"><code>delete-XXX</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
