<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-scheduledexecutorserviceedit" name="ref-scheduledexecutorserviceedit"></a></p>

<h4>Verwalteten geplanten ExecutorService bearbeiten<a id="sthref33" name="sthref33"></a></h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Auf der Seite "Managed Scheduled Executor-Service bearbeiten" k&ouml;nnen Sie eine Managed Scheduled Executor-Serviceressource bearbeiten.</p>
<p>Die Seite "Managed Scheduled Executor-Service bearbeiten" enth&auml;lt die folgenden Optionen.</p>
<dl>
<dt>Standardeinstellungen laden</dt>
<dd>
<p>Schaltfl&auml;che zur Wiederherstellung der Standardwerte von Einstellungen, die Standardwerte haben. Einstellungen, die keine Standardwerte haben, werden nicht ge&auml;ndert.</p>
</dd>
<dt>JNDI-Name</dt>
<dd>
<p>Ein eindeutiger JNDI-Name, der die Ressource identifiziert. Konventionsgem&auml;&szlig; beginnt der Name mit einem Indikator des Ressourcentyps gefolgt von einem Schr&auml;gstrich. Beispiel: concurrent/, jdbc/ oder jms/. Der JNDI-Name ist ein schreibgesch&uuml;tztes Feld. Sie k&ouml;nnen den JNDI-Namen nur festlegen, wenn Sie eine neue Ressource erstellen</p>
</dd>
<dt>Logischer JNDI-Name</dt>
<dd>
<p>Der logische JNDI-Name f&uuml;r die Ressource. Dies ist ein Java EE-Standardname, &uuml;ber den auf die Ressource zugegriffen werden kann. Der logische JNDI-Name ist ein schreibgesch&uuml;tztes Feld. Weitere Informationen finden Sie unter <a href="../../../common/en/help/ref-logicaljndinames.html">Logische JNDI-Namen</a>.</p>
</dd>
<dt>Kontextinformation</dt>
<dd>
<p>Die an Threads zu propagierenden Kontexte: Class Loader, JNDI, Sicherheit oder WorkArea. Die Kontextpropagierung kann aktiviert oder deaktiviert werden. Ist die Option aktiviert, werden die gew&auml;hlten Kontexte propagiert. Ist die Option deaktiviert, wird keiner der Kontexte propagiert, auch wenn sie ausgew&auml;hlt sind. Standardm&auml;&szlig;ig ist die Option aktiviert, und alle vier Kontexte sind gew&auml;hlt.</p>
</dd>
<dt>Status</dt>
<dd>
<p>Gibt an, ob die Ressource zur Laufzeit verf&uuml;gbar ist.</p>
<p>Wenn in der Domain nur die Standardserverinstanz <code>server</code> vorhanden ist, kann die Laufzeitverf&uuml;gbarkeit der Ressource aktiviert oder deaktiviert werden. Laufzeitverf&uuml;gbarkeit ist standardm&auml;&szlig;ig aktiviert.</p>
<p>Wurden in der Domain Cluster oder Standalone-Instanzen erstellt, k&ouml;nnen Sie die Laufzeitverf&uuml;gbarkeit der Ressource auf ihren Zielen &uuml;ber die Registerkarte "Ziel" steuern.</p>
</dd>
<dt>Threadpriorit&auml;t</dt>
<dd>
<p>Die Priorit&auml;t, die erstellten Threads zugewiesen werden soll. Der Standardwert ist 5.</p>
</dd>
<dt>Tasks mit langer Ausf&uuml;hrungszeit</dt>
<dd>
<p>Legt fest, ob die Ressource f&uuml;r Tasks mit langer Ausf&uuml;hrungszeit verwendet werden soll. Ist diese Option aktiviert, werden Tasks mit langer Ausf&uuml;hrungszeit nicht als aufgeh&auml;ngt gemeldet. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>Blockiert nach</dt>
<dd>
<p>Die Anzahl Sekunden, die Tasks ausgef&uuml;hrt werden k&ouml;nnen, bevor sie als nicht reagierend eingestuft werden. Der Standardwert ist 0.</p>
</dd>
<dt>Deployment-Reihenfolge</dt>
<dd>
<p>Die Deployment-Reihenfolge dieser Ressource. Je niedriger die Nummer einer Ressource, desto fr&uuml;her wird sie beim Hochfahren des Servers geladen. Der Standardwert ist 100.</p>
</dd>
<dt>Beschreibung</dt>
<dd>
<p>Eine Beschreibung dieser Ressource.</p>
</dd>
<dt>Core-Gr&ouml;&szlig;e</dt>
<dd>
<p>Die Anzahl von Threads, die in einem Threadpool beibehalten werden sollen. Der Standardwert ist 0.</p>
</dd>
<dt>Keep-Alive</dt>
<dd>
<p>Die Anzahl Sekunden, die Threads inaktiv bleiben k&ouml;nnen, wenn die Anzahl Threads gr&ouml;&szlig;er ist als die Kerngr&ouml;&szlig;e. Der Standardwert ist 60.</p>
</dd>
<dt>Threadg&uuml;ltigkeitsdauer</dt>
<dd>
<p>Die Anzahl Sekunden, die Threads in einem Threadpool bleiben d&uuml;rfen, bevor sie gel&ouml;scht werden, unabh&auml;ngig davon, ob die Anzahl Threads gr&ouml;&szlig;er ist als die Kerngr&ouml;&szlig;e oder ob die Threads inaktiv sind. Der Standardwert ist 0.</p>
</dd>
<dt>Weitere Eigenschaften</dt>
<dd>
<p>Weitere Eigenschaften f&uuml;r die externe Ressource. In GlassFish Server werden keine weiteren Eigenschaften f&uuml;r diesen Ressourcentyp definiert. Dar&uuml;ber hinaus verwendet dieser Ressourcentyp derzeit keine weiteren Eigenschaften.</p>
</dd>
</dl>
<a id="sthref34" name="sthref34"></a>
<h5>Verwandte Aufgaben</h5>
<ul>
<li>
<p><a href="task-managedscheduledexecutorservicecreate.html">So wird ein verwalteter geplanter ExecutorService erstellt</a></p>
</li>
<li>
<p><a href="task-managedscheduledexecutorserviceedit.html">So wird ein verwalteter geplanter ExecutorService bearbeitet</a></p>
</li>
<li>
<p><a href="task-managedscheduledexecutorservicedelete.html">So wird ein verwalteter geplanter ExecutorService gel&ouml;scht</a></p>
</li>
</ul>
<a id="GHCON151" name="GHCON151"></a>
<h5>Zugeh&ouml;rige asadmin-Befehle</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM680"><code>create-managed-scheduled-executor-service</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM873"><code>list-managed-scheduled-executor-services</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM850"><code>delete-managed-scheduled-executor-service</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
