<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-managedexecutorservicecreate" name="task-managedexecutorservicecreate"></a></p>

<h4>So wird ein verwalteter ExecutorService erstellt<a id="sthref5" name="sthref5"></a></h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Mithilfe eines Managed Executor-Service f&uuml;hren Anwendungen weitergeleitete Tasks asynchron aus. Tasks werden auf Threads ausgef&uuml;hrt, die vom Container gestartet und verwaltet werden. Der Kontext des Containers wird an den Thread propagiert, der die Task ausf&uuml;hrt.</p>
<p>In GlassFish Server konfigurieren Sie eine Managed Executor-Serviceressource und stellen sie f&uuml;r Anwendungskomponenten wie Servlets und EJBs bereit.</p>
<ol>
<li>
<p>Blenden Sie in der Navigationsbaumstruktur den Knoten "Ressourcen" ein.</p>
</li>
<li>
<p>Blenden Sie unter dem Ressourcenknoten den Knoten "Nebenl&auml;ufige Ressourcen" ein.</p>
</li>
<li>
<p>W&auml;hlen Sie unter dem Knoten "Nebenl&auml;ufige Ressourcen" den Knoten "Verwaltete ExecutorServices".</p>
<p>Die Seite "Verwaltete ExecutorServices" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie auf der Seite "Verwaltete ExecutorServices" auf "Neu".</p>
<p>Die Seite "Neuer verwalteter ExecutorService" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Geben Sie im Feld "JNDI-Name" einen eindeutigen Namen zur Identifizierung der Ressource ein.</p>
<p>Der JNDI-Name wird im JNDI Naming Service registriert und von Anwendungen zum Lookup der Ressource verwendet. Verwenden Sie das Format <code>concurrent/</code><i>name</i>. Beispiel: <code>concurrent/myManagedExecutorService</code>. Der Name darf ausschlie&szlig;lich alphanumerische Zeichen, Unterstriche, Gedankenstriche oder Punkte enthalten.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Kontextinformationen", um die Kontexte auf Threads zu propagieren, und w&auml;hlen Sie die zu propagierenden Kontexte.</p>
<p>Standardm&auml;&szlig;ig ist diese Option aktiviert, und alle Kontexte sind gew&auml;hlt. Klicken Sie bei gedr&uuml;ckter UMSCHALT- oder STRG-Taste, um mehrere Kontexte auszuw&auml;hlen. Wenn diese Option deaktiviert ist, werden Kontexte nicht propagiert, auch wenn sie ausgew&auml;hlt sind.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Status", um die Ressource zu aktivieren.</p>
<p>Diese Option ist standardm&auml;&szlig;ig aktiviert, was bedeutet, dass die Ressource bei ihrer Erstellung sofort verf&uuml;gbar wird.</p>
</li>
<li>
<p>Geben Sie im Feld "Threadpriorit&auml;t" die Priorit&auml;t ein, die erstellten Threads zugewiesen werden soll.</p>
<p>Der Standardwert ist 5.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Tasks mit langer Ausf&uuml;hrungszeit", um die Ressource zur Ausf&uuml;hrung von Tasks mit langer Ausf&uuml;hrungszeit zu verwenden.</p>
<p>Ist diese Option aktiviert, werden Tasks mit langer Ausf&uuml;hrungszeit nicht als aufgeh&auml;ngt gemeldet. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Geben Sie im Feld "Aufgeh&auml;ngt nach" die Anzahl Sekunden ein, die Tasks ausgef&uuml;hrt werden d&uuml;rfen, bevor sie als nicht reagierend eingestuft werden.</p>
<p>Der Standardwert lautet 0, was bedeutet, dass Tasks niemals als nicht reagierend eingestuft werden.</p>
</li>
<li>
<p>Geben Sie im Feld "Beschreibung" eine kurze Beschreibung der Ressource ein.</p>
<p>Bei dieser Beschreibung handelt es sich um einen Zeichenfolgenwert, der maximal 250 Zeichen umfassen darf.</p>
</li>
<li>
<p>Geben Sie im Feld "Kerngr&ouml;&szlig;e" die Anzahl Threads ein, die in einem Threadpool bleiben sollen, auch wenn sie inaktiv sind.</p>
<p>Wenn eine neue Task weitergeleitet wird und die Anzahl ausgef&uuml;hrter Tasks niedriger als die Kerngr&ouml;&szlig;e ist, wird zur Verarbeitung der Anforderung ein neuer Thread erstellt. Der Standardwert lautet 0, was bedeutet, dass neue Threads nie erstellt werden, es sei denn, die Taskqueue ist voll, oder die Ressource verwendet direktes Queuing. Direktes Queuing tritt auf, wenn die Kapazit&auml;t der Taskqueue bei 0 liegt oder wenn die Kapazit&auml;t der Taskqueue bei 2147483647 liegt und die Kerngr&ouml;&szlig;e 0 betr&auml;gt.</p>
</li>
<li>
<p>Geben Sie im Feld "Maximale Poolgr&ouml;&szlig;e" die maximale Anzahl Threads ein, die ein Threadpool enthalten darf.</p>
<p>Der Standardwert lautet 2147483647, was im Prinzip bedeutet, dass der Threadpool keiner Gr&ouml;&szlig;enbeschr&auml;nkung unterliegt und eine unbegrenzte Anzahl Threads enthalten kann.</p>
</li>
<li>
<p>Geben Sie im Feld "Keep Alive" die Anzahl Sekunden ein, die Threads inaktiv bleiben k&ouml;nnen, wenn die Anzahl Threads gr&ouml;&szlig;er ist als die Kerngr&ouml;&szlig;e.</p>
<p>Der Standardwert ist 60.</p>
</li>
<li>
<p>Geben Sie im Feld "Threadg&uuml;ltigkeitsdauer" die Anzahl Sekunden ein, die Threads in einem Threadpool bleiben d&uuml;rfen, bevor sie gel&ouml;scht werden, unabh&auml;ngig davon, ob die Anzahl Threads gr&ouml;&szlig;er ist als die Kerngr&ouml;&szlig;e oder ob die Threads inaktiv sind.</p>
<p>Der Standardwert lautet 0, was bedeutet, dass Threads niemals gel&ouml;scht werden.</p>
</li>
<li>
<p>Geben Sie im Feld "Kapazit&auml;t der Taskqueue" die Anzahl weitergeleiteter Tasks ein, die in der auf Ausf&uuml;hrung wartenden Taskqueue gespeichert werden k&ouml;nnen.</p>
<p>Der Standardwert lautet 2147483647, was im Prinzip bedeutet, dass die Taskqueue keiner Gr&ouml;&szlig;enbeschr&auml;nkung unterliegt und eine unbegrenzte Anzahl weitergeleiteter Tasks speichern kann.</p>
</li>
<li>
<p>F&uuml;gen Sie im Abschnitt "Weitere Eigenschaften" keine weiteren Eigenschaften hinzu.</p>
<p>GlassFish Server definiert keine weiteren Eigenschaften f&uuml;r diesen Ressourcentyp. Dar&uuml;ber hinaus verwendet dieser Ressourcentyp derzeit keine weiteren Eigenschaften.</p>
</li>
<li>
<p>Klicken Sie auf "OK".</p>
</li>
</ol>
<a id="GHCON110" name="GHCON110"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-managedexecutorserviceedit.html">So wird ein verwalteter ExecutorService bearbeitet</a></p>
</li>
<li>
<p><a href="task-managedexecutorservicedelete.html">So wird ein verwalteter ExecutorService gel&ouml;scht</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
