<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-adminobjectedit" name="ref-adminobjectedit"></a></p>

<h4><a id="sthref103" name="sthref103"></a>Modifier une ressource d'objet d'administration</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Modifier une ressource d'objet d'administration permet de modifier les param&egrave;tres d'une ressource d'objet administr&eacute;.</p>
<p>Elle contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Charger les valeurs par d&eacute;faut</dt>
<dd>
<p>Bouton permettant de restaurer les valeurs par d&eacute;faut des param&egrave;tres qui en ont. Les param&egrave;tres qui n'ont pas de valeurs par d&eacute;faut ne sont pas modifi&eacute;s.</p>
</dd>
<dt>Nom JNDI</dt>
<dd>
<p>Nom unique identifiant la ressource d'objet administr&eacute;. Le champ Nom JNDI est en lecture seule. Vous ne pouvez sp&eacute;cifier le nom JNDI qu'&agrave; la cr&eacute;ation d'une ressource d'objet administr&eacute;.</p>
</dd>
<dt>Adaptateur de ressources</dt>
<dd>
<p>Adaptateur de ressources pour la ressource d'objet administr&eacute;.</p>
</dd>
<dt>Type de ressource</dt>
<dd>
<p>Type Java de la ressource d'objet administr&eacute; (par exemple, <code>javax.jms.Topic</code>).</p>
</dd>
<dt>Nom de classe</dt>
<dd>
<p>Nom de la classe d'impl&eacute;mentation associ&eacute;e au type de ressource.</p>
</dd>
<dt>Ordre de d&eacute;ploiement</dt>
<dd>
<p>Ordre de d&eacute;ploiement de la ressource d'objet administr&eacute;.</p>
</dd>
<dt>Description</dt>
<dd>
<p>Description de la ressource d'objet administr&eacute;.</p>
</dd>
<dt>Statut</dt>
<dd>
<p>Indique si la ressource est disponible lors de l'ex&eacute;cution.</p>
<p>Si seule l'instance de serveur par d&eacute;faut <code>server</code>, existe dans le domaine, la disponibilit&eacute; d'ex&eacute;cution de la ressource peut &ecirc;tre activ&eacute;e ou d&eacute;sactiv&eacute;e. La disponibilit&eacute; d'ex&eacute;cution est activ&eacute;e par d&eacute;faut.</p>
<p>Si des clusters ou des instances autonomes ont &eacute;t&eacute; cr&eacute;&eacute;s dans le domaine, utilisez l'onglet Cible pour contr&ocirc;ler la disponibilit&eacute; d'ex&eacute;cution de la ressource sur ses cibles.</p>
</dd>
<dt>Autres propri&eacute;t&eacute;s</dt>
<dd>
<p>Propri&eacute;t&eacute;s suppl&eacute;mentaires de la ressource d'objet administr&eacute;. Les propri&eacute;t&eacute;s disponibles d&eacute;pendent de l'adaptateur de ressources du pool de connexions de connecteur. Les paires nom-valeur sp&eacute;cifi&eacute;es dans cette table peuvent &ecirc;tre utilis&eacute;es pour remplacer les valeurs par d&eacute;faut des propri&eacute;t&eacute;s d&eacute;finies par le fournisseur de l'adaptateur de ressources.</p>
</dd>
</dl>
<a id="sthref104" name="sthref104"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-adminobjectnew.html">Cr&eacute;ation d'une ressource d'objet administr&eacute;</a></p>
</li>
<li>
<p><a href="task-adminobjectedit.html">Modification d'une ressource d'objet administr&eacute;</a></p>
</li>
<li>
<p><a href="task-administeredobjectresourcedelete.html">Suppression d'une ressource d'objet administr&eacute;</a></p>
</li>
</ul>
<a id="sthref105" name="sthref105"></a>
<h5>Commandes asadmin connexes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00012"><code>create-admin-object</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00146"><code>list-admin-objects</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00063"><code>delete-admin-object</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
