<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-connectorconnectionpooladvance" name="ref-connectorconnectionpooladvance"></a><a id="GHJCA00045" name="GHJCA00045"></a></p>

<h4><a id="sthref78" name="sthref78"></a>Modifier les attributs avanc&eacute;s d'un pool de connexions de connecteur</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Modifier les attributs avanc&eacute;s d'un pool de connexions de connecteur permet de modifier les param&egrave;tres avanc&eacute;s d'un pool de connexions de connecteur.</p>
<p>Elle contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Charger les valeurs par d&eacute;faut</dt>
<dd>
<p>Bouton permettant de restaurer les valeurs par d&eacute;faut des param&egrave;tres qui en ont. Les param&egrave;tres qui n'ont pas de valeurs par d&eacute;faut ne sont pas modifi&eacute;s.</p>
</dd>
<dt>Valider une fois au plus</dt>
<dd>
<p>Indique l'intervalle, exprim&eacute; en secondes, entre des demandes successives de validation d'une connexion, une fois au plus. La valeur par d&eacute;faut est 0, ce qui signifie que l'attribut n'est pas activ&eacute;.</p>
</dd>
<dt>D&eacute;lai d'expiration de perte de connexion</dt>
<dd>
<p>Dur&eacute;e, en secondes, n&eacute;cessaire pour tracer les pertes de connexion dans un pool de connexions. La valeur 0 indique que le tra&ccedil;age des pertes de connexion est d&eacute;sactiv&eacute;. La valeur par d&eacute;faut est 0.</p>
</dd>
<dt>R&eacute;cup&eacute;ration de perte</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, les connexions pr&eacute;sentant des pertes seront restaur&eacute;es dans le pool une fois le tra&ccedil;age des pertes de connexion termin&eacute;. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Tentatives de cr&eacute;ation</dt>
<dd>
<p>Nombre de tentatives effectu&eacute;es en cas d'&eacute;chec de cr&eacute;ation d'une connexion. La valeur 0 indique qu'aucune tentative ne sera effectu&eacute;e pour recr&eacute;er la connexion. La valeur par d&eacute;faut est 0.</p>
</dd>
<dt>Intervalle entre les tentatives</dt>
<dd>
<p>Intervalle, en secondes, entre deux tentatives de cr&eacute;ation d'une connexion. Cet attribut n'est utilis&eacute; que si la valeur de l'option Tentatives de cr&eacute;ation est sup&eacute;rieure &agrave; 0. La valeur par d&eacute;faut est de 10 secondes.</p>
</dd>
<dt>Groupement</dt>
<dd>
<p>Active le groupement des connexions pour le pool. Cette option est activ&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Association lazy</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, les connexions sont associ&eacute;es en diff&eacute;r&eacute; lorsque vous effectuez une op&eacute;ration sur celles-ci. Les connexions sont dissoci&eacute;es lorsque la transaction est termin&eacute;e et qu'une m&eacute;thode de composant prend fin, ce qui facilite la r&eacute;utilisation des connexions physiques. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Participation des connexions lazy &agrave; la transaction</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, une ressource est engag&eacute;e dans une transaction uniquement lorsqu'elle est utilis&eacute;e dans une m&eacute;thode. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Associer &agrave; un thread</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, une connexion est associ&eacute;e &agrave; un thread. Lorsque ce dernier n&eacute;cessite une connexion, il peut r&eacute;utiliser celle qui lui est d&eacute;j&agrave; associ&eacute;e, limitant ainsi le temps syst&egrave;me li&eacute; &agrave; l'obtention d'une connexion &agrave; partir du pool. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Faire correspondre les connexions</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, la correspondance de connexions est activ&eacute;e pour le pool. Cette option peut &ecirc;tre d&eacute;sactiv&eacute;e si vous savez que les connexions du pool seront toujours homog&egrave;nes et qu'il est donc inutile pour l'adaptateur de ressources d'associer une connexion emprunt&eacute;e au pool. Cette option est activ&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Utilisation des correspondances de connexions</dt>
<dd>
<p>Nombre de r&eacute;utilisations possibles d'une connexion par le pool. Une fois qu'une connexion a &eacute;t&eacute; r&eacute;utilis&eacute;e le nombre de fois sp&eacute;cifi&eacute;, elle est ferm&eacute;e. La valeur 0 indique que cet attribut n'est pas activ&eacute;. La valeur par d&eacute;faut est 0.</p>
</dd>
</dl>
<a id="sthref79" name="sthref79"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-connectorconnectionpoolnew.html">Cr&eacute;ation d'un pool de connexions de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">Modification d'un pool de connexions de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">Modification des attributs avanc&eacute;s de pool de connexions de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">Modification des propri&eacute;t&eacute;s de pool de connexions de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">Cr&eacute;ation d'une mappe de s&eacute;curit&eacute; pour un pool de connexions de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">Modification d'une mappe de s&eacute;curit&eacute; pour un pool de connexions de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">Suppression d'une mappe de s&eacute;curit&eacute; pour un pool de connexions de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">Suppression d'un pool de connexions de connecteur</a></p>
</li>
</ul>
<a id="sthref80" name="sthref80"></a>
<h5>Commandes asadmin connexes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00018"><code>create-connector-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00157"><code>list-connector-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00070"><code>delete-connector-connection-pool</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
