<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-adminobjectnew" name="ref-adminobjectnew"></a><a id="GHJCA00051" name="GHJCA00051"></a></p>

<h4><a id="sthref100" name="sthref100"></a>Nouvelle ressource d'objet d'administration</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Nouvelle ressource d'objet d'administration permet de cr&eacute;er une ressource d'objet administr&eacute;.</p>
<p>Elle contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Nom JNDI</dt>
<dd>
<p>Nom unique identifiant la ressource d'objet administr&eacute;.</p>
</dd>
<dt>Adaptateur de ressources</dt>
<dd>
<p>Adaptateur de ressources pour la ressource d'objet administr&eacute;.</p>
</dd>
<dt>Type de ressource</dt>
<dd>
<p>Type Java de la ressource d'objet administr&eacute; (par exemple, <code>javax.jms.Topic</code>).</p>
</dd>
<dt>Nom de classe</dt>
<dd>
<p>Nom de la classe d'impl&eacute;mentation associ&eacute;e au type de ressource.</p>
</dd>
<dt>Description</dt>
<dd>
<p>Description de la ressource d'objet administr&eacute;.</p>
</dd>
<dt>Statut</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, la ressource d'objet administr&eacute; est activ&eacute;e. Cette option est activ&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Autres propri&eacute;t&eacute;s</dt>
<dd>
<p>Propri&eacute;t&eacute;s suppl&eacute;mentaires de la ressource d'objet administr&eacute;. Les propri&eacute;t&eacute;s disponibles d&eacute;pendent de l'adaptateur de ressources du pool de connexions de connecteur. Les paires nom-valeur sp&eacute;cifi&eacute;es dans cette table peuvent &ecirc;tre utilis&eacute;es pour remplacer les valeurs par d&eacute;faut des propri&eacute;t&eacute;s d&eacute;finies par le fournisseur de l'adaptateur de ressources.</p>
</dd>
<dt>Cibles</dt>
<dd>
<p>Clusters et instances autonomes de la ressource d'objet administr&eacute;. D&eacute;placez les cibles souhait&eacute;es dans la colonne Cibles s&eacute;lectionn&eacute;es &agrave; l'aide des boutons Ajouter et Tout ajouter. D&eacute;placez toutes les cibles inutiles dans la colonne Cibles disponibles &agrave; l'aide des boutons Enlever et Tout enlever.</p>
<p>Cette option appara&icirc;t uniquement si des clusters ou des instances autonomes ont &eacute;t&eacute; cr&eacute;&eacute;s dans le domaine.</p>
</dd>
</dl>
<a id="sthref101" name="sthref101"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-adminobjectnew.html">Cr&eacute;ation d'une ressource d'objet administr&eacute;</a></p>
</li>
<li>
<p><a href="task-adminobjectedit.html">Modification d'une ressource d'objet administr&eacute;</a></p>
</li>
<li>
<p><a href="task-administeredobjectresourcedelete.html">Suppression d'une ressource d'objet administr&eacute;</a></p>
</li>
</ul>
<a id="sthref102" name="sthref102"></a>
<h5>Commandes asadmin connexes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00012"><code>create-admin-object</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00146"><code>list-admin-objects</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00063"><code>delete-admin-object</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
