<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-worksecuritymaps" name="ref-worksecuritymaps"></a></p>

<h4><a id="sthref106" name="sthref106"></a><a id="sthref107" name="sthref107"></a>Mappes de s&eacute;curit&eacute; de travail</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Mappes de s&eacute;curit&eacute; de travail permet de configurer les mappes de s&eacute;curit&eacute; de travail pour les adaptateurs de ressources.</p>
<p>Une mappe de s&eacute;curit&eacute; de travail de connecteur met en correspondance l'identit&eacute; de l'appelant du travail soumis par le principal EIS ou un groupe d'utilisateurs EIS de l'adaptateur de ressources avec un principal ou un groupe d'utilisateurs appropri&eacute; dans le domaine de s&eacute;curit&eacute; GlassFish Server. Des mappes de s&eacute;curit&eacute; de travail peuvent &ecirc;tre associ&eacute;es &agrave; un adaptateur de ressources. La configuration de la mappe de s&eacute;curit&eacute; de travail de connecteur prend en charge l'utilisation du caract&egrave;re g&eacute;n&eacute;rique ast&eacute;risque (<code>*</code>) pour indiquer tous les utilisateurs ou tous les groupes d'utilisateurs.</p>
<p>Une mappe de s&eacute;curit&eacute; de travail diff&egrave;re d'une mappe de s&eacute;curit&eacute; pour un pool de connexions de connecteur, qui associe le principal re&ccedil;u pendant l'authentification EJB ou du servlet aux informations d'identification et de connexion accept&eacute;es par le syst&egrave;me EIS. Pour plus d'informations sur les mappes de s&eacute;curit&eacute; des pools de connexions du connecteur, reportez-vous &agrave; <a href="ref-connectorsecuritymaps.html">Mappes de s&eacute;curit&eacute; des pools de connexions du connecteur</a>.</p>
<p>Le syst&egrave;me d'information d'entreprise (EIS) est un syst&egrave;me contenant les donn&eacute;es de l'organisation. Il peut s'agir d'un mainframe, d'un syst&egrave;me de messagerie, d'un syst&egrave;me de base de donn&eacute;es ou d'une application.</p>
<p>Pour chaque mappe de s&eacute;curit&eacute; de travail, les informations suivantes sont fournies.</p>
<dl>
<dt>Nom</dt>
<dd>
<p>Nom de la mappe de s&eacute;curit&eacute; de travail.</p>
</dd>
</dl>
<p>La table Mappes de s&eacute;curit&eacute; de travail contient &eacute;galement les options ci-apr&egrave;s.</p>
<dl>
<dt>Nouveau</dt>
<dd>
<p>Bouton permettant de cr&eacute;er une mappe de s&eacute;curit&eacute; de travail.</p>
</dd>
<dt>Supprimer</dt>
<dd>
<p>Bouton permettant de supprimer les mappes de s&eacute;curit&eacute; de travail s&eacute;lectionn&eacute;es.</p>
</dd>
</dl>
<a id="sthref108" name="sthref108"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-worksecuritymapnew.html">Cr&eacute;ation d'une mappe de s&eacute;curit&eacute; de travail</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">Modification d'une mappe de s&eacute;curit&eacute; de travail</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">Suppression d'une mappe de s&eacute;curit&eacute; de travail</a></p>
</li>
</ul>
<a id="sthref109" name="sthref109"></a>
<h5>Commandes asadmin connexes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00021"><code>create-connector-work-security-map</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00160"><code>list-connector-work-security-maps</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00073"><code>delete-connector-work-security-map</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00253"><code>update-connector-work-security-map</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
