<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-connectors" name="ref-connectors"></a></p>

<h4><a id="sthref56" name="sthref56"></a>Connecteurs</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Connecteurs permet de configurer les types de ressource de connecteur suivants :</p>
<ul>
<li>
<p><a href="ref-connectorresources.html">Ressources de connecteur</a></p>
</li>
<li>
<p><a href="ref-connectorconnectionpools.html">Pools de connexions du connecteur</a></p>
</li>
<li>
<p><a href="ref-adminobjectresources.html">Ressources d'objet d'administration</a></p>
</li>
<li>
<p><a href="ref-worksecuritymaps.html">Mappes de s&eacute;curit&eacute; de travail</a></p>
</li>
</ul>
<p>Un module connecteur (&eacute;galement appel&eacute; adaptateur de ressources) est un composant Java qui permet aux applications d'interagir avec les syst&egrave;mes d'information d'entreprise (EIS). Les syst&egrave;mes EIS incluent diff&eacute;rents types de syst&egrave;me : progiciel de gestion int&eacute;gr&eacute; (ERP), traitement des transactions mainframe, bases de donn&eacute;es non relationnelles et syst&egrave;mes de messagerie tels que Java Message Service (JMS) notamment.</p>
<p>Un pool de connexions de connecteur est un groupe de connexions r&eacute;utilisables pour un syst&egrave;me EIS donn&eacute;.</p>
<p>Une ressource de connecteur est un objet de programme fournissant une connexion vers un syst&egrave;me EIS &agrave; une application.</p>
<p>Une ressource d'objet administr&eacute; fournit des fonctionnalit&eacute;s sp&eacute;cialis&eacute;es pour une application.</p>
<p>Une mappe de s&eacute;curit&eacute; de travail met en correspondance un principal associ&eacute; &agrave; une instance de travail entrante et un principal appartenant au domaine de s&eacute;curit&eacute; GlassFish Server.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
