<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-connectionservice" name="ref-connectionservice"></a><a id="GHJCA00059" name="GHJCA00059"></a></p>

<h4><a id="sthref125" name="sthref125"></a>Service du connecteur</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Service du connecteur permet de modifier les param&egrave;tres g&eacute;n&eacute;raux du service du connecteur, qui r&eacute;git les adaptateurs de ressources.</p>
<p>Elle contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Charger les valeurs par d&eacute;faut</dt>
<dd>
<p>Bouton permettant de restaurer les valeurs par d&eacute;faut des param&egrave;tres qui en ont. Les param&egrave;tres qui n'ont pas de valeurs par d&eacute;faut ne sont pas modifi&eacute;s.</p>
</dd>
<dt>Nom de configuration</dt>
<dd>
<p>Nom de la configuration &agrave; laquelle s'appliquent les param&egrave;tres de cette page. Ce champ est en lecture seule.</p>
</dd>
<dt>D&eacute;lai d'arr&ecirc;t</dt>
<dd>
<p>D&eacute;lai maximal autoris&eacute;, en secondes, pour l'ex&eacute;cution de la m&eacute;thode <code>ResourceAdapter.stop</code> d'une instance de module connecteur, au cours de l'arr&ecirc;t de GlassFish Server. Les adaptateurs de ressources d&eacute;passant ce d&eacute;lai de fermeture sont ignor&eacute;s et l'arr&ecirc;t de GlassFish Server se poursuit. La valeur par d&eacute;faut est de 30 secondes.</p>
</dd>
<dt>R&egrave;gle de chargement de classe de connecteur</dt>
<dd>
<p>R&egrave;gle &agrave; utiliser pour le chargement des classes. Les choix disponibles sont les suivants :</p>
<dl>
<dt><code>derived</code></dt>
<dd>
<p>Indique que les adaptateurs de ressources sont fournis en fonction des r&eacute;f&eacute;rences d'une application &agrave; l'une des ressources de l'adaptateur. Cette r&egrave;gle est utilis&eacute;e par d&eacute;faut.</p>
</dd>
<dt><code>global</code></dt>
<dd>
<p>Indique que l'ensemble des adaptateurs de ressources sera visible par toutes les applications.</p>
</dd>
</dl>
<p>Cette r&egrave;gle ne s'applique pas &agrave; l'adaptateur de ressources du syst&egrave;me JMS pr&eacute;install&eacute;, <code>jmsra</code>, qui est toujours visible par toutes les applications.</p>
</dd>
</dl>
<a id="sthref126" name="sthref126"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-connectionservice.html">Configuration du service du connecteur</a></p>
</li>
<li>
<p><a href="../../../common/en/help/task-appdeployconn.html">D&eacute;ploiement d'un module connecteur</a></p>
</li>
</ul>
<a id="sthref127" name="sthref127"></a>
<h5>Commandes asadmin connexes</h5>
<p>Aucune.</p>




<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
