<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-adminobjectnew" name="task-adminobjectnew"></a></p>

<h4><a id="sthref33" name="sthref33"></a>Cr&eacute;ation d'une ressource d'objet administr&eacute;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Ressources.</p>
</li>
<li>
<p>D&eacute;veloppez le noeud Connecteurs.</p>
</li>
<li>
<p>Sous le noeud Connecteurs, s&eacute;lectionnez le noeud Ressources d'objet d'administration.</p>
<p>La page Ressources d'objet d'administration appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Ressources d'objet d'administration, cliquez sur le bouton Nouveau.</p>
<p>La page Nouvelle ressource d'objet d'administration appara&icirc;t.</p>
</li>
<li>
<p>Dans le champ Nom JNDI, saisissez le nom unique qui identifie la ressource d'objet administr&eacute;.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Adaptateur de ressources, s&eacute;lectionnez l'adaptateur de ressources pour la ressource d'objet administr&eacute;.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Type de ressource, s&eacute;lectionnez le type Java de la ressource d'objet administr&eacute;.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Nom de classe, s&eacute;lectionnez le nom de la classe d'impl&eacute;mentation associ&eacute;e au type de ressource.</p>
</li>
<li>
<p>Dans le champ Description, saisissez la description de la ressource d'objet administr&eacute;.</p>
</li>
<li>
<p>S&eacute;lectionnez la case Activ&eacute; du champ Statut pour activer la ressource d'objet administr&eacute;.</p>
<p>Cette option est activ&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Dans la table Autres propri&eacute;t&eacute;s, sp&eacute;cifiez les propri&eacute;t&eacute;s suppl&eacute;mentaires de la ressource d'objet administr&eacute;.</p>
<p>Les propri&eacute;t&eacute;s disponibles d&eacute;pendent de l'adaptateur de ressources du pool de connexions de connecteur.</p>
<p>Pour ajouter une propri&eacute;t&eacute;, cliquez sur le bouton Ajouter une propri&eacute;t&eacute;. Sur la ligne vide qui appara&icirc;t, saisissez le nom de la propri&eacute;t&eacute; dans le champ Nom et la valeur de la propri&eacute;t&eacute; dans le champ Valeur.</p>
</li>
<li>
<p>Dans la section Cibles disponibles, s&eacute;lectionnez le domaine, le cluster ou les instances de serveur o&ugrave; doit r&eacute;sider l'objet administr&eacute;, puis cliquez sur Ajouter.</p>
<p>Pour enlever l'un des domaines, clusters ou l'une des instances de serveur r&eacute;pertori&eacute;s dans le champ S&eacute;lectionn&eacute;, s&eacute;lectionnez l'&eacute;l&eacute;ment dans le champ, puis cliquez sur Enlever.</p>
</li>
<li>
<p>Cliquez sur OK.</p>
</li>
</ol>
<a id="sthref34" name="sthref34"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-connectorresourcenew.html">Cr&eacute;ation d'une ressource de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorresourceedit.html">Modification d'une ressource de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorresourcesdelete.html">Suppression d'une ressource de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolnew.html">Cr&eacute;ation d'un pool de connexions de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">Modification d'un pool de connexions de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">Modification des attributs avanc&eacute;s de pool de connexions de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">Modification des propri&eacute;t&eacute;s de pool de connexions de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">Cr&eacute;ation d'une mappe de s&eacute;curit&eacute; pour un pool de connexions de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">Modification d'une mappe de s&eacute;curit&eacute; pour un pool de connexions de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">Suppression d'une mappe de s&eacute;curit&eacute; pour un pool de connexions de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">Suppression d'un pool de connexions de connecteur</a></p>
</li>
<li>
<p><a href="task-setupeisaccess.html">Configuration de l'acc&egrave;s au syst&egrave;me EIS</a></p>
</li>
<li>
<p><a href="task-adminobjectedit.html">Modification d'une ressource d'objet administr&eacute;</a></p>
</li>
<li>
<p><a href="task-administeredobjectresourcedelete.html">Suppression d'une ressource d'objet administr&eacute;</a></p>
</li>
<li>
<p><a href="task-worksecuritymapnew.html">Cr&eacute;ation d'une mappe de s&eacute;curit&eacute; de travail</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">Modification d'une mappe de s&eacute;curit&eacute; de travail</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">Suppression d'une mappe de s&eacute;curit&eacute; de travail</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
