<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-connectionservice" name="task-connectionservice"></a><a id="GHJCA00081" name="GHJCA00081"></a></p>

<h4><a id="sthref54" name="sthref54"></a>Configuration du service du connecteur</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Configuration.</p>
</li>
<li>
<p>Sous le noeud Configuration, s&eacute;lectionnez le noeud Service du connecteur.</p>
<p>La page Service du connecteur appara&icirc;t.</p>
</li>
<li>
<p>Dans le champ D&eacute;lai d'arr&ecirc;t, saisissez le d&eacute;lai maximal autoris&eacute;, en secondes, pour l'ex&eacute;cution de la m&eacute;thode <code>ResourceAdapter.stop</code> d'une instance de module connecteur, au cours de l'arr&ecirc;t de GlassFish Server.</p>
<p>Les adaptateurs de ressources d&eacute;passant ce d&eacute;lai de fermeture sont ignor&eacute;s et l'arr&ecirc;t de GlassFish Server se poursuit. La valeur par d&eacute;faut est de 30 secondes.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante R&egrave;gle de chargement de classe de connecteur, s&eacute;lectionnez la r&egrave;gle &agrave; utiliser.</p>
<ul>
<li>
<p>S&eacute;lectionnez <code>derived</code> pour indiquer que les adaptateurs de ressources sont fournis en fonction des r&eacute;f&eacute;rences d'une application &agrave; l'une des ressources de l'adaptateur de ressources.</p>
<p>Cette r&egrave;gle est utilis&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>S&eacute;lectionnez <code>global</code> pour indiquer que l'ensemble des adaptateurs de ressources sera visible par toutes les applications.</p>
</li>
</ul>
<p>Cette r&egrave;gle ne s'applique pas &agrave; l'adaptateur de ressources du syst&egrave;me JMS pr&eacute;install&eacute;, <code>jmsra</code>, qui est toujours visible par toutes les applications.</p>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>

<hr>
<p><b>Conseil:</b></p>
Pour revenir aux param&egrave;tres par d&eacute;faut, cliquez sur le bouton Charger les valeurs par d&eacute;faut, puis sur Enregistrer.
<hr>

</li>
</ol>
<a id="sthref55" name="sthref55"></a>
<h5>Voir aussi</h5>
<p><a href="../../../common/en/help/task-appdeployconn.html">D&eacute;ploiement d'un module connecteur</a></p>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
