<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-connectorsecuritymapedit" name="task-connectorsecuritymapedit"></a><a id="GHJCA00068" name="GHJCA00068"></a></p>

<h4><a id="sthref22" name="sthref22"></a><a id="sthref23" name="sthref23"></a>Modification d'une mappe de s&eacute;curit&eacute; pour un pool de connexions de connecteur</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Ressources.</p>
</li>
<li>
<p>D&eacute;veloppez le noeud Connecteurs.</p>
</li>
<li>
<p>Sous le noeud Connecteurs, s&eacute;lectionnez le noeud Pools de connexions du connecteur.</p>
<p>La page Pools de connexions du connecteur appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Pools de connexions du connecteur, cliquez sur le nom du pool de connexions &agrave; modifier.</p>
<p>La page Modifier le pool de connexions du connecteur appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Modifier le pool de connexions du connecteur, cliquez sur l'onglet Mappes de s&eacute;curit&eacute;.</p>
<p>La page Mappes de s&eacute;curit&eacute; des pools de connexions du connecteur appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Mappes de s&eacute;curit&eacute; des pools de connexions du connecteur, cliquez sur le nom de la mappe de s&eacute;curit&eacute; &agrave; modifier.</p>
<p>La page Modifier une mappe de s&eacute;curit&eacute; du pool de connexions du connecteur appara&icirc;t.</p>
</li>
<li>
<p>Effectuez l'une des op&eacute;rations suivantes uniquement :</p>
<ul>
<li>
<p>S&eacute;lectionnez le bouton radio Groupes d'utilisateurs et entrez les noms des groupes d'utilisateurs, s&eacute;par&eacute;s par des virgules.</p>
</li>
<li>
<p>S&eacute;lectionnez le bouton radio Principaux et entrez les noms des principaux, s&eacute;par&eacute;s par des virgules.</p>
</li>
</ul>
</li>
<li>
<p>Dans le champ Nom utilisateur, sp&eacute;cifiez le nom utilisateur du principal back-end requis par le syst&egrave;me EIS.</p>
</li>
<li>
<p>Dans le champ Mot de passe, sp&eacute;cifiez le mot de passe du principal back-end requis par le syst&egrave;me EIS.</p>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>
</li>
</ol>
<a id="sthref24" name="sthref24"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-connectorresourcenew.html">Cr&eacute;ation d'une ressource de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorresourceedit.html">Modification d'une ressource de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorresourcesdelete.html">Suppression d'une ressource de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolnew.html">Cr&eacute;ation d'un pool de connexions de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">Modification d'un pool de connexions de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">Modification des attributs avanc&eacute;s de pool de connexions de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">Modification des propri&eacute;t&eacute;s de pool de connexions de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">Cr&eacute;ation d'une mappe de s&eacute;curit&eacute; pour un pool de connexions de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">Suppression d'une mappe de s&eacute;curit&eacute; pour un pool de connexions de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">Suppression d'un pool de connexions de connecteur</a></p>
</li>
<li>
<p><a href="task-setupeisaccess.html">Configuration de l'acc&egrave;s au syst&egrave;me EIS</a></p>
</li>
<li>
<p><a href="task-adminobjectnew.html">Cr&eacute;ation d'une ressource d'objet administr&eacute;</a></p>
</li>
<li>
<p><a href="task-adminobjectedit.html">Modification d'une ressource d'objet administr&eacute;</a></p>
</li>
<li>
<p><a href="task-administeredobjectresourcedelete.html">Suppression d'une ressource d'objet administr&eacute;</a></p>
</li>
<li>
<p><a href="task-worksecuritymapnew.html">Cr&eacute;ation d'une mappe de s&eacute;curit&eacute; de travail</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">Modification d'une mappe de s&eacute;curit&eacute; de travail</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">Suppression d'une mappe de s&eacute;curit&eacute; de travail</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
