<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-connectorconnectionpooladvance" name="task-connectorconnectionpooladvance"></a><a id="GHJCA00065" name="GHJCA00065"></a></p>

<h4><a id="sthref14" name="sthref14"></a>Modification des attributs avanc&eacute;s de pool de connexions de connecteur</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Ressources.</p>
</li>
<li>
<p>D&eacute;veloppez le noeud Connecteurs.</p>
</li>
<li>
<p>Sous le noeud Connecteurs, s&eacute;lectionnez le noeud Pools de connexions du connecteur.</p>
<p>La page Pools de connexions du connecteur appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Pools de connexions du connecteur, cliquez sur le nom du pool de connexions de connecteur &agrave; modifier.</p>
<p>La page Modifier le pool de connexions du connecteur appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Modifier le pool de connexions du connecteur, cliquez sur l'onglet Avanc&eacute;.</p>
<p>La page Modifier les attributs avanc&eacute;s d'un pool de connexions de connecteur appara&icirc;t.</p>
</li>
<li>
<p>Dans le champ Valider une fois au plus, saisissez le d&eacute;lai, en secondes, au bout duquel une connexion est valid&eacute;e une fois au plus.</p>
<p>La d&eacute;finition de cet attribut sur une valeur appropri&eacute;e r&eacute;duit le nombre de demandes de validation &eacute;manant d'une connexion. La valeur par d&eacute;faut est 0, ce qui signifie que l'attribut n'est pas activ&eacute;.</p>
</li>
<li>
<p>Dans le champ D&eacute;lai d'expiration de perte de connexion, saisissez la dur&eacute;e, en secondes, n&eacute;cessaire pour tracer les pertes de connexion dans un pool de connexions.</p>
<p>La valeur 0 indique que le tra&ccedil;age des pertes de connexion est d&eacute;sactiv&eacute;. La valeur par d&eacute;faut est 0.</p>
</li>
<li>
<p>S&eacute;lectionnez la case R&eacute;cup&eacute;ration de perte pour que les connexions pr&eacute;sentant des pertes soient restaur&eacute;es dans le pool une fois le tra&ccedil;age des pertes de connexion termin&eacute;.</p>
<p>Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Dans le champ Tentatives de cr&eacute;ation, saisissez le nombre de tentatives effectu&eacute;es en cas d'&eacute;chec de cr&eacute;ation d'une connexion.</p>
<p>La valeur 0 indique qu'aucune tentative ne sera effectu&eacute;e pour recr&eacute;er la connexion. La valeur par d&eacute;faut est 0.</p>
</li>
<li>
<p>Dans le champ Intervalle entre les tentatives, saisissez l'intervalle, en secondes, entre deux tentatives de cr&eacute;ation d'une connexion.</p>
<p>Cet attribut n'est utilis&eacute; que si la valeur de l'option Tentatives de cr&eacute;ation est sup&eacute;rieure &agrave; 0. La valeur par d&eacute;faut est de 10 secondes.</p>
</li>
<li>
<p>Cochez la case Groupement pour activer le groupement des connexions du pool.</p>
<p>Cette option est activ&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>S&eacute;lectionnez la case Association lazy pour que les connexions puissent &ecirc;tre associ&eacute;es en diff&eacute;r&eacute; lorsque vous effectuez une op&eacute;ration sur celles-ci.</p>
<p>Les connexions sont dissoci&eacute;es lorsque la transaction est termin&eacute;e et qu'une m&eacute;thode de composant prend fin, ce qui facilite la r&eacute;utilisation des connexions physiques. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>S&eacute;lectionnez la case Participation des connexions lazy &agrave; la transaction pour engager une ressource dans une transaction uniquement lorsqu'elle est utilis&eacute;e dans une m&eacute;thode.</p>
<p>Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>S&eacute;lectionnez la case Associer &agrave; un thread pour associer une connexion &agrave; un thread.</p>
<p>Lorsque ce dernier n&eacute;cessite une connexion, il peut r&eacute;utiliser celle qui lui est d&eacute;j&agrave; associ&eacute;e, limitant ainsi le temps syst&egrave;me li&eacute; &agrave; l'obtention d'une connexion &agrave; partir du pool. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>S&eacute;lectionnez la case Faire correspondre les connexions pour activer l'association de connexions pour le pool.</p>
<p>D&eacute;sactivez cette option si vous savez que les connexions du pool seront toujours homog&egrave;nes et qu'il est donc inutile pour l'adaptateur de ressources d'associer une connexion emprunt&eacute;e au pool. Cette option est activ&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Dans le champ Utilisation des correspondances de connexions, saisissez le nombre de r&eacute;utilisations possibles d'une connexion par le pool.</p>
<p>Une fois qu'une connexion a &eacute;t&eacute; r&eacute;utilis&eacute;e le nombre de fois sp&eacute;cifi&eacute;, elle est ferm&eacute;e. La valeur 0 indique que cet attribut n'est pas activ&eacute;. La valeur par d&eacute;faut est 0.</p>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>

<hr>
<p><b>Conseil:</b></p>
Pour revenir aux param&egrave;tres par d&eacute;faut, cliquez sur le bouton Charger les valeurs par d&eacute;faut, puis sur Enregistrer.
<hr>

</li>
</ol>
<a id="sthref15" name="sthref15"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-connectorresourcenew.html">Cr&eacute;ation d'une ressource de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorresourceedit.html">Modification d'une ressource de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorresourcesdelete.html">Suppression d'une ressource de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolnew.html">Cr&eacute;ation d'un pool de connexions de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">Modification d'un pool de connexions de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">Modification des propri&eacute;t&eacute;s de pool de connexions de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">Cr&eacute;ation d'une mappe de s&eacute;curit&eacute; pour un pool de connexions de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">Modification d'une mappe de s&eacute;curit&eacute; pour un pool de connexions de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">Suppression d'une mappe de s&eacute;curit&eacute; pour un pool de connexions de connecteur</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">Suppression d'un pool de connexions de connecteur</a></p>
</li>
<li>
<p><a href="task-setupeisaccess.html">Configuration de l'acc&egrave;s au syst&egrave;me EIS</a></p>
</li>
<li>
<p><a href="task-adminobjectnew.html">Cr&eacute;ation d'une ressource d'objet administr&eacute;</a></p>
</li>
<li>
<p><a href="task-adminobjectedit.html">Modification d'une ressource d'objet administr&eacute;</a></p>
</li>
<li>
<p><a href="task-administeredobjectresourcedelete.html">Suppression d'une ressource d'objet administr&eacute;</a></p>
</li>
<li>
<p><a href="task-worksecuritymapnew.html">Cr&eacute;ation d'une mappe de s&eacute;curit&eacute; de travail</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">Modification d'une mappe de s&eacute;curit&eacute; de travail</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">Suppression d'une mappe de s&eacute;curit&eacute; de travail</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
