<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-batchjobsconfiguration" name="ref-batchjobsconfiguration"></a></p>

<h4>Configuration d'ex&eacute;cution de batch</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>GlassFish Server fournit une ex&eacute;cution de batch pour la planification et l'ex&eacute;cution de traitements batch. Les traitements batch sont g&eacute;n&eacute;ralement des t&acirc;ches &agrave; longue dur&eacute;e d'ex&eacute;cution en masse contenant une s&eacute;rie d'&eacute;tapes. Les applications de traitement batch soumettent des travaux &agrave; l'ex&eacute;cution de batch et fournissent des instructions sur la m&eacute;thode et le moment d'ex&eacute;cution des &eacute;tapes. L'ex&eacute;cution de batch traite les &eacute;tapes et stocke les informations relatives aux travaux dans un r&eacute;f&eacute;rentiel de travaux. Dans GlassFish Server, le r&eacute;f&eacute;rentiel de travaux est une base de donn&eacute;es.</p>
<p>Utilisez la page Configuration d'ex&eacute;cution de batch pour visualiser et modifier la configuration de l'ex&eacute;cution de batch. Celle-ci utilise un service ex&eacute;cuteur g&eacute;r&eacute; et une source de donn&eacute;es pour ex&eacute;cuter les traitements batch. Le service ex&eacute;cuteur g&eacute;r&eacute; fournit des threads aux travaux et la source de donn&eacute;es stocke les informations des travaux. Les donn&eacute;es de configuration de l'ex&eacute;cution du batch sont stock&eacute;es dans l'&eacute;l&eacute;ment <code>config</code> du fichier <code>domain.xml</code>.</p>
<p>La page Configuration d'ex&eacute;cution de batch contient les informations ci-apr&egrave;s.</p>
<dl>
<dt>Nom d'instance</dt>
<dt>Nom du cluster</dt>
<dd>
<p>Nom de l'instance de serveur et du cluster GlassFish auquel s'applique la configuration. Ce champ est en lecture seule.</p>
</dd>
<dt>Nom de recherche de service ex&eacute;cuteur</dt>
<dd>
<p>Nom de recherche JNDI du service ex&eacute;cuteur g&eacute;r&eacute; qui fournit des threads aux traitements batch. Le service ex&eacute;cuteur g&eacute;r&eacute; par d&eacute;faut est <code>concurrent/__defaultManagedExecutorService</code>.</p>
<p>Le service ex&eacute;cuteur g&eacute;r&eacute; peut &ecirc;tre modifi&eacute; une fois qu'un traitement batch a &eacute;t&eacute; soumis sur l'ex&eacute;cution de batch sans incidence sur l'ex&eacute;cution du travail.</p>
</dd>
<dt>Nom de recherche de source de donn&eacute;es</dt>
<dd>
<p>Nom de recherche JNDI de la source de donn&eacute;es qui stocke les informations relatives aux traitements batch en cours et pass&eacute;s. La source de donn&eacute;es par d&eacute;faut est <code>jdbc/__TimerPool</code>.</p>
<p>Ne modifiez pas la source de donn&eacute;es une fois le premier traitement batch soumis &agrave; l'ex&eacute;cution de batch pour ex&eacute;cution. Si la source de donn&eacute;es doit &ecirc;tre modifi&eacute;e, arr&ecirc;tez et red&eacute;marrez le domaine, puis appliquez la modification avant le d&eacute;marrage ou le red&eacute;marrage de tout travail. Cependant, une fois que la source de donn&eacute;es a &eacute;t&eacute; modifi&eacute;e, les informations stock&eacute;es dans la source de donn&eacute;es pr&eacute;c&eacute;dente deviennent inaccessibles.</p>
</dd>
</dl>
<a id="sthref31" name="sthref31"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="tasks-topic-group004.html#CEGEEGBB">Configuration de l'ex&eacute;cution de batch</a></p>
</li>
<li>
<p><a href="tasks-topic-group002.html#CEGEIGCJ">Visualisation des ex&eacute;cutions de traitement batch</a></p>
</li>
</ul>
<a id="sthref32" name="sthref32"></a>
<h5>Commandes asadmin connexes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM897"><code>set-batch-runtime-configuration</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM863"><code>list-batch-runtime-configuration</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM861"><code>list-batch-jobs</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM884"><code>list-batch-job-executions</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM895"><code>list-batch-job-steps</code>(1)</a></p>
</li>
</ul>




<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
