<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-javamailsessionsedit" name="task-javamailsessionsedit"></a></p>

<h4><a id="sthref9" name="sthref9"></a>Modification d'une session JavaMail</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Ressources.</p>
</li>
<li>
<p>Sous le noeud Ressources, s&eacute;lectionnez Sessions JavaMail.</p>
<p>La page Sessions JavaMail appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Sessions JavaMail, cliquez sur le nom de la session &agrave; modifier.</p>
<p>La page Modifier une session JavaMail appara&icirc;t.</p>
</li>
<li>
<p>Dans le champ H&ocirc;te de messagerie, sp&eacute;cifiez le nom d'h&ocirc;te du serveur de messagerie par d&eacute;faut.</p>
<p>Les m&eacute;thodes de connexion des objets Store et Transport utilisent cette valeur si aucune propri&eacute;t&eacute; d'h&ocirc;te propre &agrave; un protocole n'est indiqu&eacute;e. Le nom doit pouvoir &ecirc;tre r&eacute;solu en un nom d'h&ocirc;te r&eacute;el.</p>
</li>
<li>
<p>Dans le champ Utilisateur par d&eacute;faut, entrez un autre nom utilisateur &agrave; indiquer lors de la connexion &agrave; un serveur de messagerie.</p>
<p>Les m&eacute;thodes de connexion des objets Store et Transport utilisent cette valeur si aucune propri&eacute;t&eacute; de nom utilisateur propre &agrave; un protocole n'est fournie. Le nom utilisateur ne peut contenir que des caract&egrave;res alphanum&eacute;riques, des traits de soulignement, des tirets ou des points.</p>
</li>
<li>
<p>Dans le champ Adresse de l'exp&eacute;diteur par d&eacute;faut, entrez l'adresse &eacute;lectronique de l'utilisateur par d&eacute;faut.</p>
<p>Le format est <i>nom utilisateur</i><code>@</code><i>h&ocirc;te</i>.<i>domaine</i>.</p>
</li>
<li>
<p>Dans le champ Ordre de d&eacute;ploiement, saisissez un nombre pour indiquer l'ordre de d&eacute;ploiement de la ressource de session JavaMail.</p>
<p>Les ressources avec les plus petits num&eacute;ros sont charg&eacute;s en premier au d&eacute;marrage du serveur. La valeur par d&eacute;faut est 100.</p>
</li>
<li>
<p>Dans le champ Description, modifiez la description de la session de messagerie.</p>
</li>
<li>
<p>Cochez la case Activ&eacute; du champ Statut pour activer la session de messagerie.</p>
<p>La valeur par d&eacute;faut est Activ&eacute;.</p>
</li>
<li>
<p>Dans le champ Protocole de stockage, indiquez la m&eacute;thode de communication des objets Store &agrave; utiliser.</p>
<p>Par d&eacute;faut, le protocole de stockage est <code>imap</code>.</p>
</li>
<li>
<p>Dans le champ Classe de protocole de stockage, sp&eacute;cifiez la classe de la m&eacute;thode de communication de stockage impl&eacute;mentant le protocole de stockage requis.</p>
<p>Par d&eacute;faut, la classe de protocole de stockage est <code>com.sun.mail.imap.IMAPStore</code>.</p>
</li>
<li>
<p>Dans le champ Protocole de transport, sp&eacute;cifiez la m&eacute;thode de communication de transport.</p>
<p>Par d&eacute;faut, le protocole de transport est <code>smtp</code>.</p>
</li>
<li>
<p>Dans le champ Classe de protocole de transport, sp&eacute;cifiez la m&eacute;thode de communication de la classe de transport.</p>
<p>Par d&eacute;faut, la classe de protocole de transport est <code>com.sun.mail.smtp.SMTPTransport</code> .</p>
</li>
<li>
<p>Cochez la case D&eacute;boguer pour activer une sortie de d&eacute;bogage suppl&eacute;mentaire, notamment une trace de protocole, pour cette session de messagerie.</p>
<p>Si le niveau de journalisation JavaMail a la valeur <code>FINE</code> ou une valeur plus fine, la sortie de d&eacute;bogage est cr&eacute;&eacute;e et incluse dans le fichier journal du syst&egrave;me. Pour plus d'informations sur la d&eacute;finition du niveau de journalisation, reportez-vous &agrave; <a href="../../../common/en/help/task-eelogginglevels.html">Configuration des niveaux de journalisation</a>.</p>
</li>
<li>
<p>Dans la table Autres propri&eacute;t&eacute;s, sp&eacute;cifiez les propri&eacute;t&eacute;s suppl&eacute;mentaires requises par les applications, notamment une propri&eacute;t&eacute; d'h&ocirc;te ou de nom utilisateur propre &agrave; un protocole.</p>
<p>Pour obtenir la liste des propri&eacute;t&eacute;s disponibles, reportez-vous &agrave; la documentation de l'API JavaMail (<code><a href="http://java.sun.com/products/javamail/javadocs/index.html">http://java.sun.com/products/javamail/javadocs/index.html</a></code>). Les propri&eacute;t&eacute;s suppl&eacute;mentaires doivent commencer par <code>mail-</code> et des traits d'union doivent &ecirc;tre utilis&eacute;s comme s&eacute;parateurs &agrave; la place des points. Par exemple, <code>mail-debug</code> est correct mais <code>mail.debug</code> ne l'est pas. Le back-end GlassFish Server convertit les traits d'union en points, attendus par l'API JavaMail.</p>
<ul>
<li>
<p>Pour ajouter une propri&eacute;t&eacute;, cliquez sur le bouton Ajouter une propri&eacute;t&eacute;. Sur la ligne vide qui appara&icirc;t, saisissez le nom de la propri&eacute;t&eacute; dans le champ Nom et la valeur de la propri&eacute;t&eacute; dans le champ Valeur.</p>
</li>
<li>
<p>Pour modifier une propri&eacute;t&eacute;, modifiez le champ Valeur de cette propri&eacute;t&eacute;.</p>
</li>
<li>
<p>Pour supprimer une propri&eacute;t&eacute;, s&eacute;lectionnez la case situ&eacute;e &agrave; gauche du champ Nom de la propri&eacute;t&eacute; &agrave; supprimer, puis cliquez sur le bouton Supprimer des propri&eacute;t&eacute;s.</p>
</li>
</ul>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>

<hr>
<p><b>Conseil:</b></p>
Pour revenir aux param&egrave;tres par d&eacute;faut, cliquez sur le bouton Charger les valeurs par d&eacute;faut, puis sur Enregistrer.
<hr>

</li>
</ol>
<a id="GHJML104" name="GHJML104"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-javamailsessioncreate.html">Cr&eacute;ation d'une session JavaMail</a></p>
</li>
<li>
<p><a href="task-javamailsessionsdelete.html">Suppression d'une session JavaMail</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
