<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-javamailsessioncreate" name="task-javamailsessioncreate"></a></p>

<h4><a id="sthref8" name="sthref8"></a>Cr&eacute;ation d'une session JavaMail</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Ressources.</p>
</li>
<li>
<p>Sous le noeud Ressources, s&eacute;lectionnez Sessions JavaMail.</p>
<p>La page Sessions JavaMail appara&icirc;t.</p>
</li>
<li>
<p>Dans la table Sessions, cliquez sur Nouveau.</p>
<p>La page Nouvelle session JavaMail appara&icirc;t.</p>
</li>
<li>
<p>Dans le champ Nom JNDI, attribuez un nom unique &agrave; la ressource de session de messagerie.</p>
<p>Utilisez le pr&eacute;fixe de d&eacute;nomination de sous-contexte <code>mail/</code> pour les ressources JavaMail. Par exemple : <code>mail/MySession</code>. Le nom ne peut contenir que des caract&egrave;res alphanum&eacute;riques, des traits de soulignement, des tirets ou des points.</p>
</li>
<li>
<p>Dans le champ H&ocirc;te de messagerie, entrez le nom d'h&ocirc;te du serveur de messagerie par d&eacute;faut.</p>
<p>Les m&eacute;thodes de connexion des objets Store et Transport utilisent cette valeur si aucune propri&eacute;t&eacute; d'h&ocirc;te propre &agrave; un protocole n'est indiqu&eacute;e. Le nom doit pouvoir &ecirc;tre r&eacute;solu en un nom d'h&ocirc;te r&eacute;el.</p>
</li>
<li>
<p>Dans le champ Utilisateur par d&eacute;faut, entrez le nom utilisateur &agrave; indiquer lors de la connexion &agrave; un serveur de messagerie.</p>
<p>Les m&eacute;thodes de connexion des objets Store et Transport utilisent cette valeur si aucune propri&eacute;t&eacute; de nom utilisateur propre &agrave; un protocole n'est fournie. Le nom utilisateur ne peut contenir que des caract&egrave;res alphanum&eacute;riques, des traits de soulignement, des tirets ou des points.</p>
</li>
<li>
<p>Dans le champ Adresse de l'exp&eacute;diteur par d&eacute;faut, entrez l'adresse &eacute;lectronique de l'utilisateur par d&eacute;faut.</p>
<p>Le format est <i>nom utilisateur</i><code>@</code><i>h&ocirc;te</i>.<i>domaine</i>.</p>
</li>
<li>
<p>Dans le champ Description, entrez la description de la session de messagerie.</p>
</li>
<li>
<p>Cochez la case Activ&eacute; du champ Statut pour activer la session de messagerie.</p>
<p>La valeur par d&eacute;faut est Activ&eacute;.</p>
</li>
<li>
<p>Dans le champ Protocole de stockage, indiquez le service de protocole de stockage &agrave; utiliser.</p>
<p>Le service de protocole de stockage se connecte &agrave; un serveur de messagerie, extrait les messages puis les enregistre dans des dossiers. Les valeurs autoris&eacute;es sont les suivantes : <code>imap</code>, <code>pop3</code>, <code>imaps</code> et <code>pop3s</code>. La valeur par d&eacute;faut est <code>imap</code>.</p>
</li>
<li>
<p>Dans le champ Classe de protocole de stockage, sp&eacute;cifiez la classe d'impl&eacute;mentation du fournisseur de services de stockage.</p>
<p>Les valeurs autoris&eacute;es sont les suivantes :</p>
<ul>
<li>
<p><code>com.sun.mail.imap.IMAPStore</code></p>
</li>
<li>
<p><code>com.sun.mail.pop3.POP3Store</code></p>
</li>
<li>
<p><code>com.sun.mail.imap.IMAPSSLStore</code></p>
</li>
<li>
<p><code>com.sun.mail.pop3.POP3SSLStore</code></p>
</li>
</ul>
<p>La valeur par d&eacute;faut est <code>com.sun.mail.imap.IMAPStore</code>.</p>
</li>
<li>
<p>Dans le champ Protocole de transport, sp&eacute;cifiez la m&eacute;thode de communication de transport.</p>
<p>Le service de protocole de transport envoie les messages. Les valeurs autoris&eacute;es sont les suivantes : <code>smtp</code> et <code>smtps</code>. Par d&eacute;faut, le protocole de transport est <code>smtp</code>.</p>
</li>
<li>
<p>Dans le champ Classe de protocole de transport, sp&eacute;cifiez la classe d'impl&eacute;mentation du fournisseur de services de transport.</p>
<p>La valeur par d&eacute;faut est <code>com.sun.mail.smtp.SMTPTransport</code>.</p>
</li>
<li>
<p>Cochez la case D&eacute;boguer pour activer une sortie de d&eacute;bogage suppl&eacute;mentaire, notamment une trace de protocole, pour cette session de messagerie.</p>
<p>Si le niveau de journalisation JavaMail a la valeur <code>FINE</code> ou une valeur plus fine, la sortie de d&eacute;bogage est cr&eacute;&eacute;e et incluse dans le fichier journal du syst&egrave;me. Pour plus d'informations sur la d&eacute;finition du niveau de journalisation, reportez-vous &agrave; <a href="../../../common/en/help/task-eelogginglevels.html">Configuration des niveaux de journalisation</a>. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Dans la table Autres propri&eacute;t&eacute;s, sp&eacute;cifiez les propri&eacute;t&eacute;s suppl&eacute;mentaires requises par les applications, notamment une propri&eacute;t&eacute; d'h&ocirc;te ou de nom utilisateur propre &agrave; un protocole.</p>
<p>Pour obtenir la liste des propri&eacute;t&eacute;s disponibles, reportez-vous &agrave; la documentation de l'API JavaMail (<code><a href="http://java.sun.com/products/javamail/javadocs/index.html">http://java.sun.com/products/javamail/javadocs/index.html</a></code>). Les propri&eacute;t&eacute;s suppl&eacute;mentaires doivent commencer par <code>mail-</code> et des traits d'union doivent &ecirc;tre utilis&eacute;s comme s&eacute;parateurs &agrave; la place des points. Par exemple, <code>mail-debug</code> est correct mais <code>mail.debug</code> ne l'est pas. Le back-end GlassFish Server convertit les traits d'union en points, attendus par l'API JavaMail.</p>
<p>Pour ajouter une propri&eacute;t&eacute;, cliquez sur le bouton Ajouter une propri&eacute;t&eacute;. Sur la ligne vide qui appara&icirc;t, saisissez le nom de la propri&eacute;t&eacute; dans le champ Nom et la valeur de la propri&eacute;t&eacute; dans le champ Valeur.</p>
</li>
<li>
<p>Dans la liste des cibles disponibles, s&eacute;lectionnez les cibles souhait&eacute;es pour la configuration de la session de messagerie, puis cliquez sur Ajouter.</p>
<p>Les cibles peuvent &ecirc;tre des clusters ou des instances de serveur autonomes. Si vous ne s&eacute;lectionnez aucune cible, la session est configur&eacute;e en fonction de l'instance de serveur par d&eacute;faut, <code>server</code>.</p>
</li>
<li>
<p>Cliquez sur OK.</p>
</li>
</ol>
<a id="GHJML103" name="GHJML103"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-javamailsessionsedit.html">Modification d'une session JavaMail</a></p>
</li>
<li>
<p><a href="task-javamailsessionsdelete.html">Suppression d'une session JavaMail</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
