<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jndiexternalresourcecreate" name="task-jndiexternalresourcecreate"></a><a id="GHJML00018" name="GHJML00018"></a></p>

<h4><a id="sthref14" name="sthref14"></a><a id="sthref15" name="sthref15"></a>Cr&eacute;ation d'une ressource JNDI externe</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Une ressource JNDI externe acc&egrave;de &agrave; un r&eacute;f&eacute;rentiel JNDI externe, tel qu'un serveur LDAP.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Ressources.</p>
</li>
<li>
<p>Sous le noeud Ressources, d&eacute;veloppez le noeud JNDI.</p>
</li>
<li>
<p>Sous le noeud JNDI, s&eacute;lectionnez Ressources externes.</p>
<p>La page Ressources externes appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Ressources externes, cliquez sur Nouveau.</p>
<p>La page Nouvelle ressource externe appara&icirc;t.</p>
</li>
<li>
<p>Dans le champ Nom JNDI, entrez un nom unique.</p>
<p>Il sera inscrit aupr&egrave;s du service de d&eacute;nomination JNDI. Le nom JNDI organise et localise les composants dans un environnement informatique distribu&eacute; de la m&ecirc;me mani&egrave;re que des catalogues sur fiches organisent et repr&eacute;sentent des emplacements de livres dans une biblioth&egrave;que. Par cons&eacute;quent, le nom JNDI est une m&eacute;thode importante d'acc&egrave;s &agrave; la ressource</p>
</li>
<li>
<p>Dans le champ Type de ressource, effectuez l'une des op&eacute;rations ci-apr&egrave;s.</p>
<ul>
<li>
<p>S&eacute;lectionnez une d&eacute;finition de type dans la liste d&eacute;roulante.</p>
</li>
<li>
<p>S&eacute;lectionnez le deuxi&egrave;me bouton radio et entrez une d&eacute;finition de type qualifi&eacute;e compl&egrave;te au format suivant : <i>xxx</i><code>.</code><i>xxx</i>.</p>
</li>
</ul>
</li>
<li>
<p>Dans le champ Classe de fabrique, entrez un nom de r&eacute;f&eacute;rentiel externe de classe de fabrique JNDI pour la ressource externe &agrave; cr&eacute;er.</p>
<p>La classe de fabrique correspond au nom sp&eacute;cifi&eacute; par l'utilisateur pour la classe de fabrique, tel que <code>com.sun.jndi.ldap</code>. Cette classe impl&eacute;mente l'interface <code>javax.naming.spi.InitialContextFactory</code>.</p>
</li>
<li>
<p>Dans le champ Recherche JNDI, entrez la valeur JNDI &agrave; rechercher dans le r&eacute;f&eacute;rentiel externe.</p>
<p>Par exemple, si vous cr&eacute;ez une ressource externe pour vous connecter &agrave; un r&eacute;f&eacute;rentiel externe, pour tester une classe de bean, la recherche JNDI peut prendre la forme suivante : <code>cn=</code><i>testbean</i>.</p>
</li>
<li>
<p>Dans le champ Description, entrez une br&egrave;ve description de la ressource.</p>
<p>Cette description doit se pr&eacute;senter sous la forme d'une cha&icirc;ne pouvant inclure un maximum de 250 caract&egrave;res.</p>
</li>
<li>
<p>Cochez la case Activ&eacute; du champ Statut pour activer la ressource.</p>
<p>Par d&eacute;faut, la ressource est activ&eacute;e, ce qui signifie qu'elle est disponible d&egrave;s sa cr&eacute;ation.</p>
</li>
<li>
<p>Dans la section Autres propri&eacute;t&eacute;s, sp&eacute;cifiez les propri&eacute;t&eacute;s suppl&eacute;mentaires de la ressource externe.</p>
<p>GlassFish Server ne d&eacute;finit aucune autre propri&eacute;t&eacute; pour les ressources externes.</p>
<p>Pour ajouter une propri&eacute;t&eacute;, cliquez sur le bouton Ajouter une propri&eacute;t&eacute;. Sur la ligne vide qui appara&icirc;t, saisissez le nom de la propri&eacute;t&eacute; dans le champ Nom et la valeur de la propri&eacute;t&eacute; dans le champ Valeur.</p>
</li>
<li>
<p>Cliquez sur OK.</p>
</li>
</ol>
<a id="GHJML111" name="GHJML111"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-jndicustomresourcenew.html">Cr&eacute;ation d'une ressource JNDI personnalis&eacute;e</a></p>
</li>
<li>
<p><a href="task-jndicustomresourceedit.html">Modification d'une ressource JNDI personnalis&eacute;e</a></p>
</li>
<li>
<p><a href="task-jndicustomresourcedelete.html">Suppression d'une ressource JNDI personnalis&eacute;e</a></p>
</li>
<li>
<p><a href="task-jndiexternalresourceedit.html">Modification d'une ressource JNDI externe</a></p>
</li>
<li>
<p><a href="task-jndiexternalresourcedelete.html">Suppression d'une ressource JNDI externe</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
