<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-ejbgeneral" name="ref-ejbgeneral"></a><a id="GHEJL00001" name="GHEJL00001"></a></p>

<h4><a id="sthref5" name="sthref5"></a><a id="sthref6" name="sthref6"></a>Enterprise Java Beans (EJB)</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&#12300;&#20225;&#26989; Java Bean (EJB)&#12301;&#38913;&#38754;&#21487;&#32068;&#24907; EJB &#23481;&#22120;&#30340;&#35373;&#23450;&#12290;</p>
<p>&#38500;&#20102;&#20225;&#26989; Bean &#30340;&#19968;&#33324;&#35373;&#23450;&#20043;&#22806;&#65292;&#24744;&#20063;&#21487;&#20197;&#32068;&#24907;&#38598;&#21312;&#35373;&#23450;&#21644;&#24555;&#21462;&#35373;&#23450;&#12290;</p>
<ul>
<li>
<p>&#38598;&#21312;&#35373;&#23450;&#20677;&#36969;&#29992;&#26044;&#28961;&#29376;&#24907;&#30340;&#38542;&#27573;&#20316;&#26989; Bean&#12290;&#20381;&#38928;&#35373;&#65292;&#23481;&#22120;&#26371;&#20445;&#30041;&#20225;&#26989; Bean &#38598;&#21312;&#65292;&#20197;&#22238;&#25033;&#24478;&#23660;&#31471;&#35531;&#27714;&#65292;&#20006;&#36991;&#20813;&#24314;&#31435; Bean &#25152;&#36896;&#25104;&#30340;&#25928;&#33021;&#24433;&#38911;&#12290;</p>
<p>&#22914;&#26524;&#20351;&#29992;&#24050;&#24314;&#32622;&#20043;&#20225;&#26989; Bean &#30340;&#25033;&#29992;&#31243;&#24335;&#30332;&#29983;&#25928;&#33021;&#21839;&#38988;&#65292;&#24744;&#21487;&#20197;&#24314;&#31435;&#38598;&#21312;&#25110;&#22686;&#21152;&#29694;&#26377;&#38598;&#21312;&#20013;&#20445;&#30041;&#30340; Bean &#25976;&#30446;&#65292;&#24171;&#21161;&#25913;&#21892;&#25033;&#29992;&#31243;&#24335;&#25928;&#33021;&#12290;</p>
</li>
<li>
<p>&#24555;&#21462;&#35373;&#23450;&#20677;&#36969;&#29992;&#26044;&#26377;&#29376;&#24907;&#30340;&#38542;&#27573;&#20316;&#26989; Bean&#12290;&#23481;&#22120;&#26371;&#28858;&#26368;&#24120;&#20351;&#29992;&#30340;&#20225;&#26989; Bean &#20445;&#30041;&#20225;&#26989; Bean &#36039;&#26009;&#24555;&#21462;&#12290;&#36889;&#21487;&#20197;&#35731;&#23481;&#22120;&#26356;&#24555;&#36895;&#22320;&#22238;&#25033;&#20854;&#20182;&#25033;&#29992;&#31243;&#24335;&#27169;&#32068;&#23565;&#20225;&#26989; Bean &#36039;&#26009;&#30340;&#35531;&#27714;&#12290;</p>
<p>&#24555;&#21462;&#30340;&#20225;&#26989; Bean &#29376;&#24907;&#21253;&#25324;&#20197;&#19979;&#19977;&#31278;&#65306;&#20351;&#29992;&#20013;&#12289;&#38290;&#32622;&#21644;&#24050;&#37389;&#21270;&#12290;&#20351;&#29992;&#20013;&#65306;&#24478;&#23660;&#31471;&#30446;&#21069;&#27491;&#22312;&#23384;&#21462;&#20225;&#26989; Bean&#12290;&#38290;&#32622;&#20225;&#26989; Bean &#30340;&#36039;&#26009;&#30446;&#21069;&#20301;&#26044;&#24555;&#21462;&#20013;&#65292;&#20294;&#27794;&#26377;&#24478;&#23660;&#31471;&#27491;&#22312;&#23384;&#21462; Bean&#12290;&#37389;&#21270; Bean &#30340;&#36039;&#26009;&#26159;&#26283;&#26178;&#20786;&#23384;&#30340;&#65292;&#19988;&#26371;&#22312;&#24478;&#23660;&#31471;&#35531;&#27714; Bean &#26178;&#23559;&#36039;&#26009;&#35712;&#22238;&#24555;&#21462;&#12290;</p>
</li>
</ul>
<p>&#12300;&#20225;&#26989; Java Bean (EJB)&#12301;&#38913;&#38754;&#21253;&#21547;&#19979;&#21015;&#36984;&#38917;&#12290;</p>
<dl>
<dt>&#36617;&#20837;&#38928;&#35373;&#20540;</dt>
<dd>
<p>&#29992;&#26044;&#23559;&#20855;&#26377;&#38928;&#35373;&#20540;&#30340;&#35373;&#23450;&#24489;&#21407;&#28858;&#35373;&#23450;&#20540;&#30340;&#25353;&#37397;&#12290;&#27794;&#26377;&#38928;&#35373;&#20540;&#30340;&#35373;&#23450;&#21063;&#20445;&#25345;&#19981;&#35722;&#12290;</p>
</dd>
<dt>&#32068;&#24907;&#21517;&#31281;</dt>
<dd>
<p>&#22871;&#29992;&#27492;&#38913;&#38754;&#19978;&#20043;&#35373;&#23450;&#30340;&#32068;&#24907;&#21517;&#31281;&#12290;&#26412;&#27396;&#20301;&#26159;&#21807;&#35712;&#30340;&#12290;</p>
</dd>
<dt>&#38542;&#27573;&#20316;&#26989;&#20786;&#23384;&#20301;&#32622;</dt>
<dd>
<p>&#24050;&#37389;&#21270;&#20043;&#26377;&#29376;&#24907;&#30340;&#38542;&#27573;&#20316;&#26989; Bean &#21644;&#25345;&#32396;&#30340; HTTP &#38542;&#27573;&#20316;&#26989;&#22312;&#27284;&#26696;&#31995;&#32113;&#19978;&#30340;&#20786;&#23384;&#30446;&#37636;&#12290;&#38928;&#35373;&#20540;&#28858; <code>${com.sun.aas.instanceRoot}/session-store</code>&#12290;</p>
<p>&#37389;&#21270; Bean &#26159;&#24050;&#23559;&#20854;&#29376;&#24907;&#23531;&#20837;&#21040;&#27284;&#26696;&#31995;&#32113;&#19978;&#30340;&#27284;&#26696;&#20013;&#30340;&#26377;&#29376;&#24907;&#30340;&#38542;&#27573;&#20316;&#26989; Bean&#12290;&#36890;&#24120;&#65292;&#37389;&#21270;&#30340; Bean &#24050;&#32147;&#38290;&#32622;&#20102;&#19968;&#27573;&#26178;&#38291;&#20006;&#19988;&#30446;&#21069;&#26410;&#34987;&#24478;&#23660;&#31471;&#23384;&#21462;&#12290;&#39006;&#20284;&#22320;&#65292;&#25345;&#32396;&#30340; HTTP &#38542;&#27573;&#20316;&#26989;&#26159;&#20854;&#29376;&#24907;&#24050;&#23531;&#20837;&#27284;&#26696;&#31995;&#32113;&#19978;&#30340;&#27284;&#26696;&#20013;&#30340;&#21508;&#20491; Web &#38542;&#27573;&#20316;&#26989;&#12290;</p>
</dd>
<dt>&#30906;&#35469;&#36984;&#38917;</dt>
<dd>
<p>&#25351;&#23450;&#23481;&#22120;&#22914;&#20309;&#24555;&#21462;&#20316;&#26989;&#20107;&#20214;&#20043;&#38291;&#37389;&#21270;&#30340; Bean &#22519;&#34892;&#34389;&#29702;&#12290;&#22914;&#26524;&#24744;&#36984;&#21462;&#36984;&#38917; B (&#38928;&#35373;&#20540;)&#65292;&#23481;&#22120;&#26371;&#24555;&#21462;&#20316;&#26989;&#20107;&#20214;&#20043;&#38291;&#23601;&#32210;&#30340;&#22519;&#34892;&#34389;&#29702;&#12290;&#22914;&#26524;&#24744;&#36984;&#21462;&#36984;&#38917; C&#65292;&#23481;&#22120;&#19981;&#26371;&#24555;&#21462;&#20316;&#26989;&#20107;&#20214;&#20043;&#38291;&#23601;&#32210;&#30340;&#22519;&#34892;&#34389;&#29702;&#12290;</p>
</dd>
<dt>&#38598;&#21312;&#30340;&#21021;&#22987;&#22823;&#23567;&#21644;&#26368;&#23567;&#22823;&#23567;</dt>
<dd>
<p>&#20445;&#30041;&#22312;&#38598;&#21312;&#20013;&#30340;&#26368;&#23567; Bean &#25976;&#30446;&#12290;&#38928;&#35373;&#20540;&#28858; 0&#12290;</p>
</dd>
<dt>&#38598;&#21312;&#30340;&#26368;&#22823;&#22823;&#23567;</dt>
<dd>
<p>&#23481;&#22120;&#19968;&#27425;&#21487;&#20445;&#30041;&#22312;&#38598;&#21312;&#20013;&#30340;&#26368;&#22823; Bean &#25976;&#30446;&#12290;&#38928;&#35373;&#20540;&#28858; 32&#12290;</p>
</dd>
<dt>&#38598;&#21312;&#35373;&#23450;&#22823;&#23567;&#25976;&#37327;</dt>
<dd>
<p>&#38290;&#32622;&#26178;&#38291;&#36229;&#36942;&#12300;&#38598;&#21312;&#38290;&#32622;&#36926;&#26178;&#12301;&#27396;&#20301;&#20013;&#25351;&#23450;&#30340;&#26178;&#38291;&#26178;&#65292;&#35201;&#24478;&#38598;&#21312;&#20013;&#31227;&#38500;&#30340; Bean &#25976;&#30446;&#12290;&#27492;&#20540;&#24517;&#38920;&#33267;&#23569;&#28858; 0 &#19988;&#23567;&#26044;&#12300;&#38598;&#21312;&#30340;&#26368;&#22823;&#22823;&#23567;&#12301;&#20540;&#12290;&#38928;&#35373;&#20540;&#28858; 8&#12290;</p>
</dd>
<dt>&#38598;&#21312;&#38290;&#32622;&#36926;&#26178;</dt>
<dd>
<p>Bean &#21487;&#22312;&#38598;&#21312;&#20013;&#32173;&#25345;&#38290;&#32622;&#32780;&#19981;&#21152;&#20197;&#21034;&#38500;&#30340;&#26178;&#38291; (&#20197;&#31186;&#28858;&#21934;&#20301;)&#12290;&#36229;&#36942;&#36889;&#27573;&#26178;&#38291;&#24460;&#65292;&#23559;&#26371;&#37559;&#27584; Bean&#12290;0 &#20540;&#34920;&#31034; Bean &#21487;&#20197;&#28961;&#38480;&#26399;&#20445;&#25345;&#38290;&#32622;&#12290;&#38928;&#35373;&#20540;&#28858; 600&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#24555;&#21462;&#22823;&#23567;</dt>
<dd>
<p>&#24555;&#21462;&#21487;&#23481;&#32013;&#30340;&#26368;&#22823; Bean &#25976;&#30446;&#12290;&#22686;&#21152;&#35201;&#24555;&#21462;&#30340;&#26368;&#22823; Bean &#25976;&#30446;&#65292;&#20197;&#30465;&#19979;&#24314;&#31435;&#21644;&#37559;&#27584; Bean &#25152;&#38656;&#30340;&#32147;&#24120;&#24615;&#32791;&#29992;&#26178;&#38291;&#12290;&#20294;&#26159;&#65292;&#22914;&#26524;&#22686;&#21152;&#24555;&#21462;&#35352;&#25014;&#39636;&#65292;&#20282;&#26381;&#22120;&#23559;&#28040;&#32791;&#26356;&#22810;&#35352;&#25014;&#39636;&#21644;&#36039;&#28304;&#12290;&#35531;&#30906;&#23450;&#24744;&#30340;&#20316;&#26989;&#29872;&#22659;&#36275;&#22816;&#29992;&#26044;&#24555;&#21462;&#35352;&#25014;&#39636;&#35373;&#23450;&#12290;0 &#20540;&#34920;&#31034;&#24555;&#21462;&#28961;&#38480;&#21046;&#12290;&#38928;&#35373;&#20540;&#28858; 512&#12290;</p>
</dd>
<dt>&#24555;&#21462;&#35373;&#23450;&#22823;&#23567;&#25976;&#37327;</dt>
<dd>
<p>&#24555;&#21462;&#24050;&#28415;&#26178;&#35201;&#37389;&#21270;&#30340; Bean &#25976;&#30446;&#12290;&#24555;&#21462;&#30340; Bean &#36948;&#21040;&#26368;&#22823;&#25976;&#30446;&#20043;&#24460;&#65292;&#23481;&#22120;&#23559;&#24478;&#20633;&#20221;&#20786;&#23384;&#20013;&#31227;&#38500;&#19968;&#20123;&#37389;&#21270; Bean&#12290;&#27492;&#20540;&#20063;&#26371;&#25351;&#23450;&#22914;&#26524;&#22312;&#38598;&#21312;&#20013;&#27794;&#26377;&#21487;&#29992;&#30340; Bean &#26178;&#25509;&#21040;&#35531;&#27714;&#65292;&#25152;&#35201;&#24314;&#31435;&#30340; Bean &#25976;&#30446;&#12290;&#27492;&#20540;&#24517;&#38920;&#22823;&#26044; 1 &#19988;&#23567;&#26044;&#12300;&#26368;&#22823;&#24555;&#21462;&#22823;&#23567;&#12301;&#20540;&#12290;&#38928;&#35373;&#20540;&#28858; 32&#12290;</p>
</dd>
<dt>&#31227;&#38500;&#36926;&#26178;</dt>
<dd>
<p>&#23559;&#37389;&#21270;&#30340; Bean &#24478;&#38542;&#27573;&#20316;&#26989;&#20786;&#23384;&#20013;&#31227;&#38500;&#21069;&#31561;&#24453;&#30340;&#31186;&#25976;&#12290;0 &#20540;&#34920;&#31034;&#23481;&#22120;&#19981;&#26371;&#33258;&#21205;&#31227;&#38500;&#38750;&#20351;&#29992;&#20013;&#30340; Bean&#12290;&#22914;&#26524;&#12300;&#31227;&#38500;&#36926;&#26178;&#12301;&#20540;&#23567;&#26044;&#25110;&#31561;&#26044;&#12300;&#24555;&#21462;&#38290;&#32622;&#36926;&#26178;&#12301;&#20540;&#65292;&#26371;&#31435;&#21363;&#31227;&#38500; Bean&#65292;&#32780;&#19981;&#21152;&#20197;&#37389;&#21270;&#12290;&#38928;&#35373;&#20540;&#28858; 5400&#12290;</p>
</dd>
<dt>&#31227;&#38500;&#36984;&#21462;&#31574;&#30053;</dt>
<dd>
<p>&#23481;&#22120;&#29992;&#20197;&#24478;&#24555;&#21462;&#20013;&#31227;&#38500;&#26377;&#29376;&#24907;&#20043;&#38542;&#27573;&#20316;&#26989; Bean &#30340;&#31574;&#30053;&#12290;&#36984;&#38917;&#22914;&#19979;&#65306;</p>
<dl>
<dt>&#26368;&#36817;&#26410;&#20351;&#29992; (NRU)</dt>
<dd>
<p>&#31227;&#38500;&#26368;&#36817;&#27794;&#26377;&#20351;&#29992;&#36942;&#30340; Bean&#12290;&#27492;&#28858;&#38928;&#35373;&#20540;&#12290;</p>
</dd>
<dt>&#20808;&#20837;&#20808;&#20986; (FIFO)</dt>
<dd>
<p>&#31227;&#38500;&#24555;&#21462;&#20013;&#26368;&#33290;&#30340; Bean&#12290;</p>
</dd>
<dt>&#26368;&#36817;&#26368;&#23569;&#20351;&#29992; (LRU)</dt>
<dd>
<p>&#31227;&#38500;&#26368;&#36817;&#26368;&#23569;&#23384;&#21462;&#30340; Bean&#12290;</p>
</dd>
</dl>
</dd>
<dt>&#24555;&#21462;&#38290;&#32622;&#36926;&#26178;</dt>
<dd>
<p>Bean &#21487;&#22312;&#24555;&#21462;&#20013;&#32173;&#25345;&#38290;&#32622;&#30340;&#26368;&#22823;&#31186;&#25976;&#12290;&#36229;&#36942;&#36889;&#27573;&#26178;&#38291;&#24460;&#65292;&#23481;&#22120;&#21487;&#20197;&#37389;&#21270;&#27492; Bean&#12290;0 &#20540;&#34920;&#31034; Bean &#27704;&#36960;&#19981;&#26371;&#25104;&#28858;&#37389;&#21270;&#20505;&#36984;&#38917;&#30446;&#12290;&#38928;&#35373;&#20540;&#28858; 600&#12290;</p>
</dd>
<dt>&#20854;&#20182;&#29305;&#24615;</dt>
<dd>
<p>EJB &#23481;&#22120;&#30340;&#20854;&#20182;&#29305;&#24615;&#12290;</p>
<p>&#22914;&#38656;&#21487;&#29992;&#29305;&#24615;&#30340;&#25551;&#36848;&#65292;&#35531;&#21443;&#38321;<a href="ref-ejbgeneralproperties.html">EJB &#23481;&#22120;&#29305;&#26377;&#30340;&#29305;&#24615;</a>&#12290;</p>
</dd>
</dl>
<a id="sthref7" name="sthref7"></a>
<h5>&#30456;&#38364;&#20316;&#26989;</h5>
<ul>
<li>
<p><a href="task-ejbgeneral.html">&#32068;&#24907; EJB &#35373;&#23450;</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbmdbpoolsettings.html">&#32068;&#24907; MDB &#38598;&#21312;&#35373;&#23450;</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbtimerservice.html">&#32068;&#24907; EJB &#35336;&#26178;&#22120;&#26381;&#21209;</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbcontaineravailability.html">&#32068;&#24907; EJB &#23481;&#22120;&#30340;&#21487;&#29992;&#24615;&#35373;&#23450;</a></p>
</li>
</ul>
<a id="sthref8" name="sthref8"></a>
<h5>&#30456;&#38364;&#30340; asadmin &#21629;&#20196;</h5>
<p>&#28961;&#12290;</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
