<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-ejbgeneral" name="task-ejbgeneral"></a></p>

<h4><a id="sthref2" name="sthref2"></a><a id="sthref3" name="sthref3"></a>&#32068;&#24907; EJB &#35373;&#23450;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#28687;&#35261;&#27193;&#29376;&#32080;&#27083;&#20013;&#65292;&#36984;&#21462;&#12300;&#32068;&#24907;&#12301;&#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;EJB &#23481;&#22120;&#12301;&#31680;&#40670;&#12290;</p>
<p>&#12300;Enterprise JavaBeans (EJB)&#12301;&#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#38542;&#27573;&#20316;&#26989;&#20786;&#23384;&#20301;&#32622;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#38542;&#27573;&#20316;&#26989;&#20786;&#23384;&#20301;&#32622;&#30340;&#26032;&#20540;&#12290;</p>
<p>&#27492;&#27396;&#20301;&#21487;&#25351;&#23450;&#22312;&#27284;&#26696;&#31995;&#32113;&#19978;&#20786;&#23384;&#24050;&#37389;&#21270;&#20043;&#26377;&#29376;&#24907;&#30340;&#38542;&#27573;&#20316;&#26989; Bean &#21644;&#25345;&#32396;&#30340; SFSB &#27298;&#26597;&#40670;&#29376;&#24907;&#30340;&#30446;&#37636;&#12290;&#38928;&#35373;&#20540;&#28858; <code>${com.sun.aas.instanceRoot}/session-store</code>&#12290;</p>
<p>&#37389;&#21270; Bean &#26159;&#24050;&#23559;&#20854;&#29376;&#24907;&#23531;&#20837;&#21040;&#27284;&#26696;&#31995;&#32113;&#19978;&#30340;&#27284;&#26696;&#20013;&#30340;&#26377;&#29376;&#24907;&#30340;&#38542;&#27573;&#20316;&#26989; Bean&#12290;&#36890;&#24120;&#65292;&#37389;&#21270;&#30340; Bean &#24050;&#32147;&#38290;&#32622;&#20102;&#19968;&#27573;&#26178;&#38291;&#20006;&#19988;&#30446;&#21069;&#26410;&#34987;&#24478;&#23660;&#31471;&#23384;&#21462;&#12290;&#21516;&#27171;&#22320;&#65292;&#25345;&#32396;&#30340; SFSB &#27298;&#26597;&#40670;&#29376;&#24907;&#26159;&#23559;&#20854;&#29376;&#24907;&#23531;&#20837;&#27284;&#26696;&#31995;&#32113;&#20013;&#26576;&#20491;&#27284;&#26696;&#30340;&#21508;&#20491; SFSB&#12290;</p>
<p>&#21482;&#26377;&#22312;&#20572;&#29992; EJB &#23481;&#22120;&#21487;&#29992;&#24615;&#26178;&#65292;&#27492;&#35373;&#23450;&#25165;&#36969;&#29992;&#26044; SFSB &#27298;&#26597;&#40670;&#29376;&#24907;&#12290;&#33509;&#35201;&#20572;&#29992;&#21487;&#29992;&#24615;&#65292;&#35531;&#21443;&#38321; <a href="../../../ejb/en/help/task-ejbcontaineravailability.html">To Configure Availability Settings for the EJB Container</a>&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#36984;&#38917; B &#25110;&#36984;&#38917; C &#21934;&#36984;&#25353;&#37397;&#21487;&#35373;&#23450;&#12300;&#30906;&#35469;&#36984;&#38917;&#12301;&#12290;</p>
<p>&#12300;&#30906;&#35469;&#36984;&#38917;&#12301;&#29992;&#26044;&#25351;&#23450;&#23481;&#22120;&#22914;&#20309;&#24555;&#21462;&#20316;&#26989;&#20107;&#20214;&#20043;&#38291;&#30340;&#37389;&#21270; Bean &#22519;&#34892;&#34389;&#29702;&#12290;</p>
<ul>
<li>
<p>&#22914;&#26524;&#24744;&#36984;&#21462;&#36984;&#38917; B (&#38928;&#35373;&#20540;)&#65292;&#23481;&#22120;&#26371;&#24555;&#21462;&#20316;&#26989;&#20107;&#20214;&#20043;&#38291;&#23601;&#32210;&#30340;&#22519;&#34892;&#34389;&#29702;&#12290;</p>
</li>
<li>
<p>&#22914;&#26524;&#24744;&#36984;&#21462;&#36984;&#38917; C&#65292;&#23481;&#22120;&#19981;&#26371;&#24555;&#21462;&#20316;&#26989;&#20107;&#20214;&#20043;&#38291;&#23601;&#32210;&#30340;&#22519;&#34892;&#34389;&#29702;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#22312;&#12300;&#38598;&#21312;&#30340;&#21021;&#22987;&#22823;&#23567;&#21644;&#26368;&#23567;&#22823;&#23567;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#35201;&#20445;&#30041;&#22312;&#38598;&#21312;&#20013;&#30340;&#26368;&#23567; Bean &#25976;&#30446;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 0&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#38598;&#21312;&#30340;&#26368;&#22823;&#22823;&#23567;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#23481;&#22120;&#19968;&#27425;&#21487;&#20445;&#30041;&#22312;&#38598;&#21312;&#20013;&#30340;&#26368;&#22823; Bean &#25976;&#30446;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 32&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#38598;&#21312;&#35373;&#23450;&#22823;&#23567;&#25976;&#37327;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#38290;&#32622;&#26178;&#38291;&#36229;&#36942;&#12300;&#38598;&#21312;&#38290;&#32622;&#36926;&#26178;&#12301;&#27396;&#20301;&#20013;&#25351;&#23450;&#30340;&#26178;&#38291;&#26178;&#65292;&#35201;&#24478;&#38598;&#21312;&#20013;&#31227;&#38500;&#30340; Bean &#25976;&#30446;&#12290;</p>
<p>&#27492;&#20540;&#24517;&#38920;&#33267;&#23569;&#28858; 0 &#19988;&#23567;&#26044;&#12300;&#38598;&#21312;&#30340;&#26368;&#22823;&#22823;&#23567;&#12301;&#20540;&#12290;&#38928;&#35373;&#20540;&#28858; 8&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#38598;&#21312;&#38290;&#32622;&#36926;&#26178;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837; Bean &#22312;&#38598;&#21312;&#20013;&#38290;&#32622;&#24190;&#31186;&#24460;&#21363;&#38656;&#31227;&#38500;&#12290;</p>
<p>&#36229;&#36942;&#36889;&#27573;&#26178;&#38291;&#24460;&#65292;&#23559;&#26371;&#37559;&#27584; Bean&#12290;0 &#20540;&#34920;&#31034; Bean &#21487;&#20197;&#28961;&#38480;&#26399;&#20445;&#25345;&#38290;&#32622;&#12290;&#38928;&#35373;&#20540;&#28858; 600&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#26368;&#22823;&#24555;&#21462;&#22823;&#23567;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#24555;&#21462;&#21487;&#23481;&#32013;&#30340;&#26368;&#22823; Bean &#25976;&#30446;&#12290;</p>
<p>&#22686;&#21152;&#35201;&#24555;&#21462;&#30340;&#26368;&#22823; Bean &#25976;&#30446;&#65292;&#20197;&#30465;&#19979;&#24314;&#31435;&#21644;&#37559;&#27584; Bean &#25152;&#38656;&#30340;&#32147;&#24120;&#24615;&#32791;&#29992;&#26178;&#38291;&#12290;&#20294;&#26159;&#65292;&#22914;&#26524;&#22686;&#21152;&#24555;&#21462;&#35352;&#25014;&#39636;&#65292;&#20282;&#26381;&#22120;&#23559;&#28040;&#32791;&#26356;&#22810;&#35352;&#25014;&#39636;&#21644;&#36039;&#28304;&#12290;&#35531;&#30906;&#23450;&#24744;&#30340;&#20316;&#26989;&#29872;&#22659;&#36275;&#22816;&#29992;&#26044;&#24555;&#21462;&#35352;&#25014;&#39636;&#35373;&#23450;&#12290;0 &#20540;&#34920;&#31034;&#24555;&#21462;&#28961;&#38480;&#21046;&#12290;&#38928;&#35373;&#20540;&#28858; 512&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#24555;&#21462;&#35373;&#23450;&#22823;&#23567;&#25976;&#37327;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#24555;&#21462;&#24050;&#28415;&#26178;&#35201;&#37389;&#21270;&#30340; Bean &#25976;&#30446;&#12290;</p>
<p>&#24555;&#21462;&#30340; Bean &#36948;&#21040;&#26368;&#22823;&#25976;&#30446;&#20043;&#24460;&#65292;&#23481;&#22120;&#23559;&#24478;&#20633;&#20221;&#20786;&#23384;&#20013;&#31227;&#38500;&#19968;&#20123;&#37389;&#21270; Bean&#12290;&#27492;&#20540;&#20063;&#26371;&#25351;&#23450;&#22914;&#26524;&#22312;&#38598;&#21312;&#20013;&#27794;&#26377;&#21487;&#29992;&#30340; Bean &#26178;&#25509;&#21040;&#35531;&#27714;&#65292;&#25152;&#35201;&#24314;&#31435;&#30340; Bean &#25976;&#30446;&#12290;&#27492;&#20540;&#24517;&#38920;&#22823;&#26044; 1 &#19988;&#23567;&#26044;&#12300;&#26368;&#22823;&#24555;&#21462;&#22823;&#23567;&#12301;&#20540;&#12290;&#38928;&#35373;&#20540;&#28858; 32&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#31227;&#38500;&#36926;&#26178;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#23559;&#37389;&#21270;&#30340; Bean &#24478;&#38542;&#27573;&#20316;&#26989;&#20786;&#23384;&#20013;&#31227;&#38500;&#21069;&#31561;&#24453;&#30340;&#31186;&#25976;&#12290;</p>
<p>0 &#20540;&#34920;&#31034;&#23481;&#22120;&#19981;&#26371;&#33258;&#21205;&#31227;&#38500;&#38750;&#20351;&#29992;&#20013;&#30340; Bean&#12290;&#22914;&#26524;&#12300;&#31227;&#38500;&#36926;&#26178;&#12301;&#20540;&#23567;&#26044;&#25110;&#31561;&#26044;&#12300;&#24555;&#21462;&#38290;&#32622;&#36926;&#26178;&#12301;&#20540;&#65292;&#26371;&#31435;&#21363;&#31227;&#38500; Bean&#65292;&#32780;&#19981;&#21152;&#20197;&#37389;&#21270;&#12290;&#38928;&#35373;&#20540;&#28858; 5400&#12290;</p>
</li>
<li>
<p>&#24478;&#12300;&#31227;&#38500;&#36984;&#21462;&#31574;&#30053;&#12301;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#23481;&#22120;&#29992;&#20197;&#24478;&#24555;&#21462;&#20013;&#31227;&#38500;&#26377;&#29376;&#24907;&#20043;&#38542;&#27573;&#20316;&#26989; Bean &#30340;&#31574;&#30053;&#12290;</p>
<p>&#36984;&#38917;&#22914;&#19979;&#65306;</p>
<dl>
<dt>&#26368;&#36817;&#26410;&#20351;&#29992; (NRU)</dt>
<dd>
<p>(&#38928;&#35373;) &#31227;&#38500;&#26368;&#36817;&#27794;&#26377;&#20351;&#29992;&#36942;&#30340; Bean&#12290;</p>
</dd>
<dt>&#20808;&#20837;&#20808;&#20986; (FIFO)</dt>
<dd>
<p>&#31227;&#38500;&#24555;&#21462;&#20013;&#26368;&#33290;&#30340; Bean&#12290;</p>
</dd>
<dt>&#26368;&#36817;&#26368;&#23569;&#20351;&#29992; (LRU)</dt>
<dd>
<p>&#31227;&#38500;&#26368;&#36817;&#26368;&#23569;&#23384;&#21462;&#30340; Bean&#12290;</p>
</dd>
</dl>
</li>
<li>
<p>&#22312;&#12300;&#24555;&#21462;&#38290;&#32622;&#36926;&#26178;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837; Bean &#21487;&#20197;&#22312;&#24555;&#21462;&#20013;&#32173;&#25345;&#38290;&#32622;&#30340;&#26368;&#22823;&#31186;&#25976;&#12290;</p>
<p>&#36229;&#36942;&#36889;&#27573;&#26178;&#38291;&#24460;&#65292;&#23481;&#22120;&#21487;&#20197;&#37389;&#21270;&#27492; Bean&#12290;0 &#20540;&#34920;&#31034; Bean &#27704;&#36960;&#19981;&#26371;&#25104;&#28858;&#37389;&#21270;&#20505;&#36984;&#38917;&#30446;&#12290;&#38928;&#35373;&#20540;&#28858; 600&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#20854;&#20182;&#29305;&#24615;&#12301;&#21312;&#27573;&#20013;&#65292;&#25351;&#23450;&#20854;&#20182;&#29305;&#24615;&#12290;</p>
<p>&#22914;&#38656;&#21487;&#29992;&#29305;&#24615;&#30340;&#25551;&#36848;&#65292;&#35531;&#21443;&#38321;<a href="ref-ejbgeneralproperties.html">EJB &#23481;&#22120;&#29305;&#26377;&#30340;&#29305;&#24615;</a>&#12290;</p>
<ul>
<li>
<p>&#33509;&#35201;&#22686;&#21152;&#29305;&#24615;&#65292;&#35531;&#25353;&#19968;&#19979;&#12300;&#22686;&#21152;&#29305;&#24615;&#12301;&#25353;&#37397;&#12290;&#22312;&#20986;&#29694;&#30340;&#31354;&#30333;&#21015;&#20013;&#65292;&#26044;&#12300;&#21517;&#31281;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#21517;&#31281;&#65292;&#28982;&#24460;&#22312;&#12300;&#20540;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#20540;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#20462;&#25913;&#29305;&#24615;&#65292;&#35531;&#32232;&#36655;&#29305;&#24615;&#30340;&#12300;&#20540;&#12301;&#27396;&#20301;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#21034;&#38500;&#29305;&#24615;&#65292;&#35531;&#36984;&#21462;&#24744;&#35201;&#21034;&#38500;&#20043;&#29305;&#24615;&#12300;&#21517;&#31281;&#12301;&#27396;&#20301;&#24038;&#20596;&#30340;&#26680;&#21462;&#26041;&#22602;&#65292;&#28982;&#24460;&#25353;&#19968;&#19979;&#12300;&#21034;&#38500;&#29305;&#24615;&#12301;&#25353;&#37397;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#25353;&#19968;&#19979;&#12300;&#20786;&#23384;&#12301;&#12290;</p>

<hr>
<p><b>&#25552;&#31034;:</b></p>
&#33509;&#35201;&#22238;&#21040;&#38928;&#35373;&#35373;&#23450;&#65292;&#35531;&#25353;&#19968;&#19979;&#12300;&#36617;&#20837;&#38928;&#35373;&#20540;&#12301;&#25353;&#37397;&#65292;&#28982;&#24460;&#25353;&#19968;&#19979;&#12300;&#20786;&#23384;&#12301;&#12290;<br />
<hr>

</li>
<li>
<p>&#37325;&#26032;&#21855;&#21205; GlassFish Server&#12290;</p>
</li>
</ol>
<a id="sthref4" name="sthref4"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="../../../ejb/en/help/task-ejbmdbpoolsettings.html">&#32068;&#24907; MDB &#38598;&#21312;&#35373;&#23450;</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbtimerservice.html">&#32068;&#24907; EJB &#35336;&#26178;&#22120;&#26381;&#21209;</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbcontaineravailability.html">&#32068;&#24907; EJB &#23481;&#22120;&#30340;&#21487;&#29992;&#24615;&#35373;&#23450;</a></p>
</li>
</ul>




<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
