<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterinstances" name="ref-clusterinstances"></a><a id="GHCLU00006" name="GHCLU00006"></a></p>

<h4><a id="sthref266" name="sthref266"></a><a id="sthref267" name="sthref267"></a>Instances de serveur clusteris&eacute;es</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Instances de serveur clusteris&eacute;es permet de cr&eacute;er et de g&eacute;rer les instances GlassFish Server dans le cluster en cours.</p>
<p>Le champ Nom du cluster est un champ en lecture seule qui affiche le nom du cluster en cours.</p>
<p>La page Instances de serveur clusteris&eacute;es affiche la liste des instances appartenant au cluster en cours. Pour chaque instance, les informations suivantes sont fournies.</p>
<dl>
<dt>Nom</dt>
<dd>
<p>Nom affect&eacute; &agrave; l'instance lors de sa cr&eacute;ation. Lorsque vous cliquez sur le nom, la page <a href="ref-clusterinstanceedit.html">Informations g&eacute;n&eacute;rales</a> de l'instance s'ouvre.</p>
</dd>
<dt>Poids EC</dt>
<dd>
<p>Entier qui repr&eacute;sente la pond&eacute;ration de l'&eacute;quilibrage de charge de l'instance.</p>
<p>La pond&eacute;ration de l'&eacute;quilibrage de charge d&eacute;termine la proportion de toutes les demandes destin&eacute;es au cluster que l'instance doit traiter.</p>
<p>Par exemple, dans un cluster comportant deux instances, vous pouvez avoir besoin d'une instance pour le traitement de l'une des quatre demandes et d'une autre instance pour le traitement des trois demandes restantes. Dans ce cas, d&eacute;finissez la pond&eacute;ration de l'instance qui doit traiter une demande sur quatre sur 1 et celle de l'autre instance sur 3. Si vous pr&eacute;f&eacute;rez utiliser des pourcentages, d&eacute;finissez la pond&eacute;ration des instances sur 25 et 75, respectivement.</p>
<p>La pond&eacute;ration par d&eacute;faut est de 100.</p>
</dd>
<dt>Configuration</dt>
<dd>
<p>Configuration que l'instance r&eacute;f&eacute;rence. Le fait de cliquer sur la configuration ouvre la page <a href="../../../common/en/help/ref-configuration.html">Configurations</a> de l'instance.</p>
</dd>
<dt>Noeud</dt>
<dd>
<p>Nom du noeud sur lequel se trouve l'instance. Lorsque vous cliquez sur le nom, la page <a href="ref-nodeedit.html">Modifier le noeud</a> du noeud s'ouvre.</p>
</dd>
<dt>Statut</dt>
<dd>
<p>Mention indiquant si l'instance est en cours d'ex&eacute;cution, doit &ecirc;tre red&eacute;marr&eacute;e pour &ecirc;tre mise &agrave; jour avec les modifications de la configuration ou n'est pas en cours d'ex&eacute;cution. Ce champ est en lecture seule.</p>
</dd>
</dl>
<p>La table Instances de serveur contient &eacute;galement les options ci-apr&egrave;s.</p>
<dl>
<dt>Nouveau</dt>
<dd>
<p>Bouton permettant d'ajouter une instance au cluster.</p>
</dd>
<dt>Supprimer</dt>
<dd>
<p>Bouton permettant d'enlever les instances s&eacute;lectionn&eacute;es du cluster.</p>

<hr>
<p><b>Attention:</b></p>
Si vous utilisez un cluster JMS (Java Message Service) avec un broker ma&icirc;tre, ne supprimez pas l'instance associ&eacute;e au broker ma&icirc;tre. Si cette instance doit &ecirc;tre supprim&eacute;e, utilisez la sous-commande <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00005"><code>change-master-broker</code>(1)</a> pour affecter le broker ma&icirc;tre &agrave; une autre instance.
<hr>

</dd>
<dt>D&eacute;marrer</dt>
<dd>
<p>Bouton permettant de d&eacute;marrer les instances s&eacute;lectionn&eacute;es dans le cluster.</p>
</dd>
<dt>Arr&ecirc;ter</dt>
<dd>
<p>Bouton permettant d'arr&ecirc;ter les instances s&eacute;lectionn&eacute;es dans le cluster.</p>
</dd>
</dl>
<a id="sthref268" name="sthref268"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-create-clustered-instance.html">Ajout d'une instance GlassFish Server &agrave; un cluster</a></p>
</li>
<li>
<p><a href="task-delete-clustered-instances.html">Suppression d'instances GlassFish Server incluses dans un cluster</a></p>
</li>
<li>
<p><a href="task-start-clustered-instances.html">D&eacute;marrage d'instances GlassFish Server incluses dans un cluster</a></p>
</li>
<li>
<p><a href="task-stop-clustered-instances.html">Arr&ecirc;t d'instances GlassFish Server incluses dans un cluster</a></p>
</li>
</ul>
<a id="sthref269" name="sthref269"></a>
<h5>Sous-commandes asadmin &eacute;quivalentes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00033"><code>create-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00085"><code>delete-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00170"><code>list-instances</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00236"><code>start-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00241"><code>stop-instance</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
