<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterinstanceedit" name="ref-clusterinstanceedit"></a></p>

<h4><a id="sthref275" name="sthref275"></a><a id="sthref276" name="sthref276"></a><a id="sthref277" name="sthref277"></a>Informations g&eacute;n&eacute;rales</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Informations g&eacute;n&eacute;rales contient les options ci-apr&egrave;s.</p>
<dl>
<dt>D&eacute;marrer</dt>
<dd>
<p>Bouton permettant de d&eacute;marrer l'instance. Si l'instance est en cours d'ex&eacute;cution, ce bouton est d&eacute;sactiv&eacute;.</p>
</dd>
<dt>Arr&ecirc;ter</dt>
<dd>
<p>Bouton permettant d'arr&ecirc;ter l'instance. Si l'instance est arr&ecirc;t&eacute;e, ce bouton est d&eacute;sactiv&eacute;.</p>
</dd>
<dt>Red&eacute;marrer</dt>
<dd>
<p>Bouton permettant de red&eacute;marrer l'instance. Si l'instance est arr&ecirc;t&eacute;e, ce bouton est d&eacute;sactiv&eacute;.</p>
</dd>
<dt>Afficher les fichiers journaux</dt>
<dd>
<p>Bouton permettant d'afficher les fichiers journaux de l'instance.</p>
</dd>
<dt>R&eacute;cup&eacute;rer les transactions</dt>
<dd>
<p>Bouton permettant de r&eacute;cup&eacute;rer les transactions de l'instance.</p>
</dd>
<dt>Nom du cluster</dt>
<dd>
<p>Nom affect&eacute; au cluster lors de sa cr&eacute;ation. Lorsque vous cliquez sur le nom, la page <a href="ref-clustergeneral.html">Informations g&eacute;n&eacute;rales</a> du cluster s'ouvre.</p>
</dd>
<dt>Nom d'instance</dt>
<dd>
<p>Nom affect&eacute; &agrave; l'instance lors de son ajout au cluster. Ce champ est en lecture seule.</p>
</dd>
<dt>Statut</dt>
<dd>
<p>Mention indiquant si l'instance est en cours d'ex&eacute;cution, doit &ecirc;tre red&eacute;marr&eacute;e pour &ecirc;tre mise &agrave; jour avec les modifications de la configuration ou n'est pas en cours d'ex&eacute;cution. Ce champ est en lecture seule.</p>
</dd>
<dt>JVM</dt>
<dd>
<p>Si vous cliquez sur Rapport JVM, une fen&ecirc;tre distincte s'ouvre et affiche des rapports sur la Java Virtual Machine, notamment un rapport r&eacute;capitulatif, un rapport sur la gestion et le nettoyage de la m&eacute;moire, un rapport de chargement de classes et le vidage des threads en cours.</p>
</dd>
<dt>Noeud</dt>
<dd>
<p>Nom du noeud sur lequel se trouve l'instance. Lorsque vous cliquez sur le nom, la page <a href="ref-nodeedit.html">Modifier le noeud</a> du noeud s'ouvre.</p>
</dd>
<dt>Configuration</dt>
<dd>
<p>Configuration que l'instance r&eacute;f&eacute;rence. Le fait de cliquer sur la configuration ouvre la page <a href="../../../common/en/help/ref-configuration.html">Configurations</a> de l'instance.</p>
</dd>
<dt>Ports HTTP</dt>
<dd>
<p>Liste s&eacute;par&eacute;e par des virgules des num&eacute;ros des ports sur lesquels l'instance &eacute;coute les types de demande suivants :</p>
<ul>
<li>
<p>Demandes d'administration</p>
</li>
<li>
<p>Demandes HTTP</p>
</li>
<li>
<p>Demandes HTTPS</p>
</li>
</ul>
<p>Ce champ est en lecture seule.</p>
</dd>
<dt>Ports IIOP</dt>
<dd>
<p>Liste s&eacute;par&eacute;e par des virgules des num&eacute;ros des ports utilis&eacute;s par l'instance pour les types de connexion suivants :</p>
<ul>
<li>
<p>Connexion IIOP s&eacute;curis&eacute;e</p>
</li>
<li>
<p>Connexions IIOP s&eacute;curis&eacute;es avec authentification client</p>
</li>
<li>
<p>Connexions IIOP</p>
</li>
</ul>
<p>Ce champ est en lecture seule.</p>
</dd>
</dl>
<a id="sthref278" name="sthref278"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-start-clustered-instances.html">D&eacute;marrage d'instances GlassFish Server incluses dans un cluster</a></p>
</li>
<li>
<p><a href="task-stop-clustered-instances.html">Arr&ecirc;t d'instances GlassFish Server incluses dans un cluster</a></p>
</li>
<li>
<p><a href="task-view-logs-clustered-instance.html">Affichage des fichiers journaux pour une instance GlassFish Server incluse dans un cluster</a></p>
</li>
<li>
<p><a href="task-recovertransactions.html">R&eacute;cup&eacute;ration des transactions pour une instance GlassFish Server incluse dans un cluster</a></p>
</li>
</ul>
<a id="sthref279" name="sthref279"></a>
<h5>Sous-commandes asadmin &eacute;quivalentes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00138"><code>generate-jvm-report</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00219"><code>restart-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00236"><code>start-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00241"><code>stop-instance</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
