<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-gms" name="ref-gms"></a><a id="GHCLU00026" name="GHCLU00026"></a></p>

<h4><a id="sthref354" name="sthref354"></a>Modifier le service de gestion de groupes</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Service de gestion de groupes permet de modifier les param&egrave;tres GMS.</p>
<p>Le service de gestion de groupes (GMS) est un service inclus dans un processus offrant des services de surveillance de clusters, d'appartenance au cluster et de communication de groupe. Le service GMS est construit sur une pile configurable de protocoles de surveillance de l'int&eacute;grit&eacute; et de d&eacute;tection d'appartenance &agrave; des groupes. Il ex&eacute;cute les fonctions suivantes :</p>
<ul>
<li>
<p>Il signale les modules inscrits dans une instance GlassFish Server lorsque des instances membres sont ajout&eacute;es &agrave; un cluster et enlev&eacute;es d'un cluster, ou lorsque leur &eacute;chec est suspect&eacute; ou a &eacute;t&eacute; confirm&eacute;.</p>
</li>
<li>
<p>Il permet l'envoi et la r&eacute;ception de messages entre les membres du cluster.</p>
</li>
</ul>
<p>La page Service de gestion de groupes contient les options suivantes :</p>
<dl>
<dt>Charger les valeurs par d&eacute;faut</dt>
<dd>
<p>Bouton permettant de restaurer les valeurs par d&eacute;faut des param&egrave;tres qui en ont. Les param&egrave;tres qui n'ont pas de valeurs par d&eacute;faut ne sont pas modifi&eacute;s.</p>
</dd>
<dt>Nom de configuration</dt>
<dd>
<p>Nom de la configuration &agrave; laquelle s'appliquent les param&egrave;tres de cette page. Ce champ est en lecture seule.</p>
</dd>
<dt>Nb maximal de signaux d'activit&eacute; manqu&eacute;s</dt>
<dd>
<p>Nombre de signaux d'activit&eacute; manqu&eacute;s d'un membre apr&egrave;s lequel un &eacute;chec d'instance de serveur est suspect&eacute;. La valeur par d&eacute;faut est 3.</p>
</dd>
<dt>Fr&eacute;quence de signal</dt>
<dd>
<p>D&eacute;lai entre les signaux d'activit&eacute; manqu&eacute;s d'un membre. La valeur par d&eacute;faut est 2 000 millisecondes.</p>
</dd>
<dt>D&eacute;lai de d&eacute;tection de groupe expir&eacute;</dt>
<dd>
<p>Dur&eacute;e d'attente du service GMS pour la d&eacute;tection d'autres membres du cluster. La valeur par d&eacute;faut est 5 000 millisecondes.</p>
</dd>
<dt>Temps d'attente de v&eacute;rification d'&eacute;chec</dt>
<dd>
<p>Temps d'attente avant la v&eacute;rification de l'indication d'&eacute;chec d'un membre suspect&eacute;. La valeur par d&eacute;faut est 1 500 millisecondes.</p>
</dd>
<dt>Autres propri&eacute;t&eacute;s</dt>
<dd>
<p>Table des propri&eacute;t&eacute;s suppl&eacute;mentaires pour le service de gestion de groupes.</p>
<p>GlassFish Server ne d&eacute;finit pas d'autre propri&eacute;t&eacute; GMS.</p>
<p>Pour chaque propri&eacute;t&eacute;, les informations suivantes sont affich&eacute;es :</p>
<dl>
<dt>Nom</dt>
<dd>
<p>Nom de la propri&eacute;t&eacute;.</p>
</dd>
<dt>Valeur</dt>
<dd>
<p>Valeur de la propri&eacute;t&eacute; d&eacute;finie pour l'instance s&eacute;lectionn&eacute;e.</p>
</dd>
<dt>Description</dt>
<dd>
<p>Texte de description qui fournit de plus amples informations sur la propri&eacute;t&eacute;.</p>
</dd>
</dl>
<p>La table Autres propri&eacute;t&eacute;s contient &eacute;galement les options ci-apr&egrave;s.</p>
<dl>
<dt>Ajouter une propri&eacute;t&eacute;</dt>
<dd>
<p>Bouton permettant d'ajouter une propri&eacute;t&eacute;. Un clic sur ce bouton permet d'ajouter une ligne &agrave; la table Autres propri&eacute;t&eacute;s.</p>
</dd>
<dt>Supprimer des propri&eacute;t&eacute;s</dt>
<dd>
<p>Bouton permettant de supprimer les propri&eacute;t&eacute;s s&eacute;lectionn&eacute;es. Toute propri&eacute;t&eacute; supprim&eacute;e revient &agrave; sa valeur par d&eacute;faut ou, si aucune valeur par d&eacute;faut n'est configur&eacute;e, n'est pas d&eacute;finie.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref355" name="sthref355"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-gmsenable.html">Activation du service de gestion de groupes</a></p>
</li>
<li>
<p><a href="task-gms.html">Configuration du service de gestion de groupes</a></p>
</li>
<li>
<p><a href="task-gmscluster.html">Configuration de param&egrave;tres du service de gestion de groupes pour un cluster</a></p>
</li>
</ul>




<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
