<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterinstanceconfigproperties" name="ref-clusterinstanceconfigproperties"></a><a id="GHCLU00010" name="GHCLU00010"></a></p>

<h4><a id="sthref283" name="sthref283"></a><a id="sthref284" name="sthref284"></a><a id="sthref285" name="sthref285"></a>Propri&eacute;t&eacute;s syst&egrave;me d'instance</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Propri&eacute;t&eacute;s syst&egrave;me d'instance affiche la liste des propri&eacute;t&eacute;s syst&egrave;me Java d&eacute;finies pour l'instance GlassFish Server en cours. Les propri&eacute;t&eacute;s syst&egrave;me Java sont transmises au lanceur d'application Java via son option <code>-D</code> au d&eacute;marrage de GlassFish Server.</p>
<p>Ces propri&eacute;t&eacute;s remplacent les d&eacute;finitions de propri&eacute;t&eacute; pour les param&egrave;tres de port dans la configuration de l'instance. Les param&egrave;tres de port pr&eacute;d&eacute;finis doivent &ecirc;tre remplac&eacute;s si, par exemple, deux instances incluses dans un cluster r&eacute;sident sur le m&ecirc;me h&ocirc;te. Dans ce cas, les param&egrave;tres de port d'une instance doivent &ecirc;tre remplac&eacute;s car les deux instances partagent la m&ecirc;me configuration.</p>
<p>Pour plus d'informations sur les param&egrave;tres de port pr&eacute;d&eacute;finis dans une configuration, reportez-vous &agrave; <a href="../../../common/en/help/ref-predefinedconfigsysproperties.html">Propri&eacute;t&eacute;s syst&egrave;me de configuration pr&eacute;d&eacute;finies</a>.</p>
<p>Le champ Nom d'instance est en lecture seule. Il indique le nom de l'instance en cours.</p>
<p>Pour chaque propri&eacute;t&eacute;, les informations suivantes sont affich&eacute;es :</p>
<dl>
<dt>Nom de la variable d'instance</dt>
<dd>
<p>Nom de la propri&eacute;t&eacute; syst&egrave;me.</p>
</dd>
<dt>Valeur en cours</dt>
<dd>
<p>Valeur actuellement d&eacute;finie pour la propri&eacute;t&eacute;. Ce champ est en lecture seule.</p>
</dd>
<dt>Valeur de remplacement</dt>
<dd>
<p>Valeur sur laquelle la propri&eacute;t&eacute; sera d&eacute;finie apr&egrave;s l'enregistrement des modifications.</p>
</dd>
</dl>
<p>La table Autres propri&eacute;t&eacute;s contient &eacute;galement les options ci-apr&egrave;s.</p>
<dl>
<dt>Ajouter une propri&eacute;t&eacute;</dt>
<dd>
<p>Bouton permettant d'ajouter une propri&eacute;t&eacute;. Un clic sur ce bouton permet d'ajouter une ligne &agrave; la table Autres propri&eacute;t&eacute;s.</p>
</dd>
<dt>Supprimer des propri&eacute;t&eacute;s</dt>
<dd>
<p>Bouton permettant de supprimer les propri&eacute;t&eacute;s s&eacute;lectionn&eacute;es. Toute propri&eacute;t&eacute; supprim&eacute;e revient &agrave; sa valeur par d&eacute;faut ou, si aucune valeur par d&eacute;faut n'est configur&eacute;e, n'est pas d&eacute;finie.</p>
</dd>
</dl>
<a id="sthref286" name="sthref286"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-change-clustered-instance-ports.html">Modification des num&eacute;ros de port d'une instance GlassFish Server incluse dans un cluster</a></p>
</li>
<li>
<p><a href="task-config-sys-properties-defaults.html">D&eacute;finition des valeurs par d&eacute;faut des propri&eacute;t&eacute;s syst&egrave;me de configuration</a></p>
</li>
</ul>
<a id="sthref287" name="sthref287"></a>
<h5>Sous-commandes asadmin &eacute;quivalentes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00059"><code>create-system-properties</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00110"><code>delete-system-property</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00203"><code>list-system-properties</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
