<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-standaloneinstanceproperties" name="ref-standaloneinstanceproperties"></a></p>

<h4><a id="sthref347" name="sthref347"></a><a id="sthref348" name="sthref348"></a><a id="sthref349" name="sthref349"></a>Propri&eacute;t&eacute;s d'instance</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Propri&eacute;t&eacute;s d'instance affiche la liste des propri&eacute;t&eacute;s d&eacute;finies pour l'instance GlassFish Server en cours. Ces propri&eacute;t&eacute;s ajoutent des informations de configuration facultatives relatives &agrave; l'instance.</p>
<p>Le champ Nom d'instance est en lecture seule. Il indique le nom de l'instance en cours.</p>
<p>Pour chaque propri&eacute;t&eacute;, les informations suivantes sont affich&eacute;es :</p>
<dl>
<dt>Nom</dt>
<dd>
<p>Nom de la propri&eacute;t&eacute;.</p>
</dd>
<dt>Valeur</dt>
<dd>
<p>Valeur de la propri&eacute;t&eacute; d&eacute;finie pour l'instance s&eacute;lectionn&eacute;e.</p>
</dd>
<dt>Description</dt>
<dd>
<p>Texte de description qui fournit de plus amples informations sur la propri&eacute;t&eacute;.</p>
</dd>
</dl>
<p>La table Autres propri&eacute;t&eacute;s contient &eacute;galement les options ci-apr&egrave;s.</p>
<dl>
<dt>Ajouter une propri&eacute;t&eacute;</dt>
<dd>
<p>Bouton permettant d'ajouter une propri&eacute;t&eacute;. Un clic sur ce bouton permet d'ajouter une ligne &agrave; la table Autres propri&eacute;t&eacute;s.</p>
</dd>
<dt>Supprimer des propri&eacute;t&eacute;s</dt>
<dd>
<p>Bouton permettant de supprimer les propri&eacute;t&eacute;s s&eacute;lectionn&eacute;es. Toute propri&eacute;t&eacute; supprim&eacute;e revient &agrave; sa valeur par d&eacute;faut ou, si aucune valeur par d&eacute;faut n'est configur&eacute;e, n'est pas d&eacute;finie.</p>
</dd>
</dl>
<p>GlassFish Server d&eacute;finit les propri&eacute;t&eacute;s d'instance suivantes :</p>
<dl>
<dt><code>rendezvousOccurred</code></dt>
<dd>
<p>Indique si l'instance a contact&eacute; le serveur d'administration de domaine (DAS). Les valeurs possibles sont les suivantes :</p>
<dl>
<dt><code>True</code></dt>
<dd>
<p>L'instance a contact&eacute; le serveur DAS.</p>
</dd>
<dt><code>False</code></dt>
<dd>
<p>L'instance n'a <i>pas</i> contact&eacute; le serveur DAS.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref350" name="sthref350"></a>
<h5>T&acirc;ches connexes</h5>
<p><a href="task-set-props-standalone-instance.html">D&eacute;finition de propri&eacute;t&eacute;s propres &agrave; l'instance pour une instance GlassFish Server autonome</a></p>
<a id="sthref351" name="sthref351"></a>
<h5>Sous-commandes asadmin &eacute;quivalentes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00139"><code>get</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00145"><code>list</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00226"><code>set</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
