<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterproperties" name="ref-clusterproperties"></a><a id="GHCLU00014" name="GHCLU00014"></a></p>

<h4><a id="sthref300" name="sthref300"></a><a id="sthref301" name="sthref301"></a>Propri&eacute;t&eacute;s de cluster</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Propri&eacute;t&eacute;s de cluster affiche la liste des propri&eacute;t&eacute;s d&eacute;finies pour les clusters s&eacute;lectionn&eacute;s. Ces propri&eacute;t&eacute;s ajoutent des informations de configuration facultatives sur le cluster.</p>
<p>Le champ Nom du cluster est un champ en lecture seule qui affiche le nom du cluster s&eacute;lectionn&eacute;.</p>
<p>Pour chaque propri&eacute;t&eacute;, les informations suivantes sont affich&eacute;es :</p>
<dl>
<dt>Nom</dt>
<dd>
<p>Nom de la propri&eacute;t&eacute;.</p>
</dd>
<dt>Valeur</dt>
<dd>
<p>Valeur de la propri&eacute;t&eacute; d&eacute;finie pour l'instance s&eacute;lectionn&eacute;e.</p>
</dd>
<dt>Description</dt>
<dd>
<p>Texte de description qui fournit de plus amples informations sur la propri&eacute;t&eacute;.</p>
</dd>
</dl>
<p>La table Autres propri&eacute;t&eacute;s contient &eacute;galement les options ci-apr&egrave;s.</p>
<dl>
<dt>Ajouter une propri&eacute;t&eacute;</dt>
<dd>
<p>Bouton permettant d'ajouter une propri&eacute;t&eacute;. Un clic sur ce bouton permet d'ajouter une ligne &agrave; la table Autres propri&eacute;t&eacute;s.</p>
</dd>
<dt>Supprimer des propri&eacute;t&eacute;s</dt>
<dd>
<p>Bouton permettant de supprimer les propri&eacute;t&eacute;s s&eacute;lectionn&eacute;es. Toute propri&eacute;t&eacute; supprim&eacute;e revient &agrave; sa valeur par d&eacute;faut ou, si aucune valeur par d&eacute;faut n'est configur&eacute;e, n'est pas d&eacute;finie.</p>
</dd>
</dl>
<p>GlassFish Server d&eacute;finit les propri&eacute;t&eacute;s de cluster suivantes :</p>
<dl>
<dt><code>GMS_DISCOVERY_URI_LIST</code></dt>
<dd>
<p>Emplacements des instances GlassFish Server du cluster &agrave; utiliser pour d&eacute;tecter le cluster. Cette propri&eacute;t&eacute; n'est requise que si le service de gestion de groupes (GMS) n'utilise pas la multidiffusion pour diffuser des messages.</p>
<p>Les valeurs valides pour cette propri&eacute;t&eacute; sont les suivantes :</p>
<ul>
<li>
<p>Liste des URI s&eacute;par&eacute;s par des virgules. Chaque URI doit localiser une instance GlassFish Server ou le serveur DAS. Ce format est obligatoire si plusieurs instances GlassFish Server sont en cours d'ex&eacute;cution sur le m&ecirc;me h&ocirc;te.</p>
<p>Le format de chaque URI de la liste est le suivant :</p>
<p><i>scheme</i><code>://</code><i>host-name-or -IP-address</i><code>:</code><i>port</i></p>
<ul>
<li>
<p><i>scheme</i> est le sch&eacute;ma d'URI, c'est-&agrave;-dire <code>tcp</code>.</p>
</li>
<li>
<p><i>host-name-or -IP-address</i> est le nom de l'h&ocirc;te ou l'adresse IP de l'h&ocirc;te sur lequel l'instance est en cours d'ex&eacute;cution.</p>
</li>
<li>
<p><i>port</i> est le num&eacute;ro du port sur lequel l'instance &eacute;coute les messages provenant du service GMS. La propri&eacute;t&eacute; syst&egrave;me <code>GMS_LISTENER_PORT-</code><i>clustername</i> doit &ecirc;tre d&eacute;finie pour l'instance. Pour plus d'informations sur la d&eacute;finition de cette propri&eacute;t&eacute; syst&egrave;me pour une instance, reportez-vous &agrave; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSHAG00373">Discovering a Cluster When Multicast Transport Is Unavailable</a> dans le manuel <i>Oracle GlassFish Server High Availability Administration Guide</i>.</p>
</li>
</ul>
</li>
<li>
<p>Liste des adresses IP ou des noms d'h&ocirc;te s&eacute;par&eacute;s par des virgules sur lesquels le serveur DAS ou les instances sont ex&eacute;cut&eacute;s. La liste peut contenir une combinaison d'adresses IP et de noms d'h&ocirc;te. Utilisez ce format uniquement si une instance incluse dans un cluster est en cours d'ex&eacute;cution sur chaque h&ocirc;te. La valeur de la propri&eacute;t&eacute; <code>GMS_LISTENER_PORT</code> doit &ecirc;tre unique pour chaque cluster du domaine.</p>
</li>
<li>
<p>Mot-cl&eacute; <code>generate</code>. Vous pouvez utiliser ce format uniquement si une instance de cluster est ex&eacute;cut&eacute;e sur chaque h&ocirc;te et que le serveur DAS est ex&eacute;cut&eacute; sur un h&ocirc;te distinct. Plusieurs instances situ&eacute;es sur un m&ecirc;me h&ocirc;te ne peuvent pas &ecirc;tre membres du m&ecirc;me cluster. La valeur de la propri&eacute;t&eacute; <code>GMS_LISTENER_PORT</code> doit &ecirc;tre unique pour chaque cluster du domaine.</p>
</li>
</ul>
</dd>
<dt><code>GMS_LISTENER_PORT</code></dt>
<dd>
<p>Num&eacute;ro du port sur lequel le cluster &eacute;coute les messages du service GMS.</p>
<p>La valeur par d&eacute;faut est une r&eacute;f&eacute;rence &agrave; la propri&eacute;t&eacute; syst&egrave;me <code>GMS_LISTENER_PORT-</code><i>cluster-name</i>. Par d&eacute;faut, cette propri&eacute;t&eacute; syst&egrave;me n'est pas d&eacute;finie. Dans ce cas, le service GMS s&eacute;lectionne un port libre dans la plage d&eacute;finie par les propri&eacute;t&eacute;s <code>GMS_TCPSTARTPORT</code> et <code>GMS_TCPENDPORT</code>. Par d&eacute;faut, cette plage est comprise entre 9090 et 9200. Dans la plupart des cas, le comportement par d&eacute;faut est suffisant.</p>
<p>Cependant, si le service GMS n'a <b>pas</b> recours &agrave; la multidiffusion des messages, cette propri&eacute;t&eacute; doit indiquer un num&eacute;ro de port valide pour toutes les instances GlassFish Server du cluster. Afin que la valeur par d&eacute;faut permette de respecter cette exigence, utilisez une propri&eacute;t&eacute; syst&egrave;me pour d&eacute;finir le num&eacute;ro de port de chaque instance s&eacute;par&eacute;ment.</p>
<p>Par exemple, utilisez la page <a href="ref-clustersystemproperties.html">Propri&eacute;t&eacute;s syst&egrave;me de cluster</a> pour cr&eacute;er la propri&eacute;t&eacute; syst&egrave;me <code>GMS_LISTENER_PORT-</code><i>cluster-name</i> du DAS. Ensuite, pour chaque instance du cluster, d&eacute;finissez la propri&eacute;t&eacute; syst&egrave;me <code>GMS_LISTENER_PORT-</code><i>cluster-name</i> sur le num&eacute;ro de port sur lequel l'instance &eacute;coute les messages provenant du service GMS. La valeur par d&eacute;faut de la propri&eacute;t&eacute; <code>GMS_LISTENER_PORT</code> du cluster r&eacute;f&eacute;rence cette propri&eacute;t&eacute; syst&egrave;me.</p>
</dd>
<dt><code>GMS_LOOPBACK</code></dt>
<dd>
<p>Indique si une instance peut recevoir des messages de niveau application qu'elle envoie elle-m&ecirc;me vers le cluster.</p>
<p>Les valeurs possibles sont les suivantes :</p>
<dl>
<dt><code>False</code></dt>
<dd>
<p>L'instance ne peut <i>pas</i> recevoir de messages qu'elle a elle-m&ecirc;me envoy&eacute;s (valeur par d&eacute;faut).</p>
</dd>
<dt><code>True</code></dt>
<dd>
<p>L'instance peut recevoir des messages qu'elle a elle-m&ecirc;me envoy&eacute;s. Utilisez ce param&egrave;tre pour tester une instance lorsqu'il s'agit de la seule instance dans un cluster.</p>
</dd>
</dl>
</dd>
<dt><code>GMS_MULTICAST_TIME_TO_LIVE</code></dt>
<dd>
<p>Nombre maximal d'it&eacute;rations ou de transmissions qu'un message de multidiffusion peut subir pour les types d'&eacute;v&eacute;nement suivants avant d'&ecirc;tre supprim&eacute; :</p>
<ul>
<li>
<p>D&eacute;tection de groupe</p>
</li>
<li>
<p>Signaux d'activit&eacute; du membre</p>
</li>
<li>
<p>Modifications d'appartenance</p>
</li>
</ul>
<p>Pour une meilleure ad&eacute;quation avec la configuration du r&eacute;seau sur lequel le serveur DAS et les instances incluses dans un cluster sont d&eacute;ploy&eacute;s, d&eacute;finissez une valeur aussi faible que possible. Afin de d&eacute;terminer la plus petite valeur possible pour le syst&egrave;me, utilisez la sous-commande <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00259"><code>validate-multicast</code>(1)</a>.</p>
<p>La valeur 0 permet de s'assurer que les messages de multidiffusion ne quittent jamais l'h&ocirc;te &agrave; partir duquel ils sont diffus&eacute;s.</p>
<p>La valeur 1 risque d'emp&ecirc;cher la diffusion des messages entre les h&ocirc;tes d'un m&ecirc;me sous-r&eacute;seau connect&eacute;s via un commutateur ou un routeur.</p>
<p>La valeur par d&eacute;faut est 4, ce qui permet de s'assurer que les messages sont correctement transmis &agrave; tous les membres du cluster dans les r&eacute;seaux sur lesquels les h&ocirc;tes sont connect&eacute;s par des commutateurs ou des routeurs.</p>
</dd>
<dt><code>GMS_TCPENDPORT</code></dt>
<dd>
<p>Num&eacute;ro de port maximal de la plage dans laquelle le service GMS s&eacute;lectionne un port libre si la propri&eacute;t&eacute; syst&egrave;me <code>GMS_LISTENER_PORT-</code><i>cluster-name</i> n'est pas d&eacute;finie. La valeur par d&eacute;faut est 9200.</p>
</dd>
<dt><code>GMS_TCPSTARTPORT</code></dt>
<dd>
<p>Num&eacute;ro de port minimal de la plage dans laquelle le service GMS s&eacute;lectionne un port libre si la propri&eacute;t&eacute; syst&egrave;me <code>GMS_LISTENER_PORT-</code><i>cluster-name</i> n'est pas d&eacute;finie. La valeur par d&eacute;faut est 9090.</p>
</dd>
</dl>
<a id="sthref302" name="sthref302"></a>
<h5>Sous-commandes asadmin &eacute;quivalentes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00139"><code>get</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00145"><code>list</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00226"><code>set</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
