<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-recovertransactions" name="ref-recovertransactions"></a><a id="GHCLU00009" name="GHCLU00009"></a></p>

<h4><a id="sthref280" name="sthref280"></a>R&eacute;cup&eacute;rer les transactions</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page R&eacute;cup&eacute;rer les transactions permet de r&eacute;cup&eacute;rer les transactions effectu&eacute;es pour une instance GlassFish Server.</p>
<p>Si l'instance est en cours d'ex&eacute;cution, la page R&eacute;cup&eacute;rer les transactions contient uniquement le texte <b>La r&eacute;cup&eacute;ration est effectu&eacute;e par le serveur en cours d'ex&eacute;cution lui-m&ecirc;me</b> et le bouton OK.</p>
<p>Si l'instance n'est pas en cours d'ex&eacute;cution, la page R&eacute;cup&eacute;rer les transactions contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Nom d'instance</dt>
<dd>
<p>Nom affect&eacute; &agrave; l'instance lors de sa cr&eacute;ation. Ce champ est en lecture seule.</p>
</dd>
<dt>Serveur de destination</dt>
<dd>
<p>Autre instance pouvant r&eacute;cup&eacute;rer les transactions sur l'instance en cours.</p>
</dd>
<dt>R&eacute;pertoire des journaux des transactions</dt>
<dd>
<p>R&eacute;pertoire dans lequel les journaux des transactions sont stock&eacute;s. La valeur par d&eacute;faut est <code>/logs/tx</code> sous le r&eacute;pertoire du domaine.</p>
<p>Les journaux des transactions sont conserv&eacute;s dans le sous-r&eacute;pertoire <code>tx</code> du r&eacute;pertoire sp&eacute;cifi&eacute; par le param&egrave;tre Emplacement des journaux des transactions du service de transaction pour la configuration du cluster. La valeur par d&eacute;faut du param&egrave;tre Emplacement des journaux des transactions est le r&eacute;pertoire sp&eacute;cifi&eacute; dans le champ Racine journal de la page Attributs de domaine, qui se trouve dans l'onglet Avanc&eacute; du noeud GlassFish Server.</p>
</dd>
</dl>
<a id="sthref281" name="sthref281"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-recovertransactions.html">R&eacute;cup&eacute;ration des transactions pour une instance GlassFish Server incluse dans un cluster</a></p>
</li>
<li>
<p><a href="task-recovertransactions-standalone-instance.html">R&eacute;cup&eacute;ration des transactions pour une instance GlassFish Server autonome</a></p>
</li>
</ul>
<a id="sthref282" name="sthref282"></a>
<h5>Sous-commandes asadmin &eacute;quivalentes</h5>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00216"><code>recover-transactions</code>(1)</a></p>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
