<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-standaloneinstances" name="ref-standaloneinstances"></a></p>

<h4><a id="sthref319" name="sthref319"></a><a id="sthref320" name="sthref320"></a><a id="sthref321" name="sthref321"></a>Instances de serveur autonomes</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Instances de serveur autonomes permet de cr&eacute;er et de g&eacute;rer des instances GlassFish Server autonomes.</p>
<p>Elle affiche la liste de toutes les instances autonomes du domaine. Pour chaque instance, les informations suivantes sont fournies.</p>
<dl>
<dt>Nom</dt>
<dd>
<p>Nom affect&eacute; &agrave; l'instance lors de sa cr&eacute;ation. Lorsque vous cliquez sur le nom, la page <a href="ref-standaloneinstancegeneral.html">Informations g&eacute;n&eacute;rales</a> de l'instance s'ouvre.</p>
</dd>
<dt>Poids EC</dt>
<dd>
<p>Entier qui repr&eacute;sente la pond&eacute;ration de l'&eacute;quilibrage de charge de l'instance.</p>
<p>La pond&eacute;ration de l'&eacute;quilibrage de charge d&eacute;termine la proportion de toutes les demandes destin&eacute;es au cluster que l'instance doit traiter.</p>
<p>Par exemple, dans un cluster comportant deux instances, vous pouvez avoir besoin d'une instance pour le traitement de l'une des quatre demandes et d'une autre instance pour le traitement des trois demandes restantes. Dans ce cas, d&eacute;finissez la pond&eacute;ration de l'instance qui doit traiter une demande sur quatre sur 1 et celle de l'autre instance sur 3. Si vous pr&eacute;f&eacute;rez utiliser des pourcentages, d&eacute;finissez la pond&eacute;ration des instances sur 25 et 75, respectivement.</p>
<p>La pond&eacute;ration par d&eacute;faut est de 100.</p>
</dd>
<dt>Configuration</dt>
<dd>
<p>Configuration s&eacute;lectionn&eacute;e pour l'instance lors de sa cr&eacute;ation. Le fait de cliquer sur la configuration ouvre la page <a href="../../../common/en/help/ref-configuration.html">Configurations</a> de l'instance.</p>
</dd>
<dt>Noeud</dt>
<dd>
<p>Nom du noeud sur lequel se trouve l'instance. Lorsque vous cliquez sur le nom, la page <a href="ref-nodeedit.html">Modifier le noeud</a> du noeud s'ouvre.</p>
</dd>
<dt>Statut</dt>
<dd>
<p>Mention indiquant si l'instance est en cours d'ex&eacute;cution.</p>
</dd>
</dl>
<p>La table Instances de serveur contient &eacute;galement les options ci-apr&egrave;s.</p>
<dl>
<dt>Nouveau</dt>
<dd>
<p>Bouton permettant de cr&eacute;er une instance autonome.</p>
</dd>
<dt>Supprimer</dt>
<dd>
<p>Bouton permettant de supprimer les instances autonomes s&eacute;lectionn&eacute;es.</p>
</dd>
<dt>D&eacute;marrer</dt>
<dd>
<p>Bouton permettant de d&eacute;marrer les instances autonomes s&eacute;lectionn&eacute;es.</p>
</dd>
<dt>Arr&ecirc;ter</dt>
<dd>
<p>Bouton permettant d'arr&ecirc;ter les instances autonomes s&eacute;lectionn&eacute;es.</p>
</dd>
</dl>
<a id="sthref322" name="sthref322"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-create-standalone-instance.html">Cr&eacute;ation d'une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-delete-standalone-instances.html">Suppression d'instances GlassFish Server autonomes</a></p>
</li>
<li>
<p><a href="task-start-standalone-instances.html">D&eacute;marrage d'instances GlassFish Server autonomes</a></p>
</li>
<li>
<p><a href="task-stop-standalone-instances.html">Arr&ecirc;t d'instances GlassFish Server autonomes</a></p>
</li>
</ul>
<a id="sthref323" name="sthref323"></a>
<h5>Sous-commandes asadmin &eacute;quivalentes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00033"><code>create-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00085"><code>delete-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00170"><code>list-instances</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00236"><code>start-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00241"><code>stop-instance</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
