<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clustergeneral" name="ref-clustergeneral"></a></p>

<h4><a id="sthref251" name="sthref251"></a><a id="sthref252" name="sthref252"></a><a id="sthref253" name="sthref253"></a><a id="sthref254" name="sthref254"></a>Informations g&eacute;n&eacute;rales</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Informations g&eacute;n&eacute;rales contient les options ci-apr&egrave;s.</p>
<dl>
<dt>D&eacute;marrer le cluster</dt>
<dd>
<p>Bouton permettant de d&eacute;marrer le cluster. Si toutes les instances du cluster sont en cours d'ex&eacute;cution, ce bouton est d&eacute;sactiv&eacute;.</p>
</dd>
<dt>Arr&ecirc;ter le cluster</dt>
<dd>
<p>Bouton permettant d'arr&ecirc;ter le cluster. Si toutes les instances du cluster sont arr&ecirc;t&eacute;es, ce bouton est d&eacute;sactiv&eacute;.</p>
</dd>
<dt>Migrer les horloges EJB</dt>
<dd>
<p>Bouton permettant de migrer les horloges EJB (Enterprise Java Beans) d'une instance GlassFish Server arr&ecirc;t&eacute;e vers une instance en cours d'ex&eacute;cution dans le cluster. Un clic sur ce bouton ouvre la page <a href="ref-migrateejbtimers.html">Migrer les horloges EJB</a>. Si toutes les instances du cluster sont en cours d'ex&eacute;cution, ce bouton est d&eacute;sactiv&eacute;.</p>
</dd>
<dt>Changer de journal</dt>
<dd>
<p>Bouton permettant de changer le fichier journal du cluster. Lorsque le fichier journal est d&eacute;plac&eacute;, il est renomm&eacute; avec un horodatage, au format <code>server.log_</code><i>date-et-heure</i>, et un fichier journal vide est cr&eacute;&eacute; pour les nouveaux messages de journalisation. Les modifications sont appliqu&eacute;es dynamiquement. Il n'est pas n&eacute;cessaire de red&eacute;marrer le serveur.</p>
</dd>
<dt>Nom du cluster</dt>
<dd>
<p>Nom affect&eacute; au cluster lors de sa cr&eacute;ation. Ce champ est en lecture seule.</p>
</dd>
<dt>JVM</dt>
<dd>
<p>Si vous cliquez sur Rapport JVM, une fen&ecirc;tre distincte s'ouvre et affiche des rapports sur la Java Virtual Machine, notamment un rapport r&eacute;capitulatif, un rapport sur la gestion et le nettoyage de la m&eacute;moire, un rapport de chargement de classes et le vidage des threads en cours.</p>
</dd>
<dt>Configuration</dt>
<dd>
<p>Configuration s&eacute;lectionn&eacute;e pour le cluster lors de sa cr&eacute;ation. Le fait de cliquer sur la configuration ouvre la page <a href="../../../common/en/help/ref-configuration.html">Configurations</a> du cluster. Ce champ est en lecture seule.</p>
</dd>
<dt>GMS</dt>
<dd>
<p>Si cette option est activ&eacute;e, le service de gestion de groupes (GMS) est d&eacute;marr&eacute; dans chaque instance GlassFish Server du cluster et dans le serveur d'administration de domaine (DAS). Le serveur DAS fonctionne dans chaque cluster pour lequel le service GMS est activ&eacute;. Le service GMS fournit des fonctions de surveillance de cluster, d'appartenance au cluster et des services de communication de groupe. Cette option est activ&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Port de multidiffusion</dt>
<dd>
<p>Num&eacute;ro du port de communication sur lequel le service GMS &eacute;coute les &eacute;v&eacute;nements de groupe. Cette option doit sp&eacute;cifier un num&eacute;ro de port valide compris entre 2048 et 49151. La valeur par d&eacute;faut est g&eacute;n&eacute;r&eacute;e automatiquement dans cette plage.</p>
</dd>
<dt>Adresse de multidiffusion</dt>
<dd>
<p>Adresse sur laquelle le service GMS &eacute;coute les &eacute;v&eacute;nements de groupe. Cette option doit indiquer une adresse de multidiffusion dans la plage 224.0.0.0 &agrave; 239.255.255.255. La valeur par d&eacute;faut est 228.9.<i>XX</i>.<i>YY</i>, <i>XX</i> et <i>YY</i> &eacute;tant des valeurs ind&eacute;pendantes g&eacute;n&eacute;r&eacute;es automatiquement, comprises entre 0 et 255.</p>
</dd>
<dt>Adresse d'interface de liaison</dt>
<dd>
<p>Adresse IP (Internet Protocol) de l'interface r&eacute;seau &agrave; laquelle le service GMS est li&eacute;. Cette option doit sp&eacute;cifier l'adresse IP d'une interface r&eacute;seau locale. La valeur par d&eacute;faut correspond &agrave; toutes les adresses de l'interface r&eacute;seau publique.</p>
<p>Sur un ordinateur &agrave; connexions multiples, cette option permet de configurer l'interface r&eacute;seau utilis&eacute;e pour le service GMS. Un ordinateur &agrave; connexions multiples poss&egrave;de au moins deux interfaces r&eacute;seau.</p>
<p>Afin de sp&eacute;cifier une adresse valide pour toutes les instances GlassFish Server du cluster, utilisez une propri&eacute;t&eacute; syst&egrave;me pour d&eacute;finir l'adresse de chaque instance s&eacute;par&eacute;ment.</p>
<p>Par exemple, utilisez la page <a href="ref-clustersystemproperties.html">Propri&eacute;t&eacute;s syst&egrave;me de cluster</a> pour cr&eacute;er la propri&eacute;t&eacute; syst&egrave;me <code>GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i>. D&eacute;finissez ensuite l'option Adresse de liaison de cette page sur <code>${GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i><code>}</code> pour sp&eacute;cifier la propri&eacute;t&eacute; syst&egrave;me. Enfin, pour chaque instance du cluster, d&eacute;finissez la propri&eacute;t&eacute; syst&egrave;me <code>GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i> sur l'adresse d'interface r&eacute;seau requise sur l'ordinateur de l'instance.</p>
</dd>
<dt>Statut</dt>
<dd>
<p>Indication du nombre d'instances en cours d'ex&eacute;cution ou non dans le cluster. Ce champ est en lecture seule.</p>
</dd>
</dl>
<a id="sthref255" name="sthref255"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-gmscluster.html">Configuration de param&egrave;tres du service de gestion de groupes pour un cluster</a></p>
</li>
<li>
<p><a href="task-migrate-ejb-timers.html">Migration d'horloges EJB</a></p>
</li>
</ul>
<a id="sthref256" name="sthref256"></a>
<h5>Sous-commandes asadmin &eacute;quivalentes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00138"><code>generate-jvm-report</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00211"><code>migrate-timers</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00224"><code>rotate-log</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
