<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusternew" name="ref-clusternew"></a></p>

<h4><a id="sthref247" name="sthref247"></a><a id="sthref248" name="sthref248"></a>Nouveau cluster</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Nouveau cluster permet de cr&eacute;er un cluster.</p>
<p>Elle contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Nom du cluster</dt>
<dd>
<p>Nom du cluster.</p>
<p>Le nom doit respecter les exigences suivantes :</p>
<ul>
<li>
<p>Il ne peut contenir que des caract&egrave;res ASCII.</p>
</li>
<li>
<p>Il doit commencer par une lettre, un chiffre ou un trait de soulignement.</p>
</li>
<li>
<p>Il ne peut contenir que les caract&egrave;res suivants :</p>
<ul>
<li>
<p>Lettres minuscules</p>
</li>
<li>
<p>Lettres majuscules</p>
</li>
<li>
<p>Chiffres</p>
</li>
<li>
<p>Trait d'union</p>
</li>
<li>
<p>Point</p>
</li>
<li>
<p>Trait de soulignement</p>
</li>
</ul>
</li>
<li>
<p>Le nom doit &ecirc;tre unique dans le domaine et ne doit pas appartenir &agrave; un autre cluster, &agrave; une configuration nomm&eacute;e, &agrave; une instance GlassFish Server ou &agrave; un noeud.</p>
</li>
<li>
<p>Il ne doit pas &ecirc;tre <code>domain</code>, <code>server</code> ou tout autre mot-cl&eacute; r&eacute;serv&eacute; par GlassFish Server.</p>
</li>
</ul>
</dd>
<dt>Configuration</dt>
<dd>
<p>Liste d&eacute;roulante des configurations nomm&eacute;es existantes pouvant &ecirc;tre utilis&eacute;es par le cluster. Un cluster exige une configuration nomm&eacute;e qui d&eacute;finit la configuration de toutes les instances qu'il contient. Vous devez s&eacute;lectionner une configuration dans la liste. Le cluster utilisera la configuration s&eacute;lectionn&eacute;e lors de sa cr&eacute;ation.</p>
</dd>
<dt>Cr&eacute;er une copie de la configuration s&eacute;lectionn&eacute;e</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, la configuration choisie est copi&eacute;e lors de la cr&eacute;ation du cluster. Le nom <i>cluster-name</i><code>-config</code> est affect&eacute; &agrave; la copie de la configuration, <i>cluster-name</i> &eacute;tant le nom du cluster tel que vous l'avez saisi dans le champ Nom du cluster.</p>
<p>Si <code>default-config</code> est s&eacute;lectionn&eacute; dans la liste d&eacute;roulante Configuration, vous devez choisir cette option. La configuration <code>default-config</code> peut &ecirc;tre copi&eacute;e, mais pas utilis&eacute;e comme r&eacute;f&eacute;rence.</p>
</dd>
<dt>Utiliser la configuration s&eacute;lectionn&eacute;e comme r&eacute;f&eacute;rence</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, le cluster utilisera la configuration nomm&eacute;e existante indiqu&eacute;e.</p>
<p>Si <code>default-config</code> est s&eacute;lectionn&eacute; dans la liste d&eacute;roulante Configuration, vous ne devez <i>pas</i> choisir cette option. La configuration <code>default-config</code> peut &ecirc;tre copi&eacute;e, mais pas utilis&eacute;e comme r&eacute;f&eacute;rence.</p>
</dd>
<dt>Type de configuration du cluster de file d'attente des messages</dt>
<dd>
<p>Cette option permet d'indiquer le type de cluster de brokers Message Queue &agrave; utiliser pour le nouveau cluster GlassFish Server. Par d&eacute;faut, GlassFish Server utilise un cluster de brokers Message Queue conventionnel avec un broker ma&icirc;tre et avec un broker imbriqu&eacute; dans chacune des instances du cluster GlassFish Server.</p>
<p>Si cette option a la valeur Personnalis&eacute;, plusieurs options suppl&eacute;mentaires sont affich&eacute;es pour configurer le cluster de brokers Message Queue &agrave; utiliser pour le cluster GlassFish Server. Reportez-vous &agrave; <a href="#CHDJFEJB">Options pour les clusters de brokers Message Queue personnalis&eacute;s</a>.</p>
</dd>
<dt>Instances de serveur &agrave; cr&eacute;er</dt>
<dd>
<p>Liste des instances GlassFish Server qui seront cr&eacute;&eacute;es en m&ecirc;me temps que le cluster. Pour chaque instance, les informations suivantes sont fournies :</p>
<dl>
<dt>Nom d'instance</dt>
<dd>
<p>Nom de l'instance.</p>
</dd>
<dt>Poids</dt>
<dd>
<p>Entier qui repr&eacute;sente la pond&eacute;ration de l'&eacute;quilibrage de charge de l'instance.</p>
<p>La pond&eacute;ration de l'&eacute;quilibrage de charge d&eacute;termine la proportion de toutes les demandes destin&eacute;es au cluster que l'instance doit traiter.</p>
<p>Par exemple, dans un cluster comportant deux instances, vous pouvez avoir besoin d'une instance pour le traitement de l'une des quatre demandes et d'une autre instance pour le traitement des trois demandes restantes. Dans ce cas, d&eacute;finissez la pond&eacute;ration de l'instance qui doit traiter une demande sur quatre sur 1 et celle de l'autre instance sur 3. Si vous pr&eacute;f&eacute;rez utiliser des pourcentages, d&eacute;finissez la pond&eacute;ration des instances sur 25 et 75, respectivement.</p>
<p>La pond&eacute;ration par d&eacute;faut est de 100.</p>
</dd>
<dt>Noeud</dt>
<dd>
<p>Liste d&eacute;roulante des noeuds existants sur lesquels l'instance peut r&eacute;sider. Vous devez s&eacute;lectionner un noeud dans la liste. L'instance r&eacute;sidera sur le noeud s&eacute;lectionn&eacute; lors de la cr&eacute;ation du cluster.</p>
</dd>
</dl>
<p>La table Instances de serveur &agrave; cr&eacute;er contient &eacute;galement les options ci-apr&egrave;s.</p>
<dl>
<dt>Nouveau</dt>
<dd>
<p>Bouton permettant de cr&eacute;er une instance. Un clic sur ce bouton permet d'ajouter une ligne &agrave; la table Instances de serveur &agrave; cr&eacute;er.</p>
</dd>
<dt>Supprimer</dt>
<dd>
<p>Bouton permettant de supprimer une instance.</p>
</dd>
</dl>
</dd>
</dl>
<a id="CHDJFEJB" name="CHDJFEJB"></a>
<h5>Options pour les clusters de brokers Message Queue personnalis&eacute;s</h5>
<p>Lorsque l'option Type de configuration du cluster de file d'attente des messages a la valeur Personnalis&eacute;, les options ci-apr&egrave;s sont affich&eacute;es pour configurer le cluster de brokers Message Queue &agrave; utiliser pour le cluster GlassFish Server.</p>
<dl>
<dt>Type de service JMS</dt>
<dd>
<p>Type des brokers (appel&eacute;s h&ocirc;tes JMS dans GlassFish Server) &agrave; utiliser dans le cluster de brokers. Le type s&eacute;lectionn&eacute; d&eacute;termine les types de cluster de brokers disponibles. Les types de broker sont les suivants :</p>
<dl>
<dt>Imbriqu&eacute;</dt>
<dd>
<p>La configuration et le cycle de vie du broker sont g&eacute;r&eacute;s par GlassFish Server. Chaque instance GlassFish incluse dans un cluster est trait&eacute;e par un broker ex&eacute;cut&eacute; dans la m&ecirc;me JVM que l'instance.</p>
<p>Si l'option Type de service JMS a la valeur Imbriqu&eacute;, seuls les clusters de brokers Message Queue conventionnels sont pris en charge. Les options permettant de configurer le cluster conventionnel sont affich&eacute;es.</p>
</dd>
<dt>Local</dt>
<dd>
<p>La configuration et le cycle de vie du broker sont g&eacute;r&eacute;s par GlassFish Server. Chaque instance GlassFish incluse dans un cluster est trait&eacute;e par un broker ex&eacute;cut&eacute; dans une JVM distincte sur le m&ecirc;me h&ocirc;te que l'instance.</p>
<p>Si l'option Type de service JMS a la valeur Local, les clusters de brokers Message Queue conventionnels et am&eacute;lior&eacute;s (haute disponibilit&eacute;) sont pris en charge. Les options permettant de s&eacute;lectionner le type de cluster et de configurer le cluster sont affich&eacute;es.</p>
</dd>
<dt>Distant</dt>
<dd>
<p>La configuration et le cycle de vie du broker et du cluster de brokers sont g&eacute;r&eacute;s &agrave; l'aide des outils d'administration Message Queue.</p>
<p>Si l'option Type de service JMS a la valeur Distant, aucune autre option n'est affich&eacute;e.</p>
</dd>
</dl>
</dd>
<dt>Type de cluster JMS</dt>
<dd>
<p>Type de cluster de brokers Message Queue &agrave; utiliser pour le cluster GlassFish Server.</p>
<p>Si l'option Type de cluster JMS a la valeur Conventionnel, les options ci-apr&egrave;s sont affich&eacute;es.</p>
<dl>
<dt>Type d'emplacement de stockage de la configuration JMS</dt>
<dd>
<p>Type de banque de donn&eacute;es &agrave; utiliser pour les donn&eacute;es de configuration du cluster conventionnel. Si cette option a la valeur Broker ma&icirc;tre, un broker du cluster est d&eacute;sign&eacute; comme broker ma&icirc;tre et est utilis&eacute; pour stocker les donn&eacute;es de configuration. Si cette option a la valeur Base de donn&eacute;es partag&eacute;e, les donn&eacute;es de configuration sont stock&eacute;es dans la banque de donn&eacute;es JDBC accessible par tous les brokers. Dans ce cas, les options associ&eacute;es &agrave; la base de donn&eacute;es sont affich&eacute;es.</p>
</dd>
<dt>Type d'emplacement de stockage des messages JMS</dt>
<dd>
<p>Type de banque de donn&eacute;es que chaque broker doit utiliser pour stocker ses donn&eacute;es de message. Si cette option a la valeur Fichier, chaque broker stocke ses donn&eacute;es de message dans une banque de donn&eacute;es de type fichier. Si cette option a la valeur JDBC, chaque broker stocke ses donn&eacute;es de message dans une banque de donn&eacute;es JDBC.</p>
</dd>
</dl>
<p>Si l'option Type de cluster JMS a la valeur Am&eacute;lior&eacute; (HA), les options associ&eacute;es &agrave; la base de donn&eacute;es sont affich&eacute;es.</p>
</dd>
<dt>Fournisseur de base de donn&eacute;es</dt>
<dt>URL de base de donn&eacute;es</dt>
<dt>Utilisateur de la base de donn&eacute;es</dt>
<dd>
<p>Fournisseur, URL d'acc&egrave;s et utilisateur de la base de donn&eacute;es JDBC &agrave; utiliser dans les situations suivantes :</p>
<ul>
<li>
<p>Lorsque le type d'emplacement de stockage de la configuration d'un cluster conventionnel a la valeur Base de donn&eacute;es partag&eacute;e</p>
</li>
<li>
<p>Lorsque le type d'emplacement de stockage des messages d'un cluster conventionnel a la valeur JDBC</p>
</li>
<li>
<p>Lorsque le type de cluster a la valeur Am&eacute;lior&eacute; (HA)</p>
</li>
</ul>
<p>Pour plus d'informations sur les fournisseurs pris en charge et sur les formats des URL d'acc&egrave;s de chaque fournisseur, reportez-vous &agrave; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GMADG00244">JDBC-Based Persistence</a> dans le manuel <i>Oracle GlassFish Server Message Queue Administration Guide</i>.</p>
</dd>
<dt>Authentification de base de donn&eacute;es</dt>
<dt>Mot de passe de base de donn&eacute;es</dt>
<dt>Alias de mot de passe</dt>
<dd>
<p>Informations sur le mot de passe de l'utilisateur de base de donn&eacute;es JDBC indiqu&eacute; dans Utilisateur de la base de donn&eacute;es.</p>
<p>Si l'option Authentification de base de donn&eacute;es a la valeur Mot de passe, l'option Mot de passe de la base de donn&eacute;es est affich&eacute;e. Si l'option Authentification de base de donn&eacute;es a la valeur Alias de mot de passe, l'option Alias de mot de passe est affich&eacute;e.</p>
</dd>
<dt>Propri&eacute;t&eacute;s de cluster JMS</dt>
<dd>
<p>Liste des propri&eacute;t&eacute;s de broker Message Queue permettant de configurer les brokers. Les &eacute;l&eacute;ments de la liste sont s&eacute;par&eacute;s par le signe deux-points (<code>:</code>) et sont au format suivant :</p>
<pre>
<i>prop1Name</i>=<i>prop1Value</i>:<i>prop2Name</i>=<i>prop2Value</i>:...
</pre>
<p>Si un nom de propri&eacute;t&eacute; de broker contient des points, faites-les pr&eacute;c&eacute;dez de deux barres obliques inverses (<code>\\</code>) ; par exemple, pour inclure la propri&eacute;t&eacute; <code>imq.system.max_count</code>, indiquez <code>imq\\.system\\.max_count</code> dans la liste.</p>
</dd>
</dl>
<a id="sthref249" name="sthref249"></a>
<h5>T&acirc;ches connexes</h5>
<p><a href="task-create-cluster.html">Cr&eacute;ation d'un cluster</a></p>
<a id="sthref250" name="sthref250"></a>
<h5>Sous-commande asadmin &eacute;quivalente</h5>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00017"><code>create-cluster</code>(1)</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
