<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-nodenew" name="ref-nodenew"></a><a id="GHCLU00016" name="GHCLU00016"></a></p>

<h4><a id="sthref307" name="sthref307"></a>Nouveau noeud</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Nouveau noeud permet de cr&eacute;er un noeud GlassFish Server. Un noeud repr&eacute;sente un h&ocirc;te sur lequel le logiciel GlassFish Server est install&eacute;. Un noeud doit exister au niveau de chaque h&ocirc;te sur lequel r&eacute;sident des instances GlassFish Server.</p>
<p>Les options pr&eacute;sentes sur la page Nouveau noeud d&eacute;pendent du type de noeud.</p>
<a id="sthref308" name="sthref308"></a>
<h5>Options pour tous les types de noeud</h5>
<p>Les options suivantes sont disponibles pour tous les types de noeud :</p>
<dl>
<dt>Nom</dt>
<dd>
<p>Nom du noeud.</p>
<p>Le nom doit respecter les exigences suivantes :</p>
<ul>
<li>
<p>Il ne peut contenir que des caract&egrave;res ASCII.</p>
</li>
<li>
<p>Il doit commencer par une lettre, un chiffre ou un trait de soulignement.</p>
</li>
<li>
<p>Il ne peut contenir que les caract&egrave;res suivants :</p>
<ul>
<li>
<p>Lettres minuscules</p>
</li>
<li>
<p>Lettres majuscules</p>
</li>
<li>
<p>Chiffres</p>
</li>
<li>
<p>Trait d'union</p>
</li>
<li>
<p>Point</p>
</li>
<li>
<p>Trait de soulignement</p>
</li>
</ul>
</li>
<li>
<p>Le nom doit &ecirc;tre unique dans le domaine et ne doit pas appartenir &agrave; un autre noeud, &agrave; une configuration nomm&eacute;e, &agrave; un cluster ou &agrave; une instance GlassFish Server.</p>
</li>
<li>
<p>Il ne doit pas &ecirc;tre <code>domain</code>, <code>server</code> ou tout autre mot-cl&eacute; r&eacute;serv&eacute; par GlassFish Server.</p>
</li>
</ul>
</dd>
<dt>Type</dt>
<dd>
<p>Liste d&eacute;roulante permettant de sp&eacute;cifier le type de noeud parmi les suivants :</p>
<dl>
<dt>CONFIG</dt>
<dd>
<p>Le noeud ne prend pas en charge la communication &agrave; distance. Si CONFIG est s&eacute;lectionn&eacute;, aucune option de configuration SSH ou DCOM n'est affich&eacute;e et le champ R&eacute;pertoire d'installation est vide.</p>
</dd>
<dt>DCOM</dt>
<dd>
<p>Le noeud prend en charge la communication via le protocole distant DCOM (Distributed Component Object Model). Le protocole DCOM est disponible uniquement pour les syst&egrave;mes Windows.</p>
</dd>
<dt>SSH</dt>
<dd>
<p>Le noeud prend en charge la communication via le protocole SSH (shell s&eacute;curis&eacute;).</p>
</dd>
</dl>
</dd>
<dt>H&ocirc;te du noeud</dt>
<dd>
<p>Nom de l'h&ocirc;te que le noeud repr&eacute;sente. Le caract&egrave;re obligatoire de ce champ d&eacute;pend du type du noeud :</p>
<ul>
<li>
<p>Si le type du noeud est CONFIG, le nom de l'h&ocirc;te peut &ecirc;tre omis. Le nom de l'h&ocirc;te peut &ecirc;tre d&eacute;termin&eacute; lors de la cr&eacute;ation des instances r&eacute;sidant sur le noeud.</p>
</li>
<li>
<p>Si le type du noeud est DCOM ou SSH, le nom de l'h&ocirc;te doit &ecirc;tre sp&eacute;cifi&eacute;. Sinon, une erreur se produit.</p>
</li>
</ul>
</dd>
<dt>R&eacute;pertoire du noeud</dt>
<dd>
<p>Chemin d'acc&egrave;s complet au r&eacute;pertoire devant contenir les instances GlassFish Server cr&eacute;&eacute;es sur le noeud. Si un chemin relatif est indiqu&eacute;, il est relatif au r&eacute;pertoire as-install.</p>
<p>La valeur par d&eacute;faut d&eacute;pend du type du noeud :</p>
<ul>
<li>
<p>Si le type du noeud est CONFIG, aucun r&eacute;pertoire d'instances n'est sp&eacute;cifi&eacute; pour le noeud dans la configuration du serveur d'administration de domaine (DAS). Le r&eacute;pertoire du noeud peut &ecirc;tre d&eacute;termin&eacute; lors de la cr&eacute;ation des instances r&eacute;sidant sur le noeud.</p>
</li>
<li>
<p>Si le type du noeud est DCOM, la valeur par d&eacute;faut est as-install<code>\nodes</code>, o&ugrave; as-install correspond au r&eacute;pertoire d'installation de base du logiciel GlassFish Server sur l'h&ocirc;te.</p>
</li>
<li>
<p>Si le type du noeud est SSH, la valeur par d&eacute;faut est as-install<code>/nodes</code>, o&ugrave; as-install correspond au r&eacute;pertoire d'installation de base du logiciel GlassFish Server sur l'h&ocirc;te.</p>
</li>
</ul>
</dd>
<dt>R&eacute;pertoire d'installation</dt>
<dd>
<p>Chemin d'acc&egrave;s complet au <i>parent</i> du r&eacute;pertoire d'installation de base du logiciel GlassFish Server sur l'h&ocirc;te (par exemple, <code>/export/glassfish3</code>).</p>
<p>La valeur par d&eacute;faut d&eacute;pend du type du noeud :</p>
<ul>
<li>
<p>Si le type du noeud est CONFIG, aucun r&eacute;pertoire d'installation n'est sp&eacute;cifi&eacute; pour le noeud dans la configuration du serveur DAS. Le r&eacute;pertoire d'installation peut &ecirc;tre d&eacute;termin&eacute; lors de la cr&eacute;ation des instances r&eacute;sidant sur le noeud.</p>
</li>
<li>
<p>Si le type du noeud est DCOM ou SSH, la valeur par d&eacute;faut est le parent du r&eacute;pertoire d'installation de base par d&eacute;faut du logiciel GlassFish Server pour le serveur d'administration de domaine (DAS). Ce comportement par d&eacute;faut n'est utile que si vous installez GlassFish Server au m&ecirc;me emplacement sur tous les h&ocirc;tes.</p>
</li>
</ul>
</dd>
</dl>
<a id="sthref309" name="sthref309"></a>
<h5>Options suppl&eacute;mentaires pour les noeuds DCOM</h5>
<p>Les options suivantes sont disponibles uniquement si le champ Type a la valeur DCOM :</p>
<dl>
<dt>Installer GlassFish Server</dt>
<dd>
<p>Si l'option Activ&eacute; est s&eacute;lectionn&eacute;e, le serveur DAS copie le logiciel GlassFish Server &agrave; partir de l'h&ocirc;te de serveur DAS vers l'h&ocirc;te du noeud. Pour copier le logiciel GlassFish Server vers l'h&ocirc;te, le serveur DAS doit &ecirc;tre capable de contacter l'h&ocirc;te via DCOM.</p>
</dd>
<dt>Forcer</dt>
<dd>
<p>Si l'option Activ&eacute; est s&eacute;lectionn&eacute;e, le noeud est cr&eacute;&eacute; dans la configuration du serveur DAS m&ecirc;me si la validation des param&egrave;tres du noeud &eacute;choue. Pour valider les param&egrave;tres d'un noeud, le serveur DAS doit &ecirc;tre capable de contacter l'h&ocirc;te du noeud via DCOM.</p>
</dd>
<dt>Valider DCOM</dt>
<dd>
<p>Si l'option Activ&eacute; est s&eacute;lectionn&eacute;e, GlassFish Server teste la connexion via DCOM &agrave; l'h&ocirc;te du noeud avant de cr&eacute;er le noeud. Dans le cadre du test, GlassFish Server copie un script nomm&eacute; <code>delete_me.bat</code> vers l'h&ocirc;te.</p>
<p>Si vous s&eacute;lectionnez cette option, le champ R&eacute;pertoire de test distant est activ&eacute; pour vous permettre d'indiquer le r&eacute;pertoire dans lequel GlassFish Server doit copier le script.</p>
</dd>
<dt>R&eacute;pertoire de test distant</dt>
<dd>
<p>Dossier de l'h&ocirc;te distant dans lequel GlassFish Server doit cr&eacute;er le fichier <code>delete_me.bat</code>. L'utilisateur indiqu&eacute; par l'option Nom utilisateur Windows doit disposer d'un acc&egrave;s en &eacute;criture &agrave; ce dossier. Sinon, une erreur se produit. La valeur par d&eacute;faut est <code>C:\</code>.</p>
</dd>
<dt>Domaine Windows</dt>
<dd>
<p>Nom du domaine Windows contenant l'utilisateur indiqu&eacute; par l'option Nom utilisateur Windows. La valeur par d&eacute;faut est le nom de l'h&ocirc;te sur lequel la Console d'administration est en cours d'ex&eacute;cution.</p>
</dd>
<dt>Nom utilisateur Windows</dt>
<dd>
<p>Utilisateur sur l'h&ocirc;te de ce noeud qui doit ex&eacute;cuter le processus de connexion &agrave; l'h&ocirc;te via DCOM. La valeur par d&eacute;faut est l'utilisateur qui ex&eacute;cute le processus DAS. Si la valeur de l'option H&ocirc;te du noeud est <code>localhost-</code><i>domain</i>, l'option Nom utilisateur Windows n'est pas prise en compte.</p>
</dd>
<dt>Authentification de l'utilisateur Windows</dt>
<dd>
<p>Liste d&eacute;roulante permettant d'indiquer la mani&egrave;re dont l'utilisateur Windows est authentifi&eacute; lors de la connexion &agrave; l'h&ocirc;te de ce noeud. Les m&eacute;thodes possibles pour l'authentification sont les suivantes :</p>
<dl>
<dt>Mot de passe</dt>
<dd>
<p>L'utilisateur Windows est authentifi&eacute; par le biais d'un mot de passe stock&eacute; dans la configuration du serveur DAS.</p>

<hr>
<p><b>Attention:</b></p>
Ce mot de passe est stock&eacute; sous forme de texte en clair dans la configuration du serveur DAS. Pour une s&eacute;curit&eacute; accrue, utilisez un alias de mot de passe.
<hr>

<p>Si vous s&eacute;lectionnez cette option, le champ Mot de passe utilisateur Windows est activ&eacute; pour vous permettre d'indiquer le mot de passe.</p>
</dd>
<dt>Alias de mot de passe</dt>
<dd>
<p>L'utilisateur Windows est authentifi&eacute; par le biais d'un alias de mot de passe. Si vous s&eacute;lectionnez cette option, choisissez l'alias de mot de passe dans la liste d&eacute;roulante correspondante.</p>
</dd>
</dl>
</dd>
<dt>Mot de passe utilisateur Windows</dt>
<dd>
<p>Mot de passe que l'utilisateur Windows doit utiliser lors de la connexion &agrave; l'h&ocirc;te de ce noeud.</p>
</dd>
<dt>Alias de mot de passe</dt>
<dd>
<p>Liste d&eacute;roulante des alias de mot de passe d&eacute;finis pour ce domaine.</p>
</dd>
</dl>
<a id="sthref310" name="sthref310"></a>
<h5>Options suppl&eacute;mentaires pour les noeuds SSH</h5>
<p>Les options suivantes sont disponibles uniquement si le champ Type a la valeur SSH :</p>
<dl>
<dt>Installer GlassFish Server</dt>
<dd>
<p>Si l'option Activ&eacute; est s&eacute;lectionn&eacute;e, le serveur DAS copie le logiciel GlassFish Server &agrave; partir de l'h&ocirc;te de serveur DAS vers l'h&ocirc;te du noeud. Pour copier le logiciel GlassFish Server vers l'h&ocirc;te, le serveur DAS doit &ecirc;tre capable de contacter l'h&ocirc;te via SSH.</p>
</dd>
<dt>Forcer</dt>
<dd>
<p>Si l'option Activ&eacute; est s&eacute;lectionn&eacute;e, le noeud est cr&eacute;&eacute; dans la configuration du serveur DAS m&ecirc;me si la validation des param&egrave;tres du noeud &eacute;choue. Pour valider les param&egrave;tres d'un noeud, le serveur DAS doit &ecirc;tre capable de contacter l'h&ocirc;te du noeud via SSH.</p>
</dd>
<dt>Port SSH</dt>
<dd>
<p>Port &agrave; utiliser pour les connexions SSH &agrave; l'h&ocirc;te de ce noeud. La valeur par d&eacute;faut est 22. Si la valeur de l'option H&ocirc;te du noeud est <code>localhost-</code><i>domain</i>, l'option Port SSH n'est pas prise en compte.</p>
</dd>
<dt>Nom utilisateur SSH</dt>
<dd>
<p>Utilisateur sur l'h&ocirc;te de ce noeud qui doit ex&eacute;cuter le processus de connexion &agrave; l'h&ocirc;te via SSH. La valeur par d&eacute;faut est l'utilisateur qui ex&eacute;cute le processus DAS. Pour garantir que le serveur DAS puisse lire le fichier de cl&eacute;s priv&eacute;es SSH de l'utilisateur, indiquez l'utilisateur qui ex&eacute;cute le processus DAS. Si la valeur de l'option H&ocirc;te du noeud est <code>localhost-</code><i>domain</i>, l'option Nom utilisateur n'est pas prise en compte.</p>
</dd>
<dt>Authentification de l'utilisateur SSH</dt>
<dd>
<p>Liste d&eacute;roulante permettant d'indiquer la mani&egrave;re dont l'utilisateur SSH est authentifi&eacute; lors de la connexion &agrave; l'h&ocirc;te de ce noeud. Les m&eacute;thodes possibles pour l'authentification sont les suivantes :</p>
<dl>
<dt>Fichier de cl&eacute;s</dt>
<dd>
<p>L'utilisateur SSH est authentifi&eacute; via un fichier de cl&eacute;s priv&eacute;es SSH. Si vous s&eacute;lectionnez cette option, sp&eacute;cifiez le chemin d'acc&egrave;s absolu au fichier dans le champ Fichier de cl&eacute;s.</p>
</dd>
<dt>Mot de passe</dt>
<dd>
<p>L'utilisateur SSH est authentifi&eacute; via un mot de passe stock&eacute; dans la configuration du serveur DAS.</p>

<hr>
<p><b>Attention:</b></p>
Ce mot de passe est stock&eacute; sous forme de texte en clair dans la configuration du serveur DAS. Pour une s&eacute;curit&eacute; accrue, utilisez un fichier de cl&eacute;s ou un alias de mot de passe.
<hr>

<p>Si vous s&eacute;lectionnez cette option, le champ Mot de passe utilisateur SSH est activ&eacute; pour vous permettre d'indiquer le mot de passe.</p>
</dd>
<dt>Alias de mot de passe</dt>
<dd>
<p>L'utilisateur SSH est authentifi&eacute; via un alias de mot de passe. Si vous s&eacute;lectionnez cette option, choisissez l'alias de mot de passe dans la liste d&eacute;roulante correspondante.</p>
</dd>
</dl>
</dd>
<dt>Configurer SSH</dt>
<dd>
<p>Si l'option Activ&eacute; est s&eacute;lectionn&eacute;e, GlassFish Server configure une cl&eacute; SSH sur l'h&ocirc;te du noeud. GlassFish Server configure la cl&eacute; SSH en copiant les fichiers de cl&eacute;s existants &agrave; partir de l'h&ocirc;te de serveur DAS ou, si n&eacute;cessaire, en g&eacute;n&eacute;rant les fichiers avant de les copier. Cette option est disponible uniquement si l'option Authentification de l'utilisateur SSH a la valeur Fichier de cl&eacute;s.</p>
</dd>
<dt>G&eacute;n&eacute;rer une cl&eacute;</dt>
<dd>
<p>Si l'option Activ&eacute; est s&eacute;lectionn&eacute;e, GlassFish Server g&eacute;n&egrave;re les fichiers de cl&eacute;s SSH avant de les copier sur l'h&ocirc;te du noeud si les fichiers n'existent pas. Si les fichiers de cl&eacute;s SSH existent, GlassFish Server ne g&eacute;n&egrave;re pas les fichiers, m&ecirc;me si l'option Activ&eacute; est s&eacute;lectionn&eacute;e.</p>

<hr>
<p><b>Remarque:</b></p>
Si les fichiers de cl&eacute;s SSH n'existent pas, vous devez s&eacute;lectionner l'option Activ&eacute;. Sinon, une erreur se produit lorsque vous tentez d'enregistrer les modifications.
<hr>

</dd>
<dt>Mot de passe utilisateur SSH</dt>
<dd>
<p>Mot de passe que l'utilisateur SSH doit utiliser lors de la connexion &agrave; l'h&ocirc;te de ce noeud.</p>
</dd>
<dt>Alias de mot de passe</dt>
<dd>
<p>Liste d&eacute;roulante des alias de mot de passe d&eacute;finis pour ce domaine.</p>
</dd>
<dt>Fichier de cl&eacute;s publiques</dt>
<dd>
<p>Chemin d'acc&egrave;s absolu au fichier de cl&eacute;s publiques SSH sp&eacute;cifi&eacute; par l'option Nom utilisateur SSH. Le contenu du fichier de cl&eacute;s publiques est ajout&eacute; &agrave; la fin du fichier <code>.ssh/authorized_keys</code> de l'utilisateur sur l'h&ocirc;te du noeud. Si le fichier <code>.ssh/authorized_keys</code> n'existe pas sur l'h&ocirc;te, GlassFish Server le cr&eacute;e.</p>
</dd>
<dt>Fichier de cl&eacute;s</dt>
<dd>
<p>Chemin d'acc&egrave;s absolu au fichier de cl&eacute;s priv&eacute;es SSH sp&eacute;cifi&eacute; par l'option Nom utilisateur SSH. Ce fichier est utilis&eacute; pour l'authentification aupr&egrave;s du d&eacute;mon <code>sshd</code> sur l'h&ocirc;te du noeud.</p>

<hr>
<p><b>Remarque:</b></p>
GlassFish Server prend &eacute;galement en charge l'authentification par mot de passe via l'entr&eacute;e <code>AS_ADMIN_SSHPASSWORD</code> dans le fichier de mots de passe. Le fichier de mots de passe est sp&eacute;cifi&eacute; dans l'option <code>-paswordfile</code> de l'utilitaire <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00263"><code>asadmin</code>(1)</a>.
<hr>

<p>Si le fichier de cl&eacute;s priv&eacute;es SSH est prot&eacute;g&eacute; par une phrase secr&egrave;te, le fichier de mots de passe doit contenir l'entr&eacute;e <code>AS_ADMIN_SSHKEYPASSPHRASE</code>.</p>
<p>Le serveur DAS doit disposer de droits d'acc&egrave;s et de lecture sur le fichier de cl&eacute;s.</p>
<p>La valeur par d&eacute;faut est un fichier de cl&eacute;s plac&eacute; dans le r&eacute;pertoire <code>.ssh</code> de l'utilisateur. Si plusieurs fichiers de cl&eacute;s sont disponibles, GlassFish Server utilise l'ordre de pr&eacute;f&eacute;rence suivant :</p>
<ol>
<li>
<p><code>id_rsa</code></p>
</li>
<li>
<p><code>id_dsa</code></p>
</li>
<li>
<p><code>identity</code></p>
</li>
</ol>
</dd>
</dl>
<a id="sthref311" name="sthref311"></a>
<h5>T&acirc;ches connexes</h5>
<p><a href="task-createnode.html">Cr&eacute;ation d'un noeud</a></p>
<a id="sthref312" name="sthref312"></a>
<h5>Sous-commandes asadmin &eacute;quivalentes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00047"><code>create-node-config</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM510"><code>create-node-dcom</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00048"><code>create-node-ssh</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00229"><code>setup-ssh</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM796"><code>validate-dcom</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
