<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-standaloneinstancenew" name="ref-standaloneinstancenew"></a></p>

<h4><a id="sthref324" name="sthref324"></a><a id="sthref325" name="sthref325"></a><a id="sthref326" name="sthref326"></a>Nouvelle instance de serveur autonome</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Nouvelle instance de serveur autonome permet de cr&eacute;er une instance GlassFish Server autonome.</p>
<p>Elle contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Nom d'instance</dt>
<dd>
<p>Nom de l'instance en cours de cr&eacute;ation.</p>
<p>Le nom doit respecter les exigences suivantes :</p>
<ul>
<li>
<p>Il ne peut contenir que des caract&egrave;res ASCII.</p>
</li>
<li>
<p>Il doit commencer par une lettre, un chiffre ou un trait de soulignement.</p>
</li>
<li>
<p>Il ne peut contenir que les caract&egrave;res suivants :</p>
<ul>
<li>
<p>Lettres minuscules</p>
</li>
<li>
<p>Lettres majuscules</p>
</li>
<li>
<p>Chiffres</p>
</li>
<li>
<p>Trait d'union</p>
</li>
<li>
<p>Point</p>
</li>
<li>
<p>Trait de soulignement</p>
</li>
</ul>
</li>
<li>
<p>Le nom doit &ecirc;tre unique dans le domaine et ne doit pas appartenir &agrave; une autre instance GlassFish Server, &agrave; une configuration nomm&eacute;e, &agrave; un cluster ou &agrave; un noeud.</p>
</li>
<li>
<p>Il ne doit pas &ecirc;tre <code>domain</code>, <code>server</code> ou tout autre mot-cl&eacute; r&eacute;serv&eacute; par GlassFish Server.</p>
</li>
</ul>
</dd>
<dt>Noeud</dt>
<dd>
<p>Liste d&eacute;roulante des noeuds existants d&eacute;finissant les h&ocirc;tes sur lesquels l'instance peut r&eacute;sider. Vous devez s&eacute;lectionner un noeud dans la liste. Si vous devez cr&eacute;er l'instance sur l'h&ocirc;te h&eacute;bergeant le serveur d'administration de domaine (DAS), s&eacute;lectionnez le noeud pr&eacute;d&eacute;fini <code>localhost-</code><i>domain</i>.</p>
</dd>
<dt>Configuration</dt>
<dd>
<p>Liste d&eacute;roulante des configurations nomm&eacute;es existantes pouvant &ecirc;tre utilis&eacute;es par l'instance. Vous devez s&eacute;lectionner une configuration dans la liste. L'instance utilise la configuration s&eacute;lectionn&eacute;e lors de sa cr&eacute;ation.</p>
</dd>
<dt>Cr&eacute;er une copie de la configuration s&eacute;lectionn&eacute;e</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, la configuration choisie est copi&eacute;e lors de la cr&eacute;ation de l'instance. Le nom <i>instance-name</i><code>-config</code> est affect&eacute; &agrave; la copie de la configuration, <i>instance-name</i> &eacute;tant le nom de l'instance tel que vous l'avez saisi dans le champ Nom d'instance.</p>
<p>Si <code>default-config</code> est s&eacute;lectionn&eacute; dans la liste d&eacute;roulante Configuration, vous devez choisir cette option. La configuration <code>default-config</code> peut &ecirc;tre copi&eacute;e, mais pas utilis&eacute;e comme r&eacute;f&eacute;rence.</p>
</dd>
<dt>Utiliser la configuration s&eacute;lectionn&eacute;e comme r&eacute;f&eacute;rence</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, l'instance utilise la configuration nomm&eacute;e existante indiqu&eacute;e.</p>
<p>Si <code>default-config</code> est s&eacute;lectionn&eacute; dans la liste d&eacute;roulante Configuration, vous ne devez <i>pas</i> choisir cette option. La configuration <code>default-config</code> peut &ecirc;tre copi&eacute;e, mais pas utilis&eacute;e comme r&eacute;f&eacute;rence.</p>
</dd>
</dl>
<a id="sthref327" name="sthref327"></a>
<h5>T&acirc;ches connexes</h5>
<p><a href="task-create-standalone-instance.html">Cr&eacute;ation d'une instance GlassFish Server autonome</a></p>
<a id="sthref328" name="sthref328"></a>
<h5>Sous-commande asadmin &eacute;quivalente</h5>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00033"><code>create-instance</code>(1)</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
