<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-standaloneinstanceapplications" name="ref-standaloneinstanceapplications"></a><a id="GHCLU00021" name="GHCLU00021"></a></p>

<h4><a id="sthref334" name="sthref334"></a><a id="sthref335" name="sthref335"></a>Applications</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Applications permet d'effectuer les t&acirc;ches suivantes sur l'instance GlassFish Server autonome s&eacute;lectionn&eacute;e :</p>
<ul>
<li>
<p>Affichage et gestion des applications d&eacute;j&agrave; d&eacute;ploy&eacute;es vers l'instance</p>
</li>
<li>
<p>D&eacute;ploiement de davantage d'applications vers l'instance</p>
</li>
</ul>
<p>Le champ Nom d'instance est en lecture seule. Il indique le nom de l'instance en cours.</p>
<p>La page Applications pr&eacute;sente la liste des applications d&eacute;ploy&eacute;es vers l'instance s&eacute;lectionn&eacute;e. Pour chaque application, les informations suivantes sont fournies :</p>
<dl>
<dt>Nom</dt>
<dd>
<p>Nom de l'application.</p>
<p>Le nom peut &ecirc;tre suivi d'un identificateur de version facultatif dont il est s&eacute;par&eacute; par un signe deux-points (<code>:</code>). Pour plus d'informations sur les versions des modules et des applications, reportez-vous &agrave; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> dans le manuel <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt>Activ&eacute;</dt>
<dd>
<p>Mention indiquant si l'application est activ&eacute;e :</p>
<ul>
<li>
<p>Si l'application est activ&eacute;e, une coche (&#10003;) s'affiche.</p>
</li>
<li>
<p>Si l'application est d&eacute;sactiv&eacute;e, une croix (&#10007;) s'affiche.</p>
</li>
</ul>
</dd>
<dt>EC activ&eacute;</dt>
<dd>
<p>Mention indiquant si l'application est activ&eacute;e pour l'&eacute;quilibrage de charge :</p>
<ul>
<li>
<p>Si l'application est activ&eacute;e pour l'&eacute;quilibrage de charge, une coche (&#10003;) s'affiche.</p>
</li>
<li>
<p>Si l'application est d&eacute;sactiv&eacute;e pour l'&eacute;quilibrage de charge, une croix (&#10007;) s'affiche.</p>
</li>
</ul>
</dd>
<dt>Moteurs</dt>
<dd>
<p>Types de conteneur utilis&eacute; par l'application. Voici les diff&eacute;rents types de conteneur :</p>
<ul>
<li>
<p><code>web</code></p>
</li>
<li>
<p><code>webservices</code></p>
</li>
<li>
<p><code>ejb</code></p>
</li>
<li>
<p><code>connector</code></p>
</li>
<li>
<p><code>appclient</code></p>
</li>
<li>
<p><code>weld</code> : conteneur Contexts and Dependency Injection des applications Java EE Platform</p>
</li>
</ul>
</dd>
</dl>
<p>La table Applications d&eacute;ploy&eacute;es contient &eacute;galement les options ci-apr&egrave;s.</p>
<dl>
<dt>D&eacute;ployer</dt>
<dd>
<p>Bouton permettant de d&eacute;ployer une application.</p>
</dd>
<dt>Annuler le d&eacute;ploiement</dt>
<dd>
<p>Bouton permettant d'annuler le d&eacute;ploiement des applications s&eacute;lectionn&eacute;es.</p>
<p>L'annulation du d&eacute;ploiement d'une application enl&egrave;ve l'application de toutes les cibles et du domaine. Lorsque le d&eacute;ploiement d'une application est annul&eacute;, l'application n'est plus r&eacute;pertori&eacute;e sur la page <a href="../../../common/en/help/ref-applications.html">Applications</a> qui affiche toutes les applications d&eacute;ploy&eacute;es dans GlassFish Server.</p>
<p>Pour enlever des applications de la cible en cours uniquement, utilisez le bouton Enlever de cette page.</p>
</dd>
<dt>Enlever</dt>
<dd>
<p>Bouton permettant d'enlever les applications s&eacute;lectionn&eacute;es.</p>
<p>La suppression d'une application enl&egrave;ve l'application de la cible en cours uniquement. Lorsqu'une application est enlev&eacute;e d'une cible, elle reste r&eacute;pertori&eacute;e sur la page <a href="../../../common/en/help/ref-applications.html">Applications</a>, qui affiche toutes les applications d&eacute;ploy&eacute;es dans GlassFish Server. L'application reste &eacute;galement d&eacute;ploy&eacute;e sur les autres cibles sur lesquelles elle a &eacute;t&eacute; d&eacute;ploy&eacute;e.</p>
<p>Pour enlever des applications de toutes les cibles et du domaine, utilisez le bouton Annuler le d&eacute;ploiement sur cette page.</p>
</dd>
<dt>Plus d'actions</dt>
<dd>
<p>Liste d&eacute;roulante qui proc&egrave;de &agrave; d'autres actions sur les applications s&eacute;lectionn&eacute;es.</p>
<dl>
<dt>Activer</dt>
<dd>
<p>Active les applications s&eacute;lectionn&eacute;es.</p>
</dd>
<dt>D&eacute;sactiver</dt>
<dd>
<p>D&eacute;sactive les applications s&eacute;lectionn&eacute;es.</p>
</dd>
<dt>Equilibreur de charge activ&eacute;</dt>
<dd>
<p>Active les applications s&eacute;lectionn&eacute;es pour l'&eacute;quilibrage de charge.</p>
</dd>
<dt>Equilibreur de charge d&eacute;sactiv&eacute;</dt>
<dd>
<p>D&eacute;sactive les applications s&eacute;lectionn&eacute;es pour l'&eacute;quilibrage de charge.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref336" name="sthref336"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-standalone-instance-app-deploy.html">D&eacute;ploiement d'une application vers une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-list.html">Enum&eacute;ration des applications d&eacute;ploy&eacute;es vers une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-undeploy.html">Annulation du d&eacute;ploiement d'applications d'une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-remove.html">Suppression d'applications d'une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-edit.html">Modification d'une application d&eacute;ploy&eacute;e vers une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-enable-disable.html">Activation ou d&eacute;sactivation d'une application d&eacute;ploy&eacute;e vers une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-lb-enable-disable.html">Activation ou d&eacute;sactivation de l'&eacute;quilibrage de charge pour une application d&eacute;ploy&eacute;e vers une instance GlassFish Server autonome</a></p>
</li>
</ul>
<a id="sthref337" name="sthref337"></a>
<h5>Sous-commandes asadmin &eacute;quivalentes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00114"><code>deploy</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00116"><code>disable</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00118"><code>disable-http-lb-application</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00124"><code>enable</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00126"><code>enable-http-lb-application</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00148"><code>list-applications</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
