<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-gmscluster" name="task-gmscluster"></a></p>

<h4><a id="sthref220" name="sthref220"></a>Configuration de param&egrave;tres du service de gestion de groupes pour un cluster</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Le service de gestion de groupes (GMS) est un service inclus dans un processus offrant des services de surveillance de clusters, d'appartenance au cluster et de communication de groupe. Il ex&eacute;cute les fonctions suivantes :</p>
<ul>
<li>
<p>Il signale les modules inscrits dans une instance GlassFish Server lorsque des instances membres sont ajout&eacute;es &agrave; un cluster et enlev&eacute;es d'un cluster, ou lorsque leur &eacute;chec est suspect&eacute; ou a &eacute;t&eacute; confirm&eacute;.</p>
</li>
<li>
<p>Il permet l'envoi et la r&eacute;ception de messages entre les membres du cluster.</p>
</li>
</ul>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Clusters.</p>
</li>
<li>
<p>S&eacute;lectionnez le cluster pour lequel vous souhaitez configurer les param&egrave;tres du service de gestion de groupes (GMS).</p>
<p>La page Informations g&eacute;n&eacute;rales du cluster appara&icirc;t.</p>
</li>
<li>
<p>S&eacute;lectionnez la case Activ&eacute; du champ GMS pour activer le service GMS pour le cluster.</p>
<p>Cette option est s&eacute;lectionn&eacute;e par d&eacute;faut. Pour d&eacute;sactiver le service GMS pour le cluster, d&eacute;s&eacute;lectionnez la case Activ&eacute; du champ GMS.</p>
<p>Si cette option est activ&eacute;e, le service de gestion de groupes est d&eacute;marr&eacute; dans chaque instance de serveur du cluster et dans le serveur d'administration de domaine (DAS). Le serveur DAS se trouve dans chaque cluster dans lequel le service GMS est activ&eacute;.</p>
</li>
<li>
<p>Dans le champ Port de multidiffusion, indiquez le port utilis&eacute; par le service de gestion de groupes pour l'&eacute;coute des &eacute;v&eacute;nements de groupe.</p>
<p>Indiquez un num&eacute;ro de port UDP standard compris entre 2048 et 49151. La valeur par d&eacute;faut est g&eacute;n&eacute;r&eacute;e automatiquement dans cette plage.</p>
</li>
<li>
<p>Dans le champ Adresse de multidiffusion, entrez l'adresse utilis&eacute;e par le service de gestion de groupes pour l'&eacute;coute des &eacute;v&eacute;nements de groupe.</p>
<p>Sp&eacute;cifiez une adresse IP de multidiffusion de classe D. Les adresses IP de classe D sont comprises dans la plage <code>224.0.0.0</code> &agrave; <code>239.255.255.255</code> (inclus). L'adresse <code>224.0.0.0</code> est r&eacute;serv&eacute;e et ne doit pas &ecirc;tre utilis&eacute;e. La valeur par d&eacute;faut est 228.9.<i>XX</i>.<i>YY</i>, <i>XX</i> et <i>YY</i> &eacute;tant des valeurs ind&eacute;pendantes g&eacute;n&eacute;r&eacute;es automatiquement, comprises entre 0 et 255.</p>
</li>
<li>
<p>Dans le champ Adresse d'interface de liaison, entrez l'adresse de l'interface r&eacute;seau pour le service de gestion de groupes, s'il y en a plusieurs.</p>
<p>Ce param&egrave;tre permet de configurer les interfaces r&eacute;seau utilis&eacute;es pour le service GMS, s'il en existe plusieurs, sur les ordinateurs h&eacute;bergeant les instances de serveur dans le cluster. Cette valeur doit &ecirc;tre une adresse IP d'interface r&eacute;seau locale. Par d&eacute;faut, toutes les adresses d'interface r&eacute;seau publique sont utilis&eacute;es.</p>
<p>Afin de sp&eacute;cifier une adresse valide pour toutes les instances GlassFish Server du cluster, utilisez une propri&eacute;t&eacute; syst&egrave;me pour d&eacute;finir l'adresse de chaque instance s&eacute;par&eacute;ment.</p>
<p>Par exemple, cr&eacute;ez la propri&eacute;t&eacute; syst&egrave;me <code>GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i> sur le serveur DAS. D&eacute;finissez ensuite l'option Adresse d'interface de liaison sur <code>${GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i><code>}</code> pour sp&eacute;cifier la propri&eacute;t&eacute; syst&egrave;me. Enfin, pour chaque instance du cluster, d&eacute;finissez la propri&eacute;t&eacute; syst&egrave;me <code>GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i> sur l'adresse d'interface r&eacute;seau requise sur l'ordinateur de l'instance.</p>
</li>
<li>
<p>Pour sp&eacute;cifier d'autres propri&eacute;t&eacute;s, s&eacute;lectionnez l'onglet Propri&eacute;t&eacute;s et le sous-onglet Propri&eacute;t&eacute;s de cluster.</p>
<ul>
<li>
<p>Pour ajouter une propri&eacute;t&eacute;, cliquez sur le bouton Ajouter une propri&eacute;t&eacute;. Sur la ligne vide qui appara&icirc;t, saisissez le nom de la propri&eacute;t&eacute; dans le champ Nom et la valeur de la propri&eacute;t&eacute; dans le champ Valeur.</p>
</li>
<li>
<p>Pour modifier une propri&eacute;t&eacute;, modifiez le champ Valeur de cette propri&eacute;t&eacute;.</p>
</li>
<li>
<p>Pour supprimer une propri&eacute;t&eacute;, s&eacute;lectionnez la case situ&eacute;e &agrave; gauche du champ Nom de la propri&eacute;t&eacute; &agrave; supprimer, puis cliquez sur le bouton Supprimer des propri&eacute;t&eacute;s.</p>
</li>
</ul>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>
</li>
</ol>
<a id="sthref221" name="sthref221"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-gmsenable.html">Activation du service de gestion de groupes</a></p>
</li>
<li>
<p><a href="task-gms.html">Configuration du service de gestion de groupes</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
