<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-standalone-instance-resource-display" name="task-standalone-instance-resource-display"></a><a id="GHCLU00070" name="GHCLU00070"></a></p>

<h4><a id="sthref179" name="sthref179"></a><a id="sthref180" name="sthref180"></a>Enum&eacute;ration des ressources pour une instance GlassFish Server autonome</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, s&eacute;lectionnez le noeud Instances autonomes.</p>
<p>La page Instances de serveur autonomes appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Instances de serveur autonomes, s&eacute;lectionnez l'instance.</p>
<p>La page Informations g&eacute;n&eacute;rales de l'instance appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Informations g&eacute;n&eacute;rales, cliquez sur l'onglet Ressources.</p>
<p>La page Ressources de l'instance appara&icirc;t.</p>
</li>
<li>
<p>Pour afficher uniquement les ressources d'un type particulier, s&eacute;lectionnez le type de ressource &agrave; afficher dans la liste d&eacute;roulante Filtre.</p>
</li>
</ol>
<a id="sthref181" name="sthref181"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-create-standalone-instance.html">Cr&eacute;ation d'une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-delete-standalone-instances.html">Suppression d'instances GlassFish Server autonomes</a></p>
</li>
<li>
<p><a href="task-start-standalone-instances.html">D&eacute;marrage d'instances GlassFish Server autonomes</a></p>
</li>
<li>
<p><a href="task-stop-standalone-instances.html">Arr&ecirc;t d'instances GlassFish Server autonomes</a></p>
</li>
<li>
<p><a href="task-view-logs-standalone-instance.html">Affichage des fichiers journaux pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-recovertransactions-standalone-instance.html">R&eacute;cup&eacute;ration des transactions pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-deploy.html">D&eacute;ploiement d'une application vers une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-list.html">Enum&eacute;ration des applications d&eacute;ploy&eacute;es vers une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-undeploy.html">Annulation du d&eacute;ploiement d'applications d'une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-remove.html">Suppression d'applications d'une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-edit.html">Modification d'une application d&eacute;ploy&eacute;e vers une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-enable-disable.html">Activation ou d&eacute;sactivation d'une application d&eacute;ploy&eacute;e vers une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-lb-enable-disable.html">Activation ou d&eacute;sactivation de l'&eacute;quilibrage de charge pour une application d&eacute;ploy&eacute;e vers une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-create.html">Cr&eacute;ation d'une ressource pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-enable-disable.html">Activation ou d&eacute;sactivation d'une ressource pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-edit.html">Modification d'une ressource pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-change-standalone-instance-ports.html">Modification des num&eacute;ros de port d'une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-set-props-standalone-instance.html">D&eacute;finition de propri&eacute;t&eacute;s propres &agrave; l'instance pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-mon-app-standalone-instance.html">Affichage des donn&eacute;es de surveillance d'application pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-mon-server-standalone-instance.html">Affichage des donn&eacute;es de surveillance de serveur virtuel pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-mon-resource-standalone-instance.html">Affichage des donn&eacute;es de surveillance de ressource pour une instance GlassFish Server autonome</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
