<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-mon-app-clustered-instance" name="task-mon-app-clustered-instance"></a></p>

<h4><a id="sthref103" name="sthref103"></a><a id="sthref104" name="sthref104"></a><a id="sthref105" name="sthref105"></a><a id="sthref106" name="sthref106"></a><a id="sthref107" name="sthref107"></a>Affichage des donn&eacute;es de surveillance d'application pour une instance GlassFish Server incluse dans un cluster</h4>
<a name="BEGIN" id="BEGIN"></a><a id="sthref108" name="sthref108"></a>
<h5>Avant de commencer</h5>
<p>Avant d'afficher les donn&eacute;es de surveillance, vous devez <a href="../../../common/en/help/task-confmonitor.html">configurer le service de surveillance</a>.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Clusters.</p>
</li>
<li>
<p>Sous le noeud Clusters d&eacute;velopp&eacute;, s&eacute;lectionnez le noeud correspondant au cluster.</p>
<p>La page Informations g&eacute;n&eacute;rales du cluster appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Informations g&eacute;n&eacute;rales, cliquez sur l'onglet Instances.</p>
<p>La page Instances de serveur clusteris&eacute;es du cluster appara&icirc;t.</p>
</li>
<li>
<p>S&eacute;lectionnez l'instance pour laquelle vous souhaitez afficher les donn&eacute;es de surveillance d'application.</p>
<p>La page Informations g&eacute;n&eacute;rales de l'instance appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Informations g&eacute;n&eacute;rales, cliquez sur l'onglet Surveiller.</p>
<p>La page Surveillance d'application appara&icirc;t.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Afficher, s&eacute;lectionnez l'application pour laquelle vous souhaitez afficher les donn&eacute;es de surveillance.</p>
</li>
<li>
<p>Pour mettre &agrave; jour les donn&eacute;es de surveillance affich&eacute;es, cliquez sur Actualiser.</p>
</li>
</ol>
<a id="sthref109" name="sthref109"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="../../../common/en/help/task-confmonitor.html">Configuration du service de surveillance</a></p>
</li>
<li>
<p><a href="task-create-clustered-instance.html">Ajout d'une instance GlassFish Server &agrave; un cluster</a></p>
</li>
<li>
<p><a href="task-delete-clustered-instances.html">Suppression d'instances GlassFish Server incluses dans un cluster</a></p>
</li>
<li>
<p><a href="task-start-clustered-instances.html">D&eacute;marrage d'instances GlassFish Server incluses dans un cluster</a></p>
</li>
<li>
<p><a href="task-stop-clustered-instances.html">Arr&ecirc;t d'instances GlassFish Server incluses dans un cluster</a></p>
</li>
<li>
<p><a href="task-view-logs-clustered-instance.html">Affichage des fichiers journaux pour une instance GlassFish Server incluse dans un cluster</a></p>
</li>
<li>
<p><a href="task-recovertransactions.html">R&eacute;cup&eacute;ration des transactions pour une instance GlassFish Server incluse dans un cluster</a></p>
</li>
<li>
<p><a href="task-change-clustered-instance-ports.html">Modification des num&eacute;ros de port d'une instance GlassFish Server incluse dans un cluster</a></p>
</li>
<li>
<p><a href="task-set-props-clustered-instance.html">D&eacute;finition de propri&eacute;t&eacute;s propres &agrave; l'instance pour une instance GlassFish Server incluse dans un cluster</a></p>
</li>
<li>
<p><a href="task-mon-server-clustered-instance.html">Affichage des donn&eacute;es de surveillance de serveur virtuel pour une instance GlassFish Server incluse dans un cluster</a></p>
</li>
<li>
<p><a href="task-mon-resource-clustered-instance.html">Affichage des donn&eacute;es de surveillance de ressource pour une instance GlassFish Server incluse dans un cluster</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
