<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-create-standalone-instance" name="task-create-standalone-instance"></a></p>

<h4><a id="sthref122" name="sthref122"></a><a id="sthref123" name="sthref123"></a><a id="sthref124" name="sthref124"></a>Cr&eacute;ation d'une instance GlassFish Server autonome</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Les instances GlassFish Server forment la base d'un d&eacute;ploiement d'application. Une instance autonome n'est pas un membre d'un cluster. Chacune instance appartient &agrave; un domaine unique et poss&egrave;de une structure de r&eacute;pertoire, une configuration et des applications d&eacute;ploy&eacute;es qui lui est propre. Chaque instance comprend &eacute;galement le conteneur Web Java Platform, Enterprise Edition (Java EE) et le conteneur Enterprise JavaBeans (technologie EJB). Chaque nouvelle instance doit contenir une r&eacute;f&eacute;rence &agrave; un noeud qui d&eacute;finit l'h&ocirc;te sur lequel elle r&eacute;sidera.</p>

<hr>
<p><b>Remarque:</b></p>
Pour cr&eacute;er une instance sur un noeud de type CONFIG repr&eacute;sentant un h&ocirc;te distant, vous devez utiliser la sous-commande <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00044"><code>create-local-instance</code>(1)</a>. Vous ne pouvez pas utiliser la Console d'administration &agrave; cet effet.
<hr>

<a id="sthref125" name="sthref125"></a>
<h5>Avant de commencer</h5>
<p>Assurez-vous que le noeud sur lequel l'instance r&eacute;sidera existe. Pour plus d'informations, reportez-vous &agrave; <a href="task-createnode.html">Cr&eacute;ation d'un noeud</a>.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, s&eacute;lectionnez le noeud Instances autonomes.</p>
<p>La page Instances de serveur autonomes appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Instances de serveur autonomes, cliquez sur Nouveau.</p>
<p>La page Nouvelle instance de serveur autonome appara&icirc;t.</p>
</li>
<li>
<p>Dans le champ Nom, saisissez le nom de l'instance.</p>
<p>Le nom doit respecter les exigences suivantes :</p>
<ul>
<li>
<p>Il ne peut contenir que des caract&egrave;res ASCII.</p>
</li>
<li>
<p>Il doit commencer par une lettre, un chiffre ou un trait de soulignement.</p>
</li>
<li>
<p>Il ne peut contenir que les caract&egrave;res suivants :</p>
<ul>
<li>
<p>Lettres minuscules</p>
</li>
<li>
<p>Lettres majuscules</p>
</li>
<li>
<p>Chiffres</p>
</li>
<li>
<p>Trait d'union</p>
</li>
<li>
<p>Point</p>
</li>
<li>
<p>Trait de soulignement</p>
</li>
</ul>
</li>
<li>
<p>Le nom doit &ecirc;tre unique dans le domaine et ne doit pas appartenir &agrave; une autre instance GlassFish Server, &agrave; une configuration nomm&eacute;e, &agrave; un cluster ou &agrave; un noeud.</p>
</li>
<li>
<p>Il ne doit pas &ecirc;tre <code>domain</code>, <code>server</code> ou tout autre mot-cl&eacute; r&eacute;serv&eacute; par GlassFish Server.</p>
</li>
</ul>
</li>
<li>
<p>Dans la liste d&eacute;roulante Noeud, s&eacute;lectionnez le noeud sur lequel l'instance r&eacute;sidera.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Configuration, s&eacute;lectionnez la configuration nomm&eacute;e que l'instance utilisera.</p>

<hr>
<p><b>Remarque:</b></p>
Si vous s&eacute;lectionnez <code>default-config</code>, vous devez sp&eacute;cifier &agrave; l'&eacute;tape suivante que la configuration n'est <i>pas</i> partag&eacute;e. La configuration <code>default-config</code> ne peut pas &ecirc;tre partag&eacute;e.
<hr>

</li>
<li>
<p>Indiquez si la configuration que l'instance va utiliser est partag&eacute;e.</p>
<ul>
<li>
<p>Si la configuration n'est pas partag&eacute;e, laissez l'option Cr&eacute;er une copie de la configuration s&eacute;lectionn&eacute;e coch&eacute;e.</p>
<p>La configuration s&eacute;lectionn&eacute;e sera ainsi copi&eacute;e lors de la cr&eacute;ation de l'instance. Le nom <i>instance-name</i><code>-config</code> est affect&eacute; &agrave; la copie de la configuration, <i>instance-name</i> correspondant au nom de l'instance que vous cr&eacute;ez.</p>
</li>
<li>
<p>Si la configuration est partag&eacute;e, s&eacute;lectionnez l'option Utiliser la configuration s&eacute;lectionn&eacute;e comme r&eacute;f&eacute;rence.</p>
<p>L'instance utilisera la configuration nomm&eacute;e existante indiqu&eacute;e.</p>
</li>
</ul>
</li>
<li>
<p>Cliquez sur OK.</p>
</li>
</ol>
<a id="sthref126" name="sthref126"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-delete-standalone-instances.html">Suppression d'instances GlassFish Server autonomes</a></p>
</li>
<li>
<p><a href="task-start-standalone-instances.html">D&eacute;marrage d'instances GlassFish Server autonomes</a></p>
</li>
<li>
<p><a href="task-stop-standalone-instances.html">Arr&ecirc;t d'instances GlassFish Server autonomes</a></p>
</li>
<li>
<p><a href="task-view-logs-standalone-instance.html">Affichage des fichiers journaux pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-recovertransactions-standalone-instance.html">R&eacute;cup&eacute;ration des transactions pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-deploy.html">D&eacute;ploiement d'une application vers une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-list.html">Enum&eacute;ration des applications d&eacute;ploy&eacute;es vers une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-undeploy.html">Annulation du d&eacute;ploiement d'applications d'une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-remove.html">Suppression d'applications d'une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-edit.html">Modification d'une application d&eacute;ploy&eacute;e vers une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-enable-disable.html">Activation ou d&eacute;sactivation d'une application d&eacute;ploy&eacute;e vers une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-lb-enable-disable.html">Activation ou d&eacute;sactivation de l'&eacute;quilibrage de charge pour une application d&eacute;ploy&eacute;e vers une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-create.html">Cr&eacute;ation d'une ressource pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-display.html">Enum&eacute;ration des ressources pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-enable-disable.html">Activation ou d&eacute;sactivation d'une ressource pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-edit.html">Modification d'une ressource pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-change-standalone-instance-ports.html">Modification des num&eacute;ros de port d'une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-set-props-standalone-instance.html">D&eacute;finition de propri&eacute;t&eacute;s propres &agrave; l'instance pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-mon-app-standalone-instance.html">Affichage des donn&eacute;es de surveillance d'application pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-mon-server-standalone-instance.html">Affichage des donn&eacute;es de surveillance de serveur virtuel pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-mon-resource-standalone-instance.html">Affichage des donn&eacute;es de surveillance de ressource pour une instance GlassFish Server autonome</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
