<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-config-sys-properties-defaults" name="task-config-sys-properties-defaults"></a><a id="GHCLU00086" name="GHCLU00086"></a></p>

<h4>D&eacute;finition des valeurs par d&eacute;faut des propri&eacute;t&eacute;s syst&egrave;me de configuration</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Les valeurs par d&eacute;faut des propri&eacute;t&eacute;s de configuration sont d&eacute;finies dans la configuration que le cluster ou l'instance r&eacute;f&eacute;rence.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud de la configuration.</p>
</li>
<li>
<p>Dans la liste des types de propri&eacute;t&eacute; sous le noeud d&eacute;velopp&eacute;, s&eacute;lectionnez Propri&eacute;t&eacute;s syst&egrave;me.</p>
<p>La page Propri&eacute;t&eacute;s syst&egrave;me pour la configuration s&eacute;lectionn&eacute;e appara&icirc;t.</p>
<p>Cette page affiche les valeurs en cours des propri&eacute;t&eacute;s syst&egrave;me suivantes pour la configuration :</p>
<ul>
<li>
<p><a href="../../../common/en/help/ref-predefinedconfigsysproperties.html">Num&eacute;ros de port pr&eacute;d&eacute;finis lors de la cr&eacute;ation de la configuration</a></p>
</li>
<li>
<p>Propri&eacute;t&eacute;s personnalis&eacute;es ajout&eacute;es &agrave; la configuration, le cas &eacute;ch&eacute;ant</p>
</li>
</ul>
</li>
<li>
<p>Pour vous assurer que vos modifications sont appliqu&eacute;es sans red&eacute;marrer le cluster ou l'instance, s&eacute;lectionnez l'option Reconfiguration dynamique.</p>
</li>
<li>
<p>Indiquez la nouvelle valeur de chaque propri&eacute;t&eacute; pour laquelle vous d&eacute;finissez une valeur par d&eacute;faut dans le champ Valeur par d&eacute;faut.</p>
</li>
<li>
<p>D&eacute;finissez les valeurs par d&eacute;faut des propri&eacute;t&eacute;s suppl&eacute;mentaires requises.</p>
<ol type="a">
<li>
<p>Dans la table Autres propri&eacute;t&eacute;s, cliquez sur Ajouter une propri&eacute;t&eacute;.</p>
<p>Une ligne est ajout&eacute;e &agrave; la table Autres propri&eacute;t&eacute;s.</p>
</li>
<li>
<p>Dans le champ Nom de la variable d'instance, entrez le nom de la propri&eacute;t&eacute;.</p>
</li>
<li>
<p>Dans le champ Valeur par d&eacute;faut, entrez la valeur.</p>
</li>
</ol>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>
</li>
</ol>
<a id="sthref243" name="sthref243"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-change-clustered-instance-ports.html">Modification des num&eacute;ros de port d'une instance GlassFish Server incluse dans un cluster</a></p>
</li>
<li>
<p><a href="task-change-standalone-instance-ports.html">Modification des num&eacute;ros de port d'une instance GlassFish Server autonome</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
