<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-nodenewssh" name="task-nodenewssh"></a></p>
<!-- infolevel="all" infotype="General" -->
<h4>Ach&egrave;vement de la cr&eacute;ation d'un noeud SSH</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Cette t&acirc;che constitue la suite de la proc&eacute;dure <a href="task-createnode.html">Cr&eacute;ation d'un noeud</a> pour un noeud SSH.</p>
<ol>
<li>
<p>Pour copier le logiciel GlassFish Server &agrave; partir de l'h&ocirc;te de serveur DAS vers l'h&ocirc;te du noeud, activez l'option Installer GlassFish Server.</p>
</li>
<li>
<p>Pour forcer la cr&eacute;ation du noeud dans la configuration du serveur d'administration de domaine (DAS) m&ecirc;me si la validation des param&egrave;tres du noeud &eacute;choue, activez l'option Forcer.</p>
</li>
<li>
<p>Dans le champ Port SSH, entrez le port &agrave; utiliser pour les connexions SSH &agrave; l'h&ocirc;te de ce noeud.</p>
</li>
<li>
<p>Dans le champ Nom utilisateur SSH, entrez le nom de l'utilisateur sur l'h&ocirc;te de ce noeud qui ex&eacute;cutera le processus de connexion &agrave; l'h&ocirc;te via SSH.</p>
</li>
<li>
<p>Sp&eacute;cifiez le mode d'authentification de l'utilisateur SSH lors de sa connexion &agrave; l'h&ocirc;te de ce noeud.</p>
<ul>
<li>
<p>Pour sp&eacute;cifier l'authentification via un fichier de cl&eacute;s priv&eacute;es SSH, proc&eacute;dez comme suit :</p>
<ol type="a">
<li>
<p>Dans la liste d&eacute;roulante Authentification de l'utilisateur SSH, s&eacute;lectionnez Fichier de cl&eacute;s.</p>
</li>
<li>
<p>Si vous voulez que GlassFish Server d&eacute;finisse une cl&eacute; SSH sur l'h&ocirc;te du noeud, activez l'option Configurer SSH.</p>
<p>GlassFish Server configure la cl&eacute; SSH en copiant les fichiers de cl&eacute;s existants &agrave; partir de l'h&ocirc;te de serveur DAS ou, si n&eacute;cessaire, en g&eacute;n&eacute;rant les fichiers avant de les copier.</p>
<p>Les champs G&eacute;n&eacute;rer une cl&eacute; et Fichier de cl&eacute;s publiques sont ajout&eacute;s &agrave; la fen&ecirc;tre.</p>
</li>
<li>
<p>Si vous voulez que GlassFish Server g&eacute;n&egrave;re les fichiers de cl&eacute;s SSH avant de les copier vers l'h&ocirc;te du noeud, activez l'option G&eacute;n&eacute;rer une cl&eacute;.</p>
<p>Si les fichiers de cl&eacute;s SSH existent, GlassFish Server ne g&eacute;n&egrave;re pas les fichiers, m&ecirc;me si l'option Activ&eacute; est s&eacute;lectionn&eacute;e.</p>

<hr>
<p><b>Remarque:</b></p>
Si les fichiers de cl&eacute;s SSH n'existent pas, vous devez s&eacute;lectionner l'option Activ&eacute;. Sinon, une erreur se produit lorsque vous tentez d'enregistrer les modifications.
<hr>

</li>
<li>
<p>Dans le champ Mot de passe utilisateur SSH, entrez le mot de passe que l'utilisateur SSH utilisera lors de la connexion &agrave; l'h&ocirc;te de ce noeud.</p>
</li>
<li>
<p>Dans le champ Fichier de cl&eacute;s publiques, entrez le chemin absolu du fichier de cl&eacute;s publiques SSH pour l'utilisateur sp&eacute;cifi&eacute; par l'option Nom utilisateur SSH.</p>
</li>
<li>
<p>Dans le champ Fichier de cl&eacute;s, entrez le chemin absolu du fichier de cl&eacute;s priv&eacute;es SSH pour l'utilisateur sp&eacute;cifi&eacute; par l'option Nom utilisateur SSH.</p>

<hr>
<p><b>Remarque:</b></p>
GlassFish Server prend &eacute;galement en charge l'authentification par mot de passe via l'entr&eacute;e <code>AS_ADMIN_SSHPASSWORD</code> dans le fichier de mots de passe. Le fichier de mots de passe est sp&eacute;cifi&eacute; dans l'option <code>-paswordfile</code> de l'utilitaire <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00263"><code>asadmin</code>(1)</a>.
<hr>

</li>
</ol>
</li>
<li>
<p>Pour sp&eacute;cifier l'authentification via un mot de passe stock&eacute; dans la configuration du serveur DAS, proc&eacute;dez comme suit :</p>

<hr>
<p><b>Attention:</b></p>
Ce mot de passe est stock&eacute; sous forme de texte en clair dans la configuration du serveur DAS. Pour une s&eacute;curit&eacute; accrue, utilisez un fichier de cl&eacute;s ou un alias de mot de passe.
<hr>

<ol type="a">
<li>
<p>Dans la liste d&eacute;roulante Authentification de l'utilisateur SSH, s&eacute;lectionnez Mot de passe.</p>
</li>
<li>
<p>Dans le champ Mot de passe utilisateur SSH, entrez le mot de passe que l'utilisateur SSH utilisera lors de la connexion &agrave; l'h&ocirc;te de ce noeud.</p>
</li>
</ol>
</li>
<li>
<p>Pour sp&eacute;cifier l'authentification via un alias de mot de passe, proc&eacute;dez comme suit :</p>
<ol type="a">
<li>
<p>Dans la liste d&eacute;roulante Authentification de l'utilisateur SSH, s&eacute;lectionnez Alias de mot de passe.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Alias de mot de passe, s&eacute;lectionnez un alias existant.</p>
</li>
</ol>
</li>
</ul>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>
</li>
</ol>
<a id="sthref227" name="sthref227"></a>
<h5>Voir aussi</h5>
<p><a href="task-createnode.html">Cr&eacute;ation d'un noeud</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
