<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-change-clustered-instance-ports" name="task-change-clustered-instance-ports"></a><a id="GHCLU00051" name="GHCLU00051"></a></p>

<h4><a id="sthref95" name="sthref95"></a><a id="sthref96" name="sthref96"></a><a id="sthref97" name="sthref97"></a>Modification des num&eacute;ros de port d'une instance GlassFish Server incluse dans un cluster</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Les num&eacute;ros de port d'une instance GlassFish Server incluse dans un cluster sont initialement d&eacute;finis dans la configuration que l'instance h&eacute;rite de son cluster parent. Vous devez modifier ces num&eacute;ros de port si, par exemple, deux instances incluses dans un cluster r&eacute;sident sur le m&ecirc;me h&ocirc;te. Dans ce cas, les num&eacute;ros de port d'une instance doivent &ecirc;tre modifi&eacute;s car les deux instances partagent la m&ecirc;me configuration.</p>
<p>Les num&eacute;ros de port d'une instance sont stock&eacute;s en tant que propri&eacute;t&eacute;s syst&egrave;me Java. Ces propri&eacute;t&eacute;s sont transmises au lanceur d'application Java via son option <code>-D</code> au d&eacute;marrage de GlassFish Server.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Clusters.</p>
</li>
<li>
<p>Sous le noeud Clusters d&eacute;velopp&eacute;, s&eacute;lectionnez le noeud correspondant au cluster.</p>
<p>La page Informations g&eacute;n&eacute;rales du cluster appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Informations g&eacute;n&eacute;rales, cliquez sur l'onglet Instances.</p>
<p>La page Instances de serveur clusteris&eacute;es du cluster appara&icirc;t.</p>
</li>
<li>
<p>S&eacute;lectionnez l'instance dont vous souhaitez modifier les num&eacute;ros de port.</p>
<p>La page Informations g&eacute;n&eacute;rales de l'instance appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Informations g&eacute;n&eacute;rales, cliquez sur l'onglet Propri&eacute;t&eacute;s.</p>
<p>La page Propri&eacute;t&eacute;s syst&egrave;me d'instance appara&icirc;t.</p>
<p>Cette page affiche les valeurs en cours des propri&eacute;t&eacute;s syst&egrave;me suivantes pour l'instance :</p>
<ul>
<li>
<p><a href="../../../common/en/help/ref-predefinedconfigsysproperties.html">Num&eacute;ros de port pr&eacute;d&eacute;finis dans la configuration de l'instance</a></p>
</li>
<li>
<p>Propri&eacute;t&eacute;s personnalis&eacute;es d&eacute;finies pour l'instance, le cas &eacute;ch&eacute;ant</p>
</li>
</ul>
</li>
<li>
<p>Indiquez la nouvelle valeur de chaque propri&eacute;t&eacute; existante &agrave; modifier dans le champ Valeur de remplacement.</p>
</li>
<li>
<p>D&eacute;finissez les valeurs des propri&eacute;t&eacute;s suppl&eacute;mentaires requises.</p>
<ol type="a">
<li>
<p>Dans la table Autres propri&eacute;t&eacute;s, cliquez sur Ajouter une propri&eacute;t&eacute;.</p>
<p>Une ligne est ajout&eacute;e &agrave; la table Autres propri&eacute;t&eacute;s.</p>
</li>
<li>
<p>Dans le champ Nom de la variable d'instance, entrez le nom de la propri&eacute;t&eacute;.</p>
</li>
<li>
<p>Dans le champ Valeur de remplacement, indiquez la valeur.</p>
</li>
</ol>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>
</li>
</ol>
<a id="sthref98" name="sthref98"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-create-clustered-instance.html">Ajout d'une instance GlassFish Server &agrave; un cluster</a></p>
</li>
<li>
<p><a href="task-delete-clustered-instances.html">Suppression d'instances GlassFish Server incluses dans un cluster</a></p>
</li>
<li>
<p><a href="task-start-clustered-instances.html">D&eacute;marrage d'instances GlassFish Server incluses dans un cluster</a></p>
</li>
<li>
<p><a href="task-stop-clustered-instances.html">Arr&ecirc;t d'instances GlassFish Server incluses dans un cluster</a></p>
</li>
<li>
<p><a href="task-view-logs-clustered-instance.html">Affichage des fichiers journaux pour une instance GlassFish Server incluse dans un cluster</a></p>
</li>
<li>
<p><a href="task-recovertransactions.html">R&eacute;cup&eacute;ration des transactions pour une instance GlassFish Server incluse dans un cluster</a></p>
</li>
<li>
<p><a href="task-set-props-clustered-instance.html">D&eacute;finition de propri&eacute;t&eacute;s propres &agrave; l'instance pour une instance GlassFish Server incluse dans un cluster</a></p>
</li>
<li>
<p><a href="task-mon-app-clustered-instance.html">Affichage des donn&eacute;es de surveillance d'application pour une instance GlassFish Server incluse dans un cluster</a></p>
</li>
<li>
<p><a href="task-mon-server-clustered-instance.html">Affichage des donn&eacute;es de surveillance de serveur virtuel pour une instance GlassFish Server incluse dans un cluster</a></p>
</li>
<li>
<p><a href="task-mon-resource-clustered-instance.html">Affichage des donn&eacute;es de surveillance de ressource pour une instance GlassFish Server incluse dans un cluster</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
