<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-recovertransactions-standalone-instance" name="task-recovertransactions-standalone-instance"></a><a id="GHCLU00061" name="GHCLU00061"></a></p>

<h4><a id="sthref146" name="sthref146"></a><a id="sthref147" name="sthref147"></a><a id="sthref148" name="sthref148"></a>R&eacute;cup&eacute;ration des transactions pour une instance GlassFish Server autonome</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, s&eacute;lectionnez le noeud Instances autonomes.</p>
<p>La page Instances de serveur autonomes appara&icirc;t.</p>
</li>
<li>
<p>S&eacute;lectionnez l'instance pour laquelle une r&eacute;cup&eacute;ration des transactions est requise.</p>
<p>La page Informations g&eacute;n&eacute;rales de l'instance appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Informations g&eacute;n&eacute;rales, cliquez sur R&eacute;cup&eacute;rer les transactions.</p>
<p>La page R&eacute;cup&eacute;rer les transactions appara&icirc;t.</p>
<p>Le contenu de cette page varie selon l'&eacute;tat d'ex&eacute;cution de l'instance.</p>
<ul>
<li>
<p>Si l'instance est en cours d'ex&eacute;cution, la page R&eacute;cup&eacute;rer les transactions contient uniquement le texte <b>La r&eacute;cup&eacute;ration est effectu&eacute;e par le serveur en cours d'ex&eacute;cution lui-m&ecirc;me</b> et le bouton OK.</p>
</li>
<li>
<p>Si l'instance n'est pas en cours d'ex&eacute;cution, la page R&eacute;cup&eacute;rer les transactions contient des options suppl&eacute;mentaires.</p>
</li>
</ul>
</li>
<li>
<p>Dans la liste d&eacute;roulante Serveur de destination, s&eacute;lectionnez une autre instance pouvant r&eacute;cup&eacute;rer les transactions sur l'instance en cours.</p>
<p>Pour une instance autonome, s&eacute;lectionnez l'instance nomm&eacute;e <code>server</code> repr&eacute;sentant le serveur d'administration de domaine (DAS).</p>
</li>
<li>
<p>Dans le champ R&eacute;pertoire des journaux des transactions, indiquez le r&eacute;pertoire dans lequel les journaux des transactions sont stock&eacute;s.</p>
<p>La valeur par d&eacute;faut est <code>/logs/tx</code> sous le r&eacute;pertoire du domaine. Les journaux des transactions sont conserv&eacute;s dans le sous-r&eacute;pertoire <code>tx</code> du r&eacute;pertoire sp&eacute;cifi&eacute; par le param&egrave;tre Emplacement des journaux des transactions du service de transaction pour la configuration du cluster. La valeur par d&eacute;faut du param&egrave;tre Emplacement des journaux des transactions est le r&eacute;pertoire sp&eacute;cifi&eacute; dans le champ Racine journal de la page Attributs de domaine, qui se trouve dans l'onglet Avanc&eacute; du noeud GlassFish Server.</p>
</li>
<li>
<p>Cliquez sur OK.</p>
</li>
</ol>
<a id="sthref149" name="sthref149"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-create-standalone-instance.html">Cr&eacute;ation d'une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-delete-standalone-instances.html">Suppression d'instances GlassFish Server autonomes</a></p>
</li>
<li>
<p><a href="task-start-standalone-instances.html">D&eacute;marrage d'instances GlassFish Server autonomes</a></p>
</li>
<li>
<p><a href="task-stop-standalone-instances.html">Arr&ecirc;t d'instances GlassFish Server autonomes</a></p>
</li>
<li>
<p><a href="task-view-logs-standalone-instance.html">Affichage des fichiers journaux pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-deploy.html">D&eacute;ploiement d'une application vers une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-list.html">Enum&eacute;ration des applications d&eacute;ploy&eacute;es vers une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-undeploy.html">Annulation du d&eacute;ploiement d'applications d'une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-remove.html">Suppression d'applications d'une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-edit.html">Modification d'une application d&eacute;ploy&eacute;e vers une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-enable-disable.html">Activation ou d&eacute;sactivation d'une application d&eacute;ploy&eacute;e vers une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-lb-enable-disable.html">Activation ou d&eacute;sactivation de l'&eacute;quilibrage de charge pour une application d&eacute;ploy&eacute;e vers une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-create.html">Cr&eacute;ation d'une ressource pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-display.html">Enum&eacute;ration des ressources pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-enable-disable.html">Activation ou d&eacute;sactivation d'une ressource pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-edit.html">Modification d'une ressource pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-change-standalone-instance-ports.html">Modification des num&eacute;ros de port d'une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-set-props-standalone-instance.html">D&eacute;finition de propri&eacute;t&eacute;s propres &agrave; l'instance pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-mon-app-standalone-instance.html">Affichage des donn&eacute;es de surveillance d'application pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-mon-server-standalone-instance.html">Affichage des donn&eacute;es de surveillance de serveur virtuel pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-mon-resource-standalone-instance.html">Affichage des donn&eacute;es de surveillance de ressource pour une instance GlassFish Server autonome</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
