<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-createnode" name="task-createnode"></a><a id="GHCLU00081" name="GHCLU00081"></a></p>

<h4><a id="sthref224" name="sthref224"></a>Cr&eacute;ation d'un noeud</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Un noeud repr&eacute;sente un h&ocirc;te sur lequel le logiciel GlassFish Server est install&eacute;. Un noeud doit exister au niveau de chaque h&ocirc;te sur lequel r&eacute;sident des instances GlassFish Server.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, s&eacute;lectionnez le noeud Noeuds.</p>
<p>La page Noeuds appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Noeuds, cliquez sur Nouveau.</p>
<p>La page Nouveau noeud appara&icirc;t.</p>
</li>
<li>
<p>Dans le champ Nom, saisissez le nom que vous avez choisi pour le noeud.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Type, s&eacute;lectionnez le type du noeud &agrave; cr&eacute;er.</p>
<ul>
<li>
<p>Pour activer la prise en charge par le noeud de la communication via le protocole distant DCOM (Distributed Component Object Model), s&eacute;lectionnez DCOM.</p>
</li>
<li>
<p>Pour cr&eacute;er un noeud prenant en charge la communication SSH (shell s&eacute;curis&eacute;), s&eacute;lectionnez SSH.</p>
</li>
<li>
<p>Pour cr&eacute;er un noeud qui ne prend pas en charge la communication &agrave; distance, s&eacute;lectionnez CONFIG.</p>
</li>
</ul>
</li>
<li>
<p>Dans le champ H&ocirc;te du noeud, saisissez le nom de l'h&ocirc;te que le noeud repr&eacute;sente.</p>
<p>Le caract&egrave;re obligatoire de ce champ d&eacute;pend du type du noeud :</p>
<ul>
<li>
<p>Si le type du noeud est CONFIG, le nom de l'h&ocirc;te peut &ecirc;tre omis. Le nom de l'h&ocirc;te peut &ecirc;tre d&eacute;termin&eacute; lors de la cr&eacute;ation des instances r&eacute;sidant sur le noeud.</p>
</li>
<li>
<p>Si le type du noeud est DCOM ou SSH, le nom de l'h&ocirc;te doit &ecirc;tre sp&eacute;cifi&eacute;. Sinon, une erreur se produit.</p>
</li>
</ul>
</li>
<li>
<p>Dans le champ R&eacute;pertoire du noeud, entrez le chemin du r&eacute;pertoire qui contiendra les instances GlassFish Server cr&eacute;&eacute;es sur le noeud.</p>
<p>Si le type du noeud est CONFIG, laissez ce champ vide. Le r&eacute;pertoire du noeud peut &ecirc;tre d&eacute;termin&eacute; lors de la cr&eacute;ation des instances r&eacute;sidant sur le noeud.</p>
<p>Si un chemin relatif est sp&eacute;cifi&eacute;, il est relatif au r&eacute;pertoire as-install, o&ugrave; as-install correspond au r&eacute;pertoire d'installation de base du logiciel GlassFish Server sur l'h&ocirc;te.</p>
</li>
<li>
<p>Dans le champ R&eacute;pertoire d'installation, entrez le chemin complet du <i>parent</i> du r&eacute;pertoire d'installation de base du logiciel GlassFish Server sur l'h&ocirc;te, par exemple,<code>/export/glassfish3</code>.</p>
<p>Si le type du noeud est CONFIG, laissez ce champ vide. Le r&eacute;pertoire d'installation peut &ecirc;tre d&eacute;termin&eacute; lors de la cr&eacute;ation des instances r&eacute;sidant sur le noeud.</p>
</li>
<li>
<p>Terminez la cr&eacute;ation du noeud selon la m&eacute;thode requise pour le type de noeud.</p>
<ol type="a">
<li>
<p>Si le type de noeud est CONFIG, cliquez sur Enregistrer.</p>
</li>
<li>
<p>Si le type de noeud est DCOM, suivez les instructions indiqu&eacute;es dans <a href="task-nodenewdcom.html">Ach&egrave;vement de la cr&eacute;ation d'un noeud DCOM</a>.</p>
</li>
<li>
<p>Si le type de noeud est SSH, suivez les instructions indiqu&eacute;es dans <a href="task-nodenewssh.html">Ach&egrave;vement de la cr&eacute;ation d'un noeud SSH</a>.</p>
</li>
</ol>
</li>
</ol>
<a id="sthref225" name="sthref225"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-nodenewdcom.html">Ach&egrave;vement de la cr&eacute;ation d'un noeud DCOM</a></p>
</li>
<li>
<p><a href="task-nodenewssh.html">Ach&egrave;vement de la cr&eacute;ation d'un noeud SSH</a></p>
</li>
<li>
<p><a href="task-deletenode.html">Suppression de noeuds</a></p>
</li>
<li>
<p><a href="task-listnodes.html">Enum&eacute;ration de tous les noeuds du domaine en cours</a></p>
</li>
<li>
<p><a href="task-pingnode.html">V&eacute;rification de l'accessibilit&eacute; d'un noeud</a></p>
</li>
<li>
<p><a href="task-editnode.html">Modification d'un noeud</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
