<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-deletenode" name="task-deletenode"></a><a id="GHCLU00082" name="GHCLU00082"></a></p>

<h4><a id="sthref228" name="sthref228"></a>Suppression de noeuds</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Lorsque vous supprimez un noeud, celui-ci est enlev&eacute; de la configuration du serveur d'administration de domaine (DAS). Les r&eacute;pertoires et fichiers du noeud sont supprim&eacute;s lorsque la derni&egrave;re instance GlassFish Server r&eacute;sidant sur le noeud est supprim&eacute;e.</p>
<p>Vous pouvez &eacute;galement choisir de d&eacute;sinstaller le logiciel GlassFish Server de l'h&ocirc;te du noeud lorsque le noeud est supprim&eacute;.</p>
<a id="sthref229" name="sthref229"></a>
<h5>Avant de commencer</h5>
<p>Assurez-vous qu'aucune instance GlassFish Server ne r&eacute;side sur le noeud &agrave; supprimer.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, s&eacute;lectionnez le noeud Noeuds.</p>
<p>La page Noeuds appara&icirc;t.</p>
</li>
<li>
<p>Pour chaque noeud &agrave; supprimer, cochez la case en regard du noeud dans la table Noeuds.</p>

<hr>
<p><b>Remarque:</b></p>
Le noeud pr&eacute;d&eacute;fini <code>localhost-</code><i>domain</i> ne peut pas &ecirc;tre supprim&eacute;.
<hr>

</li>
<li>
<p>Cliquez sur le bouton pour supprimer les noeuds, ou supprimez les noeuds et d&eacute;sinstallez le logiciel GlassFish Server des h&ocirc;tes des noeuds.</p>
<ul>
<li>
<p>Pour supprimer les noeuds sans d&eacute;sinstaller le logiciel GlassFish Server, cliquez sur Supprimer.</p>
<p>Vous &ecirc;tes invit&eacute; &agrave; confirmer que vous souhaitez supprimer les noeuds.</p>
</li>
<li>
<p>Pour supprimer les noeuds et d&eacute;sinstaller le logiciel GlassFish Server des h&ocirc;tes des noeuds, cliquez sur Supprimer et d&eacute;sinstaller.</p>
<p>Vous &ecirc;tes invit&eacute; &agrave; confirmer que vous souhaitez supprimer les noeuds et d&eacute;sinstaller le logiciel GlassFish Server des h&ocirc;tes des noeuds.</p>

<hr>
<p><b>Remarque:</b></p>
Le logiciel GlassFish Server n'est pas d&eacute;sinstall&eacute; des h&ocirc;tes repr&eacute;sent&eacute;s par un noeud de type CONFIG. Seul le noeud est supprim&eacute;.
<hr>

</li>
</ul>
</li>
<li>
<p>Confirmez la suppression des noeuds, ou la suppression des noeuds et la d&eacute;sinstallation du logiciel GlassFish Server des h&ocirc;tes des noeuds.</p>
<p>Les noeuds sont supprim&eacute;s et enlev&eacute;s de la table des noeuds sur la page Noeuds. Si vous avez cliqu&eacute; sur Supprimer et d&eacute;sinstaller, le logiciel GlassFish Server est &eacute;galement d&eacute;sinstall&eacute; des h&ocirc;tes des noeuds.</p>
</li>
</ol>
<a id="sthref230" name="sthref230"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-createnode.html">Cr&eacute;ation d'un noeud</a></p>
</li>
<li>
<p><a href="task-listnodes.html">Enum&eacute;ration de tous les noeuds du domaine en cours</a></p>
</li>
<li>
<p><a href="task-pingnode.html">V&eacute;rification de l'accessibilit&eacute; d'un noeud</a></p>
</li>
<li>
<p><a href="task-editnode.html">Modification d'un noeud</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
