<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-migrate-ejb-timers" name="task-migrate-ejb-timers"></a></p>

<h4><a id="sthref240" name="sthref240"></a><a id="sthref241" name="sthref241"></a><a id="sthref242" name="sthref242"></a>Migration d'horloges EJB</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Si une instance GlassFish Server est arr&ecirc;t&eacute;e, les horloges EJB (Enterprise JavaBeans) qui y sont install&eacute;es s'arr&ecirc;tent &eacute;galement. Si l'instance a &eacute;t&eacute; arr&ecirc;t&eacute;e de mani&egrave;re anormale ou inattendue, pour permettre l'ex&eacute;cution de ces horloges alors que l'instance est arr&ecirc;t&eacute;e, vous devez migrer les horloges vers une instance de serveur en cours d'ex&eacute;cution dans le cluster.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Clusters.</p>
</li>
<li>
<p>Dans l'arborescence de navigation, sous le noeud Clusters, s&eacute;lectionnez le cluster.</p>
<p>La page Informations g&eacute;n&eacute;rales du cluster appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Informations g&eacute;n&eacute;rales, cliquez sur le bouton Migrer les horloges EJB.</p>
<p>La page Migrer les horloges EJB appara&icirc;t.</p>

<hr>
<p><b>Remarque:</b></p>
Si toutes les instances du cluster sont en cours d'ex&eacute;cution, le bouton Migrer les horloges EJB est d&eacute;sactiv&eacute;.
<hr>

<p>Pour vous aider &agrave; migrer les horloges, la page Migrer les horloges EJB pr&eacute;sente une table d'horloges EJB comportant les informations ci-apr&egrave;s.</p>
<dl>
<dt>Nom du serveur</dt>
<dd>
<p>Liste des instances GlassFish Server dans le cluster.</p>
</dd>
<dt>Nombre d'horloges</dt>
<dd>
<p>Nombre d'horloges persistantes sur chaque instance.</p>
</dd>
</dl>
</li>
<li>
<p>Sur la page Migrer les horloges EJB, s&eacute;lectionnez l'instance &agrave; partir de laquelle et vers laquelle vous souhaitez migrer les horloges.</p>
<ol type="a">
<li>
<p>Dans la liste d&eacute;roulante Source, s&eacute;lectionnez l'instance arr&ecirc;t&eacute;e &agrave; partir de laquelle vous souhaitez migrer les horloges.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Destination, s&eacute;lectionnez l'instance en cours d'ex&eacute;cution vers laquelle vous souhaitez migrer les horloges.</p>
</li>
<li>
<p>Cliquez sur OK.</p>
</li>
</ol>
</li>
</ol>
<p>Si l'instance source est en cours d'ex&eacute;cution ou si l'instance de destination n'est pas en cours d'ex&eacute;cution, la Console d'administration affiche un message d'erreur.</p>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
