<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-gmsenable" name="task-gmsenable"></a><a id="GHCLU00078" name="GHCLU00078"></a></p>

<h4><a id="sthref217" name="sthref217"></a><a id="sthref218" name="sthref218"></a>Activation du service de gestion de groupes</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Le service de gestion de groupes (GMS) est un service inclus dans un processus offrant des services de surveillance de clusters, d'appartenance au cluster et de communication de groupe. Il ex&eacute;cute les fonctions suivantes :</p>
<ul>
<li>
<p>Il signale les modules inscrits dans une instance GlassFish Server lorsque des instances membres sont ajout&eacute;es &agrave; un cluster et enlev&eacute;es d'un cluster, ou lorsque leur &eacute;chec est suspect&eacute; ou a &eacute;t&eacute; confirm&eacute;.</p>
</li>
<li>
<p>Il permet l'envoi et la r&eacute;ception de messages entre les membres du cluster.</p>
</li>
</ul>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Clusters.</p>
</li>
<li>
<p>S&eacute;lectionnez le cluster pour lequel vous souhaitez activer le service de gestion de groupes (GMS).</p>
<p>La page Informations g&eacute;n&eacute;rales du cluster appara&icirc;t.</p>
</li>
<li>
<p>S&eacute;lectionnez la case Activ&eacute; du champ GMS pour activer le service GMS pour le cluster.</p>
<p>Cette option est s&eacute;lectionn&eacute;e par d&eacute;faut. Pour d&eacute;sactiver le service GMS pour le cluster, d&eacute;s&eacute;lectionnez la case Activ&eacute; du champ GMS.</p>
<p>Si cette option est activ&eacute;e, le service de gestion de groupes est d&eacute;marr&eacute; dans chaque instance de serveur du cluster et dans le serveur d'administration de domaine (DAS). Le serveur DAS se trouve dans chaque cluster dans lequel le service GMS est activ&eacute;.</p>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>
</li>
</ol>
<a id="sthref219" name="sthref219"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-gmscluster.html">Configuration de param&egrave;tres du service de gestion de groupes pour un cluster</a></p>
</li>
<li>
<p><a href="task-gms.html">Configuration du service de gestion de groupes</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
