<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-set-props-clustered-instance" name="task-set-props-clustered-instance"></a><a id="GHCLU00052" name="GHCLU00052"></a></p>

<h4><a id="sthref99" name="sthref99"></a><a id="sthref100" name="sthref100"></a><a id="sthref101" name="sthref101"></a>D&eacute;finition de propri&eacute;t&eacute;s propres &agrave; l'instance pour une instance GlassFish Server incluse dans un cluster</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Les propri&eacute;t&eacute;s d'une instance GlassFish Server ajoutent des informations de configuration facultatives sur l'instance.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Clusters.</p>
</li>
<li>
<p>Sous le noeud Clusters d&eacute;velopp&eacute;, s&eacute;lectionnez le noeud correspondant au cluster.</p>
<p>La page Informations g&eacute;n&eacute;rales du cluster appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Informations g&eacute;n&eacute;rales, cliquez sur l'onglet Instances.</p>
<p>La page Instances de serveur clusteris&eacute;es du cluster appara&icirc;t.</p>
</li>
<li>
<p>S&eacute;lectionnez l'instance dont vous souhaitez modifier les propri&eacute;t&eacute;s.</p>
<p>La page Informations g&eacute;n&eacute;rales de l'instance appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Informations g&eacute;n&eacute;rales, cliquez sur l'onglet Propri&eacute;t&eacute;s.</p>
</li>
<li>
<p>Si n&eacute;cessaire, cliquez sur l'onglet Propri&eacute;t&eacute;s d'instance.</p>
<p>La page Propri&eacute;t&eacute;s d'instance appara&icirc;t.</p>
<p>Cette page affiche la liste des propri&eacute;t&eacute;s d&eacute;finies pour l'instance GlassFish Server s&eacute;lectionn&eacute;e.</p>
</li>
<li>
<p>Indiquez la nouvelle valeur de chaque propri&eacute;t&eacute; existante &agrave; modifier dans le champ Valeur.</p>
</li>
<li>
<p>D&eacute;finissez les valeurs des propri&eacute;t&eacute;s suppl&eacute;mentaires requises.</p>
<ol type="a">
<li>
<p>Dans la table Autres propri&eacute;t&eacute;s, cliquez sur Ajouter une propri&eacute;t&eacute;.</p>
<p>Une ligne est ajout&eacute;e &agrave; la table Autres propri&eacute;t&eacute;s.</p>
</li>
<li>
<p>Dans le champ Nom, entrez le nom de la propri&eacute;t&eacute;.</p>
</li>
<li>
<p>Dans le champ Valeur, indiquez la valeur.</p>
</li>
<li>
<p>Dans le champ Description, entrez une br&egrave;ve description de la propri&eacute;t&eacute;.</p>
</li>
</ol>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>
</li>
</ol>
<a id="sthref102" name="sthref102"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-create-clustered-instance.html">Ajout d'une instance GlassFish Server &agrave; un cluster</a></p>
</li>
<li>
<p><a href="task-delete-clustered-instances.html">Suppression d'instances GlassFish Server incluses dans un cluster</a></p>
</li>
<li>
<p><a href="task-start-clustered-instances.html">D&eacute;marrage d'instances GlassFish Server incluses dans un cluster</a></p>
</li>
<li>
<p><a href="task-stop-clustered-instances.html">Arr&ecirc;t d'instances GlassFish Server incluses dans un cluster</a></p>
</li>
<li>
<p><a href="task-view-logs-clustered-instance.html">Affichage des fichiers journaux pour une instance GlassFish Server incluse dans un cluster</a></p>
</li>
<li>
<p><a href="task-recovertransactions.html">R&eacute;cup&eacute;ration des transactions pour une instance GlassFish Server incluse dans un cluster</a></p>
</li>
<li>
<p><a href="task-change-clustered-instance-ports.html">Modification des num&eacute;ros de port d'une instance GlassFish Server incluse dans un cluster</a></p>
</li>
<li>
<p><a href="task-mon-app-clustered-instance.html">Affichage des donn&eacute;es de surveillance d'application pour une instance GlassFish Server incluse dans un cluster</a></p>
</li>
<li>
<p><a href="task-mon-server-clustered-instance.html">Affichage des donn&eacute;es de surveillance de serveur virtuel pour une instance GlassFish Server incluse dans un cluster</a></p>
</li>
<li>
<p><a href="task-mon-resource-clustered-instance.html">Affichage des donn&eacute;es de surveillance de ressource pour une instance GlassFish Server incluse dans un cluster</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
