<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-start-clustered-instances" name="task-start-clustered-instances"></a><a id="GHCLU00047" name="GHCLU00047"></a></p>

<h4><a id="sthref76" name="sthref76"></a><a id="sthref77" name="sthref77"></a><a id="sthref78" name="sthref78"></a>D&eacute;marrage d'instances GlassFish Server incluses dans un cluster</h4>
<a name="BEGIN" id="BEGIN"></a><a id="sthref79" name="sthref79"></a>
<h5>Avant de commencer</h5>
<p>Assurez-vous que les pr&eacute;requis suivants sont respect&eacute;s :</p>
<ul>
<li>
<p>Tous les noeuds sur lesquels r&eacute;sident les instances sont activ&eacute;s pour la communication &agrave; distance.</p>
</li>
<li>
<p>L'utilisateur du serveur d'administration de domaine (DAS) peut utiliser le protocole DCOM (Distributed Component Object Model) ou SSH (shell s&eacute;curis&eacute;) pour se connecter &agrave; l'h&ocirc;te pour n'importe quel noeud dans lequel r&eacute;sident les instances.</p>
</li>
</ul>
<p>Si l'un de ces pr&eacute;requis n'est pas respect&eacute;, d&eacute;marrez chaque instance s&eacute;par&eacute;ment &agrave; partir de la ligne de commande &agrave; l'aide de la sous-commande <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00237"><code>start-local-instance</code>(1)</a>.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Clusters.</p>
</li>
<li>
<p>Sous le noeud Clusters d&eacute;velopp&eacute;, s&eacute;lectionnez le noeud correspondant au cluster.</p>
<p>La page Informations g&eacute;n&eacute;rales du cluster appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Informations g&eacute;n&eacute;rales, cliquez sur l'onglet Instances.</p>
<p>La page Instances de serveur clusteris&eacute;es du cluster appara&icirc;t.</p>
</li>
<li>
<p>Pour chaque instance &agrave; d&eacute;marrer, cochez la case en regard de l'instance dans la table Instances de serveur.</p>
</li>
<li>
<p>Cliquez sur D&eacute;marrer.</p>
<p>Vous &ecirc;tes invit&eacute; &agrave; confirmer que vous souhaitez d&eacute;marrer les instances.</p>
</li>
<li>
<p>Confirmez le d&eacute;marrage des instances.</p>
<p>Le statut de chaque instance est mis &agrave; jour dans la table Instances de serveur au d&eacute;marrage de l'instance.</p>
</li>
</ol>
<a id="sthref80" name="sthref80"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-create-clustered-instance.html">Ajout d'une instance GlassFish Server &agrave; un cluster</a></p>
</li>
<li>
<p><a href="task-delete-clustered-instances.html">Suppression d'instances GlassFish Server incluses dans un cluster</a></p>
</li>
<li>
<p><a href="task-stop-clustered-instances.html">Arr&ecirc;t d'instances GlassFish Server incluses dans un cluster</a></p>
</li>
<li>
<p><a href="task-view-logs-clustered-instance.html">Affichage des fichiers journaux pour une instance GlassFish Server incluse dans un cluster</a></p>
</li>
<li>
<p><a href="task-recovertransactions.html">R&eacute;cup&eacute;ration des transactions pour une instance GlassFish Server incluse dans un cluster</a></p>
</li>
<li>
<p><a href="task-change-clustered-instance-ports.html">Modification des num&eacute;ros de port d'une instance GlassFish Server incluse dans un cluster</a></p>
</li>
<li>
<p><a href="task-set-props-clustered-instance.html">D&eacute;finition de propri&eacute;t&eacute;s propres &agrave; l'instance pour une instance GlassFish Server incluse dans un cluster</a></p>
</li>
<li>
<p><a href="task-mon-app-clustered-instance.html">Affichage des donn&eacute;es de surveillance d'application pour une instance GlassFish Server incluse dans un cluster</a></p>
</li>
<li>
<p><a href="task-mon-server-clustered-instance.html">Affichage des donn&eacute;es de surveillance de serveur virtuel pour une instance GlassFish Server incluse dans un cluster</a></p>
</li>
<li>
<p><a href="task-mon-resource-clustered-instance.html">Affichage des donn&eacute;es de surveillance de ressource pour une instance GlassFish Server incluse dans un cluster</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
