<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-gms" name="task-gms"></a></p>

<h4><a id="sthref222" name="sthref222"></a>Configuration du service de gestion de groupes</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Le service de gestion de groupes (GMS) est un service inclus dans un processus offrant des services de surveillance de clusters, d'appartenance au cluster et de communication de groupe. Il ex&eacute;cute les fonctions suivantes :</p>
<ul>
<li>
<p>Il signale les modules inscrits dans une instance GlassFish Server lorsque des instances membres sont ajout&eacute;es &agrave; un cluster et enlev&eacute;es d'un cluster, ou lorsque leur &eacute;chec est suspect&eacute; ou a &eacute;t&eacute; confirm&eacute;.</p>
</li>
<li>
<p>Il permet l'envoi et la r&eacute;ception de messages entre les membres du cluster.</p>
</li>
</ul>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Configuration.</p>
</li>
<li>
<p>S&eacute;lectionnez la configuration &agrave; modifier pour le cluster.</p>
</li>
<li>
<p>Sous le noeud Configuration, s&eacute;lectionnez le noeud Service de gestion de groupes.</p>
<p>La page Service de gestion de groupes appara&icirc;t.</p>
</li>
<li>
<p>Dans le champ Nb maximal de signaux d'activit&eacute; manqu&eacute;s, entrez le nombre maximal de signaux manqu&eacute;s pour un membre avant que le service GMS ne confirme qu'une d&eacute;faillance est suspect&eacute;e.</p>
<p>La valeur par d&eacute;faut est 3.</p>
</li>
<li>
<p>Dans le champ Fr&eacute;quence de signal, indiquez le d&eacute;lai entre les diffusions successives du signal d'activit&eacute; d'un membre de groupe.</p>
<p>La valeur par d&eacute;faut est 2 000 millisecondes.</p>
</li>
<li>
<p>Dans le champ D&eacute;lai de d&eacute;tection de groupe expir&eacute;, entrez la dur&eacute;e d'attente du service GMS pour la d&eacute;tection d'autres membres du cluster.</p>
<p>La valeur par d&eacute;faut est 5 000 millisecondes.</p>
</li>
<li>
<p>Dans le champ Temps d'attente de v&eacute;rification d'&eacute;chec, indiquez le temps d'attente avant de v&eacute;rifier qu'un membre suspect&eacute; d'&eacute;chec doit &ecirc;tre signal&eacute; comme ayant &eacute;chou&eacute;.</p>
<p>La valeur par d&eacute;faut est 1 500 millisecondes.</p>
</li>
<li>
<p>Pour restaurer les valeurs par d&eacute;faut, cliquez sur le bouton Charger les valeurs par d&eacute;faut.</p>
</li>
<li>
<p>Dans la section Autres propri&eacute;t&eacute;s, sp&eacute;cifiez les propri&eacute;t&eacute;s suppl&eacute;mentaires.</p>
<ul>
<li>
<p>Pour ajouter une propri&eacute;t&eacute;, cliquez sur le bouton Ajouter une propri&eacute;t&eacute;. Sur la ligne vide qui appara&icirc;t, saisissez le nom de la propri&eacute;t&eacute; dans le champ Nom et la valeur de la propri&eacute;t&eacute; dans le champ Valeur.</p>
</li>
<li>
<p>Pour modifier une propri&eacute;t&eacute;, modifiez le champ Valeur de cette propri&eacute;t&eacute;.</p>
</li>
<li>
<p>Pour supprimer une propri&eacute;t&eacute;, s&eacute;lectionnez la case situ&eacute;e &agrave; gauche du champ Nom de la propri&eacute;t&eacute; &agrave; supprimer, puis cliquez sur le bouton Supprimer des propri&eacute;t&eacute;s.</p>
</li>
</ul>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>
</li>
</ol>
<a id="sthref223" name="sthref223"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-gmsenable.html">Activation du service de gestion de groupes</a></p>
</li>
<li>
<p><a href="task-gmscluster.html">Configuration de param&egrave;tres du service de gestion de groupes pour un cluster</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
