<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-change-standalone-instance-ports" name="task-change-standalone-instance-ports"></a><a id="GHCLU00073" name="GHCLU00073"></a></p>

<h4><a id="sthref190" name="sthref190"></a><a id="sthref191" name="sthref191"></a><a id="sthref192" name="sthref192"></a>Modification des num&eacute;ros de port d'une instance GlassFish Server autonome</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Les num&eacute;ros de port d'une instance GlassFish Server autonome sont initialement d&eacute;finis dans la configuration que l'instance r&eacute;f&eacute;rence. Vous devez modifier ces num&eacute;ros de port si, par exemple, deux instances qui r&eacute;f&eacute;rencent la m&ecirc;me configuration r&eacute;sident sur le m&ecirc;me h&ocirc;te. Dans ce cas, les num&eacute;ros de port d'une instance doivent &ecirc;tre modifi&eacute;s car les deux instances r&eacute;f&eacute;rencent la m&ecirc;me configuration.</p>
<p>Les num&eacute;ros de port d'une instance sont stock&eacute;s en tant que propri&eacute;t&eacute;s syst&egrave;me Java. Ces propri&eacute;t&eacute;s sont transmises au lanceur d'application Java via son option <code>-D</code> au d&eacute;marrage de GlassFish Server.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, s&eacute;lectionnez le noeud Instances autonomes.</p>
<p>La page Instances de serveur autonomes appara&icirc;t.</p>
</li>
<li>
<p>S&eacute;lectionnez l'instance dont vous souhaitez modifier les num&eacute;ros de port.</p>
<p>La page Informations g&eacute;n&eacute;rales de l'instance appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Informations g&eacute;n&eacute;rales, cliquez sur l'onglet Propri&eacute;t&eacute;s.</p>
<p>La page Propri&eacute;t&eacute;s syst&egrave;me d'instance appara&icirc;t.</p>
<p>Cette page affiche les valeurs en cours des propri&eacute;t&eacute;s syst&egrave;me suivantes pour l'instance :</p>
<ul>
<li>
<p><a href="../../../common/en/help/ref-predefinedconfigsysproperties.html">Num&eacute;ros de port pr&eacute;d&eacute;finis dans la configuration de l'instance</a></p>
</li>
<li>
<p>Propri&eacute;t&eacute;s personnalis&eacute;es d&eacute;finies pour l'instance, le cas &eacute;ch&eacute;ant</p>
</li>
</ul>
</li>
<li>
<p>Indiquez la nouvelle valeur de chaque propri&eacute;t&eacute; existante &agrave; modifier dans le champ Valeur de remplacement.</p>
</li>
<li>
<p>D&eacute;finissez les valeurs des propri&eacute;t&eacute;s suppl&eacute;mentaires requises.</p>
<ol type="a">
<li>
<p>Dans la table Autres propri&eacute;t&eacute;s, cliquez sur Ajouter une propri&eacute;t&eacute;.</p>
<p>Une ligne est ajout&eacute;e &agrave; la table Autres propri&eacute;t&eacute;s.</p>
</li>
<li>
<p>Dans le champ Nom de la variable d'instance, entrez le nom de la propri&eacute;t&eacute;.</p>
</li>
<li>
<p>Dans le champ Valeur de remplacement, indiquez la valeur.</p>
</li>
</ol>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>
</li>
</ol>
<a id="sthref193" name="sthref193"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-create-standalone-instance.html">Cr&eacute;ation d'une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-delete-standalone-instances.html">Suppression d'instances GlassFish Server autonomes</a></p>
</li>
<li>
<p><a href="task-start-standalone-instances.html">D&eacute;marrage d'instances GlassFish Server autonomes</a></p>
</li>
<li>
<p><a href="task-stop-standalone-instances.html">Arr&ecirc;t d'instances GlassFish Server autonomes</a></p>
</li>
<li>
<p><a href="task-view-logs-standalone-instance.html">Affichage des fichiers journaux pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-recovertransactions-standalone-instance.html">R&eacute;cup&eacute;ration des transactions pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-deploy.html">D&eacute;ploiement d'une application vers une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-list.html">Enum&eacute;ration des applications d&eacute;ploy&eacute;es vers une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-undeploy.html">Annulation du d&eacute;ploiement d'applications d'une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-remove.html">Suppression d'applications d'une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-edit.html">Modification d'une application d&eacute;ploy&eacute;e vers une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-enable-disable.html">Activation ou d&eacute;sactivation d'une application d&eacute;ploy&eacute;e vers une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-lb-enable-disable.html">Activation ou d&eacute;sactivation de l'&eacute;quilibrage de charge pour une application d&eacute;ploy&eacute;e vers une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-create.html">Cr&eacute;ation d'une ressource pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-display.html">Enum&eacute;ration des ressources pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-enable-disable.html">Activation ou d&eacute;sactivation d'une ressource pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-edit.html">Modification d'une ressource pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-set-props-standalone-instance.html">D&eacute;finition de propri&eacute;t&eacute;s propres &agrave; l'instance pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-mon-app-standalone-instance.html">Affichage des donn&eacute;es de surveillance d'application pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-mon-server-standalone-instance.html">Affichage des donn&eacute;es de surveillance de serveur virtuel pour une instance GlassFish Server autonome</a></p>
</li>
<li>
<p><a href="task-mon-resource-standalone-instance.html">Affichage des donn&eacute;es de surveillance de ressource pour une instance GlassFish Server autonome</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
