<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-upgrade-components" name="task-upgrade-components"></a><a id="GHCLU00044" name="GHCLU00044"></a></p>

<h4><a id="sthref62" name="sthref62"></a><a id="sthref63" name="sthref63"></a><a id="sthref64" name="sthref64"></a><a id="sthref65" name="sthref65"></a>Mise &agrave; niveau des composants sans perte de service</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Dans un environnement inclus dans un cluster, une mise &agrave; niveau non simultan&eacute;e red&eacute;ploie une application avec une perte minimale de service et de sessions. Une session est un artefact qui peut &ecirc;tre r&eacute;pliqu&eacute;, par exemple :</p>
<ul>
<li>
<p><code>HttpSession</code></p>
</li>
<li>
<p><code>SingleSignOn</code></p>
</li>
<li>
<p><code>ServletTimer</code></p>
</li>
<li>
<p><code>DialogFragment</code></p>
</li>
<li>
<p>Bean Session avec conservation de statut</p>
</li>
</ul>
<p>Vous pouvez utiliser l'&eacute;quilibreur de charge et plusieurs clusters pour mettre &agrave; niveau des composants dans GlassFish Server sans aucune perte de service. Un composant peut &ecirc;tre, par exemple, une JVM, le logiciel GlassFish Server ou une application Web.</p>
<p>Une mise &agrave; niveau non simultan&eacute;e peut avoir lieu &agrave; des charges faibles ou mod&eacute;r&eacute;es. La proc&eacute;dure n&eacute;cessite environ 10 &agrave; 15 minutes pour chaque instance GlassFish Server.</p>
<p>Les applications doivent &ecirc;tre compatibles sur l'ensemble de la mise &agrave; niveau. Elles doivent fonctionner correctement lors de la transition lorsque certaines instances ex&eacute;cutent l'ancienne version et d'autres ex&eacute;cutent la nouvelle. L'ancienne et la nouvelle version doivent avoir la m&ecirc;me forme de classes s&eacute;rialisables qui constituent les graphiques d'objet stock&eacute;s dans des sessions (par exemple, variables d'instance persistantes). Si la forme de ces classes doit changer, le d&eacute;veloppeur d'applications doit s'assurer que le comportement de s&eacute;rialisation appropri&eacute; se produit. Si l'application n'est pas compatible sur l'ensemble de la mise &agrave; niveau, le cluster doit &ecirc;tre arr&ecirc;t&eacute; en vue d'un red&eacute;ploiement complet.</p>
<p>Cette approche n'est pas applicable si la mise &agrave; niveau de l'application implique une modification du sch&eacute;ma de base de donn&eacute;es de l'application.</p>

<hr>
<p><b>Attention:</b></p>
Pour &eacute;viter tout risque d'incompatibilit&eacute; de version lors du basculement d'une session en cas d'incident, mettez &agrave; niveau toutes les instances d'un cluster en m&ecirc;me temps. Sinon, une session peut basculer vers une instance sur laquelle d'autres versions des composants sont en cours d'ex&eacute;cution.
<hr>

<p>Ex&eacute;cutez cette t&acirc;che sur chaque cluster s&eacute;par&eacute;ment. Un cluster fonctionne comme une limite de s&eacute;curit&eacute; pour le basculement des sessions en cas d'incident pour les instances dans le cluster. Les sessions dans un cluster ne peuvent jamais basculer vers les sessions dans un autre cluster. Ceci &eacute;vite le risque d'incompatibilit&eacute; de version.</p>
<ol>
<li>
<p>Arr&ecirc;tez le cluster.</p>
<p>Reportez-vous &agrave; <a href="task-stop-cluster.html">Arr&ecirc;t d'un cluster</a>.</p>
</li>
<li>
<p>Mettez &agrave; niveau le composant dans ce cluster.</p>
</li>
<li>
<p>D&eacute;marrez le cluster.</p>
<p>Reportez-vous &agrave; <a href="task-start-cluster.html">D&eacute;marrage d'un cluster</a>.</p>
</li>
</ol>
<a id="sthref66" name="sthref66"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-create-cluster.html">Cr&eacute;ation d'un cluster</a></p>
</li>
<li>
<p><a href="task-delete-cluster.html">Suppression d'un cluster</a></p>
</li>
<li>
<p><a href="task-availabilityservice.html">Configuration de param&egrave;tres de disponibilit&eacute; pour un cluster</a></p>
</li>
<li>
<p><a href="task-start-cluster.html">D&eacute;marrage d'un cluster</a></p>
</li>
<li>
<p><a href="task-stop-cluster.html">Arr&ecirc;t d'un cluster</a></p>
</li>
<li>
<p><a href="task-modify-cluster-config.html">Modification de la configuration d'un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-deploy.html">D&eacute;ploiement d'une application vers un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-list.html">Enum&eacute;ration des applications d&eacute;ploy&eacute;es vers un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-undeploy.html">Annulation du d&eacute;ploiement d'applications d'un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-remove.html">Suppression d'applications d'un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-edit.html">Modification d'une application d&eacute;ploy&eacute;e vers un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-enable-disable.html">Activation ou d&eacute;sactivation d'une application d&eacute;ploy&eacute;e vers un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-lb-enable-disable.html">Activation ou d&eacute;sactivation de l'&eacute;quilibrage de charge pour une application d&eacute;ploy&eacute;e vers un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-resource-create.html">Cr&eacute;ation d'une ressource pour un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-resource-display.html">Enum&eacute;ration des ressources pour un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-resource-enable-disable.html">Activation ou d&eacute;sactivation d'une ressource de mani&egrave;re globale</a></p>
</li>
<li>
<p><a href="task-cluster-resource-edit.html">Modification d'une ressource pour un cluster</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
