<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-nodeupdatedcom" name="task-nodeupdatedcom"></a></p>
<!-- infolevel="all" infotype="General" -->
<h4>Ach&egrave;vement de la mise &agrave; jour d'un noeud DCOM</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Cette t&acirc;che constitue la suite de la proc&eacute;dure <a href="task-editnode.html">Modification d'un noeud</a> pour un noeud DCOM.</p>
<ol>
<li>
<p>Pour forcer la cr&eacute;ation du noeud dans la configuration du serveur d'administration de domaine (DAS) m&ecirc;me si la validation des param&egrave;tres du noeud &eacute;choue, activez l'option Forcer.</p>
</li>
<li>
<p>Si vous voulez que GlassFish Server teste la connexion via DCOM &agrave; l'h&ocirc;te du noeud avant de mettre &agrave; jour ce dernier, proc&eacute;dez comme suit :</p>
<ol type="a">
<li>
<p>Activez l'option Valider DCOM.</p>
</li>
<li>
<p>Dans le champ R&eacute;pertoire de test distant, saisissez le nom du dossier sur l'h&ocirc;te distant dans lequel GlassFish Server doit cr&eacute;er un fichier pour tester la connexion.</p>
</li>
</ol>
</li>
<li>
<p>Dans le champ Domaine Windows, saisissez le nom du domaine Windows contenant l'utilisateur sp&eacute;cifi&eacute; par l'option Nom utilisateur Windows.</p>
<p>Si vous changez le type du noeud en DCOM et que vous laissez ce champ vide, l'option Domaine Windows est d&eacute;finie sur le nom de l'h&ocirc;te sur lequel la Console d'administration est ex&eacute;cut&eacute;e.</p>
</li>
<li>
<p>Dans le champ Nom utilisateur Windows, entrez le nom de l'utilisateur sur l'h&ocirc;te de ce noeud qui ex&eacute;cutera le processus de connexion &agrave; l'h&ocirc;te via DCOM.</p>
<p>Si vous changez le type de noeud CONFIG en DCOM et que vous laissez ce champ vide, l'option Nom utilisateur Windows est d&eacute;finie sur l'utilisateur qui ex&eacute;cute le processus de serveur DAS.</p>
</li>
<li>
<p>Sp&eacute;cifiez le mode d'authentification de l'utilisateur Windows lors de sa connexion &agrave; l'h&ocirc;te de ce noeud.</p>

<hr>
<p><b>Remarque:</b></p>
GlassFish Server prend &eacute;galement en charge l'authentification par mot de passe via l'entr&eacute;e <code>AS_ADMIN_WINDOWSPASSWORD</code> dans le fichier de mots de passe. Le fichier de mots de passe est sp&eacute;cifi&eacute; dans l'option <code>-paswordfile</code> de l'utilitaire <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00263"><code>asadmin</code>(1)</a>.
<hr>

<ol type="a">
<li>
<p>Pour sp&eacute;cifier l'authentification via un mot de passe stock&eacute; dans la configuration du serveur DAS, proc&eacute;dez comme suit :</p>

<hr>
<p><b>Attention:</b></p>
Ce mot de passe est stock&eacute; sous forme de texte en clair dans la configuration du serveur DAS. Pour une s&eacute;curit&eacute; accrue, utilisez un alias de mot de passe.
<hr>

<ol>
<li>
<p>Dans la liste d&eacute;roulante Authentification de l'utilisateur Windows, s&eacute;lectionnez Mot de passe.</p>
</li>
<li>
<p>Dans le champ Mot de passe utilisateur Windows, entrez le mot de passe que l'utilisateur Windows utilisera lors de la connexion &agrave; l'h&ocirc;te de ce noeud.</p>
</li>
</ol>
</li>
<li>
<p>Pour sp&eacute;cifier l'authentification via un alias de mot de passe, proc&eacute;dez comme suit :</p>
<ol>
<li>
<p>Dans la liste d&eacute;roulante Authentification de l'utilisateur Windows, s&eacute;lectionnez Alias de mot de passe.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Alias de mot de passe, s&eacute;lectionnez un alias existant.</p>
</li>
</ol>
</li>
</ol>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>
</li>
</ol>
<a id="sthref238" name="sthref238"></a>
<h5>Voir aussi</h5>
<p><a href="task-editnode.html">Modification d'un noeud</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
