<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-connectorsecuritymapedit" name="ref-connectorsecuritymapedit"></a><a id="GHJCA00049" name="GHJCA00049"></a></p>

<h4><a id="sthref90" name="sthref90"></a><a id="sthref91" name="sthref91"></a>Editar asignaci&oacute;n de seguridad del pool de conexiones de conector</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Editar asignaci&oacute;n de seguridad del pool de conexiones del conector para editar una asignaci&oacute;n de seguridad para un pool de conexiones de conector.</p>
<p>La p&aacute;gina Editar asignaci&oacute;n de seguridad del pool de conexiones del conector presenta las opciones siguientes:</p>
<dl>
<dt>Nombre del pool de conexiones</dt>
<dd>
<p>Nombre del pool de conexiones de conector al que pertenece esta asignaci&oacute;n de seguridad. El nombre del pool es un campo s&oacute;lo de lectura.</p>
</dd>
<dt>Nombre de asignaci&oacute;n de seguridad</dt>
<dd>
<p>Nombre de la asignaci&oacute;n de seguridad. Este campo es de s&oacute;lo lectura. S&oacute;lo se puede especificar un nombre de asignaci&oacute;n de seguridad cuando cree una nueva asignaci&oacute;n de seguridad.</p>
</dd>
<dt>Nombre de asignaci&oacute;n de seguridad</dt>
<dd>
<p>Nombre de la asignaci&oacute;n de seguridad.</p>
</dd>
<dt>Grupos de usuarios</dt>
<dd>
<p>Si este bot&oacute;n de radio est&aacute; seleccionado, el campo de texto debe contener los nombres de los grupos de usuarios, separados por comas.</p>
</dd>
<dt>Principales</dt>
<dd>
<p>Si este bot&oacute;n de radio est&aacute; seleccionado, el campo de texto debe contener los nombres de los principales, separados por comas.</p>
</dd>
<dt>Nombre de usuario</dt>
<dd>
<p>Nombre de usuario del principal de backend requerido por el EIS.</p>
</dd>
<dt>Contrase&ntilde;a</dt>
<dd>
<p>Contrase&ntilde;a del principal de backend requerida por el EIS.</p>
</dd>
</dl>
<a id="sthref92" name="sthref92"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-connectorconnectionpoolnew.html">Para crear un pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">Para editar un pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">Para editar atributos avanzados del pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">Para editar propiedades de pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">Para crear una asignaci&oacute;n de seguridad para un pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">Para editar una asignaci&oacute;n de seguridad para un pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">Para suprimir una asignaci&oacute;n de seguridad para un pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">Para suprimir un pool de conexiones del conector</a></p>
</li>
</ul>
<a id="sthref93" name="sthref93"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00020"><code>create-connector-security-map</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00159"><code>list-connector-security-maps</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00072"><code>delete-connector-security-map</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00252"><code>update-connector-security-map</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
