<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-worksecuritymaps" name="ref-worksecuritymaps"></a></p>

<h4><a id="sthref106" name="sthref106"></a><a id="sthref107" name="sthref107"></a>Asignaciones de Seguridad de Trabajo</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Asignaciones de Seguridad de Trabajo para configurar las asignaciones de seguridad de trabajo para los adaptadores de recursos.</p>
<p>Una asignaci&oacute;n de seguridad de trabajo asigna la identidad del emisor de la llamada del trabajo enviado por el principal del EIS o un grupo de usuarios del EIS del adaptador de recursos a un principal o grupo de usuarios adecuado del dominio de segurida de GlassFish Server. Se puede asociar una o m&aacute;s asignaciones de seguridad de trabajo a un adaptador de recursos. La configuraci&oacute;n de la asignaci&oacute;n de seguridad de trabajo del conector soporta el uso del car&aacute;cter asterisco como comod&iacute;n (<code>*</code>) para hacer referencia a todos los usuarios o todos los grupos de usuarios.</p>
<p>Una asignaci&oacute;n de seguridad de trabajo es diferente de una asignaci&oacute;n de seguridad para un pool de conexiones de conectores, el cual asigna el principal recibido durante la autenticaci&oacute;n EJB o de servlet a las credenciales aceptadas por el EIS. Consulte <a href="ref-connectorsecuritymaps.html">Asignaciones de seguridad del pool de conexiones del conector</a> para obtener m&aacute;s informaci&oacute;n sobre las asignaciones de seguridad relativas a pools de conexiones de conectores.</p>
<p>El sistema de informaci&oacute;n de empresa (EIS) es cualquier sistema que almacene los datos de una organizaci&oacute;n. Puede ser un mainframe, un sistema de mensajer&iacute;a, un sistema de base de datos o una aplicaci&oacute;n.</p>
<p>Para cada asignaci&oacute;n de seguridad de trabajo, se proporciona la siguiente informaci&oacute;n.</p>
<dl>
<dt>Nombre</dt>
<dd>
<p>Nombre de la asignaci&oacute;n de seguridad de trabajo.</p>
</dd>
</dl>
<p>La tabla Asignaciones de seguridad de trabajo tambi&eacute;n contiene las siguientes opciones.</p>
<dl>
<dt>Nuevo</dt>
<dd>
<p>Bot&oacute;n para crear una nueva asignaci&oacute;n seguridad de trabajo.</p>
</dd>
<dt>Suprimir</dt>
<dd>
<p>Bot&oacute;n para suprimir una o m&aacute;s asignaciones de seguridad de trabajo seleccionadas.</p>
</dd>
</dl>
<a id="sthref108" name="sthref108"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-worksecuritymapnew.html">Para crear una asignaci&oacute;n de seguridad de trabajo</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">Para editar una asignaci&oacute;n de seguridad de trabajo</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">Para suprimir una asignaci&oacute;n de seguridad de trabajo</a></p>
</li>
</ul>
<a id="sthref109" name="sthref109"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00021"><code>create-connector-work-security-map</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00160"><code>list-connector-work-security-maps</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00073"><code>delete-connector-work-security-map</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00253"><code>update-connector-work-security-map</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
