<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-connectorconnectionpoolnew2" name="ref-connectorconnectionpoolnew2"></a><a id="GHJCA00043" name="GHJCA00043"></a></p>

<h4><a id="sthref69" name="sthref69"></a>Nuevo pool de conexiones del conector (paso 2 de 2).</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice el nuevo pool de conexiones del conector (paso 2 de 2) para crear un nuevo pool de conexiones del conector.</p>
<p>La p&aacute;gina Nuevo pool de conexiones del conector (paso 2 de 2) contiene las siguientes opciones.</p>
<dl>
<dt>Ping</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; activada, se hace ping en el pool de conexiones durante la creaci&oacute;n o la nueva configuraci&oacute;n a fin de identificar y advertir si hay valores err&oacute;neos para sus atributos. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Descripci&oacute;n</dt>
<dd>
<p>Descripci&oacute;n del pool de conexiones de conector.</p>
</dd>
<dt>Tama&ntilde;o de pool inicial y m&iacute;nimo:</dt>
<dd>
<p>N&uacute;mero m&iacute;nimo de conexiones del pool de conexiones de conector. El valor por defecto es 8.</p>
</dd>
<dt>Tama&ntilde;o de Pool M&aacute;ximo</dt>
<dd>
<p>N&uacute;mero m&aacute;ximo de conexiones del pool de conexiones de conector. El valor por defecto es 32.</p>
</dd>
<dt>Cantidad de Cambio de Tama&ntilde;o del Pool</dt>
<dd>
<p>N&uacute;mero de conexiones que se pueden eliminar cuando se agota el timeout de inactividad del pool. El valor por defecto es 2.</p>
</dd>
<dt>Timeout de Inactividad</dt>
<dd>
<p>Tiempo m&aacute;ximo, en segundos, que una conexi&oacute;n puede permanecer inactiva en el pool. El valor por defecto es 300.</p>
</dd>
<dt>Tiempo de Espera M&aacute;ximo</dt>
<dd>
<p>Cantidad de tiempo que la aplicaci&oacute;n que solicita una conexi&oacute;n puede esperar para obtener un mensaje de timeout de conexi&oacute;n. El valor por defecto es 60000.</p>
</dd>
<dt>Validaci&oacute;n de la conexi&oacute;n</dt>
<dd>
<p>Si la casilla de control Necesaria est&aacute; activada, las conexiones se validar&aacute;n antes de proporcion&aacute;rselas a la aplicaci&oacute;n. Si falla la validaci&oacute;n de un recurso, &eacute;ste se destruye, y se crea y se devuelve un recurso nuevo. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Ante cualquier fallo</dt>
<dd>
<p>Si se activa la casilla de control Cerrar Todas las Conexiones, GlassFish Server cerrar&aacute; todas las conexiones del pool y las restablecer&aacute; aunque tan s&oacute;lo falle una. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Soporte de Transacci&oacute;n</dt>
<dd>
<p>El soporte de transacci&oacute;n seleccionado sustituye el atributo de soporte de transacci&oacute;n en el adaptador de recursos asociado al pool de conexiones de una forma descendente. Dicho de otro modo, puede soportar un nivel de transacci&oacute;n inferior o id&eacute;ntico al que se especifica en el adaptador de recursos, pero no puede indicar un nivel superior.</p>
<p>El valor puede ser cualquiera de los siguientes:</p>
<dl>
<dt>XATransaction</dt>
<dd>
<p>El adaptador de recursos soporta transacciones JTA y transacciones locales del gestor de recursos mediante la implantaci&oacute;n de las interfaces LocalTransaction y XAResource. Las transacciones XA se controlan y coordinan a trav&eacute;s de un gestor de transacciones externo en un gestor de recursos.</p>
</dd>
<dt>LocalTransaction</dt>
<dd>
<p>El adaptador de recursos soporta transacciones locales mediante la implantaci&oacute;n de la interfaz LocalTransaction. Las transacciones locales se gestionan de manera interna en un gestor de recursos y no involucran a gestores de transacciones externos.</p>
</dd>
<dt>NoTransaction</dt>
<dd>
<p>El adaptador de recursos no soporta transacciones JTA o transacciones locales del gestor de recursos y no implanta las interfaces XAResource o LocalTransaction.</p>
</dd>
</dl>
</dd>
<dt>Propiedades Adicionales</dt>
<dd>
<p>Propiedades adicionales para el pool de conexiones de conector. Las propiedades disponibles dependen del adaptador de recursos para el pool de conexiones de conector. Los pares nombre-valor especificados en esta tabla se pueden usar para sustituir los valores por defecto de las propiedades definidas por el proveedor del adaptador de recursos.</p>
<p>Si especifica un nombre, pero no un valor para una propiedad, &eacute;ste se elimina de la tabla al finalizar la creaci&oacute;n del pool de conexiones. Si no desea definir un valor para una propiedad ahora, pero desea que la propiedad permanezca en la tabla para que el valor se pueda definir m&aacute;s adelante, introduzca un juego de par&eacute;ntesis vac&iacute;o en el campo Valor:</p>
<pre>
()
</pre></dd>
</dl>
<a id="sthref70" name="sthref70"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-connectorconnectionpoolnew.html">Para crear un pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">Para editar un pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">Para editar atributos avanzados del pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">Para editar propiedades de pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">Para crear una asignaci&oacute;n de seguridad para un pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">Para editar una asignaci&oacute;n de seguridad para un pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">Para suprimir una asignaci&oacute;n de seguridad para un pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">Para suprimir un pool de conexiones del conector</a></p>
</li>
</ul>
<a id="sthref71" name="sthref71"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00018"><code>create-connector-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00157"><code>list-connector-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00070"><code>delete-connector-connection-pool</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
