<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-connectionservice" name="ref-connectionservice"></a></p>

<h4><a id="sthref125" name="sthref125"></a>Servicio de Conector</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Servicio de conector para modificar la configuraci&oacute;n general del servicio de conector, que controla los adaptadores de recursos.</p>
<p>La p&aacute;gina Servicio de conector contiene las siguientes opciones.</p>
<dl>
<dt>Cargar Valores por Defecto</dt>
<dd>
<p>Bot&oacute;n para restaurar configuraci&oacute;n que tiene valores por defecto a sus valores por defecto. Las configuraciones que no tienen valores por defecto no se modifican.</p>
</dd>
<dt>Nombre de Configuraci&oacute;n</dt>
<dd>
<p>Nombre de la configuraci&oacute;n a la que se aplican los valores de esta p&aacute;gina. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>Timeout de cierre</dt>
<dd>
<p>N&uacute;mero m&aacute;ximo de segundos permitidos durante el cierre de GlassFish Server para que se complete el m&eacute;todo <code>ResourceAdapter.stop</code> de una instancia del m&oacute;dulo del conector. Los adaptadores de recursos que tarden m&aacute;s en cerrarse se ignoran y contin&uacute;a el cierre de GlassFish Server. El valor por defecto es 30 segundos.</p>
</dd>
<dt>Pol&iacute;tica de carga de clases del conector</dt>
<dd>
<p>Pol&iacute;tica que se utiliza para cargar las clases. Las opciones disponibles son:</p>
<dl>
<dt><code>derivada</code></dt>
<dd>
<p>Indica que los adaptadores de recursos se proporcionan en funci&oacute;n de las referencias de una aplicaci&oacute;n a cualquiera de los recursos del adaptador de recursos. Se trata de la pol&iacute;tica por defecto.</p>
</dd>
<dt><code>global</code></dt>
<dd>
<p>Indica que todos los adaptadores de recursos ser&aacute;n visibles en todas las aplicaciones.</p>
</dd>
</dl>
<p>Esta pol&iacute;tica no se aplica al adaptador de recursos del sistema JMS preinstalado, <code>jmsra</code>, que es siempre visible en todas las aplicaciones.</p>
</dd>
</dl>
<a id="sthref126" name="sthref126"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-connectionservice.html">Para configurar el servicio de conector</a></p>
</li>
<li>
<p><a href="../../../common/en/help/task-appdeployconn.html">Para desplegar un m&oacute;dulo del conector</a></p>
</li>
</ul>
<a id="sthref127" name="sthref127"></a>
<h5>Comandos asadmin Relacionados</h5>
<p>Ninguno.</p>





<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
