<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-connectorconnectionpooladvance" name="ref-connectorconnectionpooladvance"></a></p>

<h4><a id="sthref78" name="sthref78"></a>Editar atributos avanzados del pool de conexiones de conector</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Editar atributos avanzados del pool de conexiones de conector para modificar la configuraci&oacute;n avanzada de un pool de conexiones del conector.</p>
<p>La p&aacute;gina Editar atributos avanzados del pool de conexiones de conector presenta las opciones siguientes:</p>
<dl>
<dt>Cargar Valores por Defecto</dt>
<dd>
<p>Bot&oacute;n para restaurar configuraci&oacute;n que tiene valores por defecto a sus valores por defecto. Las configuraciones que no tienen valores por defecto no se modifican.</p>
</dd>
<dt>Validar como m&aacute;ximo una vez</dt>
<dd>
<p>Especifica el intervalo de tiempo, en segundos, entre solicitudes consecutivas para validar una conexi&oacute;n como m&aacute;ximo una vez. El valor por defecto es 0, lo que significa que el atributo no est&aacute; activado.</p>
</dd>
<dt>Timeout de p&eacute;rdida</dt>
<dd>
<p>Duraci&oacute;n de tiempo, en segundos, para realizar un seguimiento de las p&eacute;rdidas de conexi&oacute;n en un pool de conexiones. El valor 0 indica que el seguimiento de p&eacute;rdidas de conexi&oacute;n est&aacute; desactivado. El valor por defecto es 0.</p>
</dd>
<dt>Recuperaci&oacute;n de p&eacute;rdida:</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, las conexiones perdidas se restaurar&aacute;n en el pool una vez finalizado el seguimiento de las p&eacute;rdidas de conexi&oacute;n. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Reintentos de creaci&oacute;n</dt>
<dd>
<p>N&uacute;mero de intentos que se realizar&aacute;n si se produce un fallo al crear una nueva conexi&oacute;n. El valor de 0 significa que no se realizar&aacute; ning&uacute;n intento para crear la conexi&oacute;n de nuevo. El valor por defecto es 0.</p>
</dd>
<dt>Intervalo de reintento</dt>
<dd>
<p>Intervalo, en segundos, entre dos intentos para crear una conexi&oacute;n. Este atributo se utiliza s&oacute;lo si el valor de Intentos de creaci&oacute;n es mayor que 0. El valor por defecto es 10 segundos.</p>
</dd>
<dt>Pool</dt>
<dd>
<p>Permite crear pool de conexiones en el pool. Esta opci&oacute;n se encuentra activada por defecto.</p>
</dd>
<dt>Asociaci&oacute;n lenta</dt>
<dd>
<p>Si se selecciona esta opci&oacute;n, las conexiones se asocian de forma lenta cuando se realiza una operaci&oacute;n en ellas. Las conexiones se disocian cuando la transacci&oacute;n se completa y un m&eacute;todo de componentes finaliza, lo que ayuda a reutilizar las conexiones f&iacute;sicas. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Inscripci&oacute;n lenta de conexiones</dt>
<dd>
<p>Si se selecciona esta opci&oacute;n, s&oacute;lo se inscribe un recurso en la transacci&oacute;n cuando realmente se utiliza en un m&eacute;todo. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Asociar a thread</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, la conexi&oacute;n est&aacute; asociada a un thread. Cuando el mismo thread necesita una conexi&oacute;n, se puede volver a utilizar la conexi&oacute;n ya asociada a ese thread y, por tanto, no se incurra en una sobrecarga a la hora de obtener una conexi&oacute;n del pool. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Conexiones coincidentes</dt>
<dd>
<p>Si selecciona esta opci&oacute;n, la coincidencia de conexiones est&aacute; activada en el pool. Esta opci&oacute;n se puede desactivar si sabe que las conexiones del pool siempre ser&aacute;n homog&eacute;neas y, por tanto, el adaptador de recursos no necesitar&aacute; buscar una coincidencia de una conexi&oacute;n seleccionada del pool. Esta opci&oacute;n se encuentra activada por defecto.</p>
</dd>
<dt>Uso de conexiones coincidentes</dt>
<dd>
<p>N&uacute;mero de veces que el pool debe reutilizar una conexi&oacute;n. La conexi&oacute;n se cerrar&aacute; una vez reutilizada durante un n&uacute;mero espec&iacute;fico de veces. El valor 0 indica que el atributo no est&aacute; activado. El valor por defecto es 0.</p>
</dd>
</dl>
<a id="sthref79" name="sthref79"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-connectorconnectionpoolnew.html">Para crear un pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">Para editar un pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">Para editar atributos avanzados del pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">Para editar propiedades de pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">Para crear una asignaci&oacute;n de seguridad para un pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">Para editar una asignaci&oacute;n de seguridad para un pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">Para suprimir una asignaci&oacute;n de seguridad para un pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">Para suprimir un pool de conexiones del conector</a></p>
</li>
</ul>
<a id="sthref80" name="sthref80"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00018"><code>create-connector-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00157"><code>list-connector-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00070"><code>delete-connector-connection-pool</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
