<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-worksecuritymapnew" name="ref-worksecuritymapnew"></a></p>

<h4><a id="sthref107" name="sthref107"></a><a id="sthref108" name="sthref108"></a>Nueva asignaci&oacute;n de seguridad de trabajo</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Nueva asignaci&oacute;n de seguridad de trabajo para crear una nueva asignaci&oacute;n de seguridad de trabajo.</p>
<p>La p&aacute;gina Nueva asignaci&oacute;n de seguridad de trabajo contiene las siguientes opciones.</p>
<dl>
<dt>Nombre de asignaci&oacute;n de seguridad</dt>
<dd>
<p>Nombre de la asignaci&oacute;n de seguridad de trabajo.</p>
</dd>
<dt>Grupo</dt>
<dd>
<p>Si el bot&oacute;n de radio Asignaci&oacute;n de Grupo est&aacute; activado, el campo de texto debe especificar una asignaci&oacute;n de cada grupo de usuarios EIS de backend al grupo de usuarios correspondiente definido en el dominio de seguridad de GlassFish Server. Utilice una lista separada por comas para especificar m&aacute;s de una asignaci&oacute;n. Por ejemplo:</p>
<pre>
eis-group-1=server-group-1,eis-group-2=server-group-2
</pre></dd>
<dt>Principal</dt>
<dd>
<p>Si el bot&oacute;n de radio Asignaci&oacute;n de Principal est&aacute; activado, el campo de texto debe especificar una asignaci&oacute;n de cada principal EIS de backend al principal correspondiente definido en el dominio de seguridad de GlassFish Server. Utilice una lista separada por comas para especificar m&aacute;s de una asignaci&oacute;n. Por ejemplo:</p>
<pre>
eis-principal-1=server-principal-1,eis-principal-2=server-principal-2
</pre></dd>
<dt>Adaptador de recursos</dt>
<dd>
<p>Adaptador de recursos para el EIS.</p>
</dd>
<dt>Descripci&oacute;n</dt>
<dd>
<p>Descripci&oacute;n de la asignaci&oacute;n de seguridad de trabajo.</p>
</dd>
<dt>Estado</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, la asignaci&oacute;n de seguridad de trabajo est&aacute; activada. Esta opci&oacute;n se encuentra activada por defecto.</p>
</dd>
</dl>
<a id="sthref109" name="sthref109"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-worksecuritymapnew.html">Para crear una asignaci&oacute;n de seguridad de trabajo</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">Para editar una asignaci&oacute;n de seguridad de trabajo</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">Para suprimir una asignaci&oacute;n de seguridad de trabajo</a></p>
</li>
</ul>
<a id="sthref110" name="sthref110"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00021"><code>create-connector-work-security-map</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00160"><code>list-connector-work-security-maps</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00073"><code>delete-connector-work-security-map</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00253"><code>update-connector-work-security-map</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
