<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-resourceadapterconfig" name="ref-resourceadapterconfig"></a><a id="GHJCA00056" name="GHJCA00056"></a></p>

<h4><a id="sthref113" name="sthref113"></a>Configuraciones del Adaptador de Recursos</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Configuraciones del adaptador de recursos para gestionar las configuraciones del conector (adaptador de recursos).</p>
<p>La configuraci&oacute;n del adaptador de recursos proporciona informaci&oacute;n de configuraci&oacute;n para un adaptador de recursos. Con la Consola de administraci&oacute;n puedes crear una configuraci&oacute;n del adaptador de recursos despu&eacute;s de desplegar dicho adaptador. En este caso, el adaptador de recursos se reinicia con la nueva configuraci&oacute;n. Para crear una configuraci&oacute;n del adaptador de recursos antes de desplegar dicho adaptador, utilice el comando <code>asadmin create-resource-adapter-config</code>.</p>
<p>Antes de que pueda crear una configuraci&oacute;n del adaptador de recursos, debe crear un pool de threads para que lo utilice dicho adaptador.</p>
<p>Para la configuraci&oacute;n de cada adaptador de recursos, se proporciona la siguiente informaci&oacute;n.</p>
<dl>
<dt>Nombre</dt>
<dd>
<p>Nombre del adaptador de recursos.</p>
</dd>
</dl>
<p>La tabla Configuraciones tambi&eacute;n contiene las siguientes opciones.</p>
<dl>
<dt>Nuevo</dt>
<dd>
<p>Bot&oacute;n para crear una nueva configuraci&oacute;n del adaptador de recursos.</p>
</dd>
<dt>Suprimir</dt>
<dd>
<p>Bot&oacute;n para suprimir una o m&aacute;s configuraciones seleccionadas del adaptador de recursos.</p>
</dd>
</dl>
<a id="sthref114" name="sthref114"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-resourceadapterconfignew.html">Para crear la configuraci&oacute;n del adaptador de recursos</a></p>
</li>
<li>
<p><a href="task-resourceadapterconfigedit.html">Para editar la configuraci&oacute;n del adaptador de recursos</a></p>
</li>
<li>
<p><a href="task-resourceadapterconfigdelete.html">Para suprimir la configuraci&oacute;n del adaptador de recursos</a></p>
</li>
</ul>
<a id="sthref115" name="sthref115"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00054"><code>create-resource-adapter-config</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00196"><code>list-resource-adapter-configs</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00106"><code>delete-resource-adapter-config</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
