<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-adminobjectedit" name="task-adminobjectedit"></a></p>

<h4><a id="sthref32" name="sthref32"></a>Para editar un recurso de objeto administrado</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Recursos.</p>
</li>
<li>
<p>Ampl&iacute;e el nodo Conectores.</p>
</li>
<li>
<p>En el nodo Conectores, seleccione el nodo Recursos de objeto administrado.</p>
<p>Se abrir&aacute; la p&aacute;gina Recursos de objeto administrado</p>
</li>
<li>
<p>En la p&aacute;gina Recursos de objeto administrado, haga clic en el nombre del recurso de objeto administrado que se est&aacute; editando.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar recurso de objeto administrado.</p>
</li>
<li>
<p>En la lista desplegable Adaptador de recursos, seleccione el adaptador de recursos para el recurso de objeto administrado.</p>
</li>
<li>
<p>En la lista desplegable Tipo de recurso, seleccione el tipo Java para el recurso de objeto administrado.</p>
</li>
<li>
<p>En la lista desplegable Nombre de clase, seleccione el nombre de clase de implantaci&oacute;n asociado al tipo de recurso.</p>
</li>
<li>
<p>En el campo Descripci&oacute;n, introduzca una descripci&oacute;n del recurso de objeto administrado.</p>
</li>
<li>
<p>Active la casilla de control Estado activado para activar el recurso de objeto administrado.</p>
<p>Esta opci&oacute;n se encuentra activada por defecto.</p>
</li>
<li>
<p>En la tabla Propiedades adicionales, especifique las propiedades adicionales para el recurso de objeto administrado.</p>
<p>Las propiedades disponibles dependen del adaptador de recursos para el pool de conexiones de conector.</p>
<ul>
<li>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, introduzca el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
</li>
<li>
<p>Para modificar una propiedad, edite el campo Valor.</p>
</li>
<li>
<p>Para suprimir una propiedad, active la casilla de control a la izquierda del campo Nombre de la propiedad que est&aacute; suprimiendo y, a continuaci&oacute;n, haga clic en el bot&oacute;n Suprimir Propiedades.</p>
</li>
</ul>
</li>
<li>
<p>En el separador Destino, haga clic en Gestionar destinos para editar los destinos en los que el objeto administrado est&aacute; desplegado.</p>
<p>Vuelva a la p&aacute;gina Editar recurso de objeto administrado haciendo clic en el separador General.</p>
</li>
<li>
<p>Haga clic en Guardar.</p>

<hr>
<p><b>Sugerencia:</b></p>
Para volver a la configuraci&oacute;n por defecto, haga clic en el bot&oacute;n Cargar Valores por Defecto y, a continuaci&oacute;n, en Guardar.
<hr>

</li>
</ol>
<a id="sthref33" name="sthref33"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-connectorresourcenew.html">Para crear un recurso de conectores</a></p>
</li>
<li>
<p><a href="task-connectorresourceedit.html">Para editar un recurso de conector</a></p>
</li>
<li>
<p><a href="task-connectorresourcesdelete.html">Para suprimir un recurso de conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolnew.html">Para crear un pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">Para editar un pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">Para editar atributos avanzados del pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">Para editar propiedades de pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">Para crear una asignaci&oacute;n de seguridad para un pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">Para editar una asignaci&oacute;n de seguridad para un pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">Para suprimir una asignaci&oacute;n de seguridad para un pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">Para suprimir un pool de conexiones del conector</a></p>
</li>
<li>
<p><a href="task-setupeisaccess.html">Para configurar acceso de EIS</a></p>
</li>
<li>
<p><a href="task-adminobjectnew.html">Para crear un recurso de objeto administrado</a></p>
</li>
<li>
<p><a href="task-administeredobjectresourcedelete.html">Para suprimir un recurso de objeto administrado</a></p>
</li>
<li>
<p><a href="task-worksecuritymapnew.html">Para crear una asignaci&oacute;n de seguridad de trabajo</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">Para editar una asignaci&oacute;n de seguridad de trabajo</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">Para suprimir una asignaci&oacute;n de seguridad de trabajo</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
