<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-connectorconnectionpooladvance" name="task-connectorconnectionpooladvance"></a></p>

<h4><a id="sthref14" name="sthref14"></a>Para editar atributos avanzados del pool de conexiones de conector</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Recursos.</p>
</li>
<li>
<p>Ampl&iacute;e el nodo Conectores.</p>
</li>
<li>
<p>En el nodo Configuraci&oacute;n, seleccione el nodo Pools de conexiones de conector.</p>
<p>Se abrir&aacute; la p&aacute;gina Pools de conexiones de conectores.</p>
</li>
<li>
<p>En la p&aacute;gina Pool de conexiones de conectores, haga clic en el nombre del pool de conexiones de conector que desee editar.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar pool de conexiones del conector.</p>
</li>
<li>
<p>En la p&aacute;gina Editar Pool de Conexiones de Conector, haga clic en el separador Avanzado.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar atributos avanzados del pool de conexiones de conector</p>
</li>
<li>
<p>En el campo Validar al menos una vez, introduzca el tiempo, en segundos, tras el cual se valida una conexi&oacute;n al menos una vez.</p>
<p>Si se define este atributo con un valor apropiado se minimiza el n&uacute;mero de solicitudes de validaci&oacute;n por conexi&oacute;n. El valor por defecto es 0, lo que significa que el atributo no est&aacute; activado.</p>
</li>
<li>
<p>En el campo Timeout de p&eacute;rdida, introduzca el tiempo, en segundos, para realizar un seguimiento de las p&eacute;rdidas de conexi&oacute;n de un pool de conexiones.</p>
<p>El valor 0 indica que el seguimiento de p&eacute;rdidas de conexi&oacute;n est&aacute; desactivado. El valor por defecto es 0.</p>
</li>
<li>
<p>Active la casilla de control Recuperaci&oacute;n de p&eacute;rdida para restaurar las conexiones perdidas en el pool una vez haya finalizado el seguimiento de p&eacute;rdidas de conexi&oacute;n.</p>
<p>Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>En el campo Reintentos de creaci&oacute;n, introduzca el n&uacute;mero de intentos que se realizar&aacute;n si se produjera un fallo al crear una conexi&oacute;n nueva.</p>
<p>El valor de 0 significa que no se realizar&aacute; ning&uacute;n intento para crear la conexi&oacute;n de nuevo. El valor por defecto es 0.</p>
</li>
<li>
<p>En el campo Intervalo de reintentos, introduzca el intervalo, en segundos, que hay entre dos intentos de creaci&oacute;n de una conexi&oacute;n.</p>
<p>Este atributo se utiliza s&oacute;lo si el valor de Intentos de creaci&oacute;n es mayor que 0. El valor por defecto es 10 segundos.</p>
</li>
<li>
<p>Active la casilla de control Pool para activar pool de conexiones para el pool.</p>
<p>Esta opci&oacute;n se encuentra activada por defecto.</p>
</li>
<li>
<p>Active la casilla de control Asociaci&oacute;n lenta para permitir que las conexiones se asocien de forma lenta cuando se realice una operaci&oacute;n con ellas.</p>
<p>Las conexiones se disocian cuando la transacci&oacute;n se completa y un m&eacute;todo de componentes finaliza, lo que ayuda a reutilizar las conexiones f&iacute;sicas. Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>Active la casilla de control Inscripci&oacute;n lenta de conexiones para inscribir un recurso en la transacci&oacute;n s&oacute;lo cuando se est&eacute; utilizando en ese instante en un m&eacute;todo.</p>
<p>Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>Active la casilla de control Asociar a thread para asociar una conexi&oacute;n a un thread.</p>
<p>Cuando el mismo thread necesita una conexi&oacute;n, se puede volver a utilizar la conexi&oacute;n ya asociada a ese thread y, por tanto, no se incurra en una sobrecarga a la hora de obtener una conexi&oacute;n del pool. Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>Active la casilla de control Conexiones Coincidentes para activar la coincidencia de conexi&oacute;n para el pool.</p>
<p>Esta opci&oacute;n se puede desactivada si sabe que las conexiones del pool siempre ser&aacute;n homog&eacute;neas y, por tanto, el adaptador de recursos no necesitar&aacute; buscar una coincidencia de una conexi&oacute;n seleccionada del pool. Esta opci&oacute;n se encuentra activada por defecto.</p>
</li>
<li>
<p>En el campo Uso de la coincidencia de conexiones, introduzca el n&uacute;mero de veces que el pool debe usar una conexi&oacute;n.</p>
<p>La conexi&oacute;n se cerrar&aacute; una vez reutilizada durante un n&uacute;mero espec&iacute;fico de veces. El valor 0 indica que el atributo no est&aacute; activado. El valor por defecto es 0.</p>
</li>
<li>
<p>Haga clic en Guardar.</p>

<hr>
<p><b>Sugerencia:</b></p>
Para volver a la configuraci&oacute;n por defecto, haga clic en el bot&oacute;n Cargar Valores por Defecto y, a continuaci&oacute;n, en Guardar.
<hr>

</li>
</ol>
<a id="sthref15" name="sthref15"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-connectorresourcenew.html">Para crear un recurso de conectores</a></p>
</li>
<li>
<p><a href="task-connectorresourceedit.html">Para editar un recurso de conector</a></p>
</li>
<li>
<p><a href="task-connectorresourcesdelete.html">Para suprimir un recurso de conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolnew.html">Para crear un pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">Para editar un pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">Para editar propiedades de pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">Para crear una asignaci&oacute;n de seguridad para un pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">Para editar una asignaci&oacute;n de seguridad para un pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">Para suprimir una asignaci&oacute;n de seguridad para un pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">Para suprimir un pool de conexiones del conector</a></p>
</li>
<li>
<p><a href="task-setupeisaccess.html">Para configurar acceso de EIS</a></p>
</li>
<li>
<p><a href="task-adminobjectnew.html">Para crear un recurso de objeto administrado</a></p>
</li>
<li>
<p><a href="task-adminobjectedit.html">Para editar un recurso de objeto administrado</a></p>
</li>
<li>
<p><a href="task-administeredobjectresourcedelete.html">Para suprimir un recurso de objeto administrado</a></p>
</li>
<li>
<p><a href="task-worksecuritymapnew.html">Para crear una asignaci&oacute;n de seguridad de trabajo</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">Para editar una asignaci&oacute;n de seguridad de trabajo</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">Para suprimir una asignaci&oacute;n de seguridad de trabajo</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
