<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-connectorconnectionpoolnew" name="task-connectorconnectionpoolnew"></a><a id="GHJCA00063" name="GHJCA00063"></a></p>

<h4><a id="sthref9" name="sthref9"></a>Para crear un pool de conexiones de conector</h4>
<a name="BEGIN" id="BEGIN"></a><a id="sthref10" name="sthref10"></a>
<h5>Antes de Empezar</h5>
<p>Antes de crear el pool, implante el m&oacute;dulo del conector (adaptador de recursos) asociado al pool. Los valores que se especifican para el nuevo pool dependen del m&oacute;dulo de conector que se despliegue.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Recursos.</p>
</li>
<li>
<p>Ampl&iacute;e el nodo Conectores.</p>
</li>
<li>
<p>En el nodo Configuraci&oacute;n, seleccione el nodo Pools de conexiones de conector.</p>
<p>Se abrir&aacute; la p&aacute;gina Pools de conexiones de conectores.</p>
</li>
<li>
<p>En la p&aacute;gina Pools de conexiones de conectores, haga clic en Nuevo.</p>
<p>Se abrir&aacute; la p&aacute;gina Nuevo Pool de Conexiones del Conector (paso 1 de 2).</p>
</li>
<li>
<p>En el campo Nombre de pool, asigne un nombre &uacute;nico al pool.</p>
<p>Especifique este nombre cuando cree un recurso de conector.</p>
</li>
<li>
<p>En la lista desplegable Adaptador de recursos, haga una selecci&oacute;n en la lista de adaptadores de recursos implantados (m&oacute;dulos de conector).</p>
</li>
<li>
<p>En la lista desplegable Definici&oacute;n de Conexi&oacute;n, seleccione la definici&oacute;n de conexi&oacute;n para el pool de conexiones del conector.</p>
<p>Las opciones de la lista dependen del adaptador de recursos seleccionado. La definici&oacute;n de conexi&oacute;n identifica un elemento <code>connection-definition</code> del adaptador de recursos en el archivo <code>ra.xml</code>.</p>
</li>
<li>
<p>Haga clic en Siguiente.</p>
<p>Se abrir&aacute; la p&aacute;gina Nuevo Pool de Conexiones del Conector (paso 2 de 2).</p>
</li>
<li>
<p>Active la casilla de control de activaci&oacute;n de ping para hacer ping en el pool de conexiones durante la creaci&oacute;n o reconfiguraci&oacute;n para identificar los valores err&oacute;neos de sus atributos y avisar de ellos.</p>
<p>Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>En el campo Descripci&oacute;n, introduzca una descripci&oacute;n del pool de conexiones.</p>
</li>
<li>
<p>En el campo Tama&ntilde;o de Pool Inicial y M&iacute;nimo, introduzca el n&uacute;mero m&iacute;nimo de conexiones del pool.</p>
<p>El valor por defecto es 8.</p>
</li>
<li>
<p>En el campo Tama&ntilde;o de Pool M&aacute;ximo, introduzca el n&uacute;mero m&aacute;ximo de conexiones de este pool.</p>
<p>El valor por defecto es 32.</p>
</li>
<li>
<p>En el campo Cantidad de Cambio de Tama&ntilde;o del Pool, especifique el n&uacute;mero de conexiones que se eliminar&aacute;n cuando se supere el timeout l&iacute;mite de inactividad del pool.</p>
<p>El valor por defecto es 2.</p>
</li>
<li>
<p>En el campo Timeout de Inactividad, indique el tiempo m&aacute;ximo en segundos que una conexi&oacute;n puede permanecer inactiva en el pool.</p>
<p>El valor por defecto es 300.</p>
</li>
<li>
<p>En el campo Tiempo de Espera M&aacute;ximo, indique la cantidad de tiempo que la aplicaci&oacute;n que solicita una conexi&oacute;n puede esperar para obtener un mensaje de timeout de conexi&oacute;n.</p>
<p>El valor por defecto es 60000.</p>
</li>
<li>
<p>Active la casilla de control Validaci&oacute;n de conexi&oacute;n necesaria para activar la validaci&oacute;n de la conexi&oacute;n.</p>
<p>Si la casilla de control Necesaria est&aacute; activada, las conexiones se validar&aacute;n antes de proporcion&aacute;rselas a la aplicaci&oacute;n. Si falla la validaci&oacute;n de un recurso, &eacute;ste se destruye, y se crea y se devuelve un recurso nuevo. Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>Active la casilla de control Ante Cualquier Fallo Cerrar Todas las Conexiones, para que GlassFish Server cierre todas las conexiones del pool y las restablezca aunque tan s&oacute;lo falle una.</p>
<p>Si no activa esta casilla de control, las conexiones individuales se restablecer&aacute;n s&oacute;lo cuando vaya a utilizarlas. Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>Utilice la lista desplegable Soporte de Transacci&oacute;n para seleccionar el tipo de soporte de transacci&oacute;n para el pool de conexiones.</p>
<p>El soporte de transacci&oacute;n seleccionado sustituye el atributo de soporte de transacci&oacute;n en el adaptador de recursos asociado al pool de conexiones de una forma descendente. Dicho de otro modo, puede soportar un nivel de transacci&oacute;n inferior o id&eacute;ntico al que se especifica en el adaptador de recursos, pero no puede indicar un nivel superior.</p>
<p>Las opciones siguientes est&aacute;n disponibles en la lista desplegable:</p>
<ul>
<li>
<p>NoTransaction: indica que el adaptador de recursos no soporta transacciones JTA o transacciones locales del gestor de recursos y no implanta las interfaces XAResource o LocalTransaction.</p>
</li>
<li>
<p>LocalTransaction: indica que el adaptador de recursos soporta transacciones locales mediante la implantaci&oacute;n de la interfaz LocalTransaction.</p>
<p>Las transacciones locales se gestionan de manera interna en un gestor de recursos y no involucran a gestores de transacciones externos.</p>
</li>
<li>
<p>XATransaction: indica que el adaptador de recursos soporta transacciones JTA y transacciones locales del gestor de recursos mediante la implantaci&oacute;n de las interfaces LocalTransaction y XAResource.</p>
<p>Las transacciones XA se controlan y coordinan a trav&eacute;s de un gestor de transacciones externo en un gestor de recursos.</p>
</li>
</ul>
</li>
<li>
<p>En la secci&oacute;n Propiedades adicionales, especifique propiedades adicionales del pool de conexiones de conector.</p>
<p>Las propiedades disponibles dependen del adaptador de recursos para el pool de conexiones de conector.</p>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, introduzca el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
<p>Si especifica un nombre, pero no un valor para una propiedad, &eacute;ste se elimina de la tabla al finalizar la creaci&oacute;n del pool de conexiones. Si no desea definir un valor para una propiedad ahora, pero desea que la propiedad permanezca en la tabla para que el valor se pueda definir m&aacute;s adelante, introduzca un juego de par&eacute;ntesis vac&iacute;o en el campo Valor:</p>
<pre>
()
</pre></li>
<li>
<p>Haga clic en Aceptar.</p>
</li>
</ol>
<a id="sthref11" name="sthref11"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-connectorresourcenew.html">Para crear un recurso de conectores</a></p>
</li>
<li>
<p><a href="task-connectorresourceedit.html">Para editar un recurso de conector</a></p>
</li>
<li>
<p><a href="task-connectorresourcesdelete.html">Para suprimir un recurso de conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">Para editar un pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">Para editar atributos avanzados del pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">Para editar propiedades de pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">Para crear una asignaci&oacute;n de seguridad para un pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">Para editar una asignaci&oacute;n de seguridad para un pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">Para suprimir una asignaci&oacute;n de seguridad para un pool de conexiones de conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">Para suprimir un pool de conexiones del conector</a></p>
</li>
<li>
<p><a href="task-setupeisaccess.html">Para configurar acceso de EIS</a></p>
</li>
<li>
<p><a href="task-adminobjectnew.html">Para crear un recurso de objeto administrado</a></p>
</li>
<li>
<p><a href="task-adminobjectedit.html">Para editar un recurso de objeto administrado</a></p>
</li>
<li>
<p><a href="task-administeredobjectresourcedelete.html">Para suprimir un recurso de objeto administrado</a></p>
</li>
<li>
<p><a href="task-worksecuritymapnew.html">Para crear una asignaci&oacute;n de seguridad de trabajo</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">Para editar una asignaci&oacute;n de seguridad de trabajo</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">Para suprimir una asignaci&oacute;n de seguridad de trabajo</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
