<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-connectionservice" name="task-connectionservice"></a><a id="GHJCA00081" name="GHJCA00081"></a></p>

<h4><a id="sthref51" name="sthref51"></a>Para configurar el servicio de conector</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Configuraci&oacute;n.</p>
</li>
<li>
<p>En el nodo Configuraci&oacute;n, seleccione el nodo Servicio de conector.</p>
<p>Se abrir&aacute; la p&aacute;gina Servicio de conector.</p>
</li>
<li>
<p>En el campo Timeout de cierre, escriba el n&uacute;mero m&aacute;ximo de segundos permitidos durante el cierre de GlassFish Server para que se complete el m&eacute;todo <code>ResourceAdapter.stop</code> de una instancia del m&oacute;dulo del conector.</p>
<p>Los adaptadores de recursos que tarden m&aacute;s en cerrarse se ignoran y contin&uacute;a el cierre de GlassFish Server. El valor por defecto es 30 segundos.</p>
</li>
<li>
<p>En la lista desplegable Pol&iacute;tica de carga de clases del conector, seleccione la pol&iacute;tica que se va a utilizar.</p>
<ul>
<li>
<p>Seleccione <code>derivados</code> para especificar que los adaptadores de recursos se proporcionan en funci&oacute;n de las referencias de una aplicaci&oacute;n a cualquiera de los recursos del adaptador de recursos.</p>
<p>Se trata de la pol&iacute;tica por defecto.</p>
</li>
<li>
<p>Seleccione <code>global</code> para especificar que todos los adaptadores de recursos ser&aacute;n visibles en todas las aplicaciones.</p>
</li>
</ul>
<p>Esta pol&iacute;tica no se aplica al adaptador de recursos del sistema JMS preinstalado, <code>jmsra</code>, que es siempre visible en todas las aplicaciones.</p>
</li>
<li>
<p>Haga clic en Guardar.</p>

<hr>
<p><b>Sugerencia:</b></p>
Para volver a la configuraci&oacute;n por defecto, haga clic en el bot&oacute;n Cargar Valores por Defecto y, a continuaci&oacute;n, en Guardar.
<hr>

</li>
</ol>
<a id="sthref52" name="sthref52"></a>
<h5>Consulte tambi&eacute;n</h5>
<p><a href="../../../common/en/help/task-appdeployconn.html">Para desplegar un m&oacute;dulo del conector</a></p>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
