<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-batchjobsconfiguration" name="ref-batchjobsconfiguration"></a></p>

<h4>&#12496;&#12483;&#12481;&#12539;&#12521;&#12531;&#12479;&#12452;&#12512;&#12398;&#27083;&#25104;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>GlassFish Server&#12399;&#12289;&#12496;&#12483;&#12481;&#12539;&#12472;&#12519;&#12502;&#12398;&#12473;&#12465;&#12472;&#12517;&#12540;&#12523;&#12392;&#23455;&#34892;&#29992;&#12395;&#12496;&#12483;&#12481;&#12539;&#12521;&#12531;&#12479;&#12452;&#12512;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;&#12496;&#12483;&#12481;&#12539;&#12472;&#12519;&#12502;&#12399;&#19968;&#33324;&#30340;&#12395;&#12289;&#38263;&#26399;&#23455;&#34892;&#12398;&#12496;&#12523;&#12463;&#25351;&#21521;&#12398;&#12479;&#12473;&#12463;&#12391;&#12289;&#19968;&#36899;&#12398;&#12473;&#12486;&#12483;&#12503;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;&#12496;&#12483;&#12481;&#12539;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12496;&#12483;&#12481;&#12539;&#12521;&#12531;&#12479;&#12452;&#12512;&#12395;&#12472;&#12519;&#12502;&#12434;&#36865;&#20449;&#12375;&#12289;&#12473;&#12486;&#12483;&#12503;&#12398;&#23455;&#34892;&#26041;&#27861;&#12420;&#12479;&#12452;&#12511;&#12531;&#12464;&#12434;&#25351;&#31034;&#12375;&#12414;&#12377;&#12290;&#12496;&#12483;&#12481;&#12539;&#12521;&#12531;&#12479;&#12452;&#12512;&#12399;&#12473;&#12486;&#12483;&#12503;&#12434;&#20966;&#29702;&#12375;&#12289;&#12472;&#12519;&#12502;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12398;&#12472;&#12519;&#12502;&#12395;&#38306;&#12377;&#12427;&#24773;&#22577;&#12434;&#26684;&#32013;&#12375;&#12414;&#12377;&#12290;GlassFish Server&#12391;&#12399;&#12289;&#12472;&#12519;&#12502;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12399;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12391;&#12377;&#12290;</p>
<p>&#12496;&#12483;&#12481;&#12539;&#12521;&#12531;&#12479;&#12452;&#12512;&#12398;&#27083;&#25104;&#12434;&#34920;&#31034;&#12362;&#12424;&#12403;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;&#12289;&#12496;&#12483;&#12481;&#12539;&#12521;&#12531;&#12479;&#12452;&#12512;&#12398;&#27083;&#25104;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#12496;&#12483;&#12481;&#12539;&#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12399;&#12289;&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12362;&#12424;&#12403;&#12487;&#12540;&#12479;&#12539;&#12477;&#12540;&#12473;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12496;&#12483;&#12481;&#12539;&#12472;&#12519;&#12502;&#12364;&#23455;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12399;&#12472;&#12519;&#12502;&#12395;&#12473;&#12524;&#12483;&#12489;&#12434;&#25552;&#20379;&#12375;&#12289;&#12487;&#12540;&#12479;&#12539;&#12477;&#12540;&#12473;&#12395;&#12472;&#12519;&#12502;&#24773;&#22577;&#12364;&#26684;&#32013;&#12373;&#12428;&#12414;&#12377;&#12290;&#12496;&#12483;&#12481;&#23455;&#34892;&#26178;&#12398;&#27083;&#25104;&#12487;&#12540;&#12479;&#12399;&#12289;<code>domain.xml</code>&#12398;<code>config</code>&#35201;&#32032;&#12395;&#26684;&#32013;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<p>&#12496;&#12483;&#12481;&#12539;&#12521;&#12531;&#12479;&#12452;&#12512;&#12398;&#27083;&#25104;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#24773;&#22577;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21517;</dt>
<dt>&#12463;&#12521;&#12473;&#12479;&#21517;</dt>
<dd>
<p>&#27083;&#25104;&#12364;&#36969;&#29992;&#12373;&#12428;&#12427;GlassFish&#12463;&#12521;&#12473;&#12479;&#12414;&#12383;&#12399;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#21517;&#21069;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12539;&#12523;&#12483;&#12463;&#12450;&#12483;&#12503;&#21517;</dt>
<dd>
<p>&#12496;&#12483;&#12481;&#12539;&#12472;&#12519;&#12502;&#12395;&#12473;&#12524;&#12483;&#12489;&#12434;&#25552;&#20379;&#12377;&#12427;&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12398;JNDI&#12523;&#12483;&#12463;&#12450;&#12483;&#12503;&#21517;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12399;&#12289;<code>concurrent/__defaultManagedExecutorService</code>&#12391;&#12377;&#12290;</p>
<p>&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12399;&#12289;&#12496;&#12483;&#12481;&#12539;&#12472;&#12519;&#12502;&#12364;&#12496;&#12483;&#12481;&#12539;&#12521;&#12531;&#12479;&#12452;&#12512;&#12395;&#36865;&#20449;&#12373;&#12428;&#12383;&#24460;&#12395;&#12289;&#12472;&#12519;&#12502;&#12398;&#23455;&#34892;&#12395;&#24433;&#38911;&#12434;&#19982;&#12360;&#12378;&#12395;&#22793;&#26356;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12487;&#12540;&#12479;&#12539;&#12477;&#12540;&#12473;&#12539;&#12523;&#12483;&#12463;&#12450;&#12483;&#12503;&#21517;</dt>
<dd>
<p>&#29694;&#22312;&#12392;&#36942;&#21435;&#12398;&#12496;&#12483;&#12481;&#12539;&#12472;&#12519;&#12502;&#12395;&#38306;&#12377;&#12427;&#24773;&#22577;&#12434;&#26684;&#32013;&#12377;&#12427;&#12487;&#12540;&#12479;&#12539;&#12477;&#12540;&#12473;&#12398;JNDI&#12523;&#12483;&#12463;&#12450;&#12483;&#12503;&#21517;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12487;&#12540;&#12479;&#12539;&#12477;&#12540;&#12473;&#12399;&#12289;<code>jdbc/__TimerPool</code>&#12391;&#12377;&#12290;</p>
<p>&#26368;&#21021;&#12398;&#12496;&#12483;&#12481;&#12539;&#12472;&#12519;&#12502;&#12364;&#23455;&#34892;&#12398;&#12496;&#12483;&#12481;&#12539;&#12521;&#12531;&#12479;&#12452;&#12512;&#12395;&#36865;&#20449;&#12373;&#12428;&#12383;&#24460;&#12395;&#12289;&#12487;&#12540;&#12479;&#12539;&#12477;&#12540;&#12473;&#12434;&#22793;&#26356;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;&#12487;&#12540;&#12479;&#12539;&#12477;&#12540;&#12473;&#12434;&#22793;&#26356;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;&#12489;&#12513;&#12452;&#12531;&#12434;&#20572;&#27490;&#12375;&#12390;&#20877;&#36215;&#21205;&#12375;&#12289;&#12472;&#12519;&#12502;&#12364;&#38283;&#22987;&#12414;&#12383;&#12399;&#20877;&#38283;&#12373;&#12428;&#12427;&#21069;&#12395;&#22793;&#26356;&#12434;&#34892;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12383;&#12384;&#12375;&#12289;&#12487;&#12540;&#12479;&#12539;&#12477;&#12540;&#12473;&#12364;&#22793;&#26356;&#12373;&#12428;&#12427;&#12392;&#12289;&#21069;&#12398;&#12487;&#12540;&#12479;&#12539;&#12477;&#12540;&#12473;&#12395;&#26684;&#32013;&#12373;&#12428;&#12390;&#12356;&#12427;&#24773;&#22577;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<a id="sthref31" name="sthref31"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="tasks-topic-group004.html#CEGEEGBB">&#12496;&#12483;&#12481;&#12539;&#12521;&#12531;&#12479;&#12452;&#12512;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="tasks-topic-group002.html#CEGEIGCJ">&#12496;&#12483;&#12481;&#12539;&#12472;&#12519;&#12502;&#23455;&#34892;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref32" name="sthref32"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM897"><code>set-batch-runtime-configuration</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM863"><code>list-batch-runtime-configuration</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM861"><code>list-batch-jobs</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM884"><code>list-batch-job-executions</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM895"><code>list-batch-job-steps</code>(1)</a></p>
</li>
</ul>




<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
