<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-batchjobslisting" name="ref-batchjobslisting"></a></p>

<h4>&#12496;&#12483;&#12481;&#12539;&#12472;&#12519;&#12502;&#23455;&#34892;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>GlassFish Server&#12399;&#12289;&#12496;&#12483;&#12481;&#12539;&#12472;&#12519;&#12502;&#12398;&#12473;&#12465;&#12472;&#12517;&#12540;&#12523;&#12392;&#23455;&#34892;&#29992;&#12395;&#12496;&#12483;&#12481;&#12539;&#12521;&#12531;&#12479;&#12452;&#12512;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;&#12496;&#12483;&#12481;&#12539;&#12472;&#12519;&#12502;&#12399;&#19968;&#33324;&#30340;&#12395;&#12289;&#38263;&#26399;&#23455;&#34892;&#12398;&#12496;&#12523;&#12463;&#25351;&#21521;&#12398;&#12479;&#12473;&#12463;&#12391;&#12289;&#19968;&#36899;&#12398;&#12473;&#12486;&#12483;&#12503;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;&#12496;&#12483;&#12481;&#12539;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12496;&#12483;&#12481;&#12539;&#12521;&#12531;&#12479;&#12452;&#12512;&#12395;&#12472;&#12519;&#12502;&#12434;&#36865;&#20449;&#12375;&#12289;&#12473;&#12486;&#12483;&#12503;&#12398;&#23455;&#34892;&#26041;&#27861;&#12420;&#12479;&#12452;&#12511;&#12531;&#12464;&#12434;&#25351;&#31034;&#12375;&#12414;&#12377;&#12290;&#12496;&#12483;&#12481;&#12539;&#12521;&#12531;&#12479;&#12452;&#12512;&#12399;&#12473;&#12486;&#12483;&#12503;&#12434;&#20966;&#29702;&#12375;&#12289;&#12472;&#12519;&#12502;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12398;&#12472;&#12519;&#12502;&#12395;&#38306;&#12377;&#12427;&#24773;&#22577;&#12434;&#26684;&#32013;&#12375;&#12414;&#12377;&#12290;GlassFish Server&#12391;&#12399;&#12289;&#12472;&#12519;&#12502;&#12539;&#12522;&#12509;&#12472;&#12488;&#12522;&#12399;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12391;&#12377;&#12290;</p>
<p>&#12496;&#12483;&#12481;&#12539;&#12472;&#12519;&#12502;&#12398;&#35352;&#37682;&#12373;&#12428;&#12383;&#23455;&#34892;&#12398;&#35443;&#32048;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;&#12289;&#12496;&#12483;&#12481;&#12539;&#12472;&#12519;&#12502;&#23455;&#34892;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12496;&#12483;&#12481;&#12539;&#12472;&#12519;&#12502;&#23455;&#34892;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#24773;&#22577;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21517;</dt>
<dt>&#12463;&#12521;&#12473;&#12479;&#21517;</dt>
<dd>
<p>&#27083;&#25104;&#12364;&#36969;&#29992;&#12373;&#12428;&#12427;GlassFish&#12463;&#12521;&#12473;&#12479;&#12414;&#12383;&#12399;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#21517;&#21069;&#12290;</p>
</dd>
<dt>&#12496;&#12483;&#12481;&#12539;&#12472;&#12519;&#12502;</dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12414;&#12383;&#12399;&#12463;&#12521;&#12473;&#12479;&#12398;&#35352;&#37682;&#12373;&#12428;&#12383;&#12496;&#12483;&#12481;&#12539;&#12472;&#12519;&#12502;&#23455;&#34892;&#12398;&#12522;&#12473;&#12488;&#12290;&#21508;&#23455;&#34892;&#12395;&#12388;&#12356;&#12390;&#12289;&#27425;&#12398;&#24773;&#22577;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;:</p>
<dl>
<dt>&#23455;&#34892;ID</dt>
<dd>
<p>&#12496;&#12483;&#12481;&#12539;&#12472;&#12519;&#12502;&#12398;&#23455;&#34892;&#12395;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12383;ID&#12290;&#23455;&#34892;ID&#12434;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12392;&#12289;&#23455;&#34892;&#12398;&#12496;&#12483;&#12481;&#12539;&#12472;&#12519;&#12502;&#23455;&#34892;&#12398;&#35443;&#32048;&#12506;&#12540;&#12472;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#26032;&#12375;&#12356;&#23455;&#34892;&#12399;&#12289;&#12472;&#12519;&#12502;&#12364;&#21021;&#12417;&#12390;&#38283;&#22987;&#12373;&#12428;&#12383;&#12392;&#12365;&#12289;&#12362;&#12424;&#12403;&#26082;&#23384;&#12398;&#23455;&#34892;&#12364;&#20877;&#38283;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#20316;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12472;&#12519;&#12502;&#21517;</dt>
<dd>
<p>&#12472;&#12519;&#12502;&#12398;&#21517;&#21069;&#12290;</p>
</dd>
<dt>&#12496;&#12483;&#12481;&#12539;&#12473;&#12486;&#12540;&#12479;&#12473;</dt>
<dd>
<p>&#12496;&#12483;&#12481;&#12539;&#12521;&#12531;&#12479;&#12452;&#12512;&#12395;&#12424;&#12426;&#35373;&#23450;&#12373;&#12428;&#12383;&#12392;&#12362;&#12426;&#12398;&#23455;&#34892;&#12473;&#12486;&#12540;&#12479;&#12473;&#12290;</p>
</dd>
<dt>&#32066;&#20102;&#12473;&#12486;&#12540;&#12479;&#12473;</dt>
<dd>
<p>&#12472;&#12519;&#12502;&#12398;&#12472;&#12519;&#12502;XML&#12414;&#12383;&#12399;&#12496;&#12483;&#12481;&#12539;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12424;&#12426;&#35373;&#23450;&#12373;&#12428;&#12383;&#12392;&#12362;&#12426;&#12398;&#23455;&#34892;&#12473;&#12486;&#12540;&#12479;&#12473;&#12290;&#32066;&#20102;&#12473;&#12486;&#12540;&#12479;&#12473;&#12364;&#26126;&#31034;&#30340;&#12395;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12373;&#12428;&#12394;&#12356;&#12363;&#12366;&#12426;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#32066;&#20102;&#12473;&#12486;&#12540;&#12479;&#12473;&#12392;&#12496;&#12483;&#12481;&#12539;&#12473;&#12486;&#12540;&#12479;&#12473;&#12399;&#21516;&#19968;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;ID</dt>
<dd>
<p>&#12496;&#12483;&#12481;&#12539;&#12472;&#12519;&#12502;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12383;ID&#12290;&#12496;&#12483;&#12481;&#12539;&#12472;&#12519;&#12502;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#12399;&#12289;&#35079;&#25968;&#12398;&#23455;&#34892;&#12434;&#21547;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#38283;&#22987;&#26178;&#38291;</dt>
<dd>
<p>&#23455;&#34892;&#12398;&#38283;&#22987;&#26178;&#38291;&#12290;</p>
</dd>
<dt>&#32066;&#20102;&#26178;&#38291;</dt>
<dd>
<p>&#23455;&#34892;&#12398;&#32066;&#20102;&#26178;&#38291;&#12290;</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref26" name="sthref26"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="tasks-topic-group002.html#CEGEIGCJ">&#12496;&#12483;&#12481;&#12539;&#12472;&#12519;&#12502;&#23455;&#34892;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="tasks-topic-group004.html#CEGEEGBB">&#12496;&#12483;&#12481;&#12539;&#12521;&#12531;&#12479;&#12452;&#12512;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="GHJML141" name="GHJML141"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM861"><code>list-batch-jobs</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM884"><code>list-batch-job-executions</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM895"><code>list-batch-job-steps</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM863"><code>list-batch-runtime-configuration</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM897"><code>set-batch-runtime-configuration</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
