<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-javamailsessioncreate" name="task-javamailsessioncreate"></a></p>

<h4><a id="sthref8" name="sthref8"></a>JavaMail&#12475;&#12483;&#12471;&#12519;&#12531;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#12522;&#12477;&#12540;&#12473;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12522;&#12477;&#12540;&#12473;&#12301;&#12494;&#12540;&#12489;&#12391;&#12289;&#12300;JavaMail&#12475;&#12483;&#12471;&#12519;&#12531;&#12301;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;JavaMail&#12475;&#12483;&#12471;&#12519;&#12531;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12475;&#12483;&#12471;&#12519;&#12531;&#12301;&#12398;&#34920;&#12391;&#12289;&#12300;&#26032;&#35215;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26032;&#35215;JavaMail&#12475;&#12483;&#12471;&#12519;&#12531;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;JNDI&#21517;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12513;&#12540;&#12523;&#12539;&#12475;&#12483;&#12471;&#12519;&#12531;&#12539;&#12522;&#12477;&#12540;&#12473;&#12398;&#19968;&#24847;&#12398;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>JavaMail&#12522;&#12477;&#12540;&#12473;&#12398;&#12493;&#12540;&#12511;&#12531;&#12464;&#12539;&#12469;&#12502;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#25509;&#38957;&#36766;<code>mail/</code>&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#20363;: <code>mail/MySession</code>&#12290;&#21517;&#21069;&#12395;&#21547;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12398;&#12399;&#12289;&#33521;&#25968;&#23383;&#12289;&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#12289;&#12480;&#12483;&#12471;&#12517;&#12289;&#12414;&#12383;&#12399;&#12489;&#12483;&#12488;&#12398;&#21508;&#25991;&#23383;&#12398;&#12415;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12513;&#12540;&#12523;&#12539;&#12507;&#12473;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12513;&#12540;&#12523;&#12539;&#12469;&#12540;&#12496;&#12540;&#12398;&#12507;&#12473;&#12488;&#21517;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12503;&#12525;&#12488;&#12467;&#12523;&#22266;&#26377;&#12398;&#12507;&#12473;&#12488;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#25552;&#20379;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;Store&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;Transport&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#25509;&#32154;&#12513;&#12477;&#12483;&#12489;&#12399;&#12371;&#12398;&#20516;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#21517;&#21069;&#12399;&#23455;&#38555;&#12398;&#12507;&#12473;&#12488;&#21517;&#12392;&#12375;&#12390;&#35299;&#27770;&#21487;&#33021;&#12391;&#12354;&#12427;&#12371;&#12392;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12518;&#12540;&#12470;&#12540;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12513;&#12540;&#12523;&#12539;&#12469;&#12540;&#12496;&#12540;&#12408;&#12398;&#25509;&#32154;&#26178;&#12395;&#28193;&#12373;&#12428;&#12427;&#12518;&#12540;&#12470;&#12540;&#21517;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12503;&#12525;&#12488;&#12467;&#12523;&#22266;&#26377;&#12398;username&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#25552;&#20379;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;Store&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;Transport&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#25509;&#32154;&#12513;&#12477;&#12483;&#12489;&#12399;&#12371;&#12398;&#20516;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#12518;&#12540;&#12470;&#12540;&#21517;&#12395;&#20351;&#29992;&#12391;&#12365;&#12427;&#12398;&#12399;&#12289;&#33521;&#25968;&#23383;&#12289;&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#12289;&#12480;&#12483;&#12471;&#12517;&#12289;&#12414;&#12383;&#12399;&#12489;&#12483;&#12488;&#12398;&#12415;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#36865;&#20449;&#20803;&#12450;&#12489;&#12524;&#12473;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12518;&#12540;&#12470;&#12540;&#12398;&#38651;&#23376;&#12513;&#12540;&#12523;&#12539;&#12450;&#12489;&#12524;&#12473;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#24418;&#24335;&#12399;&#12289;<i>username</i><code>@</code><i>host</i>.<i>domain</i>&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#35500;&#26126;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12513;&#12540;&#12523;&#12539;&#12475;&#12483;&#12471;&#12519;&#12531;&#12398;&#35500;&#26126;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12473;&#12486;&#12540;&#12479;&#12473;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#12513;&#12540;&#12523;&#12539;&#12475;&#12483;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12300;&#26377;&#21177;&#12301;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12473;&#12488;&#12450;&#12539;&#12503;&#12525;&#12488;&#12467;&#12523;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12391;&#12289;&#20351;&#29992;&#12377;&#12427;&#35352;&#25014;&#22495;&#12503;&#12525;&#12488;&#12467;&#12523;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#35352;&#25014;&#22495;&#12503;&#12525;&#12488;&#12467;&#12523;&#12539;&#12469;&#12540;&#12499;&#12473;&#12399;&#12289;&#12513;&#12540;&#12523;&#12539;&#12469;&#12540;&#12496;&#12540;&#12395;&#25509;&#32154;&#12375;&#12390;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#21462;&#24471;&#12375;&#12289;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12501;&#12457;&#12523;&#12480;&#12395;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#20445;&#23384;&#12375;&#12414;&#12377;&#12290;&#20351;&#29992;&#21487;&#33021;&#12394;&#20516;&#12399;&#12289;<code>imap</code>&#12289;<code>pop3</code>&#12289;<code>imaps</code>&#12289;&#12362;&#12424;&#12403;<code>pop3s</code>&#12391;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>imap</code>&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12473;&#12488;&#12450;&#12539;&#12503;&#12525;&#12488;&#12467;&#12523;&#12539;&#12463;&#12521;&#12473;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#35352;&#25014;&#22495;&#12398;&#12469;&#12540;&#12499;&#12473;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#23455;&#35013;&#12463;&#12521;&#12473;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#20351;&#29992;&#21487;&#33021;&#12394;&#20516;&#12399;&#27425;&#12398;&#12392;&#12362;&#12426;&#12391;&#12377;:</p>
<ul>
<li>
<p><code>com.sun.mail.imap.IMAPStore</code></p>
</li>
<li>
<p><code>com.sun.mail.pop3.POP3Store</code></p>
</li>
<li>
<p><code>com.sun.mail.imap.IMAPSSLStore</code></p>
</li>
<li>
<p><code>com.sun.mail.pop3.POP3SSLStore</code></p>
</li>
</ul>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>com.sun.mail.imap.IMAPStore</code>&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;&#12539;&#12503;&#12525;&#12488;&#12467;&#12523;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;&#12398;&#36890;&#20449;&#26041;&#27861;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;&#12539;&#12503;&#12525;&#12488;&#12467;&#12523;&#12539;&#12469;&#12540;&#12499;&#12473;&#12399;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#36865;&#20449;&#12375;&#12414;&#12377;&#12290;&#20351;&#29992;&#21487;&#33021;&#12394;&#20516;&#12399;&#12289;<code>smtp</code>&#12392;<code>smtps</code>&#12391;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;&#12539;&#12503;&#12525;&#12488;&#12467;&#12523;&#12399;<code>smtp</code>&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;&#12539;&#12463;&#12521;&#12473;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;&#12398;&#12469;&#12540;&#12499;&#12473;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#23455;&#35013;&#12463;&#12521;&#12473;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>com.sun.mail.smtp.SMTPTransport</code>&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12487;&#12496;&#12483;&#12464;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#12371;&#12398;&#12513;&#12540;&#12523;&#12539;&#12475;&#12483;&#12471;&#12519;&#12531;&#12391;&#12503;&#12525;&#12488;&#12467;&#12523;&#12398;&#12488;&#12524;&#12540;&#12473;&#12394;&#12393;&#12398;&#36861;&#21152;&#12487;&#12496;&#12483;&#12464;&#20986;&#21147;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>JavaMail&#12398;&#12525;&#12464;&#12539;&#12524;&#12505;&#12523;&#12434;<code>FINE</code>&#12414;&#12383;&#12399;&#12381;&#12428;&#20197;&#19978;&#12395;&#35373;&#23450;&#12375;&#12383;&#22580;&#21512;&#12289;&#12487;&#12496;&#12483;&#12464;&#20986;&#21147;&#12364;&#29983;&#25104;&#12373;&#12428;&#12289;&#12471;&#12473;&#12486;&#12512;&#12398;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12395;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;&#12525;&#12464;&#12539;&#12524;&#12505;&#12523;&#12398;&#35373;&#23450;&#12398;&#35443;&#32048;&#12399;&#12289;&#12300;<a href="../../../common/en/help/task-eelogginglevels.html">&#12525;&#12464;&#12539;&#12524;&#12505;&#12523;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a>&#12301;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12398;&#34920;&#12395;&#12289;&#12503;&#12525;&#12488;&#12467;&#12523;&#22266;&#26377;&#12398;&#12507;&#12473;&#12488;&#12414;&#12383;&#12399;&#12518;&#12540;&#12470;&#12540;&#21517;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12394;&#12393;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#24517;&#35201;&#12394;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#20351;&#29992;&#21487;&#33021;&#12394;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12522;&#12473;&#12488;&#12399;&#12289;JavaMail API&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;(<code><a href="http://java.sun.com/products/javamail/javadocs/index.html">http://java.sun.com/products/javamail/javadocs/index.html</a></code>)&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21517;&#21069;&#12399;<code>mail-</code>&#12391;&#22987;&#12414;&#12426;&#12289;&#21306;&#20999;&#12426;&#25991;&#23383;&#12392;&#12375;&#12390;(&#12500;&#12522;&#12458;&#12489;&#12391;&#12399;&#12394;&#12367;)&#12495;&#12452;&#12501;&#12531;&#12434;&#20351;&#29992;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;<code>mail-debug</code>&#12399;&#27491;&#12375;&#12356;&#12391;&#12377;&#12364;&#12289;<code>mail.debug</code>&#12399;&#27491;&#12375;&#12367;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;GlassFish Server&#12496;&#12483;&#12463;&#12456;&#12531;&#12489;&#12364;&#12289;JavaMail API&#12395;&#24540;&#12376;&#12390;&#12495;&#12452;&#12501;&#12531;&#12434;&#12500;&#12522;&#12458;&#12489;&#12395;&#22793;&#25563;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#34920;&#31034;&#12373;&#12428;&#12427;&#31354;&#30333;&#34892;&#12391;&#12289;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#21517;&#12434;&#20837;&#21147;&#12375;&#12289;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#20351;&#29992;&#21487;&#33021;&#12394;&#12479;&#12540;&#12466;&#12483;&#12488;&#12398;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#12513;&#12540;&#12523;&#12539;&#12475;&#12483;&#12471;&#12519;&#12531;&#12434;&#27083;&#25104;&#12377;&#12427;&#12479;&#12540;&#12466;&#12483;&#12488;(&#35079;&#25968;&#21487;)&#12434;&#36984;&#25246;&#12375;&#12289;&#12300;&#36861;&#21152;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12479;&#12540;&#12466;&#12483;&#12488;&#12395;&#12399;&#12289;&#12463;&#12521;&#12473;&#12479;&#12414;&#12383;&#12399;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36984;&#25246;&#12391;&#12365;&#12414;&#12377;&#12290;&#12479;&#12540;&#12466;&#12483;&#12488;&#12434;&#36984;&#25246;&#12375;&#12394;&#12356;&#22580;&#21512;&#12289;&#12475;&#12483;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;<code>server</code>&#12395;&#27083;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;OK&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="GHJML103" name="GHJML103"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-javamailsessionsedit.html">JavaMail&#12475;&#12483;&#12471;&#12519;&#12531;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-javamailsessionsdelete.html">JavaMail&#12475;&#12483;&#12471;&#12519;&#12531;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
