<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="CEGEEGBB" name="CEGEEGBB"></a></p>
<!-- infolevel="all" infotype="General" -->
<h4><a id="sthref6" name="sthref6"></a>&#12496;&#12483;&#12481;&#12539;&#12521;&#12531;&#12479;&#12452;&#12512;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12496;&#12483;&#12481;&#12539;&#12472;&#12519;&#12502;&#23455;&#34892;&#12434;&#34920;&#31034;&#12377;&#12427;GlassFish Server&#12398;&#12463;&#12521;&#12473;&#12479;&#12414;&#12383;&#12399;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#19968;&#33324;&#24773;&#22577;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12496;&#12483;&#12481;&#12539;&#12479;&#12502;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12496;&#12483;&#12481;&#12539;&#12472;&#12519;&#12502;&#23455;&#34892;&#12506;&#12540;&#12472;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#27083;&#25104;&#12301;&#12479;&#12502;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12496;&#12483;&#12481;&#12539;&#12521;&#12531;&#12479;&#12452;&#12512;&#12398;&#27083;&#25104;&#12506;&#12540;&#12472;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;&#12521;&#12531;&#12479;&#12452;&#12512;&#12391;&#12399;&#12289;&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12362;&#12424;&#12403;&#12487;&#12540;&#12479;&#12539;&#12477;&#12540;&#12473;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12496;&#12483;&#12481;&#12539;&#12472;&#12519;&#12502;&#12364;&#23455;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12539;&#12523;&#12483;&#12463;&#12450;&#12483;&#12503;&#21517;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#12496;&#12483;&#12481;&#12539;&#12472;&#12519;&#12502;&#12408;&#12398;&#12473;&#12524;&#12483;&#12489;&#12398;&#25552;&#20379;&#12395;&#20351;&#29992;&#12377;&#12427;&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12399;&#12289;<code>concurrent/__defaultManagedExecutorService</code>&#12391;&#12377;&#12290;&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12399;&#12289;&#12496;&#12483;&#12481;&#12539;&#12472;&#12519;&#12502;&#12364;&#12496;&#12483;&#12481;&#12539;&#12521;&#12531;&#12479;&#12452;&#12512;&#12395;&#36865;&#20449;&#12373;&#12428;&#12383;&#24460;&#12395;&#12289;&#12472;&#12519;&#12502;&#12398;&#23455;&#34892;&#12395;&#24433;&#38911;&#12434;&#19982;&#12360;&#12378;&#12395;&#22793;&#26356;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12487;&#12540;&#12479;&#12539;&#12477;&#12540;&#12473;&#12539;&#12523;&#12483;&#12463;&#12450;&#12483;&#12503;&#21517;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#12472;&#12519;&#12502;&#24773;&#22577;&#12398;&#26684;&#32013;&#12395;&#20351;&#29992;&#12377;&#12427;&#12487;&#12540;&#12479;&#12539;&#12477;&#12540;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12487;&#12540;&#12479;&#12539;&#12477;&#12540;&#12473;&#12399;&#12289;<code>jdbc/__TimerPool</code>&#12391;&#12377;&#12290;&#26368;&#21021;&#12398;&#12496;&#12483;&#12481;&#12539;&#12472;&#12519;&#12502;&#12364;&#23455;&#34892;&#12398;&#12496;&#12483;&#12481;&#12539;&#12521;&#12531;&#12479;&#12452;&#12512;&#12395;&#36865;&#20449;&#12373;&#12428;&#12383;&#24460;&#12395;&#12289;&#12487;&#12540;&#12479;&#12539;&#12477;&#12540;&#12473;&#12434;&#22793;&#26356;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;&#12487;&#12540;&#12479;&#12539;&#12477;&#12540;&#12473;&#12434;&#22793;&#26356;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;&#12489;&#12513;&#12452;&#12531;&#12434;&#20572;&#27490;&#12375;&#12390;&#20877;&#36215;&#21205;&#12375;&#12289;&#12472;&#12519;&#12502;&#12364;&#38283;&#22987;&#12414;&#12383;&#12399;&#20877;&#38283;&#12373;&#12428;&#12427;&#21069;&#12395;&#22793;&#26356;&#12434;&#34892;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12383;&#12384;&#12375;&#12289;&#12487;&#12540;&#12479;&#12539;&#12477;&#12540;&#12473;&#12364;&#22793;&#26356;&#12373;&#12428;&#12427;&#12392;&#12289;&#21069;&#12398;&#12487;&#12540;&#12479;&#12539;&#12477;&#12540;&#12473;&#12395;&#26684;&#32013;&#12373;&#12428;&#12390;&#12356;&#12427;&#24773;&#22577;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref7" name="sthref7"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<p><a href="tasks-topic-group002.html#CEGEIGCJ">&#12496;&#12483;&#12481;&#12539;&#12472;&#12519;&#12502;&#23455;&#34892;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
