<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jndicustomresourcenew" name="task-jndicustomresourcenew"></a></p>

<h4><a id="sthref11" name="sthref11"></a><a id="sthref12" name="sthref12"></a><a id="sthref13" name="sthref13"></a>&#12459;&#12473;&#12479;&#12512;JNDI&#12522;&#12477;&#12540;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12459;&#12473;&#12479;&#12512;JNDI&#12522;&#12477;&#12540;&#12473;&#12399;&#12289;&#12469;&#12540;&#12496;&#12540;&#20840;&#20307;&#12398;&#12459;&#12473;&#12479;&#12512;&#12539;&#12522;&#12477;&#12540;&#12473;&#12539;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12539;&#12501;&#12449;&#12463;&#12488;&#12522;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#12522;&#12477;&#12540;&#12473;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12522;&#12477;&#12540;&#12473;&#12301;&#12494;&#12540;&#12489;&#12391;&#12289;&#12300;JNDI&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;JNDI&#12301;&#12494;&#12540;&#12489;&#12391;&#12289;&#12300;&#12459;&#12473;&#12479;&#12512;&#12539;&#12522;&#12477;&#12540;&#12473;&#12301;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12459;&#12473;&#12479;&#12512;&#12539;&#12522;&#12477;&#12540;&#12473;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12459;&#12473;&#12479;&#12512;&#12539;&#12522;&#12477;&#12540;&#12473;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;&#26032;&#35215;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26032;&#35215;&#12459;&#12473;&#12479;&#12512;&#12539;&#12522;&#12477;&#12540;&#12473;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;JNDI&#21517;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#19968;&#24847;&#12398;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#21517;&#21069;&#12399;JNDI&#12493;&#12540;&#12511;&#12531;&#12464;&#12539;&#12469;&#12540;&#12499;&#12473;&#12395;&#30331;&#37682;&#12373;&#12428;&#12414;&#12377;&#12290;&#12459;&#12540;&#12489;&#24335;&#12398;&#30446;&#37682;&#12395;&#12424;&#12387;&#12390;&#22259;&#26360;&#39208;&#12398;&#34101;&#26360;&#12398;&#20998;&#39006;&#12392;&#20445;&#31649;&#22580;&#25152;&#12398;&#31649;&#29702;&#12434;&#34892;&#12358;&#22580;&#21512;&#12392;&#21516;&#27096;&#12398;&#26041;&#27861;&#12391;&#12289;&#20998;&#25955;&#12467;&#12531;&#12500;&#12517;&#12540;&#12486;&#12451;&#12531;&#12464;&#29872;&#22659;&#12395;&#37197;&#32622;&#12373;&#12428;&#12383;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#32232;&#25104;&#12392;&#22580;&#25152;&#12398;&#31649;&#29702;&#12364;JNDI&#21517;&#12395;&#12424;&#12387;&#12390;&#34892;&#12431;&#12428;&#12414;&#12377;&#12290;&#12381;&#12398;&#12383;&#12417;&#12289;JNDI&#21517;&#12399;&#12459;&#12473;&#12479;&#12512;&#12539;&#12522;&#12477;&#12540;&#12473;&#12408;&#12398;&#37325;&#35201;&#12394;&#12450;&#12463;&#12475;&#12473;&#26041;&#27861;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12522;&#12477;&#12540;&#12473;&#12539;&#12479;&#12452;&#12503;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12391;&#12289;&#27425;&#12398;&#12356;&#12378;&#12428;&#12363;&#12398;&#25805;&#20316;&#12434;&#34892;&#12356;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#12479;&#12452;&#12503;&#23450;&#32681;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>2&#30058;&#30446;&#12398;&#12521;&#12472;&#12458;&#12539;&#12508;&#12479;&#12531;&#12434;&#36984;&#25246;&#12375;&#12289;&#23436;&#20840;&#20462;&#39166;&#12479;&#12452;&#12503;&#23450;&#32681;&#12434;<i>xxx</i><code>.</code><i>xxx</i>&#12398;&#24418;&#24335;&#12391;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#12501;&#12449;&#12463;&#12488;&#12522;&#12539;&#12463;&#12521;&#12473;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#20316;&#25104;&#12377;&#12427;&#12459;&#12473;&#12479;&#12512;&#12539;&#12522;&#12477;&#12540;&#12473;&#12398;&#12501;&#12449;&#12463;&#12488;&#12522;&#12539;&#12463;&#12521;&#12473;&#21517;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12501;&#12449;&#12463;&#12488;&#12522;&#12539;&#12463;&#12521;&#12473;&#12301;&#12399;&#12501;&#12449;&#12463;&#12488;&#12522;&#12539;&#12463;&#12521;&#12473;&#12398;&#12518;&#12540;&#12470;&#12540;&#25351;&#23450;&#12398;&#21517;&#21069;&#12391;&#12377;&#12290;&#12371;&#12398;&#12463;&#12521;&#12473;&#12399;<code>javax.naming.spi.ObjectFactory</code>&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12434;&#23455;&#35013;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#35500;&#26126;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12522;&#12477;&#12540;&#12473;&#12398;&#31777;&#21336;&#12394;&#35500;&#26126;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#35500;&#26126;&#12399;&#25991;&#23383;&#21015;&#20516;&#12391;&#12289;&#26368;&#22823;250&#25991;&#23383;&#12434;&#20837;&#21147;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12473;&#12486;&#12540;&#12479;&#12473;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#12522;&#12477;&#12540;&#12473;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12522;&#12477;&#12540;&#12473;&#12399;&#26377;&#21177;&#12391;&#12289;&#20316;&#25104;&#24460;&#12377;&#12368;&#12395;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#12289;&#12459;&#12473;&#12479;&#12512;&#12539;&#12522;&#12477;&#12540;&#12473;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>GlassFish Server&#12391;&#12399;&#12289;&#12459;&#12473;&#12479;&#12512;&#12539;&#12522;&#12477;&#12540;&#12473;&#12395;&#12399;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#23450;&#32681;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#34920;&#31034;&#12373;&#12428;&#12427;&#31354;&#30333;&#34892;&#12391;&#12289;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#21517;&#12434;&#20837;&#21147;&#12375;&#12289;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;OK&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="GHJML108" name="GHJML108"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-jndicustomresourceedit.html">&#12459;&#12473;&#12479;&#12512;JNDI&#12522;&#12477;&#12540;&#12473;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jndicustomresourcedelete.html">&#12459;&#12473;&#12479;&#12512;JNDI&#12522;&#12477;&#12540;&#12473;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jndiexternalresourcecreate.html">&#22806;&#37096;JNDI&#12522;&#12477;&#12540;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jndiexternalresourceedit.html">&#22806;&#37096;JNDI&#12522;&#12477;&#12540;&#12473;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jndiexternalresourcedelete.html">&#22806;&#37096;JNDI&#12522;&#12477;&#12540;&#12473;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
