<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jdbcconnpooladvanceattrtab" name="ref-jdbcconnpooladvanceattrtab"></a><a id="GHJDB00027" name="GHJDB00027"></a></p>

<h4><a id="sthref50" name="sthref50"></a>Modifier les attributs avanc&eacute;s du pool de connexions</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Modifier les attributs avanc&eacute;s du pool de connexions permet de sp&eacute;cifier les attributs permettant d'&eacute;tablir un diagnostic des pertes de connexion et de faciliter l'utilisation.</p>
<p>Elle contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Charger les valeurs par d&eacute;faut</dt>
<dd>
<p>Bouton permettant de restaurer les valeurs par d&eacute;faut des param&egrave;tres qui en ont. Les param&egrave;tres qui n'ont pas de valeurs par d&eacute;faut ne sont pas modifi&eacute;s.</p>
</dd>
<dt>Nom du pool</dt>
<dd>
<p>Nom du pool de connexions. Le champ Nom est en lecture seule. Vous ne pouvez sp&eacute;cifier le nom du pool de connexions qu'&agrave; la cr&eacute;ation d'un pool de connexions JDBC.</p>
</dd>
<dt>D&eacute;lai d'expiration des instructions</dt>
<dd>
<p>D&eacute;lai, en secondes, au-del&agrave; duquel les requ&ecirc;tes dont l'ex&eacute;cution est anormalement longue sont abandonn&eacute;es. GlassFish Server d&eacute;finit <code>QueryTimeout</code> sur les instructions cr&eacute;&eacute;es. La valeur -1 signifie que l'option est d&eacute;sactiv&eacute;e. La valeur par d&eacute;faut est -1.</p>
</dd>
<dt>Taille du cache d'instruction</dt>
<dd>
<p>Nombre d'instructions devant &ecirc;tre mises en m&eacute;moire cache &agrave; l'aide du syst&egrave;me de mise en m&eacute;moire cache LRU (utilis&eacute; le moins r&eacute;cemment). La valeur 0 d&eacute;sactive la mise en m&eacute;moire cache des instructions. La valeur par d&eacute;faut est 0.</p>
</dd>
<dt>Init. SQL</dt>
<dd>
<p>Cha&icirc;ne SQL &agrave; ex&eacute;cuter lors de la cr&eacute;ation (mais pas de la r&eacute;utilisation) d'une connexion dans le pool. L'ex&eacute;cution de cette cha&icirc;ne initialise l'&eacute;tat de la connexion.</p>
</dd>
<dt>Processus d'&eacute;coute de trace SQL</dt>
<dd>
<p>Liste des noms de classe d'impl&eacute;mentation de processus d'&eacute;coute, s&eacute;par&eacute;s par des virgules, qui indique que les instructions SQL ex&eacute;cut&eacute;es par les applications sont trac&eacute;es. Les classes de processus d'&eacute;coute doivent impl&eacute;menter l'interface <code>org.glassfish.api.jdbc.SQLTraceListener</code>. L'utilisation de processus d'&eacute;coute facilite le filtrage des messages de journal des instructions SQL et aide les administrateurs &agrave; analyser ces instructions.</p>
</dd>
<dt>Encapsuler les objets JDBC</dt>
<dd>
<p>Lorsque cette option est activ&eacute;e, les applications obtiennent des objets JDBC encapsul&eacute;s pour les &eacute;l&eacute;ments Statement, PreparedStatement, CallableStatement, ResultSet et DatabaseMetaData. Cette option est activ&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Groupement</dt>
<dd>
<p>Active le groupement des connexions pour le pool. Cette option est activ&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Valider une fois au plus</dt>
<dd>
<p>Indique l'intervalle, exprim&eacute; en secondes, entre des demandes successives de validation d'une connexion, une fois au plus. La d&eacute;finition de cet attribut sur une valeur appropri&eacute;e r&eacute;duit le nombre de demandes de validation &eacute;manant d'une connexion. La valeur par d&eacute;faut est 0, ce qui signifie que l'attribut n'est pas activ&eacute;.</p>
</dd>
<dt>Temporisation de la perte de connexion</dt>
<dd>
<p>Dur&eacute;e, en secondes, n&eacute;cessaire pour tracer les pertes de connexion dans un pool de connexions. Ce champ permet de d&eacute;tecter les &eacute;ventuelles pertes de connexion de l'application. Une connexion non renvoy&eacute;e au pool par l'application dans l'intervalle sp&eacute;cifi&eacute; est soup&ccedil;onn&eacute;e de pr&eacute;senter une perte. La trace de pile de l'appelant est alors journalis&eacute;e. La valeur 0 indique que le tra&ccedil;age des pertes de connexion est d&eacute;sactiv&eacute;. La valeur par d&eacute;faut est 0.</p>
<p>Utilisez ce champ avec le champ R&eacute;cup&eacute;ration de perte pour &eacute;viter tout risque de perte de connexion de l'application.</p>
</dd>
<dt>R&eacute;cup&eacute;ration de la perte de connexion</dt>
<dd>
<p>Si cette option est activ&eacute;e, les connexions pr&eacute;sentant des pertes sont restaur&eacute;es dans le pool une fois le tra&ccedil;age des pertes de connexion termin&eacute;. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>D&eacute;lai d'expiration de perte d'instruction</dt>
<dd>
<p>Dur&eacute;e, en secondes, n&eacute;cessaire pour tracer les pertes d'instruction dans un pool de connexions. Ce champ permet de d&eacute;tecter les &eacute;ventuelles pertes d'instruction de l'application. Une instruction non renvoy&eacute;e au pool par l'application dans l'intervalle sp&eacute;cifi&eacute; est soup&ccedil;onn&eacute;e de pr&eacute;senter une perte. La trace de pile de l'appelant est alors journalis&eacute;e. La valeur 0 indique que le tra&ccedil;age des pertes d'instruction est d&eacute;sactiv&eacute;. La valeur par d&eacute;faut est 0.</p>
<p>Utilisez ce champ avec le champ R&eacute;cup&eacute;ration de perte d'instruction pour &eacute;viter tout risque de perte de connexion de l'application.</p>
</dd>
<dt>R&eacute;cup&eacute;ration de perte d'instruction</dt>
<dd>
<p>Si cette option est activ&eacute;e, les instructions pr&eacute;sentant des pertes sont restaur&eacute;es dans le pool une fois le tra&ccedil;age des pertes d'instruction termin&eacute;. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Tentatives de cr&eacute;ation</dt>
<dd>
<p>Nombre de tentatives effectu&eacute;es en cas d'&eacute;chec de cr&eacute;ation d'une connexion. La valeur 0 indique qu'aucune tentative ne sera effectu&eacute;e pour recr&eacute;er la connexion. La valeur par d&eacute;faut est 0.</p>
</dd>
<dt>Intervalle entre les tentatives</dt>
<dd>
<p>Intervalle, en secondes, entre deux tentatives de cr&eacute;ation d'une connexion. La valeur par d&eacute;faut est 10. Cet attribut n'est utilis&eacute; que si la valeur de l'option Tentatives de cr&eacute;ation est sup&eacute;rieure &agrave; 0.</p>
</dd>
<dt>Association lazy</dt>
<dd>
<p>Si cette option est activ&eacute;e, une connexion physique n'est associ&eacute;e &agrave; une collection logique que lorsque la connexion est utilis&eacute;e. Les connexions sont dissoci&eacute;es lorsque la transaction est termin&eacute;e et qu'une m&eacute;thode de composant prend fin, ce qui facilite la r&eacute;utilisation des connexions physiques. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Participation des connexions lazy &agrave; la transaction</dt>
<dd>
<p>Si cette option est activ&eacute;e, une ressource est engag&eacute;e dans une transaction uniquement lorsqu'elle est utilis&eacute;e dans une m&eacute;thode. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Associer &agrave; un thread</dt>
<dd>
<p>Si cette option est activ&eacute;e, la connexion est associ&eacute;e &agrave; un thread de sorte que lorsque celui-ci n&eacute;cessite une connexion, il puisse r&eacute;utiliser celle qui lui est d&eacute;j&agrave; associ&eacute;e, limitant ainsi le temps syst&egrave;me li&eacute; &agrave; l'obtention d'une connexion &agrave; partir du pool. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Faire correspondre les connexions</dt>
<dd>
<p>Si cette option est activ&eacute;e, une connexion s&eacute;lectionn&eacute;e dans le pool doit &ecirc;tre mise en correspondance avec les connexions disposant de certaines informations d'identification et de connexion. Cette option doit &ecirc;tre activ&eacute;e si le pool de connexions est utilis&eacute; par des applications disposant de plusieurs informations d'identification et de connexion utilisateur. Cette option peut &ecirc;tre d&eacute;sactiv&eacute;e en toute s&eacute;curit&eacute; si l'administrateur sait que les connexions du pool seront toujours homog&egrave;nes et qu'il est donc inutile pour l'adaptateur de ressources d'associer une connexion emprunt&eacute;e au pool. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Utilisation maximale des connexions</dt>
<dd>
<p>Nombre de r&eacute;utilisations possibles d'une connexion par le pool. Une fois qu'une connexion a &eacute;t&eacute; r&eacute;utilis&eacute;e le nombre de fois sp&eacute;cifi&eacute;, elle est ferm&eacute;e. En limitant le nombre de r&eacute;utilisations d'une connexion, vous pouvez &eacute;viter les pertes d'instruction lorsqu'une application ne ferme pas les instructions. La valeur 0 indique que cet attribut est d&eacute;sactiv&eacute;. La valeur par d&eacute;faut est 0.</p>
</dd>
<dt>Validation de la connexion</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, la validation des connexions est requise, ce qui permet au serveur de se reconnecter en cas d'&eacute;chec.</p>
</dd>
<dt>M&eacute;thode de validation</dt>
<dd>
<p>GlassFish Server peut valider les connexions &agrave; la base de donn&eacute;es de l'une des mani&egrave;res ci-apr&egrave;s.</p>
<dl>
<dt><code>auto-commit</code> et <code>metadata</code></dt>
<dd>
<p>GlassFish Server valide une connexion en appelant la m&eacute;thode <code>con.getAutoCommit</code> ou <code>con.getMetaData</code>.</p>

<hr>
<p><b>Remarque:</b></p>
La plupart des pilotes JDBC mettent en m&eacute;moire cache le r&eacute;sultat de ces appels. Par cons&eacute;quent, l'utilisation de ces appels ne donne pas toujours une validation fiable. Contactez votre fournisseur de pilote pour savoir si ces appels sont mis en m&eacute;moire cache ou non.
<hr>

</dd>
<dt><code>custom-validation</code></dt>
<dd>
<p>GlassFish Server utilise un m&eacute;canisme de validation d&eacute;fini par l'utilisateur sp&eacute;cifi&eacute; par la classe d'impl&eacute;mentation personnalis&eacute;e dans le champ Nom de classe de validation.</p>
</dd>
<dt><code>table</code></dt>
<dd>
<p>L'application interroge la table de base de donn&eacute;es sp&eacute;cifi&eacute;e. La table doit exister et &ecirc;tre accessible mais ne requiert aucune ligne. N'utilisez pas une table existante comportant un nombre important de lignes ou une table d&eacute;j&agrave; fr&eacute;quemment consult&eacute;e.</p>
</dd>
</dl>
</dd>
<dt>Nom de la table</dt>
<dd>
<p>Nom de la table de base de donn&eacute;es utilis&eacute;e pour la validation. Ce champ ne doit &ecirc;tre utilis&eacute; que si la m&eacute;thode de validation a &eacute;t&eacute; d&eacute;finie sur <code>table</code>. Vous pouvez s&eacute;lectionner un nom dans la liste d&eacute;roulante ou en saisir un.</p>
</dd>
<dt>Nom de classe de validation</dt>
<dd>
<p>Nom de la classe d'impl&eacute;mentation de validation personnalis&eacute;e. Ce champ ne doit &ecirc;tre utilis&eacute; que si la m&eacute;thode de validation a &eacute;t&eacute; d&eacute;finie sur <code>custom-validation</code>. GlassFish Server doit pouvoir acc&eacute;der au nom de classe indiqu&eacute;. La classe sp&eacute;cifi&eacute;e doit impl&eacute;menter l'interface <code>org.glassfish.api.jdbc.ConnectionValidation</code>. Vous pouvez s&eacute;lectionner un nom dans la liste d&eacute;roulante ou en saisir un.</p>
</dd>
<dt>Echec sur tout</dt>
<dd>
<p>Si cette option est activ&eacute;e, GlassFish Server ferme toutes les connexions du pool et les r&eacute;tablit en cas d'&eacute;chec de l'une d'entre elles. Si cette option est d&eacute;sactiv&eacute;e, les connexions individuelles ne sont r&eacute;tablies que lorsqu'elles sont utilis&eacute;es. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Autoriser les programmes appelants autres que des composants</dt>
<dd>
<p>Si cette option est activ&eacute;e, le pool peut &ecirc;tre utilis&eacute; par des appelants autres que des composants tels que les filtres de servlet et les gestionnaires de persistance tiers. Les connexions obtenues par des appelants autres que des composants ne sont pas automatiquement ferm&eacute;es par le conteneur &agrave; la fin d'une transaction. Elles doivent &ecirc;tre explicitement ferm&eacute;es par l'appelant. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
</dl>
<a id="sthref51" name="sthref51"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">Configuration de l'acc&egrave;s aux bases de donn&eacute;es</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">Int&eacute;gration d'un pilote JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">Cr&eacute;ation d'un pool de connexions JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">Modification des param&egrave;tres g&eacute;n&eacute;raux de pool de connexions JDBC</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">V&eacute;rification des param&egrave;tres de pool de connexions</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">Modification des attributs avanc&eacute;s de pool de connexions JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">Modification des propri&eacute;t&eacute;s de pool de connexions JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">Suppression d'un pool de connexions JDBC</a></p>
</li>
</ul>
<a id="sthref52" name="sthref52"></a>
<h5>Commandes asadmin connexes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00001"><code>add-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00036"><code>create-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00088"><code>delete-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00135"><code>flush-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00173"><code>list-jdbc-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00214"><code>ping-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00234"><code>start-database</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00239"><code>stop-database</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
