<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jdbc-properties" name="ref-jdbc-properties"></a><a id="GHJDB00029" name="GHJDB00029"></a></p>

<h4><a id="sthref56" name="sthref56"></a><a id="sthref57" name="sthref57"></a>Propri&eacute;t&eacute;s propres aux pools de connexions JDBC</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La plupart des pilotes JDBC permettent d'utiliser des listes de propri&eacute;t&eacute;s standard pour sp&eacute;cifier l'utilisateur, le mot de passe et d'autres informations de configuration des ressources. Bien que les propri&eacute;t&eacute;s soient facultatives par rapport &agrave; GlassFish Server, certaines propri&eacute;t&eacute;s peuvent &ecirc;tre n&eacute;cessaires pour la plupart des bases de donn&eacute;es. Pour plus d'informations, reportez-vous &agrave; JDBC 4.0 Standard Extension API.</p>
<p>La modification des propri&eacute;t&eacute;s de pilote JDBC n&eacute;cessite un red&eacute;marrage du serveur.</p>
<p>Les propri&eacute;t&eacute;s standard suivantes sont communes &agrave; la plupart des fournisseurs JDBC. Pour plus d'informations sur les propri&eacute;t&eacute;s disponibles pour votre pilote JDBC, consultez la documentation du fournisseur.</p>
<dl>
<dt><code>user</code></dt>
<dd>
<p>Sp&eacute;cifie le nom utilisateur permettant la connexion &agrave; la base de donn&eacute;es.</p>
</dd>
<dt><code>password</code></dt>
<dd>
<p>Sp&eacute;cifie le mot de passe permettant la connexion &agrave; la base de donn&eacute;es.</p>
</dd>
<dt><code>databaseName</code></dt>
<dd>
<p>Sp&eacute;cifie la base de donn&eacute;es du pool de connexions.</p>
</dd>
<dt><code>serverName</code></dt>
<dd>
<p>Sp&eacute;cifie le serveur de base de donn&eacute;es du pool de connexions.</p>
</dd>
<dt><code>port</code></dt>
<dd>
<p>Sp&eacute;cifie le port sur lequel le serveur de base de donn&eacute;es &eacute;coute les demandes.</p>
</dd>
<dt><code>networkProtocol</code></dt>
<dd>
<p>Sp&eacute;cifie le protocole de communication.</p>
</dd>
<dt><code>roleName</code></dt>
<dd>
<p>Sp&eacute;cifie le nom du r&ocirc;le SQL initial.</p>
</dd>
<dt><code>datasourceName</code></dt>
<dd>
<p>Sp&eacute;cifie un &eacute;l&eacute;ment <code>XADataSource</code> sous-jacent ou un &eacute;l&eacute;ment <code>ConnectionPoolDataSource</code> si le groupement de connexions est effectu&eacute;.</p>
</dd>
<dt><code>description</code></dt>
<dd>
<p>Sp&eacute;cifie une description textuelle.</p>
</dd>
<dt><code>url</code></dt>
<dd>
<p>Sp&eacute;cifie l'URL du pool de connexions. Bien qu'il ne s'agisse pas d'une propri&eacute;t&eacute; standard, elle est couramment utilis&eacute;e.</p>
</dd>
</dl>





<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
