<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jdbcconnectionpoolnew2" name="ref-jdbcconnectionpoolnew2"></a></p>

<h4><a id="sthref44" name="sthref44"></a>Nouveau pool de connexions JDBC (&eacute;tape 2 sur 2)</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Nouveau pool de connexions JDBC (&eacute;tape 2 sur 2) permet de cr&eacute;er un pool de connexions JDBC.</p>
<p>Elle contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Nom de classe de la source de donn&eacute;es</dt>
<dd>
<p>Nom de classe propre au fournisseur qui impl&eacute;mente l'API <code>DataSource</code>, <code>ConnectionPoolDataSource</code> ou <code>XADataSource</code>. Si vous avez activ&eacute; l'option Introspecter et s&eacute;lectionn&eacute; l'un des types de ressource de source de donn&eacute;es, ce champ contient automatiquement le nom de classe associ&eacute; au type de ressource et au fournisseur de base de donn&eacute;es choisis. Si vous s&eacute;lectionnez le type de ressource <code>java.sql.Driver</code>, ce champ est d&eacute;sactiv&eacute;.</p>
</dd>
<dt>Nom de classe du pilote</dt>
<dd>
<p>Nom de classe du pilote JDBC indiqu&eacute; par le fournisseur. Si vous avez activ&eacute; l'option Introspecter et s&eacute;lectionn&eacute; le type de ressource <code>java.sql.Driver</code>, ce champ contient automatiquement le nom de classe associ&eacute; au pilote et au fournisseur de base de donn&eacute;es choisis. Si vous s&eacute;lectionnez l'un des types de ressource de source de donn&eacute;es, ce champ est d&eacute;sactiv&eacute;.</p>
</dd>
<dt>Ping</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, la commande ping est automatiquement envoy&eacute;e au pool lors de sa cr&eacute;ation ou de sa reconfiguration, afin d'identifier et de signaler toute erreur de valeur d'attribut. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Description</dt>
<dd>
<p>Br&egrave;ve description du pool de connexions.</p>
</dd>
<dt>Taille initiale et minimale du pool</dt>
<dd>
<p>Nombre minimal de connexions dans le pool. Cette valeur d&eacute;termine &eacute;galement le nombre de connexions plac&eacute;es dans le pool lors de sa cr&eacute;ation initiale ou lors du d&eacute;marrage de GlassFish Server. La valeur par d&eacute;faut est 8.</p>
</dd>
<dt>Taille maximale du pool</dt>
<dd>
<p>Nombre maximal de connexions dans le pool. La valeur par d&eacute;faut est 32.</p>
</dd>
<dt>Valeur de redimensionnement du pool</dt>
<dd>
<p>Lors de la mont&eacute;e en puissance du pool jusqu'&agrave; sa taille maximale ou de sa r&eacute;duction jusqu'&agrave; sa taille minimale, il est redimensionn&eacute; par batch. Cette valeur d&eacute;termine le nombre de connexions dans le batch. Une valeur trop &eacute;lev&eacute;e retarde la cr&eacute;ation et le recyclage de la connexion, alors qu'une valeur trop basse r&eacute;duit les performances. La valeur par d&eacute;faut est 2.</p>
</dd>
<dt>D&eacute;lai d'inactivit&eacute;</dt>
<dd>
<p>Dur&eacute;e maximale, en secondes, pendant laquelle une connexion peut rester inactive dans le pool. Une fois ce d&eacute;lai expir&eacute;, la connexion est enlev&eacute;e du pool. La valeur par d&eacute;faut est 300.</p>
</dd>
<dt>Attente max.</dt>
<dd>
<p>D&eacute;lai d'attente maximal, en millisecondes, d'une application demandant une connexion au-del&agrave; duquel la connexion est temporis&eacute;e. La valeur par d&eacute;faut est 60 000.</p>
</dd>
<dt>Connexions non transactionnelles</dt>
<dd>
<p>Si cette option est activ&eacute;e, des connexions non transactionnelles sont renvoy&eacute;es.</p>
</dd>
<dt>Isolement de la transaction</dt>
<dd>
<p>Lorsqu'un niveau d'isolement de transaction est sp&eacute;cifi&eacute;, les connexions de ce pool op&egrave;rent au niveau indiqu&eacute;. Si aucune valeur n'est sp&eacute;cifi&eacute;e, les connexions sont &eacute;tablies au niveau d'isolement par d&eacute;faut indiqu&eacute; par le pilote JDBC. Par d&eacute;faut, cette option n'est pas sp&eacute;cifi&eacute;e.</p>
</dd>
<dt>Niveau d'isolement</dt>
<dd>
<p>Si la case Garanti est coch&eacute;e, toutes les connexions emprunt&eacute;es au pool partagent le m&ecirc;me niveau d'isolement. Par exemple, si le niveau d'isolement de la connexion a &eacute;t&eacute; modifi&eacute; par programmation (avec <code>con.setTransactionIsolation</code>) lors de sa derni&egrave;re utilisation, ce m&eacute;canisme r&eacute;tablit le statut au niveau d'isolement sp&eacute;cifi&eacute;. Cette option est activ&eacute;e par d&eacute;faut.</p>
<p>Ce param&egrave;tre ne s'applique que lorsqu'un niveau d'isolement de transaction a &eacute;t&eacute; sp&eacute;cifi&eacute;.</p>
</dd>
<dt>Autres propri&eacute;t&eacute;s</dt>
<dd>
<p>Propri&eacute;t&eacute;s suppl&eacute;mentaires du pool de connexions JDBC. Ces propri&eacute;t&eacute;s peuvent inclure le nom de la base de donn&eacute;es (URL), le nom utilisateur et le mot de passe. La table contient normalement les propri&eacute;t&eacute;s utilis&eacute;es par le fournisseur de base de donn&eacute;es.</p>
<p>Pour obtenir la description d'une partie des propri&eacute;t&eacute;s disponibles, reportez-vous &agrave; <a href="ref-jdbc-properties.html">Propri&eacute;t&eacute;s propres aux pools de connexions JDBC</a>.</p>
<p>Si vous n'indiquez pas de valeur pour une propri&eacute;t&eacute;, celle-ci est enlev&eacute;e de la table &agrave; l'issue de la cr&eacute;ation du pool de connexions. Si vous ne souhaitez pas d&eacute;finir imm&eacute;diatement la valeur d'une propri&eacute;t&eacute; mais conserver cette propri&eacute;t&eacute; dans la table afin de d&eacute;finir sa valeur ult&eacute;rieurement, entrez des parenth&egrave;ses vides dans le champ Valeur :</p>
<pre>
()
</pre></dd>
</dl>
<a id="sthref45" name="sthref45"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">Configuration de l'acc&egrave;s aux bases de donn&eacute;es</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">Int&eacute;gration d'un pilote JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">Cr&eacute;ation d'un pool de connexions JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">Modification des param&egrave;tres g&eacute;n&eacute;raux de pool de connexions JDBC</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">V&eacute;rification des param&egrave;tres de pool de connexions</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">Modification des attributs avanc&eacute;s de pool de connexions JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">Modification des propri&eacute;t&eacute;s de pool de connexions JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">Suppression d'un pool de connexions JDBC</a></p>
</li>
</ul>
<a id="sthref46" name="sthref46"></a>
<h5>Commandes asadmin connexes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00001"><code>add-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00036"><code>create-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00088"><code>delete-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00135"><code>flush-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00173"><code>list-jdbc-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00214"><code>ping-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00234"><code>start-database</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00239"><code>stop-database</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
