<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jdbcresourcenew" name="task-jdbcresourcenew"></a></p>

<h4><a id="sthref6" name="sthref6"></a>Cr&eacute;ation d'une ressource JDBC</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Une ressource JDBC (Java DataBase Connectivity) (source de donn&eacute;es) fournit des applications dans le but d'&eacute;tablir une connexion &agrave; une base de donn&eacute;es.</p>
<a id="sthref7" name="sthref7"></a>
<h5>Avant de commencer</h5>
<p>Pour cr&eacute;er une ressource JDBC, vous devez commencer par cr&eacute;er un pool de connexions JDBC. Reportez-vous &agrave; <a href="task-jdbcconnectionpoolnew.html">Cr&eacute;ation d'un pool de connexions JDBC</a>.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Ressources.</p>
</li>
<li>
<p>Sous le noeud Ressources, d&eacute;veloppez le noeud JDBC.</p>
</li>
<li>
<p>Sous le noeud JDBC, s&eacute;lectionnez le noeud Ressources JDBC.</p>
<p>La page Ressources JDBC appara&icirc;t.</p>
</li>
<li>
<p>Dans la page Ressources JDBC, cliquez sur Nouveau.</p>
<p>La page Nouvelle ressource JDBC appara&icirc;t.</p>
</li>
<li>
<p>Dans le champ Nom JNDI, attribuez un nom unique &agrave; la ressource.</p>
<p>Le nom JNDI organise et localise les composants dans un environnement informatique distribu&eacute; de la m&ecirc;me mani&egrave;re que des catalogues sur fiches organisent et repr&eacute;sentent des emplacements de livres dans une biblioth&egrave;que. Par cons&eacute;quent, le nom JNDI est une m&eacute;thode importante d'acc&egrave;s &agrave; la ressource JDBC. Par convention, le nom commence par la cha&icirc;ne <code>jdbc/</code>, par exemple <code>jdbc/payrolldb</code>. N'oubliez pas la barre oblique.</p>
<p>Le nom ne peut contenir que des caract&egrave;res alphanum&eacute;riques, des traits de soulignement, des tirets ou des points.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Nom du pool, s&eacute;lectionnez un pool de connexions &agrave; associer &agrave; la nouvelle ressource JDBC.</p>
</li>
<li>
<p>Dans le champ Description, entrez une br&egrave;ve description de la nouvelle ressource JDBC.</p>
</li>
<li>
<p>Cochez la case Activ&eacute; du champ Statut pour rendre la ressource disponible lors de l'ex&eacute;cution.</p>
<p>Cette option est activ&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Dans la section Autres propri&eacute;t&eacute;s, sp&eacute;cifiez les propri&eacute;t&eacute;s suppl&eacute;mentaires.</p>
<p>GlassFish Server ne d&eacute;finit aucune autre propri&eacute;t&eacute; pour les ressources JDBC.</p>
<p>Pour ajouter une propri&eacute;t&eacute;, cliquez sur le bouton Ajouter une propri&eacute;t&eacute;. Sur la ligne vide qui appara&icirc;t, saisissez le nom de la propri&eacute;t&eacute; dans le champ Nom et la valeur de la propri&eacute;t&eacute; dans le champ Valeur.</p>
</li>
<li>
<p>S&eacute;lectionnez une cible disponible pour l'ajouter &agrave; la liste Cibles s&eacute;lectionn&eacute;es ou l'en enlever.</p>
</li>
<li>
<p>Cliquez sur OK.</p>
</li>
</ol>
<a id="sthref8" name="sthref8"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">Configuration de l'acc&egrave;s aux bases de donn&eacute;es</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">Int&eacute;gration d'un pilote JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesedit.html">Modification d'une ressource JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcetargets.html">Modification des cibles de ressource JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesdelete.html">Suppression d'une ressource JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">Cr&eacute;ation d'un pool de connexions JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">Modification des param&egrave;tres g&eacute;n&eacute;raux de pool de connexions JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">Modification des attributs avanc&eacute;s de pool de connexions JDBC</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">V&eacute;rification des param&egrave;tres de pool de connexions</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">Modification des propri&eacute;t&eacute;s de pool de connexions JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">Suppression d'un pool de connexions JDBC</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
