<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jdbcconnectionpooledit" name="task-jdbcconnectionpooledit"></a></p>

<h4><a id="sthref17" name="sthref17"></a>Modification des param&egrave;tres g&eacute;n&eacute;raux de pool de connexions JDBC</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Ressources.</p>
</li>
<li>
<p>Sous le noeud Ressources, d&eacute;veloppez le noeud JDBC.</p>
</li>
<li>
<p>Sous le noeud JDBC, s&eacute;lectionnez le noeud Pools de connexions.</p>
<p>La page Pools de connexions appara&icirc;t.</p>
</li>
<li>
<p>Cliquez sur le nom du pool de connexions &agrave; modifier.</p>
<p>La page Modifier le pool de connexions appara&icirc;t.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Type de ressource, s&eacute;lectionnez un type de ressource.</p>
<p>Les options suivantes sont disponibles : <code>javax.sql.DataSource</code> (transactions locales uniquement), <code>javax.sql.XADataSource</code> (transactions globales) et <code>java.sql.ConnectionPoolDataSource</code> (transactions locales, am&eacute;liorations possibles des performances).</p>
</li>
<li>
<p>Dans le champ Nom de classe de la source de donn&eacute;es, saisissez le nom de la classe propre au fournisseur qui impl&eacute;mente l'API <code>DataSource</code>, <code>ConnectionPoolDataSource</code> ou <code>XADataSource</code>.</p>
<p>Si vous s&eacute;lectionnez l'un des types de ressource de source de donn&eacute;es, ce champ indique habituellement automatiquement le nom de classe associ&eacute; au type de ressource et au fournisseur de base de donn&eacute;es que vous avez choisis. Si vous s&eacute;lectionnez le type de ressource <code>java.sql.Driver</code>, ce champ est d&eacute;sactiv&eacute;.</p>
</li>
<li>
<p>Dans le champ Nom de classe du pilote, saisissez le nom de classe propre au fournisseur qui impl&eacute;mente l'API <code>java.sql.Driver</code>.</p>
<p>Si vous s&eacute;lectionnez le type de ressource <code>java.sql.Driver</code>, ce champ indique habituellement automatiquement le nom de classe associ&eacute; au pilote et au fournisseur de base de donn&eacute;es que vous avez choisis. Si vous s&eacute;lectionnez l'un des types de ressource de source de donn&eacute;es, ce champ est d&eacute;sactiv&eacute;.</p>
</li>
<li>
<p>Cochez la case Activ&eacute; du champ Ping pour envoyer automatiquement la commande ping &agrave; un pool lors de sa cr&eacute;ation ou de sa reconfiguration, afin d'identifier et de signaler toute erreur de valeur d'attribut.</p>
<p>Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Dans le champ Ordre de d&eacute;ploiement, saisissez un nombre pour indiquer l'ordre de d&eacute;ploiement du pool de connexions.</p>
<p>Les ressources avec les plus petits num&eacute;ros sont charg&eacute;s en premier au d&eacute;marrage du serveur. La valeur par d&eacute;faut est 100.</p>
</li>
<li>
<p>Dans le champ Description, entrez une br&egrave;ve description du pool de connexions.</p>
</li>
<li>
<p>Dans le champ Taille initiale et minimale du pool, entrez le nombre minimal de connexions de ce pool.</p>
<p>Cette valeur d&eacute;termine &eacute;galement le nombre de connexions plac&eacute;es dans le pool lors de sa cr&eacute;ation initiale ou lors du d&eacute;marrage de GlassFish Server. La valeur par d&eacute;faut est 8.</p>
</li>
<li>
<p>Dans le champ Taille maximale du pool, entrez le nombre maximal de connexions de ce pool.</p>
<p>La valeur par d&eacute;faut est 32.</p>
</li>
<li>
<p>Dans le champ Valeur de redimensionnement du pool, entrez le nombre de connexions par batch de redimensionnement du pool.</p>
<p>Lors de la mont&eacute;e en puissance du pool jusqu'&agrave; sa taille maximale ou de sa r&eacute;duction jusqu'&agrave; sa taille minimale, il est redimensionn&eacute; par batch. Cette valeur d&eacute;termine le nombre de connexions dans le batch. Une valeur trop &eacute;lev&eacute;e retarde la cr&eacute;ation et le recyclage de la connexion, alors qu'une valeur trop basse r&eacute;duit les performances. La valeur par d&eacute;faut est 2.</p>
</li>
<li>
<p>Dans le champ D&eacute;lai d'inactivit&eacute;, entrez la dur&eacute;e maximale, en secondes, pendant laquelle une connexion peut rester inactive dans le pool.</p>
<p>Une fois ce d&eacute;lai expir&eacute;, la connexion est enlev&eacute;e du pool. La valeur par d&eacute;faut est 300.</p>
</li>
<li>
<p>Dans le champ Attente max., entrez le d&eacute;lai d'attente maximal (en millisecondes) au-del&agrave; duquel la connexion est temporis&eacute;e pour une application demandant une connexion.</p>
<p>La valeur par d&eacute;faut est 60 000.</p>
</li>
<li>
<p>Cochez la case Activ&eacute; du champ Connexions non transactionnelles pour renvoyer les connexions non transactionnelles.</p>
<p>Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante, s&eacute;lectionnez le niveau d'isolement de transaction du pool de connexions.</p>
<p>Si aucune valeur n'est sp&eacute;cifi&eacute;e, les connexions sont &eacute;tablies au niveau d'isolement par d&eacute;faut indiqu&eacute; par le pilote JDBC. Par d&eacute;faut, cette option n'est pas sp&eacute;cifi&eacute;e.</p>
</li>
<li>
<p>Cochez la case Garanti du champ Niveau d'isolement pour que toutes les connexions emprunt&eacute;es au pool partagent le m&ecirc;me niveau d'isolement.</p>
<p>Par exemple, si le niveau d'isolement de la connexion a &eacute;t&eacute; modifi&eacute; par programmation (avec <code>con.setTransactionIsolation</code>) lors de sa derni&egrave;re utilisation, ce m&eacute;canisme r&eacute;tablit le statut au niveau d'isolement indiqu&eacute;.</p>
<p>Ce param&egrave;tre ne s'applique que lorsqu'un niveau d'isolement de transaction a &eacute;t&eacute; sp&eacute;cifi&eacute;.</p>
</li>
<li>
<p>Cliquez sur le bouton Ping pour v&eacute;rifier la connexion &agrave; la base de donn&eacute;es.</p>
<p>La Console d'administration tente de se connecter &agrave; la base de donn&eacute;es. Si un message d'erreur appara&icirc;t, v&eacute;rifiez que le serveur de base de donn&eacute;es a &eacute;t&eacute; d&eacute;marr&eacute;.</p>
</li>
<li>
<p>Cliquez sur le bouton Vider pour r&eacute;initialiser le pool de connexions &agrave; son &eacute;tat initial.</p>
<p>Toutes les connexions actives sont d&eacute;truites, ce qui signifie que les transactions associ&eacute;es &agrave; ces connexions sont perdues. La sous-commande recr&eacute;e ensuite les connexions initiales pour le pool et restaure le pool &agrave; sa taille de pool constante.</p>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>

<hr>
<p><b>Conseil:</b></p>
Pour revenir aux param&egrave;tres par d&eacute;faut, cliquez sur le bouton Charger les valeurs par d&eacute;faut, puis sur Enregistrer.
<hr>

</li>
</ol>
<a id="sthref18" name="sthref18"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">Configuration de l'acc&egrave;s aux bases de donn&eacute;es</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">Int&eacute;gration d'un pilote JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcenew.html">Cr&eacute;ation d'une ressource JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesedit.html">Modification d'une ressource JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcetargets.html">Modification des cibles de ressource JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesdelete.html">Suppression d'une ressource JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">Cr&eacute;ation d'un pool de connexions JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">Modification des attributs avanc&eacute;s de pool de connexions JDBC</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">V&eacute;rification des param&egrave;tres de pool de connexions</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">Modification des propri&eacute;t&eacute;s de pool de connexions JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">Suppression d'un pool de connexions JDBC</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
