<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-setdbaccess" name="task-setdbaccess"></a></p>

<h4><a id="sthref2" name="sthref2"></a>Configuration de l'acc&egrave;s aux bases de donn&eacute;es</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Pour stocker, organiser et extraire les donn&eacute;es, la plupart des applications utilisent des bases de donn&eacute;es relationnelles.</p>
<p>GlassFish Server inclut une copie de la base de donn&eacute;es Java DB et est pr&eacute;configur&eacute; pour acc&eacute;der &agrave; cette base de donn&eacute;es.</p>
<ol>
<li>
<p>Installez un produit de base de donn&eacute;es pris en charge.</p>
<p>Pour obtenir la liste des bases de donn&eacute;es prises en charge, reportez-vous &agrave; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRLN"><i>Oracle GlassFish Server Release Notes</i></a>.</p>
</li>
<li>
<p>Installez un pilote prenant en charge l'API JDBC (pilote JDBC) pour la base de donn&eacute;es.</p>
<p>Assurez-vous que le pilote que vous souhaitez utiliser pour cr&eacute;er des connexions &agrave; la base de donn&eacute;es est install&eacute; sur tous les serveurs sur lesquels vous souhaitez d&eacute;ployer la source de donn&eacute;es.</p>
</li>
<li>
<p>Assurez-vous que le fichier JAR du pilote est accessible &agrave; l'instance de serveur du domaine.</p>
<p>Reportez-vous &agrave; <a href="task-integratejdbcdriver.html">Int&eacute;gration d'un pilote JDBC</a>.</p>
</li>
<li>
<p>Cr&eacute;ez la base de donn&eacute;es.</p>
<p>G&eacute;n&eacute;ralement, le fournisseur d'application offre des scripts pour cr&eacute;er et remplir la base de donn&eacute;es.</p>
</li>
<li>
<p>Cr&eacute;ez un pool de connexions pour la base de donn&eacute;es.</p>
<p>Reportez-vous &agrave; <a href="task-jdbcconnectionpoolnew.html">Cr&eacute;ation d'un pool de connexions JDBC</a>.</p>
</li>
<li>
<p>Cr&eacute;ez une ressource JDBC pointant vers le pool de connexions.</p>
<p>Reportez-vous &agrave; <a href="task-jdbcresourcenew.html">Cr&eacute;ation d'une ressource JDBC</a>.</p>
</li>
</ol>
<a id="sthref3" name="sthref3"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-integratejdbcdriver.html">Int&eacute;gration d'un pilote JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcenew.html">Cr&eacute;ation d'une ressource JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesedit.html">Modification d'une ressource JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesdelete.html">Suppression d'une ressource JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">Cr&eacute;ation d'un pool de connexions JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">Modification des param&egrave;tres g&eacute;n&eacute;raux de pool de connexions JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">Modification des attributs avanc&eacute;s de pool de connexions JDBC</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">V&eacute;rification des param&egrave;tres de pool de connexions</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">Modification des propri&eacute;t&eacute;s de pool de connexions JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">Suppression d'un pool de connexions JDBC</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
