<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jdbcresourcesedit" name="task-jdbcresourcesedit"></a></p>

<h4><a id="sthref9" name="sthref9"></a>Modification d'une ressource JDBC</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Ressources.</p>
</li>
<li>
<p>Sous le noeud Ressources, d&eacute;veloppez le noeud JDBC.</p>
</li>
<li>
<p>Sous le noeud JDBC, s&eacute;lectionnez le noeud Ressources JDBC.</p>
<p>La page Ressources JDBC appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Ressources JDBC, cliquez sur le nom de la ressource &agrave; modifier.</p>
<p>La page Modifier une ressource JDBC appara&icirc;t.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Nom du pool, s&eacute;lectionnez un pool de connexions &agrave; associer &agrave; la ressource JDBC.</p>
</li>
<li>
<p>Dans le champ Description, entrez une br&egrave;ve description de la ressource JDBC.</p>
</li>
<li>
<p>Dans la section Autres propri&eacute;t&eacute;s, sp&eacute;cifiez les propri&eacute;t&eacute;s suppl&eacute;mentaires.</p>
<p>GlassFish Server ne d&eacute;finit aucune autre propri&eacute;t&eacute; pour les ressources JDBC.</p>
<ul>
<li>
<p>Pour ajouter une propri&eacute;t&eacute;, cliquez sur le bouton Ajouter une propri&eacute;t&eacute;. Sur la ligne vide qui appara&icirc;t, saisissez le nom de la propri&eacute;t&eacute; dans le champ Nom et la valeur de la propri&eacute;t&eacute; dans le champ Valeur.</p>
</li>
<li>
<p>Pour modifier une propri&eacute;t&eacute;, modifiez le champ Valeur de cette propri&eacute;t&eacute;.</p>
</li>
<li>
<p>Pour supprimer une propri&eacute;t&eacute;, s&eacute;lectionnez la case situ&eacute;e &agrave; gauche du champ Nom de la propri&eacute;t&eacute; &agrave; supprimer, puis cliquez sur le bouton Supprimer des propri&eacute;t&eacute;s.</p>
</li>
</ul>
</li>
<li>
<p>Cliquez sur l'onglet Cible pour g&eacute;rer les cibles de ressource.</p>
<ol type="a">
<li>
<p>Activez ou d&eacute;sactivez les cibles d&eacute;finies pour la ressource, en fonction de vos besoins.</p>
</li>
<li>
<p>Cliquez sur le bouton G&eacute;rer les cibles pour ajouter des cibles &agrave; la ressource ou en enlever.</p>
</li>
</ol>
<p>Pour plus d'informations, reportez-vous &agrave; <a href="task-jdbcresourcetargets.html">Modification des cibles de ressource JDBC</a>.</p>
</li>
<li>
<p>Cliquez sur l'onglet G&eacute;n&eacute;ral pour revenir &agrave; la page Modifier une ressource JDBC.</p>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>
</li>
</ol>
<a id="sthref10" name="sthref10"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">Configuration de l'acc&egrave;s aux bases de donn&eacute;es</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">Int&eacute;gration d'un pilote JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcenew.html">Cr&eacute;ation d'une ressource JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcetargets.html">Modification des cibles de ressource JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesdelete.html">Suppression d'une ressource JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">Cr&eacute;ation d'un pool de connexions JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">Modification des param&egrave;tres g&eacute;n&eacute;raux de pool de connexions JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">Modification des attributs avanc&eacute;s de pool de connexions JDBC</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">V&eacute;rification des param&egrave;tres de pool de connexions</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">Modification des propri&eacute;t&eacute;s de pool de connexions JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">Suppression d'un pool de connexions JDBC</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
