<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="documentinfo"></a><p>N&#250;mero da pe&#231;a: 821-0085-10</p><p>Novembro de 2009</p><p>4150 Network Circle<br>Santa Clara,  CA 95054<br>U.S.A.</p><p>Copyright 2009 Sun Microsystems, Inc.</p><p>A
Sun Microsystems, Inc. possui os direitos de propriedade intelectual relacionados &#224; tecnologia
incorporada ao produto descrito neste documento.  Em especial, mas sem limita&#231;&#245;es,
esses direitos de propriedade intelectual podem incluir uma ou mais patentes norte-americanas
ou solicita&#231;&#245;es de patentes pendentes nos Estados Unidos e em outros pa&#237;ses.</p><p>Direitos
do Governo dos Estados Unidos &#8211; Software comercial.  Os usu&#225;rios governamentais
est&#227;o sujeitos ao contrato de licen&#231;a padr&#227;o da Sun Microsystems, Inc. e
&#224;s cl&#225;usulas aplic&#225;veis do FAR e seus suplementos.</p><p>Esta distribui&#231;&#227;o pode incluir materiais
desenvolvidos por terceiros.</p><p>Partes do produto podem ser derivadas de sistemas Berkeley BSD,
licenciadas pela Universidade da Calif&#243;rnia. UNIX &#233; marca registrada nos Estados Unidos
e outros pa&#237;ses, exclusivamente licenciada pela X/Open Company, Ltd.</p><p>Sun, Sun Microsystems, o
logotipo  Sun, o logotipo Solaris, o logotipo Java Coffee Cup, docs.sun.com,
 Enterprise JavaBeans, EJB, GlassFish, J2EE, J2SE, Java Naming and Directory Interface, JavaBeans,
Javadoc, JDBC, JDK, JavaScript, JavaServer, JavaServer Pages, JMX, JRE, JSP, JVM, MySQL,
NetBeans, OpenSolaris, SunSolve, Sun GlassFish,  Java e Solaris s&#227;o marcas comerciais ou registradas
da Sun Microsystems, Inc. ou de suas subsidi&#225;rias nos Estados Unidos e
em outros pa&#237;ses.  Todas as marcas SPARC s&#227;o utilizadas sob licen&#231;a
e s&#227;o marcas comerciais ou registradas da SPARC International, Inc. nos Estados
Unidos e em outros pa&#237;ses.  Os produtos com marcas SPARC est&#227;o
baseados na arquitetura desenvolvida pela Sun Microsystems, Inc. </p><p>O OPEN LOOK e
a Interface Gr&#225;fica do Usu&#225;rio da Sun<sup>TM</sup> foram desenvolvidos pela Sun Microsystems,
Inc. para seus usu&#225;rios e licenciados.  A Sun reconhece o trabalho
pioneiro da Xerox na pesquisa e no desenvolvimento do conceito de interfaces
do usu&#225;rio visuais ou gr&#225;ficas para a ind&#250;stria de computadores.  A
Sun possui uma licen&#231;a n&#227;o exclusiva da Xerox para a Interface do
Usu&#225;rio Gr&#225;fica Xerox. Essa licen&#231;a abrange tamb&#233;m os licenciados da Sun com
implementa&#231;&#245;es de GUIs do OPEN LOOK e que, dessa forma, cumprem os
contratos de licen&#231;a escritos da Sun.</p><p>Os produtos abrangidos por e as informa&#231;&#245;es
contidas nesta publica&#231;&#227;o s&#227;o controlados pelas leis de Controle de Exporta&#231;&#227;o dos
Estados Unidos e podem estar sujeitos &#224;s leis de exporta&#231;&#227;o ou importa&#231;&#227;o
de outros pa&#237;ses.  Est&#227;o estritamente proibidos os usos ou usu&#225;rios finais,
independentemente de serem diretos ou indiretos, de armas nucleares, m&#237;sseis, armas qu&#237;micas
ou biol&#243;gicas ou os usos/usu&#225;rios finais de produtos mar&#237;timos nucleares. &#201; estritamente
proibida a exporta&#231;&#227;o ou reexporta&#231;&#227;o para pa&#237;ses sujeitos a embargos dos Estados
Unidos ou para entidades identificadas nas listas norte-americanas de exclus&#227;o &#224; exporta&#231;&#227;o,
incluindo, mas n&#227;o se limitando &#224;s listas nacionais de pessoas recusadas e
especialmente designadas.</p><p>A DOCUMENTA&#199;&#195;O &#201; FORNECIDA "NO ESTADO EM QUE SE ENCONTRA", E
S&#195;O RECUSADAS TODAS AS CONDI&#199;&#213;ES, REPRESENTA&#199;&#213;ES E GARANTIAS EXPRESSAS OU IMPL&#205;CITAS, INCLUINDO
TODAS AS GARANTIAS IMPL&#205;CITAS DE COMERCIALIZA&#199;&#195;O, ADEQUA&#199;&#195;O A UMA FINALIDADE ESPEC&#205;FICA OU
DE N&#195;O-VIOLA&#199;&#195;O, EXCETO QUANDO TAIS REJEI&#199;&#213;ES FOREM CONSIDERADAS LEGALMENTE INV&#193;LIDAS.</p><p></p><p>Sun Microsystems, Inc.
d&#233;tient les droits de propri&#233;t&#233; intellectuelle relatifs &#224; la technologie incorpor&#233;e dans le produit
qui est d&#233;crit dans ce document. En particulier, et ce sans limitation, ces droits
de propri&#233;t&#233; intellectuelle peuvent inclure un ou plusieurs brevets am&#233;ricains ou des applications de brevet
en attente aux Etats-Unis et dans d'autres pays.</p><p>Cette distribution peut comprendre des composants d&#233;velopp&#233;s
par des tierces personnes.</p><p>Certaines composants de ce produit peuvent &#234;tre d&#233;riv&#233;es du logiciel
Berkeley BSD, licenci&#233;s par l'Universit&#233; de Californie. UNIX est une marque d&#233;pos&#233;e aux Etats-Unis
et dans d'autres pays; elle est licenci&#233;e exclusivement par X/Open Company, Ltd. </p><p>Sun, Sun
Microsystems, le logo Sun, le logo Solaris, le logo Java Coffee Cup, docs.sun.com,
 Enterprise JavaBeans, EJB, GlassFish, J2EE, J2SE, Java Naming and Directory Interface, JavaBeans,
Javadoc, JDBC, JDK, JavaScript, JavaServer, JavaServer Pages, JMX, JRE, JSP, JVM, MySQL,
NetBeans, OpenSolaris, SunSolve, Sun GlassFish,   Java et Solaris sont des marques de fabrique
ou des marques d&#233;pos&#233;es de Sun Microsystems, Inc., ou ses filiales, aux Etats-Unis
et dans d'autres pays. Toutes les marques SPARC sont utilis&#233;es sous licence et sont
des marques de fabrique ou des marques d&#233;pos&#233;es de SPARC International, Inc. aux Etats-Unis et
dans d'autres pays. Les produits portant les marques SPARC sont bas&#233;s sur une architecture d&#233;velopp&#233;e
par Sun Microsystems, Inc.</p><p>L'interface d'utilisation graphique OPEN LOOK et Sun a &#233;t&#233; d&#233;velopp&#233;e par
Sun Microsystems, Inc. pour ses utilisateurs et licenci&#233;s. Sun reconna&#238;t les efforts de pionniers
de Xerox pour la recherche et le d&#233;veloppement du concept des interfaces d'utilisation visuelle ou graphique
pour l'industrie de l'informatique. Sun d&#233;tient une licence non exclusive de Xerox sur l'interface
d'utilisation graphique Xerox, cette licence couvrant &#233;galement les licenci&#233;s de Sun qui mettent en
place l'interface d'utilisation graphique OPEN LOOK et qui, en outre, se conforment aux licences
&#233;crites de Sun.</p><p>Les produits qui font l'objet de cette publication et les informations
qu'il contient sont r&#233;gis par la legislation am&#233;ricaine en mati&#232;re de contr&#244;le des
exportations et peuvent &#234;tre soumis au droit d'autres pays dans le domaine des
exportations et importations. Les utilisations finales, ou utilisateurs finaux, pour des armes nucl&#233;aires,
des missiles, des armes chimiques ou biologiques ou pour le nucl&#233;aire maritime, directement
ou indirectement, sont strictement interdites. Les exportations ou r&#233;exportations vers des pays sous embargo
des Etats-Unis, ou vers des entit&#233;s figurant sur les listes d'exclusion d'exportation am&#233;ricaines,
y compris, mais de mani&#232;re non exclusive, la liste de personnes qui font
objet d'un ordre de ne pas participer, d'une fa&#231;on directe ou indirecte, aux exportations
des produits ou des services qui sont r&#233;gis par la legislation am&#233;ricaine en mati&#232;re
de contr&#244;le des exportations et la liste de ressortissants sp&#233;cifiquement design&#233;s, sont rigoureusement interdites.</p><p>LA DOCUMENTATION
EST FOURNIE "EN L'ETAT" ET TOUTES AUTRES CONDITIONS, DECLARATIONS ET GARANTIES EXPRESSES OU
TACITES SONT FORMELLEMENT EXCLUES, DANS LA MESURE AUTORISEE PAR LA LOI APPLICABLE, Y
COMPRIS NOTAMMENT TOUTE GARANTIE IMPLICITE RELATIVE A LA QUALITE MARCHANDE, A L'APTITUDE A
UNE UTILISATION PARTICULIERE OU A L'ABSENCE DE CONTREFACON. </p>
