<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-editfile-adminrealm"></a><h4>Propriedades espec&#237;ficas da classe <tt> FileRealm</tt></h4>
<p>As seguintes propriedades s&#227;o necess&#225;rias a um dom&#237;nio <tt>arquivo</tt>.</p><dl><dt>Contexto JAAS</dt>
<dd><p>O contexto JAAS (Java Authentication and Authorization Service) (o identificador do m&#243;dulo de login para usar este dom&#237;nio). O &#250;nico valor v&#225;lido &#233; <tt>fileRealm</tt>.</p></dd>
<dt>Arquivo Principal</dt>
<dd><p>Caminho completo e nome do arquivo em que o servidor armazenar&#225; todas as informa&#231;&#245;es de usu&#225;rio, grupo e senha para esse dom&#237;nio. O Valor padr&#227;o &#233; <i>domain-dir</i><tt>/config/keyfile</tt> para o dom&#237;nio <tt>arquivo</tt> e <i>domain-dir</i><tt>/config/admin-keyfile</tt> para <tt>dom&#237;nio admin</tt>.</p></dd>
</dl>
<p>O arquivo principal do dom&#237;nio <tt>arquivo</tt> inicialmente est&#225; vazio, portanto, os usu&#225;rios
devem ser adicionados na p&#225;gina <a href="ref-managefilerealm.html">Usu&#225;rios do Arquivo</a> para que o dom&#237;nio <tt>arquivo</tt> possa
ser usado.</p><p>O arquivo principal do <tt>dom&#237;nio admin</tt> inicialmente cont&#233;m o nome de usu&#225;rio do
administrador, a senha do administrador em um formato criptografado e o grupo
ao qual este usu&#225;rio pertence (<tt>asadmin</tt>, por padr&#227;o).  Para obter mais
informa&#231;&#245;es sobre como adicionar usu&#225;rios ao <tt>dom&#237;nio admin</tt>, consulte <a href="task-accessadmintools.html">Para dar acesso a ferramentas de administra&#231;&#227;o</a>.</p>
<hr><p><b>Observa&#231;&#227;o - </b>Os usu&#225;rios do grupo <tt>asadmin</tt> no <tt>dom&#237;nio admin</tt> s&#227;o autorizados a usar o
Console de Administra&#231;&#227;o e as ferramentas de <tt>asadmin</tt>.  Adicione, a esse
grupo, somente usu&#225;rios com privil&#233;gios administrativos de servidor.</p>
<hr>
<p>A propriedade opcional a seguir est&#225; dispon&#237;vel no dom&#237;nio <tt>arquivo</tt>.</p><dl><dt>Atribuir Grupos</dt>
<dd><p>Uma lista de nomes de grupos, separados por v&#237;rgula. Todos os clientes que apresentarem certificados v&#225;lidos ser&#227;o atribu&#237;dos a esses grupos; por exemplo, <tt>funcion&#225;rio,gerente</tt>, onde esses forem os nomes de grupos de usu&#225;rios.</p></dd>
</dl>

