<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-ldaprealmprop"></a><h4>Propriedades espec&#237;ficas da classe <tt>LDAPRealm </tt></h4>
<p>As seguintes propriedades s&#227;o necess&#225;rias a um dom&#237;nio LDAP.</p><dl><dt>Contexto JAAS</dt>
<dd><p>O contexto JAAS (Java Authentication and Authorization Service) (o identificador do m&#243;dulo de login para usar este dom&#237;nio). O &#250;nico valor v&#225;lido &#233; <tt>solarisRealm</tt>.</p></dd>
<dt>Diret&#243;rio</dt>
<dd><p>A URL LDAP do servidor.</p></dd>
<dt>DN Base</dt>
<dd><p>O nome distinto (DN) de base do LDAP para o local de dados do usu&#225;rio. Esse DN base pode estar em qualquer n&#237;vel acima dos dados do usu&#225;rio, pois uma pesquisa de escopo de &#225;rvore &#233; executada. Quanto menor a &#225;rvore de pesquisa, melhor o desempenho.</p></dd>
</dl>
<p>A propriedade opcional a seguir est&#225; dispon&#237;vel no dom&#237;nio LDAP.</p><dl><dt>Atribuir Grupos</dt>
<dd><p>Uma lista de nomes de grupos, separados por v&#237;rgula. Todos os clientes que apresentarem certificados v&#225;lidos ser&#227;o atribu&#237;dos a esses grupos; por exemplo, <tt>funcion&#225;rio,gerente</tt>, onde esses forem os nomes de grupos de usu&#225;rios.</p></dd>
</dl>
<p>As seguintes propriedades adicionais est&#227;o dispon&#237;veis em um dom&#237;nio LDAP.</p><dl><dt><tt>search-filter</tt></dt>
<dd><p>O filtro de pesquisa a ser usado para localizar o usu&#225;rio. O padr&#227;o &#233; <tt> uid=%s</tt> (<tt>%s</tt> expande o nome do assunto).</p></dd>
<dt><tt>group-base-dn</tt></dt>
<dd><p>O DN base do local de dados do usu&#225;rio. Por padr&#227;o, &#233; igual ao valor DN de base, mas pode ser ajustado, se necess&#225;rio.</p></dd>
<dt><tt>group-search-filter</tt></dt>
<dd><p>O filtro de pesquisa para localizar associa&#231;&#245;es de grupos para o usu&#225;rio. O padr&#227;o &#233; <tt>uniquemember=%d</tt> (<tt>%d</tt> expande o DN de elemento do usu&#225;rio).</p></dd>
<dt><tt>group-target</tt></dt>
<dd><p>O nome do atributo do LDAP que cont&#233;m entradas de nomes de grupos. O padr&#227;o &#233; <tt>CN</tt>.</p></dd>
<dt><tt>search-bind-dn</tt></dt>
<dd><p>Um DN opcional usado para autenticar o diret&#243;rio para execu&#231;&#227;o da pesquisa <tt>search-filter</tt>. Exigido apenas para diret&#243;rios que n&#227;o permitem pesquisa an&#244;nima.</p></dd>
<dt><tt>search-bind-password</tt></dt>
<dd><p>A senha do LDAP para o DN fornecido em <tt>search-bind-dn</tt> .</p></dd>
</dl>

