<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-editjdbcrealm"></a><h4>Propriedades espec&#237;ficas para a classe <tt>JDBCRealm </tt></h4>
<p>Para proteger suas p&#225;ginas da Web ou seus aplicativos Web, configure a
seguran&#231;a para que somente usu&#225;rios registrados possam acess&#225;-los. Isso &#233; conhecido como
recurso de autentica&#231;&#227;o. Esse tipo de dom&#237;nio envolve o armazenamento de credenciais
dos usu&#225;rios em um banco de dados. O Enterprise Server usa as
informa&#231;&#245;es do banco de dados e a op&#231;&#227;o ativada de dom&#237;nio JDBC
no arquivo de configura&#231;&#227;o.</p><p>As seguintes propriedades s&#227;o necess&#225;rias a um dom&#237;nio JDBC.</p><dl><dt>Contexto JAAS</dt>
<dd><p>O contexto JAAS (Java Authentication and Authorization Service) (o identificador do m&#243;dulo de login para usar este dom&#237;nio). O &#250;nico valor v&#225;lido &#233; <tt>jdbcRealm</tt>.</p></dd>
<dt>JNDI</dt>
<dd><p>O nome JNDI deste dom&#237;nio. O valor padr&#227;o &#233; <tt>jdbc/security </tt>.</p></dd>
<dt>Tabela de Usu&#225;rios</dt>
<dd><p>A tabela que cont&#233;m uma lista de usu&#225;rios autorizados deste dom&#237;nio. O valor padr&#227;o &#233; <tt>usertable</tt>.</p></dd>
<dt>Coluna de Nomes de Usu&#225;rios</dt>
<dd><p>O nome da coluna que cont&#233;m a lista de usu&#225;rios, na tabela de usu&#225;rios. O valor padr&#227;o &#233; <tt>userid</tt>.</p></dd>
<dt>Coluna de Senhas</dt>
<dd><p>O nome da coluna que cont&#233;m a respectiva senha do usu&#225;rio, na tabela de usu&#225;rios. O valor padr&#227;o &#233; <tt>password</tt>.</p></dd>
<dt>Tabela de Grupos</dt>
<dd><p>O nome da tabela de grupos no banco de dados. O valor padr&#227;o &#233; <tt>grouptable</tt>.</p></dd>
<dt>Coluna de Nomes de Grupos</dt>
<dd><p>O nome da coluna de nomes de grupos, na tabela de grupos do banco de dados. O valor padr&#227;o &#233; <tt>groupid</tt>.</p></dd>
</dl>
<p>As seguintes propriedades opcionais est&#227;o dispon&#237;veis para um dom&#237;nio JDBC.</p><dl><dt>Atribuir Grupos</dt>
<dd><p>Uma lista de nomes de grupos, separados por v&#237;rgula. Todos os clientes que apresentarem certificados v&#225;lidos ser&#227;o atribu&#237;dos a esses grupos; por exemplo, <tt>funcion&#225;rio,gerente</tt>, onde esses forem os nomes de grupos de usu&#225;rios.</p></dd>
<dt>Usu&#225;rio do Banco de Dados</dt>
<dd><p>Permite especificar o nome do usu&#225;rio do banco de dados no dom&#237;nio, em vez de <tt>jdbc-connection-pool</tt>. Isso evita que outros aplicativos pesquisem o banco de dados, obtenham conex&#227;o e procurem a tabela de usu&#225;rios. Por padr&#227;o, a configura&#231;&#227;o <tt>jdbc-connection-pool</tt> &#233; usada.</p></dd>
<dt>Senha do Banco de Dados</dt>
<dd><p>Permite especificar a senha do banco de dados no dom&#237;nio, em vez de <tt>jdbc-connection-pool</tt>. Isso evita que outros aplicativos pesquisem o banco de dados, obtenham conex&#227;o e procurem a tabela de usu&#225;rios. Por padr&#227;o, a configura&#231;&#227;o <tt>jdbc-connection-pool</tt> &#233; usada.</p></dd>
<dt>Algoritmo de S&#237;ntese</dt>
<dd><p>O algoritmo de s&#237;ntese. O padr&#227;o &#233; <tt>MD5</tt>. Voc&#234; pode usar qualquer algoritmo suportado no JDK ou <tt>nenhum</tt>.</p></dd>
<dt>Codifica&#231;&#227;o</dt>
<dd><p>A codifica&#231;&#227;o. Os valores permitidos s&#227;o <tt>Hex</tt> e <tt> Base64</tt>. Se <tt>digest-algorithm</tt> for especificado, o padr&#227;o ser&#225; <tt>Hex</tt>. Se <tt>digest-algorithm</tt> n&#227;o for especificado, nenhuma codifica&#231;&#227;o ser&#225; especificada, por padr&#227;o.</p></dd>
<dt>Conjunto de Caracteres</dt>
<dd><p>O conjunto de caracteres do algoritmo de s&#237;ntese. </p></dd>
</dl>

