<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-jmxconnectorssledit"></a><h4>SSL</h4>
<p>Use a p&#225;gina SSL para modificar as configura&#231;&#245;es SSL do conector JMX.</p><p>As configura&#231;&#245;es nesta p&#225;gina tem significado apenas se a seguran&#231;a estiver ativada
para o conector JMX na p&#225;gina Editar conector JMX.</p><p>A p&#225;gina SSL cont&#233;m estas op&#231;&#245;es.</p><dl><dt>SSL3</dt>
<dd><p>Se a caixa de sele&#231;&#227;o estiver selecionada, o protocolo SSL3 est&#225; dispon&#237;vel para o conector JMX. Por padr&#227;o, a op&#231;&#227;o est&#225; ativada.</p></dd>
<dt>TLS</dt>
<dd><p>Se a caixa de sele&#231;&#227;o estiver selecionada, o protocolo TLS est&#225; dispon&#237;vel para o conector JMX. Por padr&#227;o, a op&#231;&#227;o est&#225; ativada.</p></dd>
<dt></dt>
<dt>Autentica&#231;&#227;o do Cliente</dt>
<dd><p>Se a caixa de sele&#231;&#227;o estiver selecionada, os clientes dever&#227;o identificar-se eles mesmos para o servidor a cada solicita&#231;&#227;o. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p></dd>
<dt>Nickname Certificado</dt>
<dd><p>O apelido do certificado do servidor no banco de dados de certificados ou o s&#237;mbolo PKCS#11. No certificado, o formato do nome &#233; <tt><i> tokenname</i>:<i>nickname</i></tt>. Incluindo <tt><i>tokenname</i>:</tt> parte do nome nesse atributo &#233; opcional. O valor padr&#227;o &#233; <tt>s1as</tt>.</p></dd>
<dt>Armazenar senha</dt>
<dd><p>O nome do arquivo keystore (por exemplo, <tt>keystore.jks </tt>).</p></dd>
<dt>Algoritmo Confi&#225;vel</dt>
<dd><p>O nome do algoritmo de gerenciamento confi&#225;vel (por exemplo, PKIX) a ser usado para valida&#231;&#227;o do caminho de certifica&#231;&#227;o.</p></dd>
<dt>Comprimento m&#225;x certificado</dt>
<dd><p>O n&#250;mero m&#225;ximo de certificados intermedi&#225;rios n&#227;o auto-emitidos que podem existir em um caminho de certifica&#231;&#227;o. Este campo &#233; usado apenas se o campo Algoritmo Confi&#225;vel estiver definido como PKIX. O valor 0 indica que o caminho pode conter somente um certificado. O valor -1 indica que o comprimento do caminho n&#227;o &#233; restringido (n&#227;o existe m&#225;ximo). Definir um valor valor menor que -1 causa uma exce&#231;&#227;o a ser lan&#231;ada. O valor padr&#227;o &#233; 5.</p></dd>
<dt>Trust Store</dt>
<dd><p>O nome do arquivo truststore (por exemplo, <tt>cacerts.jks </tt>).</p></dd>
<dt>Conjuntos Codificados</dt>
<dd><p>Uma &#225;rea onde voc&#234; pode adicionar ou remover conjuntos codificados. Se voc&#234; n&#227;o adicionar quaisquer conjuntos codificados, todos os conjuntos codificados ser&#227;o usados.</p></dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-jmxconnectoredit.html">Para editar o conector JMX </a></p></li>
<li><p><a href="task-jmxconnectorssledit.html">Para editar as configura&#231;&#245;es SSL do conector JMX</a></p></li></ul>

