<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-eelogging"></a><h4>Configura&#231;&#245;es do Agente de Log</h4>
<p>Use a p&#225;gina Configura&#231;&#245;es do Agente de Log para configurar o log
do Enterprise Server.</p><p>A p&#225;gina Configura&#231;&#245;es do Agente de Log cont&#233;m as seguintes op&#231;&#245;es.</p><dl><dt>Gravar no Log do Sistema</dt>
<dd><p>Se esta op&#231;&#227;o estiver selecionada, a sa&#237;da do log ser&#225; enviada ao recurso <tt> syslog</tt> al&#233;m do log do servidor. Esse recurso est&#225; dispon&#237;vel apenas nos sistemas Solaris e Linux. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p></dd>
<dt>Log no Console</dt>
<dd><p>Se essa op&#231;&#227;o for selecionada, N&#195;O FA&#199;O ID&#201;IA do que acontecer&#225;. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p></dd>
<dt>Arquivo de Log</dt>
<dd><p>Um nome alternativo ou local do arquivo do log do servidor. O local padr&#227;o &#233; <tt>glassfish/domains/domain1/logs/server.log</tt>.</p></dd>
<dt>Manipulador de Logs</dt>
<dd><p>O nome da classe absoluta de um manipulador de logs personalizado. Um manipulador de logs personalizado permite que voc&#234; envie logs para um destino diferente de <tt>server.log </tt> ou <tt>syslog</tt> O manipulador personalizado deve estender a classe <tt>java.util.logging.Handler</tt> (uma API compat&#237;vel com JSR 047). Coloque a classe do manipulador no caminho da classe do Enterprise Server, para que o manipulador seja instalado durante a inicializa&#231;&#227;o do servidor.</p></dd>
<dt>Limite de Rota&#231;&#227;o de Arquivo</dt>
<dd><p>O tamanho em bytes que o arquivo do log do servidor deve alcan&#231;ar antes de ser rotacionado. Quando o log do servidor alcan&#231;a o tamanho especificado, o Enterprise Server cria um arquivo novo, vazio, chamado <tt>server.log</tt> e renomeia o arquivo antigo para <tt>server.log_</tt><i>date</i>, onde <i> date</i> &#233; a data e a hora em que o arquivo foi rotacionado. O valor padr&#227;o &#233; 2 megabytes. O valor m&#237;nimo para o limite &#233; de 500 quilobytes; se voc&#234; especificar um valor menor, o arquivo ser&#225; rotacionado quando alcan&#231;ar 500 KB. Para desativar a rota&#231;&#227;o de arquivos de log, defina o valor para 0.</p></dd>
<dt>Limite de Tempo de Rota&#231;&#227;o de Arquivo</dt>
<dd><p>O n&#250;mero de minutos ap&#243;s o qual o log do servidor deve ser rotacionado. O valor padr&#227;o &#233; 0, o que significa que o arquivo &#233; rotacionado quando ele alcan&#231;a o tamanho especificado no campo Limite de Rota&#231;&#227;o de Arquivo. Se voc&#234; especificar um ou mais minutos, o limite de tempo tem preced&#234;ncia sobre o limite de tamanho especificado pelo campo Limite de Rota&#231;&#227;o de Arquivo.</p></dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-eelogging.html">Para Definir as configura&#231;&#245;es gerais de log</a></p></li>
<li><p><a href="task-eelogginglevels.html">Para configurar n&#237;veis de log</a></p></li>
<li><p><a href="task-logviewer.html">Para exibir o log do servidor</a></p></li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><tt>set-log-level</tt></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/rotate-log-1?a=view"><tt>rotate-log</tt>(1)</a></p></li></ul>

