<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-lifecyclemoduleedit"></a><h4>Editar o M&#243;dulo do Ciclo de Vida</h4>
<p>Use a p&#225;gina Editar o M&#243;dulo do Ciclo de Vida para modificar
configura&#231;&#245;es para um m&#243;dulo do ciclo de vida.</p><p>A p&#225;gina Editar o M&#243;dulo do Ciclo de Vida cont&#233;m as seguintes
op&#231;&#245;es.</p><dl><dt>Nome</dt>
<dd><p>O nome do m&#243;dulo do ciclo de vida. O nome &#233; um campo somente leitura. Voc&#234; pode apenas especificar um nome quando cria um novo m&#243;dulo do ciclo de vida.</p></dd>
<dt>Nome da Classe</dt>
<dd><p>O nome totalmente qualificado do arquivo de classes do m&#243;dulo do ciclo de vida. A classe deve implementar a interface <tt>com.sun.appserv.server.LifecycleListener</tt>.</p></dd>
<dt>Caminho da classe</dt>
<dd><p>O caminho da classe do m&#243;dulo do ciclo de vida. O caminho da classe especifica onde o m&#243;dulo do ciclo de vida est&#225; localizado. O valor padr&#227;o &#233; <tt></tt><i>domain-dir</i><tt>/applications </tt>. Se o m&#243;dulo j&#225; estiver neste diret&#243;rio (isto &#233;, no caminho da classe do servidor), esse campo poder&#225; ser deixado em branco.</p></dd>
<dt>Ordem de Carregamento</dt>
<dd><p>A ordem na qual este m&#243;dulo do ciclo de vida deve ser carregado na inicializa&#231;&#227;o. Os m&#243;dulos com valores inteiros menores de ordem de carregamento s&#227;o carregados antes. O valor pode variar de 101 at&#233; o <tt>MAXINT</tt> do sistema operacional. Valores de 1 a 100 s&#227;o reservados.</p></dd>
<dt>Status</dt>
<dd><p>Se esta op&#231;&#227;o for selecionada, o m&#243;dulo do ciclo de vida ser&#225; ativado. Por padr&#227;o, a op&#231;&#227;o est&#225; ativada.</p></dd>
<dt>Em caso de falha do carregamento</dt>
<dd><p>Se esta op&#231;&#227;o estiver selecionada, o servidor ser&#225; desligado se o m&#243;dulo do ciclo de vida falhar ao ser carregado. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p></dd>
<dt>Servidores Virtuais</dt>
<dd><p>O servidor ou servidores virtuais a serem associados com o m&#243;dulo do ciclo de vida. Por padr&#227;o, nenhum servidor virtual &#233; selecionado.</p></dd>
<dt>Descri&#231;&#227;o</dt>
<dd><p>Uma descri&#231;&#227;o do m&#243;dulo do ciclo de vida.</p></dd>
<dt>Propriedades Adicionais</dt>
<dd><p>Propriedades adicionais do m&#243;dulo do ciclo de vida. O Enterprise Server n&#227;o define nenhuma propriedade adicional para os m&#243;dulos do ciclo de vida.</p></dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-lifecyclemodulenew.html">Para criar um m&#243;dulo do ciclo de vida</a></p></li>
<li><p><a href="task-lifecyclemoduleedit.html">Para editar um m&#243;dulo do ciclo de vida</a></p></li>
<li><p><a href="task-lifecyclemoduledelete.html">Para excluir um m&#243;dulo do ciclo de vida</a></p></li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://docs.sun.com/doc/820-7701/create-lifecycle-module-1?a=view"><tt>create-lifecycle-module</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/list-lifecycle-modules-1?a=view"><tt>list-lifecycle-modules</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/delete-lifecycle-module-1?a=view"><tt>delete-lifecycle-module</tt>(1)</a></p></li></ul>

