<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-serverinstappsconfig"></a><h4>Configura&#231;&#227;o de Aplicativos</h4>
<a name="indexterm-24"></a><a name="indexterm-25"></a><a name="indexterm-26"></a><a name="indexterm-27"></a><p>Use a p&#225;gina Configura&#231;&#227;o de Aplicativos para definir as propriedades que ajudar&#227;o
a garantir que as altera&#231;&#245;es em aplicativos implantados ser&#227;o detectadas e que
as classes modificadas ser&#227;o recarregadas.</p><p>A p&#225;gina Configura&#231;&#227;o de Aplicativos cont&#233;m as seguintes op&#231;&#245;es.</p><dl><dt>Recarregar</dt>
<dd><p>Se esta op&#231;&#227;o estiver ativada, as classes modificadas ser&#227;o recarregadas dinamicamente. O servidor verifica periodicamente se h&#225; altera&#231;&#245;es no diret&#243;rio de implanta&#231;&#227;o e reimplanta o aplicativo, autom&#225;tica e dinamicamente, com as altera&#231;&#245;es. Isso &#233; &#250;til em um ambiente de desenvolvimento, pois permite testar rapidamente as altera&#231;&#245;es de c&#243;digos. Em um ambiente de produ&#231;&#227;o, no entanto, o recarregamento din&#226;mico pode prejudicar o desempenho. Al&#233;m disso, sempre que ocorre um recarregamento, as sess&#245;es nesse tempo de transi&#231;&#227;o se tornam inv&#225;lidas. O cliente deve reiniciar a sess&#227;o. Por padr&#227;o, a op&#231;&#227;o est&#225; ativada.</p></dd>
<dt>Intervalo de Consulta de Recarregamento</dt>
<dd><p>Identifica com que frequ&#234;ncia o servidor deve verificar altera&#231;&#245;es de c&#243;digo nos aplicativos e m&#243;dulos implantados. O valor padr&#227;o &#233; 2.</p></dd>
<dt>Tempo-limite de Sess&#227;o Admin</dt>
<dd><p>Identifica o n&#250;mero de minutos de inatividade que antecede o tempo-limite do Console de Administra&#231;&#227;o, voc&#234; precisa fazer login novamente. O valor padr&#227;o &#233; 60.</p></dd>
<dt>Implanta&#231;&#227;o Autom&#225;tica</dt>
<dd><p>Se esta op&#231;&#227;o for ativada, os aplicativos no diret&#243;rio de implanta&#231;&#227;o autom&#225;tica ser&#227;o implantados dessa forma. Por padr&#227;o, a op&#231;&#227;o est&#225; ativada.</p></dd>
<dt>Intervalo de Consulta de Implanta&#231;&#227;o Autom&#225;tica</dt>
<dd><p>Especifica com que frequ&#234;ncia o servidor deve verificar o diret&#243;rio de implanta&#231;&#227;o autom&#225;tica quanto a altera&#231;&#245;es em aplicativos ou m&#243;dulos. A altera&#231;&#227;o do intervalo de consulta n&#227;o afeta o tempo destinado &#224; implanta&#231;&#227;o de um aplicativo ou m&#243;dulo. O valor padr&#227;o &#233; 2.</p></dd>
<dt>Tempo-limite de Novas Tentativas de Implanta&#231;&#227;o Autom&#225;tica</dt>
<dd><p>Especifica o n&#250;mero de segundos que um arquivo parcialmente copiado pode permanecer inalterado em termos de tamanho antes que ocorra um erro. O valor padr&#227;o &#233; 4.</p><p>Se um arquivo for copiado lentamente no diret&#243;rio de implanta&#231;&#227;o autom&#225;tica, esse arquivo poder&#225; ser exibido antes que todo o arquivo seja copiado. Como resultado, a tentativa de implant&#225;-lo automaticamente falhar&#225;. Se uma tentativa de implanta&#231;&#227;o autom&#225;tica de um aplicativo falhar por esse motivo, o Enterprise Server tentar&#225; implantar o arquivo novamente. Se o tamanho do arquivo parcialmente copiado permanecer inalterado durante o per&#237;odo especificado, ocorrer&#225; um erro.</p></dd>
<dt>Diret&#243;rio de Implanta&#231;&#227;o Autom&#225;tica</dt>
<dd><p>Identifica o diret&#243;rio para monitorar a implanta&#231;&#227;o autom&#225;tica de aplicativos. O valor padr&#227;o &#233; <tt></tt><i>domain-dir</i><tt>/autodeploy</tt>.</p></dd>
<dt>Valida&#231;&#227;o do XML</dt>
<dd><p>Especifica o tipo de valida&#231;&#227;o do XML a ser realizada nos descritores de implanta&#231;&#227;o padr&#227;o e do Enterprise Server. O tipo de ser qualquer um dos seguintes:</p><dl><dt>Completo</dt>
<dd><p>Se a valida&#231;&#227;o do XML falhar, a implanta&#231;&#227;o falhar&#225;. Este &#233; o valor padr&#227;o.</p></dd>
<dt>Analisando</dt>
<dd><p>A implanta&#231;&#227;o ocorreu, apesar dos erros de valida&#231;&#227;o do XML relatados.</p></dd>
<dt>Nenhum</dt>
<dd><p>N&#227;o foi realizada nenhuma valida&#231;&#227;o do XML.</p></dd>
</dl>
</dd>
<dt>Verificador</dt>
<dd><p>Se esta op&#231;&#227;o estiver ativada, o verificador ser&#225; executado antes da implanta&#231;&#227;o autom&#225;tica. Se a verifica&#231;&#227;o falhar, a implanta&#231;&#227;o n&#227;o ser&#225; realizada. O verificador examina a estrutura e o conte&#250;do do arquivo. A verifica&#231;&#227;o de aplicativos grandes geralmente consome muito tempo. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p></dd>
<dt>Pr&#233;-compilar</dt>
<dd><p>Se esta op&#231;&#227;o for ativada, os arquivos JavaServer Pages<sup>TM</sup> ( JSP<sup>TM</sup>) ser&#227;o pr&#233;-compilados. Se esta op&#231;&#227;o for desativada, os arquivos JSP ser&#227;o compilados no tempo de execu&#231;&#227;o, quando forem acessados pela primeira vez. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p></dd>
<dt>Propriedades Adicionais</dt>
<dd><p>Propriedades adicionais dos aplicativos. O Enterprise Server n&#227;o define nenhuma propriedade adicional para os aplicativos.</p></dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-setadvanceappconfig.html">Para definir a configura&#231;&#227;o dos aplicativos avan&#231;ados</a></p></li>
<li><p><a href="task-setadvancedomainattributes.html">Para definir os atributos de dom&#237;nio avan&#231;ados</a></p></li></ul>

