<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-generaltab"></a><h4>Informa&#231;&#245;es Gerais</h4>
<p>Use a p&#225;gina Informa&#231;&#245;es Gerais para verificar as configura&#231;&#245;es do servidor de
aplicativos e para exibir os dados do Java Virtual Machine.</p><p>A p&#225;gina Informa&#231;&#245;es Gerais cont&#233;m as seguintes informa&#231;&#245;es.</p><dl><dt>Bot&#227;o Parar</dt>
<dd><p>Clique no bot&#227;o Parar para interromper o Enterprise Server.</p></dd>
<dt>Bot&#227;o Reiniciar</dt>
<dd><p>Clique no bot&#227;o Reiniciar para iniciar novamente o Enterprise Server.</p></dd>
<dt>Bot&#227;o Exibir arquivos de log</dt>
<dd><p>Clique no bot&#227;o Exibir arquivos de log para exibir o log do servidor.</p></dd>
<dt>Nome</dt>
<dd><p>O nome do servidor.</p></dd>
<dt>JVM Report</dt>
<dd><p>Se voc&#234; clicar em JVM Report, ser&#225; aberta uma janela separada que exibe relat&#243;rios sobre o Java Virtual Machine, incluindo um relat&#243;rio de resumo, um relat&#243;rio de gerenciamento de mem&#243;ria e de coleta de erros,um relat&#243;rio de carregamento de classe e um despejo de segmentos atual.</p></dd>
<dt>Diret&#243;rio de Configura&#231;&#227;o</dt>
<dd><p>O diret&#243;rio localizado no computador host, que cont&#233;m arquivos de configura&#231;&#227;o; por exemplo, <tt>domain.xml</tt>.</p></dd>
<dt>Vers&#227;o Instalada</dt>
<dd><p>O identificador de vers&#227;o do produto.</p></dd>
<dt>Depura&#231;&#227;o</dt>
<dd><p>Identifica se a depura&#231;&#227;o est&#225; ativada. Se a depura&#231;&#227;o estiver ativada, o n&#250;mero de porta tamb&#233;m ser&#225; exibido.</p></dd>
<dt>Porta(s) HTTP</dt>
<dd><p>As portas configuradas atualmente para solicita&#231;&#245;es e respostas HTTP.</p></dd>
<dt>Porta(s) IIOP</dt>
<dd><p>As portas configuradas atualmente para solicita&#231;&#245;es e respostas IIOP.</p></dd>
</dl>
<h5>Tarefa relacionada</h5>

<ul><li><p><a href="task-generaltab.html">Para Exibir Informa&#231;&#245;es Gerais do Enterprise Server</a></p></li>
<li><p><a href="task-logviewer.html">Para exibir o log do servidor</a></p></li></ul>

