<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-security"></a><h4>Seguran&#231;a</h4>
<p>Use a p&#225;gina Seguran&#231;a para definir as propriedades de seguran&#231;a do Enterprise
Server.</p><p>A p&#225;gina Seguran&#231;a cont&#233;m estas op&#231;&#245;es.</p><dl><dt>Gerenciador de Seguran&#231;a </dt>
<dd><p>Se esta op&#231;&#227;o for selecionada, o gerenciador de seguran&#231;a do dom&#237;nio ser&#225; ativado. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p><p>Quando esta op&#231;&#227;o est&#225; ativada, a op&#231;&#227;o <tt>-Djava.security.manager</tt>, do JVM, &#233; adicionada &#225; configura&#231;&#227;o JVM do Enterprise Server. Consulte <a href="task-jvmoptions.html">Para configurar as op&#231;&#245;es de JVM</a>. &#201; preciso reiniciar o servidor para ativar a altera&#231;&#227;o. </p><p>Verifique se voc&#234; tem as permiss&#245;es corretas para todos os aplicativos. Para melhorar o desempenho, desative o gerenciador de seguran&#231;a. </p></dd>
<dt>Log de Auditoria</dt>
<dd><p>Se esta op&#231;&#227;o for ativada, o servidor carregar&#225; e executar&#225; todos os m&#243;dulos de auditoria especificados na configura&#231;&#227;o M&#243;dulos de Auditoria. Se a op&#231;&#227;o for desativada, o servidor n&#227;o acessar&#225; os m&#243;dulos de auditoria. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p></dd>
<dt>Dom&#237;nio Padr&#227;o</dt>
<dd><p>O dom&#237;nio (padr&#227;o) ativo que o servidor usa para autentica&#231;&#227;o. Os aplicativos usam esse dom&#237;nio, a menos que o descritor de implanta&#231;&#227;o especifique um dom&#237;nio diferente. Todos os dom&#237;nios configurados s&#227;o exibidos na lista. O valor padr&#227;o &#233; <tt>arquivo</tt>.</p></dd>
<dt>Principal Padr&#227;o</dt>
<dd><p>Especifica o nome de usu&#225;rio padr&#227;o. O servidor usa esse nome de usu&#225;rio quando nenhum outro principal &#233; fornecido. Se voc&#234; digitar um valor nesse campo, digite a senha correspondente no campo Senha do Principal Padr&#227;o.</p><p>Um principal padr&#227;o n&#227;o &#233; exigido para opera&#231;&#227;o normal do servidor.</p></dd>
<dt>Senha do Principal Padr&#227;o</dt>
<dd><p>A senha do principal padr&#227;o especificada no campo Principal Padr&#227;o. Um principal padr&#227;o n&#227;o &#233; exigido para opera&#231;&#227;o normal do servidor.</p></dd>
<dt>JACC</dt>
<dd><p>O nome da classe de um provedor JACC configurado. O valor padr&#227;o &#233; <tt>default</tt>.</p></dd>
<dt>M&#243;dulos de Auditoria</dt>
<dd><p>Os m&#243;dulos do provedor de auditoria que ser&#227;o usados pelo subsistema de auditoria se o log de auditoria estiver ativado. Por padr&#227;o, o servidor usa um m&#243;dulo de auditoria chamado <tt>padr&#227;o</tt>. Para obter informa&#231;&#245;es sobre a cria&#231;&#227;o de novos m&#243;dulos de auditoria, consulte <a href="task-auditmodulenew.html">Para criar um m&#243;dulo de auditoria</a>.</p></dd>
<dt>Mapeamento Principal Padr&#227;o para Fun&#231;&#227;o Ativado</dt>
<dd><p>Se esta op&#231;&#227;o for selecionada, o mapeamento principal-para-fun&#231;&#227;o ser&#225; aplicado ao aplicativo que n&#227;o tiver um mapeamento espec&#237;fico do aplicativo.</p></dd>
<dt>Classe de Principal Mapeada</dt>
<dd><p>Especifica uma implementa&#231;&#227;o personalizada da classe <tt>java.security.Principal </tt> usada no mapeamento principal-para-fun&#231;&#227;o padr&#227;o, se o mapeamento principal-para-fun&#231;&#227;o padr&#227;o estiver ativado.</p></dd>
<dt>Propriedades Adicionais</dt>
<dd><p>Propriedades de seguran&#231;a adicionais do servidor.</p><p>As propriedades v&#225;lidas dependem do tipo de dom&#237;nio selecionado no campo Dom&#237;nio Padr&#227;o e, geralmente, s&#227;o especificadas quando voc&#234; edita um dom&#237;nio. Para obter detalhes, consulte estes t&#243;picos:</p>
<ul><li><p><a href="ref-editfile-adminrealm.html">Propriedades espec&#237;ficas da classe <tt> FileRealm</tt></a></p></li>
<li><p><a href="ref-editcertrealm.html">Propriedades espec&#237;ficas da classe <tt>CertificateRealm </tt></a></p></li>
<li><p><a href="ref-editjdbcrealm.html">Propriedades espec&#237;ficas para a classe <tt>JDBCRealm </tt></a></p></li>
<li><p><a href="ref-ldaprealmprop.html">Propriedades espec&#237;ficas da classe <tt>LDAPRealm </tt></a></p></li>
<li><p><a href="ref-solarisrealmprop.html">Propriedades espec&#237;ficas da classe <tt>SolarisRealm </tt></a></p></li></ul>
</dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-securitysettings.html">Para definir as configura&#231;&#245;es de seguran&#231;a</a></p></li>
<li><p><a href="task-auditmodulenew.html">Para criar um m&#243;dulo de auditoria</a></p></li>
<li><p><a href="task-changeadminpasswd.html">Para alterar a senha de um usu&#225;rio no dom&#237;nio do admin</a></p></li>
<li><p><a href="task-accessadmintools.html">Para dar acesso a ferramentas de administra&#231;&#227;o</a></p></li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>
<p>Nenhum.</p>
