<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-redeploy"></a><h4>Reimplantar Aplicativos ou M&#243;dulos</h4>
<p>Use a p&#225;gina Reimplantar Aplicativos ou M&#243;dulos para implantar outra vez um
aplicativo implantado anteriormente.</p><p>A p&#225;gina Reimplantar Aplicativos ou M&#243;dulos cont&#233;m as seguintes op&#231;&#245;es</p><dl><dt>Local</dt>
<dd><p>O local do novo arquivo compactado do aplicativo que est&#225; sendo reimplantado.</p><p>As seguintes op&#231;&#245;es especificam de onde o arquivo compactado &#233; acessado e se &#233; um arquivo ou um diret&#243;rio.</p><dl><dt>Arquivo empacotado a ser carregado no servidor </dt>
<dd><p>O arquivo compactado reside ou &#233; acessado no computador cliente.</p><p>O computador cliente &#233; o host em que voc&#234; visualiza o Console de Administra&#231;&#227;o por meio de um navegador.</p></dd>
<dt>Arquivo ou diret&#243;rio empacotado local que &#233; acessado no Enterprise Server</dt>
<dd><p>O arquivo &#233; um arquivo que reside no computador servidor ou &#233; um aplicativo n&#227;o empacotado, em um diret&#243;rio destacado.</p><p>O computador servidor &#233; o host que executa o servidor de administra&#231;&#227;o de dom&#237;nio do Enterprise Server . </p></dd>
</dl>
</dd>
<dt>Nome do Aplicativo</dt>
<dd><p>Campo somente leitura que exibe o nome do aplicativo que est&#225; sendo reimplantado.</p></dd>
<dt>Preservar sess&#245;es</dt>
<dd><p>Se a caixa de sele&#231;&#227;o Preservar Sess&#245;es estiver marcada, as sess&#245;es ativas do aplicativo em reimplanta&#231;&#227;o ser&#227;o preservadas e restauradas quando a reimplanta&#231;&#227;o estiver conclu&#237;da.</p><p>Se alguma sess&#227;o ativa do aplicativo n&#227;o for preservada ou restaurada, <b> nenhuma</b> das sess&#245;es ser&#225; disponibilizada quando a reimplanta&#231;&#227;o estiver conclu&#237;da. Entretanto, a reimplanta&#231;&#227;o continuar&#225; e um aviso ser&#225; registrado em log.</p><p>Para preservar sess&#245;es ativas, o Enterprise Server serializa as sess&#245;es e as salva na mem&#243;ria. Para restaurar as sess&#245;es, o carregador de classe do aplicativo que acabou de ser reimplantado desserializa todas as sess&#245;es anteriormente salvas.</p></dd>
<dt>Precompilar JSPs</dt>
<dd><p>Se essa op&#231;&#227;o for selecionada, os arquivos JavaServer Pages ( JSP) ser&#227;o pr&#233;-compilados. Se esta op&#231;&#227;o for desativada, os arquivos JSP ser&#227;o compilados no tempo de execu&#231;&#227;o, quando forem acessados pela primeira vez. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p></dd>
<dt>Executar verificador</dt>
<dd><p>Se essa op&#231;&#227;o for selecionada, o verificador ser&#225; executado antes da implanta&#231;&#227;o. Se a verifica&#231;&#227;o falhar, a implanta&#231;&#227;o n&#227;o ser&#225; realizada O verificador examina a estrutura e o conte&#250;do do arquivo. A verifica&#231;&#227;o de aplicativos grandes geralmente consome muito tempo. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p></dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-appredeploy.html">Para reimplantar um aplicativo implantado</a></p></li>
<li><p><a href="task-appdeployweb.html">Para implantar um aplicativo Web</a></p></li>
<li><p><a href="task-deployentapp.html">Para implantar um Aplicativo Empresarial</a></p></li>
<li><p><a href="task-appdeployclient.html">Para implantar um cliente aplicativo</a></p></li>
<li><p><a href="task-appdeployconn.html">Para implantar um m&#243;dulo conector</a></p></li>
<li><p><a href="task-appdeployejb.html">Para implantar um EJB Jar</a></p></li>
<li><p><a href="task-appdeployruby.html">Para implantar um aplicativo Ruby</a></p></li>
<li><p><a href="task-appedit.html">Para editar um aplicativo implantado</a></p></li>
<li><p><a href="task-appviewdesc.html">Para exibir os descritores de um aplicativo</a></p></li>
<li><p><a href="task-applaunch.html">Para iniciar um aplicativo</a></p></li>
<li><p><a href="task-apprestart.html">Para reiniciar um aplicativo implantado</a></p></li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://docs.sun.com/doc/820-7701/deploy-1?a=view"><tt>deploy</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/redeploy-1?a=view"><tt>redeploy</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/list-applications-1?a=view"><tt>list-applications</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/list-modules-1?a=view"><tt>list-modules</tt>(1)</a></p></li></ul>

