<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-messagesecurityproviderconfigedit"></a><h4>Editar Configura&#231;&#227;o do Provedor</h4>
<p>Use a p&#225;gina Editar Configura&#231;&#227;o do Provedor para modificar uma configura&#231;&#227;o do
provedor de seguran&#231;a de mensagens.</p><p>A p&#225;gina Editar Configura&#231;&#227;o do Provedor cont&#233;m as seguintes op&#231;&#245;es.</p><dl><dt>Camada de Autentica&#231;&#227;o</dt>
<dd><p>A camada de autentica&#231;&#227;o (SOAP ou HttpServlet) para a qual essa configura&#231;&#227;o de servidor foi criada. Este &#233; um campo somente leitura.</p></dd>
<dt>ID do Provedor</dt>
<dd><p>O nome da configura&#231;&#227;o do provedor de seguran&#231;a de mensagens. Este &#233; um campo somente leitura. Voc&#234; s&#243; pode especificar o ID do provedor quando cria uma nova configura&#231;&#227;o do provedor de seguran&#231;a de mensagens.</p></dd>
<dt>Provedor Padr&#227;o</dt>
<dd><p>Se esta op&#231;&#227;o for selecionada, este provedor ser&#225; o provedor padr&#227;o. O provedor padr&#227;o ser&#225; chamado para qualquer aplicativo que n&#227;o identifique um provedor espec&#237;fico. Se o provedor for o provedor de cliente padr&#227;o, o provedor de servidor padr&#227;o, ou de ambos, &#233; determinado pelo Tipo de Provedor.</p></dd>
<dt>Tipo de Provedor</dt>
<dd><p>Especifica o tipo do provedor. As op&#231;&#245;es dispon&#237;veis s&#227;o:</p><dl><dt><tt>cliente</tt></dt>
<dd><p>Especifica que o provedor &#233; o provedor de autentica&#231;&#227;o do cliente.</p></dd>
<dt><tt>servidor</tt></dt>
<dd><p>Especifica que o provedor &#233; o provedor de autentica&#231;&#227;o do servidor.</p></dd>
<dt><tt>cliente-servidor</tt></dt>
<dd><p>Especifica que o provedor e um provedor de autentica&#231;&#227;o do cliente e do servidor.</p></dd>
</dl>
</dd>
<dt>Nome da Classe</dt>
<dd><p>O nome da classe de implementa&#231;&#227;o Java do provedor. Os provedores de autentica&#231;&#227;o cliente devem implementar a <tt>com.sun.enterprise.security.jauth.ClientAuthModule</tt> da interface. Os provedores do lado do servidor devem implementar a <tt>com.sun.enterprise.security.jauth.ServerAuthModule</tt> da interface. Os provedores de cliente-servidor devem implementar as duas interfaces.</p></dd>
<dt>Autenticar Fonte (para Diretiva de Solicita&#231;&#227;o)</dt>
<dd><p>O tipo da autentica&#231;&#227;o necess&#225;ria para a diretiva de solicita&#231;&#227;o. A diretiva de solicita&#231;&#227;o determina o processamento da solicita&#231;&#227;o que o provedor de autentica&#231;&#227;o realiza. Os campos da diretiva de solicita&#231;&#227;o s&#227;o opcionais, mas se eles n&#227;o forem especificados, o provedor de autentica&#231;&#227;o n&#227;o autentica as mensagens solicitadas.</p><p>Selecione <tt>remetente</tt> para especificar a autentica&#231;&#227;o do remetente da camada de mensagens (por exemplo, nome de usu&#225;rio e senha) das mensagens solicitadas. Selecione <tt>conte&#250;do </tt> para especificar autentica&#231;&#227;o de conte&#250;do (por exemplo, assinatura digital) das mensagens solicitadas. Deixe o campo vazio para n&#227;o autenticar a fonte das solicita&#231;&#245;es. Por padr&#227;o, nenhum tipo de autentica&#231;&#227;o &#233; selecionado.</p><p>Para uma descri&#231;&#227;o das a&#231;&#245;es realizadas pelos provedores de seguran&#231;a de mensagens SOAP, consulte <a href="ref-configreq-respolicy.html">Configura&#231;&#245;es da Diretiva de Solicita&#231;&#227;o e Resposta</a>.</p></dd>
<dt>Autenticar Destinat&#225;rio (para Diretiva de Solicita&#231;&#227;o)</dt>
<dd><p>Especifica se a autentica&#231;&#227;o do destinat&#225;rio ocorre antes ou ap&#243;s a autentica&#231;&#227;o de conte&#250;do da diretiva de solicita&#231;&#227;o.</p><p>Selecione <tt>before-content</tt> ou <tt>after-content</tt> para solicitar autentica&#231;&#227;o de camada-mensagem do destinat&#225;rio da mensagem solicitada ao seu remetente (por criptografia XML). Se o valor n&#227;o for especificado, o padr&#227;o ser&#225; <tt>after-content</tt>. As diretivas s&#227;o expressas no pedido do remetente da mensagem, portanto <tt>after-content</tt> significa que o destinat&#225;rio da mensagem descriptografa a mensagem antes de validar a assinatura.</p></dd>
<dt>Autenticar Fonte (para Diretiva de Resposta)</dt>
<dd><p>O tipo da autentica&#231;&#227;o necess&#225;ria para a diretiva de resposta. A diretiva de resposta determina o processamento da resposta que o provedor de autentica&#231;&#227;o realiza. Os campos da diretiva de resposta s&#227;o opcionais, mas se eles n&#227;o forem especificados, nenhuma autentica&#231;&#227;o ser&#225; aplicada &#224;s mensagens de resposta.</p><p>Selecione <tt>remetente</tt> para especificar a autentica&#231;&#227;o do remetente da camada de mensagens (por exemplo, nome de usu&#225;rio e senha) das mensagens de resposta. Selecione <tt>conte&#250;do </tt> para especificar autentica&#231;&#227;o de conte&#250;do (por exemplo, assinatura digital) das mensagens de resposta. Deixe o campo em branco para n&#227;o autenticar as fontes de resposta. Por padr&#227;o, nenhum tipo de autentica&#231;&#227;o &#233; selecionado.</p><p>Para uma descri&#231;&#227;o das a&#231;&#245;es realizadas pelos provedores de seguran&#231;a de mensagens SOAP, consulte <a href="ref-configreq-respolicy.html">Configura&#231;&#245;es da Diretiva de Solicita&#231;&#227;o e Resposta</a>.</p></dd>
<dt>Autenticar Destinat&#225;rio (para Diretiva de Resposta)</dt>
<dd><p>Especifica se a autentica&#231;&#227;o do destinat&#225;rio ocorre antes ou ap&#243;s a autentica&#231;&#227;o de conte&#250;do da diretiva de resposta.</p><p>Selecione <tt>before-content</tt> ou <tt>after-content</tt> para definir a autentica&#231;&#227;o de camada-mensagem do destinat&#225;rio da mensagem de resposta ao seu remetente (por criptografia XML). Se o valor n&#227;o for especificado, o padr&#227;o ser&#225; <tt>after-content</tt>. As diretivas s&#227;o expressas no pedido do remetente da mensagem, portanto <tt>after-content</tt> significa que o destinat&#225;rio da mensagem descriptografa a mensagem antes de validar a assinatura.</p></dd>
<dt>Propriedades Adicionais</dt>
<dd><p>Propriedades adicionais para configura&#231;&#227;o do provedor de seguran&#231;a de mensagens. Para uma descri&#231;&#227;o das propriedades adicionais dispon&#237;veis para configura&#231;&#245;es do provedor, consulte <a href="ref-messagesecurityproviderconfigprops.html">Propriedades Espec&#237;ficas das Configura&#231;&#245;es do Provedor de Seguran&#231;a de Mensagens</a>.</p></dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-configmsgsecproviders.html">Para configurar os recursos do Enterprise Server para uso pelos provedores de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityconfignew.html">Para criar uma configura&#231;&#227;o de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityconfigedit.html">Para editar uma configura&#231;&#227;o de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityconfigdelete.html">Para excluir uma configura&#231;&#227;o de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityproviderconfignew.html">Para criar uma configura&#231;&#227;o de provedor de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigedit.html">Para editar uma configura&#231;&#227;o de provedor de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigdelete.html">Para excluir uma configura&#231;&#227;o de provedor de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-enablemesec4appclients.html">Para ativar a seguranda de mensagens para clientes aplicativos</a></p></li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://docs.sun.com/doc/820-7701/create-message-security-provider-1?a=view"><tt>create-message-security-provider</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/list-message-security-providers-1?a=view"><tt>list-message-security-providers</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/delete-message-security-provider-1?a=view"><tt>delete-message-security-provider</tt>(1)</a></p></li></ul>
<p>Al&#233;m disso, use o comando <a href="http://docs.sun.com/doc/820-7701/set-1?a=view"><tt>set</tt>(1)</a> para modificar as diretivas de solicita&#231;&#227;o
e resposta.</p><p>Para definir a diretiva de resposta, substitua a palavra <tt>request</tt>, nos comandos
a seguir, por <tt>response</tt>.</p>
<ul><li><p>Adicione uma diretiva de solicita&#231;&#227;o ao cliente e defina a fonte de autentica&#231;&#227;o:</p><pre>asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
provider-config.ClientProvider.request-policy.auth_source=
sender | content</pre></li>
<li><p>Adicione uma diretiva de solicita&#231;&#227;o ao servidor e defina a fonte de autentica&#231;&#227;o:</p><pre>asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
provider-config.ServerProvider.request-policy.auth_source=
sender | content</pre></li>
<li><p>Adicione uma diretiva de solicita&#231;&#227;o ao cliente e defina o destinat&#225;rio da autentica&#231;&#227;o:</p><pre>asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
provider-config.ClientProvider.request-policy.auth_recipient=
before-content | after-content</pre></li>
<li><p>Adicione uma diretiva de solicita&#231;&#227;o ao servidor e defina o destinat&#225;rio da autentica&#231;&#227;o:</p><pre>asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
provider-config.ServerProvider.request-policy.auth_recipient=
before-content | after-content</pre></li></ul>

