<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-uc-pkgdetails"></a><h4>Detalhes do Componente</h4>
<p>A p&#225;gina Detalhes do Componente fornece informa&#231;&#245;es detalhadas sobre um componente.</p><p>A p&#225;gina Detalhes do Componente cont&#233;m estas op&#231;&#245;es:</p><dl><dt>Voltar</dt>
<dd><p>Este bot&#227;o permite voltar &#224; p&#225;gina em que voc&#234; selecionou o componente cujos detalhes est&#225; visualizando.</p></dd>
<dt>Nome do Pacote</dt>
<dd><p>O nome do pacote em que o componente foi fornecido.</p></dd>
<dt>Identificador Exclusivo</dt>
<dd><p>O identificador totalmente qualificado do componente, tal como apresentado no reposit&#243;rio.</p></dd>
<dt>Categoria</dt>
<dd><p>A categoria de software que &#233; associada ao componente; por exemplo, Servidores de Aplicativos, Ferramentas do Sistema e Bancos de Dados. A categoria &#233; atribu&#237;da pelo autor do componente quando o componente &#233; criado.</p></dd>
<dt>Vers&#227;o</dt>
<dd><p>O n&#250;mero de vers&#227;o do pacote em que o componente foi fornecido.</p></dd>
<dt>Tamanho Instalado</dt>
<dd><p>A quantidade de espa&#231;o em disco que a instala&#231;&#227;o do componente consome.</p></dd>
<dt>Data da Publica&#231;&#227;o</dt>
<dd><p>A data e a hora em que a vers&#227;o do componente foi publicada no reposit&#243;rio. Essa data <b>n&#227;o</b> &#233; a data e hora em que o componente foi instalado na imagem de instala&#231;&#227;o.</p></dd>
<dt>Origem</dt>
<dd><p>Para um componente instalado, o nome do <a href="ref-uc-concepts.html#ref-uc-about-repository">Reposit&#243;rio de rede</a> de onde o componente foi obtido. </p><p>Para um componente de suplemento ou para uma atualiza&#231;&#227;o, o nome do reposit&#243;rio de rede de onde o componente deve ser obtido. </p></dd>
<dt>Descri&#231;&#227;o</dt>
<dd><p>Uma vis&#227;o geral do componente.</p></dd>
</dl>
<h5>Tarefas relacionadas</h5>
<p><a href="task-uc-pkgdetails.html">Para exibir informa&#231;&#245;es detalhadas sobre um componente</a></p><h5>Comandos <tt>asadmin</tt> relacionados</h5>
<p>Nenhum.</p>
