<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-uc-addon"></a><h4>Suplementos Dispon&#237;veis</h4>
<p>A p&#225;gina Suplementos Dispon&#237;veis fornece informa&#231;&#245;es sobre os <a href="ref-uc-concepts.html#ref-uc-about-component">componentes</a> da <a href="ref-uc-concepts.html#ref-uc-about-repository">imagem de instala&#231;&#227;o</a> ainda
n&#227;o instalados. </p><p>A p&#225;gina Suplementos Dispon&#237;veis cont&#233;m as seguintes op&#231;&#245;es.</p><dl><dt>Caminho da Instala&#231;&#227;o</dt>
<dd><p>O caminho do sistema de arquivos do diret&#243;rio raiz ou de n&#237;vel superior da imagem de instala&#231;&#227;o.</p></dd>
<dt>Instalar</dt>
<dd><p>Este bot&#227;o instala os componentes de suplemento selecionados.</p></dd>
<dt>Suplementos Dispon&#237;veis</dt>
<dd><p>Esta tabela fornece as seguintes informa&#231;&#245;es sobre cada componente da imagem de instala&#231;&#227;o, os quais ainda n&#227;o foram instalados.</p><dl><dt>Componente</dt>
<dd><p>O nome do componente.</p></dd>
<dt>Categoria</dt>
<dd><p>A categoria de software que &#233; associada ao componente; por exemplo, Servidores de Aplicativos, Ferramentas do Sistema e Bancos de Dados. A categoria &#233; atribu&#237;da pelo autor do componente quando o componente &#233; criado.</p></dd>
<dt>Vers&#227;o</dt>
<dd><p>O n&#250;mero de vers&#227;o do pacote em que o componente foi fornecido.</p></dd>
<dt>Tamanho Instalado</dt>
<dd><p>A quantidade de espa&#231;o em disco que a instala&#231;&#227;o do componente consome.</p></dd>
<dt>Origem</dt>
<dd><p>Para um componente instalado, o nome do <a href="ref-uc-concepts.html#ref-uc-about-repository">Reposit&#243;rio de rede</a> de onde o componente foi obtido. </p><p>Para um componente de suplemento ou para uma atualiza&#231;&#227;o, o nome do reposit&#243;rio de rede de onde o componente deve ser obtido. </p></dd>
</dl>
</dd>
</dl>
<h5>Tarefas relacionadas</h5>
<p><a href="task-uc-addon.html">Para instalar componentes complementares</a></p><h5>Comandos <tt>asadmin</tt> relacionados</h5>
<p>Nenhum.</p>
