<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-registrationpage"></a><h4>Registro de Produto</h4>
<p>Para registrar a instala&#231;&#227;o do Sun GlassFish<sup>TM</sup>Enterprise Server com o <a href="http://www.sun.com/service/sunconnection/index.jsp">Sun Connection</a>, &#233;
preciso ter uma <a href="https://reg.sun.com/whyregister">Conta Sun Online</a>.  Caso voc&#234; n&#227;o tenha uma Conta Sun
Online, o Enterprise Server permitir&#225; a cria&#231;&#227;o de uma conta durante o
registro.</p><p>A p&#225;gina Registro de Produto cont&#233;m estas op&#231;&#245;es.</p><dl><dt>J&#225; tenho uma Conta Sun Online ou uma Conta Sun Developer Network (SDN)</dt>
<dd><p>Selecione esta op&#231;&#227;o se j&#225; tiver uma conta. Se voc&#234; selecionar essa op&#231;&#227;o, os seguintes campos estar&#227;o vis&#237;veis.</p><dl><dt>Nome de Usu&#225;rio</dt>
<dd><p>O nome de usu&#225;rio especificado quando a Conta Sun Online foi registrada.</p></dd>
<dt>Senha</dt>
<dd><p>A senha especificada quando a Conta Sun Online foi registrada.</p></dd>
<dt>Host Proxy</dt>
<dd><p>O nome de host do servidor proxy para o computador em que o Enterprise Server est&#225; em execu&#231;&#227;o.</p><p>Esse campo s&#243; ser&#225; aplic&#225;vel se o computador em que Enterprise Server estiver em execu&#231;&#227;o se conectar &#224; Internet por meio de um servidor proxy.</p></dd>
<dt>Porta Proxy</dt>
<dd><p>O n&#250;mero de porta do servidor proxy para o computador em que o Enterprise Server est&#225; em execu&#231;&#227;o.</p><p>Esse campo s&#243; ser&#225; aplic&#225;vel se o computador em que Enterprise Server estiver em execu&#231;&#227;o se conectar &#224; Internet por meio de um servidor proxy.</p></dd>
</dl>
</dd>
<dt>N&#227;o tenho uma Conta Sun Online. Inscreva-me.</dt>
<dd><p>Selecione esta op&#231;&#227;o se n&#227;o tiver uma conta e quiser registrar sua instala&#231;&#227;o do Enterprise Server com o Sun Connection. Se voc&#234; selecionar essa op&#231;&#227;o, os seguintes campos estar&#227;o vis&#237;veis.</p><dl><dt>Endere&#231;o de E-mail</dt>
<dd><p>Seu endere&#231;o de e-mail, que ser&#225; o nome de usu&#225;rio da sua Conta Sun Online.</p></dd>
<dt>Senha</dt>
<dd><p>A senha a ser usada para a Conta Sun Online. A senha diferencia mai&#250;sculas/min&#250;sculas e deve ter de 6 a 10 caracteres.</p></dd>
<dt>Digitar Senha Novamente</dt>
<dd><p>Digite novamente a senha especificada no campo Senha.</p></dd>
<dt>Nome</dt>
<dd><p>Seu nome.</p></dd>
<dt>Sobrenome</dt>
<dd><p>Seu sobrenome.</p></dd>
<dt>Empresa</dt>
<dd><p>A empresa em que trabalha, se aplic&#225;vel.</p></dd>
<dt>Pa&#237;s/Territ&#243;rio</dt>
<dd><p>O pa&#237;s ou territ&#243;rio onde voc&#234; reside.</p></dd>
<dt>Host Proxy</dt>
<dd><p>O nome de host do servidor proxy para o computador em que o Enterprise Server est&#225; em execu&#231;&#227;o.</p><p>Esse campo s&#243; ser&#225; aplic&#225;vel se o computador em que Enterprise Server estiver em execu&#231;&#227;o se conectar &#224; Internet por meio de um servidor proxy.</p></dd>
<dt>Porta Proxy</dt>
<dd><p>O n&#250;mero de porta do servidor proxy para o computador em que o Enterprise Server est&#225; em execu&#231;&#227;o.</p><p>Esse campo s&#243; ser&#225; aplic&#225;vel se o computador em que Enterprise Server estiver em execu&#231;&#227;o se conectar &#224; Internet por meio de um servidor proxy.</p></dd>
</dl>
</dd>
</dl>
<h5>Tarefa relacionada</h5>

<ul><li><p><a href="task-register.html">Para registrar o Sun GlassFish Enterprise Server com conex&#227;o Sun</a></p></li></ul>

