<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-uc-config"></a><h4>Configura&#231;&#227;o do Ferramenta de Atualiza&#231;&#227;o</h4>
<p>A p&#225;gina Configura&#231;&#227;o fornece informa&#231;&#245;es de configura&#231;&#227;o do Ferramenta de Atualiza&#231;&#227;o e
permite alterar a configura&#231;&#227;o do Ferramenta de Atualiza&#231;&#227;o.</p><p>A p&#225;gina Configura&#231;&#227;o do Ferramenta de Atualiza&#231;&#227;o cont&#233;m as seguintes op&#231;&#245;es.</p><dl><dt>Caminho da Instala&#231;&#227;o</dt>
<dd><p>O caminho do sistema de arquivos do diret&#243;rio raiz ou de n&#237;vel superior da imagem de instala&#231;&#227;o.</p></dd>
<dt>Reposit&#243;rio Preferencial</dt>
<dd><p>O nome do <a href="ref-uc-concepts.html#ref-uc-about-repository">reposit&#243;rio de rede</a> preferencial, que &#233; associado &#224; imagem de instala&#231;&#227;o; por exemplo, <tt>glassfish.org</tt>.</p></dd>
<dt>Conex&#227;o com a Internet</dt>
<dd><p>Como o Enterprise Server se conecta &#224; Internet:</p><dl><dt>Conex&#227;o Direta</dt>
<dd><p>Esta op&#231;&#227;o especifica que o Enterprise Server se conecta diretamente &#224; Internet.</p></dd>
<dt>Via Proxy</dt>
<dd><p>Esta op&#231;&#227;o especifica se o Enterprise Server se conecta &#224; Internet por meio de um servidor proxy. Quando a op&#231;&#227;o &#233; selecionada, o campo Host Proxy e o campo Porta Proxy s&#227;o adicionados &#224; p&#225;gina.</p></dd>
</dl>
</dd>
<dt>Host Proxy</dt>
<dd><p>O nome de host do servidor proxy para o computador em que o Enterprise Server est&#225; em execu&#231;&#227;o.</p><p>Esse campo s&#243; ser&#225; aplic&#225;vel se o computador em que Enterprise Server estiver em execu&#231;&#227;o se conectar &#224; Internet por meio de um servidor proxy.</p></dd>
<dt>Porta Proxy</dt>
<dd><p>O n&#250;mero de porta do servidor proxy para o computador em que o Enterprise Server est&#225; em execu&#231;&#227;o.</p><p>Esse campo s&#243; ser&#225; aplic&#225;vel se o computador em que Enterprise Server estiver em execu&#231;&#227;o se conectar &#224; Internet por meio de um servidor proxy.</p></dd>
<dt>Reposit&#243;rios</dt>
<dd><p>Esta tabela fornece as seguintes informa&#231;&#245;es sobre cada <a href="ref-uc-concepts.html#ref-uc-about-repository">reposit&#243;rio de rede</a> associado &#224; imagem de instala&#231;&#227;o:</p><dl><dt>Reposit&#243;rio</dt>
<dd><p>O nome do reposit&#243;rio; por exemplo, <tt>glassfish.org</tt>.</p></dd>
</dl>
</dd>
</dl>
<h5>Tarefas relacionadas</h5>
<p><a href="task-uc-set-proxy.html">Para definir configura&#231;&#245;es de proxy de rede para acessar reposit&#243;rios de rede</a></p><h5>Comandos <tt>asadmin</tt> relacionados</h5>
<p>Nenhum.</p>
