<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-messagesecurityconfig"></a><h4>Seguran&#231;a de Mensagens</h4>
<p>A p&#225;gina Configura&#231;&#245;es de Seguran&#231;a de Mensagens lista as configura&#231;&#245;es dispon&#237;veis para
provedores de seguran&#231;a de mensagens.</p><p>Para configurar a seguran&#231;a de mensagens, voc&#234; precisa de uma compreens&#227;o b&#225;sica
de conceitos de seguran&#231;a e de servi&#231;os da Web. Para obter mais
informa&#231;&#245;es, consulte o <a href="http://docs.sun.com/doc/820-7692/ablrk?a=view">Cap&#237;tulo 13, Administering Message Security, no <i>Sun GlassFish Enterprise Server v3 Administration Guide</i></a> e o <a href="http://docs.sun.com/doc/820-7692/gbbjk?a=view">Cap&#237;tulo 6, Administering Web Applications, no <i>Sun GlassFish Enterprise Server v3 Administration Guide</i></a>.</p><p>O Enterprise Server implementa a seguran&#231;a de mensagens usando provedores de seguran&#231;a
de mensagens integrados em sua camada de processamento SOAP. Os provedores de
seguran&#231;a de mensagens dependen de outros recursos de seguran&#231;a de Enterprise Server.</p><p>Para cada configura&#231;&#227;o, a p&#225;gina Configura&#231;&#245;es de Seguran&#231;a de Mensagens cont&#233;m as
seguintes informa&#231;&#245;es.</p><dl><dt>Camada de Autentica&#231;&#227;o</dt>
<dd><p>A camada de mensagens na qual a autentica&#231;&#227;o &#233; realizada. Por padr&#227;o, uma configura&#231;&#227;o SOAP &#233; fornecida. Tamb&#233;m &#233; poss&#237;vel fornecer uma configura&#231;&#227;o HttpServlet.</p></dd>
<dt>Provedor Padr&#227;o</dt>
<dd><p>O provedor do servidor padr&#227;o desta configura&#231;&#227;o. Por padr&#227;o, nenhum provedor de servidor padr&#227;o est&#225; configurado.</p></dd>
<dt>Provedor de Cliente Padr&#227;o</dt>
<dd><p>O provedor de cliente padr&#227;o desta configura&#231;&#227;o. Por padr&#227;o, nenhum provedor de cliente padr&#227;o est&#225; configurado.</p></dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-configmsgsecproviders.html">Para configurar os recursos do Enterprise Server para uso pelos provedores de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityconfignew.html">Para criar uma configura&#231;&#227;o de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityconfigedit.html">Para editar uma configura&#231;&#227;o de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityconfigdelete.html">Para excluir uma configura&#231;&#227;o de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityproviderconfignew.html">Para criar uma configura&#231;&#227;o de provedor de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigedit.html">Para editar uma configura&#231;&#227;o de provedor de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigdelete.html">Para excluir uma configura&#231;&#227;o de provedor de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-enablemesec4appclients.html">Para ativar a seguranda de mensagens para clientes aplicativos</a></p></li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>
<p>Nenhum.</p>
