<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-messagesecurityproviderconfig"></a><h4>Configura&#231;&#245;es do Provedor</h4>
<p>Use a p&#225;gina Configura&#231;&#245;es do Provedor para definir as configura&#231;&#245;es do provedor
de seguran&#231;a de mensagens para a camada e autentica&#231;&#227;o do SOAP ou
do HttpServlet.</p><p>Por padr&#227;o, quatro provedores s&#227;o configurados para a camada de autentica&#231;&#227;o </p><p>Para cada configura&#231;&#227;o, a p&#225;gina Configura&#231;&#245;es do Provedor cont&#233;m as seguintes informa&#231;&#245;es.</p><dl><dt>ID do Provedor</dt>
<dd><p>O nome da configura&#231;&#227;o do provedor.</p></dd>
<dt>Tipo de Provedor</dt>
<dd><p>O tipo do provedor, que pode ser qualquer um dos seguintes:</p><dl><dt><tt>cliente</tt></dt>
<dd><p>Especifica que o provedor &#233; o provedor de autentica&#231;&#227;o do cliente.</p></dd>
<dt><tt>servidor</tt></dt>
<dd><p>Especifica que o provedor &#233; o provedor de autentica&#231;&#227;o do servidor.</p></dd>
<dt><tt>cliente-servidor</tt></dt>
<dd><p>Especifica que o provedor e um provedor de autentica&#231;&#227;o do cliente e do servidor.</p></dd>
</dl>
</dd>
<dt>Provedor Padr&#227;o</dt>
<dd><p>Se definido como <tt>verdadeiro</tt>, o provedor ser&#225; o provedor padr&#227;o.</p></dd>
<dt>Nome da Classe</dt>
<dd><p>O nome da classe de implementa&#231;&#227;o Java do provedor.</p></dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-configmsgsecproviders.html">Para configurar os recursos do Enterprise Server para uso pelos provedores de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityconfignew.html">Para criar uma configura&#231;&#227;o de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityconfigedit.html">Para editar uma configura&#231;&#227;o de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityconfigdelete.html">Para excluir uma configura&#231;&#227;o de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityproviderconfignew.html">Para criar uma configura&#231;&#227;o de provedor de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigedit.html">Para editar uma configura&#231;&#227;o de provedor de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigdelete.html">Para excluir uma configura&#231;&#227;o de provedor de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-enablemesec4appclients.html">Para ativar a seguranda de mensagens para clientes aplicativos</a></p></li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://docs.sun.com/doc/820-7701/create-message-security-provider-1?a=view"><tt>create-message-security-provider</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/list-message-security-providers-1?a=view"><tt>list-message-security-providers</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/delete-message-security-provider-1?a=view"><tt>delete-message-security-provider</tt>(1)</a></p></li></ul>

