<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-jmxconnectoredit"></a><h4>Editar Conector JMX</h4>
<p>Use a p&#225;gina Editar conector JMX para editar o conector JMX compat&#237;vel
com JSR 360.</p><p>A p&#225;gina Editar conector JMX cont&#233;m as seguintes op&#231;&#245;es.</p><dl><dt>Nome</dt>
<dd><p>O nome do conector JMX. Este campo &#233; somente leitura.</p></dd>
<dt> Protocol JMX</dt>
<dd><p>O nome do protocolo que esse conector JMX suporta. Este campo &#233; somente leitura.</p></dd>
<dt>JMXServiceURL</dt>
<dd><p>O URL de servi&#231;os JMX. Este campo &#233; somente leitura.</p></dd>
<dt>Seguran&#231;a</dt>
<dd><p>Se a caixa de sele&#231;&#227;o Dispon&#237;vel estiver marcada, a comunica&#231;&#227;o JMX ser&#225; criptografada. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p></dd>
<dt>Endere&#231;o</dt>
<dd><p>O endere&#231;o IP do servi&#231;o de nomes no qual o stub do servidor do conector JMX est&#225; registrado. Esta n&#227;o &#233; a porta do soquete do servidor que faz a comunica&#231;&#227;o JMX real. Este &#233; o endere&#231;o da interface de rede onde o registro do RMI foi iniciado. Se o seu sistema tem m&#250;ltiplas interfaces de rede, modifique esse valor para que apenas uma determinada interface seja selecionada. O valor padr&#227;o &#233; <tt>0.0.0.0</tt>.</p></dd>
<dt>Porta</dt>
<dd><p>O n&#250;mero da porta na qual o servi&#231;o de nomes (registro RMI) escutam conex&#245;es do cliente RMI. O &#250;nico uso deste servi&#231;o de nomes &#233; para baixar os stubs RMI. Se a porta padr&#227;o estiver ocupada, uma porta livre ser&#225; usada. Os valores legais s&#227;o 1- 65535. Em sistemas UNIX<sup>&#174;</sup>, a cria&#231;&#227;o de soquetes que escutam nas portas 1 - 1024 requer privil&#233;gios de superusu&#225;rio. O valor padr&#227;o &#233; 8686.</p></dd>
<dt>Nome de Dom&#237;nio</dt>
<dd><p>O nome que representa o dom&#237;nio administrativo especial. Todas as autentica&#231;&#245;es s&#227;o manuseadas por este dom&#237;nio. O valor padr&#227;o &#233; <tt>admin-realm </tt>.</p></dd>
<dt>Propriedades Adicionais</dt>
<dd><p>Propriedade adicional para o conector JMX. Diversas propriedades s&#227;o especificadas por padr&#227;o.</p></dd>
</dl>
<h5>Tarefa relacionada</h5>

<ul><li><p><a href="task-jmxconnectoredit.html">Para editar o conector JMX </a></p></li>
<li><p><a href="task-jmxconnectorssledit.html">Para editar as configura&#231;&#245;es SSL do conector JMX</a></p></li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>
<p>Nenhum.</p>
