<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-logviewer"></a><h4>Visualizador de Logs</h4>
<a name="indexterm-22"></a><a name="indexterm-23"></a><p>Use a p&#225;gina Visualizador de Logs para exibir o log do servidor
e para personalizar a exibi&#231;&#227;o de log.</p><p>A p&#225;gina Visualizador de Logs cont&#233;m tr&#234;s &#225;reas:</p>
<ul><li><p>Crit&#233;rios de pesquisa</p></li>
<li><p>Pesquisa avan&#231;ada</p></li>
<li><p>Resultados da pesquisa</p></li></ul>
<p>A &#225;rea Crit&#233;rios de Pesquisa cont&#233;m estas op&#231;&#245;es.</p><dl><dt>Pesquisa Advan&#231;ada</dt>
<dd><p>Clicar neste link abre uma &#225;rea que permite fazer ajustes adicionais ao visualizador de logs.</p></dd>
<dt>Carimbo de Hora</dt>
<dd><p>O bot&#227;o de op&#231;&#227;o Mais Recente exibe as mensagens mais recentes. O bot&#227;o de op&#231;&#227;o Intervalo Espec&#237;fico abre os campos De e Para que permite exibir mensagens apenas de um determinado per&#237;odo de tempo.</p><p>Para o valor Tempo, a sintaxe deve considerar que esta forma (<b>SSS</b> significa milissegundos):</p><pre><b>hh</b>:<b>mm</b>:<b>ss</b>.<b>SSS</b></pre><p>Por exemplo:</p><pre>17:10:00.000</pre><p>Se o valor De for posterior ao valor Para, aparecer&#225; uma mensagem de erro.</p></dd>
<dt>N&#237;vel de Log</dt>
<dd><p>O n&#237;vel de log selecionado para filtragem. Por padr&#227;o, a exibi&#231;&#227;o inclui todas as mensagens que aparecem no log do servidor, no n&#237;vel de log escolhido e nos n&#237;veis mais graves. Marque a caixa de sele&#231;&#227;o rotulada &#8220;N&#227;o incluir mais mensagens graves&#8221; para exibir mensagens apenas no n&#237;vel escolhido</p><p>Para assegurar que as mensagens que voc&#234; deseja exibir apare&#231;am no log do servidor, primeiro defina os n&#237;veis de log apropriados na p&#225;gina N&#237;veis de Log do M&#243;dulo. Ver <a href="task-eelogginglevels.html">Para configurar n&#237;veis de log</a></p><p>Se voc&#234; escolher filtrar as mensagens de log com base no n&#237;vel de log, apenas as mensagens que correspondem aos crit&#233;rios de filtro espec&#237;ficos ser&#227;o mostradas. Contudo, essa filtragem n&#227;o afeta quais mensagens s&#227;o registradas no log do servidor.</p></dd>
</dl>
<p>A &#225;rea Pesquisa Avan&#231;ada cont&#233;m as seguintes op&#231;&#245;es.</p><dl><dt>Agente de Log</dt>
<dd><p>Espa&#231;os para nomes do Agente de Log a serem filtrados por m&#243;dulo. Use shift-clique ou control-clique para escolher m&#250;ltiplos espa&#231;os para nomes.</p><p>Selecionar um espa&#231;o para nomes em um n&#237;vel mais elevado seleciona todos os espa&#231;os para nomes abaixo dele. Por exemplo, selecionar <tt>javax.enterprise.system</tt> tamb&#233;m selecione os agentes de log de todos os m&#243;dulos naquele espa&#231;o para nomes: <tt>javax.enterprise.system.core </tt>, <tt>javax.enterprise.system.tools.admin</tt> e assim por diante.</p></dd>
<dt>Agente de Log Personalizado</dt>
<dd><p>Os Agentes de Log espec&#237;ficos de um determinado aplicativo, um por linha.</p><p>Se o aplicativo tiver diversos m&#243;dulos, voc&#234; poder&#225; exibir qualquer um deles. Por exemplo, suponha que o aplicativo tenha agentes de log com os seguintes nomes:</p><pre>com.mycompany.myapp.module1
com.mycompany.myapp.module2
com.mycompany.myapp.module3</pre><p>Para exibir as mensagens de todos os m&#243;dulos no aplicativo, digite <tt>com.mycompany.myapp </tt>. Para exibir apenas mensagens do <tt>module2</tt>, digite <tt> com.mycompany.myapp.module2</tt>.</p><p>Quando voc&#234; especifica um ou mais agentes de logs, as mensagens dos m&#243;dulos do Enterprise Server aparecem apenas se voc&#234; as especificar explicitamente na &#225;rea do Agente de Log.</p></dd>
<dt>Pares nome-valor</dt>
<dd><p>O nome da chave de um segmento, para exibir a sa&#237;da de um segmento espec&#237;fico. O nome da chave &#233; <tt>_ThreadID</tt>. Por exemplo:</p><pre>_ThreadID=13</pre><p>Suponha que <tt>com.mycompany.myapp.module2</tt> &#233; executado em diversos segmentos. Para refinar o visualizador de logs para mostrar apenas a sa&#237;da de um &#250;nico segmento, especifique agente de log daquele m&#243;dulo no campo Agente de Log Personalizado e especifique o ID do segmento neste campo.</p></dd>
<dt>Exibir</dt>
<dd><p>O n&#250;mero de mensagens a exibir por vez. O n&#250;mero padr&#227;o de mensagens exibidas &#233; 40. Outras op&#231;&#245;es s&#227;o 100, 250 e 1.000.</p><p>Para exibir os rastreamentos de pilha, desmarque a caixa de sele&#231;&#227;o &#8220;Limitar mensagens excessivamente longas&#8221;. Por padr&#227;o, os rastreamentos de pilha n&#227;o aparecem no visualizador; para exibi-las, clique no link <tt>(detalhes)</tt> para obter uma mensagem.</p></dd>
</dl>
<p>A tabela Resultados da Pesquisa exibe as mensagens do log do servidor.</p><p>Para cada mensagem, a tabela Resultados da Pesquisa cont&#233;m as seguintes informa&#231;&#245;es.</p><dl><dt>N&#250;mero do Registro</dt>
<dd><p>O n&#250;mero da mensagem no log do servidor.</p></dd>
<dt>N&#237;vel do Log</dt>
<dd><p>O n&#237;vel do log da mensagem.</p></dd>
<dt>Mensagem</dt>
<dd><p>O texto breve da mensagem de log. Clique no link <tt>(detalhes)</tt> para exibir uma vers&#227;o formatada de uma mensagem.</p></dd>
<dt>Agente de Log</dt>
<dd><p>O m&#243;dulo do agente de log que gerou a mensagem de log.</p></dd>
<dt>Carimbo de Hora</dt>
<dd><p>A data e a hora em que a mensagem de log foi emitida.</p></dd>
<dt>Pares nome/valor</dt>
<dd><p>O nome e a ID do segmento da mensagem de log.</p></dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-eelogging.html">Para Definir as configura&#231;&#245;es gerais de log</a></p></li>
<li><p><a href="task-eelogginglevels.html">Para configurar n&#237;veis de log</a></p></li>
<li><p><a href="task-logviewer.html">Para exibir o log do servidor</a></p></li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><tt>set-log-level</tt></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/rotate-log-1?a=view"><tt>rotate-log</tt>(1)</a></p></li></ul>

