<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-serverinstjvmpathsettings"></a><h4>Configura&#231;&#245;es de Caminho de Classe de JVM</h4>
<p>O caminho de classe &#233; a lista de arquivos JAR que o
ambiente de tempo de execu&#231;&#227;o JAVA pesquisa para detectar classes e outros
recursos.</p><p>A p&#225;gina Configura&#231;&#245;es de Caminho de Classe de JVM cont&#233;m as seguintes
op&#231;&#245;es.</p><dl><dt>Caminho de Classe de Ambiente</dt>
<dd><p>Se a caixa de sele&#231;&#227;o Ignorar estiver marcada, a vari&#225;vel de ambiente <tt>CAMINHO DE CLASSE</tt> ser&#225; ignorada. A vari&#225;vel de ambiente <tt>CAMINHO DE CLASSE</tt> &#233; conveniente para tutoriais b&#225;sicos de programa&#231;&#227;o, mas n&#227;o &#233; recomendada para ambientes empresariais.</p></dd>
<dt>Caminho de Classe de Servidor</dt>
<dd><p>O caminho de classe do Enterprise Server. Este &#233; um campo somente leitura.</p></dd>
<dt>Caminho de Classe do Sistema</dt>
<dd><p>O caminho para as classes no seu sistema.</p></dd>
<dt>Prefixo de Caminho de Classe</dt>
<dd><p>Caminhos completos para os arquivos JAR a serem colocados no in&#237;cio do caminho de classe do servidor, um por linha.</p></dd>
<dt>Sufixo de Caminho de Classe</dt>
<dd><p>Caminhos completos para os arquivos JAR a serem anexados ao caminho de classe do servidor, um por linha.</p></dd>
<dt>Prefixo de Caminho da Biblioteca Nativa</dt>
<dd><p>Caminhos completos para os arquivos JAR a serem colocados no in&#237;cio do caminho da biblioteca nativa, um por linha.</p></dd>
<dt>Sufixo de Caminho da Biblioteca Nativa</dt>
<dd><p>Caminhos completos para os arquivos JAR a serem anexados ao caminho da biblioteca nativa, um por linha.</p><p>O caminho da biblioteca nativa &#233; uma concatena&#231;&#227;o do caminho relativo do servidor para as respectivas bibliotecas compartilhadas, o caminho da biblioteca nativa do ambiente de tempo de execu&#231;&#227;o padr&#227;o, a configura&#231;&#227;o do ambiente de shell (<tt>LD_LIBRARY_PATH</tt> nos sistemas UNIX<sup>&#174;</sup>) e qualquer caminho especificado na p&#225;gina <a href="ref-serverinstjvmprofiler.html">Configura&#231;&#245;es do Gerador de Perfil de JVM</a>.</p></dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-jvmsettings.html">Para configurar as defini&#231;&#245;es gerais de JVM</a></p></li>
<li><p><a href="task-jvmpathsettings.html">Para configurar as defini&#231;&#245;es de caminho de JVM</a></p></li>
<li><p><a href="task-jvmoptions.html">Para configurar as op&#231;&#245;es de JVM</a></p></li>
<li><p><a href="task-securitymanagerdisable.html">Para desativar o gerenciador de seguran&#231;a</a></p></li>
<li><p><a href="task-jvmprofilersettings.html">Para configurar as defini&#231;&#245;es do gerador de perfil do JVM</a></p></li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://docs.sun.com/doc/820-7701/create-jvm-options-1?a=view"><tt>create-jvm-options</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/delete-jvm-options-1?a=view"><tt>delete-jvm-options</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/list-jvm-options-1?a=view"><tt>list-jvm-options</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/create-profiler-1?a=view"><tt>create-profiler</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/delete-profiler-1?a=view"><tt>delete-profiler</tt>(1)</a></p></li></ul>

