<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-managefilerealm"></a><h4>Usu&#225;rios do Arquivo</h4>
<p>Gerencie os usu&#225;rios do dom&#237;nio <tt>arquivo</tt> com o Console de Administra&#231;&#227;o. 
Usu&#225;rios e grupos do dom&#237;nio <tt>arquivo</tt> s&#227;o listados no arquivo principal, cuja
localiza&#231;&#227;o est&#225; especificada na propriedade <tt>arquivo</tt>.</p>
<hr><p><b>Observa&#231;&#227;o - </b>Tamb&#233;m &#233; poss&#237;vel usar essas etapas para adicionar usu&#225;rios a qualquer dom&#237;nio
arquivo, incluindo o <tt>dom&#237;nio admin</tt>.  Basta substituir o nome do dom&#237;nio de
destino no lugar do dom&#237;nio <tt>arquivo</tt> mencionado nesta se&#231;&#227;o.</p>
<hr>
<p>Um usu&#225;rio do dom&#237;nio <tt>arquivo</tt> pode pertencer a um <b> grupo Java</b>, uma categoria
de usu&#225;rios classificada por caracter&#237;sticas comuns. Por exemplo, os clientes de um
aplicativo de e-commerce podem pertencer ao grupo <tt>CLIENTE</tt>, mas os grandes consumidores
podem pertencer ao grupo <tt>PREFERENCIAL</tt>.  A categoriza&#231;&#227;o de usu&#225;rios em grupos
facilita ainda mais o controle do acesso de um grande n&#250;mero de
usu&#225;rios.</p><p>Inicialmente, ap&#243;s a instala&#231;&#227;o do Enterprise Server, o &#250;nico usu&#225;rio &#233; o
administrador especificado durante a instala&#231;&#227;o.  Por padr&#227;o, esse usu&#225;rio pertence ao
grupo <tt>asadmin</tt>, no <tt>dom&#237;nio admin</tt>, o que lhe direitos para modificar o Enterprise
Server.  Todos os usu&#225;rios atribu&#237;dos a esse grupo ter&#227;o privil&#233;gios de
administrador, ou seja, eles ter&#227;o acesso &#224; ferramenta <tt>asadmin</tt> e ao Console
de Administra&#231;&#227;o.</p><p>A p&#225;gina Usu&#225;rios do Arquivo exibe uma lista de usu&#225;rios do dom&#237;nio
selecionado. Para cada usu&#225;rio, as seguintes informa&#231;&#245;es s&#227;o fornecidas:</p><dl><dt>ID do Usu&#225;rio</dt>
<dd><p>O nome de usu&#225;rio.</p></dd>
<dt>Lista de Grupos</dt>
<dd><p>Os grupos aos quais o usu&#225;rio pertence.</p></dd>
</dl>

