<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-serverinstjvmgeneral"></a><h4>Configura&#231;&#245;es Gerais de JVM</h4>
<p>A Java<sup>TM</sup> Virtual Machine (JVM<sup>TM</sup>) permite que c&#243;digos de bytes Java sejam
executados em um computador f&#237;sico.  O ajuste das configura&#231;&#245;es de JVM
melhora o desempenho e evita erros de aloca&#231;&#227;o de mem&#243;ria.</p><p>O Java Virtual Machine est&#225; inclu&#237;do no Java Platform, Standard Edition (plataforma
Java SE), que &#233; exigido pelo Enterprise Server.  Configura&#231;&#245;es de JVM
incorretas impedir&#227;o que o servidor seja executado, portanto, tenha cuidado ao alterar
essas configura&#231;&#245;es.</p>
<hr><p><b>Observa&#231;&#227;o - </b>Os termos &#8220;Java Virtual Machine&#8221; e &#8220;JVM&#8221; significam uma M&#225;quina Virtual para
a plataforma Java.</p>
<hr>
<p>A p&#225;gina Configura&#231;&#245;es Gerais de JVM cont&#233;m as seguintes op&#231;&#245;es.</p><dl><dt>Java Home</dt>
<dd><p>O nome do diret&#243;rio de instala&#231;&#227;o do software Java SE, necess&#225;rio &#224; execu&#231;&#227;o do Enterprise Server. Para verificar se a vers&#227;o do software Java SE especificada &#233; compat&#237;vel com esta vers&#227;o, consulte <a href="http://docs.sun.com/doc/820-7688"><i>Sun GlassFish Enterprise Server v3 Release Notes</i></a>. Se voc&#234; especificar um nome de diret&#243;rio inexistente ou se a vers&#227;o do diret&#243;rio n&#227;o for compat&#237;vel com o software Java SE, o Enterprise Server n&#227;o ser&#225; iniciado.</p></dd>
<dt>Op&#231;&#245;es Javac</dt>
<dd><p>As op&#231;&#245;es de linha de comando do compilador da linguagem de programa&#231;&#227;o Java. O Enterprise Server executa o compilador quando os componentes Enterprise JavaBeans <sup>TM</sup> (EJB<sup>TM</sup>) s&#227;o implantados.</p></dd>
<dt>Depura&#231;&#227;o</dt>
<dd><p>Ativa a depura&#231;&#227;o com o Java Platform Debugger Architecture (JPDA).</p><p>O JPDA &#233; utilizado pelos desenvolvedores de aplicativos. Para obter mais informa&#231;&#245;es, consulte <a href="http://docs.sun.com/doc/820-7695"><i>Sun GlassFish Enterprise Server v3 Preview Application Development Guide </i></a>.</p></dd>
<dt>Op&#231;&#245;es de Depura&#231;&#227;o</dt>
<dd><p>Especifica as op&#231;&#245;es do JPDA passadas &#224; JVM quando a depura&#231;&#227;o est&#225; ativada.</p></dd>
<dt>Op&#231;&#245;es de Compila&#231;&#227;o RMI</dt>
<dd><p>As op&#231;&#245;es de linha de comando do compilador <tt>rmic</tt>. O Enterprise Server executa o compilador <tt>rmic</tt> quando os componentes EJB s&#227;o implantados.</p></dd>
<dt>Pr&#233;-processador de C&#243;digo de Bytes</dt>
<dd><p>Nomes de classes para pr&#233;-processamento de c&#243;digos de bytes. Use v&#237;rgulas para separar os nomes de classes. Cada classe deve implementar a interface com.sun.appserv.BytecodePreprocessor . As classes s&#227;o chamadas na ordem especificada.</p></dd>
<dt>Propriedades Adicionais</dt>
<dd><p>Propriedades adicionais do JVM. O Enterprise Server n&#227;o define propriedades adicionais para o JVM.</p></dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-jvmsettings.html">Para configurar as defini&#231;&#245;es gerais de JVM</a></p></li>
<li><p><a href="task-jvmpathsettings.html">Para configurar as defini&#231;&#245;es de caminho de JVM</a></p></li>
<li><p><a href="task-jvmoptions.html">Para configurar as op&#231;&#245;es de JVM</a></p></li>
<li><p><a href="task-securitymanagerdisable.html">Para desativar o gerenciador de seguran&#231;a</a></p></li>
<li><p><a href="task-jvmprofilersettings.html">Para configurar as defini&#231;&#245;es do gerador de perfil do JVM</a></p></li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>
<p>Nenhum.</p>
