<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-configreq-respolicy"></a><h4>Configura&#231;&#245;es da Diretiva de Solicita&#231;&#227;o e Resposta</h4>
<p>Se a Autenticar Fonte for o <tt>sender</tt>, a mensagem conter&#225; um cabe&#231;alho
<tt>wsse:Security</tt> com um <tt>wsse:UsernameToken </tt> (com senha). Se Autenticar Fonte for o conte&#250;do,
o conte&#250;do do corpo da mensagem SOAP ser&#225; assinado, e a mensagem
conter&#225; um cabe&#231;alho <tt>wsse:Security </tt> com a assinatura do corpo da mensagem representado
como um <tt>ds</tt>:<tt> Signature</tt>.</p><p>Se Autenticar Destinat&#225;rio for <tt>before-content</tt> ou <tt> after-content</tt>, o conte&#250;do do corpo da
mensagem SOAP ser&#225; criptografado e substitu&#237;do pelo <tt>xend:EncryptedData</tt> resultante. A mensagem cont&#233;m
<tt>a wsse:Security</tt>cabe&#231;alho que cont&#233;m um <tt>xenc:EncryptedKey</tt>. O <tt>xenc:EncryptedKey</tt> cont&#233;m a chave usada para
criptografar o corpo da mensagem SOAP. A chave est&#225; criptografada na chave
p&#250;blica do destinat&#225;rio.</p><p>Se as configura&#231;&#245;es Autenticar Fonte e Autenticar Destinat&#225;rio forem deixadas em branco,
nenhuma diretiva de seguran&#231;a ser&#225; especificada e os m&#243;dulos n&#227;o realiza&#231;&#227;o opera&#231;&#245;es
de seguran&#231;a.</p><p>A tabela a seguir mostra as configura&#231;&#245;es da diretiva de prote&#231;&#227;o de
mensagens e as opera&#231;&#245;es de seguran&#231;a de mensagens resultantes, realizadas pelos provedores
de seguran&#231;a de mensagens WS-Security SOAP para essa configura&#231;&#227;o.</p><a name="gbutq"></a><h6>Tabela&#160;1 Diretiva de Prote&#231;&#227;o de Mensagens com base na Opera&#231;&#227;o de Seguran&#231;a de Mensagens WS-Security SOAP</h6><table><col width="33%"><col width="33%"><col width="33%"><tr><th align="left" valign="top" scope="column"></th>
<th align="left" valign="top" scope="column"><p>Autenticar Destinat&#225;rio <tt>before-content</tt></p></th>
<th align="left" valign="top" scope="column"><p>Autenticar Destinat&#225;rio
<tt>after-content</tt></p></th>
</tr>
<tr><td align="left" valign="top" scope="row"><p>Autenticar Fonte <tt>sender</tt></p></td>
<td colspan="2" align="left" valign="top" scope="row"><p>O conte&#250;do do corpo da mensagem SOAP &#233; criptografado e
substitu&#237;do pelo <tt>xend:EncryptedData</tt> resultante. A mensagem cont&#233;m um cabe&#231;alho <tt> a wsse:Security</tt> que cont&#233;m
um <tt>wsse:UsernameToken (com senha)</tt> e um <tt>xenc:EncryptedKey</tt>. O <tt>xenc:EncryptedKey</tt> cont&#233;m a chave usada para
criptografar o corpo da mensagem SOAP. A chave est&#225; criptografada na chave
p&#250;blica do destinat&#225;rio.</p></td>
</tr>
<tr><td align="left" valign="top" scope="row"><p>Autenticar Fonte <tt>content</tt></p></td>
<td align="left" valign="top" scope="row"><p>O conte&#250;do do corpo da mensagem SOAP &#233;
criptografado e substitu&#237;do pelo <tt>xend:EncryptedData</tt> resultante. O <tt>xenc:EncryptedData </tt> est&#225; assinado. A mensagem
cont&#233;m um cabe&#231;alho <tt>a wsse:Security</tt> que cont&#233;m um <tt>xenc:EncryptedKey</tt> e um <tt>ds:Signature </tt>. O
<tt>xenc:EncryptedKey</tt> cont&#233;m a chave usada para criptografar o corpo da mensagem SOAP.
A chave est&#225; criptografada na chave p&#250;blica do destinat&#225;rio.</p></td>
<td align="left" valign="top" scope="row"><p>O conte&#250;do do corpo
da mensagem SOAP &#233; assinado, criptografado e substitu&#237;do pelo <tt>xend:EncryptedData</tt> resultante. A
mensagem cont&#233;m um cabe&#231;alho <tt>wsse:Security</tt> que cont&#233;m um <tt> xenc:EncryptedKey</tt> e um <tt>ds:Signature</tt>.
O <tt>xenc:EncryptedKey</tt> cont&#233;m a chave usada para criptografar o corpo da mensagem
SOAP. A chave est&#225; criptografada na chave p&#250;blica do destinat&#225;rio.</p></td>
</tr>
</table>
