<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-uploaddev"></a><h4>Implantar Aplicativos ou M&#243;dulos</h4>
<p>Use a p&#225;gina Implantar Aplicativos ou M&#243;dulos para implantar um aplicativo.</p><p>A p&#225;gina Implantar Aplicativos ou M&#243;dulos cont&#233;m as seguintes op&#231;&#245;es para todos
os aplicativos. Op&#231;&#245;es adicionais aparecem apenas ap&#243;s voc&#234; especificar o campo Local
do aplicativo.</p><dl><dt>Local</dt>
<dd><p>O local do arquivo compactado do aplicativo que est&#225; sendo implantado.</p><p>As seguintes op&#231;&#245;es especificam de onde o arquivo compactado &#233; acessado e se &#233; um arquivo ou um diret&#243;rio.</p><dl><dt>Arquivo empacotado a ser carregado no servidor </dt>
<dd><p>O arquivo compactado reside ou &#233; acessado no computador cliente.</p><p>O computador cliente &#233; o host em que voc&#234; visualiza o Console de Administra&#231;&#227;o por meio de um navegador.</p></dd>
<dt>Arquivo ou diret&#243;rio empacotado local que &#233; acessado no Enterprise Server</dt>
<dd><p>O arquivo &#233; um arquivo que reside no computador servidor ou &#233; um aplicativo n&#227;o empacotado, em um diret&#243;rio destacado.</p><p>O computador servidor &#233; o host que executa o servidor de administra&#231;&#227;o de dom&#237;nio do Enterprise Server . </p></dd>
</dl>
</dd>
<dt>Tipo</dt>
<dd><p>O tipo do aplicativo. As op&#231;&#245;es dispon&#237;veis s&#227;o: </p>
<ul><li><p>Aplicativo da Web</p></li>
<li><p>Aplicativo empresarial</p></li>
<li><p>Cliente aplicativo</p></li>
<li><p>M&#243;dulo do conector</p></li>
<li><p>EJB Jar</p></li>
<li><p>Aplicativo Ruby</p></li>
<li><p>Outro</p></li></ul>
</dd>
</dl>
<p>As op&#231;&#245;es adicionais dos diversos tipos de aplicativos est&#227;o descritas nas se&#231;&#245;es
a seguir.</p>
<ul><li><p><a href="#ref-webapp-options">Op&#231;&#245;es adicionais para um aplicativo da Web</a></p></li>
<li><p><a href="#ref-entapp-options">Op&#231;&#245;es adicionais para um aplicativo empresarial</a></p></li>
<li><p><a href="#ref-appclient-options">Op&#231;&#245;es adicionais para um cliente aplicativo</a></p></li>
<li><p><a href="#ref-connmodule-options">Op&#231;&#245;es adicionais para um m&#243;dulo conector</a></p></li>
<li><p><a href="#ref-ejb-options">Op&#231;&#245;es adicionais para um EJB Jar.</a></p></li>
<li><p><a href="#ref-ruby-options">Op&#231;&#245;es adicionais para um aplicativo Ruby</a></p></li></ul>
<a name="ref-webapp-options"></a><h5>Op&#231;&#245;es adicionais para um aplicativo da Web</h5>
<p>Se o tipo do aplicativo for Aplicativo da Web, as seguintes op&#231;&#245;es
aparecer&#227;o.</p><dl><dt>Raiz de Contexto</dt>
<dd><p>O caminho do aplicativo. Na URL do aplicativo Web, a raiz de contexto aparece imediatamente ap&#243;s o n&#250;mero da porta (<tt>http://<i>host</i>:<i>port</i>/<i> context-root</i>/...</tt>). A raiz de contexto deve iniciar com uma barra; por exemplo, <tt>/hello</tt>.</p></dd>
<dt>Nome do Aplicativo</dt>
<dd><p>O nome do aplicativo.</p></dd>
<dt>Servidores Virtuais</dt>
<dd><p>Os servidores virtuais associados ao aplicativo.</p></dd>
<dt>Status</dt>
<dd><p>Se essa op&#231;&#227;o for ativada, o aplicativo ser&#225; ativado. Por padr&#227;o, a op&#231;&#227;o est&#225; ativada.</p></dd>
<dt>Precompilar JSPs</dt>
<dd><p>Se esta op&#231;&#227;o for ativada, os arquivos JavaServer Pages<sup>TM</sup> ( JSP<sup>TM</sup>) ser&#227;o pr&#233;-compilados. Se esta op&#231;&#227;o for desativada, os arquivos JSP ser&#227;o compilados no tempo de execu&#231;&#227;o, quando forem acessados pela primeira vez. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p></dd>
<dt>Executar verificador</dt>
<dd><p>Se esta op&#231;&#227;o estiver ativada, o verificador ser&#225; executado antes da implanta&#231;&#227;o. Se a verifica&#231;&#227;o falhar, a implanta&#231;&#227;o n&#227;o ser&#225; realizada O verificador examina a estrutura e o conte&#250;do do arquivo. A verifica&#231;&#227;o de aplicativos grandes geralmente consome muito tempo. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p></dd>
<dt>Bibliotecas</dt>
<dd><p>Uma lista separada por v&#237;rgulas dos arquivos JAR da biblioteca, espec&#237;ficos deste m&#243;dulo ou aplicativo. Os caminhos podem ser absolutos ou relativos. Um caminho &#233; relativo a<tt></tt><i>domain-dir</i><tt>/lib/applibs </tt> Se o caminho for absoluto, o caminho deve ser acess&#237;vel ao servidor de administra&#231;&#227;o de dom&#237;nio (DAS), o que significa que ele deve estar sob<tt></tt><i>domain-dir</i><tt></tt> As bibliotecas s&#227;o disponibilizadas ao aplicativo na ordem em que elas s&#227;o especificadas.</p></dd>
<dt>Descri&#231;&#227;o</dt>
<dd><p>Uma descri&#231;&#227;o do aplicativo.</p></dd>
</dl>
<a name="ref-entapp-options"></a><h5>Op&#231;&#245;es adicionais para um aplicativo empresarial</h5>
<p>Se o tipo do aplicativo for aplicativo empresarial, aparecem estas op&#231;&#245;es.</p><dl><dt>Nome do Aplicativo</dt>
<dd><p>O nome do aplicativo.</p></dd>
<dt>Servidores Virtuais</dt>
<dd><p>Os servidores virtuais associados ao aplicativo.</p></dd>
<dt>Status</dt>
<dd><p>Se esta op&#231;&#227;o for ativada, o aplicativo ser&#225; ativado. Por padr&#227;o, a op&#231;&#227;o est&#225; ativada.</p></dd>
<dt>Precompilar JSPs</dt>
<dd><p>Se esta op&#231;&#227;o for ativada, os arquivos JavaServer Pages ( JSP) ser&#227;o pr&#233;-compilados. Se esta op&#231;&#227;o for desativada, os arquivos JSP ser&#227;o compilados no tempo de execu&#231;&#227;o, quando forem acessados pela primeira vez. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p></dd>
<dt>Executar verificador</dt>
<dd><p>Se esta op&#231;&#227;o estiver ativada, o verificador ser&#225; executado antes da implanta&#231;&#227;o. Se a verifica&#231;&#227;o falhar, a implanta&#231;&#227;o n&#227;o ser&#225; realizada. O verificador examina a estrutura e o conte&#250;do do arquivo. A verifica&#231;&#227;o de aplicativos grandes geralmente consome muito tempo. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p></dd>
<dt>Java Web Start</dt>
<dd><p>Se esta op&#231;&#227;o for ativada, ser&#225; permitido o acesso ao Java Web Start para um m&#243;dulo do cliente aplicativo. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p></dd>
<dt>Bibliotecas</dt>
<dd><p>Uma lista, separada por v&#237;rgulas, de arquivos JAR da biblioteca espec&#237;ficos desse aplicativo. Especifica um caminho absoluto ou relativo. Um caminho relativo &#233; relativo ao<tt></tt><i>domain-dir</i><tt>/lib/applibs</tt> Se o caminho for absoluto, o caminho deve ser acess&#237;vel ao servidor de administra&#231;&#227;o de dom&#237;nio (DAS), o que significa que ele deve estar em <tt></tt><i>domain-dir</i><tt></tt> As bibliotecas s&#227;o disponibilizadas para o aplicativo na ordem em que elas s&#227;o especificadas.</p></dd>
<dt>Descri&#231;&#227;o</dt>
<dd><p>Uma descri&#231;&#227;o do aplicativo.</p></dd>
</dl>
<a name="ref-appclient-options"></a><h5>Op&#231;&#245;es adicionais para um cliente aplicativo</h5>
<p>Se o tipo do aplicativo for um cliente aplicativo, aparecer&#227;o estas op&#231;&#245;es.</p><dl><dt>Nome do Aplicativo</dt>
<dd><p>O nome do aplicativo.</p></dd>
<dt>Executar verificador</dt>
<dd><p>Se esta op&#231;&#227;o estiver ativada, o verificador ser&#225; executado antes da implanta&#231;&#227;o. Se a verifica&#231;&#227;o falhar, a implanta&#231;&#227;o n&#227;o ser&#225; realizada O verificador examina a estrutura e o conte&#250;do do arquivo. A verifica&#231;&#227;o de aplicativos grandes geralmente consome muito tempo. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p></dd>
<dt>Java Web Start</dt>
<dd><p>Se essa op&#231;&#227;o for ativada, o acesso ao Java Web Start ser&#225; permitido para um m&#243;dulo cliente aplicativo. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p></dd>
<dt>Descri&#231;&#227;o</dt>
<dd><p>Uma descri&#231;&#227;o do aplicativo.</p></dd>
</dl>
<a name="ref-connmodule-options"></a><h5>Op&#231;&#245;es adicionais para um m&#243;dulo conector</h5>
<p>Se o tipo do aplicativo for m&#243;dulo conector, aparecer&#227;o estas op&#231;&#245;es.</p><dl><dt>Nome do Aplicativo</dt>
<dd><p>O nome do aplicativo.</p></dd>
<dt>Status</dt>
<dd><p>Se esta op&#231;&#227;o for ativada, o aplicativo ser&#225; ativado. Por padr&#227;o, a op&#231;&#227;o est&#225; ativada.</p></dd>
<dt>Executar verificador</dt>
<dd><p>Se esta op&#231;&#227;o estiver ativada, o verificador ser&#225; executado antes da implanta&#231;&#227;o. Se a verifica&#231;&#227;o falhar, a implanta&#231;&#227;o n&#227;o ser&#225; realizada. O verificador examina a estrutura e o conte&#250;do do arquivo. A verifica&#231;&#227;o de aplicativos grandes geralmente consome muito tempo. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p></dd>
<dt>ID do Pool de Segmentos</dt>
<dd><p>O nome de um pool de segmentos a ser usado pelo aplicativo.</p></dd>
<dt>Descri&#231;&#227;o</dt>
<dd><p>Uma descri&#231;&#227;o do aplicativo.</p></dd>
</dl>
<a name="ref-ejb-options"></a><h5>Op&#231;&#245;es adicionais para um EJB Jar.</h5>
<p>Se o tipo do aplicativo for um EJB Jar, aparecer&#227;o estas op&#231;&#245;es.</p><dl><dt>Nome do Aplicativo</dt>
<dd><p>O nome do aplicativo.</p></dd>
<dt>Status</dt>
<dd><p>Se esta op&#231;&#227;o for ativada, o aplicativo ser&#225; ativado. Por padr&#227;o, a op&#231;&#227;o est&#225; ativada.</p></dd>
<dt>Executar verificador</dt>
<dd><p>Se esta op&#231;&#227;o estiver ativada, o verificador ser&#225; executado antes da implanta&#231;&#227;o. Se a verifica&#231;&#227;o falhar, a implanta&#231;&#227;o n&#227;o ser&#225; realizada. O verificador examina a estrutura e o conte&#250;do do arquivo. A verifica&#231;&#227;o de aplicativos grandes geralmente consome muito tempo. Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p></dd>
<dt>Bibliotecas</dt>
<dd><p>Uma lista separada por v&#237;rgulas de arquivos JAR da biblioteca, espec&#237;ficos desse m&#243;dulo ou aplicativo. Especifica um caminho absoluto ou relativo. Um caminho relativo &#233; relativo a <tt></tt><i>domain-dir</i><tt>/lib/applibs</tt> Se o caminho for absoluto, o caminho deve ser acess&#237;vl ao servidor de administra&#231;&#227;o de dom&#237;nio (DAS), o que significa que ele deve estar em <tt></tt><i>domain-dir</i><tt></tt> As bibliotecas s&#227;o disponibilizadas para o aplicativo na ordem em que elas s&#227;o especificadas.</p></dd>
<dt>Descri&#231;&#227;o</dt>
<dd><p>Uma descri&#231;&#227;o do aplicativo.</p></dd>
</dl>
<a name="ref-ruby-options"></a><h5>Op&#231;&#245;es adicionais para um aplicativo Ruby</h5>
<p>Se o tipo do aplicativo for aplicativo Ruby, aparecem estas op&#231;&#245;es.</p><dl><dt>Nome do Aplicativo</dt>
<dd><p>O nome do aplicativo.</p></dd>
<dt>Raiz de Contexto</dt>
<dd><p>O caminho do aplicativo. Na URL do aplicativo Web, a raiz de contexto aparece imediatamente ap&#243;s o n&#250;mero da porta (<tt>http://<i>host</i>:<i>port</i>/<i> context-root</i>/...</tt>). A raiz de contexto deve iniciar com uma barra; por exemplo, <tt>/hello</tt>.</p></dd>
<dt>Status</dt>
<dd><p>Se esta op&#231;&#227;o for ativada, o aplicativo ser&#225; ativado. Por padr&#227;o, a op&#231;&#227;o est&#225; ativada.</p></dd>
<dt>JRuby Home</dt>
<dd><p>O caminho para o diret&#243;rio onde o recipiente JRuby est&#225; instalado. O local padr&#227;o &#233;<tt></tt><i>as-install</i><tt>/jruby</tt>. Se voc&#234; especificar um valor para este campo, o valor do aplicativo substituir&#225; o valor JRuby Home definido para o recipiente Ruby.</p></dd>
<dt>Tempo de execu&#231;&#227;o</dt>
<dd><p>O n&#250;mero inicial de tempos de execu&#231;&#227;o do JRuby para iniciar. O valor deve ser igual a ou maior que o valor no campo Tempo de execu&#231;&#227;o m&#237;nimo, por&#233;m menor do que o valor no campo Tempo de execu&#231;&#227;o m&#225;ximo. O valor padr&#227;o &#233; 1. Se voc&#234; especificar um valor para este campo, o valor do aplicativo substituir&#225; o valor Tempo de execu&#231;&#227;o definido para o recipiente Ruby.</p></dd>
<dt>Tempo de execu&#231;&#227;o m&#237;nimo</dt>
<dd><p>O n&#250;mero m&#237;nimo de tempos de execu&#231;&#227;o do JRuby no pool. O valor deve ser menor que ou igual ao valor no campo Tempo de execu&#231;&#227;o e menor do que o valor no campo Tempo de execu&#231;&#227;o m&#225;ximo. O valor padr&#227;o &#233; 1. Se voc&#234; especificar um valor para este campo, o valor do aplicativo substituir&#225; o valor Tempo de execu&#231;&#227;o m&#237;nimo definido para o recipiente Ruby.</p></dd>
<dt>Tempo de execu&#231;&#227;o m&#225;ximo</dt>
<dd><p>O n&#250;mero m&#225;ximo de tempos de execu&#231;&#227;o do JRuby no pool. O valor deve ser igual a ou maior que o valor no campo Tempo de execu&#231;&#227;o m&#237;nimo, e igual a ou maior que o valor no campo Tempo de execu&#231;&#227;o. O valor padr&#227;o &#233; 2. Se voc&#234; especificar um valor para este campo, o valor do aplicativo substituir&#225; o valor Tempo de execu&#231;&#227;o m&#225;ximo definido para o recipiente Ruby.</p></dd>
<dt>Estrutura</dt>
<dd><p>A estrutura na qual o aplicativo ser&#225; implantado. As op&#231;&#245;es dispon&#237;veis s&#227;o<tt>rails</tt>,<tt>merb</tt>,<tt>sinatra</tt> e <tt>autodetec&#231;&#227;o</tt> O padr&#227;o &#233; <tt>rails</tt>. Configurar esta propriedade para um valor diferente de<tt>autodetec&#231;&#227;o</tt> ignora o processo normal e potencialmente longo da autodetec&#231;&#227;o e for&#231;a a implanta&#231;&#227;o na estrutura espec&#237;fica. Haver&#225; erros, se o aplicativo implantado n&#227;o tiver sido escrito para a estrutura espec&#237;fica.</p></dd>
<dt>Ambiente de rack</dt>
<dd><p>O ambiente no qual &#233; executada a estrutura JRuby, como Rails ou Merb. As op&#231;&#245;es dispon&#237;veis s&#227;o<tt>produ&#231;&#227;o</tt>,<tt>desenvolvimento</tt> e <tt>teste</tt>. O padr&#227;o &#233; <tt>desenvolvimento</tt>.</p></dd>
<dt>MT seguro</dt>
<dd><p>A configura&#231;&#227;o de segmento seguro da estrutura, na qual o aplicativo ser&#225; executado. Essa propriedade afeta aplicativos iniciados usando-se um script de inicializa&#231;&#227;o de autodetec&#231;&#227;o, fornecido pelo usu&#225;rio. As op&#231;&#245;es dispon&#237;veis s&#227;o:</p><dl><dt><tt>verdadeiro</tt></dt>
<dd><p>Especifica que a estrutura &#233; segmento seguro e, portanto, n&#227;o precisa de um pool criado para ela.</p></dd>
<dt><tt>falso</tt></dt>
<dd><p>Especifica que o aplicativo come&#231;a com um pool de inst&#226;ncias de aplicativos, e cada inst&#226;ncia do aplicativo &#233; acessado por um segmento de cada vez.</p></dd>
<dt><tt>padr&#227;o</tt></dt>
<dd><p>O Enterprise Server tenta detectar a seguran&#231;a de segmentos automaticamente. Este &#233; o valor padr&#227;o.</p></dd>
</dl>
<p>Essa propriedade afeta apenas estruturas que est&#227;o sendo iniciadas onde a seguran&#231;a de segmentos n&#227;o pode ser automaticamente determinada. A Configura&#231;&#227;o deste valor para <tt>verdadeiro</tt> n&#227;o faz com que um aplicativo Rails 2.1.<i>x</i> de autodetec&#231;&#227;o seja iniciado no modo de segmento seguro, ou que ele possa ser usado para for&#231;ar uma estrutura de segmentos seguros a ser iniciada no modo pooled.</p></dd>
<dt>Servidores Virtuais</dt>
<dd><p>Os servidores virtuais associados ao aplicativo.</p></dd>
<dt>Descri&#231;&#227;o</dt>
<dd><p>Uma descri&#231;&#227;o do aplicativo.</p></dd>
</dl>
<h5>Tarefas relacionadas</h5>

<ul><li><p><a href="task-appdeployweb.html">Para implantar um aplicativo da Web</a></p></li>
<li><p><a href="task-deployentapp.html">Para implantar um Aplicativo Empresarial</a></p></li>
<li><p><a href="task-appdeployclient.html">Para implantar um cliente aplicativo</a></p></li>
<li><p><a href="task-appdeployconn.html">Para implantar um m&#243;dulo conector</a></p></li>
<li><p><a href="task-appdeployejb.html">Para implantar um EJB Jar</a></p></li>
<li><p><a href="task-appdeployruby.html">Para implantar um aplicativo Ruby</a></p></li>
<li><p><a href="task-appedit.html">Para editar um aplicativo implantado</a></p></li>
<li><p><a href="task-appviewdesc.html">Para exibir os descritores de um aplicativo</a></p></li>
<li><p><a href="task-applaunch.html">Para iniciar um aplicativo</a></p></li>
<li><p><a href="task-appredeploy.html">Para reimplantar um aplicativo implantado</a></p></li>
<li><p><a href="task-apprestart.html">Para reiniciar um aplicativo implantado</a></p></li></ul>
<h5>Comandos <tt>asadmin</tt> relacionados</h5>

<ul><li><p><a href="http://docs.sun.com/doc/820-7701/deploy-1?a=view"><tt>deploy</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/redeploy-1?a=view"><tt>redeploy</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/list-applications-1?a=view"><tt>list-applications</tt>(1)</a></p></li></ul>

