<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-uc-concepts"></a><h4>Principais conceitos do Ferramenta de Atualiza&#231;&#227;o</h4>
<p>O Ferramenta de Atualiza&#231;&#227;o gerencia as instala&#231;&#245;es de componentes de software do
Enterprise Server que est&#227;o contidos em um &#250;nico diret&#243;rio do sistema de
arquivos do seu sistema.</p><p>Os principais conceitos do Ferramenta de Atualiza&#231;&#227;o est&#227;o descritos nas se&#231;&#245;es a
seguir.</p><a name="ref-uc-about-component"></a><h5>Componente</h5>
<p>Um <b>componente</b> &#233; a unidade instal&#225;vel que o Ferramenta de Atualiza&#231;&#227;o gerencia.
 Um componente consiste em arquivos que s&#227;o instalados como uma unidade
no sistema, em uma imagem de instala&#231;&#227;o.</p><a name="ref-uc-about-image"></a><h5>Imagem de instala&#231;&#227;o</h5>
<p>Uma <b>imagem de instala&#231;&#227;o</b> &#233; o diret&#243;rio que cont&#233;m os componentes de software, incluindo
o conte&#250;do do diret&#243;rio.  A imagem de instala&#231;&#227;o &#233; adicionada ao
Ferramenta de Atualiza&#231;&#227;o como resultado do download e da instala&#231;&#227;o do software
Enterprise Server.  Para ativar a adi&#231;&#227;o e a atualiza&#231;&#227;o dos componentes
de software do Enterprise Server, cada imagem de instala&#231;&#227;o cont&#233;m informa&#231;&#245;es sobre
a instala&#231;&#227;o de componentes.</p><a name="ref-uc-about-repository"></a><h5>Reposit&#243;rio de rede</h5>
<p>Um <b>reposit&#243;rio de rede</b> cont&#233;m estes itens:</p>
<ul><li><p>Componentes que podem ser adicionados a uma imagem de instala&#231;&#227;o</p></li>
<li><p>Atualiza&#231;&#245;es para componentes existentes em uma imagem de instala&#231;&#227;o</p></li></ul>
<p>Uma imagem de instala&#231;&#227;o &#233; associada a um ou mais reposit&#243;rios de
rede. Cada reposit&#243;rio de rede &#233; representado por um nome e uma
URL associada. Um nome de reposit&#243;rio &#233; exclusivo para cada imagem de
instala&#231;&#227;o e representa a organiza&#231;&#227;o ou o projeto que gerencia o reposit&#243;rio
e um escopo bem definido de conte&#250;do.</p><a name="ref-uc-about-addon"></a><h5> Componente de suplemento</h5>
<p>Um <b>componente de suplemento</b> &#233; um componente da imagem de instala&#231;&#227;o que ainda n&#227;o
foi instalado.</p>
