<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jmxconnectorssledit"></a><h4>Para editar as configura&#231;&#245;es SSL do conector JMX</h4><h6>Antes de come&#231;ar</h6><p>Essa tarefa &#233; significativa apenas se a seguran&#231;a for ativada pelo conector
JMX.</p><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Configura&#231;&#227;o.</b></li>
<li><b>Sob o n&#243; Configura&#231;&#227;o, selecione o n&#243; Servi&#231;o de Administra&#231;&#227;o.</b><p>A p&#225;gina Editar Conector JMX &#233; exibida.</p></li>
<li><b>Marque a caixa de sele&#231;&#227;o Seguran&#231;a Ativada para que a comunica&#231;&#227;o JMX
seja criptografada.</b><p>Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p></li>
<li><b>Clique na guia SSL.</b><p>A p&#225;gina SSL &#233; exibida.</p></li>
<li><b>Na p&#225;gina SSL, marque a caixa de sele&#231;&#227;o SSL3 Ativada para ativar
a SSL3.</b><p>Por padr&#227;o, a op&#231;&#227;o est&#225; ativada.</p></li>
<li><b>Marque a caixa de sele&#231;&#227;o TLS Ativada para ativar o Transport Layer
Security (TLS).</b><p>Por padr&#227;o, a op&#231;&#227;o est&#225; ativada.</p></li>
<li><b>Marque a caixa de sele&#231;&#227;o Autentica&#231;&#227;o Cliente Ativada para exigir que os
clientes se identifiquem ao servidor a cada solicita&#231;&#227;o.</b><p>Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p></li>
<li><b>No campo Apelido do Certificado, digite o apelido do certificado do servidor,
no banco de dados do certificado ou  no s&#237;mbolo PKCS#11.</b><p>No certificado, o formato do nome &#233; <tt><i>nome do s&#237;mbolo</i>:<i> apelido</i></tt>. Incluir a parte do
<tt><i>nome do s&#237;mbolo</i>: </tt> neste atributo &#233; opcional. O valor padr&#227;o &#233; <tt>s1as</tt>.</p></li>
<li><b>No campo Armazenamento Chave, digite o nome do arquivo do armazenamento chave
(por exemplo, <tt>keystore.jks</tt>).</b></li>
<li><b>No campo Algoritmo Confi&#225;vel, digite o nome do algoritmo de gest&#227;o fiduci&#225;ria
(por exemplo, PKIX) para usar para valida&#231;&#227;o do caminho de certifica&#231;&#227;o.</b></li>
<li><b>No campo Comprimento M&#225;x. do Certificado, digite o n&#250;mero m&#225;ximo de certificados
intermedi&#225;rios n&#227;o emitidos automaticamente, que podem existir em um caminho de certifica&#231;&#227;o.</b><p>Este campo &#233; usado apenas se o campo Algoritmo Confi&#225;vel estiver definido
como PKIX. O valor 0 indica que o caminho pode conter somente
um certificado. O valor -1 indica que o comprimento do caminho n&#227;o
&#233;   restringido (n&#227;o existe m&#225;ximo). Definir um valor valor menor
que -1 causa uma exce&#231;&#227;o a ser lan&#231;ada. O valor padr&#227;o &#233;
5.</p></li>
<li><b>No campo Armazenamento Confi&#225;vel, digite o nome do arquivo do armazenamento confi&#225;vel
(por exemplo, <tt>cacerts.jks</tt>).</b></li>
<li><b>Na &#225;rea Conjuntos Codificados, especifique os conjuntos codificados a serem usados.</b><p>Se voc&#234; n&#227;o adicionar quaisquer conjuntos codificados, todos os conjuntos codificados ser&#227;o
usados.</p></li>
<li><b>Clique em OK.</b></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-jmxconnectoredit.html">Para editar o conector JMX </a></p></li></ul>

