<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-lifecyclemoduleedit"></a><h4>Para editar um m&#243;dulo do ciclo de vida</h4><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, selecione o n&#243; M&#243;dulos do Ciclo de Vida.</b><p>A p&#225;gina M&#243;dulos do Ciclo de Vida &#233; exibida.</p></li>
<li><b>Na p&#225;gina M&#243;dulos do Ciclo de Vida, clique no nome do m&#243;dulo
do ciclo de vida a ser editado.</b><p>A p&#225;gina Editar M&#243;dulo do Ciclo de Vida &#233; aberta.</p></li>
<li><b>No campo Nome da Classe, digite o nome totalmente qualificado do arquivo
de classe do m&#243;dulo do ciclo de vida.</b><p>A classe deve implementar a interface <tt>com.sun.appserv.server.LifecycleListener</tt>.</p></li>
<li><b>No campo Caminho da classe, digite o caminho da classe do m&#243;dulo
do ciclo de vida.</b><p>O caminho da classe especifica onde o m&#243;dulo do ciclo de vida
est&#225; localizado. O valor padr&#227;o &#233; <tt></tt><i>domain-dir</i><tt>/applications </tt>. Se o m&#243;dulo j&#225; estiver
neste diret&#243;rio (isto &#233;, no caminho da classe do servidor), esse campo
poder&#225; ser deixado em branco.</p></li>
<li><b>No campo Ordem de Carregamento, digite um valor especificando a ordem na
qual esse m&#243;dulo do ciclo de vida deve ser carregado na inicializa&#231;&#227;o.</b><p>Os m&#243;dulos com valores inteiros menores de ordem de carregamento s&#227;o carregados
antes. O valor pode variar de 101 at&#233; o <tt>MAXINT</tt> do sistema
operacional. Valores de 1 a 100 s&#227;o reservados.</p></li>
<li><b>Marque a caixa de sele&#231;&#227;o Status Ativado para habilitar o m&#243;dulo do
ciclo de vida.</b><p>Por padr&#227;o, a op&#231;&#227;o est&#225; ativada.</p></li>
<li><b>Marque a caixa de sele&#231;&#227;o Inicializa&#231;&#227;o de Inst&#226;ncia de Preven&#231;&#227;o de Falha
de Carregamento para especificar que o servidor seja desligado, em caso de
falha do carregamento do m&#243;dulo do ciclo de vida.</b><p>Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p></li>
<li><b>Na lista suspensa Servidores Virtuais, selecione o servidor ou servidores virtuais a
serem associados com o m&#243;dulo do ciclo de vida.</b><p>Por padr&#227;o, nenhum servidor virtual &#233; selecionado.</p></li>
<li><b>No campo Descri&#231;&#227;o, digite uma descri&#231;&#227;o do m&#243;dulo do ciclo de vida.</b></li>
<li>(Opcional) <b>Na se&#231;&#227;o Propriedades Adicionais, especifique essas propriedades.</b><p>O Enterprise Server n&#227;o define nenhuma propriedade adicional para os m&#243;dulos do
ciclo de vida.</p><ul>
<li><b>Para adicionar uma propriedade, clique no bot&#227;o Adicionar Propriedade. Na linha em
branco que &#233; exibida, digite o nome da propriedade no campo Nome
e digite o valor da propriedade no campo Valor.</b></li>
<li><b>Para modificar uma propriedade, edite o campo Valor da propriedade.</b></li>
<li><b>Para excluir uma propriedade, marque a caixa de sele&#231;&#227;o &#224; esquerda do
campo Nome da propriedade a ser exclu&#237;da. Clique no bot&#227;o Excluir Propriedades.</b></li></ul></li>
<li><b>Clique em Salvar.</b>
<hr><p><b>Dica - </b>Para restaurar as configura&#231;&#245;es padr&#227;o, clique no bot&#227;o Carregar Padr&#245;es e depois
em Salvar. </p>
<hr>
</li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-lifecyclemodulenew.html">Para criar um m&#243;dulo do ciclo de vida</a></p></li>
<li><p><a href="task-lifecyclemoduledelete.html">Para excluir um m&#243;dulo do ciclo de vida</a></p></li></ul>

