<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-realmedit"></a><h4>Para editar um dom&#237;nio</h4><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Configura&#231;&#227;o.</b></li>
<li><b>Expanda o n&#243; Seguran&#231;a.</b></li>
<li><b>Expanda o n&#243; Dom&#237;nios.</b></li>
<li><b>Selecione o nome de um dom&#237;nio existente.</b><p>A p&#225;gina Editar Dom&#237;nio &#233; exibida.</p></li>
<li><b>Para modificar o nome da classe do dom&#237;nio, fa&#231;a uma das seguintes
coisas:</b><ul>
<li><b>Na lista suspensa Nome da Classe, selecione o nome da classe do
dom&#237;nio que est&#225; sendo criado.</b></li>
<li><b>Selecione o segundo bot&#227;o de op&#231;&#245;es e digite o nome da classe
do dom&#237;nio que est&#225; sendo criado.</b></li></ul></li>
<li>(Opcional) <b>Na se&#231;&#227;o Propriedades Adicionais, especifique essas propriedades.</b><p>As propriedades v&#225;lidas dependem do tipo de dom&#237;nio.</p>
<ul><li><p>Para obter uma descri&#231;&#227;o das propriedades Dom&#237;nio de Arquivo, consulte <a href="ref-editfile-adminrealm.html">Propriedades espec&#237;ficas da classe <tt> FileRealm</tt></a>.</p></li>
<li><p>Para obter uma descri&#231;&#227;o das propriedades Dom&#237;nio de Certificado, consulte <a href="ref-editcertrealm.html">Propriedades espec&#237;ficas da classe <tt>CertificateRealm </tt></a>.</p></li>
<li><p>Para obter uma descri&#231;&#227;o das propriedades Dom&#237;nio JDBC, consulte <a href="ref-editjdbcrealm.html">Propriedades espec&#237;ficas para a classe <tt>JDBCRealm </tt></a>.</p></li>
<li><p>Para obter uma descri&#231;&#227;o das propriedades Dom&#237;nio LDAP, consulte <a href="ref-ldaprealmprop.html">Propriedades espec&#237;ficas da classe <tt>LDAPRealm </tt></a>.</p></li>
<li><p>Para obter uma descri&#231;&#227;o das propriedades Dom&#237;nio do Solaris, consulte <a href="ref-solarisrealmprop.html">Propriedades espec&#237;ficas da classe <tt>SolarisRealm </tt></a>.</p></li></ul>
<ul>
<li><b>Para adicionar uma propriedade, clique no bot&#227;o Adicionar Propriedade. Na linha em
branco que &#233; exibida, digite o nome da propriedade no campo Nome
e digite o valor da propriedade no campo Valor.</b></li>
<li><b>Para modificar uma propriedade, edite o campo Valor da propriedade.</b></li>
<li><b>Para excluir uma propriedade, marque a caixa de sele&#231;&#227;o &#224; esquerda do
campo Nome da propriedade a ser exclu&#237;da. Clique no bot&#227;o Excluir Propriedades.</b></li></ul></li>
<li><b>Clique em Salvar.</b></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-realmnew.html">Para criar um dom&#237;nio</a></p></li>
<li><p><a href="task-todeleterealm.html">Para excluir um dom&#237;nio</a></p></li>
<li><p><a href="task-tosetdefault.html">Para definir o dom&#237;nio padr&#227;o</a></p></li>
<li><p><a href="task-createcustomrealm.html">Para criar um dom&#237;nio personalizado</a></p></li></ul>

