<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-appdeployruby"></a><h4>Para implantar um aplicativo Ruby</h4><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, selecione o n&#243; Aplicativos.</b><p>A p&#225;gina Aplicativos &#233; exibida.</p></li>
<li><b>Na tabela Aplicativos Implantados, clique no bot&#227;o Implantar.</b><p>A p&#225;gina Implantar Aplicativos ou M&#243;dulos &#233; exibida.</p></li>
<li><b>Especifique o local do arquivo compacto que cont&#233;m o aplicativo a ser
implantado.</b><ul>
<li><b>Se o arquivo compacto residir em ou for acessado do computador cliente,
selecione a op&#231;&#227;o Arquivo Empacotador a Ser Carregado no Servidor.</b><p>O computador cliente &#233; o host em que voc&#234; visualiza o Console
de Administra&#231;&#227;o por meio de um navegador.</p><p>Clique em Procurar para localizar o arquivo ou digite o caminho completo
para o arquivo.</p></li>
<li><b>Se o arquivo compacto residir no computador servidor ou se for um
aplicativo n&#227;o empacotado localizado em um diret&#243;rio destacado, selecione a op&#231;&#227;o Arquivo
Empacotado Local ou Diret&#243;rio Acessado no Enterprise Server.</b><p>O computador servidor &#233; o host que executa o servidor de administra&#231;&#227;o
de dom&#237;nio (DAS). </p><p>Clique em Procurar Arquivos para localizar um arquivo ou clique em Procurar
Pastas para localizar um diret&#243;rio. Como alternativa, digite o caminho completo para
o arquivo ou diret&#243;rio. &#201; comum implantar um aplicativo JRuby de um
diret&#243;rio.</p></li></ul></li>
<li><b>Na lista suspensa Tipo, selecione Aplicativo Ruby.</b><p>Se voc&#234; tiver especificado um Arquivo Empacotador a Ser Carregado no Servidor
ou um Arquivo Empacotado Local Acessado do Enterprise Server, o tipo do
aplicativo ser&#225; detectado automaticamente. Se voc&#234; tiver especificado um Diret&#243;rio Acessado do
Enterprise Server, voc&#234; deve especificar o tipo manualmente.</p></li>
<li><b>No campo Nome do Aplicativo, preserve o nome padr&#227;o, que &#233; o
nome do diret&#243;rio ou o prefixo do nome do arquivo, ou digite
outro nome.</b><p>O nome padr&#227;o ser&#225; exibido se voc&#234; optar por carregar um arquivo.
O nome do aplicativo deve ser exclusivo.</p></li>
<li><b>No campo Raiz de Contexto, digite uma sequ&#234;ncia que identifica o aplicativo
Ruby.</b><p>Na URL do aplicativo Ruby, a raiz de contexto aparece imediatamente ap&#243;s
o n&#250;mero da porta (<tt>http://</tt><i>host</i><tt>:</tt><i>port</i><tt>/</tt><i> context-root</i><tt>/...</tt>).  A raiz de contexto deve iniciar
com uma barra; por exemplo, <tt>/hello</tt>.</p></li>
<li><b>Marque a caixa de sele&#231;&#227;o Status Ativado para habilitar o aplicativo.</b><p>Por padr&#227;o, a op&#231;&#227;o est&#225; ativada. Se esta op&#231;&#227;o for desativada, o
aplicativo n&#227;o estar&#225; dispon&#237;vel.</p></li>
<li><b>No campo JRuby Home, digite o caminho para o diret&#243;rio onde o
recipiente JRuby est&#225; instalado.</b><p>O local padr&#227;o &#233;<tt></tt><i>as-install</i><tt>/jruby</tt>. Se voc&#234; especificar um valor para este campo,
o valor do aplicativo substituir&#225; o valor JRuby Home definido para o
recipiente Ruby.</p></li>
<li><b>No campo Tempo de execu&#231;&#227;o, digite o n&#250;mero inicial dos tempos de
execu&#231;&#227;o do JRuby para iniciar.</b><p>O valor deve ser no m&#237;nimo o valor do campo Tempo de
execu&#231;&#227;o m&#237;nimo, por&#233;m menor do que o valor no campo Tempo de
execu&#231;&#227;o m&#225;ximo. O valor padr&#227;o &#233; 1. Se voc&#234; especificar um valor
para este campo, o valor do aplicativo substituir&#225; o valor Tempo de
execu&#231;&#227;o definido para o recipiente Ruby.</p></li>
<li><b>No campo Tempo de execu&#231;&#227;o m&#237;nimo, digite o n&#250;mero m&#237;nimo de tempos
de execu&#231;&#227;o do JRuby no pool.</b><p>O valor deve ser menor ou igual ao valor no campo Tempo
de execu&#231;&#227;o, e menor do que o valor no campo Tempo de
execu&#231;&#227;o m&#225;ximo. O valor padr&#227;o &#233; 1. Se voc&#234; especificar um valor
para este campo, o valor do aplicativo substituir&#225; o valor Tempo de
execu&#231;&#227;o m&#237;nimo definido para o recipiente Ruby.</p></li>
<li><b>No campo Tempo de execu&#231;&#227;o m&#225;ximo, digite o n&#250;mero m&#225;ximo de tempos
de execu&#231;&#227;o do JRuby no pool.</b><p>O valor deve ser igual ou maior do que o valor no
campo Tempo de execu&#231;&#227;o m&#237;nimo e igual ou maior do que o
valor no campo Tempo de execu&#231;&#227;o. O valor padr&#227;o &#233; 2. Se
voc&#234; especificar um valor para este campo, o valor do aplicativo substituir&#225;
o conjunto de valores de Tempo de execu&#231;&#227;o m&#225;ximo do recipiente Ruby.</p></li>
<li><b>Na lista suspensa Estrutura, selecione a estrutura na qual o aplicativo deve
ser implantado.</b><p>As op&#231;&#245;es dispon&#237;veis s&#227;o<tt>rails</tt>,<tt>merb</tt>,<tt>sinatra</tt> e <tt>autodetec&#231;&#227;o</tt> O padr&#227;o &#233; <tt>detec&#231;&#227;o autom&#225;tica</tt>. Configurar esta
propriedade para um valor diferente de<tt>autodetec&#231;&#227;o</tt> ignora o processo normal e potencialmente
longo da autodetec&#231;&#227;o e for&#231;a a implanta&#231;&#227;o na estrutura espec&#237;fica. Haver&#225; erros,
se o aplicativo implantado n&#227;o tiver sido escrito para a estrutura espec&#237;fica.</p></li>
<li><b>Na lista suspensa Ambiente de rack, selecione o ambiente no qual a
estrutura do JRuby &#233; executada, por exemplo Rails ou Merb.</b><p>As op&#231;&#245;es dispon&#237;veis s&#227;o<tt>produ&#231;&#227;o</tt>,<tt>desenvolvimento</tt> e <tt>teste</tt>. O padr&#227;o &#233; <tt>desenvolvimento</tt>.</p></li>
<li><b>Na lista suspensa MT seguro, selecione a configura&#231;&#227;o segmento seguro para a
estrutura na qual o aplicativo ser&#225; executado.</b><p>Essa propriedade afeta aplicativos iniciados usando-se um script de inicializa&#231;&#227;o de autodetec&#231;&#227;o,
fornecido pelo usu&#225;rio. As op&#231;&#245;es dispon&#237;veis s&#227;o:</p><dl><dt><tt>verdadeiro</tt></dt>
<dd><p>Especifica que a estrutura &#233; segmento seguro e, portanto, n&#227;o precisa de um pool criado para ela.</p></dd>
<dt><tt>falso</tt></dt>
<dd><p>Especifica que o aplicativo come&#231;a com um pool de inst&#226;ncias de aplicativos, e cada inst&#226;ncia do aplicativo &#233; acessado por um segmento de cada vez.</p></dd>
<dt><tt>padr&#227;o</tt></dt>
<dd><p>O Enterprise Server tenta detectar a seguran&#231;a de segmentos automaticamente. Este &#233; o valor padr&#227;o.</p></dd>
</dl>
<p>Essa propriedade afeta apenas estruturas que est&#227;o sendo iniciadas onde a seguran&#231;a
de segmentos n&#227;o pode ser automaticamente determinada. A Configura&#231;&#227;o deste valor para
<tt>verdadeiro</tt> n&#227;o faz com que um aplicativo Rails 2.1.<i>x</i> de autodetec&#231;&#227;o seja
iniciado no modo de segmento seguro, ou que ele possa ser usado
para for&#231;ar uma estrutura de segmentos seguros a ser iniciada no modo
pooled.</p></li>
<li><b>Na lista suspensa Servidores Virtuais, selecione o servidor virtual a ser associado
ao aplicativo.</b></li>
<li><b>No campo Descri&#231;&#227;o, digite uma descri&#231;&#227;o para o aplicativo.</b></li>
<li><b>Clique em OK.</b></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-applistdeployed.html">Para exibir uma lista de aplicativos implantados</a></p></li>
<li><p><a href="task-appdeployweb.html">Para implantar um aplicativo da Web</a></p></li>
<li><p><a href="task-deployentapp.html">Para implantar um Aplicativo Empresarial</a></p></li>
<li><p><a href="task-appdeployclient.html">Para implantar um cliente aplicativo</a></p></li>
<li><p><a href="task-appdeployconn.html">Para implantar um m&#243;dulo conector</a></p></li>
<li><p><a href="task-appdeployejb.html">Para implantar um EJB Jar</a></p></li>
<li><p><a href="task-appedit.html">Para editar um aplicativo implantado</a></p></li>
<li><p><a href="task-appviewdesc.html">Para exibir os descritores de um aplicativo</a></p></li>
<li><p><a href="task-applaunch.html">Para iniciar um aplicativo</a></p></li>
<li><p><a href="task-appredeploy.html">Para reimplantar um aplicativo implantado</a></p></li>
<li><p><a href="task-apprestart.html">Para reiniciar um aplicativo implantado</a></p></li></ul>

