<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-setadvanceappconfig"></a><h4>Para definir a configura&#231;&#227;o dos aplicativos avan&#231;ados</h4><a name="indexterm-8"></a><a name="indexterm-9"></a><a name="indexterm-10"></a><a name="indexterm-11"></a><p>Use a p&#225;gina Configura&#231;&#227;o de Aplicativos para definir as propriedades que ajudar&#227;o
a garantir que as altera&#231;&#245;es em aplicativos implantados ser&#227;o detectadas e que
as classes modificadas ser&#227;o recarregadas.</p><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, selecione o n&#243; Enterprise Server.</b><p>A p&#225;gina Informa&#231;&#245;es Gerais &#233; exibida.</p></li>
<li><b>Na p&#225;gina Informa&#231;&#245;es Gerais, clique na guia Avan&#231;ado.</b><p>A p&#225;gina Configura&#231;&#227;o de Aplicativos &#233; exibida.</p></li>
<li><b>Marque a caixa de sele&#231;&#227;o Recarregamento Ativado para ativar o recarregamento din&#226;mico
de aplicativos.</b><p>Quando o recarregamento din&#226;mico est&#225; ativado, voc&#234; n&#227;o precisa reimplantar aplicativos ou
m&#243;dulos caso altere o respectivo c&#243;digo ou os descritores de implanta&#231;&#227;o. 
Tudo o que precisa fazer &#233; copiar os arquivos do JavaServer Pages<sup>TM</sup> (JSP<sup>TM</sup>)
ou os arquivos da classe no diret&#243;rio de implanta&#231;&#227;o do aplicativo ou
do m&#243;dulo. O servidor verifica periodicamente se h&#225; altera&#231;&#245;es no diret&#243;rio de
implanta&#231;&#227;o e reimplanta o aplicativo, autom&#225;tica e dinamicamente, com as altera&#231;&#245;es. Isso
&#233; &#250;til em um ambiente de desenvolvimento, pois permite testar rapidamente as
altera&#231;&#245;es de c&#243;digos. Em um ambiente de produ&#231;&#227;o, no entanto, o recarregamento
din&#226;mico pode prejudicar o desempenho. Al&#233;m disso, sempre que ocorre um recarregamento,
as sess&#245;es nesse tempo de transi&#231;&#227;o se tornam inv&#225;lidas. O cliente deve
reiniciar a sess&#227;o.</p><p>Por padr&#227;o, a op&#231;&#227;o est&#225; ativada.</p></li>
<li><b>No campo Intervalo de Consulta de Recarregamento, digite a dura&#231;&#227;o, em segundos,
do intervalo em que aplicativos e m&#243;dulos dever&#227;o ser verificados, para detec&#231;&#227;o
de altera&#231;&#245;es de c&#243;digos, e recarregados dinamicamente. </b><p>O valor padr&#227;o &#233; 2.</p></li>
<li><b>No campo Tempo-limite de Sess&#227;o Admin, digite o n&#250;mero de minutos de
inatividade, ap&#243;s o qual a sess&#227;o do Console de Administra&#231;&#227;o ser&#225; encerrada.</b><p>O valor padr&#227;o &#233; 60.</p></li>
<li><b>Marque a caixa de sele&#231;&#227;o Implanta&#231;&#227;o Autom&#225;tica Ativada para ativar a implanta&#231;&#227;o
autom&#225;tica de aplicativos.</b><p>Se voc&#234; copiar um arquivo de aplicativo ou m&#243;dulo (JAR, WAR, RAR
ou EAR) para um diret&#243;rio especial e depois aivar a implanta&#231;&#227;o autom&#225;tica,
o aplicativo ou m&#243;dulo ser&#225; automaticamente implantado pelo Enterprise Server. Por padr&#227;o,
a op&#231;&#227;o est&#225; ativada.</p></li>
<li><b>No campo Intervalo de Consulta de Implanta&#231;&#227;o Autom&#225;tica, digite a dura&#231;&#227;o, em
segundos, do intervalo em que aplicativos e m&#243;dulos dever&#227;o ser verificados, para
detec&#231;&#227;o de altera&#231;&#245;es de c&#243;digos, e recarregados dinamicamente. </b><p>O valor padr&#227;o &#233; 2. A altera&#231;&#227;o do intervalo de consulta n&#227;o
afeta o tempo destinado &#224; implanta&#231;&#227;o de um aplicativo ou m&#243;dulo.</p></li>
<li><b>No campo Tempo-limite de Novas Tentativas de Implanta&#231;&#227;o Autom&#225;tica, digite o n&#250;mero
de segundos em que o tamanho de um arquivo parcialmente copiado pode
permanecer inalterado antes que ocorra um erro.</b><p>O valor padr&#227;o &#233; 4.</p></li>
<li><b>O campo Diret&#243;rio de Implanta&#231;&#227;o Autom&#225;tica, digite o caminho completo do diret&#243;rio
para monitorar a implanta&#231;&#227;o autom&#225;tica de aplicativos.</b><p>O valor padr&#227;o &#233; <tt></tt><i>domain-dir</i><tt>/autodeploy</tt>.</p></li>
<li><b>Na lista suspensa XML, selecione o tipo de valida&#231;&#227;o XML a ser
realizada nos descritores de implanta&#231;&#227;o padr&#227;o e do Enterprise Server.</b><p>O tipo de ser qualquer um dos seguintes:</p><dl><dt><tt>completo</tt></dt>
<dd><p>Se a valida&#231;&#227;o do XML falhar, a implanta&#231;&#227;o falhar&#225;. Este &#233; o valor padr&#227;o.</p></dd>
<dt><tt>analisando</tt></dt>
<dd><p>A implanta&#231;&#227;o ocorreu, apesar dos erros de valida&#231;&#227;o do XML relatados.</p></dd>
<dt><tt>nenhum</tt></dt>
<dd><p>N&#227;o foi realizada nenhuma valida&#231;&#227;o do XML.</p></dd>
</dl>
</li>
<li><b>Marque a caixa de sele&#231;&#227;o Verificador Ativado para verificar os arquivos de
descritor de implanta&#231;&#227;o.</b><p>O verificador examina a estrutura e o conte&#250;do do arquivo antes da
implanta&#231;&#227;o autom&#225;tica.  Se a verifica&#231;&#227;o falhar, a implanta&#231;&#227;o n&#227;o ser&#225; realizada.
A verifica&#231;&#227;o de aplicativos grandes geralmente consome muito tempo. Por padr&#227;o, a
op&#231;&#227;o est&#225; desativada.</p></li>
<li><b>Marque a caixa de sele&#231;&#227;o Pr&#233;-compila&#231;&#227;o Ativada para compilar previamente todos os
arquivos JSP <sup>TM</sup>.</b><p>Se esta op&#231;&#227;o for desativada, os arquivos JSP ser&#227;o compilados no tempo
de execu&#231;&#227;o, quando forem acessados pela primeira vez. Por padr&#227;o, a op&#231;&#227;o
est&#225; desativada.</p></li>
<li>(Opcional) <b>Na se&#231;&#227;o Propriedades Adicionais, especifique essas propriedades.</b><p>O Enterprise Server n&#227;o define nenhuma propriedade adicional para os aplicativos.</p><ul>
<li><b>Para adicionar uma propriedade, clique no bot&#227;o Adicionar Propriedade. Na linha em
branco que &#233; exibida, digite o nome da propriedade no campo Nome
e digite o valor da propriedade no campo Valor.</b></li>
<li><b>Para modificar uma propriedade, edite o campo Valor da propriedade.</b></li>
<li><b>Para excluir uma propriedade, marque a caixa de sele&#231;&#227;o &#224; esquerda do
campo Nome da propriedade a ser exclu&#237;da. Clique no bot&#227;o Excluir Propriedades.</b></li></ul></li>
<li><b>Clique em Salvar.</b>
<hr><p><b>Dica - </b>Para restaurar as configura&#231;&#245;es padr&#227;o, clique no bot&#227;o Carregar Padr&#245;es e depois
em Salvar. </p>
<hr>
</li>
<li><b>Reinicie o servidor.</b></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-generaltab.html">Para Exibir Informa&#231;&#245;es Gerais do Enterprise Server</a></p></li>
<li><p><a href="task-logviewer.html">Para exibir o log do servidor</a></p></li>
<li><p><a href="task-setadvancedomainattributes.html">Para definir os atributos de dom&#237;nio avan&#231;ados</a></p></li>
<li><p><a href="task-setadminpassword.html">Para alterar a Senha do Administrador</a></p></li>
<li><p><a href="task-systemproperties.html">Para gerenciar propriedades do sistema</a></p></li>
<li><p><a href="task-appmonitoringdata.html">Para exibir dados de monitoramento do aplicativo</a></p></li>
<li><p><a href="task-servermonitoringdata.html">Para exibir dados de monitoramento do servidor</a></p></li></ul>

