<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jaccprovidernew"></a><h4>Para criar um provedor de JACC</h4><p>JACC (Java Authorization Contract for Containers) faz parte da especifica&#231;&#227;o Java EE
que define uma interface para provedores de autoriza&#231;&#227;o plug&#225;vel. Isso permite ao
administrador configurar m&#243;dulos de <b>plugin</b> de terceiros para realizar a autoriza&#231;&#227;o. Por
padr&#227;o, o Enterprise Server fornece um mecanismo de autoriza&#231;&#227;o, baseado em arquivo,
compat&#237;vel com JACC.</p><p>Para obter informa&#231;&#245;es sobre como gravar as classes de implementa&#231;&#227;o do provedor
de JACC, consulte a especifica&#231;&#227;o JACC em <a href="http://jcp.org/en/jsr/detail?id=115">http://jcp.org/en/jsr/detail?id=115</a>.</p><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Configura&#231;&#227;o.</b></li>
<li><b>Sob o n&#243; Configura&#231;&#227;o, expanda o n&#243; Seguran&#231;a.</b></li>
<li><b>Sob o n&#243; Seguran&#231;a, selecione o n&#243; Provedores de JACC.</b><p>A p&#225;gina Provedores de JACC &#233; exibida.</p></li>
<li><b>Na p&#225;gina Provedores de JACC, clique em Novo.</b><p>A p&#225;gina Novo Provedor de JACC &#233; exibida.</p></li>
<li><b>Na p&#225;gina Novo Provedor de JACC, no campo Nome, digite o nome
que ir&#225; identificar este provedor.</b></li>
<li><b>No campo Configura&#231;&#227;o da Diretiva, digite o nome da classe que implementa
a f&#225;brica de configura&#231;&#245;es de diretivas.</b><p>O provedor <tt>padr&#227;o </tt>usa <tt>com.sun.enterprise.security.provider.PolicyConfigurationFactoryImpl </tt>. O provedor <tt>simples</tt> usa <tt>com.sun.enterprise.security.jacc.provider.SimplePolicyConfigurationFactory </tt>.</p></li>
<li><b>No campo Provedor de Diretiva, digite o nome da classe que implementa
a f&#225;brica de diretivas.</b><p>O provedor <tt>padr&#227;o </tt>usa <tt>com.sun.enterprise.security.provider.PolicyWrapper</tt>. O provedor <tt>simples</tt> usa <tt>com.sun.enterprise.security.jacc.provider.SimplePolicyProvider </tt>.</p></li>
<li>(Opcional) <b>Na se&#231;&#227;o Propriedades Adicionais, especifique essas propriedades.</b><p>Para adicionar uma propriedade, clique no bot&#227;o Adicionar Propriedade. Na linha em
branco que &#233; exibida, digite o nome da propriedade no campo Nome
e digite o valor da propriedade no campo Valor.</p><p>Para obter uma descri&#231;&#227;o das propriedades adicionais dispon&#237;veis para provedores de JACC,
consulte <a href="ref-jaccproviderprop.html">Propriedades espec&#237;ficas de provedores de JACC</a>.</p></li>
<li><b>Clique em OK.</b></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-jaccprovideredit.html">Para editar um provedor de JACC</a></p></li>
<li><p><a href="task-jaccproviderdelete.html">Para excluir um Provedor de JACC</a></p></li>
<li><p><a href="task-setactivejaccprov.html">Para definir o Provedor de JACC ativo</a></p></li></ul>

