<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-messagesecurityconfignew"></a><h4>Para criar uma configura&#231;&#227;o de seguran&#231;a de mensagens</h4><p>Normalmente, voc&#234; n&#227;o precisa criar uma configura&#231;&#227;o de seguran&#231;a de mensagens. O
Enterprise Server inclui uma configura&#231;&#227;o de seguran&#231;a de mensagens para a camada
de autentica&#231;&#227;o SOAP. Os provedores desta configura&#231;&#227;o n&#227;o s&#227;o ativados por padr&#227;o,
mas voc&#234; pode ativ&#225;-los editando a configura&#231;&#227;o de seguran&#231;a de mensagens SOAP.
Voc&#234; pode, contudo, criar uma configura&#231;&#227;o para a camada de autentica&#231;&#227;o HttpServlet,
e especificar uma ou mais configura&#231;&#245;es para ela.</p><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Configura&#231;&#227;o.</b></li>
<li><b>Expanda o n&#243; Seguran&#231;a.</b></li>
<li><b>Selecione o n&#243; Seguran&#231;a de Mensagens.</b><p>A p&#225;gina Configura&#231;&#245;es de Seguran&#231;a de Mensagens &#233; exibida.</p></li>
<li><b>Na p&#225;gina Configura&#231;&#245;es de Seguran&#231;a de Mensagens, clique em Novo.</b><p>A p&#225;gina Nova Configura&#231;&#227;o de Seguran&#231;a de Mensagens &#233; exibida.</p></li>
<li><b>Na p&#225;gina Nova Configura&#231;&#227;o de Seguran&#231;a de Mensagens, na lista suspensa Camada
de Autentica&#231;&#227;o, selecione a camada de mensagens para a quar voc&#234; est&#225;
criando uma configura&#231;&#227;o. </b><p>Como uma configura&#231;&#227;o SOAP est&#225; dispon&#237;vel por padr&#227;o, a &#250;nica op&#231;&#227;o &#233;
<tt>HttpServlet</tt>.</p></li>
<li><b>No campo ID do Provedor, digite o identificador exclusivo da configura&#231;&#227;o do
provedor para essa configura&#231;&#227;o de seguran&#231;a de mensagens.</b></li>
<li><b>Marque a caixa de sele&#231;&#227;o Provedor Padr&#227;o para especificar que essa configura&#231;&#227;o
de provedor &#233; o provedor padr&#227;o.</b></li>
<li><b>Na lista suspensa Tipo de Provedor, selecione o tipo deste provedor.</b><p>As op&#231;&#245;es dispon&#237;veis s&#227;o:</p><dl><dt><tt>cliente</tt></dt>
<dd><p>Especifica que o provedor &#233; o provedor de autentica&#231;&#227;o do cliente.</p></dd>
<dt><tt>servidor</tt></dt>
<dd><p>Especifica que o provedor &#233; o provedor de autentica&#231;&#227;o do servidor.</p></dd>
<dt><tt>cliente-servidor</tt></dt>
<dd><p>Especifica que o provedor e um provedor de autentica&#231;&#227;o do cliente e do servidor.</p></dd>
</dl>
</li>
<li><b>No campo Nome da Classe, digite o nome da classe de Implementa&#231;&#227;o
Java do provedor.</b><p>Os provedores de autentica&#231;&#227;o cliente devem implementar a <tt>com.sun.enterprise.security.jauth.ClientAuthModule</tt> da interface. Os
provedores do lado do servidor devem implementar a <tt>com.sun.enterprise.security.jauth.ServerAuthModule</tt> da interface. Os
provedores de cliente-servidor devem implementar as duas interfaces.</p></li>
<li>(Opcional) <b>Na se&#231;&#227;o Propriedades Adicionais, especifique essas propriedades.</b><p>Para adicionar uma propriedade, clique no bot&#227;o Adicionar Propriedade. Na linha em
branco que &#233; exibida, digite o nome da propriedade no campo Nome
e digite o valor da propriedade no campo Valor.</p><p>O Enterprise Server n&#227;o define nenhuma propriedade adicional para configura&#231;&#245;es de seguran&#231;a
de mensagens.</p></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-configmsgsecproviders.html">Para configurar os recursos do Enterprise Server para uso pelos provedores de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityconfigedit.html">Para editar uma configura&#231;&#227;o de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityconfigdelete.html">Para excluir uma configura&#231;&#227;o de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityproviderconfignew.html">Para criar uma configura&#231;&#227;o de provedor de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigedit.html">Para editar uma configura&#231;&#227;o de provedor de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigdelete.html">Para excluir uma configura&#231;&#227;o de provedor de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-enablemesec4appclients.html">Para ativar a seguranda de mensagens para clientes aplicativos</a></p></li></ul>

