<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-accessadmintools"></a><h4>Para dar acesso a ferramentas de administra&#231;&#227;o</h4><p>Somente usu&#225;rios do grupo <tt>asadmin</tt> podem acessar o Console de Administra&#231;&#227;o e
o utilit&#225;rio da linha de comando <tt>asadmin</tt>.  Para dar aos usu&#225;rios
acesso a essas ferramentas de administra&#231;&#227;o, adicione-as ao grupo <tt>asadmin </tt> no <tt>admin-realm</tt>.</p><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Configura&#231;&#227;o.</b></li>
<li><b>Expanda o n&#243; Seguran&#231;a.</b></li>
<li><b>Expanda o n&#243; Dom&#237;nios.</b></li>
<li><b>Selecione o n&#243; <tt>admin-realm</tt>.</b><p>A p&#225;gina Editar Dom&#237;nio &#233; exibida.</p></li>
<li><b>Na p&#225;gina Editar Dom&#237;nio, clique no bot&#227;o Gerenciar Usu&#225;rios.</b><p>A p&#225;gina Usu&#225;rios do Arquivo &#233; exibida.</p><p>Inicialmente, depois da instala&#231;&#227;o, o nome de usu&#225;rio e senha do administrador
inseridos na instala&#231;&#227;o s&#227;o listados em um arquivo chamado <tt>admin-keyfile</tt>.  Por
padr&#227;o, esse usu&#225;rio pertence ao grupo <tt>asadmin</tt>, que d&#225; direitos para modificar
o Enterprise Server.  Atribua usu&#225;rios para esse grupo somente se quiser
dar a eles privil&#233;gios de administrador do Enterprise Server.</p><p>Se voc&#234; adicionar usu&#225;rios ao dom&#237;nio <tt>admin-realm</tt>, mas atribuir o usu&#225;rio a
um grupo diferente do <tt>asadmin</tt>, as informa&#231;&#245;es de usu&#225;rios ainda ser&#227;o gravadas
no arquivo denominado <tt>admin-keyfile</tt>, por&#233;m os usu&#225;rios n&#227;o ter&#227;o acesso &#224;s ferramentas
administrativas ou a aplicativos no dom&#237;nio <tt>file</tt>.</p></li>
<li><b>Na p&#225;gina Usu&#225;rios do Arquivo, clique em Novo, para adicionar um novo
usu&#225;rio ao dom&#237;nio <tt>admin-realm </tt>.</b><p>A p&#225;gina Novo Usu&#225;rio do Dom&#237;nio Arquivo &#233; exibida.</p></li>
<li><b>No campo ID de Usu&#225;rio, digite o nome do novo usu&#225;rio.</b></li>
<li><b>No campo Lista de Grupos, digite os nomes dos grupos aos quais
o usu&#225;rio vai pertencer.</b><p>Para autorizar um usu&#225;rio a fazer modifica&#231;&#245;es no Enterprise Server, inclua o
grupo <tt>asadmin</tt> na  Lista de Grupos.</p></li>
<li><b>Nos campos Nova Senha e Confirmar Nova Senha, digite a senha do
novo usu&#225;rio.</b></li>
<li><b>Clique em OK para adicionar esse usu&#225;rio ao dom&#237;nio <tt>admin-realm</tt> ou clique
em Cancelar para sair sem salvar.</b></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-securitysettings.html">Para definir as configura&#231;&#245;es de seguran&#231;a</a></p></li>
<li><p><a href="task-changeadminpasswd.html">Para alterar a senha de um usu&#225;rio no dom&#237;nio do admin</a></p></li></ul>

