<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-appredeploy"></a><h4>Para reimplantar um aplicativo implantado</h4><p>A reimplanta&#231;&#227;o de um aplicativo implanta uma nova vers&#227;o do aplicativo, embora
preserve as configura&#231;&#245;es e outras op&#231;&#245;es do aplicativo implantado originalmente.</p><h6>Antes de come&#231;ar</h6><p>Verifique se o aplicativo a ser reimplantado j&#225; est&#225; implantado.</p><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, selecione o n&#243; Aplicativos.</b><p>A p&#225;gina Aplicativos &#233; exibida.</p></li>
<li><b>Na tabela Aplicativos Implantados, clique em Reimplantar na linha do aplicativo a
ser reimplantado.</b><p>A p&#225;gina Reimplantar Aplicativos ou M&#243;dulos &#233; exibida.</p></li>
<li><b>Se precisar que sess&#245;es ativas do aplicativo sejam preservadas e ent&#227;o restauradas
ap&#243;s a conclus&#227;o da reimplanta&#231;&#227;o, marque a caixa de sele&#231;&#227;o Manter Sess&#245;es.</b><p>Se alguma sess&#227;o ativa do aplicativo n&#227;o for preservada ou restaurada, <b> nenhuma</b>
das sess&#245;es ser&#225; disponibilizada quando a reimplanta&#231;&#227;o estiver conclu&#237;da.  Entretanto, a
reimplanta&#231;&#227;o continuar&#225; e um aviso ser&#225; registrado em log.</p></li>
<li><b>Especifique o local do arquivo compacto que cont&#233;m o aplicativo a ser
reimplantado.</b><ul>
<li><b>Se o arquivo compacto residir em ou for acessado do computador cliente,
selecione a op&#231;&#227;o Arquivo Empacotador a Ser Carregado no Servidor.</b><p>O computador cliente &#233; o host em que voc&#234; visualiza o Console
de Administra&#231;&#227;o por meio de um navegador.</p><p>Clique em Procurar para localizar o arquivo ou digite o caminho completo
para o arquivo.</p></li>
<li><b>Se o arquivo compacto residir no computador servidor ou se for um
aplicativo n&#227;o empacotado localizado em um diret&#243;rio destacado, selecione a op&#231;&#227;o Arquivo
Empacotado Local ou Diret&#243;rio Acessado no Servidor de Aplicativos.</b><p>O computador servidor &#233; o host que executa o servidor de administra&#231;&#227;o
de dom&#237;nio (DAS). </p><p>Clique em Procurar Arquivos para localizar um arquivo ou clique em Procurar
Pastas para localizar um diret&#243;rio. Como alternativa, digite o caminho completo para
o arquivo ou diret&#243;rio. A implanta&#231;&#227;o a partir de um diret&#243;rio avan&#231;ado
destina-se a desenvolvedores avan&#231;ados e n&#227;o &#233; recomendada para ambientes de produ&#231;&#227;o.</p></li></ul></li>
<li><b>Clique em OK.</b></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-applistdeployed.html">Para exibir uma lista de aplicativos implantados</a></p></li>
<li><p><a href="task-appdeployweb.html">Para implantar um aplicativo da Web</a></p></li>
<li><p><a href="task-deployentapp.html">Para implantar um Aplicativo Empresarial</a></p></li>
<li><p><a href="task-appdeployclient.html">Para implantar um cliente aplicativo</a></p></li>
<li><p><a href="task-appdeployconn.html">Para implantar um m&#243;dulo conector</a></p></li>
<li><p><a href="task-appdeployejb.html">Para implantar um EJB Jar</a></p></li>
<li><p><a href="task-appdeployruby.html">Para implantar um aplicativo Ruby</a></p></li>
<li><p><a href="task-appedit.html">Para editar um aplicativo implantado</a></p></li>
<li><p><a href="task-appviewdesc.html">Para exibir os descritores de um aplicativo</a></p></li>
<li><p><a href="task-applaunch.html">Para iniciar um aplicativo</a></p></li>
<li><p><a href="task-apprestart.html">Para reiniciar um aplicativo implantado</a></p></li></ul>

