<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-uc-addon"></a><h4>Para instalar componentes complementares</h4><p>A instala&#231;&#227;o de um <a href="ref-uc-concepts.html#ref-uc-about-addon">componente complementar</a> envolve as seguintes opera&#231;&#245;es:</p>
<ul><li><p>Transfer&#234;ncia do conte&#250;do do componente e das depend&#234;ncias do componente de um <a href="ref-uc-concepts.html#ref-uc-about-repository"> reposit&#243;rio de rede</a></p></li>
<li><p>Instala&#231;&#227;o do componente da <a href="ref-uc-concepts.html#ref-uc-about-repository">imagem de instala&#231;&#227;o</a> do Enterprise Server no sistema</p></li></ul>
<p>Se um componente precisar de qualquer outro componente ainda n&#227;o instalado, os
componentes necess&#225;rios tamb&#233;m ser&#227;o instalados.</p><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, selecione o n&#243; Ferramenta de Atualiza&#231;&#227;o.</b><p>&#201; aberta a p&#225;gina Complementos Dispon&#237;veis.</p></li>
<li><b>Na p&#225;gina Complementos Dispon&#237;veis, na tabela de componentes complementares dispon&#237;veis, selecione os
componentes que est&#227;o sendo instalados.</b><p>Se n&#227;o houver componentes complementares dispon&#237;veis, a tabela estar&#225; vazia.</p><ul>
<li><b>Para selecionar um componente individual, marque a caixa de sele&#231;&#227;o adjacente ao
nome do componente.</b></li>
<li><b>Para selecionar todos os componentes, clique no &#237;cone Selecionar Todos, no cabe&#231;alho
da tabela.</b></li>
<li><b>Para desmarcar todos os componentes, clique no &#237;cone Selecionar Todos, no cabe&#231;alho
da tabela Desmarcar Tudo.</b></li></ul></li>
<li><b>Clique em Instalar.</b><p>Uma caixa de di&#225;logo pede que voc&#234; confirme se devem ser instalados
os componentes selecionados e qualquer outro componente necess&#225;rio.</p></li>
<li><b>Na caixa de di&#225;logo, clique em OK.</b><p>Voc&#234; &#233; solicitado a aceitar os contratos de licen&#231;a dos componentes que
estiver instalando.</p></li>
<li><b>Aceite os contratos de licen&#231;a dos componentes que est&#225; instalando.</b><p>O Enterprise Server confirma que a instala&#231;&#227;o est&#225; conclu&#237;da.  Os componentes
s&#227;o removidos da tabela de componentes complementares e adicionados &#224; tabela de
componentes instalados na p&#225;gina Componentes Instalados. </p></li>
<li><b>Reinicie o servidor.</b><p>Para obter instru&#231;&#245;es detalhadas, consulte a seguinte documenta&#231;&#227;o:</p>
<ul><li><p><a href="http://docs.sun.com/doc/820-7692/ggoch?a=view">To Stop a Domain no <i>Sun GlassFish Enterprise Server v3 Administration Guide </i></a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7692/ggoda?a=view">To Start a Domain no <i>Sun GlassFish Enterprise Server v3 Administration Guide </i></a></p></li></ul>
</li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-uc-set-proxy.html">Para definir configura&#231;&#245;es de proxy de rede para acessar reposit&#243;rios de rede</a></p></li>
<li><p><a href="task-uc-update.html">Para instalar atualiza&#231;&#245;es de componentes </a></p></li>
<li><p><a href="task-uc-installed-remove.html">Para desinstalar componentes</a></p></li>
<li><p><a href="task-uc-pkgdetails.html">Para exibir informa&#231;&#245;es detalhadas sobre um componente</a></p></li></ul>

