<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-eelogginglevels"></a><h4>Para configurar n&#237;veis de log</h4><a name="indexterm-20"></a><a name="indexterm-21"></a><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Configura&#231;&#227;o.</b></li>
<li><b>Sob o n&#243; Configura&#231;&#227;o, selecione o n&#243; Configura&#231;&#245;es do Agente de Log.</b><p>A p&#225;gina Configura&#231;&#245;es do Agente de Log.</p></li>
<li><b>Na p&#225;gina Configura&#231;&#245;es do Agente de Log, clique na guia N&#237;veis de
Log.</b><p>A p&#225;gina N&#237;veis de Log do M&#243;dulo &#233; exibida.</p></li>
<li><b>Na p&#225;gina N&#237;veis de Log do M&#243;dulo, altere os n&#237;veis de log
de um ou mais m&#243;dulos, como a seguir.</b><ul>
<li><b>Para alterar o n&#237;vel de log de um m&#243;dulo individual, selecione um
novo valor da lista suspensa, oposta ao m&#243;dulo cujo n&#237;vel de log
voc&#234; deseja alterar.</b></li>
<li><b>Para alterar o n&#237;vel de log de um grupo de m&#243;dulos:</b><ol style="list-style-type: lower-alpha">
<li><b>Marque as caixas de sele&#231;&#227;o pr&#243;ximas aos nomes dos m&#243;dulos cujos n&#237;veis
de log voc&#234; deseja alterar.</b></li>
<li><b>Selecione um valor na lista suspensa na parte superior da tabela.</b></li>
<li><b>Clique no bot&#227;o Alterar N&#237;vel.</b></li></ol></li></ul><p>As mensagens do n&#237;vel selecionado ou superiores aparecer&#227;o no log. Escolha qualquer
um dos valores a seguir (listados do maior para o menor).</p>
<ul><li><p><tt>SEVERE</tt></p></li>
<li><p><tt>WARNING</tt></p></li>
<li><p><tt>INFO</tt></p></li>
<li><p><tt>CONFIG</tt></p></li>
<li><p><tt>FINE</tt></p></li>
<li><p><tt>FINER</tt></p></li>
<li><p><tt>FINEST</tt></p></li>
<li><p><tt>OFF</tt></p></li></ul>
<p>Para obter os detalhes sobre os significados dos n&#237;veis de log, consulte
<a href="ref-eelogginglevels.html">N&#237;veis de Log de M&#243;dulo</a>. O n&#237;vel padr&#227;o &#233; <tt>INFO</tt>, portanto, por padr&#227;o, o log conter&#225;
as mensagens dos n&#237;veis <tt> INFO</tt>, <tt>WARNING</tt> ou <tt>SEVERE</tt>.</p></li>
<li><b>Clique em Salvar.</b><p>As altera&#231;&#245;es das configura&#231;&#245;es do N&#237;vel de Log t&#234;m efeito imediato. Elas
tamb&#233;m s&#227;o salvas para uso quando o servidor &#233; reiniciado.</p></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-eelogging.html">Para Definir as configura&#231;&#245;es gerais de log</a></p></li>
<li><p><a href="task-logviewer.html">Para exibir o log do servidor</a></p></li></ul>

