<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-messagesecurityproviderconfignew"></a><h4>Para criar uma configura&#231;&#227;o de provedor de seguran&#231;a de mensagens</h4><p>Para criar uma nova configura&#231;&#227;o de provedor de seguran&#231;a de mensagens, siga
estas etapas:</p><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Configura&#231;&#227;o.</b></li>
<li><b>Expanda o n&#243; Seguran&#231;a.</b></li>
<li><b>Selecione o n&#243; Seguran&#231;a de Mensagens.</b><p>A p&#225;gina Configura&#231;&#245;es de Seguran&#231;a de Mensagens &#233; exibida.</p></li>
<li><b>Na p&#225;gina Configura&#231;&#245;es de Seguran&#231;a de Mensagens, clique no nome da Camada
de Autentica&#231;&#227;o da configura&#231;&#227;o que voc&#234; est&#225; editando.</b><p>Por padr&#227;o, a &#250;nica configura&#231;&#227;o de seguran&#231;a de mensagens definida &#233; SOAP.</p><p>A p&#225;gina Editar Configura&#231;&#227;o de Seguran&#231;a de Mensagens &#233; exibida.</p></li>
<li><b>Clique na guia Provedores.</b><p>A p&#225;gina Configura&#231;&#245;es do Provedor &#233; exibida.</p></li>
<li><b>Na p&#225;gina Configura&#231;&#245;es do Provedor, clique em Novo.</b><p>A p&#225;gina Nova Configura&#231;&#227;o do Provedor &#233; exibida.</p></li>
<li><b>Na p&#225;gina Nova Configura&#231;&#227;o do Provedor, no campo ID do Provedor, digite
um nome exclusivo para a configura&#231;&#227;o do provedor.</b></li>
<li><b>Marque a caixa de sele&#231;&#227;o do Provedor Padr&#227;o para tornar esse provedor
o provedor padr&#227;o.</b><p>O provedor padr&#227;o ser&#225; chamado para qualquer aplicativo que n&#227;o identifique um
provedor espec&#237;fico. Se o provedor for o provedor de cliente padr&#227;o, o
provedor de servidor padr&#227;o, ou de ambos, &#233; determinado pelo Tipo de
Provedor.</p></li>
<li><b>Na lista suspensa Tipo de Provedor, selecione o tipo de provedor.</b><p>As op&#231;&#245;es dispon&#237;veis s&#227;o:</p><dl><dt><tt>cliente</tt></dt>
<dd><p>Especifica que o provedor &#233; o provedor de autentica&#231;&#227;o do cliente.</p></dd>
<dt><tt>servidor</tt></dt>
<dd><p>Especifica que o provedor &#233; o provedor de autentica&#231;&#227;o do servidor.</p></dd>
<dt><tt>cliente-servidor</tt></dt>
<dd><p>Especifica que o provedor e um provedor de autentica&#231;&#227;o do cliente e do servidor.</p></dd>
</dl>
</li>
<li><b>No campo Nome da Classe, digite o nome da classe de Implementa&#231;&#227;o
Java do provedor.</b><p>Os provedores de autentica&#231;&#227;o cliente devem implementar a <tt>com.sun.enterprise.security.jauth.ClientAuthModule</tt> da interface. Os
provedores do lado do servidor devem implementar a <tt>com.sun.enterprise.security.jauth.ServerAuthModule</tt> da interface. Os
provedores de cliente-servidor devem implementar as duas interfaces.</p></li>
<li><b>Na &#225;rea Diretiva de Solicita&#231;&#227;o, da lista Autenticar Fonte, selecione o tipo
da autentica&#231;&#227;o exigida para a diretiva de solicita&#231;&#227;o.</b><p>A diretiva de solicita&#231;&#227;o determina o processamento da solicita&#231;&#227;o que o provedor
de autentica&#231;&#227;o realiza. Os campos da diretiva de solicita&#231;&#227;o s&#227;o opcionais, mas
se eles n&#227;o forem especificados, o provedor de autentica&#231;&#227;o n&#227;o autentica as
mensagens solicitadas.</p><p>Selecione <tt>remetente</tt> para especificar a autentica&#231;&#227;o do remetente da camada de mensagens
(por exemplo, nome de usu&#225;rio e senha) das mensagens solicitadas. Selecione <tt>conte&#250;do </tt>
para especificar autentica&#231;&#227;o de conte&#250;do (por exemplo, assinatura digital) das mensagens solicitadas.
Deixe o campo vazio para n&#227;o autenticar a fonte das solicita&#231;&#245;es. Por
padr&#227;o, nenhum tipo de autentica&#231;&#227;o &#233; selecionado.</p><p>Para uma descri&#231;&#227;o das a&#231;&#245;es realizadas pelos provedores de seguran&#231;a de mensagens
SOAP, consulte <a href="ref-configreq-respolicy.html">Configura&#231;&#245;es da Diretiva de Solicita&#231;&#227;o e Resposta</a>.</p></li>
<li><b>Na lista suspensa Autenticar Destinat&#225;rio, selecione se a autentica&#231;&#227;o de destinat&#225;rio ocorre
antes ou depois da autentica&#231;&#227;o de conte&#250;do da diretiva de solicita&#231;&#227;o.</b><p>Selecione <tt>before-content</tt> ou <tt>after-content</tt> para solicitar autentica&#231;&#227;o de camada-mensagem do destinat&#225;rio da
mensagem solicitada ao seu remetente (por criptografia XML). Se o valor n&#227;o
for especificado, o padr&#227;o ser&#225; <tt>after-content</tt>. As diretivas s&#227;o expressas no pedido
do remetente da mensagem, portanto <tt>after-content</tt> significa que o destinat&#225;rio da mensagem
descriptografa a mensagem antes de validar a assinatura.</p></li>
<li><b>Na &#225;rea Diretiva de Solicita&#231;&#227;o, da lista Autenticar Fonte, selecione o tipo
da autentica&#231;&#227;o exigida para a diretiva de solicita&#231;&#227;o.</b><p>A diretiva de resposta determina o processamento da resposta que o provedor
de autentica&#231;&#227;o realiza. Os campos da diretiva de resposta s&#227;o opcionais, mas
se eles n&#227;o forem especificados, nenhuma autentica&#231;&#227;o ser&#225; aplicada &#224;s mensagens de
resposta.</p><p>Selecione <tt>remetente</tt> para especificar a autentica&#231;&#227;o do remetente da camada de mensagens
(por exemplo, nome de usu&#225;rio e senha) das mensagens de resposta. Selecione
<tt>conte&#250;do </tt> para especificar autentica&#231;&#227;o de conte&#250;do (por exemplo, assinatura digital) das mensagens
de resposta. Deixe o campo em branco para n&#227;o autenticar as fontes
de resposta. Por padr&#227;o, nenhum tipo de autentica&#231;&#227;o &#233; selecionado.</p><p>Para uma descri&#231;&#227;o das a&#231;&#245;es realizadas pelos provedores de seguran&#231;a de mensagens
SOAP, consulte <a href="ref-configreq-respolicy.html">Configura&#231;&#245;es da Diretiva de Solicita&#231;&#227;o e Resposta</a>.</p></li>
<li><b>Na lista suspensa Autenticar Destinat&#225;rio, selecione se a autentica&#231;&#227;o de destinat&#225;rio ocorre
antes ou depois da autentica&#231;&#227;o de conte&#250;do da diretiva de resposta.</b><p>Selecione <tt>before-content</tt> ou <tt>after-content</tt> para definir a autentica&#231;&#227;o de camada-mensagem do destinat&#225;rio
da mensagem de resposta ao seu remetente (por criptografia XML). Se o
valor n&#227;o for especificado, o padr&#227;o ser&#225; <tt>after-content</tt>. As diretivas s&#227;o expressas
no pedido do remetente da mensagem, portanto <tt>after-content</tt> significa que o destinat&#225;rio
da mensagem descriptografa a mensagem antes de validar a assinatura.</p></li>
<li>(Opcional) <b>Na se&#231;&#227;o Propriedades Adicionais, especifique essas propriedades.</b><p>Para adicionar uma propriedade, clique no bot&#227;o Adicionar Propriedade. Na linha em
branco que &#233; exibida, digite o nome da propriedade no campo Nome
e digite o valor da propriedade no campo Valor.</p><p>Para uma descri&#231;&#227;o das propriedades adicionais dispon&#237;veis para configura&#231;&#245;es do provedor, consulte
<a href="ref-messagesecurityproviderconfigprops.html">Propriedades Espec&#237;ficas das Configura&#231;&#245;es do Provedor de Seguran&#231;a de Mensagens</a>.</p></li>
<li><b>Clique em OK.</b></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-configmsgsecproviders.html">Para configurar os recursos do Enterprise Server para uso pelos provedores de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityconfignew.html">Para criar uma configura&#231;&#227;o de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityconfigedit.html">Para editar uma configura&#231;&#227;o de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityconfigdelete.html">Para excluir uma configura&#231;&#227;o de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigedit.html">Para editar uma configura&#231;&#227;o de provedor de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigdelete.html">Para excluir uma configura&#231;&#227;o de provedor de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-enablemesec4appclients.html">Para ativar a seguranda de mensagens para clientes aplicativos</a></p></li></ul>

