<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-auditmodulenew"></a><h4>Para criar um m&#243;dulo de auditoria</h4><p>A auditoria &#233; como o Enterprise Server grava eventos significativos, como erros
ou vulnerabilidades de seguran&#231;a. O Enterprise Server registra todos os eventos de
autentica&#231;&#227;o em arquivos de log.  Um log de acesso completo fornece
uma pista sequencial dos eventos de acesso do Enterprise Server.</p><p>O Enterprise Server fornece um m&#243;dulo de auditoria padr&#227;o, que &#233; nem
simples. Para obter mais informa&#231;&#245;es, consulte <a href="task-usedefaultauditmod.html">Para usar o m&#243;dulo de auditoria padr&#227;o</a> .</p><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Configura&#231;&#227;o.</b></li>
<li><b>Sob o n&#243; Configura&#231;&#227;o, expanda o n&#243; Seguran&#231;a.</b></li>
<li><b>Sob o n&#243; Seguran&#231;a, selecione o n&#243; M&#243;dulos de Auditoria.</b><p>A p&#225;gina M&#243;dulos de Auditoria &#233; exibida.</p></li>
<li><b>Na p&#225;gina M&#243;dulos de Auditoria, clique em Novo.</b><p>A p&#225;gina Novo M&#243;dulo de Auditoria &#233; exibida.</p></li>
<li><b>Na p&#225;gina Novo M&#243;dulo de Auditoria, no campo Nome, digite o nome
do m&#243;dulo de auditoria. </b></li>
<li><b>No campo Nome da Classe, digite o nome totalmente qualificado da classe
que implementa esse m&#243;dulo.</b><p>O nome da classe do m&#243;dulo de auditoria padr&#227;o &#233; <tt>com.sun.enterprise.security.Audit </tt>.</p></li>
<li>(Opcional) <b>Na se&#231;&#227;o Propriedades Adicionais, especifique essas propriedades.</b><p>Para adicionar uma propriedade, clique no bot&#227;o Adicionar Propriedade. Na linha em
branco que &#233; exibida, digite o nome da propriedade no campo Nome
e digite o valor da propriedade no campo Valor.</p><p>Para uma descri&#231;&#227;o da propriedade adicional que est&#225; dispon&#237;vel para m&#243;dulos de
auditoria, consulte <a href="ref-auditmoduleprop.html">Propriedades Espec&#237;ficas de M&#243;dulos de Auditoria</a>.</p></li>
<li><b>Clique em OK.</b></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-auditmoduleedit.html">Para editar um m&#243;dulo de auditoria</a></p></li>
<li><p><a href="task-auditmoduledelete.html">Para excluir um m&#243;dulo de auditoria</a></p></li>
<li><p><a href="task-enabledisableauditmod.html">Para ativar ou desativar logs de auditoria</a></p></li>
<li><p><a href="task-setactiveauditmod.html">Para definir o m&#243;dulo de auditoria ativo</a></p></li>
<li><p><a href="task-usedefaultauditmod.html">Para usar o m&#243;dulo de auditoria padr&#227;o</a></p></li></ul>

