<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jaccprovideredit"></a><h4>Para editar um provedor de JACC</h4><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Configura&#231;&#227;o.</b></li>
<li><b>Sob o n&#243; Configura&#231;&#227;o, expanda o n&#243; Seguran&#231;a.</b></li>
<li><b>Sob o n&#243; Seguran&#231;a, selecione o n&#243; Provedores de JACC.</b><p>A p&#225;gina Provedores de JACC &#233; exibida.</p></li>
<li><b>Na p&#225;gina Provedores de JACC, clique no nome do provedor de JACC
a ser editado.</b><p>A p&#225;gina Editar Provedor de JACC &#233; exibida.</p></li>
<li><b>Na p&#225;gina Editar Provedor de JACC, no campo Configura&#231;&#227;o da Diretiva, digite
o nome da classe que implementa a f&#225;brica de configura&#231;&#227;o da diretiva.</b></li>
<li><b>No campo Provedor de Diretiva, digite o nome da classe que implementa
a f&#225;brica de diretivas.</b></li>
<li>(Opcional) <b>Na se&#231;&#227;o Propriedades Adicionais, especifique essas propriedades.</b><p>Para obter uma descri&#231;&#227;o das propriedades adicionais dispon&#237;veis para provedores de JACC,
consulte <a href="ref-jaccproviderprop.html">Propriedades espec&#237;ficas de provedores de JACC</a>.</p><ul>
<li><b>Para adicionar uma propriedade, clique no bot&#227;o Adicionar Propriedade. Na linha em
branco que &#233; exibida, digite o nome da propriedade no campo Nome
e digite o valor da propriedade no campo Valor.</b></li>
<li><b>Para modificar uma propriedade, edite o campo Valor da propriedade.</b></li>
<li><b>Para excluir uma propriedade, marque a caixa de sele&#231;&#227;o &#224; esquerda do
campo Nome da propriedade a ser exclu&#237;da. Clique no bot&#227;o Excluir Propriedades.</b></li></ul></li>
<li><b>Clique em Salvar.</b>
<hr><p><b>Dica - </b>Para restaurar as configura&#231;&#245;es padr&#227;o, clique no bot&#227;o Carregar Padr&#245;es e depois
em Salvar. </p>
<hr>
</li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-jaccprovidernew.html">Para criar um provedor de JACC</a></p></li>
<li><p><a href="task-jaccproviderdelete.html">Para excluir um Provedor de JACC</a></p></li>
<li><p><a href="task-setactivejaccprov.html">Para definir o Provedor de JACC ativo</a></p></li></ul>

