<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-logviewer"></a><h4>Para exibir o log do servidor</h4><a name="indexterm-6"></a><a name="indexterm-7"></a><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, selecione o n&#243; Enterprise Server.</b><p>A p&#225;gina Informa&#231;&#245;es Gerais &#233; exibida.</p></li>
<li><b>Na p&#225;gina Informa&#231;&#245;es Gerais, clique no bot&#227;o Exibir Arquivos de Log.</b><p>A janela Visualizador de Logs &#233; exibida.</p></li>
<li><b>Use a &#225;rea Crit&#233;rios de Pesquisa para personalizar e filtrar o visualizador
de logs.</b><ul>
<li><b>Clique em Pesquisa Avan&#231;ada na &#225;rea Crit&#233;rios de Pesquisa para fazer ajustes
adicionais ao visualizador de logs.</b></li>
<li><b>No campo Carimbo de Hora:</b><ul>
<li><b>Para exibir as mensagens mais recentes, selecione Mais Recente (o padr&#227;o).</b></li>
<li><b>Para exibir as mensagens apenas de um determinado per&#237;odo de tempo, selecione
Intervalo Espec&#237;fico e digite os valores de data e hora nos campos
De e Para que aparecem.</b><p>Para o valor Hora, a sintaxe deve ter a seguinte forma (<b>SSS</b>
significa milissegundos):</p><pre><b>hh</b>:<b>mm</b>:<b>ss</b>.<b>SSS</b></pre><p>Por exemplo:</p><pre>17:10:00.000</pre><p>se o valor De for posterior ao valor Para, aparecer&#225; uma mensagem
de erro.</p></li></ul></li>
<li><b>Na lista suspensa N&#237;vel de Log, selecione um n&#237;vel de log para
filtrar mensagens por n&#237;vel de log. Marque a caixa de sele&#231;&#227;o rotulada
&#8220;N&#227;o incluir mais mensagens graves&#8221; para exibir mensagens apenas no n&#237;vel escolhido</b><p>Por padr&#227;o, a exibi&#231;&#227;o inclui todas as mensagens que aparecem no log
do servidor, no n&#237;vel de log escolhido e nos n&#237;veis mais graves.</p><p>Para assegurar que as mensagens que voc&#234; deseja exibir apare&#231;am no log
do servidor, primeiro defina os n&#237;veis de log apropriados na p&#225;gina N&#237;veis
de Log do M&#243;dulo. Ver <a href="task-eelogginglevels.html">Para configurar n&#237;veis de log</a></p><p>Se voc&#234; escolher filtrar as mensagens de log com base no n&#237;vel
de log, apenas as mensagens que correspondem aos crit&#233;rios de filtro espec&#237;ficos
ser&#227;o mostradas. Contudo, essa filtragem n&#227;o afeta quais mensagens s&#227;o registradas no
log do servidor.</p></li></ul></li>
<li><b>Se voc&#234; clicou na Pesquisa Avan&#231;ada na &#225;rea Crit&#233;rios de pesquisa, realize
estas etapas.</b><ol style="list-style-type: lower-alpha">
<li><b>Na lista suspensa Agente de Log, selecione um ou mais espa&#231;os para
nome para filtrar por m&#243;dulo.</b><p>Use shift-clique ou control-clique para escolher m&#250;ltiplos espa&#231;os para nomes.</p><p>Selecionar um espa&#231;o para nomes em um n&#237;vel mais elevado seleciona todos
os espa&#231;os para nomes abaixo dele. Por exemplo, selecionar <tt>javax.enterprise.system</tt> tamb&#233;m seleciona
os agentes de log de todos os m&#243;dulos naquele espa&#231;o para nomes:
<tt>javax.enterprise.system.core </tt>, <tt>javax.enterprise.system.tools.admin</tt> e assim por diante.</p></li>
<li><b>No campo Agente de Log Personalizado, digite os nomes dos agentes de
log, um por linha, para exibir mensagens de agentes de log espec&#237;ficos
em um determinado aplicativo.</b><p>Se o aplicativo tiver diversos m&#243;dulos, voc&#234; poder&#225; exibir qualquer um deles.
Por exemplo, suponha que o aplicativo tenha agentes de log com os
seguintes nomes:</p><pre>com.mycompany.myapp.module1
com.mycompany.myapp.module2
com.mycompany.myapp.module3</pre><p>Para exibir as mensagens de todos os m&#243;dulos no aplicativo, digite <tt>com.mycompany.myapp </tt>.
Para exibir apenas mensagens do <tt>module2</tt>, digite <tt> com.mycompany.myapp.module2</tt>.</p><p>Quando voc&#234; especifica um ou mais agentes de logs, as mensagens dos
m&#243;dulos do Enterprise Server aparecem apenas se voc&#234; as especificar explicitamente na
&#225;rea do Agente de Log.</p></li>
<li><b>No campo Pares nome-valor, digite o nome e o valor da chave
daquele segmento para exibir a sa&#237;da de um segmento espec&#237;fico.</b><p>O nome da chave &#233; <tt>_ThreadID</tt>. Por exemplo:</p><pre>_ThreadID=13</pre><p>Suponha que <tt>com.mycompany.myapp.module2</tt> &#233; executado em diversos segmentos. Para refinar o visualizador
de logs para mostrar apenas a sa&#237;da de um &#250;nico segmento, especifique
agente de log daquele m&#243;dulo no campo Agente de Log Personalizado e
especifique o ID do segmento neste campo.</p></li>
<li><b>Na lista suspensa Exibir, selecione um valor para exibir esse n&#250;mero de
mensagens por vez.</b><p>O n&#250;mero padr&#227;o de mensagens exibidas &#233; 40. Outras op&#231;&#245;es s&#227;o 100,
250 e 1.000.</p><p>Para exibir os rastreamentos de pilha, desmarque a caixa de sele&#231;&#227;o &#8220;Limitar
mensagens excessivamente longas&#8221;. Por padr&#227;o, os rastreamentos de pilha n&#227;o aparecem no
visualizador; para exibi-las, clique no link <tt>(detalhes)</tt> para obter uma mensagem.</p></li>
<li><b>Clique em Pesquisa B&#225;sica para ocultar a &#225;rea Op&#231;&#245;es Avan&#231;adas.</b></li></ol></li>
<li><b>Na &#225;rea Resultados da Pesquisa, personalize a exibi&#231;&#227;o das mensagens de log.</b><p>A &#225;rea Resultados da Pesquisa exibe as 40 entradas mais recentes no
log do servidor, com as configura&#231;&#245;es especificadas nas p&#225;ginas Configura&#231;&#245;es de Log
e N&#237;veis de Log.</p><ul>
<li><b>Clique nas setas nas colunas para classificar as mensagens de formas diferentes.</b></li>
<li><b>Clique no link rotulado <tt>(detalhes)</tt> para exibir uma vers&#227;o formatada de qualquer
mensagem.</b><p>Uma janela rotulada Detalhes da Entrada de Log &#233; exibida, com uma
vers&#227;o formatada da mensagem.</p></li>
<li><b>Clique nos bot&#245;es na parte superior e inferior da tabela para exibir
as entradas mais antigas ou mais recentes do arquivo de log.</b></li></ul></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-eelogging.html">Para Definir as configura&#231;&#245;es gerais de log</a></p></li>
<li><p><a href="task-eelogginglevels.html">Para configurar n&#237;veis de log</a></p></li>
<li><p><a href="task-generaltab.html">Para Exibir Informa&#231;&#245;es Gerais do Enterprise Server</a></p></li>
<li><p><a href="task-setadvanceappconfig.html">Para definir a configura&#231;&#227;o dos aplicativos avan&#231;ados</a></p></li>
<li><p><a href="task-setadvancedomainattributes.html">Para definir os atributos de dom&#237;nio avan&#231;ados</a></p></li>
<li><p><a href="task-setadminpassword.html">Para alterar a Senha do Administrador</a></p></li>
<li><p><a href="task-systemproperties.html">Para gerenciar propriedades do sistema</a></p></li>
<li><p><a href="task-appmonitoringdata.html">Para exibir dados de monitoramento do aplicativo</a></p></li>
<li><p><a href="task-servermonitoringdata.html">Para exibir dados de monitoramento do servidor</a></p></li></ul>

