<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jvmsettings"></a><h4>Para configurar as defini&#231;&#245;es gerais de JVM</h4><p>A Java<sup>TM</sup> Virtual Machine (JVM) permite que c&#243;digos de bytes Java sejam
executados em um computador f&#237;sico.  O ajuste das configura&#231;&#245;es de JVM
melhora o desempenho e evita erros de aloca&#231;&#227;o de mem&#243;ria.</p><p>O Java Virtual Machine est&#225; inclu&#237;do no Java Platform, Standard Edition (plataforma
Java SE), que &#233; exigido pelo Enterprise Server.  Configura&#231;&#245;es de JVM
incorretas impedir&#227;o que o servidor seja executado, portanto, tenha cuidado ao alterar
essas configura&#231;&#245;es.</p>
<hr><p><b>Observa&#231;&#227;o - </b>Os termos &#8220;Java Virtual Machine&#8221; e &#8220;JVM&#8221; significam uma M&#225;quina Virtual para
a plataforma Java.</p>
<hr>
<ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, selecione o n&#243; Configura&#231;&#227;o.</b></li>
<li><b>Sob o n&#243; Configura&#231;&#227;o, selecione o n&#243; Configura&#231;&#245;es de JVM.</b><p>A p&#225;gina Configura&#231;&#245;es Gerais de JVM &#233; exibida.</p></li>
<li><b>Na p&#225;gina Configura&#231;&#245;es Gerais de JVM, no campo Java Home, digite o
nome do diret&#243;rio de instala&#231;&#227;o do software Java SE.</b><p>O Enterprise Server depende da plataforma Java SE.  Para verificar se
a vers&#227;o do software Java SE especificada &#233; compat&#237;vel com esta vers&#227;o,
consulte <a href="http://docs.sun.com/doc/820-7688"><i>Sun GlassFish Enterprise Server v3 Preview Release Notes </i></a>.  Se voc&#234; especificar um nome de diret&#243;rio inexistente ou
se a vers&#227;o do diret&#243;rio n&#227;o for compat&#237;vel com o software Java
SE, o Enterprise Server n&#227;o ser&#225; iniciado.</p></li>
<li><b>No campo Op&#231;&#245;es Javac, digite as op&#231;&#245;es de linha de comando para
o compilador de linguagem de programa&#231;&#227;o Java.</b><p>O Enterprise Server executa o compilador quando os componentes Enterprise JavaBeans <sup>TM</sup> (EJB<sup>TM</sup>) s&#227;o
implantados.</p></li>
<li><b>Marque a caixa de sele&#231;&#227;o Depura&#231;&#227;o Ativada para ativar a depura&#231;&#227;o com
o Java Platform Debugger Architecture (JPDA).</b><p>O JPDA &#233; utilizado pelos desenvolvedores de aplicativos. Para obter mais informa&#231;&#245;es,
consulte <a href="http://docs.sun.com/doc/820-7695"><i>Sun GlassFish Enterprise Server v3 Preview Application Development Guide </i></a>.</p></li>
<li><b>No campo Op&#231;&#245;es de Depura&#231;&#227;o, digite as op&#231;&#245;es do JPDA a serem
transmitidas para o JVM.</b><p>Esse campo s&#243; ser&#225; aplic&#225;vel se a depura&#231;&#227;o tiver sido ativada na
etapa precedente.</p></li>
<li><b>No campo Op&#231;&#245;es de Compila&#231;&#227;o RMI, digite as op&#231;&#245;es de linha de
comando para o compilador <tt>rmic</tt>.</b><p>O Enterprise Server executa o compilador <tt>rmic</tt> quando os componentes EJB s&#227;o
implantados.</p></li>
<li><b>No campo Pr&#233;-processador de C&#243;digo de Byte, digite uma lista de nomes
de classes.</b><p>Use v&#237;rgulas para separar os nomes de classes. Cada classe deve implementar
a interface com.sun.appserv.BytecodePreprocessor .  As classes s&#227;o chamadas na ordem especificada.</p></li>
<li>(Opcional) <b>Na se&#231;&#227;o Propriedades Adicionais, especifique essas propriedades.</b><p>Para adicionar uma propriedade, clique no bot&#227;o Adicionar Propriedade. Na linha em
branco que &#233; exibida, digite o nome da propriedade no campo Nome
e digite o valor da propriedade no campo Valor.</p><p>O Enterprise Server n&#227;o define propriedades adicionais para o JVM.</p></li>
<li><b>Clique em Salvar.</b></li>
<li><b>Reinicie o servidor.</b></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-jvmpathsettings.html">Para configurar as defini&#231;&#245;es de caminho de JVM</a></p></li>
<li><p><a href="task-jvmoptions.html">Para configurar as op&#231;&#245;es de JVM</a></p></li>
<li><p><a href="task-securitymanagerdisable.html">Para desativar o gerenciador de seguran&#231;a</a></p></li>
<li><p><a href="task-jvmprofilersettings.html">Para configurar as defini&#231;&#245;es do gerador de perfil do JVM</a></p></li></ul>

