<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-enablemesec4appclients"></a><h4>Para ativar a seguranda de mensagens para clientes aplicativos</h4><p>Os provedores clientes devem ter as mesmas diretivas de prote&#231;&#227;o de mensagens
que os provedores do lado do servidor com que eles interagem. Esse
j&#225; &#233; o caso dos provedores configurados (mas n&#227;o ativados) quando o
Enterprise Server &#233; instalado.</p><p>Para ativar a seguran&#231;a de mensagens para aplicativos cliente, modifique a configura&#231;&#227;o
espec&#237;fica do Enterprise Server para o recipiente cliente aplicativo. </p><ol>
<li><b>Interrompa quaisquer aplicativos cliente que dependam do descritor do recipiente cliente.</b></li>
<li><b>Em um editor de texto, abra o descritor do recipiente cliente aplicativo
da Sun, localizado em <i>domain-dir</i><tt>/config/sun-acc.xml.</tt></b></li>
<li><b>Para ativar o provedor do cliente padr&#227;o no cliente aplicativo, adicione o
atributo <tt>default-client-provider</tt> ao elemento, ao elemento <tt>message-security-config</tt>. </b><p>O c&#243;digo ao redor &#233; mostrado para contexto e pode diferir ligeiramente
em sua instala&#231;&#227;o. N&#227;o o altere.</p><pre>&#60;client-container>
  &#60;target-server name="<i>your-host</i>" address="<i>your-host</i>"
      port="<i>your-port</i>"/>
  &#60;log-service file="" level="WARNING"/>
  &#60;message-security-config auth-layer="SOAP"
      <b>default-client-provider="ClientProvider"</b>>
    &#60;provider-config
        class-name="com.sun.enterprise.security.jauth.ClientAuthModule"
        provider-id="ClientProvider" provider-type="client">
      &#60;request-policy auth-source="sender"/>
      &#60;response-policy/>
        &#60;property name="security.config"
          value="C:/Sun/AppServer/lib/appclient/wss-client-config.xml"/>
    &#60;/provider-config>
  &#60;/message-security-config>
&#60;/client-container></pre><p>O provedor de seguran&#231;a de mensagens configurado no recipiente cliente deve ter
acesso a chaves particulares e a certificados confi&#225;veis. Para fornecer-lhe acesso, defina
os valores das propriedades do sistema a seguir no script de inicializa&#231;&#227;o
do cliente aplicativo:</p><pre>-Djavax.net.ssl.keyStore</pre><pre>-Djavax.net.ssl.trustStore</pre></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-configmsgsecproviders.html">Para configurar os recursos do Enterprise Server para uso pelos provedores de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityconfignew.html">Para criar uma configura&#231;&#227;o de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityconfigedit.html">Para editar uma configura&#231;&#227;o de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityconfigdelete.html">Para excluir uma configura&#231;&#227;o de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityproviderconfignew.html">Para criar uma configura&#231;&#227;o de provedor de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigedit.html">Para editar uma configura&#231;&#227;o de provedor de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigdelete.html">Para excluir uma configura&#231;&#227;o de provedor de seguran&#231;a de mensagens</a></p></li></ul>

