<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-register"></a><h4>Para registrar o Sun GlassFish Enterprise Server com conex&#227;o Sun</h4><a name="indexterm-1"></a><a name="indexterm-2"></a><a name="indexterm-3"></a><p>Como usu&#225;rio registrado do Sun GlassFish<sup>TM</sup> Enterprise Server, voc&#234; recebe benef&#237;cios, como:</p>
<ul><li><p>Informa&#231;&#245;es sobre patches e atualiza&#231;&#245;es de bugs</p></li>
<li><p>Capturas de v&#237;deo e tutoriais</p></li>
<li><p>Not&#237;cias e eventos</p></li>
<li><p>Ofertas de suporte e treinamento</p></li></ul>
<p>Para registrar sua instala&#231;&#227;o de Sun GlassFish Enterprise Server na <a href="http://www.sun.com/service/sunconnection/index.jsp">Sun Connection </a>, &#233;
preciso ter uma <a href="https://reg.sun.com/whyregister">Conta Sun Online</a>.  Caso voc&#234; n&#227;o tenha uma Conta Sun
Online, o Enterprise Server permitir&#225; a cria&#231;&#227;o de uma conta durante o
registro.</p>
<hr><p><b>Observa&#231;&#227;o - </b>Se criar uma Conta Sun Online ao registrar o Enterprise Server, voc&#234;
ser&#225; solicitado a fornecer apenas as informa&#231;&#245;es obrigat&#243;rias.  Depois de registrar
o Enterprise Server, forne&#231;a outras informa&#231;&#245;es pelo <a href="https://reg.sun.com/updateaccount">, atualizando sua Conta Sun Online</a>. </p>
<hr>
<h6>Antes de come&#231;ar</h6><p>Se a m&#225;quina na qual o Enterprise Server est&#225; sendo executado se
conectar com a Internet por meio de um proxy, obtenha o nome
do host e o n&#250;mero da porta do proxy. Se um navegador
da web estiver sendo executado na m&#225;quina onde est&#225; sendo executado o
Enterprise Server, voc&#234; poder&#225; obter essas informa&#231;&#245;es do navegador da web. 
Voc&#234; tamb&#233;m pode solicitar essa informa&#231;&#227;o ao administrador do sistema.</p><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, selecione o n&#243; Registro.</b><p>&#201; aberta a p&#225;gina Registro do Produto.</p></li>
<li><b>Na p&#225;gina Registro do Produto, forne&#231;a as informa&#231;&#245;es solicitadas.</b><ul>
<li><b>Se voc&#234; j&#225; tem uma Conta Sun Online, forne&#231;a as informa&#231;&#245;es exigidas,
desta forma:</b><ol style="list-style-type: lower-alpha">
<li><b>Selecione a op&#231;&#227;o J&#225; tenho uma Conta Sun Online ou uma Rede
de desenvolvedor Sun (SDN).</b></li>
<li><b>No campo Nome de Usu&#225;rio, digite o nome de usu&#225;rio que especificou
ao se registrar na Conta Sun Online.</b></li>
<li><b>No campo Senha, digite a senha que especificou ao se registrar na
Conta Sun Online.</b></li></ol></li>
<li><b>Caso n&#227;o tenha uma Conta Sun Online, forne&#231;a as informa&#231;&#245;es exigidas, desta
forma:</b><ol style="list-style-type: lower-alpha">
<li><b>Selecione a op&#231;&#227;o N&#227;o tenho uma conta Sun online.</b></li>
<li><b>No campo Endere&#231;o de Email, digite seu endere&#231;o de email.</b><p>O endere&#231;o de email ser&#225; seu nome de usu&#225;rio da Conta Sun
Online.</p></li>
<li><b>No campo Senha, digite a senha que deve ser usada na sua
Conta Sun Online.</b><p>A senha diferencia mai&#250;sculas/min&#250;sculas e deve ter de 6 a 10 caracteres.</p></li>
<li><b>No campo Repetir a Senha, digite novamente a senha inserida na etapa
anterior.</b></li>
<li><b>No campo Nome, digite seu nome.</b></li>
<li><b>No campo Sobrenome, digite seu sobrenome.</b></li>
<li><b>No campo Empresa, digite o nome da empresa, se for o caso.</b></li>
<li><b>Na lista suspensa, selecione o pa&#237;s onde voc&#234; reside.</b></li></ol></li></ul></li>
<li><b>Se a m&#225;quina na qual o Enterprise Server est&#225; sendo executado se
conectar com a Internet por meio de um proxy, forne&#231;a o nome
do host e o n&#250;mero da porta do proxy.</b><p>Se a m&#225;quina na qual o Enterprise Server est&#225; sendo executado se
conectar com a Internet diretamente, omita esta etapa.</p><p>Um navegador da web pode estar sendo executado na m&#225;quina na qual
est&#225; sendo executado o Enterprise Server.  Nesta situa&#231;&#227;o, voc&#234; pode obter
o nome do host e o n&#250;mero da porta do proxy do
navegador da web.  Voc&#234; tamb&#233;m pode solicitar essa informa&#231;&#227;o ao administrador
do sistema.</p></li>
<li><b>Clique em Registrar.</b><p>Para confirmar a conclus&#227;o do registro, &#233; aberta a <a href="ref-supportpage.html">P&#225;gina de Suporte</a>.</p></li></ol>
