<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jvmpathsettings"></a><h4>Para configurar as defini&#231;&#245;es de caminho de JVM</h4><p>O caminho de classe &#233; a lista de arquivos JAR que o
ambiente de tempo de execu&#231;&#227;o JAVA pesquisa para detectar classes e outros
recursos.</p><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, selecione o n&#243; Configura&#231;&#227;o.</b></li>
<li><b>Sob o n&#243; Configura&#231;&#227;o, selecione o n&#243; Configura&#231;&#245;es de JVM.</b><p>A p&#225;gina Configura&#231;&#245;es Gerais de JVM &#233; exibida.</p></li>
<li><b>Na p&#225;gina Configura&#231;&#245;es Gerais de JVM, clique na guia Configura&#231;&#245;es de Caminho.</b><p>A p&#225;gina Configura&#231;&#245;es de Caminho de Classe de JVM &#233; exibida.</p></li>
<li><b>Marque a caixa de sele&#231;&#227;o Ignorar Caminho de Classe de Ambiente para
ignorar a vari&#225;vel de ambiente <tt> CAMINHO DE CLASSE</tt>.</b><p>A vari&#225;vel de ambiente <tt>CAMINHO DE CLASSE</tt> &#233; conveniente para tutoriais b&#225;sicos de programa&#231;&#227;o,
mas n&#227;o &#233; recomendada para ambientes empresariais.</p></li>
<li><b>No campo Caminho de Classe do Sistema, digite o caminho para as
classes no seu sistema.</b></li>
<li><b>No campo Prefixo de Caminho de Classe, digite os caminhos completos dos
arquivos JAR a serem colocados no in&#237;cio do caminho de classe do
servidor.</b><p>Para colocar v&#225;rios arquivos no in&#237;cio, digite um caminho por linha.</p></li>
<li><b>No campo Sufixo de Caminho de Classe, digite os caminhos completos dos
arquivos JAR a serem anexados ao caminho de classe do servidor. </b><p>Por exemplo, especifique o arquivo JAR de um driver da banco de
dados. Consulte <a href="../../../jdbc/en/help/">To Integrate a JDBC Driver</a>.</p><p>Para anexar v&#225;rios arquivos, digite um caminho por linha.</p></li>
<li><b>No campo Prefixo de Caminho de Classe da Biblioteca Nativa, digite os
caminhos completos dos arquivos JAR a serem colocados no in&#237;cio do caminho
da biblioteca nativa.</b><p>Para colocar v&#225;rios arquivos no in&#237;cio, digite um caminho por linha.</p></li>
<li><b>No campo Sufixo de Caminho de Classe da Biblioteca Nativa, digite os
caminhos completos dos arquivos JAR a serem anexados ao caminho da biblioteca
nativa. </b><p>Para anexar v&#225;rios arquivos, digite um caminho por linha.</p><p>O caminho da biblioteca nativa &#233; uma concatena&#231;&#227;o dos seguintes caminhos:</p>
<ul><li><p>O caminho relativo do servidor para as respectivos bibliotecas nativas compartilhadas</p></li>
<li><p>O caminho da biblioteca nativa do ambiente de tempo de execu&#231;&#227;o padr&#227;o</p></li>
<li><p>A configura&#231;&#227;o de ambiente do shell (<tt>LD_LIBRARY_PATH</tt> nos sistemas UNIX<sup>&#174;</sup>)</p></li>
<li><p>Todos os caminhos especificados na p&#225;gina <a href="ref-serverinstjvmprofiler.html">Configura&#231;&#245;es do Gerador de Perfil de JVM</a></p></li></ul>
</li>
<li><b>Clique em Salvar.</b></li>
<li><b>Reinicie o servidor.</b></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-jvmsettings.html">Para configurar as defini&#231;&#245;es gerais de JVM</a></p></li>
<li><p><a href="task-jvmoptions.html">Para configurar as op&#231;&#245;es de JVM</a></p></li>
<li><p><a href="task-securitymanagerdisable.html">Para desativar o gerenciador de seguran&#231;a</a></p></li>
<li><p><a href="task-jvmprofilersettings.html">Para configurar as defini&#231;&#245;es do gerador de perfil do JVM</a></p></li></ul>

