<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-appdeployweb"></a><h4>Para implantar um aplicativo da Web</h4><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, selecione o n&#243; Aplicativos.</b><p>A p&#225;gina Aplicativos &#233; exibida.</p></li>
<li><b>Na tabela Aplicativos Implantados, clique no bot&#227;o Implantar.</b><p>A p&#225;gina Implantar Aplicativos ou M&#243;dulos &#233; exibida.</p></li>
<li><b>Especifique o local do arquivo compacto que cont&#233;m o aplicativo a ser
implantado.</b><ul>
<li><b>Se o arquivo compacto residir em ou for acessado do computador cliente,
selecione a op&#231;&#227;o Arquivo Empacotador a Ser Carregado no Servidor.</b><p>O computador cliente &#233; o host em que voc&#234; visualiza o Console
de Administra&#231;&#227;o por meio de um navegador.</p><p>Clique em Procurar para localizar o arquivo ou digite o caminho completo
para o arquivo.</p></li>
<li><b>Se o arquivo compacto residir no computador servidor ou se for um
aplicativo n&#227;o empacotado localizado em um diret&#243;rio destacado, selecione a op&#231;&#227;o Arquivo
Empacotado Local ou Diret&#243;rio Acessado no Enterprise Server.</b><p>O computador servidor &#233; o host que executa o servidor de administra&#231;&#227;o
de dom&#237;nio (DAS). </p><p>Clique em Procurar Arquivos para localizar um arquivo ou clique em Procurar
Pastas para localizar um diret&#243;rio. Como alternativa, digite o caminho completo para
o arquivo ou diret&#243;rio. A implanta&#231;&#227;o a partir de um diret&#243;rio avan&#231;ado
destina-se a desenvolvedores avan&#231;ados e n&#227;o &#233; recomendada para ambientes de produ&#231;&#227;o.</p></li></ul></li>
<li><b>Na lista suspensa Tipo, selecione Aplicativo da Web.</b><p>Se voc&#234; tiver especificado um Arquivo Empacotador a Ser Carregado no Servidor
ou um Arquivo Empacotado Local Acessado do Enterprise Server, o tipo do
aplicativo ser&#225; detectado automaticamente. Se voc&#234; tiver especificado um Diret&#243;rio Acessado do
Enterprise Server, voc&#234; deve especificar o tipo manualmente.</p></li>
<li><b>No campo Raiz de Contexto, digite uma sequ&#234;ncia que identifica o aplicativo
da Web.</b><p>Na URL do aplicativo Web, a raiz de contexto aparece imediatamente ap&#243;s
o n&#250;mero da porta (<tt>http://</tt><i>host</i><tt>:</tt><i>port</i><tt>/</tt><i> context-root</i><tt>/...</tt>).  A raiz de contexto deve iniciar
com uma barra; por exemplo, <tt>/hello</tt>.</p></li>
<li><b>No campo Nome do Aplicativo, preserve o nome padr&#227;o, que &#233; o
nome do diret&#243;rio ou o prefixo do nome do arquivo, ou digite
outro nome. </b><p>O nome padr&#227;o ser&#225; exibido se voc&#234; optar por carregar um arquivo.
O nome do aplicativo deve ser exclusivo.</p></li>
<li><b>Na lista suspensa Servidores Virtuais, selecione o servidor virtual a ser associado
ao aplicativo.</b></li>
<li><b>Marque a caixa de sele&#231;&#227;o Satatus Ativado para ativar o aplicativo.</b><p>Por padr&#227;o, a op&#231;&#227;o est&#225; ativada. Esta op&#231;&#227;o est&#225; desativada, o aplicativo
n&#227;o est&#225; dispon&#237;vel.</p></li>
<li><b>Marque a caixa de sele&#231;&#227;o Precompilar JSPs para precompilar arquivos JavaServer Pages<sup>TM</sup> (JSP<sup>TM</sup>).</b><p>Se esta op&#231;&#227;o for desativada, os arquivos JSP ser&#227;o compilados no tempo
de execu&#231;&#227;o, quando forem acessados pela primeira vez. Por padr&#227;o, a op&#231;&#227;o
est&#225; desativada.</p></li>
<li><b>Marque a caixa de sele&#231;ao Executar Verificador para executar o verificador antes
da implanta&#231;&#227;o.</b><p>Se esta op&#231;&#227;o estiver ativada e se a verifica&#231;&#227;o falhar, a implanta&#231;&#227;o
n&#227;o ser&#225; realizada. O verificador examina a estrutura e o conte&#250;do do
arquivo. A verifica&#231;&#227;o de aplicativos grandes geralmente consome muito tempo. Por padr&#227;o,
a op&#231;&#227;o est&#225; desativada.</p></li>
<li><b>No campo Bibliotecas, digite uma lista separada por v&#237;rgulas  dos arquivos
JAR da biblioteca, espec&#237;ficos deste m&#243;dulo ou aplicativo. </b><p>Os caminhos podem ser absolutos ou relativos. Um caminho relativo &#233; relativo
ao<tt></tt><i>domain-dir</i><tt>/lib/applibs</tt> Se o caminho for absoluto, o caminho deve ser acess&#237;vel ao
servidor de administra&#231;&#227;o de dom&#237;nio (DAS), o que significa que ele deve
estar em <tt></tt><i>domain-dir</i><tt></tt> As bibliotecas s&#227;o disponibilizadas para o aplicativo na ordem
em que elas s&#227;o especificadas.</p></li>
<li><b>No campo Descri&#231;&#227;o, digite uma descri&#231;&#227;o para o aplicativo.</b></li>
<li><b>Clique em OK.</b></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-applistdeployed.html">Para exibir uma lista de aplicativos implantados</a></p></li>
<li><p><a href="task-deployentapp.html">Para implantar um Aplicativo Empresarial</a></p></li>
<li><p><a href="task-appdeployclient.html">Para implantar um cliente aplicativo</a></p></li>
<li><p><a href="task-appdeployconn.html">Para implantar um m&#243;dulo conector</a></p></li>
<li><p><a href="task-appdeployejb.html">Para implantar um EJB Jar</a></p></li>
<li><p><a href="task-appdeployruby.html">Para implantar um aplicativo Ruby</a></p></li>
<li><p><a href="task-appedit.html">Para editar um aplicativo implantado</a></p></li>
<li><p><a href="task-appviewdesc.html">Para exibir os descritores de um aplicativo</a></p></li>
<li><p><a href="task-applaunch.html">Para iniciar um aplicativo</a></p></li>
<li><p><a href="task-appredeploy.html">Para reimplantar um aplicativo implantado</a></p></li>
<li><p><a href="task-apprestart.html">Para reiniciar um aplicativo implantado</a></p></li></ul>

