<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-setadvancedomainattributes"></a><h4>Para definir os atributos de dom&#237;nio avan&#231;ados</h4><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, selecione o n&#243; Servidor de Aplicativos.</b><p>A p&#225;gina Informa&#231;&#245;es Gerais &#233; exibida.</p></li>
<li><b>Na p&#225;gina Informa&#231;&#245;es Gerais, clique na guia Avan&#231;ado.</b><p>A p&#225;gina Configura&#231;&#227;o de Aplicativos &#233; exibida.</p></li>
<li><b>Na p&#225;gina Configura&#231;&#227;o de Aplicativos, clique na guia  Atributos de Dom&#237;nio.</b><p>A p&#225;gina Atributos de Dom&#237;nio &#233; exibida.</p></li>
<li><b>No campo Raiz de Aplicativo, digite o caminho completo do diret&#243;rio onde
os aplicativos implantados residem.</b><p>O valor padr&#227;o &#233; <tt></tt><i>domain-dir</i><tt>/applications </tt>.</p></li>
<li><b>No campo Raiz de Log, digite o caminho completo do diret&#243;rio onde
os arquivos de log de servidor ser&#227;o mantidos.</b><p>O valor padr&#227;o &#233; <tt></tt><i>domain-dir</i><tt>/logs</tt>.</p></li>
<li><b>Deixe o campo Localidade em branco para usar a localidade padr&#227;o do
host.</b><p>Uma localidade &#233; um identificador que especifica uma determinada combina&#231;&#227;o de idioma
e regi&#227;o. Por exemplo, a localidade para ingl&#234;s americano &#233; <tt>en_US </tt> e
para japon&#234;s &#233; <tt>ja_JP</tt>.  Para usar uma localidade que n&#227;o seja
o ingl&#234;s, o Enterprise Server deve ser localizado, um processo que inclui
a tradu&#231;&#227;o de ingl&#234;s para outro idioma.</p></li>
<li><b>Clique em Salvar.</b></li>
<li><b>Reinicie o servidor.</b></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-generaltab.html">Para Exibir Informa&#231;&#245;es Gerais do Enterprise Server</a></p></li>
<li><p><a href="task-logviewer.html">Para exibir o log do servidor</a></p></li>
<li><p><a href="task-setadvanceappconfig.html">Para definir a configura&#231;&#227;o dos aplicativos avan&#231;ados</a></p></li>
<li><p><a href="task-setadminpassword.html">Para alterar a Senha do Administrador</a></p></li>
<li><p><a href="task-systemproperties.html">Para gerenciar propriedades do sistema</a></p></li>
<li><p><a href="task-appmonitoringdata.html">Para exibir dados de monitoramento do aplicativo</a></p></li>
<li><p><a href="task-servermonitoringdata.html">Para exibir dados de monitoramento do servidor</a></p></li></ul>

