<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-uc-set-proxy"></a><h4>Para definir configura&#231;&#245;es de proxy de rede para acessar reposit&#243;rios de rede</h4><p>As configura&#231;&#245;es de proxy de rede determinam como o Enterprise Server conecta-se
com a Internet.  Para permitir que o Ferramenta de Atualiza&#231;&#227;o acesse
os <a href="ref-uc-concepts.html#ref-uc-about-repository">reposit&#243;rios da rede</a> pela Internet, defina as configura&#231;&#245;es do proxy da rede.</p><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, selecione o n&#243; Ferramenta de Atualiza&#231;&#227;o.</b><p>&#201; aberta a p&#225;gina Complementos Dispon&#237;veis.</p></li>
<li><b>Na p&#225;gina Complementos Dispon&#237;veis, clique na guia Configura&#231;&#227;o.</b><p>&#201; exibida a p&#225;gina Configura&#231;&#227;o Ferramenta de Atualiza&#231;&#227;o.</p></li>
<li><b>Na p&#225;gina Configura&#231;&#227;o Ferramenta de Atualiza&#231;&#227;o, especifique como a m&#225;quina na qual
Enterprise Server est&#225; sendo executado se conecta com a Internet.</b><ul>
<li><b>Se a m&#225;quina se conecta com a Internet diretamente, selecione a op&#231;&#227;o
Conex&#227;o Direta.</b></li>
<li><b>Se a m&#225;quina se conecta com a Internet por meio de um
proxy, selecione a op&#231;&#227;o Por meio de um Proxy.</b></li></ul></li>
<li><b>Se a m&#225;quina na qual o Enterprise Server est&#225; sendo executado se
conectar com a Internet por meio de um proxy, forne&#231;a o nome
do Host do Proxy e o n&#250;mero da Porta do Proxy.</b><p>Se a m&#225;quina na qual o Enterprise Server est&#225; sendo executado se
conectar com a Internet diretamente, omita esta etapa.</p><p>Um navegador da web pode estar sendo executado na m&#225;quina na qual
est&#225; sendo executado o Enterprise Server.  Nesta situa&#231;&#227;o, voc&#234; pode obter
o nome do host e o n&#250;mero da porta do proxy do
navegador da web.  Voc&#234; tamb&#233;m pode solicitar essa informa&#231;&#227;o ao administrador
do sistema.</p></li>
<li><b>Clique em Salvar.</b></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-uc-update.html">Para instalar atualiza&#231;&#245;es de componentes </a></p></li>
<li><p><a href="task-uc-addon.html">Para instalar componentes complementares</a></p></li>
<li><p><a href="task-uc-installed-remove.html">Para desinstalar componentes</a></p></li>
<li><p><a href="task-uc-pkgdetails.html">Para exibir informa&#231;&#245;es detalhadas sobre um componente</a></p></li></ul>

