<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-securitysettings"></a><h4>Para definir as configura&#231;&#245;es de seguran&#231;a</h4><p>O Console de Administra&#231;&#227;o permite que voc&#234; defina uma variedade de configura&#231;&#245;es
de seguran&#231;a em todo o sistema.</p><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Configura&#231;&#227;o.</b></li>
<li><b>Sob o n&#243; Configura&#231;&#227;o, selecione o n&#243; Seguran&#231;a.</b><p>A p&#225;gina Seguran&#231;a &#233; exibida.</p></li>
<li><b>Marque a caixa de sele&#231;&#227;o Gerenciador de Seguran&#231;a Ativado para ativar o
gerenciador de seguran&#231;a.</b><p>Se esta op&#231;&#227;o for ativada, uma op&#231;&#227;o de JVM, <tt>-Djava.security.manager </tt>, ser&#225; adicionada
&#224;s configura&#231;&#245;es de JVM do Enterprise Server.  Consulte <a href="task-jvmoptions.html">Para configurar as op&#231;&#245;es de JVM</a>.  &#201;
preciso reiniciar o servidor para ativar a altera&#231;&#227;o.</p><p>Verifique se voc&#234; tem as permiss&#245;es corretas para todos os aplicativos. Para
melhorar o desempenho, desative o gerenciador de seguran&#231;a.  Por padr&#227;o, a
op&#231;&#227;o est&#225; desativada.</p></li>
<li><b>Marque a caixa de sele&#231;&#227;o Log de Auditoria Ativado para ativar o
registro de auditoria.</b><p>Se essa op&#231;&#227;o for ativada, o servidor carregar&#225; e executar&#225; todos os
m&#243;dulos de auditoria selecionados na lista M&#243;dulos de Auditoria.  Se essa
op&#231;&#227;o for desativada, o servidor n&#227;o acessar&#225; os m&#243;dulos de auditoria. 
Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p></li>
<li><b>Na lista suspensa Dom&#237;nio Padr&#227;o, selecione um dom&#237;nio ativo que o servidor
usar&#225; para a autentica&#231;&#227;o.</b><p>Os aplicativos ir&#227;o usar esse dom&#237;nio, a menos que o descritor de
implanta&#231;&#227;o especifique um dom&#237;nio diferente. Todos os dom&#237;nios configurados s&#227;o exibidos na
lista. O valor padr&#227;o &#233; <tt>arquivo</tt>.</p></li>
<li><b>Especifique a informa&#231;&#227;o do Principal Padr&#227;o.</b><ol style="list-style-type: lower-alpha">
<li><b>No campo Principal Padr&#227;o, digite o nome de usu&#225;rio padr&#227;o.</b><p>O servidor usa esse nome de usu&#225;rio quando nenhum outro principal &#233;
fornecido.</p></li>
<li><b>No campo Senha do Principal Padr&#227;o, digite a senha do principal padr&#227;o
especificado no campo Principal Padr&#227;o.</b></li></ol><p>Um principal padr&#227;o n&#227;o &#233; exigido para opera&#231;&#227;o normal do servidor.</p></li>
<li><b>Na lista suspensa do JACC, selecione o nome de  um provedor
JACC configurado.</b><p>As op&#231;&#245;es padr&#227;o s&#227;o <tt>default</tt> e <tt> simple</tt>. A op&#231;&#227;o padr&#227;o &#233; <tt>default</tt>.</p></li>
<li><b>Na lista suspensa M&#243;dulos de Auditoria, selecione os m&#243;dulos do provedor de
auditoria que ser&#227;o usados pelo subsistema de auditoria, se o log de
auditoria estiver ativado.</b><p>Por padr&#227;o, o servidor usa um m&#243;dulo de auditoria chamado <tt>padr&#227;o</tt>. 
Para obter informa&#231;&#245;es sobre a cria&#231;&#227;o de novos m&#243;dulos de auditoria, consulte
<a href="task-auditmodulenew.html">Para criar um m&#243;dulo de auditoria</a>.</p></li>
<li><b>Marque a caixa de sele&#231;&#227;o Mapeamento Ativado de Principal Padr&#227;o para Fun&#231;&#227;o
para aplicar um mapeamento de principal padr&#227;o para fun&#231;&#227;o nos aplicativos que
n&#227;o t&#234;m um mapeamento espec&#237;fico de aplicativo.</b></li>
<li><b>Se voc&#234; tiver ativado o mapeamento principal-para-fun&#231;&#227;o padr&#227;o, no campo Classe Principal
Mapeada, digite o nome de uma classe de implementa&#231;&#227;o <tt>java.security.Principal </tt> personalizada a
ser usada no mapeamento principal-para-fun&#231;&#227;o padr&#227;o.</b></li>
<li>(Opcional) <b>Na se&#231;&#227;o Propriedades Adicionais, especifique essas propriedades.</b><p>As propriedades v&#225;lidas s&#227;o dependentes do tipo de dom&#237;nio selecionado no campo
Dom&#237;nio Padr&#227;o.</p>
<ul><li><p>Para obter uma descri&#231;&#227;o das propriedades Dom&#237;nio de Arquivo, consulte <a href="ref-editfile-adminrealm.html">Propriedades espec&#237;ficas da classe <tt> FileRealm</tt></a>.</p></li>
<li><p>Para obter uma descri&#231;&#227;o das propriedades Dom&#237;nio de Certificado, consulte <a href="ref-editcertrealm.html">Propriedades espec&#237;ficas da classe <tt>CertificateRealm </tt></a>.</p></li>
<li><p>Para obter uma descri&#231;&#227;o das propriedades Dom&#237;nio JDBC, consulte <a href="ref-editjdbcrealm.html">Propriedades espec&#237;ficas para a classe <tt>JDBCRealm </tt></a>.</p></li>
<li><p>Para obter uma descri&#231;&#227;o das propriedades Dom&#237;nio LDAP, consulte <a href="ref-ldaprealmprop.html">Propriedades espec&#237;ficas da classe <tt>LDAPRealm </tt></a>.</p></li>
<li><p>Para obter uma descri&#231;&#227;o das propriedades Dom&#237;nio do Solaris, consulte <a href="ref-solarisrealmprop.html">Propriedades espec&#237;ficas da classe <tt>SolarisRealm </tt></a>.</p></li></ul>
<ul>
<li><b>Para adicionar uma propriedade, clique no bot&#227;o Adicionar Propriedade. Na linha em
branco que &#233; exibida, digite o nome da propriedade no campo Nome
e digite o valor da propriedade no campo Valor.</b></li>
<li><b>Para modificar uma propriedade, edite o campo Valor da propriedade.</b></li>
<li><b>Para excluir uma propriedade, marque a caixa de sele&#231;&#227;o &#224; esquerda do
campo Nome da propriedade a ser exclu&#237;da. Clique no bot&#227;o Excluir Propriedades.</b></li></ul></li>
<li><b>Clique em Salvar.</b></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-accessadmintools.html">Para dar acesso a ferramentas de administra&#231;&#227;o</a></p></li>
<li><p><a href="task-changeadminpasswd.html">Para alterar a senha de um usu&#225;rio no dom&#237;nio do admin</a></p></li></ul>

