<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-configmsgsecproviders"></a><h4>Para configurar os recursos do Enterprise Server para uso pelos provedores de seguran&#231;a de mensagens</h4><ol>
<li><b>Se estiver usando um s&#237;mbolo de nome de usu&#225;rio, configure um banco
de dados de usu&#225;rio, se necess&#225;rio.</b><p>Ao usar um s&#237;mbolo de nome de usu&#225;rio/senha, primeiro configure um dom&#237;nio
adequado e um banco de dados de usu&#225;rio adequado para o dom&#237;nio.</p><p>A configura&#231;&#227;o de um banco de dados de usu&#225;rio &#233; discutida em
<a href="task-realmedit.html">Para editar um dom&#237;nio</a>.</p></li>
<li><b>Gerencie os certificados e as chaves particulares, se necess&#225;rio.</b></li></ol><h6>Passos Seguintes</h6><p>Quando os recursos do Enterprise Server estiverem configurados para uso pelos provedores
de seguran&#231;a de mensagens, os provedores instalados no Enterprise Server poder&#227;o ser
ativados como descrito em <a href="task-messagesecurityconfigedit.html">Para editar uma configura&#231;&#227;o de seguran&#231;a de mensagens</a>.</p><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-messagesecurityconfignew.html">Para criar uma configura&#231;&#227;o de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityconfigedit.html">Para editar uma configura&#231;&#227;o de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityconfigdelete.html">Para excluir uma configura&#231;&#227;o de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityproviderconfignew.html">Para criar uma configura&#231;&#227;o de provedor de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigedit.html">Para editar uma configura&#231;&#227;o de provedor de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigdelete.html">Para excluir uma configura&#231;&#227;o de provedor de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-enablemesec4appclients.html">Para ativar a seguranda de mensagens para clientes aplicativos</a></p></li></ul>

