<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-uc-update"></a><h4>Para instalar atualiza&#231;&#245;es de componentes </h4><p>A atualiza&#231;&#227;o de um <a href="ref-uc-concepts.html#ref-uc-about-component">componente</a> instalado envolve as seguintes opera&#231;&#245;es:</p>
<ul><li><p>Transfer&#234;ncia somente dos arquivos modificados de um <a href="ref-uc-concepts.html#ref-uc-about-repository">reposit&#243;rio da rede</a> para o sistema</p></li>
<li><p>Atualiza&#231;&#227;o somente dos arquivos modificados dentro da <a href="ref-uc-concepts.html#ref-uc-about-repository">imagem de instala&#231;&#227;o</a> do Enterprise Server no sistema</p></li>
<li><p>Aplica&#231;&#227;o de novas depend&#234;ncias (se houver) entre os componentes atualizados</p></li></ul>
<ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, selecione o n&#243; Ferramenta de Atualiza&#231;&#227;o.</b><p>&#201; aberta a p&#225;gina Complementos Dispon&#237;veis.</p></li>
<li><b>Na p&#225;gina Complementos Dispon&#237;veis, clique na guia Atualiza&#231;&#245;es Dispon&#237;veis.</b><p>&#201; aberta a p&#225;gina Atualiza&#231;&#245;es Dispon&#237;veis.</p></li>
<li><b>Na tabela de atualiza&#231;&#245;es dispon&#237;veis, selecione os componentes que est&#225; atualizando.</b><p>Se n&#227;o houver diferen&#231;a na vers&#227;o ou no tamanho entre a vers&#227;o
instalada e a nova vers&#227;o do componente, n&#227;o &#233; necess&#225;rio atualizar o
componente. Se n&#227;o houver atualiza&#231;&#245;es dispon&#237;veis, a tabela estar&#225; vazia.</p><ul>
<li><b>Para selecionar um componente individual, marque a caixa de sele&#231;&#227;o adjacente ao
nome do componente.</b></li>
<li><b>Para selecionar todos os componentes, clique no &#237;cone Selecionar Todos, no cabe&#231;alho
da tabela.</b></li>
<li><b>Para desmarcar todos os componentes, clique no &#237;cone Selecionar Todos, no cabe&#231;alho
da tabela Desmarcar Tudo.</b></li></ul></li>
<li><b>Clique em Instalar.</b></li>
<li><b>Aceite o contrato de licen&#231;a.</b><p>O Enterprise Server confirma que a instala&#231;&#227;o est&#225; conclu&#237;da.  </p></li>
<li><b>Reinicie o servidor.</b><p>Para obter instru&#231;&#245;es detalhadas, consulte a seguinte documenta&#231;&#227;o:</p>
<ul><li><p><a href="http://docs.sun.com/doc/820-7692/ggoch?a=view">To Stop a Domain no <i>Sun GlassFish Enterprise Server v3 Administration Guide </i></a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7692/ggoda?a=view">To Start a Domain no <i>Sun GlassFish Enterprise Server v3 Administration Guide </i></a></p></li></ul>
</li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-uc-set-proxy.html">Para definir configura&#231;&#245;es de proxy de rede para acessar reposit&#243;rios de rede</a></p></li>
<li><p><a href="task-uc-addon.html">Para instalar componentes complementares</a></p></li>
<li><p><a href="task-uc-installed-remove.html">Para desinstalar componentes</a></p></li>
<li><p><a href="task-uc-pkgdetails.html">Para exibir informa&#231;&#245;es detalhadas sobre um componente</a></p></li></ul>

