<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jmxconnectoredit"></a><h4>Para editar o conector JMX </h4><p>Use o Servi&#231;o de Administra&#231;&#227;o para configurar um conector JMX remoto compat&#237;vel
com JSR-160.</p><p>O conector JMX remoto compat&#237;vel com JSR-160 lida com a comunica&#231;&#227;o entre
clientes JMX, como o JConsole, e o servi&#231;o JMX, para fins de
gerenciamento de dom&#237;nio.</p><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Configura&#231;&#227;o.</b></li>
<li><b>Sob o n&#243; Configura&#231;&#227;o, selecione o n&#243; Servi&#231;o de Administra&#231;&#227;o.</b><p>A p&#225;gina Editar Conector JMX &#233; exibida.</p></li>
<li><b>Marque a caixa de sele&#231;&#227;o Seguran&#231;a Ativada para que a comunica&#231;&#227;o JMX
seja criptografada.</b><p>Por padr&#227;o, a op&#231;&#227;o est&#225; desativada.</p></li>
<li><b>No campo Endere&#231;o, digite o endere&#231;o IP do servi&#231;o de nomes onde
o stub do servidor do conector JMX est&#225; registrado.</b><p>Esta n&#227;o &#233; a porta do soquete do servidor que faz a
comunica&#231;&#227;o JMX real. Este &#233; o endere&#231;o da interface de rede onde
o registro do RMI foi iniciado. Se o seu sistema tem m&#250;ltiplas
interfaces de rede, modifique esse valor para que apenas uma determinada interface
seja selecionada. O valor padr&#227;o &#233; <tt>0.0.0.0</tt>.</p></li>
<li><b>No campo Porta, digite o n&#250;mero da porta no qual o servi&#231;o
de nomes (registro RMI) escuta as conex&#245;es cliente RMI.</b><p>O &#250;nico uso deste servi&#231;o de nomes &#233; baixado para os stubs
de RMI. Se a porta padr&#227;o estiver ocupada, uma porta livre ser&#225;
usada. Os valores legais s&#227;o 1- 65535. Em sistemas UNIX<sup>&#174;</sup>, a cria&#231;&#227;o
de soquetes que escutam nas portas 1 - 1024 requer privil&#233;gios de
superusu&#225;rio. O valor padr&#227;o &#233; 8686.</p></li>
<li><b>No campo Nome do Dom&#237;nio, digite o nome que representa o dom&#237;nio
administrativo especial.</b><p>Toda a autentica&#231;&#227;o &#233; tratada por esse dom&#237;nio. O valor padr&#227;o &#233;
<tt>admin-dom&#237;nio</tt>.</p></li>
<li>(Opcional) <b>Na se&#231;&#227;o Propriedades Adicionais, especifique essas propriedades.</b><p>O Enterprise Server especifica diversas propriedades por padr&#227;o.</p><ul>
<li><b>Para adicionar uma propriedade, clique no bot&#227;o Adicionar Propriedade. Na linha em
branco que &#233; exibida, digite o nome da propriedade no campo Nome
e digite o valor da propriedade no campo Valor.</b></li>
<li><b>Para modificar uma propriedade, edite o campo Valor da propriedade.</b></li>
<li><b>Para excluir uma propriedade, marque a caixa de sele&#231;&#227;o &#224; esquerda do
campo Nome da propriedade a ser exclu&#237;da. Clique no bot&#227;o Excluir Propriedades.</b></li></ul></li>
<li><b>Clique em Salvar.</b></li>
<li><b>Se voc&#234; tiver marcado a caixa de sele&#231;&#227;o Seguran&#231;a Ativada, siga as
etapas em <a href="task-jmxconnectorssledit.html">Para editar as configura&#231;&#245;es SSL do conector JMX</a>.</b></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-jmxconnectorssledit.html">Para editar as configura&#231;&#245;es SSL do conector JMX</a></p></li></ul>

