<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-messagesecurityconfigedit"></a><h4>Para editar uma configura&#231;&#227;o de seguran&#231;a de mensagens</h4><p>Para ativar a seguran&#231;a de mensagens para pontos de extremidade de servi&#231;os
da Web implantados no Enterprise Server, voc&#234; deve especificar um provedor a
ser usado por padr&#227;o no lado do servidor. Se voc&#234; ativar a
seguran&#231;a de mensagens de um provedor padr&#227;o, tamb&#233;m ser&#225; necess&#225;rio permitir que
os provedores sejam usados por clientes dos servi&#231;os da Web implantados no
Enterprise Server. As informa&#231;&#245;es sobre a ativa&#231;&#227;o de provedores usados por clientes
&#233; discutida em <a href="task-enablemesec4appclients.html">Para ativar a seguranda de mensagens para clientes aplicativos</a>.</p><p>Para ativar a seguran&#231;a de mensagens de chamadas de servi&#231;os da Web
de pontos de extremidades implantados, voc&#234; deve especificar um provedor de cliente
padr&#227;o. Se voc&#234; tiver ativado um provedor cliente padr&#227;o para Enterprise Server,
dever&#225; assegurar que quaisquer servi&#231;os chamados de pontos de extremidades implantados no
Enterprise Server estejam compativelmente configurados para seguran&#231;a de camada de mensagens.</p><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Configura&#231;&#227;o.</b></li>
<li><b>Expanda o n&#243; Seguran&#231;a.</b></li>
<li><b>Selecione o n&#243; Seguran&#231;a de Mensagens.</b><p>A p&#225;gina Configura&#231;&#245;es de Seguran&#231;a de Mensagens &#233; exibida.</p></li>
<li><b>Na p&#225;gina Configura&#231;&#245;es de Seguran&#231;a de Mensagens, clique no nome da Camada
de Autentica&#231;&#227;o da configura&#231;&#227;o que voc&#234; est&#225; editando.</b><p>Por padr&#227;o, a &#250;nica configura&#231;&#227;o de seguran&#231;a de mensagens definida &#233; SOAP.</p><p>A p&#225;gina Editar Configura&#231;&#227;o de Seguran&#231;a de Mensagens &#233; exibida.</p></li>
<li><b>Na p&#225;gina Editar Configura&#231;&#227;o de Seguran&#231;a de Mensagens, da lista suspensa Provedor
Padr&#227;o, selecione um provedor do lado do servidor. </b><p>O provedor do servidor padr&#227;o, tamb&#233;m chamado de provedor padr&#227;o, identifica o
provedor do servidor chamado para um aplicativo que n&#227;o identifica um provedor
do servidor espec&#237;fico. As op&#231;&#245;es dispon&#237;veis s&#227;o <tt>ServerProvider</tt>, <tt>XWS_ServerProvider </tt> ou nenhuma. Por
padr&#227;o, nenhum provedor &#233; selecionado, de forma que o Enterprise Server n&#227;o
ir&#225; chamar um provedor de seguran&#231;a de mensagens no lado do servidor.
Geralmente o <tt> ServerProvider</tt> &#233; selecionado como provedor padr&#227;o.</p></li>
<li><b>Na lista suspensa Provedor de Cliente Padr&#227;o, selecione um provedor de cliente.</b><p>O provedor do cliente padr&#227;o identifica o provedor de cliente chamado por
um aplicativo que n&#227;o identifica um provedor de cliente espec&#237;fico. As op&#231;&#245;es
dispon&#237;veis s&#227;o <tt>ClientProvider</tt>, <tt> XWS_ClientProvider</tt> ou nenhuma. Por padr&#227;o, nenhum provedor &#233; selecionado,
de forma que o Enterprise Server n&#227;o ir&#225; chamar um provedor de
seguran&#231;a de mensagens no lado do cliente. Geralmente, nenhum &#233; selecionado para
o provedor de cliente padr&#227;o. Selecione o <tt>ClientProvider </tt> para ativar um provedor
padr&#227;o e a diretiva de prote&#231;&#227;o de mensagens a ser aplicada &#224;s
chamadas dos servi&#231;os da Web que se originam de pontos de extremidades
de servi&#231;os da Web implantados no Enterprise Server.</p></li>
<li><b>Clique em Salvar.</b></li>
<li><b>Para obter instru&#231;&#245;es sobre como modificar as diretivas de prote&#231;&#227;o de mensagens
de provedores de cliente ou servidor ativados, consulte <a href="task-messagesecurityproviderconfigedit.html">Para editar uma configura&#231;&#227;o de provedor de seguran&#231;a de mensagens</a>.</b></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-configmsgsecproviders.html">Para configurar os recursos do Enterprise Server para uso pelos provedores de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityconfignew.html">Para criar uma configura&#231;&#227;o de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityconfigdelete.html">Para excluir uma configura&#231;&#227;o de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityproviderconfignew.html">Para criar uma configura&#231;&#227;o de provedor de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigedit.html">Para editar uma configura&#231;&#227;o de provedor de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigdelete.html">Para excluir uma configura&#231;&#227;o de provedor de seguran&#231;a de mensagens</a></p></li>
<li><p><a href="task-enablemesec4appclients.html">Para ativar a seguranda de mensagens para clientes aplicativos</a></p></li></ul>

