<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-auditmoduleedit"></a><h4>Para editar um m&#243;dulo de auditoria</h4><p>Os m&#243;dulos de auditoria n&#227;o est&#227;o ativados por padr&#227;o. Para obter mais
informa&#231;&#245;es sobre como ativar m&#243;dulos de auditoria, consulte <a href="task-enabledisableauditmod.html">Para ativar ou desativar logs de auditoria</a>.</p><ol>
<li><b>Na &#225;rvore de navega&#231;&#227;o, expanda o n&#243; Configura&#231;&#227;o.</b></li>
<li><b>Sob o n&#243; Configura&#231;&#227;o, expanda o n&#243; Seguran&#231;a.</b></li>
<li><b>Sob o n&#243; Seguran&#231;a, selecione o n&#243; M&#243;dulos de Auditoria.</b><p>A p&#225;gina M&#243;dulos de Auditoria &#233; exibida.</p></li>
<li><b>Na p&#225;gina M&#243;dulos de Auditoria, clique no nome do m&#243;dulo de auditoria
que voc&#234; est&#225; editando.</b><p>A p&#225;gina Editar M&#243;dulo de Auditoria &#233; exibida.</p></li>
<li><b>Na p&#225;gina Editar M&#243;dulo de Auditoria, digite um novo valor no campo
Nome da Classe para modificar esse nome.</b></li>
<li>(Opcional) <b>Na se&#231;&#227;o Propriedades Adicionais, especifique essas propriedades.</b><p>Para uma descri&#231;&#227;o da propriedade adicional que est&#225; dispon&#237;vel para m&#243;dulos de
auditoria, consulte <a href="ref-auditmoduleprop.html">Propriedades Espec&#237;ficas de M&#243;dulos de Auditoria</a>.</p><ul>
<li><b>Para adicionar uma propriedade, clique no bot&#227;o Adicionar Propriedade. Na linha em
branco que &#233; exibida, digite o nome da propriedade no campo Nome
e digite o valor da propriedade no campo Valor.</b></li>
<li><b>Para modificar uma propriedade, edite o campo Valor da propriedade.</b></li>
<li><b>Para excluir uma propriedade, marque a caixa de sele&#231;&#227;o &#224; esquerda do
campo Nome da propriedade a ser exclu&#237;da. Clique no bot&#227;o Excluir Propriedades.</b></li></ul></li>
<li><b>Clique em Salvar.</b></li></ol><h6>Consulte tamb&#233;m</h6>
<ul><li><p><a href="task-auditmodulenew.html">Para criar um m&#243;dulo de auditoria</a></p></li>
<li><p><a href="task-auditmoduledelete.html">Para excluir um m&#243;dulo de auditoria</a></p></li>
<li><p><a href="task-enabledisableauditmod.html">Para ativar ou desativar logs de auditoria</a></p></li>
<li><p><a href="task-setactiveauditmod.html">Para definir o m&#243;dulo de auditoria ativo</a></p></li>
<li><p><a href="task-usedefaultauditmod.html">Para usar o m&#243;dulo de auditoria padr&#227;o</a></p></li></ul>

