<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmxconnectorssledit" name="ref-jmxconnectorssledit"></a><a id="GHCOM00128" name="GHCOM00128"></a></p>

<h4><a id="sthref430" name="sthref430"></a><a id="sthref431" name="sthref431"></a><a id="sthref432" name="sthref432"></a>SSL</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilisez la page SSL pour modifier les param&egrave;tres SSL du connecteur JMX.</p>
<p>Les param&egrave;tres de cette page ne sont pertinents que si la s&eacute;curit&eacute; est activ&eacute;e pour le connecteur JMX sur la page Modifier un connecteur JMX.</p>
<p>La page SSL contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Nom de configuration</dt>
<dd>
<p>Nom de la configuration &agrave; laquelle s'appliquent les param&egrave;tres de cette page. Ce champ est en lecture seule.</p>
</dd>
<dt>SSL3</dt>
<dd>
<p>Si cette case est coch&eacute;e, le protocole SSL3 est activ&eacute; pour le connecteur JMX. Cette option est activ&eacute;e par d&eacute;faut.</p>
</dd>
<dt>TLS</dt>
<dd>
<p>Si cette case est coch&eacute;e, le protocole TLS est activ&eacute; pour le connecteur JMX. Cette option est activ&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Authentification client</dt>
<dd>
<p>Si cette case est coch&eacute;e, les clients doivent s'identifier sur le serveur &agrave; chaque demande. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Pseudonyme du certificat</dt>
<dd>
<p>Pseudonyme du certificat du serveur dans la base de donn&eacute;es des certificats ou jeton PKCS#11. Dans le certificat, le format du nom est <i>nom du jeton</i><code>:</code><i>pseudonyme</i>. M&ecirc;me la partie <i>nom du jeton</i><code>:</code> du nom de cet attribut est facultative.</p>
</dd>
<dt>Keystore</dt>
<dd>
<p>Nom du fichier keystore (par exemple, <code>keystore.jks</code>).</p>
</dd>
<dt>Algorithme s&eacute;curis&eacute;</dt>
<dd>
<p>Nom de l'algorithme de gestion s&eacute;curis&eacute; (par exemple, PKIX) &agrave; utiliser pour la validation du chemin de certification.</p>
</dd>
<dt>Longueur max. du certificat</dt>
<dd>
<p>Nombre maximal des certificats interm&eacute;diaires non auto-&eacute;mis pouvant exister dans un chemin de certification. Ce champ est utilis&eacute; uniquement si le champ Algorithme s&eacute;curis&eacute; a la valeur PKIX. La valeur 0 implique que le chemin peut contenir un seul certificat. La valeur -1 implique que la longueur du chemin est illimit&eacute;e (pas de maximum). La d&eacute;finition d'une valeur inf&eacute;rieure &agrave; -1 entra&icirc;ne la g&eacute;n&eacute;ration d'une exception.</p>
</dd>
<dt>Truststore</dt>
<dd>
<p>Nom du fichier truststore (par exemple, <code>cacerts.jks</code> ).</p>
</dd>
<dt>Suites de cryptage</dt>
<dd>
<p>Zone o&ugrave; vous pouvez ajouter ou enlever des suites de cryptage. Si vous n'ajoutez pas de suite de cryptage, toutes les suites seront utilis&eacute;es.</p>
</dd>
</dl>
<a id="sthref433" name="sthref433"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-jmxconnectoredit.html">Modification du connecteur JMX</a></p>
</li>
<li>
<p><a href="task-jmxconnectorssledit.html">Modifier des param&egrave;tres SSL pour le connecteur JMX</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
