<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-uc-concepts" name="ref-uc-concepts"></a></p>

<h4><a id="sthref253" name="sthref253"></a>Concepts-cl&eacute;s du Outil de mise &agrave; jour</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Le Outil de mise &agrave; jour g&egrave;re les installations des composants du logiciel GlassFish Server contenus dans un m&ecirc;me r&eacute;pertoire du syst&egrave;me de fichiers.</p>
<p>La version de la Console d'administration du Outil de mise &agrave; jour permet d'effectuer les op&eacute;rations suivantes :</p>
<ul>
<li>
<p>Installer des composants d'extension</p>
</li>
<li>
<p>Afficher des mises &agrave; jour pour les composants install&eacute;s</p>
</li>
<li>
<p>Afficher les composants install&eacute;s</p>
</li>
</ul>
<p>Pour mettre &agrave; jour ou enlever des composants install&eacute;s, arr&ecirc;tez le domaine GlassFish Server, puis utilisez l'une des commandes suivantes :</p>
<ul>
<li>
<p>as-install-parent<code>/bin/updatetool</code>, qui d&eacute;marre l'utilitaire graphique de l'outil de mise &agrave; jour</p>
</li>
<li>
<p>as-install-parent<code>/bin/pkg</code>, version de ligne de commande de l'outil de mise &agrave; jour</p>
</li>
</ul>
<p>Les concepts-cl&eacute;s de l'Outil de mise &agrave; jour sont d&eacute;crits dans les sections ci-apr&egrave;s.</p>
<a id="ref-uc-about-component" name="ref-uc-about-component"></a><a id="GHCOM483" name="GHCOM483"></a>
<h5>Composant</h5>
<p>Un composant correspond &agrave; l'unit&eacute; installable que g&egrave;re l'Outil de mise &agrave; jour. Un composant regroupe des fichiers qui sont install&eacute;s ensemble sur le syst&egrave;me dans une image d'installation.</p>
<a id="ref-uc-about-image" name="ref-uc-about-image"></a><a id="GHCOM484" name="GHCOM484"></a>
<h5>Image d'installation</h5>
<p>Une image d'installation correspond au r&eacute;pertoire contenant les composants du logiciel, y compris le contenu du r&eacute;pertoire. L'image d'installation est ajout&eacute;e &agrave; l'Outil de mise &agrave; jour suite au t&eacute;l&eacute;chargement et &agrave; l'installation du logiciel GlassFish Server. Pour vous permettre d'ajouter et de mettre &agrave; jour les composants du logiciel GlassFish Server, chaque image d'installation contient des informations sur l'installation des composants.</p>
<a id="ref-uc-about-repository" name="ref-uc-about-repository"></a><a id="GHCOM485" name="GHCOM485"></a>
<h5>R&eacute;f&eacute;rentiel r&eacute;seau</h5>
<p>Un r&eacute;f&eacute;rentiel r&eacute;seau contient les &eacute;l&eacute;ments suivants :</p>
<ul>
<li>
<p>Composants pouvant &ecirc;tre ajout&eacute;s &agrave; une image d'installation</p>
</li>
<li>
<p>Mises &agrave; jour de composants existants dans une image d'installation</p>
</li>
</ul>
<p>Une image d'installation est associ&eacute;e &agrave; des r&eacute;f&eacute;rentiels r&eacute;seau. Chaque r&eacute;f&eacute;rentiel r&eacute;seau est d&eacute;sign&eacute; par un nom et une URL. Le nom de r&eacute;f&eacute;rentiel est propre &agrave; chaque image d'installation. Il repr&eacute;sente &agrave; la fois l'organisation ou le projet qui g&egrave;re le r&eacute;f&eacute;rentiel et la port&eacute;e bien d&eacute;finie du contenu. Pour en savoir plus sur les r&eacute;f&eacute;rentiels r&eacute;seau pr&eacute;configur&eacute;s de GlassFish Server, reportez-vous &agrave; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSADG00569"><i>Preconfigured Repositories for GlassFish Server</i> dans le manuel <i>Oracle GlassFish Server Administration Guide</i></a>.</p>
<a id="ref-uc-about-addon" name="ref-uc-about-addon"></a><a id="GHCOM486" name="GHCOM486"></a>
<h5>Composant d'extension</h5>
<p>Un composant d'extension est un composant de l'image d'installation qui n'est pas encore install&eacute;.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
