<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-serverinstjvmpathsettings" name="ref-serverinstjvmpathsettings"></a><a id="GHCOM00091" name="GHCOM00091"></a></p>

<h4><a id="sthref330" name="sthref330"></a>Param&egrave;tres du chemin JVM</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Param&egrave;tres du chemin JVM permet de configurer le chemin d'acc&egrave;s &agrave; la biblioth&egrave;que native. Le chemin d'acc&egrave;s &agrave; la biblioth&egrave;que native est une concat&eacute;nation des chemins suivants :</p>
<ul>
<li>
<p>Le pr&eacute;fixe du chemin d'acc&egrave;s &agrave; la biblioth&egrave;que native</p>
</li>
<li>
<p>Le chemin du serveur pour ses biblioth&egrave;ques natives (c'est-&agrave;-dire, as-install<code>/lib</code>)</p>
</li>
<li>
<p>Les r&eacute;pertoires de biblioth&egrave;que native 64 bits, le cas &eacute;ch&eacute;ant</p>
</li>
<li>
<p>La valeur de la variable <code>java.library.path</code> de la JVM utilis&eacute;e pour d&eacute;marrer GlassFish Server (elle diff&egrave;re selon les syst&egrave;mes d'exploitation)</p>
</li>
<li>
<p>Tous les chemins sp&eacute;cifi&eacute;s sur la page <a href="ref-serverinstjvmprofiler.html">Param&egrave;tres de l'analyseur de perfomarnces JVM</a>, si l'analyseur de performances est activ&eacute;</p>
</li>
<li>
<p>Le suffixe du chemin d'acc&egrave;s &agrave; la biblioth&egrave;que native</p>
</li>
</ul>
<p>D'autres param&egrave;tres sont affich&eacute;s comme des valeurs en lecture seule pour les domaines qui ont &eacute;t&eacute; mis &agrave; niveau &agrave; partir d'une version pr&eacute;c&eacute;dente de GlassFish Server. Ils ne sont pas pris en charge dans la version 3.</p>
<p>La page Param&egrave;tres du chemin JVM contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Nom de configuration</dt>
<dd>
<p>Nom de la configuration &agrave; laquelle s'appliquent les param&egrave;tres de cette page. Ce champ est en lecture seule.</p>
</dd>
<dt>Classpath de l'environnement</dt>
<dd>
<p>Si la case Ignorer est coch&eacute;e, la variable d'environnement <code>CLASSPATH</code> est ignor&eacute;e. La variable d'environnement <code>CLASSPATH</code> est utile pour les didacticiels de base relatifs &agrave; la programmation, mais d&eacute;conseill&eacute;e pour les environnements d'entreprise. Ce champ est en lecture seule.</p>
</dd>
<dt>Classpath syst&egrave;me</dt>
<dd>
<p>Chemin des classes sur votre syst&egrave;me. Ce champ est en lecture seule.</p>
</dd>
<dt>Pr&eacute;fixe de classpath</dt>
<dd>
<p>Chemins complets des fichiers JAR &agrave; ajouter au d&eacute;but du classpath du serveur, un par ligne. Ce champ est en lecture seule.</p>
</dd>
<dt>Suffixe de classpath</dt>
<dd>
<p>Chemins complets des fichiers JAR &agrave; ajouter &agrave; la fin du classpath du serveur, un par ligne. Ce champ est en lecture seule.</p>
</dd>
<dt>Pr&eacute;fixe du chemin de la biblioth&egrave;que native</dt>
<dd>
<p>Chemins complets des fichiers JAR &agrave; ajouter au d&eacute;but du chemin de la biblioth&egrave;que native, un par ligne.</p>
</dd>
<dt>Suffixe du chemin de la biblioth&egrave;que native</dt>
<dd>
<p>Chemins complets des fichiers JAR &agrave; ajouter &agrave; la fin du chemin de la biblioth&egrave;que native, un par ligne.</p>
</dd>
</dl>
<a id="sthref331" name="sthref331"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-jvmsettings.html">Configuration des param&egrave;tres g&eacute;n&eacute;raux JVM</a></p>
</li>
<li>
<p><a href="task-jvmpathsettings.html">Configuration des param&egrave;tres du chemin JVM</a></p>
</li>
<li>
<p><a href="task-jvmoptions.html">Configuration des options JVM</a></p>
</li>
<li>
<p><a href="task-securitymanagerdisable.html">D&eacute;sactivation du gestionnaire de s&eacute;curit&eacute;</a></p>
</li>
<li>
<p><a href="task-jvmprofilersettings.html">Configuration des param&egrave;tres de l'analyseur de performances JVM</a></p>
</li>
</ul>
<a id="sthref332" name="sthref332"></a>
<h5>Commandes asadmin connexes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00042"><code>create-jvm-options</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00094"><code>delete-jvm-options</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00180"><code>list-jvm-options</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00050"><code>create-profiler</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00102"><code>delete-profiler</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
