<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-appedit" name="ref-appedit"></a></p>

<h4><a id="sthref271" name="sthref271"></a>Modifier une application</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Pour modifier une application existante, utilisez la page Modifier une application.</p>
<p>Celle-ci contient l'ensemble ou certaines des options suivantes, selon le type d'application.</p>
<dl>
<dt>Nom</dt>
<dd>
<p>Champ en lecture seule indiquant le nom de l'application que vous modifiez.</p>
<p>Le nom peut &ecirc;tre suivi d'un identificateur de version facultatif dont il est s&eacute;par&eacute; par un signe deux-points (<code>:</code>). Pour plus d'informations sur les versions des modules et des applications, reportez-vous &agrave; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> dans le manuel <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt>Statut</dt>
<dd>
<p>Si la case Activ&eacute; est coch&eacute;e, l'application est activ&eacute;e. Cette option est s&eacute;lectionn&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Racine du contexte</dt>
<dd>
<p>Pour une application Web, ce champ sp&eacute;cifie le chemin de l'application. Dans l'URL de l'application Web, la racine du contexte suit imm&eacute;diatement le num&eacute;ro de port (<code>http://</code><i>host</i><code>:</code><i>port</i><code>/</code><i>context-root</i><code>/...</code>). La racine du contexte doit commencer par une barre oblique, par exemple <code>/hello</code>.</p>
</dd>
<dt>Disponibilit&eacute;</dt>
<dd>
<p>Si la case Activ&eacute; est coch&eacute;e, la haute disponibilit&eacute; est activ&eacute;e pour la r&eacute;alisation de points de reprise et &eacute;ventuellement la passivation des sessions Web et des beans Session avec conservation de statut (SFSB). Si la valeur est False (valeur par d&eacute;faut), tous les enregistrements de session Web et la r&eacute;alisation de points de reprise SFSB sont d&eacute;sactiv&eacute;s pour l'application, l'application Web ou le module EJB sp&eacute;cifi&eacute;. Si cette valeur est True, l'application ou le module sp&eacute;cifi&eacute; est activ&eacute; pour la haute disponibilit&eacute;. D&eacute;finissez cette option sur True seulement si la haute disponibilit&eacute; est configur&eacute;e et activ&eacute;e &agrave; des niveaux sup&eacute;rieurs, tels que les niveaux serveur et conteneur.</p>
<p>Cette option appara&icirc;t si des clusters ou des instances de serveur autonomes existent en plus de l'instance de serveur par d&eacute;faut (<code>server</code>).</p>
</dd>
<dt>Serveurs virtuels</dt>
<dd>
<p>Serveurs virtuels associ&eacute;s &agrave; cette application.</p>
<p>L'option Serveurs virtuels appara&icirc;t si seule l'instance de serveur par d&eacute;faut, <code>server</code>, existe. S'il existe des clusters ou d'autres instances de serveur autonomes, vous pouvez s&eacute;lectionner des serveurs virtuels apr&egrave;s le d&eacute;ploiement. Ouvrez la page Modifier une application, s&eacute;lectionnez l'onglet Cible, puis G&eacute;rer les serveurs virtuels pour la cible de votre choix.</p>
</dd>
<dt>Java Web Start</dt>
<dd>
<p>(Pour certains types d'application) Si la case Activ&eacute; est coch&eacute;e, l'application utilise le logiciel Java Web Start. Il permet de d&eacute;ployer des applications Java &agrave; ex&eacute;cuter sur une JVM sans contrainte de navigateur.</p>
</dd>
<dt>Description</dt>
<dd>
<p>Br&egrave;ve description de l'application.</p>
</dd>
<dt>Emplacement</dt>
<dd>
<p>Emplacement de l'application d&eacute;ploy&eacute;e. Ce champ est en lecture seule.</p>
</dd>
<dt>Ordre de d&eacute;ploiement</dt>
<dd>
<p>Ordre de d&eacute;ploiement de l'application.</p>
<p>Les applications ayant le num&eacute;ro le plus faible sont charg&eacute;es en premier au d&eacute;marrage du serveur. Une application ayant un ordre de d&eacute;ploiement de 102 est charg&eacute;e avant une application ayant un ordre de d&eacute;ploiement de 110. Si l'ordre de d&eacute;ploiement n'est pas indiqu&eacute; au moment o&ugrave; une application est d&eacute;ploy&eacute;e, l'ordre de d&eacute;ploiement par d&eacute;faut de 100 est affect&eacute;. Si deux applications ont le m&ecirc;me ordre de d&eacute;ploiement, l'application qui a &eacute;t&eacute; d&eacute;ploy&eacute;e en premier est charg&eacute;e en premier. La sp&eacute;cification d'un ordre de d&eacute;ploiement s'av&egrave;re utile si l'application a des d&eacute;pendances et doit &ecirc;tre charg&eacute;e dans un certain ordre.</p>
</dd>
<dt>Biblioth&egrave;ques</dt>
<dd>
<p>Fichiers JAR de biblioth&egrave;que requis par l'application. Ce champ est en lecture seule.</p>
</dd>
<dt>Modules et composants</dt>
<dd>
<p>Table affichant les noms des modules de l'application et leurs moteurs. Pour une adresse de service Web, vous pouvez s&eacute;lectionner Afficher l'adresse pour obtenir la page Informations relatives &agrave; une adresse de service Web. Pour un client d'application, vous pouvez s&eacute;lectionner Lancer pour afficher la page de lancement du client d'application ou T&eacute;l&eacute;charger les stubs client pour t&eacute;l&eacute;charger les stubs client.</p>
</dd>
</dl>
<a id="sthref272" name="sthref272"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-appedit.html">Modification d'une application d&eacute;ploy&eacute;e</a></p>
</li>
<li>
<p><a href="task-applistdeployed.html">Affichage de la liste des applications d&eacute;ploy&eacute;es</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">D&eacute;ploiement d'une application Web</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">D&eacute;ploiement d'une application d'entreprise</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">D&eacute;ploiement d'un client d'application</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">D&eacute;ploiement d'un module connecteur</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">D&eacute;ploiement d'un fichier JAR EJB</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">Affichage des descripteurs d'une application</a></p>
</li>
<li>
<p><a href="task-appviewtargets.html">Affichage des cibles d'application</a></p>
</li>
<li>
<p><a href="task-endpoint.html">Affichage des informations d'adresse pour un service Web</a></p>
</li>
<li>
<p><a href="task-applaunch.html">Lancement d'une application</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">Lancement d'un client d'application</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">T&eacute;l&eacute;chargement de stubs client d'application</a></p>
</li>
<li>
<p><a href="task-appredeploy.html">Red&eacute;ploiement d'une application d&eacute;ploy&eacute;e</a></p>
</li>
<li>
<p><a href="task-apprestart.html">Rechargement d'une application d&eacute;ploy&eacute;e</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">Affichage de ressources de niveau application</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">Modification de ressources de niveau application</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
