<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-uc-config" name="ref-uc-config"></a></p>

<h4><a id="sthref465" name="sthref465"></a>Configuration de l'Outil de mise &agrave; jour</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Configuration contient les informations de configuration de l'Outil de mise &agrave; jour et permet de modifier le mode de connexion &agrave; Internet de l'&amp;UpdateToolAdminConsoleNode. Pour modifier d'autres aspects de la configuration Outil de mise &agrave; jour, utilisez l'application <code>updatetool</code> autonome situ&eacute;e dans as-install-parent<code>/bin</code>.</p>
<p>La page Configuration de l'Outil de mise &agrave; jour contient les options suivantes :</p>
<dl>
<dt>Chemin d'installation</dt>
<dd>
<p>Chemin du syst&egrave;me de fichiers du r&eacute;pertoire racine ou du r&eacute;pertoire de niveau sup&eacute;rieur de l'image d'installation.</p>
</dd>
<dt>R&eacute;f&eacute;rentiel pr&eacute;f&eacute;r&eacute;</dt>
<dd>
<p>Nom du r&eacute;f&eacute;rentiel r&eacute;seau pr&eacute;f&eacute;r&eacute; qui est associ&eacute; &agrave; cette image d'installation, par exemple <code>glassfish.org</code>.</p>
</dd>
<dt>Connexion Internet</dt>
<dd>
<p>Mode de connexion de GlassFish Server &agrave; Internet :</p>
<dl>
<dt>Connexion directe</dt>
<dd>
<p>Cette option signifie que GlassFish Server se connecte directement &agrave; Internet.</p>
</dd>
<dt>Via un proxy</dt>
<dd>
<p>Cette option signifie que GlassFish Server se connecte &agrave; Internet via un serveur proxy. Lorsque cette option est s&eacute;lectionn&eacute;e, les champs H&ocirc;te proxy et Port proxy sont ajout&eacute;s &agrave; la page.</p>
</dd>
</dl>
</dd>
<dt>H&ocirc;te proxy</dt>
<dd>
<p>Nom d'h&ocirc;te du serveur proxy de l'ordinateur sur lequel GlassFish Server est ex&eacute;cut&eacute;.</p>
<p>Ce champ est applicable uniquement si l'ordinateur sur lequel GlassFish Server est ex&eacute;cut&eacute; se connecte &agrave; Internet via un serveur proxy.</p>
</dd>
<dt>Port proxy</dt>
<dd>
<p>Num&eacute;ro de port du serveur proxy de l'ordinateur sur lequel GlassFish Server est ex&eacute;cut&eacute;.</p>
<p>Ce champ est applicable uniquement si l'ordinateur sur lequel GlassFish Server est ex&eacute;cut&eacute; se connecte &agrave; Internet via un serveur proxy.</p>
</dd>
<dt>R&eacute;f&eacute;rentiels</dt>
<dd>
<p>Cette table pr&eacute;sente les informations ci-dessous pour chaque r&eacute;f&eacute;rentiel r&eacute;seau associ&eacute; &agrave; cette image d'installation :</p>
<dl>
<dt>R&eacute;f&eacute;rentiel</dt>
<dd>
<p>Nom du r&eacute;f&eacute;rentiel, par exemple, <code>dev.glassfish.org</code> .</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref466" name="sthref466"></a>
<h5>T&acirc;ches connexes</h5>
<p><a href="task-uc-set-proxy.html">Configuration des param&egrave;tres de proxy r&eacute;seau permettant d'acc&eacute;der &agrave; des r&eacute;f&eacute;rentiels r&eacute;seau</a></p>
<a id="sthref467" name="sthref467"></a>
<h5>Commandes asadmin connexes</h5>
<p>Aucune.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
