<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-messagesecurityconfigedit" name="ref-messagesecurityconfigedit"></a><a id="GHCOM00120" name="GHCOM00120"></a></p>

<h4><a id="sthref410" name="sthref410"></a>Modifier la configuration de la s&eacute;curit&eacute; des messages</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Modifier la configuration de la s&eacute;curit&eacute; des messages permet d'activer les fournisseurs de s&eacute;curit&eacute; des messages.</p>
<p>Pour activer la s&eacute;curit&eacute; des messages au niveau des adresses des services Web d&eacute;ploy&eacute;s sur GlassFish Server, vous devez sp&eacute;cifier un fournisseur &agrave; utiliser par d&eacute;faut c&ocirc;t&eacute; serveur. Si vous activez un fournisseur de s&eacute;curit&eacute; des messages par d&eacute;faut, vous devez &eacute;galement activer les fournisseurs qu'utiliseront les clients des services Web d&eacute;ploy&eacute;s sur GlassFish Server. L'activation des fournisseurs utilis&eacute;s par les clients est abord&eacute;e dans <a href="task-enablemesec4appclients.html">Activation de la s&eacute;curit&eacute; des messages pour les clients d'application</a>.</p>
<p>Pour activer la s&eacute;curit&eacute; des messages pour les appels de service Web provenant des adresses d&eacute;ploy&eacute;es, vous devez sp&eacute;cifier un fournisseur c&ocirc;t&eacute; client par d&eacute;faut. Si vous avez activ&eacute; un fournisseur c&ocirc;t&eacute; client par d&eacute;faut pour GlassFish Server, vous devez vous assurer que les services appel&eacute;s depuis les adresses d&eacute;ploy&eacute;es sur GlassFish Server sont configur&eacute;s d'une mani&egrave;re compatible avec la s&eacute;curit&eacute; de la couche Messages.</p>
<p>La page Modifier la configuration de la s&eacute;curit&eacute; des messages contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Nom de configuration</dt>
<dd>
<p>Nom de la configuration &agrave; laquelle s'appliquent les param&egrave;tres de cette page. Ce champ est en lecture seule.</p>
</dd>
<dt>Couche d'authentification</dt>
<dd>
<p>Couche Messages au niveau de laquelle l'authentification est effectu&eacute;e. Ce champ est en lecture seule. La valeur est <code>SOAP</code> (pour la configuration de s&eacute;curit&eacute; des messages par d&eacute;faut) ou <code>HttpServlet</code>.</p>
</dd>
<dt>Fournisseur par d&eacute;faut</dt>
<dd>
<p>Fournisseur c&ocirc;t&eacute; serveur par d&eacute;faut, le cas &eacute;ch&eacute;ant. Le fournisseur c&ocirc;t&eacute; serveur par d&eacute;faut, &eacute;galement appel&eacute; fournisseur par d&eacute;faut, identifie le fournisseur c&ocirc;t&eacute; serveur appel&eacute; si l'application n'identifie aucun fournisseur c&ocirc;t&eacute; serveur sp&eacute;cifique. Les choix disponibles sont <code>ServerProvider</code>, <code>XWS_ServerProvider</code> ou aucun. Par d&eacute;faut, aucun fournisseur n'est s&eacute;lectionn&eacute;, afin que GlassFish Server n'appelle pas de fournisseur de s&eacute;curit&eacute; des messages c&ocirc;t&eacute; serveur. En r&egrave;gle g&eacute;n&eacute;rale, s&eacute;lectionnez <code>ServerProvider</code> comme fournisseur par d&eacute;faut.</p>
</dd>
<dt>Fournisseur client par d&eacute;faut</dt>
<dd>
<p>Fournisseur c&ocirc;t&eacute; client par d&eacute;faut, le cas &eacute;ch&eacute;ant. Le fournisseur c&ocirc;t&eacute; client par d&eacute;faut identifie le fournisseur c&ocirc;t&eacute; client appel&eacute; si l'application n'identifie aucun fournisseur c&ocirc;t&eacute; client sp&eacute;cifique. Les choix disponibles sont <code>ClientProvider</code>, <code>XWS_ClientProvider</code> ou aucun. Par d&eacute;faut, aucun fournisseur n'est s&eacute;lectionn&eacute;, afin que GlassFish Server n'appelle pas de fournisseur de s&eacute;curit&eacute; des messages c&ocirc;t&eacute; client. En r&egrave;gle g&eacute;n&eacute;rale, s&eacute;lectionnez "aucun" comme fournisseur c&ocirc;t&eacute; client par d&eacute;faut. S&eacute;lectionnez <code>ClientProvider</code> pour activer une r&egrave;gle de protection des messages et de fournisseur par d&eacute;faut &agrave; appliquer aux appels de service Web provenant des adresses de services Web d&eacute;ploy&eacute;es sur GlassFish Server.</p>
</dd>
</dl>
<a id="sthref411" name="sthref411"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">Configuration des utilitaires GlassFish Server que les fournisseurs de s&eacute;curit&eacute; des messages doivent utiliser</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">Cr&eacute;ation d'une configuration de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">Modification d'une configuration de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">Suppression d'une configuration de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">Cr&eacute;ation d'une configuration de fournisseur de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">Modification d'une configuration de fournisseur de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">Suppression d'une configuration de fournisseur de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">Activation de la s&eacute;curit&eacute; des messages pour les clients d'application</a></p>
</li>
</ul>
<a id="sthref412" name="sthref412"></a>
<h5>Commandes asadmin connexes</h5>
<p>Utilisez la commande <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00226"><code>set</code>(1)</a> pour modifier la configuration de s&eacute;curit&eacute; des messages.</p>
<ul>
<li>
<p>Pour sp&eacute;cifier le fournisseur c&ocirc;t&eacute; serveur par d&eacute;faut, entrez la commande suivante :</p>
<pre>
asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
default_provider=ServerProvider
</pre></li>
<li>
<p>Pour sp&eacute;cifier le fournisseur c&ocirc;t&eacute; client par d&eacute;faut, entrez la commande suivante :</p>
<pre>
asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
default_client_provider=ClientProvider
</pre></li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
