<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-domainattributestab" name="ref-domainattributestab"></a></p>

<h4><a id="sthref124" name="sthref124"></a>Attributs de domaine</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Attributs de domaine permet de d&eacute;finir les attributs de domaine avanc&eacute;s de GlassFish Server.</p>
<p>Elle contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Charger la console apr&egrave;s le d&eacute;marrage de DAS</dt>
<dd>
<p>Indique les conditions de chargement de la Console d'administration :</p>
<dl>
<dt>En fonction de l'utilisation</dt>
<dd>
<p>Charge la Console d'administration apr&egrave;s le serveur d'administration de domaine (DAS) si la console a &eacute;t&eacute; utilis&eacute;e dans les derni&egrave;res 24 heures ou si des instances de serveur autres que celles du serveur DAS existent. Il s'agit de la valeur par d&eacute;faut.</p>
</dd>
<dt>Toujours</dt>
<dd>
<p>Charge toujours la Console d'administration apr&egrave;s le serveur DAS. La console est charg&eacute;e une fois la s&eacute;quence de d&eacute;marrage principale de GlassFish Server termin&eacute;e.</p>
</dd>
<dt>Jamais</dt>
<dd>
<p>Ne charge jamais la Console d'administration apr&egrave;s le serveur DAS. La console est charg&eacute;e une fois l'acc&egrave;s &agrave; celle-ci demand&eacute;.</p>
</dd>
</dl>
</dd>
<dt>Racine application</dt>
<dd>
<p>Chemin complet du r&eacute;pertoire o&ugrave; r&eacute;sident les applications d&eacute;ploy&eacute;es. La valeur par d&eacute;faut est domain-dir<code>/applications</code>.</p>
</dd>
<dt>Racine journal</dt>
<dd>
<p>Identifie l'emplacement de stockage des fichiers journaux du serveur. La valeur par d&eacute;faut est domain-dir<code>/logs</code>.</p>
</dd>
<dt>Environnement local</dt>
<dd>
<p>Si ce champ n'est pas renseign&eacute;, l'environnement local par d&eacute;faut de l'h&ocirc;te est utilis&eacute;.</p>
<p>Un environnement local est un identificateur qui sp&eacute;cifie une combinaison particuli&egrave;re de langue et de r&eacute;gion. Par exemple, l'environnement local pour l'anglais des Etats-Unis est <code>en_US</code> et pour le japonais, <code>ja_JP</code>. Pour utiliser un environnement local non anglophone, GlassFish Server doit &ecirc;tre localis&eacute;, c'est-&agrave;-dire adapt&eacute; de l'anglais en une autre langue.</p>
</dd>
</dl>
<a id="GHCOM338" name="GHCOM338"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-setadvanceappconfig.html">D&eacute;finition de la configuration des applications</a></p>
</li>
<li>
<p><a href="task-setadvancedomainattributes.html">D&eacute;finition des attributs de domaine</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
