<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jaccprovidernew" name="ref-jaccprovidernew"></a></p>

<h4><a id="sthref396" name="sthref396"></a>Nouveau fournisseur JACC</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Nouveau fournisseur JACC permet de cr&eacute;er un fournisseur JACC (Java Authorization Contract for Containers) conforme &agrave; la JSR-115/196 pouvant &ecirc;tre utilis&eacute; par des modules d'autorisation tiers pour des applications ex&eacute;cut&eacute;es sur GlassFish Server. Le fournisseur JACC est cr&eacute;&eacute; en tant qu'&eacute;l&eacute;ment <code>jacc-provider</code> &agrave; l'int&eacute;rieur de l'&eacute;l&eacute;ment <code>security-service</code>, dans le fichier <code>domain.xml</code> du domaine.</p>
<p>L'installation par d&eacute;faut de GlassFish Server comprend deux fournisseurs JACC, nomm&eacute;s <code>default</code> et <code>simple</code>. Tous les fournisseurs JACC que vous cr&eacute;ez s'ajoutent &agrave; ces deux fournisseurs par d&eacute;faut. Les fournisseurs JACC GlassFish Server par d&eacute;faut impl&eacute;mentent un moteur d'autorisation simple, bas&eacute; sur des fichiers et conforme &agrave; la sp&eacute;cification JACC.</p>
<p>Tous les fournisseurs JACC GlassFish Server doivent utiliser les API JAAS (Java Authentication and Authorization Service). JAAS permet aux services d'authentifier les utilisateurs et de leur appliquer des contr&ocirc;les d'acc&egrave;s. JAAS impl&eacute;mente une version Java de la structure PAM (Pluggable Authentication Module) standard.</p>
<p>La JSR 196 permet de d&eacute;velopper des plug-ins sur diff&eacute;rentes couches. Vous pouvez d&eacute;finir des plug-ins modifiant la mani&egrave;re dont les nouveaux m&eacute;canismes d'authentification sont configur&eacute;s, tels que <code>AuthConfigProvider</code> et <code>AuthConfigFactory</code>. Vous pouvez &eacute;galement d&eacute;finir de nouveaux m&eacute;canismes d'authentification, tels que <code>ServerAuthModule</code> et <code>ClientAuthModule</code>.</p>
<p>La page Nouveau fournisseur JACC contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Nom de configuration</dt>
<dd>
<p>Nom de la configuration &agrave; laquelle s'appliquent les param&egrave;tres de cette page. Ce champ est en lecture seule.</p>
</dd>
<dt>Nom</dt>
<dd>
<p>Nom du fournisseur JACC. Ce nom est utilis&eacute; pour r&eacute;f&eacute;rencer l'&eacute;l&eacute;ment <code>jacc-provider</code> dans <code>domain.xml</code>.</p>
</dd>
<dt>Configuration de r&egrave;gles</dt>
<dd>
<p>Nom qualifi&eacute; complet de l'&eacute;l&eacute;ment <code>javax.security.jacc.PolicyConfigurationFactory.provider</code> qui impl&eacute;mente l'&eacute;l&eacute;ment <code>javax.security.jacc.PolicyConfigurationFactory</code> propre au fournisseur.</p>
</dd>
<dt>Fournisseur de r&egrave;gles</dt>
<dd>
<p>Nom qualifi&eacute; complet de l'&eacute;l&eacute;ment <code>javax.security.jacc.policy.provider</code> qui impl&eacute;mente l'&eacute;l&eacute;ment <code>java.security.Policy</code>.</p>
</dd>
<dt>Autres propri&eacute;t&eacute;s</dt>
<dd>
<p>Propri&eacute;t&eacute;s suppl&eacute;mentaires pour le fournisseur JACC. Pour obtenir une description des propri&eacute;t&eacute;s suppl&eacute;mentaires disponibles pour les fournisseurs JACC, reportez-vous &agrave; <a href="ref-jaccproviderprop.html">Propri&eacute;t&eacute;s propres aux fournisseurs JACC</a>.</p>
</dd>
</dl>
<a id="sthref397" name="sthref397"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-jaccprovidernew.html">Cr&eacute;ation d'un fournisseur JACC</a></p>
</li>
<li>
<p><a href="task-jaccprovideredit.html">Modification d'un fournisseur JACC</a></p>
</li>
<li>
<p><a href="task-jaccproviderdelete.html">Suppression d'un fournisseur JACC</a></p>
</li>
</ul>
<a id="sthref398" name="sthref398"></a>
<h5>Commandes asadmin connexes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00034"><code>create-jacc-provider</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00086"><code>delete-jacc-provider</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00171"><code>list-jacc-providers</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
