<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-managefilerealm" name="ref-managefilerealm"></a><a id="GHCOM00106" name="GHCOM00106"></a></p>

<h4><a id="sthref371" name="sthref371"></a>Utilisateurs de fichiers</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Utilisateurs de fichiers permet de g&eacute;rer les utilisateurs de domaine <code>file</code>. Les utilisateurs et les groupes du domaine <code>file</code> sont r&eacute;pertori&eacute;s dans le fichier de cl&eacute;s, dont l'emplacement est sp&eacute;cifi&eacute; par la propri&eacute;t&eacute; <code>file</code>.</p>
<p>Un utilisateur du domaine <code>file</code> peut appartenir &agrave; un <i>groupe Java</i>, c'est-&agrave;-dire une cat&eacute;gorie d'utilisateurs class&eacute;s selon des caract&eacute;ristiques communes. Par exemple, les clients d'une application d'e-commerce appartiendront au groupe <code>CUSTOMER</code>, tandis que les plus gros clients appartiendront au groupe <code>PREFERRED</code>. La classification des utilisateurs dans des groupes facilite le contr&ocirc;le de l'acc&egrave;s d'un grand nombre d'utilisateurs.</p>
<p>Juste apr&egrave;s l'installation de GlassFish Server, le seul utilisateur est l'administrateur configur&eacute; lors de l'installation. Par d&eacute;faut, cet utilisateur appartient au groupe <code>asadmin</code>, du domaine <code>admin-realm</code>, qui autorise la modification de GlassFish Server. Les utilisateurs affect&eacute;s &agrave; ce groupe auront des privil&egrave;ges d'administrateur, c'est-&agrave;-dire qu'ils auront acc&egrave;s &agrave; l'outil <code>asadmin</code> et &agrave; la Console d'administration.</p>
<p>La page Utilisateurs de fichiers affiche la liste des utilisateurs du domaine s&eacute;lectionn&eacute;. Pour chaque utilisateur, les informations suivantes sont fournies :</p>
<dl>
<dt>ID utilisateur</dt>
<dd>
<p>Nom utilisateur.</p>
</dd>
<dt>Liste des groupes</dt>
<dd>
<p>Groupes auxquels l'utilisateur appartient.</p>
</dd>
</dl>
<p>La table Utilisateurs de fichiers contient &eacute;galement les options ci-apr&egrave;s.</p>
<dl>
<dt>Nouveau</dt>
<dd>
<p>Bouton permettant de cr&eacute;er un utilisateur.</p>
</dd>
<dt>Supprimer</dt>
<dd>
<p>Bouton permettant de supprimer les utilisateurs s&eacute;lectionn&eacute;s.</p>
</dd>
</dl>
<a id="sthref372" name="sthref372"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-fileuserscreate.html">Ajout d'un utilisateur au domaine de fichiers</a></p>
</li>
<li>
<p><a href="task-fileusersedit.html">Modification des informations relatives &agrave; l'utilisateur du domaine de fichiers</a></p>
</li>
<li>
<p><a href="task-fileusersdelete.html">Suppression d'un utilisateur du domaine de fichiers</a></p>
</li>
</ul>
<a id="sthref373" name="sthref373"></a>
<h5>Commandes asadmin connexes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00165"><code>list-file-users</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00024"><code>create-file-user</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00254"><code>update-file-user</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00076"><code>delete-file-user</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
