<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-editcertrealm" name="ref-editcertrealm"></a><a id="GHCOM00101" name="GHCOM00101"></a></p>

<h4><a id="sthref361" name="sthref361"></a><a id="sthref362" name="sthref362"></a>Propri&eacute;t&eacute;s propres &agrave; la classe <code>CertificateRealm</code></h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Le domaine <code>certificate</code> prend en charge l'authentification SSL. Ce domaine &eacute;tablit l'identit&eacute; de l'utilisateur dans le contexte de s&eacute;curit&eacute; de GlassFish Server, &agrave; partir des donn&eacute;es utilisateur provenant des certificats client v&eacute;rifi&eacute;s cryptographiquement se trouvant dans les fichiers de keystore et de truststore. Ajoutez des utilisateurs &agrave; ces fichiers &agrave; l'aide de <code>keytool</code> ou de <code>certutil</code>. Pour plus d'informations, reportez-vous &agrave; la <a href="http://www.oracle.com/pls/topic/lookup?ctx=dsc&amp;id=/app/docs/doc/821-1841#gijrp">partie&nbsp;VII, <i>Security</i>, du manuel <i>The Java EE 6 Tutorial</i></a>.</p>
<p>Le domaine <code>certificate</code> est utilis&eacute; par les conteneurs Java pour traiter les autorisations en fonction du nom distinctif (DN) de chaque utilisateur mentionn&eacute; dans son certificat. Le DN est le nom de l'entit&eacute; dont le certificat identifie la cl&eacute; publique. Ce nom utilise la norme X.500 ; il doit donc &ecirc;tre unique sur Internet. Pour plus d'informations sur les keystores et les truststores, reportez-vous &agrave; la documentation keytool (<code><a href="http://java.sun.com/j2se/1.4.2/docs/tooldocs/solaris/keytool.html">http://java.sun.com/j2se/1.4.2/docs/tooldocs/solaris/keytool.html</a></code>).</p>
<p>La propri&eacute;t&eacute; facultative suivante est disponible pour le domaine <code>certificate</code>.</p>
<dl>
<dt>Affecter des groupes</dt>
<dd>
<p>Liste de noms de groupe s&eacute;par&eacute;s par une virgule. Tous les clients pr&eacute;sentant un certificat valide sont affect&eacute;s &agrave; ces groupes, comme par exemple <code>employee,manager</code> qui sont des noms de groupes d'utilisateurs.</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
