<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-uc-pkgdetails" name="ref-uc-pkgdetails"></a><a id="GHCOM00137" name="GHCOM00137"></a></p>

<h4><a id="sthref462" name="sthref462"></a>D&eacute;tails du composant</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page D&eacute;tails du composant fournit des informations d&eacute;taill&eacute;es &agrave; propos d'un composant.</p>
<p>Elle contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Pr&eacute;c&eacute;dent</dt>
<dd>
<p>Ce bouton permet de revenir &agrave; la page sur laquelle vous avez s&eacute;lectionn&eacute; le composant dont vous consultez les d&eacute;tails.</p>
</dd>
<dt>Nom du package</dt>
<dd>
<p>Nom du package comprenant le composant.</p>
</dd>
<dt>Identificateur unique</dt>
<dd>
<p>Identificateur qualifi&eacute; complet du composant tel qu'il existe dans le r&eacute;f&eacute;rentiel.</p>
</dd>
<dt>Cat&eacute;gorie</dt>
<dd>
<p>Cat&eacute;gorie du logiciel auquel le composant est associ&eacute; (par exemple, serveurs d'applications, outils syst&egrave;me et bases de donn&eacute;es). La cat&eacute;gorie est affect&eacute;e au composant par le fabricant au moment de la cr&eacute;ation du composant.</p>
</dd>
<dt>Version</dt>
<dd>
<p>Num&eacute;ro de version du package comprenant le composant.</p>
</dd>
<dt>Date de publication</dt>
<dd>
<p>Date et heure auxquelles cette version du composant a &eacute;t&eacute; publi&eacute;e dans le r&eacute;f&eacute;rentiel. Cette date <i>ne correspond pas</i> &agrave; la date et &agrave; l'heure auxquelles le composant a &eacute;t&eacute; install&eacute; dans l'image d'installation.</p>
</dd>
<dt>Taille apr&egrave;s installation</dt>
<dd>
<p>Espace disque utilis&eacute; pour l'installation du composant.</p>
</dd>
<dt>Source</dt>
<dd>
<p>Pour un composant install&eacute;, nom du <a href="ref-uc-concepts.html#ref-uc-about-repository">R&eacute;f&eacute;rentiel r&eacute;seau</a> &agrave; partir duquel le composant a &eacute;t&eacute; obtenu.</p>
<p>Pour un composant d'extension ou une mise &agrave; jour, nom du r&eacute;f&eacute;rentiel r&eacute;seau &agrave; partir duquel le composant a &eacute;t&eacute; obtenu.</p>
</dd>
<dt>Description</dt>
<dd>
<p>Pr&eacute;sentation du composant.</p>
</dd>
</dl>
<a id="sthref463" name="sthref463"></a>
<h5>T&acirc;ches connexes</h5>
<p><a href="task-uc-pkgdetails.html">Affichage des informations d&eacute;taill&eacute;es sur un composant</a></p>
<a id="sthref464" name="sthref464"></a>
<h5>Commandes asadmin connexes</h5>
<p>Aucune.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
