<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-securityadmin" name="ref-securityadmin"></a></p>

<h4>Administration s&eacute;curis&eacute;e</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilisez la page Administration s&eacute;curis&eacute;e pour activer ou d&eacute;sactiver l'administration s&eacute;curis&eacute;e.</p>
<p>Lorsque l'administration s&eacute;curis&eacute;e est activ&eacute;e :</p>
<ul>
<li>
<p>Le serveur DAS et les instances du domaine utilisent des certificats SSL pour crypter les messages qu'ils &eacute;changent.</p>
</li>
<li>
<p>Le serveur DAS accepte les messages d'administration des clients admin distants tels que l'utilitaire asadmin et les IDE.</p>
</li>
</ul>
<p>La page Administration s&eacute;curis&eacute;e contient les informations ci-apr&egrave;s.</p>
<dl>
<dt>Activer l'administration s&eacute;curis&eacute;e</dt>
<dd>
<p>Bouton permettant d'activer l'administration s&eacute;curis&eacute;e. Ce bouton appara&icirc;t uniquement lorsque l'administration s&eacute;curis&eacute;e est d&eacute;sactiv&eacute;e.</p>

<hr>
<p><b>Remarque:</b></p>
Si l'administrateur du domaine poss&egrave;de un mot de passe vide, les tentatives d'activation de l'administration s&eacute;curis&eacute;e &eacute;chouent.
<hr>

</dd>
<dt>D&eacute;sactiver l'administration s&eacute;curis&eacute;e</dt>
<dd>
<p>Bouton permettant de d&eacute;sactiver l'administration s&eacute;curis&eacute;e. Ce bouton appara&icirc;t uniquement lorsque l'administration s&eacute;curis&eacute;e est activ&eacute;e.</p>
</dd>
<dt>Alias d'administration</dt>
<dd>
<p>Alias qui fait r&eacute;f&eacute;rence au certificat SSL/TLS sur le serveur DAS. Le serveur DAS utilise cet alias pour s'identifier aupr&egrave;s des instances. La valeur par d&eacute;faut est <code>s1as</code>. Cette option appara&icirc;t uniquement lorsque l'administration s&eacute;curis&eacute;e est d&eacute;sactiv&eacute;e.</p>
</dd>
<dt>Alias d'instance</dt>
<dd>
<p>Alias qui fait r&eacute;f&eacute;rence au certificat SSL/TLS sur les instances. Les instances utilisent cet alias pour s'identifier aupr&egrave;s du serveur DAS. La valeur par d&eacute;faut est <code>glassfish-instance</code>. Cette option appara&icirc;t uniquement lorsque l'administration s&eacute;curis&eacute;e est d&eacute;sactiv&eacute;e.</p>
</dd>
</dl>
<a id="sthref246" name="sthref246"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-enable-secure-admin.html">Activation de l'administration s&eacute;curis&eacute;e</a></p>
</li>
<li>
<p><a href="task-disable-secure-admin.html">D&eacute;sactivation de l'administration s&eacute;curis&eacute;e</a></p>
</li>
</ul>
<a id="sthref247" name="sthref247"></a>
<h5>Commandes asadmin connexes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00129"><code>enable-secure-admin</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00121"><code>disable-secure-admin</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
