<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-generaltab" name="ref-generaltab"></a></p>

<h4><a id="sthref137" name="sthref137"></a><a id="sthref138" name="sthref138"></a>Informations g&eacute;n&eacute;rales</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>GlassFish Server cr&eacute;e une instance de serveur d'applications nomm&eacute;e <code>server</code> au moment de l'installation. Vous pouvez supprimer l'instance de serveur et en cr&eacute;er une portant un autre nom.</p>
<p>Chaque instance GlassFish Server a sa propre configuration Java, ainsi que ses propres ressources Java, zones de d&eacute;ploiement d'application et param&egrave;tres de configuration de serveur. Les modifications apport&eacute;es &agrave; une instance de serveur d'applications n'ont aucun effet sur les autres instances de serveur d'applications. Vous pouvez disposer d'une seule instance de serveur d'applications dans un domaine d'administration.</p>
<p>Pour de nombreux utilisateurs, une instance de serveur d'applications suffit. Cependant, en fonction de votre environnement, vous pouvez avoir besoin de cr&eacute;er des instances de serveur d'applications suppl&eacute;mentaires. Par exemple, dans un environnement de d&eacute;veloppement, vous pouvez utiliser diff&eacute;rentes instances de serveur d'applications pour tester diff&eacute;rentes configurations GlassFish Server, ou pour comparer et tester diff&eacute;rents d&eacute;ploiements d'application. Les instances de serveur d'applications &eacute;tant faciles &agrave; ajouter ou &agrave; supprimer, vous pouvez les utiliser pour cr&eacute;er des zones de stockage temporaires (ou mod&egrave;les d'environnement restreint) &agrave; tester pendant le d&eacute;veloppement.</p>
<p>De plus, pour chaque instance de serveur d'applications, vous pouvez &eacute;galement cr&eacute;er des serveurs virtuels. Dans une seule instance de serveur d'applications install&eacute;e, vous pouvez attribuer des noms de domaine, des adresses IP et certaines fonctions d'administration &agrave; des entreprises ou des personnes. Les utilisateurs ont les m&ecirc;mes avantages que s'ils disposaient de leur propre serveur Web, sans la maintenance du serveur et du mat&eacute;riel. Ces serveurs virtuels ne couvrent pas les instances de serveur d'applications. Pour plus d'informations sur les serveurs virtuels, reportez-vous &agrave; <a href="ref-serverinstjvmgeneral.html">Param&egrave;tres g&eacute;n&eacute;raux JVM</a>.</p>
<p>Dans les d&eacute;ploiements op&eacute;rationnels, vous pouvez, pour de nombreuses raisons, utiliser des serveurs virtuels plut&ocirc;t que plusieurs instances de serveur d'applications. Cependant, si les serveurs virtuels ne r&eacute;pondent pas &agrave; vos besoins, vous pouvez &eacute;galement utiliser plusieurs instances de serveur d'applications.</p>
<p>Une instance GlassFish Server ne d&eacute;marre pas automatiquement. Une fois que vous avez d&eacute;marr&eacute; une instance, elle est ex&eacute;cut&eacute;e jusqu'&agrave; ce que vous l'arr&ecirc;tiez. Lorsque vous arr&ecirc;tez une instance de serveur d'applications, elle cesse d'accepter de nouvelles connexions, puis attend la fin de toutes les connexions restantes. Si votre ordinateur tombe en panne ou est mis hors ligne, le serveur est arr&ecirc;t&eacute; et toutes les demandes qu'il traitait risquent d'&ecirc;tre perdues.</p>
<p>La page Informations g&eacute;n&eacute;rales permet de v&eacute;rifier les param&egrave;tres de GlassFish Server et d'afficher les donn&eacute;es de la JVM.</p>
<p>Elle contient les informations ci-apr&egrave;s.</p>
<dl>
<dt>Bouton Arr&ecirc;ter</dt>
<dd>
<p>Cliquez sur le bouton Arr&ecirc;ter pour arr&ecirc;ter GlassFish Server.</p>
</dd>
<dt>Bouton Red&eacute;marrer</dt>
<dd>
<p>Cliquez sur le bouton Red&eacute;marrer pour red&eacute;marrer GlassFish Server.</p>
</dd>
<dt>Bouton Afficher les fichiers journaux</dt>
<dd>
<p>Cliquez sur le bouton Afficher les fichiers journaux pour visualiser les fichiers journaux d'un cluster ou d'une instance GlassFish Server.</p>
</dd>
<dt>Bouton Changer de journal</dt>
<dd>
<p>Cliquez sur le bouton Changer de journal pour changer le fichier journal du serveur d'administration (nomm&eacute; <code>server</code>).</p>
</dd>
<dt>Bouton R&eacute;cup&eacute;rer une transaction</dt>
<dd>
<p>Cliquez sur le bouton R&eacute;cup&eacute;rer une transaction pour r&eacute;cup&eacute;rer des transactions pour le serveur d'administration (nomm&eacute; <code>server</code>) sur la page <a href="ref-recovertransactions.html">R&eacute;cup&eacute;rer les transactions</a>.</p>
</dd>
<dt>Bouton Administration s&eacute;curis&eacute;e</dt>
<dd>
<p>Cliquez sur le bouton Administration s&eacute;curis&eacute;e pour activer ou d&eacute;sactiver l'administration s&eacute;curis&eacute;e sur la page <a href="ref-securityadmin.html">Administration s&eacute;curis&eacute;e</a>.</p>
</dd>
<dt>Nom</dt>
<dd>
<p>Nom du serveur en cours.</p>
</dd>
<dt>Statut</dt>
<dd>
<p>Statut en cours de l'instance de serveur. Le serveur peut &ecirc;tre arr&ecirc;t&eacute;, d&eacute;marr&eacute; ou en cours d'ex&eacute;cution.</p>
</dd>
<dt>Temps d'activit&eacute;</dt>
<dd>
<p>Nombre d'heures et de minutes pendant lequel l'instance de serveur a &eacute;t&eacute; continuellement en cours d'ex&eacute;cution. Cet &eacute;l&eacute;ment est en lecture seule.</p>
</dd>
<dt>Equilibreur de charge HTTP</dt>
<dd>
<p>Nom de l'&eacute;quilibreur de charge, s'il est activ&eacute; pour l'instance de serveur.</p>
</dd>
<dt>JVM</dt>
<dd>
<p>Si vous cliquez sur Rapport JVM, une fen&ecirc;tre distincte s'ouvre et affiche des rapports sur la Java Virtual Machine, notamment un rapport r&eacute;capitulatif, un rapport sur la gestion et le nettoyage de la m&eacute;moire, un rapport de chargement de classes et le vidage des threads en cours.</p>
</dd>
<dt>R&eacute;pertoire de configuration</dt>
<dd>
<p>R&eacute;pertoire de l'ordinateur h&ocirc;te qui contient les fichiers de configuration, tels que <code>domain.xml</code>.</p>
</dd>
<dt>Version install&eacute;e</dt>
<dd>
<p>Identificateur de la version du produit.</p>
</dd>
<dt>Administration s&eacute;curis&eacute;e</dt>
<dd>
<p>Statut en cours de l'administration s&eacute;curis&eacute;e. Les valeurs possibles sont Activ&eacute; et Non activ&eacute;.</p>
</dd>
<dt>D&eacute;boguer</dt>
<dd>
<p>Indique si le d&eacute;bogage est activ&eacute;. Si c'est le cas, le num&eacute;ro de port est &eacute;galement affich&eacute;.</p>
</dd>
<dt>Port(s) HTTP</dt>
<dd>
<p>Ports actuellement configur&eacute;s pour les demandes et les r&eacute;ponses HTTP.</p>
</dd>
<dt>Port(s) IIOP</dt>
<dd>
<p>Ports actuellement configur&eacute;s pour les demandes et les r&eacute;ponses IIOP.</p>
</dd>
</dl>
<a id="GHCOM353" name="GHCOM353"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-generaltab.html">Affichage d'informations g&eacute;n&eacute;rales pour le serveur DAS</a></p>
</li>
<li>
<p><a href="task-logviewer.html">Affichage de fichiers journaux pour le serveur DAS</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
