<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-lifecyclemodules" name="ref-lifecyclemodules"></a></p>

<h4><a id="sthref185" name="sthref185"></a>Modules de cycle de vie</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Modules de cycle de vie permet de configurer les modules de cycle de vie.</p>
<p>Un module de cycle de vie accomplit certaines t&acirc;ches lorsqu'il est d&eacute;clench&eacute; par des &eacute;v&eacute;nements dans le cycle de vie du serveur. Les &eacute;v&eacute;nements de serveur agissant comme des d&eacute;clencheurs potentiels sont les suivants : l'initialisation, le d&eacute;marrage, le fait d'&ecirc;tre pr&ecirc;t pour les demandes de service et l'arr&ecirc;t. Les modules de cycle de vie ne font pas partie de la sp&eacute;cification Java EE, mais ils optimisent le fonctionnement de GlassFish Server.</p>
<p>Pour chaque module de cycle de vie, les informations ci-apr&egrave;s sont fournies.</p>
<dl>
<dt>Nom</dt>
<dd>
<p>Nom du module de cycle de vie.</p>
</dd>
<dt>Activ&eacute; ou statut</dt>
<dd>
<p>Coche si l'application est activ&eacute;e ou X si l'application est d&eacute;sactiv&eacute;e (si seule l'instance de serveur par d&eacute;faut <code>server</code> existe).</p>
<p>S'il existe des clusters ou d'autres instances de serveur autonomes, s&eacute;lectionnez Activ&eacute; sur toutes les cibles pour afficher les cibles sur lesquelles l'application est d&eacute;ploy&eacute;e.</p>
</dd>
<dt>Ordre de chargement</dt>
<dd>
<p>Valeur indiquant l'ordre relatif dans lequel le module de cycle de vie doit &ecirc;tre charg&eacute;.</p>
</dd>
</dl>
<p>La table Modules de cycle de vie contient &eacute;galement les options ci-apr&egrave;s.</p>
<dl>
<dt>Nouveau</dt>
<dd>
<p>Bouton permettant de cr&eacute;er un module de cycle de vie.</p>
</dd>
<dt>Supprimer</dt>
<dd>
<p>Bouton permettant de supprimer les modules de cycle de vie s&eacute;lectionn&eacute;s.</p>
</dd>
<dt>Activer</dt>
<dd>
<p>Bouton permettant d'activer les modules de cycle de vie s&eacute;lectionn&eacute;s. Pr&eacute;sent si seule l'instance de serveur par d&eacute;faut, <code>server</code>, existe.</p>
</dd>
<dt>D&eacute;sactiver</dt>
<dd>
<p>Bouton permettant de d&eacute;sactiver les modules de cycle de vie s&eacute;lectionn&eacute;s. Pr&eacute;sent si seule l'instance de serveur par d&eacute;faut, <code>server</code>, existe.</p>
</dd>
</dl>
<a id="GHCOM391" name="GHCOM391"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-lifecyclemodulenew.html">Cr&eacute;ation d'un module de cycle de vie</a></p>
</li>
<li>
<p><a href="task-lifecyclemoduleedit.html">Modification d'un module de cycle de vie</a></p>
</li>
<li>
<p><a href="task-lifecyclemoduledelete.html">Suppression d'un module de cycle de vie</a></p>
</li>
</ul>
<a id="GHCOM392" name="GHCOM392"></a>
<h5>Commandes asadmin connexes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00043"><code>create-lifecycle-module</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00181"><code>list-lifecycle-modules</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00095"><code>delete-lifecycle-module</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
