<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-logviewer" name="ref-logviewer"></a></p>

<h4><a id="sthref239" name="sthref239"></a><a id="sthref240" name="sthref240"></a><a id="sthref241" name="sthref241"></a>Visualiseur de journaux</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Visualiseur de journaux permet d'afficher les fichiers journaux des clusters et instances GlassFish Server s&eacute;lectionn&eacute;s, et de personnaliser l'affichage desdits journaux.</p>
<p>La page Visualiseur de journaux se compose de quatre zones :</p>
<ul>
<li>
<p>Crit&egrave;res de recherche</p>
</li>
<li>
<p>Recherche avanc&eacute;e</p>
</li>
<li>
<p>Modifier la recherche</p>
</li>
<li>
<p>R&eacute;sultats de la recherche</p>
</li>
</ul>
<p>La zone Crit&egrave;res de recherche contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Recherche avanc&eacute;e</dt>
<dd>
<p>Un clic sur ce lien ouvre une zone qui vous permet d'affiner davantage le visualiseur de journaux.</p>
</dd>
<dt>Horodatage</dt>
<dd>
<p>Le bouton radio Le plus r&eacute;cent affiche les messages les plus r&eacute;cents. Le bouton radio Plage sp&eacute;cifique ouvre les champs De et A qui permettent d'afficher les messages d'une certaine p&eacute;riode uniquement.</p>
<p>Pour la valeur Heure, la syntaxe doit avoir le format suivant (<i>SSS</i> correspond aux millisecondes) :</p>
<pre>
<i>hh</i>:<i>mm</i>:<i>ss</i>.<i>SSS</i>
</pre>
<p>Exemple :</p>
<pre>
17:10:00.000
</pre>
<p>Si la valeur De est post&eacute;rieure &agrave; la valeur A, un message d'erreur appara&icirc;t.</p>
</dd>
<dt>Niveau de journalisation</dt>
<dd>
<p>Niveau de journalisation s&eacute;lectionn&eacute; pour le filtrage. Par d&eacute;faut, tous les messages figurant dans le journal du serveur &agrave; partir du niveau de journalisation choisi sont affich&eacute;s. Pour afficher uniquement les messages du niveau choisi, cochez la case Ne pas inclure des messages plus graves.</p>
<p>Pour vous assurer que les messages &agrave; afficher apparaissent dans le journal du serveur, commencez par d&eacute;finir les niveaux de journalisation appropri&eacute;s sur la page Niveaux de journalisation de module. Reportez-vous &agrave; <a href="task-eelogginglevels.html">Configuration de niveaux de journalisation</a>.</p>
<p>Si vous choisissez de filtrer les messages de journalisation en fonction du niveau de journalisation, seuls les messages correspondant aux crit&egrave;res de filtre sp&eacute;cifi&eacute;s apparaissent. Toutefois, ce filtrage n'affecte pas les messages consign&eacute;s dans le journal du serveur.</p>
</dd>
</dl>
<p>La zone Recherche avanc&eacute;e contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Journaliseur</dt>
<dd>
<p>Espaces de noms du journaliseur &agrave; filtrer par module. Appuyez sur les touches Maj ou Ctrl pendant que vous cliquez pour s&eacute;lectionner plusieurs espaces de noms.</p>
<p>Si vous s&eacute;lectionnez un espace de noms &agrave; un niveau sup&eacute;rieur, tous les espaces de noms situ&eacute;s en dessous seront &eacute;galement s&eacute;lectionn&eacute;s. Par exemple, si vous s&eacute;lectionnez <code>javax.enterprise.system</code>, les journaliseurs de tous les modules situ&eacute;s sous cet espace de noms seront &eacute;galement s&eacute;lectionn&eacute;s : <code>javax.enterprise.system.core</code>, <code>javax.enterprise.system.tools.admin</code> , etc.</p>
</dd>
<dt>Journaliseur personnalis&eacute;</dt>
<dd>
<p>Journaliseurs propres &agrave; une application particuli&egrave;re, un par ligne.</p>
<p>Si l'application comprend plusieurs modules, vous pouvez les afficher tous ou seulement certains d'entre eux. Prenons l'exemple d'une application comprenant les journaliseurs suivants :</p>
<pre>
com.mycompany.myapp.module1
com.mycompany.myapp.module2
com.mycompany.myapp.module3
</pre>
<p>Pour afficher les messages de tous les modules de l'application, saisissez <code>com.mycompany.myapp</code>. Pour afficher les messages du <code>module2</code> uniquement, saisissez <code>com.mycompany.myapp.module2</code>.</p>
<p>Si vous indiquez des journaliseurs personnalis&eacute;s, les messages des modules GlassFish Server n'apparaissent que si vous les avez explicitement sp&eacute;cifi&eacute;s dans la zone Journaliseur.</p>
</dd>
<dt>Afficher</dt>
<dd>
<p>Nombre de messages &agrave; afficher simultan&eacute;ment. Le nombre de messages affich&eacute;s par d&eacute;faut est de 40. Les autres possibilit&eacute;s sont 100, 250 et 1 000.</p>
<p>Pour afficher les traces de pile, d&eacute;s&eacute;lectionnez la case Tronquer les messages trop longs. Par d&eacute;faut, les traces de pile n'apparaissent pas dans le visualiseur ; pour les afficher, cliquez sur le lien <code>(d&eacute;tails)</code> du message.</p>
</dd>
</dl>
<p>La zone Modifier la recherche permet d'indiquer l'instance de serveur ou le cluster, ainsi que le nom d'un fichier journal associ&eacute; &agrave; afficher.</p>
<dl>
<dt>Instance</dt>
<dd>
<p>Instance de serveur ou cluster dont les enregistrements de journal seront affich&eacute;s. La valeur par d&eacute;faut est server. Les autres possibilit&eacute;s d&eacute;pendent des clusters et des instances pouvant &ecirc;tre d&eacute;finis et activ&eacute;s pour le domaine.</p>
</dd>
<dt>Fichier journal</dt>
<dd>
<p>Nom du fichier journal &agrave; afficher. La valeur par d&eacute;faut est <code>server.log</code>. Les autres possibilit&eacute;s d&eacute;pendent des param&egrave;tres du journal pour la cible s&eacute;lectionn&eacute;e.</p>
</dd>
</dl>
<p>La table R&eacute;sultats du visualiseur de journaux affiche les messages de journalisation du serveur. Utilisez les boutons Enregistrements avant et Enregistrements apr&egrave;s situ&eacute;s en haut de la table pour choisir la plage d'enregistrements &agrave; afficher.</p>
<p>Pour chaque message, la table R&eacute;sultats du visualiseur de journaux contient les informations ci-apr&egrave;s.</p>
<dl>
<dt>Num&eacute;ro d'enregistrement</dt>
<dd>
<p>Num&eacute;ro du message dans le journal du serveur.</p>
</dd>
<dt>Niveau de journalisation</dt>
<dd>
<p>Niveau de journalisation du message.</p>
</dd>
<dt>Message</dt>
<dd>
<p>Texte bref du message de journalisation. Cliquez sur le lien <code>(d&eacute;tails)</code> pour afficher la version format&eacute;e d'un message.</p>
</dd>
<dt>Journaliseur</dt>
<dd>
<p>Module de journalisation qui a g&eacute;n&eacute;r&eacute; le message de journalisation.</p>
</dd>
<dt>Horodatage</dt>
<dd>
<p>Date et heure d'&eacute;mission du message de journalisation.</p>
</dd>
<dt>Paires nom-valeur</dt>
<dd>
<p>Nom du thread et ID du message de journalisation.</p>
</dd>
</dl>
<a id="sthref242" name="sthref242"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-eelogging.html">Configuration de param&egrave;tres de journalisation g&eacute;n&eacute;raux</a></p>
</li>
<li>
<p><a href="task-eelogginglevels.html">Configuration de niveaux de journalisation</a></p>
</li>
<li>
<p><a href="task-logviewer.html">Affichage de fichiers journaux pour le serveur DAS</a></p>
</li>
</ul>
<a id="sthref243" name="sthref243"></a>
<h5>Commandes asadmin connexes</h5>
<ul>
<li>
<p><code>set-log-level</code></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00224"><code>rotate-log</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
