<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-uploaddev" name="ref-uploaddev"></a><a id="GHCOM00077" name="GHCOM00077"></a></p>

<h4><a id="sthref292" name="sthref292"></a><a id="sthref293" name="sthref293"></a><a id="sthref294" name="sthref294"></a><a id="sthref295" name="sthref295"></a><a id="sthref296" name="sthref296"></a><a id="sthref297" name="sthref297"></a><a id="sthref298" name="sthref298"></a><a id="sthref299" name="sthref299"></a><a id="sthref300" name="sthref300"></a><a id="sthref301" name="sthref301"></a><a id="sthref302" name="sthref302"></a><a id="sthref303" name="sthref303"></a>D&eacute;ployer des applications ou des modules</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Pour d&eacute;ployer une application, utilisez la page D&eacute;ployer des applications ou des modules.</p>
<p>Cette page contient les options ci-apr&egrave;s pour toutes les applications. Des options suppl&eacute;mentaires apparaissent uniquement apr&egrave;s avoir renseign&eacute; le champ Emplacement de l'application.</p>
<dl>
<dt>Emplacement</dt>
<dd>
<p>Emplacement de l'archive de l'application que vous d&eacute;ployez.</p>
<p>Les options suivantes indiquent les points d'acc&egrave;s &agrave; l'archive et pr&eacute;cisent si cette derni&egrave;re est un fichier ou un r&eacute;pertoire.</p>
<dl>
<dt>Fichier packag&eacute; &agrave; t&eacute;l&eacute;charger sur le serveur</dt>
<dd>
<p>L'archive est contenue dans un fichier stock&eacute; sur l'ordinateur client ou accessible &agrave; partir de celui-ci.</p>
<p>L'ordinateur client est l'h&ocirc;te sur lequel vous visualisez la Console d'administration via un navigateur.</p>
</dd>
<dt>R&eacute;pertoire ou fichier packag&eacute; local accessible &agrave; partir de GlassFish Server</dt>
<dd>
<p>L'archive est un fichier stock&eacute; sur l'ordinateur serveur ou une application non packag&eacute;e contenue dans un r&eacute;pertoire &eacute;clat&eacute;.</p>
<p>L'ordinateur serveur est l'h&ocirc;te qui ex&eacute;cute le serveur d'administration de domaine GlassFish Server.</p>
</dd>
</dl>
</dd>
<dt>Type</dt>
<dd>
<p>Type de l'application. Les choix disponibles sont les suivants :</p>
<ul>
<li>
<p>Application Web</p>
</li>
<li>
<p>Application d'entreprise</p>
</li>
<li>
<p>Client d'application</p>
</li>
<li>
<p>Module connecteur</p>
</li>
<li>
<p>Fichier JAR EJB</p>
</li>
<li>
<p>Autre</p>
</li>
</ul>
</dd>
<dt>Cibles</dt>
<dd>
<p>Clusters et instances autonomes sur lesquels d&eacute;ployer l'application ou le module. D&eacute;placez les cibles souhait&eacute;es dans la colonne Cibles s&eacute;lectionn&eacute;es &agrave; l'aide des boutons Ajouter et Tout ajouter. D&eacute;placez toutes les cibles inutiles dans la colonne Cibles disponibles &agrave; l'aide des boutons Enlever et Tout enlever.</p>
<p>Cette option appara&icirc;t uniquement si des clusters ou des instances autonomes ont &eacute;t&eacute; cr&eacute;&eacute;s dans le domaine.</p>
</dd>
</dl>
<p>D'autres options, relatives aux diff&eacute;rents types d'application, sont d&eacute;crites dans les sections ci-apr&egrave;s.</p>
<ul>
<li>
<p><a href="#ref-webapp-options">Options suppl&eacute;mentaires pour une application Web</a></p>
</li>
<li>
<p><a href="#ref-entapp-options">Options suppl&eacute;mentaires pour une application d'entreprise</a></p>
</li>
<li>
<p><a href="#ref-appclient-options">Options suppl&eacute;mentaires pour un client d'application</a></p>
</li>
<li>
<p><a href="#ref-connmodule-options">Options suppl&eacute;mentaires pour un module connecteur</a></p>
</li>
<li>
<p><a href="#ref-ejb-options">Options suppl&eacute;mentaires pour un fichier JAR EJB</a></p>
</li>
</ul>
<a id="ref-webapp-options" name="ref-webapp-options"></a>
<h5>Options suppl&eacute;mentaires pour une application Web</h5>
<p>Dans le cas d'une application Web, les options suivantes apparaissent.</p>
<dl>
<dt>Racine du contexte</dt>
<dd>
<p>Chemin d'acc&egrave;s &agrave; l'application. Dans l'URL de l'application Web, la racine du contexte suit imm&eacute;diatement le num&eacute;ro de port (<code>http://</code><i>host</i><code>:</code><i>port</i><code>/</code><i>context-root</i><code>/...</code>). La racine du contexte doit commencer par une barre oblique, par exemple <code>/hello</code>.</p>
</dd>
<dt>Nom de l'application</dt>
<dd>
<p>Nom de l'application.</p>
<p>Le nom peut &ecirc;tre suivi d'un identificateur de version facultatif dont il est s&eacute;par&eacute; par un signe deux-points (<code>:</code>). L'identificateur de version doit commencer par une lettre ou un chiffre. Il peut contenir des caract&egrave;res alphanum&eacute;riques, des traits de soulignement (<code>_</code>), des tirets (<code>-</code>) et des points (<code>.</code>). Pour plus d'informations sur les versions des modules et des applications, reportez-vous &agrave; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> dans le manuel <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt>Serveurs virtuels</dt>
<dd>
<p>Serveurs virtuels associ&eacute;s &agrave; cette application.</p>
<p>L'option Serveurs virtuels appara&icirc;t si seule l'instance de serveur par d&eacute;faut, <code>server</code>, existe. S'il existe des clusters ou d'autres instances de serveur autonomes, vous pouvez s&eacute;lectionner des serveurs virtuels apr&egrave;s le d&eacute;ploiement. Ouvrez la page Modifier une application, s&eacute;lectionnez l'onglet Cible, puis G&eacute;rer les serveurs virtuels pour la cible de votre choix.</p>
</dd>
<dt>Statut</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, l'application est activ&eacute;e. Cette option est s&eacute;lectionn&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Disponibilit&eacute;</dt>
<dd>
<p>Si la case Activ&eacute; est coch&eacute;e, la haute disponibilit&eacute; est activ&eacute;e pour la r&eacute;alisation de points de reprise et &eacute;ventuellement la passivation des sessions Web et des beans Session avec conservation de statut (SFSB). Si la valeur est False (valeur par d&eacute;faut), tous les enregistrements de session Web et la r&eacute;alisation de points de reprise SFSB sont d&eacute;sactiv&eacute;s pour l'application, l'application Web ou le module EJB sp&eacute;cifi&eacute;. Si cette valeur est True, l'application ou le module sp&eacute;cifi&eacute; est activ&eacute; pour la haute disponibilit&eacute;. D&eacute;finissez cette option sur True seulement si la haute disponibilit&eacute; est configur&eacute;e et activ&eacute;e &agrave; des niveaux sup&eacute;rieurs, tels que les niveaux serveur et conteneur.</p>
<p>Cette option appara&icirc;t si des clusters ou des instances de serveur autonomes existent en plus de l'instance de serveur par d&eacute;faut (<code>server</code>).</p>
</dd>
<dt>Pr&eacute;compiler les JSP</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, les fichiers JSP (Java Server Pages) sont pr&eacute;compil&eacute;s. Si cette option est d&eacute;sactiv&eacute;e, les fichiers JSP sont compil&eacute;s au moment de l'ex&eacute;cution, lors de leur premier acc&egrave;s. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Ex&eacute;cuter le v&eacute;rificateur</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, les descripteurs de d&eacute;ploiement sont v&eacute;rifi&eacute;s avant le d&eacute;ploiement. En cas d'&eacute;chec de la v&eacute;rification, le d&eacute;ploiement n'a pas lieu. Le v&eacute;rificateur examine la structure et le contenu des descripteurs de d&eacute;ploiement. La v&eacute;rification d'applications volumineuses est souvent une t&acirc;che qui demande du temps. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
<p>Les packages du v&eacute;rificateur doivent &ecirc;tre install&eacute;s &agrave; partir de l'outil de mise &agrave; jour ; sinon, un avertissement est consign&eacute; et cette option est ignor&eacute;e.</p>
</dd>
<dt>Forcer le red&eacute;ploiement</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, l'application est red&eacute;ploy&eacute;e si elle a d&eacute;j&agrave; &eacute;t&eacute; d&eacute;ploy&eacute;e. Si cette option n'est pas s&eacute;lectionn&eacute;e, toute tentative de d&eacute;ploiement d'une application d&eacute;j&agrave; d&eacute;ploy&eacute;e g&eacute;n&egrave;re une erreur. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Conserver l'&eacute;tat</dt>
<dd>
<p>Cette option d&eacute;termine si les sessions Web, les instances SFSB et les horloges EJB cr&eacute;&eacute;es de fa&ccedil;on persistante sont conserv&eacute;es entre les red&eacute;ploiements.</p>
<p>Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut. Elle n'est prise en charge que sur l'instance de serveur par d&eacute;faut, nomm&eacute;e <code>server</code>. Elle n'est pas prise en charge et est ignor&eacute;e pour toute autre cible.</p>
<p>Certaines modifications apport&eacute;es &agrave; une application entre des red&eacute;ploiements emp&ecirc;chent cette option de fonctionner correctement. Par exemple, ne modifiez pas l'ensemble des variables d'instance dans la classe de bean SFSB.</p>
<p>Pour les applications Web, cette fonctionnalit&eacute; n'est applicable que si, dans le fichier <code>glassfish-web-app.xml</code>, l'attribut <code>persistence-type</code> de l'&eacute;l&eacute;ment <code>session-manager</code> est <code>file</code>.</p>
<p>Pour les instances SFSB, le type de persistance sans haute disponibilit&eacute; est d&eacute;fini dans le serveur (option Type de persistance SFSB) et doit avoir la valeur <code>file</code>, qui est la valeur par d&eacute;faut recommand&eacute;e.</p>
<p>En cas d'&eacute;chec de la conservation ou de la restauration d'une session Web, d'une instance SFSB ou d'une horloge EJB active, <i>aucune</i> d'entre elles ne sera disponible une fois le red&eacute;ploiement termin&eacute;. Toutefois, le red&eacute;ploiement se poursuit et un avertissement est consign&eacute;.</p>
<p>Pour conserver les donn&eacute;es d'&eacute;tat actives, GlassFish Server s&eacute;rialise les donn&eacute;es et les enregistre dans la m&eacute;moire. Pour restaurer les donn&eacute;es, le chargeur de classe de l'application qui vient d'&ecirc;tre red&eacute;ploy&eacute;e d&eacute;s&eacute;rialise les donn&eacute;es pr&eacute;c&eacute;demment enregistr&eacute;es.</p>
</dd>
<dt>Conserver les ressources de niveau application</dt>
<dd>
<p>Si cette case est coch&eacute;e, le syst&egrave;me conserve les ressources de niveau application et les restaure pendant le red&eacute;ploiement. Cette option n'est pas coch&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Ordre de d&eacute;ploiement</dt>
<dd>
<p>Ordre de d&eacute;ploiement de l'application.</p>
<p>Les applications ayant le num&eacute;ro le plus faible sont charg&eacute;es en premier au d&eacute;marrage du serveur. Une application ayant un ordre de d&eacute;ploiement de 102 est charg&eacute;e avant une application ayant un ordre de d&eacute;ploiement de 110. Si l'ordre de d&eacute;ploiement n'est pas indiqu&eacute; au moment o&ugrave; une application est d&eacute;ploy&eacute;e, l'ordre de d&eacute;ploiement par d&eacute;faut de 100 est affect&eacute;. Si deux applications ont le m&ecirc;me ordre de d&eacute;ploiement, l'application qui a &eacute;t&eacute; d&eacute;ploy&eacute;e en premier est charg&eacute;e en premier. La sp&eacute;cification d'un ordre de d&eacute;ploiement s'av&egrave;re utile si l'application a des d&eacute;pendances et doit &ecirc;tre charg&eacute;e dans un certain ordre.</p>
</dd>
<dt>Biblioth&egrave;ques</dt>
<dd>
<p>Liste des fichiers JAR de biblioth&egrave;que (s&eacute;par&eacute;s par des virgules) propres &agrave; ce module ou &agrave; cette application. Les chemins peuvent &ecirc;tre absolus ou relatifs. Un chemin relatif est relatif &agrave; domain-dir<code>/lib/applibs</code>. Si le chemin est absolu, le serveur d'administration de domaine (DAS) doit pouvoir y acc&eacute;der, ce qui signifie qu'il doit se trouver sous domain-dir. Les biblioth&egrave;ques sont mises &agrave; la disposition de l'application selon l'ordre dans lequel elles sont sp&eacute;cifi&eacute;es.</p>
</dd>
<dt>Description</dt>
<dd>
<p>Description de l'application.</p>
</dd>
</dl>
<a id="ref-entapp-options" name="ref-entapp-options"></a>
<h5>Options suppl&eacute;mentaires pour une application d'entreprise</h5>
<p>Dans le cas d'une application d'entreprise, les options suivantes apparaissent.</p>
<dl>
<dt>Nom de l'application</dt>
<dd>
<p>Nom de l'application.</p>
<p>Le nom peut &ecirc;tre suivi d'un identificateur de version facultatif dont il est s&eacute;par&eacute; par un signe deux-points (<code>:</code>). L'identificateur de version doit commencer par une lettre ou un chiffre. Il peut contenir des caract&egrave;res alphanum&eacute;riques, des traits de soulignement (<code>_</code>), des tirets (<code>-</code>) et des points (<code>.</code>). Pour plus d'informations sur les versions des modules et des applications, reportez-vous &agrave; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> dans le manuel <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt>Serveurs virtuels</dt>
<dd>
<p>Serveurs virtuels associ&eacute;s &agrave; cette application.</p>
<p>L'option Serveurs virtuels appara&icirc;t si seule l'instance de serveur par d&eacute;faut, <code>server</code>, existe. S'il existe des clusters ou d'autres instances de serveur autonomes, vous pouvez s&eacute;lectionner des serveurs virtuels apr&egrave;s le d&eacute;ploiement. Ouvrez la page Modifier une application, s&eacute;lectionnez l'onglet Cible, puis G&eacute;rer les serveurs virtuels pour la cible de votre choix.</p>
</dd>
<dt>Statut</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, l'application est activ&eacute;e. Cette option est s&eacute;lectionn&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Disponibilit&eacute;</dt>
<dd>
<p>Si la case Activ&eacute; est coch&eacute;e, la haute disponibilit&eacute; est activ&eacute;e pour la r&eacute;alisation de points de reprise et &eacute;ventuellement la passivation des sessions Web et des beans Session avec conservation de statut (SFSB). Si la valeur est False (valeur par d&eacute;faut), tous les enregistrements de session Web et la r&eacute;alisation de points de reprise SFSB sont d&eacute;sactiv&eacute;s pour l'application, l'application Web ou le module EJB sp&eacute;cifi&eacute;. Si cette valeur est True, l'application ou le module sp&eacute;cifi&eacute; est activ&eacute; pour la haute disponibilit&eacute;. D&eacute;finissez cette option sur True seulement si la haute disponibilit&eacute; est configur&eacute;e et activ&eacute;e &agrave; des niveaux sup&eacute;rieurs, tels que les niveaux serveur et conteneur.</p>
<p>Cette option appara&icirc;t si des clusters ou des instances de serveur autonomes existent en plus de l'instance de serveur par d&eacute;faut (<code>server</code>).</p>
</dd>
<dt>Java Web Start</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, l'acc&egrave;s &agrave; Java Web Start est autoris&eacute; pour un module client d'application. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Pr&eacute;compiler les JSP</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, les fichiers JSP (Java Server Pages) sont pr&eacute;compil&eacute;s. Si cette option est d&eacute;sactiv&eacute;e, les fichiers JSP sont compil&eacute;s au moment de l'ex&eacute;cution, lors de leur premier acc&egrave;s. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Ex&eacute;cuter le v&eacute;rificateur</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, les descripteurs de d&eacute;ploiement sont v&eacute;rifi&eacute;s avant le d&eacute;ploiement. En cas d'&eacute;chec de la v&eacute;rification, le d&eacute;ploiement n'a pas lieu. Le v&eacute;rificateur examine la structure et le contenu des descripteurs de d&eacute;ploiement. La v&eacute;rification d'applications volumineuses est souvent une t&acirc;che qui demande du temps. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
<p>Les packages du v&eacute;rificateur doivent &ecirc;tre install&eacute;s &agrave; partir de l'outil de mise &agrave; jour ; sinon, un avertissement est consign&eacute; et cette option est ignor&eacute;e.</p>
</dd>
<dt>Compatibilit&eacute;</dt>
<dd>
<p>Si cette case est coch&eacute;e, le syst&egrave;me utilise les exigences de visibilit&eacute; JAR de GlassFish Server version 2 pour les applications au lieu des exigences Java EE 6 plus strictes impl&eacute;ment&eacute;es dans les versions ult&eacute;rieures de GlassFish Server, y compris 4.0. Cette option n'est pas coch&eacute;e par d&eacute;faut.</p>
<p>La sp&eacute;cification de la plate-forme Java EE 6 impose des exigences plus strictes que Java EE 5 quant aux fichiers JAR visibles dans divers modules au sein d'un fichier EAR. Plus particuli&egrave;rement, les clients d'application ne doivent pas avoir acc&egrave;s aux fichiers JAR EJB ou &agrave; d'autres fichiers JAR dans le fichier EAR, sauf si les r&eacute;f&eacute;rences utilisent les m&eacute;canismes Java SE standard (les extensions, par exemple) ou le m&eacute;canisme library-directory de Java EE. La s&eacute;lection de cette case enl&egrave;ve ces restrictions Java EE 6.</p>
</dd>
<dt>Forcer le red&eacute;ploiement</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, l'application est red&eacute;ploy&eacute;e si elle a d&eacute;j&agrave; &eacute;t&eacute; d&eacute;ploy&eacute;e. Si cette option n'est pas s&eacute;lectionn&eacute;e, toute tentative de d&eacute;ploiement d'une application d&eacute;j&agrave; d&eacute;ploy&eacute;e g&eacute;n&egrave;re une erreur. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Conserver l'&eacute;tat</dt>
<dd>
<p>Cette option d&eacute;termine si les sessions Web, les instances SFSB et les horloges EJB cr&eacute;&eacute;es de fa&ccedil;on persistante sont conserv&eacute;es entre les red&eacute;ploiements.</p>
<p>Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut. Elle n'est prise en charge que sur l'instance de serveur par d&eacute;faut, nomm&eacute;e <code>server</code>. Elle n'est pas prise en charge et est ignor&eacute;e pour toute autre cible.</p>
<p>Certaines modifications apport&eacute;es &agrave; une application entre des red&eacute;ploiements emp&ecirc;chent cette option de fonctionner correctement. Par exemple, ne modifiez pas l'ensemble des variables d'instance dans la classe de bean SFSB.</p>
<p>Pour les applications Web, cette fonctionnalit&eacute; n'est applicable que si, dans le fichier <code>glassfish-web-app.xml</code>, l'attribut <code>persistence-type</code> de l'&eacute;l&eacute;ment <code>session-manager</code> est <code>file</code>.</p>
<p>Pour les instances SFSB, le type de persistance sans haute disponibilit&eacute; est d&eacute;fini dans le serveur (option Type de persistance SFSB) et doit avoir la valeur <code>file</code>, qui est la valeur par d&eacute;faut recommand&eacute;e.</p>
<p>En cas d'&eacute;chec de la conservation ou de la restauration d'une session Web, d'une instance SFSB ou d'une horloge EJB active, <i>aucune</i> d'entre elles ne sera disponible une fois le red&eacute;ploiement termin&eacute;. Toutefois, le red&eacute;ploiement se poursuit et un avertissement est consign&eacute;.</p>
<p>Pour conserver les donn&eacute;es d'&eacute;tat actives, GlassFish Server s&eacute;rialise les donn&eacute;es et les enregistre dans la m&eacute;moire. Pour restaurer les donn&eacute;es, le chargeur de classe de l'application qui vient d'&ecirc;tre red&eacute;ploy&eacute;e d&eacute;s&eacute;rialise les donn&eacute;es pr&eacute;c&eacute;demment enregistr&eacute;es.</p>
</dd>
<dt>Conserver les ressources de niveau application</dt>
<dd>
<p>Si cette case est coch&eacute;e, le syst&egrave;me conserve les ressources de niveau application et les restaure pendant le red&eacute;ploiement. Cette option n'est pas coch&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Ordre de d&eacute;ploiement</dt>
<dd>
<p>Ordre de d&eacute;ploiement de l'application.</p>
<p>Les applications ayant le num&eacute;ro le plus faible sont charg&eacute;es en premier au d&eacute;marrage du serveur. Une application ayant un ordre de d&eacute;ploiement de 102 est charg&eacute;e avant une application ayant un ordre de d&eacute;ploiement de 110. Si l'ordre de d&eacute;ploiement n'est pas indiqu&eacute; au moment o&ugrave; une application est d&eacute;ploy&eacute;e, l'ordre de d&eacute;ploiement par d&eacute;faut de 100 est affect&eacute;. Si deux applications ont le m&ecirc;me ordre de d&eacute;ploiement, l'application qui a &eacute;t&eacute; d&eacute;ploy&eacute;e en premier est charg&eacute;e en premier. La sp&eacute;cification d'un ordre de d&eacute;ploiement s'av&egrave;re utile si l'application a des d&eacute;pendances et doit &ecirc;tre charg&eacute;e dans un certain ordre.</p>
</dd>
<dt>Biblioth&egrave;ques</dt>
<dd>
<p>Liste des fichiers JAR de biblioth&egrave;que (s&eacute;par&eacute;s par des virgules) propres &agrave; cette application. Indique un chemin absolu ou relatif. Un chemin relatif est relatif &agrave; domain-dir<code>/lib/applibs</code>. Si le chemin est absolu, le serveur d'administration de domaine (DAS) doit pouvoir y acc&eacute;der, ce qui signifie qu'il doit se trouver sous domain-dir. Les biblioth&egrave;ques sont mises &agrave; la disposition de l'application selon l'ordre dans lequel elles sont sp&eacute;cifi&eacute;es.</p>
</dd>
<dt>Description</dt>
<dd>
<p>Description de l'application.</p>
</dd>
</dl>
<a id="ref-appclient-options" name="ref-appclient-options"></a>
<h5>Options suppl&eacute;mentaires pour un client d'application</h5>
<p>Dans le cas d'un client d'application, les options ci-apr&egrave;s apparaissent.</p>
<dl>
<dt>Nom de l'application</dt>
<dd>
<p>Nom de l'application.</p>
<p>Le nom peut &ecirc;tre suivi d'un identificateur de version facultatif dont il est s&eacute;par&eacute; par un signe deux-points (<code>:</code>). L'identificateur de version doit commencer par une lettre ou un chiffre. Il peut contenir des caract&egrave;res alphanum&eacute;riques, des traits de soulignement (<code>_</code>), des tirets (<code>-</code>) et des points (<code>.</code>). Pour plus d'informations sur les versions des modules et des applications, reportez-vous &agrave; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> dans le manuel <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt>Java Web Start</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, l'acc&egrave;s &agrave; Java Web Start est autoris&eacute; pour un module client d'application. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Ex&eacute;cuter le v&eacute;rificateur</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, les descripteurs de d&eacute;ploiement sont v&eacute;rifi&eacute;s avant le d&eacute;ploiement. En cas d'&eacute;chec de la v&eacute;rification, le d&eacute;ploiement n'a pas lieu. Le v&eacute;rificateur examine la structure et le contenu des descripteurs de d&eacute;ploiement. La v&eacute;rification d'applications volumineuses est souvent une t&acirc;che qui demande du temps. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
<p>Les packages du v&eacute;rificateur doivent &ecirc;tre install&eacute;s &agrave; partir de l'outil de mise &agrave; jour ; sinon, un avertissement est consign&eacute; et cette option est ignor&eacute;e.</p>
</dd>
<dt>Forcer le red&eacute;ploiement</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, l'application est red&eacute;ploy&eacute;e si elle a d&eacute;j&agrave; &eacute;t&eacute; d&eacute;ploy&eacute;e. Si cette option n'est pas s&eacute;lectionn&eacute;e, toute tentative de d&eacute;ploiement d'une application d&eacute;j&agrave; d&eacute;ploy&eacute;e g&eacute;n&egrave;re une erreur. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Ordre de d&eacute;ploiement</dt>
<dd>
<p>Ordre de d&eacute;ploiement de l'application.</p>
<p>Les applications ayant le num&eacute;ro le plus faible sont charg&eacute;es en premier au d&eacute;marrage du serveur. Une application ayant un ordre de d&eacute;ploiement de 102 est charg&eacute;e avant une application ayant un ordre de d&eacute;ploiement de 110. Si l'ordre de d&eacute;ploiement n'est pas indiqu&eacute; au moment o&ugrave; une application est d&eacute;ploy&eacute;e, l'ordre de d&eacute;ploiement par d&eacute;faut de 100 est affect&eacute;. Si deux applications ont le m&ecirc;me ordre de d&eacute;ploiement, l'application qui a &eacute;t&eacute; d&eacute;ploy&eacute;e en premier est charg&eacute;e en premier. La sp&eacute;cification d'un ordre de d&eacute;ploiement s'av&egrave;re utile si l'application a des d&eacute;pendances et doit &ecirc;tre charg&eacute;e dans un certain ordre.</p>
</dd>
<dt>Description</dt>
<dd>
<p>Description de l'application.</p>
</dd>
</dl>
<a id="ref-connmodule-options" name="ref-connmodule-options"></a>
<h5>Options suppl&eacute;mentaires pour un module connecteur</h5>
<p>Dans le cas d'un module connecteur, les options ci-apr&egrave;s apparaissent.</p>
<dl>
<dt>Nom de l'application</dt>
<dd>
<p>Nom de l'application.</p>
<p>Le nom peut &ecirc;tre suivi d'un identificateur de version facultatif dont il est s&eacute;par&eacute; par un signe deux-points (<code>:</code>). L'identificateur de version doit commencer par une lettre ou un chiffre. Il peut contenir des caract&egrave;res alphanum&eacute;riques, des traits de soulignement (<code>_</code>), des tirets (<code>-</code>) et des points (<code>.</code>). Pour plus d'informations sur les versions des modules et des applications, reportez-vous &agrave; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> dans le manuel <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt>Statut</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, l'application est activ&eacute;e. Cette option est s&eacute;lectionn&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Ex&eacute;cuter le v&eacute;rificateur</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, les descripteurs de d&eacute;ploiement sont v&eacute;rifi&eacute;s avant le d&eacute;ploiement. En cas d'&eacute;chec de la v&eacute;rification, le d&eacute;ploiement n'a pas lieu. Le v&eacute;rificateur examine la structure et le contenu des descripteurs de d&eacute;ploiement. La v&eacute;rification d'applications volumineuses est souvent une t&acirc;che qui demande du temps. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
<p>Les packages du v&eacute;rificateur doivent &ecirc;tre install&eacute;s &agrave; partir de l'outil de mise &agrave; jour ; sinon, un avertissement est consign&eacute; et cette option est ignor&eacute;e.</p>
</dd>
<dt>Forcer le red&eacute;ploiement</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, l'application est red&eacute;ploy&eacute;e si elle a d&eacute;j&agrave; &eacute;t&eacute; d&eacute;ploy&eacute;e. Si cette option n'est pas s&eacute;lectionn&eacute;e, toute tentative de d&eacute;ploiement d'une application d&eacute;j&agrave; d&eacute;ploy&eacute;e g&eacute;n&egrave;re une erreur. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Conserver les ressources de niveau application</dt>
<dd>
<p>Si cette case est coch&eacute;e, le syst&egrave;me conserve les ressources de niveau application et les restaure pendant le red&eacute;ploiement. Cette option n'est pas coch&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Ordre de d&eacute;ploiement</dt>
<dd>
<p>Ordre de d&eacute;ploiement de l'application.</p>
<p>Les applications ayant le num&eacute;ro le plus faible sont charg&eacute;es en premier au d&eacute;marrage du serveur. Une application ayant un ordre de d&eacute;ploiement de 102 est charg&eacute;e avant une application ayant un ordre de d&eacute;ploiement de 110. Si l'ordre de d&eacute;ploiement n'est pas indiqu&eacute; au moment o&ugrave; une application est d&eacute;ploy&eacute;e, l'ordre de d&eacute;ploiement par d&eacute;faut de 100 est affect&eacute;. Si deux applications ont le m&ecirc;me ordre de d&eacute;ploiement, l'application qui a &eacute;t&eacute; d&eacute;ploy&eacute;e en premier est charg&eacute;e en premier. La sp&eacute;cification d'un ordre de d&eacute;ploiement s'av&egrave;re utile si l'application a des d&eacute;pendances et doit &ecirc;tre charg&eacute;e dans un certain ordre.</p>
</dd>
<dt>Description</dt>
<dd>
<p>Description de l'application.</p>
</dd>
</dl>
<a id="ref-ejb-options" name="ref-ejb-options"></a>
<h5>Options suppl&eacute;mentaires pour un fichier JAR EJB</h5>
<p>Dans le cas d'un fichier JAR EJB, les options ci-apr&egrave;s apparaissent.</p>
<dl>
<dt>Nom de l'application</dt>
<dd>
<p>Nom de l'application.</p>
<p>Le nom peut &ecirc;tre suivi d'un identificateur de version facultatif dont il est s&eacute;par&eacute; par un signe deux-points (<code>:</code>). L'identificateur de version doit commencer par une lettre ou un chiffre. Il peut contenir des caract&egrave;res alphanum&eacute;riques, des traits de soulignement (<code>_</code>), des tirets (<code>-</code>) et des points (<code>.</code>). Pour plus d'informations sur les versions des modules et des applications, reportez-vous &agrave; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> dans le manuel <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt>Statut</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, l'application est activ&eacute;e. Cette option est s&eacute;lectionn&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Disponibilit&eacute;</dt>
<dd>
<p>Si la case Activ&eacute; est coch&eacute;e, la haute disponibilit&eacute; est activ&eacute;e pour la r&eacute;alisation de points de reprise et &eacute;ventuellement la passivation des sessions Web et des beans Session avec conservation de statut (SFSB). Si la valeur est False (valeur par d&eacute;faut), tous les enregistrements de session Web et la r&eacute;alisation de points de reprise SFSB sont d&eacute;sactiv&eacute;s pour l'application, l'application Web ou le module EJB sp&eacute;cifi&eacute;. Si cette valeur est True, l'application ou le module sp&eacute;cifi&eacute; est activ&eacute; pour la haute disponibilit&eacute;. D&eacute;finissez cette option sur True seulement si la haute disponibilit&eacute; est configur&eacute;e et activ&eacute;e &agrave; des niveaux sup&eacute;rieurs, tels que les niveaux serveur et conteneur.</p>
<p>Cette option appara&icirc;t si des clusters ou des instances de serveur autonomes existent en plus de l'instance de serveur par d&eacute;faut (<code>server</code>).</p>
</dd>
<dt>Ex&eacute;cuter le v&eacute;rificateur</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, les descripteurs de d&eacute;ploiement sont v&eacute;rifi&eacute;s avant le d&eacute;ploiement. En cas d'&eacute;chec de la v&eacute;rification, le d&eacute;ploiement n'a pas lieu. Le v&eacute;rificateur examine la structure et le contenu des descripteurs de d&eacute;ploiement. La v&eacute;rification d'applications volumineuses est souvent une t&acirc;che qui demande du temps. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
<p>Les packages du v&eacute;rificateur doivent &ecirc;tre install&eacute;s &agrave; partir de l'outil de mise &agrave; jour ; sinon, un avertissement est consign&eacute; et cette option est ignor&eacute;e.</p>
</dd>
<dt>Compatibilit&eacute;</dt>
<dd>
<p>Si cette case est coch&eacute;e, le syst&egrave;me utilise les exigences de visibilit&eacute; JAR de GlassFish Server version 2 pour les applications au lieu des exigences Java EE 6 plus strictes impl&eacute;ment&eacute;es dans les versions ult&eacute;rieures de GlassFish Server, y compris 4.0. Cette option n'est pas coch&eacute;e par d&eacute;faut.</p>
<p>La sp&eacute;cification de la plate-forme Java EE 6 impose des exigences plus strictes que Java EE 5 quant aux fichiers JAR visibles dans divers modules au sein d'un fichier EAR. Plus particuli&egrave;rement, les clients d'application ne doivent pas avoir acc&egrave;s aux fichiers JAR EJB ou &agrave; d'autres fichiers JAR dans le fichier EAR, sauf si les r&eacute;f&eacute;rences utilisent les m&eacute;canismes Java SE standard (les extensions, par exemple) ou le m&eacute;canisme library-directory de Java EE. La s&eacute;lection de cette case enl&egrave;ve ces restrictions Java EE 6.</p>
</dd>
<dt>Forcer le red&eacute;ploiement</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, l'application est red&eacute;ploy&eacute;e si elle a d&eacute;j&agrave; &eacute;t&eacute; d&eacute;ploy&eacute;e. Si cette option n'est pas s&eacute;lectionn&eacute;e, toute tentative de d&eacute;ploiement d'une application d&eacute;j&agrave; d&eacute;ploy&eacute;e g&eacute;n&egrave;re une erreur. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Conserver l'&eacute;tat</dt>
<dd>
<p>Cette option d&eacute;termine si les sessions Web, les instances SFSB et les horloges EJB cr&eacute;&eacute;es de fa&ccedil;on persistante sont conserv&eacute;es entre les red&eacute;ploiements.</p>
<p>Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut. Elle n'est prise en charge que sur l'instance de serveur par d&eacute;faut, nomm&eacute;e <code>server</code>. Elle n'est pas prise en charge et est ignor&eacute;e pour toute autre cible.</p>
<p>Certaines modifications apport&eacute;es &agrave; une application entre des red&eacute;ploiements emp&ecirc;chent cette option de fonctionner correctement. Par exemple, ne modifiez pas l'ensemble des variables d'instance dans la classe de bean SFSB.</p>
<p>Pour les applications Web, cette fonctionnalit&eacute; n'est applicable que si, dans le fichier <code>glassfish-web-app.xml</code>, l'attribut <code>persistence-type</code> de l'&eacute;l&eacute;ment <code>session-manager</code> est <code>file</code>.</p>
<p>Pour les instances SFSB, le type de persistance sans haute disponibilit&eacute; est d&eacute;fini dans le serveur (option Type de persistance SFSB) et doit avoir la valeur <code>file</code>, qui est la valeur par d&eacute;faut recommand&eacute;e.</p>
<p>En cas d'&eacute;chec de la conservation ou de la restauration d'une session Web, d'une instance SFSB ou d'une horloge EJB active, <i>aucune</i> d'entre elles ne sera disponible une fois le red&eacute;ploiement termin&eacute;. Toutefois, le red&eacute;ploiement se poursuit et un avertissement est consign&eacute;.</p>
<p>Pour conserver les donn&eacute;es d'&eacute;tat actives, GlassFish Server s&eacute;rialise les donn&eacute;es et les enregistre dans la m&eacute;moire. Pour restaurer les donn&eacute;es, le chargeur de classe de l'application qui vient d'&ecirc;tre red&eacute;ploy&eacute;e d&eacute;s&eacute;rialise les donn&eacute;es pr&eacute;c&eacute;demment enregistr&eacute;es.</p>
</dd>
<dt>Conserver les ressources de niveau application</dt>
<dd>
<p>Si cette case est coch&eacute;e, le syst&egrave;me conserve les ressources de niveau application et les restaure pendant le red&eacute;ploiement. Cette option n'est pas coch&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Ordre de d&eacute;ploiement</dt>
<dd>
<p>Ordre de d&eacute;ploiement de l'application.</p>
<p>Les applications ayant le num&eacute;ro le plus faible sont charg&eacute;es en premier au d&eacute;marrage du serveur. Une application ayant un ordre de d&eacute;ploiement de 102 est charg&eacute;e avant une application ayant un ordre de d&eacute;ploiement de 110. Si l'ordre de d&eacute;ploiement n'est pas indiqu&eacute; au moment o&ugrave; une application est d&eacute;ploy&eacute;e, l'ordre de d&eacute;ploiement par d&eacute;faut de 100 est affect&eacute;. Si deux applications ont le m&ecirc;me ordre de d&eacute;ploiement, l'application qui a &eacute;t&eacute; d&eacute;ploy&eacute;e en premier est charg&eacute;e en premier. La sp&eacute;cification d'un ordre de d&eacute;ploiement s'av&egrave;re utile si l'application a des d&eacute;pendances et doit &ecirc;tre charg&eacute;e dans un certain ordre.</p>
</dd>
<dt>Biblioth&egrave;ques</dt>
<dd>
<p>Liste des fichiers JAR de biblioth&egrave;que (s&eacute;par&eacute;s par des virgules) propres &agrave; ce module ou &agrave; cette application. Indique un chemin absolu ou relatif. Un chemin relatif est relatif &agrave; domain-dir<code>/lib/applibs</code>. Si le chemin est absolu, le serveur d'administration de domaine (DAS) doit pouvoir y acc&eacute;der, ce qui signifie qu'il doit se trouver sous domain-dir. Les biblioth&egrave;ques sont mises &agrave; la disposition de l'application selon l'ordre dans lequel elles sont sp&eacute;cifi&eacute;es.</p>
</dd>
<dt>Description</dt>
<dd>
<p>Description de l'application.</p>
</dd>
</dl>
<a id="sthref304" name="sthref304"></a>
<h5>Options suppl&eacute;mentaires pour les applications d'un autre type</h5>
<p>Dans le cas d'un autre type d'application, les options ci-apr&egrave;s apparaissent.</p>
<dl>
<dt>Nom de l'application</dt>
<dd>
<p>Nom de l'application.</p>
<p>Le nom peut &ecirc;tre suivi d'un identificateur de version facultatif dont il est s&eacute;par&eacute; par un signe deux-points (<code>:</code>). L'identificateur de version doit commencer par une lettre ou un chiffre. Il peut contenir des caract&egrave;res alphanum&eacute;riques, des traits de soulignement (<code>_</code>), des tirets (<code>-</code>) et des points (<code>.</code>). Pour plus d'informations sur les versions des modules et des applications, reportez-vous &agrave; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> dans le manuel <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt>Serveurs virtuels</dt>
<dd>
<p>Serveurs virtuels associ&eacute;s &agrave; cette application.</p>
<p>L'option Serveurs virtuels appara&icirc;t si seule l'instance de serveur par d&eacute;faut, <code>server</code>, existe. S'il existe des clusters ou d'autres instances de serveur autonomes, vous pouvez s&eacute;lectionner des serveurs virtuels apr&egrave;s le d&eacute;ploiement. Ouvrez la page Modifier une application, s&eacute;lectionnez l'onglet Cible, puis G&eacute;rer les serveurs virtuels pour la cible de votre choix.</p>
</dd>
<dt>Statut</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, l'application est activ&eacute;e. Cette option est s&eacute;lectionn&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Disponibilit&eacute;</dt>
<dd>
<p>Si la case Activ&eacute; est coch&eacute;e, la haute disponibilit&eacute; est activ&eacute;e pour la r&eacute;alisation de points de reprise et &eacute;ventuellement la passivation des sessions Web et des beans Session avec conservation de statut (SFSB). Si la valeur est False (valeur par d&eacute;faut), tous les enregistrements de session Web et la r&eacute;alisation de points de reprise SFSB sont d&eacute;sactiv&eacute;s pour l'application, l'application Web ou le module EJB sp&eacute;cifi&eacute;. Si cette valeur est True, l'application ou le module sp&eacute;cifi&eacute; est activ&eacute; pour la haute disponibilit&eacute;. D&eacute;finissez cette option sur True seulement si la haute disponibilit&eacute; est configur&eacute;e et activ&eacute;e &agrave; des niveaux sup&eacute;rieurs, tels que les niveaux serveur et conteneur.</p>
<p>Cette option appara&icirc;t si des clusters ou des instances de serveur autonomes existent en plus de l'instance de serveur par d&eacute;faut (<code>server</code>).</p>
</dd>
<dt>Type OSGi</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, elle indique un module OSGi/Java-EE hybride. Cette option appara&icirc;t uniquement si le type s&eacute;lectionn&eacute; est Autre.</p>
</dd>
<dt>Pr&eacute;compiler les JSP</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, les fichiers JSP (Java Server Pages) sont pr&eacute;compil&eacute;s. Si cette option est d&eacute;sactiv&eacute;e, les fichiers JSP sont compil&eacute;s au moment de l'ex&eacute;cution, lors de leur premier acc&egrave;s. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Ex&eacute;cuter le v&eacute;rificateur</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, les descripteurs de d&eacute;ploiement sont v&eacute;rifi&eacute;s avant le d&eacute;ploiement. En cas d'&eacute;chec de la v&eacute;rification, le d&eacute;ploiement n'a pas lieu. Le v&eacute;rificateur examine la structure et le contenu des descripteurs de d&eacute;ploiement. La v&eacute;rification d'applications volumineuses est souvent une t&acirc;che qui demande du temps. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
<p>Les packages du v&eacute;rificateur doivent &ecirc;tre install&eacute;s &agrave; partir de l'outil de mise &agrave; jour ; sinon, un avertissement est consign&eacute; et cette option est ignor&eacute;e.</p>
</dd>
<dt>Forcer le red&eacute;ploiement</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, l'application est red&eacute;ploy&eacute;e si elle a d&eacute;j&agrave; &eacute;t&eacute; d&eacute;ploy&eacute;e. Si cette option n'est pas s&eacute;lectionn&eacute;e, toute tentative de d&eacute;ploiement d'une application d&eacute;j&agrave; d&eacute;ploy&eacute;e g&eacute;n&egrave;re une erreur. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Conserver l'&eacute;tat</dt>
<dd>
<p>Cette option d&eacute;termine si les sessions Web, les instances SFSB et les horloges EJB cr&eacute;&eacute;es de fa&ccedil;on persistante sont conserv&eacute;es entre les red&eacute;ploiements.</p>
<p>Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut. Elle n'est prise en charge que sur l'instance de serveur par d&eacute;faut, nomm&eacute;e <code>server</code>. Elle n'est pas prise en charge et est ignor&eacute;e pour toute autre cible.</p>
<p>Certaines modifications apport&eacute;es &agrave; une application entre des red&eacute;ploiements emp&ecirc;chent cette option de fonctionner correctement. Par exemple, ne modifiez pas l'ensemble des variables d'instance dans la classe de bean SFSB.</p>
<p>Pour les applications Web, cette fonctionnalit&eacute; n'est applicable que si, dans le fichier <code>glassfish-web-app.xml</code>, l'attribut <code>persistence-type</code> de l'&eacute;l&eacute;ment <code>session-manager</code> est <code>file</code>.</p>
<p>Pour les instances SFSB, le type de persistance sans haute disponibilit&eacute; est d&eacute;fini dans le serveur (option Type de persistance SFSB) et doit avoir la valeur <code>file</code>, qui est la valeur par d&eacute;faut recommand&eacute;e.</p>
<p>En cas d'&eacute;chec de la conservation ou de la restauration d'une session Web, d'une instance SFSB ou d'une horloge EJB active, <i>aucune</i> d'entre elles ne sera disponible une fois le red&eacute;ploiement termin&eacute;. Toutefois, le red&eacute;ploiement se poursuit et un avertissement est consign&eacute;.</p>
<p>Pour conserver les donn&eacute;es d'&eacute;tat actives, GlassFish Server s&eacute;rialise les donn&eacute;es et les enregistre dans la m&eacute;moire. Pour restaurer les donn&eacute;es, le chargeur de classe de l'application qui vient d'&ecirc;tre red&eacute;ploy&eacute;e d&eacute;s&eacute;rialise les donn&eacute;es pr&eacute;c&eacute;demment enregistr&eacute;es.</p>
</dd>
<dt>Ordre de d&eacute;ploiement</dt>
<dd>
<p>Ordre de d&eacute;ploiement de l'application.</p>
<p>Les applications ayant le num&eacute;ro le plus faible sont charg&eacute;es en premier au d&eacute;marrage du serveur. Une application ayant un ordre de d&eacute;ploiement de 102 est charg&eacute;e avant une application ayant un ordre de d&eacute;ploiement de 110. Si l'ordre de d&eacute;ploiement n'est pas indiqu&eacute; au moment o&ugrave; une application est d&eacute;ploy&eacute;e, l'ordre de d&eacute;ploiement par d&eacute;faut de 100 est affect&eacute;. Si deux applications ont le m&ecirc;me ordre de d&eacute;ploiement, l'application qui a &eacute;t&eacute; d&eacute;ploy&eacute;e en premier est charg&eacute;e en premier. La sp&eacute;cification d'un ordre de d&eacute;ploiement s'av&egrave;re utile si l'application a des d&eacute;pendances et doit &ecirc;tre charg&eacute;e dans un certain ordre.</p>
</dd>
<dt>Biblioth&egrave;ques</dt>
<dd>
<p>Liste des fichiers JAR de biblioth&egrave;que (s&eacute;par&eacute;s par des virgules) propres &agrave; ce module ou &agrave; cette application. Indique un chemin absolu ou relatif. Un chemin relatif est relatif &agrave; domain-dir<code>/lib/applibs</code>. Si le chemin est absolu, le serveur d'administration de domaine (DAS) doit pouvoir y acc&eacute;der, ce qui signifie qu'il doit se trouver sous domain-dir. Les biblioth&egrave;ques sont mises &agrave; la disposition de l'application selon l'ordre dans lequel elles sont sp&eacute;cifi&eacute;es.</p>
</dd>
<dt>Description</dt>
<dd>
<p>Description de l'application.</p>
</dd>
</dl>
<a id="sthref305" name="sthref305"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-applistdeployed.html">Affichage de la liste des applications d&eacute;ploy&eacute;es</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">D&eacute;ploiement d'une application Web</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">D&eacute;ploiement d'une application d'entreprise</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">D&eacute;ploiement d'un client d'application</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">D&eacute;ploiement d'un module connecteur</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">D&eacute;ploiement d'un fichier JAR EJB</a></p>
</li>
<li>
<p><a href="task-appedit.html">Modification d'une application d&eacute;ploy&eacute;e</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">Affichage des descripteurs d'une application</a></p>
</li>
<li>
<p><a href="task-endpoint.html">Affichage des informations d'adresse pour un service Web</a></p>
</li>
<li>
<p><a href="task-applaunch.html">Lancement d'une application</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">Lancement d'un client d'application</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">T&eacute;l&eacute;chargement de stubs client d'application</a></p>
</li>
<li>
<p><a href="task-appredeploy.html">Red&eacute;ploiement d'une application d&eacute;ploy&eacute;e</a></p>
</li>
<li>
<p><a href="task-apprestart.html">Rechargement d'une application d&eacute;ploy&eacute;e</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">Affichage de ressources de niveau application</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">Modification de ressources de niveau application</a></p>
</li>
</ul>
<a id="sthref306" name="sthref306"></a>
<h5>Commandes asadmin connexes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00114"><code>deploy</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00217"><code>redeploy</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00148"><code>list-applications</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
