<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-configurationsystemproperties" name="ref-configurationsystemproperties"></a><a id="GHCOM00130" name="GHCOM00130"></a></p>

<h4><a id="sthref437" name="sthref437"></a><a id="sthref438" name="sthref438"></a>Propri&eacute;t&eacute;s syst&egrave;me</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Propri&eacute;t&eacute;s syst&egrave;me affiche la liste des propri&eacute;t&eacute;s syst&egrave;me Java d&eacute;finies pour la configuration nomm&eacute;e s&eacute;lectionn&eacute;e. Les propri&eacute;t&eacute;s syst&egrave;me Java sont transmises au lanceur d'application Java via son option <code>-D</code> au d&eacute;marrage de GlassFish Server.</p>
<p>Ces propri&eacute;t&eacute;s d&eacute;finissent les valeurs par d&eacute;faut des param&egrave;tres de port pour toutes les instances GlassFish Server qui r&eacute;f&eacute;rencent la configuration.</p>
<p>Pour plus d'informations sur les param&egrave;tres de port pr&eacute;d&eacute;finis dans une configuration, reportez-vous &agrave; <a href="ref-predefinedconfigsysproperties.html">Propri&eacute;t&eacute;s syst&egrave;me pr&eacute;d&eacute;finies</a>.</p>
<p>Pour chaque propri&eacute;t&eacute;, les informations suivantes sont affich&eacute;es :</p>
<dl>
<dt>Nom de la variable d'instance</dt>
<dd>
<p>Nom de la propri&eacute;t&eacute; syst&egrave;me.</p>
</dd>
<dt>Valeur par d&eacute;faut</dt>
<dd>
<p>Valeur d&eacute;finie pour la propri&eacute;t&eacute; dans la configuration nomm&eacute;e que l'instance r&eacute;f&eacute;rence. Ce champ est en lecture seule.</p>
</dd>
<dt>Valeurs de l'instance</dt>
<dd>
<p>Lien vers la page <a href="ref-sysinstancevalues.html">Valeurs de l'instance</a> de la propri&eacute;t&eacute;.</p>
</dd>
</dl>
<p>La table Autres propri&eacute;t&eacute;s contient &eacute;galement les options ci-apr&egrave;s.</p>
<dl>
<dt>Ajouter une propri&eacute;t&eacute;</dt>
<dd>
<p>Bouton permettant d'ajouter une propri&eacute;t&eacute;. Un clic sur ce bouton permet d'ajouter une ligne &agrave; la table Autres propri&eacute;t&eacute;s.</p>
</dd>
<dt>Supprimer des propri&eacute;t&eacute;s</dt>
<dd>
<p>Bouton permettant de supprimer les propri&eacute;t&eacute;s s&eacute;lectionn&eacute;es. Toute propri&eacute;t&eacute; supprim&eacute;e revient &agrave; sa valeur par d&eacute;faut ou, si aucune valeur par d&eacute;faut n'est configur&eacute;e, n'est pas d&eacute;finie.</p>
</dd>
</dl>
<p>La page Propri&eacute;t&eacute;s syst&egrave;me contient &eacute;galement les options suivantes :</p>
<dl>
<dt>Nom de configuration</dt>
<dd>
<p>Nom de la configuration &agrave; laquelle s'appliquent les param&egrave;tres de cette page. Ce champ est en lecture seule.</p>
</dd>
<dt>Reconfiguration dynamique</dt>
<dd>
<p>Si cette option est activ&eacute;e, les modifications apport&eacute;es &agrave; la configuration sont appliqu&eacute;es aux instances qui r&eacute;f&eacute;rencent la configuration sans n&eacute;cessiter le red&eacute;marrage des instances.</p>
</dd>
<dt>Clusters et/ou instances utilisant cette configuration</dt>
<dd>
<p>Liste des clusters et instances qui r&eacute;f&eacute;rencent la configuration en indiquant si chaque cluster ou instance est en cours d'ex&eacute;cution :</p>
<ul>
<li>
<p>Si l'instance ou le cluster est en cours d'ex&eacute;cution, une coche (&#10003;) s'affiche.</p>
</li>
<li>
<p>Si le cluster ou l'instance est arr&ecirc;t&eacute;, un point d'exclamation (<code>!</code>) appara&icirc;t.</p>
</li>
</ul>
</dd>
</dl>
<a id="sthref439" name="sthref439"></a>
<h5>T&acirc;ches connexes</h5>
<p>D&eacute;finition des valeurs par d&eacute;faut des propri&eacute;t&eacute;s de configuration</p>
<a id="sthref440" name="sthref440"></a>
<h5>Sous-commandes asadmin &eacute;quivalentes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00059"><code>create-system-properties</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00110"><code>delete-system-property</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00203"><code>list-system-properties</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
