<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-lifecyclemoduleedit" name="ref-lifecyclemoduleedit"></a><a id="GHCOM00081" name="GHCOM00081"></a></p>

<h4><a id="sthref319" name="sthref319"></a>Modifier le module de cycle de vie</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Modifier le module de cycle de vie permet de modifier les param&egrave;tres d'un module de cycle de vie.</p>
<p>Elle contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Nom</dt>
<dd>
<p>Nom du module de cycle de vie. Le champ Nom est en lecture seule. Vous ne pouvez sp&eacute;cifier le nom qu'&agrave; la cr&eacute;ation du module de cycle de vie.</p>
</dd>
<dt>Nom de classe</dt>
<dd>
<p>Nom qualifi&eacute; complet du fichier de classe du module de cycle de vie. La classe doit impl&eacute;menter l'interface <code>com.sun.appserv.server.LifecycleListener</code>.</p>
</dd>
<dt>Classpath</dt>
<dd>
<p>Classpath du module de cycle de vie. Le classpath indique l'emplacement du module de cycle de vie. La valeur par d&eacute;faut est domain-dir<code>/applications</code>. Si le module est d&eacute;j&agrave; dans ce r&eacute;pertoire (c'est-&agrave;-dire dans le classpath du serveur), ce champ peut &ecirc;tre laiss&eacute; vide.</p>
</dd>
<dt>Ordre de chargement</dt>
<dd>
<p>Ordre dans lequel ce module de cycle de vie doit &ecirc;tre charg&eacute; au d&eacute;marrage. Les modules aux valeurs enti&egrave;res les plus faibles dans l'ordre de chargement sont charg&eacute;s en premier. Ce chiffre peut aller de 101 &agrave; la valeur <code>MAXINT</code> du syst&egrave;me d'exploitation. Les valeurs de 1 &agrave; 100 sont r&eacute;serv&eacute;es.</p>
</dd>
<dt>Description</dt>
<dd>
<p>Description du module de cycle de vie.</p>
</dd>
<dt>Statut</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, le module de cycle de vie est activ&eacute;. Cette option est activ&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Echec lors du chargement</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, le serveur sera arr&ecirc;t&eacute; en cas d'&eacute;chec de chargement du module de cycle de vie. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
</dl>
<a id="sthref320" name="sthref320"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-lifecyclemodulenew.html">Cr&eacute;ation d'un module de cycle de vie</a></p>
</li>
<li>
<p><a href="task-lifecyclemoduleedit.html">Modification d'un module de cycle de vie</a></p>
</li>
<li>
<p><a href="task-lifecyclemoduledelete.html">Suppression d'un module de cycle de vie</a></p>
</li>
</ul>
<a id="sthref321" name="sthref321"></a>
<h5>Commandes asadmin connexes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00043"><code>create-lifecycle-module</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00181"><code>list-lifecycle-modules</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00095"><code>delete-lifecycle-module</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
