<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-messagesecurityconfig" name="ref-messagesecurityconfig"></a></p>

<h4><a id="sthref404" name="sthref404"></a>Configurations de la s&eacute;curit&eacute; des messages</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Configurations de la s&eacute;curit&eacute; des messages permet d'afficher et de modifier les configurations disponibles pour les fournisseurs de s&eacute;curit&eacute; des messages.</p>
<p>Pour configurer la s&eacute;curit&eacute; des messages, vous devez comprendre les bases des concepts de s&eacute;curit&eacute; et de services Web. Pour plus d'informations, reportez-vous au <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSSCG00037">chapitre 3, <i>Administering Message Security</i>, du manuel <i>Oracle GlassFish Server Security Guide</i></a> et au <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSADG00009">chapitre 6, <i>Administering Web Applications</i>, du manuel <i>Oracle GlassFish Server Administration Guide</i></a>.</p>
<p>GlassFish Server impl&eacute;mente la s&eacute;curit&eacute; des messages via les fournisseurs de s&eacute;curit&eacute; des messages int&eacute;gr&eacute;s &agrave; sa couche de traitement SOAP. Les fournisseurs de s&eacute;curit&eacute; des messages d&eacute;pendent des autres utilitaires de s&eacute;curit&eacute; de GlassFish Server.</p>
<p>Pour chaque configuration, les informations ci-apr&egrave;s sont fournies.</p>
<dl>
<dt>Couche d'authentification</dt>
<dd>
<p>Couche Messages au niveau de laquelle l'authentification est effectu&eacute;e. Par d&eacute;faut, une configuration SOAP est fournie. Il est &eacute;galement possible de fournir une configuration HttpServlet.</p>
</dd>
<dt>Fournisseur par d&eacute;faut</dt>
<dd>
<p>Fournisseur c&ocirc;t&eacute; serveur par d&eacute;faut pour cette configuration. Aucun fournisseur c&ocirc;t&eacute; serveur par d&eacute;faut n'est configur&eacute;.</p>
</dd>
<dt>Fournisseur client par d&eacute;faut</dt>
<dd>
<p>Fournisseur c&ocirc;t&eacute; client par d&eacute;faut pour cette configuration. Aucun fournisseur c&ocirc;t&eacute; client par d&eacute;faut n'est configur&eacute;.</p>
</dd>
</dl>
<p>La table Configurations de la s&eacute;curit&eacute; des messages contient &eacute;galement les options ci-apr&egrave;s.</p>
<dl>
<dt>Nouveau</dt>
<dd>
<p>Bouton permettant de cr&eacute;er une configuration.</p>
</dd>
<dt>Supprimer</dt>
<dd>
<p>Bouton permettant de supprimer les configurations s&eacute;lectionn&eacute;es.</p>
</dd>
</dl>
<a id="sthref405" name="sthref405"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">Configuration des utilitaires GlassFish Server que les fournisseurs de s&eacute;curit&eacute; des messages doivent utiliser</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">Cr&eacute;ation d'une configuration de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">Modification d'une configuration de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">Suppression d'une configuration de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">Cr&eacute;ation d'une configuration de fournisseur de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">Modification d'une configuration de fournisseur de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">Suppression d'une configuration de fournisseur de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">Activation de la s&eacute;curit&eacute; des messages pour les clients d'application</a></p>
</li>
</ul>
<a id="sthref406" name="sthref406"></a>
<h5>Commandes asadmin connexes</h5>
<p>Aucune.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
