<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-ldaprealmprop" name="ref-ldaprealmprop"></a></p>

<h4><a id="sthref365" name="sthref365"></a><a id="sthref366" name="sthref366"></a>Propri&eacute;t&eacute;s propres &agrave; la classe <code>LDAPRealm</code></h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Les propri&eacute;t&eacute;s suivantes sont obligatoires pour un domaine LDAP.</p>
<dl>
<dt>Contexte de JAAS</dt>
<dd>
<p>Contexte JAAS (Java Authentication and Authorization Service) identifiant le module de connexion &agrave; utiliser pour ce domaine. La seule valeur valide est <code>solarisRealm</code>.</p>
</dd>
<dt>R&eacute;pertoire</dt>
<dd>
<p>URL LDAP du serveur.</p>
</dd>
<dt>Nom distinctif de base</dt>
<dd>
<p>Nom distinctif (DN) de base LDAP pour l'emplacement des donn&eacute;es utilisateur. Ce DN de base peut se trouver &agrave; n'importe quel niveau au-dessus des donn&eacute;es utilisateur, &eacute;tant donn&eacute; qu'une recherche en arborescence est effectu&eacute;e. Plus l'arborescence de recherche est r&eacute;duite, meilleures sont les performances.</p>
</dd>
</dl>
<p>La propri&eacute;t&eacute; facultative suivante est disponible pour un domaine LDAP.</p>
<dl>
<dt>Affecter des groupes</dt>
<dd>
<p>Liste de noms de groupe s&eacute;par&eacute;s par une virgule. Tous les clients pr&eacute;sentant un certificat valide sont affect&eacute;s &agrave; ces groupes, comme par exemple <code>employee,manager</code> qui sont des noms de groupes d'utilisateurs.</p>
</dd>
</dl>
<p>Les propri&eacute;t&eacute;s facultatives suivantes sont disponibles pour un domaine LDAP.</p>
<dl>
<dt><code>search-filter</code></dt>
<dd>
<p>Filtre de recherche &agrave; utiliser pour trouver l'utilisateur. La valeur par d&eacute;faut est <code>uid=%s</code> (<code>%s</code> s'&eacute;tend au nom du sujet).</p>
</dd>
<dt><code>group-base-dn</code></dt>
<dd>
<p>DN de base pour l'emplacement des donn&eacute;es de groupe. Par d&eacute;faut, il est identique &agrave; la valeur du DN de base, mais il peut &ecirc;tre affin&eacute; si n&eacute;cessaire.</p>
</dd>
<dt><code>group-search-filter</code></dt>
<dd>
<p>Filtre de recherche permettant de trouver les appartenances de l'utilisateur &agrave; des groupes. La valeur par d&eacute;faut est <code>uniquemember=%d</code> (<code>%d</code> s'&eacute;tend au nom distinctif d'&eacute;l&eacute;ment de l'utilisateur).</p>
</dd>
<dt><code>group-target</code></dt>
<dd>
<p>Nom d'attribut LDAP contenant les entr&eacute;es des noms de groupe. La valeur par d&eacute;faut est <code>CN</code>.</p>
</dd>
<dt><code>search-bind-dn</code></dt>
<dd>
<p>DN facultatif utilis&eacute; pour l'authentification aupr&egrave;s du r&eacute;pertoire en vue de l'ex&eacute;cution de la recherche <code>search-filter</code>. Obligatoire uniquement pour les r&eacute;pertoires ne permettant pas de recherche anonyme.</p>
</dd>
<dt><code>search-bind-password</code></dt>
<dd>
<p>Mot de passe LDAP associ&eacute; au DN indiqu&eacute; dans <code>search-bind-dn</code>.</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
