<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-uc-installed" name="ref-uc-installed"></a></p>

<h4><a id="sthref459" name="sthref459"></a>Composants install&eacute;s</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Composants install&eacute;s contient des informations sur les composants de l'image d'installation d&eacute;j&agrave; install&eacute;s.</p>
<p>Pour d&eacute;sinstaller des composants install&eacute;s, commencez par arr&ecirc;ter le domaine GlassFish Server. Utilisez ensuite l'une des commandes suivantes :</p>
<ul>
<li>
<p><code>glassfish3/bin/updatetool</code>, qui d&eacute;marre l'utilitaire graphique de l'outil de mise &agrave; jour</p>
</li>
<li>
<p><code>glassfish3/bin/pkg</code>, version de ligne de commande de l'outil de mise &agrave; jour</p>
</li>
</ul>
<p>Pour plus d'informations sur l'utilisation de la commande <code>pkg</code>, reportez-vous au <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSADG00014">chapitre 11, <i>Extending and Updating GlassFish Server</i>, dans le manuel <i>Oracle GlassFish Server Administration Guide</i></a>. L'utilitaire de l'outil de mise &agrave; jour poss&egrave;de sa propre aide en ligne.</p>
<p>Red&eacute;marrez le serveur apr&egrave;s avoir termin&eacute; la d&eacute;sinstallation des composants.</p>
<p>La page Composants install&eacute;s contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Chemin d'installation</dt>
<dd>
<p>Chemin du syst&egrave;me de fichiers du r&eacute;pertoire racine ou du r&eacute;pertoire de niveau sup&eacute;rieur de l'image d'installation.</p>
</dd>
<dt>Composants install&eacute;s</dt>
<dd>
<p>Pour chacun des composants install&eacute;s, cette table fournit les informations ci-apr&egrave;s.</p>
<dl>
<dt>Composant</dt>
<dd>
<p>Nom du composant.</p>
</dd>
<dt>Cat&eacute;gorie</dt>
<dd>
<p>Cat&eacute;gorie du logiciel auquel le composant est associ&eacute; (par exemple, serveurs d'applications, outils syst&egrave;me et bases de donn&eacute;es). La cat&eacute;gorie est affect&eacute;e au composant par le fabricant au moment de la cr&eacute;ation du composant.</p>
</dd>
<dt>Version</dt>
<dd>
<p>Num&eacute;ro de version du package comprenant le composant.</p>
</dd>
<dt>Taille apr&egrave;s installation</dt>
<dd>
<p>Espace disque utilis&eacute; pour l'installation du composant.</p>
</dd>
<dt>Source</dt>
<dd>
<p>Nom du <a href="ref-uc-concepts.html#ref-uc-about-repository">R&eacute;f&eacute;rentiel r&eacute;seau</a> &agrave; partir duquel le composant a &eacute;t&eacute; obtenu.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref460" name="sthref460"></a>
<h5>T&acirc;ches connexes</h5>
<p><a href="task-uc-installed-remove.html">Affichage des composants install&eacute;s</a></p>
<a id="sthref461" name="sthref461"></a>
<h5>Commandes asadmin connexes</h5>
<p>Aucune.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
