<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-monitoringservice" name="ref-monitoringservice"></a></p>

<h4><a id="sthref434" name="sthref434"></a>Service de surveillance</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Service de surveillance permet de configurer les options de surveillance des composants ou services de serveur individuels.</p>
<p>Vous devez d&eacute;ployer une application, un composant ou un service avant d'en configurer la surveillance.</p>
<p>La page Service de surveillance contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Nom de configuration</dt>
<dd>
<p>Nom de la configuration &agrave; laquelle s'appliquent les param&egrave;tres de cette page. Ce champ est en lecture seule.</p>
</dd>
<dt>Service de surveillance</dt>
<dd>
<p>Si la case Service de surveillance activ&eacute; est coch&eacute;e, la surveillance est activ&eacute;e pour GlassFish Server. Cette option est activ&eacute;e par d&eacute;faut.</p>
</dd>
<dt>MBeans de surveillance</dt>
<dd>
<p>Si la case MBeans de surveillance activ&eacute;s est coch&eacute;e, tous les MBeans n&eacute;cessaires &agrave; la surveillance sont d&eacute;ploy&eacute;s sur GlassFish Server. Cette option est activ&eacute;e par d&eacute;faut.</p>
<p>Si la case n'est pas coch&eacute;e, vous ne pouvez pas afficher les donn&eacute;es de surveillance dans la Console d'administration, m&ecirc;me si la case Service de surveillance est coch&eacute;e. Au lieu de cela, vous devez utiliser la ligne de commande pour afficher les donn&eacute;es de surveillance. Si vous d&eacute;s&eacute;lectionnez la case, l'empreinte de m&eacute;moire de GlassFish Server est r&eacute;duite.</p>
</dd>
<dt>DTrace</dt>
<dd>
<p>Si la case DTrace activ&eacute; est coch&eacute;e et si vous avez activ&eacute; la surveillance DTrace de Oracle Enterprise Manager, vous pouvez utiliser l'outil DTrace Solaris. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
</dl>
<p>Pour chaque composant disponible, les informations ci-apr&egrave;s sont fournies.</p>
<dl>
<dt>Composant</dt>
<dd>
<p>Nom du composant GlassFish Server.</p>
</dd>
<dt>Niveau de surveillance</dt>
<dd>
<p>Niveau de surveillance d&eacute;fini pour le composant. Pour chaque composant, les niveaux disponibles sont LOW, HIGH et OFF. Le niveau par d&eacute;faut est OFF. Dans cette version, il n'existe aucune diff&eacute;rence entre les options LOW et HIGH.</p>
</dd>
</dl>
<p>La table Param&egrave;tres de niveau composant contient &eacute;galement les options ci-apr&egrave;s.</p>
<dl>
<dt>Modifier le niveau</dt>
<dd>
<p>Bouton permettant de modifier le niveau de surveillance des composants s&eacute;lectionn&eacute;s.</p>
</dd>
<dt>Niveau</dt>
<dd>
<p>Liste d&eacute;roulante dans laquelle vous pouvez s&eacute;lectionner un niveau de surveillance &agrave; appliquer &agrave; tous les composants s&eacute;lectionn&eacute;s.</p>
</dd>
</dl>
<a id="sthref435" name="sthref435"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-confmonitor.html">Configuration du service de surveillance</a></p>
</li>
<li>
<p><a href="task-appmonitoringdata.html">Affichage des donn&eacute;es de surveillance d'application</a></p>
</li>
<li>
<p><a href="task-servermonitoringdata.html">Affichage des donn&eacute;es de surveillance de serveur</a></p>
</li>
<li>
<p><a href="task-resourcemonitoringdata.html">Affichage des donn&eacute;es de surveillance de ressource</a></p>
</li>
</ul>
<a id="sthref436" name="sthref436"></a>
<h5>Commandes asadmin connexes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00128"><code>enable-monitoring</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00120"><code>disable-monitoring</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00212"><code>monitor</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
