<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-applications" name="ref-applications"></a><a id="GHCOM00068" name="GHCOM00068"></a></p>

<h4><a id="sthref269" name="sthref269"></a>Applications</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Applications pr&eacute;sente la liste des applications d&eacute;ploy&eacute;es sur GlassFish Server. Vous pouvez afficher et g&eacute;rer les applications qui sont d&eacute;j&agrave; d&eacute;ploy&eacute;es et vous pouvez d&eacute;ployer d'autres applications.</p>
<p>Pour chaque application, les informations suivantes sont fournies :</p>
<dl>
<dt>Nom</dt>
<dd>
<p>Nom de l'application.</p>
<p>Le nom peut &ecirc;tre suivi d'un identificateur de version facultatif dont il est s&eacute;par&eacute; par un signe deux-points (<code>:</code>). Pour plus d'informations sur les versions des modules et des applications, reportez-vous &agrave; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> dans le manuel <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt>Ordre de d&eacute;ploiement</dt>
<dd>
<p>Ordre de d&eacute;ploiement de l'application.</p>
<p>Les applications ayant le num&eacute;ro le plus faible sont charg&eacute;es en premier au d&eacute;marrage du serveur. Une application ayant un ordre de d&eacute;ploiement de 102 est charg&eacute;e avant une application ayant un ordre de d&eacute;ploiement de 110. Si l'ordre de d&eacute;ploiement n'est pas indiqu&eacute; au moment o&ugrave; une application est d&eacute;ploy&eacute;e, l'ordre de d&eacute;ploiement par d&eacute;faut de 100 est affect&eacute;. Si deux applications ont le m&ecirc;me ordre de d&eacute;ploiement, l'application qui a &eacute;t&eacute; d&eacute;ploy&eacute;e en premier est charg&eacute;e en premier. La sp&eacute;cification d'un ordre de d&eacute;ploiement s'av&egrave;re utile si l'application a des d&eacute;pendances et doit &ecirc;tre charg&eacute;e dans un certain ordre.</p>
</dd>
<dt>Activ&eacute; ou statut</dt>
<dd>
<p>Coche si l'application est activ&eacute;e ou X si l'application est d&eacute;sactiv&eacute;e (si seule l'instance de serveur par d&eacute;faut <code>server</code> existe).</p>
<p>S'il existe des clusters ou d'autres instances de serveur autonomes, s&eacute;lectionnez Activ&eacute; sur les cibles pour afficher les cibles sur lesquelles l'application est d&eacute;ploy&eacute;e.</p>
</dd>
<dt>Moteurs</dt>
<dd>
<p>Types de conteneurs utilis&eacute;s par l'application. Voici les diff&eacute;rents types de conteneur :</p>
<ul>
<li>
<p><code>web</code></p>
</li>
<li>
<p><code>webservices</code></p>
</li>
<li>
<p><code>ejb</code></p>
</li>
<li>
<p><code>connector</code></p>
</li>
<li>
<p><code>appclient</code></p>
</li>
<li>
<p><code>weld</code> (conteneur Contexts and Dependency Injection des applications Java EE Platform)</p>
</li>
</ul>
</dd>
<dt>Action</dt>
<dd>
<p>Liens vers les actions que vous pouvez effectuer sur le composant apr&egrave;s l'avoir d&eacute;ploy&eacute; : Red&eacute;ploiement et Rechargement pour tous les composants, Lancement pour les applications Web et les clients d'application et T&eacute;l&eacute;chargement des stubs client pour les clients d'application.</p>
</dd>
</dl>
<p>La table Applications d&eacute;ploy&eacute;es contient &eacute;galement les options ci-apr&egrave;s.</p>
<dl>
<dt>D&eacute;ployer</dt>
<dd>
<p>Bouton permettant de d&eacute;ployer une application.</p>
</dd>
<dt>Annuler le d&eacute;ploiement</dt>
<dd>
<p>Bouton permettant d'annuler le d&eacute;ploiement des applications s&eacute;lectionn&eacute;es.</p>
</dd>
<dt>Activer</dt>
<dd>
<p>Bouton permettant d'activer les applications s&eacute;lectionn&eacute;es, si seule l'instance de serveur par d&eacute;faut, <code>server</code>, existe.</p>
</dd>
<dt>D&eacute;sactiver</dt>
<dd>
<p>Bouton permettant de d&eacute;sactiver les applications s&eacute;lectionn&eacute;es, si seule l'instance de serveur par d&eacute;faut, <code>server</code>, existe.</p>
</dd>
<dt>Filtre</dt>
<dd>
<p>Liste d&eacute;roulante qui filtre les applications par moteur.</p>
</dd>
</dl>
<a id="sthref270" name="sthref270"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-applistdeployed.html">Affichage de la liste des applications d&eacute;ploy&eacute;es</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">D&eacute;ploiement d'une application Web</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">D&eacute;ploiement d'une application d'entreprise</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">D&eacute;ploiement d'un client d'application</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">D&eacute;ploiement d'un module connecteur</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">D&eacute;ploiement d'un fichier JAR EJB</a></p>
</li>
<li>
<p><a href="task-appedit.html">Modification d'une application d&eacute;ploy&eacute;e</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">Affichage des descripteurs d'une application</a></p>
</li>
<li>
<p><a href="task-appviewtargets.html">Affichage des cibles d'application</a></p>
</li>
<li>
<p><a href="task-endpoint.html">Affichage des informations d'adresse pour un service Web</a></p>
</li>
<li>
<p><a href="task-applaunch.html">Lancement d'une application</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">Lancement d'un client d'application</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">T&eacute;l&eacute;chargement de stubs client d'application</a></p>
</li>
<li>
<p><a href="task-appredeploy.html">Red&eacute;ploiement d'une application d&eacute;ploy&eacute;e</a></p>
</li>
<li>
<p><a href="task-apprestart.html">Rechargement d'une application d&eacute;ploy&eacute;e</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">Affichage de ressources de niveau application</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">Modification de ressources de niveau application</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
