<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-eelogging" name="ref-eelogging"></a><a id="GHCOM00094" name="GHCOM00094"></a></p>

<h4><a id="sthref339" name="sthref339"></a>Param&egrave;tres du journaliseur</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Param&egrave;tres du journaliseur permet de configurer la journalisation pour l'instance ou le cluster GlassFish Server s&eacute;lectionn&eacute;.</p>
<p>Elle contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Nom de configuration</dt>
<dd>
<p>Nom de la configuration &agrave; laquelle s'appliquent les param&egrave;tres de cette page. Ce champ est en lecture seule.</p>
</dd>
<dt>Ecrire dans le journal syst&egrave;me</dt>
<dd>
<p>Lorsque cette option est activ&eacute;e, la sortie de journalisation est envoy&eacute;e &agrave; l'utilitaire <code>syslog</code> en plus du journal du serveur. Cette fonctionnalit&eacute; est disponible sur les syst&egrave;mes Solaris et Linux uniquement. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Journaliser dans la console</dt>
<dd>
<p>Lorsque cette option est activ&eacute;e, la sortie de journalisation est envoy&eacute;e &agrave; la console syst&egrave;me.</p>
</dd>
<dt>Modification de la date de rotation</dt>
<dd>
<p>Lorsque cette option est activ&eacute;e, GlassFish Server change de fichier journal chaque jour &agrave; minuit.</p>
</dd>
<dt>Mode multiligne</dt>
<dd>
<p>Lorsque cette option est activ&eacute;e, les messages de journalisation sont mis en forme d'une mani&egrave;re qui rend leur lecture plus facile. Le corps des messages de journalisation est mis en retrait et commence sur une nouvelle ligne.</p>
</dd>
<dt>Format de journalisation de console</dt>
<dd>
<p>Format de journalisation dans la console. Les choix possibles sont ULF (UniformLogFormatter) et ODL (Oracle Diagnostics Logging). La valeur par d&eacute;faut est ODL.</p>
</dd>
<dt>Format de journalisation LogFile</dt>
<dd>
<p>Format de journalisation dans le fichier journal du serveur. Les options disponibles sont ULF et ODL. La valeur par d&eacute;faut est ODL.</p>
</dd>
<dt>Limite de rotation des fichiers</dt>
<dd>
<p>Taille en octets que le fichier journal du serveur doit atteindre avant d'&ecirc;tre d&eacute;plac&eacute;. Lorsque le journal du serveur atteint la taille indiqu&eacute;e, GlassFish Server cr&eacute;e un fichier vide nomm&eacute; <code>server.log</code> et renomme l'ancien fichier <code>server.log_</code><i>date</i>, o&ugrave; <i>date</i> indique la date et l'heure auxquelles le fichier est d&eacute;plac&eacute;. La valeur par d&eacute;faut est 2 Mo. La valeur minimale est 500 ko. Si vous sp&eacute;cifiez une valeur inf&eacute;rieure, le fichier est d&eacute;plac&eacute; lorsqu'il atteint 500 ko. Pour d&eacute;sactiver la rotation du fichier journal, sp&eacute;cifiez la valeur 0.</p>
</dd>
<dt>Temps limite de rotation des fichiers</dt>
<dd>
<p>Nombre de minutes au bout duquel le journal du serveur doit &ecirc;tre d&eacute;plac&eacute;. La valeur par d&eacute;faut est 0 ; cela signifie que le fichier est d&eacute;plac&eacute; lorsqu'il atteint la taille sp&eacute;cifi&eacute;e dans le champ Limite de rotation des fichiers. Si vous sp&eacute;cifiez une ou plusieurs minutes, le temps limite remplace la taille limite indiqu&eacute;e par le champ Limite de rotation des fichiers.</p>
</dd>
<dt>Fr&eacute;quence de vidage</dt>
<dd>
<p>Nombre maximal de messages &agrave; &eacute;crire simultan&eacute;ment de la file d'attente vers le journal du serveur. La valeur par d&eacute;faut est 1.</p>
</dd>
<dt>Nombre maximal de fichiers d'historique</dt>
<dd>
<p>Nombre maximal de fichiers journaux que GlassFish Server conserve avant de supprimer le fichier le plus ancien. Si vous d&eacute;finissez cette valeur sur z&eacute;ro (0), GlassFish Server ne supprime pas les anciens fichiers journaux.</p>
</dd>
<dt>Fichier journal</dt>
<dd>
<p>Autre nom ou emplacement pour le fichier du journal du serveur. L'emplacement par d&eacute;faut est domain-dir<code>/logs/server.log</code>.</p>
</dd>
<dt>Gestionnaire du journal</dt>
<dd>
<p>Nom de classe absolu d'un gestionnaire de journal personnalis&eacute;. Un gestionnaire de journal personnalis&eacute; permet d'envoyer des journaux vers une destination autre que <code>server.log</code> ou <code>syslog</code>. Il doit &eacute;tendre la classe <code>java.util.logging.Handler</code> (API compatible JSR 047). Ajoutez la classe du gestionnaire au classpath de GlassFish Server de fa&ccedil;on &agrave; installer le gestionnaire au d&eacute;marrage du serveur.</p>
</dd>
</dl>
<a id="sthref340" name="sthref340"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-eelogging.html">Configuration de param&egrave;tres de journalisation g&eacute;n&eacute;raux</a></p>
</li>
<li>
<p><a href="task-eelogginglevels.html">Configuration de niveaux de journalisation</a></p>
</li>
<li>
<p><a href="task-logviewer.html">Affichage de fichiers journaux pour le serveur DAS</a></p>
</li>
</ul>
<a id="sthref341" name="sthref341"></a>
<h5>Commandes asadmin connexes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00007"><code>collect-log-files</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00183"><code>list-log-levels</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00224"><code>rotate-log</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00228"><code>set-log-levels</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
