<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-editfile-adminrealm" name="ref-editfile-adminrealm"></a></p>

<h4><a id="sthref359" name="sthref359"></a><a id="sthref360" name="sthref360"></a>Propri&eacute;t&eacute;s propres &agrave; la classe <code>FileRealm</code></h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Les propri&eacute;t&eacute;s suivantes sont obligatoires pour un domaine <code>file</code>.</p>
<dl>
<dt>Contexte de JAAS</dt>
<dd>
<p>Contexte JAAS (Java Authentication and Authorization Service) identifiant le module de connexion &agrave; utiliser pour ce domaine. La seule valeur valide est <code>fileRealm</code>.</p>
</dd>
<dt>Fichier de cl&eacute;s</dt>
<dd>
<p>Chemin complet et nom du fichier o&ugrave; le serveur stockera toutes les informations relatives aux utilisateurs, groupes et mots de passe du domaine. La valeur par d&eacute;faut est domain-dir<code>/config/keyfile</code> pour le domaine <code>file</code> et domain-dir<code>/config/admin-keyfile</code> pour le domaine <code>admin-realm</code>.</p>
</dd>
</dl>
<p>Au d&eacute;part, le fichier de cl&eacute;s du domaine <code>file</code> est vide. Les utilisateurs doivent donc &ecirc;tre ajout&eacute;s sur la page <a href="ref-managefilerealm.html">Utilisateurs de fichiers</a> avant toute utilisation du domaine <code>file</code>.</p>
<p>Au d&eacute;part, le fichier de cl&eacute;s du domaine <code>admin-realm</code> contient le nom utilisateur de l'administrateur, le mot de passe associ&eacute; dans un format crypt&eacute; et le groupe auquel appartient l'utilisateur (<code>asadmin</code> par d&eacute;faut). Pour plus d'informations sur l'ajout d'utilisateurs au domaine <code>admin-realm</code>, reportez-vous &agrave; <a href="task-accessadmintools.html">Octroi d'un acc&egrave;s aux outils d'administration</a>.</p>

<hr>
<p><b>Remarque:</b></p>
Les utilisateurs du groupe <code>asadmin</code> dans le domaine <code>admin-realm</code> sont autoris&eacute;s &agrave; employer la Console d'administration et les outils <code>asadmin</code>. N'ajoutez &agrave; ce groupe que des utilisateurs ayant des privil&egrave;ges d'administrateur de serveur.
<hr>

<p>La propri&eacute;t&eacute; facultative suivante est disponible pour un domaine <code>file</code>.</p>
<dl>
<dt>Affecter des groupes</dt>
<dd>
<p>Liste de noms de groupe s&eacute;par&eacute;s par une virgule. Tous les clients pr&eacute;sentant un certificat valide sont affect&eacute;s &agrave; ces groupes, comme par exemple <code>employee,manager</code> qui sont des noms de groupes d'utilisateurs.</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
