<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-serverinstappsconfig" name="ref-serverinstappsconfig"></a><a id="GHCOM00053" name="GHCOM00053"></a></p>

<h4><a id="sthref216" name="sthref216"></a><a id="sthref217" name="sthref217"></a><a id="sthref218" name="sthref218"></a><a id="sthref219" name="sthref219"></a><a id="sthref220" name="sthref220"></a>Configuration des applications</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Sur la page Configuration des applications, vous pouvez d&eacute;finir les propri&eacute;t&eacute;s permettant de s'assurer que les modifications apport&eacute;es aux applications d&eacute;ploy&eacute;es sont d&eacute;tect&eacute;es et que les classes modifi&eacute;es sont recharg&eacute;es.</p>
<p>La page Configuration des applications contient les options suivantes :</p>
<dl>
<dt>Charger les valeurs par d&eacute;faut</dt>
<dd>
<p>Bouton permettant de restaurer les valeurs par d&eacute;faut des param&egrave;tres qui en ont. Les param&egrave;tres qui n'ont pas de valeurs par d&eacute;faut ne sont pas modifi&eacute;s.</p>
</dd>
<dt>Recharger</dt>
<dd>
<p>Si cette option est activ&eacute;e, les classes modifi&eacute;es sont recharg&eacute;es dynamiquement. Le serveur recherche r&eacute;guli&egrave;rement la pr&eacute;sence de modifications dans le r&eacute;pertoire de d&eacute;ploiement et red&eacute;ploie l'application, automatiquement et dynamiquement, avec ces modifications. Cette fonction est utile dans un environnement de d&eacute;veloppement car elle permet de tester rapidement les modifications du code. Cependant, dans un environnement de production, le rechargement dynamique peut diminuer les performances. De plus, &agrave; chaque rechargement, les sessions ouvertes durant cette p&eacute;riode de transition deviennent non valides. Le client doit red&eacute;marrer la session. Cette option est activ&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Intervalle d'interrogation de rechargement</dt>
<dd>
<p>Identifie la fr&eacute;quence &agrave; laquelle le serveur doit v&eacute;rifier les &eacute;ventuelles modifications de code dans les applications et modules d&eacute;ploy&eacute;s. La valeur par d&eacute;faut est 2.</p>
</dd>
<dt>Expiration de la session d'administration</dt>
<dd>
<p>Identifie le nombre de minutes d'inactivit&eacute; devant s'&eacute;couler avant que la Console d'administration n'arrive &agrave; expiration et exige une reconnexion. La valeur par d&eacute;faut est 60.</p>
</dd>
<dt>D&eacute;ploiement automatique</dt>
<dd>
<p>Si cette option est activ&eacute;e, les applications plac&eacute;es dans le r&eacute;pertoire de d&eacute;ploiement automatique sont d&eacute;ploy&eacute;es automatiquement. Cette option est activ&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Intervalle d'interrogation de d&eacute;ploiement automatique</dt>
<dd>
<p>D&eacute;finit la fr&eacute;quence &agrave; laquelle le serveur doit v&eacute;rifier la pr&eacute;sence de modifications d'application ou de module dans le r&eacute;pertoire de d&eacute;ploiement automatique. La modification de l'intervalle d'interrogation n'affecte pas le temps de d&eacute;ploiement d'une application ou d'un module. La valeur par d&eacute;faut est 2.</p>
</dd>
<dt>Expiration du d&eacute;lai de tentative de d&eacute;ploiement automatique</dt>
<dd>
<p>D&eacute;finit le nombre de secondes pendant lesquelles la taille d'un fichier partiellement copi&eacute; peut demeurer inchang&eacute;e avant qu'une erreur ne se produise. La valeur par d&eacute;faut est 4.</p>
<p>Lorsqu'un fichier est copi&eacute; lentement dans le r&eacute;pertoire de d&eacute;ploiement automatique, il peut s'afficher avant d'&ecirc;tre copi&eacute; en entier. Cela entra&icirc;ne l'&eacute;chec de la tentative de d&eacute;ploiement automatique de l'application. Dans ce cas, GlassFish Server tente de d&eacute;ployer l'application &agrave; nouveau. Si la taille du fichier partiellement copi&eacute; demeure inchang&eacute;e apr&egrave;s le d&eacute;lai sp&eacute;cifi&eacute;, une erreur se produit.</p>
</dd>
<dt>R&eacute;pertoire de d&eacute;ploiement automatique</dt>
<dd>
<p>Identifie le r&eacute;pertoire &agrave; surveiller pour le d&eacute;ploiement automatique des applications. La valeur par d&eacute;faut est domain-dir<code>/autodeploy</code>.</p>
</dd>
<dt>Validation XML</dt>
<dd>
<p>Indique le type de validation XML &agrave; effectuer sur les descripteurs de d&eacute;ploiement standard et GlassFish Server. Il peut s'agir de l'un des types suivants :</p>
<dl>
<dt>Plein</dt>
<dd>
<p>En cas d'&eacute;chec de la validation XML, le d&eacute;ploiement &eacute;choue. Il s'agit de la valeur par d&eacute;faut.</p>
</dd>
<dt>Analyse</dt>
<dd>
<p>Les erreurs de validation XML sont signal&eacute;es, mais le d&eacute;ploiement a lieu.</p>
</dd>
<dt>Aucun</dt>
<dd>
<p>Aucune validation XML n'est effectu&eacute;e.</p>
</dd>
</dl>
</dd>
<dt>V&eacute;rificateur</dt>
<dd>
<p>Si cette option est activ&eacute;e, le v&eacute;rificateur est ex&eacute;cut&eacute; avant le d&eacute;ploiement automatique. En cas d'&eacute;chec de la v&eacute;rification, le d&eacute;ploiement n'a pas lieu. Le v&eacute;rificateur examine la structure et le contenu du fichier. La v&eacute;rification d'applications volumineuses est souvent une t&acirc;che qui demande du temps. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Pr&eacute;compiler</dt>
<dd>
<p>Si cette option est activ&eacute;e, les fichiers JSP (JavaServer Pages) sont pr&eacute;compil&eacute;s. Si cette option est d&eacute;sactiv&eacute;e, les fichiers JSP sont compil&eacute;s au moment de l'ex&eacute;cution, lors de leur premier acc&egrave;s. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</dd>
<dt>Autres propri&eacute;t&eacute;s</dt>
<dd>
<p>Propri&eacute;t&eacute;s suppl&eacute;mentaires pour les applications. GlassFish Server ne d&eacute;finit aucune propri&eacute;t&eacute; suppl&eacute;mentaire pour les applications.</p>
</dd>
</dl>
<a id="sthref221" name="sthref221"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-setadvanceappconfig.html">D&eacute;finition de la configuration des applications</a></p>
</li>
<li>
<p><a href="task-setadvancedomainattributes.html">D&eacute;finition des attributs de domaine</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
