<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-messagesecurityproviderconfigedit" name="ref-messagesecurityproviderconfigedit"></a><a id="GHCOM00124" name="GHCOM00124"></a></p>

<h4><a id="sthref421" name="sthref421"></a>Modifier la configuration du fournisseur</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Modifier la configuration du fournisseur permet de modifier la configuration d'un fournisseur de s&eacute;curit&eacute; des messages.</p>
<p>Elle contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Nom de configuration</dt>
<dd>
<p>Nom de la configuration &agrave; laquelle s'appliquent les param&egrave;tres de cette page. Ce champ est en lecture seule.</p>
</dd>
<dt>Couche d'authentification</dt>
<dd>
<p>Couche d'authentification (SOAP ou HttpServlet) pour laquelle cette configuration de fournisseur a &eacute;t&eacute; cr&eacute;&eacute;e. Ce champ est en lecture seule.</p>
</dd>
<dt>ID fournisseur</dt>
<dd>
<p>Nom de la configuration de fournisseur de s&eacute;curit&eacute; des messages. Ce champ est en lecture seule. Vous pouvez sp&eacute;cifier l'ID de fournisseur uniquement lors de la cr&eacute;ation d'une configuration de fournisseur de s&eacute;curit&eacute; des messages.</p>
</dd>
<dt>Fournisseur par d&eacute;faut</dt>
<dd>
<p>Si cette option est s&eacute;lectionn&eacute;e, ce fournisseur est le fournisseur par d&eacute;faut. Le fournisseur par d&eacute;faut est appel&eacute; lorsque l'application n'identifie aucun fournisseur sp&eacute;cifique. Le type de fournisseur d&eacute;termine si le fournisseur est le fournisseur c&ocirc;t&eacute; client par d&eacute;faut, le fournisseur c&ocirc;t&eacute; serveur par d&eacute;faut, ou les deux.</p>
</dd>
<dt>Type de fournisseur</dt>
<dd>
<p>Sp&eacute;cifie le type du fournisseur. Les choix disponibles sont les suivants :</p>
<dl>
<dt><code>client</code></dt>
<dd>
<p>Sp&eacute;cifie que le fournisseur est le fournisseur d'authentification c&ocirc;t&eacute; client.</p>
</dd>
<dt><code>server</code></dt>
<dd>
<p>Sp&eacute;cifie que le fournisseur est le fournisseur d'authentification c&ocirc;t&eacute; serveur.</p>
</dd>
<dt><code>client-server</code></dt>
<dd>
<p>Sp&eacute;cifie que le fournisseur est &agrave; la fois le fournisseur d'authentification c&ocirc;t&eacute; client et c&ocirc;t&eacute; serveur.</p>
</dd>
</dl>
</dd>
<dt>Nom de classe</dt>
<dd>
<p>Nom de la classe d'impl&eacute;mentation Java du fournisseur. Les fournisseurs d'authentification c&ocirc;t&eacute; client doivent impl&eacute;menter l'interface <code>com.sun.enterprise.security.jauth.ClientAuthModule</code>. Les fournisseurs c&ocirc;t&eacute; serveur doivent impl&eacute;menter l'interface <code>com.sun.enterprise.security.jauth.ServerAuthModule</code>. Les fournisseurs c&ocirc;t&eacute; client doivent impl&eacute;menter les deux interfaces.</p>
</dd>
<dt>Authentifier la source (pour la r&egrave;gle de demande)</dt>
<dd>
<p>Type d'authentification requise pour la r&egrave;gle de demande. La r&egrave;gle de demande d&eacute;termine le traitement des demandes par le fournisseur d'authentification. Les champs de r&egrave;gle de demande sont facultatifs ; n&eacute;anmoins, s'ils ne sont pas renseign&eacute;s, le fournisseur d'authentification n'authentifie pas les messages de demande.</p>
<p>S&eacute;lectionnez <code>sender</code> pour indiquer, au niveau de la couche Messages, l'authentification de l'exp&eacute;diteur (par exemple, nom utilisateur et mot de passe) des messages de demande. S&eacute;lectionnez <code>content</code> pour indiquer l'authentification du contenu (par exemple, signature num&eacute;rique) des messages de demande. Laissez le champ vide pour ne pas authentifier la source des demandes. Par d&eacute;faut, aucun type d'authentification n'est s&eacute;lectionn&eacute;.</p>
<p>Pour obtenir une description des actions effectu&eacute;es par les fournisseurs de s&eacute;curit&eacute; des messages SOAP, reportez-vous &agrave; <a href="ref-configreq-respolicy.html">Configurations de r&egrave;gle de demande et de r&eacute;ponse</a>.</p>
</dd>
<dt>Authentifier le destinataire (pour la r&egrave;gle de demande)</dt>
<dd>
<p>Sp&eacute;cifie si l'authentification du destinataire a lieu avant ou apr&egrave;s l'authentification du contenu pour la r&egrave;gle de demande.</p>
<p>S&eacute;lectionnez <code>before-content</code> ou <code>after-content</code> pour d&eacute;finir, au niveau de la couche Messages, l'authentification du destinataire du message de demande aupr&egrave;s de son exp&eacute;diteur (par cryptage XML). Si la valeur n'est pas indiqu&eacute;e, la valeur par d&eacute;faut est <code>after-content</code>. Les r&egrave;gles sont exprim&eacute;es dans l'ordre choisi par l'exp&eacute;diteur du message ; ainsi, <code>after-content</code> signifie que le destinataire d&eacute;crypte le message avant de valider la signature.</p>
</dd>
<dt>Authentifier la source (pour la r&egrave;gle de r&eacute;ponse)</dt>
<dd>
<p>Type d'authentification requise pour la r&egrave;gle de r&eacute;ponse. La r&egrave;gle de r&eacute;ponse d&eacute;termine le traitement des r&eacute;ponses par le fournisseur d'authentification. Les champs de r&egrave;gle de r&eacute;ponse sont facultatifs ; n&eacute;anmoins, s'ils ne sont pas renseign&eacute;s, aucune authentification n'est appliqu&eacute;e aux messages de r&eacute;ponse.</p>
<p>S&eacute;lectionnez <code>sender</code> pour indiquer, au niveau de la couche Messages, l'authentification de l'exp&eacute;diteur (par exemple, nom utilisateur et mot de passe) des messages de r&eacute;ponse. S&eacute;lectionnez <code>content</code> pour indiquer l'authentification du contenu (par exemple, signature num&eacute;rique) des messages de r&eacute;ponse. Laissez le champ vide pour ne pas authentifier les sources de r&eacute;ponse. Par d&eacute;faut, aucun type d'authentification n'est s&eacute;lectionn&eacute;.</p>
<p>Pour obtenir une description des actions effectu&eacute;es par les fournisseurs de s&eacute;curit&eacute; des messages SOAP, reportez-vous &agrave; <a href="ref-configreq-respolicy.html">Configurations de r&egrave;gle de demande et de r&eacute;ponse</a>.</p>
</dd>
<dt>Authentifier le destinataire (pour la r&egrave;gle de r&eacute;ponse)</dt>
<dd>
<p>Sp&eacute;cifie si l'authentification du destinataire a lieu avant ou apr&egrave;s l'authentification du contenu pour la r&egrave;gle de r&eacute;ponse.</p>
<p>S&eacute;lectionnez <code>before-content</code> ou <code>after-content</code> pour d&eacute;finir, au niveau de la couche Messages, l'authentification du destinataire du message de r&eacute;ponse aupr&egrave;s de son exp&eacute;diteur (par cryptage XML). Si la valeur n'est pas indiqu&eacute;e, la valeur par d&eacute;faut est <code>after-content</code>. Les r&egrave;gles sont exprim&eacute;es dans l'ordre choisi par l'exp&eacute;diteur du message ; ainsi, <code>after-content</code> signifie que le destinataire d&eacute;crypte le message avant de valider la signature.</p>
</dd>
<dt>Autres propri&eacute;t&eacute;s</dt>
<dd>
<p>Propri&eacute;t&eacute;s suppl&eacute;mentaires pour la configuration de fournisseur de s&eacute;curit&eacute; des messages. Pour obtenir une description des propri&eacute;t&eacute;s suppl&eacute;mentaires disponibles pour les configurations de fournisseur, reportez-vous &agrave; <a href="ref-messagesecurityproviderconfigprops.html">Propri&eacute;t&eacute;s propres aux configurations de fournisseur de s&eacute;curit&eacute; des messages</a>.</p>
</dd>
</dl>
<a id="sthref422" name="sthref422"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">Configuration des utilitaires GlassFish Server que les fournisseurs de s&eacute;curit&eacute; des messages doivent utiliser</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">Cr&eacute;ation d'une configuration de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">Modification d'une configuration de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">Suppression d'une configuration de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">Cr&eacute;ation d'une configuration de fournisseur de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">Modification d'une configuration de fournisseur de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">Suppression d'une configuration de fournisseur de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">Activation de la s&eacute;curit&eacute; des messages pour les clients d'application</a></p>
</li>
</ul>
<a id="sthref423" name="sthref423"></a>
<h5>Commandes asadmin connexes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00045"><code>create-message-security-provider</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00184"><code>list-message-security-providers</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00097"><code>delete-message-security-provider</code>(1)</a></p>
</li>
</ul>
<p>En outre, utilisez la commande <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00226"><code>set</code>(1)</a> pour modifier les r&egrave;gles de demande et de r&eacute;ponse.</p>
<p>Pour d&eacute;finir la r&egrave;gle de r&eacute;ponse, remplacez <code>request</code> par <code>response</code> dans les commandes ci-apr&egrave;s.</p>
<ul>
<li>
<p>Ajoutez une r&egrave;gle de demande au client et d&eacute;finissez la source d'authentification :</p>
<pre>
asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
provider-config.ClientProvider.request-policy.auth_source=
sender | content
</pre></li>
<li>
<p>Ajoutez une r&egrave;gle de demande au serveur et d&eacute;finissez la source d'authentification :</p>
<pre>
asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
provider-config.ServerProvider.request-policy.auth_source=
sender | content
</pre></li>
<li>
<p>Ajoutez une r&egrave;gle de demande au client et d&eacute;finissez le destinataire de l'authentification :</p>
<pre>
asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
provider-config.ClientProvider.request-policy.auth_recipient=
before-content | after-content
</pre></li>
<li>
<p>Ajoutez une r&egrave;gle de demande au serveur et d&eacute;finissez le destinataire de l'authentification :</p>
<pre>
asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
provider-config.ServerProvider.request-policy.auth_recipient=
before-content | after-content
</pre></li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
