<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-editjdbcrealm" name="ref-editjdbcrealm"></a></p>

<h4><a id="sthref205" name="sthref205"></a><a id="sthref206" name="sthref206"></a>Propri&eacute;t&eacute;s propres &agrave; la classe <code>JDBCRealm</code></h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Pour prot&eacute;ger vos pages ou applications Web, vous pouvez d&eacute;finir la s&eacute;curit&eacute; de fa&ccedil;on &agrave; n'autoriser l'acc&egrave;s qu'aux utilisateurs inscrits. Il s'agit de l'utilitaire d'authentification. Ce type de domaine implique de stocker les informations d'identification et de connexion des utilisateurs dans une base de donn&eacute;es. GlassFish Server utilise les informations de la base de donn&eacute;es et l'option de domaine JDBC activ&eacute;e dans le fichier de configuration.</p>
<p>Les propri&eacute;t&eacute;s suivantes sont obligatoires pour un domaine JDBC.</p>
<dl>
<dt>Contexte de JAAS</dt>
<dd>
<p>Contexte JAAS (Java Authentication and Authorization Service) identifiant le module de connexion &agrave; utiliser pour ce domaine. La seule valeur valide est <code>jdbcRealm</code>.</p>
</dd>
<dt>JNDI</dt>
<dd>
<p>Nom JNDI de ce domaine. La valeur par d&eacute;faut est <code>jdbc/security</code>.</p>
</dd>
<dt>Table des utilisateurs</dt>
<dd>
<p>Table contenant la liste des utilisateurs autoris&eacute;s pour ce domaine. La valeur par d&eacute;faut est <code>usertable</code>.</p>
</dd>
<dt>Colonne de noms utilisateur</dt>
<dd>
<p>Nom de la colonne contenant la liste des utilisateurs dans la table d'utilisateurs. La valeur par d&eacute;faut est <code>userid</code>.</p>
</dd>
<dt>Colonne de mots de passe</dt>
<dd>
<p>Nom de la colonne contenant le mot de passe de l'utilisateur correspondant dans la table d'utilisateurs. La valeur par d&eacute;faut est <code>password</code>.</p>
</dd>
<dt>Table de groupes</dt>
<dd>
<p>Nom de la table des groupes dans la base de donn&eacute;es. La valeur par d&eacute;faut est <code>grouptable</code>.</p>
</dd>
<dt>Colonne de noms de groupes</dt>
<dd>
<p>Nom de la colonne de noms de groupe dans la table des groupes de la base de donn&eacute;es. La valeur par d&eacute;faut est <code>groupid</code>.</p>
</dd>
</dl>
<p>Les propri&eacute;t&eacute;s facultatives suivantes sont disponibles pour un domaine JDBC.</p>
<dl>
<dt>Affecter des groupes</dt>
<dd>
<p>Liste de noms de groupe s&eacute;par&eacute;s par une virgule. Tous les clients pr&eacute;sentant un certificat valide sont affect&eacute;s &agrave; ces groupes, comme par exemple <code>employee,manager</code> qui sont des noms de groupes d'utilisateurs.</p>
</dd>
<dt>Utilisateur de la base de donn&eacute;es</dt>
<dd>
<p>Permet de sp&eacute;cifier le nom utilisateur de base de donn&eacute;es dans le domaine plut&ocirc;t que <code>jdbc-connection-pool</code>. Cela emp&ecirc;che d'autres applications de faire des recherches dans la base de donn&eacute;es, d'obtenir une connexion et de parcourir la table des utilisateurs. Par d&eacute;faut, la configuration <code>jdbc-connection-pool</code> est utilis&eacute;e.</p>
</dd>
<dt>Mot de passe de base de donn&eacute;es</dt>
<dd>
<p>Permet de sp&eacute;cifier le mot de passe de base de donn&eacute;es dans le domaine plut&ocirc;t que <code>jdbc-connection-pool</code>. Cela emp&ecirc;che d'autres applications de faire des recherches dans la base de donn&eacute;es, d'obtenir une connexion et de parcourir la table des utilisateurs. Par d&eacute;faut, la configuration <code>jdbc-connection-pool</code> est utilis&eacute;e.</p>
</dd>
<dt>Algorithme condens&eacute;</dt>
<dd>
<p>(Facultatif) Sp&eacute;cifie l'algorithme condens&eacute;. La valeur par d&eacute;faut est <code>SHA-256</code>. Vous pouvez utiliser tout algorithme pris en charge dans le JDK ou n'en utiliser aucun.</p>

<hr>
<p><b>Remarque:</b></p>
Dans les versions de GlassFish Server ant&eacute;rieures &agrave; 4.0, l'algorithme par d&eacute;faut &eacute;tait <code>MD5</code>. Si vous disposez d'applications d&eacute;pendant de l'algorithme <code>MD5</code>, vous pouvez remplacer l'algorithme par d&eacute;faut <code>SHA-25</code> &agrave; l'aide de la sous-commande <code>asadmin set</code> :
<pre>
asadmin&gt; <b>set server.security-service.property.default-digest-algorithm=MD5</b>
</pre>
<p>Vous pouvez utiliser la sous-commande <code>asadmin get</code> pour d&eacute;terminer l'algorithme en cours d'utilisation :</p>
<pre>
asadmin&gt; <b>get server.security-service.property.default-digest-algorithm</b>
</pre>
<p>Par ailleurs, pour des raisons de compatibilit&eacute; amont, si une mise &agrave; niveau est effectu&eacute;e de GlassFish Server v2.<i>x</i> ou 3.0.<i>x</i> vers GlassFish Server 4.0, l'algorithme par d&eacute;faut est automatiquement d&eacute;fini sur <code>MD5</code> au cas o&ugrave; l'algorithme condens&eacute; n'avait pas &eacute;t&eacute; explicitement d&eacute;fini dans l'ancienne version de GlassFish Server.</p>

<hr>

</dd>
<dt>Algorithme de cryptage du mot de passe</dt>
<dd>
<p>Algorithme de cryptage de mots de passe stock&eacute;s dans la base de donn&eacute;es.</p>

<hr>
<p><b>Remarque:</b></p>
Ne pas indiquer l'algorithme de cryptage des mots de passe constitue un risque en mati&egrave;re de s&eacute;curit&eacute;.
<hr>

</dd>
<dt>Codage</dt>
<dd>
<p>Codage. Les valeurs autoris&eacute;es sont <code>Hex</code> et <code>Base64</code>. Si <code>digest-algorithm</code> est sp&eacute;cifi&eacute;, la valeur par d&eacute;faut est <code>Hex</code>. Si <code>digest-algorithm</code> n'est pas sp&eacute;cifi&eacute;, aucun codage n'est indiqu&eacute; par d&eacute;faut.</p>
</dd>
<dt>Jeu de caract&egrave;res</dt>
<dd>
<p>Jeu de caract&egrave;res pour l'algorithme condens&eacute;.</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
