<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jaccprovidernew" name="task-jaccprovidernew"></a></p>
<a name="BEGIN" id="BEGIN"></a>



<p>L'installation par d&eacute;faut de GlassFish Server comprend deux fournisseurs JACC, nomm&eacute;s <code>default</code> et <code>simple</code>. Tous les fournisseurs JACC que vous cr&eacute;ez s'ajoutent &agrave; ces deux fournisseurs par d&eacute;faut. Les fournisseurs JACC GlassFish Server par d&eacute;faut impl&eacute;mentent un moteur d'autorisation simple, bas&eacute; sur des fichiers et conforme &agrave; la sp&eacute;cification JACC.</p>
<p>Pour plus d'informations sur l'&eacute;criture de classes d'impl&eacute;mentation pour un fournisseur JACC, reportez-vous &agrave; la sp&eacute;cification JACC sur <code><a href="http://jcp.org/en/jsr/detail?id=115">http://jcp.org/en/jsr/detail?id=115</a></code>.</p>
<ol>
<li>
<p>Sous le noeud Configurations dans l'arborescence de navigation, d&eacute;veloppez le cluster ou l'instance GlassFish Server pour lequel vous souhaitez cr&eacute;er un fournisseur JACC.</p>
<p>Pour cr&eacute;er un fournisseur qui sera disponible pour l'ensemble des instances et clusters, choisissez le noeud <code>default-config</code>.</p>
</li>
<li>
<p>Sous le noeud d&eacute;velopp&eacute; de configuration du cluster ou de l'instance, d&eacute;veloppez le noeud S&eacute;curit&eacute;.</p>
</li>
<li>
<p>Sous le noeud S&eacute;curit&eacute;, s&eacute;lectionnez le noeud Fournisseurs JACC.</p>
<p>La page Fournisseurs JACC appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Fournisseurs JACC, cliquez sur Nouveau.</p>
<p>La page Nouveau fournisseur JACC appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Nouveau fournisseur JACC, dans le champ Nom, saisissez le nom qui identifiera ce fournisseur.</p>
<p>Ce nom est utilis&eacute; pour r&eacute;f&eacute;rencer l'&eacute;l&eacute;ment <code>jacc-provider</code> dans <code>domain.xml</code>.</p>
</li>
<li>
<p>Dans le champ Configuration de r&egrave;gles, saisissez le nom de la classe qui impl&eacute;mente la fabrique de configuration de r&egrave;gles.</p>
<p>Le fournisseur <code>default</code> utilise <code>com.sun.enterprise.security.provider.PolicyConfigurationFactoryImpl</code>. Le fournisseur <code>simple</code> utilise <code>com.sun.enterprise.security.jacc.provider.SimplePolicyConfigurationFactory</code>.</p>
</li>
<li>
<p>Dans le champ Fournisseur de r&egrave;gles, saisissez le nom de la classe qui impl&eacute;mente la fabrique de r&egrave;gles.</p>
<p>Le fournisseur <code>default</code> utilise <code>com.sun.enterprise.security.provider.PolicyWrapper</code>. Le fournisseur <code>simple</code> utilise <code>com.sun.enterprise.security.jacc.provider.SimplePolicyProvider</code>.</p>
</li>
<li>
<p>Dans la section Autres propri&eacute;t&eacute;s, sp&eacute;cifiez les propri&eacute;t&eacute;s suppl&eacute;mentaires.</p>
<p>Pour ajouter une propri&eacute;t&eacute;, cliquez sur le bouton Ajouter une propri&eacute;t&eacute;. Sur la ligne vide qui appara&icirc;t, saisissez le nom de la propri&eacute;t&eacute; dans le champ Nom et la valeur de la propri&eacute;t&eacute; dans le champ Valeur.</p>
<p>Pour obtenir une description des propri&eacute;t&eacute;s suppl&eacute;mentaires disponibles pour les fournisseurs JACC, reportez-vous &agrave; <a href="ref-jaccproviderprop.html">Propri&eacute;t&eacute;s propres aux fournisseurs JACC</a>.</p>
</li>
<li>
<p>Cliquez sur OK.</p>
</li>
</ol>
<p><a id="sthref166" name="sthref166"></a></p>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-jaccprovideredit.html">Modification d'un fournisseur JACC</a></p>
</li>
<li>
<p><a href="task-jaccproviderdelete.html">Suppression d'un fournisseur JACC</a></p>
</li>
</ul>
<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
