<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-messagesecurityproviderconfigdelete" name="task-messagesecurityproviderconfigdelete"></a></p>

<h4><a id="sthref108" name="sthref108"></a>Suppression d'une configuration de fournisseur de s&eacute;curit&eacute; des messages</h4>
<a name="BEGIN" id="BEGIN"></a><a id="GHCOM316" name="GHCOM316"></a>
<h5>Avant de commencer</h5>
<p>Il n'est pas possible de cr&eacute;er ou de supprimer les fournisseurs de s&eacute;curit&eacute; des messages pour la configuration par d&eacute;faut <code>server-config</code>. Les seuls fournisseurs de s&eacute;curit&eacute; des messages pris en charge pour la configuration par d&eacute;faut <code>server-config</code> sont SOAP et HttpServlet. Comme ces deux fournisseurs de messages sont d&eacute;j&agrave; cr&eacute;&eacute;s par d&eacute;faut lors de l'installation de GlassFish Server, le bouton Supprimer ne figure pas sur la page Configurations de la s&eacute;curit&eacute; des messages pour la configuration par d&eacute;faut <code>server-config</code>.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Configuration.</p>
</li>
<li>
<p>D&eacute;veloppez le noeud S&eacute;curit&eacute;.</p>
</li>
<li>
<p>S&eacute;lectionnez le noeud S&eacute;curit&eacute; des messages.</p>
<p>La page Configurations de la s&eacute;curit&eacute; des messages appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Configurations de la s&eacute;curit&eacute; des messages, s&eacute;lectionnez SOAP.</p>
<p>La page Modifier la configuration de la s&eacute;curit&eacute; des messages appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Modifier la configuration de la s&eacute;curit&eacute; des messages, cliquez sur l'onglet Fournisseurs.</p>
<p>La page Modifier la configuration du fournisseur appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Modifier la configuration du fournisseur, cochez la case situ&eacute;e sur la gauche de la configuration de fournisseur &agrave; supprimer.</p>
</li>
<li>
<p>Cliquez sur Supprimer.</p>
</li>
</ol>
<a id="GHCOM317" name="GHCOM317"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">Configuration des utilitaires GlassFish Server que les fournisseurs de s&eacute;curit&eacute; des messages doivent utiliser</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">Cr&eacute;ation d'une configuration de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">Modification d'une configuration de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">Suppression d'une configuration de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">Cr&eacute;ation d'une configuration de fournisseur de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">Modification d'une configuration de fournisseur de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">Activation de la s&eacute;curit&eacute; des messages pour les clients d'application</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
