<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-eelogging" name="task-eelogging"></a><a id="GHCOM00177" name="GHCOM00177"></a></p>

<h4><a id="sthref117" name="sthref117"></a>Configuration de param&egrave;tres de journalisation g&eacute;n&eacute;raux</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Configurations.</p>
</li>
<li>
<p>Sous le noeud Configurations, cliquez sur la configuration d'instance de serveur ou de cluster pour laquelle vous souhaitez d&eacute;finir les param&egrave;tres du journaliseur.</p>
<p>La page Configuration appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Configuration, cliquez sur Param&egrave;tres du journaliseur.</p>
<p>La page Param&egrave;tres du journaliseur de la cible de configuration s&eacute;lectionn&eacute;e appara&icirc;t.</p>
</li>
<li>
<p>Cochez la case Ecriture dans le journal syst&egrave;me activ&eacute;e pour envoyer la sortie de journalisation &agrave; l'utilitaire <code>syslog</code> en plus du journal du serveur.</p>
<p>Cette fonctionnalit&eacute; est disponible sur les syst&egrave;mes Solaris et Linux uniquement. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Cochez la case Journalisation dans la console activ&eacute;e pour envoyer la sortie de journalisation &agrave; la console syst&egrave;me.</p>
</li>
<li>
<p>Cochez la case Modification de la date de rotation activ&eacute;e pour changer de fichier journal du serveur chaque jour &agrave; minuit.</p>
</li>
<li>
<p>Cochez la case Mode multiligne activ&eacute; pour mettre en forme les messages de journalisation afin d'en faciliter la lecture. Le corps des messages de journalisation est mis en retrait et commence sur une nouvelle ligne.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Format de journalisation de console, s&eacute;lectionnez le format de journalisation dans la console. L'option par d&eacute;faut est ODL (Oracle Diagnostics Logging). L'autre option est ULF (UniformLogFormatter).</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Format de journalisation LogFile, s&eacute;lectionnez le format de journalisation dans le fichier journal du serveur. L'option par d&eacute;faut est ODL.</p>
</li>
<li>
<p>Dans le champ Limite de rotation des fichiers, saisissez la taille en octets que le fichier journal du serveur doit atteindre avant d'&ecirc;tre d&eacute;plac&eacute;.</p>
<p>Lorsque le journal du serveur atteint la taille indiqu&eacute;e, GlassFish Server cr&eacute;e un fichier vide nomm&eacute; <code>server.log</code> et renomme l'ancien fichier <code>server.log_</code><i>date</i>, o&ugrave; <i>date</i> indique la date et l'heure auxquelles le fichier est d&eacute;plac&eacute;. La valeur par d&eacute;faut est 2 Mo. La valeur minimale est 500 ko. Si vous sp&eacute;cifiez une valeur inf&eacute;rieure, le fichier est d&eacute;plac&eacute; lorsqu'il atteint 500 ko. Pour d&eacute;sactiver la rotation du fichier journal, sp&eacute;cifiez la valeur 0.</p>
</li>
<li>
<p>Dans le champ Temps limite de rotation des fichiers, saisissez le nombre de minutes au bout duquel le journal du serveur doit &ecirc;tre d&eacute;plac&eacute;.</p>
<p>La valeur par d&eacute;faut est 0 ; cela signifie que le fichier est d&eacute;plac&eacute; lorsqu'il atteint la taille sp&eacute;cifi&eacute;e dans le champ Limite de rotation des fichiers.</p>

<hr>
<p><b>Remarque:</b></p>
Si vous sp&eacute;cifiez une ou plusieurs minutes, le temps limite remplace la taille limite indiqu&eacute;e par le champ Limite de rotation des fichiers.
<hr>

</li>
<li>
<p>Dans le champ Fr&eacute;quence de vidage, saisissez le nombre maximal de messages &agrave; &eacute;crire simultan&eacute;ment de la file d'attente vers le journal du serveur.</p>
<p>La valeur par d&eacute;faut est 1.</p>
</li>
<li>
<p>Dans le champ Nombre maximal de fichiers d'historique, saisissez le nombre maximal de fichiers journaux que GlassFish Server doit conserver avant de supprimer le fichier le plus ancien. Si vous d&eacute;finissez cette valeur sur z&eacute;ro (0), GlassFish Server ne supprime pas les anciens fichiers journaux.</p>
</li>
<li>
<p>Dans le champ Fichier journal, saisissez un autre nom ou emplacement pour le fichier journal du serveur.</p>
<p>L'emplacement par d&eacute;faut est <code>${com.sun.aas.instanceRoot}/logs/server.log</code>.</p>
</li>
<li>
<p>Dans le champ Gestionnaire du journal, saisissez le nom de classe absolu d'un gestionnaire de journal personnalis&eacute;.</p>
<p>Un gestionnaire de journal personnalis&eacute; permet d'envoyer des journaux vers une destination autre que <code>server.log</code> ou <code>syslog</code>. Celui-ci doit &eacute;tendre la classe <code>java.util.logging.ConsoleHandler</code> (API compatible JSR 047). Ajoutez la classe du gestionnaire au classpath de GlassFish Server de fa&ccedil;on &agrave; installer le gestionnaire au d&eacute;marrage du serveur.</p>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>

<hr>
<p><b>Remarque:</b></p>
Selon la configuration pour laquelle la journalisation est activ&eacute;e, vous devrez peut-&ecirc;tre red&eacute;marrer le serveur.
<p>Un red&eacute;marrage du serveur peut &eacute;galement &ecirc;tre requis si le nom du fichier journal est modifi&eacute; par rapport &agrave; la valeur par d&eacute;faut. Un message <code>Red&eacute;marrage requis</code> appara&icirc;t dans l'angle sup&eacute;rieur droit de la Console d'administration s'il est n&eacute;cessaire de red&eacute;marrer le serveur.</p>

<hr>

</li>
</ol>
<a id="sthref118" name="sthref118"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-eelogginglevels.html">Configuration de niveaux de journalisation</a></p>
</li>
<li>
<p><a href="task-logging-max-logfiles.html">Modification du nombre limite de fichiers journaux d&eacute;plac&eacute;s</a></p>
</li>
<li>
<p><a href="task-logviewer.html">Affichage de fichiers journaux pour le serveur DAS</a></p>
</li>
<li>
<p><a href="task-collectdomainlogs.html">Collecte et t&eacute;l&eacute;chargement de journaux de domaine</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
