<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-appdeployejb" name="task-appdeployejb"></a><a id="GHCOM00160" name="GHCOM00160"></a></p>

<h4><a id="sthref67" name="sthref67"></a><a id="sthref68" name="sthref68"></a><a id="sthref69" name="sthref69"></a>D&eacute;ploiement d'un fichier JAR EJB</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, s&eacute;lectionnez le noeud Applications.</p>
<p>La page Applications appara&icirc;t.</p>
</li>
<li>
<p>Dans la table Applications d&eacute;ploy&eacute;es, cliquez sur le bouton D&eacute;ployer.</p>
<p>La page D&eacute;ployer des applications ou des modules appara&icirc;t.</p>
</li>
<li>
<p>Sp&eacute;cifiez l'emplacement de l'application &agrave; d&eacute;ployer.</p>
<ul>
<li>
<p>Si l'application est un fichier d'archive stock&eacute; sur l'ordinateur client ou accessible &agrave; partir de ce dernier, s&eacute;lectionnez l'option Fichier packag&eacute; &agrave; t&eacute;l&eacute;charger sur le serveur.</p>
<p>L'ordinateur client est l'h&ocirc;te sur lequel vous visualisez la Console d'administration via un navigateur.</p>
<p>Cliquez sur Parcourir pour acc&eacute;der au fichier ou saisissez le chemin d'acc&egrave;s complet.</p>
</li>
<li>
<p>Si l'application est un fichier d'archive stock&eacute; sur l'ordinateur serveur ou une application non packag&eacute;e situ&eacute;e dans un r&eacute;pertoire &eacute;clat&eacute;, s&eacute;lectionnez l'option R&eacute;pertoire ou fichier packag&eacute; local accessible &agrave; partir de GlassFish Server.</p>
<p>L'ordinateur serveur est l'h&ocirc;te qui ex&eacute;cute le serveur d'administration de domaine (DAS).</p>
<p>Cliquez sur Parcourir les fichiers pour acc&eacute;der &agrave; un fichier ou sur Parcourir les dossiers pour acc&eacute;der &agrave; un r&eacute;pertoire. Vous pouvez &eacute;galement saisir le chemin d'acc&egrave;s complet au fichier ou au r&eacute;pertoire. Le d&eacute;ploiement &agrave; partir d'un r&eacute;pertoire &eacute;clat&eacute; est r&eacute;serv&eacute; aux d&eacute;veloppeurs exp&eacute;riment&eacute;s et est d&eacute;conseill&eacute; dans les environnements de production.</p>
</li>
</ul>
</li>
<li>
<p>Dans la liste d&eacute;roulante Type, s&eacute;lectionnez JAR EJB.</p>
<p>Si vous avez sp&eacute;cifi&eacute; un fichier packag&eacute; &agrave; t&eacute;l&eacute;charger sur le serveur ou un fichier local packag&eacute; accessible &agrave; partir de GlassFish Server, le type d'application est d&eacute;tect&eacute; automatiquement. Si vous avez sp&eacute;cifi&eacute; un r&eacute;pertoire accessible &agrave; partir de GlassFish Server, vous devez sp&eacute;cifier le type manuellement.</p>
</li>
<li>
<p>Dans le champ Nom de l'application, conservez le nom par d&eacute;faut, qui correspond au nom du r&eacute;pertoire ou au pr&eacute;fixe du nom de fichier, ou saisissez un autre nom.</p>
<p>Le nom par d&eacute;faut appara&icirc;t si vous d&eacute;cidez de t&eacute;l&eacute;charger un fichier. Le nom de l'application doit &ecirc;tre unique.</p>
<p>Le nom peut &ecirc;tre suivi d'un identificateur de version facultatif dont il est s&eacute;par&eacute; par un signe deux-points (<code>:</code>). L'identificateur de version doit commencer par une lettre ou un chiffre. Il peut contenir des caract&egrave;res alphanum&eacute;riques, des traits de soulignement (<code>_</code>), des tirets (<code>-</code>) et des points (<code>.</code>). Pour plus d'informations sur les versions des modules et des applications, reportez-vous &agrave; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> dans le manuel <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</li>
<li>
<p>Cochez la case Statut activ&eacute; pour activer l'application.</p>
<p>Cette option est s&eacute;lectionn&eacute;e par d&eacute;faut. Si cette option est d&eacute;sactiv&eacute;e, l'application est indisponible.</p>
</li>
<li>
<p>Cochez la case Disponibilit&eacute; activ&eacute;e afin d'activer la r&eacute;alisation de points de reprise SFSB pour l'application.</p>
<p>Si la case Activ&eacute; est coch&eacute;e, la haute disponibilit&eacute; est activ&eacute;e pour la r&eacute;alisation de points de reprise et &eacute;ventuellement la passivation des beans Session avec conservation de statut (SFSB). Si la valeur est False (valeur par d&eacute;faut), la r&eacute;alisation de tous les points de reprise SFSB est d&eacute;sactiv&eacute;e pour le module EJB sp&eacute;cifi&eacute;. Si cette valeur est True, le module EJB sp&eacute;cifi&eacute; est activ&eacute; pour la haute disponibilit&eacute;. D&eacute;finissez cette option sur True seulement si la haute disponibilit&eacute; est configur&eacute;e et activ&eacute;e &agrave; des niveaux sup&eacute;rieurs, tels que les niveaux serveur et conteneur.</p>
<p>Cette option appara&icirc;t si des clusters ou des instances de serveur autonomes existent en plus de l'instance de serveur par d&eacute;faut (<code>server</code>).</p>
</li>
<li>
<p>Cochez la case Ex&eacute;cuter le v&eacute;rificateur pour v&eacute;rifier les descripteurs de d&eacute;ploiement avant le d&eacute;ploiement.</p>
<p>Si cette option est s&eacute;lectionn&eacute;e et que la v&eacute;rification &eacute;choue, le d&eacute;ploiement n'a pas lieu. Le v&eacute;rificateur examine la structure et le contenu des descripteurs de d&eacute;ploiement. La v&eacute;rification d'applications volumineuses est souvent une t&acirc;che qui demande du temps. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
<p>Les packages du v&eacute;rificateur doivent &ecirc;tre install&eacute;s &agrave; partir de l'outil de mise &agrave; jour ; sinon, un avertissement est consign&eacute; et cette option est ignor&eacute;e.</p>
</li>
<li>
<p>Cochez la case Compatibilit&eacute; afin d'utiliser les exigences de visibilit&eacute; JAR de GlassFish Server version 2 pour les applications au lieu des exigences Java EE&amp; 6 plus strictes impl&eacute;ment&eacute;es dans les versions ult&eacute;rieures de GlassFish Server, y compris 4.0.</p>
<p>Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
<p>La sp&eacute;cification de la plate-forme Java EE 6 impose des exigences plus strictes que Java EE 5 quant aux fichiers JAR visibles dans divers modules au sein d'un fichier EAR. Plus particuli&egrave;rement, les clients d'application ne doivent pas avoir acc&egrave;s aux fichiers JAR EJB ou &agrave; d'autres fichiers JAR dans le fichier EAR, sauf si les r&eacute;f&eacute;rences utilisent les m&eacute;canismes Java SE standard (les extensions, par exemple) ou le m&eacute;canisme library-directory de Java EE. La s&eacute;lection de cette case enl&egrave;ve ces restrictions Java EE 6.</p>
</li>
<li>
<p>Cochez la case Forcer le red&eacute;ploiement pour forcer le red&eacute;ploiement si l'application a d&eacute;j&agrave; &eacute;t&eacute; d&eacute;ploy&eacute;e.</p>
<p>Si cette option n'est pas s&eacute;lectionn&eacute;e, toute tentative de d&eacute;ploiement d'une application d&eacute;j&agrave; d&eacute;ploy&eacute;e g&eacute;n&egrave;re une erreur. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>S&eacute;lectionnez la case Conserver l'&eacute;tat pour conserver les sessions Web, les instances SFSB et les horloges EJB cr&eacute;&eacute;es de fa&ccedil;on persistante entre les red&eacute;ploiements.</p>
<p>Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut. Elle n'est prise en charge que sur l'instance de serveur par d&eacute;faut, nomm&eacute;e <code>server</code>. Elle n'est pas prise en charge et est ignor&eacute;e pour toute autre cible.</p>
<p>Certaines modifications apport&eacute;es &agrave; une application entre des red&eacute;ploiements emp&ecirc;chent cette option de fonctionner correctement. Par exemple, ne modifiez pas l'ensemble des variables d'instance dans la classe de bean SFSB.</p>
<p>Pour les applications Web, cette fonctionnalit&eacute; n'est applicable que si, dans le fichier <code>glassfish-web-app.xml</code>, l'attribut <code>persistence-type</code> de l'&eacute;l&eacute;ment <code>session-manager</code> est <code>file</code>.</p>
<p>Pour les instances SFSB, le type de persistance sans haute disponibilit&eacute; est d&eacute;fini dans le serveur (option Type de persistance SFSB) et doit avoir la valeur <code>file</code>, qui est la valeur par d&eacute;faut recommand&eacute;e.</p>
<p>En cas d'&eacute;chec de la conservation ou de la restauration d'une session Web, d'une instance SFSB ou d'une horloge EJB active, <i>aucune</i> d'entre elles ne sera disponible une fois le red&eacute;ploiement termin&eacute;. Toutefois, le red&eacute;ploiement se poursuit et un avertissement est consign&eacute;.</p>
<p>Pour conserver les donn&eacute;es d'&eacute;tat actives, GlassFish Server s&eacute;rialise les donn&eacute;es et les enregistre dans la m&eacute;moire. Pour restaurer les donn&eacute;es, le chargeur de classe de l'application qui vient d'&ecirc;tre red&eacute;ploy&eacute;e d&eacute;s&eacute;rialise les donn&eacute;es pr&eacute;c&eacute;demment enregistr&eacute;es.</p>
</li>
<li>
<p>Cochez la case Conserver les ressources de niveau application pour conserver des ressources de niveau application et les restaurer pendant le red&eacute;ploiement.</p>
<p>Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Dans le champ Ordre de d&eacute;ploiement, saisissez un nombre pour indiquer l'ordre de d&eacute;ploiement de l'application.</p>
<p>Les applications ayant le num&eacute;ro le plus faible sont charg&eacute;es en premier au d&eacute;marrage du serveur. Une application ayant un ordre de d&eacute;ploiement de 102 est charg&eacute;e avant une application ayant un ordre de d&eacute;ploiement de 110. Si l'ordre de d&eacute;ploiement n'est pas indiqu&eacute; au moment o&ugrave; une application est d&eacute;ploy&eacute;e, l'ordre de d&eacute;ploiement par d&eacute;faut de 100 est affect&eacute;. Si deux applications ont le m&ecirc;me ordre de d&eacute;ploiement, l'application qui a &eacute;t&eacute; d&eacute;ploy&eacute;e en premier est charg&eacute;e en premier. La sp&eacute;cification d'un ordre de d&eacute;ploiement s'av&egrave;re utile si l'application a des d&eacute;pendances et doit &ecirc;tre charg&eacute;e dans un certain ordre.</p>
</li>
<li>
<p>Dans le champ Biblioth&egrave;ques, indiquez sous forme de liste s&eacute;par&eacute;e par des virgules les fichiers JAR de biblioth&egrave;que propres &agrave; cette application.</p>
<p>Les chemins peuvent &ecirc;tre absolus ou relatifs. Un chemin relatif est relatif &agrave; domain-dir<code>/lib/applibs</code>. Si le chemin est absolu, le serveur d'administration de domaine (DAS) doit pouvoir y acc&eacute;der, ce qui signifie qu'il doit se trouver sous domain-dir. Les biblioth&egrave;ques sont mises &agrave; la disposition de l'application selon l'ordre dans lequel elles sont sp&eacute;cifi&eacute;es.</p>
</li>
<li>
<p>Dans le champ Description, entrez une br&egrave;ve description de cette application.</p>
</li>
<li>
<p>Pour ajouter des clusters et des instances de serveur cible sur lesquels d&eacute;ployer le module ou l'application, s&eacute;lectionnez-les dans la liste Cibles disponibles et utilisez le bouton Ajouter pour les d&eacute;placer vers la liste Cibles s&eacute;lectionn&eacute;es.</p>
<p>L'option Cible appara&icirc;t si des clusters ou des instances de serveur autonomes existent en plus de l'instance de serveur par d&eacute;faut (<code>server</code>). Par d&eacute;faut, le module ou l'application est d&eacute;ploy&eacute; sur l'instance de serveur par d&eacute;faut nomm&eacute;e <code>server</code>. Utilisez le bouton Tout ajouter pour le/la d&eacute;ployer vers toutes les cibles. Utilisez les boutons Enlever et Tout enlever pour enlever des cibles de la liste Cibles s&eacute;lectionn&eacute;es.</p>
</li>
<li>
<p>Cliquez sur OK.</p>
</li>
</ol>
<a id="sthref70" name="sthref70"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-applistdeployed.html">Affichage de la liste des applications d&eacute;ploy&eacute;es</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">D&eacute;ploiement d'une application Web</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">D&eacute;ploiement d'une application d'entreprise</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">D&eacute;ploiement d'un client d'application</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">D&eacute;ploiement d'un module connecteur</a></p>
</li>
<li>
<p><a href="task-appedit.html">Modification d'une application d&eacute;ploy&eacute;e</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">Affichage des descripteurs d'une application</a></p>
</li>
<li>
<p><a href="task-endpoint.html">Affichage des informations d'adresse pour un service Web</a></p>
</li>
<li>
<p><a href="task-applaunch.html">Lancement d'une application</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">Lancement d'un client d'application</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">T&eacute;l&eacute;chargement de stubs client d'application</a></p>
</li>
<li>
<p><a href="task-appredeploy.html">Red&eacute;ploiement d'une application d&eacute;ploy&eacute;e</a></p>
</li>
<li>
<p><a href="task-apprestart.html">Rechargement d'une application d&eacute;ploy&eacute;e</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">Affichage de ressources de niveau application</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">Modification de ressources de niveau application</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
