<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-endpoint" name="task-endpoint"></a></p>

<h4><a id="sthref51" name="sthref51"></a><a id="sthref52" name="sthref52"></a><a id="sthref53" name="sthref53"></a>Affichage des informations d'adresse pour un service Web</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, s&eacute;lectionnez le noeud Applications.</p>
<p>La page Applications appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Applications, cliquez sur le nom du service Web dont vous affichez les informations d'adresse.</p>
<p>Le nom peut &ecirc;tre suivi d'un identificateur de version facultatif dont il est s&eacute;par&eacute; par un signe deux-points (<code>:</code>). Pour plus d'informations sur les versions des modules et des applications, reportez-vous &agrave; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> dans le manuel <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
<p>La page Modifier une application appara&icirc;t.</p>
</li>
<li>
<p>Dans la table Modules et composants, cliquez sur le lien Afficher l'adresse du sous-composant.</p>
<p>La page Informations relatives &agrave; une adresse de service Web appara&icirc;t.</p>
</li>
<li>
<p>Si le lien Testeur est visible, cliquez dessus pour afficher une page qui permet d'indiquer des param&egrave;tres visant &agrave; tester les m&eacute;thodes du service Web.</p>
<p>Le lien Testeur appara&icirc;t uniquement si le type de d&eacute;ploiement de l'application n'est pas RI (par exemple, s'il s'agit de 109). La page Testeur appara&icirc;t dans un nouvel onglet ou une nouvelle fen&ecirc;tre du navigateur.</p>
</li>
<li>
<p>Cliquez sur le lien WSDL pour afficher le fichier WSDL (Web Services Definition Language) associ&eacute; &agrave; l'adresse.</p>
<p>Le fichier WSDL s'ouvre dans un nouvel onglet ou une nouvelle fen&ecirc;tre du navigateur.</p>
<p>Certains navigateurs Web tentent d'interpr&eacute;ter la source WSDL lorsque vous cliquez sur le lien WSDL, affichant ainsi une page vierge. Pour de tels navigateurs, utilisez la commande d'affichage de la source du navigateur sur la page vierge pour afficher la source WSDL.</p>
</li>
<li>
<p>Cliquez sur le lien Nom de l'application ou sur le bouton Pr&eacute;c&eacute;dent pour revenir &agrave; la page Modifier une application.</p>
</li>
</ol>
<a id="GHCOM250" name="GHCOM250"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-applistdeployed.html">Affichage de la liste des applications d&eacute;ploy&eacute;es</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">D&eacute;ploiement d'une application Web</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">D&eacute;ploiement d'une application d'entreprise</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">D&eacute;ploiement d'un client d'application</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">D&eacute;ploiement d'un module connecteur</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">D&eacute;ploiement d'un fichier JAR EJB</a></p>
</li>
<li>
<p><a href="task-appedit.html">Modification d'une application d&eacute;ploy&eacute;e</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">Affichage des descripteurs d'une application</a></p>
</li>
<li>
<p><a href="task-applaunch.html">Lancement d'une application</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">Lancement d'un client d'application</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">T&eacute;l&eacute;chargement de stubs client d'application</a></p>
</li>
<li>
<p><a href="task-appredeploy.html">Red&eacute;ploiement d'une application d&eacute;ploy&eacute;e</a></p>
</li>
<li>
<p><a href="task-apprestart.html">Rechargement d'une application d&eacute;ploy&eacute;e</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">Affichage de ressources de niveau application</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">Modification de ressources de niveau application</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
