<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-appviewtargets" name="task-appviewtargets"></a></p>

<h4>Affichage des cibles d'application</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, s&eacute;lectionnez le noeud Applications.</p>
<p>La page Applications appara&icirc;t.</p>
</li>
<li>
<p>S&eacute;lectionnez l'application dont vous souhaitez afficher les cibles.</p>
<p>Le nom de l'application peut &ecirc;tre suivi d'un identificateur de version facultatif dont il est s&eacute;par&eacute; par un signe deux-points (<code>:</code>). Pour plus d'informations sur les versions des modules et des applications, reportez-vous &agrave; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> dans le manuel <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
<p>La page de l'application appara&icirc;t.</p>
</li>
<li>
<p>S&eacute;lectionnez l'onglet Cible.</p>
<p>La page Cibles de l'application appara&icirc;t et les cibles actuellement sp&eacute;cifi&eacute;es pour l'application s'affichent.</p>
</li>
<li>
<p>Pour activer ou d&eacute;sactiver une application sur une instance ou un cluster cible sp&eacute;cifique, cochez la case situ&eacute;e en regard de la cible et s&eacute;lectionnez Activer ou D&eacute;sactiver dans le menu d&eacute;roulant Plus d'actions.</p>
</li>
<li>
<p>Pour permettre l'&eacute;quilibrage de charge d'une cible sur une instance ou un cluster cible sp&eacute;cifique, cochez la case situ&eacute;e en regard de la cible et s&eacute;lectionnez Equilibreur de charge activ&eacute; ou Equilibreur de charge d&eacute;sactiv&eacute; dans le menu d&eacute;roulant Plus d'actions.</p>
</li>
<li>
<p>Pour associer une application &agrave; des serveurs virtuels sp&eacute;cifiques, s&eacute;lectionnez G&eacute;rer les serveurs virtuels pour l'instance ou le cluster cible de votre choix.</p>
<p>La page Cibles de serveur virtuel appara&icirc;t.</p>
<p>Pour ajouter des serveurs virtuels cible, s&eacute;lectionnez-les dans la liste Cibles disponibles et d&eacute;placez-les vers la liste Cibles s&eacute;lectionn&eacute;es &agrave; l'aide du bouton Ajouter.</p>
<p>Par d&eacute;faut, le module ou l'application est associ&eacute; au serveur virtuel par d&eacute;faut, nomm&eacute; <code>server</code>. Utilisez le bouton Tout ajouter pour ajouter toutes les cibles. Utilisez les boutons Enlever et Tout enlever pour enlever des cibles de la liste Cibles s&eacute;lectionn&eacute;es.</p>
<p>Cliquez sur Enregistrer pour revenir &agrave; la page Cibles de l'application.</p>
</li>
<li>
<p>Pour ajouter ou supprimer des instances ou clusters cible de l'application, s&eacute;lectionnez G&eacute;rer les cibles.</p>
<p>La page G&eacute;rer les cibles appara&icirc;t.</p>
<p>Pour ajouter des cibles, s&eacute;lectionnez-les dans la liste Cibles disponibles et d&eacute;placez-les vers la liste Cibles s&eacute;lectionn&eacute;es &agrave; l'aide du bouton Ajouter.</p>
<p>Utilisez le bouton Tout ajouter pour ajouter toutes les cibles. Utilisez les boutons Enlever et Tout enlever pour enlever des cibles de la liste Cibles s&eacute;lectionn&eacute;es.</p>
<p>Cliquez sur Enregistrer pour revenir &agrave; la page Cibles de l'application.</p>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>
<p>L'application est d&eacute;sormais disponible dans la liste r&eacute;vis&eacute;e des cibles.</p>
</li>
</ol>
<a id="sthref80" name="sthref80"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-appedit.html">Modification d'une application d&eacute;ploy&eacute;e</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">Affichage des descripteurs d'une application</a></p>
</li>
<li>
<p><a href="task-applaunch.html">Lancement d'une application</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
