<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-uc-addon" name="task-uc-addon"></a></p>

<h4><a id="sthref199" name="sthref199"></a><a id="sthref200" name="sthref200"></a>Installation de composants d'extension</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>L'installation d'un composant d'extension inclut les op&eacute;rations suivantes :</p>
<ul>
<li>
<p>Transf&eacute;rer le contenu du composant et de ses d&eacute;pendances &agrave; partir d'un r&eacute;f&eacute;rentiel r&eacute;seau</p>
</li>
<li>
<p>Installer le composant sous l'image d'installation GlassFish Server dans votre syst&egrave;me</p>
</li>
</ul>
<p>Si un composant exige un autre composant qui n'est pas encore install&eacute;, ce dernier est &eacute;galement install&eacute;.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, s&eacute;lectionnez le noeud Outil de mise &agrave; jour.</p>
<p>La page Extensions disponibles appara&icirc;t.</p>
</li>
<li>
<p>Dans la table de la page Extensions disponibles, s&eacute;lectionnez les composants &agrave; installer.</p>
<p>Si aucun composant d'extension n'est disponible, la table est vide.</p>
<ul>
<li>
<p>Pour s&eacute;lectionner un composant, cochez la case situ&eacute;e en regard de son nom.</p>
</li>
<li>
<p>Pour s&eacute;lectionner tous les composants, cliquez sur l'ic&ocirc;ne Tout s&eacute;lectionner dans l'en-t&ecirc;te de la table.</p>
</li>
<li>
<p>Pour d&eacute;s&eacute;lectionner tous les composants, cliquez sur l'ic&ocirc;ne Tout d&eacute;s&eacute;lectionner dans l'en-t&ecirc;te de la table.</p>
</li>
</ul>
</li>
<li>
<p>Cliquez sur Installer.</p>
<p>Une bo&icirc;te de dialogue vous demande de confirmer que les composants s&eacute;lectionn&eacute;s, ainsi que tout autre composant requis, doivent &ecirc;tre install&eacute;s.</p>
</li>
<li>
<p>Dans la bo&icirc;te de dialogue, cliquez sur OK.</p>
<p>Vous devez accepter les contrats de licence des composants que vous installez.</p>
</li>
<li>
<p>Acceptez les contrats de licence des composants que vous installez.</p>
<p>GlassFish Server confirme que l'installation est termin&eacute;e. Les composants sont enlev&eacute;s de la table des composants d'extension et ajout&eacute;s &agrave; la table de la page Composants install&eacute;s.</p>
</li>
<li>
<p>Red&eacute;marrez le serveur.</p>
<p>Pour obtenir des instructions d&eacute;taill&eacute;es, reportez-vous &agrave; la documentation ci-dessous :</p>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSADG00336"><i>To Stop a Domain</i> dans le manuel <i>Oracle GlassFish Server Administration Guide</i></a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSADG00335"><i>To Start a Domain</i> dans le manuel <i>Oracle GlassFish Server Administration Guide</i></a></p>
</li>
</ul>
</li>
</ol>
<a id="sthref201" name="sthref201"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-uc-update.html">Affichage des mises &agrave; jour disponibles pour les composants</a></p>
</li>
<li>
<p><a href="task-uc-installed-remove.html">Affichage des composants install&eacute;s</a></p>
</li>
<li>
<p><a href="task-uc-pkgdetails.html">Affichage des informations d&eacute;taill&eacute;es sur un composant</a></p>
</li>
<li>
<p><a href="task-uc-set-proxy.html">Configuration des param&egrave;tres de proxy r&eacute;seau permettant d'acc&eacute;der &agrave; des r&eacute;f&eacute;rentiels r&eacute;seau</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
