<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-lifecyclemodulenew" name="task-lifecyclemodulenew"></a></p>

<h4><a id="sthref64" name="sthref64"></a>Cr&eacute;ation d'un module de cycle de vie</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, s&eacute;lectionnez le noeud Modules de cycle de vie.</p>
<p>La page Module de cycle de vie appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Modules de cycle de vie, cliquez sur Nouveau.</p>
<p>La page Nouveau module de cycle de vie appara&icirc;t.</p>
</li>
<li>
<p>Dans le champ Nom, saisissez le nom du module de cycle de vie.</p>
</li>
<li>
<p>Dans le champ Nom de classe, saisissez le nom qualifi&eacute; complet du fichier de classe du module de cycle de vie.</p>
<p>La classe doit impl&eacute;menter l'interface <code>com.sun.appserv.server.LifecycleListener</code>.</p>
</li>
<li>
<p>Dans le champ Classpath, saisissez le classpath du module de cycle de vie.</p>
<p>Le classpath indique l'emplacement du module de cycle de vie. La valeur par d&eacute;faut est domain-dir<code>/applications</code>. Si le module est d&eacute;j&agrave; dans ce r&eacute;pertoire (c'est-&agrave;-dire dans le classpath du serveur), ce champ peut &ecirc;tre laiss&eacute; vide.</p>
</li>
<li>
<p>Dans le champ Ordre de chargement, saisissez une valeur indiquant l'ordre dans lequel ce module de cycle de vie doit &ecirc;tre charg&eacute; au d&eacute;marrage.</p>
<p>Les modules aux valeurs enti&egrave;res les plus faibles dans l'ordre de chargement sont charg&eacute;s en premier. Ce chiffre peut aller de 101 &agrave; la valeur <code>MAXINT</code> du syst&egrave;me d'exploitation. Les valeurs de 1 &agrave; 100 sont r&eacute;serv&eacute;es.</p>
</li>
<li>
<p>Dans le champ Description, saisissez une description du module de cycle de vie.</p>
</li>
<li>
<p>Cochez la case Statut activ&eacute; pour activer le module de cycle de vie.</p>
<p>Cette option est activ&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Cochez la case Emp&ecirc;cher le d&eacute;marrage de l'instance en cas d'&eacute;chec du chargement pour indiquer que le serveur doit &ecirc;tre arr&ecirc;t&eacute; en cas d'&eacute;chec du chargement du module de cycle de vie.</p>
<p>Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Pour ajouter des clusters et des instances de serveur cible sur lesquels activer le module de cycle de vie, s&eacute;lectionnez-les dans la liste Cibles disponibles et utilisez le bouton Ajouter pour les d&eacute;placer vers la liste Cibles s&eacute;lectionn&eacute;es.</p>
<p>L'option Cible appara&icirc;t si des clusters ou des instances de serveur autonomes existent en plus de l'instance de serveur par d&eacute;faut (<code>server</code>). Par d&eacute;faut, le module de cycle de vie est activ&eacute; sur l'instance de serveur par d&eacute;faut, nomm&eacute;e <code>server</code>. Utilisez le bouton Tout ajouter pour le/la d&eacute;ployer vers toutes les cibles. Utilisez les boutons Enlever et Tout enlever pour enlever des cibles de la liste Cibles s&eacute;lectionn&eacute;es.</p>
</li>
<li>
<p>Cliquez sur OK.</p>
</li>
</ol>
<a id="GHCOM266" name="GHCOM266"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-lifecyclemoduleedit.html">Modification d'un module de cycle de vie</a></p>
</li>
<li>
<p><a href="task-lifecyclemoduledelete.html">Suppression d'un module de cycle de vie</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
