<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-generaltab" name="task-generaltab"></a></p>

<h4><a id="sthref19" name="sthref19"></a><a id="sthref20" name="sthref20"></a>Affichage d'informations g&eacute;n&eacute;rales pour le serveur DAS</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, s&eacute;lectionnez le noeud du serveur (serveur d'administration).</p>
<p>La page Informations g&eacute;n&eacute;rales appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Informations g&eacute;n&eacute;rales, proc&eacute;dez &agrave; l'une des &eacute;tapes ci-apr&egrave;s.</p>
<ul>
<li>
<p>Consultez l'affichage du statut en lecture seule pour voir si le serveur est en cours d'ex&eacute;cution.</p>
</li>
<li>
<p>Consultez l'affichage du temps d'activit&eacute; en lecture seule pour voir le nombre d'heures et de minutes pendant lesquelles le serveur a &eacute;t&eacute; continuellement en cours d'ex&eacute;cution.</p>
</li>
<li>
<p>Cliquez sur le bouton Arr&ecirc;ter pour arr&ecirc;ter GlassFish Server.</p>
</li>
<li>
<p>Cliquez sur le bouton Red&eacute;marrer pour red&eacute;marrer GlassFish Server.</p>
</li>
<li>
<p>Cliquez sur le bouton Afficher les fichiers journaux pour visualiser les fichiers journaux des clusters ou des instances GlassFish Server.</p>
<p>Pour plus d'informations, reportez-vous &agrave; <a href="task-logviewer.html">Affichage de fichiers journaux pour le serveur DAS</a>.</p>
</li>
<li>
<p>Cliquez sur Rapport JVM pour ouvrir une fen&ecirc;tre distincte qui permet d'afficher des rapports sur la Java Virtual Machine, notamment un rapport r&eacute;capitulatif, un rapport sur la gestion de la m&eacute;moire, un rapport de chargement de classe et un vidage des threads en cours.</p>
</li>
</ul>
</li>
</ol>
<a id="sthref21" name="sthref21"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-logviewer.html">Affichage de fichiers journaux pour le serveur DAS</a></p>
</li>
<li>
<p><a href="task-filter-logs.html">Filtrage des enregistrements de journal affich&eacute;s</a></p>
</li>
<li>
<p><a href="task-setadvanceappconfig.html">D&eacute;finition de la configuration des applications</a></p>
</li>
<li>
<p><a href="task-setadvancedomainattributes.html">D&eacute;finition des attributs de domaine</a></p>
</li>
<li>
<p><a href="task-setadminpassword.html">Modification du mot de passe administrateur</a></p>
</li>
<li>
<p><a href="task-systemproperties.html">Gestion des propri&eacute;t&eacute;s syst&egrave;me</a></p>
</li>
<li>
<p><a href="task-appmonitoringdata.html">Affichage des donn&eacute;es de surveillance d'application</a></p>
</li>
<li>
<p><a href="task-servermonitoringdata.html">Affichage des donn&eacute;es de surveillance de serveur</a></p>
</li>
<li>
<p><a href="task-resourcemonitoringdata.html">Affichage des donn&eacute;es de surveillance de ressource</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
