<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-setadvanceappconfig" name="task-setadvanceappconfig"></a><a id="GHCOM00144" name="GHCOM00144"></a></p>

<h4><a id="sthref7" name="sthref7"></a><a id="sthref8" name="sthref8"></a><a id="sthref9" name="sthref9"></a><a id="sthref10" name="sthref10"></a><a id="sthref11" name="sthref11"></a>D&eacute;finition de la configuration des applications</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Sur la page Configuration des applications, vous pouvez d&eacute;finir les propri&eacute;t&eacute;s permettant de s'assurer que les modifications apport&eacute;es aux applications d&eacute;ploy&eacute;es sont d&eacute;tect&eacute;es et que les classes modifi&eacute;es sont recharg&eacute;es.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, s&eacute;lectionnez le noeud Domaine.</p>
<p>La page Attributs de domaine appara&icirc;t.</p>
</li>
<li>
<p>S&eacute;lectionnez l'onglet Configuration des applications.</p>
<p>La page Configuration des applications appara&icirc;t.</p>
</li>
<li>
<p>Cochez la case Rechargement activ&eacute; pour autoriser le rechargement dynamique des applications.</p>
<p>Lorsque le rechargement dynamique est activ&eacute;, il n'est pas n&eacute;cessaire de red&eacute;ployer une application ou un module lorsque vous modifiez son code ou ses descripteurs de d&eacute;ploiement. Il suffit de copier les fichiers JSP (JavaServer Pages) ou de classe modifi&eacute;s dans le r&eacute;pertoire de d&eacute;ploiement de l'application ou du module. Le serveur recherche r&eacute;guli&egrave;rement la pr&eacute;sence de modifications dans le r&eacute;pertoire de d&eacute;ploiement et red&eacute;ploie l'application, automatiquement et dynamiquement, avec ces modifications. Cette fonction est utile dans un environnement de d&eacute;veloppement car elle permet de tester rapidement les modifications du code. Cependant, dans un environnement de production, le rechargement dynamique peut diminuer les performances. De plus, &agrave; chaque rechargement, les sessions ouvertes durant cette p&eacute;riode de transition deviennent non valides. Le client doit red&eacute;marrer la session.</p>
<p>Cette option est activ&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Dans le champ Intervalle d'interrogation de rechargement, saisissez la dur&eacute;e, en secondes, de l'intervalle auquel les modifications du code doivent &ecirc;tre v&eacute;rifi&eacute;es dans les applications et les modules, et auquel ces derniers doivent &ecirc;tre recharg&eacute;s dynamiquement.</p>
<p>La valeur par d&eacute;faut est 2.</p>
</li>
<li>
<p>Dans le champ Expiration de la session d'administration, saisissez le nombre de minutes d'inactivit&eacute; apr&egrave;s lesquelles la session de la Console d'administration doit expirer.</p>
<p>La valeur par d&eacute;faut est 60.</p>
</li>
<li>
<p>Cochez la case D&eacute;ploiement automatique activ&eacute; pour activer le d&eacute;ploiement automatique des applications.</p>
<p>Si vous copiez un fichier d'application ou de module (JAR, WAR, RAR ou EAR) dans un r&eacute;pertoire sp&eacute;cial, puis activez le d&eacute;ploiement automatiquement, GlassFish Server d&eacute;ploie automatiquement l'application ou le module. Cette option est activ&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Dans le champ Intervalle d'interrogation de d&eacute;ploiement automatique, saisissez la dur&eacute;e, en secondes, de l'intervalle auquel les modifications du code doivent &ecirc;tre v&eacute;rifi&eacute;es dans les applications et les modules, et auquel ces derniers doivent &ecirc;tre recharg&eacute;s dynamiquement.</p>
<p>La valeur par d&eacute;faut est 2. La modification de l'intervalle d'interrogation n'affecte pas le temps de d&eacute;ploiement d'une application ou d'un module.</p>
</li>
<li>
<p>Dans le champ Expiration du d&eacute;lai de tentative de d&eacute;ploiement automatique, saisissez le nombre de secondes durant lesquelles la taille d'un fichier partiellement copi&eacute; peut demeurer inchang&eacute;e avant qu'une erreur ne se produise.</p>
<p>La valeur par d&eacute;faut est 4.</p>
</li>
<li>
<p>Dans le champ R&eacute;pertoire de d&eacute;ploiement automatique, saisissez le chemin complet du r&eacute;pertoire &agrave; surveiller pour le d&eacute;ploiement automatique des applications.</p>
<p>La valeur par d&eacute;faut est domain-dir<code>/autodeploy</code>.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Validation XML, s&eacute;lectionnez le type de validation XML &agrave; effectuer sur les descripteurs de d&eacute;ploiement standard et de GlassFish Server.</p>
<p>Il peut s'agir de l'un des types suivants :</p>
<dl>
<dt><code>full</code></dt>
<dd>
<p>En cas d'&eacute;chec de la validation XML, le d&eacute;ploiement &eacute;choue. Il s'agit de la valeur par d&eacute;faut.</p>
</dd>
<dt><code>parsing</code></dt>
<dd>
<p>Les erreurs de validation XML sont signal&eacute;es, mais le d&eacute;ploiement a lieu.</p>
</dd>
<dt><code>none</code></dt>
<dd>
<p>Aucune validation XML n'est effectu&eacute;e.</p>
</dd>
</dl>
</li>
<li>
<p>Cochez la case V&eacute;rificateur activ&eacute; pour v&eacute;rifier les fichiers du descripteur de d&eacute;ploiement.</p>
<p>Le v&eacute;rificateur examine la structure et le contenu du fichier avant le d&eacute;ploiement automatique. En cas d'&eacute;chec de la v&eacute;rification, le d&eacute;ploiement n'a pas lieu. La v&eacute;rification d'applications volumineuses est souvent une t&acirc;che qui demande du temps. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Cochez la case Pr&eacute;compilation activ&eacute;e pour pr&eacute;compiler les fichiers JSP.</p>
<p>Si cette option est d&eacute;sactiv&eacute;e, les fichiers JSP sont compil&eacute;s au moment de l'ex&eacute;cution, lors de leur premier acc&egrave;s. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Dans la section Autres propri&eacute;t&eacute;s, sp&eacute;cifiez les propri&eacute;t&eacute;s suppl&eacute;mentaires.</p>
<p>GlassFish Server ne d&eacute;finit aucune propri&eacute;t&eacute; suppl&eacute;mentaire pour les applications.</p>
<ul>
<li>
<p>Pour ajouter une propri&eacute;t&eacute;, cliquez sur le bouton Ajouter une propri&eacute;t&eacute;. Sur la ligne vide qui appara&icirc;t, saisissez le nom de la propri&eacute;t&eacute; dans le champ Nom et la valeur de la propri&eacute;t&eacute; dans le champ Valeur.</p>
</li>
<li>
<p>Pour modifier une propri&eacute;t&eacute;, modifiez le champ Valeur de cette propri&eacute;t&eacute;.</p>
</li>
<li>
<p>Pour supprimer une propri&eacute;t&eacute;, s&eacute;lectionnez la case situ&eacute;e &agrave; gauche du champ Nom de la propri&eacute;t&eacute; &agrave; supprimer, puis cliquez sur le bouton Supprimer des propri&eacute;t&eacute;s.</p>
</li>
</ul>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>

<hr>
<p><b>Conseil:</b></p>
Pour revenir aux param&egrave;tres par d&eacute;faut, cliquez sur le bouton Charger les valeurs par d&eacute;faut, puis sur Enregistrer.
<hr>

</li>
<li>
<p>Red&eacute;marrez le serveur.</p>
</li>
</ol>
<a id="sthref12" name="sthref12"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-generaltab.html">Affichage d'informations g&eacute;n&eacute;rales pour le serveur DAS</a></p>
</li>
<li>
<p><a href="task-logviewer.html">Affichage de fichiers journaux pour le serveur DAS</a></p>
</li>
<li>
<p><a href="task-filter-logs.html">Filtrage des enregistrements de journal affich&eacute;s</a></p>
</li>
<li>
<p><a href="task-setadvancedomainattributes.html">D&eacute;finition des attributs de domaine</a></p>
</li>
<li>
<p><a href="task-collectdomainlogs.html">Collecte et t&eacute;l&eacute;chargement de journaux de domaine</a></p>
</li>
<li>
<p><a href="task-setadminpassword.html">Modification du mot de passe administrateur</a></p>
</li>
<li>
<p><a href="task-systemproperties.html">Gestion des propri&eacute;t&eacute;s syst&egrave;me</a></p>
</li>
<li>
<p><a href="task-appmonitoringdata.html">Affichage des donn&eacute;es de surveillance d'application</a></p>
</li>
<li>
<p><a href="task-servermonitoringdata.html">Affichage des donn&eacute;es de surveillance de serveur</a></p>
</li>
<li>
<p><a href="task-resourcemonitoringdata.html">Affichage des donn&eacute;es de surveillance de ressource</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
