<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-usedefaultauditmod" name="task-usedefaultauditmod"></a><a id="GHCOM00199" name="GHCOM00199"></a></p>

<h4><a id="sthref164" name="sthref164"></a>Utilisation du module d'audit par d&eacute;faut</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Le module d'audit <code>default</code> consigne les demandes d'authentification et d'autorisation dans le fichier journal du serveur. Pour plus d'informations sur la modification de l'emplacement du fichier journal, reportez-vous &agrave; <a href="task-eelogging.html">Configuration de param&egrave;tres de journalisation g&eacute;n&eacute;raux</a>.</p>
<p>Les entr&eacute;es de journal relatives &agrave; l'authentification comprennent les informations suivantes :</p>
<ul>
<li>
<p>Noms des utilisateurs qui ont tent&eacute; de s'authentifier</p>
</li>
<li>
<p>Domaine ayant trait&eacute; la demande d'acc&egrave;s</p>
</li>
<li>
<p>Composant EJB ou URI de module Web demand&eacute;</p>
</li>
<li>
<p>Succ&egrave;s ou &eacute;chec de la demande</p>
</li>
</ul>
<p>Que la journalisation d'audit soit activ&eacute;e ou non, GlassFish Server journalise tous les &eacute;v&eacute;nements d'authentification refus&eacute;e.</p>
<p>Les entr&eacute;es de journal relatives aux autorisations comprennent les informations suivantes :</p>
<ul>
<li>
<p>Noms des utilisateurs authentifi&eacute;s, le cas &eacute;ch&eacute;ant</p>
</li>
<li>
<p>Composant EJB ou URI Web demand&eacute;</p>
</li>
<li>
<p>Succ&egrave;s ou &eacute;chec des demandes</p>
</li>
</ul>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Configuration.</p>
</li>
<li>
<p>S&eacute;lectionnez l'instance &agrave; configurer :</p>
<ul>
<li>
<p>Pour configurer une instance sp&eacute;cifique, d&eacute;veloppez le noeud de configuration de l'instance. Par exemple, pour l'instance par d&eacute;faut <code>server</code>, d&eacute;veloppez le noeud <code>server-config</code>.</p>
</li>
<li>
<p>Pour configurer les param&egrave;tres par d&eacute;faut pour toutes les instances, d&eacute;veloppez le noeud <code>default-config</code>.</p>
</li>
</ul>
</li>
<li>
<p>Sous le noeud Configuration, s&eacute;lectionnez le noeud S&eacute;curit&eacute;.</p>
<p>La page S&eacute;curit&eacute; appara&icirc;t.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Modules d'audit, s&eacute;lectionnez le module d'audit nomm&eacute; <code>default</code>.</p>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>
</li>
</ol>
<a id="sthref165" name="sthref165"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-auditmodulenew.html">Cr&eacute;ation d'un module d'audit</a></p>
</li>
<li>
<p><a href="task-auditmoduleedit.html">Modification d'un module d'audit</a></p>
</li>
<li>
<p><a href="task-auditmoduledelete.html">Suppression d'un module d'audit</a></p>
</li>
<li>
<p><a href="task-enabledisableauditmod.html">Activation ou d&eacute;sactivation de la journalisation d'audit</a></p>
</li>
<li>
<p><a href="task-setactiveauditmod.html">D&eacute;finition du module d'audit actif</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
