<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-confmonitor" name="task-confmonitor"></a></p>

<h4><a id="sthref196" name="sthref196"></a>Configuration du service de surveillance</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Pour ouvrir la page Service de surveillance, effectuez l'une des op&eacute;rations suivantes :</p>
<ul>
<li>
<p>S&eacute;lectionnez le noeud Donn&eacute;es de surveillance et cliquez sur le lien Configurer la surveillance de l'instance de serveur pour laquelle vous voulez configurer la surveillance. Pour configurer la surveillance d'un cluster, s&eacute;lectionnez une instance dans le cluster.</p>
</li>
</ul>
<ul>
<li>
<p>Sous le noeud Configurations, d&eacute;veloppez la configuration d'instance de serveur ou de cluster pour laquelle vous souhaitez configurer la surveillance, puis d&eacute;veloppez le noeud Surveillance.</p>
</li>
</ul>
<p>La page Service de surveillance appara&icirc;t.</p>
</li>
<li>
<p>Cochez la case Service de surveillance activ&eacute; pour activer la surveillance sur GlassFish Server, ou d&eacute;s&eacute;lectionnez cette case pour la d&eacute;sactiver.</p>
<p>Cette option est activ&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Cochez la case MBeans activ&eacute;s pour d&eacute;ployer tous les MBeans n&eacute;cessaires &agrave; la surveillance, ou d&eacute;s&eacute;lectionnez cette case pour annuler le d&eacute;ploiement de ces MBeans.</p>
<p>Cette option est activ&eacute;e par d&eacute;faut.</p>
<p>Si la case n'est pas coch&eacute;e, vous ne pouvez pas afficher les donn&eacute;es de surveillance dans la Console d'administration, m&ecirc;me si la case Service de surveillance est coch&eacute;e. Au lieu de cela, vous devez utiliser la ligne de commande pour afficher les donn&eacute;es de surveillance. Si vous d&eacute;s&eacute;lectionnez la case, l'empreinte de m&eacute;moire de GlassFish Server est r&eacute;duite.</p>
</li>
<li>
<p>Cochez la case DTrace activ&eacute; pour activer l'utilisation de l'outil Solaris DTrace.</p>
<p>Pour pouvoir utiliser l'outil Solaris DTrace, vous devez &eacute;galement disposer de la surveillance DTrace d'Oracle Enterprise Manager. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Dans la table, effectuez l'une des actions ci-apr&egrave;s.</p>
<ul>
<li>
<p>Dans la colonne Niveau de surveillance, s&eacute;lectionnez HIGH ou LOW dans la liste d&eacute;roulante pour les composants de la colonne Composant, afin d'activer la surveillance sur ces derniers.</p>
</li>
<li>
<p>Cochez les cases en regard des composants, puis s&eacute;lectionnez HIGH ou LOW dans la liste d&eacute;roulante Niveau en haut de la table et cliquez sur le bouton Modifier le niveau afin de d&eacute;finir le niveau de surveillance sur cette valeur pour tous ces composants.</p>
</li>
</ul>
<p>Dans cette version, il n'existe aucune diff&eacute;rence entre les options LOW et HIGH. Pour d&eacute;sactiver la surveillance des composants, s&eacute;lectionnez OFF. La valeur par d&eacute;faut est OFF.</p>
<p>Vous devez d&eacute;ployer une application, un composant ou un service avant d'en configurer la surveillance.</p>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>
</li>
</ol>
<a id="sthref197" name="sthref197"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-appmonitoringdata.html">Affichage des donn&eacute;es de surveillance d'application</a></p>
</li>
<li>
<p><a href="task-servermonitoringdata.html">Affichage des donn&eacute;es de surveillance de serveur</a></p>
</li>
<li>
<p><a href="task-resourcemonitoringdata.html">Affichage des donn&eacute;es de surveillance de ressource</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
