<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-auditmodulenew" name="task-auditmodulenew"></a></p>

<h4><a id="sthref93" name="sthref93"></a>Cr&eacute;ation d'un module d'audit</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>L'audit est la mani&egrave;re dont GlassFish Server consigne les &eacute;v&eacute;nements importants, comme les erreurs et les br&egrave;ches de s&eacute;curit&eacute;. GlassFish Server consigne tous les &eacute;v&eacute;nements d'authentification dans des fichiers journaux. Un journal d'acc&egrave;s complet fournit un suivi chronologique des &eacute;v&eacute;nements d'acc&egrave;s dans GlassFish Server.</p>
<p>GlassFish Server fournit un simple module d'audit par d&eacute;faut. Pour plus d'informations, reportez-vous &agrave; <a href="task-usedefaultauditmod.html">Utilisation du module d'audit par d&eacute;faut</a>.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Configuration.</p>
</li>
<li>
<p>S&eacute;lectionnez l'instance &agrave; configurer :</p>
<ul>
<li>
<p>Pour configurer une instance sp&eacute;cifique, d&eacute;veloppez le noeud de configuration de l'instance. Par exemple, pour l'instance par d&eacute;faut <code>server</code>, d&eacute;veloppez le noeud <code>server-config</code>.</p>
</li>
<li>
<p>Pour configurer les param&egrave;tres par d&eacute;faut pour toutes les instances, d&eacute;veloppez le noeud <code>default-config</code>.</p>
</li>
</ul>
</li>
<li>
<p>Sous le noeud Configuration, d&eacute;veloppez le noeud S&eacute;curit&eacute;.</p>
</li>
<li>
<p>Sous le noeud S&eacute;curit&eacute;, s&eacute;lectionnez le noeud Modules d'audit.</p>
<p>La page Modules d'audit appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Modules d'audit, cliquez sur Nouveau.</p>
<p>La page Nouveau module d'audit appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Nouveau module d'audit, dans le champ Nom, saisissez le nom du module d'audit.</p>
</li>
<li>
<p>Dans le champ Nom de classe, saisissez le nom complet de la classe qui impl&eacute;mente ce module.</p>
<p>Le nom de classe du module d'audit par d&eacute;faut est <code>com.sun.enterprise.security.Audit</code>.</p>
</li>
<li>
<p>Dans la section Autres propri&eacute;t&eacute;s, sp&eacute;cifiez les propri&eacute;t&eacute;s suppl&eacute;mentaires.</p>
<p>Pour ajouter une propri&eacute;t&eacute;, cliquez sur le bouton Ajouter une propri&eacute;t&eacute;. Sur la ligne vide qui appara&icirc;t, saisissez le nom de la propri&eacute;t&eacute; dans le champ Nom et la valeur de la propri&eacute;t&eacute; dans le champ Valeur.</p>
<p>Pour obtenir une description de la propri&eacute;t&eacute; suppl&eacute;mentaire disponible dans les modules d'audit, reportez-vous &agrave; <a href="ref-auditmoduleprop.html">Propri&eacute;t&eacute;s propres aux modules d'audit</a>.</p>
</li>
<li>
<p>Cliquez sur OK.</p>
</li>
</ol>
<a id="GHCOM297" name="GHCOM297"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-auditmoduleedit.html">Modification d'un module d'audit</a></p>
</li>
<li>
<p><a href="task-auditmoduledelete.html">Suppression d'un module d'audit</a></p>
</li>
<li>
<p><a href="task-enabledisableauditmod.html">Activation ou d&eacute;sactivation de la journalisation d'audit</a></p>
</li>
<li>
<p><a href="task-setactiveauditmod.html">D&eacute;finition du module d'audit actif</a></p>
</li>
<li>
<p><a href="task-usedefaultauditmod.html">Utilisation du module d'audit par d&eacute;faut</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
