<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-enablemesec4appclients" name="task-enablemesec4appclients"></a><a id="GHCOM00210" name="GHCOM00210"></a></p>

<h4><a id="sthref188" name="sthref188"></a>Activation de la s&eacute;curit&eacute; des messages pour les clients d'application</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Les fournisseurs c&ocirc;t&eacute; client doivent avoir les m&ecirc;mes r&egrave;gles de protection des messages que les fournisseurs c&ocirc;t&eacute; serveur avec lesquels ils interagissent. Cela est d&eacute;j&agrave; le cas des fournisseurs configur&eacute;s (mais non activ&eacute;s) lors de l'installation de GlassFish Server.</p>
<p>Pour activer la s&eacute;curit&eacute; des messages sur les clients d'application, modifiez la configuration de GlassFish Server pour le conteneur du client d'application.</p>
<ol>
<li>
<p>Arr&ecirc;tez les applications client qui d&eacute;pendent du descripteur de conteneur client.</p>
</li>
<li>
<p>Dans un &eacute;diteur de texte, ouvrez le descripteur de conteneur client d'application Sun, qui se trouve dans domain-dir<code>/config/sun-acc.xml.</code></p>
</li>
<li>
<p>Pour activer le fournisseur c&ocirc;t&eacute; client par d&eacute;faut dans le client d'application, ajoutez l'attribut <code>default-client-provider</code> &agrave; l'&eacute;l&eacute;ment <code>message-security-config</code>.</p>
<p>Le code environnant est donn&eacute; comme contexte et peut &ecirc;tre l&eacute;g&egrave;rement diff&eacute;rent dans votre installation. Ne le changez pas.</p>
<pre>
&lt;client-container&gt;
  &lt;target-server name="<i>your-host</i>" address="<i>your-host</i>"
      port="<i>your-port</i>"
  &lt;log-service file="" level="WARNING"
  &lt;message-security-config auth-layer="SOAP"
      <b>default-client-provider="ClientProvider"</b>&gt;
    &lt;provider-config
        class-name="com.sun.enterprise.security.jauth.ClientAuthModule"
        provider-id="clientprovider" provider-type="client"&gt;
      &lt;request-policy auth-source="sender"
      &lt;response-policy
        &lt;property name="security.config"
          value="C:/Sun/AppServer/lib/appclient/wss-client-config.xml"
    &lt;/provider-config&gt;
  &lt;/message-security-config&gt;
&lt;/client-container&gt;
</pre>
<p>Le fournisseur de s&eacute;curit&eacute; des messages configur&eacute; dans le conteneur client doit avoir acc&egrave;s aux cl&eacute;s priv&eacute;es et aux certificats s&eacute;curis&eacute;s. Pour permettre l'acc&egrave;s, d&eacute;finissez les valeurs des propri&eacute;t&eacute;s syst&egrave;me suivantes dans le script de d&eacute;marrage du client d'application :</p>
<pre>
-Djavax.net.ssl.keyStore

-Djavax.net.ssl.trustStore
</pre></li>
</ol>
<a id="sthref189" name="sthref189"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">Configuration des utilitaires GlassFish Server que les fournisseurs de s&eacute;curit&eacute; des messages doivent utiliser</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">Cr&eacute;ation d'une configuration de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">Modification d'une configuration de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">Suppression d'une configuration de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">Cr&eacute;ation d'une configuration de fournisseur de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">Modification d'une configuration de fournisseur de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">Suppression d'une configuration de fournisseur de s&eacute;curit&eacute; des messages</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
