<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-configmsgsecproviders" name="task-configmsgsecproviders"></a></p>

<h4><a id="sthref102" name="sthref102"></a>Configuration des utilitaires GlassFish Server que les fournisseurs de s&eacute;curit&eacute; des messages doivent utiliser</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Si vous utilisez un jeton de nom utilisateur, configurez une base de donn&eacute;es utilisateur, si n&eacute;cessaire.</p>
<p>Si vous utilisez un jeton de nom utilisateur/mot de passe, configurez d'abord un domaine et une base de donn&eacute;es utilisateur appropri&eacute;s pour le domaine.</p>
<p>La configuration d'une base de donn&eacute;es utilisateur est abord&eacute;e dans <a href="task-realmedit.html">Modification d'un domaine</a>.</p>
</li>
<li>
<p>G&eacute;rez les certificats et les cl&eacute;s priv&eacute;es, si n&eacute;cessaire.</p>
</li>
</ol>
<a id="GHCOM308" name="GHCOM308"></a>
<h5>Etapes suivantes</h5>
<p>Une fois les utilitaires de GlassFish Server configur&eacute;s en vue d'une utilisation par les fournisseurs de s&eacute;curit&eacute; des messages, les fournisseurs install&eacute;s avec GlassFish Server peuvent &ecirc;tre activ&eacute;s comme d&eacute;crit dans <a href="task-messagesecurityconfigedit.html">Modification d'une configuration de s&eacute;curit&eacute; des messages</a>.</p>
<a id="GHCOM309" name="GHCOM309"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-messagesecurityconfignew.html">Cr&eacute;ation d'une configuration de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">Modification d'une configuration de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">Suppression d'une configuration de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">Cr&eacute;ation d'une configuration de fournisseur de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">Modification d'une configuration de fournisseur de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">Suppression d'une configuration de fournisseur de s&eacute;curit&eacute; des messages</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">Activation de la s&eacute;curit&eacute; des messages pour les clients d'application</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
