<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-appedit" name="task-appedit"></a><a id="GHCOM00161" name="GHCOM00161"></a></p>

<h4><a id="sthref71" name="sthref71"></a>Modification d'une application d&eacute;ploy&eacute;e</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, s&eacute;lectionnez le noeud Applications.</p>
<p>La page Applications appara&icirc;t.</p>
</li>
<li>
<p>Dans la table Applications d&eacute;ploy&eacute;es, cliquez sur le nom de l'application &agrave; modifier.</p>
<p>Le nom peut &ecirc;tre suivi d'un identificateur de version facultatif dont il est s&eacute;par&eacute; par un signe deux-points (<code>:</code>). Pour plus d'informations sur les versions des modules et des applications, reportez-vous &agrave; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> dans le manuel <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
<p>La page Modifier une application appara&icirc;t.</p>
</li>
<li>
<p>D&eacute;s&eacute;lectionnez la case Statut activ&eacute; pour d&eacute;sactiver le statut de l'application et la rendre indisponible.</p>
<p>Par d&eacute;faut, le statut d'une application est Activ&eacute; d&egrave;s son d&eacute;ploiement.</p>
</li>
<li>
<p>Pour une application Web, dans le champ Racine du contexte, saisissez le chemin de l'application.</p>
<p>Dans l'URL de l'application Web, la racine du contexte suit imm&eacute;diatement le num&eacute;ro de port (<code>http://</code><i>host</i><code>:</code><i>port</i><code>/</code><i>context-root</i><code>/...</code>). Assurez-vous que la racine du contexte commence par une barre oblique (par exemple, <code>/hello</code>).</p>
</li>
<li>
<p>D&eacute;s&eacute;lectionnez la case Disponibilit&eacute; activ&eacute;e afin de d&eacute;sactiver la persistance de session et la r&eacute;alisation de points de reprise SFSB pour l'application.</p>
<p>Si la case Activ&eacute; est coch&eacute;e, la haute disponibilit&eacute; est activ&eacute;e pour la r&eacute;alisation de points de reprise et &eacute;ventuellement la passivation des sessions Web et des beans Session avec conservation de statut (SFSB). Si la valeur est False (valeur par d&eacute;faut), tous les enregistrements de session Web et la r&eacute;alisation de points de reprise SFSB sont d&eacute;sactiv&eacute;s pour l'application, l'application Web ou le module EJB sp&eacute;cifi&eacute;. Si cette valeur est True, l'application ou le module sp&eacute;cifi&eacute; est activ&eacute; pour la haute disponibilit&eacute;. D&eacute;finissez cette option sur True seulement si la haute disponibilit&eacute; est configur&eacute;e et activ&eacute;e &agrave; des niveaux sup&eacute;rieurs, tels que les niveaux serveur et conteneur.</p>
<p>Cette option appara&icirc;t si des clusters ou des instances de serveur autonomes existent en plus de l'instance de serveur par d&eacute;faut (<code>server</code>).</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Serveurs virtuels, s&eacute;lectionnez le serveur virtuel &agrave; associer &agrave; cette application.</p>
<p>L'option Serveurs virtuels appara&icirc;t si seule l'instance de serveur par d&eacute;faut, <code>server</code>, existe. S'il existe des clusters ou d'autres instances de serveur autonomes, vous pouvez s&eacute;lectionner des serveurs virtuels apr&egrave;s le d&eacute;ploiement. Ouvrez la page Modifier une application, s&eacute;lectionnez l'onglet Cible, puis G&eacute;rer les serveurs virtuels pour la cible de votre choix.</p>
</li>
<li>
<p>Cochez la case Java Web Start activ&eacute; pour d&eacute;ployer l'application &agrave; l'aide du logiciel Java Web Start.</p>
<p>Cette option est activ&eacute;e ou d&eacute;sactiv&eacute;e par d&eacute;faut en fonction de son param&eacute;trage lors du d&eacute;ploiement initial de l'application.</p>
</li>
<li>
<p>Dans le champ Ordre de d&eacute;ploiement, saisissez un nombre pour indiquer l'ordre de d&eacute;ploiement de l'application.</p>
<p>Les applications ayant le num&eacute;ro le plus faible sont charg&eacute;es en premier au d&eacute;marrage du serveur. Une application ayant un ordre de d&eacute;ploiement de 102 est charg&eacute;e avant une application ayant un ordre de d&eacute;ploiement de 110. Si l'ordre de d&eacute;ploiement n'est pas indiqu&eacute; au moment o&ugrave; une application est d&eacute;ploy&eacute;e, l'ordre de d&eacute;ploiement par d&eacute;faut de 100 est affect&eacute;. Si deux applications ont le m&ecirc;me ordre de d&eacute;ploiement, l'application qui a &eacute;t&eacute; d&eacute;ploy&eacute;e en premier est charg&eacute;e en premier. La sp&eacute;cification d'un ordre de d&eacute;ploiement s'av&egrave;re utile si l'application a des d&eacute;pendances et doit &ecirc;tre charg&eacute;e dans un certain ordre.</p>
</li>
<li>
<p>Dans le champ Description, entrez une br&egrave;ve description de cette application.</p>
</li>
<li>
<p>Pour afficher la liste des descripteurs de module de l'application, cliquez sur l'onglet Description. Pour plus d'informations, reportez-vous &agrave; <a href="task-appviewdesc.html">Affichage des descripteurs d'une application</a>.</p>
</li>
<li>
<p>Par d&eacute;faut, le statut d'une application est Activ&eacute; sur toutes les cibles. Pour afficher les cibles sur lesquelles l'application est activ&eacute;e, cliquez sur l'onglet Cibles. Vous pouvez activer ou d&eacute;sactiver les applications sur des cibles. Reportez-vous &agrave; <a href="task-appviewtargets.html">Affichage des cibles d'application</a>.</p>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>
</li>
</ol>
<a id="sthref72" name="sthref72"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-applistdeployed.html">Affichage de la liste des applications d&eacute;ploy&eacute;es</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">D&eacute;ploiement d'une application Web</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">D&eacute;ploiement d'une application d'entreprise</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">D&eacute;ploiement d'un client d'application</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">D&eacute;ploiement d'un module connecteur</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">D&eacute;ploiement d'un fichier JAR EJB</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">Affichage des descripteurs d'une application</a></p>
</li>
<li>
<p><a href="task-appviewtargets.html">Affichage des cibles d'application</a></p>
</li>
<li>
<p><a href="task-endpoint.html">Affichage des informations d'adresse pour un service Web</a></p>
</li>
<li>
<p><a href="task-applaunch.html">Lancement d'une application</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">Lancement d'un client d'application</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">T&eacute;l&eacute;chargement de stubs client d'application</a></p>
</li>
<li>
<p><a href="task-appredeploy.html">Red&eacute;ploiement d'une application d&eacute;ploy&eacute;e</a></p>
</li>
<li>
<p><a href="task-apprestart.html">Rechargement d'une application d&eacute;ploy&eacute;e</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">Affichage de ressources de niveau application</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">Modification de ressources de niveau application</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
