<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-accessadmintools" name="task-accessadmintools"></a></p>

<h4><a id="sthref129" name="sthref129"></a>Octroi d'un acc&egrave;s aux outils d'administration</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Seuls les utilisateurs du groupe <code>asadmin</code> ont acc&egrave;s &agrave; la Console d'administration et &agrave; l'utilitaire de ligne de commande <code>asadmin</code>. Pour autoriser l'acc&egrave;s &agrave; ces outils d'administration, ajoutez les utilisateurs au groupe <code>asadmin</code> dans le domaine <code>admin-realm</code>.</p>
<ol>
<li>
<p>Sous le noeud Configurations, d&eacute;veloppez la configuration d'instance de serveur ou de cluster pour laquelle vous souhaitez configurer les privil&egrave;ges d'acc&egrave;s d'administration.</p>
</li>
<li>
<p>D&eacute;veloppez le noeud S&eacute;curit&eacute;.</p>
</li>
<li>
<p>D&eacute;veloppez le noeud Domaines.</p>
</li>
<li>
<p>S&eacute;lectionnez le noeud <code>admin-realm</code>.</p>
<p>La page Modifier le domaine appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Modifier le domaine, cliquez sur le bouton G&eacute;rer les utilisateurs.</p>
<p>La page Administrateurs appara&icirc;t.</p>
<p>Apr&egrave;s l'installation, le nom utilisateur et le mot de passe de l'administrateur entr&eacute;s lors de l'installation figurent dans un fichier nomm&eacute; <code>admin-keyfile</code>. Par d&eacute;faut, cet utilisateur appartient au groupe <code>asadmin</code>, ce qui lui conf&egrave;re le droit de modifier GlassFish Server. N'affectez des utilisateurs &agrave; ce groupe que si vous voulez leur accorder des privil&egrave;ges d'administrateur pour l'instance ou le cluster GlassFish Server s&eacute;lectionn&eacute;.</p>
<p>Si vous ajoutez des utilisateurs au domaine <code>admin-realm</code>, mais que vous les affectez &agrave; un autre groupe que <code>asadmin</code>, les informations utilisateur seront toujours &eacute;crites dans le fichier nomm&eacute; <code>admin-keyfile</code>, mais l'utilisateur n'aura pas acc&egrave;s aux outils d'administration ni aux applications du domaine <code>file</code>.</p>
</li>
<li>
<p>Sur la page Administrateurs, cliquez sur Nouveau pour ajouter un utilisateur au domaine <code>admin-realm</code>.</p>
<p>La page Nouvel utilisateur du domaine de fichiers appara&icirc;t.</p>
</li>
<li>
<p>Dans le champ ID utilisateur, saisissez le nom du nouvel utilisateur.</p>
</li>
<li>
<p>Dans le champ Liste des groupes, saisissez le nom des groupes auxquels l'utilisateur appartient.</p>
<p>Pour autoriser un utilisateur &agrave; modifier GlassFish Server, ajoutez le groupe <code>asadmin</code> &agrave; la liste des groupes.</p>
</li>
<li>
<p>Dans les champs Nouveau mot de passe et Confirmer le nouveau mot de passe, saisissez le mot de passe du nouvel utilisateur.</p>
</li>
<li>
<p>Cliquez sur OK pour ajouter cet utilisateur au domaine <code>admin-realm</code> ou sur Annuler pour quitter sans enregistrer.</p>
</li>
</ol>
<a id="sthref130" name="sthref130"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-securitysettings.html">Configuration de param&egrave;tres de s&eacute;curit&eacute;</a></p>
</li>
<li>
<p><a href="task-changeadminpasswd.html">Modification du mot de passe d'un utilisateur dans le domaine d'administration</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
