<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmxconnectorssledit" name="task-jmxconnectorssledit"></a><a id="GHCOM00212" name="GHCOM00212"></a></p>

<h4><a id="sthref191" name="sthref191"></a><a id="sthref192" name="sthref192"></a><a id="sthref193" name="sthref193"></a>Modifier des param&egrave;tres SSL pour le connecteur JMX</h4>
<a name="BEGIN" id="BEGIN"></a><a id="sthref194" name="sthref194"></a>
<h5>Avant de commencer</h5>
<p>Cette t&acirc;che n'est pertinente que si la s&eacute;curit&eacute; est activ&eacute;e pour le connecteur JMX.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Configuration.</p>
</li>
<li>
<p>Sous le noeud Configuration, s&eacute;lectionnez le noeud Service d'administration.</p>
<p>La page Modifier un connecteur JMX appara&icirc;t.</p>
</li>
<li>
<p>Cochez la case S&eacute;curit&eacute; activ&eacute;e pour que la communication JMX soit crypt&eacute;e.</p>
<p>Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Cliquez sur l'onglet SSL.</p>
<p>La page SSL appara&icirc;t.</p>
</li>
<li>
<p>Sur la page SSL, cochez la case SSL3 activ&eacute; pour activer SSL3.</p>
<p>Cette option est activ&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Cochez la case TLS activ&eacute; pour activer TLS (Transport Layer Security).</p>
<p>Cette option est activ&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Cochez la case Authentification client activ&eacute;e pour demander aux clients de s'identifier sur le serveur &agrave; chaque demande.</p>
<p>Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Dans le champ Pseudonyme du certificat, saisissez le pseudonyme du certificat du serveur dans la base de donn&eacute;es de certificats ou le jeton PKCS#11.</p>
<p>Dans le certificat, le format du nom est <i>nom du jeton</i><code>:</code><i>pseudonyme</i>. M&ecirc;me la partie <i>nom du jeton</i><code>:</code> du nom de cet attribut est facultative.</p>
</li>
<li>
<p>Dans le champ Keystore, saisissez le nom du keystore (par exemple, <code>keystore.jks</code>).</p>
</li>
<li>
<p>Dans le champ Algorithme s&eacute;curis&eacute;, saisissez le nom de l'algorithme de gestion s&eacute;curis&eacute; (par exemple, PKIX) &agrave; utiliser pour la validation du chemin de certification.</p>
</li>
<li>
<p>Dans le champ Longueur max. du certificat, saisissez le nombre maximal de certificats interm&eacute;diaires non auto-&eacute;mis qui peuvent exister dans un chemin de certification.</p>
<p>Ce champ est utilis&eacute; uniquement si le champ Algorithme s&eacute;curis&eacute; a la valeur PKIX. La valeur 0 implique que le chemin peut contenir un seul certificat. La valeur -1 implique que la longueur du chemin est illimit&eacute;e (pas de maximum). La d&eacute;finition d'une valeur inf&eacute;rieure &agrave; -1 entra&icirc;ne la g&eacute;n&eacute;ration d'une exception.</p>
</li>
<li>
<p>Dans le champ Truststore, saisissez le nom du fichier truststore (par exemple, <code>cacerts.jks</code>).</p>
</li>
<li>
<p>Dans la zone Suites de cryptage, sp&eacute;cifiez les m&eacute;canismes de cryptage &agrave; utiliser.</p>
<p>Si vous n'ajoutez pas de suite de cryptage, toutes les suites seront utilis&eacute;es.</p>
</li>
<li>
<p>Cliquez sur OK.</p>
</li>
</ol>
<a id="sthref195" name="sthref195"></a>
<h5>Voir aussi</h5>
<p><a href="task-jmxconnectoredit.html">Modification du connecteur JMX</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
