<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-securitysettings" name="task-securitysettings"></a></p>

<h4><a id="sthref126" name="sthref126"></a><a id="sthref127" name="sthref127"></a>Configuration de param&egrave;tres de s&eacute;curit&eacute;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La Console d'administration permet de d&eacute;finir toute une s&eacute;rie de param&egrave;tres de s&eacute;curit&eacute; de niveau syst&egrave;me.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Configurations.</p>
</li>
<li>
<p>Sous le noeud Configurations, cliquez sur la configuration d'instance de serveur ou de cluster pour laquelle vous souhaitez d&eacute;finir les param&egrave;tres de s&eacute;curit&eacute;.</p>
<p>La page Configuration appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Configuration, cliquez sur S&eacute;curit&eacute;.</p>
<p>La page Param&egrave;tres de s&eacute;curit&eacute; de la cible de configuration s&eacute;lectionn&eacute;e appara&icirc;t.</p>
</li>
<li>
<p>Cochez la case Gestionnaire de s&eacute;curit&eacute; activ&eacute; pour activer le gestionnaire de s&eacute;curit&eacute;.</p>
<p>Si cette option est activ&eacute;e, une option JVM, <code>Djava.security.manager</code>, est ajout&eacute;e aux param&egrave;tres JVM de GlassFish Server. Reportez-vous &agrave; <a href="task-jvmoptions.html">Configuration des options JVM</a>. Vous devez red&eacute;marrer le serveur pour activer la modification.</p>
<p>V&eacute;rifiez que vous avez accord&eacute; les droits appropri&eacute;s pour toutes les applications. Vous pouvez d&eacute;sactiver le gestionnaire de s&eacute;curit&eacute; pour am&eacute;liorer les performances. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Cochez la case Journalisation d'audit activ&eacute;e pour activer la journalisation d'audit.</p>
<p>Si cette option est activ&eacute;e, le serveur charge et ex&eacute;cute tous les modules d'audit s&eacute;lectionn&eacute;s dans la liste Modules d'audit. Si cette option n'est pas activ&eacute;e, le serveur n'acc&egrave;de pas aux modules d'audit. Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Domaine par d&eacute;faut, s&eacute;lectionnez le domaine actif que le serveur utilisera pour l'authentification.</p>
<p>Les applications utiliseront ce domaine sauf indication contraire de leur descripteur de d&eacute;ploiement. Tous les domaines configur&eacute;s apparaissent dans la liste. La valeur par d&eacute;faut est <code>file</code>.</p>
</li>
<li>
<p>Indiquez les informations du principal par d&eacute;faut.</p>
<ol type="a">
<li>
<p>Dans le champ Principal par d&eacute;faut, saisissez le nom de l'utilisateur par d&eacute;faut.</p>
<p>Le serveur emploie ce nom utilisateur lorsque aucun autre principal n'est fourni.</p>
</li>
<li>
<p>Dans le champ Mot de passe du principal par d&eacute;faut, saisissez le mot de passe du principal par d&eacute;faut indiqu&eacute; dans le champ Principal par d&eacute;faut.</p>
</li>
</ol>
<p>Aucun principal par d&eacute;faut n'est requis pour un fonctionnement normal du serveur.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante JACC, s&eacute;lectionnez le nom d'un fournisseur JACC configur&eacute;.</p>
<p>Les choix par d&eacute;faut sont <code>default</code> et <code>simple</code>. L'option par d&eacute;faut est <code>default</code>. Pour plus d'informations sur la cr&eacute;ation de fournisseurs JACC, reportez-vous &agrave; ***.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante Modules d'audit, s&eacute;lectionnez les modules de fournisseur d'audit qui seront utilis&eacute;s par le sous-syst&egrave;me d'audit si la journalisation d'audit est activ&eacute;e.</p>
<p>Par d&eacute;faut, le serveur utilise un module d'audit nomm&eacute; <code>default</code>. Pour plus d'informations sur la cr&eacute;ation de modules d'audit, reportez-vous &agrave; <a href="task-auditmodulenew.html">Cr&eacute;ation d'un module d'audit</a>.</p>
</li>
<li>
<p>Cochez la case Mise en correspondance par d&eacute;faut des principaux avec des r&ocirc;les activ&eacute;e pour appliquer une correspondance principal-r&ocirc;le par d&eacute;faut &agrave; des applications qui ne poss&egrave;dent pas de correspondance propre.</p>
</li>
<li>
<p>Si vous avez activ&eacute; la correspondance principal-r&ocirc;le par d&eacute;faut, dans le champ Classe de principal mise en correspondance, saisissez le nom d'une classe d'impl&eacute;mentation <code>java.security.Principal</code> personnalis&eacute;e &agrave; utiliser dans la correspondance principal-r&ocirc;le par d&eacute;faut.</p>
</li>
<li>
<p>Dans la section Autres propri&eacute;t&eacute;s, sp&eacute;cifiez les propri&eacute;t&eacute;s suppl&eacute;mentaires.</p>
<p>Les propri&eacute;t&eacute;s valides d&eacute;pendent du type de domaine s&eacute;lectionn&eacute; dans le champ Domaine par d&eacute;faut. Dans la liste ci-dessous, reportez-vous &agrave; l'entr&eacute;e appropri&eacute;e pour le type de domaine &agrave; configurer.</p>
<ul>
<li>
<p><a href="ref-editfile-adminrealm.html">Propri&eacute;t&eacute;s propres &agrave; la classe <code>FileRealm</code></a></p>
</li>
<li>
<p><a href="ref-editcertrealm.html">Propri&eacute;t&eacute;s propres &agrave; la classe <code>CertificateRealm</code></a></p>
</li>
<li>
<p><a href="ref-editjdbcrealm.html">Propri&eacute;t&eacute;s propres &agrave; la classe <code>JDBCRealm</code></a></p>
</li>
<li>
<p><a href="ref-ldaprealmprop.html">Propri&eacute;t&eacute;s propres &agrave; la classe <code>LDAPRealm</code></a></p>
</li>
<li>
<p><a href="ref-solarisrealmprop.html">Propri&eacute;t&eacute;s propres &agrave; la classe <code>SolarisRealm</code></a></p>
</li>
<li>
<p><a href="ref-pamrealmprop.html">Propri&eacute;t&eacute;s propres &agrave; la classe <code>PamRealm</code></a></p>
</li>
</ul>
<ul>
<li>
<p>Pour ajouter une propri&eacute;t&eacute;, cliquez sur le bouton Ajouter une propri&eacute;t&eacute;. Sur la ligne vide qui appara&icirc;t, saisissez le nom de la propri&eacute;t&eacute; dans le champ Nom et la valeur de la propri&eacute;t&eacute; dans le champ Valeur.</p>
</li>
<li>
<p>Pour modifier une propri&eacute;t&eacute;, modifiez le champ Valeur de cette propri&eacute;t&eacute;.</p>
</li>
<li>
<p>Pour supprimer une propri&eacute;t&eacute;, s&eacute;lectionnez la case situ&eacute;e &agrave; gauche du champ Nom de la propri&eacute;t&eacute; &agrave; supprimer, puis cliquez sur le bouton Supprimer des propri&eacute;t&eacute;s.</p>
</li>
</ul>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>
</li>
</ol>
<a id="sthref128" name="sthref128"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-accessadmintools.html">Octroi d'un acc&egrave;s aux outils d'administration</a></p>
</li>
<li>
<p><a href="task-changeadminpasswd.html">Modification du mot de passe d'un utilisateur dans le domaine d'administration</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
