<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-ejbgeneral" name="ref-ejbgeneral"></a></p>

<h4><a id="sthref5" name="sthref5"></a><a id="sthref6" name="sthref6"></a>Enterprise Java Beans (EJB)</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>EJB&#12467;&#12531;&#12486;&#12490;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;Enterprise Java Beans (EJB)&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;Bean&#12398;&#19968;&#33324;&#35373;&#23450;&#12398;&#20182;&#12395;&#12289;&#12503;&#12540;&#12523;&#35373;&#23450;&#12392;&#12461;&#12515;&#12483;&#12471;&#12517;&#35373;&#23450;&#12434;&#27083;&#25104;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#12503;&#12540;&#12523;&#35373;&#23450;&#12399;&#12289;&#12473;&#12486;&#12540;&#12488;&#12524;&#12473;&#12539;&#12475;&#12483;&#12471;&#12519;&#12531;Bean&#12395;&#12398;&#12415;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12522;&#12463;&#12456;&#12473;&#12488;&#12395;&#24540;&#31572;&#12377;&#12427;&#38555;&#12395;Bean&#12398;&#20316;&#25104;&#12395;&#12424;&#12387;&#12390;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12364;&#20302;&#19979;&#12375;&#12394;&#12356;&#12424;&#12358;&#12395;&#12289;&#12467;&#12531;&#12486;&#12490;&#12399;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;Bean&#12398;&#12503;&#12540;&#12523;&#12434;&#20445;&#25345;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12503;&#12525;&#12452;&#28168;&#12398;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;Bean&#12434;&#20351;&#29992;&#12377;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12395;&#21839;&#38988;&#12364;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;&#12503;&#12540;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#12363;&#12289;&#26082;&#23384;&#12398;&#12503;&#12540;&#12523;&#12395;&#20445;&#25345;&#12373;&#12428;&#12427;Bean&#12398;&#25968;&#12434;&#22679;&#12420;&#12377;&#12371;&#12392;&#12391;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12434;&#21521;&#19978;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12461;&#12515;&#12483;&#12471;&#12517;&#35373;&#23450;&#12399;&#12289;&#12473;&#12486;&#12540;&#12488;&#12501;&#12523;&#12539;&#12475;&#12483;&#12471;&#12519;&#12531;Bean&#12395;&#12398;&#12415;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12467;&#12531;&#12486;&#12490;&#12399;&#12289;&#26368;&#12418;&#20351;&#29992;&#12373;&#12428;&#12427;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;Bean&#12395;&#23550;&#12375;&#12390;&#12289;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;Bean&#12487;&#12540;&#12479;&#12398;&#12461;&#12515;&#12483;&#12471;&#12517;&#12434;&#20445;&#25345;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12395;&#12424;&#12426;&#12289;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;Bean&#12398;&#12487;&#12540;&#12479;&#12395;&#23550;&#12377;&#12427;&#20182;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12514;&#12472;&#12517;&#12540;&#12523;&#12363;&#12425;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12395;&#12289;&#12467;&#12531;&#12486;&#12490;&#12399;&#12424;&#12426;&#39640;&#36895;&#12395;&#24540;&#31572;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<p>&#12461;&#12515;&#12483;&#12471;&#12517;&#12373;&#12428;&#12383;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;Bean&#12399;&#12289;&#12450;&#12463;&#12486;&#12451;&#12502;&#12289;&#12450;&#12452;&#12489;&#12523;&#12289;&#12362;&#12424;&#12403;&#38750;&#27963;&#24615;&#21270;&#12398;&#12356;&#12378;&#12428;&#12363;&#12398;&#29366;&#24907;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12450;&#12463;&#12486;&#12451;&#12502;&#12394;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;Bean&#12399;&#12289;&#29694;&#22312;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12363;&#12425;&#12450;&#12463;&#12475;&#12473;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12450;&#12452;&#12489;&#12523;&#12394;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;Bean&#12398;&#12487;&#12540;&#12479;&#12399;&#29694;&#22312;&#12461;&#12515;&#12483;&#12471;&#12517;&#12395;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12399;Bean&#12395;&#12450;&#12463;&#12475;&#12473;&#12375;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#38750;&#27963;&#24615;&#21270;&#12373;&#12428;&#12383;Bean&#12398;&#12487;&#12540;&#12479;&#12399;&#19968;&#26178;&#30340;&#12395;&#20445;&#31649;&#12373;&#12428;&#12289;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12364;Bean&#12434;&#12522;&#12463;&#12456;&#12473;&#12488;&#12375;&#12383;&#12392;&#12365;&#12395;&#12461;&#12515;&#12483;&#12471;&#12517;&#12395;&#35501;&#12415;&#12394;&#12362;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
</ul>
<p>&#12300;Enterprise Java Beans (EJB)&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12489;</dt>
<dd>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12354;&#12427;&#35373;&#23450;&#12434;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12395;&#24489;&#20803;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12394;&#12356;&#35373;&#23450;&#12399;&#22793;&#26356;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>&#27083;&#25104;&#21517;</dt>
<dd>
<p>&#12371;&#12398;&#12506;&#12540;&#12472;&#12398;&#35373;&#23450;&#12364;&#36969;&#29992;&#12373;&#12428;&#12427;&#27083;&#25104;&#12398;&#21517;&#21069;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12475;&#12483;&#12471;&#12519;&#12531;&#26684;&#32013;&#20301;&#32622;</dt>
<dd>
<p>&#38750;&#27963;&#24615;&#21270;&#12373;&#12428;&#12383;&#12473;&#12486;&#12540;&#12488;&#12501;&#12523;&#12539;&#12475;&#12483;&#12471;&#12519;&#12531;Bean&#12392;&#25345;&#32154;HTTP&#12475;&#12483;&#12471;&#12519;&#12531;&#12364;&#26684;&#32013;&#12373;&#12428;&#12427;&#12289;&#12501;&#12449;&#12452;&#12523;&#12539;&#12471;&#12473;&#12486;&#12512;&#19978;&#12398;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>${com.sun.aas.instanceRoot}/session-store</code>&#12391;&#12377;&#12290;</p>
<p>&#38750;&#27963;&#24615;&#21270;&#12373;&#12428;&#12383;Bean&#12399;&#12289;&#29366;&#24907;&#12364;&#12501;&#12449;&#12452;&#12523;&#12539;&#12471;&#12473;&#12486;&#12512;&#19978;&#12398;&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#36796;&#12414;&#12428;&#12390;&#12356;&#12427;&#12473;&#12486;&#12540;&#12488;&#12501;&#12523;&#12539;&#12475;&#12483;&#12471;&#12519;&#12531;Bean&#12391;&#12377;&#12290;&#38750;&#27963;&#24615;&#21270;&#12373;&#12428;&#12383;Beans&#12399;&#12289;&#36890;&#24120;&#29305;&#23450;&#12398;&#26178;&#38291;&#20869;&#12398;&#12450;&#12452;&#12489;&#12523;&#29366;&#24907;&#12395;&#12354;&#12426;&#12289;&#29694;&#22312;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12395;&#12424;&#12387;&#12390;&#12450;&#12463;&#12475;&#12473;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#21516;&#27096;&#12395;&#12289;&#25345;&#32154;&#30340;&#12394;HTTP&#12475;&#12483;&#12471;&#12519;&#12531;&#12399;&#12501;&#12449;&#12452;&#12523;&#12539;&#12471;&#12473;&#12486;&#12512;&#19978;&#12398;&#12501;&#12449;&#12452;&#12523;&#12395;&#29366;&#24907;&#12434;&#26360;&#12365;&#36796;&#12414;&#12428;&#12383;&#20491;&#21029;&#12398;Web&#12475;&#12483;&#12471;&#12519;&#12531;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12467;&#12511;&#12483;&#12488;&#12539;&#12458;&#12503;&#12471;&#12519;&#12531;</dt>
<dd>
<p>&#12467;&#12531;&#12486;&#12490;&#12364;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#38291;&#12391;&#38750;&#27963;&#24615;&#21270;&#12373;&#12428;&#12383;Bean&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#12461;&#12515;&#12483;&#12471;&#12517;&#12377;&#12427;&#26041;&#27861;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12300;&#12458;&#12503;&#12471;&#12519;&#12531;B&#12301;(&#12487;&#12501;&#12457;&#12523;&#12488;)&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12467;&#12531;&#12486;&#12490;&#12399;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#38291;&#12391;&#28310;&#20633;&#23436;&#20102;&#29366;&#24907;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#12461;&#12515;&#12483;&#12471;&#12517;&#12375;&#12414;&#12377;&#12290;&#12300;&#12458;&#12503;&#12471;&#12519;&#12531;C&#12301;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12467;&#12531;&#12486;&#12490;&#12399;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#38291;&#12391;&#28310;&#20633;&#23436;&#20102;&#29366;&#24907;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#12461;&#12515;&#12483;&#12471;&#12517;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>&#21021;&#26399;&#12362;&#12424;&#12403;&#26368;&#23567;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;</dt>
<dd>
<p>&#12503;&#12540;&#12523;&#12395;&#20445;&#25345;&#12373;&#12428;&#12427;Bean&#12398;&#26368;&#23567;&#25968;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;0&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;</dt>
<dd>
<p>&#12467;&#12531;&#12486;&#12490;&#12364;&#12503;&#12540;&#12523;&#12395;&#19968;&#24230;&#12395;&#20445;&#25345;&#12391;&#12365;&#12427;Bean&#12398;&#26368;&#22823;&#25968;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;32&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;&#22793;&#26356;&#37327;</dt>
<dd>
<p>&#12450;&#12452;&#12489;&#12523;&#29366;&#24907;&#12398;&#32153;&#32154;&#26178;&#38291;&#12364;&#12300;&#12503;&#12540;&#12523;&#12539;&#12450;&#12452;&#12489;&#12523;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#25351;&#23450;&#12375;&#12383;&#26178;&#38291;&#12434;&#36229;&#12360;&#12383;&#22580;&#21512;&#12395;&#12289;&#12503;&#12540;&#12523;&#12363;&#12425;&#38500;&#21435;&#12373;&#12428;&#12427;Bean&#12398;&#25968;&#12290;&#20516;&#12399;0&#20197;&#19978;&#12391;&#12289;&#12300;&#26368;&#22823;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;&#12301;&#12398;&#20516;&#26410;&#28288;&#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;8&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12503;&#12540;&#12523;&#12539;&#12450;&#12452;&#12489;&#12523;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;</dt>
<dd>
<p>&#12503;&#12540;&#12523;&#20013;&#12398;Bean&#12364;&#12289;&#12503;&#12540;&#12523;&#12363;&#12425;&#38500;&#21435;&#12373;&#12428;&#12427;&#12414;&#12391;&#12395;&#12450;&#12452;&#12489;&#12523;&#29366;&#24907;&#12434;&#32173;&#25345;&#12391;&#12365;&#12427;&#26178;&#38291;(&#31186;&#21336;&#20301;)&#12290;&#12371;&#12398;&#26178;&#38291;&#12364;&#32076;&#36942;&#12377;&#12427;&#12392;&#12289;Bean&#12399;&#30772;&#26820;&#12373;&#12428;&#12414;&#12377;&#12290;0&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;Bean&#12399;&#21046;&#38480;&#12394;&#12367;&#12450;&#12452;&#12489;&#12523;&#29366;&#24907;&#12434;&#32173;&#25345;&#12391;&#12365;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;600&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#12461;&#12515;&#12483;&#12471;&#12517;&#12539;&#12469;&#12452;&#12474;</dt>
<dd>
<p>&#12461;&#12515;&#12483;&#12471;&#12517;&#12395;&#20445;&#25345;&#12373;&#12428;&#12427;Bean&#12398;&#26368;&#22823;&#25968;&#12290;Bean&#12398;&#20316;&#25104;&#12392;&#30772;&#26820;&#12398;&#12458;&#12540;&#12496;&#12540;&#12504;&#12483;&#12489;&#12434;&#12394;&#12367;&#12377;&#12383;&#12417;&#12395;&#12289;&#12461;&#12515;&#12483;&#12471;&#12517;&#12377;&#12427;Beans&#12398;&#26368;&#22823;&#25968;&#12434;&#22823;&#12365;&#12367;&#12375;&#12414;&#12377;&#12290;&#12383;&#12384;&#12375;&#12289;&#12461;&#12515;&#12483;&#12471;&#12517;&#12434;&#22823;&#12365;&#12367;&#12375;&#12383;&#22580;&#21512;&#12289;&#12469;&#12540;&#12496;&#12540;&#12399;&#12424;&#12426;&#22823;&#12365;&#12394;&#12513;&#12514;&#12522;&#12540;&#12392;&#12522;&#12477;&#12540;&#12473;&#12434;&#28040;&#36027;&#12375;&#12414;&#12377;&#12290;&#12461;&#12515;&#12483;&#12471;&#12517;&#35373;&#23450;&#12395;&#23550;&#12375;&#12390;&#21205;&#20316;&#29872;&#22659;&#12364;&#21313;&#20998;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;0&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12461;&#12515;&#12483;&#12471;&#12517;&#12398;&#21046;&#38480;&#12364;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;512&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12461;&#12515;&#12483;&#12471;&#12517;&#12539;&#12469;&#12452;&#12474;&#22793;&#26356;&#37327;</dt>
<dd>
<p>&#12461;&#12515;&#12483;&#12471;&#12517;&#12364;&#12501;&#12523;&#12398;&#12392;&#12365;&#12395;&#38750;&#27963;&#24615;&#21270;&#12373;&#12428;&#12427;Bean&#12398;&#25968;&#12290;&#12461;&#12515;&#12483;&#12471;&#12517;&#12373;&#12428;&#12383;Bean&#12398;&#25968;&#12364;&#26368;&#22823;&#25968;&#12395;&#36948;&#12377;&#12427;&#12392;&#12289;&#12467;&#12531;&#12486;&#12490;&#12399;&#35079;&#25968;&#12398;&#38750;&#27963;&#24615;&#21270;Bean&#12434;&#12496;&#12483;&#12463;&#12450;&#12483;&#12503;&#12539;&#12473;&#12488;&#12450;&#12363;&#12425;&#38500;&#21435;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#20516;&#12399;&#12289;&#12503;&#12540;&#12523;&#12395;&#20351;&#29992;&#21487;&#33021;&#12394;Bean&#12364;&#12394;&#12356;&#12392;&#12365;&#12395;&#12522;&#12463;&#12456;&#12473;&#12488;&#12364;&#23626;&#12356;&#12383;&#22580;&#21512;&#12398;&#12289;&#20316;&#25104;&#12373;&#12428;&#12427;Bean&#12398;&#25968;&#12418;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#20516;&#12399;1&#12424;&#12426;&#22823;&#12365;&#12367;&#12289;&#12300;&#26368;&#22823;&#12461;&#12515;&#12483;&#12471;&#12517;&#12539;&#12469;&#12452;&#12474;&#12301;&#12398;&#20516;&#26410;&#28288;&#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;32&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#21066;&#38500;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;</dt>
<dd>
<p>&#38750;&#27963;&#24615;&#21270;&#12373;&#12428;&#12383;Bean&#12364;&#12475;&#12483;&#12471;&#12519;&#12531;&#12539;&#12473;&#12488;&#12450;&#12363;&#12425;&#38500;&#21435;&#12373;&#12428;&#12427;&#12414;&#12391;&#12398;&#26178;&#38291;(&#31186;&#21336;&#20301;)&#12290;0&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12467;&#12531;&#12486;&#12490;&#12399;&#38750;&#12450;&#12463;&#12486;&#12451;&#12502;&#12394;Bean&#12434;&#33258;&#21205;&#30340;&#12395;&#38500;&#21435;&#12375;&#12414;&#12379;&#12435;&#12290;&#12300;&#38500;&#21435;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12301;&#12398;&#20516;&#12364;&#12300;&#12461;&#12515;&#12483;&#12471;&#12517;&#12539;&#12450;&#12452;&#12489;&#12523;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12301;&#12398;&#20516;&#20197;&#19979;&#12398;&#22580;&#21512;&#12289;Bean&#12399;&#38750;&#27963;&#24615;&#21270;&#12373;&#12428;&#12378;&#12395;&#12377;&#12368;&#12395;&#38500;&#21435;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;5400&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#36984;&#25246;&#20869;&#23481;&#12398;&#38500;&#21435;&#12509;&#12522;&#12471;&#12540;</dt>
<dd>
<p>&#12473;&#12486;&#12540;&#12488;&#12501;&#12523;&#12539;&#12475;&#12483;&#12471;&#12519;&#12531;Bean&#12434;&#12461;&#12515;&#12483;&#12471;&#12517;&#12363;&#12425;&#38500;&#21435;&#12377;&#12427;&#12392;&#12365;&#12395;&#12289;&#12467;&#12531;&#12486;&#12490;&#12364;&#20351;&#29992;&#12377;&#12427;&#12509;&#12522;&#12471;&#12540;&#12290;&#27425;&#12398;&#12509;&#12522;&#12471;&#12540;&#12434;&#36984;&#25246;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#26368;&#36817;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;(NRU)</dt>
<dd>
<p>&#26368;&#36817;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;Bean&#12434;&#38500;&#21435;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#20516;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12501;&#12449;&#12540;&#12473;&#12488;&#12539;&#12452;&#12531;&#12539;&#12501;&#12449;&#12540;&#12473;&#12488;&#12539;&#12450;&#12454;&#12488;(FIFO)</dt>
<dd>
<p>&#12461;&#12515;&#12483;&#12471;&#12517;&#12391;&#26368;&#12418;&#21476;&#12356;Bean&#12434;&#38500;&#21435;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#26368;&#36817;&#12398;&#20351;&#29992;&#38971;&#24230;&#12364;&#26368;&#12418;&#20302;&#12356;(LRU)</dt>
<dd>
<p>&#26368;&#36817;&#12398;&#12450;&#12463;&#12475;&#12473;&#38971;&#24230;&#12364;&#26368;&#12418;&#20302;&#12356;Bean&#12434;&#38500;&#21435;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
</dd>
<dt>&#12461;&#12515;&#12483;&#12471;&#12517;&#12539;&#12450;&#12452;&#12489;&#12523;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;</dt>
<dd>
<p>&#12461;&#12515;&#12483;&#12471;&#12517;&#20013;&#12398;Bean&#12364;&#12450;&#12452;&#12489;&#12523;&#29366;&#24907;&#12434;&#32173;&#25345;&#12391;&#12365;&#12427;&#26368;&#22823;&#26178;&#38291;(&#31186;&#21336;&#20301;)&#12371;&#12398;&#26178;&#38291;&#12364;&#32076;&#36942;&#12377;&#12427;&#12392;&#12289;&#12467;&#12531;&#12486;&#12490;&#12399;Bean&#12434;&#38750;&#27963;&#24615;&#21270;&#12391;&#12365;&#12414;&#12377;&#12290;0&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;Bean&#12399;&#38750;&#27963;&#24615;&#21270;&#12398;&#20505;&#35036;&#12395;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;600&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;</dt>
<dd>
<p>EJB&#12467;&#12531;&#12486;&#12490;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12290;</p>
<p>&#20351;&#29992;&#21487;&#33021;&#12394;&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a href="ref-ejbgeneralproperties.html">EJB&#12467;&#12531;&#12486;&#12490;&#12395;&#22266;&#26377;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</dd>
</dl>
<a id="sthref7" name="sthref7"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-ejbgeneral.html">EJB&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbmdbpoolsettings.html">MDB&#12503;&#12540;&#12523;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbtimerservice.html">EJB&#12479;&#12452;&#12510;&#12540;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbcontaineravailability.html">EJB&#12467;&#12531;&#12486;&#12490;&#12398;&#21487;&#29992;&#24615;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref8" name="sthref8"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<p>&#12394;&#12375;&#12290;</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
