<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-ejbgeneral" name="task-ejbgeneral"></a></p>

<h4><a id="sthref2" name="sthref2"></a><a id="sthref3" name="sthref3"></a>EJB&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;EJB&#12467;&#12531;&#12486;&#12490;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;Enterprise Java Beans (EJB)&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12475;&#12483;&#12471;&#12519;&#12531;&#26684;&#32013;&#20301;&#32622;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12475;&#12483;&#12471;&#12519;&#12531;&#26684;&#32013;&#20301;&#32622;&#12398;&#26032;&#12375;&#12356;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#12289;&#38750;&#27963;&#24615;&#21270;&#12373;&#12428;&#12383;&#12473;&#12486;&#12540;&#12488;&#12501;&#12523;&#12539;&#12475;&#12483;&#12471;&#12519;&#12531;Bean&#12392;&#25345;&#32154;SFSB&#12481;&#12455;&#12483;&#12463;&#12509;&#12452;&#12531;&#12488;&#29366;&#24907;&#12364;&#26684;&#32013;&#12373;&#12428;&#12427;&#12289;&#12501;&#12449;&#12452;&#12523;&#12539;&#12471;&#12473;&#12486;&#12512;&#19978;&#12398;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>${com.sun.aas.instanceRoot}/session-store</code>&#12391;&#12377;&#12290;</p>
<p>&#38750;&#27963;&#24615;&#21270;&#12373;&#12428;&#12383;Bean&#12399;&#12289;&#29366;&#24907;&#12364;&#12501;&#12449;&#12452;&#12523;&#12539;&#12471;&#12473;&#12486;&#12512;&#19978;&#12398;&#12501;&#12449;&#12452;&#12523;&#12395;&#26360;&#12365;&#36796;&#12414;&#12428;&#12390;&#12356;&#12427;&#12473;&#12486;&#12540;&#12488;&#12501;&#12523;&#12539;&#12475;&#12483;&#12471;&#12519;&#12531;Bean&#12391;&#12377;&#12290;&#38750;&#27963;&#24615;&#21270;&#12373;&#12428;&#12383;Beans&#12399;&#12289;&#36890;&#24120;&#29305;&#23450;&#12398;&#26178;&#38291;&#20869;&#12398;&#12450;&#12452;&#12489;&#12523;&#29366;&#24907;&#12395;&#12354;&#12426;&#12289;&#29694;&#22312;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12395;&#12424;&#12387;&#12390;&#12450;&#12463;&#12475;&#12473;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;&#21516;&#27096;&#12395;&#12289;&#25345;&#32154;&#30340;&#12394;SFSB&#12481;&#12455;&#12483;&#12463;&#12509;&#12452;&#12531;&#12488;&#29366;&#24907;&#12399;&#12501;&#12449;&#12452;&#12523;&#12539;&#12471;&#12473;&#12486;&#12512;&#19978;&#12398;&#12501;&#12449;&#12452;&#12523;&#12395;&#29366;&#24907;&#12434;&#26360;&#12365;&#36796;&#12414;&#12428;&#12383;&#20491;&#21029;&#12398;SFSB&#12391;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#35373;&#23450;&#12399;&#12289;EJB&#12467;&#12531;&#12486;&#12490;&#12398;&#21487;&#29992;&#24615;&#12364;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#12289;SFSB&#12481;&#12455;&#12483;&#12463;&#12509;&#12452;&#12531;&#12488;&#29366;&#24907;&#12395;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#21487;&#29992;&#24615;&#12434;&#28961;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;<a href="../../../ejb/en/help/task-ejbcontaineravailability.html">EJB&#12467;&#12531;&#12486;&#12490;&#12398;&#21487;&#29992;&#24615;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a>&#12301;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
<li>
<p>&#12300;&#12458;&#12503;&#12471;&#12519;&#12531;B&#12301;&#12414;&#12383;&#12399;&#12300;&#12458;&#12503;&#12471;&#12519;&#12531;C&#12301;&#12398;&#12521;&#12472;&#12458;&#12539;&#12508;&#12479;&#12531;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#12300;&#12467;&#12511;&#12483;&#12488;&#12539;&#12458;&#12503;&#12471;&#12519;&#12531;&#12301;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12467;&#12511;&#12483;&#12488;&#12539;&#12458;&#12503;&#12471;&#12519;&#12531;&#12301;&#12391;&#12399;&#12289;&#12467;&#12531;&#12486;&#12490;&#12364;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#38291;&#12391;&#38750;&#27963;&#24615;&#21270;&#12373;&#12428;&#12383;Bean&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#12461;&#12515;&#12483;&#12471;&#12517;&#12377;&#12427;&#26041;&#27861;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#12300;&#12458;&#12503;&#12471;&#12519;&#12531;B&#12301;(&#12487;&#12501;&#12457;&#12523;&#12488;)&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12467;&#12531;&#12486;&#12490;&#12399;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#38291;&#12391;&#28310;&#20633;&#23436;&#20102;&#29366;&#24907;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#12461;&#12515;&#12483;&#12471;&#12517;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12458;&#12503;&#12471;&#12519;&#12531;C&#12301;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12467;&#12531;&#12486;&#12490;&#12399;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#38291;&#12391;&#28310;&#20633;&#23436;&#20102;&#29366;&#24907;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#12461;&#12515;&#12483;&#12471;&#12517;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#21021;&#26399;&#12362;&#12424;&#12403;&#26368;&#23567;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12503;&#12540;&#12523;&#12395;&#20445;&#25345;&#12373;&#12428;&#12427;Bean&#12398;&#26368;&#23567;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;0&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26368;&#22823;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12467;&#12531;&#12486;&#12490;&#12364;&#12503;&#12540;&#12523;&#12395;&#19968;&#24230;&#12395;&#20445;&#25345;&#12391;&#12365;&#12427;Bean&#12398;&#26368;&#22823;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;32&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;&#22793;&#26356;&#37327;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12450;&#12452;&#12489;&#12523;&#29366;&#24907;&#12398;&#32153;&#32154;&#26178;&#38291;&#12364;&#12300;&#12503;&#12540;&#12523;&#12539;&#12450;&#12452;&#12489;&#12523;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#25351;&#23450;&#12375;&#12383;&#26178;&#38291;&#12434;&#36229;&#12360;&#12383;&#22580;&#21512;&#12395;&#12289;&#12503;&#12540;&#12523;&#12363;&#12425;&#38500;&#21435;&#12373;&#12428;&#12427;Bean&#12398;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#20516;&#12399;0&#20197;&#19978;&#12391;&#12289;&#12300;&#26368;&#22823;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;&#12301;&#12398;&#20516;&#26410;&#28288;&#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;8&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12503;&#12540;&#12523;&#12539;&#12450;&#12452;&#12489;&#12523;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12503;&#12540;&#12523;&#20013;&#12398;Bean&#12364;&#12289;&#12503;&#12540;&#12523;&#12363;&#12425;&#38500;&#21435;&#12373;&#12428;&#12427;&#12414;&#12391;&#12395;&#12450;&#12452;&#12489;&#12523;&#29366;&#24907;&#12434;&#32173;&#25345;&#12391;&#12365;&#12427;&#26178;&#38291;&#12434;&#31186;&#21336;&#20301;&#12391;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#26178;&#38291;&#12364;&#32076;&#36942;&#12377;&#12427;&#12392;&#12289;Bean&#12399;&#30772;&#26820;&#12373;&#12428;&#12414;&#12377;&#12290;0&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;Bean&#12399;&#21046;&#38480;&#12394;&#12367;&#12450;&#12452;&#12489;&#12523;&#29366;&#24907;&#12434;&#32173;&#25345;&#12391;&#12365;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;600&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26368;&#22823;&#12461;&#12515;&#12483;&#12471;&#12517;&#12539;&#12469;&#12452;&#12474;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12461;&#12515;&#12483;&#12471;&#12517;&#12395;&#20445;&#25345;&#12373;&#12428;&#12427;Bean&#12398;&#26368;&#22823;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>Bean&#12398;&#20316;&#25104;&#12392;&#30772;&#26820;&#12398;&#12458;&#12540;&#12496;&#12540;&#12504;&#12483;&#12489;&#12434;&#12394;&#12367;&#12377;&#12383;&#12417;&#12395;&#12289;&#12461;&#12515;&#12483;&#12471;&#12517;&#12377;&#12427;Beans&#12398;&#26368;&#22823;&#25968;&#12434;&#22823;&#12365;&#12367;&#12375;&#12414;&#12377;&#12290;&#12383;&#12384;&#12375;&#12289;&#12461;&#12515;&#12483;&#12471;&#12517;&#12434;&#22823;&#12365;&#12367;&#12375;&#12383;&#22580;&#21512;&#12289;&#12469;&#12540;&#12496;&#12540;&#12399;&#12424;&#12426;&#22823;&#12365;&#12394;&#12513;&#12514;&#12522;&#12540;&#12392;&#12522;&#12477;&#12540;&#12473;&#12434;&#28040;&#36027;&#12375;&#12414;&#12377;&#12290;&#12461;&#12515;&#12483;&#12471;&#12517;&#35373;&#23450;&#12395;&#23550;&#12375;&#12390;&#21205;&#20316;&#29872;&#22659;&#12364;&#21313;&#20998;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;0&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12461;&#12515;&#12483;&#12471;&#12517;&#12398;&#21046;&#38480;&#12364;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;512&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12461;&#12515;&#12483;&#12471;&#12517;&#12539;&#12469;&#12452;&#12474;&#22793;&#26356;&#37327;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12461;&#12515;&#12483;&#12471;&#12517;&#12364;&#12501;&#12523;&#12398;&#12392;&#12365;&#12395;&#38750;&#27963;&#24615;&#21270;&#12377;&#12427;Bean&#12398;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12461;&#12515;&#12483;&#12471;&#12517;&#12373;&#12428;&#12383;Bean&#12398;&#25968;&#12364;&#26368;&#22823;&#25968;&#12395;&#36948;&#12377;&#12427;&#12392;&#12289;&#12467;&#12531;&#12486;&#12490;&#12399;&#35079;&#25968;&#12398;&#38750;&#27963;&#24615;&#21270;Bean&#12434;&#12496;&#12483;&#12463;&#12450;&#12483;&#12503;&#12539;&#12473;&#12488;&#12450;&#12363;&#12425;&#38500;&#21435;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#20516;&#12399;&#12289;&#12503;&#12540;&#12523;&#12395;&#20351;&#29992;&#21487;&#33021;&#12394;Bean&#12364;&#12394;&#12356;&#12392;&#12365;&#12395;&#12522;&#12463;&#12456;&#12473;&#12488;&#12364;&#23626;&#12356;&#12383;&#22580;&#21512;&#12398;&#12289;&#20316;&#25104;&#12373;&#12428;&#12427;Bean&#12398;&#25968;&#12418;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#20516;&#12399;1&#12424;&#12426;&#22823;&#12365;&#12367;&#12289;&#12300;&#26368;&#22823;&#12461;&#12515;&#12483;&#12471;&#12517;&#12539;&#12469;&#12452;&#12474;&#12301;&#12398;&#20516;&#26410;&#28288;&#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;32&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#38500;&#21435;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#38750;&#27963;&#24615;&#21270;&#12373;&#12428;&#12383;Bean&#12364;&#12475;&#12483;&#12471;&#12519;&#12531;&#12539;&#12473;&#12488;&#12450;&#12363;&#12425;&#38500;&#21435;&#12373;&#12428;&#12427;&#12414;&#12391;&#12398;&#26178;&#38291;&#12434;&#31186;&#21336;&#20301;&#12391;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>0&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12467;&#12531;&#12486;&#12490;&#12399;&#38750;&#12450;&#12463;&#12486;&#12451;&#12502;&#12394;Bean&#12434;&#33258;&#21205;&#30340;&#12395;&#38500;&#21435;&#12375;&#12414;&#12379;&#12435;&#12290;&#12300;&#38500;&#21435;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12301;&#12398;&#20516;&#12364;&#12300;&#12461;&#12515;&#12483;&#12471;&#12517;&#12539;&#12450;&#12452;&#12489;&#12523;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12301;&#12398;&#20516;&#20197;&#19979;&#12398;&#22580;&#21512;&#12289;Bean&#12399;&#38750;&#27963;&#24615;&#21270;&#12373;&#12428;&#12378;&#12395;&#12377;&#12368;&#12395;&#38500;&#21435;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;5400&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#36984;&#25246;&#20869;&#23481;&#12398;&#38500;&#21435;&#12509;&#12522;&#12471;&#12540;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#12467;&#12531;&#12486;&#12490;&#12364;&#12473;&#12486;&#12540;&#12488;&#12501;&#12523;&#12539;&#12475;&#12483;&#12471;&#12519;&#12531;Bean&#12434;&#12461;&#12515;&#12483;&#12471;&#12517;&#12363;&#12425;&#38500;&#21435;&#12377;&#12427;&#38555;&#12395;&#20351;&#29992;&#12377;&#12427;&#12509;&#12522;&#12471;&#12540;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#27425;&#12398;&#12509;&#12522;&#12471;&#12540;&#12434;&#36984;&#25246;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#26368;&#36817;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;(NRU)</dt>
<dd>
<p>(&#12487;&#12501;&#12457;&#12523;&#12488;)&#26368;&#36817;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;Bean&#12434;&#38500;&#21435;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12501;&#12449;&#12540;&#12473;&#12488;&#12539;&#12452;&#12531;&#12539;&#12501;&#12449;&#12540;&#12473;&#12488;&#12539;&#12450;&#12454;&#12488;(FIFO)</dt>
<dd>
<p>&#12461;&#12515;&#12483;&#12471;&#12517;&#12391;&#26368;&#12418;&#21476;&#12356;Bean&#12434;&#38500;&#21435;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#26368;&#36817;&#12398;&#20351;&#29992;&#38971;&#24230;&#12364;&#26368;&#12418;&#20302;&#12356;(LRU)</dt>
<dd>
<p>&#26368;&#36817;&#12398;&#12450;&#12463;&#12475;&#12473;&#38971;&#24230;&#12364;&#26368;&#12418;&#20302;&#12356;Bean&#12434;&#38500;&#21435;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
</li>
<li>
<p>&#12300;&#12461;&#12515;&#12483;&#12471;&#12517;&#12539;&#12450;&#12452;&#12489;&#12523;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;Bean&#12434;&#12461;&#12515;&#12483;&#12471;&#12517;&#12395;&#20445;&#25345;&#12391;&#12365;&#12427;&#26368;&#22823;&#26178;&#38291;&#12434;&#31186;&#21336;&#20301;&#12391;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#26178;&#38291;&#12364;&#32076;&#36942;&#12377;&#12427;&#12392;&#12289;&#12467;&#12531;&#12486;&#12490;&#12399;Bean&#12434;&#38750;&#27963;&#24615;&#21270;&#12391;&#12365;&#12414;&#12377;&#12290;0&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;Bean&#12399;&#38750;&#27963;&#24615;&#21270;&#12398;&#20505;&#35036;&#12395;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;600&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#12289;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#20351;&#29992;&#21487;&#33021;&#12394;&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a href="ref-ejbgeneralproperties.html">EJB&#12467;&#12531;&#12486;&#12490;&#12395;&#22266;&#26377;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<ul>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#34920;&#31034;&#12373;&#12428;&#12427;&#31354;&#30333;&#34892;&#12391;&#12289;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#21517;&#12434;&#20837;&#21147;&#12375;&#12289;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;&#12289;&#12381;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#32232;&#38598;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;&#12289;&#21066;&#38500;&#12377;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12398;&#24038;&#20596;&#12395;&#12354;&#12427;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21066;&#38500;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#12498;&#12531;&#12488;:</b></p>
&#12487;&#12501;&#12457;&#12523;&#12488;&#35373;&#23450;&#12395;&#36820;&#12377;&#12395;&#12399;&#12289;&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12489;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12289;&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;<br />
<hr>

</li>
<li>
<p>GlassFish Server&#12434;&#20877;&#36215;&#21205;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref4" name="sthref4"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="../../../ejb/en/help/task-ejbmdbpoolsettings.html">MDB&#12503;&#12540;&#12523;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbtimerservice.html">EJB&#12479;&#12452;&#12510;&#12540;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbcontaineravailability.html">EJB&#12467;&#12531;&#12486;&#12490;&#12398;&#21487;&#29992;&#24615;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>




<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
