<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterinstances" name="ref-clusterinstances"></a></p>

<h4><a id="sthref266" name="sthref266"></a><a id="sthref267" name="sthref267"></a>&#21474;&#38598;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&#12300;&#21474;&#38598;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#12301;&#38913;&#38754;&#21487;&#24314;&#31435;&#21644;&#31649;&#29702;&#30446;&#21069;&#21474;&#38598;&#20013;&#30340; GlassFish Server &#22519;&#34892;&#34389;&#29702;&#12290;</p>
<p>&#12300;&#21474;&#38598;&#21517;&#31281;&#12301;&#27396;&#20301;&#26159;&#21807;&#35712;&#27396;&#20301;&#65292;&#26371;&#39023;&#31034;&#30446;&#21069;&#21474;&#38598;&#30340;&#21517;&#31281;&#12290;</p>
<p>&#12300;&#21474;&#38598;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#12301;&#38913;&#38754;&#26371;&#39023;&#31034;&#38584;&#23660;&#26044;&#30446;&#21069;&#21474;&#38598;&#30340;&#22519;&#34892;&#34389;&#29702;&#28165;&#21934;&#12290;&#23565;&#26044;&#27599;&#20491;&#22519;&#34892;&#34389;&#29702;&#65292;&#22343;&#25552;&#20379;&#20197;&#19979;&#36039;&#35338;&#12290;</p>
<dl>
<dt>&#21517;&#31281;</dt>
<dd>
<p>&#24314;&#31435;&#22519;&#34892;&#34389;&#29702;&#26178;&#25351;&#23450;&#32102;&#22519;&#34892;&#34389;&#29702;&#30340;&#21517;&#31281;&#12290;&#25353;&#19968;&#19979;&#35442;&#21517;&#31281;&#65292;&#38568;&#21363;&#26371;&#38283;&#21855;&#35442;&#22519;&#34892;&#34389;&#29702;&#30340;&#12300;<a href="ref-clusterinstanceedit.html">&#19968;&#33324;&#36039;&#35338;</a>&#12301;&#38913;&#38754;&#12290;</p>
</dd>
<dt>&#36000;&#36617;&#24179;&#34913;&#21152;&#27402;</dt>
<dd>
<p>&#19968;&#20491;&#25972;&#25976;&#65292;&#20195;&#34920;&#22519;&#34892;&#34389;&#29702;&#30340;&#36000;&#36617;&#24179;&#34913;&#21152;&#27402;&#12290;</p>
<p>&#36000;&#36617;&#24179;&#34913;&#21152;&#27402;&#21487;&#27770;&#23450;&#36865;&#33267;&#21474;&#38598;&#20379;&#22519;&#34892;&#34389;&#29702;&#34389;&#29702;&#20043;&#25152;&#26377;&#35531;&#27714;&#30340;&#27604;&#20363;&#12290;</p>
<p>&#20363;&#22914;&#65292;&#22312;&#26377;&#20841;&#20491;&#22519;&#34892;&#34389;&#29702;&#30340;&#21474;&#38598;&#20013;&#65292;&#24744;&#21487;&#33021;&#38656;&#35201;&#35731;&#20854;&#20013;&#19968;&#20491;&#22519;&#34892;&#34389;&#29702;&#34389;&#29702;&#27599;&#22235;&#20491;&#35531;&#27714;&#20013;&#30340;&#19968;&#20491;&#35531;&#27714;&#65292;&#32780;&#35731;&#21478;&#19968;&#20491;&#22519;&#34892;&#34389;&#29702;&#34389;&#29702;&#27599;&#22235;&#20491;&#35531;&#27714;&#20013;&#30340;&#19977;&#20491;&#35531;&#27714;&#12290;&#22312;&#36889;&#31278;&#24773;&#27841;&#19979;&#65292;&#21487;&#23559;&#34389;&#29702;&#27599;&#22235;&#20491;&#35531;&#27714;&#20013;&#20043;&#19968;&#20491;&#35531;&#27714;&#30340;&#22519;&#34892;&#34389;&#29702;&#21152;&#27402;&#35373;&#23450;&#28858; 1&#65292;&#23559;&#21478;&#19968;&#20491;&#22519;&#34892;&#34389;&#29702;&#21152;&#27402;&#35373;&#23450;&#28858; 3&#12290;&#22914;&#26524;&#24744;&#35201;&#20351;&#29992;&#30334;&#20998;&#27604;&#65292;&#35531;&#23559;&#36889;&#20841;&#20491;&#22519;&#34892;&#34389;&#29702;&#30340;&#21152;&#27402;&#20998;&#21029;&#35373;&#23450;&#28858; 25 &#33287; 75&#12290;</p>
<p>&#38928;&#35373;&#21152;&#27402;&#28858; 100&#12290;</p>
</dd>
<dt>&#32068;&#24907;</dt>
<dd>
<p>&#22519;&#34892;&#34389;&#29702;&#21443;&#29031;&#30340;&#32068;&#24907;&#12290;&#25353;&#19968;&#19979;&#32068;&#24907;&#65292;&#38568;&#21363;&#26371;&#38283;&#21855;&#22519;&#34892;&#34389;&#29702;&#30340; <a href="../../../common/en/help/ref-configuration.html">&#12300;&#32068;&#24907;&#12301;</a> &#38913;&#38754;&#12290;</p>
</dd>
<dt>&#31680;&#40670;</dt>
<dd>
<p>&#22519;&#34892;&#34389;&#29702;&#25152;&#22312;&#20043;&#31680;&#40670;&#30340;&#21517;&#31281;&#12290;&#25353;&#19968;&#19979;&#35442;&#21517;&#31281;&#65292;&#38568;&#21363;&#26371;&#38283;&#21855;&#31680;&#40670;&#30340;&#12300;<a href="ref-nodeedit.html">&#32232;&#36655;&#31680;&#40670;</a>&#12301;&#38913;&#38754;&#12290;</p>
</dd>
<dt>&#29376;&#24907;</dt>
<dd>
<p>&#25351;&#31034;&#22519;&#34892;&#34389;&#29702;&#26159;&#22312;&#22519;&#34892;&#20013; (&#38656;&#35201;&#37325;&#26032;&#21855;&#21205;&#25165;&#33021;&#26356;&#26032;&#32068;&#24907;&#35722;&#26356;) &#36996;&#26159;&#19981;&#22312;&#22519;&#34892;&#20013;&#12290;&#26412;&#27396;&#20301;&#26159;&#21807;&#35712;&#30340;&#12290;</p>
</dd>
</dl>
<p>&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#34920;&#20063;&#21253;&#21547;&#19979;&#21015;&#36984;&#38917;&#12290;</p>
<dl>
<dt>&#26032;&#24314;</dt>
<dd>
<p>&#23559;&#22519;&#34892;&#34389;&#29702;&#22686;&#21152;&#33267;&#21474;&#38598;&#30340;&#25353;&#37397;&#12290;</p>
</dd>
<dt>&#21034;&#38500;</dt>
<dd>
<p>&#24478;&#21474;&#38598;&#20013;&#31227;&#38500;&#19968;&#25110;&#22810;&#20491;&#25152;&#36984;&#21462;&#22519;&#34892;&#34389;&#29702;&#30340;&#25353;&#37397;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
&#22914;&#26524;&#36879;&#36942;&#20027;&#20195;&#29702;&#31243;&#24335;&#20351;&#29992; Java Message Service (JMS) &#21474;&#38598;&#65292;&#35531;&#21247;&#21034;&#38500;&#33287;&#20027;&#20195;&#29702;&#31243;&#24335;&#30456;&#38364;&#32879;&#30340;&#22519;&#34892;&#34389;&#29702;&#12290;&#22914;&#26524;&#24517;&#38920;&#21034;&#38500;&#27492;&#22519;&#34892;&#34389;&#29702;&#65292;&#35531;&#20351;&#29992; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00005"><code>change-master-broker</code>(1)</a> &#23376;&#21629;&#20196;&#65292;&#23559;&#20027;&#20195;&#29702;&#31243;&#24335;&#25351;&#23450;&#32102;&#19981;&#21516;&#30340;&#22519;&#34892;&#34389;&#29702;&#12290;
<hr>

</dd>
<dt>&#21855;&#21205;</dt>
<dd>
<p>&#21855;&#21205;&#21474;&#38598;&#20013;&#19968;&#25110;&#22810;&#20491;&#25152;&#36984;&#21462;&#22519;&#34892;&#34389;&#29702;&#30340;&#25353;&#37397;&#12290;</p>
</dd>
<dt>&#20572;&#27490;</dt>
<dd>
<p>&#20572;&#27490;&#21474;&#38598;&#20013;&#19968;&#25110;&#22810;&#20491;&#25152;&#36984;&#21462;&#22519;&#34892;&#34389;&#29702;&#30340;&#25353;&#37397;&#12290;</p>
</dd>
</dl>
<a id="sthref268" name="sthref268"></a>
<h5>&#30456;&#38364;&#20316;&#26989;</h5>
<ul>
<li>
<p><a href="task-create-clustered-instance.html">&#23559; GlassFish Server &#22519;&#34892;&#34389;&#29702;&#26032;&#22686;&#33267;&#21474;&#38598;</a></p>
</li>
<li>
<p><a href="task-delete-clustered-instances.html">&#21034;&#38500;&#21474;&#38598; GlassFish Server &#22519;&#34892;&#34389;&#29702;</a></p>
</li>
<li>
<p><a href="task-start-clustered-instances.html">&#21855;&#21205;&#21474;&#38598; GlassFish Server &#22519;&#34892;&#34389;&#29702;</a></p>
</li>
<li>
<p><a href="task-stop-clustered-instances.html">&#20572;&#27490;&#21474;&#38598; GlassFish Server &#22519;&#34892;&#34389;&#29702;</a></p>
</li>
</ul>
<a id="sthref269" name="sthref269"></a>
<h5>&#31561;&#25928; asadmin &#23376;&#21629;&#20196;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00033"><code>create-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00085"><code>delete-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00170"><code>list-instances</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00236"><code>start-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00241"><code>stop-instance</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
