<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusternew" name="ref-clusternew"></a></p>

<h4><a id="sthref247" name="sthref247"></a><a id="sthref248" name="sthref248"></a>&#26032;&#24314;&#21474;&#38598;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&#12300;&#26032;&#24314;&#21474;&#38598;&#12301;&#38913;&#38754;&#21487;&#24314;&#31435;&#21474;&#38598;&#12290;</p>
<p>&#12300;&#26032;&#24314;&#21474;&#38598;&#12301;&#38913;&#38754;&#21253;&#21547;&#19979;&#21015;&#36984;&#38917;&#12290;</p>
<dl>
<dt>&#21474;&#38598;&#21517;&#31281;</dt>
<dd>
<p>&#21474;&#38598;&#30340;&#21517;&#31281;&#12290;</p>
<p>&#21517;&#31281;&#24517;&#38920;&#31526;&#21512;&#19979;&#21015;&#38656;&#27714;&#65306;</p>
<ul>
<li>
<p>&#21517;&#31281;&#21482;&#33021;&#21253;&#21547; ASCII &#23383;&#20803;&#12290;</p>
</li>
<li>
<p>&#21517;&#31281;&#24517;&#38920;&#20197;&#23383;&#27597;&#12289;&#25976;&#23383;&#25110;&#24213;&#32218;&#28858;&#38283;&#38957;&#12290;</p>
</li>
<li>
<p>&#21517;&#31281;&#21482;&#33021;&#21253;&#21547;&#19979;&#21015;&#23383;&#20803;&#65306;</p>
<ul>
<li>
<p>&#23567;&#23531;&#23383;&#27597;</p>
</li>
<li>
<p>&#22823;&#23531;&#23383;&#27597;</p>
</li>
<li>
<p>&#25976;&#23383;</p>
</li>
<li>
<p>&#36899;&#23383;&#31526;</p>
</li>
<li>
<p>&#23567;&#25976;&#40670;&#34399;</p>
</li>
<li>
<p>&#24213;&#32218;</p>
</li>
</ul>
</li>
<li>
<p>&#21517;&#31281;&#22312;&#32178;&#22495;&#20013;&#24517;&#38920;&#26159;&#21807;&#19968;&#30340;&#65292;&#19988;&#19981;&#24471;&#28858;&#21478;&#19968;&#20491;&#21474;&#38598;&#12289;&#24050;&#21629;&#21517;&#32068;&#24907;&#12289;GlassFish Server &#22519;&#34892;&#34389;&#29702;&#25110;&#31680;&#40670;&#30340;&#21517;&#31281;&#12290;</p>
</li>
<li>
<p>&#21517;&#31281;&#19981;&#24471;&#28858; <code>domain</code>&#12289;<code>server</code> &#25110; GlassFish Server &#25152;&#20445;&#30041;&#30340;&#20219;&#20309;&#20854;&#20182;&#38364;&#37749;&#23383;&#12290;</p>
</li>
</ul>
</dd>
<dt>&#32068;&#24907;</dt>
<dd>
<p>&#21474;&#38598;&#21487;&#20197;&#20351;&#29992;&#20043;&#29694;&#26377;&#24050;&#21629;&#21517;&#32068;&#24907;&#30340;&#19979;&#25289;&#24335;&#28165;&#21934;&#12290;&#21474;&#38598;&#38656;&#35201;&#24050;&#21629;&#21517;&#32068;&#24907;&#65292;&#35442;&#32068;&#24907;&#26371;&#23450;&#32681;&#22686;&#21152;&#33267;&#21474;&#38598;&#20043;&#25152;&#26377;&#22519;&#34892;&#34389;&#29702;&#30340;&#32068;&#24907;&#12290;&#24744;&#24517;&#38920;&#24478;&#28165;&#21934;&#20013;&#36984;&#21462;&#19968;&#20491;&#32068;&#24907;&#12290;&#24314;&#31435;&#21474;&#38598;&#26178;&#65292;&#21474;&#38598;&#23559;&#20351;&#29992;&#25152;&#36984;&#21462;&#30340;&#32068;&#24907;&#12290;</p>
</dd>
<dt>&#35079;&#35069;&#36984;&#21462;&#30340;&#32068;&#24907;</dt>
<dd>
<p>&#22914;&#26524;&#36984;&#21462;&#27492;&#36984;&#38917;&#65292;&#23601;&#26371;&#22312;&#24314;&#31435;&#21474;&#38598;&#26178;&#35079;&#35069;&#36984;&#21462;&#30340;&#32068;&#24907;&#12290;&#28858;&#32068;&#24907;&#21103;&#26412;&#25351;&#23450;&#30340;&#21517;&#31281;&#26159; <i>cluster-name</i><code>-config</code>&#65292;&#20854;&#20013; <i>cluster-name</i> &#26159;&#22312;&#12300;&#21474;&#38598;&#21517;&#31281;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#30340;&#21474;&#38598;&#21517;&#31281;&#12290;</p>
<p>&#22914;&#26524;&#24050;&#24478;&#12300;&#32068;&#24907;&#12301;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#36984;&#21462; <code>default-config</code>&#65292;&#21063;&#24517;&#38920;&#36984;&#21462;&#27492;&#36984;&#38917;&#12290;<code>default-config</code> &#32068;&#24907;&#20677;&#21487;&#35079;&#35069;&#65292;&#28961;&#27861;&#21443;&#29031;&#12290;</p>
</dd>
<dt>&#21443;&#29031;&#36984;&#21462;&#30340;&#32068;&#24907;</dt>
<dd>
<p>&#22914;&#26524;&#36984;&#21462;&#27492;&#36984;&#38917;&#65292;&#21474;&#38598;&#23559;&#26371;&#20351;&#29992;&#25351;&#23450;&#30340;&#29694;&#26377;&#24050;&#21629;&#21517;&#32068;&#24907;&#12290;</p>
<p>&#22914;&#26524;&#24050;&#24478;&#12300;&#32068;&#24907;&#12301;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#36984;&#21462; <code>default-config</code>&#65292;&#21063;<i>&#19981;&#33021;</i>&#36984;&#21462;&#27492;&#36984;&#38917;&#12290;<code>default-config</code> &#32068;&#24907;&#28961;&#27861;&#21443;&#29031;&#65292;&#20677;&#21487;&#35079;&#35069;&#12290;</p>
</dd>
<dt>&#35338;&#24687;&#20295;&#21015;&#21474;&#38598;&#32068;&#24907;&#39006;&#22411;</dt>
<dd>
<p>&#20351;&#29992;&#27492;&#36984;&#38917;&#21487;&#25351;&#23450;&#35201;&#20351;&#29992;&#26044;&#26032; GlassFish Server &#21474;&#38598;&#30340; Message Queue &#20195;&#29702;&#31243;&#24335;&#21474;&#38598;&#39006;&#22411;&#12290;&#20381;&#38928;&#35373;&#65292;GlassFish Server &#26371;&#20351;&#29992;&#21547;&#26377;&#20027;&#20195;&#29702;&#31243;&#24335;&#30340;&#20659;&#32113; Message Queue &#20195;&#29702;&#31243;&#24335;&#21474;&#38598;&#65292;&#20195;&#29702;&#31243;&#24335;&#26371;&#20839;&#23884;&#26044; GlassFish Server &#21474;&#38598;&#20013;&#30340;&#27599;&#20491;&#22519;&#34892;&#34389;&#29702;&#20013;&#12290;</p>
<p>&#22914;&#26524;&#27492;&#36984;&#38917;&#35373;&#28858;&#12300;&#33258;&#35330;&#12301;&#65292;&#23601;&#26371;&#39023;&#31034;&#21487;&#32068;&#24907; Message Queue &#20195;&#29702;&#31243;&#24335;&#21474;&#38598;&#20197;&#29992;&#26044; GlassFish Server &#21474;&#38598;&#30340;&#20854;&#20182;&#36984;&#38917;&#12290;&#35531;&#21443;&#38321;<a href="#CHDJFEJB">&#33258;&#35330; Message Queue &#20195;&#29702;&#31243;&#24335;&#21474;&#38598;&#30340;&#36984;&#38917;</a>&#12290;</p>
</dd>
<dt>&#35201;&#24314;&#31435;&#30340;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;</dt>
<dd>
<p>&#21363;&#23559;&#22312;&#24314;&#31435;&#21474;&#38598;&#26178;&#24314;&#31435;&#30340; GlassFish Server &#22519;&#34892;&#34389;&#29702;&#28165;&#21934;&#12290;&#23565;&#26044;&#27599;&#20491;&#22519;&#34892;&#34389;&#29702;&#65292;&#22343;&#25552;&#20379;&#20197;&#19979;&#36039;&#35338;&#65306;</p>
<dl>
<dt>&#22519;&#34892;&#34389;&#29702;&#21517;&#31281;</dt>
<dd>
<p>&#22519;&#34892;&#34389;&#29702;&#30340;&#21517;&#31281;&#12290;</p>
</dd>
<dt>&#21152;&#27402;</dt>
<dd>
<p>&#19968;&#20491;&#25972;&#25976;&#65292;&#20195;&#34920;&#22519;&#34892;&#34389;&#29702;&#30340;&#36000;&#36617;&#24179;&#34913;&#21152;&#27402;&#12290;</p>
<p>&#36000;&#36617;&#24179;&#34913;&#21152;&#27402;&#21487;&#27770;&#23450;&#36865;&#33267;&#21474;&#38598;&#20379;&#22519;&#34892;&#34389;&#29702;&#34389;&#29702;&#20043;&#25152;&#26377;&#35531;&#27714;&#30340;&#27604;&#20363;&#12290;</p>
<p>&#20363;&#22914;&#65292;&#22312;&#26377;&#20841;&#20491;&#22519;&#34892;&#34389;&#29702;&#30340;&#21474;&#38598;&#20013;&#65292;&#24744;&#21487;&#33021;&#38656;&#35201;&#35731;&#20854;&#20013;&#19968;&#20491;&#22519;&#34892;&#34389;&#29702;&#34389;&#29702;&#27599;&#22235;&#20491;&#35531;&#27714;&#20013;&#30340;&#19968;&#20491;&#35531;&#27714;&#65292;&#32780;&#35731;&#21478;&#19968;&#20491;&#22519;&#34892;&#34389;&#29702;&#34389;&#29702;&#27599;&#22235;&#20491;&#35531;&#27714;&#20013;&#30340;&#19977;&#20491;&#35531;&#27714;&#12290;&#22312;&#36889;&#31278;&#24773;&#27841;&#19979;&#65292;&#21487;&#23559;&#34389;&#29702;&#27599;&#22235;&#20491;&#35531;&#27714;&#20013;&#20043;&#19968;&#20491;&#35531;&#27714;&#30340;&#22519;&#34892;&#34389;&#29702;&#21152;&#27402;&#35373;&#23450;&#28858; 1&#65292;&#23559;&#21478;&#19968;&#20491;&#22519;&#34892;&#34389;&#29702;&#21152;&#27402;&#35373;&#23450;&#28858; 3&#12290;&#22914;&#26524;&#24744;&#35201;&#20351;&#29992;&#30334;&#20998;&#27604;&#65292;&#35531;&#23559;&#36889;&#20841;&#20491;&#22519;&#34892;&#34389;&#29702;&#30340;&#21152;&#27402;&#20998;&#21029;&#35373;&#23450;&#28858; 25 &#33287; 75&#12290;</p>
<p>&#38928;&#35373;&#21152;&#27402;&#28858; 100&#12290;</p>
</dd>
<dt>&#31680;&#40670;</dt>
<dd>
<p>&#21487;&#23384;&#22312;&#22519;&#34892;&#34389;&#29702;&#20043;&#29694;&#26377;&#31680;&#40670;&#30340;&#19979;&#25289;&#24335;&#28165;&#21934;&#12290;&#24744;&#24517;&#38920;&#24478;&#28165;&#21934;&#20013;&#36984;&#21462;&#19968;&#20491;&#31680;&#40670;&#12290;&#24314;&#31435;&#21474;&#38598;&#26178;&#65292;&#22519;&#34892;&#34389;&#29702;&#23559;&#20301;&#26044;&#36984;&#21462;&#30340;&#31680;&#40670;&#19978;&#12290;</p>
</dd>
</dl>
<p>&#35201;&#24314;&#31435;&#30340;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#34920;&#20063;&#21253;&#21547;&#19979;&#21015;&#36984;&#38917;&#12290;</p>
<dl>
<dt>&#26032;&#24314;</dt>
<dd>
<p>&#24314;&#31435;&#22519;&#34892;&#34389;&#29702;&#30340;&#25353;&#37397;&#12290;&#25353;&#19968;&#19979;&#27492;&#25353;&#37397;&#21363;&#21487;&#22312;&#35201;&#24314;&#31435;&#30340;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#34920;&#20013;&#22686;&#21152;&#19968;&#21015;&#12290;</p>
</dd>
<dt>&#21034;&#38500;</dt>
<dd>
<p>&#21034;&#38500;&#22519;&#34892;&#34389;&#29702;&#30340;&#25353;&#37397;&#12290;</p>
</dd>
</dl>
</dd>
</dl>
<a id="CHDJFEJB" name="CHDJFEJB"></a>
<h5>&#33258;&#35330; Message Queue &#20195;&#29702;&#31243;&#24335;&#21474;&#38598;&#30340;&#36984;&#38917;</h5>
<p>&#30070;&#12300;&#35338;&#24687;&#20295;&#21015;&#21474;&#38598;&#32068;&#24907;&#39006;&#22411;&#12301;&#35373;&#28858;&#12300;&#33258;&#35330;&#12301;&#26178;&#65292;&#23601;&#26371;&#39023;&#31034;&#21487;&#32068;&#24907; Message Queue &#20195;&#29702;&#31243;&#24335;&#21474;&#38598;&#20197;&#29992;&#26044; GlassFish Server &#21474;&#38598;&#30340;&#20854;&#20182;&#36984;&#38917;&#12290;</p>
<dl>
<dt>JMS &#26381;&#21209;&#39006;&#22411;</dt>
<dd>
<p>&#35201;&#29992;&#26044;&#20195;&#29702;&#31243;&#24335;&#21474;&#38598;&#20013;&#30340;&#20195;&#29702;&#31243;&#24335;&#39006;&#22411; (&#22312; GlassFish Server &#20013;&#31281;&#28858; JMS &#20027;&#27231;)&#12290;&#36984;&#25799;&#30340;&#39006;&#22411;&#26371;&#27770;&#23450;&#21487;&#29992;&#30340;&#20195;&#29702;&#31243;&#24335;&#21474;&#38598;&#39006;&#22411;&#12290;&#20195;&#29702;&#31243;&#24335;&#39006;&#22411;&#22914;&#19979;&#65306;</p>
<dl>
<dt>&#20839;&#23884;</dt>
<dd>
<p>&#20195;&#29702;&#31243;&#24335;&#32068;&#24907;&#33287;&#29983;&#21629;&#36913;&#26399;&#30001; GlassFish Server &#25152;&#31649;&#29702;&#12290;&#27599;&#20491; GlassFish &#21474;&#38598;&#22519;&#34892;&#34389;&#29702;&#22343;&#30001;&#33287;&#22519;&#34892;&#34389;&#29702;&#22312;&#21516;&#19968;&#20491; JVM &#20013;&#22519;&#34892;&#30340;&#20195;&#29702;&#31243;&#24335;&#25552;&#20379;&#26381;&#21209;&#12290;</p>
<p>&#22914;&#26524;&#12300;JMS &#26381;&#21209;&#39006;&#22411;&#12301;&#36984;&#38917;&#35373;&#28858;&#12300;&#20839;&#23884;&#12301;&#65292;&#21063;&#20677;&#25903;&#25588;&#20659;&#32113;&#30340; Message Queue &#20195;&#29702;&#31243;&#24335;&#21474;&#38598;&#12290;&#31995;&#32113;&#26371;&#39023;&#31034;&#32068;&#24907;&#20659;&#32113;&#21474;&#38598;&#30340;&#36984;&#38917;&#12290;</p>
</dd>
<dt>&#26412;&#27231;</dt>
<dd>
<p>&#20195;&#29702;&#31243;&#24335;&#32068;&#24907;&#33287;&#29983;&#21629;&#36913;&#26399;&#30001; GlassFish Server &#25152;&#31649;&#29702;&#12290;&#27599;&#20491; GlassFish &#21474;&#38598;&#22519;&#34892;&#34389;&#29702;&#22343;&#30001;&#33287;&#22519;&#34892;&#34389;&#29702;&#22312;&#21516;&#19968;&#20027;&#27231;&#30340;&#19981;&#21516; JVM &#20013;&#22519;&#34892;&#30340;&#20195;&#29702;&#31243;&#24335;&#25552;&#20379;&#26381;&#21209;&#12290;</p>
<p>&#22914;&#26524;&#12300;JMS &#26381;&#21209;&#39006;&#22411;&#12301;&#36984;&#38917;&#35373;&#28858;&#12300;&#26412;&#27231;&#12301;&#65292;&#21063;&#25903;&#25588;&#20659;&#32113;&#33287;&#22686;&#24375;&#30340; (&#39640;&#21487;&#29992;&#24615;) Message Queue &#20195;&#29702;&#31243;&#24335;&#21474;&#38598;&#12290;&#31995;&#32113;&#26371;&#39023;&#31034;&#36984;&#21462;&#21474;&#38598;&#39006;&#22411;&#33287;&#32068;&#24907;&#21474;&#38598;&#30340;&#36984;&#38917;&#12290;</p>
</dd>
<dt>&#36960;&#31471;</dt>
<dd>
<p>&#20195;&#29702;&#31243;&#24335;&#33287;&#20195;&#29702;&#31243;&#24335;&#21474;&#38598;&#30340;&#32068;&#24907;&#21644;&#29983;&#21629;&#36913;&#26399;&#26159;&#20351;&#29992; Message Queue &#31649;&#29702;&#24037;&#20855;&#25152;&#31649;&#29702;&#30340;&#12290;</p>
<p>&#22914;&#26524;&#12300;JMS &#26381;&#21209;&#39006;&#22411;&#12301;&#36984;&#38917;&#35373;&#28858;&#12300;&#36960;&#31471;&#12301;&#65292;&#21063;&#19981;&#26371;&#39023;&#31034;&#20854;&#20182;&#36984;&#38917;&#12290;</p>
</dd>
</dl>
</dd>
<dt>JMS &#21474;&#38598;&#39006;&#22411;</dt>
<dd>
<p>&#35201;&#20351;&#29992;&#26044; GlassFish Server &#21474;&#38598;&#30340; Message Queue &#20195;&#29702;&#31243;&#24335;&#21474;&#38598;&#39006;&#22411;&#12290;</p>
<p>&#22914;&#26524;&#12300;JMS &#21474;&#38598;&#39006;&#22411;&#12301;&#36984;&#38917;&#35373;&#28858;&#12300;&#20659;&#32113;&#12301;&#65292;&#26371;&#39023;&#31034;&#19979;&#21015;&#36984;&#38917;&#12290;</p>
<dl>
<dt>JMS &#32068;&#24907;&#23384;&#25918;&#21312;&#39006;&#22411;</dt>
<dd>
<p>&#35201;&#29992;&#26044;&#20659;&#32113;&#21474;&#38598;&#20043;&#32068;&#24907;&#36039;&#26009;&#30340;&#36039;&#26009;&#23384;&#25918;&#21312;&#39006;&#22411;&#12290;&#22914;&#26524;&#27492;&#36984;&#38917;&#35373;&#28858;&#12300;&#20027;&#20195;&#29702;&#31243;&#24335;&#12301;&#65292;&#26371;&#23559;&#21474;&#38598;&#20013;&#30340;&#26576;&#20491;&#20195;&#29702;&#31243;&#24335;&#25351;&#23450;&#28858;&#20027;&#20195;&#29702;&#31243;&#24335;&#65292;&#20006;&#30001;&#20854;&#20786;&#23384;&#32068;&#24907;&#36039;&#26009;&#12290;&#22914;&#26524;&#27492;&#36984;&#38917;&#35373;&#28858;&#12300;&#20849;&#29992;&#30340;&#36039;&#26009;&#24235;&#12301;&#65292;&#21063;&#32068;&#24907;&#36039;&#26009;&#26371;&#20786;&#23384;&#22312;&#25152;&#26377;&#20195;&#29702;&#31243;&#24335;&#21487;&#23384;&#21462;&#30340; JDBC &#36039;&#26009;&#23384;&#25918;&#21312;&#20013;&#12290;&#22312;&#27492;&#24773;&#27841;&#19979;&#65292;&#26371;&#39023;&#31034;&#33287;&#36039;&#26009;&#24235;&#30456;&#38364;&#30340;&#36984;&#38917;&#12290;</p>
</dd>
<dt>JMS &#35338;&#24687;&#23384;&#25918;&#21312;&#39006;&#22411;</dt>
<dd>
<p>&#27599;&#20491;&#20195;&#29702;&#31243;&#24335;&#29992;&#20358;&#20786;&#23384;&#20854;&#35338;&#24687;&#36039;&#26009;&#30340;&#36039;&#26009;&#23384;&#25918;&#21312;&#39006;&#22411;&#12290;&#22914;&#26524;&#27492;&#36984;&#38917;&#35373;&#28858;&#12300;&#27284;&#26696;&#12301;&#65292;&#27599;&#20491;&#20195;&#29702;&#31243;&#24335;&#26371;&#23559;&#20854;&#35338;&#24687;&#36039;&#26009;&#20786;&#23384;&#22312;&#27284;&#26696;&#22411;&#30340;&#36039;&#26009;&#23384;&#25918;&#21312;&#12290;&#22914;&#26524;&#27492;&#36984;&#38917;&#35373;&#28858; JDBC&#65292;&#27599;&#20491;&#20195;&#29702;&#31243;&#24335;&#26371;&#23559;&#20854;&#35338;&#24687;&#36039;&#26009;&#20786;&#23384;&#22312; JDBC &#36039;&#26009;&#23384;&#25918;&#21312;&#12290;</p>
</dd>
</dl>
<p>&#22914;&#26524;&#12300;JMS &#21474;&#38598;&#39006;&#22411;&#12301;&#36984;&#38917;&#35373;&#28858;&#12300;&#22686;&#24375; (HA)&#12301;&#65292;&#26371;&#39023;&#31034;&#33287;&#36039;&#26009;&#24235;&#30456;&#38364;&#30340;&#36984;&#38917;&#12290;</p>
</dd>
<dt>&#36039;&#26009;&#24235;&#20379;&#25033;&#21830;</dt>
<dt>&#36039;&#26009;&#24235; URL</dt>
<dt>&#36039;&#26009;&#24235;&#20351;&#29992;&#32773;</dt>
<dd>
<p>&#35201;&#22312;&#20197;&#19979;&#20219;&#19968;&#24773;&#24418;&#20351;&#29992;&#20043; JDBC &#36039;&#26009;&#24235;&#30340;&#36039;&#26009;&#24235;&#20379;&#25033;&#21830;&#12289;&#23384;&#21462; URL &#20197;&#21450;&#20351;&#29992;&#32773;&#65306;</p>
<ul>
<li>
<p>&#30070;&#20659;&#32113;&#21474;&#38598;&#30340;&#32068;&#24907;&#23384;&#25918;&#21312;&#39006;&#22411;&#35373;&#28858;&#12300;&#20849;&#29992;&#36039;&#26009;&#24235;&#12301;&#26178;</p>
</li>
<li>
<p>&#30070;&#20659;&#32113;&#21474;&#38598;&#30340;&#35338;&#24687;&#23384;&#25918;&#21312;&#39006;&#22411;&#35373;&#28858; JDBC &#26178;</p>
</li>
<li>
<p>&#30070;&#21474;&#38598;&#39006;&#22411;&#35373;&#28858;&#12300;&#22686;&#24375; (HA)&#12301;&#26178;</p>
</li>
</ul>
<p>&#22914;&#38656;&#26377;&#38364;&#25903;&#25588;&#20379;&#25033;&#21830;&#21450;&#21508;&#20379;&#25033;&#21830;&#23384;&#21462; URL &#26684;&#24335;&#30340;&#30456;&#38364;&#36039;&#35338;&#65292;&#35531;&#21443;&#38321; <i>Oracle GlassFish Server Message Queue Administration Guide</i> &#20013;&#30340; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GMADG00244">JDBC-Based Persistence</a>&#12290;</p>
</dd>
<dt>&#36039;&#26009;&#24235;&#35469;&#35657;</dt>
<dt>&#36039;&#26009;&#24235;&#23494;&#30908;</dt>
<dt>&#23494;&#30908;&#21029;&#21517;</dt>
<dd>
<p>&#22312;&#12300;&#36039;&#26009;&#24235;&#20351;&#29992;&#32773;&#12301;&#20013;&#25351;&#23450;&#30340; JDBC &#36039;&#26009;&#24235;&#20351;&#29992;&#32773;&#30340;&#23494;&#30908;&#36039;&#35338;&#12290;</p>
<p>&#22914;&#26524;&#12300;&#36039;&#26009;&#24235;&#35469;&#35657;&#12301;&#35373;&#28858;&#12300;&#23494;&#30908;&#12301;&#65292;&#26371;&#39023;&#31034;&#12300;&#36039;&#26009;&#24235;&#23494;&#30908;&#12301;&#36984;&#38917;&#12290;&#22914;&#26524;&#12300;&#36039;&#26009;&#24235;&#35469;&#35657;&#12301;&#35373;&#28858;&#12300;&#23494;&#30908;&#21029;&#21517;&#12301;&#65292;&#26371;&#39023;&#31034;&#12300;&#23494;&#30908;&#21029;&#21517;&#12301;&#36984;&#38917;&#12290;</p>
</dd>
<dt>JMS &#21474;&#38598;&#29305;&#24615;</dt>
<dd>
<p>&#32068;&#24907;&#20195;&#29702;&#31243;&#24335;&#25152;&#29992;&#30340;&#19968;&#25110;&#22810;&#20491; Message Queue &#20195;&#29702;&#31243;&#24335;&#29305;&#24615;&#28165;&#21934;&#12290;&#27492;&#28165;&#21934;&#26159;&#20197;&#20882;&#34399;&#20998;&#38548; (<code>:</code>)&#65292;&#26684;&#24335;&#28858;&#65306;</p>
<pre>
<i>prop1Name</i>=<i>prop1Value</i>:<i>prop2Name</i>=<i>prop2Value</i>:...
</pre>
<p>&#22914;&#26524;&#20195;&#29702;&#31243;&#24335;&#29305;&#24615;&#21517;&#31281;&#21253;&#21547;&#40670;&#65292;&#35531;&#22312;&#40670;&#21069;&#38754;&#21152;&#19978;&#20841;&#20491;&#21453;&#26012;&#32218; (<code>\\</code>)&#65307;&#20363;&#22914;&#65292;&#33509;&#35201;&#21253;&#21547; <code>imq.system.max_count</code> &#29305;&#24615;&#65292;&#35531;&#22312;&#28165;&#21934;&#20013;&#25351;&#23450; <code>imq\\.system\\.max_count</code>&#12290;</p>
</dd>
</dl>
<a id="sthref249" name="sthref249"></a>
<h5>&#30456;&#38364;&#20316;&#26989;</h5>
<p><a href="task-create-cluster.html">&#24314;&#31435;&#21474;&#38598;</a></p>
<a id="sthref250" name="sthref250"></a>
<h5>&#31561;&#25928; asadmin &#23376;&#21629;&#20196;</h5>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00017"><code>create-cluster</code>(1)</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
