<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clustergeneral" name="ref-clustergeneral"></a><a id="GHCLU00003" name="GHCLU00003"></a></p>

<h4><a id="sthref251" name="sthref251"></a><a id="sthref252" name="sthref252"></a><a id="sthref253" name="sthref253"></a><a id="sthref254" name="sthref254"></a>&#19968;&#33324;&#36039;&#35338;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;&#19968;&#33324;&#36039;&#35338;&#12301;&#38913;&#38754;&#21253;&#21547;&#19979;&#21015;&#36984;&#38917;&#12290;</p>
<dl>
<dt>&#21855;&#21205;&#21474;&#38598;</dt>
<dd>
<p>&#21855;&#21205;&#21474;&#38598;&#30340;&#25353;&#37397;&#12290;&#22914;&#26524;&#21474;&#38598;&#20013;&#30340;&#25152;&#26377;&#22519;&#34892;&#34389;&#29702;&#37117;&#22312;&#22519;&#34892;&#20013;&#65292;&#20415;&#26371;&#38364;&#38281;&#27492;&#25353;&#37397;&#12290;</p>
</dd>
<dt>&#20572;&#27490;&#21474;&#38598;</dt>
<dd>
<p>&#20572;&#27490;&#21474;&#38598;&#30340;&#25353;&#37397;&#12290;&#22914;&#26524;&#21474;&#38598;&#20013;&#30340;&#25152;&#26377;&#22519;&#34892;&#34389;&#29702;&#37117;&#24050;&#20572;&#27490;&#65292;&#20415;&#26371;&#38364;&#38281;&#27492;&#25353;&#37397;&#12290;</p>
</dd>
<dt>&#36983;&#31227; EJB &#35336;&#26178;&#22120;</dt>
<dd>
<p>&#27492;&#25353;&#37397;&#21487;&#23559; Enterprise JavaBeans (EJB) &#25216;&#34899;&#35336;&#26178;&#22120;&#24478;&#24050;&#20572;&#27490;&#30340; GlassFish Server &#22519;&#34892;&#34389;&#29702;&#36983;&#31227;&#21040;&#21474;&#38598;&#20013;&#27491;&#22312;&#22519;&#34892;&#30340;&#22519;&#34892;&#34389;&#29702;&#12290;&#25353;&#19968;&#19979;&#27492;&#25353;&#37397;&#65292;&#38568;&#21363;&#26371;&#38283;&#21855;&#12300;<a href="ref-migrateejbtimers.html">&#36983;&#31227; EJB &#35336;&#26178;&#22120;</a>&#12301;&#38913;&#38754;&#12290;&#22914;&#26524;&#21474;&#38598;&#20013;&#30340;&#25152;&#26377;&#22519;&#34892;&#34389;&#29702;&#37117;&#22312;&#22519;&#34892;&#20013;&#65292;&#20415;&#26371;&#38364;&#38281;&#27492;&#25353;&#37397;&#12290;</p>
</dd>
<dt>&#24490;&#29872;&#26085;&#35468;</dt>
<dd>
<p>&#28858;&#21474;&#38598;&#24490;&#29872;&#26085;&#35468;&#27284;&#30340;&#25353;&#37397;&#12290;&#24490;&#29872;&#26085;&#35468;&#27284;&#26178;&#65292;&#26371;&#20351;&#29992;&#26178;&#38291;&#25139;&#35352;&#21517;&#31281; (&#26684;&#24335;&#28858; <code>server.log_</code><i>date-and-time</i>) &#20358;&#37325;&#26032;&#21629;&#21517;&#27284;&#26696;&#65292;&#20006;&#19988;&#28858;&#26032;&#30340;&#26085;&#35468;&#35338;&#24687;&#24314;&#31435;&#31354;&#30333;&#26085;&#35468;&#27284;&#12290;&#35722;&#26356;&#26371;&#20197;&#21205;&#24907;&#26041;&#24335;&#22871;&#29992;&#12290;&#19981;&#38656;&#35201;&#37325;&#26032;&#21855;&#21205;&#20282;&#26381;&#22120;&#12290;</p>
</dd>
<dt>&#21474;&#38598;&#21517;&#31281;</dt>
<dd>
<p>&#24314;&#31435;&#21474;&#38598;&#26178;&#25351;&#23450;&#32102;&#21474;&#38598;&#30340;&#21517;&#31281;&#12290;&#26412;&#27396;&#20301;&#26159;&#21807;&#35712;&#30340;&#12290;</p>
</dd>
<dt>JVM</dt>
<dd>
<p>&#22914;&#26524;&#25353;&#19968;&#19979;&#12300;JVM &#22577;&#21578;&#12301;&#65292;&#26371;&#38283;&#21855;&#21478;&#22806;&#19968;&#20491;&#35222;&#31383;&#20006;&#39023;&#31034; Java &#34395;&#25836;&#27231;&#22120;&#30340;&#30456;&#38364;&#22577;&#21578;&#65292;&#21253;&#25324;&#25688;&#35201;&#22577;&#21578;&#12289;&#35352;&#25014;&#39636;&#31649;&#29702;&#21644;&#36039;&#28304;&#22238;&#25910;&#22577;&#21578;&#12289;&#39006;&#21029;&#36617;&#20837;&#22577;&#21578;&#20197;&#21450;&#30446;&#21069;&#32363;&#32218;&#20670;&#21360;&#12290;</p>
</dd>
<dt>&#32068;&#24907;</dt>
<dd>
<p>&#24314;&#31435;&#21474;&#38598;&#26178;&#28858;&#21474;&#38598;&#36984;&#21462;&#30340;&#32068;&#24907;&#12290;&#25353;&#19968;&#19979;&#35442;&#32068;&#24907;&#65292;&#21363;&#26371;&#38283;&#21855;&#21474;&#38598;&#30340; <a href="../../../common/en/help/ref-configuration.html">&#12300;&#32068;&#24907;&#12301;</a> &#38913;&#38754;&#12290;&#26412;&#27396;&#20301;&#26159;&#21807;&#35712;&#30340;&#12290;</p>
</dd>
<dt>GMS</dt>
<dd>
<p>&#22914;&#26524;&#24050;&#21855;&#29992;&#27492;&#36984;&#38917;&#65292;&#23601;&#26371;&#22312;&#21474;&#38598;&#33287;&#32178;&#22495;&#31649;&#29702;&#20282;&#26381;&#22120;(DAS) &#30340;&#27599;&#20491; GlassFish Server &#22519;&#34892;&#34389;&#29702;&#20013;&#21855;&#21205;&#32676;&#32068;&#31649;&#29702;&#26381;&#21209; (GMS)&#12290; DAS &#26371;&#21443;&#33287;&#27599;&#20491;&#24050;&#21855;&#29992; GMS &#30340;&#21474;&#38598;&#12290;GMS &#26371;&#25552;&#20379;&#21474;&#38598;&#30435;&#35222;&#12289;&#21474;&#38598;&#25104;&#21729;&#36523;&#20221;&#21450;&#32676;&#32068;&#36890;&#35338;&#26381;&#21209;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#21855;&#29992;&#12290;</p>
</dd>
<dt>&#22810;&#37325;&#25773;&#36865;&#36899;&#25509;&#22496;</dt>
<dd>
<p>GMS &#30435;&#32893;&#32676;&#32068;&#20107;&#20214;&#20043;&#36890;&#35338;&#22496;&#30340;&#36899;&#25509;&#22496;&#34399;&#30908;&#12290;&#27492;&#36984;&#38917;&#24517;&#38920;&#25351;&#23450;&#26377;&#25928;&#30340;&#36899;&#25509;&#22496;&#34399;&#30908;&#65292;&#31684;&#22285;&#20171;&#26044; 2048-49151 &#20043;&#38291;&#12290;&#38928;&#35373;&#20540;&#28858;&#33258;&#21205;&#29986;&#29983;&#30340;&#20540; (&#20171;&#26044;&#27492;&#31684;&#22285;&#20839;)&#12290;</p>
</dd>
<dt>&#22810;&#37325;&#25773;&#36865;&#20301;&#22336;</dt>
<dd>
<p>GMS &#30435;&#32893;&#32676;&#32068;&#20107;&#20214;&#30340;&#20301;&#22336;&#12290;&#27492;&#36984;&#38917;&#24517;&#38920;&#25351;&#23450;&#22810;&#37325;&#25773;&#36865;&#20301;&#22336;&#65292;&#31684;&#22285;&#20171;&#26044; 224.0.0.0 &#33267; 239.255.255.255 &#20043;&#38291;&#12290;&#38928;&#35373;&#20540;&#26159; 228.9.<i>XX</i>.<i>YY</i>&#65292;&#20854;&#20013; <i>XX</i> &#33287; <i>YY</i> &#26159;&#33258;&#21205;&#29986;&#29983;&#30340;&#29544;&#31435;&#20540; (&#20171;&#26044; 0 &#33267; 255 &#20043;&#38291;)&#12290;</p>
</dd>
<dt>&#36899;&#32080;&#20171;&#38754;&#20301;&#22336;</dt>
<dd>
<p>GMS &#25152;&#36899;&#32080;&#20043;&#32178;&#36335;&#20171;&#38754;&#30340;&#32178;&#38555;&#32178;&#36335;&#21332;&#23450; (IP) &#20301;&#22336;&#12290;&#27492;&#36984;&#38917;&#24517;&#38920;&#25351;&#23450;&#26412;&#27231;&#32178;&#36335;&#20171;&#38754;&#30340; IP &#20301;&#22336;&#12290;&#38928;&#35373;&#20540;&#28858;&#25152;&#26377;&#20844;&#29992;&#32178;&#36335;&#20171;&#38754;&#20301;&#22336;&#12290;</p>
<p>&#22312;&#22810;&#22336;&#27231;&#22120;&#19978;&#65292;&#27492;&#36984;&#38917;&#26371;&#32068;&#24907;&#29992;&#26044; GMS &#30340;&#32178;&#36335;&#20171;&#38754;&#12290;&#22810;&#22336;&#27231;&#22120;&#25793;&#26377;&#20841;&#20491;&#25110;&#20841;&#20491;&#20197;&#19978;&#30340;&#32178;&#36335;&#20171;&#38754;&#12290;</p>
<p>&#33509;&#35201;&#25351;&#23450;&#21474;&#38598;&#20013;&#25152;&#26377; GlassFish Server &#22519;&#34892;&#34389;&#29702;&#30340;&#26377;&#25928;&#20301;&#22336;&#65292;&#35531;&#20351;&#29992;&#31995;&#32113;&#29305;&#24615;&#20358;&#28858;&#27599;&#20491;&#22519;&#34892;&#34389;&#29702;&#20491;&#21029;&#35373;&#23450;&#20301;&#22336;&#12290;</p>
<p>&#20363;&#22914;&#65292;&#20351;&#29992;<a href="ref-clustersystemproperties.html">&#21474;&#38598;&#31995;&#32113;&#29305;&#24615;</a>&#38913;&#38754;&#21487;&#24314;&#31435;&#31995;&#32113;&#29305;&#24615; <code>GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i>&#12290;&#25509;&#33879;&#65292;&#23559;&#27492;&#38913;&#38754;&#20013;&#30340;&#12300;&#36899;&#32080;&#20301;&#22336;&#12301;&#36984;&#38917;&#35373;&#23450;&#28858; <code>${GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i><code>}</code>&#65292;&#20358;&#25351;&#23450;&#31995;&#32113;&#29305;&#24615;&#12290;&#26368;&#24460;&#65292;&#37341;&#23565;&#21474;&#38598;&#20013;&#30340;&#27599;&#20491;&#22519;&#34892;&#34389;&#29702;&#65292;&#23559; <code>GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i> &#31995;&#32113;&#29305;&#24615;&#35373;&#23450;&#28858;&#22519;&#34892;&#34389;&#29702;&#27231;&#22120;&#19978;&#25152;&#38656;&#30340;&#32178;&#36335;&#20171;&#38754;&#20301;&#22336;&#12290;</p>
</dd>
<dt>&#29376;&#24907;</dt>
<dd>
<p>&#25351;&#31034;&#21474;&#38598;&#20013;&#27491;&#22312;&#22519;&#34892;&#33287;&#26410;&#22312;&#22519;&#34892;&#30340;&#22519;&#34892;&#34389;&#29702;&#25976;&#30446;&#12290;&#26412;&#27396;&#20301;&#26159;&#21807;&#35712;&#30340;&#12290;</p>
</dd>
</dl>
<a id="sthref255" name="sthref255"></a>
<h5>&#30456;&#38364;&#20316;&#26989;</h5>
<ul>
<li>
<p><a href="task-gmscluster.html">&#32068;&#24907;&#21474;&#38598;&#30340;&#32676;&#32068;&#31649;&#29702;&#26381;&#21209;&#35373;&#23450;</a></p>
</li>
<li>
<p><a href="task-migrate-ejb-timers.html">&#36983;&#31227; EJB &#35336;&#26178;&#22120;</a></p>
</li>
</ul>
<a id="sthref256" name="sthref256"></a>
<h5>&#31561;&#25928; asadmin &#23376;&#21629;&#20196;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00138"><code>generate-jvm-report</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00211"><code>migrate-timers</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00224"><code>rotate-log</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
