<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterapplications" name="ref-clusterapplications"></a></p>

<h4><a id="sthref262" name="sthref262"></a><a id="sthref263" name="sthref263"></a>&#25033;&#29992;&#31243;&#24335;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&#12300;&#25033;&#29992;&#31243;&#24335;&#12301;&#38913;&#38754;&#65292;&#21487;&#23565;&#30446;&#21069;&#30340;&#21474;&#38598;&#22519;&#34892;&#19979;&#21015;&#20316;&#26989;&#65306;</p>
<ul>
<li>
<p>&#27298;&#35222;&#21644;&#31649;&#29702;&#24050;&#24314;&#32622;&#33267;&#21474;&#38598;&#30340;&#25033;&#29992;&#31243;&#24335;</p>
</li>
<li>
<p>&#23559;&#26356;&#22810;&#25033;&#29992;&#31243;&#24335;&#24314;&#32622;&#33267;&#21474;&#38598;</p>
</li>
</ul>
<p>&#12300;&#21474;&#38598;&#21517;&#31281;&#12301;&#27396;&#20301;&#26159;&#21807;&#35712;&#27396;&#20301;&#65292;&#26371;&#39023;&#31034;&#30446;&#21069;&#21474;&#38598;&#30340;&#21517;&#31281;&#12290;</p>
<p>&#12300;&#25033;&#29992;&#31243;&#24335;&#12301;&#38913;&#38754;&#26371;&#39023;&#31034;&#24314;&#32622;&#33267;&#30446;&#21069;&#21474;&#38598;&#30340;&#25033;&#29992;&#31243;&#24335;&#28165;&#21934;&#12290;&#23565;&#26044;&#27599;&#20491;&#25033;&#29992;&#31243;&#24335;&#65292;&#22343;&#25552;&#20379;&#20197;&#19979;&#36039;&#35338;&#65306;</p>
<dl>
<dt>&#21517;&#31281;</dt>
<dd>
<p>&#25033;&#29992;&#31243;&#24335;&#21517;&#31281;&#12290;</p>
<p>&#21517;&#31281;&#20013;&#21487;&#20197;&#21253;&#21547;&#19968;&#20491;&#36984;&#25799;&#24615;&#30340;&#29256;&#26412;&#35672;&#21029;&#30908;&#65292;&#24460;&#38754;&#25509;&#33879;&#21517;&#31281;&#65292;&#20841;&#32773;&#38291;&#29992;&#20882;&#34399; (<code>:</code>) &#38548;&#38283;&#12290; &#22914;&#38656;&#26377;&#38364;&#27169;&#32068;&#33287;&#25033;&#29992;&#31243;&#24335;&#29256;&#26412;&#30340;&#26356;&#22810;&#36039;&#35338;&#65292;&#35531;&#21443;&#38321; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Oracle GlassFish Server Application Deployment Guide</i> &#20013;&#30340; <i>Module and Application Versions</i></a>&#12290;</p>
</dd>
<dt>&#24050;&#21855;&#29992;</dt>
<dd>
<p>&#25351;&#31034;&#25033;&#29992;&#31243;&#24335;&#26159;&#21542;&#24050;&#21855;&#29992;&#65306;</p>
<ul>
<li>
<p>&#22914;&#26524;&#24050;&#21855;&#29992;&#25033;&#29992;&#31243;&#24335;&#65292;&#20415;&#26371;&#39023;&#31034;&#21246;&#36984;&#35352;&#34399; (&#10003;)&#12290;</p>
</li>
<li>
<p>&#22914;&#26524;&#24050;&#20572;&#29992;&#25033;&#29992;&#31243;&#24335;&#65292;&#20415;&#26371;&#39023;&#31034;&#21449;&#34399; (&#10007;)&#12290;</p>
</li>
</ul>
</dd>
<dt>&#36000;&#36617;&#24179;&#34913;&#24050;&#21855;&#29992;</dt>
<dd>
<p>&#25351;&#31034;&#25033;&#29992;&#31243;&#24335;&#26159;&#21542;&#24050;&#21855;&#29992;&#36000;&#36617;&#24179;&#34913;&#65306;</p>
<ul>
<li>
<p>&#22914;&#26524;&#25033;&#29992;&#31243;&#24335;&#24050;&#21855;&#29992;&#36000;&#36617;&#24179;&#34913;&#65292;&#20415;&#26371;&#39023;&#31034;&#21246;&#36984;&#35352;&#34399; (&#10003;)&#12290;</p>
</li>
<li>
<p>&#22914;&#26524;&#25033;&#29992;&#31243;&#24335;&#24050;&#20572;&#29992;&#36000;&#36617;&#24179;&#34913;&#65292;&#20415;&#26371;&#39023;&#31034;&#21449;&#34399; (&#10007;)&#12290;</p>
</li>
</ul>
</dd>
<dt>&#24341;&#25806;</dt>
<dd>
<p>&#25033;&#29992;&#31243;&#24335;&#20351;&#29992;&#30340;&#23481;&#22120;&#39006;&#22411;&#12290;&#23481;&#22120;&#39006;&#22411;&#21487;&#20197;&#26159;&#19979;&#21015;&#20219;&#20309;&#39006;&#22411;&#65306;</p>
<ul>
<li>
<p><code>web</code></p>
</li>
<li>
<p><code>webservices</code></p>
</li>
<li>
<p><code>ejb</code></p>
</li>
<li>
<p><code>connector</code></p>
</li>
<li>
<p><code>appclient</code></p>
</li>
<li>
<p><code>weld</code> &mdash; &#29992;&#26044; Java EE &#24179;&#21488;&#25033;&#29992;&#31243;&#24335;&#20043;&#29872;&#22659;&#33287;&#30456;&#20381;&#24615;&#24341;&#20837;&#30340;&#23481;&#22120;</p>
</li>
</ul>
</dd>
</dl>
<p>&#24050;&#24314;&#32622;&#30340;&#25033;&#29992;&#31243;&#24335;&#34920;&#20063;&#21253;&#21547;&#19979;&#21015;&#36984;&#38917;&#12290;</p>
<dl>
<dt>&#24314;&#32622;</dt>
<dd>
<p>&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;&#30340;&#25353;&#37397;&#12290;</p>
</dd>
<dt>&#35299;&#38500;&#24314;&#32622;</dt>
<dd>
<p>&#35299;&#38500;&#24314;&#32622;&#19968;&#25110;&#22810;&#20491;&#25152;&#36984;&#21462;&#25033;&#29992;&#31243;&#24335;&#30340;&#25353;&#37397;&#12290;</p>
<p>&#21462;&#28040;&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;&#26371;&#24478;&#25152;&#26377;&#30446;&#27161;&#33287;&#32178;&#22495;&#20013;&#31227;&#38500;&#25033;&#29992;&#31243;&#24335;&#12290;&#21462;&#28040;&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;&#24460;&#65292;&#22312;&#39023;&#31034; GlassFish Server &#20013;&#24050;&#24314;&#32622;&#20043;&#25152;&#26377;&#25033;&#29992;&#31243;&#24335;&#30340; <a href="../../../common/en/help/ref-applications.html">&#12300;&#25033;&#29992;&#31243;&#24335;&#12301;</a> &#38913;&#38754;&#19978;&#65292;&#20415;&#19981;&#20877;&#21015;&#20986;&#35442;&#25033;&#29992;&#31243;&#24335;&#12290;</p>
<p>&#33509;&#35201;&#21482;&#24478;&#30446;&#21069;&#30340;&#30446;&#27161;&#31227;&#38500;&#25033;&#29992;&#31243;&#24335;&#65292;&#35531;&#20351;&#29992;&#27492;&#38913;&#38754;&#19978;&#30340;&#12300;&#31227;&#38500;&#12301;&#25353;&#37397;&#12290;</p>
</dd>
<dt>&#31227;&#38500;</dt>
<dd>
<p>&#31227;&#38500;&#19968;&#25110;&#22810;&#20491;&#25152;&#36984;&#21462;&#25033;&#29992;&#31243;&#24335;&#30340;&#25353;&#37397;&#12290;</p>
<p>&#31227;&#38500;&#25033;&#29992;&#31243;&#24335;&#21482;&#26371;&#24478;&#30446;&#21069;&#30446;&#27161;&#20013;&#31227;&#38500;&#25033;&#29992;&#31243;&#24335;&#12290;&#24478;&#30446;&#27161;&#20013;&#31227;&#38500;&#25033;&#29992;&#31243;&#24335;&#26178;&#65292;&#22312;&#39023;&#31034; GlassFish Server &#20013;&#24050;&#24314;&#32622;&#20043;&#25152;&#26377;&#25033;&#29992;&#31243;&#24335;&#30340; <a href="../../../common/en/help/ref-applications.html">&#12300;&#25033;&#29992;&#31243;&#24335;&#12301;</a> &#38913;&#38754;&#19978;&#65292;&#20173;&#26371;&#32380;&#32396;&#21015;&#20986;&#35442;&#25033;&#29992;&#31243;&#24335;&#12290;&#22312;&#24050;&#24314;&#32622;&#35442;&#25033;&#29992;&#31243;&#24335;&#30340;&#20219;&#20309;&#20854;&#20182;&#30446;&#27161;&#19978;&#65292;&#35442;&#25033;&#29992;&#31243;&#24335;&#20173;&#28982;&#20445;&#25345;&#24050;&#24314;&#32622;&#29376;&#24907;&#12290;</p>
<p>&#33509;&#35201;&#24478;&#25152;&#26377;&#30446;&#27161;&#33287;&#32178;&#22495;&#20013;&#31227;&#38500;&#25033;&#29992;&#31243;&#24335;&#65292;&#35531;&#20351;&#29992;&#27492;&#38913;&#38754;&#19978;&#30340;&#12300;&#26410;&#24314;&#32622;&#12301;&#25353;&#37397;&#12290;</p>
</dd>
<dt>&#26356;&#22810;&#21205;&#20316;</dt>
<dd>
<p>&#21487;&#23565;&#19968;&#25110;&#22810;&#20491;&#25152;&#36984;&#21462;&#25033;&#29992;&#31243;&#24335;&#22519;&#34892;&#20854;&#20182;&#21205;&#20316;&#30340;&#19979;&#25289;&#24335;&#28165;&#21934;&#12290;</p>
<dl>
<dt>&#21855;&#29992;</dt>
<dd>
<p>&#21855;&#29992;&#19968;&#25110;&#22810;&#20491;&#25152;&#36984;&#21462;&#30340;&#25033;&#29992;&#31243;&#24335;&#12290;</p>
</dd>
<dt>&#20572;&#29992;</dt>
<dd>
<p>&#20572;&#29992;&#19968;&#25110;&#22810;&#20491;&#25152;&#36984;&#21462;&#30340;&#25033;&#29992;&#31243;&#24335;&#12290;</p>
</dd>
<dt>&#36000;&#36617;&#24179;&#34913;&#31243;&#24335;&#21855;&#29992;</dt>
<dd>
<p>&#21855;&#29992;&#19968;&#25110;&#22810;&#20491;&#25152;&#36984;&#21462;&#25033;&#29992;&#31243;&#24335;&#30340;&#36000;&#36617;&#24179;&#34913;&#12290;</p>
</dd>
<dt>&#36000;&#36617;&#24179;&#34913;&#31243;&#24335;&#20572;&#29992;</dt>
<dd>
<p>&#20572;&#29992;&#19968;&#25110;&#22810;&#20491;&#25152;&#36984;&#21462;&#25033;&#29992;&#31243;&#24335;&#30340;&#36000;&#36617;&#24179;&#34913;&#12290;</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref264" name="sthref264"></a>
<h5>&#30456;&#38364;&#20316;&#26989;</h5>
<ul>
<li>
<p><a href="task-cluster-app-deploy.html">&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;&#33267;&#21474;&#38598;</a></p>
</li>
<li>
<p><a href="task-cluster-app-list.html">&#21015;&#20986;&#24314;&#32622;&#33267;&#21474;&#38598;&#30340;&#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-cluster-app-undeploy.html">&#24478;&#21474;&#38598;&#21462;&#28040;&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-cluster-app-remove.html">&#24478;&#21474;&#38598;&#31227;&#38500;&#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-cluster-app-edit.html">&#32232;&#36655;&#24314;&#32622;&#33267;&#21474;&#38598;&#30340;&#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-cluster-app-enable-disable.html">&#21855;&#29992;&#25110;&#20572;&#29992;&#24314;&#32622;&#33267;&#21474;&#38598;&#30340;&#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-cluster-app-lb-enable-disable.html">&#21855;&#29992;&#25110;&#20572;&#29992;&#24314;&#32622;&#33267;&#21474;&#38598;&#20043;&#25033;&#29992;&#31243;&#24335;&#30340;&#36000;&#36617;&#24179;&#34913;</a></p>
</li>
</ul>
<a id="sthref265" name="sthref265"></a>
<h5>&#31561;&#25928; asadmin &#23376;&#21629;&#20196;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00114"><code>deploy</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00116"><code>disable</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00118"><code>disable-http-lb-application</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00124"><code>enable</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00126"><code>enable-http-lb-application</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00148"><code>list-applications</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
