<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-gmscluster" name="task-gmscluster"></a><a id="GHCLU00079" name="GHCLU00079"></a></p>

<h4><a id="sthref220" name="sthref220"></a>&#32068;&#24907;&#21474;&#38598;&#30340;&#32676;&#32068;&#31649;&#29702;&#26381;&#21209;&#35373;&#23450;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#32676;&#32068;&#31649;&#29702;&#26381;&#21209; (GMS) &#26159;&#19968;&#31278;&#36914;&#31243;&#26381;&#21209;&#65292;&#21487;&#25552;&#20379;&#21474;&#38598;&#30435;&#35222;&#12289;&#21474;&#38598;&#25104;&#21729;&#36523;&#20221;&#21644;&#32676;&#32068;&#36890;&#35338;&#26381;&#21209;&#12290;GMS &#26371;&#22519;&#34892;&#19979;&#21015;&#21151;&#33021;&#65306;</p>
<ul>
<li>
<p>&#24478;&#21474;&#38598;&#22686;&#21152;&#25110;&#31227;&#38500;&#19968;&#25110;&#22810;&#20491;&#25104;&#21729;&#22519;&#34892;&#34389;&#29702;&#65292;&#25110;&#32773;&#19968;&#25110;&#22810;&#20491;&#25104;&#21729;&#22519;&#34892;&#34389;&#29702;&#30097;&#20284;&#25925;&#38556;&#25110;&#30906;&#35469;&#25925;&#38556;&#26178;&#65292;&#26371;&#36890;&#30693;&#24050;&#22312; GlassFish Server &#22519;&#34892;&#34389;&#29702;&#20013;&#35387;&#20874;&#30340;&#27169;&#32068;&#12290;</p>
</li>
<li>
<p>&#22312;&#21474;&#38598;&#25104;&#21729;&#20043;&#38291;&#20659;&#36865;&#21644;&#25509;&#25910;&#35338;&#24687;&#12290;</p>
</li>
</ul>
<ol>
<li>
<p>&#22312;&#28687;&#35261;&#27193;&#29376;&#32080;&#27083;&#20013;&#65292;&#23637;&#38283;&#12300;&#21474;&#38598;&#12301;&#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#35201;&#28858;&#20854;&#32068;&#24907;&#32676;&#32068;&#31649;&#29702;&#26381;&#21209; (GMS) &#35373;&#23450;&#30340;&#21474;&#38598;&#12290;</p>
<p>&#27492;&#26178;&#23559;&#38283;&#21855;&#21474;&#38598;&#30340;&#12300;&#19968;&#33324;&#36039;&#35338;&#12301;&#38913;&#38754;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;GMS &#24050;&#21855;&#29992;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#28858;&#21474;&#38598;&#21855;&#29992; GMS&#12290;</p>
<p>&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#36984;&#21462;&#12290;&#33509;&#35201;&#20572;&#29992;&#21474;&#38598;&#30340; GMS&#65292;&#35531;&#21462;&#28040;&#21246;&#36984;&#12300;GMS &#24050;&#21855;&#29992;&#12301;&#26680;&#21462;&#26041;&#22602;&#12290;</p>
<p>&#22914;&#26524;&#21855;&#29992;&#65292;&#23601;&#26371;&#22312;&#21474;&#38598;&#33287;&#32178;&#22495;&#31649;&#29702;&#20282;&#26381;&#22120;(DAS) &#30340;&#27599;&#20491;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#20013;&#21855;&#21205;&#32676;&#32068;&#31649;&#29702;&#26381;&#21209;&#12290;DAS &#26371;&#21443;&#33287;&#27599;&#20491;&#24050;&#21855;&#29992; GMS &#30340;&#21474;&#38598;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#22810;&#37325;&#25773;&#36865;&#36899;&#25509;&#22496;&#12301;&#27396;&#20301;&#20013;&#65292;&#36664;&#20837;&#32676;&#32068;&#31649;&#29702;&#26381;&#21209;&#29992;&#20358;&#30435;&#32893;&#32676;&#32068;&#20107;&#20214;&#30340;&#36899;&#25509;&#22496;&#12290;</p>
<p>&#25351;&#23450;&#27161;&#28310; UDP &#36899;&#25509;&#22496;&#34399;&#30908;&#65292;&#31684;&#22285;&#20171;&#26044; 2048-49151 &#20043;&#38291;&#12290;&#38928;&#35373;&#20540;&#28858;&#33258;&#21205;&#29986;&#29983;&#30340;&#20540; (&#20171;&#26044;&#27492;&#31684;&#22285;&#20839;)&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#22810;&#37325;&#25773;&#36865;&#20301;&#22336;&#12301;&#27396;&#20301;&#20013;&#65292;&#36664;&#20837;&#32676;&#32068;&#31649;&#29702;&#26381;&#21209;&#29992;&#20358;&#30435;&#32893;&#32676;&#32068;&#20107;&#20214;&#30340;&#20301;&#22336;&#12290;</p>
<p>&#25351;&#23450;&#39006;&#21029; D IP &#22810;&#37325;&#25773;&#36865;&#20301;&#22336;&#12290;&#39006;&#21029; D IP &#20301;&#22336;&#30340;&#31684;&#22285;&#26159; <code>224.0.0.0</code> &#21040; <code>239.255.255.255</code> (&#21547;)&#12290;&#20301;&#22336; <code>224.0.0.0</code> &#28858;&#20445;&#30041;&#20301;&#22336;&#65292;&#19981;&#21487;&#20351;&#29992;&#12290;&#38928;&#35373;&#20540;&#26159; 228.9.<i>XX</i>.<i>YY</i>&#65292;&#20854;&#20013; <i>XX</i> &#33287; <i>YY</i> &#26159;&#33258;&#21205;&#29986;&#29983;&#30340;&#29544;&#31435;&#20540; (&#20171;&#26044; 0 &#33267; 255 &#20043;&#38291;)&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#36899;&#32080;&#20171;&#38754;&#20301;&#22336;&#12301;&#27396;&#20301;&#20013;&#65292;&#36664;&#20837;&#32676;&#32068;&#31649;&#29702;&#26381;&#21209;&#30340;&#32178;&#36335;&#20171;&#38754;&#20301;&#22336; (&#22914;&#26524;&#26377;&#22810;&#20491;&#32178;&#36335;&#20171;&#38754;)&#12290;</p>
<p>&#22914;&#26524;&#21474;&#38598;&#20839;&#35351;&#31649;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#30340;&#20219;&#19968;&#27231;&#22120;&#19978;&#26377;&#22810;&#20491;&#32178;&#36335;&#20171;&#38754;&#65292;&#21063;&#27492;&#35373;&#23450;&#21487;&#35731;&#24744;&#32068;&#24907;&#23559;&#21738;&#20491;&#32178;&#36335;&#20171;&#38754;&#29992;&#26044; GMS&#12290;&#27492;&#20540;&#24517;&#38920;&#26159;&#26412;&#27231;&#32178;&#36335;&#20171;&#38754; IP &#20301;&#22336;&#12290;&#20381;&#38928;&#35373;&#65292;&#26371;&#20351;&#29992;&#25152;&#26377;&#20844;&#29992;&#32178;&#36335;&#20171;&#38754;&#20301;&#22336;&#12290;</p>
<p>&#33509;&#35201;&#25351;&#23450;&#21474;&#38598;&#20013;&#25152;&#26377; GlassFish Server &#22519;&#34892;&#34389;&#29702;&#30340;&#26377;&#25928;&#20301;&#22336;&#65292;&#35531;&#20351;&#29992;&#31995;&#32113;&#29305;&#24615;&#20358;&#28858;&#27599;&#20491;&#22519;&#34892;&#34389;&#29702;&#20491;&#21029;&#35373;&#23450;&#20301;&#22336;&#12290;</p>
<p>&#20363;&#22914;&#65292;&#22312; DAS &#19978;&#24314;&#31435;&#31995;&#32113;&#29305;&#24615; <code>GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i>&#12290;&#28982;&#24460;&#23559;&#27492;&#12300;&#36899;&#32080;&#20171;&#38754;&#20301;&#22336;&#12301;&#36984;&#38917;&#35373;&#23450;&#28858; <code>${GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i><code>}</code> &#20197;&#25351;&#23450;&#31995;&#32113;&#29305;&#24615;&#12290;&#26368;&#24460;&#65292;&#37341;&#23565;&#21474;&#38598;&#20013;&#30340;&#27599;&#20491;&#22519;&#34892;&#34389;&#29702;&#65292;&#23559; <code>GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i> &#31995;&#32113;&#29305;&#24615;&#35373;&#23450;&#28858;&#22519;&#34892;&#34389;&#29702;&#27231;&#22120;&#19978;&#25152;&#38656;&#30340;&#32178;&#36335;&#20171;&#38754;&#20301;&#22336;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#25351;&#23450;&#20854;&#20182;&#29305;&#24615;&#65292;&#35531;&#36984;&#21462;&#12300;&#29305;&#24615;&#12301;&#27161;&#31844;&#21644;&#12300;&#21474;&#38598;&#29305;&#24615;&#12301;&#23376;&#27161;&#31844;&#12290;</p>
<ul>
<li>
<p>&#33509;&#35201;&#22686;&#21152;&#29305;&#24615;&#65292;&#35531;&#25353;&#19968;&#19979;&#12300;&#22686;&#21152;&#29305;&#24615;&#12301;&#25353;&#37397;&#12290;&#22312;&#20986;&#29694;&#30340;&#31354;&#30333;&#21015;&#20013;&#65292;&#26044;&#12300;&#21517;&#31281;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#21517;&#31281;&#65292;&#28982;&#24460;&#22312;&#12300;&#20540;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#20540;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#20462;&#25913;&#29305;&#24615;&#65292;&#35531;&#32232;&#36655;&#29305;&#24615;&#30340;&#12300;&#20540;&#12301;&#27396;&#20301;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#21034;&#38500;&#29305;&#24615;&#65292;&#35531;&#36984;&#21462;&#24744;&#35201;&#21034;&#38500;&#20043;&#29305;&#24615;&#12300;&#21517;&#31281;&#12301;&#27396;&#20301;&#24038;&#20596;&#30340;&#26680;&#21462;&#26041;&#22602;&#65292;&#28982;&#24460;&#25353;&#19968;&#19979;&#12300;&#21034;&#38500;&#29305;&#24615;&#12301;&#25353;&#37397;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#25353;&#19968;&#19979;&#12300;&#20786;&#23384;&#12301;&#12290;</p>
</li>
</ol>
<a id="sthref221" name="sthref221"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-gmsenable.html">&#21855;&#29992;&#32676;&#32068;&#31649;&#29702;&#26381;&#21209;</a></p>
</li>
<li>
<p><a href="task-gms.html">&#32068;&#24907;&#32676;&#32068;&#31649;&#29702;&#26381;&#21209;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
