<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-upgrade-components" name="task-upgrade-components"></a><a id="GHCLU00044" name="GHCLU00044"></a></p>

<h4><a id="sthref62" name="sthref62"></a><a id="sthref63" name="sthref63"></a><a id="sthref64" name="sthref64"></a><a id="sthref65" name="sthref65"></a>&#21319;&#32026;&#20803;&#20214;&#32780;&#19981;&#20013;&#26039;&#26381;&#21209;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#22312;&#21474;&#38598;&#29872;&#22659;&#20013;&#65292;&#36650;&#27969;&#21319;&#32026;&#21487;&#22312;&#25613;&#22833;&#26368;&#23569;&#26381;&#21209;&#33287;&#38542;&#27573;&#20316;&#26989;&#30340;&#29376;&#27841;&#19979;&#65292;&#37325;&#26032;&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;&#12290;&#38542;&#27573;&#20316;&#26989;&#26159;&#20219;&#20309;&#21487;&#20197;&#37325;&#35079;&#30340;&#24037;&#20214;&#65292;&#20363;&#22914;&#65306;</p>
<ul>
<li>
<p><code>HttpSession</code></p>
</li>
<li>
<p><code>SingleSignOn</code></p>
</li>
<li>
<p><code>ServletTimer</code></p>
</li>
<li>
<p><code>DialogFragment</code></p>
</li>
<li>
<p>&#26377;&#29376;&#24907;&#30340;&#38542;&#27573;&#20316;&#26989; Bean</p>
</li>
</ul>
<p>&#22312; GlassFish Server &#20013;&#65292;&#24744;&#21487;&#20197;&#20351;&#29992;&#36000;&#36617;&#24179;&#34913;&#22120;&#21644;&#22810;&#20491;&#21474;&#38598;&#20358;&#21319;&#32026;&#20803;&#20214;&#65292;&#32780;&#19981;&#20351;&#26381;&#21209;&#21463;&#21040;&#20219;&#20309;&#25613;&#22833;&#12290;&#20363;&#22914;&#65292;&#20803;&#20214;&#21487;&#20197;&#26159; JVM &#27231;&#22120;&#12289;GlassFish Server &#36575;&#39636;&#25110; Web &#25033;&#29992;&#31243;&#24335;&#12290;</p>
<p>&#36650;&#27969;&#21319;&#32026;&#21487;&#22312;&#36000;&#36617;&#36611;&#23567;&#25110;&#36969;&#20013;&#26178;&#36914;&#34892;&#12290;&#23565;&#26044;&#27599;&#20491; GlassFish Server &#22519;&#34892;&#34389;&#29702;&#65292;&#35442;&#31243;&#24207;&#38656;&#26178;&#32004; 10-15 &#20998;&#37912;&#12290;</p>
<p>&#25033;&#29992;&#31243;&#24335;&#22312;&#21319;&#32026;&#36942;&#31243;&#20013;&#24517;&#38920;&#30456;&#23481;&#12290;&#22240;&#28858;&#22312;&#36681;&#25563;&#26399;&#38291;&#65292;&#26576;&#20123;&#22519;&#34892;&#34389;&#29702;&#26371;&#22519;&#34892;&#33290;&#29256;&#25033;&#29992;&#31243;&#24335;&#65292;&#32780;&#26576;&#20123;&#22519;&#34892;&#34389;&#29702;&#26371;&#22519;&#34892;&#26032;&#29256;&#25033;&#29992;&#31243;&#24335;&#65292;&#25152;&#20197;&#36889;&#20123;&#25033;&#29992;&#31243;&#24335;&#24517;&#38920;&#33021;&#22816;&#27491;&#30906;&#36939;&#20316;&#12290;&#33290;&#29256;&#21644;&#26032;&#29256;&#25033;&#29992;&#31243;&#24335;&#24517;&#38920;&#20855;&#26377;&#30456;&#21516;&#24418;&#24335;&#30340;&#21487;&#20018;&#21015;&#21270;&#39006;&#21029;&#65292;&#32780;&#36889;&#20123;&#21487;&#20018;&#21015;&#21270;&#39006;&#21029;&#26159;&#29992;&#20358;&#24418;&#25104;&#38542;&#27573;&#20316;&#26989;&#20013;&#20786;&#23384;&#30340;&#29289;&#20214;&#22294;&#24418; (&#20363;&#22914;&#38750;&#30636;&#26178;&#22519;&#34892;&#34389;&#29702;&#35722;&#25976;)&#12290;&#22914;&#26524;&#24517;&#38920;&#35722;&#26356;&#36889;&#20123;&#39006;&#21029;&#30340;&#24418;&#24335;&#65292;&#25033;&#29992;&#31243;&#24335;&#38283;&#30332;&#20154;&#21729;&#23601;&#24517;&#38920;&#30906;&#20445;&#26371;&#30332;&#29983;&#27491;&#30906;&#30340;&#20018;&#21015;&#21270;&#34892;&#28858;&#12290;&#22914;&#26524;&#25033;&#29992;&#31243;&#24335;&#22312;&#21319;&#32026;&#36942;&#31243;&#20013;&#19981;&#30456;&#23481;&#65292;&#23601;&#24517;&#38920;&#20572;&#27490;&#21474;&#38598;&#20197;&#36914;&#34892;&#23436;&#25972;&#30340;&#37325;&#26032;&#24314;&#32622;&#12290;</p>
<p>&#22914;&#26524;&#25033;&#29992;&#31243;&#24335;&#21319;&#32026;&#28041;&#21450;&#35722;&#26356;&#25033;&#29992;&#31243;&#24335;&#36039;&#26009;&#24235;&#32177;&#35201;&#65292;&#21063;&#28961;&#27861;&#20351;&#29992;&#36889;&#31278;&#26041;&#27861;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
&#28858;&#20102;&#38450;&#27490;&#38542;&#27573;&#20316;&#26989;&#23481;&#37679;&#31227;&#36681;&#26178;&#30332;&#29983;&#29256;&#26412;&#19981;&#30456;&#31526;&#30340;&#39080;&#38570;&#65292;&#35531;&#21516;&#26178;&#21319;&#32026;&#21474;&#38598;&#20013;&#30340;&#25152;&#26377;&#22519;&#34892;&#34389;&#29702;&#12290;&#21542;&#21063;&#65292;&#38542;&#27573;&#20316;&#26989;&#21487;&#33021;&#26371;&#23481;&#37679;&#31227;&#36681;&#33267;&#22519;&#34892;&#19981;&#21516;&#20803;&#20214;&#29256;&#26412;&#30340;&#22519;&#34892;&#34389;&#29702;&#12290;<br />
<hr>

<p>&#35531;&#23565;&#27599;&#20491;&#21474;&#38598;&#20998;&#21029;&#22519;&#34892;&#27492;&#20316;&#26989;&#12290;&#21474;&#38598;&#21487;&#20570;&#28858;&#21474;&#38598;&#20013;&#22519;&#34892;&#34389;&#29702;&#30340;&#38542;&#27573;&#20316;&#26989;&#23481;&#37679;&#31227;&#36681;&#23433;&#20840;&#30028;&#38480;&#12290;&#26576;&#20491;&#21474;&#38598;&#20839;&#30340;&#38542;&#27573;&#20316;&#26989;&#32085;&#23565;&#19981;&#26371;&#23481;&#37679;&#31227;&#36681;&#33267;&#21478;&#19968;&#20491;&#21474;&#38598;&#20013;&#30340;&#38542;&#27573;&#20316;&#26989;&#12290;&#24478;&#32780;&#36991;&#20813;&#20102;&#29256;&#26412;&#19981;&#30456;&#31526;&#30340;&#39080;&#38570;&#12290;</p>
<ol>
<li>
<p>&#20572;&#27490;&#21474;&#38598;&#12290;</p>
<p>&#35531;&#21443;&#38321;<a href="task-stop-cluster.html">&#20572;&#27490;&#21474;&#38598;</a>&#12290;</p>
</li>
<li>
<p>&#21319;&#32026;&#35442;&#21474;&#38598;&#20013;&#30340;&#20803;&#20214;&#12290;</p>
</li>
<li>
<p>&#21855;&#21205;&#21474;&#38598;&#12290;</p>
<p>&#35531;&#21443;&#38321;<a href="task-start-cluster.html">&#21855;&#21205;&#21474;&#38598;</a>&#12290;</p>
</li>
</ol>
<a id="sthref66" name="sthref66"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-create-cluster.html">&#24314;&#31435;&#21474;&#38598;</a></p>
</li>
<li>
<p><a href="task-delete-cluster.html">&#21034;&#38500;&#21474;&#38598;</a></p>
</li>
<li>
<p><a href="task-availabilityservice.html">&#32068;&#24907;&#21474;&#38598;&#30340;&#21487;&#29992;&#24615;&#35373;&#23450;</a></p>
</li>
<li>
<p><a href="task-start-cluster.html">&#21855;&#21205;&#21474;&#38598;</a></p>
</li>
<li>
<p><a href="task-stop-cluster.html">&#20572;&#27490;&#21474;&#38598;</a></p>
</li>
<li>
<p><a href="task-modify-cluster-config.html">&#20462;&#25913;&#21474;&#38598;&#30340;&#32068;&#24907;</a></p>
</li>
<li>
<p><a href="task-cluster-app-deploy.html">&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;&#33267;&#21474;&#38598;</a></p>
</li>
<li>
<p><a href="task-cluster-app-list.html">&#21015;&#20986;&#24314;&#32622;&#33267;&#21474;&#38598;&#30340;&#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-cluster-app-undeploy.html">&#24478;&#21474;&#38598;&#21462;&#28040;&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-cluster-app-remove.html">&#24478;&#21474;&#38598;&#31227;&#38500;&#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-cluster-app-edit.html">&#32232;&#36655;&#24314;&#32622;&#33267;&#21474;&#38598;&#30340;&#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-cluster-app-enable-disable.html">&#21855;&#29992;&#25110;&#20572;&#29992;&#24314;&#32622;&#33267;&#21474;&#38598;&#30340;&#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-cluster-app-lb-enable-disable.html">&#21855;&#29992;&#25110;&#20572;&#29992;&#24314;&#32622;&#33267;&#21474;&#38598;&#20043;&#25033;&#29992;&#31243;&#24335;&#30340;&#36000;&#36617;&#24179;&#34913;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-create.html">&#24314;&#31435;&#21474;&#38598;&#30340;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-display.html">&#21015;&#20986;&#21474;&#38598;&#30340;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-enable-disable.html">&#20840;&#22495;&#21855;&#29992;&#25110;&#20572;&#29992;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-edit.html">&#32232;&#36655;&#21474;&#38598;&#30340;&#36039;&#28304;</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
