<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-create-cluster" name="task-create-cluster"></a><a id="GHCLU00027" name="GHCLU00027"></a></p>

<h4><a id="sthref2" name="sthref2"></a>&#24314;&#31435;&#21474;&#38598;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#21474;&#38598;&#26159;&#20849;&#29992;&#30456;&#21516;&#25033;&#29992;&#31243;&#24335;&#12289;&#36039;&#28304;&#21644;&#32068;&#24907;&#36039;&#35338;&#30340;&#24050;&#21629;&#21517; GlassFish Server &#22519;&#34892;&#34389;&#29702;&#38598;&#21512;&#12290;</p>
<p>&#21474;&#38598;&#21487;&#36879;&#36942;&#24310;&#23637;&#24615;&#12289;&#36000;&#36617;&#24179;&#34913;&#21644;&#25925;&#38556;&#20445;&#35703;&#20358;&#25552;&#20379;&#39640;&#21487;&#29992;&#24615;&#12290;&#21474;&#38598;&#20013;&#30340;&#22519;&#34892;&#34389;&#29702;&#25110;&#20027;&#27231;&#25925;&#38556;&#26178;&#65292;GlassFish Server &#26371;&#20597;&#28204;&#21040;&#35442;&#25925;&#38556;&#65292;&#20006;&#23559;&#35531;&#27714;&#24478;&#25925;&#38556;&#22519;&#34892;&#34389;&#29702;&#37325;&#26032;&#23566;&#21521;&#33267;&#21474;&#38598;&#20013;&#30340;&#20854;&#20182;&#22519;&#34892;&#34389;&#29702;&#65292;&#28982;&#24460;&#24489;&#21407;&#20351;&#29992;&#32773;&#38542;&#27573;&#20316;&#26989;&#29376;&#24907;&#12290;&#22240;&#28858;&#30456;&#21516;&#25033;&#29992;&#31243;&#24335;&#21644;&#36039;&#28304;&#22343;&#20301;&#26044;&#21474;&#38598;&#20013;&#30340;&#25152;&#26377;&#22519;&#34892;&#34389;&#29702;&#19978;&#65292;&#22240;&#27492;&#22519;&#34892;&#34389;&#29702;&#21487;&#20197;&#23481;&#37679;&#31227;&#36681;&#33267;&#21474;&#38598;&#20013;&#30340;&#20219;&#20309;&#20854;&#20182;&#22519;&#34892;&#34389;&#29702;&#12290;</p>
<p>&#28961;&#35542;&#22519;&#34892;&#34389;&#29702;&#26159;&#20301;&#26044;&#21516;&#19968;&#20027;&#27231;&#36996;&#26159;&#19981;&#21516;&#20027;&#27231;&#65292;GlassFish Server &#37117;&#33021;&#35731;&#24744;&#24478;&#21934;&#19968;&#20027;&#27231;&#20197;&#21934;&#19968;&#21934;&#20803;&#30340;&#26041;&#24335;&#31649;&#29702;&#21474;&#38598;&#20013;&#30340;&#25152;&#26377;&#22519;&#34892;&#34389;&#29702;&#12290;</p>
<a id="sthref3" name="sthref3"></a>
<h5>&#38283;&#22987;&#21069;</h5>
<p>&#22914;&#26524;&#24744;&#25171;&#31639;&#23559; GlassFish Server &#22519;&#34892;&#34389;&#29702;&#22686;&#21152;&#33267;&#24744;&#35201;&#24314;&#31435;&#30340;&#21474;&#38598;&#65292;&#35531;&#30906;&#35469;&#22519;&#34892;&#34389;&#29702;&#35201;&#20301;&#26044;&#30340;&#31680;&#40670;&#24050;&#32147;&#23384;&#22312;&#12290;</p>
<ol>
<li>
<p>&#22312;&#28687;&#35261;&#27193;&#29376;&#32080;&#27083;&#20013;&#65292;&#36984;&#21462;&#12300;&#21474;&#38598;&#12301;&#31680;&#40670;&#12290;</p>
<p>&#27492;&#26178;&#23559;&#38283;&#21855;&#12300;&#21474;&#38598;&#12301;&#38913;&#38754;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#21474;&#38598;&#12301;&#38913;&#38754;&#19978;&#65292;&#25353;&#19968;&#19979;&#12300;&#26032;&#22686;&#12301;&#12290;</p>
<p>&#27492;&#26178;&#23559;&#38283;&#21855;&#12300;&#26032;&#24314;&#21474;&#38598;&#12301;&#38913;&#38754;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#21474;&#38598;&#21517;&#31281;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#21474;&#38598;&#30340;&#21517;&#31281;&#12290;</p>
<p>&#21517;&#31281;&#24517;&#38920;&#31526;&#21512;&#19979;&#21015;&#38656;&#27714;&#65306;</p>
<ul>
<li>
<p>&#21517;&#31281;&#21482;&#33021;&#21253;&#21547; ASCII &#23383;&#20803;&#12290;</p>
</li>
<li>
<p>&#21517;&#31281;&#24517;&#38920;&#20197;&#23383;&#27597;&#12289;&#25976;&#23383;&#25110;&#24213;&#32218;&#28858;&#38283;&#38957;&#12290;</p>
</li>
<li>
<p>&#21517;&#31281;&#21482;&#33021;&#21253;&#21547;&#19979;&#21015;&#23383;&#20803;&#65306;</p>
<ul>
<li>
<p>&#23567;&#23531;&#23383;&#27597;</p>
</li>
<li>
<p>&#22823;&#23531;&#23383;&#27597;</p>
</li>
<li>
<p>&#25976;&#23383;</p>
</li>
<li>
<p>&#36899;&#23383;&#31526;</p>
</li>
<li>
<p>&#23567;&#25976;&#40670;&#34399;</p>
</li>
<li>
<p>&#24213;&#32218;</p>
</li>
</ul>
</li>
<li>
<p>&#21517;&#31281;&#22312;&#32178;&#22495;&#20013;&#24517;&#38920;&#26159;&#21807;&#19968;&#30340;&#65292;&#19988;&#19981;&#24471;&#28858;&#21478;&#19968;&#20491;&#21474;&#38598;&#12289;&#24050;&#21629;&#21517;&#32068;&#24907;&#12289;GlassFish Server &#22519;&#34892;&#34389;&#29702;&#25110;&#31680;&#40670;&#30340;&#21517;&#31281;&#12290;</p>
</li>
<li>
<p>&#21517;&#31281;&#19981;&#24471;&#28858; <code>domain</code>&#12289;<code>server</code> &#25110; GlassFish Server &#25152;&#20445;&#30041;&#30340;&#20219;&#20309;&#20854;&#20182;&#38364;&#37749;&#23383;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#24478;&#12300;&#32068;&#24907;&#12301;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#21474;&#38598;&#23559;&#20351;&#29992;&#30340;&#24050;&#21629;&#21517;&#32068;&#24907;&#12290;</p>

<hr>
<p><b>&#20633;&#35387;:</b></p>
&#22914;&#26524;&#24744;&#36984;&#21462; <code>default-config</code>&#65292;&#23601;&#24517;&#38920;&#22312;&#19979;&#20491;&#27493;&#39519;&#20013;&#23559;&#32068;&#24907;&#25351;&#23450;&#28858;<i>&#19981;</i>&#20849;&#29992;&#12290;<code>default-config</code> &#32068;&#24907;&#28961;&#27861;&#20849;&#29992;&#12290;
<hr>

</li>
<li>
<p>&#25351;&#23450;&#26159;&#21542;&#35201;&#20849;&#29992;&#21474;&#38598;&#23559;&#20351;&#29992;&#30340;&#32068;&#24907;&#12290;</p>
<ul>
<li>
<p>&#22914;&#26524;&#19981;&#20849;&#29992;&#32068;&#24907;&#65292;&#35531;&#20445;&#30041;&#36984;&#21462;&#12300;&#35079;&#35069;&#36984;&#21462;&#30340;&#32068;&#24907;&#12301;&#36984;&#38917;&#12290;</p>
<p>&#24314;&#31435;&#21474;&#38598;&#26178;&#65292;&#26371;&#35079;&#35069;&#36984;&#21462;&#30340;&#32068;&#24907;&#12290;&#28858;&#32068;&#24907;&#21103;&#26412;&#25351;&#23450;&#30340;&#21517;&#31281;&#26159; cluster-name<code>-config</code>&#65292;&#20854;&#20013; <i>cluster-name</i> &#26159;&#24744;&#35201;&#24314;&#31435;&#30340;&#21474;&#38598;&#21517;&#31281;&#12290;</p>
</li>
<li>
<p>&#22914;&#26524;&#20849;&#29992;&#32068;&#24907;&#65292;&#35531;&#36984;&#21462;&#12300;&#21443;&#29031;&#36984;&#21462;&#30340;&#32068;&#24907;&#12301;&#36984;&#38917;&#12290;</p>
<p>&#21474;&#38598;&#23559;&#20351;&#29992;&#25351;&#23450;&#30340;&#29694;&#26377;&#24050;&#21629;&#21517;&#32068;&#24907;&#12290;</p>
</li>
</ul>
</li>
<li>
<p><a id="sthref4" name="sthref4"></a>&#23559; GlassFish Server &#22519;&#34892;&#34389;&#29702;&#26032;&#22686;&#33267;&#21474;&#38598;&#12290;</p>

<hr>
<p><b>&#20633;&#35387;:</b></p>
&#33509;&#35201;&#22312;&#39006;&#22411;&#28858; CONFIG &#19988;&#20195;&#34920;&#36960;&#31471;&#20027;&#27231;&#30340;&#31680;&#40670;&#19978;&#24314;&#31435;&#22519;&#34892;&#34389;&#29702;&#65292;&#24744;&#24517;&#38920;&#20351;&#29992; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00044"><code>create-local-instance</code>(1)</a> &#23376;&#21629;&#20196;&#12290;&#24744;&#28961;&#27861;&#20351;&#29992; &#31649;&#29702;&#20027;&#25511;&#21488; &#20358;&#36948;&#25104;&#27492;&#30446;&#30340;&#12290;
<hr>

<p>&#24744;&#20063;&#21487;&#20197;&#22312;&#24314;&#31435;&#21474;&#38598;&#24460;&#22686;&#21152;&#22519;&#34892;&#34389;&#29702; (&#22914;<a href="task-create-clustered-instance.html">&#23559; GlassFish Server &#22519;&#34892;&#34389;&#29702;&#26032;&#22686;&#33267;&#21474;&#38598;</a>&#25152;&#36848;)&#12290;</p>
<p>&#22686;&#21152;&#21508;&#20491;&#22519;&#34892;&#34389;&#29702;&#65292;&#22914;&#19979;&#25152;&#31034;&#65306;</p>
<ol type="a">
<li>
<p>&#22312;&#12300;&#35201;&#24314;&#31435;&#30340;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#12301;&#21312;&#22495;&#65292;&#25353;&#19968;&#19979;&#12300;&#22686;&#21152;&#12301;&#12290;</p>
<p>&#38568;&#21363;&#26371;&#22312;&#21474;&#38598;&#20839;&#30340;&#22519;&#34892;&#34389;&#29702;&#34920;&#20013;&#22686;&#21152;&#19968;&#21015;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#22519;&#34892;&#34389;&#29702;&#21517;&#31281;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#22519;&#34892;&#34389;&#29702;&#30340;&#21517;&#31281;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#21152;&#27402;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#34920;&#31034;&#22519;&#34892;&#34389;&#29702;&#36000;&#36617;&#24179;&#34913;&#21152;&#27402;&#30340;&#25972;&#25976;&#12290;</p>
<p>&#36000;&#36617;&#24179;&#34913;&#21152;&#27402;&#21487;&#27770;&#23450;&#36865;&#33267;&#21474;&#38598;&#20379;&#22519;&#34892;&#34389;&#29702;&#34389;&#29702;&#20043;&#25152;&#26377;&#35531;&#27714;&#30340;&#27604;&#20363;&#12290;</p>
<p>&#20363;&#22914;&#65292;&#22312;&#26377;&#20841;&#20491;&#22519;&#34892;&#34389;&#29702;&#30340;&#21474;&#38598;&#20013;&#65292;&#24744;&#21487;&#33021;&#38656;&#35201;&#35731;&#20854;&#20013;&#19968;&#20491;&#22519;&#34892;&#34389;&#29702;&#34389;&#29702;&#27599;&#22235;&#20491;&#35531;&#27714;&#20013;&#30340;&#19968;&#20491;&#35531;&#27714;&#65292;&#32780;&#35731;&#21478;&#19968;&#20491;&#22519;&#34892;&#34389;&#29702;&#34389;&#29702;&#27599;&#22235;&#20491;&#35531;&#27714;&#20013;&#30340;&#19977;&#20491;&#35531;&#27714;&#12290;&#22312;&#36889;&#31278;&#24773;&#27841;&#19979;&#65292;&#21487;&#23559;&#34389;&#29702;&#27599;&#22235;&#20491;&#35531;&#27714;&#20013;&#20043;&#19968;&#20491;&#35531;&#27714;&#30340;&#22519;&#34892;&#34389;&#29702;&#21152;&#27402;&#35373;&#23450;&#28858; 1&#65292;&#23559;&#21478;&#19968;&#20491;&#22519;&#34892;&#34389;&#29702;&#21152;&#27402;&#35373;&#23450;&#28858; 3&#12290;&#22914;&#26524;&#24744;&#35201;&#20351;&#29992;&#30334;&#20998;&#27604;&#65292;&#35531;&#23559;&#36889;&#20841;&#20491;&#22519;&#34892;&#34389;&#29702;&#30340;&#21152;&#27402;&#20998;&#21029;&#35373;&#23450;&#28858; 25 &#33287; 75&#12290;</p>
<p>&#38928;&#35373;&#21152;&#27402;&#28858; 100&#12290;</p>
</li>
<li>
<p>&#24478;&#12300;&#31680;&#40670;&#12301;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#22519;&#34892;&#34389;&#29702;&#35201;&#20301;&#26044;&#30340;&#31680;&#40670;&#12290;</p>
</li>
</ol>
</li>
<li>
<p>&#25353;&#19968;&#19979;&#12300;&#30906;&#23450;&#12301;&#12290;</p>
<p>&#24744;&#26371;&#22238;&#21040;&#12300;&#21474;&#38598;&#12301;&#38913;&#38754;&#12290;&#21474;&#38598;&#26371;&#22686;&#21152;&#33267;&#35442;&#38913;&#38754;&#30340;&#21474;&#38598;&#34920;&#12290;</p>
</li>
</ol>
<a id="sthref5" name="sthref5"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-delete-cluster.html">&#21034;&#38500;&#21474;&#38598;</a></p>
</li>
<li>
<p><a href="task-availabilityservice.html">&#32068;&#24907;&#21474;&#38598;&#30340;&#21487;&#29992;&#24615;&#35373;&#23450;</a></p>
</li>
<li>
<p><a href="task-start-cluster.html">&#21855;&#21205;&#21474;&#38598;</a></p>
</li>
<li>
<p><a href="task-stop-cluster.html">&#20572;&#27490;&#21474;&#38598;</a></p>
</li>
<li>
<p><a href="task-modify-cluster-config.html">&#20462;&#25913;&#21474;&#38598;&#30340;&#32068;&#24907;</a></p>
</li>
<li>
<p><a href="task-cluster-app-deploy.html">&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;&#33267;&#21474;&#38598;</a></p>
</li>
<li>
<p><a href="task-cluster-app-list.html">&#21015;&#20986;&#24314;&#32622;&#33267;&#21474;&#38598;&#30340;&#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-cluster-app-undeploy.html">&#24478;&#21474;&#38598;&#21462;&#28040;&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-cluster-app-remove.html">&#24478;&#21474;&#38598;&#31227;&#38500;&#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-cluster-app-edit.html">&#32232;&#36655;&#24314;&#32622;&#33267;&#21474;&#38598;&#30340;&#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-cluster-app-enable-disable.html">&#21855;&#29992;&#25110;&#20572;&#29992;&#24314;&#32622;&#33267;&#21474;&#38598;&#30340;&#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-cluster-app-lb-enable-disable.html">&#21855;&#29992;&#25110;&#20572;&#29992;&#24314;&#32622;&#33267;&#21474;&#38598;&#20043;&#25033;&#29992;&#31243;&#24335;&#30340;&#36000;&#36617;&#24179;&#34913;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-create.html">&#24314;&#31435;&#21474;&#38598;&#30340;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-display.html">&#21015;&#20986;&#21474;&#38598;&#30340;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-enable-disable.html">&#20840;&#22495;&#21855;&#29992;&#25110;&#20572;&#29992;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-edit.html">&#32232;&#36655;&#21474;&#38598;&#30340;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-upgrade-components.html">&#21319;&#32026;&#20803;&#20214;&#32780;&#19981;&#20013;&#26039;&#26381;&#21209;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
