<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-javamailsessions" name="ref-javamailsessions"></a></p>

<h4><a id="sthref33" name="sthref33"></a>Sesiones de JavaMail</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>GlassFish Server incluye la API de JavaMail. JavaMail proporciona acceso desde aplicaciones Java a servidores de correo compatibles con Internet Message Access Protocol (IMAP) y Simple Mail Transfer Protocol (SMTP) situados en su red o en Internet.</p>
<p>Utilice la p&aacute;gina Sesiones JavaMail para configurar sesiones JavaMail.</p>
<p>Para cada sesi&oacute;n JavaMail, se proporciona la siguiente informaci&oacute;n.</p>
<dl>
<dt>Nombre JNDI</dt>
<dd>
<p>Nombre &uacute;nico que identifica las sesiones JavaMail.</p>
</dd>
<dt>Activado</dt>
<dd>
<p>(Esta columna s&oacute;lo se muestra si la instancia del servidor por defecto, <code>server</code>, existe en el dominio).</p>
<p>Una marca de control si el recurso est&aacute; activado, o una X si est&aacute; desactivado.</p>
</dd>
<dt>Estado</dt>
<dd>
<p>(Esta columna s&oacute;lo se muestra si en el dominio se ha creado alg&uacute;n cluster o instancia independiente).</p>
<p>N&uacute;mero de clusters e instancias independientes a los que se dirige el recurso y el n&uacute;mero de estos destinos en los que el recurso est&aacute; activado. Por ejemplo, "Activado en 2 de 4 de destinos" significa que el recurso se dirige a cuatro clusters e instancias independientes y que est&aacute; activado en dos de estos cuatro destinos.</p>
</dd>
<dt>Descripci&oacute;n</dt>
<dd>
<p>Descripci&oacute;n de las sesiones JavaMail.</p>
</dd>
</dl>
<p>La tabla Sesiones tambi&eacute;n contiene las siguientes opciones.</p>
<dl>
<dt>Nuevo</dt>
<dd>
<p>Bot&oacute;n para crear una nueva sesi&oacute;n JavaMail.</p>
</dd>
<dt>Suprimir</dt>
<dd>
<p>Bot&oacute;n para suprimir una o m&aacute;s sesiones JavaMail seleccionadas.</p>
</dd>
<dt>Activar</dt>
<dd>
<p>Bot&oacute;n para activar una o m&aacute;s sesiones JavaMail seleccionadas.</p>
</dd>
<dt>Desactivar</dt>
<dd>
<p>Bot&oacute;n para desactivar una o m&aacute;s sesiones JavaMail seleccionadas.</p>
</dd>
</dl>
<a id="GHJML117" name="GHJML117"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-javamailsessioncreate.html">Para crear una sesi&oacute;n JavaMail</a></p>
</li>
<li>
<p><a href="task-javamailsessionsedit.html">Para editar una sesi&oacute;n JavaMail</a></p>
</li>
<li>
<p><a href="task-javamailsessionsdelete.html">Para suprimir una sesi&oacute;n JavaMail</a></p>
</li>
</ul>
<a id="GHJML118" name="GHJML118"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00035"><code>create-javamail-resource</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00172"><code>list-javamail-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00087"><code>delete-javamail-resource</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
