<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-batchjobsconfiguration" name="ref-batchjobsconfiguration"></a></p>

<h4>Configuraci&oacute;n de tiempo de ejecuci&oacute;n por lotes</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>GlassFish Server proporciona un tiempo de ejecuci&oacute;n por lotes para la programaci&oacute;n y ejecuci&oacute;n de trabajos por lotes. Los trabajos por lotes suelen ser de larga ejecuci&oacute;n, tareas orientadas a lotes que contienen varios pasos. Las aplicaciones por lotes env&iacute;an trabajos al tiempo de ejecuci&oacute;n por lotes y proporcionan instrucciones sobre c&oacute;mo y cu&aacute;ndo ejecutar los pasos. El tiempo de ejecuci&oacute;n por lotes procesa los pasos y almacena informaci&oacute;n sobre los trabajos en un repositorio de trabajo. En GlassFish Server, el repositorio de trabajo es una base de datos.</p>
<p>Utilice la p&aacute;gina Configuraci&oacute;n de tiempo de ejecuci&oacute;n por lotes para ver y cambiar la configuraci&oacute;n del tiempo de ejecuci&oacute;n por lotes. El tiempo de ejecuci&oacute;n por lotes utiliza un servicio de ejecutor gestionado y un origen de datos para ejecutar los trabajos por lotes. El servicio de ejecutor gestionado proporciona threads a los trabajos y el origen de datos almacena la informaci&oacute;n de los trabajos. Los datos de configuraci&oacute;n de tiempo de ejecuci&oacute;n por lotes se almacenan en el elemento <code>config</code> de <code>domain.xml</code>.</p>
<p>La p&aacute;gina Configuraci&oacute;n de tiempo de ejecuci&oacute;n por lotes contiene la siguiente informaci&oacute;n.</p>
<dl>
<dt>Nombre de la instancia</dt>
<dt>Nombre del cluster</dt>
<dd>
<p>Nombre de la instancia de servidor o cluster de GlassFish al que se aplica la configuraci&oacute;n. &Eacute;ste es un campo de s&oacute;lo lectura.</p>
</dd>
<dt>Nombre de la b&uacute;squeda de servicio de ejecutor</dt>
<dd>
<p>Nombre de la b&uacute;squeda de JNDI del servicio de ejecutor gestionado que proporciona threads a los trabajos por lotes. El servicio de ejecutor gestionado por defecto es <code>concurrent/__defaultManagedExecutorService</code>.</p>
<p>El servicio de ejecutor gestionado se puede cambiar una vez que el trabajo por lotes se ha ejecutado en el tiempo de ejecuci&oacute;n por lotes sin afectar a la ejecuci&oacute;n del trabajo.</p>
</dd>
<dt>Nombre de la b&uacute;squeda de origen de datos</dt>
<dd>
<p>Nombre de la b&uacute;squeda de JNDI del origen de datos que almacena informaci&oacute;n sobre los trabajos por lotes actuales y pasados. El origen de datos por defecto es <code>jdbc/__TimerPool</code>.</p>
<p>No cambie el origen de datos despu&eacute;s de que se haya ejecutado el primer trabajo por lotes en el tiempo de ejecuci&oacute;n por lotes para su ejecuci&oacute;n. Si debe abrir el origen de datos, pare y reinicie el dominio y, a continuaci&oacute;n, realice el cambio antes de que se inicie o reinicie cualquier trabajo. Sin embargo, una vez que el origen de datos se ha cambiado, ya no se podr&aacute; acceder a la informaci&oacute;n almacenada en el origen de datos anterior.</p>
</dd>
</dl>
<a id="sthref31" name="sthref31"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="tasks-topic-group004.html#CEGEEGBB">Para configurar el tiempo de ejecuci&oacute;n por lotes</a></p>
</li>
<li>
<p><a href="tasks-topic-group002.html#CEGEIGCJ">Para ver ejecuciones de trabajo por lotes</a></p>
</li>
</ul>
<a id="sthref32" name="sthref32"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM897"><code>set-batch-runtime-configuration</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM863"><code>list-batch-runtime-configuration</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM861"><code>list-batch-jobs</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM884"><code>list-batch-job-executions</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM895"><code>list-batch-job-steps</code>(1)</a></p>
</li>
</ul>




<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
