<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-batchjobslisting" name="ref-batchjobslisting"></a></p>

<h4>Ejecuciones de trabajo por lotes</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>GlassFish Server proporciona un tiempo de ejecuci&oacute;n por lotes para la programaci&oacute;n y ejecuci&oacute;n de trabajos por lotes. Los trabajos por lotes suelen ser de larga ejecuci&oacute;n, tareas orientadas a lotes que contienen varios pasos. Las aplicaciones por lotes env&iacute;an trabajos al tiempo de ejecuci&oacute;n por lotes y proporcionan instrucciones sobre c&oacute;mo y cu&aacute;ndo ejecutar los pasos. El tiempo de ejecuci&oacute;n por lotes procesa los pasos y almacena informaci&oacute;n sobre los trabajos en un repositorio de trabajo. En GlassFish Server, el repositorio de trabajo es una base de datos.</p>
<p>Utilice la p&aacute;gina Ejecuciones de trabajo por lotes para ver los detalles sobre las ejecuciones de trabajo por lotes registradas.</p>
<p>La p&aacute;gina Ejecuciones de trabajo por lotes contiene la siguiente informaci&oacute;n.</p>
<dl>
<dt>Nombre de la instancia</dt>
<dt>Nombre del cluster</dt>
<dd>
<p>Nombre de la instancia de servidor o cluster de GlassFish al que se aplica la configuraci&oacute;n.</p>
</dd>
<dt>Trabajos por lotes</dt>
<dd>
<p>Lista de ejecuciones de trabajo por lotes registradas para la instancia o el cluster. Para cada ejecuci&oacute;n, se muestra la informaci&oacute;n siguiente:</p>
<dl>
<dt>ID de ejecuci&oacute;n</dt>
<dd>
<p>ID asignado para la ejecuci&oacute;n del trabajo por lotes. Al hacer clic en el ID de ejecuci&oacute;n se abre la p&aacute;gina Detalles de ejecuci&oacute;n de trabajo por lotes. La primera vez que se inicia un trabajo y cada vez que se reinicia la ejecuci&oacute;n existente, se crea una nueva ejecuci&oacute;n.</p>
</dd>
<dt>Nombre del trabajo</dt>
<dd>
<p>Nombre del trabajo.</p>
</dd>
<dt>Estado de lote</dt>
<dd>
<p>Estado de la ejecuci&oacute;n tal y como lo ha definido el tiempo de ejecuci&oacute;n por lotes.</p>
</dd>
<dt>Estado de salida</dt>
<dd>
<p>Estado de la ejecuci&oacute;n tal y como lo ha definido el XML de trabajo o la aplicaci&oacute;n por lotes. Por defecto, el estado de salida y el estado de lotes son el mismo a menos que el estado de salida se sustituya de forma expl&iacute;cita.</p>
</dd>
<dt>Identificador de instancia</dt>
<dd>
<p>Identificador asignado a la instancia del trabajo por lotes. La instancia de un trabajo por lotes puede tener varias ejecuciones.</p>
</dd>
<dt>Hora de inicio</dt>
<dd>
<p>Hora a la que se inicia la ejecuci&oacute;n.</p>
</dd>
<dt>Hora de finalizaci&oacute;n</dt>
<dd>
<p>Hora a la que termina la ejecuci&oacute;n.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref26" name="sthref26"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="tasks-topic-group002.html#CEGEIGCJ">Para ver ejecuciones de trabajo por lotes</a></p>
</li>
<li>
<p><a href="tasks-topic-group004.html#CEGEEGBB">Para configurar el tiempo de ejecuci&oacute;n por lotes</a></p>
</li>
</ul>
<a id="GHJML141" name="GHJML141"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM861"><code>list-batch-jobs</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM884"><code>list-batch-job-executions</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM895"><code>list-batch-job-steps</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM863"><code>list-batch-runtime-configuration</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM897"><code>set-batch-runtime-configuration</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
