<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jndicustomresourcenew" name="task-jndicustomresourcenew"></a></p>
<a name="BEGIN" id="BEGIN"></a>
<p>Un recurso JNDI personalizado especifica una f&aacute;brica de objetos de recursos para todo el servidor.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Recursos.</p>
</li>
<li>
<p>En el nodo Recursos, ampl&iacute;e el nodo JNDI.</p>
</li>
<li>
<p>En el nodo JNDI, seleccione Recursos Personalizados.</p>
<p>Se abrir&aacute; la p&aacute;gina Recursos Personalizados.</p>
</li>
<li>
<p>En la p&aacute;gina Recursos Personalizados, haga clic en Nuevo.</p>
<p>Se abrir&aacute; la p&aacute;gina Nuevo Recurso Personalizado.</p>
</li>
<li>
<p>En el campo Nombre JNDI, introduzca un nombre &uacute;nico.</p>
<p>Este nombre se registrar&aacute; en el servicio de nomenclatura de JNDI. El nombre JNDI organiza y ubica componentes dentro de un entorno inform&aacute;tico distribuido del mismo modo que los ficheros organizan y representan ubicaciones de libros en una biblioteca. Por consiguiente, el nombre JNDI se convierte en un importante m&eacute;todo de acceso al recurso personalizado.</p>
</li>
<li>
<p>En el campo Tipo de Recurso, realice una de las acciones siguientes.</p>
<ul>
<li>
<p>En la lista desplegable, seleccione una definici&oacute;n de tipo.</p>
</li>
<li>
<p>Seleccione el segundo bot&oacute;n de radio e introduzca una definici&oacute;n de tipo completamente cualificada que siga el formato <i>xxx</i><code>.</code><i>xxx</i>.</p>
</li>
</ul>
</li>
<li>
<p>En el campo Clase de F&aacute;brica, introduzca un nombre de clase de f&aacute;brica para el recurso personalizado que se va a crear.</p>
<p>La Clase de F&aacute;brica es el nombre especificado por el usuario para la clase de f&aacute;brica. Esta clase implanta la interfaz <code>javax.naming.spi.ObjectFactory</code>.</p>
</li>
<li>
<p>En el campo Descripci&oacute;n, introduzca una breve descripci&oacute;n del recurso.</p>
<p>Esta descripci&oacute;n es un valor de cadena y puede incluir un m&aacute;ximo de 250 caracteres.</p>
</li>
<li>
<p>Active la casilla de control Estado activado para activar el recurso.</p>
<p>Por defecto, el recurso est&aacute; activado, lo que significa que est&aacute; disponible en cuanto se crea.</p>
</li>
<li>
<p>En la secci&oacute;n Propiedades Adicionales, especifique propiedades adicionales del recurso personalizado.</p>
<p>GlassFish Server no define ninguna propiedad adicional para los recursos personalizados.</p>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, introduzca el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
</li>
<li>
<p>Haga clic en Aceptar.</p>
</li>
</ol>
<a id="GHJML108" name="GHJML108"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-jndicustomresourceedit.html">Para editar un recurso JNDI personalizado</a></p>
</li>
<li>
<p><a href="task-jndicustomresourcedelete.html">Para suprimir un recurso JNDI personalizado</a></p>
</li>
<li>
<p><a href="task-jndiexternalresourcecreate.html">Para crear un recurso JNDI externo</a></p>
</li>
<li>
<p><a href="task-jndiexternalresourceedit.html">Para editar un recurso JNDI externo</a></p>
</li>
<li>
<p><a href="task-jndiexternalresourcedelete.html">para suprimir un recurso JNDI externo</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
