<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-javamailsessionsedit" name="task-javamailsessionsedit"></a></p>

<h4><a id="sthref9" name="sthref9"></a>Para editar una sesi&oacute;n JavaMail</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Recursos.</p>
</li>
<li>
<p>En el nodo Recursos, seleccione Sesiones JavaMail.</p>
<p>Se abrir&aacute; la p&aacute;gina Sesiones JavaMail.</p>
</li>
<li>
<p>En la p&aacute;gina Sesiones JavaMail, haga clic en el nombre de la sesi&oacute;n que est&eacute; editando.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar Sesi&oacute;n JavaMail.</p>
</li>
<li>
<p>En el campo Host de Correo, especifique el nombre de host del servidor de correo por defecto.</p>
<p>Los m&eacute;todos de conexi&oacute;n de los objetos de almacenamiento y transporte utilizan este valor si no se suministra una propiedad de host espec&iacute;fica del protocolo. El nombre debe poder resolverse en un nombre de host real.</p>
</li>
<li>
<p>En el campo Usuario por Defecto, escriba otro nombre de usuario que se debe proporcionar al conectarse a un servidor de correo electr&oacute;nico.</p>
<p>Los m&eacute;todos de conexi&oacute;n de los objetos de almacenamiento y transporte utilizan este valor si no se suministra una propiedad de nombre de usuario espec&iacute;fica del protocolo. El nombre de usuario debe contener &uacute;nicamente caracteres alfanum&eacute;ricos, de subrayado, guiones o puntos.</p>
</li>
<li>
<p>En el campo Direcci&oacute;n de Remitente por Defecto, escriba la direcci&oacute;n de correo electr&oacute;nico del usuario por defecto.</p>
<p>El formato es <i>nombre_usuario</i><code>@</code><i>host</i>.<i>dominio</i>.</p>
</li>
<li>
<p>En el campo Orden de despliegue, escriba un n&uacute;mero para especificar el orden de despliegue del recurso de sesi&oacute;n JavaMail.</p>
<p>Los recursos con un n&uacute;mero inferior se cargan en primer lugar al iniciar el servidor. El valor por defecto es 100.</p>
</li>
<li>
<p>En el campo Descripci&oacute;n, cambie la descripci&oacute;n de la sesi&oacute;n de correo.</p>
</li>
<li>
<p>Active la casilla de control Estado activado para activar la sesi&oacute;n de correo.</p>
<p>El valor por defecto es Activado.</p>
</li>
<li>
<p>En el campo Protocolo de Almacenamiento, defina el m&eacute;todo de comunicaci&oacute;n de objetos de almacenamiento que se va a utilizar.</p>
<p>Por defecto, el protocolo de almacenamiento es <code>imap</code>.</p>
</li>
<li>
<p>En el campo Clase de Protocolo de Almacenamiento, especifique la clase del m&eacute;todo de comunicaci&oacute;n de almacenamiento que implanta el protocolo de almacenamiento deseado.</p>
<p>Por defecto, la clase de protocolo de almacenamiento es <code>com.sun.mail.imap.IMAPStore</code>.</p>
</li>
<li>
<p>En el campo Protocolo de Transporte, especifique el m&eacute;todo de comunicaci&oacute;n de transporte.</p>
<p>Por defecto, el protocolo de transporte es <code>smtp</code>.</p>
</li>
<li>
<p>En el campo Clase de Protocolo de Transporte, especifique el m&eacute;todo de comunicaci&oacute;n para la clase de transporte.</p>
<p>Por defecto, la clase de protocolo de transporte es <code>com.sun.mail.smtp.SMTPTransport</code> .</p>
</li>
<li>
<p>Active la casilla de control Depurar para activar una salida de depuraci&oacute;n adicional para esta sesi&oacute;n de correo, incluido un rastreo de protocolo.</p>
<p>Si el nivel de log de JavaMail se ha definido como <code>FINE</code> o FINER, la salida de depuraci&oacute;n se genera y se incluye en el archivo log del sistema. Consulte <a href="../../../common/en/help/task-eelogginglevels.html">Para configurar niveles de log</a> para obtener m&aacute;s informaci&oacute;n sobre la definici&oacute;n del nivel de log.</p>
</li>
<li>
<p>En la tabla Propiedades Adicionales, especifique otras propiedades requeridas por las aplicaciones, como una propiedad de host o nombre de usuario espec&iacute;fico del protocolo.</p>
<p>Para obtener una lista de las propiedades disponibles, consulte la documentaci&oacute;n de la API de JavaMail (<code><a href="http://java.sun.com/products/javamail/javadocs/index.html">http://java.sun.com/products/javamail/javadocs/index.html</a></code>). Las propiedades adicionales deben comenzar por <code>mail-</code> y como separadores se deben utilizar guiones en lugar de puntos. Por ejemplo, <code>mail-debug</code> es correcta, pero <code>mail.debug</code> no lo es. El backend de GlassFish Server convierte los guiones en los puntos que espera la API de JavaMail.</p>
<ul>
<li>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, introduzca el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
</li>
<li>
<p>Para modificar una propiedad, edite el campo Valor.</p>
</li>
<li>
<p>Para suprimir una propiedad, active la casilla de control a la izquierda del campo Nombre de la propiedad que est&aacute; suprimiendo y, a continuaci&oacute;n, haga clic en el bot&oacute;n Suprimir Propiedades.</p>
</li>
</ul>
</li>
<li>
<p>Haga clic en Guardar.</p>

<hr>
<p><b>Sugerencia:</b></p>
Para volver a la configuraci&oacute;n por defecto, haga clic en el bot&oacute;n Cargar Valores por Defecto y, a continuaci&oacute;n, en Guardar.
<hr>

</li>
</ol>
<a id="GHJML104" name="GHJML104"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-javamailsessioncreate.html">Para crear una sesi&oacute;n JavaMail</a></p>
</li>
<li>
<p><a href="task-javamailsessionsdelete.html">Para suprimir una sesi&oacute;n JavaMail</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
