<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jndiexternalresourceedit" name="task-jndiexternalresourceedit"></a></p>

<h4><a id="sthref22" name="sthref22"></a><a id="sthref23" name="sthref23"></a>Para editar un recurso JNDI externo</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Recursos.</p>
</li>
<li>
<p>En el nodo Recursos, ampl&iacute;e el nodo JNDI.</p>
</li>
<li>
<p>En el nodo JNDI, seleccione Recursos Externos.</p>
<p>Se abrir&aacute; la p&aacute;gina Recursos Externos.</p>
</li>
<li>
<p>En la p&aacute;gina Recursos Externos, haga clic en el nombre del recurso que va a editar.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar Recurso Externo.</p>
</li>
<li>
<p>Para modificar el tipo de recurso, realice una de las acciones siguientes.</p>
<ul>
<li>
<p>En la lista desplegable, seleccione una definici&oacute;n de tipo.</p>
</li>
<li>
<p>Seleccione el segundo bot&oacute;n de radio e introduzca una definici&oacute;n de tipo completamente cualificada que siga el formato <i>xxx</i><code>.</code><i>xxx</i>.</p>
</li>
</ul>
</li>
<li>
<p>En el campo Clase de F&aacute;brica, escriba un repositorio externo de clase de f&aacute;brica JNDI para el recurso externo.</p>
<p>La Clase de F&aacute;brica es el nombre especificado por el usuario para la clase de f&aacute;brica, como <code>com.sun.jndi.ldap</code>. Esta clase implanta la interfaz <code>javax.naming.spi.InitialContextFactory</code>.</p>
</li>
<li>
<p>En el campo B&uacute;squeda JNDI, introduzca el valor JNDI que buscar en el repositorio externo.</p>
<p>Por ejemplo, cuando se crea un recurso externo para conectar a un repositorio externo, para probar una clase de bean, la b&uacute;squeda JNDI puede seguir el formato: <code>cn=</code><i>testmybean</i>.</p>
</li>
<li>
<p>En el campo Orden de despliegue, escriba un n&uacute;mero para especificar el orden de despliegue de los recursos externos.</p>
<p>Los recursos con un n&uacute;mero inferior se cargan en primer lugar al iniciar el servidor. El valor por defecto es 100.</p>
</li>
<li>
<p>En el campo Descripci&oacute;n, introduzca una breve descripci&oacute;n del recurso.</p>
<p>Esta descripci&oacute;n es un valor de cadena y puede incluir un m&aacute;ximo de 250 caracteres.</p>
</li>
<li>
<p>Active la casilla de control Estado activado para activar el recurso.</p>
<p>Por defecto, el recurso est&aacute; activado, lo que significa que est&aacute; disponible en cuanto se crea.</p>
</li>
<li>
<p>En la secci&oacute;n Propiedades Adicionales, especifique propiedades adicionales del recurso externo.</p>
<p>GlassFish Server no define ninguna propiedad adicional para los recursos externos.</p>
<ul>
<li>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, introduzca el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
</li>
<li>
<p>Para modificar una propiedad, edite el campo Valor.</p>
</li>
<li>
<p>Para suprimir una propiedad, active la casilla de control a la izquierda del campo Nombre de la propiedad que est&aacute; suprimiendo y, a continuaci&oacute;n, haga clic en el bot&oacute;n Suprimir Propiedades.</p>
</li>
</ul>
</li>
<li>
<p>Haga clic en Guardar.</p>
</li>
</ol>
<a id="GHJML112" name="GHJML112"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-jndicustomresourcenew.html">Para crear un recurso JNDI personalizado</a></p>
</li>
<li>
<p><a href="task-jndicustomresourceedit.html">Para editar un recurso JNDI personalizado</a></p>
</li>
<li>
<p><a href="task-jndicustomresourcedelete.html">Para suprimir un recurso JNDI personalizado</a></p>
</li>
<li>
<p><a href="task-jndiexternalresourcecreate.html">Para crear un recurso JNDI externo</a></p>
</li>
<li>
<p><a href="task-jndiexternalresourcedelete.html">para suprimir un recurso JNDI externo</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
