<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-javamailsessioncreate" name="task-javamailsessioncreate"></a></p>

<h4><a id="sthref2" name="sthref2"></a>Para crear una sesi&oacute;n JavaMail</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Recursos.</p>
</li>
<li>
<p>En el nodo Recursos, seleccione Sesiones JavaMail.</p>
<p>Se abrir&aacute; la p&aacute;gina Sesiones JavaMail.</p>
</li>
<li>
<p>En la tabla Sesiones, haga clic en Nuevo.</p>
<p>Se abrir&aacute; la p&aacute;gina Nueva Sesi&oacute;n de JavaMail.</p>
</li>
<li>
<p>En el campo Nombre JNDI, introduzca un nombre &uacute;nico para el recurso de sesi&oacute;n de correo.</p>
<p>Utilice el prefijo de subcontexto de nombres <code>mail/</code> para recursos de JavaMail. Por ejemplo: <code>mail/MySession</code>. El nombre debe contener &uacute;nicamente caracteres alfanum&eacute;ricos, de subrayado, guiones y puntos.</p>
</li>
<li>
<p>En el campo Host de Correo, escriba el nombre de host del servidor de correo por defecto.</p>
<p>Los m&eacute;todos de conexi&oacute;n de los objetos de almacenamiento y transporte utilizan este valor si no se suministra una propiedad de host espec&iacute;fica del protocolo. El nombre debe poder resolverse en un nombre de host real.</p>
</li>
<li>
<p>En el campo Usuario por Defecto escriba el nombre de usuario que se debe proporcionar cuando se conecta a un servidor de correo electr&oacute;nico.</p>
<p>Los m&eacute;todos de conexi&oacute;n de los objetos de almacenamiento y transporte utilizan este valor si no se suministra una propiedad de nombre de usuario espec&iacute;fica del protocolo. El nombre de usuario debe contener &uacute;nicamente caracteres alfanum&eacute;ricos, de subrayado, guiones o puntos.</p>
</li>
<li>
<p>En el campo Direcci&oacute;n de Remitente por Defecto, escriba la direcci&oacute;n de correo electr&oacute;nico del usuario por defecto.</p>
<p>El formato es <i>nombre_usuario</i><code>@</code><i>host</i>.<i>dominio</i>.</p>
</li>
<li>
<p>En el campo Descripci&oacute;n, escriba una descripci&oacute;n de esta sesi&oacute;n de correo.</p>
</li>
<li>
<p>Active la casilla de control Estado activado para activar la sesi&oacute;n de correo.</p>
<p>El valor por defecto es Activado.</p>
</li>
<li>
<p>En el campo Protocolo de Almacenamiento, defina el servicio de protocolo de almacenamiento que se va a utilizar.</p>
<p>El servicio de protocolo de almacenamiento se conecta a un servidor de correo, recupera mensajes y los guarda en una o varias carpetas. Los valores permitidos son <code>imap</code>, <code>pop3</code>, <code>imaps</code> y <code>pop3s</code>. El valor por defecto es <code>imap</code>.</p>
</li>
<li>
<p>En el campo Clase de protocolo de almacenamiento, especifique la clase de implantaci&oacute;n del proveedor de servicios para el almacenamiento.</p>
<p>Los valores permitidos son:</p>
<ul>
<li>
<p><code>com.sun.mail.imap.IMAPStore</code></p>
</li>
<li>
<p><code>com.sun.mail.pop3.POP3Store</code></p>
</li>
<li>
<p><code>com.sun.mail.imap.IMAPSSLStore</code></p>
</li>
<li>
<p><code>com.sun.mail.pop3.POP3SSLStore</code></p>
</li>
</ul>
<p>El valor por defecto es <code>com.sun.mail.imap.IMAPStore</code>.</p>
</li>
<li>
<p>En el campo Protocolo de Transporte, especifique el m&eacute;todo de comunicaci&oacute;n de transporte.</p>
<p>El servicio de protocolo de transporte env&iacute;a mensajes. Los valores permitidos son <code>smtp</code> y <code>smtps</code>. Por defecto, el protocolo de transporte es <code>smtp</code>.</p>
</li>
<li>
<p>En el campo Clase de Protocolo de Transporte, especifique la clase de implantaci&oacute;n del proveedor de servicios para el transporte.</p>
<p>El valor por defecto es <code>com.sun.mail.smtp.SMTPTransport</code>.</p>
</li>
<li>
<p>Active la casilla de control Depurar para activar una salida de depuraci&oacute;n adicional para esta sesi&oacute;n de correo, incluido un rastreo de protocolo.</p>
<p>Si el nivel de log de JavaMail se ha definido como <code>FINE</code> o FINER, la salida de depuraci&oacute;n se genera y se incluye en el archivo log del sistema. Consulte <a href="../../../common/en/help/task-eelogginglevels.html">Para configurar niveles de log</a> para obtener m&aacute;s informaci&oacute;n sobre la definici&oacute;n del nivel de log. Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>En la tabla Propiedades Adicionales, especifique otras propiedades requeridas por las aplicaciones, como una propiedad de host o nombre de usuario espec&iacute;fico del protocolo.</p>
<p>Para obtener una lista de las propiedades disponibles, consulte la documentaci&oacute;n de la API de JavaMail (<code><a href="http://java.sun.com/products/javamail/javadocs/index.html">http://java.sun.com/products/javamail/javadocs/index.html</a></code>). Las propiedades adicionales deben comenzar por <code>mail-</code> y como separadores se deben utilizar guiones en lugar de puntos. Por ejemplo, <code>mail-debug</code> es correcta, pero <code>mail.debug</code> no lo es. El backend de GlassFish Server convierte los guiones en los puntos que espera la API de JavaMail.</p>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, introduzca el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
</li>
<li>
<p>En la lista de destinos disponibles, seleccione el destino o los destinos en los que desea configurar la sesi&oacute;n de correo. A continuaci&oacute;n, haga clic en Agregar.</p>
<p>Los destinos pueden ser clusters o instancias de servidor aut&oacute;nomas. Si no selecciona un destino, la sesi&oacute;n se configura en la instancia de servidor por defecto <code>server</code>.</p>
</li>
<li>
<p>Haga clic en Aceptar.</p>
</li>
</ol>
<a id="GHJML103" name="GHJML103"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-javamailsessionsedit.html">Para editar una sesi&oacute;n JavaMail</a></p>
</li>
<li>
<p><a href="task-javamailsessionsdelete.html">Para suprimir una sesi&oacute;n JavaMail</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
