<!DOCTYPE html PUBLIC "-//Tigris//DTD XHTML 1.0 Transitional//EN" "http://style.tigris.org/nonav/tigris_transitional.dtd">
<html>
<head>
  <title>Proyecto GlassFish - Introducci&oacute;n</title>
  <meta http-equiv="Content-Type"

 content="text/html; charset=windows-1252">
  <meta http-equiv="CONTENT-TYPE" content="text/html; charset=utf-8">
</head>
<body style="color: rgb(0, 0, 0); background-color: rgb(255, 255, 255);">
<div id="projecthome" class="app"><font size="+1"><span

 style="font-weight: bold;">Proyecto GlassFish de compilaci&oacute;n</span></font><br> <a href="#pre_req">Requisitos para la compilaci&oacute;n GlassFish</a><br> <a

 href="http://wiki.glassfish.java.net/Wiki.jsp?page=BuildInformation#qs">Gu&iacute;a de inicio r&aacute;pido</a><span style="font-weight: bold;"></span><br> <a href="#Complete_Instructions_on_how_to_Build">Instrucciones de compilaci&oacute;n completas</a><br> <a href="http://www.netbeans.org/kb/41/glassfish.html">Compilaci&oacute;n GlassFish con IDE NetBeans</a><br> <a href="BuildGlassFish.html#Branch">Compilaci&oacute;n desde la rama</a><br> <a href="#maven_goals">Descripci&oacute;n general de objetivos de maven de GlassFish</a><br> <br> En esta p&aacute;gina se describe c&oacute;mo se compila GlassFish. Se muestran v&iacute;nculos &uacute;tiles para <a

 href="https://glassfish.dev.java.net/public/NewtoGlsasFish.html#Submit_a_Bug">enviar un error</a> o <a

 href="https://glassfish.dev.java.net/public/NewtoGlsasFish.html#Request_a_Feature">solicitar una funci&oacute;n</a>. Puede encontrar la directiva rectora <a

 href="https://glassfish.dev.java.net/public/GovernancePolicy.html">aqu&iacute;.</a><br>
<p><span style="font-weight: bold;"></span></p>
<h3><a name="Complete_Instructions_on_how_to_Build"></a>Instrucciones completas sobre c&oacute;mo compilar GlassFish</h3>
GlassFish se puede compilar con NetBeans o mediante las opciones de la l&iacute;nea de comandos. El siguiente art&iacute;culo contiene m&aacute;s informaci&oacute;n sobre la <a

 href="http://www.netbeans.org/kb/41/glassfish.html">compilaci&oacute;n y el desarrollo de un proyecto GlassFish con NetBeans</a>. Las opciones de la l&iacute;nea de comandos para la compilaci&oacute;n GlassFish se incluyen m&aacute;s abajo.<br> <br> <span style="font-weight: bold;"><a name="pre_req"></a>Requisitos para la compilaci&oacute;n GlassFish </span><br>
<ul>
  <li>Los usuarios deben tener instalado <a

 href="http://maven.apache.org/maven-1.x/start/download.html">Maven</a> (1.0.2): Esto crear&aacute; el dep&oacute;sito local necesario por Maven para almacenar dependencias GlassFish.</li>
  <li>El usuario debe tener un inicio de sesi&oacute;n en java.net y debe tener acceso al dep&oacute;sito CVS para el proyecto GlassFish.</li>
  <li>El usuario debe iniciar la sesi&oacute;n en el dep&oacute;sito CVS GlassFish una vez (CVS guarda la contrase&ntilde;a en el archivo .cvspass en el directorio principal del usuario)</li>
  <li><a href="http://java.sun.com/j2se/1.5.0/download.jsp">J2SE 5.0</a> (1.5.0_12) debe estar instalado, configurado como variable de entorno JAVA_HOME y en la ruta binaria. Le recomendamos que utilice la &uacute;ltima versi&oacute;n disponible.<br>
  </li>
  <li>Configure <a

 href="https://glassfish.dev.java.net/servlets/ProjectSource#wincvs">cliente cvs</a> mediante instrucciones java.net.<br>
  </li>
</ul>
<span style="font-weight: bold;">Pasos para la compilaci&oacute;n GlassFish:</span><br>
<ol>
</ol>
<div style="margin-left: 40px;">El primer paso es comprobar las dependencias de m&oacute;dulo y los archivos comunes que se utilizan en el sistema de compilaci&oacute;n y editar el archivo de propiedades.</div>
<ol>
  <pre>% mkdir workspace<br>% cd workspace<br>% cvs -d :pserver:&lt;userid&gt;@cvs.dev.java.net:/cvs checkout glassfish/bootstrap<br></pre>
Esto comprobar&aacute; project.xml, maven.xml, project.properties y archivos comunes de project.xml.<br>
</ol>
<div style="margin-left: 40px;">Cree workspace/glassfish/bootstrap/build.properties o para espacio de trabajo GlassFish reutilizable, un proceso &uacute;nico es crear ${HOME}/build.properties (Unix) o %HOMEPATH%\build.properties (Windows) y definir las variables siguientes: (puede obtener el valor %HOMEPATH% si ejecuta el comando: echo %HOMEPATH% o ejecute &quot;set&quot; y busque la variable HOMEPATH (Windows))<br> Defina dos variables glassfish: glassfish.os.name, glassfish.cvs.username <a href="BuildGlassFish.html#configuration">igual que arriba</a>.<br> glassfish.os.name= &lt;nombre OS - valores posibles: WINNT, SunOS, Linux, SunOS_X86, Darwin&gt;<br> glassfish.cvs.username= &lt;java.net id&gt;<br>
</div>
<ol>
Por ejemplo, en Windows XP Professional<br> <code>glassfish.os.name=WINNT<br> glassfish.cvs.username=carlavmott<br></code> <br>
  <li>El paso siguiente es comprobar los c&oacute;digos fuente.</li>
  <pre>% cd glassfish/bootstrap<br>% maven checkout<br></pre>
Limitaci&oacute;n conocida: Puede que algunos de los c&oacute;digos fuente necesarios para crear GlassFish no est&eacute;n disponibles en java.net de momento (por ejemplo MQ, ORB, JWSDP 2.0, etc). Se tratar&aacute;n como dependencias binarias por ahora. (Consulte el paso siguiente para saber c&oacute;mo se utilizan las dependencias binarias.) Tambi&eacute;n puede comproblar un subconjunto de los m&oacute;dulos mediante:<br>
  <pre>% maven checkout -Dmodules=<span style="font-family: monospace;">[</span>lista de nombres de m&oacute;dulo separados por comas]   </pre>
  <p>Los nombres de m&oacute;dulo est&aacute;n en esta <a

 href="http://wiki.java.net/bin/view/Projects/GlassFishModuleOwners">p&aacute;gina</a>.<span

 style="font-family: monospace;"></span></p>
  <li>Cree un proceso bootstrap (instrucciones de inicializaci&oacute;n) de la imagen del servidor (una recopilaci&oacute;n de scripts y archivos .jar que se emplean para ejecutar glassfish). El desarrollador puede seleccionar la opci&oacute;n de &quot;bootstrap&quot; que descarga el servidor pre-compilado y compila s&oacute;lo un subconjunto de los m&oacute;dulos. La otra opci&oacute;n, &quot;bootstrap-all&quot;, es crear el servidor desde cero, y compilar todos los m&oacute;dulos para verificar el cambio de versi&oacute;n de las dependencias binarias o el interm&oacute;dulo.<br>
  </li>
  opci&oacute;n <span style="font-weight: bold;"><br></span><b>bootstrap-all</b>: Compile todos los m&oacute;dulos desde el c&oacute;digo fuente.<br>
  <pre>% maven bootstrap-all </pre>
  opci&oacute;n <b>bootstrap</b>: Compile su propio m&oacute;dulo con el servidor pre-compilado <br>
  <pre>% maven bootstrap</pre>
Este paso es opcional si ya tiene instalada una compilaci&oacute;n aprobada de GlassFish. Para utilizar la compilaci&oacute;n aprobada necesitar&aacute; definir la propiedad en glassfish/project.properties.
  <pre wrap="">glassfish.image.version=&lt;&lt;versi&oacute;n de compilaci&oacute;n&gt;&gt;</pre>
Este har&aacute; que el sistema de compilaci&oacute;n &quot;apunte&quot; a esa instalaci&oacute;n. Esta propiedad tambi&eacute;n se puede a&ntilde;adir a ${HOME}/build.properties<br> <br>
  <li>Compile el c&oacute;digo fuente comprobado. El orden de compilaci&oacute;n estar&aacute; a cargo de un archivo de configuraci&oacute;n com&uacute;n comprobado en el paso 2. <strong>Este paso actualizar&aacute; la imagen instalada al final de la compilaci&oacute;n de cada m&oacute;dulo</strong>.<br>
  </li>
  <pre>% maven build<br></pre>
Tambi&eacute;n puede compilar un subconjunto de los m&oacute;dulos mediante:<br>
  <pre>% maven build -Dmodules<i style="font-style: italic;">=</i><span

 style="font-family: monospace;">[</span>lista de nombres de m&oacute;dulo separados por coma] </pre>
o vaya a ../[nombre de m&oacute;dulo] e invoque:<br>
  <pre>% maven build<br></pre>
  <li>Configure el tiempo de ejecuci&oacute;n del servidor GlassFish. Este paso crear&aacute; el script asadmin, run create-domain, etc., que son necesarios para ejecutar el servidor GlassFish.<br>
  </li>
  <pre>% maven configure-runtime   (el valor predeterminado es la instalaci&oacute;n silenciosa) </pre>
Si desea especificar informaci&oacute;n de configuraci&oacute;n com&uacute;n (por ejemplo, n&uacute;meros de puerto, etc.), utilice configure-runtime en modo detallado. &nbsp;
  <pre>% maven configure-runtime -Dinteractive<br></pre>
Generalmente, s&oacute;lo necesitar&aacute; ejecutar este comando una vez. En los casos donde se producen cambios, el entorno de dominio precisa reconfiguraci&oacute;n; consulte las preguntas frecuentes para obtener m&aacute;s informaci&oacute;n. Los valores predeterminados para la configuraci&oacute;n del tiempo de ejecuci&oacute;n se pueden encontrar en glassfish/bootstrap/project.properties:<br>
  <pre>domain.name=&quot;domain1&quot;<br>instance.name=&quot;server&quot;<br>admin.user=&quot;admin&quot;<br>admin.password=&quot;adminadmin&quot;<br>admin.port=&quot;4848&quot;<br>instance.port&quot;=&quot;8080&quot;<br>orb.port=&quot;3700&quot;<br>imq.port=&quot;7676&quot;<br>https.port=&quot;8181&quot; <br></pre>
El objetivo de maven 'configure-runtime' crear&aacute; un dominio de instancia &uacute;nica similar a GlassFish V1. Si desea crear un dominio de GlassFish V2 en modo cl&uacute;ster, ejecute el comando siguiente:<br> <code>% maven configure-cluster</code><br>
  <li>
    <p>Inicie el servidor con el comando siguiente. Todos los comandos del servidor GlassFish se ubican en el directorio &lt;glassfish.root&gt;/publish/bin. Para obtener m&aacute;s documentaci&oacute;n sobre c&oacute;mo administrar el servidor, consulte la <a href="http://docs.sun.com/source/819-1004/QuickStart.html">documentaci&oacute;n</a> para Sun Java System Application Server PE versi&oacute;n 8 series. Una gran cantidad de lo que contiene a&uacute;n se aplica a la versi&oacute;n 9. Nota: actualmente GlassFish admite s&oacute;lo opci&oacute;n de la l&iacute;nea de comandos para todas las plataformas.<br>
    </p>
  </li>
  <pre>% asadmin start-domain</pre>
  <li>
    <p>Limpieza del servidor.<br>
    </p>
  </li>
  <pre>% maven clobber<br></pre>
Esto eliminar&aacute; todos los scripts y archivos jar que se utilizan para ejecutar el servidor. Se eliminar&aacute; todo en glassfish.home y una vez hecho esto, deber&aacute; volver al paso 2.<br> <br>
  <li>Limpie compilaci&oacute;n/servidor<span style="font-weight: bold;">: </span>Puede utilizar cualquiera de los tres objetivos de arriba durante el proceso de desarrollo. Actualice los c&oacute;digos fuente con el IDE favorito, y utilice cualquiera de los comandos siguientes en un espacio de trabajo ya compilado para llevar el espacio de trabajo a su fase original a fin de recompilar y verificar los cambios. </li>
  <ul>
    <li>Para limpiar los m&oacute;dulos y eliminar archivos generados por compilaci&oacute;n, como .class, .properties, y preparar la recompilaci&oacute;n, ejecute el siguiente comando
      <pre>% maven clean (o maven -Dmodules=mail,activation clean)</pre>
    </li>
    <li>Para limpiar el servidor configurado en el paso 5, utilice el comando siguiente para limpiar el servidor que elimina Administration Server, domain1 y devuelve el servidor a su fase original instalada. (Elimina los reci&eacute;n generados archivos token reemplazados en ${glassfish.home}/bin, directorios config.)
      <pre>% maven clean-config</pre>
    </li>
    <li>Utilice &quot;maven clean-config&quot; para verificar los cambios relacionados con el arranque del servidor de administraci&oacute;n y el dominio. El objetivo &quot;clobber&quot; se puede utilizar para eliminar el servidor y obtener un servidor nuevo. &quot;clean&quot; se puede utilizar para eliminar archivos de compilaci&oacute;n y preparar la recompilaci&oacute;n.<br>
    </li>
  </ul>
  <br>
  <li><span style="font-weight: bold;">Ejecute pruebas Quicklook</span>: las pruebas Quicklook ofrecen al desarrollador una forma de comprobar las funciones principales en el servidor de aplicaciones y de ejecutar una revisi&oacute;n para asegurar que no se ha da&ntilde;ado nada importante. <br>
  </li>
  <ul>
    <li>Consulte las pruebas necesarias en glassfish/appserv-tests seg&uacute;n se muestra a continuaci&oacute;n.<br>
    </li>
    <pre>% cd glassfish/bootstrap<br>% maven checkout-quicklook</pre>
    <li>Defina <code>APS_HOME</code>. &Eacute;ste es el directorio donde ha comprobado el espacio de trabajo, incluido el nombre ra&iacute;z del espacio de trabajo (p.ej. <code>/workspace/appserv-tests</code>)</li>
    <li>Defina <code>S1AS_HOME</code>. &Eacute;ste es el directorio de instalaci&oacute;n para el servidor GlassFish (p.ej. <code>/workspace/publish/glassfish</code>)</li>
    <li>Las propiedades de la instalaci&oacute;n est&aacute;n en <code>${APS_HOME}/config.properties</code> para ajustar la instalaci&oacute;n (p.ej. <code>admin.password</code>, <code>http.port</code>, etc.). Si ha modificado los valores predeterminados, edite este archivo config.properties.</li>
    <li>Aseg&uacute;rese de que el servidor NO est&aacute; en ejecuci&oacute;n antes de ejecutar las pruebas; detenga el servidor si ya est&aacute; en ejecuci&oacute;n.<br>
    </li>
    <li>Ejecute la prueba:
      <pre>% cd $APS_HOME<br>% maven runtest<br></pre>
    </li>
    <li>Abra el archivo <code>${APS_HOME}/test_results.html</code> en un explorador y examine los resultados.</li>
  </ul>
  <ul>
    <li>Puede buscar las instrucciones detalladas para ejecutar pruebas Quicklook <a

 href="https://glassfish.dev.java.net/public/GuidelinesandConventions.html#Quicklook_Tests">AQU&Iacute;</a>.</li>
  </ul>
</ol>
<p>No olvide consultar la p&aacute;gina wiki sobre <a

 href="http://wiki.java.net/bin/view/Projects/GlassFishBuildQuestions">preguntas frecuentes sobre compilaci&oacute;n de GlassFish</a> si tiene problemas.</p>
<p><b>Soporte IDE</b><br> <br> <font color="#000080"><a href="http://community.java.net/netbeans"><font

 color="#000080"><img src="image/builds-bestSmaller.png" name="Graphic2"

 align="bottom" border="1" height="38" width="75"></font></a></font><a

 href="http://community.java.net/netbeans"> </a><a

 href="http://www.netbeans.org/kb/41/glassfish.html">Compilaci&oacute;n y desarrollo de GlassFish</a> con NetBeans 4.1.<br> <br> Para obtener informaci&oacute;n adicional, consulte las <a

 href="https://glassfish.dev.java.net/public/GuidelinesandConventions.html#Workspace_Guidelines">directrices de espacios de trabajo</a> y los <a

 href="https://glassfish.dev.java.net/public/GuidelinesandConventions.html#Commit_Procedures">procedimientos de confirmaci&oacute;n</a>. Adem&aacute;s, puede utilizar <a

 href="http://fisheye.cenqua.com/java.net/viewrep/cvs/glassfish">FishEye</a> para investigar qu&eacute; cambios se han producido en el espacio de trabajo.</p>
<p><span style="font-weight: bold;"><a name="Branch"></a><big>Compilaci&oacute;n Glassfish para FCS, SJSAS91_FCS_BRANCH : </big></span><br>
</p>
<span style="font-weight: bold;"></span>
<p>A continuaci&oacute;n, se muestran los pasos para compilar en GlassFish Branch:<br> <code>% mkdir workspace<br> % cd workspace<br> % cvs -d :pserver:&lt;userid&gt;@cvs.dev.java.net:/cvs checkout -r <b>SJSAS91_FCS_BRANCH</b> glassfish/bootstrap</code>
</p>
<p>Como glassfish/bootstrap/project.properties de SJSAS91_FCS_BRANCH, la rama tiene variable &quot;glassfish.cvstag&quot; definida como &quot;glassfish.cvstag=SJSAS91_FCS_BRANCH&quot;. Los c&oacute;digos fuente de la rama FCS se comprobar&aacute;n y compilar&aacute;n en consecuencia.
</p>
<p>Defina dos variables glassfish: glassfish.os.name, glassfish.cvs.username <a href="BuildGlassFish.html#configuration">como se ha descrito m&aacute;s arriba</a>.
</p>
<p>Entonces:<br> <code>% cd glassfish/bootstrap<br> % maven checkout <b>bootstrap-all</b> build configure-runtime</code>
</p>
<p>Puede decidir qu&eacute; objetivo va a ejecutar entre bootstrap y bootstrap-all en los comandos m&aacute;s arriba indicados, a trav&eacute;s de los detalles <a

 href="BuildGlassFish.html#maven_goals">aqu&iacute;</a>.</p>
<a name="maven_goals"></a><big><span style="font-weight: bold;">Descripci&oacute;n general de objetivos de maven de GlassFish:</span></big><br> <br>
<table style="text-align: left; width: 743px; height: 328px;" border="1"

 cellpadding="2" cellspacing="2">
  <tbody>
    <tr>
      <td

 style="vertical-align: top; font-weight: bold; background-color: rgb(204, 204, 204);">Nombre de objetivo<br>
      </td>
      <td

 style="vertical-align: top; font-weight: bold; background-color: rgb(204, 204, 204);">Comando usado normalmente<br>
      </td>
      <td

 style="vertical-align: top; font-weight: bold; background-color: rgb(204, 204, 204);">Descripci&oacute;n<br>
      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">bootstrap<br>
      </td>
      <td style="vertical-align: top;">maven -Dmodules=admin <span

 style="font-weight: bold;">bootstrap</span> compilaci&oacute;n de comprobaci&oacute;n<br>
      </td>
      <td style="vertical-align: top;"> Descargue el archivo glassfish-image-SNAPSHOT.jar y descomprima el archivo de ${glassfish.home}(Server Image) para compilar m&oacute;dulos individuales<br>
      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">bootstrap-all<br>
      </td>
      <td style="vertical-align: top;">maven checkout <span

 style="font-weight: bold;">bootstrap-all</span> compilaci&oacute;n<br>
      </td>
      <td style="vertical-align: top;">Instale una imagen glassfish vac&iacute;a que contenga s&oacute;lo las dependencias binarias; a continuaci&oacute;n, descargue dependencias binarias individuales y descompr&iacute;malas en ${glassfish.home} y comprima todos los m&oacute;dulos de c&oacute;digos fuente.<br>
      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">checkout </td>
      <td style="vertical-align: top;">maven <span

 style="font-weight: bold;">checkout</span><br>
      </td>
      <td style="vertical-align: top;"> Comprobaci&oacute;n de un m&oacute;dulo<br>
      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">build<br>
      </td>
      <td style="vertical-align: top;">maven <span

 style="font-weight: bold;">build</span><br>
      </td>
      <td style="vertical-align: top;"> Compilaci&oacute;n de m&oacute;dulo</td>
    </tr>
    <tr>
      <td style="vertical-align: top;">configure-runtime</td>
      <td style="vertical-align: top;">maven <span

 style="font-weight: bold;">configure-runtime</span><br>
      </td>
      <td style="vertical-align: top;"> Configuraci&oacute;n de ${glassfish.home} con dominio de instancia &uacute;nica<br>
      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">configure-cluster<br>
      </td>
      <td style="vertical-align: top;">maven <span

 style="font-weight: bold;">configure-cluster</span><br>
      </td>
      <td style="vertical-align: top;">Configuraci&oacute;n de dominio con funciones en cl&uacute;ster para GlassFish V2<br>
      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">clean </td>
      <td style="vertical-align: top;">maven <span

 style="font-weight: bold;">clean</span> clobber<br>
      </td>
      <td style="vertical-align: top;"> Limpieza de m&oacute;dulo</td>
    </tr>
    <tr>
      <td style="vertical-align: top;">clobber<br>
      </td>
      <td style="vertical-align: top;">maven <span

 style="font-weight: bold;">clobber</span><br>
      </td>
      <td style="vertical-align: top;">Limpia la imagen del servidor GlassFish - elimina el directorio ${glassfish.home. Se tiene que usar con &quot;bootstrap-all&quot; para obtener nueva imagen y limpiar cualquier imagen de servidor da&ntilde;ada.<br>
      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">clean-config<br>
      </td>
      <td style="vertical-align: top;">maven <span

 style="font-weight: bold;">clean-config</span><br>
      </td>
      <td style="vertical-align: top;">Limpia el servidor. Elimina domain1 y archivos token reemplazados en bin,config<br>
      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">-Dmodules=<br>
      </td>
      <td style="vertical-align: top;">maven <span

 style="font-weight: bold;">-Dmodules</span>=admin bootstrap checkout build</td>
      <td style="vertical-align: top;"> Limpia/comprueba/compila s&oacute;lo algunos m&oacute;dulos: maven -Dmodules={lista separada por comas} nombre de objetivo</td>
    </tr>
  </tbody>
</table>
<br> <br> <!--EndFragment--></div>
</body>
</html>
