<!DOCTYPE html PUBLIC "-//Tigris//DTD XHTML 1.0 Transitional//EN" "http://style.tigris.org/nonav/tigris_transitional.dtd">

<html>

<head>
<!-- Inserted by TRADOS: --><META HTTP-EQUIV="content-type" CONTENT="text/html; charset=windows-1252">

  <link rel="SHORTCUT ICON" href="../image/glassfish_favicon.gif">

  <title>Desarroladores de GlassFish</title>

</head>

<body>
<div class="app">
<p>
Si como desarrollador o desarrolladora le interesa formar parte de la comunidad que implement&oacute; el primer servidor de aplicaciones Java EE5 compatible, el Proyecto GlassFish es el lugar perfecto para usted.

<p>
Animamos a los miembros de la comunidad GlassFish a registrarse en una <a href="http://wiki.java.net/bin/view/Projects/GlassFishPeoplePage">P&aacute;gina de la gente</a> de nuestra Wiki.

Tambi&eacute;n tenemos una p&aacute;gina con un aspecto algo mejor, que usamos para <a href="developers.html">detectar desarrolladores</a> y que tratamos de mantener en expansi&oacute;n.
</p>

<h3>Entender el c&oacute;digo</h3>

<p>
Desarrollar un servidor de aplicaciones es un gran desaf&iacute;o. M&aacute;s abajo figuran los v&iacute;nculos que nos ayudan a organizar el desarrollo de un proyecto de este tama&ntilde;o.

<ul>

  <li>El proyecto GlassFish se divide en <a

 href="https://glassfish.dev.java.net/public/ServerModules.html">m&oacute;dulos</a><br>

  </li>

  <li>Leer <a

 href="https://glassfish.dev.java.net/nonav/javaee5/api/index.html">javadocs</a>

que se actualizan con cada compilaci&oacute;n aprobada.</li>

  <li><a

 href="https://glassfish.dev.java.net/servlets/ProjectMailingListList">Charlar

con otros desarrolladores de GlassFish</a> sobre los detalles de la implementaci&oacute;n en

nuestras listas de correo. No olvide

iniciar sesi&oacute;n para ver todas las listas disponibles.</li>

  <li>Comprobar la lista de los <a

 href="https://glassfish.dev.java.net/public/GuidelinesandConventions.html#Module_Owners">propietarios de

m&oacute;dulos</a></li>

  <li>Consultar las <a

 href="https://glassfish.dev.java.net/public/ServerModules.html#Related_GlassFish_Technologies_">tecnolog&iacute;as 

relacionadas</a> que forman parte de GlassFish<br>

  </li>

</ul>

<h3>Crearlo</h3>

<p>
La infraestructura de la compilaci&oacute;n de GlassFish emplea maven y ant. Actualmente estamos buscando desarrolladores que ayuden a mejorar la infraestructura de la compilaci&oacute;n para que dependa menos de ant.

<ul>

  <li>La <a

 href="http://wiki.glassfish.java.net/Wiki.jsp?page=BuildInformation#qs">gu&iacute;a de procedimientos

iniciales</a> contiene la lista resumida de pasos necesarios para crear el servidor</li>

  <li>Las <a

 href="BuildGlassFish.html#Complete_Instructions_on_how_to_Build">instrucciones

completas</a> detallan c&oacute;mo crear GlassFish<br>

  </li>

</ul>

<h3>Comprobarlo</h3>

<p>Hay varias comprobaciones diferentes disponibles en GlassFish. Quicklook comprueba la ejecuci&oacute;n en un corto plazo de tiempo y cubre una amplia gama de funciones en el servidor de aplicaciones. Las pruebas de desarrollador tambi&eacute;n est&aacute;n disponibles para los diferentes m&oacute;dulos. Cada m&oacute;dulo tiene m&aacute;s informaci&oacute;n sobre el m&eacute;todo de ejecuci&oacute;n de las pruebas.</p>

<p>Si desea m&aacute;s informaci&oacute;n, consulte el <a href="http://wiki.java.net/bin/view/Projects/GlassFishQuality">Portal de calidad GlassFish</a>.</p>

<ul>

  <li><a

 href="https://glassfish.dev.java.net/public/downloadsindex.html">Descargar</a>

una compilaci&oacute;n nocturna o aprobada</li>

  <li>Ejecutar las <a

 href="https://glassfish.dev.java.net/public/GuidelinesandConventions.html#Quicklook_Tests">pruebas

QuickLook</a></li>

  <li>Unirse al <a href="http://wiki.java.net/bin/view/Projects/CATfish">programa

CATfish</a><br>

  </li>

  <li><a

 href="https://glassfish.dev.java.net/public/NewtoGlassFish.html#Submit_a_Bug">Enviar 

un error</a></li>

</ul>

<h3>Aportar c&oacute;digo</h3>

<p>
Las aportaciones al proyecto GlassFish pueden hacerse de varias formas: solucionando errores, enviando mejoras, nuevas funciones o, incluso, m&oacute;dulos completos.

<ul>

  <li>Los que desean hacer aportaciones deben firmar y remitir un <a href="https://glassfish.dev.java.net/public/GovernancePolicy.html#SCA_Policy">Acuerdo de aportaci&oacute;n</a></li>

  <li>Consulte la <a href="https://glassfish.dev.java.net/public/GovernancePolicy.html">directiva rectora </a>para obtener m&aacute;s informaci&oacute;n sobre misiones y responsabilidades. </li>

  <li>Todo el c&oacute;digo enviado al espacio de trabajo debe seguir las <a href="https://glassfish.dev.java.net/public/GuidelinesandConventions.html#Coding_Conventions">convenciones de codificaci&oacute;n</a></li>

  <li>Si a&uacute;n no tiene la funci&oacute;n de desarrollador, consulte el <a href="https://glassfish.dev.java.net/public/GuidelinesandConventions.html#Submit_a_Patch">procedimiento para enviar un parche</a></li>

  <li>Los desarrolladores deben seguir <a href="https://glassfish.dev.java.net/public/GuidelinesandConventions.html#Commit_Procedures">procedimientos de confirmaci&oacute;n</a> al actualizar el espacio de trabajo</li>
</ul>

<h3>Ejemplos de aportaciones</h3>

<p>
Aceptamos los ejemplos de buena calidad que demuestren una funci&oacute;n o aspecto de la tecnolog&iacute;a GlassFish o Java EE 5. &Uacute;nase al <a href="glassfish-samples.dev.java.net">Proyecto Ejemplos de GlassFish</a> y vea c&oacute;mo sus aportaciones marcan la diferencia.

<p>
Eche un vistazo a esta p&aacute;gina <a href="https://glassfish-samples.dev.java.net/new_samples.html">con ejemplos de aportaciones en &aacute;reas espec&iacute;ficas</a>.

Pase tambi&eacute;n por el <a href="blueprints.dev.java.net">proyecto Java Blueprints</a> para conocer aportaciones para las aplicaciones m&aacute;s eficaces.

<p>
Los que desean hacer aportaciones deben firmar y remitir un <a href="https://glassfish.dev.java.net/public/GovernancePolicy.html#SCA_Policy">Acuerdo de aportaci&oacute;n</a>.



<h3>Documentaci&oacute;n</h3>

<p>
Parte de la creaci&oacute;n de un producto de calidad es la documentaci&oacute;n que lo respalda. En el juego de documentaci&oacute;n hay borradores de varios libros para su consulta.

<p>
Consulte la <a
 href="http://glassfish.dev.java.net/javaee5/docs/DocsIndex.html">p&aacute;gina de documentaci&oacute;n</a> para ver la informaci&oacute;n sobre los libros disponibles en formato de borrador. Asimismo, consulte la <a href="TipsandBlogs.html">lista creciente de sugerencias y blogs t&eacute;cnicos</a>, para ver m&aacute;s ejemplos. Agradecemos todos los comentarios.

</div>

</body>

</html>

