<!DOCTYPE html PUBLIC "-//Tigris//DTD XHTML 1.0 Transitional//EN" "http://style.tigris.org/nonav/tigris_transitional.dtd">
<html>
<head>
  <link rel="SHORTCUT ICON" href="../image/glassfish_favicon.gif">
  <title>Usuarios de GlassFish y desarrolladores de aplicaciones</title>
  <meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
</head>
<body>
GlassFish es un servidor de aplicaciones de c&oacute;digo abierto que implementa las &uacute;ltimas funciones de la plataforma Java EE 5. La plataforma Java EE 5 incluye las &uacute;ltimas versiones de tecnolog&iacute;as como JavaServer Pages (JSP) 2.1, JavaServer Faces (JSF) 1.2, Servlet 2.4, Enterprise JavaBeans 3.0, Java API for Web Services (JAX-WS) 2.0, Java Architecture for XML Binding (JAXB) 2.0, Web Services Metadata para Java Platform 1.0, entre otras muchas. <br> <br> &iquest;Es nuevo en GlassFish? Aprenda a descargar e instalar GlassFish, pruebe la gu&iacute;a de procedimientos iniciales, vea algunas pel&iacute;culas o ensaye nuestros ejemplos en el tutorial. Vaya a la p&aacute;gina de procedimientos iniciales. <br> <a href="#Learn_and_Write_Applications_with_the"></a>
<div id="projecthome" class="app">
<h3>Descargar y ejecutar<br>
</h3>
Puede descargar versiones de acceso r&aacute;pido del servidor de aplicaciones GlassFish. La descarga incluye una versi&oacute;n binaria del servidor de aplicaciones GlassFish Java EE 5, de manera que s&oacute;lo tiene que descomprimir la descarga y ejecutarla. Hay descargas para ejecutar en los sistemas operativos m&aacute;s conocidos. <br> <br> Consiga ya las <a href="downloadsindex.html">descargas</a>.<br>
<ul>
</ul>
<h3>Gu&iacute;a de procedimientos iniciales para GlassFish</h3>
Incluye instrucciones para instalar y ejecutar el servidor GlassFish. Adem&aacute;s, contiene un ejemplo de aplicaci&oacute;n sencilla para instalar y probar.
<br> <br> Consulte la <a
 href="http://glassfish.dev.java.net/downloads/quickstart/index.html">Gu&iacute;a</a>.<br><h3>Vea una pel&iacute;cula</h3>
Inicie su experiencia con GlassFish viendo una pel&iacute;cula.
 <br><ul>
  <li><a
 href="http://download.java.net/javaee5/screencasts/sdk-intro/index.html">Introducci&oacute;n a Java EE 5 SDK</a> (21 de febrero de 2006)</li>
  <li><a
 href="http://download.java.net/javaee5/screencasts/admin-console/index.html">Presentaci&oacute;n de la consola de administraci&oacute;n</a> (21 de febrero de 2006)</li>
  <li><a
 href="http://download.java.net/javaee5/screencasts/deployment/index.html">Instalaci&oacute;n de archivos Enterprise y aplicaciones Web</a> (21 de febrero de 2006)</li>
  <li><a href="http://www.netbeans.org/kb/articles/flash.html">Demostraciones Flash de NetBeans IDE</a> (febrero de 2006)<br>
  </li>
</ul>
<h3>Consulte el tutorial</h3>
Conozca las tecnolog&iacute;as Java EE 5, EJB 3.0, JavaServer Faces, Java Persistence APIs, Servlets, JAX-WS JAXB, Java Message Services and transactions, por citar algunas. Escriba ejemplos sencillos e implem&eacute;ntelos en GlassFish.<br> <br> Consulte el <a  href="http://java.sun.com/javaee/5/docs/tutorial/doc/index.html">Tutorial</a>.<br>
<div id="projecthome" class="app"><br>
<h3>P&oacute;ngase en contacto con la comunidad GlassFish<br>
</h3>
Apreciamos y fomentamos su participaci&oacute;n en este proyecto.
<br><ul>
  <li><a href="mailto:feedback@glassfish.dev.java.net">Cu&eacute;ntenos</a> cuando ejecute su aplicaci&oacute;n Java EE en GlassFish<br>
  </li>
  <li><a href="http://forums.java.net/jive/forum.jspa?forumID=56">Participe en debates en los foros</a> con otros usuarios de GlassFish</li>
</ul>
</div>
</div>
</body>
</html>
