<!DOCTYPE html PUBLIC "-//Tigris//DTD XHTML 1.0 Transitional//EN" "http://style.tigris.org/nonav/tigris_transitional.dtd">
<html><head>
  <link rel="SHORTCUT ICON" href="../image/glassfish_favicon.gif">
  <style>
   body
   {
    color: black; padding:0px; margin:0px;
    font-size: 0.8em;
    font-family: Verdana, "Verdana CE",  Arial, "Arial CE", "Lucida Grande CE", lucida, "Helvetica CE", sans-serif;
    background-color: #ffffff;
    background-image: none;
    margin: 10px;
   }
   h1
   {
    color: #ee6b00;
    font-weight: normal;
    font-size: 200%;
    padding: 5px 0 0 0;
    margin: 0 5px 0 0;
    border: 0;
   }
   h2
   {
    font-weight: normal;
    font-size: 150%;
   }
   p,h2,h3,h4
   {
    color: black;
    padding: 0 0 5px 0;
    margin: 0;
    border: 0;
   }
   div.buttons
   {
    padding: 10px 0 20px 0;
    border: 0;
   }
   .blue
   {
    color: #1E2A60;
   }

.app H3 {
clear: none;
}
.axial {
display: none;
}
#apphead {
display: none;
}
  </style><title>Usuarios de GlassFish y desarrolladores de aplicaciones</title>

  <meta http-equiv="Content-Type" content="text/html; charset=windows-1252"></head>
<body>
<p>GlassFish es un servidor de aplicaciones de c&oacute;digo abierto que implementa las &uacute;ltimas funciones de la plataforma Java EE 5. La plataforma Java EE 5 incluye las &uacute;ltimas versiones de tecnolog&iacute;as como JavaServer Pages (JSP) 2.1, JavaServer Faces (JSF) 1.2, Servlet 2.5, Enterprise JavaBeans 3.0, Java API for Web Services (JAX-WS) 2.0, Java Architecture for XML Binding (JAXB) 2.0, Web Services Metadata para Java Platform 1.0, entre otras muchas.<p>
<br>
<p>&iquest;Es nuevo en GlassFish? Aprenda a descargar e instalar GlassFish, pruebe la gu&iacute;a de procedimientos iniciales, vea algunas pel&iacute;culas o ensaye nuestros ejemplos en el tutorial. Visite la <a href="getstarted.html">p&aacute;gina de presentaci&oacute;n de GlassFish</a>.</p>
<div id="projecthome" class="app">
<h3>&iquest;Qu&eacute; desea hacer?</h3>
<a href="getstarted.html">Ver una r&aacute;pida introducci&oacute;n</a><br> <a href="#Download_and_Run_">Descargar</a><br> <a href="#Learn_and_Write_Applications_with_the">Aprender y escribir aplicaciones</a><br> <a href="#GlassFish_Documentation_Drafts">Ver la documentaci&oacute;n</a> <br> <a href="#Contribute_to_the_GlassFish_Community_">Aportaciones a GlassFish</a><br> <a href="#Run_popular_open_source_frameworks_or">Ejecutar conocidos marcos o aplicaciones de c&oacute;digo abierto</a><br> <br>
<h3><a name="Download_and_Run_"></a>Descargar y ejecutar<br>
</h3>
Puede descargar la versi&oacute;n estable de las &uacute;ltimas versiones de acceso r&aacute;pido del servidor de aplicaciones GlassFish. La descarga incluye una versi&oacute;n binaria del servidor de aplicaciones GlassFish Java EE 5, de manera que s&oacute;lo tiene que seguir las sencillas instrucciones y ejecutarla. Hay descargas para ejecutar en los sistemas operativos m&aacute;s conocidos.
<br><ul>
  <li>Consiga ya las <a href="downloadsindex.html">descargas</a>.<br>
  </li>
</ul>
<h3><a name="Learn_and_Write_Applications_with_the"></a>Aprender y escribir aplicaciones con las &uacute;ltimas tecnolog&iacute;as Java EE 5</h3>
El servidor de aplicaciones GlassFish implementa las &uacute;ltimas tecnolog&iacute;as <a href="http://java.sun.com/javaee/5/javatech.html">Java EE 5</a>. Por ejemplo, escriba una aplicaci&oacute;n usando las &uacute;ltimas tecnolog&iacute;as de nivel de web, como JSF1.2.
 Adem&aacute;s de probar las &uacute;ltimas tecnolog&iacute;as, puede ensayar sus aplicaciones J2EE 1.4 (o de versiones anteriores) en GlassFish y obtener un adelanto sobre la migraci&oacute;n.
<ul>
  <li>Consulte la <a href="http://glassfish.dev.java.net/downloads/quickstart/index.html">Gu&iacute;a de procedimientos iniciales</a> para GlassFish. Incluye instrucciones para instalar y ejecutar el servidor GlassFish, as&iacute; como una peque&ntilde;a aplicaci&oacute;n de ejemplo para implementar. </li>
  <li>
    Vaya a la <a href="http://java.sun.com/reference/blueprints/index.html">p&aacute;gina inicial de Java BluePrints</a>, donde encontrar&aacute; trabajos sobre Java EE 5.
 Incluye BluePrints para crear aplicaciones AJAX en la plataforma Java EE 5.  </li>

  <li>
    Desarrolle aplicaciones Java EE <a href="http://glassfish.dev.java.net/public/netbeans/index.html">con NetBeans</a>, usando uno de estos dos tutoriales, una aplicaci&oacute;n sencilla del tipo &quot;hola a todos&quot; y otras m&aacute;s avanzadas, mediante Java EE 5 persistence.</li><li>Los <a href="https://glassfish.dev.java.net/nonav/javaee5/api/index.html">javadocs</a> est&aacute;n en l&iacute;nea.&nbsp;Se actualizan con cada compilaci&oacute;n aprobada.</li>
<li>
    Plantee dudas en el <a href="http://forums.java.net/jive/forum.jspa?forumID=56"> foro</a>
  </li><li>Compruebe la <a href="TipsandBlogs.html">lista creciente de sugerencias y blogs t&eacute;cnicos</a> con ejemplos de uso de las tecnolog&iacute;as Java EE 5 en GlassFish.</li>
  <li>Compruebe <a href="http://blogs.sun.com/roller/page/theaquarium">The Aquarium</a> para enterarse de m&aacute;s novedaes sobre las tecnolog&iacute;as relacionadas con GlassFish.<br>
  </li>

</ul>
<div id="projecthome" class="app">
<h3><a name="GlassFish_Documentation_Drafts"></a>Borradores de documentaci&oacute;n sobre GlassFish</h3>
El equipo GlassFish tiene redactores de documentaci&oacute;n que han sacado los documentos finales. Los documentos se actualizar&aacute;n durante la versi&oacute;n V2 para incluir las funciones adicionales.
 <br><ul>
  <li>Consulte la <a href="https://glassfish.dev.java.net/javaee5/docs/DocsIndex.html">p&aacute;gina inicial de la documentaci&oacute;n</a>, con indicadores a la documentaci&oacute;n disponible. Cu&eacute;ntenos lo que opina.</li>
</ul>
<h3><a name="Contribute_to_the_GlassFish_Community_"></a>Hacer aportaciones a la comunidad GlassFish<br>
</h3>
Apreciamos su participaci&oacute;n en este proyecto y le animamos a que forme parte de &eacute;l. Formas de contribuir:
    <ul>
      <li><a href="mailto:feedback@glassfish.dev.java.net">Cu&eacute;ntenos</a> cu&aacute;ndo llevar&aacute; a ejecutar su aplicaci&oacute;n Java EE en GlassFish<br>
      </li>
      <li><a href="http://forums.java.net/jive/forum.jspa?forumID=56">Participe en debates en los foros</a> con otros usuarios de GlassFish</li>
      <li><a href="https://glassfish.dev.java.net/public/NewtoGlassFish.html#Submit_a_Bug">Env&iacute;e un error</a></li>
      <li><a href="https://glassfish.dev.java.net/public/NewtoGlassFish.html#Request_a_Feature">Solicite una funci&oacute;n</a></li>
      <li><a href="http://wiki.java.net/bin/view/Projects/GlassFishQuality">Proponga pruebas</a>, vea c&oacute;mo en el          Portal de calidad de GlassFish</li>
      <li><a href="devindex.html">Compruebe c&oacute;digo</a> para el servidor de aplicaciones GlassFish</li>
      <li><a href="https://glassfish-samples.dev.java.net">Aporte ejemplos de GlassFish/Java EE</a></li>
       <li>Participe en el <a href="http://wiki.java.net/bin/view/Projects/CATfish">programa CATfish</a><br>
  </li>

    </ul>
<h3><a name="Run_popular_open_source_frameworks_or"></a>Ejecutar conocidos marcos o aplicaciones de c&oacute;digo abierto</h3>
Hay una gran cantidad de marcos de trabajo y aplicaciones de c&oacute;digo abierto que se ejecutan en GlassFish. <a href="http://wiki.java.net/bin/view/Projects/GlassFishExtras">Vea si su aplicaci&oacute;n favorita</a> ha sido comprobada. &iquest;No la ve? Pru&eacute;bela y cu&eacute;ntenoslo.<br> <br>
</div>
</div>
</body></html>
