<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsphysicaldestnew" name="ref-jmsphysicaldestnew"></a></p>

<h4><a id="sthref92" name="sthref92"></a><a id="sthref93" name="sthref93"></a>Nuevo Destino F&iacute;sico JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Nuevo Destino F&iacute;sico JMS para crear un nuevo destino f&iacute;sico JMS.</p>
<p>Normalmente, no es necesario crear destinos f&iacute;sicos, ya que se especifica un nombre de destino f&iacute;sico al crear un recurso de destino JMS y GlassFish Server crea autom&aacute;ticamente el destino f&iacute;sico cuando hace falta.</p>
<p>La p&aacute;gina Nuevo Destino F&iacute;sico JMS contiene las siguientes opciones.</p>
<dl>
<dt>Nombre</dt>
<dd>
<p>Nombre del destino f&iacute;sico.</p>
</dd>
<dt>Tipo</dt>
<dd>
<p>Tipo del destino f&iacute;sico. Las opciones disponibles son <code>javax.jms.Topic</code> y <code>javax.jms.Queue</code>.</p>
</dd>
<dt>N&uacute;mero M&aacute;ximo de Mensajes No Consumidos:</dt>
<dd>
<p>N&uacute;mero m&aacute;ximo de mensajes no consumidos permitido para el destino. Un valor de -1 indica que no hay l&iacute;mite para el n&uacute;mero de mensajes no consumidos. El valor por defecto es -1.</p>
</dd>
<dt>Tama&ntilde;o M&aacute;ximo de Mensaje</dt>
<dd>
<p>Tama&ntilde;o m&aacute;ximo de un mensaje, en bytes. Un valor de -1 indica un tama&ntilde;o de mensaje ilimitado. El valor por defecto es -1.</p>
</dd>
<dt>Memoria M&aacute;xima Total</dt>
<dd>
<p>Total m&aacute;ximo de memoria para mensajes no consumidos, en bytes. Un valor de -1 indica que no hay l&iacute;mite para el tama&ntilde;o de memoria destinado a los mensajes no consumidos. El valor por defecto es -1.</p>
</dd>
<dt>Comportamiento L&iacute;mite de Umbral</dt>
<dd>
<p>Comportamiento que debe seguir el broker cuando se alcanza el umbral del l&iacute;mite de memoria. Las opciones disponibles son:</p>
<dl>
<dt>Rechazar los mensajes m&aacute;s recientes</dt>
<dd>
<p>Rechazar los mensajes m&aacute;s recientes y notificar al cliente que los produce con una excepci&oacute;n s&oacute;lo si el mensaje es persistente. &Eacute;ste es el valor por defecto.</p>
</dd>
<dt>Ralentizar productores</dt>
<dd>
<p>Ralentizar la frecuencia con que los productores de mensajes los env&iacute;an.</p>
</dd>
<dt>Rechazar los m&aacute;s antiguos</dt>
<dd>
<p>Descartar los mensajes m&aacute;s antiguos.</p>
</dd>
<dt>Rechazar los mensajes con prioridad m&aacute;s baja</dt>
<dd>
<p>Descartar los mensajes con la prioridad m&aacute;s baja.</p>
</dd>
</dl>
<p>Si el valor es Rechazar los m&aacute;s antiguos o Rechazar los mensajes con prioridad m&aacute;s baja y Usar cola de mensajes inoperativos se define como True, los mensajes que superen el l&iacute;mite se mueven a la cola de mensajes inoperativos.</p>
</dd>
<dt>N&uacute;mero M&aacute;ximo de Productores</dt>
<dd>
<p>N&uacute;mero m&aacute;ximo de productores de mensajes que se pueden asociar a este destino f&iacute;sico. Cuando se alcanza este l&iacute;mite, no se pueden crear nuevos productores. El valor -1 indica un n&uacute;mero ilimitado de productores. El valor por defecto es 100.</p>
</dd>
<dt>Recuento m&aacute;ximo de mensajes de entrega de lotes</dt>
<dd>
<p>N&uacute;mero m&aacute;ximo de mensajes que pueden entregarse a los consumidores en un solo lote. Un valor de -1 indica un n&uacute;mero ilimitado de mensajes. El valor por defecto es 1.000.</p>
</dd>
<dt>Usar cola de mensajes inoperativos</dt>
<dd>
<p>Si el valor se define en "True", los mensajes inoperativos se colocan en la cola de mensajes inoperativos. Si el valor se define en "False", los mensajes inoperativos se descartar&aacute;n. Por defecto, esta opci&oacute;n se define en "True".</p>
</dd>
<dt>Validar Esquema XML</dt>
<dd>
<p>Si el valor se define en "True", el tiempo de ejecuci&oacute;n del cliente de Message Queue intentar&aacute; validar un mensaje de XML en comparaci&oacute;n con las definiciones del esquema XML especificadas (o compar&aacute;ndolo con el DTD, si es que no se especifica XSD) antes de enviarlo al broker. Si el esquema especificado no se puede localizar o no es posible validar el mensaje, &eacute;ste &uacute;ltimo no se enviar&aacute; y aparecer&aacute; una excepci&oacute;n. Por defecto, esta opci&oacute;n se define en "False".</p>
</dd>
<dt>Lista URI de Esquema XML</dt>
<dd>
<p>Una lista separada por espacios de cadenas URI (XSD) de definici&oacute;n de esquema XML. Si est&aacute; activada la validaci&oacute;n del esquema XML, las URI indican la ubicaci&oacute;n de uno o m&aacute;s XSD que se emplear&aacute;n para la validaci&oacute;n del esquema XML.</p>
</dd>
</dl>
<a id="sthref94" name="sthref94"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-jmsservice.html">Para configurar el servicio JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestnew.html">Para crea un destino f&iacute;sico JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestedit.html">Para editar un destino f&iacute;sico JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestdelete.html">Para suprimir un destino f&iacute;sico JMS</a></p>
</li>
<li>
<p><a href="task-jmsflushmessages.html">Para eliminar mensajes de un destino f&iacute;sico JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldeststats.html">Para ver las estad&iacute;sticas de un destino f&iacute;sico JMS</a></p>
</li>
</ul>
<a id="sthref95" name="sthref95"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00038"><code>create-jmsdest</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00175"><code>list-jmsdest</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00090"><code>delete-jmsdest</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00136"><code>flush-jmsdest</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00144"><code>jms-ping</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
