<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsconnectionproperties" name="ref-jmsconnectionproperties"></a><a id="GHJMS00005" name="GHJMS00005"></a></p>

<h4><a id="sthref57" name="sthref57"></a><a id="sthref58" name="sthref58"></a>Propiedades espec&iacute;ficas de f&aacute;bricas de conexiones JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Las siguientes propiedades adicionales est&aacute;n disponibles para una f&aacute;brica de conexiones JMS.</p>
<dl>
<dt><code>ClientID</code></dt>
<dd>
<p>Especifica un ID de cliente para una f&aacute;brica de conexiones que utilizar&aacute; un suscriptor duradero.</p>
</dd>
<dt><code>AddressList</code></dt>
<dd>
<p>Especifica el nombre (y, de forma opcional, n&uacute;meros de puerto) de una instancia o instancias de Oracle Message Broker con el que se comunicar&aacute;n las aplicaciones. Cada una de las direcciones de la lista incluye el nombre del host (y, de forma opcional, el puerto del host y el servicio de conexi&oacute;n) para efectuar la conexi&oacute;n. Por ejemplo, el valor podr&iacute;a ser <code>earth</code> o <code>earth:7677</code>. Especifique el n&uacute;mero de puerto si Oracle Message Broker se est&aacute; ejecutando en un puerto distinto del puerto por defecto (7676). Si la configuraci&oacute;n de propiedades indica varios hosts y puertos en un entorno de clusters, se utiliza el primer host disponible de la lista, a menos que la propiedad <code>AddressListBehavior</code> se defina en <code>RANDOM</code>.</p>
<p>Para obtener m&aacute;s informaci&oacute;n, consulte la <i>Message Queue Developer's Guide for Java Clients</i> (Gu&iacute;a del Desarrollador de Message Queue para Clientes Java)</p>
<p>El valor por defecto es el host local y el n&uacute;mero de puerto por defecto (7676). El cliente intentar&aacute; una conexi&oacute;n a un broker en el puerto 7676 del host local.</p>
</dd>
<dt><code>Nombre de Usuario</code></dt>
<dd>
<p>Nombre de usuario para la f&aacute;brica de conexiones.</p>
<p>El valor por defecto es <code>guest</code>.</p>
</dd>
<dt><code>Contrase&ntilde;a</code></dt>
<dd>
<p>Contrase&ntilde;a para la f&aacute;brica de conexiones.</p>
<p>El valor por defecto es <code>guest</code>.</p>
</dd>
<dt><code>ReconnectEnabled</code></dt>
<dd>
<p>Si se define como <code>true</code>, indica que el tiempo de ejecuci&oacute;n del cliente intenta volver a conectarse con un servidor de mensajes (o la lista de direcciones de <code>AddressList</code>) cuando se pierde una conexi&oacute;n.</p>
<p>El valor por defecto es <code>true</code>.</p>
</dd>
<dt><code>ReconnectAttempts</code></dt>
<dd>
<p>Especifica el n&uacute;mero de intentos cuando intenta conectarse (o volver a conectarse) para cada direcci&oacute;n de la <code>AddressList</code> antes de que el tiempo de ejecuci&oacute;n del cliente contin&uacute;e con la siguiente direcci&oacute;n de la lista. El valor -1 indica que el n&uacute;mero de intentos de reconexi&oacute;n es ilimitado (el tiempo de ejecuci&oacute;n del cliente intenta conectarse con la primera direcci&oacute;n hasta que lo consigue).</p>
<p>El valor por defecto es 3.</p>
</dd>
<dt><code>ReconnectInterval</code></dt>
<dd>
<p>Especifica en milisegundos el intervalo entre dos intentos de reconexi&oacute;n. Se refiere a intentos en cada direcci&oacute;n de la <code>AddressList</code> y direcciones sucesivas de la lista. Si el intervalo es demasiado corto, el broker no tiene tiempo de recuperar. Si es demasiado largo, la reconexi&oacute;n puede suponer un retraso inaceptable.</p>
<p>El valor por defecto es 30000.</p>
</dd>
<dt><code>AddressListBehavior</code></dt>
<dd>
<p>Especifica si los intentos de conexi&oacute;n se realizan en el orden de las direcciones del atributo <code>AddressList</code> (<code>PRIORITY</code>) o de forma aleatoria (<code>RANDOM</code>).</p>
<p><code>RANDOM</code> significa que la reconexi&oacute;n selecciona una direcci&oacute;n aleatoria de la <code>AddressList</code>. Si es probable que muchos clientes intenten una conexi&oacute;n con la misma f&aacute;brica de conexiones, este valor evita que se conecten todos a la misma direcci&oacute;n.</p>
<p><code>PRIORITY</code> significa que la reconexi&oacute;n siempre intenta conectar con la primera direcci&oacute;n del servidor en la <code>AddressList</code> y utiliza otra direcci&oacute;n s&oacute;lo si el primer broker no est&aacute; disponible.</p>
<p>El valor por defecto es <code>RANDOM</code>.</p>
</dd>
<dt><code>AddressListIterations</code></dt>
<dd>
<p>Especifica el n&uacute;mero de veces que el tiempo de ejecuci&oacute;n del cliente se repite a trav&eacute;s de la <code>AddressList</code> en un esfuerzo por establecer (o restablecer) una conexi&oacute;n. El valor -1 indica que el n&uacute;mero de intentos es ilimitado.</p>
<p>El valor por defecto es 3.</p>
</dd>
</dl>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
