<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsavailability" name="ref-jmsavailability"></a></p>

<h4><a id="sthref71" name="sthref71"></a><a id="sthref72" name="sthref72"></a>Disponibilidad de JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Disponibilidad de JMS para configurar el cluster de broker Cola de mensajes para atender el cluster de GlassFish Server.</p>

<hr>
<p><b>Atenci&oacute;n:</b></p>
Antes de usar la p&aacute;gina Disponibilidad de JMS para volver a configurar un cluster existente, realice los procedimientos espec&iacute;ficos para la migraci&oacute;n a otro tipo de cluster de broker, como se describe en la secci&oacute;n sobre <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSHAG00158">migraci&oacute;n entre tipos de clusters de broker convencionales embebidos o locales</a> en <i>Oracle GlassFish Server High Availability Administration Guide</i>. Si no realiza estos procedimientos especiales, se pueden perder o corromper datos o incluso hacer que la configuraci&oacute;n sea inservible, dependiendo de las operaciones de JMS realizadas en el cluster existente.
<hr>

<p>La p&aacute;gina Disponibilidad de JMS contiene las siguientes opciones.</p>

<hr>
<p><b>Nota:</b></p>
Si se est&aacute;n ejecutando instancias que utilizan la configuraci&oacute;n, la p&aacute;gina Disponibilidad de JMS mostrar&aacute; una advertencia, definir&aacute; todas las opciones en s&oacute;lo lectura y desactivar&aacute; el bot&oacute;n Guardar.
<hr>

<dl>
<dt>Tipo de servicio JMS</dt>
<dd>
<p>Tipo de broker (llamado host JMS en GlassFish Server) que se debe usar en el cluster de broker. El tipo seleccionado determinar&aacute; los tipos de clusters de broker disponibles. Los tipos de broker disponibles son los siguientes:</p>
<dl>
<dt>Embebido</dt>
<dd>
<p>GlassFish Server gestiona el ciclo de vida y la configuraci&oacute;n del broker. Cada instancia en cluster de GlassFish la sirve un broker que se ejecuta en la misma JVM que la instancia.</p>
<p>Si la opci&oacute;n Tipo de servicio JMS se define en Embebido, s&oacute;lo se soportar&aacute;n los clusters de broker Cola de mensajes convencionales. Se mostrar&aacute;n las opciones de configuraci&oacute;n del cluster convencional.</p>
</dd>
<dt>Local</dt>
<dd>
<p>GlassFish Server gestiona el ciclo de vida y la configuraci&oacute;n del broker. Cada instancia en cluster de GlassFish la sirve un broker que se ejecuta en una JVM distinta situada en el mismo host que la instancia.</p>
<p>Si la opci&oacute;n Tipo de servicio JMS se define en Local, se soportar&aacute;n los clusters de broker Cola de mensajes convencionales y tambi&eacute;n los mejorados (con alta disponibilidad). Se mostrar&aacute;n las opciones para seleccionar el tipo de cluster y para la configuraci&oacute;n del mismo.</p>
</dd>
<dt>Remoto</dt>
<dd>
<p>La configuraci&oacute;n y el ciclo de vida del broker y del cluster de broker se gestionan a trav&eacute;s de las herramientas administrativas de Cola de mensajes.</p>
<p>Si la opci&oacute;n Tipo de servicio JMS se define en Remoto, no se mostrar&aacute;n otras opciones.</p>
</dd>
</dl>
</dd>
<dt>Tipo de cluster de JMS</dt>
<dd>
<p>Tipo de cluster de broker Cola de mensajes que se debe usar para el cluster de GlassFish Server.</p>
<p>Si la opci&oacute;n Tipo de cluster de JMS se define en Convencional, se mostrar&aacute;n las opciones siguientes.</p>
<dl>
<dt>Tipo de almac&eacute;n de configuraci&oacute;n de JMS</dt>
<dd>
<p>Tipo de almac&eacute;n de datos que se va a usar para los datos de configuraci&oacute;n del cluster convencional. Si esta opci&oacute;n se define como Broker maestro, se designar&aacute; un broker del cluster como broker maestro que ser&aacute; responsable del almacenamiento de los datos de configuraci&oacute;n. Si esta opci&oacute;n se define en Base de datos compartida, los datos de configuraci&oacute;n se almacenar&aacute;n en un almac&eacute;n de datos JDBC accesible para todos los brokers. En este caso, se mostrar&aacute;n las opciones relacionadas con la base de datos.</p>
</dd>
<dt>Tipo de almac&eacute;n de mensajes de JMS</dt>
<dd>
<p>Tipo de almac&eacute;n de datos que va a usar cada broker para almacenar los datos de sus mensajes. Si se define esta opci&oacute;n en Archivo, cada broker almacenar&aacute; los datos correspondientes en un almac&eacute;n de datos basado en archivos. Si se define esta opci&oacute;n en JDBC, cada broker almacenar&aacute; los datos correspondientes en un almac&eacute;n de datos JDBC.</p>
</dd>
</dl>
<p>Si la opci&oacute;n Tipo de cluster de JMS se define en Mejorado (HA), se mostrar&aacute;n las opciones relacionadas con las bases de datos.</p>
</dd>
<dt>Proveedor de base de datos</dt>
<dt>URL de base de datos</dt>
<dt>Usuario de base de datos</dt>
<dd>
<p>Proveedor de la base de datos, URL de acceso y usuario de la base de datos JDBC que se van a utilizar en cualquiera de estas situaciones:</p>
<ul>
<li>
<p>Cuando el tipo de almac&eacute;n de configuraci&oacute;n de un cluster convencional se ha definido en Base de datos compartida.</p>
</li>
<li>
<p>Cuando el tipo de almac&eacute;n de mensajes de un cluster convencional se ha definido en JDBC.</p>
</li>
<li>
<p>Cuando el tipo de cluster se ha definido en Mejorado (HA).</p>
</li>
</ul>
<p>Para obtener informaci&oacute;n sobre proveedores soportados y los formatos de URL de acceso de cada proveedor, consulte la secci&oacute;n sobre <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GMADG00244">persistencia basada en JDBC</a> en <i>Oracle GlassFish Server Message Queue Administration Guide</i>.</p>
</dd>
<dt>Autenticaci&oacute;n de base de datos</dt>
<dt>Contrase&ntilde;a de base de datos</dt>
<dt>Alias de contrase&ntilde;a</dt>
<dd>
<p>Informaci&oacute;n de contrase&ntilde;a para el usuario de la base de datos JDBC especificado en Usuario de base de datos.</p>
<p>Si la opci&oacute;n Autenticaci&oacute;n de base de datos est&aacute; definida en Contrase&ntilde;a, se mostrar&aacute; la opci&oacute;n Contrase&ntilde;a de base de datos. Si la opci&oacute;n Autenticaci&oacute;n de base de datos est&aacute; definida en Alias de contrase&ntilde;a, se mostrar&aacute; la opci&oacute;n Alias de contrase&ntilde;a.</p>
</dd>
<dt>Propiedades Adicionales</dt>
<dd>
<p>Propiedades adicionales para la disponibilidad de JMS.</p>
<p>GlassFish Server no predefine las propiedades adicionales de disponibilidad de JMS.</p>
</dd>
</dl>
<a id="sthref73" name="sthref73"></a>
<h5>Tareas relacionadas</h5>
<p><a href="task-jmsservice.html">Para configurar el servicio JMS</a></p>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
