<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsservice" name="ref-jmsservice"></a></p>

<h4><a id="sthref74" name="sthref74"></a>Java Message Service</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use la p&aacute;gina Java Message Service para configurar los valores que usar&aacute; el proveedor de JMS por defecto, GlassFish Server Cola de mensajes.</p>
<p>Para obtener m&aacute;s informaci&oacute;n sobre c&oacute;mo configurar el servicio JMS, consulte el <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDVG00020">Cap&iacute;tulo 19 sobre <i>c&oacute;mo utilizar el Java Message Service,</i> en la <i>Oracle GlassFish Server Application Development Guide</i></a>.</p>
<p>La p&aacute;gina Java Message Service contiene las opciones siguientes.</p>
<dl>
<dt>Cargar Valores por Defecto</dt>
<dd>
<p>Bot&oacute;n para restaurar configuraci&oacute;n que tiene valores por defecto a sus valores por defecto. Las configuraciones que no tienen valores por defecto no se modifican.</p>
</dd>
<dt>Ping</dt>
<dd>
<p>Bot&oacute;n para comprobar que el servicio JMS se est&aacute; ejecutando en el host JMS por defecto. Si el servicio JMS est&aacute; activo y en ejecuci&oacute;n, un mensaje informa que el ping se ha realizado correctamente.</p>
</dd>
<dt>Nombre de Configuraci&oacute;n</dt>
<dd>
<p>Nombre de la configuraci&oacute;n a la que se aplican los valores de esta p&aacute;gina. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>Tipo</dt>
<dd>
<p>Tipo de acceso para el servicio JMS. Las opciones disponibles son:</p>
<dl>
<dt>EMBEDDED</dt>
<dd>
<p>Acceso al servicio JMS en el host local. El servicio JMS se inicia en la misma m&aacute;quina JVM que GlassFish Server. La inicializaci&oacute;n lenta inicia el broker por defecto embebido al acceder por primera vez a los servicios JMS, en lugar de al iniciar GlassFish Server. &Eacute;ste es el tipo por defecto de servicio JMS.</p>
</dd>
<dt>LOCAL</dt>
<dd>
<p>Acceso al servicio JMS en el host local. El proveedor JMS se inicia junto con GlassFish Server.</p>
</dd>
<dt>REMOTE</dt>
<dd>
<p>Acceso al servicio JMS en otro sistema. Si selecciona REMOTE, GlassFish Server no iniciar&aacute; el servicio JMS la siguiente vez que se inicie el servidor. En su lugar, el servicio JMS se inicia y se gestiona a trav&eacute;s de Message Queue; por tanto, debe iniciar el broker de Message Queue por separado. Para obtener m&aacute;s informaci&oacute;n sobre c&oacute;mo iniciar el broker, consulte la secci&oacute;n sobre <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GMADG00227"><i>c&oacute;mo iniciar el broker</i> de <i>Oracle GlassFish Server Message Queue Administration Guide</i></a>. Si selecciona este valor y est&aacute; utilizando un host remoto, siga las instrucciones de la secci&oacute;n <a href="task-jmshostedit.html">Para editar un host JMS</a> para especificar el nombre del host remoto.</p>
</dd>
</dl>
</dd>
<dt>Timeout de Inicio</dt>
<dd>
<p>N&uacute;mero de segundos que GlassFish Server esperar&aacute; para que se inicie el servicio JMS antes de abortar el inicio. Para un sistema lento o sobrecargado, aumente el valor por defecto. El valor por defecto es 60.</p>
</dd>
<dt>Argumentos de Inicio</dt>
<dd>
<p>Argumentos para personalizar el inicio del servicio JMS. Puede utilizar todos los argumentos disponibles a trav&eacute;s del comando as-install-parent<code>/mq/bin/imqbrokerd</code>.</p>
</dd>
<dt>Volver a Conectar</dt>
<dd>
<p>Si se activa la casilla de control de activaci&oacute;n de nueva conexi&oacute;n, el servicio JMS intentar&aacute; volver a conectarse a un servidor de mensajes (o a la lista de direcciones de AddressList) cuando se pierda una conexi&oacute;n. Esta opci&oacute;n se encuentra activada por defecto.</p>
</dd>
<dt>Intervalo de Reconexi&oacute;n</dt>
<dd>
<p>N&uacute;mero de segundos entre los intentos de reconexi&oacute;n. Este intervalo se aplica a intentos con cada direcci&oacute;n de la AddressList y direcciones sucesivas de la lista. Si es demasiado corto, este intervalo de tiempo no dar&aacute; tiempo al broker para la recuperaci&oacute;n. Si es demasiado largo, la reconexi&oacute;n puede suponer un retraso inaceptable. El valor por defecto es de 5 segundos.</p>
</dd>
<dt>Intentos de Reconexi&oacute;n</dt>
<dd>
<p>Especifica el n&uacute;mero de intentos de conexi&oacute;n (o reconexi&oacute;n) para cada direcci&oacute;n de la AddressList antes de que el tiempo de ejecuci&oacute;n del cliente contin&uacute;e con la siguiente direcci&oacute;n de la lista. El valor -1 indica que el n&uacute;mero de intentos de reconexi&oacute;n es ilimitado (el tiempo de ejecuci&oacute;n del cliente intenta conectarse con la primera direcci&oacute;n hasta que lo consigue). El valor por defecto es 3.</p>
</dd>
<dt>Host JMS por Defecto</dt>
<dd>
<p>Nombre del host JMS por defecto. El valor por defecto es <code>default_JMS_host</code>.</p>
</dd>
<dt>Broker Maestro</dt>
<dd>
<p>Nombre de la instancia en cluster de GlassFish Server cuyo broker Cola de mensajes asociado se va a usar como broker maestro en el cluster de broker Cola de mensajes. Deje este campo en blanco para activar la designaci&oacute;n autom&aacute;tica de broker maestro en GlassFish Server.</p>
<p>Si cambia este valor, debe reiniciar el cluster de GlassFish Server que usa la configuraci&oacute;n.</p>
</dd>
<dt>Comportamiento de Lista de Direcciones</dt>
<dd>
<p>Orden de intentos de conexi&oacute;n. Las opciones disponibles son:</p>
<dl>
<dt><code>random</code></dt>
<dd>
<p>Seleccione una direcci&oacute;n de la lista de direcciones de forma aleatoria. Si hay muchos clientes que intentan una conexi&oacute;n utilizando la misma f&aacute;brica de conexiones, especifique <code>RANDOM</code> para evitar que todos se conecten a la misma direcci&oacute;n. &Eacute;sta es la opci&oacute;n por defecto.</p>
</dd>
<dt><code>priority</code></dt>
<dd>
<p>La reconexi&oacute;n siempre intenta volver a conectarse a la primera direcci&oacute;n de servidor de AddressList y utiliza otra solamente cuando el primer broker no est&aacute; disponible.</p>
</dd>
</dl>
</dd>
<dt>Iteraciones de Lista de Direcciones</dt>
<dd>
<p>N&uacute;mero de veces que servicio JMS repite el recorrido por la lista AddressList en un esfuerzo por establecer (o restablecer) una conexi&oacute;n. El valor -1 indica que el n&uacute;mero de intentos es ilimitado. El valor por defecto es 3.</p>
</dd>
<dt>Esquema MQ y Servicio MQ</dt>
<dd>
<p>Nombre de esquema de la direcci&oacute;n de Message Queue y el nombre del servicio de conexi&oacute;n de Message Queue si no se van a utilizar esquemas o servicios por defecto. Consulte <a href="ref-mqschemeservice.html">Sintaxis de las Direcciones de Esquema MQ y Servicio MQ</a> para obtener m&aacute;s informaci&oacute;n sobre la sintaxis.</p>
</dd>
<dt>Propiedades Adicionales</dt>
<dd>
<p>Propiedades adicionales del servicio JMS.</p>
<p>Para obtener m&aacute;s informaci&oacute;n sobre las propiedades disponibles, consulte <a href="ref-jmsservice-additional-props.html">Propiedades espec&iacute;ficas del servicio JMS</a>.</p>
</dd>
</dl>
<a id="sthref75" name="sthref75"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-jmsservice.html">Para configurar el servicio JMS</a></p>
</li>
<li>
<p><a href="task-jmshostnew.html">Para crear un host JMS</a></p>
</li>
<li>
<p><a href="task-jmshostedit.html">Para editar un host JMS</a></p>
</li>
<li>
<p><a href="task-jmshostdelete.html">Para suprimir un host JMS</a></p>
</li>
</ul>
<a id="sthref76" name="sthref76"></a>
<h5>Comandos asadmin Relacionados</h5>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00144"><code>jms-ping</code>(1)</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
