<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsconnectionfactories" name="ref-jmsconnectionfactories"></a></p>

<h4><a id="sthref45" name="sthref45"></a><a id="sthref46" name="sthref46"></a>F&aacute;bricas de conexiones de JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina F&aacute;bricas de Conexiones JMS para configurar recursos de la f&aacute;brica de conexiones JMS.</p>
<p>Para cada recurso, aparece la siguiente informaci&oacute;n.</p>
<dl>
<dt>Nombre JNDI</dt>
<dd>
<p>Nombre JNDI que identifica la f&aacute;brica de conexiones.</p>
</dd>
<dt>Nombre de JNDI l&oacute;gico</dt>
<dd>
<p>Nombre de JNDI l&oacute;gico para la f&aacute;brica de conexiones. Consulte <a href="../../../common/en/help/ref-logicaljndinames.html">Nombres de JNDI l&oacute;gicos</a> para obtener m&aacute;s informaci&oacute;n.</p>
</dd>
<dt>Activado</dt>
<dd>
<p>(Esta columna s&oacute;lo se muestra si la instancia del servidor por defecto, <code>server</code>, existe en el dominio).</p>
<p>Una marca de control si el recurso est&aacute; activado, o una X si est&aacute; desactivado.</p>
</dd>
<dt>Estado</dt>
<dd>
<p>(Esta columna s&oacute;lo se muestra si en el dominio se ha creado alg&uacute;n cluster o instancia independiente).</p>
<p>N&uacute;mero de clusters e instancias independientes a los que se dirige el recurso y el n&uacute;mero de estos destinos en los que el recurso est&aacute; activado. Por ejemplo, "Activado en 2 de 4 de destinos" significa que el recurso se dirige a cuatro clusters e instancias independientes y que est&aacute; activado en dos de estos cuatro destinos.</p>
</dd>
<dt>Tipo de recurso</dt>
<dd>
<p>Tipo de recurso de la f&aacute;brica de conexiones.</p>
</dd>
<dt>Descripci&oacute;n</dt>
<dd>
<p>Descripci&oacute;n de la f&aacute;brica de conexiones.</p>
</dd>
</dl>
<p>La tabla F&aacute;bricas de Conexiones tambi&eacute;n contiene las siguientes opciones.</p>
<dl>
<dt>Nuevo</dt>
<dd>
<p>Bot&oacute;n para crear una nueva f&aacute;brica de conexiones.</p>
</dd>
<dt>Suprimir</dt>
<dd>
<p>Bot&oacute;n para suprimir una o varias f&aacute;bricas de conexiones seleccionadas.</p>
</dd>
<dt>Activar</dt>
<dd>
<p>Bot&oacute;n para activar una o varias f&aacute;bricas de conexiones seleccionadas.</p>
</dd>
<dt>Desactivar</dt>
<dd>
<p>Bot&oacute;n para desactivar una o varias f&aacute;bricas de conexiones seleccionadas.</p>
</dd>
</dl>
<a id="sthref47" name="sthref47"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-jmsconnectionnew.html">Para crear un recurso de la f&aacute;brica de conexiones JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectionedit.html">Para editar un recurso de la f&aacute;brica de conexiones JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">Para suprimir un recurso de la f&aacute;brica de conexiones JMS</a></p>
</li>
</ul>
<a id="sthref48" name="sthref48"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00040"><code>create-jms-resource</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00177"><code>list-jms-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00092"><code>delete-jms-resource</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
