<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsconnectionnew" name="ref-jmsconnectionnew"></a><a id="GHJMS00003" name="GHJMS00003"></a></p>

<h4><a id="sthref49" name="sthref49"></a><a id="sthref50" name="sthref50"></a>Nueva F&aacute;brica de Conexiones JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina de Nueva F&aacute;brica de Conexiones JMS para crear una f&aacute;brica de conexiones JMS nueva.</p>
<p>La p&aacute;gina Nueva F&aacute;brica de Conexiones JMS contiene las siguientes opciones.</p>
<dl>
<dt>Nombre de pool</dt>
<dd>
<p>Un nombre &uacute;nico que identifica la f&aacute;brica de conexiones. GlassFish Server define el nombre JNDI de la f&aacute;brica de conexiones en este valor.</p>
</dd>
<dt>Tipo de recurso</dt>
<dd>
<p>Tipo de la f&aacute;brica de conexiones. Las opciones disponibles son <code>javax.jms.ConnectionFactory</code>, <code>javax.jms.QueueConnectionFactory</code> y <code>javax.jms.TopicConnectionFactory</code>.</p>
</dd>
<dt>Descripci&oacute;n</dt>
<dd>
<p>Descripci&oacute;n de la f&aacute;brica de conexiones.</p>
</dd>
<dt>Estado</dt>
<dd>
<p>Estado de la f&aacute;brica de conexiones. La f&aacute;brica de conexiones se puede activar o desactivar. Esta opci&oacute;n se encuentra activada por defecto.</p>
</dd>
<dt>Tama&ntilde;o de pool inicial y m&iacute;nimo:</dt>
<dd>
<p>El n&uacute;mero m&iacute;nimo de conexiones del pool para la f&aacute;brica de conexiones. El valor por defecto es 8.</p>
</dd>
<dt>Tama&ntilde;o de Pool M&aacute;ximo</dt>
<dd>
<p>El n&uacute;mero m&aacute;ximo de conexiones del pool para la f&aacute;brica de conexiones. El valor por defecto es 32.</p>
</dd>
<dt>Cantidad de Cambio de Tama&ntilde;o del Pool</dt>
<dd>
<p>N&uacute;mero de conexiones que se pueden eliminar cuando se agota el timeout de inactividad del pool. El valor por defecto es 2.</p>
</dd>
<dt>Timeout de Inactividad</dt>
<dd>
<p>Tiempo m&aacute;ximo, en segundos, que una conexi&oacute;n puede permanecer inactiva en el pool. El valor por defecto es 300.</p>
</dd>
<dt>Tiempo de Espera M&aacute;ximo</dt>
<dd>
<p>Cantidad de tiempo que la aplicaci&oacute;n que solicita una conexi&oacute;n puede esperar para obtener un mensaje de timeout de conexi&oacute;n. El valor por defecto es 60000.</p>
</dd>
<dt>Ante cualquier fallo</dt>
<dd>
<p>Si se activa la casilla de control Cerrar Todas las Conexiones, GlassFish Server cerrar&aacute; todas las conexiones del pool y las restablecer&aacute; aunque tan s&oacute;lo falle una. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Soporte de Transacci&oacute;n</dt>
<dd>
<p>El soporte de transacci&oacute;n seleccionado sustituye el atributo de soporte de transacci&oacute;n en el adaptador de recursos asociado al pool de conexiones de una forma descendente. Dicho de otro modo, puede soportar un nivel de transacci&oacute;n inferior o id&eacute;ntico al que se especifica en el adaptador de recursos, pero no puede indicar un nivel superior.</p>
<p>El valor puede ser cualquiera de los siguientes:</p>
<dl>
<dt>XATransaction</dt>
<dd>
<p>El recurso se puede utilizar para transacciones que suponen el uso de m&aacute;s de un recurso dentro de un &aacute;mbito de transacci&oacute;n. &Eacute;ste es el valor por defecto de una f&aacute;brica de conexiones JMS.</p>
<p>Por ejemplo, en las transacciones puede participar este recurso m&aacute;s un recurso JDBC, un recurso de conector u otro recurso de f&aacute;brica de conexiones JMS. Este valor ofrece la m&aacute;xima flexibilidad. Un recurso que se configure como XATransaction participar&aacute; en operaciones de confirmaci&oacute;n de dos fases.</p>
</dd>
<dt>LocalTransaction</dt>
<dd>
<p>Este recurso se puede utilizar bien para transacciones que impliquen solamente un recurso dentro del &aacute;mbito de la transacci&oacute;n o bien como el &uacute;ltimo agente en una transacci&oacute;n distribuida que involucre a m&aacute;s de un recurso XA.</p>
<p>Este valor ofrece un rendimiento mucho m&aacute;s &oacute;ptimo. Un recurso que se configura como LocalTransaction no se utilizar&aacute; en operaciones de confirmaci&oacute;n de dos fases.</p>
</dd>
<dt>NoTransaction</dt>
<dd>
<p>Este recurso no puede participar nunca en transacciones. Esta configuraci&oacute;n es de uso limitado en aplicaciones JMS.</p>
</dd>
</dl>
</dd>
<dt>Validaci&oacute;n de la conexi&oacute;n</dt>
<dd>
<p>Si la casilla de control Necesaria est&aacute; activada, las conexiones se validar&aacute;n antes de proporcion&aacute;rselas a la aplicaci&oacute;n. Si falla la validaci&oacute;n de un recurso, &eacute;ste se destruye, y se crea y se devuelve un recurso nuevo. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Propiedades Adicionales</dt>
<dd>
<p>Son las propiedades adicionales de la f&aacute;brica de conexiones.</p>
<p>Para obtener m&aacute;s informaci&oacute;n sobre las propiedades disponibles, consulte <a href="ref-jmsconnectionproperties.html">Propiedades espec&iacute;ficas de f&aacute;bricas de conexiones JMS</a>.</p>
</dd>
<dt>Destinos</dt>
<dd>
<p>Clusters e instancias independientes para la f&aacute;brica de conexiones. Mueva los destinos seleccionados a la columna Destinos Seleccionados mediante los botones Agregar y Agregar Todos. Mueva los destinos que no necesite a la columna Destinos Disponibles mediante los botones Eliminar y Eliminar Todos.</p>
<p>Esta opci&oacute;n s&oacute;lo se muestra si en el dominio se han creado clusters o instancias independientes.</p>
</dd>
</dl>
<a id="sthref51" name="sthref51"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-jmsconnectionnew.html">Para crear un recurso de la f&aacute;brica de conexiones JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectionedit.html">Para editar un recurso de la f&aacute;brica de conexiones JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">Para suprimir un recurso de la f&aacute;brica de conexiones JMS</a></p>
</li>
</ul>
<a id="sthref52" name="sthref52"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00040"><code>create-jms-resource</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00177"><code>list-jms-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00092"><code>delete-jms-resource</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
