<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsdestinationedit" name="task-jmsdestinationedit"></a></p>

<h4><a id="sthref14" name="sthref14"></a><a id="sthref15" name="sthref15"></a>Para editar un recurso de destino JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Recursos.</p>
</li>
<li>
<p>En el nodo Recursos, ampl&iacute;e el nodo Recursos de JMS.</p>
</li>
<li>
<p>En el nodo Recursos de JMS, seleccione el nodo Recursos de Destino JMS.</p>
<p>Se abrir&aacute; la p&aacute;gina Recursos de Destino JMS.</p>
</li>
<li>
<p>En la p&aacute;gina Recursos de Destino JMS, haga clic en el nombre del recurso de destino que vaya a editar.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar Recurso de Destino JMS.</p>
</li>
<li>
<p>En el campo Nombre de Destino F&iacute;sico, introduzca el nombre del destino f&iacute;sico que se asociar&aacute; a este recurso.</p>
<p>GlassFish Server crear&aacute; el destino f&iacute;sico autom&aacute;ticamente cuando sea necesario y lo suprimir&aacute; cuando se suprima el recurso de destino.</p>
</li>
<li>
<p>En la lista desplegable Tipo de Recurso, seleccione <code>javax.jms.Topic</code> o <code>javax.jms.Queue</code>.</p>
</li>
<li>
<p>En el campo Descripci&oacute;n, introduzca una descripci&oacute;n del recurso de destino.</p>
</li>
<li>
<p>Active la casilla de control Estado activado para activar el recurso en tiempo de ejecuci&oacute;n.</p>
<p>Esta opci&oacute;n se encuentra activada por defecto.</p>
</li>
<li>
<p>En el &aacute;rea de Propiedades Adicionales, indique las propiedades adicionales para el recurso de destino.</p>
<p>ProductName; no define ninguna propiedad adicional para los recursos de destino JMS.</p>
<ul>
<li>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, introduzca el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
</li>
<li>
<p>Para modificar una propiedad, edite el campo Valor.</p>
</li>
<li>
<p>Para suprimir una propiedad, active la casilla de control a la izquierda del campo Nombre de la propiedad que est&aacute; suprimiendo y, a continuaci&oacute;n, haga clic en el bot&oacute;n Suprimir Propiedades.</p>
</li>
</ul>
</li>
<li>
<p>Haga clic en Guardar.</p>

<hr>
<p><b>Sugerencia:</b></p>
Para volver a la configuraci&oacute;n por defecto, haga clic en el bot&oacute;n Cargar Valores por Defecto y, a continuaci&oacute;n, en Guardar.
<hr>

</li>
<li>
<p>Tambi&eacute;n puede hacer clic en el separador Destinos para ir a la p&aacute;gina Destinos de Recurso de Destino JMS. En esta p&aacute;gina, haga lo siguiente:</p>
<ol type="a">
<li>
<p>Haga clic en Gestionar Destinos para abrir la p&aacute;gina Gestionar Destinos de Recurso correspondiente.</p>
<p>En esta p&aacute;gina, mueva los destinos como corresponda entre la columna Disponibles y la columna Seleccionados. Aseg&uacute;rese de colocar en esta &uacute;ltima columna los destinos en los que se desplegar&aacute;n las aplicaciones que usan el recurso. Los destinos disponibles incluyen los clusters y las instancias de servidor disponibles, as&iacute; como la instancia de servidor por defecto, llamada <code>server</code>. Haga clic en Aceptar para guardar los cambios.</p>
</li>
<li>
<p>Active la casilla de control de un destino concreto y haga clic en Activar o Desactivar para realizar la acci&oacute;n correspondiente en el recurso para dicho destino.</p>
</li>
</ol>
</li>
</ol>
<a id="sthref16" name="sthref16"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-jmsconnectionnew.html">Para crear un recurso de la f&aacute;brica de conexiones JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectionedit.html">Para editar un recurso de la f&aacute;brica de conexiones JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">Para suprimir un recurso de la f&aacute;brica de conexiones JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationnew.html">Para crear un recurso de destino JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationdelete.html">Para suprimir un recurso de destino JMS</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
