<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsdestinationnew" name="task-jmsdestinationnew"></a><a id="GHJMS00023" name="GHJMS00023"></a></p>

<h4><a id="sthref11" name="sthref11"></a><a id="sthref12" name="sthref12"></a>Para crear un recurso de destino JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Cuando se crea un recurso de destino JMS, GlassFish Server crea un recurso de objeto de administraci&oacute;n para el recurso de destino. Puede visualizar este recurso en el nodo Conectores.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Recursos.</p>
</li>
<li>
<p>En el nodo Recursos, ampl&iacute;e el nodo Recursos de JMS.</p>
</li>
<li>
<p>En el nodo Recursos de JMS, seleccione el nodo Recursos de Destino JMS.</p>
<p>Se abrir&aacute; la p&aacute;gina Recursos de Destino JMS.</p>
</li>
<li>
<p>En la p&aacute;gina Recursos de Destino JMS, haga clic en Nuevo.</p>
<p>Se abrir&aacute; la p&aacute;gina Nuevo recurso de destino JMS.</p>
</li>
<li>
<p>En el campo Nombre JNDI, introduzca el nombre JNDI del recurso.</p>
<p>Es una pr&aacute;ctica recomendada utilizar el prefijo de subcontexto de nomenclatura <code>jms/</code> para recursos de JMS. Por ejemplo: <code>jms/Queue</code>.</p>
</li>
<li>
<p>En el campo Nombre de Destino F&iacute;sico, introduzca el nombre del destino f&iacute;sico que se asociar&aacute; a este recurso.</p>
<p>GlassFish Server crear&aacute; el destino f&iacute;sico autom&aacute;ticamente cuando sea necesario y lo suprimir&aacute; cuando se suprima el recurso de destino.</p>
</li>
<li>
<p>En la lista desplegable Tipo de Recurso, seleccione <code>javax.jms.Topic</code> o <code>javax.jms.Queue</code>.</p>
</li>
<li>
<p>En el campo Descripci&oacute;n, introduzca una descripci&oacute;n del recurso de destino.</p>
</li>
<li>
<p>Active la casilla de control Estado activado para activar el recurso en tiempo de ejecuci&oacute;n.</p>
<p>Esta opci&oacute;n se encuentra activada por defecto.</p>
</li>
<li>
<p>En el &aacute;rea de Propiedades Adicionales, indique las propiedades adicionales para el recurso de destino.</p>
<p>ProductName; no define ninguna propiedad adicional para los recursos de destino JMS.</p>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, introduzca el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
</li>
<li>
<p>En el &aacute;rea Destinos, haga lo siguiente:</p>
<ol type="a">
<li>
<p>En la columna Disponibles, seleccione los destinos en los que se desplegar&aacute;n las aplicaciones que usen el recurso.</p>
<p>Los destinos disponibles incluyen los clusters y las instancias de servidor disponibles, as&iacute; como la instancia de servidor por defecto, llamada <code>server</code>.</p>
</li>
<li>
<p>Haga clic en Agregar para mover el destino a la columna Seleccionados.</p>
</li>
</ol>
</li>
<li>
<p>Haga clic en Aceptar.</p>
</li>
</ol>
<a id="sthref13" name="sthref13"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-jmsconnectionnew.html">Para crear un recurso de la f&aacute;brica de conexiones JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectionedit.html">Para editar un recurso de la f&aacute;brica de conexiones JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">Para suprimir un recurso de la f&aacute;brica de conexiones JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationedit.html">Para editar un recurso de destino JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationdelete.html">Para suprimir un recurso de destino JMS</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
