<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsconnectionnew" name="task-jmsconnectionnew"></a></p>

<h4><a id="sthref2" name="sthref2"></a><a id="sthref3" name="sthref3"></a>Para crear un recurso de la f&aacute;brica de conexiones JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Al crear una f&aacute;brica de conexiones JMS, GlassFish Server crea un pool de conexiones de conector y un recurso de conector para la f&aacute;brica de conexiones. Puede ver estos objetos en el nodo Conectores.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Recursos.</p>
</li>
<li>
<p>En el nodo Recursos, ampl&iacute;e el nodo Recursos de JMS.</p>
</li>
<li>
<p>En el nodo de Recursos de JMS, seleccione el nodo F&aacute;bricas de Conexiones JMS.</p>
<p>Se abrir&aacute; la p&aacute;gina F&aacute;bricas de conexiones JMS.</p>
</li>
<li>
<p>En la p&aacute;gina F&aacute;bricas de conexiones JMS, haga clic en Nuevo.</p>
<p>Aparece la p&aacute;gina Nueva f&aacute;brica de conexiones JMS.</p>
</li>
<li>
<p>En el campo Nombre de Pool, introduzca el nombre &uacute;nico de la f&aacute;brica de conexiones.</p>
<p>GlassFish Server define el nombre JNDI de la f&aacute;brica de conexiones en este valor.</p>
</li>
<li>
<p>En la lista desplegable Tipo de Recurso, seleccione <code>javax.jms.ConnectionFactory</code>, <code>javax.jms.QueueConnectionFactory</code> o <code>javax.jms.TopicConnectionFactory</code>.</p>
</li>
<li>
<p>En el campo Descripci&oacute;n, introduzca una descripci&oacute;n de la f&aacute;brica de conexiones.</p>
</li>
<li>
<p>Active la casilla de control Estado activado para activar el recurso en tiempo de ejecuci&oacute;n.</p>
<p>Esta opci&oacute;n se encuentra activada por defecto.</p>
</li>
<li>
<p>En el campo Tama&ntilde;o de Pool Inicial y M&iacute;nimo, introduzca el n&uacute;mero m&iacute;nimo de conexiones del pool.</p>
<p>El valor por defecto es 8.</p>
</li>
<li>
<p>En el campo Tama&ntilde;o de Pool M&aacute;ximo, introduzca el n&uacute;mero m&aacute;ximo de conexiones de este pool.</p>
<p>El valor por defecto es 32.</p>
</li>
<li>
<p>En el campo Cantidad de Cambio de Tama&ntilde;o del Pool, especifique el n&uacute;mero de conexiones que se eliminar&aacute;n cuando se supere el timeout l&iacute;mite de inactividad del pool.</p>
<p>El valor por defecto es 2.</p>
</li>
<li>
<p>En el campo Timeout de Inactividad, indique el tiempo m&aacute;ximo en segundos que una conexi&oacute;n puede permanecer inactiva en el pool.</p>
<p>El valor por defecto es 300.</p>
</li>
<li>
<p>En el campo Tiempo de Espera M&aacute;ximo, indique la cantidad de tiempo que la aplicaci&oacute;n que solicita una conexi&oacute;n puede esperar para obtener un mensaje de timeout de conexi&oacute;n.</p>
<p>El valor por defecto es 60000.</p>
</li>
<li>
<p>Active la casilla de control Ante cualquier fallo cerrar todas las conexiones, para que GlassFish Server cierre todas las conexiones del pool y las restablezca aunque tan s&oacute;lo falle una.</p>
<p>Si no activa esta casilla de control, las conexiones individuales se restablecer&aacute;n s&oacute;lo cuando vaya a utilizarlas. Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>Para un recurso de f&aacute;brica de conexiones JMS, seleccione el nivel de soporte de transacci&oacute;n.</p>
<p>El valor seleccionado sobrescribe el atributo de soporte de transacci&oacute;n en el adaptador de recursos, de manera que es compatible en sentido descendente.</p>
<ul>
<li>
<p>Seleccione XATransaction (el valor por defecto para el adaptador de recursos) para un recurso que se pueda utilizar para transacciones que supongan el uso de m&aacute;s de un recurso dentro de un &aacute;mbito de transacci&oacute;n.</p>
<p>Por ejemplo, en las transacciones puede participar este recurso m&aacute;s un recurso JDBC, un recurso de conector u otro recurso de f&aacute;brica de conexiones JMS. Este valor ofrece la m&aacute;xima flexibilidad. Un recurso que se configure como XATransaction participar&aacute; en operaciones de confirmaci&oacute;n de dos fases.</p>
</li>
<li>
<p>Seleccione LocalTransaction para un recurso que se puede utilizar para transacciones que impliquen s&oacute;lo un recurso dentro del &aacute;mbito de la transacci&oacute;n o como el &uacute;ltimo agente en una transacci&oacute;n distribuida que implique m&aacute;s de un recurso XA.</p>
<p>Este valor ofrece un rendimiento mucho m&aacute;s &oacute;ptimo. Un recurso que se configura como LocalTransaction no se utilizar&aacute; en operaciones de confirmaci&oacute;n de dos fases.</p>
</li>
<li>
<p>Seleccione NoTransaction para un recurso que nunca puede participar en transacciones.</p>
<p>Esta configuraci&oacute;n es de uso limitado en aplicaciones JMS.</p>
</li>
</ul>
</li>
<li>
<p>Active la casilla de control Validaci&oacute;n de conexi&oacute;n necesaria para activar la validaci&oacute;n de la conexi&oacute;n.</p>
<p>Si se selecciona esta opci&oacute;n, las conexiones se validan antes de proporcion&aacute;rselas a la aplicaci&oacute;n. Si falla la validaci&oacute;n de un recurso, &eacute;ste se destruye, y se crea y se devuelve un recurso nuevo. Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>En la secci&oacute;n Propiedades Adicionales, especifique las propiedades adicionales de la f&aacute;brica de conexiones.</p>
<p>Para obtener m&aacute;s informaci&oacute;n sobre las propiedades disponibles, consulte <a href="ref-jmsconnectionproperties.html">Propiedades espec&iacute;ficas de f&aacute;bricas de conexiones JMS</a>.</p>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, introduzca el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
</li>
<li>
<p>En el &aacute;rea Destinos, haga lo siguiente:</p>
<ol type="a">
<li>
<p>En la columna Disponibles, seleccione los destinos en los que se desplegar&aacute;n las aplicaciones que usen el recurso.</p>
<p>Los destinos disponibles incluyen los clusters y las instancias de servidor disponibles, as&iacute; como la instancia de servidor por defecto, llamada <code>server</code>.</p>
</li>
<li>
<p>Haga clic en Agregar para mover el destino a la columna Seleccionados.</p>
</li>
</ol>
</li>
<li>
<p>Haga clic en Aceptar.</p>
</li>
</ol>
<a id="sthref4" name="sthref4"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-jmsconnectionedit.html">Para editar un recurso de la f&aacute;brica de conexiones JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">Para suprimir un recurso de la f&aacute;brica de conexiones JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationnew.html">Para crear un recurso de destino JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationedit.html">Para editar un recurso de destino JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationdelete.html">Para suprimir un recurso de destino JMS</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
