<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsconnectionedit" name="task-jmsconnectionedit"></a></p>

<h4><a id="sthref5" name="sthref5"></a><a id="sthref6" name="sthref6"></a>Para editar un recurso de la f&aacute;brica de conexiones JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Recursos.</p>
</li>
<li>
<p>En el nodo Recursos, ampl&iacute;e el nodo Recursos de JMS.</p>
</li>
<li>
<p>En el nodo de Recursos de JMS, seleccione el nodo F&aacute;bricas de Conexiones JMS.</p>
<p>Se abrir&aacute; la p&aacute;gina F&aacute;bricas de conexiones JMS.</p>
</li>
<li>
<p>En la p&aacute;gina F&aacute;bricas de Conexiones JMS, haga clic en el nombre de la f&aacute;brica que desee editar.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar F&aacute;brica de Conexiones JMS.</p>
</li>
<li>
<p>En el campo Descripci&oacute;n, introduzca una descripci&oacute;n de la f&aacute;brica de conexiones.</p>
</li>
<li>
<p>Active la casilla de control Estado activado para activar el recurso en tiempo de ejecuci&oacute;n.</p>
<p>Esta opci&oacute;n se encuentra activada por defecto.</p>
</li>
<li>
<p>En el campo Tama&ntilde;o de Pool Inicial y M&iacute;nimo, introduzca el n&uacute;mero m&iacute;nimo de conexiones del pool.</p>
<p>El valor por defecto es 8.</p>
</li>
<li>
<p>En el campo Tama&ntilde;o de Pool M&aacute;ximo, introduzca el n&uacute;mero m&aacute;ximo de conexiones de este pool.</p>
<p>El valor por defecto es 32.</p>
</li>
<li>
<p>En el campo Cantidad de Cambio de Tama&ntilde;o del Pool, especifique el n&uacute;mero de conexiones que se eliminar&aacute;n cuando se supere el timeout l&iacute;mite de inactividad del pool.</p>
<p>El valor por defecto es 2.</p>
</li>
<li>
<p>En el campo Timeout de Inactividad, indique el tiempo m&aacute;ximo en segundos que una conexi&oacute;n puede permanecer inactiva en el pool.</p>
<p>El valor por defecto es 300.</p>
</li>
<li>
<p>En el campo Tiempo de Espera M&aacute;ximo, indique la cantidad de tiempo que la aplicaci&oacute;n que solicita una conexi&oacute;n puede esperar para obtener un mensaje de timeout de conexi&oacute;n.</p>
<p>El valor por defecto es 60000.</p>
</li>
<li>
<p>Active la casilla de control Ante cualquier fallo cerrar todas las conexiones, para que GlassFish Server cierre todas las conexiones del pool y las restablezca aunque tan s&oacute;lo falle una.</p>
<p>Si no activa esta casilla de control, las conexiones individuales se restablecer&aacute;n s&oacute;lo cuando vaya a utilizarlas.</p>
</li>
<li>
<p>Para un recurso de f&aacute;brica de conexiones JMS, especifique el valor de Soporte de Transacci&oacute;n de la siguiente manera:</p>
<ul>
<li>
<p>Especifique <code>XATransaction</code> (el valor por defecto) para un recurso que se puede utilizar para transacciones que suponen el uso de m&aacute;s de un recurso dentro de un &aacute;mbito de transacci&oacute;n.</p>
<p>Por ejemplo, este recurso m&aacute;s un recurso JDBC, un recurso de conector, u otro recurso de f&aacute;brica de conexiones JMS. Este valor ofrece la m&aacute;xima flexibilidad. Un recurso que se configura como <code>XATransaction</code> participar&aacute; en operaciones de confirmaci&oacute;n de dos fases.</p>
</li>
<li>
<p>Especifique <code>LocalTransaction</code> para un recurso que se puede utilizar para transacciones que implican s&oacute;lo un recurso dentro del &aacute;mbito de la transacci&oacute;n o como el &uacute;ltimo agente en una transacci&oacute;n distribuida que implica m&aacute;s de un recurso XA.</p>
<p>Este valor ofrece un rendimiento mucho m&aacute;s &oacute;ptimo. Un recurso que se configura como <code>LocalTransaction</code> no se utilizar&aacute; en operaciones de confirmaci&oacute;n de dos fases.</p>
</li>
<li>
<p>Especifique <code>NoTransaction</code> para un recurso que nunca puede participar en transacciones.</p>
<p>Esta configuraci&oacute;n es de uso limitado en aplicaciones JMS.</p>
</li>
</ul>
</li>
<li>
<p>Active la casilla de control Validaci&oacute;n de Conexi&oacute;n para activar la validaci&oacute;n de la conexi&oacute;n.</p>
<p>Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>En la tabla Propiedades Adicionales, especifique propiedades adicionales para la f&aacute;brica de conexiones.</p>
<p>Para obtener m&aacute;s informaci&oacute;n sobre las propiedades disponibles, consulte <a href="ref-jmsconnectionproperties.html">Propiedades espec&iacute;ficas de f&aacute;bricas de conexiones JMS</a>.</p>
<ul>
<li>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, introduzca el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
</li>
<li>
<p>Para modificar una propiedad, edite el campo Valor.</p>
</li>
<li>
<p>Para suprimir una propiedad, active la casilla de control a la izquierda del campo Nombre de la propiedad que est&aacute; suprimiendo y, a continuaci&oacute;n, haga clic en el bot&oacute;n Suprimir Propiedades.</p>
</li>
</ul>
</li>
<li>
<p>Tambi&eacute;n puede hacer clic en el separador Destinos para ir a la p&aacute;gina Destinos de Recurso de F&aacute;bricas de Conexiones JMS. En esta p&aacute;gina, haga lo siguiente:</p>
<ol type="a">
<li>
<p>Haga clic en Gestionar Destinos para abrir la p&aacute;gina Gestionar Destinos de Recurso correspondiente.</p>
<p>En esta p&aacute;gina, mueva los destinos como corresponda entre la columna Disponibles y la columna Seleccionados. Aseg&uacute;rese de colocar en esta &uacute;ltima columna los destinos en los que se desplegar&aacute;n las aplicaciones que usan el recurso. Los destinos disponibles incluyen los clusters y las instancias de servidor disponibles, as&iacute; como la instancia de servidor por defecto, llamada <code>server</code>. Haga clic en Aceptar para guardar los cambios.</p>
</li>
<li>
<p>Active la casilla de control de un destino concreto y haga clic en Activar o Desactivar para realizar la acci&oacute;n correspondiente en el recurso para dicho destino.</p>
</li>
</ol>
</li>
<li>
<p>Haga clic en Guardar.</p>

<hr>
<p><b>Sugerencia:</b></p>
Para volver a la configuraci&oacute;n por defecto, haga clic en el bot&oacute;n Cargar Valores por Defecto y, a continuaci&oacute;n, en Guardar.
<hr>

</li>
</ol>
<a id="sthref7" name="sthref7"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-jmsconnectionnew.html">Para crear un recurso de la f&aacute;brica de conexiones JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">Para suprimir un recurso de la f&aacute;brica de conexiones JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationnew.html">Para crear un recurso de destino JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationedit.html">Para editar un recurso de destino JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationdelete.html">Para suprimir un recurso de destino JMS</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
