<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-virtualserverprops" name="ref-virtualserverprops"></a></p>

<h4><a id="sthref125" name="sthref125"></a><a id="sthref126" name="sthref126"></a>&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12395;&#22266;&#26377;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12395;&#20351;&#29992;&#12391;&#12365;&#12427;&#36861;&#21152;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#27425;&#12398;&#12392;&#12362;&#12426;&#12391;&#12377;&#12290;</p>
<dl>
<dt><code>sso-max-inactive-seconds</code></dt>
<dd>
<p>&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12364;&#27963;&#21205;&#12434;&#20572;&#27490;&#24460;&#12289;&#20309;&#31186;&#24460;&#12395;&#12518;&#12540;&#12470;&#12540;&#12398;&#12471;&#12531;&#12464;&#12523;&#12539;&#12469;&#12452;&#12531;&#12458;&#12531;&#12398;&#35352;&#37682;&#12434;&#21066;&#38500;&#21487;&#33021;&#12395;&#12377;&#12427;&#12363;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12471;&#12531;&#12464;&#12523;&#12539;&#12469;&#12452;&#12531;&#12458;&#12531;&#12399;&#21516;&#19968;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#19978;&#12398;&#35079;&#25968;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#36969;&#29992;&#12373;&#12428;&#12427;&#12398;&#12391;&#12289;&#12371;&#12428;&#12425;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12356;&#12378;&#12428;&#12363;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#12371;&#12392;&#12391;&#12471;&#12531;&#12464;&#12523;&#12539;&#12469;&#12452;&#12531;&#12458;&#12531;&#12398;&#35352;&#37682;&#12399;&#12450;&#12463;&#12486;&#12451;&#12502;&#12394;&#12414;&#12414;&#20445;&#25345;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;300&#31186;(5&#20998;)&#12391;&#12377;&#12290;&#20516;&#12434;&#22823;&#12365;&#12367;&#12377;&#12427;&#12392;&#12518;&#12540;&#12470;&#12540;&#12398;&#12471;&#12531;&#12464;&#12523;&#12539;&#12469;&#12452;&#12531;&#12458;&#12531;&#12398;&#27704;&#32154;&#24615;&#12399;&#38263;&#12367;&#12394;&#12426;&#12414;&#12377;&#12364;&#12289;&#12469;&#12540;&#12496;&#12540;&#19978;&#12398;&#12513;&#12514;&#12522;&#12540;&#28040;&#36027;&#37327;&#12418;&#22679;&#21152;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt><code>sso-reap-interval-seconds</code></dt>
<dd>
<p>&#26377;&#21177;&#26399;&#38480;&#12364;&#20999;&#12428;&#12383;&#12471;&#12531;&#12464;&#12523;&#12539;&#12469;&#12452;&#12531;&#12458;&#12531;&#12398;&#35352;&#37682;&#12398;&#21066;&#38500;&#12434;&#34892;&#12358;&#38291;&#38548;&#12434;&#31186;&#21336;&#20301;&#12391;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;60&#12391;&#12377;&#12290;</p>
</dd>
<dt><code>ssoCookieSecure</code></dt>
<dd>
<p>&#12371;&#12398;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12383;Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12383;&#12289;<code>JSESSIONIDSSO</code> cookie&#12398;<code>Secure</code>&#23646;&#24615;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#12471;&#12531;&#12464;&#12523;&#12539;&#12469;&#12452;&#12531;&#12458;&#12531;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12395;&#12398;&#12415;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#20351;&#29992;&#21487;&#33021;&#12394;&#20516;&#12399;&#27425;&#12398;&#12392;&#12362;&#12426;&#12391;&#12377;:</p>
<dl>
<dt><code>true</code></dt>
<dd>
<p><code>Secure</code>&#12434;true&#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt><code>false</code></dt>
<dd>
<p><code>Secure</code>&#12434;false&#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt><code>dynamic</code></dt>
<dd>
<p><code>JSESSIONIDSSO</code> cookie&#12399;&#12289;SSO&#12398;&#26368;&#21021;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12398;<code>Secure</code>&#35373;&#23450;&#12434;&#32153;&#25215;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<p><code>JSESSIONID</code> cookie&#12398;Secure&#23646;&#24615;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;&#12289;<code>sun-web.xml</code>&#12501;&#12449;&#12452;&#12523;&#12398;<code>cookieSecure</code> <code>cookie-properties</code>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#35443;&#32048;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00130"><i>Oracle GlassFish Server&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12460;&#12452;&#12489;</i>&#12398;<i>cookie-properties</i></a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</dd>
<dt><code>setCacheControl</code></dt>
<dd>
<p><code>Cache-Control</code>&#12524;&#12473;&#12509;&#12531;&#12473;&#12539;&#12487;&#12451;&#12524;&#12463;&#12486;&#12451;&#12502;&#12398;&#12459;&#12531;&#12510;&#21306;&#20999;&#12426;&#12522;&#12473;&#12488;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#26377;&#21177;&#12394;&#12487;&#12451;&#12524;&#12463;&#12486;&#12451;&#12502;&#12398;&#12522;&#12473;&#12488;&#12399;&#12289;http://www.ietf.org/rfc/rfc2616.txt (<code><a href="http://www.ietf.org/rfc/rfc2616.txt">http://www.ietf.org/rfc/rfc2616.txt</a></code>)&#12395;&#12354;&#12427;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#31532;14.9&#38917;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</dd>
<dt><code>accessLogBufferSize</code></dt>
<dd>
<p>&#12450;&#12463;&#12475;&#12473;&#12539;&#12525;&#12464;&#12398;&#12467;&#12540;&#12523;&#12364;&#26684;&#32013;&#12373;&#12428;&#12427;&#12496;&#12483;&#12501;&#12449;&#12398;&#12469;&#12452;&#12474;&#12434;&#12496;&#12452;&#12488;&#21336;&#20301;&#12391;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#20516;&#12364;5120&#26410;&#28288;&#12398;&#22580;&#21512;&#12399;&#35686;&#21578;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#34920;&#31034;&#12373;&#12428;&#12289;&#20516;&#12364;5120&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;32768&#12391;&#12377;&#12290;</p>
</dd>
<dt><code>accessLogWriterInterval</code></dt>
<dd>
<p>&#12525;&#12464;&#12364;&#12487;&#12451;&#12473;&#12463;&#12395;&#26360;&#12365;&#36796;&#12414;&#12428;&#12427;&#12414;&#12391;&#12398;&#26178;&#38291;(&#31186;&#21336;&#20301;)&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12450;&#12463;&#12475;&#12473;&#12539;&#12525;&#12464;&#12399;&#12289;&#12496;&#12483;&#12501;&#12449;&#12364;&#12501;&#12523;&#12395;&#12394;&#12427;&#12363;&#12289;&#25351;&#23450;&#12375;&#12383;&#26178;&#38291;&#12364;&#32076;&#36942;&#12377;&#12427;&#12392;&#26360;&#12365;&#36796;&#12414;&#12428;&#12414;&#12377;&#12290;0&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12496;&#12483;&#12501;&#12449;&#12364;&#12501;&#12523;&#12391;&#12394;&#12367;&#12390;&#12418;&#24120;&#12395;&#26360;&#12365;&#36796;&#12414;&#12428;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;&#12469;&#12540;&#12496;&#12540;&#12539;&#12450;&#12463;&#12475;&#12473;&#12364;&#12354;&#12427;&#12383;&#12403;&#12395;&#12289;&#12525;&#12464;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#12501;&#12449;&#12452;&#12523;&#12395;&#30452;&#25509;&#26684;&#32013;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;300&#12391;&#12377;&#12290;</p>
</dd>
<dt><code>allowRemoteAddress</code></dt>
<dd>
<p>&#12522;&#12514;&#12540;&#12488;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;IP&#12450;&#12489;&#12524;&#12473;&#12434;&#27604;&#36611;&#12377;&#12427;&#12289;&#27491;&#35215;&#34920;&#29694;&#12497;&#12479;&#12540;&#12531;&#12398;&#12459;&#12531;&#12510;&#21306;&#20999;&#12426;&#12522;&#12473;&#12488;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#21463;&#12369;&#20837;&#12428;&#12427;&#12383;&#12417;&#12395;&#12399;&#12522;&#12514;&#12540;&#12488;&#12539;&#12450;&#12489;&#12524;&#12473;&#12364;&#12300;&#19968;&#33268;&#12375;&#12390;&#12356;&#12427;&#12301;<i>&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;</i>&#12290;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12522;&#12514;&#12540;&#12488;&#12539;&#12450;&#12489;&#12524;&#12473;&#12364;<code>denyRemoteAddress</code>&#12497;&#12479;&#12540;&#12531;&#12392;&#19968;&#33268;&#12375;&#12390;<i>&#12356;&#12394;&#12356;</i>&#12363;&#12366;&#12426;&#12289;&#12377;&#12409;&#12390;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12364;&#21463;&#12369;&#20837;&#12428;&#12425;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt><code>denyRemoteAddress</code></dt>
<dd>
<p>&#12522;&#12514;&#12540;&#12488;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;IP&#12450;&#12489;&#12524;&#12473;&#12434;&#27604;&#36611;&#12377;&#12427;&#12289;&#27491;&#35215;&#34920;&#29694;&#12497;&#12479;&#12540;&#12531;&#12398;&#12459;&#12531;&#12510;&#21306;&#20999;&#12426;&#12522;&#12473;&#12488;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#21463;&#12369;&#20837;&#12428;&#12427;&#12383;&#12417;&#12395;&#12399;&#12522;&#12514;&#12540;&#12488;&#12539;&#12450;&#12489;&#12524;&#12473;&#12364;&#12300;&#19968;&#33268;&#12375;&#12390;&#12356;&#12394;&#12356;&#12301;<i>&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;</i>&#12290;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12522;&#12463;&#12456;&#12473;&#12488;&#12398;&#21463;&#20837;&#12428;&#12399;<code>allowRemoteAddress</code>&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12415;&#12391;&#21046;&#24481;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt><code>allowRemoteHost</code></dt>
<dd>
<p>&#12522;&#12514;&#12540;&#12488;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#12507;&#12473;&#12488;&#21517;(<code>[java.net.]Socket.getInetAddress().getHostName()</code>&#12395;&#12424;&#12387;&#12390;&#36820;&#12373;&#12428;&#12427;)&#12434;&#27604;&#36611;&#12377;&#12427;&#27491;&#35215;&#34920;&#29694;&#12497;&#12479;&#12540;&#12531;&#12398;&#12459;&#12531;&#12510;&#21306;&#20999;&#12426;&#12398;&#12522;&#12473;&#12488;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#21463;&#12369;&#20837;&#12428;&#12427;&#12383;&#12417;&#12395;&#12399;&#12522;&#12514;&#12540;&#12488;&#12539;&#12507;&#12473;&#12488;&#21517;&#12364;&#12300;&#19968;&#33268;&#12375;&#12390;&#12356;&#12427;&#12301;<i>&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;</i>&#12290;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12522;&#12514;&#12540;&#12488;&#12539;&#12507;&#12473;&#12488;&#21517;&#12364;<code>denyRemoteHost</code>&#12497;&#12479;&#12540;&#12531;&#12392;&#19968;&#33268;&#12375;&#12390;<i>&#12356;&#12394;&#12356;</i>&#12363;&#12366;&#12426;&#12289;&#12377;&#12409;&#12390;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12364;&#21463;&#12369;&#20837;&#12428;&#12425;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt><code>denyRemoteHost</code></dt>
<dd>
<p>&#12522;&#12514;&#12540;&#12488;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#12507;&#12473;&#12488;&#21517;(<code>[java.net.]Socket.getInetAddress().getHostName()</code>&#12395;&#12424;&#12387;&#12390;&#36820;&#12373;&#12428;&#12427;)&#12434;&#27604;&#36611;&#12377;&#12427;&#27491;&#35215;&#34920;&#29694;&#12497;&#12479;&#12540;&#12531;&#12398;&#12459;&#12531;&#12510;&#21306;&#20999;&#12426;&#12398;&#12522;&#12473;&#12488;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#21463;&#12369;&#20837;&#12428;&#12427;&#12383;&#12417;&#12395;&#12399;&#12522;&#12514;&#12540;&#12488;&#12539;&#12507;&#12473;&#12488;&#21517;&#12364;&#12300;&#19968;&#33268;&#12375;&#12390;&#12356;&#12394;&#12356;&#12301;<i>&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;</i>&#12290;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12522;&#12463;&#12456;&#12473;&#12488;&#12398;&#21463;&#20837;&#12428;&#12399;<code>allowRemoteHost</code>&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12415;&#12391;&#21046;&#24481;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<p>GlassFish Server&#12489;&#12513;&#12452;&#12531;&#12364;&#12289;&#12300;JK&#12522;&#12473;&#12490;&#12540;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#26377;&#21177;&#12394;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;&#12434;&#36890;&#12375;&#12390;&#12450;&#12463;&#12475;&#12473;&#12373;&#12428;&#12427;&#22580;&#21512;&#12289;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#35373;&#23450;&#12375;&#12390;&#12418;&#24433;&#38911;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt><code>authRealm</code></dt>
<dd>
<p>&#35469;&#35388;&#12524;&#12523;&#12512;&#12398;&#21517;&#21069;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#20516;&#12399;&#12289;&#12371;&#12398;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12390;&#12356;&#12427;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12289;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12524;&#12523;&#12512;&#12434;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12375;&#12414;&#12377;&#12290;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12398;Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;<code>web.xml</code>&#12501;&#12449;&#12452;&#12523;&#12395;&#23450;&#32681;&#12373;&#12428;&#12390;&#12356;&#12427;&#12524;&#12523;&#12512;&#12399;&#12289;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12398;&#12524;&#12523;&#12512;&#12434;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12375;&#12414;&#12377;&#12290;&#35443;&#32048;&#12399;&#12289;&#12300;<a href="../../../common/en/help/ref-realms.html">&#12524;&#12523;&#12512;</a>&#12301;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</dd>
<dt><code>securePagesWithPragma</code></dt>
<dd>
<p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;<code>false</code>&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#12371;&#12398;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#19978;&#12398;&#12377;&#12409;&#12390;&#12398;Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12289;SSL&#12434;&#20351;&#29992;&#12375;&#12383;&#12501;&#12449;&#12452;&#12523;&#12398;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12364;Internet Explorer&#12391;&#24517;&#12378;&#27491;&#12375;&#12367;&#27231;&#33021;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#20491;&#12293;&#12398;Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12371;&#12398;&#35373;&#23450;&#12434;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12391;&#12365;&#12414;&#12377;&#12290;&#12381;&#12428;&#12395;&#12399;&#12289;<code>sun-web.xml</code>&#12501;&#12449;&#12452;&#12523;&#12398;<code>sun-web-app</code>&#35201;&#32032;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#35443;&#32048;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>Oracle GlassFish Server&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12460;&#12452;&#12489;</i>&#12398;<i>glassfish-web-app</i></a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>true</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt><code>alternatedocroot_</code><i>n</i></dt>
<dd>
<p>&#20195;&#26367;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12539;&#12523;&#12540;&#12488;(docroot)&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12371;&#12391;&#12289;<i>n</i>&#12399;&#27491;&#12398;&#25972;&#25968;&#12391;&#35079;&#25968;&#12398;&#25351;&#23450;&#12364;&#21487;&#33021;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#20195;&#26367;docroot&#12395;&#12424;&#12426;&#12289;Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#29305;&#23450;&#12398;&#12522;&#12477;&#12540;&#12473;&#12395;&#23550;&#12377;&#12427;&#12381;&#12428;&#12382;&#12428;&#12398;docroot&#20197;&#22806;&#12363;&#12425;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12395;&#23550;&#24540;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12289;&#12381;&#12428;&#12425;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12364;Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#20195;&#26367;docroot&#12398;URI&#12497;&#12479;&#12540;&#12531;&#12398;1&#12388;(&#12414;&#12383;&#12399;&#35079;&#25968;)&#12395;&#19968;&#33268;&#12377;&#12427;&#12363;&#12395;&#22522;&#12389;&#12365;&#12414;&#12377;&#12290;</p>
<p>&#12522;&#12463;&#12456;&#12473;&#12488;&#12364;&#20195;&#26367;docroot&#12398;URI&#12497;&#12479;&#12540;&#12531;&#12392;&#19968;&#33268;&#12377;&#12427;&#22580;&#21512;&#12289;&#12522;&#12463;&#12456;&#12473;&#12488;&#12398;URI(Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12523;&#12540;&#12488;&#12434;&#12510;&#12452;&#12490;&#12473;&#12375;&#12383;&#12418;&#12398;)&#12434;&#20195;&#26367;docroot&#12398;&#29289;&#29702;&#30340;&#12394;&#20301;&#32622;(&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;)&#12395;&#20184;&#21152;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;&#12289;&#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#20195;&#26367;docroot&#12395;&#12510;&#12483;&#12503;&#12375;&#12414;&#12377;&#12290;&#12522;&#12463;&#12456;&#12473;&#12488;&#12364;&#35079;&#25968;&#12398;URI&#12497;&#12479;&#12540;&#12531;&#12395;&#19968;&#33268;&#12377;&#12427;&#22580;&#21512;&#12289;&#20195;&#26367;docroot&#12399;&#27425;&#12398;&#20778;&#20808;&#38918;&#20301;&#12391;&#21028;&#26029;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#23436;&#20840;&#19968;&#33268;</p>
</li>
<li>
<p>&#26368;&#38263;&#12497;&#12473;&#19968;&#33268;</p>
</li>
<li>
<p>&#25313;&#24373;&#19968;&#33268;</p>
</li>
</ul>
<p>&#12383;&#12392;&#12360;&#12400;&#12289;&#27425;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;3&#12388;&#12398;&#20195;&#26367;docroot&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#26368;&#21021;&#12398;&#20195;&#26367;docroot&#12398;URI&#12497;&#12479;&#12540;&#12531;&#12399;&#23436;&#20840;&#19968;&#33268;&#12434;&#20351;&#29992;&#12375;&#12289;2&#30058;&#30446;&#12392;3&#30058;&#30446;&#12398;&#20195;&#26367;docroot&#12398;URI&#12497;&#12479;&#12540;&#12531;&#12399;&#25313;&#24373;&#12362;&#12424;&#12403;&#26368;&#38263;&#12497;&#12473;&#25509;&#38957;&#36766;&#19968;&#33268;&#12434;&#12381;&#12428;&#12382;&#12428;&#20351;&#29992;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
<pre>
&lt;property name="alternatedocroot_1" 
   value="from=/my.jpg dir=/srv/images/jpg"
&lt;property name="alternatedocroot_2" 
   value="from=*.jpg dir=/srv/images/jpg"
&lt;property name="alternatedocroot_3" 
   value="from=/jpg/* dir=/src/images"
</pre>
<p>&#21508;&#20195;&#26367;docroot&#12398;<code>value</code>&#12395;&#12399;2&#12388;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#26368;&#21021;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;<code>from</code>&#12399;&#20195;&#26367;docroot&#12398;URI&#12497;&#12479;&#12540;&#12531;&#12434;&#25351;&#23450;&#12375;&#12289;2&#30058;&#30446;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;<code>dir</code>&#12399;&#20195;&#26367;docroot&#12398;&#29289;&#29702;&#30340;&#12394;&#20301;&#32622;(&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;)&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;<code>dir</code>&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12395;&#12399;&#12473;&#12506;&#12540;&#12473;&#12364;&#35377;&#23481;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
<p>&#20491;&#12293;&#12398;Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12371;&#12398;&#35373;&#23450;&#12434;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12391;&#12365;&#12414;&#12377;&#12290;&#12381;&#12428;&#12395;&#12399;&#12289;<code>sun-web.xml</code>&#12501;&#12449;&#12452;&#12523;&#12398;<code>sun-web-app</code>&#35201;&#32032;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#35443;&#32048;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>Oracle GlassFish Server&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12460;&#12452;&#12489;</i>&#12398;<i>glassfish-web-app</i></a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</dd>
<dt><code>contextXmlDefault</code></dt>
<dd>
<p>&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12371;&#12398;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12395;&#23550;&#12375;&#12390;&#12289;<code>context.xml</code>&#12501;&#12449;&#12452;&#12523;&#12398;domain-dir&#12395;&#30456;&#23550;&#30340;&#12394;&#20301;&#32622;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;<code>context.xml</code>&#12501;&#12449;&#12452;&#12523;&#12398;&#35443;&#32048;&#12399;&#12289;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12467;&#12531;&#12486;&#12490;(<code><a href="http://tomcat.apache.org/tomcat-5.5-doc/config/context.html">http://tomcat.apache.org/tomcat-5.5-doc/config/context.html</a></code>)&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</dd>
<dt><code>allowLinking</code></dt>
<dd>
<p><code>true</code>&#12398;&#22580;&#21512;&#12289;&#12371;&#12398;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#19978;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12390;&#12356;&#12427;&#12377;&#12409;&#12390;&#12398;Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12289;&#12471;&#12531;&#12508;&#12522;&#12483;&#12463;&#12539;&#12522;&#12531;&#12463;&#12398;&#12522;&#12477;&#12540;&#12473;&#12364;&#25552;&#20379;&#12373;&#12428;&#12414;&#12377;&#12290;&#20491;&#12293;&#12398;Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12371;&#12398;&#35373;&#23450;&#12434;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12391;&#12365;&#12414;&#12377;&#12290;&#12381;&#12428;&#12395;&#12399;&#12289;<code>sun-web.xml</code>&#12501;&#12449;&#12452;&#12523;&#20869;&#12391;<code>sun-web-app</code>&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;<code>allowLinking</code>&#12434;&#27425;&#12398;&#12424;&#12358;&#12395;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<pre>
&lt;sun-web-app&gt;
   &lt;property name="allowLinking" 
      value="{true|false}"
&lt;/sun-web-app&gt;
</pre>
<p>&#35443;&#32048;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>Oracle GlassFish Server&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12460;&#12452;&#12489;</i>&#12398;<i>glassfish-web-app</i></a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>false</code>&#12391;&#12377;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
Windows&#12471;&#12473;&#12486;&#12512;&#12391;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;true&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;JSP&#12477;&#12540;&#12473;&#12539;&#12467;&#12540;&#12489;&#12364;&#20844;&#38283;&#12373;&#12428;&#12414;&#12377;&#12290;
<hr>

</dd>
<dt><code>send-error_</code><i>n</i></dt>
<dd>
<p>&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#19978;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12390;&#12356;&#12427;&#12377;&#12409;&#12390;&#12398;Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#32153;&#25215;&#12377;&#12427;&#12289;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12398;&#12459;&#12473;&#12479;&#12512;&#12539;&#12456;&#12521;&#12540;&#12539;&#12506;&#12540;&#12472;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12289;<code>web.xml</code>&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#35352;&#36848;&#23376;&#12398;&#12371;&#12428;&#12425;&#12459;&#12473;&#12479;&#12512;&#12539;&#12456;&#12521;&#12540;&#12539;&#12506;&#12540;&#12472;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12434;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12391;&#12365;&#12414;&#12377;&#12290;&#21508;<code>send-error_</code><i>n</i>&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12395;&#12399;3&#12388;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12364;&#12354;&#12426;&#12289;&#20219;&#24847;&#12398;&#38918;&#30058;&#12391;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#26368;&#21021;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;<code>code</code>&#12399;&#12289;&#12524;&#12473;&#12509;&#12531;&#12473;&#12391;&#12459;&#12473;&#12479;&#12512;&#12539;&#12456;&#12521;&#12540;&#12539;&#12506;&#12540;&#12472;&#12434;&#36820;&#12377;&#24517;&#35201;&#12364;&#12354;&#12427;3&#26689;&#12398;HTTP&#12524;&#12473;&#12509;&#12531;&#12473;&#12539;&#12473;&#12486;&#12540;&#12479;&#12473;&#12539;&#12467;&#12540;&#12489;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>2&#30058;&#30446;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;<code>path</code>&#12399;&#12289;&#12459;&#12473;&#12479;&#12512;&#12539;&#12456;&#12521;&#12540;&#12539;&#12506;&#12540;&#12472;&#12398;&#32118;&#23550;&#12289;&#12414;&#12383;&#12399;&#30456;&#23550;&#12501;&#12449;&#12452;&#12523;&#12539;&#12471;&#12473;&#12486;&#12512;&#12539;&#12497;&#12473;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#30456;&#23550;&#12501;&#12449;&#12452;&#12523;&#12539;&#12471;&#12473;&#12486;&#12512;&#12539;&#12497;&#12473;&#12399;&#12289;domain-dir<code>/config</code>&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#30456;&#23550;&#30340;&#12394;&#12418;&#12398;&#12392;&#12375;&#12390;&#35299;&#37320;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>3&#30058;&#30446;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;<code>reason</code>&#12399;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#12289;&#36820;&#12373;&#12428;&#12427;&#29702;&#30001;&#25991;&#23383;&#21015;&#12398;&#12486;&#12461;&#12473;&#12488;(<code>Unauthorized</code>&#12414;&#12383;&#12399; <code>Forbidden</code>)&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
<p>&#20363;:</p>
<pre>
&lt;property name="send-error_1"
   value="code=401 path=/myhost/401.html reason=MY-401-REASON"
</pre>
<p>&#12371;&#12398;&#20363;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#23450;&#32681;&#12391;&#12399;&#12289;<code>/myhost/401.html</code>&#12398;&#20869;&#23481;&#12364;401&#12524;&#12473;&#12509;&#12531;&#12473;&#12391;&#36820;&#12373;&#12428;&#12427;&#12392;&#12392;&#12418;&#12395;&#12289;&#27425;&#12398;&#12524;&#12473;&#12509;&#12531;&#12473;&#34892;&#12364;&#36820;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<pre>
HTTP/1.1 401 MY-401-REASON
</pre></dd>
<dt><code>redirect_</code><i>n</i></dt>
<dd>
<p>&#21476;&#12356;URL&#12395;&#23550;&#12377;&#12427;&#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#26032;&#12375;&#12356;URL&#12395;&#23550;&#12377;&#12427;&#12522;&#12463;&#12456;&#12473;&#12488;&#12392;&#12375;&#12390;&#20966;&#29702;&#12377;&#12427;&#12424;&#12358;&#12395;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#19978;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12390;&#12356;&#12427;&#12377;&#12409;&#12390;&#12398;Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#32153;&#25215;&#12373;&#12428;&#12414;&#12377;&#12290;&#21508;<code>redirect_</code><i>n</i>&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12395;&#12399;2&#12388;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12364;&#12354;&#12426;&#12289;&#20219;&#24847;&#12398;&#38918;&#30058;&#12391;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#26368;&#21021;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;<code>from</code>&#12399;&#12289;&#29031;&#21512;&#12377;&#12427;&#12522;&#12463;&#12456;&#12473;&#12488;&#12373;&#12428;&#12383;URI&#12398;&#25509;&#38957;&#36766;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>2&#30058;&#30446;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;<code>url-prefix</code>&#12399;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12395;&#36820;&#12377;&#26032;&#12375;&#12356;URL&#25509;&#38957;&#36766;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;<code>from</code>&#25509;&#38957;&#36766;&#12399;&#12289;&#12371;&#12398;URL&#25509;&#38957;&#36766;&#12391;&#21336;&#32020;&#12395;&#32622;&#12365;&#25563;&#12360;&#12425;&#12428;&#12414;&#12377;&#12290;</p>
</li>
</ul>
<p>&#20363;:</p>
<pre>
&lt;property name="redirect_1" 
  value="from=/dummy url-prefix=http://etude"
</pre></dd>
<dt><code>valve_</code><i>n</i></dt>
<dd>
<p>&#12459;&#12473;&#12479;&#12512;&#20516;&#12398;&#23436;&#20840;&#20462;&#39166;&#12463;&#12521;&#12473;&#21517;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;<i>n</i>&#12399;&#27491;&#12398;&#25972;&#25968;&#12391;&#12289;&#35079;&#25968;&#12398;&#25351;&#23450;&#12364;&#21487;&#33021;&#12391;&#12377;&#12290;valve&#12463;&#12521;&#12473;&#12399;&#12289;Tomcat&#12414;&#12383;&#12399;&#20197;&#21069;&#12398;GlassFish Server&#12522;&#12522;&#12540;&#12473;&#12398;<code>org.apache.catalina.Valve</code>&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12363;&#12289;&#29694;&#22312;&#12398;GlassFish Server&#12522;&#12522;&#12540;&#12473;&#12398;<code>org.glassfish.web.valve.GlassFishValve</code>&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12434;&#23455;&#35013;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#20363;:</p>
<pre>
&lt;property name="valve_1"
value="org.glassfish.extension.Valve"
</pre>
<p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#29305;&#23450;&#12398;Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;&#35373;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;&#35443;&#32048;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>Oracle GlassFish Server&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12460;&#12452;&#12489;</i>&#12398;<i>glassfish-web-app</i></a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</dd>
<dt><code>listener_</code><i>n</i></dt>
<dd>
<p>&#12459;&#12473;&#12479;&#12512;Catalina&#12522;&#12473;&#12490;&#12540;&#12398;&#23436;&#20840;&#20462;&#39166;&#12463;&#12521;&#12473;&#21517;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;<i>n</i>&#12399;&#27491;&#12398;&#25972;&#25968;&#12391;&#12289;&#35079;&#25968;&#12398;&#25351;&#23450;&#12364;&#21487;&#33021;&#12391;&#12377;&#12290;&#12522;&#12473;&#12490;&#12540;&#12539;&#12463;&#12521;&#12473;&#12399;&#12289;<code>org.apache.catalina.ContainerListener</code>&#12414;&#12383;&#12399;<code>org.apache.catalina.LifecycleListener</code>&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12434;&#23455;&#35013;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#20363;:</p>
<pre>
&lt;property name="listener_1"
value="org.glassfish.extension.MyLifecycleListener"
</pre>
<p>&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#29305;&#23450;&#12398;Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;&#35373;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;&#35443;&#32048;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>Oracle GlassFish Server&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12487;&#12503;&#12525;&#12452;&#12513;&#12531;&#12488;&#12539;&#12460;&#12452;&#12489;</i>&#12398;<i>glassfish-web-app</i></a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</dd>
<dt><code>errorReportValve</code></dt>
<dd>
<p>&#12371;&#12398;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#19978;&#12391;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12456;&#12521;&#12540;&#12539;&#12506;&#12540;&#12472;&#12434;&#29983;&#25104;&#12377;&#12427;&#12459;&#12473;&#12479;&#12512;&#20516;&#12398;&#23436;&#20840;&#20462;&#39166;&#12463;&#12521;&#12473;&#21517;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12456;&#12521;&#12540;&#12539;&#12506;&#12540;&#12472;&#12539;&#12513;&#12459;&#12491;&#12474;&#12512;&#12434;&#28961;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;&#31354;&#12398;&#25991;&#23383;&#21015;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
