<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-protocolhttpedit" name="ref-protocolhttpedit"></a><a id="GHWEB00022" name="GHWEB00022"></a></p>

<h4><a id="sthref151" name="sthref151"></a><a id="sthref152" name="sthref152"></a>HTTP</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12503;&#12525;&#12488;&#12467;&#12523;&#12398;HTTP&#35373;&#23450;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;HTTP&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;HTTP&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12489;</dt>
<dd>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12354;&#12427;&#35373;&#23450;&#12434;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12395;&#24489;&#20803;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12394;&#12356;&#35373;&#23450;&#12399;&#22793;&#26356;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>&#27083;&#25104;&#21517;</dt>
<dd>
<p>&#12371;&#12398;&#12506;&#12540;&#12472;&#12398;&#35373;&#23450;&#12364;&#36969;&#29992;&#12373;&#12428;&#12427;&#27083;&#25104;&#12398;&#21517;&#21069;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12503;&#12525;&#12488;&#12467;&#12523;&#21517;</dt>
<dd>
<p>&#12503;&#12525;&#12488;&#12467;&#12523;&#12398;&#21517;&#21069;&#12290;&#12300;&#12503;&#12525;&#12488;&#12467;&#12523;&#21517;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;&#21517;&#21069;&#12434;&#25351;&#23450;&#12391;&#12365;&#12427;&#12398;&#12399;&#12289;&#26032;&#35215;&#12503;&#12525;&#12488;&#12467;&#12523;&#12398;&#20316;&#25104;&#26178;&#12398;&#12415;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12469;&#12540;&#12496;&#12540;&#21517;</dt>
<dd>
<p>&#12469;&#12540;&#12496;&#12540;&#12364;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12395;&#36865;&#20449;&#12377;&#12427;URL&#12391;&#20351;&#29992;&#12373;&#12428;&#12427;&#12507;&#12473;&#12488;&#21517;&#12290;&#12469;&#12540;&#12496;&#12540;&#12364;&#12456;&#12452;&#12522;&#12450;&#12473;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12371;&#12398;&#21517;&#21069;&#12399;&#12456;&#12452;&#12522;&#12450;&#12473;&#12391;&#12377;&#12290;&#12469;&#12540;&#12496;&#12540;&#12364;&#12456;&#12452;&#12522;&#12450;&#12473;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#31354;&#12398;&#12414;&#12414;&#27531;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12487;&#12501;&#12457;&#12523;&#12488;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;</dt>
<dd>
<p>&#12503;&#12525;&#12488;&#12467;&#12523;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12427;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12290;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12434;&#23450;&#32681;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;&#12539;&#12509;&#12540;&#12488;</dt>
<dd>
<p>&#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#21029;&#12398;&#12509;&#12540;&#12488;&#12395;&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;&#12377;&#12427;&#12509;&#12540;&#12488;&#20516;&#12290;GlassFish Server&#12399;&#12289;&#27425;&#12398;2&#12388;&#12398;&#26465;&#20214;&#12364;&#23384;&#22312;&#12377;&#12427;&#22580;&#21512;&#12289;&#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#33258;&#21205;&#30340;&#12395;&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;&#12375;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#12371;&#12398;&#12503;&#12525;&#12488;&#12467;&#12523;&#12364;&#38750;SSL&#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#19968;&#33268;&#12375;&#12383;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#21046;&#32004;&#12364;SSL&#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;&#12434;&#24517;&#35201;&#12392;&#12377;&#12427;&#12522;&#12463;&#12456;&#12473;&#12488;&#12364;&#21463;&#20449;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
</ul>
<p>&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;&#12539;&#12509;&#12540;&#12488;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;GlassFish Server&#12399;&#20803;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12391;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12383;&#12509;&#12540;&#12488;&#30058;&#21495;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#25509;&#32154;&#25968;</dt>
<dd>
<p>&#12461;&#12540;&#12503;&#12450;&#12521;&#12452;&#12502;&#12539;&#12514;&#12540;&#12489;&#12391;&#32173;&#25345;&#12377;&#12427;&#27704;&#32154;&#30340;&#25509;&#32154;&#12398;&#26368;&#22823;&#25968;&#12290;&#12461;&#12540;&#12503;&#12450;&#12521;&#12452;&#12502;&#12539;&#12469;&#12502;&#12471;&#12473;&#12486;&#12512;&#12399;&#23450;&#26399;&#30340;&#12395;&#12450;&#12452;&#12489;&#12523;&#25509;&#32154;&#12434;&#12509;&#12540;&#12522;&#12531;&#12464;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;256&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;</dt>
<dd>
<p>&#25509;&#32154;&#12434;&#12450;&#12452;&#12489;&#12523;&#12392;&#12415;&#12394;&#12375;&#12390;&#12461;&#12540;&#12503;&#12450;&#12521;&#12452;&#12502;&#29366;&#24907;&#12434;&#20445;&#25345;&#12391;&#12365;&#12427;&#26368;&#22823;&#26178;&#38291;(&#31186;&#21336;&#20301;)&#12290;0&#20197;&#19979;&#12398;&#20516;&#12434;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#12461;&#12540;&#12503;&#12450;&#12521;&#12452;&#12502;&#25509;&#32154;&#12399;&#38283;&#12356;&#12383;&#12414;&#12414;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;30&#31186;&#12391;&#12377;&#12290;</p>
<p>-1&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12371;&#12398;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12399;&#28961;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12450;&#12483;&#12503;&#12525;&#12540;&#12489;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#20302;&#36895;&#12391;&#35501;&#21462;&#12426;&#12434;&#34892;&#12358;&#12469;&#12540;&#12502;&#12524;&#12483;&#12488;&#12398;&#25509;&#32154;&#12364;&#12289;&#12300;&#25509;&#32154;&#12450;&#12483;&#12503;&#12525;&#12540;&#12489;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12301;&#12398;&#21046;&#38480;&#12395;&#36948;&#12375;&#12383;&#24460;&#12395;&#12463;&#12525;&#12540;&#12474;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#28961;&#21177;&#12398;&#22580;&#21512;&#12289;&#12469;&#12540;&#12502;&#12524;&#12483;&#12488;&#12398;&#25509;&#32154;&#12399;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12375;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#25509;&#32154;&#12450;&#12483;&#12503;&#12525;&#12540;&#12489;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;</dt>
<dd>
<p>&#12450;&#12483;&#12503;&#12525;&#12540;&#12489;&#12398;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;(&#12511;&#12522;&#31186;&#21336;&#20301;)&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#12289;&#12300;&#12450;&#12483;&#12503;&#12525;&#12540;&#12489;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12364;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;300000&#12511;&#12522;&#31186;&#12391;&#12377;&#12290;</p>
<p>-1&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12371;&#12398;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12399;&#28961;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12522;&#12463;&#12456;&#12473;&#12488;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;</dt>
<dd>
<p>&#12522;&#12463;&#12456;&#12473;&#12488;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12414;&#12391;&#12398;&#31186;&#25968;&#12290;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#20516;&#12395;&#36948;&#12377;&#12427;&#12414;&#12391;&#12395;&#12522;&#12463;&#12456;&#12473;&#12488;&#12364;&#20966;&#29702;&#12373;&#12428;&#12394;&#12356;&#22580;&#21512;&#12289;&#12522;&#12463;&#12456;&#12473;&#12488;&#12399;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;30&#31186;&#12391;&#12377;&#12290;</p>
<p>-1&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12371;&#12398;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12399;&#28961;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#36865;&#20449;&#12496;&#12483;&#12501;&#12449;&#12539;&#12469;&#12452;&#12474;</dt>
<dd>
<p>&#36865;&#20449;&#12496;&#12483;&#12501;&#12449;&#12398;&#12469;&#12452;&#12474;(&#12496;&#12452;&#12488;&#21336;&#20301;)&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;8192&#12496;&#12452;&#12488;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12504;&#12483;&#12480;&#12540;&#12539;&#12496;&#12483;&#12501;&#12449;&#38263;</dt>
<dd>
<p>&#12522;&#12463;&#12456;&#12473;&#12488;&#20966;&#29702;&#12473;&#12524;&#12483;&#12489;&#12364;&#12522;&#12463;&#12456;&#12473;&#12488;&#12539;&#12487;&#12540;&#12479;&#12398;&#35501;&#21462;&#12426;&#26178;&#12395;&#20351;&#29992;&#12377;&#12427;&#12496;&#12483;&#12501;&#12449;&#12398;&#12469;&#12452;&#12474;(&#12496;&#12452;&#12488;&#21336;&#20301;)&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;8192&#12496;&#12452;&#12488;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#12509;&#12473;&#12488;&#12469;&#12452;&#12474;</dt>
<dd>
<p>application/x-www-form-urlencoded&#12434;&#20351;&#29992;&#12375;&#12383;POST&#12450;&#12463;&#12471;&#12519;&#12531;&#12398;&#26368;&#22823;&#12469;&#12452;&#12474;(&#12496;&#12452;&#12488;&#21336;&#20301;)&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;2097152&#12496;&#12452;&#12488;&#12391;&#12377;&#12290;</p>
</dd>
<dt>URI&#12456;&#12531;&#12467;&#12540;&#12487;&#12451;&#12531;&#12464;</dt>
<dd>
<p>&#21463;&#20449;&#12375;&#12383;&#12522;&#12463;&#12456;&#12473;&#12488;URI&#12398;&#12487;&#12467;&#12540;&#12489;&#12395;&#20351;&#29992;&#12377;&#12427;&#25991;&#23383;&#12475;&#12483;&#12488;&#12398;&#21517;&#21069;&#12290;&#26377;&#21177;&#12394;IANA&#25991;&#23383;&#12475;&#12483;&#12488;&#21517;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;UTF-8&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12496;&#12540;&#12472;&#12519;&#12531;</dt>
<dd>
<p>&#20351;&#29992;&#12377;&#12427;HTTP&#12503;&#12525;&#12488;&#12467;&#12523;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;HTTP/1.1&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#22311;&#32302;</dt>
<dd>
<p>HTTP/1.1 GZIP&#22311;&#32302;&#12434;&#20351;&#29992;&#12375;&#12390;&#12469;&#12540;&#12496;&#12540;&#24111;&#22495;&#24133;&#12434;&#31680;&#32004;&#12377;&#12427;&#12371;&#12392;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#36984;&#25246;&#21487;&#33021;&#12394;&#20516;&#12399;&#27425;&#12398;&#12392;&#12362;&#12426;&#12391;&#12377;:</p>
<dl>
<dt><code>on</code></dt>
<dd>
<p>&#12487;&#12540;&#12479;&#12434;&#22311;&#32302;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt><code>off</code></dt>
<dd>
<p>&#22311;&#32302;&#12434;&#28961;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt><code>force</code></dt>
<dd>
<p>&#12356;&#12388;&#12391;&#12418;&#24375;&#21046;&#30340;&#12395;&#12487;&#12540;&#12479;&#22311;&#32302;&#12434;&#34892;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12300;<code>off</code>&#12301;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#22311;&#32302;&#21487;&#33021;&#12394;MIME&#12479;&#12452;&#12503;</dt>
<dd>
<p>HTTP&#22311;&#32302;&#12434;&#20351;&#29992;&#12377;&#12427;MIME&#12479;&#12452;&#12503;&#12398;&#12459;&#12531;&#12510;&#21306;&#20999;&#12426;&#12522;&#12473;&#12488;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12289;<code>text/html,text/xml,text/plain</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#22311;&#32302;&#12398;&#26368;&#23567;&#12469;&#12452;&#12474;</dt>
<dd>
<p>&#22311;&#32302;&#12434;&#36969;&#29992;&#12377;&#12427;&#12501;&#12449;&#12452;&#12523;&#12398;&#26368;&#23567;&#12469;&#12452;&#12474;&#12290;&#22311;&#32302;&#12434;&#12300;<code>on</code>&#12301;&#12414;&#12383;&#12399;&#12300;<code>force</code>&#12301;&#12395;&#35373;&#23450;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12371;&#12398;&#20516;&#12434;&#35373;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;2048&#12496;&#12452;&#12488;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#22311;&#32302;&#12434;&#20351;&#29992;&#12375;&#12394;&#12356;&#12518;&#12540;&#12470;&#12540;&#12539;&#12456;&#12540;&#12472;&#12455;&#12531;&#12488;</dt>
<dd>
<p>&#22311;&#32302;&#12434;&#20351;&#29992;&#12375;&#12394;&#12356;HTTP&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#12518;&#12540;&#12470;&#12540;&#12539;&#12456;&#12540;&#12472;&#12455;&#12531;&#12488;&#12395;&#19968;&#33268;&#12377;&#12427;&#27491;&#35215;&#34920;&#29694;&#12398;&#12459;&#12531;&#12510;&#21306;&#20999;&#12426;&#12522;&#12473;&#12488;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12371;&#12398;&#20516;&#12399;&#31354;&#12398;&#25991;&#23383;&#21015;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#21046;&#38480;&#12373;&#12428;&#12383;&#12518;&#12540;&#12470;&#12540;&#12539;&#12456;&#12540;&#12472;&#12455;&#12531;&#12488;</dt>
<dd>
<p>HTTP&#22311;&#32302;&#36969;&#29992;&#23550;&#35937;&#12398;&#21046;&#38480;&#12373;&#12428;&#12383;&#12518;&#12540;&#12470;&#12540;&#12539;&#12456;&#12540;&#12472;&#12455;&#12531;&#12488;&#12398;&#12522;&#12473;&#12488;&#12290;&#12518;&#12540;&#12470;&#12540;&#12539;&#12456;&#12540;&#12472;&#12455;&#12531;&#12488;&#12434;&#25351;&#23450;&#12375;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#12518;&#12540;&#12470;&#12540;&#12539;&#12456;&#12540;&#12472;&#12455;&#12531;&#12488;&#12395;HTTP&#22311;&#32302;&#12364;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12518;&#12540;&#12470;&#12540;&#12539;&#12456;&#12540;&#12472;&#12455;&#12531;&#12488;&#12399;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12524;&#12473;&#12509;&#12531;&#12473;&#12539;&#12479;&#12452;&#12503;</dt>
<dd>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12524;&#12473;&#12509;&#12531;&#12473;&#12539;&#12479;&#12452;&#12503;&#12434;&#25351;&#23450;&#12377;&#12427;&#25991;&#23383;&#21015;&#12290;&#24418;&#24335;&#12399;&#12289;&#12467;&#12531;&#12486;&#12531;&#12484;&#12539;&#12479;&#12452;&#12503;&#12289;&#12456;&#12531;&#12467;&#12540;&#12487;&#12451;&#12531;&#12464;&#12289;&#35328;&#35486;&#12289;&#12362;&#12424;&#12403;&#25991;&#23383;&#12475;&#12483;&#12488;&#12391;&#27083;&#25104;&#12373;&#12428;&#12427;&#12289;&#12475;&#12511;&#12467;&#12525;&#12531;&#12391;&#21306;&#20999;&#12425;&#12428;&#12383;&#25991;&#23383;&#21015;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12289;<code>text/html; charset=iso-8859-1</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#24375;&#21046;&#12524;&#12473;&#12509;&#12531;&#12473;&#12539;&#12479;&#12452;&#12503;</dt>
<dd>
<p>&#12501;&#12449;&#12452;&#12523;&#25313;&#24373;&#23376;&#12395;&#19968;&#33268;&#12377;&#12427;MIME&#12510;&#12483;&#12500;&#12531;&#12464;&#12364;&#12394;&#12356;&#22580;&#21512;&#12395;&#20351;&#29992;&#12373;&#12428;&#12427;&#12289;&#12522;&#12463;&#12456;&#12473;&#12488;&#12539;&#12479;&#12452;&#12503;&#12434;&#25351;&#23450;&#12377;&#12427;&#25991;&#23383;&#21015;&#12290;&#24418;&#24335;&#12399;&#12289;&#12467;&#12531;&#12486;&#12531;&#12484;&#12539;&#12479;&#12452;&#12503;&#12289;&#12456;&#12531;&#12467;&#12540;&#12487;&#12451;&#12531;&#12464;&#12289;&#35328;&#35486;&#12289;&#12362;&#12424;&#12403;&#25991;&#23383;&#12475;&#12483;&#12488;&#12391;&#27083;&#25104;&#12373;&#12428;&#12427;&#12289;&#12475;&#12511;&#12467;&#12525;&#12531;&#12391;&#21306;&#20999;&#12425;&#12428;&#12383;&#25991;&#23383;&#21015;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12289;<code>text/html; charset=iso-8859-1</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12450;&#12480;&#12503;&#12479;</dt>
<dd>
<p>&#38745;&#30340;&#12394;&#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12398;&#12463;&#12521;&#12473;&#21517;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12289;<code>com.sun.grizzly.tcp.StaticResourcesAdapter</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt>Comet&#12469;&#12509;&#12540;&#12488;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12503;&#12525;&#12488;&#12467;&#12523;&#12395;&#23550;&#12375;&#12390;Comet&#12469;&#12509;&#12540;&#12488;&#12399;&#26377;&#21177;&#12391;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>DNS&#12523;&#12483;&#12463;&#12450;&#12483;&#12503;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12489;&#12513;&#12452;&#12531;&#12539;&#12493;&#12540;&#12512;&#12539;&#12471;&#12473;&#12486;&#12512;(DNS)&#26908;&#32034;&#12364;&#26377;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>RCM&#12469;&#12509;&#12540;&#12488;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;Resource Configuration Management (RCM)&#12364;&#26377;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12488;&#12524;&#12540;&#12473;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;TRACE&#25805;&#20316;&#12364;&#26377;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#28961;&#21177;&#12395;&#12377;&#12427;&#12392;&#12289;GlassFish Server&#12399;&#12463;&#12525;&#12473;&#12469;&#12452;&#12488;&#12539;&#12473;&#12463;&#12522;&#12503;&#12488;&#25915;&#25731;&#12398;&#24433;&#38911;&#12434;&#21463;&#12369;&#12395;&#12367;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#35469;&#35388;&#12497;&#12473;&#12539;&#12473;&#12523;&#12540;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12371;&#12398;&#12503;&#12525;&#12488;&#12467;&#12523;&#12434;&#20351;&#29992;&#12377;&#12427;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;&#12364;SSL&#12398;&#32066;&#31471;&#12503;&#12525;&#12461;&#12471;&#12539;&#12469;&#12540;&#12496;&#12540;&#12363;&#12425;&#12398;&#12488;&#12521;&#12501;&#12451;&#12483;&#12463;&#12434;&#21463;&#20449;&#12377;&#12427;&#12371;&#12392;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12481;&#12515;&#12531;&#12463;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;HTTP&#12524;&#12473;&#12509;&#12531;&#12473;&#12398;&#12481;&#12515;&#12531;&#12463;&#12364;&#26377;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>XPowered By</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;GlassFish Server&#12399;Java Servlet 3.0&#12362;&#12424;&#12403;Java Server Pages 2.0&#12398;&#20181;&#27096;&#12395;&#24467;&#12387;&#12390;<code>X-Powered-By</code>&#12504;&#12483;&#12480;&#12540;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12456;&#12531;&#12467;&#12540;&#12489;&#12373;&#12428;&#12383;&#12473;&#12521;&#12483;&#12471;&#12517;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;URI&#12395;&#12456;&#12531;&#12467;&#12540;&#12489;&#12373;&#12428;&#12383;&#12473;&#12521;&#12483;&#12471;&#12517;&#12434;&#21547;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>WebSocket&#12469;&#12509;&#12540;&#12488;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;WebSocket&#12503;&#12525;&#12488;&#12467;&#12523;&#12364;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<a id="sthref153" name="sthref153"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-protocolnew.html">&#12503;&#12525;&#12488;&#12467;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">&#12503;&#12525;&#12488;&#12467;&#12523;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">&#12503;&#12525;&#12488;&#12467;&#12523;&#12398;SSL&#35373;&#23450;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">&#12503;&#12525;&#12488;&#12467;&#12523;&#12398;HTTP&#35373;&#23450;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-protocolfilecacheedit.html">&#12503;&#12525;&#12488;&#12467;&#12523;&#12398;&#12501;&#12449;&#12452;&#12523;&#12539;&#12461;&#12515;&#12483;&#12471;&#12517;&#35373;&#23450;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">&#12503;&#12525;&#12488;&#12467;&#12523;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref154" name="sthref154"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00051"><code>create-protocol</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00195"><code>list-protocols</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00103"><code>delete-protocol</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
