<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-managerproptab" name="ref-managerproptab"></a></p>

<h4><a id="sthref94" name="sthref94"></a><a id="sthref95" name="sthref95"></a>&#12510;&#12493;&#12540;&#12472;&#12515;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12475;&#12483;&#12471;&#12519;&#12531;&#12539;&#12510;&#12493;&#12540;&#12472;&#12515;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12475;&#12483;&#12471;&#12519;&#12531;&#12434;&#20316;&#25104;&#12362;&#12424;&#12403;&#30772;&#26820;&#12377;&#12427;&#26041;&#27861;&#12289;&#12475;&#12483;&#12471;&#12519;&#12531;&#29366;&#24907;&#12434;&#26684;&#32013;&#12377;&#12427;&#22580;&#25152;&#12289;&#12362;&#12424;&#12403;&#20351;&#29992;&#21487;&#33021;&#12394;&#12475;&#12483;&#12471;&#12519;&#12531;&#12398;&#26368;&#22823;&#25968;&#12434;&#27083;&#25104;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12510;&#12493;&#12540;&#12472;&#12515;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;Web&#12467;&#12531;&#12486;&#12490;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12539;&#12510;&#12493;&#12540;&#12472;&#12515;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12414;&#12383;&#12399;&#22793;&#26356;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12510;&#12493;&#12540;&#12472;&#12515;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12489;</dt>
<dd>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12354;&#12427;&#35373;&#23450;&#12434;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12395;&#24489;&#20803;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12394;&#12356;&#35373;&#23450;&#12399;&#22793;&#26356;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>&#27083;&#25104;&#21517;</dt>
<dd>
<p>&#12371;&#12398;&#12506;&#12540;&#12472;&#12398;&#35373;&#23450;&#12364;&#36969;&#29992;&#12373;&#12428;&#12427;&#27083;&#25104;&#12398;&#21517;&#21069;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#21462;&#24471;&#38291;&#38548;</dt>
<dd>
<p>&#38750;&#12450;&#12463;&#12486;&#12451;&#12502;&#12394;&#12475;&#12483;&#12471;&#12519;&#12531;&#12539;&#12487;&#12540;&#12479;&#12364;&#12473;&#12488;&#12450;&#12363;&#12425;&#21066;&#38500;&#12373;&#12428;&#12427;&#12414;&#12391;&#12398;&#31186;&#25968;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;60&#12391;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#20516;&#12399;&#12289;&#12475;&#12483;&#12471;&#12519;&#12531;&#12539;&#12487;&#12540;&#12479;&#12364;&#22793;&#26356;&#12373;&#12428;&#12427;&#38971;&#24230;&#12424;&#12426;&#23567;&#12373;&#12356;&#20516;&#12395;&#35373;&#23450;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#12498;&#12483;&#12488;&#38971;&#24230;&#12398;&#39640;&#12356;Web&#12469;&#12452;&#12488;&#12398;&#12498;&#12483;&#12488;&#12539;&#12459;&#12454;&#12531;&#12479;&#12539;&#12469;&#12540;&#12502;&#12524;&#12483;&#12488;&#12391;&#12399;&#12289;&#12371;&#12398;&#20516;&#12434;&#12391;&#12365;&#12427;&#12384;&#12369;&#23567;&#12373;&#12356;&#20516;(1&#31186;)&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#20516;&#12364;&#22823;&#12365;&#12356;&#22580;&#21512;&#12289;&#12469;&#12540;&#12496;&#12540;&#12434;&#20877;&#36215;&#21205;&#12377;&#12427;&#12383;&#12403;&#12395;&#12289;&#26368;&#24460;&#12398;&#25968;&#22238;&#12398;&#12498;&#12483;&#12488;&#12434;&#21462;&#24471;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#12475;&#12483;&#12471;&#12519;&#12531;&#25968;</dt>
<dd>
<p>&#12461;&#12515;&#12483;&#12471;&#12517;&#12395;&#32173;&#25345;&#12391;&#12365;&#12427;&#12475;&#12483;&#12471;&#12519;&#12531;&#12398;&#26368;&#22823;&#25968;&#12290;-1&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12475;&#12483;&#12471;&#12519;&#12531;&#12398;&#25968;&#12399;&#21046;&#38480;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;-1&#12391;&#12377;&#12290;</p>
<p>&#21046;&#38480;&#12395;&#36948;&#12375;&#12383;&#24460;&#12395;&#26032;&#35215;&#12475;&#12483;&#12471;&#12519;&#12531;&#12434;&#20316;&#25104;&#12375;&#12424;&#12358;&#12392;&#12377;&#12427;&#12392;&#12289;<code>IllegalStateException</code>&#12364;&#12473;&#12525;&#12540;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12475;&#12483;&#12471;&#12519;&#12531;&#12539;&#12501;&#12449;&#12452;&#12523;&#21517;</dt>
<dd>
<p>&#29366;&#24907;&#12398;&#20445;&#23384;&#12364;&#21487;&#33021;&#12394;&#22580;&#21512;&#12395;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#20877;&#36215;&#21205;&#38291;&#12391;&#12475;&#12483;&#12471;&#12519;&#12531;&#29366;&#24907;&#12434;&#20445;&#23384;&#12377;&#12427;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12398;&#32118;&#23550;&#12497;&#12473;&#12414;&#12383;&#12399;&#30456;&#23550;&#12497;&#12473;&#12290;&#12371;&#12398;&#12497;&#12473;&#12364;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12475;&#12483;&#12471;&#12519;&#12531;&#29366;&#24907;&#12399;&#20445;&#23384;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12371;&#12398;&#12497;&#12473;&#12399;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;</p>
<p>&#30456;&#23550;&#12497;&#12473;&#12399;&#12289;&#12371;&#12398;Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#19968;&#26178;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12363;&#12425;&#12398;&#30456;&#23550;&#12391;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;</dt>
<dd>
<p>&#12475;&#12483;&#12471;&#12519;&#12531;&#12539;&#12510;&#12493;&#12540;&#12472;&#12515;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12290;GlassFish Server&#12399;&#12475;&#12483;&#12471;&#12519;&#12531;&#12539;&#12510;&#12493;&#12540;&#12472;&#12515;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#23450;&#32681;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
</dl>
<a id="sthref96" name="sthref96"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-webcontainergeneral.html">Web&#12467;&#12531;&#12486;&#12490;&#12398;&#19968;&#33324;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-webcontainersessiontimeout.html">Web&#12467;&#12531;&#12486;&#12490;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-webcontainermanagerprops.html">Web&#12467;&#12531;&#12486;&#12490;&#12398;&#12510;&#12493;&#12540;&#12472;&#12515;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-webcontainerstoreprops.html">Web&#12467;&#12531;&#12486;&#12490;&#12398;&#12473;&#12488;&#12450;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-webcontaineravailability.html">Web&#12467;&#12531;&#12486;&#12490;&#12398;&#21487;&#29992;&#24615;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref97" name="sthref97"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<p>&#12394;&#12375;&#12290;</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
