<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-accesslog" name="ref-accesslog"></a></p>

<h4><a id="sthref103" name="sthref103"></a><a id="sthref104" name="sthref104"></a>HTTP&#12469;&#12540;&#12499;&#12473;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#19968;&#33324;&#30340;&#12394;&#12450;&#12463;&#12475;&#12473;&#12539;&#12525;&#12464;&#12539;&#12509;&#12522;&#12471;&#12540;&#12434;&#25351;&#23450;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;HTTP&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>HTTP&#12469;&#12540;&#12499;&#12473;&#12399;&#12289;Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#27231;&#33021;&#12289;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12390;&#12356;&#12427;Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;HTTP&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12391;&#12450;&#12463;&#12475;&#12473;&#21487;&#33021;&#12395;&#12377;&#12427;&#27231;&#33021;&#12289;&#12362;&#12424;&#12403;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12289;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12289;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#27083;&#25104;&#27231;&#33021;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;</p>
<p>GlassFish Server&#12399;HTTP&#12469;&#12540;&#12499;&#12473;&#12398;&#12450;&#12463;&#12475;&#12473;&#12539;&#12525;&#12464;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12398;&#12450;&#12463;&#12475;&#12473;&#12539;&#12525;&#12464;&#12398;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12395;&#12375;&#12289;&#27083;&#25104;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#12525;&#12464;&#12399;domain-dir<code>/logs/access</code>&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#12354;&#12426;&#12289;&#21517;&#21069;&#12398;&#24418;&#24335;&#12399;<i>virtual_server_name</i><code>_access_log.</code><i>yyyyMMdd</i><code>-</code><i>HH</i><code>h</code><i>mm</i><code>m</code><i>ss</i><code>s.txt</code>&#12391;&#12377;&#12290;</p>
<p>&#12300;HTTP&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12489;</dt>
<dd>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12354;&#12427;&#35373;&#23450;&#12434;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12395;&#24489;&#20803;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12394;&#12356;&#35373;&#23450;&#12399;&#22793;&#26356;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>&#27083;&#25104;&#21517;</dt>
<dd>
<p>&#12371;&#12398;&#12506;&#12540;&#12472;&#12398;&#35373;&#23450;&#12364;&#36969;&#29992;&#12373;&#12428;&#12427;&#27083;&#25104;&#12398;&#21517;&#21069;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>SSO</dt>
<dd>
<p>&#12371;&#12398;&#12469;&#12540;&#12496;&#12540;&#12398;&#12377;&#12409;&#12390;&#12398;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#19978;&#12391;&#12289;&#21516;&#12376;&#12524;&#12523;&#12512;&#12391;&#27083;&#25104;&#12373;&#12428;&#12383;&#12377;&#12409;&#12390;&#12398;Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12471;&#12531;&#12464;&#12523;&#12539;&#12469;&#12452;&#12531;&#12458;&#12531;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#35672;&#21029;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#26377;&#21177;&#12391;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12391;&#12471;&#12531;&#12464;&#12523;&#12539;&#12469;&#12452;&#12531;&#12458;&#12531;&#12364;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#28961;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12518;&#12540;&#12470;&#12540;&#12399;&#12289;&#21508;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#19978;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12372;&#12392;&#12395;&#20491;&#21029;&#12395;&#35469;&#35388;&#12434;&#34892;&#12358;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#35373;&#23450;&#12399;&#21508;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12391;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12391;&#12365;&#12414;&#12377;&#12290;SSO&#12399;&#26377;&#21177;&#12414;&#12383;&#12399;&#28961;&#21177;&#12395;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12450;&#12463;&#12475;&#12473;&#12539;&#12525;&#12462;&#12531;&#12464;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#22580;&#21512;&#12289;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12377;&#12409;&#12390;&#12398;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12539;&#12469;&#12502;&#35201;&#32032;&#12398;&#12450;&#12463;&#12475;&#12473;&#12539;&#12525;&#12462;&#12531;&#12464;&#12364;&#26377;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#36984;&#25246;&#12375;&#12394;&#12356;&#22580;&#21512;&#12289;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12395;&#12424;&#12426;&#12289;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12377;&#12409;&#12390;&#12398;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12539;&#12469;&#12502;&#35201;&#32032;&#12398;&#12450;&#12463;&#12475;&#12473;&#12539;&#12525;&#12462;&#12531;&#12464;&#12364;&#28961;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12364;&#26377;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12539;&#12509;&#12522;&#12471;&#12540;</dt>
<dd>
<p>&#20351;&#29992;&#21487;&#33021;&#12394;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12539;&#12509;&#12522;&#12471;&#12540;&#12399;<code>time</code>&#12398;&#12415;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#38291;&#38548;</dt>
<dd>
<p>&#12450;&#12463;&#12475;&#12473;&#12539;&#12525;&#12464;&#12398;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#38291;&#38548;(&#20998;)&#12391;&#12377;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#12289;&#12300;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12539;&#12509;&#12522;&#12471;&#12540;&#12301;&#12364;&#12300;<code>time</code>&#12301;&#12398;&#22580;&#21512;&#12395;&#12398;&#12415;&#26377;&#21177;&#12391;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;1,440&#20998;(24&#26178;&#38291;)&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#25509;&#23614;&#36766;</dt>
<dd>
<p>&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#24460;&#12395;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#21517;&#12398;&#26368;&#24460;&#12395;&#36861;&#21152;&#12373;&#12428;&#12427;&#25991;&#23383;&#21015;&#20516;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>yyyy-MM-dd</code>&#12391;&#12377;&#12290;</p>
<p>&#12525;&#12464;&#12539;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12372;&#12392;&#12395;&#19968;&#24847;&#12398;&#25509;&#23614;&#36766;&#12434;&#20316;&#25104;&#12377;&#12427;&#12383;&#12417;&#12395;&#24517;&#35201;&#12394;&#20516;&#12364;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#25509;&#23614;&#36766;&#12395;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#12450;&#12463;&#12475;&#12473;&#12539;&#12525;&#12464;&#12434;&#27598;&#26085;&#35079;&#25968;&#22238;&#12398;&#38971;&#24230;&#12391;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12377;&#12427;&#22580;&#21512;&#12395;&#12399;&#12289;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#25509;&#23614;&#36766;&#12395;&#26178;&#38291;&#12434;&#21547;&#12417;&#12414;&#12377;&#12290;</p>
<p>&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#38291;&#38548;&#12364;&#32076;&#36942;&#12377;&#12427;&#12383;&#12403;&#12395;&#12450;&#12463;&#12475;&#12473;&#12539;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12364;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;&#19968;&#24847;&#12398;&#25509;&#23614;&#36766;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;&#26032;&#12375;&#12356;&#12450;&#12463;&#12475;&#12473;&#12539;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#25509;&#23614;&#36766;&#12364;&#26082;&#23384;&#12398;&#12450;&#12463;&#12475;&#12473;&#12539;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#25509;&#23614;&#36766;&#12392;&#21516;&#12376;&#22580;&#21512;&#12289;&#12501;&#12449;&#12452;&#12523;&#12399;&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#12501;&#12449;&#12452;&#12523;&#25968;</dt>
<dd>
<p>&#12525;&#12540;&#12486;&#12540;&#12471;&#12519;&#12531;&#12391;&#32173;&#25345;&#12377;&#12427;&#12450;&#12463;&#12475;&#12473;&#12539;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#26368;&#22823;&#25968;&#12290;&#36000;&#12398;&#20516;&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12501;&#12449;&#12452;&#12523;&#25968;&#12399;&#21046;&#38480;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;-1&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12496;&#12483;&#12501;&#12449;&#12539;&#12469;&#12452;&#12474;</dt>
<dd>
<p>&#12450;&#12463;&#12475;&#12473;&#12539;&#12525;&#12464;&#12539;&#12496;&#12483;&#12501;&#12449;&#12398;&#12469;&#12452;&#12474;(&#12496;&#12452;&#12488;&#21336;&#20301;)&#12290;&#12496;&#12483;&#12501;&#12449;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12450;&#12463;&#12475;&#12473;&#12539;&#12525;&#12464;&#12391;&#12399;&#12289;0&#20197;&#19979;&#12398;&#20516;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;32768&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#26360;&#36796;&#12415;&#38291;&#38548;</dt>
<dd>
<p>&#12525;&#12464;&#12364;&#12487;&#12451;&#12473;&#12463;&#12395;&#26360;&#12365;&#36796;&#12414;&#12428;&#12427;&#12414;&#12391;&#12398;&#31186;&#25968;&#12290;&#12450;&#12463;&#12475;&#12473;&#12539;&#12525;&#12464;&#12399;&#12289;&#12496;&#12483;&#12501;&#12449;&#12364;&#12501;&#12523;&#12395;&#12394;&#12427;&#12363;&#12289;&#25351;&#23450;&#12375;&#12383;&#26178;&#38291;&#12364;&#32076;&#36942;&#12377;&#12427;&#12392;&#26360;&#12365;&#36796;&#12414;&#12428;&#12414;&#12377;&#12290;0&#20197;&#19979;&#12398;&#20516;&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12496;&#12483;&#12501;&#12449;&#12364;&#12501;&#12523;&#12391;&#12394;&#12367;&#12390;&#12418;&#24120;&#12395;&#26360;&#12365;&#36796;&#12414;&#12428;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;&#12469;&#12540;&#12496;&#12540;&#12539;&#12450;&#12463;&#12475;&#12473;&#12364;&#12354;&#12427;&#12383;&#12403;&#12395;&#12289;&#12525;&#12464;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#12501;&#12449;&#12452;&#12523;&#12395;&#30452;&#25509;&#26684;&#32013;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;300&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#24418;&#24335;</dt>
<dd>
<p>&#12450;&#12463;&#12475;&#12473;&#12539;&#12525;&#12464;&#12395;&#21462;&#12426;&#36796;&#12414;&#12428;&#12427;&#24773;&#22577;&#12392;&#21462;&#12426;&#36796;&#12414;&#12428;&#12427;&#38918;&#24207;&#12434;&#25351;&#23450;&#12377;&#12427;&#25991;&#23383;&#21015;&#20516;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#27425;&#12398;&#12392;&#12362;&#12426;&#12391;&#12377;&#12290;</p>
<pre>
%client.name% %auth-user-name% %datetime% %request% %status% %response.length%
</pre>
<p>&#24418;&#24335;&#25991;&#23383;&#21015;&#12395;&#21547;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#20516;&#12399;&#27425;&#12398;&#12392;&#12362;&#12426;&#12391;&#12377;&#12290;</p>
<dl>
<dt><code>%attribute.</code><i>name</i><code>%</code></dt>
<dd>
<p>&#25351;&#23450;&#12375;&#12383;<i>name</i>&#12434;&#25345;&#12388;&#12522;&#12463;&#12456;&#12473;&#12488;&#23646;&#24615;&#12398;&#20516;&#12434;(<code>toString</code>&#12513;&#12477;&#12483;&#12489;&#12434;&#12467;&#12540;&#12523;&#12375;&#12390;)&#35352;&#37682;&#12375;&#12414;&#12377;</p>
</dd>
<dt><code>%auth-user-name%</code></dt>
<dd>
<p>&#25215;&#35469;&#12518;&#12540;&#12470;&#12540;&#12398;&#21517;&#21069;</p>
</dd>
<dt><code>%client.name%</code></dt>
<dd>
<p>&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12507;&#12473;&#12488;&#21517;</p>
</dd>
<dt><code>%client.dns%</code></dt>
<dd>
<p>&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;DNS</p>
</dd>
<dt><code>%cookie.</code><i>name</i><code>%</code></dt>
<dd>
<p>&#25351;&#23450;&#12375;&#12383;<i>name</i>&#12434;&#25345;&#12388;&#12522;&#12463;&#12456;&#12473;&#12488;&#12398;cookie&#12398;&#20516;</p>
</dd>
<dt><code>%cookie.value%</code></dt>
<dd>
<p>&#12522;&#12463;&#12456;&#12473;&#12488;&#12395;&#12354;&#12427;&#26368;&#21021;&#12398;cookie&#12398;&#20516;</p>
</dd>
<dt><code>%datetime%</code></dt>
<dd>
<p>&#12471;&#12473;&#12486;&#12512;&#26085;&#20184;</p>
</dd>
<dt><code>%request%</code></dt>
<dd>
<p>&#23436;&#20840;&#12394;HTTP&#12522;&#12463;&#12456;&#12473;&#12488;&#34892;</p>
</dd>
<dt><code>%status%</code></dt>
<dd>
<p>&#12473;&#12486;&#12540;&#12479;&#12473;</p>
</dd>
<dt><code>%response.length%</code></dt>
<dd>
<p>&#12524;&#12473;&#12509;&#12531;&#12473;&#12539;&#12467;&#12531;&#12486;&#12531;&#12484;&#38263;</p>
</dd>
<dt><code>%header.referer%</code></dt>
<dd>
<p>Referer&#12504;&#12483;&#12480;&#12540;</p>
</dd>
<dt><code>%header.user-agent%</code></dt>
<dd>
<p>&#12518;&#12540;&#12470;&#12540;&#12539;&#12456;&#12540;&#12472;&#12455;&#12531;&#12488;&#12539;&#12504;&#12483;&#12480;&#12540;</p>
</dd>
<dt><code>%http-method%</code></dt>
<dd>
<p>HTTP&#12513;&#12477;&#12483;&#12489;</p>
</dd>
<dt><code>%http-uri%</code></dt>
<dd>
<p>HTTP URI</p>
</dd>
<dt><code>%query-str%</code></dt>
<dd>
<p>HTTP&#21839;&#21512;&#12379;&#25991;&#23383;&#21015;</p>
</dd>
<dt><code>%http-version%</code></dt>
<dd>
<p>HTTP&#12503;&#12525;&#12488;&#12467;&#12523;&#12539;&#12496;&#12540;&#12472;&#12519;&#12531;</p>
</dd>
<dt><code>%header.accept%</code></dt>
<dd>
<p>&#21463;&#20837;&#12428;&#12504;&#12483;&#12480;&#12540;</p>
</dd>
<dt><code>%header.date%</code></dt>
<dd>
<p>&#26085;&#20184;&#12504;&#12483;&#12480;&#12540;</p>
</dd>
<dt><code>%header.if-mod-since%</code></dt>
<dd>
<p>If-Modified-Since&#12504;&#12483;&#12480;&#12540;</p>
</dd>
<dt><code>%header.auth%</code></dt>
<dd>
<p>&#35469;&#35388;&#12504;&#12483;&#12480;&#12540;</p>
</dd>
<dt><code>%header.</code><i>any</i><code>%</code></dt>
<dd>
<p>RFC 2616&#12391;&#23450;&#32681;&#12373;&#12428;&#12383;&#20219;&#24847;&#12398;&#26377;&#21177;&#12394;HTTP&#12504;&#12483;&#12480;&#12540;&#20516;(<code>any</code>&#12418;&#26377;&#21177;&#12394;&#12504;&#12483;&#12480;&#12540;&#20516;&#12290;&#12371;&#12371;&#12391;&#12399;&#22793;&#25968;&#12392;&#12375;&#12390;&#25351;&#23450;&#12373;&#12428;&#12427;)</p>
</dd>
<dt><code>%session.</code><i>name</i><code>%</code></dt>
<dd>
<p><i>name</i>&#12392;&#12356;&#12358;&#21517;&#21069;&#12434;&#25345;&#12388;&#12475;&#12483;&#12471;&#12519;&#12531;&#23646;&#24615;&#12398;&#20516;&#12290;&#25351;&#23450;&#12375;&#12383;&#23646;&#24615;&#12364;&#12475;&#12483;&#12471;&#12519;&#12531;&#12395;&#23384;&#22312;&#12375;&#12394;&#12356;&#22580;&#21512;&#12399;<code>NULL-SESSION-ATTRIBUTE-</code><i>name</i>&#12289;&#12475;&#12483;&#12471;&#12519;&#12531;&#12364;&#23384;&#22312;&#12375;&#12394;&#12356;&#22580;&#21512;&#12399;<code>NULL-SESSION</code>&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
</dd>
<dt><code>%time-taken%</code></dt>
<dd>
<p>&#21508;&#12522;&#12463;&#12456;&#12473;&#12488;&#12398;&#20966;&#29702;&#12395;&#12363;&#12363;&#12387;&#12383;&#26178;&#38291;(&#12511;&#12522;&#31186;&#21336;&#20301;)</p>
</dd>
<dt><code>%vs.id%</code></dt>
<dd>
<p>&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;ID</p>
</dd>
</dl>
</dd>
<dt>&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;</dt>
<dd>
<p>HTTP&#12469;&#12540;&#12499;&#12473;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12290;&#20351;&#29992;&#21487;&#33021;&#12394;&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a href="ref-httpserviceprops.html">HTTP&#12469;&#12540;&#12499;&#12473;&#12395;&#22266;&#26377;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</dd>
</dl>
<a id="sthref105" name="sthref105"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<p><a href="task-accesslog.html">HTTP&#12469;&#12540;&#12499;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
<a id="sthref106" name="sthref106"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<p>&#12394;&#12375;&#12290;</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
