<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-virtualservernew" name="ref-virtualservernew"></a><a id="GHWEB00011" name="GHWEB00011"></a></p>

<h4><a id="sthref121" name="sthref121"></a>&#26032;&#35215;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#26032;&#35215;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26032;&#35215;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#27083;&#25104;&#21517;</dt>
<dd>
<p>&#12371;&#12398;&#12506;&#12540;&#12472;&#12398;&#35373;&#23450;&#12364;&#36969;&#29992;&#12373;&#12428;&#12427;&#27083;&#25104;&#12398;&#21517;&#21069;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>Id</dt>
<dd>
<p>&#20869;&#37096;&#30340;&#12395;&#21442;&#29031;&#21487;&#33021;&#12394;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12398;&#35672;&#21029;&#23376;&#12290;&#12371;&#12428;&#12364;HTTP&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#20596;&#12395;&#34920;&#31034;&#12373;&#12428;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;HTTP&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#20596;&#12395;&#34920;&#31034;&#12377;&#12427;&#12507;&#12473;&#12488;&#21517;&#12399;&#12289;&#12300;&#12507;&#12473;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12507;&#12473;&#12488;</dt>
<dd>
<p>&#12469;&#12540;&#12496;&#12540;&#12364;&#31292;&#20685;&#12377;&#12427;&#12510;&#12471;&#12531;&#12398;&#12507;&#12473;&#12488;&#21517;(1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;)&#12290;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12398;DNS&#12469;&#12540;&#12496;&#12540;(UNIX&#12471;&#12473;&#12486;&#12512;&#12391;&#12399;<code>/etc/hosts</code>&#12501;&#12449;&#12452;&#12523;)&#12395;&#30331;&#37682;&#12373;&#12428;&#12390;&#12356;&#12427;&#12289;&#23455;&#38555;&#12398;&#12507;&#12473;&#12488;&#21517;&#12414;&#12383;&#12399;&#20206;&#24819;&#12507;&#12473;&#12488;&#21517;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12289;&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12398;<code>${com.sun.aas.hostName}</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#29366;&#24907;</dt>
<dd>
<p>&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12395;&#27714;&#12417;&#12425;&#12428;&#12427;&#29366;&#24907;&#12290;&#20516;&#12399;&#27425;&#12398;&#12356;&#12378;&#12428;&#12363;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12458;&#12531;</dt>
<dd>
<p>&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12399;&#12450;&#12463;&#12486;&#12451;&#12502;&#12391;&#12377;&#12290;&#12371;&#12398;&#20516;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12458;&#12501;</dt>
<dd>
<p>&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12399;&#38750;&#12450;&#12463;&#12486;&#12451;&#12502;&#12391;&#12377;&#12290;&#12469;&#12540;&#12496;&#12540;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;&#12434;&#35430;&#34892;&#12377;&#12427;&#12392;&#12289;&#12456;&#12521;&#12540;&#12539;&#12467;&#12540;&#12489;404(&#12522;&#12477;&#12540;&#12473;&#12364;&#20351;&#29992;&#12391;&#12365;&#12414;&#12379;&#12435;)&#12364;&#36820;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#28961;&#21177;</dt>
<dd>
<p>&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12399;&#28961;&#21177;&#12391;&#12377;&#12290;&#12469;&#12540;&#12496;&#12540;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;&#12434;&#35430;&#34892;&#12377;&#12427;&#12392;&#12289;&#12456;&#12521;&#12540;&#12539;&#12467;&#12540;&#12489;403(&#12522;&#12463;&#12456;&#12473;&#12488;&#12398;&#23455;&#34892;&#25298;&#21542;)&#12364;&#36820;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
</dd>
<dt>SSO</dt>
<dd>
<p>&#12471;&#12531;&#12464;&#12523;&#12539;&#12469;&#12452;&#12531;&#12458;&#12531;&#12398;&#21205;&#20316;&#12434;&#12289;HTTP&#12469;&#12540;&#12499;&#12473;&#12363;&#12425;&#32153;&#25215;&#12289;&#26377;&#21177;&#12289;&#12414;&#12383;&#12399;&#28961;&#21177;&#12398;&#12356;&#12378;&#12428;&#12363;&#12395;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;HTTP&#12469;&#12540;&#12499;&#12473;&#12363;&#12425;&#32153;&#25215;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#26377;&#21177;&#12398;&#22580;&#21512;&#12289;&#12371;&#12398;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#19978;&#12398;&#21516;&#12376;&#12524;&#12523;&#12512;&#12391;&#27083;&#25104;&#12373;&#12428;&#12383;Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;&#12471;&#12531;&#12464;&#12523;&#12539;&#12469;&#12452;&#12531;&#12458;&#12531;&#12364;&#26377;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#28961;&#21177;&#12398;&#22580;&#21512;&#12289;&#12371;&#12398;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12391;&#12399;&#12471;&#12531;&#12464;&#12523;&#12539;&#12469;&#12452;&#12531;&#12458;&#12531;&#12364;&#28961;&#21177;&#12395;&#12394;&#12426;&#12289;&#12518;&#12540;&#12470;&#12540;&#12399;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#19978;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12372;&#12392;&#12395;&#20491;&#21029;&#12395;&#35469;&#35388;&#12434;&#34892;&#12358;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;</dt>
<dd>
<p>&#12371;&#12398;&#12469;&#12540;&#12496;&#12540;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12383;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;(&#23384;&#22312;&#12377;&#12427;&#22580;&#21512;)&#12290;</p>
</dd>
<dt>&#12487;&#12501;&#12457;&#12523;&#12488;Web&#12514;&#12472;&#12517;&#12540;&#12523;</dt>
<dd>
<p>&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12390;&#12356;&#12427;&#12381;&#12398;&#20182;&#12398;Web&#12514;&#12472;&#12517;&#12540;&#12523;&#12395;&#12510;&#12483;&#12500;&#12531;&#12464;&#12391;&#12365;&#12394;&#12356;&#12377;&#12409;&#12390;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12395;&#24540;&#31572;&#12377;&#12427;&#12487;&#12503;&#12525;&#12452;&#28168;Web&#12514;&#12472;&#12517;&#12540;&#12523;(&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;)&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;Web&#12514;&#12472;&#12517;&#12540;&#12523;&#12364;&#25351;&#23450;&#12373;&#12428;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12523;&#12540;&#12488;&#12364;&#31354;&#12398;Web&#12514;&#12472;&#12517;&#12540;&#12523;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12523;&#12540;&#12488;&#12364;&#31354;&#12398;Web&#12514;&#12472;&#12517;&#12540;&#12523;&#12364;&#23384;&#22312;&#12375;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12471;&#12473;&#12486;&#12512;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;Web&#12514;&#12472;&#12517;&#12540;&#12523;&#12364;&#20316;&#25104;&#12373;&#12428;&#12289;&#12371;&#12428;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;</dt>
<dd>
<p>&#12371;&#12398;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12363;&#12425;&#12398;&#12525;&#12462;&#12531;&#12464;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#34920;&#31034;&#12373;&#12428;&#12427;&#12501;&#12449;&#12452;&#12523;&#12398;&#12497;&#12473;&#21517;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12525;&#12462;&#12531;&#12464;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;domain-dir<code>/logs/server.log</code>&#12395;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>Docroot</dt>
<dd>
<p>&#12469;&#12540;&#12496;&#12540;&#12398;&#12523;&#12540;&#12488;&#12539;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12408;&#12398;&#32118;&#23550;&#12497;&#12473;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;domain-dir<code>/docroot</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12450;&#12463;&#12475;&#12473;&#12539;&#12525;&#12462;&#12531;&#12464;</dt>
<dd>
<p>&#12450;&#12463;&#12475;&#12473;&#12539;&#12525;&#12462;&#12531;&#12464;&#12434;&#12289;HTTP&#12469;&#12540;&#12499;&#12473;&#12363;&#12425;&#32153;&#25215;&#12289;&#26377;&#21177;&#12289;&#12414;&#12383;&#12399;&#28961;&#21177;&#12398;&#12356;&#12378;&#12428;&#12363;&#12395;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;HTTP&#12469;&#12540;&#12499;&#12473;&#12363;&#12425;&#32153;&#25215;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;</dt>
<dd>
<p>&#12469;&#12540;&#12496;&#12540;&#12398;&#12450;&#12463;&#12475;&#12473;&#12539;&#12525;&#12464;&#12408;&#12398;&#32118;&#23550;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12539;&#12497;&#12473;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;domain-dir<code>/logs/access</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;</dt>
<dd>
<p>&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12290;</p>
<p>&#20351;&#29992;&#21487;&#33021;&#12394;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#35443;&#32048;&#12399;&#12289;<a href="ref-virtualserverprops.html">&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12395;&#22266;&#26377;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</dd>
</dl>
<a id="sthref122" name="sthref122"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-virtualservercreate.html">&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-virtualserveredit.html">&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-virtualserverdelete.html">&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref123" name="sthref123"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00062"><code>create-virtual-server</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00207"><code>list-virtual-servers</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00113"><code>delete-virtual-server</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
