<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-threadpools" name="ref-threadpools"></a></p>

<h4><a id="sthref168" name="sthref168"></a><a id="sthref169" name="sthref169"></a>&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12469;&#12540;&#12499;&#12473;&#12434;&#29305;&#23450;&#12398;&#25968;&#12398;&#20006;&#34892;&#12473;&#12524;&#12483;&#12489;&#12395;&#21046;&#38480;&#12375;&#12414;&#12377;&#12290;</p>
<p>GlassFish Server&#12434;&#21021;&#12417;&#12390;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;2&#12388;&#12398;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12364;&#23384;&#22312;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;<code>http-thread-pool</code>&#12392;&#12356;&#12358;&#21517;&#21069;&#12398;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12399;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;&#12391;&#20351;&#29992;&#12377;&#12427;&#12424;&#12358;&#12395;&#27083;&#25104;&#12373;&#12428;&#12289;<code>thread-pool-1</code>&#12399;ORB&#12391;RMI/IIOP&#12522;&#12463;&#12456;&#12473;&#12488;&#12395;&#20351;&#29992;&#12377;&#12427;&#12424;&#12358;&#12395;&#27083;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12434;&#29305;&#23450;&#12398;&#31278;&#39006;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12420;&#29305;&#23450;&#12398;&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12539;&#12471;&#12473;&#12486;&#12512;&#12391;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#21029;&#12398;&#35373;&#23450;&#12391;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#12363;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12434;&#35201;&#27714;&#12395;&#24540;&#12376;&#12390;&#35519;&#25972;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<p>Java&#20206;&#24819;&#12510;&#12471;&#12531;(JVM)&#12399;&#12289;1&#22238;&#12398;&#23455;&#34892;&#12391;&#22810;&#25968;&#12398;&#12473;&#12524;&#12483;&#12489;&#12434;&#12469;&#12509;&#12540;&#12488;&#12391;&#12365;&#12414;&#12377;&#12290;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12395;&#24441;&#31435;&#12388;&#12424;&#12358;&#12395;&#12289;GlassFish Server&#12399;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12434;&#32173;&#25345;&#12375;&#12414;&#12377;&#12290;&#29305;&#23450;&#12398;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12434;&#29305;&#23450;&#12398;&#12469;&#12540;&#12499;&#12473;&#12395;&#21106;&#12426;&#24403;&#12390;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<p>1&#12388;&#12398;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12391;&#35079;&#25968;&#12398;&#12469;&#12540;&#12499;&#12473;&#12395;&#23550;&#24540;&#12391;&#12365;&#12414;&#12377;&#12290;&#12522;&#12463;&#12456;&#12473;&#12488;&#12539;&#12473;&#12524;&#12483;&#12489;&#12399;&#12518;&#12540;&#12470;&#12540;&#12539;&#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#20966;&#29702;&#12375;&#12414;&#12377;&#12290;&#12469;&#12540;&#12496;&#12540;&#12399;&#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#21463;&#12369;&#21462;&#12427;&#12392;&#12289;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12363;&#12425;&#20351;&#29992;&#21487;&#33021;&#12394;&#12473;&#12524;&#12483;&#12489;&#12395;&#12381;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#21106;&#12426;&#24403;&#12390;&#12414;&#12377;&#12290;&#12473;&#12524;&#12483;&#12489;&#12399;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#23455;&#34892;&#12375;&#12289;&#32080;&#26524;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#29694;&#22312;&#12499;&#12472;&#12540;&#29366;&#24907;&#12398;&#12471;&#12473;&#12486;&#12512;&#12539;&#12522;&#12477;&#12540;&#12473;&#12364;&#24517;&#35201;&#12394;&#22580;&#21512;&#12289;&#12473;&#12524;&#12483;&#12489;&#12399;&#12522;&#12477;&#12540;&#12473;&#12364;&#35299;&#25918;&#12373;&#12428;&#12427;&#12398;&#12434;&#24453;&#27231;&#12375;&#12390;&#12363;&#12425;&#12289;&#12522;&#12477;&#12540;&#12473;&#12398;&#20351;&#29992;&#12434;&#12522;&#12463;&#12456;&#12473;&#12488;&#12395;&#35377;&#21487;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12522;&#12463;&#12456;&#12473;&#12488;&#29992;&#12395;&#30906;&#20445;&#12377;&#12427;&#12473;&#12524;&#12483;&#12489;&#12398;&#26368;&#23567;&#25968;&#12392;&#26368;&#22823;&#25968;&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12399;&#12371;&#12428;&#12425;2&#12388;&#12398;&#20516;&#12398;&#38291;&#12391;&#21205;&#30340;&#12395;&#35519;&#25972;&#12373;&#12428;&#12414;&#12377;&#12290;&#12469;&#12540;&#12496;&#12540;&#12399;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#26368;&#23567;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;&#12395;&#24467;&#12387;&#12390;&#12289;&#12522;&#12463;&#12456;&#12473;&#12488;&#29992;&#12395;&#30906;&#20445;&#12377;&#12427;&#12473;&#12524;&#12483;&#12489;&#12434;&#21106;&#12426;&#24403;&#12390;&#12414;&#12377;&#12290;&#12381;&#12398;&#25968;&#12399;&#12289;&#25351;&#23450;&#12373;&#12428;&#12383;&#26368;&#22823;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;&#12414;&#12391;&#22679;&#21152;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<p>&#12503;&#12525;&#12475;&#12473;&#12391;&#20351;&#29992;&#21487;&#33021;&#12394;&#12473;&#12524;&#12483;&#12489;&#12398;&#25968;&#12434;&#22679;&#12420;&#12377;&#12392;&#12289;&#12503;&#12525;&#12475;&#12473;&#12364;&#21516;&#26178;&#12395;&#24540;&#31572;&#12391;&#12365;&#12427;&#12522;&#12463;&#12456;&#12473;&#12488;&#25968;&#12364;&#22810;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
<p>&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12372;&#12392;&#12395;&#12289;&#27425;&#12398;&#24773;&#22577;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;ID</dt>
<dd>
<p>&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12398;&#21517;&#21069;&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;</dt>
<dd>
<p>&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12395;&#21547;&#12414;&#12428;&#12427;&#12473;&#12524;&#12483;&#12489;&#12398;&#26368;&#22823;&#25968;&#12290;</p>
</dd>
<dt>&#26368;&#23567;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;</dt>
<dd>
<p>&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12395;&#21547;&#12414;&#12428;&#12427;&#12473;&#12524;&#12483;&#12489;&#12398;&#26368;&#23567;&#25968;&#12290;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12364;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21270;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;&#12289;&#12371;&#12428;&#12425;&#12398;&#12473;&#12524;&#12483;&#12489;&#12364;&#20316;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#12461;&#12517;&#12540;&#12539;&#12469;&#12452;&#12474;</dt>
<dd>
<p>&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#20966;&#29702;&#12395;&#12473;&#12524;&#12483;&#12489;&#12434;&#20351;&#29992;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12414;&#12391;&#12395;&#12289;&#12461;&#12517;&#12540;&#12395;&#20837;&#12428;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#26368;&#22823;&#25968;&#12290;</p>
</dd>
<dt>&#12450;&#12452;&#12489;&#12523;&#12539;&#12473;&#12524;&#12483;&#12489;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;</dt>
<dd>
<p>&#12450;&#12452;&#12489;&#12523;&#12539;&#12473;&#12524;&#12483;&#12489;&#12434;&#12503;&#12540;&#12523;&#12363;&#12425;&#38500;&#21435;&#12377;&#12427;&#12414;&#12391;&#12398;&#26178;&#38291;(&#31186;&#21336;&#20301;)&#12290;</p>
</dd>
</dl>
<p>&#12300;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12301;&#12398;&#34920;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12418;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#26032;&#35215;</dt>
<dd>
<p>&#26032;&#35215;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
<dt>&#21066;&#38500;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12434;&#21066;&#38500;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
</dl>
<a id="sthref170" name="sthref170"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-threadpoolnew.html">&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-threadpooledit.html">&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-threadpooldelete.html">&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref171" name="sthref171"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00060"><code>create-threadpool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00204"><code>list-threadpools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00111"><code>delete-threadpool</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
