<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-httpserviceprops" name="ref-httpserviceprops"></a><a id="GHWEB00009" name="GHWEB00009"></a></p>

<h4><a id="sthref107" name="sthref107"></a><a id="sthref108" name="sthref108"></a>HTTP&#12469;&#12540;&#12499;&#12473;&#12395;&#22266;&#26377;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>HTTP&#12469;&#12540;&#12499;&#12473;&#12391;&#20351;&#29992;&#12391;&#12365;&#12427;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#27425;&#12398;&#12392;&#12362;&#12426;&#12391;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12377;&#12409;&#12390;&#12398;<a href="ref-group-networklisteners.html">&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;</a>&#12395;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt><code>ssl-cache-entriese</code></dt>
<dd>
<p>&#12461;&#12515;&#12483;&#12471;&#12517;&#12373;&#12428;&#12427;SSL&#12475;&#12483;&#12471;&#12519;&#12531;&#12398;&#25968;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;10,000&#12391;&#12377;&#12290;</p>
</dd>
<dt><code>ssl3-session-timeout</code></dt>
<dd>
<p>SSL3&#12475;&#12483;&#12471;&#12519;&#12531;&#12364;&#12461;&#12515;&#12483;&#12471;&#12517;&#12373;&#12428;&#12427;&#38291;&#38548;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;86,400&#12391;&#12377;&#12290;</p>
</dd>
<dt><code>ssl-session-timeout</code></dt>
<dd>
<p>SSL2&#12475;&#12483;&#12471;&#12519;&#12531;&#12364;&#12461;&#12515;&#12483;&#12471;&#12517;&#12373;&#12428;&#12427;&#38291;&#38548;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;100&#12391;&#12377;&#12290;</p>
</dd>
<dt><code>proxyHandler</code></dt>
<dd>
<p><code>com.sun.appserv.ProxyHandler</code>&#25277;&#35937;&#12463;&#12521;&#12473;&#12398;&#12459;&#12473;&#12479;&#12512;&#23455;&#35013;&#12398;&#23436;&#20840;&#20462;&#39166;&#12463;&#12521;&#12473;&#21517;&#12290;&#12496;&#12483;&#12463;&#12456;&#12531;&#12489;&#12398;GlassFish Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#12289;SSL&#12398;&#32066;&#31471;&#12503;&#12525;&#12461;&#12471;&#12539;&#12469;&#12540;&#12496;&#12540;(&#12383;&#12392;&#12360;&#12400;&#12525;&#12540;&#12489;&#12539;&#12496;&#12521;&#12531;&#12469;)&#12391;&#36974;&#26029;&#12373;&#12428;&#12383;&#20803;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12522;&#12463;&#12456;&#12473;&#12488;&#12395;&#38306;&#12377;&#12427;&#24773;&#22577;&#12434;&#21462;&#24471;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#25277;&#35937;&#12463;&#12521;&#12473;&#12398;&#23455;&#35013;&#12399;&#12289;Enterprise Server&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12408;&#12398;&#20803;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12522;&#12463;&#12456;&#12473;&#12488;&#12395;&#38306;&#12377;&#12427;&#24773;&#22577;&#12434;&#20253;&#36948;&#12377;&#12427;&#12383;&#12417;&#12395;&#12503;&#12525;&#12461;&#12471;&#12539;&#12469;&#12540;&#12496;&#12540;&#12364;&#20351;&#29992;&#12377;&#12427;&#12459;&#12473;&#12479;&#12512;&#12539;&#12522;&#12463;&#12456;&#12473;&#12488;&#12539;&#12504;&#12483;&#12480;&#12540;&#12395;&#23550;&#12375;&#12390;&#34892;&#12431;&#12428;&#12427;&#29305;&#23450;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#35519;&#12409;&#12289;&#12381;&#12398;&#24773;&#22577;&#12434;&#12467;&#12540;&#12523;&#20596;&#12395;&#36820;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#23455;&#35013;&#12391;&#12399;&#12289;<code>Proxy-ip</code>&#12392;&#12356;&#12358;&#21517;&#21069;&#12398;HTTP&#12522;&#12463;&#12456;&#12473;&#12488;&#12539;&#12504;&#12483;&#12480;&#12540;&#12363;&#12425;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;IP&#12450;&#12489;&#12524;&#12473;&#12434;&#12289;<code>Proxy-keysize</code>&#12392;&#12356;&#12358;&#21517;&#21069;&#12398;HTTP&#12522;&#12463;&#12456;&#12473;&#12488;&#12539;&#12504;&#12483;&#12480;&#12540;&#12363;&#12425;SSL&#12461;&#12540;&#12469;&#12452;&#12474;&#12434;&#12289;<code>Proxy-auth-cert</code>&#12392;&#12356;&#12358;&#21517;&#21069;&#12398;HTTP&#12522;&#12463;&#12456;&#12473;&#12488;&#12539;&#12504;&#12483;&#12480;&#12540;&#12363;&#12425;SSL&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#35388;&#26126;&#26360;&#12481;&#12455;&#12540;&#12531;&#12434;&#35501;&#12415;&#21462;&#12426;&#12414;&#12377;&#12290;<code>Proxy-auth-cert</code>&#20516;&#12395;&#12399;&#12289;<code>BEGIN CERTIFICATE</code>&#12362;&#12424;&#12403;<code>END CERTIFICATE</code>&#12398;&#22659;&#30028;&#12364;&#12394;&#12367;&#12289;<code>\n</code>&#12364;<code>% d% a</code>&#12395;&#12424;&#12387;&#12390;&#32622;&#12365;&#25563;&#12360;&#12425;&#12428;&#12383;&#12289;BASE-64&#12391;&#31526;&#21495;&#21270;&#12373;&#12428;&#12383;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#35388;&#26126;&#26360;&#12481;&#12455;&#12540;&#12531;&#12434;&#21547;&#12416;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#35373;&#23450;&#12399;&#12289;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;&#12539;&#12503;&#12525;&#12488;&#12467;&#12523;&#12398;&#12300;HTTP&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;&#35469;&#35388;&#12497;&#12473;&#12539;&#12473;&#12523;&#12540;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12364;true&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt><code>connectionTimeout</code></dt>
<dd>
<p>&#25509;&#32154;&#12398;&#21463;&#20837;&#12428;&#24460;&#12289;&#12522;&#12463;&#12456;&#12473;&#12488;URI&#12398;&#34892;&#12364;&#25552;&#31034;&#12373;&#12428;&#12427;&#12414;&#12391;&#12398;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;&#12398;&#24453;&#27231;&#26178;&#38291;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;(&#31186;&#21336;&#20301;)&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;30&#12391;&#12377;&#12290;</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
