<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-threadpoolnew" name="ref-threadpoolnew"></a></p>

<h4><a id="sthref173" name="sthref173"></a>&#26032;&#35215;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#26032;&#35215;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26032;&#35215;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#27083;&#25104;&#21517;</dt>
<dd>
<p>&#12371;&#12398;&#12506;&#12540;&#12472;&#12398;&#35373;&#23450;&#12364;&#36969;&#29992;&#12373;&#12428;&#12427;&#27083;&#25104;&#12398;&#21517;&#21069;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#21517;&#21069;</dt>
<dd>
<p>&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12398;&#21517;&#21069;&#12290;</p>
</dd>
<dt>&#12463;&#12521;&#12473;&#21517;</dt>
<dd>
<p>&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12434;&#23455;&#35013;&#12377;&#12427;&#12463;&#12521;&#12473;&#12398;&#23436;&#20840;&#20462;&#39166;&#21517;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>com.sun.grizzly.http.StatsThreadPool</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#12461;&#12517;&#12540;&#12539;&#12469;&#12452;&#12474;</dt>
<dd>
<p>&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#20966;&#29702;&#12395;&#12473;&#12524;&#12483;&#12489;&#12434;&#20351;&#29992;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12414;&#12391;&#12395;&#12289;&#12461;&#12517;&#12540;&#12395;&#20837;&#12428;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#26368;&#22823;&#25968;&#12290;-1&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12461;&#12517;&#12540;&#12398;&#12469;&#12452;&#12474;&#12399;&#21046;&#38480;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;4096&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;</dt>
<dd>
<p>&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12395;&#21547;&#12414;&#12428;&#12427;&#12473;&#12524;&#12483;&#12489;&#12398;&#26368;&#22823;&#25968;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;5&#12391;&#12377;&#12290;&#12371;&#12428;&#12399;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;&#12539;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12398;&#25512;&#22888;&#20516;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#26368;&#23567;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;</dt>
<dd>
<p>&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12395;&#21547;&#12414;&#12428;&#12427;&#12473;&#12524;&#12483;&#12489;&#12398;&#26368;&#23567;&#25968;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;2&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12450;&#12452;&#12489;&#12523;&#12539;&#12473;&#12524;&#12483;&#12489;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;</dt>
<dd>
<p>&#12503;&#12540;&#12523;&#12391;&#12473;&#12524;&#12483;&#12489;&#12364;&#12450;&#12452;&#12489;&#12523;&#29366;&#24907;&#12398;&#12414;&#12414;&#12391;&#12356;&#12425;&#12428;&#12427;&#31186;&#21336;&#20301;&#12398;&#26368;&#38263;&#26178;&#38291;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#26178;&#38291;&#12434;&#36942;&#12366;&#12427;&#12392;&#12289;&#12473;&#12524;&#12483;&#12489;&#12399;&#12503;&#12540;&#12523;&#12363;&#12425;&#38500;&#21435;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;900&#12391;&#12377;&#12290;</p>
</dd>
</dl>
<a id="sthref174" name="sthref174"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-threadpoolnew.html">&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-threadpooledit.html">&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-threadpooldelete.html">&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref175" name="sthref175"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00060"><code>create-threadpool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00204"><code>list-threadpools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00111"><code>delete-threadpool</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
