<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-transportnew" name="ref-transportnew"></a><a id="GHWEB00025" name="GHWEB00025"></a></p>

<h4><a id="sthref162" name="sthref162"></a>&#26032;&#35215;&#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#26032;&#35215;&#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#26032;&#35215;&#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#19968;&#33324;&#30340;&#12395;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;<code>tcp</code>&#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;&#12398;&#20182;&#12395;&#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;&#12399;&#24517;&#35201;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;</p>
<p>&#12300;&#26032;&#35215;&#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#27083;&#25104;&#21517;</dt>
<dd>
<p>&#12371;&#12398;&#12506;&#12540;&#12472;&#12398;&#35373;&#23450;&#12364;&#36969;&#29992;&#12373;&#12428;&#12427;&#27083;&#25104;&#12398;&#21517;&#21069;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;&#21517;</dt>
<dd>
<p>&#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;&#12398;&#19968;&#24847;&#12398;&#21517;&#21069;&#12290;</p>
</dd>
<dt>&#12463;&#12521;&#12473;&#21517;</dt>
<dd>
<p>&#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;&#23455;&#35013;&#12398;&#12463;&#12521;&#12473;&#21517;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12289;<code>com.sun.grizzly.TCPSelectorHandler</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#36984;&#25246;&#12461;&#12540;&#12539;&#12495;&#12531;&#12489;&#12521;</dt>
<dd>
<p>&#36984;&#25246;&#12461;&#12540;&#12539;&#12495;&#12531;&#12489;&#12521;&#12398;&#12463;&#12521;&#12473;&#21517;&#12290;&#36984;&#25246;&#12461;&#12540;&#12539;&#12495;&#12531;&#12489;&#12521;&#12399;&#12289;&#36984;&#25246;&#12461;&#12540;&#12398;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12434;&#31649;&#29702;&#12377;&#12427;&#25277;&#35937;&#12463;&#12521;&#12473;&#12391;&#12377;&#12290;&#20516;&#12434;&#25351;&#23450;&#12375;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#23455;&#35013;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12496;&#12452;&#12488;&#12539;&#12496;&#12483;&#12501;&#12449;&#12398;&#12479;&#12452;&#12503;</dt>
<dd>
<p>&#20351;&#29992;&#12377;&#12427;<code>ByteBuffer</code>&#12398;&#12479;&#12452;&#12503;&#12290;&#36984;&#25246;&#21487;&#33021;&#12394;&#20516;&#12399;&#12289;<code>HEAP</code>&#12362;&#12424;&#12403;<code>DIRECT</code>&#12391;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>HEAP</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12450;&#12463;&#12475;&#12503;&#12479;&#12539;&#12473;&#12524;&#12483;&#12489;</dt>
<dd>
<p>&#12510;&#12471;&#12531;&#12398;&#12503;&#12525;&#12475;&#12483;&#12469;&#12398;&#25968;&#12290;-1&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;Grizzly&#12364;&#12510;&#12471;&#12531;&#12398;&#12503;&#12525;&#12475;&#12483;&#12469;&#12398;&#25968;&#12395;&#22522;&#12389;&#12356;&#12390;&#12450;&#12463;&#12475;&#12503;&#12479;&#12539;&#12473;&#12524;&#12483;&#12489;&#12398;&#25968;&#12434;&#35336;&#31639;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;1&#12391;&#12377;&#12290;</p>
<p>&#12522;&#12463;&#12456;&#12473;&#12488;&#20966;&#29702;&#12473;&#12524;&#12483;&#12489;&#12398;&#25968;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;&#12289;&#12371;&#12398;&#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;&#12434;&#20351;&#29992;&#12377;&#12427;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;&#12391;&#20351;&#29992;&#12373;&#12428;&#12427;&#12289;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12398;&#12300;&#26368;&#22823;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;&#12301;&#12398;&#20516;&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#25509;&#32154;&#25968;</dt>
<dd>
<p>&#12371;&#12398;&#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;&#12434;&#20351;&#29992;&#12377;&#12427;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;&#12391;&#20445;&#30041;&#20013;&#12398;&#25509;&#32154;&#12398;&#26368;&#22823;&#25968;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;4096&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12496;&#12483;&#12501;&#12449;&#12539;&#12469;&#12452;&#12474;</dt>
<dd>
<p>&#12371;&#12398;&#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;&#12434;&#20351;&#29992;&#12377;&#12427;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;&#12364;&#20316;&#25104;&#12377;&#12427;&#12289;&#20837;&#21147;&#12473;&#12488;&#12522;&#12540;&#12512;&#29992;&#12398;&#12496;&#12483;&#12501;&#12449;&#12398;&#12469;&#12452;&#12474;(&#12496;&#12452;&#12488;&#21336;&#20301;)&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;8192&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12450;&#12452;&#12489;&#12523;&#12539;&#12461;&#12540;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;</dt>
<dd>
<p>&#12450;&#12452;&#12489;&#12523;&#12539;&#12461;&#12540;&#12364;&#21462;&#12426;&#28040;&#12373;&#12428;&#12289;&#12481;&#12515;&#12493;&#12523;&#12364;&#12463;&#12525;&#12540;&#12474;&#12373;&#12428;&#12427;&#12414;&#12391;&#12398;&#26178;&#38291;(&#31186;&#21336;&#20301;)&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;30&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#35501;&#21462;&#12426;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;</dt>
<dd>
<p>&#35501;&#21462;&#12426;&#25805;&#20316;&#12398;&#12504;&#12483;&#12480;&#12540;&#12392;&#26412;&#25991;&#12398;&#35299;&#26512;&#12501;&#12455;&#12540;&#12474;&#20013;&#12395;GlassFish Server&#12364;&#24453;&#27231;&#12377;&#12427;&#26178;&#38291;(&#12511;&#12522;&#31186;&#21336;&#20301;)&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;30,000&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12475;&#12524;&#12463;&#12479;&#12539;&#12509;&#12540;&#12522;&#12531;&#12464;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;</dt>
<dd>
<p>NIO&#12475;&#12524;&#12463;&#12479;&#12364;&#12452;&#12505;&#12531;&#12488;(&#12518;&#12540;&#12470;&#12540;&#12539;&#12522;&#12463;&#12456;&#12473;&#12488;)&#12398;&#24453;&#27231;&#12434;&#12502;&#12525;&#12483;&#12463;&#12377;&#12427;&#26178;&#38291;(&#12511;&#12522;&#31186;&#21336;&#20301;)&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;1000&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#26360;&#36796;&#12415;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;</dt>
<dd>
<p>&#12524;&#12473;&#12509;&#12531;&#12473;&#12398;&#26360;&#36796;&#12415;&#26178;&#12395;&#12289;&#12522;&#12514;&#12540;&#12488;&#12539;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12364;&#20999;&#26029;&#12373;&#12428;&#12383;&#12392;&#12415;&#12394;&#12373;&#12428;&#12427;&#12414;&#12391;&#12395;GlassFish Server&#12364;&#24453;&#27231;&#12377;&#12427;&#26178;&#38291;(&#12511;&#12522;&#31186;&#21336;&#20301;)&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;30,000&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#34920;&#31034;&#27083;&#25104;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;Grizzly&#12398;&#20869;&#37096;&#27083;&#25104;&#12364;&#12469;&#12540;&#12496;&#12540;&#12539;&#12525;&#12464;&#12395;&#12501;&#12521;&#12483;&#12471;&#12517;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12395;&#12424;&#12426;&#12289;&#12487;&#12496;&#12483;&#12464;&#12395;&#26377;&#21177;&#12394;&#24773;&#22577;&#12364;&#24471;&#12425;&#12428;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12473;&#12492;&#12540;&#12503;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12522;&#12463;&#12456;&#12473;&#12488;&#12392;&#12524;&#12473;&#12509;&#12531;&#12473;&#12398;&#24773;&#22577;&#12364;&#12469;&#12540;&#12496;&#12540;&#12539;&#12525;&#12464;&#12395;&#12480;&#12531;&#12503;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12395;&#12424;&#12426;&#12289;&#12487;&#12496;&#12483;&#12464;&#12395;&#26377;&#21177;&#12394;&#24773;&#22577;&#12434;&#24471;&#12425;&#12428;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12364;&#22823;&#12365;&#12367;&#20302;&#19979;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>TCP&#36933;&#24310;&#12394;&#12375;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;TCP_NODELAY (Nagle&#12398;&#12450;&#12523;&#12468;&#12522;&#12474;&#12512;&#12392;&#12418;&#21628;&#12400;&#12428;&#12427;)&#12364;&#26377;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<a id="sthref163" name="sthref163"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-transportnew.html">&#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-transportedit.html">&#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-transportdelete.html">&#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref164" name="sthref164"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00061"><code>create-transport</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00206"><code>list-transports</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00112"><code>delete-transport</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
