<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-httplistenernew" name="task-httplistenernew"></a></p>

<h4><a id="sthref23" name="sthref23"></a>HTTP&#12522;&#12473;&#12490;&#12540;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12398;&#19979;&#12391;&#12289;&#12300;HTTP&#12469;&#12540;&#12499;&#12473;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12398;&#19979;&#12391;&#12289;&#12300;HTTP&#12522;&#12473;&#12490;&#12540;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;HTTP&#12522;&#12473;&#12490;&#12540;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;HTTP&#12522;&#12473;&#12490;&#12540;&#12301;&#12506;&#12540;&#12472;&#12391;&#12300;&#26032;&#35215;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26032;&#35215;HTTP&#12522;&#12473;&#12490;&#12540;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;HTTP&#12522;&#12473;&#12490;&#12540;&#12398;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>HTTP&#12522;&#12473;&#12490;&#12540;&#21517;&#12398;&#20808;&#38957;&#12395;&#12399;&#25968;&#23383;&#12434;&#20351;&#29992;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p>&#12300;&#12509;&#12540;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;HTTP&#12522;&#12473;&#12490;&#12540;&#12364;&#12522;&#12473;&#12491;&#12531;&#12464;&#12377;&#12427;&#12509;&#12540;&#12488;&#30058;&#21495;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#36969;&#20999;&#12394;&#20516;&#12399;1&#12363;&#12425;65535&#12391;&#12377;&#12290;UNIX&#12471;&#12473;&#12486;&#12512;&#12391;&#12289;&#12509;&#12540;&#12488;1&#12363;&#12425;1024&#12391;&#12522;&#12473;&#12491;&#12531;&#12464;&#12377;&#12427;&#12477;&#12465;&#12483;&#12488;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12473;&#12540;&#12497;&#12540;&#12518;&#12540;&#12470;&#12540;&#27177;&#38480;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12473;&#12486;&#12540;&#12479;&#12473;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;HTTP&#12522;&#12473;&#12490;&#12540;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;&#12522;&#12473;&#12490;&#12540;&#12364;&#28961;&#21177;&#12398;&#22580;&#21512;&#12399;&#12289;&#12522;&#12473;&#12490;&#12540;&#12395;&#25509;&#32154;&#12375;&#12424;&#12358;&#12392;&#12377;&#12427;&#12392;&#12477;&#12465;&#12483;&#12488;&#20363;&#22806;(<code>java.net.ConnectException</code>)&#12364;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12496;&#12540;&#12472;&#12519;&#12531;9.1&#12424;&#12426;&#21069;&#12398;GlassFish Server&#12391;&#12399;&#12289;&#26377;&#21177;&#21270;&#12373;&#12428;&#12383;&#23646;&#24615;&#12364;false&#12395;&#35373;&#23450;&#12373;&#12428;&#12383;&#12522;&#12473;&#12490;&#12540;&#12399;&#12289;&#36865;&#20449;&#12373;&#12428;&#12383;&#12522;&#12463;&#12456;&#12473;&#12488;&#12395;&#23550;&#12375;&#12390;404&#12524;&#12473;&#12509;&#12531;&#12473;&#12539;&#12467;&#12540;&#12489;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;&#29694;&#22312;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398;GlassFish Server&#12391;&#12371;&#12398;&#21205;&#20316;&#12434;&#34892;&#12358;&#12395;&#12399;&#12289;&#12522;&#12473;&#12490;&#12540;&#12398;&#12473;&#12486;&#12540;&#12479;&#12473;&#12434;&#26377;&#21177;&#12395;&#35373;&#23450;&#12375;&#12289;&#38306;&#36899;&#12377;&#12427;&#21508;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12398;&#29366;&#24907;&#12434;&#12458;&#12501;&#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12398;&#12300;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12395;&#12399;&#12289;&#38306;&#36899;&#12377;&#12427;&#12522;&#12473;&#12490;&#12540;&#12364;&#19968;&#35239;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;(HTTP&#12522;&#12473;&#12490;&#12540;&#12399;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;&#12539;&#12479;&#12452;&#12503;&#12391;&#12377;)&#12290;</p>
</li>
<li>
<p>&#12300;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;HTTP&#12522;&#12473;&#12490;&#12540;&#12391;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
<p><code>server-config</code>&#27083;&#25104;&#12434;&#20351;&#29992;&#12377;&#12427;&#12489;&#12513;&#12452;&#12531;&#31649;&#29702;&#12469;&#12540;&#12496;&#12540;(DAS)&#12395;&#23550;&#12375;&#12390;<code>admin-listener</code>&#12434;&#27083;&#25104;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;&#12371;&#12398;&#12522;&#12473;&#12490;&#12540;&#12395;&#23550;&#12375;&#12390;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#20445;&#35703;&#12373;&#12428;&#12383;&#31649;&#29702;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;<a href="../../../common/en/help/ref-securityadmin.html">Secure Administration</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
<li>
<p>&#12300;JK&#12522;&#12473;&#12490;&#12540;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#12522;&#12473;&#12490;&#12540;&#12364;Apache&#12398;<code>mod-jk</code>&#12503;&#12525;&#12488;&#12467;&#12523;&#12434;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427;&#12371;&#12392;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p><code>mod-jk</code>&#12503;&#12525;&#12488;&#12467;&#12523;&#12399;&#12289;Apache&#12398;<code>httpd</code>(Web&#12469;&#12540;&#12496;&#12540;)&#12392;GlassFish Server&#12398;&#12496;&#12483;&#12463;&#12456;&#12531;&#12489;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#38291;&#12391;&#20351;&#29992;&#12373;&#12428;&#12427;&#12289;&#23554;&#29992;&#12398;&#36890;&#20449;/&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12398;&#12503;&#12525;&#12488;&#12467;&#12523;&#12391;&#12377;&#12290;&#12522;&#12473;&#12490;&#12540;&#12364;&#12371;&#12398;&#12503;&#12525;&#12488;&#12467;&#12523;&#12434;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427;&#22580;&#21512;&#12289;<code>httpd</code>&#12399;&#12377;&#12409;&#12390;&#12398;&#38745;&#30340;&#12394;&#12467;&#12531;&#12486;&#12531;&#12484;&#12434;&#20966;&#29702;&#12377;&#12427;&#12392;&#24819;&#23450;&#12373;&#12428;&#12289;&#21205;&#30340;&#12394;&#12522;&#12477;&#12540;&#12473;(&#12469;&#12540;&#12502;&#12524;&#12483;&#12488;&#12362;&#12424;&#12403;JSP)&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12399;&#12289;<code>mod-jk</code>&#12395;&#23550;&#24540;&#12377;&#12427;GlassFish Server&#12398;HTTP&#12522;&#12473;&#12490;&#12540;&#12395;<code>mod-jk</code>&#12503;&#12525;&#12488;&#12467;&#12523;&#12434;&#20351;&#29992;&#12375;&#12390;&#12523;&#12540;&#12486;&#12451;&#12531;&#12464;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12450;&#12489;&#12524;&#12473;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;HTTP&#12522;&#12473;&#12490;&#12540;&#12364;&#12522;&#12473;&#12491;&#12531;&#12464;&#12377;&#12427;IP&#12450;&#12489;&#12524;&#12473;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12450;&#12489;&#12524;&#12473;&#12399;&#12489;&#12483;&#12488;&#21306;&#20999;&#12426;&#12363;IPv6&#12398;&#34920;&#35352;&#27861;&#12391;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12377;&#12409;&#12390;&#12398;IP&#12450;&#12489;&#12524;&#12473;&#12391;&#12522;&#12473;&#12491;&#12531;&#12464;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;<code>any</code>(<code>INADDR_ANY</code>)&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;&#12507;&#12473;&#12488;&#21517;&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#12371;&#12398;HTTP&#12522;&#12473;&#12490;&#12540;&#12395;&#38306;&#36899;&#20184;&#12369;&#12427;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12434;&#23450;&#32681;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;HTTP&#12522;&#12473;&#12490;&#12540;&#12395;&#38306;&#36899;&#20184;&#12369;&#12427;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#36890;&#24120;&#12399;&#12289;GlassFish Server&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#26178;&#12395;&#27083;&#25104;&#12373;&#12428;&#12427;2&#12388;&#12398;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12398;&#12356;&#12378;&#12428;&#12363;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12469;&#12540;&#12496;&#12540;&#21517;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12469;&#12540;&#12496;&#12540;&#12364;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12395;&#36865;&#20449;&#12377;&#12427;URL&#12391;&#20351;&#29992;&#12373;&#12428;&#12427;&#12507;&#12473;&#12488;&#21517;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12469;&#12540;&#12496;&#12540;&#12364;&#12456;&#12452;&#12522;&#12450;&#12473;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12371;&#12398;&#21517;&#21069;&#12399;&#12456;&#12452;&#12522;&#12450;&#12473;&#12391;&#12377;&#12290;&#12469;&#12540;&#12496;&#12540;&#12364;&#12456;&#12452;&#12522;&#12450;&#12473;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#31354;&#12398;&#12414;&#12414;&#27531;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#20516;&#12399;&#12289;&#12469;&#12540;&#12496;&#12540;&#12364;&#33258;&#21205;&#30340;&#12395;&#29983;&#25104;&#12377;&#12427;URL&#12395;&#12399;&#24433;&#38911;&#12375;&#12414;&#12377;&#12364;&#12289;&#12469;&#12540;&#12496;&#12540;&#12395;&#26684;&#32013;&#12373;&#12428;&#12390;&#12356;&#12427;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12420;&#12501;&#12449;&#12452;&#12523;&#12398;URL&#12395;&#12399;&#24433;&#38911;&#12375;&#12414;&#12379;&#12435;&#12290;&#12469;&#12540;&#12496;&#12540;&#12364;&#12456;&#12452;&#12522;&#12450;&#12473;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12469;&#12540;&#12496;&#12540;&#21517;&#12434;&#12456;&#12452;&#12522;&#12450;&#12473;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12467;&#12525;&#12531;&#12392;&#12509;&#12540;&#12488;&#30058;&#21495;&#12434;&#20184;&#21152;&#12377;&#12427;&#12392;&#12289;&#12469;&#12540;&#12496;&#12540;&#12399;&#25351;&#23450;&#12375;&#12383;&#12509;&#12540;&#12488;&#12434;&#20351;&#29992;&#12375;&#12390;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12395;URL&#12434;&#36865;&#20449;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;OK&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref24" name="sthref24"></a>
<h5>&#27425;&#12398;&#12473;&#12486;&#12483;&#12503;</h5>
<p>HTTP&#12522;&#12473;&#12490;&#12540;&#12398;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12392;&#12289;&#12300;SSL&#12301;&#12479;&#12502;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;HTTP&#12522;&#12473;&#12490;&#12540;&#12398;SSL&#35373;&#23450;&#12434;&#32232;&#38598;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<p>HTTP&#12522;&#12473;&#12490;&#12540;&#12399;&#12289;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;&#12398;1&#12388;&#12398;&#12479;&#12452;&#12503;&#12391;&#12377;&#12290;&#39640;&#24230;&#12394;&#27231;&#33021;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12390;HTTP&#12522;&#12473;&#12490;&#12540;&#12434;&#32232;&#38598;&#12375;&#12414;&#12377;&#12290;</p>
<a id="sthref25" name="sthref25"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-httplisteneredit.html">HTTP&#12522;&#12473;&#12490;&#12540;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-httplistenerdelete.html">HTTP&#12522;&#12473;&#12490;&#12540;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-httplistenerssl.html">HTTP&#12522;&#12473;&#12490;&#12540;&#12398;SSL&#35373;&#23450;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-virtualservercreate.html">&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-networklistenernew.html">&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">&#12503;&#12525;&#12488;&#12467;&#12523;&#12398;HTTP&#35373;&#23450;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
