<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-webcontaineravailability" name="task-webcontaineravailability"></a></p>

<h4><a id="sthref16" name="sthref16"></a><a id="sthref17" name="sthref17"></a><a id="sthref18" name="sthref18"></a><a id="sthref19" name="sthref19"></a>Web&#12467;&#12531;&#12486;&#12490;&#12398;&#21487;&#29992;&#24615;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#22793;&#26356;&#12377;&#12427;&#27083;&#25104;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#27083;&#25104;&#12398;&#12494;&#12540;&#12489;&#12391;&#12289;&#12300;&#21487;&#29992;&#24615;&#12469;&#12540;&#12499;&#12473;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#21487;&#29992;&#24615;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#21487;&#29992;&#24615;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;Web&#12467;&#12531;&#12486;&#12490;&#12398;&#21487;&#29992;&#24615;&#12301;&#12479;&#12502;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;Web&#12467;&#12531;&#12486;&#12490;&#12398;&#21487;&#29992;&#24615;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#21487;&#29992;&#24615;&#12469;&#12540;&#12499;&#12473;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12391;&#12300;&#26377;&#21177;&#12301;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;Web&#12467;&#12531;&#12486;&#12490;&#12398;&#21487;&#29992;&#24615;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#21487;&#29992;&#24615;&#12434;&#28961;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#21487;&#29992;&#24615;&#12469;&#12540;&#12499;&#12473;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12508;&#12483;&#12463;&#12473;&#12398;&#36984;&#25246;&#12434;&#35299;&#38500;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#27704;&#32154;&#24615;&#12398;&#12479;&#12452;&#12503;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#27704;&#32154;&#24615;&#12513;&#12459;&#12491;&#12474;&#12512;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#12300;&#21487;&#29992;&#24615;&#12469;&#12540;&#12499;&#12473;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12434;<i>&#36984;&#25246;&#12375;&#12394;&#12356;</i>&#22580;&#21512;&#12399;&#12289;&#27425;&#12398;&#12356;&#12378;&#12428;&#12363;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#12475;&#12483;&#12471;&#12519;&#12531;&#27704;&#32154;&#24615;&#12394;&#12375;&#12398;&#22580;&#21512;&#12399;&#12300;<code>memory</code>&#12301;</p>
</li>
<li>
<p>&#39640;&#21487;&#29992;&#12391;&#12399;&#12394;&#12356;&#12501;&#12449;&#12452;&#12523;&#12539;&#12471;&#12473;&#12486;&#12512;&#12395;&#22522;&#12389;&#12356;&#12383;&#12475;&#12483;&#12471;&#12519;&#12531;&#27704;&#32154;&#24615;&#12398;&#22580;&#21512;&#12399;&#12300;<code>file</code>&#12301;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#21487;&#29992;&#24615;&#12469;&#12540;&#12499;&#12473;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12434;&#36984;&#25246;&#12375;&#12383;&#22580;&#21512;&#12399;&#12289;&#39640;&#21487;&#29992;&#12398;&#12463;&#12521;&#12473;&#12479;&#12539;&#12501;&#12455;&#12452;&#12523;&#12458;&#12540;&#12496;&#12540;&#12395;&#22522;&#12389;&#12356;&#12383;&#12475;&#12483;&#12471;&#12519;&#12531;&#27704;&#32154;&#24615;&#12398;&#12300;<code>replicated</code>&#12301;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#27704;&#32154;&#24615;&#12398;&#38971;&#24230;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;HTTP&#12475;&#12483;&#12471;&#12519;&#12531;&#12398;&#20445;&#23384;&#38971;&#24230;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p><code>web-method</code> - &#12475;&#12483;&#12471;&#12519;&#12531;&#29366;&#24907;&#12399;&#12289;&#21508;Web&#12522;&#12463;&#12456;&#12473;&#12488;&#12398;&#32066;&#20102;&#26178;&#12395;&#12289;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12395;&#12524;&#12473;&#12509;&#12531;&#12473;&#12434;&#36820;&#20449;&#12377;&#12427;&#21069;&#12395;&#26684;&#32013;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12514;&#12540;&#12489;&#12391;&#12399;&#12289;&#38556;&#23475;&#30330;&#29983;&#26178;&#12395;&#12475;&#12483;&#12471;&#12519;&#12531;&#29366;&#24907;&#12434;&#23436;&#20840;&#12395;&#26356;&#26032;&#12377;&#12427;&#12383;&#12417;&#12398;&#26368;&#33391;&#12398;&#20445;&#35388;&#12364;&#24471;&#12425;&#12428;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12377;&#12290;</p>
</li>
</ul>
<p>&#12300;&#27704;&#32154;&#24615;&#12398;&#38971;&#24230;&#12301;&#12399;&#12289;&#12300;&#27704;&#32154;&#24615;&#12398;&#12479;&#12452;&#12503;&#12301;&#12364;&#12300;<code>replicated</code>&#12301;&#12398;&#22580;&#21512;&#12395;&#12398;&#12415;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#27704;&#32154;&#24615;&#12398;&#31684;&#22258;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12391;&#12289;&#20445;&#23384;&#12434;&#34892;&#12358;&#12383;&#12417;&#12395;&#24517;&#35201;&#12394;HTTP&#12475;&#12483;&#12471;&#12519;&#12531;&#22793;&#26356;&#12398;&#31684;&#22258;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p><code>session</code> - &#24120;&#12395;&#12377;&#12409;&#12390;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#29366;&#24907;&#12364;&#26684;&#32013;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12514;&#12540;&#12489;&#12391;&#12399;&#12289;&#12475;&#12483;&#12471;&#12519;&#12531;&#12539;&#12487;&#12540;&#12479;&#12434;&#20998;&#25955;&#21487;&#33021;&#12394;Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#27491;&#12375;&#12367;&#26684;&#32013;&#12377;&#12427;&#12383;&#12417;&#12398;&#26368;&#33391;&#12398;&#20445;&#35388;&#12364;&#24471;&#12425;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p><code>modified-session</code> - &#12475;&#12483;&#12471;&#12519;&#12531;&#29366;&#24907;&#12364;&#22793;&#26356;&#12373;&#12428;&#12383;&#22580;&#21512;&#12289;&#12377;&#12409;&#12390;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#29366;&#24907;&#12364;&#26684;&#32013;&#12373;&#12428;&#12414;&#12377;&#12290;<code>HttpSession.setAttribute()</code>&#12414;&#12383;&#12399;<code>HttpSession.removeAttribute()</code>&#12364;&#12467;&#12540;&#12523;&#12373;&#12428;&#12383;&#22580;&#21512;&#12395;&#12289;&#12475;&#12483;&#12471;&#12519;&#12531;&#12364;&#22793;&#26356;&#12373;&#12428;&#12383;&#12392;&#12415;&#12394;&#12375;&#12414;&#12377;&#12290;&#23646;&#24615;&#12364;&#22793;&#26356;&#12373;&#12428;&#12427;&#12383;&#12403;&#12395;&#12289;&#24517;&#12378;<code>setAttribute()</code>&#12434;&#12467;&#12540;&#12523;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;Java EE&#20181;&#27096;&#12398;&#35201;&#20214;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;&#12371;&#12398;&#12514;&#12540;&#12489;&#12434;&#27491;&#12375;&#12367;&#21205;&#20316;&#12373;&#12379;&#12427;&#12383;&#12417;&#12395;&#24517;&#35201;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p><code>modified-attribute</code> - &#22793;&#26356;&#12373;&#12428;&#12383;&#12475;&#12483;&#12471;&#12519;&#12531;&#23646;&#24615;&#12398;&#12415;&#12364;&#26684;&#32013;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12514;&#12540;&#12489;&#12434;&#27491;&#12375;&#12367;&#21205;&#20316;&#12373;&#12379;&#12427;&#12395;&#12399;&#12289;&#27425;&#12398;&#12460;&#12452;&#12489;&#12521;&#12452;&#12531;&#12395;&#24467;&#12358;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#12475;&#12483;&#12471;&#12519;&#12531;&#29366;&#24907;&#12364;&#22793;&#26356;&#12373;&#12428;&#12427;&#12383;&#12403;&#12395;&#12289;<code>setAttribute()</code>&#12434;&#12467;&#12540;&#12523;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#23646;&#24615;&#38291;&#12391;&#30456;&#20114;&#21442;&#29031;&#12375;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;&#21029;&#20491;&#12398;&#21508;&#23646;&#24615;&#12461;&#12540;&#12395;&#12354;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12539;&#12464;&#12521;&#12501;&#12434;&#12471;&#12522;&#12450;&#12521;&#12452;&#12474;&#12375;&#12289;&#21029;&#12293;&#12395;&#26684;&#32013;&#12375;&#12414;&#12377;&#12290;&#21029;&#20491;&#12398;&#21508;&#12461;&#12540;&#12395;&#12354;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#38291;&#12395;&#30456;&#20114;&#21442;&#29031;&#12364;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;&#27491;&#24120;&#12394;&#12471;&#12522;&#12450;&#12521;&#12452;&#12474;&#12362;&#12424;&#12403;&#12487;&#12471;&#12522;&#12450;&#12521;&#12452;&#12474;&#12399;&#34892;&#12431;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p>&#35079;&#25968;&#12398;&#23646;&#24615;&#38291;&#12289;&#12414;&#12383;&#12399;&#23569;&#12394;&#12367;&#12392;&#12418;&#35501;&#21462;&#12426;&#23554;&#29992;&#23646;&#24615;&#12392;&#22793;&#26356;&#21487;&#33021;&#12394;&#23646;&#24615;&#38291;&#12391;&#12475;&#12483;&#12471;&#12519;&#12531;&#29366;&#24907;&#12434;&#20998;&#25955;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
</ul>
<p>&#12300;&#27704;&#32154;&#24615;&#12398;&#31684;&#22258;&#12301;&#12399;&#12289;&#12300;&#27704;&#32154;&#24615;&#12398;&#12479;&#12452;&#12503;&#12301;&#12364;&#12300;<code>replicated</code>&#12301;&#12398;&#22580;&#21512;&#12395;&#12398;&#12415;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12471;&#12531;&#12464;&#12523;&#12539;&#12469;&#12452;&#12531;&#12458;&#12531;&#29366;&#24907;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12391;&#12300;&#26377;&#21177;&#12301;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#12501;&#12455;&#12452;&#12523;&#12458;&#12540;&#12496;&#12540;&#12391;&#12471;&#12531;&#12464;&#12523;&#12539;&#12469;&#12452;&#12531;&#12458;&#12531;&#29366;&#24907;&#12434;&#20351;&#29992;&#21487;&#33021;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12501;&#12455;&#12452;&#12523;&#12458;&#12540;&#12496;&#12540;&#12391;&#12471;&#12531;&#12464;&#12523;&#12539;&#12469;&#12452;&#12531;&#12458;&#12531;&#29366;&#24907;&#12434;&#28961;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12471;&#12531;&#12464;&#12523;&#12539;&#12469;&#12452;&#12531;&#12458;&#12531;&#29366;&#24907;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12508;&#12483;&#12463;&#12473;&#12398;&#36984;&#25246;&#12434;&#35299;&#38500;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12377;&#12409;&#12390;&#12398;&#35373;&#23450;&#12398;&#20516;&#12434;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12395;&#25147;&#12377;&#12395;&#12399;&#12289;&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12489;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#12289;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>GlassFish Server&#12399;Web&#12467;&#12531;&#12486;&#12490;&#12398;&#21487;&#29992;&#24615;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#23450;&#32681;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
<ul>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#34920;&#31034;&#12373;&#12428;&#12427;&#31354;&#30333;&#34892;&#12391;&#12289;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#21517;&#12434;&#20837;&#21147;&#12375;&#12289;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;&#12289;&#12381;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#32232;&#38598;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;&#12289;&#21066;&#38500;&#12377;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12398;&#24038;&#20596;&#12395;&#12354;&#12427;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21066;&#38500;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref20" name="sthref20"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-webcontainergeneral.html">Web&#12467;&#12531;&#12486;&#12490;&#12398;&#19968;&#33324;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-webcontainersessiontimeout.html">Web&#12467;&#12531;&#12486;&#12490;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-webcontainermanagerprops.html">Web&#12467;&#12531;&#12486;&#12490;&#12398;&#12510;&#12493;&#12540;&#12472;&#12515;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-webcontainerstoreprops.html">Web&#12467;&#12531;&#12486;&#12490;&#12398;&#12473;&#12488;&#12450;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
