<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-protocolnew" name="task-protocolnew"></a></p>

<h4><a id="sthref50" name="sthref50"></a>&#12503;&#12525;&#12488;&#12467;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12398;&#19979;&#12391;&#12289;&#12300;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12398;&#19979;&#12391;&#12289;&#12300;&#12503;&#12525;&#12488;&#12467;&#12523;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12503;&#12525;&#12488;&#12467;&#12523;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12503;&#12525;&#12488;&#12467;&#12523;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;&#26032;&#35215;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26032;&#35215;&#12503;&#12525;&#12488;&#12467;&#12523;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12503;&#12525;&#12488;&#12467;&#12523;&#12398;&#19968;&#24847;&#12398;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#12503;&#12525;&#12488;&#12467;&#12523;&#12395;&#23550;&#12375;&#12390;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12392;&#12289;&#12300;&#12503;&#12525;&#12488;&#12467;&#12523;&#12434;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12398;&#12300;SSL&#12301;&#12479;&#12502;&#12434;&#20351;&#29992;&#12375;&#12390;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#35373;&#23450;&#12434;&#22793;&#26356;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12473;&#12486;&#12540;&#12479;&#12473;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#12501;&#12449;&#12452;&#12523;&#12539;&#12461;&#12515;&#12483;&#12471;&#12517;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26368;&#22823;&#26377;&#21177;&#26399;&#38291;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#26377;&#21177;&#12394;&#12461;&#12515;&#12483;&#12471;&#12517;&#12539;&#12456;&#12531;&#12488;&#12522;&#12398;&#26368;&#22823;&#26377;&#21177;&#26399;&#38291;&#12434;&#31186;&#21336;&#20301;&#12391;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12399;&#12289;&#12501;&#12449;&#12452;&#12523;&#12434;&#12461;&#12515;&#12483;&#12471;&#12517;&#12395;&#26360;&#12365;&#36796;&#12435;&#12384;&#24460;&#12395;&#12289;&#12461;&#12515;&#12483;&#12471;&#12517;&#12395;&#26360;&#12365;&#36796;&#12435;&#12384;&#24773;&#22577;&#12434;&#20351;&#29992;&#12377;&#12427;&#26399;&#38291;&#12434;&#21046;&#24481;&#12375;&#12414;&#12377;&#12290;&#26368;&#38263;&#26377;&#21177;&#26399;&#38291;&#12424;&#12426;&#21476;&#12356;&#12456;&#12531;&#12488;&#12522;&#12399;&#12289;&#21516;&#12376;&#12501;&#12449;&#12452;&#12523;&#12398;&#26032;&#12375;&#12356;&#12456;&#12531;&#12488;&#12522;&#12395;&#32622;&#12365;&#25563;&#12360;&#12425;&#12428;&#12414;&#12377;&#12290;&#20869;&#23481;&#12398;&#22793;&#26356;&#12364;&#38971;&#32321;&#12391;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12371;&#12398;&#20516;&#12434;&#22823;&#12365;&#12367;&#12377;&#12427;&#12392;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12364;&#21521;&#19978;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#26368;&#36969;&#12394;&#26368;&#38263;&#26377;&#21177;&#26399;&#38291;&#12399;&#12289;&#26082;&#23384;&#12398;&#12501;&#12449;&#12452;&#12523;&#12364;&#23450;&#26399;&#30340;&#12395;&#22793;&#26356;&#12373;&#12428;&#12427;&#12363;&#12393;&#12358;&#12363;&#12395;&#20381;&#23384;&#12375;&#12414;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#12501;&#12449;&#12452;&#12523;&#12364;1&#26085;&#12395;4&#22238;&#19968;&#23450;&#38291;&#38548;&#12391;&#22793;&#26356;&#12373;&#12428;&#12427;&#22580;&#21512;&#12399;&#12289;&#26368;&#38263;&#26377;&#21177;&#26399;&#38291;&#12434;21600&#31186;(6&#26178;&#38291;)&#12395;&#35373;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;&#12381;&#12358;&#12391;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#26368;&#38263;&#26377;&#21177;&#26399;&#38291;&#12434;&#12289;&#12501;&#12449;&#12452;&#12523;&#12398;&#22793;&#26356;&#24460;&#12395;&#20869;&#23481;&#12364;&#21069;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#25552;&#20379;&#12377;&#12427;&#26368;&#38263;&#12398;&#26178;&#38291;&#12395;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12434;&#32771;&#24942;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;30&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26368;&#22823;&#12461;&#12515;&#12483;&#12471;&#12517;&#12539;&#12469;&#12452;&#12474;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12487;&#12451;&#12473;&#12463;&#19978;&#12398;&#12501;&#12449;&#12452;&#12523;&#12539;&#12461;&#12515;&#12483;&#12471;&#12517;&#12398;&#26368;&#22823;&#21512;&#35336;&#12469;&#12452;&#12474;(&#12496;&#12452;&#12488;&#21336;&#20301;)&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;10485760&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26368;&#22823;&#12501;&#12449;&#12452;&#12523;&#25968;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12501;&#12449;&#12452;&#12523;&#12539;&#12461;&#12515;&#12483;&#12471;&#12517;&#12395;&#26684;&#32013;&#21487;&#33021;&#12394;&#12501;&#12449;&#12452;&#12523;&#12398;&#26368;&#22823;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#20516;&#12364;&#22823;&#12365;&#12377;&#12366;&#12427;&#12392;&#12289;&#12469;&#12540;&#12496;&#12540;&#12399;&#12411;&#12392;&#12435;&#12393;&#24517;&#35201;&#12398;&#12394;&#12356;&#12501;&#12449;&#12452;&#12523;&#12418;&#12461;&#12515;&#12483;&#12471;&#12517;&#12395;&#26360;&#12365;&#36796;&#12416;&#12383;&#12417;&#12289;&#12513;&#12514;&#12522;&#12540;&#12398;&#28010;&#36027;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#20516;&#12364;&#23567;&#12373;&#12377;&#12366;&#12427;&#12392;&#12289;&#12461;&#12515;&#12483;&#12471;&#12517;&#12398;&#21033;&#28857;&#12364;&#22833;&#12431;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#23646;&#24615;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#27096;&#12293;&#12394;&#20516;&#12434;&#35430;&#12375;&#12390;&#12415;&#12390;&#12289;&#29305;&#23450;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#26368;&#36969;&#12394;&#20516;&#12434;&#35211;&#12388;&#12369;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;1024&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12469;&#12540;&#12496;&#12540;&#21517;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12469;&#12540;&#12496;&#12540;&#12364;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12395;&#36865;&#20449;&#12377;&#12427;URL&#12391;&#20351;&#29992;&#12373;&#12428;&#12427;&#12507;&#12473;&#12488;&#21517;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12469;&#12540;&#12496;&#12540;&#12364;&#12456;&#12452;&#12522;&#12450;&#12473;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12371;&#12398;&#21517;&#21069;&#12399;&#12456;&#12452;&#12522;&#12450;&#12473;&#12391;&#12377;&#12290;&#12469;&#12540;&#12496;&#12540;&#12364;&#12456;&#12452;&#12522;&#12450;&#12473;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#31354;&#12398;&#12414;&#12414;&#27531;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#20516;&#12399;&#12289;&#12469;&#12540;&#12496;&#12540;&#12364;&#33258;&#21205;&#30340;&#12395;&#29983;&#25104;&#12377;&#12427;URL&#12395;&#12399;&#24433;&#38911;&#12375;&#12414;&#12377;&#12364;&#12289;&#12469;&#12540;&#12496;&#12540;&#12395;&#26684;&#32013;&#12373;&#12428;&#12390;&#12356;&#12427;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12420;&#12501;&#12449;&#12452;&#12523;&#12398;URL&#12395;&#12399;&#24433;&#38911;&#12375;&#12414;&#12379;&#12435;&#12290;&#12469;&#12540;&#12496;&#12540;&#12364;&#12456;&#12452;&#12522;&#12450;&#12473;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12469;&#12540;&#12496;&#12540;&#21517;&#12434;&#12456;&#12452;&#12522;&#12450;&#12473;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12467;&#12525;&#12531;&#12392;&#12509;&#12540;&#12488;&#30058;&#21495;&#12434;&#20184;&#21152;&#12377;&#12427;&#12392;&#12289;&#12469;&#12540;&#12496;&#12540;&#12399;&#25351;&#23450;&#12375;&#12383;&#12509;&#12540;&#12488;&#12434;&#20351;&#29992;&#12375;&#12390;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12395;URL&#12434;&#36865;&#20449;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#12503;&#12525;&#12488;&#12467;&#12523;&#12395;&#38306;&#36899;&#20184;&#12369;&#12427;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12434;&#23450;&#32681;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;&#12539;&#12509;&#12540;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#21029;&#12398;&#12509;&#12540;&#12488;&#12395;&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;&#12377;&#12427;&#12383;&#12417;&#12395;&#20351;&#29992;&#12377;&#12427;&#12509;&#12540;&#12488;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>GlassFish Server&#12399;&#12289;&#27425;&#12398;2&#12388;&#12398;&#26465;&#20214;&#12364;&#23384;&#22312;&#12377;&#12427;&#22580;&#21512;&#12289;&#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#33258;&#21205;&#30340;&#12395;&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;&#12375;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#12371;&#12398;&#12503;&#12525;&#12488;&#12467;&#12523;&#12434;&#21442;&#29031;&#12377;&#12427;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;&#12399;&#12289;&#38750;SSL&#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#19968;&#33268;&#12375;&#12383;&#12475;&#12461;&#12517;&#12522;&#12486;&#12451;&#21046;&#32004;&#12364;SSL&#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;&#12434;&#24517;&#35201;&#12392;&#12377;&#12427;&#12522;&#12463;&#12456;&#12473;&#12488;&#12364;&#21463;&#20449;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
</ul>
<p>&#12522;&#12480;&#12452;&#12524;&#12463;&#12488;&#12539;&#12509;&#12540;&#12488;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;GlassFish Server&#12399;&#20803;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12391;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12383;&#12509;&#12540;&#12488;&#30058;&#21495;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12509;&#12540;&#12488;&#12399;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p>&#12300;&#26368;&#22823;&#25509;&#32154;&#25968;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12469;&#12540;&#12496;&#12540;&#12364;&#25509;&#32154;&#12434;&#12463;&#12525;&#12540;&#12474;&#12377;&#12427;&#12414;&#12391;&#12395;&#12497;&#12452;&#12503;&#12521;&#12452;&#12531;&#21270;&#12391;&#12365;&#12427;&#12522;&#12463;&#12456;&#12473;&#12488;&#12398;&#26368;&#22823;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12461;&#12540;&#12503;&#12450;&#12521;&#12452;&#12502;&#12539;&#12469;&#12502;&#12471;&#12473;&#12486;&#12512;&#12399;&#23450;&#26399;&#30340;&#12395;&#12450;&#12452;&#12489;&#12523;&#25509;&#32154;&#12434;&#12509;&#12540;&#12522;&#12531;&#12464;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;256&#12391;&#12377;&#12290;</p>
<p>HTTP/1.0&#12461;&#12540;&#12503;&#12450;&#12521;&#12452;&#12502;&#12289;HTTP/1.1&#12461;&#12540;&#12503;&#12450;&#12521;&#12452;&#12502;&#12289;&#12362;&#12424;&#12403;&#12497;&#12452;&#12503;&#12521;&#12452;&#12531;&#12434;&#28961;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;1&#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;0&#12434;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#12522;&#12463;&#12456;&#12473;&#12488;&#12399;&#24120;&#12395;&#25298;&#21542;&#12373;&#12428;&#12414;&#12377;&#12290;-1&#12434;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#12461;&#12540;&#12503;&#12450;&#12521;&#12452;&#12502;&#25509;&#32154;&#12398;&#25968;&#12399;&#21046;&#38480;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p>&#12300;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#25509;&#32154;&#12434;&#12450;&#12452;&#12489;&#12523;&#12392;&#12415;&#12394;&#12375;&#12390;&#12461;&#12540;&#12503;&#12450;&#12521;&#12452;&#12502;&#29366;&#24907;&#12434;&#20445;&#25345;&#12391;&#12365;&#12427;&#26368;&#22823;&#26178;&#38291;&#12434;&#31186;&#21336;&#20301;&#12391;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>0&#20197;&#19979;&#12398;&#20516;&#12434;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#12461;&#12540;&#12503;&#12450;&#12521;&#12452;&#12502;&#25509;&#32154;&#12399;&#38283;&#12356;&#12383;&#12414;&#12414;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;30&#31186;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12450;&#12483;&#12503;&#12525;&#12540;&#12489;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#20302;&#36895;&#12391;&#35501;&#21462;&#12426;&#12434;&#34892;&#12358;&#12469;&#12540;&#12502;&#12524;&#12483;&#12488;&#12398;&#25509;&#32154;&#12434;&#12289;&#12300;&#25509;&#32154;&#12450;&#12483;&#12503;&#12525;&#12540;&#12489;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12301;&#12398;&#21046;&#38480;&#12395;&#36948;&#12375;&#12383;&#24460;&#12395;&#12463;&#12525;&#12540;&#12474;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#28961;&#21177;&#12398;&#22580;&#21512;&#12289;&#12469;&#12540;&#12502;&#12524;&#12483;&#12488;&#12398;&#25509;&#32154;&#12399;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12375;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#25509;&#32154;&#12450;&#12483;&#12503;&#12525;&#12540;&#12489;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12450;&#12483;&#12503;&#12525;&#12540;&#12489;&#12398;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12434;&#12511;&#12522;&#31186;&#21336;&#20301;&#12391;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#12289;&#12300;&#12450;&#12483;&#12503;&#12525;&#12540;&#12489;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12364;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;300000&#12511;&#12522;&#31186;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12522;&#12463;&#12456;&#12473;&#12488;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12522;&#12463;&#12456;&#12473;&#12488;&#12364;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12373;&#12428;&#12427;&#12414;&#12391;&#12398;&#26178;&#38291;&#12434;&#31186;&#21336;&#20301;&#12391;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#20516;&#12395;&#36948;&#12377;&#12427;&#12414;&#12391;&#12395;&#12522;&#12463;&#12456;&#12473;&#12488;&#12364;&#20966;&#29702;&#12373;&#12428;&#12394;&#12356;&#22580;&#21512;&#12289;&#12522;&#12463;&#12456;&#12473;&#12488;&#12399;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;30&#31186;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#36865;&#20449;&#12496;&#12483;&#12501;&#12449;&#12539;&#12469;&#12452;&#12474;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#36865;&#20449;&#12496;&#12483;&#12501;&#12449;&#12398;&#12469;&#12452;&#12474;&#12434;&#12496;&#12452;&#12488;&#21336;&#20301;&#12391;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;8192&#12496;&#12452;&#12488;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12504;&#12483;&#12480;&#12540;&#12539;&#12496;&#12483;&#12501;&#12449;&#38263;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12522;&#12463;&#12456;&#12473;&#12488;&#20966;&#29702;&#12473;&#12524;&#12483;&#12489;&#12364;&#12522;&#12463;&#12456;&#12473;&#12488;&#12539;&#12487;&#12540;&#12479;&#12398;&#35501;&#21462;&#12426;&#12395;&#20351;&#29992;&#12377;&#12427;&#12496;&#12483;&#12501;&#12449;&#12398;&#12469;&#12452;&#12474;&#12434;&#12496;&#12452;&#12488;&#21336;&#20301;&#12391;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;8192&#12496;&#12452;&#12488;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26368;&#22823;&#12509;&#12473;&#12488;&#12469;&#12452;&#12474;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;POST&#12450;&#12463;&#12471;&#12519;&#12531;&#12398;&#26368;&#22823;&#12469;&#12452;&#12474;&#12434;&#12496;&#12452;&#12488;&#21336;&#20301;&#12391;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;2097152&#12496;&#12452;&#12488;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;URI&#12456;&#12531;&#12467;&#12540;&#12487;&#12451;&#12531;&#12464;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#21463;&#20449;&#12375;&#12383;&#12522;&#12463;&#12456;&#12473;&#12488;URI&#12398;&#12487;&#12467;&#12540;&#12489;&#12395;&#20351;&#29992;&#12377;&#12427;&#25991;&#23383;&#12475;&#12483;&#12488;&#12398;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#26377;&#21177;&#12394;IANA&#25991;&#23383;&#12475;&#12483;&#12488;&#21517;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;UTF-8&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12496;&#12540;&#12472;&#12519;&#12531;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#20351;&#29992;&#12377;&#12427;HTTP&#12503;&#12525;&#12488;&#12467;&#12523;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;HTTP/1.1&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#22311;&#32302;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;HTTP/1.1 GZIP&#22311;&#32302;&#12398;&#20351;&#29992;&#12434;&#36984;&#25246;&#12375;&#12390;&#12469;&#12540;&#12496;&#12540;&#24111;&#22495;&#24133;&#12434;&#31680;&#32004;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#36984;&#25246;&#21487;&#33021;&#12394;&#20516;&#12399;&#27425;&#12398;&#12392;&#12362;&#12426;&#12391;&#12377;:</p>
<dl>
<dt><code>on</code></dt>
<dd>
<p>&#12487;&#12540;&#12479;&#12434;&#22311;&#32302;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt><code>off</code></dt>
<dd>
<p>&#22311;&#32302;&#12434;&#28961;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt><code>force</code></dt>
<dd>
<p>&#12356;&#12388;&#12391;&#12418;&#24375;&#21046;&#30340;&#12395;&#12487;&#12540;&#12479;&#22311;&#32302;&#12434;&#34892;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12300;<code>off</code>&#12301;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#22311;&#32302;&#21487;&#33021;&#12394;MIME&#12479;&#12452;&#12503;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;HTTP&#22311;&#32302;&#12434;&#20351;&#29992;&#12377;&#12427;MIME&#12479;&#12452;&#12503;&#12434;&#12459;&#12531;&#12510;&#21306;&#20999;&#12426;&#12522;&#12473;&#12488;&#12391;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12289;<code>text/html,text/xml,text/plain</code>&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#22311;&#32302;&#12398;&#26368;&#23567;&#12469;&#12452;&#12474;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#22311;&#32302;&#12434;&#36969;&#29992;&#12377;&#12427;&#12501;&#12449;&#12452;&#12523;&#12398;&#26368;&#23567;&#12469;&#12452;&#12474;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#22311;&#32302;&#12434;&#12300;<code>on</code>&#12301;&#12414;&#12383;&#12399;&#12300;<code>force</code>&#12301;&#12395;&#35373;&#23450;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12371;&#12398;&#20516;&#12434;&#35373;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;2048&#12496;&#12452;&#12488;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#22311;&#32302;&#12434;&#20351;&#29992;&#12375;&#12394;&#12356;&#12518;&#12540;&#12470;&#12540;&#12539;&#12456;&#12540;&#12472;&#12455;&#12531;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#22311;&#32302;&#12434;&#20351;&#29992;&#12375;&#12394;&#12356;HTTP&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#12518;&#12540;&#12470;&#12540;&#12539;&#12456;&#12540;&#12472;&#12455;&#12531;&#12488;&#12395;&#19968;&#33268;&#12377;&#12427;&#27491;&#35215;&#34920;&#29694;&#12434;&#12289;&#12459;&#12531;&#12510;&#21306;&#20999;&#12426;&#12522;&#12473;&#12488;&#12391;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12371;&#12398;&#20516;&#12399;&#31354;&#12398;&#25991;&#23383;&#21015;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#21046;&#38480;&#12373;&#12428;&#12383;&#12518;&#12540;&#12470;&#12540;&#12539;&#12456;&#12540;&#12472;&#12455;&#12531;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;HTTP&#22311;&#32302;&#36969;&#29992;&#23550;&#35937;&#12398;&#21046;&#38480;&#12373;&#12428;&#12383;&#12518;&#12540;&#12470;&#12540;&#12539;&#12456;&#12540;&#12472;&#12455;&#12531;&#12488;&#12398;&#12522;&#12473;&#12488;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12518;&#12540;&#12470;&#12540;&#12539;&#12456;&#12540;&#12472;&#12455;&#12531;&#12488;&#12434;&#25351;&#23450;&#12375;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#12518;&#12540;&#12470;&#12540;&#12539;&#12456;&#12540;&#12472;&#12455;&#12531;&#12488;&#12395;HTTP&#22311;&#32302;&#12364;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12518;&#12540;&#12470;&#12540;&#12539;&#12456;&#12540;&#12472;&#12455;&#12531;&#12488;&#12399;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p>&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12524;&#12473;&#12509;&#12531;&#12473;&#12539;&#12479;&#12452;&#12503;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12524;&#12473;&#12509;&#12531;&#12473;&#12539;&#12479;&#12452;&#12503;&#12434;&#25351;&#23450;&#12377;&#12427;&#25991;&#23383;&#21015;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#24418;&#24335;&#12399;&#12289;&#12467;&#12531;&#12486;&#12531;&#12484;&#12539;&#12479;&#12452;&#12503;&#12289;&#12456;&#12531;&#12467;&#12540;&#12487;&#12451;&#12531;&#12464;&#12289;&#35328;&#35486;&#12289;&#12362;&#12424;&#12403;&#25991;&#23383;&#12475;&#12483;&#12488;&#12391;&#27083;&#25104;&#12373;&#12428;&#12427;&#12289;&#12475;&#12511;&#12467;&#12525;&#12531;&#12391;&#21306;&#20999;&#12425;&#12428;&#12383;&#25991;&#23383;&#21015;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12289;<code>text/html; charset=iso-8859-1</code>&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#24375;&#21046;&#12524;&#12473;&#12509;&#12531;&#12473;&#12539;&#12479;&#12452;&#12503;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12501;&#12449;&#12452;&#12523;&#25313;&#24373;&#23376;&#12395;&#19968;&#33268;&#12377;&#12427;MIME&#12510;&#12483;&#12500;&#12531;&#12464;&#12364;&#12394;&#12356;&#22580;&#21512;&#12395;&#20351;&#29992;&#12373;&#12428;&#12427;&#12522;&#12463;&#12456;&#12473;&#12488;&#12539;&#12479;&#12452;&#12503;&#12434;&#25351;&#23450;&#12377;&#12427;&#25991;&#23383;&#21015;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#24418;&#24335;&#12399;&#12289;&#12467;&#12531;&#12486;&#12531;&#12484;&#12539;&#12479;&#12452;&#12503;&#12289;&#12456;&#12531;&#12467;&#12540;&#12487;&#12451;&#12531;&#12464;&#12289;&#35328;&#35486;&#12289;&#12362;&#12424;&#12403;&#25991;&#23383;&#12475;&#12483;&#12488;&#12391;&#27083;&#25104;&#12373;&#12428;&#12427;&#12289;&#12475;&#12511;&#12467;&#12525;&#12531;&#12391;&#21306;&#20999;&#12425;&#12428;&#12383;&#25991;&#23383;&#21015;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12289;<code>text/html; charset=iso-8859-1</code>&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12450;&#12480;&#12503;&#12479;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#38745;&#30340;&#12394;&#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12398;&#12463;&#12521;&#12473;&#21517;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12289;<code>com.sun.grizzly.tcp.StaticResourcesAdapter</code>&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;Comet&#12469;&#12509;&#12540;&#12488;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#12371;&#12398;&#12503;&#12525;&#12488;&#12467;&#12523;&#12434;&#21442;&#29031;&#12377;&#12427;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;&#12398;Comet&#12469;&#12509;&#12540;&#12488;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#28961;&#21177;&#12391;&#12377;&#12290;&#12469;&#12540;&#12502;&#12524;&#12483;&#12488;&#12414;&#12383;&#12399;JSP&#12506;&#12540;&#12472;&#12391;Comet&#12486;&#12463;&#12494;&#12525;&#12472;&#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;GlassFish Server&#12398;&#36215;&#21205;&#26178;&#12395;<code>load-on-startup</code>&#35201;&#32032;&#12434;<code>web.xml</code>&#12501;&#12449;&#12452;&#12523;&#12395;&#36861;&#21152;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12387;&#12390;&#21021;&#26399;&#21270;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;&#20363;:</p>
<pre>
&lt;servlet&gt;
&lt;servlet-name&gt;CheckIn&lt;/servlet-name&gt;
&lt;servlet-class&gt;CheckInServlet&lt;/servlet-class&gt;
&lt;load-on-startup&gt;0&lt;/load-on-startup&gt;
&lt;/servlet&gt;
</pre></li>
<li>
<p>&#12300;DNS&#12523;&#12483;&#12463;&#12450;&#12483;&#12503;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;DNS&#12523;&#12483;&#12463;&#12450;&#12483;&#12503;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;RCM&#12469;&#12509;&#12540;&#12488;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;Resource Configuration Management (RCM)&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12488;&#12524;&#12540;&#12473;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;TRACE&#25805;&#20316;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#28961;&#21177;&#12395;&#12377;&#12427;&#12392;&#12289;GlassFish Server&#12399;&#12463;&#12525;&#12473;&#12469;&#12452;&#12488;&#12539;&#12473;&#12463;&#12522;&#12503;&#12488;&#25915;&#25731;&#12398;&#24433;&#38911;&#12434;&#21463;&#12369;&#12395;&#12367;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#35469;&#35388;&#12497;&#12473;&#12539;&#12473;&#12523;&#12540;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#12371;&#12398;&#12503;&#12525;&#12488;&#12467;&#12523;&#12434;&#20351;&#29992;&#12377;&#12427;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;&#12364;SSL&#12398;&#32066;&#31471;&#12503;&#12525;&#12461;&#12471;&#12539;&#12469;&#12540;&#12496;&#12540;&#12363;&#12425;&#12488;&#12521;&#12501;&#12451;&#12483;&#12463;&#12434;&#21463;&#20449;&#12377;&#12427;&#12371;&#12392;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12481;&#12515;&#12531;&#12463;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;HTTP&#12524;&#12473;&#12509;&#12531;&#12473;&#12398;&#12481;&#12515;&#12531;&#12463;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;XPowered By&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;Java Servlet 3.0&#12362;&#12424;&#12403;Java Servlet Pages 2.0&#20181;&#27096;&#12395;&#24467;&#12387;&#12390;<code>X-Powered-By</code>&#12504;&#12483;&#12480;&#12540;&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12434;&#12289;GlassFish Server&#12395;&#36890;&#30693;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref51" name="sthref51"></a>
<h5>&#27425;&#12398;&#12473;&#12486;&#12483;&#12503;</h5>
<p>&#12503;&#12525;&#12488;&#12467;&#12523;&#12434;&#20316;&#25104;&#12375;&#12383;&#24460;&#12399;&#12289;&#12381;&#12398;&#12503;&#12525;&#12488;&#12467;&#12523;&#12434;&#20351;&#29992;&#12377;&#12427;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;&#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<a id="sthref52" name="sthref52"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-networklistenernew.html">&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-networklisteneredit.html">&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-networklistenerdelete.html">&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">&#12503;&#12525;&#12488;&#12467;&#12523;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">&#12503;&#12525;&#12488;&#12467;&#12523;&#12398;SSL&#35373;&#23450;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">&#12503;&#12525;&#12488;&#12467;&#12523;&#12398;HTTP&#35373;&#23450;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-protocolfilecacheedit.html">&#12503;&#12525;&#12488;&#12467;&#12523;&#12398;&#12501;&#12449;&#12452;&#12523;&#12539;&#12461;&#12515;&#12483;&#12471;&#12517;&#35373;&#23450;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">&#12503;&#12525;&#12488;&#12467;&#12523;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-transportnew.html">&#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-transportedit.html">&#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-transportdelete.html">&#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
