<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-virtualservercreate" name="task-virtualservercreate"></a><a id="GHWEB00036" name="GHWEB00036"></a></p>

<h4><a id="sthref34" name="sthref34"></a>&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#22793;&#26356;&#12377;&#12427;&#27083;&#25104;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12398;&#19979;&#12391;&#12289;&#12300;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12301;&#12506;&#12540;&#12472;&#12391;&#12300;&#26032;&#35215;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26032;&#35215;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;ID&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12434;&#20869;&#37096;&#30340;&#12395;&#35672;&#21029;&#12377;&#12427;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#20516;&#12399;HTTP&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12395;&#20844;&#38283;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;HTTP&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#20596;&#12395;&#34920;&#31034;&#12377;&#12427;&#12507;&#12473;&#12488;&#21517;&#12399;&#12289;&#12300;&#12507;&#12473;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12507;&#12473;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12469;&#12540;&#12496;&#12540;&#12364;&#31292;&#20685;&#12377;&#12427;&#12510;&#12471;&#12531;&#12398;&#12507;&#12473;&#12488;&#21517;&#12414;&#12383;&#12399;IP&#12450;&#12489;&#12524;&#12473;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12398;DNS&#12469;&#12540;&#12496;&#12540;(UNIX&#12471;&#12473;&#12486;&#12512;&#12391;&#12399;<code>/etc/hosts</code>&#12501;&#12449;&#12452;&#12523;)&#12395;&#30331;&#37682;&#12373;&#12428;&#12390;&#12356;&#12427;&#12289;&#23455;&#38555;&#12398;&#12507;&#12473;&#12488;&#21517;&#12414;&#12383;&#12399;&#20206;&#24819;&#12507;&#12473;&#12488;&#21517;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12289;&#12471;&#12473;&#12486;&#12512;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12398;<code>${com.sun.aas.hostName}</code>&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#26032;&#35215;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12398;&#12300;&#29366;&#24907;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12398;&#29366;&#24907;&#12399;&#12289;&#12300;&#12458;&#12531;&#12301;(&#12450;&#12463;&#12486;&#12451;&#12502;)&#12289;&#12300;&#12458;&#12501;&#12301;&#12289;&#12414;&#12383;&#12399;&#12300;&#28961;&#21177;&#12301;&#12398;&#12356;&#12378;&#12428;&#12363;&#12391;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12300;&#12458;&#12531;&#12301;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#26032;&#35215;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12398;&#12300;SSO&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12399;HTTP&#12469;&#12540;&#12499;&#12473;&#12398;&#12471;&#12531;&#12464;&#12523;&#12539;&#12469;&#12452;&#12531;&#12458;&#12531;(SSO)&#35373;&#23450;&#12434;&#32153;&#25215;&#12375;&#12414;&#12377;&#12290;&#12300;&#26377;&#21177;&#12301;&#12414;&#12383;&#12399;&#12300;&#28961;&#21177;&#12301;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;HTTP&#12469;&#12540;&#12499;&#12473;&#35373;&#23450;&#12364;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12373;&#12428;&#12289;&#12371;&#12398;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12391;&#12471;&#12531;&#12464;&#12523;&#12539;&#12469;&#12452;&#12531;&#12458;&#12531;&#12364;&#26377;&#21177;&#12414;&#12383;&#12399;&#28961;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
<p>GlassFish Server&#19978;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#38291;&#12391;&#12398;&#12471;&#12531;&#12464;&#12523;&#12539;&#12469;&#12452;&#12531;&#12458;&#12531;&#12399;&#12289;&#12469;&#12540;&#12502;&#12524;&#12483;&#12488;&#12392;JSP&#12501;&#12449;&#12452;&#12523;&#12395;&#12424;&#12387;&#12390;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#27231;&#33021;&#12395;&#12424;&#12426;&#12289;&#35079;&#25968;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#21516;&#19968;&#12398;&#12469;&#12452;&#12531;&#12458;&#12531;&#24773;&#22577;&#12434;&#20849;&#26377;&#12391;&#12365;&#12427;&#12383;&#12417;&#12289;&#12518;&#12540;&#12470;&#12540;&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12372;&#12392;&#12395;&#12469;&#12452;&#12531;&#12458;&#12531;&#12377;&#12427;&#24517;&#35201;&#12364;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;&#12434;&#36984;&#25246;&#12377;&#12427;&#12363;&#12289;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#31354;&#12398;&#12414;&#12414;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;Web&#12514;&#12472;&#12517;&#12540;&#12523;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12395;&#12487;&#12503;&#12525;&#12452;&#12373;&#12428;&#12390;&#12356;&#12427;&#12381;&#12398;&#20182;&#12398;Web&#12514;&#12472;&#12517;&#12540;&#12523;&#12395;&#12510;&#12483;&#12500;&#12531;&#12464;&#12391;&#12365;&#12394;&#12356;&#12377;&#12409;&#12390;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12395;&#24540;&#31572;&#12377;&#12427;&#12514;&#12472;&#12517;&#12540;&#12523;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;Web&#12514;&#12472;&#12517;&#12540;&#12523;&#12364;&#25351;&#23450;&#12373;&#12428;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12523;&#12540;&#12488;&#12364;&#31354;&#12398;Web&#12514;&#12472;&#12517;&#12540;&#12523;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12523;&#12540;&#12488;&#12364;&#31354;&#12398;Web&#12514;&#12472;&#12517;&#12540;&#12523;&#12364;&#23384;&#22312;&#12375;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12471;&#12473;&#12486;&#12512;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;Web&#12514;&#12472;&#12517;&#12540;&#12523;&#12364;&#20316;&#25104;&#12373;&#12428;&#12289;&#12371;&#12428;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12371;&#12398;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12363;&#12425;&#12398;&#12525;&#12462;&#12531;&#12464;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#35352;&#37682;&#12373;&#12428;&#12427;&#12501;&#12449;&#12452;&#12523;&#12398;&#12497;&#12473;&#21517;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12289;&#12525;&#12462;&#12531;&#12464;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12469;&#12540;&#12496;&#12540;&#12539;&#12525;&#12464;domain-dir<code>/logs/server.log</code>&#12395;&#36865;&#20449;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;docroot&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12469;&#12540;&#12496;&#12540;&#12398;&#12523;&#12540;&#12488;&#12539;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12408;&#12398;&#32118;&#23550;&#12497;&#12473;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#31354;&#30333;&#12398;&#12414;&#12414;&#12395;&#12377;&#12427;&#12392;&#12289;domain-dir<code>/docroot</code>&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12450;&#12463;&#12475;&#12473;&#12539;&#12525;&#12462;&#12531;&#12464;&#12301;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#12450;&#12463;&#12475;&#12473;&#12539;&#12525;&#12462;&#12531;&#12464;&#12434;&#26377;&#21177;&#12414;&#12383;&#12399;&#28961;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12414;&#12383;&#12399;&#12289;&#12450;&#12463;&#12475;&#12473;&#12539;&#12525;&#12462;&#12531;&#12464;&#12364;HTTP&#12469;&#12540;&#12499;&#12473;&#12363;&#12425;&#32153;&#25215;&#12373;&#12428;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;HTTP&#12469;&#12540;&#12499;&#12473;&#12363;&#12425;&#32153;&#25215;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12469;&#12540;&#12496;&#12540;&#12539;&#12450;&#12463;&#12475;&#12473;&#12539;&#12525;&#12464;&#12408;&#12398;&#32118;&#23550;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12539;&#12497;&#12473;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;domain-dir<code>/logs/access</code>&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#12289;&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#20351;&#29992;&#21487;&#33021;&#12394;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#35443;&#32048;&#12399;&#12289;<a href="ref-virtualserverprops.html">&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12395;&#22266;&#26377;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#34920;&#31034;&#12373;&#12428;&#12427;&#31354;&#30333;&#34892;&#12391;&#12289;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#21517;&#12434;&#20837;&#21147;&#12375;&#12289;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;OK&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref35" name="sthref35"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-virtualserveredit.html">&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-virtualserverdelete.html">&#20206;&#24819;&#12469;&#12540;&#12496;&#12540;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
