<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-threadpoolnew" name="task-threadpoolnew"></a></p>

<h4><a id="sthref73" name="sthref73"></a>&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12399;&#12289;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;&#12392;ORB&#12395;&#12424;&#12387;&#12390;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#19968;&#33324;&#30340;&#12395;&#12289;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;&#12399;GlassFish Server&#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#26178;&#12395;&#20316;&#25104;&#12373;&#12428;&#12427;2&#12388;&#12398;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12398;&#12356;&#12378;&#12428;&#12363;&#19968;&#26041;&#12434;&#20351;&#29992;&#12375;&#12289;ORB&#12364;&#12418;&#12358;&#19968;&#26041;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12420;&#12495;&#12540;&#12489;&#12454;&#12455;&#12450;&#12539;&#12471;&#12473;&#12486;&#12512;&#12395;&#36969;&#20999;&#12394;&#35373;&#23450;&#12392;&#12394;&#12427;&#12424;&#12358;&#12395;&#12289;&#12371;&#12428;&#12425;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12434;&#32232;&#38598;&#12375;&#12383;&#12426;&#12289;&#12371;&#12428;&#12425;&#12398;&#35373;&#23450;&#12391;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12434;&#20316;&#25104;&#12375;&#12390;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12398;&#19979;&#12391;&#12289;&#12300;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;&#26032;&#35215;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26032;&#35215;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12398;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12463;&#12521;&#12473;&#21517;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12434;&#23455;&#35013;&#12377;&#12427;&#12463;&#12521;&#12473;&#12398;&#23436;&#20840;&#20462;&#39166;&#21517;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>com.sun.grizzly.http.StatsThreadPool</code>&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26368;&#22823;&#12461;&#12517;&#12540;&#12539;&#12469;&#12452;&#12474;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#20966;&#29702;&#12395;&#12473;&#12524;&#12483;&#12489;&#12434;&#20351;&#29992;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#12414;&#12391;&#12395;&#12289;&#12461;&#12517;&#12540;&#12395;&#20837;&#12428;&#12425;&#12428;&#12427;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#26368;&#22823;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>-1&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12461;&#12517;&#12540;&#12398;&#12469;&#12452;&#12474;&#12399;&#21046;&#38480;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;4096&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26368;&#22823;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12395;&#23384;&#22312;&#12391;&#12365;&#12427;&#12473;&#12524;&#12483;&#12489;&#12398;&#26368;&#22823;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;5&#12391;&#12377;&#12290;&#12371;&#12428;&#12399;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;&#12539;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12398;&#25512;&#22888;&#20516;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26368;&#23567;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12395;&#23384;&#22312;&#12391;&#12365;&#12427;&#12473;&#12524;&#12483;&#12489;&#12398;&#26368;&#23567;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12364;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21270;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;&#12289;&#12371;&#12428;&#12425;&#12398;&#12473;&#12524;&#12483;&#12489;&#12364;&#20316;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;2&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12450;&#12452;&#12489;&#12523;&#12539;&#12473;&#12524;&#12483;&#12489;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12473;&#12524;&#12483;&#12489;&#12364;&#12503;&#12540;&#12523;&#20869;&#12395;&#12450;&#12452;&#12489;&#12523;&#29366;&#24907;&#12391;&#27531;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#26368;&#22823;&#26178;&#38291;&#12434;&#31186;&#21336;&#20301;&#12391;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#26178;&#38291;&#12434;&#36942;&#12366;&#12427;&#12392;&#12289;&#12473;&#12524;&#12483;&#12489;&#12399;&#12503;&#12540;&#12523;&#12363;&#12425;&#38500;&#21435;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;900&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;OK&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref74" name="sthref74"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-threadpooledit.html">&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-threadpooldelete.html">&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
