<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-protocolfilecacheedit" name="task-protocolfilecacheedit"></a></p>

<h4><a id="sthref62" name="sthref62"></a><a id="sthref63" name="sthref63"></a>&#12503;&#12525;&#12488;&#12467;&#12523;&#12398;&#12501;&#12449;&#12452;&#12523;&#12539;&#12461;&#12515;&#12483;&#12471;&#12517;&#35373;&#23450;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12398;&#19979;&#12391;&#12289;&#12300;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12398;&#19979;&#12391;&#12289;&#12300;&#12503;&#12525;&#12488;&#12467;&#12523;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12503;&#12525;&#12488;&#12467;&#12523;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12503;&#12525;&#12488;&#12467;&#12523;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#32232;&#38598;&#12377;&#12427;&#12503;&#12525;&#12488;&#12467;&#12523;&#12398;&#21517;&#21069;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12503;&#12525;&#12488;&#12467;&#12523;&#12398;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12503;&#12525;&#12488;&#12467;&#12523;&#12398;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;&#12501;&#12449;&#12452;&#12523;&#12539;&#12461;&#12515;&#12483;&#12471;&#12517;&#12301;&#12479;&#12502;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12501;&#12449;&#12452;&#12523;&#12539;&#12461;&#12515;&#12483;&#12471;&#12517;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12473;&#12486;&#12540;&#12479;&#12473;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#12501;&#12449;&#12452;&#12523;&#12539;&#12461;&#12515;&#12483;&#12471;&#12517;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26368;&#22823;&#26377;&#21177;&#26399;&#38291;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#26377;&#21177;&#12394;&#12461;&#12515;&#12483;&#12471;&#12517;&#12539;&#12456;&#12531;&#12488;&#12522;&#12398;&#26368;&#22823;&#26377;&#21177;&#26399;&#38291;&#12434;&#31186;&#21336;&#20301;&#12391;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12399;&#12289;&#12501;&#12449;&#12452;&#12523;&#12434;&#12461;&#12515;&#12483;&#12471;&#12517;&#12395;&#26360;&#12365;&#36796;&#12435;&#12384;&#24460;&#12395;&#12289;&#12461;&#12515;&#12483;&#12471;&#12517;&#12395;&#26360;&#12365;&#36796;&#12435;&#12384;&#24773;&#22577;&#12434;&#20351;&#29992;&#12377;&#12427;&#26399;&#38291;&#12434;&#21046;&#24481;&#12375;&#12414;&#12377;&#12290;&#26368;&#38263;&#26377;&#21177;&#26399;&#38291;&#12424;&#12426;&#21476;&#12356;&#12456;&#12531;&#12488;&#12522;&#12399;&#12289;&#21516;&#12376;&#12501;&#12449;&#12452;&#12523;&#12398;&#26032;&#12375;&#12356;&#12456;&#12531;&#12488;&#12522;&#12395;&#32622;&#12365;&#25563;&#12360;&#12425;&#12428;&#12414;&#12377;&#12290;&#20869;&#23481;&#12398;&#22793;&#26356;&#12364;&#38971;&#32321;&#12391;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12371;&#12398;&#20516;&#12434;&#22823;&#12365;&#12367;&#12377;&#12427;&#12392;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12364;&#21521;&#19978;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#26368;&#36969;&#12394;&#26368;&#38263;&#26377;&#21177;&#26399;&#38291;&#12399;&#12289;&#26082;&#23384;&#12398;&#12501;&#12449;&#12452;&#12523;&#12364;&#23450;&#26399;&#30340;&#12395;&#22793;&#26356;&#12373;&#12428;&#12427;&#12363;&#12393;&#12358;&#12363;&#12395;&#20381;&#23384;&#12375;&#12414;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#12501;&#12449;&#12452;&#12523;&#12364;1&#26085;&#12395;4&#22238;&#19968;&#23450;&#38291;&#38548;&#12391;&#22793;&#26356;&#12373;&#12428;&#12427;&#22580;&#21512;&#12399;&#12289;&#26368;&#38263;&#26377;&#21177;&#26399;&#38291;&#12434;21600&#31186;(6&#26178;&#38291;)&#12395;&#35373;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;&#12381;&#12358;&#12391;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#26368;&#38263;&#26377;&#21177;&#26399;&#38291;&#12434;&#12289;&#12501;&#12449;&#12452;&#12523;&#12398;&#22793;&#26356;&#24460;&#12395;&#20869;&#23481;&#12364;&#21069;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12398;&#12501;&#12449;&#12452;&#12523;&#12434;&#25552;&#20379;&#12377;&#12427;&#26368;&#38263;&#12398;&#26178;&#38291;&#12395;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12434;&#32771;&#24942;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;30&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26368;&#22823;&#12461;&#12515;&#12483;&#12471;&#12517;&#12539;&#12469;&#12452;&#12474;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12487;&#12451;&#12473;&#12463;&#19978;&#12398;&#12501;&#12449;&#12452;&#12523;&#12539;&#12461;&#12515;&#12483;&#12471;&#12517;&#12398;&#26368;&#22823;&#21512;&#35336;&#12469;&#12452;&#12474;(&#12496;&#12452;&#12488;&#21336;&#20301;)&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;10485760&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26368;&#22823;&#12501;&#12449;&#12452;&#12523;&#25968;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12501;&#12449;&#12452;&#12523;&#12539;&#12461;&#12515;&#12483;&#12471;&#12517;&#12395;&#26684;&#32013;&#21487;&#33021;&#12394;&#12501;&#12449;&#12452;&#12523;&#12398;&#26368;&#22823;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#20516;&#12364;&#22823;&#12365;&#12377;&#12366;&#12427;&#12392;&#12289;&#12469;&#12540;&#12496;&#12540;&#12399;&#12411;&#12392;&#12435;&#12393;&#24517;&#35201;&#12398;&#12394;&#12356;&#12501;&#12449;&#12452;&#12523;&#12418;&#12461;&#12515;&#12483;&#12471;&#12517;&#12395;&#26360;&#12365;&#36796;&#12416;&#12383;&#12417;&#12289;&#12513;&#12514;&#12522;&#12540;&#12398;&#28010;&#36027;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#20516;&#12364;&#23567;&#12373;&#12377;&#12366;&#12427;&#12392;&#12289;&#12461;&#12515;&#12483;&#12471;&#12517;&#12398;&#21033;&#28857;&#12364;&#22833;&#12431;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#23646;&#24615;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#27096;&#12293;&#12394;&#20516;&#12434;&#35430;&#12375;&#12390;&#12415;&#12390;&#12289;&#29305;&#23450;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#26368;&#36969;&#12394;&#20516;&#12434;&#35211;&#12388;&#12369;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;1024&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#12498;&#12531;&#12488;:</b></p>
&#12487;&#12501;&#12457;&#12523;&#12488;&#35373;&#23450;&#12395;&#36820;&#12377;&#12395;&#12399;&#12289;&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12489;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12289;&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;<br />
<hr>

</li>
</ol>
<a id="sthref64" name="sthref64"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-networklistenernew.html">&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-networklisteneredit.html">&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-networklistenerdelete.html">&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#12539;&#12522;&#12473;&#12490;&#12540;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-protocolnew.html">&#12503;&#12525;&#12488;&#12467;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">&#12503;&#12525;&#12488;&#12467;&#12523;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">&#12503;&#12525;&#12488;&#12467;&#12523;&#12398;SSL&#35373;&#23450;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">&#12503;&#12525;&#12488;&#12467;&#12523;&#12398;HTTP&#35373;&#23450;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">&#12503;&#12525;&#12488;&#12467;&#12523;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-transportnew.html">&#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-transportedit.html">&#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-transportdelete.html">&#12488;&#12521;&#12531;&#12473;&#12509;&#12540;&#12488;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
