<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-webcontainermanagerprops" name="task-webcontainermanagerprops"></a></p>

<h4><a id="sthref8" name="sthref8"></a><a id="sthref9" name="sthref9"></a><a id="sthref10" name="sthref10"></a>Web&#12467;&#12531;&#12486;&#12490;&#12398;&#12510;&#12493;&#12540;&#12472;&#12515;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12475;&#12483;&#12471;&#12519;&#12531;&#12539;&#12510;&#12493;&#12540;&#12472;&#12515;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12475;&#12483;&#12471;&#12519;&#12531;&#12434;&#20316;&#25104;&#12362;&#12424;&#12403;&#30772;&#26820;&#12377;&#12427;&#26041;&#27861;&#12289;&#12475;&#12483;&#12471;&#12519;&#12531;&#29366;&#24907;&#12434;&#26684;&#32013;&#12377;&#12427;&#22580;&#25152;&#12289;&#12362;&#12424;&#12403;&#20351;&#29992;&#21487;&#33021;&#12394;&#12475;&#12483;&#12471;&#12519;&#12531;&#12398;&#26368;&#22823;&#25968;&#12434;&#27083;&#25104;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#22793;&#26356;&#12377;&#12427;&#27083;&#25104;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#27083;&#25104;&#12398;&#12494;&#12540;&#12489;&#12391;&#12289;&#12300;Web&#12467;&#12531;&#12486;&#12490;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#19968;&#33324;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#19968;&#33324;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;&#12510;&#12493;&#12540;&#12472;&#12515;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12479;&#12502;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12510;&#12493;&#12540;&#12472;&#12515;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#21462;&#24471;&#38291;&#38548;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#38750;&#12450;&#12463;&#12486;&#12451;&#12502;&#12394;&#12475;&#12483;&#12471;&#12519;&#12531;&#12539;&#12487;&#12540;&#12479;&#12364;&#12473;&#12488;&#12450;&#12363;&#12425;&#21066;&#38500;&#12373;&#12428;&#12427;&#12414;&#12391;&#12398;&#26178;&#38291;&#12434;&#31186;&#21336;&#20301;&#12391;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;60&#12391;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#20516;&#12399;&#12289;&#12475;&#12483;&#12471;&#12519;&#12531;&#12539;&#12487;&#12540;&#12479;&#12364;&#22793;&#26356;&#12373;&#12428;&#12427;&#38971;&#24230;&#12424;&#12426;&#23567;&#12373;&#12356;&#20516;&#12395;&#35373;&#23450;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#12498;&#12483;&#12488;&#38971;&#24230;&#12398;&#39640;&#12356;Web&#12469;&#12452;&#12488;&#12398;&#12498;&#12483;&#12488;&#12539;&#12459;&#12454;&#12531;&#12479;&#12539;&#12469;&#12540;&#12502;&#12524;&#12483;&#12488;&#12391;&#12399;&#12289;&#12371;&#12398;&#20516;&#12434;&#12391;&#12365;&#12427;&#12384;&#12369;&#23567;&#12373;&#12356;&#20516;(1&#31186;)&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#20516;&#12364;&#22823;&#12365;&#12356;&#22580;&#21512;&#12289;&#12469;&#12540;&#12496;&#12540;&#12434;&#20877;&#36215;&#21205;&#12377;&#12427;&#12383;&#12403;&#12395;&#12289;&#26368;&#24460;&#12398;&#25968;&#22238;&#12398;&#12498;&#12483;&#12488;&#12434;&#21462;&#24471;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26368;&#22823;&#12475;&#12483;&#12471;&#12519;&#12531;&#25968;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12461;&#12515;&#12483;&#12471;&#12517;&#12395;&#32173;&#25345;&#12391;&#12365;&#12427;&#12475;&#12483;&#12471;&#12519;&#12531;&#12398;&#26368;&#22823;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>-1&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12475;&#12483;&#12471;&#12519;&#12531;&#12398;&#25968;&#12399;&#21046;&#38480;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;-1&#12391;&#12377;&#12290;</p>
<p>&#21046;&#38480;&#12395;&#36948;&#12375;&#12383;&#24460;&#12395;&#26032;&#35215;&#12475;&#12483;&#12471;&#12519;&#12531;&#12434;&#20316;&#25104;&#12375;&#12424;&#12358;&#12392;&#12377;&#12427;&#12392;&#12289;<code>IllegalStateException</code>&#12364;&#12473;&#12525;&#12540;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12475;&#12483;&#12471;&#12519;&#12531;&#29366;&#24907;&#12398;&#20445;&#23384;&#12364;&#21487;&#33021;&#12394;&#22580;&#21512;&#12399;&#12289;&#12300;&#12475;&#12483;&#12471;&#12519;&#12531;&#12539;&#12501;&#12449;&#12452;&#12523;&#21517;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#20877;&#36215;&#21205;&#38291;&#12391;&#12475;&#12483;&#12471;&#12519;&#12531;&#29366;&#24907;&#12434;&#20445;&#23384;&#12377;&#12427;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12434;&#32118;&#23550;&#12497;&#12473;&#12414;&#12383;&#12399;&#30456;&#23550;&#12497;&#12473;&#12391;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12497;&#12473;&#12364;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12475;&#12483;&#12471;&#12519;&#12531;&#29366;&#24907;&#12399;&#20445;&#23384;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12371;&#12398;&#12497;&#12473;&#12399;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;</p>
<p>&#30456;&#23550;&#12497;&#12473;&#12399;&#12289;&#12371;&#12398;Web&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#19968;&#26178;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12363;&#12425;&#12398;&#30456;&#23550;&#12391;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#35373;&#23450;&#12399;&#12289;&#12300;&#27704;&#32154;&#24615;&#12398;&#12479;&#12452;&#12503;&#12301;&#12364;&#12300;<code>memory</code>&#12301;&#12398;&#22580;&#21512;&#12395;&#12398;&#12415;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#27704;&#32154;&#24615;&#12398;&#12479;&#12452;&#12503;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;&#12289;<a href="task-webcontaineravailability.html">Web&#12467;&#12531;&#12486;&#12490;&#12398;&#21487;&#29992;&#24615;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
<li>
<p>&#12300;&#12475;&#12483;&#12471;&#12519;&#12531;ID&#12472;&#12455;&#12493;&#12524;&#12540;&#12479;&#12539;&#12463;&#12521;&#12473;&#21517;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#19968;&#24847;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;ID&#12434;&#29983;&#25104;&#12377;&#12427;&#12383;&#12417;&#12398;&#12459;&#12473;&#12479;&#12512;&#12539;&#12463;&#12521;&#12473;&#12398;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12372;&#12392;&#12395;&#20351;&#29992;&#12391;&#12365;&#12427;&#12475;&#12483;&#12471;&#12519;&#12531;ID&#12472;&#12455;&#12493;&#12524;&#12540;&#12479;&#12539;&#12463;&#12521;&#12473;&#12399;1&#12388;&#12398;&#12415;&#12391;&#12289;&#12475;&#12483;&#12471;&#12519;&#12531;&#12539;&#12461;&#12540;&#12398;&#34909;&#31361;&#12434;&#36991;&#12369;&#12427;&#12383;&#12417;&#12395;&#12289;&#12463;&#12521;&#12473;&#12479;&#12398;&#12377;&#12409;&#12390;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#21516;&#12376;&#12475;&#12483;&#12471;&#12519;&#12531;ID&#12472;&#12455;&#12493;&#12524;&#12540;&#12479;&#12434;&#20351;&#29992;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<p>&#12459;&#12473;&#12479;&#12512;&#12539;&#12475;&#12483;&#12471;&#12519;&#12531;ID&#12472;&#12455;&#12493;&#12524;&#12540;&#12479;&#12539;&#12463;&#12521;&#12473;&#12399;&#12289;<code>com.sun.enterprise.util.uuid.UuidGenerator</code>&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12434;&#23455;&#35013;&#12375;&#12390;&#12356;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<pre>
package com.sun.enterprise.util.uuid;

public interface UuidGenerator {

    public String generateUuid();
    public String generateUuid(Object obj);  //obj is the session object
}
</pre>
<p>&#12463;&#12521;&#12473;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12463;&#12521;&#12473;&#12497;&#12473;&#12395;&#23384;&#22312;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#12289;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>GlassFish Server&#12391;&#12399;&#12289;&#12475;&#12483;&#12471;&#12519;&#12531;&#12539;&#12510;&#12493;&#12540;&#12472;&#12515;&#12395;&#12399;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#23450;&#32681;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
<ul>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#34920;&#31034;&#12373;&#12428;&#12427;&#31354;&#30333;&#34892;&#12391;&#12289;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#21517;&#12434;&#20837;&#21147;&#12375;&#12289;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;&#12289;&#12381;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#32232;&#38598;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;&#12289;&#21066;&#38500;&#12377;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12398;&#24038;&#20596;&#12395;&#12354;&#12427;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21066;&#38500;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#12498;&#12531;&#12488;:</b></p>
&#12487;&#12501;&#12457;&#12523;&#12488;&#35373;&#23450;&#12395;&#36820;&#12377;&#12395;&#12399;&#12289;&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12489;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12289;&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;<br />
<hr>

</li>
</ol>
<a id="sthref11" name="sthref11"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-webcontainergeneral.html">Web&#12467;&#12531;&#12486;&#12490;&#12398;&#19968;&#33324;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-webcontainersessiontimeout.html">Web&#12467;&#12531;&#12486;&#12490;&#12398;&#12475;&#12483;&#12471;&#12519;&#12531;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-webcontainerstoreprops.html">Web&#12467;&#12531;&#12486;&#12490;&#12398;&#12473;&#12488;&#12450;&#12539;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-webcontaineravailability.html">Web&#12467;&#12531;&#12486;&#12490;&#12398;&#21487;&#29992;&#24615;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
