<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-managerproptab" name="ref-managerproptab"></a></p>

<h4><a id="sthref95" name="sthref95"></a><a id="sthref96" name="sthref96"></a>Propiedades del gestor</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>El gestor de sesiones proporciona los medios para configurar el modo de crear y destruir las sesiones, el lugar en el que se almacena el estado de sesi&oacute;n y el n&uacute;mero m&aacute;ximo de sesiones disponibles.</p>
<p>Utilice la p&aacute;gina Propiedades de Gestor para agregar o modificar propiedades de gestor de sesiones para el contenedor web.</p>
<p>La p&aacute;gina Propiedades de Gestor contiene las opciones siguientes.</p>
<dl>
<dt>Cargar Valores por Defecto</dt>
<dd>
<p>Bot&oacute;n para restaurar configuraci&oacute;n que tiene valores por defecto a sus valores por defecto. Las configuraciones que no tienen valores por defecto no se modifican.</p>
</dd>
<dt>Nombre de Configuraci&oacute;n</dt>
<dd>
<p>Nombre de la configuraci&oacute;n a la que se aplican los valores de esta p&aacute;gina. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>Intervalo de Recolecci&oacute;n</dt>
<dd>
<p>N&uacute;mero de segundos que transcurren antes de que los datos de sesi&oacute;n inactiva se suprimen del almac&eacute;n. El valor por defecto es 60.</p>
<p>Defina este valor de forma que sea menor que la frecuencia con la que cambian los datos de la sesi&oacute;n. Por ejemplo, este valor debe ser lo m&aacute;s bajo posible (1 segundo) para un servlet con contador de visitas en un sitio web con visitas frecuentes; de lo contrario, podr&iacute;a perder las &uacute;ltimas visitas cada vez que reinicie el servidor.</p>
</dd>
<dt>N&uacute;mero M&aacute;ximo de Sesiones</dt>
<dd>
<p>El n&uacute;mero m&aacute;ximo de sesiones que puede haber en la cach&eacute;. Un valor de-1 indica que no hay un l&iacute;mite para el n&uacute;mero de sesiones. El valor por defecto es -1.</p>
<p>Una vez alcanzado el l&iacute;mite, un intento de crear una nueva sesi&oacute;n provoca que se devuelva una excepci&oacute;n <code>IllegalStateException</code>.</p>
</dd>
<dt>Nombre de Archivo de Sesi&oacute;n</dt>
<dd>
<p>La ruta de acceso absoluta o relativa al directorio en el que se conserva el estado de la sesi&oacute;n entre reinicios de la aplicaci&oacute;n, en caso de que sea posible conservar el estado. Si no se define esta ruta de acceso, el estado de la sesi&oacute;n no se conserva. Por defecto, esta ruta de acceso no se encuentra definida.</p>
<p>Una ruta de acceso relativa se relaciona con el directorio temporal para esta aplicaci&oacute;n web.</p>
</dd>
<dt>Propiedades Adicionales</dt>
<dd>
<p>Propiedades adicionales del gestor de sesiones. GlassFish Server no define ninguna propiedad adicional para el gestor de sesiones.</p>
</dd>
</dl>
<a id="sthref97" name="sthref97"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-webcontainergeneral.html">Para configurar las propiedades generales para el contenedor web</a></p>
</li>
<li>
<p><a href="task-webcontainersessiontimeout.html">Para configurar las propiedades de la sesi&oacute;n para el contenedor web</a></p>
</li>
<li>
<p><a href="task-webcontainermanagerprops.html">Para configurar propiedades del gestor para el contenedor web</a></p>
</li>
<li>
<p><a href="task-webcontainerstoreprops.html">Para configurar las propiedades del almac&eacute;n para el contenedor web</a></p>
</li>
<li>
<p><a href="task-webcontaineravailability.html">Para configurar la disponibilidad del contenedor web</a></p>
</li>
</ul>
<a id="sthref98" name="sthref98"></a>
<h5>Comandos asadmin Relacionados</h5>
<p>Ninguno.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
