<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-accesslog" name="ref-accesslog"></a></p>

<h4><a id="sthref104" name="sthref104"></a><a id="sthref105" name="sthref105"></a>Servicio HTTP</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Servicio HTTP para especificar la pol&iacute;tica de log de acceso general de las aplicaciones web.</p>
<p>El servicio HTTP proporciona la posibilidad de desplegar aplicaciones web y de que los clientes HTTP puedan acceder a las aplicaciones web desplegadas, as&iacute; como a los servidores virtuales, pools de threads y capacidad de configuraci&oacute;n de red.</p>
<p>GlassFish Server utiliza el log de acceso de servicio HTTP para activar y configurar la rotaci&oacute;n de los logs de acceso de los servidores virtuales. Estos logs est&aacute;n ubicados en el directorio domain-dir<code>/logs/access</code> y se denominan: <i>virtual_server_name</i><code>_access_log.</code><i>yyyyMMdd</i><code>-</code><i>HH</i><code>h</code><i>mm</i><code>m</code><i>ss</i><code>s.txt</code></p>
<p>La p&aacute;gina Servicio HTTP contiene las siguientes opciones.</p>
<dl>
<dt>Cargar Valores por Defecto</dt>
<dd>
<p>Bot&oacute;n para restaurar configuraci&oacute;n que tiene valores por defecto a sus valores por defecto. Las configuraciones que no tienen valores por defecto no se modifican.</p>
</dd>
<dt>Nombre de Configuraci&oacute;n</dt>
<dd>
<p>Nombre de la configuraci&oacute;n a la que se aplican los valores de esta p&aacute;gina. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>SSO</dt>
<dd>
<p>Identifica si se activa el single sign-on por defecto para todas las aplicaciones web en todos los servidores virtuales en este servidor que se han configurado para el mismo dominio. Si esta opci&oacute;n no est&aacute; activada, el single sign-on se encuentra desactivado por defecto para todos los servidores virtuales y los usuarios se deben autenticar por separado para cada aplicaci&oacute;n en cada servidor virtual. Puede sustituir esta configuraci&oacute;n para un servidor virtual individual. La opci&oacute;n SSO puede estar activada o desactivada. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Registro de Acceso</dt>
<dd>
<p>Si se selecciona esta opci&oacute;n, se activa el registro de acceso para todos los sub-elementos del servidor virtual que no especifiquen esta propiedad. Si no selecciona esta opci&oacute;n, se desactivar&aacute; el registro de acceso de todos los subelementos de servidores virtuales que no tengan especificada esta propiedad. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Rotaci&oacute;n</dt>
<dd>
<p>Si selecciona esta opci&oacute;n, se activar&aacute; la rotaci&oacute;n del archivo log. Esta opci&oacute;n se encuentra activada por defecto.</p>
</dd>
<dt>Pol&iacute;tica de Rotaci&oacute;n</dt>
<dd>
<p>La &uacute;nica pol&iacute;tica de rotaci&oacute;n disponible es <code>time</code>.</p>
</dd>
<dt>Intervalo de Rotaci&oacute;n</dt>
<dd>
<p>N&uacute;mero de minutos transcurridos entre las rotaciones del log de acceso. Este campo s&oacute;lo es v&aacute;lido si la pol&iacute;tica de rotaci&oacute;n es <code>time</code>. El valor por defecto es 1.440 minutos (24 horas).</p>
</dd>
<dt>Sufijo de Rotaci&oacute;n</dt>
<dd>
<p>Valor de la cadena que se agregar&aacute; al final del nombre del archivo log tras la rotaci&oacute;n. El valor por defecto es <code>aaaa-MM-dd</code>.</p>
<p>Aseg&uacute;rese de que el sufijo de rotaci&oacute;n contenga valores suficientes para crear un sufijo &uacute;nico para cada rotaci&oacute;n del log. Por ejemplo, si el log de acceso rota m&aacute;s de una vez al d&iacute;a, se incluye la hora del d&iacute;a en el sufijo de rotaci&oacute;n.</p>
<p>Es necesario un sufijo &uacute;nico para asegurar que el archivo log de acceso rota cada vez que transcurre el intervalo de rotaci&oacute;n. Si el sufijo de rotaci&oacute;n del nuevo archivo log de acceso es igual que el sufijo de rotaci&oacute;n del archivo log de acceso existente, el archivo no se rota.</p>
</dd>
<dt>Recuento M&aacute;ximo de Archivos</dt>
<dd>
<p>N&uacute;mero m&aacute;ximo de archivos log de acceso de rotaci&oacute;n que se deben conservar. Un valor negativo indica que no hay l&iacute;mite en el recuento de archivos. El valor por defecto es -1.</p>
</dd>
<dt>Tama&ntilde;o de Buffer</dt>
<dd>
<p>Tama&ntilde;o en bytes del buffer de log de acceso, o un valor inferior o igual a cero para los logs de acceso sin buffer. El valor por defecto es 32768.</p>
</dd>
<dt>Intervalo de Escritura</dt>
<dd>
<p>N&uacute;mero de segundos antes de que el log se escriba en el disco. El log de acceso se escribe cuando el buffer est&aacute; lleno o cuando caduca el intervalo. Si el valor es menor o igual a cero, el buffer siempre se escribe aunque no est&eacute; lleno. Esto significa que cada vez que se accede al servidor, el mensaje de log se almacena directamente en el archivo. El valor por defecto es 300.</p>
</dd>
<dt>Formato</dt>
<dd>
<p>Valor de la cadena que especifica la informaci&oacute;n que hay que capturar en el log de acceso y el orden en el que hay que capturarla. El valor por defecto es el siguiente:</p>
<pre>
%client.name% %auth-user-name% %datetime% %request% %status% %response.length%
</pre>
<p>Los valores siguientes est&aacute;n disponibles para su inclusi&oacute;n en la cadena de formato:</p>
<dl>
<dt><code>%attribute.</code><i>nombre</i><code>%</code></dt>
<dd>
<p>Registra el valor (mediante una llamada a su m&eacute;todo <code>toString</code>) del atributo de la solicitud con el <i>nombre</i> indicado</p>
</dd>
<dt><code>%auth-user-name%</code></dt>
<dd>
<p>Nombre de usuario autorizado</p>
</dd>
<dt><code>%client.name%</code></dt>
<dd>
<p>Nombre de host del cliente</p>
</dd>
<dt><code>%client.dns%</code></dt>
<dd>
<p>DNS de cliente</p>
</dd>
<dt><code>%cookie.</code><i>nombre</i><code>%</code></dt>
<dd>
<p>El valor de la cookie de la solicitud con el <i>nombre</i> indicado</p>
</dd>
<dt><code>%cookie.value%</code></dt>
<dd>
<p>Valor de la primera cookie que se encuentra en la solicitud</p>
</dd>
<dt><code>%datetime%</code></dt>
<dd>
<p>Fecha del sistema</p>
</dd>
<dt><code>%request%</code></dt>
<dd>
<p>L&iacute;nea de solicitud HTTP completa</p>
</dd>
<dt><code>%status%</code></dt>
<dd>
<p>Estado</p>
</dd>
<dt><code>%response.length%</code></dt>
<dd>
<p>Longitud del contenido de respuesta</p>
</dd>
<dt><code>%header.referer%</code></dt>
<dd>
<p>Cabecera del referencia</p>
</dd>
<dt><code>%header.user-agent%</code></dt>
<dd>
<p>Cabecera del agente del usuario</p>
</dd>
<dt><code>%http-method%</code></dt>
<dd>
<p>M&eacute;todo HTTP</p>
</dd>
<dt><code>%http-uri%</code></dt>
<dd>
<p>URI de HTTP</p>
</dd>
<dt><code>%query-str%</code></dt>
<dd>
<p>Cadena de consulta HTTP</p>
</dd>
<dt><code>%http-version%</code></dt>
<dd>
<p>Versi&oacute;n de protocolo HTTP</p>
</dd>
<dt><code>%header.accept%</code></dt>
<dd>
<p>Cabecera de aceptaci&oacute;n</p>
</dd>
<dt><code>%header.date%</code></dt>
<dd>
<p>Cabecera de fecha</p>
</dd>
<dt><code>%header.if-mod-since%</code></dt>
<dd>
<p>Cabecera de fecha de modificaci&oacute;n</p>
</dd>
<dt><code>%header.auth%</code></dt>
<dd>
<p>Cabecera de autorizaci&oacute;n</p>
</dd>
<dt><code>%header.</code><i>cualquiera</i><code>%</code></dt>
<dd>
<p>Cualquier valor de cabecera HTTP v&aacute;lido definido en RFC 2616 (<code>cualquiera</code> tambi&eacute;n es un valor de cabecera v&aacute;lido; se especifica como variable aqu&iacute;)</p>
</dd>
<dt><code>%session.</code><i>nombre</i><code>%</code></dt>
<dd>
<p>El valor del atributo de la sesi&oacute;n con el nombre <i>nombre</i> o <code>NULL-SESSION-ATTRIBUTE-</code> si el atributo indicado no existe en la sesi&oacute;n, o <code>NULL-SESSION</code> si no existe ninguna sesi&oacute;n</p>
</dd>
<dt><code>%time-taken%</code></dt>
<dd>
<p>Tiempo (en milisegundos) que se tard&oacute; en prestar servicio a cada solicitud</p>
</dd>
<dt><code>%vs.id%</code></dt>
<dd>
<p>ID de servidor virtual</p>
</dd>
</dl>
</dd>
<dt>Propiedades Adicionales</dt>
<dd>
<p>Propiedades adicionales del servicio HTTP. Para obtener una descripci&oacute;n de las propiedades disponibles, consulte <a href="ref-httpserviceprops.html">Propiedades espec&iacute;ficas del servicio HTTP</a>.</p>
</dd>
</dl>
<a id="sthref106" name="sthref106"></a>
<h5>Tareas relacionadas</h5>
<p><a href="task-accesslog.html">Para configurar el servicio HTTP</a></p>
<a id="sthref107" name="sthref107"></a>
<h5>Comandos asadmin Relacionados</h5>
<p>Ninguno.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
