<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-threadpools" name="ref-threadpools"></a></p>

<h4><a id="sthref169" name="sthref169"></a><a id="sthref170" name="sthref170"></a>Pools de Threads</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Pools de Threads para configurar los pools de threads.</p>
<p>Utilice los pools de threads para limitar un servicio a un n&uacute;mero espec&iacute;fico de threads simult&aacute;neos.</p>
<p>Al instalar por primera vez GlassFish Server, existen dos pools de threads por defecto. El pool de threads denominado <code>http-thread-pool</code> est&aacute; configurado para que lo utilicen listeners de red, mientras que el denominado <code>thread-pool-1</code> est&aacute; configurado para que lo utilice el ORB para solicitudes RMI/IIOP. Es posible que necesite crear un pool de threads con una configuraci&oacute;n distinta para su uso por parte de determinados tipos de aplicaciones y determinados sistemas de hardware, o bien para ajustar los pools de threads por defecto en funci&oacute;n de sus necesidades.</p>
<p>Java Virtual Machine (JVM) puede soportar muchos threads de ejecuci&oacute;n a la vez. Para mejorar el rendimiento GlassFish Server tiene uno o m&aacute;s pools de threads. Es posible asignar pools de threads espec&iacute;ficos a servicios concretos.</p>
<p>Un pool de threads puede utilizarse para diversos servicios. Los threads de solicitud manejan las solicitudes de los usuarios. Cuando un servidor recibe una solicitud, la asigna a un thread libre del pool de threads. El thread ejecuta las solicitudes del cliente y devuelve los resultados. Por ejemplo, si la solicitud necesita utilizar un recurso de sistema que est&aacute; actualmente ocupado, el thread espera hasta que el recurso est&eacute; libre antes de permitirle utilizar dicho recurso.</p>
<p>Especifique el n&uacute;mero m&iacute;nimo y m&aacute;ximo de threads que estar&aacute;n reservados para solicitudes. El pool de threads se ajusta din&aacute;micamente entre estos dos valores. El tama&ntilde;o m&iacute;nimo del pool de threads que se especifica indica al servidor que asigne por lo menos este n&uacute;mero de threads de reserva para solicitudes. Ese n&uacute;mero se incrementa hasta el tama&ntilde;o de pool de threads m&aacute;ximo especificado.</p>
<p>El incremento del n&uacute;mero de threads disponibles para un proceso permite al proceso responder a m&aacute;s solicitudes de forma simult&aacute;nea.</p>
<p>Para cada pool de threads, se muestra la siguiente informaci&oacute;n.</p>
<dl>
<dt>ID de Pool de Threads</dt>
<dd>
<p>Nombre del pool de threads.</p>
</dd>
<dt>Tama&ntilde;o M&aacute;ximo del Pool de Threads</dt>
<dd>
<p>N&uacute;mero m&aacute;ximo de threads del pool de threads.</p>
</dd>
<dt>Tama&ntilde;o M&iacute;nimo de Pool de Threads</dt>
<dd>
<p>N&uacute;mero m&iacute;nimo de threads en el pool de threads. Estos threads se crean cuando se instancia el pool de threads.</p>
</dd>
<dt>Tama&ntilde;o de Cola M&aacute;ximo</dt>
<dd>
<p>N&uacute;mero m&aacute;ximo de mensajes que pueden ponerse en cola hasta que haya threads disponibles para procesarlos.</p>
</dd>
<dt>Timeout de Thread Inactivo</dt>
<dd>
<p>Cantidad de tiempo en segundos a partir de la cual se suprimir&aacute;n los threads inactivos del pool.</p>
</dd>
</dl>
<p>La tabla Pools de Threads contiene adem&aacute;s las siguientes opciones.</p>
<dl>
<dt>Nuevo</dt>
<dd>
<p>Bot&oacute;n para crear un nuevo pool de threads.</p>
</dd>
<dt>Suprimir</dt>
<dd>
<p>Bot&oacute;n para suprimir uno o varios pool de threads seleccionados.</p>
</dd>
</dl>
<a id="sthref171" name="sthref171"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-threadpoolnew.html">Para crear un pool de threads</a></p>
</li>
<li>
<p><a href="task-threadpooledit.html">Para editar un pool de threads</a></p>
</li>
<li>
<p><a href="task-threadpooldelete.html">Para suprimir un pool de threads</a></p>
</li>
</ul>
<a id="sthref172" name="sthref172"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00060"><code>create-threadpool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00204"><code>list-threadpools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00111"><code>delete-threadpool</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
