<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-httplistenernew" name="ref-httplistenernew"></a></p>

<h4><a id="sthref113" name="sthref113"></a>Nuevo Listener HTTP</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Nuevo Listener HTTP para crear un nuevo listener HTTP.</p>
<p>Cuando se crea un listener HTTP, el separador SSL se puede editar tambi&eacute;n.</p>
<p>La p&aacute;gina Nuevo Listener HTTP contiene las opciones siguientes.</p>
<dl>
<dt>Nombre de Configuraci&oacute;n</dt>
<dd>
<p>Nombre de la configuraci&oacute;n a la que se aplican los valores de esta p&aacute;gina. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>Nombre</dt>
<dd>
<p>Nombre &uacute;nico de listener. Un nombre de listener HTTP no puede empezar con un n&uacute;mero.</p>
</dd>
<dt>Puerto</dt>
<dd>
<p>N&uacute;mero de puerto en el que recibir&aacute; el listener. Los valores v&aacute;lidos se encuentran entre 1 y 65535. En un sistema UNIX, la creaci&oacute;n de sockets que reciben en los puertos 1-1024 requiere privilegios de superusuario.</p>
</dd>
<dt>Estado</dt>
<dd>
<p>Estado del listener HTTP. El listener puede estar activado o desactivado. Esta opci&oacute;n se encuentra activada por defecto. Si el listener se encuentra desactivado, cualquier intento de establecer una conexi&oacute;n con &eacute;l tiene como resultado una excepci&oacute;n de socket (<code>java.net.ConnectException</code>).</p>
<p>En las versiones anteriores a la 9.1 de GlassFish Server, un listener cuyo atributo activado se hubiera definido como false devolv&iacute;a un c&oacute;digo de respuesta 404 para cualquier solicitud que se le enviaba. Para lograr este comportamiento en la versi&oacute;n actual de GlassFish Server, defina el estado del listener en activado y defina cada estado de servidor virtual asociado como desactivado. Un servidor virtual incluye sus listeners asociados en la lista desplegable Listeners de Red.</p>
</dd>
<dt>Seguridad</dt>
<dd>
<p>Si se selecciona esta opci&oacute;n, se activa la seguridad para el listener HTTP. Esta opci&oacute;n se activada por defecto.</p>
<p>Si est&aacute; configurando el <code>admin-listener</code> para el servidor de administraci&oacute;n de dominio (DAS), que usa la configuraci&oacute;n <code>server-config</code>, esta opci&oacute;n ser&aacute; de s&oacute;lo lectura. Para activar la seguridad de este listener, debe activar primero la administraci&oacute;n segura. Consulte la secci&oacute;n <a href="../../../common/en/help/ref-securityadmin.html">Administraci&oacute;n Segura</a>.</p>
</dd>
<dt>Listener JK</dt>
<dd>
<p>Si esta opci&oacute;n se encuentra seleccionada, el listener soporta el protocolo <code>mod-jk</code> de Apache. El protocolo <code>mod-jk</code> es un protocolo de red/comunicaci&oacute;n de propiedad entre <code>httpd</code> de Apache (servidor web) y una instancia back-end de GlassFish Server. Si el listener soporta este protocolo, se supone que <code>httpd</code> maneja todo el contenido est&aacute;tico, mientras que cualquier solicitud de recursos din&aacute;micos (es decir, servlets y JSP) se direccionan al listener HTTP de <code>mod jk</code> activado de GlassFish Server a trav&eacute;s del protocolo <code>mod-jk</code>. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Direcci&oacute;n</dt>
<dd>
<p>Direcci&oacute;n IP en la que actuar&aacute; el listener de red. La direcci&oacute;n se puede especificar en par punteado o notaci&oacute;n IPv6. Puede ser <code>cualquiera</code> (para <code>INADDR_ANY</code>) para recibir en todas las direcciones IP. Puede ser un nombre de host.</p>
</dd>
<dt>Servidor Virtual por Defecto</dt>
<dd>
<p>Servidor virtual que se va a asociar a este listener HTTP. Utilice la p&aacute;gina Servidores Virtuales para definir los servidores virtuales.</p>
</dd>
<dt>Pool de Threads</dt>
<dd>
<p>Pool de threads asociado al listener HTTP. Normalmente, puede seleccionar uno de los dos pools de threads que est&aacute;n configurados cuando se instala GlassFish Server.</p>
</dd>
<dt>Nombre de servidor</dt>
<dd>
<p>Nombre de host que se utiliza en las URL que el servidor env&iacute;a al cliente. Este nombre es el nombre de alias si el servidor utiliza un alias. Si el servidor no utiliza un alias, deje vac&iacute;o este campo.</p>
<p>Este valor afecta a las URL que genera autom&aacute;ticamente el servidor; no afecta a las URL de los directorios y archivos almacenados en el servidor. Si el servidor utiliza un alias, el nombre-servidor deber&iacute;a ser el nombre de alias. Si se agregan dos puntos y un n&uacute;mero de puerto, dicho puerto se usar&aacute; en las URL que el servidor env&iacute;a al cliente.</p>
</dd>
</dl>
<a id="sthref114" name="sthref114"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-httplistenernew.html">Para crear un listener HTTP</a></p>
</li>
<li>
<p><a href="task-httplisteneredit.html">Para editar un listener HTTP</a></p>
</li>
<li>
<p><a href="task-httplistenerdelete.html">Para suprimir un listener HTTP</a></p>
</li>
<li>
<p><a href="task-httplistenerssl.html">Para editar la configuraci&oacute;n SSL para un listener HTTP</a></p>
</li>
<li>
<p><a href="task-virtualservercreate.html">Para crear un servidor virtual</a></p>
</li>
<li>
<p><a href="task-networklistenernew.html">Para crear un listener de red</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">Para editar la configuraci&oacute;n HTTP para un protocolo</a></p>
</li>
</ul>
<a id="sthref115" name="sthref115"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00030"><code>create-http-listener</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00168"><code>list-http-listeners</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00082"><code>delete-http-listener</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00046"><code>create-network-listener</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00186"><code>list-network-listeners</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00098"><code>delete-network-listener</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
