<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-webcontaineravailability" name="ref-webcontaineravailability"></a><a id="GHWEB00001" name="GHWEB00001"></a></p>

<h4><a id="sthref79" name="sthref79"></a><a id="sthref80" name="sthref80"></a>Disponibilidad de contenedor web</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Disponibilidad de Contenedor Web para configurar los valores de disponibilidad del contenedor web.</p>
<p>La p&aacute;gina Disponibilidad de Contenedor Web contiene las siguientes opciones.</p>
<dl>
<dt>Cargar Valores por Defecto</dt>
<dd>
<p>Bot&oacute;n para restaurar configuraci&oacute;n que tiene valores por defecto a sus valores por defecto. Las configuraciones que no tienen valores por defecto no se modifican.</p>
</dd>
<dt>Nombre de Configuraci&oacute;n</dt>
<dd>
<p>Nombre de la configuraci&oacute;n a la que se aplican los valores de esta p&aacute;gina. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>Servicio de Disponibilidad</dt>
<dd>
<p>Si se activa la casilla de control Activado, se activa la disponibilidad para el contenedor web.</p>
</dd>
<dt>Tipo de Persistencia</dt>
<dd>
<p>Mecanismo de persistencia utilizado.</p>
<ul>
<li>
<p>Si Servicio de Disponibilidad Activado <i>no</i> est&aacute; activada, seleccione una de las siguientes opciones:</p>
<ul>
<li>
<p><code>memory</code> para ninguna persistencia de sesi&oacute;n</p>
</li>
<li>
<p><code>file</code> para la persistencia de sesi&oacute;n en funci&oacute;n del sistema de archivos que no es de alta disponibilidad</p>
</li>
</ul>
</li>
<li>
<p>Si la Activaci&oacute;n del Servicio de Disponibilidad est&aacute; activada, seleccione <code>replicated</code> para la persistencia de sesi&oacute;n en funci&oacute;n del failover del cluster que es de alta disponibilidad.</p>
</li>
</ul>
</dd>
<dt>Frecuencia de Persistencia</dt>
<dd>
<p>La frecuencia con la que se almacena la sesi&oacute;n HTTP:</p>
<ul>
<li>
<p><code>web-method</code> &mdash;: el estado de la sesi&oacute;n se almacena al final de cada solicitud web antes de enviar una respuesta al cliente. Este modo ofrece la mejor garant&iacute;a de que el estado de la sesi&oacute;n se actualizar&aacute; completamente en caso de fallo. &Eacute;ste es el valor por defecto.</p>
</li>
</ul>
</dd>
<dt>&Aacute;mbito de Persistencia</dt>
<dd>
<p>El &aacute;mbito de los cambios de la sesi&oacute;n HTTP necesarios para que se realice el almacenamiento:</p>
<ul>
<li>
<p><code>session</code> &mdash; se almacena el estado de la sesi&oacute;n completo cada vez. Este modo ofrece la mejor garant&iacute;a de que sus datos de sesi&oacute;n se almacenan correctamente para las aplicaciones web distribuibles.</p>
</li>
<li>
<p><code>modified-session</code> &mdash; el estado de la sesi&oacute;n completo se almacena si se ha modificado. Se considera que se ha modificado una sesi&oacute;n si se ha realizado una llamada a <code>HttpSession.setAttribute()</code> o <code>HttpSession.removeAttribute()</code>. Debe garantizar que se llama a <code>setAttribute()</code> cada vez que se cambia un atributo. Esto no es un requisito de especificaci&oacute;n de Java EE, pero es necesario para que este modo funcione correctamente.</p>
</li>
<li>
<p><code>modified-attribute</code> &mdash; s&oacute;lo se almacenan los atributos de sesi&oacute;n modificados. Para que este modo funcione correctamente, debe seguir estas directrices:</p>
<ul>
<li>
<p>Llame a <code>setAttribute()</code> cada vez que se modifique el estado de la sesi&oacute;n.</p>
</li>
<li>
<p>Aseg&uacute;rese de que no existen referencias cruzadas entre atributos. El gr&aacute;fico de objetos debajo de cada clave de atributo distinto se serializa y almacena por separado. Si hay referencias cruzadas de objetos entre los objetos de cada clave diferente, no est&aacute;n serializados ni deserializados correctamente.</p>
</li>
<li>
<p>Distribuya el estado de la sesi&oacute;n en varios atributos o por lo menos entre un atributo de s&oacute;lo lectura y uno modificable.</p>
</li>
</ul>
</li>
</ul>
</dd>
<dt>Estado de Single-Sign-On</dt>
<dd>
<p>Si se activa la casilla de control Activado, el estado de single sign-on estar&aacute; disponible para el failover.</p>
</dd>
<dt>Propiedades Adicionales</dt>
<dd>
<p>Propiedades adicionales de la disponibilidad de contenedor web.</p>
<p>GlassFish Server no define propiedades adicionales para la disponibilidad de contenedor web.</p>
</dd>
</dl>
<a id="sthref81" name="sthref81"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-webcontainergeneral.html">Para configurar las propiedades generales para el contenedor web</a></p>
</li>
<li>
<p><a href="task-webcontainersessiontimeout.html">Para configurar las propiedades de la sesi&oacute;n para el contenedor web</a></p>
</li>
<li>
<p><a href="task-webcontainermanagerprops.html">Para configurar propiedades del gestor para el contenedor web</a></p>
</li>
<li>
<p><a href="task-webcontainerstoreprops.html">Para configurar las propiedades del almac&eacute;n para el contenedor web</a></p>
</li>
<li>
<p><a href="task-webcontaineravailability.html">Para configurar la disponibilidad del contenedor web</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
