<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-protocolfilecacheedit" name="ref-protocolfilecacheedit"></a></p>

<h4><a id="sthref156" name="sthref156"></a><a id="sthref157" name="sthref157"></a>Cach&eacute; de archivos</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Cach&eacute; de Archivos para modificar la configuraci&oacute;n de la cach&eacute; de archivos para un protocolo de red.</p>
<p>La p&aacute;gina Cach&eacute; de Archivos contiene las opciones siguientes.</p>
<dl>
<dt>Cargar Valores por Defecto</dt>
<dd>
<p>Bot&oacute;n para restaurar configuraci&oacute;n que tiene valores por defecto a sus valores por defecto. Las configuraciones que no tienen valores por defecto no se modifican.</p>
</dd>
<dt>Nombre de Configuraci&oacute;n</dt>
<dd>
<p>Nombre de la configuraci&oacute;n a la que se aplican los valores de esta p&aacute;gina. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>Nombre de Protocolo</dt>
<dd>
<p>Nombre del protocolo. El campo Nombre de Protocolo es un campo de s&oacute;lo lectura. &Uacute;nicamente puede especificar el nombre al crear un nuevo protocolo.</p>
</dd>
<dt>Estado</dt>
<dd>
<p>Si se selecciona esta opci&oacute;n, se activa el estado de la cach&eacute; de archivos. Esta opci&oacute;n est&aacute; activada por defecto.</p>
</dd>
<dt>Antig&uuml;edad M&aacute;xima</dt>
<dd>
<p>Antig&uuml;edad m&aacute;xima, en segundos, de una entrada en cach&eacute; v&aacute;lida.</p>
<p>Este par&aacute;metro controla el tiempo que se utiliza la informaci&oacute;n en cach&eacute; despu&eacute;s de que un archivo se haya almacenado en cach&eacute;. Una entrada m&aacute;s antigua que la antig&uuml;edad m&aacute;xima se sustituye por una nueva entrada para el mismo archivo. Si su contenido no cambia con frecuencia, aumente este valor para mejorar el rendimiento.</p>
<p>La antig&uuml;edad m&aacute;xima &oacute;ptima depende de si los archivos existentes se modifican con regularidad. Por ejemplo, si los archivos se modifican cuatro veces al d&iacute;a en intervalos regulares, plant&eacute;ese definir la antig&uuml;edad m&aacute;xima en 21.600 segundos (6 horas). De lo contrario, una vez que el archivo haya sido modificado, considere definir la antig&uuml;edad m&aacute;xima en el per&iacute;odo de tiempo mayor que desee servir a la versi&oacute;n anterior de un archivo.</p>
<p>El valor por defecto es 30.</p>
</dd>
<dt>Tama&ntilde;o de cach&eacute; m&aacute;ximo</dt>
<dd>
<p>Tama&ntilde;o m&aacute;ximo total (en bytes) de la cach&eacute; de archivos en disco. El valor por defecto es 10485760.</p>
</dd>
<dt>Recuento M&aacute;ximo de Archivos</dt>
<dd>
<p>N&uacute;mero m&aacute;ximo de archivos que se pueden almacenar en la cach&eacute; de archivos.</p>
<p>Si el valor es demasiado grande, el servidor almacena en cach&eacute; archivos que no son estrictamente necesarios, lo que desperdicia memoria. Si el valor es demasiado peque&ntilde;o, no se aprovechan las ventajas del almacenamiento en cach&eacute;. Pruebe distintos valores de este atributo para determinar la soluci&oacute;n &oacute;ptima para aplicaciones espec&iacute;ficas.</p>
<p>El valor por defecto es 1024.</p>
</dd>
</dl>
<a id="sthref158" name="sthref158"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-protocolnew.html">Para crear un protocolo</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">Para editar un protocolo</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">Para editar la configuraci&oacute;n SSL para un protocolo</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">Para editar la configuraci&oacute;n HTTP para un protocolo</a></p>
</li>
<li>
<p><a href="task-protocolfilecacheedit.html">Para editar la configuraci&oacute;n de cach&eacute; de archivos para un protocolo</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">Para suprimir un protocolo</a></p>
</li>
</ul>
<a id="sthref159" name="sthref159"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00051"><code>create-protocol</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00195"><code>list-protocols</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00103"><code>delete-protocol</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
