<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-protocolssledit" name="ref-protocolssledit"></a><a id="GHWEB00021" name="GHWEB00021"></a></p>

<h4><a id="sthref148" name="sthref148"></a><a id="sthref149" name="sthref149"></a>SSL</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina SSL para modificar la configuraci&oacute;n de SSL para un protocolo de red.</p>
<p>La configuraci&oacute;n de esta p&aacute;gina &uacute;nicamente tiene sentido si se encuentra activada la seguridad en la p&aacute;gina Editar Protocolo.</p>
<p>La p&aacute;gina SSL contiene las siguientes opciones.</p>
<dl>
<dt>Nombre de Configuraci&oacute;n</dt>
<dd>
<p>Nombre de la configuraci&oacute;n a la que se aplican los valores de esta p&aacute;gina. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>SSL3</dt>
<dd>
<p>Si se activa esta casilla de control, se activar&aacute; el protocolo SSL3 para el protocolo. Esta opci&oacute;n se encuentra activada por defecto.</p>
</dd>
<dt>TLS</dt>
<dd>
<p>Si se activa esta casilla de control, se activar&aacute; el protocolo TLS para el protocolo. Esta opci&oacute;n se encuentra activada por defecto.</p>
</dd>
<dt>Autenticaci&oacute;n de Cliente</dt>
<dd>
<p>Si esta casilla de control est&aacute; activada, los clientes se deben identificar en el servidor con cada solicitud. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Apodo de Certificado</dt>
<dd>
<p>Apodo del certificado del servidor en la base de datos de certificados o token PKCS#11. En el certificado, el formato del nombre es <i>tokenname</i><code>:</code><i>nickname</i>. Incluir tokenname<code>:</code> parte del nombre de este atributo es opcional.</p>
</dd>
<dt>Almac&eacute;n de Claves</dt>
<dd>
<p>Nombre de archivo del almac&eacute;n de claves (por ejemplo, <code>keystore.jks</code>).</p>
</dd>
<dt>Algoritmo de Confianza</dt>
<dd>
<p>Nombre del algoritmo de gesti&oacute;n de confianza (por ejemplo, PKIX) que se utilizar&aacute; para la validaci&oacute;n de rutas de acceso de certificaci&oacute;n.</p>
</dd>
<dt>Longitud de Certificado M&aacute;xima</dt>
<dd>
<p>N&uacute;mero m&aacute;ximo de certificados intermedios no emitidos autom&aacute;ticamente que puede haber en una ruta de acceso de certificaci&oacute;n. Este campo s&oacute;lo se utiliza en caso de que el campo Algoritmo de Confianza est&eacute; definido en PKIX. Un valor de 0 implica que la ruta de acceso s&oacute;lo puede contener un certificado. Un valor de -1 implica que la longitud de la ruta de acceso no est&aacute; restringida (no hay un m&aacute;ximo). La configuraci&oacute;n en un valor inferior a -1 inicia una excepci&oacute;n.</p>
</dd>
<dt>Almac&eacute;n de Confianza</dt>
<dd>
<p>Nombre de un archivo del almac&eacute;n de confianza (por ejemplo, <code>cacerts.jks</code>).</p>
</dd>
<dt>Conjuntos de Cifrado</dt>
<dd>
<p>&Aacute;rea en la que puede agregar o suprimir conjuntos de cifrado. Si no agrega ning&uacute;n conjunto de cifrado, se utilizar&aacute;n todos los conjuntos de cifrado.</p>
</dd>
</dl>
<a id="sthref150" name="sthref150"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-protocolnew.html">Para crear un protocolo</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">Para editar un protocolo</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">Para editar la configuraci&oacute;n SSL para un protocolo</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">Para editar la configuraci&oacute;n HTTP para un protocolo</a></p>
</li>
<li>
<p><a href="task-protocolfilecacheedit.html">Para editar la configuraci&oacute;n de cach&eacute; de archivos para un protocolo</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">Para suprimir un protocolo</a></p>
</li>
</ul>
<a id="sthref151" name="sthref151"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00051"><code>create-protocol</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00195"><code>list-protocols</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00103"><code>delete-protocol</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
