<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-httpserviceprops" name="ref-httpserviceprops"></a><a id="GHWEB00009" name="GHWEB00009"></a></p>

<h4><a id="sthref108" name="sthref108"></a><a id="sthref109" name="sthref109"></a>Propiedades espec&iacute;ficas del servicio HTTP</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Las siguientes propiedades adicionales est&aacute;n disponibles para el servicio HTTP. Si especifica estas propiedades, estas se aplicar&aacute;n a todas las <a href="ref-group-networklisteners.html">Listeners de Red</a>.</p>
<dl>
<dt><code>ssl-cache-entriese</code></dt>
<dd>
<p>n&uacute;mero de sesiones SSL que desea almacenar en cach&eacute;. El valor por defecto es 10000.</p>
</dd>
<dt><code>ssl3-session-timeout</code></dt>
<dd>
<p>Intervalo en el que las sesiones SSL3 se almacenan en cach&eacute;. El valor por defecto es 86,400.</p>
</dd>
<dt><code>ssl-session-timeout</code></dt>
<dd>
<p>Intervalo en el que las sesiones SSL2 se almacenan en cach&eacute;. El valor por defecto es 100.</p>
</dd>
<dt><code>proxyHandler</code></dt>
<dd>
<p>El nombre de clase completo de una implantaci&oacute;n personalizada de la clase abstracta <code>com.sun.appserv.ProxyHandler</code> que permite a una instancia de backend de GlassFish Server recuperar informaci&oacute;n relativa a la solicitud original del cliente interceptada por un servidor proxy con terminaci&oacute;n SSL (por ejemplo, un equilibrador de carga). Una implantaci&oacute;n de esta clase abstracta inspecciona una solicitud espec&iacute;fica en lo que concierne a las cabeceras de solicitud personalizadas mediante las cuales el servidor proxy comunica la informaci&oacute;n acerca de la solicitud original del cliente a la instancia de Enterprise Server y devuelve esa informaci&oacute;n al emisor de la llamada.</p>
<p>La implantaci&oacute;n por defecto lee la direcci&oacute;n de IP del cliente desde una cabecera de solicitud HTTP denominada <code>Proxy-ip</code>, los <code>keysize</code> de SSL desde una cabecera de solicitud HTTP denominada <code>Proxy-keysize</code> y la cadena del certificado de cliente SSL desde una cabecera de solicitud HTTP denominada <code>Proxy-auth-cert</code>. El valor <code>Proxy-auth-cert</code> debe contener la cadena de certificado de cliente con codificaci&oacute;n BASE-64 sin los l&iacute;mites <code>BEGIN CERTIFICATE</code> y <code>END CERTIFICATE</code> y con <code>\n</code> sustituido por<code>% d% a</code>.</p>
<p>Esta configuraci&oacute;n se utiliza &uacute;nicamente si la casilla de control Traspaso de Autenticaci&oacute;n de la p&aacute;gina HTTP de los protocolos de listener de red se ha definido como true.</p>
</dd>
<dt><code>connectionTimeout</code></dt>
<dd>
<p>Especifica el n&uacute;mero de segundos que esperan los listeners de red despu&eacute;s de aceptar una conexi&oacute;n para que se presente la l&iacute;nea URI de solicitud. El valor por defecto es 30.</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
