<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-transportedit" name="ref-transportedit"></a><a id="GHWEB00026" name="GHWEB00026"></a></p>

<h4><a id="sthref166" name="sthref166"></a>Editar transporte</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Editar Transporte para modificar la configuraci&oacute;n de un transporte existente.</p>
<p>La p&aacute;gina Editar Transporte contiene las siguientes opciones.</p>
<dl>
<dt>Cargar Valores por Defecto</dt>
<dd>
<p>Bot&oacute;n para restaurar configuraci&oacute;n que tiene valores por defecto a sus valores por defecto. Las configuraciones que no tienen valores por defecto no se modifican.</p>
</dd>
<dt>Nombre de Configuraci&oacute;n</dt>
<dd>
<p>Nombre de la configuraci&oacute;n a la que se aplican los valores de esta p&aacute;gina. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>Nombre</dt>
<dd>
<p>Nombre del transporte. Este campo es de s&oacute;lo lectura. S&oacute;lo puede especificar el nombre al crear un nuevo transporte.</p>
</dd>
<dt>Nombre de clase</dt>
<dd>
<p>Nombre de clase de la implantaci&oacute;n del transporte. El valor por defecto es <code>com.sun.grizzly.TCPSelectorHandler</code>.</p>
</dd>
<dt>Manejador de Clave de Selecci&oacute;n</dt>
<dd>
<p>El nombre de clase del manejador de clave de selecci&oacute;n. Un manejador de clave de selecci&oacute;n es una clase abstracta que gestiona el ciclo de vida de las claves de selecci&oacute;n. Si no se especifica ning&uacute;n valor, se utiliza una implantaci&oacute;n por defecto.</p>
</dd>
<dt>Tipo de Buffer de Bytes</dt>
<dd>
<p>El tipo de <code>buffer de bytes</code> que se va a utilizar. Las opciones disponibles son <code>HEAP</code> y <code>DIRECT</code>. El valor por defecto es <code>HEAP</code>.</p>
</dd>
<dt>Threads de Responsable de Aceptaci&oacute;n</dt>
<dd>
<p>N&uacute;mero de procesadores del equipo. Un valor de -1 indica que Grizzly calcular&aacute; por su cuenta el n&uacute;mero de threads del dispositivo de aceptaci&oacute;n seg&uacute;n el n&uacute;mero de procesadores de la m&aacute;quina. El valor por defecto es 1.</p>
<p>Para definir el n&uacute;mero de threads de procesamiento de solicitudes, defina el valor del Tama&ntilde;o M&aacute;ximo del Pool de Threads del pool de threads utilizado por un listener de red que emplea este transporte.</p>
</dd>
<dt>Recuento M&aacute;ximo de Conexiones</dt>
<dd>
<p>N&uacute;mero m&aacute;ximo de conexiones pendientes en un listener de red que utiliza este transporte. El valor por defecto es 4096.</p>
</dd>
<dt>Tama&ntilde;o de Buffer</dt>
<dd>
<p>Tama&ntilde;o de buffer, en bytes, que se proporciona para los flujos de entrada creados por un listener de red que utiliza este transporte. El valor por defecto es 8192.</p>
</dd>
<dt>Timeout de Clave Inactiva</dt>
<dd>
<p>N&uacute;mero de segundos despu&eacute;s de los cuales se cancelar&aacute; una clave inactiva y se cerrar&aacute; el canal. El valor por defecto es 30.</p>
</dd>
<dt>Timeout de Lectura</dt>
<dd>
<p>N&uacute;mero de milisegundos que GlassFish Server esperar&aacute; durante la fase de an&aacute;lisis de cabecera y cuerpo de una operaci&oacute;n de lectura. El valor por defecto es 30000.</p>
</dd>
<dt>Timeout de Sondeo de Selector</dt>
<dd>
<p>N&uacute;mero de milisegundos que un selector NIO bloquear&aacute; la espera de eventos (solicitudes de usuarios). El valor por defecto es 1.000.</p>
</dd>
<dt>Timeout de Escritura</dt>
<dd>
<p>N&uacute;mero de milisegundos que GlassFish Server espera antes de considerar que el cliente remoto est&aacute; desconectado al escribir la respuesta. El valor por defecto es 30000.</p>
</dd>
<dt>Configuraci&oacute;n de Pantalla</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, la configuraci&oacute;n interna de Grizzly se vaciar&aacute; en los logs del servidor. Esta opci&oacute;n puede proporcionar informaci&oacute;n &uacute;til para la depuraci&oacute;n. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Investigar</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, la informaci&oacute;n de la respuesta/solicitud se vuelca en el log del servidor. Puede que esta opci&oacute;n proporcione informaci&oacute;n &uacute;til para realizar la depuraci&oacute;n, pero reduce significativamente el rendimiento. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>TCP sin Retraso</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, la opci&oacute;n TCP_NODELAY (tambi&eacute;n llamada algoritmo de Nagle) est&aacute; activada. Esta opci&oacute;n se encuentra activada por defecto.</p>
</dd>
</dl>
<a id="sthref167" name="sthref167"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-transportnew.html">Para crear un transporte</a></p>
</li>
<li>
<p><a href="task-transportedit.html">Para editar un transporte</a></p>
</li>
<li>
<p><a href="task-transportdelete.html">Para suprimir un transporte</a></p>
</li>
</ul>
<a id="sthref168" name="sthref168"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00061"><code>create-transport</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00206"><code>list-transports</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00112"><code>delete-transport</code>(1)</a></p>
</li>
</ul>
</li>
</ul>




<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
