<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-virtualserverprops" name="ref-virtualserverprops"></a><a id="GHWEB00012" name="GHWEB00012"></a></p>

<h4><a id="sthref125" name="sthref125"></a><a id="sthref126" name="sthref126"></a>Propiedades espec&iacute;ficas de servidores virtuales</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Las siguientes propiedades adicionales est&aacute;n disponibles para un servidor virtual.</p>
<dl>
<dt><code>sso-max-inactive-seconds</code></dt>
<dd>
<p>Especifica el n&uacute;mero de segundos despu&eacute;s de los cuales el registro de single sign-on de un usuario cumple con los requisitos necesarios para la depuraci&oacute;n si no se detecta ninguna actividad de cliente. Dado que el single sign-on se aplica en varias aplicaciones en el mismo servidor virtual, el acceso a cualquiera de las aplicaciones mantiene activo el registro de single sign-on.</p>
<p>El valor por defecto es 300 segundos (5 minutos). Los valores m&aacute;s altos proporcionan una persistencia de single sign-on m&aacute;s larga para los usuarios a costa de un mayor consumo de memoria en el servidor.</p>
</dd>
<dt><code>sso-reap-interval-seconds</code></dt>
<dd>
<p>Especifica el n&uacute;mero de segundos entre depuraciones de registros de single sign-on caducados.</p>
<p>El valor por defecto es 60.</p>
</dd>
<dt><code>ssoCookieSecure</code></dt>
<dd>
<p>Define el atributo <code>Secure</code> de cualquier cookie <code>JSESSIONIDSSO</code> asociada a las aplicaciones web desplegadas en este servidor virtual. Esta propiedad &uacute;nicamente se aplica si se activa el single sign-on. Los valores permitidos son los siguientes:</p>
<dl>
<dt><code>true</code></dt>
<dd>
<p>Define <code>Secure</code> en true.</p>
</dd>
<dt><code>false</code></dt>
<dd>
<p>Define <code>Secure</code> en false.</p>
</dd>
<dt><code>dynamic</code></dt>
<dd>
<p>La cookie <code>JSESSIONIDSSO</code> hereda el valor <code>Secure</code> de la primera sesi&oacute;n que participa en el SSO.</p>
</dd>
</dl>
<p>Para definir el atributo Secure de una cookie <code>JSESSIONID</code>, utilice la propiedad <code>cookieSecure</code> <code>cookie-properties</code> del archivo <code>sun-web.xml</code>. Para obtener m&aacute;s informaci&oacute;n, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00130"><i>cookie-properties</i> en <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt><code>setCacheControl</code></dt>
<dd>
<p>Especifica una lista separada por comas de las directivas de respuesta de <code>Cache-Control</code>. Para obtener una lista de directivas v&aacute;lidas, consulte la secci&oacute;n 14.9 del documento en http://www.ietf.org/rfc/rfc2616.txt (<code><a href="http://www.ietf.org/rfc/rfc2616.txt">http://www.ietf.org/rfc/rfc2616.txt</a></code>).</p>
</dd>
<dt><code>accessLogBufferSize</code></dt>
<dd>
<p>Especifica el tama&ntilde;o (en bytes) del buffer en el que se almacenan las llamadas del log de acceso. Si el valor es inferior a 5120, se muestra una advertencia y el valor se define en 5120. El valor por defecto es 32768.</p>
</dd>
<dt><code>accessLogWriterInterval</code></dt>
<dd>
<p>Especifica el n&uacute;mero de segundos antes de que el log se escriba en el disco. El log de acceso se escribe cuando el buffer est&aacute; lleno o cuando caduca el intervalo. Si el valor es 0, el buffer siempre se escribir&aacute; aunque no est&eacute; lleno. Esto significa que cada vez que se accede al servidor, el mensaje de log se almacena directamente en el archivo. El valor por defecto es 300.</p>
</dd>
<dt><code>allowRemoteAddress</code></dt>
<dd>
<p>Especifica una lista de patrones de expresi&oacute;n regular separados por comas con los que se compara la direcci&oacute;n IP del cliente. Si se especifica esta propiedad, la direcci&oacute;n remota <i>debe</i> coincidir para que se acepte esta solicitud. Si no se especifica esta propiedad, se aceptan todas las solicitudes <i>a menos que</i> la direcci&oacute;n remota coincida con un patr&oacute;n <code>denyRemoteAddress</code>.</p>
</dd>
<dt><code>denyRemoteAddress</code></dt>
<dd>
<p>Especifica una lista de patrones de expresi&oacute;n regular separados por comas con los que se compara la direcci&oacute;n IP del cliente. Si se especifica esta propiedad, la direcci&oacute;n remota <i>no</i> debe coincidir para que se acepte esta solicitud. Si no se especifica esta propiedad, la aceptaci&oacute;n de la solicitud se regula s&oacute;lo por medio de la propiedad <code>allowRemoteAddress</code>.</p>
</dd>
<dt><code>allowRemoteHost</code></dt>
<dd>
<p>Especifica una lista de patrones de expresi&oacute;n regular separados por comas que se compara con el nombre de host del cliente remoto (devuelto por <code>[java.net.]Socket.getInetAddress().getHostName()</code>). Si se especifica esta propiedad, el nombre de host remoto <i>debe</i> coincidir para que se acepte esta solicitud. Si no se especifica esta propiedad, se aceptan todas las solicitudes <i>a menos que</i> el nombre de host remoto coincida con un patr&oacute;n <code>denyRemoteHost</code>.</p>
</dd>
<dt><code>denyRemoteHost</code></dt>
<dd>
<p>Especifica una lista de patrones de expresi&oacute;n regular separados por comas que se compara con el nombre de host del cliente remoto (devuelto por <code>[java.net.]Socket.getInetAddress().getHostName()</code>). Si se especifica esta propiedad, el nombre de host remoto <i>no</i> debe coincidir para que se acepte esta solicitud. Si no se especifica esta propiedad, la aceptaci&oacute;n de la solicitud se regula s&oacute;lo por medio de la propiedad <code>allowRemoteHost</code>.</p>
<p>La definici&oacute;n de esta propiedad no tiene ning&uacute;n efecto si se accede al dominio de GlassFish Server a trav&eacute;s del listener de red que tiene activada la opci&oacute;n Listener JK.</p>
</dd>
<dt><code>authRealm</code></dt>
<dd>
<p>Especifica el nombre de un dominio de autenticaci&oacute;n que sustituye el dominio por defecto de la instancia del servidor para las aplicaciones web independientes desplegadas en este servidor virtual. Un dominio definido en el archivo <code>web.xml</code> de una aplicaci&oacute;n web independiente sustituye al dominio del servidor virtual. Para obtener m&aacute;s informaci&oacute;n, consulte <a href="../../../common/en/help/ref-realms.html">Dominios</a>.</p>
</dd>
<dt><code>securePagesWithPragma</code></dt>
<dd>
<p>Defina esta propiedad en <code>false</code> para garantizar que todas las aplicaciones web de las descargas de archivos de este servidor virtual que utilicen SSL funcionen correctamente en Internet Explorer.</p>
<p>Las aplicaciones web individuales pueden sustituir esta configuraci&oacute;n utilizando el elemento <code>sun-web-app</code> del archivo <code>sun-web.xml.</code> Para obtener m&aacute;s informaci&oacute;n, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>glassfish-web-app</i> en <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
<p>El valor por defecto es <code>true</code>.</p>
</dd>
<dt><code>alternatedocroot_</code><i>n</i></dt>
<dd>
<p>Especifica una ra&iacute;z de documento alternativa (ra&iacute;z de documento), donde <i>n</i> es un entero positivo que permite la especificaci&oacute;n de m&aacute;s de uno. Las ra&iacute;ces de documento alternativas permiten que las aplicaciones web sirven solicitudes para ciertos recursos desde fuera de su propia ra&iacute;z de documento, en funci&oacute;n de si dichas solicitudes coinciden o no con uno (o m&aacute;s) de los patrones URI de las ra&iacute;ces de documento alternativas de la aplicaci&oacute;n web.</p>
<p>Si una solicitud coincide con el patr&oacute;n URI de la ra&iacute;z de documento alternativa, se asigna agregando la solicitud URI (menos la ra&iacute;z de contexto de la aplicaci&oacute;n web) a la ubicaci&oacute;n f&iacute;sica de la ra&iacute;z de documento alternativa (directorio). Si una solicitud coincide con varios patrones URI, se determina la ra&iacute;z de documento alternativa seg&uacute;n el orden especificado anteriormente:</p>
<ul>
<li>
<p>Coincidencia exacta</p>
</li>
<li>
<p>Ruta de acceso de coincidencia m&aacute;s larga</p>
</li>
<li>
<p>Coincidencia de extensi&oacute;n</p>
</li>
</ul>
<p>Por ejemplo, las siguientes propiedades especifican tres ra&iacute;ces de documento alternativas. El patr&oacute;n de URI de la primera ra&iacute;z de documento alternativa utiliza una coincidencia exacta, mientras que los patrones URI de la segunda y tercera ra&iacute;ces de documento alternativas usan una extensi&oacute;n y coincidencias del prefijo de la ruta de acceso m&aacute;s larga, respectivamente.</p>
<pre>
&lt;property name="alternatedocroot_1" 
   value="from=/my.jpg dir=/srv/images/jpg"
&lt;property name="alternatedocroot_2" 
   value="from=*.jpg dir=/srv/images/jpg"
&lt;property name="alternatedocroot_3" 
   value="from=/jpg/* dir=/src/images"
</pre>
<p>El <code>value</code> de cada ra&iacute;z de documento alternativa posee dos componentes: el primero, <code>from</code>, especifica el patr&oacute;n URI de la ra&iacute;z de documento alternativa, y el segundo, <code>dir</code>, especifica la ubicaci&oacute;n f&iacute;sica de la ra&iacute;z de documento alternativa (directorio). Se permiten espacios en el componente <code>dir</code>.</p>
<p>Las aplicaciones web individuales pueden sustituir esta configuraci&oacute;n utilizando el elemento <code>sun-web-app</code> del archivo <code>sun-web.xml.</code> Para obtener m&aacute;s informaci&oacute;n, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>glassfish-web-app</i> en <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt><code>contextXmlDefault</code></dt>
<dd>
<p>Especifica la ubicaci&oacute;n, con respecto a domain-dir del archivo <code>context.xml</code> de este servidor virtual, si se utiliza uno. Para obtener m&aacute;s informaci&oacute;n sobre el archivo <code>context.xml</code>, consulte la secci&oacute;n sobre el contenedor de contexto (<code><a href="http://tomcat.apache.org/tomcat-5.5-doc/config/context.html">http://tomcat.apache.org/tomcat-5.5-doc/config/context.html</a></code>).</p>
</dd>
<dt><code>allowLinking</code></dt>
<dd>
<p>Si est&aacute; propiedad es <code>true</code>, se servir&aacute;n los recursos que son enlaces simb&oacute;licos para todas las aplicaciones web desplegadas en este servidor virtual. Las aplicaciones web individuales pueden sustituir esta configuraci&oacute;n utilizando la propiedad <code>allowLinking</code> de <code>sun-web-app</code> en el archivo <code>sun-web.xml</code>:</p>
<pre>
&lt;sun-web-app&gt;
   &lt;property name="allowLinking" 
      value="{true|false}"
&lt;/sun-web-app&gt;
</pre>
<p>Para obtener m&aacute;s informaci&oacute;n, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>glassfish-web-app</i> en <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
<p>El valor por defecto es <code>false</code>.</p>

<hr>
<p><b>Atenci&oacute;n:</b></p>
La definici&oacute;n de esta propiedad como true en los sistemas Windows expone el c&oacute;digo fuente JSP.
<hr>

</dd>
<dt><code>send-error_</code><i>n</i></dt>
<dd>
<p>Especifica las asignaciones de la p&aacute;gina de errores personalizados para el servidor virtual, que heredan todas las aplicaciones web desplegadas en el servidor virtual. Una aplicaci&oacute;n web puede sustituir estas asignaciones de p&aacute;ginas de errores personalizadas en su descriptor de despliegue <code>web.xml</code>. El valor de cada propiedad <code>send-error_</code><i>n</i> posee tres componentes, que pueden especificarse en cualquier orden:</p>
<ul>
<li>
<p>El primer componente, <code>code</code>, especifica el c&oacute;digo de estado de la respuesta HTTP de tres d&iacute;gitos para el que la p&aacute;gina de errores personalizados deber&iacute;a devolverse como respuesta.</p>
</li>
<li>
<p>El segundo componente <code>path</code>, especifica la ruta de acceso absoluta o relativa del sistema de archivos de la p&aacute;gina de errores personalizados. Una ruta de acceso del sistema de archivos relativa se interpreta como relativa con respecto al directorio <code>/config</code> de domain-dir</p>
</li>
<li>
<p>El tercer componente, <code>reason</code>, es opcional y especifica el texto de la cadena raz&oacute;n (como, por ejemplo <code>Unauthorized</code> o <code>Forbidden</code>) que se debe devolver.</p>
</li>
</ul>
<p>Por ejemplo:</p>
<pre>
&lt;property name="send-error_1"
   value="code=401 path=/myhost/401.html reason=MY-401-REASON"
</pre>
<p>Este ejemplo de definici&oacute;n de la propiedad provoca que se devuelva el contenido de <code>/myhost/401.html</code> con las respuestas 401, junto con la l&iacute;nea de respuesta:</p>
<pre>
HTTP/1.1 401 MY-401-REASON
</pre></dd>
<dt><code>redirect_</code><i>n</i></dt>
<dd>
<p>Especifica que una solicitud de una URL antigua de trata como una solicitud de una URL nueva. Todas las aplicaciones web desplegadas en el servidor virtual heredan estas propiedades. El valor de cada propiedad <code>redirect_</code><i>n</i> posee dos componentes, que pueden especificarse en cualquier orden:</p>
<ul>
<li>
<p>El primer componente, <code>from</code>, especifica el prefijo de la URI cuya coincidencia se solicita.</p>
</li>
<li>
<p>El segundo componente, <code>url-prefix</code>, especifica el nuevo prefijo de URL para devolverlo al cliente. El prefijo <code>from</code> se sustituye simplemente con este prefijo de URL.</p>
</li>
</ul>
<p>Por ejemplo:</p>
<pre>
&lt;property name="redirect_1" 
  value="from=/dummy url-prefix=http://etude"
</pre></dd>
<dt><code>valve_</code><i>n</i></dt>
<dd>
<p>Especifica un nombre de clase completamente cualificado de una v&aacute;lvula personalizada, donde <i>n</i> es un n&uacute;mero entero positivo que permite especificaci&oacute;n de m&aacute;s de uno. La clase de v&aacute;lvula debe implantar la interfaz <code>org.apache.catalina.Valve</code> de Tomcat o de versiones anteriores de GlassFish Server, o la interfaz <code>org.glassfish.web.valve.GlassFishValve</code> de la versi&oacute;n actual de GlassFish Server. Por ejemplo:</p>
<pre>
&lt;property name="valve_1"
value="org.glassfish.extension.Valve"
</pre>
<p>Puede configurar esta propiedad para una determinada aplicaci&oacute;n web. Para obtener m&aacute;s informaci&oacute;n, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>glassfish-web-app</i> en <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt><code>listener_</code><i>n</i></dt>
<dd>
<p>Especifica un nombre de clase completo de un listener Catalina personalizado, donde <i>n</i> es un n&uacute;mero entero positivo que permite la especificaci&oacute;n de m&aacute;s de uno. La clase de listener debe implantar la interfaz <code>org.apache.catalina.ContainerListener</code> o <code>org.apache.catalina.LifecycleListener</code>. Por ejemplo:</p>
<pre>
&lt;property name="listener_1"
value="org.glassfish.extension.MyLifecycleListener"
</pre>
<p>Puede configurar esta propiedad para una determinada aplicaci&oacute;n web. Para obtener m&aacute;s informaci&oacute;n, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>glassfish-web-app</i> en <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt><code>errorReportValve</code></dt>
<dd>
<p>Especifica un nombre de clase completamente cualificado de una v&aacute;lvula personalizada que genera p&aacute;ginas de error por defecto para aplicaciones en este servidor virtual. Especifique una cadena vac&iacute;a para desactivar el mecanismo de p&aacute;ginas de error por defecto para este servidor virtual.</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
