<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-virtualservernew" name="ref-virtualservernew"></a><a id="GHWEB00011" name="GHWEB00011"></a></p>

<h4><a id="sthref122" name="sthref122"></a>Nuevo servidor virtual</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Nuevo Servidor Virtual para crear un servidor virtual.</p>
<p>La p&aacute;gina Nuevo Servidor Virtual contiene las siguientes opciones.</p>
<dl>
<dt>Nombre de Configuraci&oacute;n</dt>
<dd>
<p>Nombre de la configuraci&oacute;n a la que se aplican los valores de esta p&aacute;gina. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>ID</dt>
<dd>
<p>Identificador de servidor virtual visible internamente. No se muestra a los clientes HTTP. Los nombres de host que se muestran a los clientes HTTP se deben especificar en el campo Hosts.</p>
</dd>
<dt>Hosts</dt>
<dd>
<p>Nombre o nombres de host para la m&aacute;quina en el que se ejecuta el servidor. Utilice nombres de host reales o virtuales que est&eacute;n registrados en el servidor DNS de la red (y, en un sistema UNIX, en el archivo <code>/etc/hosts</code>). El valor por defecto es el valor de la propiedad del sistema <code>${com.sun.aas.hostName}</code>.</p>
</dd>
<dt>Estado</dt>
<dd>
<p>Estado deseado para el servidor virtual. El valor puede ser cualquiera de los siguientes:</p>
<dl>
<dt>Activado</dt>
<dd>
<p>El servidor virtual est&aacute; activo. &Eacute;ste es el valor por defecto.</p>
</dd>
<dt>Desactivado</dt>
<dd>
<p>El servidor virtual est&aacute; inactivo. Los intentos de acceder al servidor generar&aacute;n el c&oacute;digo de error 404 (recurso no disponible).</p>
</dd>
<dt>Desactivado</dt>
<dd>
<p>El servidor virtual est&aacute; desactivado. Los intentos de acceder al servidor generar&aacute;n el c&oacute;digo de error 403 (denegaci&oacute;n de cumplimiento de la solicitud).</p>
</dd>
</dl>
</dd>
<dt>SSO</dt>
<dd>
<p>Especifica si el comportamiento de single sign-on se hereda del servicio HTTP, activado o desactivado. Por defecto, se hereda del servicio HTTP. Si esta opci&oacute;n se encuentra activada, el single sign-on est&aacute; activado para aplicaciones web que se han configurado para el mismo dominio en este servidor virtual. Si esta opci&oacute;n est&aacute; desactivada, el single sign-on est&aacute; desactivado para este servidor virtual y los usuarios deben autenticarse por separado para cada aplicaci&oacute;n del servidor virtual.</p>
</dd>
<dt>Listeners de Red</dt>
<dd>
<p>Listener o listeners de red asociados a este servidor, si los hubiera.</p>
</dd>
<dt>M&oacute;dulo Web por Defecto</dt>
<dd>
<p>El m&oacute;dulo web desplegado (si lo hay) que debe responder a todas las solicitudes que no pueden asignarse a otros m&oacute;dulos web desplegados en el servidor virtual. Si no se especifica un m&oacute;dulo web por defecto, se utiliza un m&oacute;dulo web con una ra&iacute;z de contexto vac&iacute;a. Si no hay ning&uacute;n m&oacute;dulo web con una ra&iacute;z de contexto vac&iacute;a, se crea y utiliza un m&oacute;dulo web por defecto del sistema.</p>
</dd>
<dt>Archivo Log</dt>
<dd>
<p>Nombre de ruta de acceso del archivo en el que aparecer&aacute;n los mensajes de registro de este servidor virtual. Por defecto, los mensajes de registro aparecer&aacute;n en domain-dir<code>/logs/server.log</code>.</p>
</dd>
<dt>Ra&iacute;z de Documento</dt>
<dd>
<p>Ruta de acceso absoluta al directorio ra&iacute;z de documentos del servidor. El valor por defecto es domain-dir<code>/docroot</code>.</p>
</dd>
<dt>Registro de Acceso</dt>
<dd>
<p>Especifica si el registro de acceso se hereda del servicio HTTP, activado o desactivado. Por defecto, se hereda del servicio HTTP.</p>
</dd>
<dt>Directorio</dt>
<dd>
<p>Ruta de acceso de directorio absoluta a los logs de acceso del servidor. El valor por defecto es domain-dir<code>/logs/access</code>.</p>
</dd>
<dt>Propiedades Adicionales</dt>
<dd>
<p>Propiedades adicionales para el servidor virtual.</p>
<p>Para obtener m&aacute;s informaci&oacute;n sobre las propiedades disponibles, consulte <a href="ref-virtualserverprops.html">Propiedades espec&iacute;ficas de servidores virtuales</a>.</p>
</dd>
</dl>
<a id="sthref123" name="sthref123"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-virtualservercreate.html">Para crear un servidor virtual</a></p>
</li>
<li>
<p><a href="task-virtualserveredit.html">Para editar un servidor virtual</a></p>
</li>
<li>
<p><a href="task-virtualserverdelete.html">Para suprimir un servidor virtual</a></p>
</li>
</ul>
<a id="sthref124" name="sthref124"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00062"><code>create-virtual-server</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00207"><code>list-virtual-servers</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00113"><code>delete-virtual-server</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
