<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-protocolnew" name="ref-protocolnew"></a><a id="GHWEB00019" name="GHWEB00019"></a></p>

<h4><a id="sthref142" name="sthref142"></a>Nuevo protocolo</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Nuevo Protocolo para crear un nuevo protocolo de red.</p>
<p>Despu&eacute;s de crear un protocolo, debe crear normalmente un listener de red con el mismo nombre y asociarlo al protocolo. Si lo desea, tambi&eacute;n puede crear un listener de red y hacer que se cree un protocolo con configuraci&oacute;n por defecto al mismo tiempo.</p>
<p>La p&aacute;gina Nuevo Protocolo contiene las siguientes opciones.</p>
<dl>
<dt>Nombre de Configuraci&oacute;n</dt>
<dd>
<p>Nombre de la configuraci&oacute;n a la que se aplican los valores de esta p&aacute;gina. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>Nombre</dt>
<dd>
<p>Nombre &uacute;nico del protocolo. Nombre de protocolo no puede empezar con un n&uacute;mero.</p>
</dd>
<dt>Seguridad</dt>
<dd>
<p>Si se selecciona esta opci&oacute;n, se activa la seguridad para el protocolo. Esta opci&oacute;n se activada por defecto. Si activa la seguridad, puede utilizar el separador SSL de la p&aacute;gina Editar Protocolo para modificar la configuraci&oacute;n de seguridad.</p>
</dd>
<dt>Estado</dt>
<dd>
<p>Si se selecciona esta opci&oacute;n, se activa la cach&eacute; de archivos. Esta opci&oacute;n se encuentra activada por defecto.</p>
</dd>
<dt>Antig&uuml;edad M&aacute;xima</dt>
<dd>
<p>Antig&uuml;edad m&aacute;xima, en segundos, de una entrada en cach&eacute; v&aacute;lida.</p>
<p>Este par&aacute;metro controla el tiempo que se utiliza la informaci&oacute;n en cach&eacute; despu&eacute;s de que un archivo se haya almacenado en cach&eacute;. Una entrada m&aacute;s antigua que la antig&uuml;edad m&aacute;xima se sustituye por una nueva entrada para el mismo archivo. Si su contenido no cambia con frecuencia, aumente este valor para mejorar el rendimiento.</p>
<p>La antig&uuml;edad m&aacute;xima &oacute;ptima depende de si los archivos existentes se modifican con regularidad. Por ejemplo, si los archivos se modifican cuatro veces al d&iacute;a en intervalos regulares, plant&eacute;ese definir la antig&uuml;edad m&aacute;xima en 21.600 segundos (6 horas). De lo contrario, una vez que el archivo haya sido modificado, considere definir la antig&uuml;edad m&aacute;xima en el per&iacute;odo de tiempo mayor que desee servir a la versi&oacute;n anterior de un archivo.</p>
<p>El valor por defecto es 30.</p>
</dd>
<dt>Tama&ntilde;o de cach&eacute; m&aacute;ximo</dt>
<dd>
<p>Tama&ntilde;o m&aacute;ximo total (en bytes) de la cach&eacute; de archivos en disco. El valor por defecto es 10485760.</p>
</dd>
<dt>Recuento M&aacute;ximo de Archivos</dt>
<dd>
<p>N&uacute;mero m&aacute;ximo de archivos que se pueden almacenar en la cach&eacute; de archivos.</p>
<p>Si el valor es demasiado grande, el servidor almacena en cach&eacute; archivos que no son estrictamente necesarios, lo que desperdicia memoria. Si el valor es demasiado peque&ntilde;o, no se aprovechan las ventajas del almacenamiento en cach&eacute;. Pruebe distintos valores de este atributo para determinar la soluci&oacute;n &oacute;ptima para aplicaciones espec&iacute;ficas.</p>
<p>El valor por defecto es 1024.</p>
</dd>
<dt>Nombre de servidor</dt>
<dd>
<p>Nombre de host que se utiliza en las URL que el servidor env&iacute;a al cliente. Este nombre es el nombre de alias si el servidor utiliza un alias. Si el servidor no utiliza un alias, deje vac&iacute;o este campo.</p>
<p>Este valor afecta a las URL que genera autom&aacute;ticamente el servidor; no afecta a las URL de los directorios y archivos almacenados en el servidor. Si el servidor utiliza un alias, el nombre-servidor deber&iacute;a ser el nombre de alias. Si se agregan dos puntos y un n&uacute;mero de puerto, dicho puerto se usar&aacute; en las URL que el servidor env&iacute;a al cliente.</p>
</dd>
<dt>Servidor Virtual por Defecto</dt>
<dd>
<p>Servidor virtual que se va a asociar a este protocolo. Utilice la p&aacute;gina Servidores Virtuales para definir los servidores virtuales.</p>
</dd>
<dt>Puerto de Redireccionamientos</dt>
<dd>
<p>Valor de puerto que redirige una solicitud a otro puerto. GlassFish Server redirige autom&aacute;ticamente la solicitud si se dan estas dos condiciones:</p>
<ul>
<li>
<p>El listener de red que hace referencia a este protocolo soporta otras solicitudes que no son SSL.</p>
</li>
<li>
<p>Se recibe una solicitud para la que una restricci&oacute;n de seguridad coincidente requiere transporte SSL.</p>
</li>
</ul>
<p>Si no se especifica un puerto de redireccionamientos, GlassFish Server utiliza el n&uacute;mero de puerto especificado en la solicitud original. Por defecto, no se especifica ning&uacute;n puerto.</p>
</dd>
<dt>N&uacute;mero M&aacute;ximo de Conexiones</dt>
<dd>
<p>Especifica el n&uacute;mero m&aacute;ximo de solicitudes que se pueden canalizar hasta que el servidor cierre la conexi&oacute;n. El subsistema de mantenimiento de conexiones sondea peri&oacute;dicamente las conexiones inactivas. El valor por defecto es 256.</p>
<p>Defina esta propiedad en 1 para desactivar el mantenimiento de conexiones HTTP/1.0, as&iacute; como la pipelining y el mantenimiento de conexiones HTTP/1.1. Un valor de 0 significa que las solicitudes ser&aacute;n siempre rechazadas. Un valor de -1 no define ning&uacute;n l&iacute;mite en cuanto al n&uacute;mero de conexiones del mantenimiento de conexiones.</p>
</dd>
<dt>Timeout</dt>
<dd>
<p>Tiempo m&aacute;ximo en segundos que una conexi&oacute;n puede considerarse como inactiva y conservarse en el estado de mantenimiento de conexiones. Un valor de 0 o menos significa que las conexiones del mantenimiento de conexiones ese mantienen abiertas de forma indefinida. El valor por defecto es 30 segundos.</p>
</dd>
<dt>Timeout de Carga</dt>
<dd>
<p>Si esta opci&oacute;n se encuentra seleccionada, la conexi&oacute;n a un servlet que lee bytes lentamente se cerrar&aacute; tras alcanzarse el l&iacute;mite de Timeout de Carga de Conexi&oacute;n. Si esta opci&oacute;n se encuentra desactivada, las conexiones del servlet no sufren un timeout. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Timeout de Carga de Conexi&oacute;n</dt>
<dd>
<p>Timeout para cargas en milisegundos. Este campo &uacute;nicamente se aplica si se ha activado la casilla de control de activaci&oacute;n de timeout de carga. El valor por defecto es 300000 milisegundos.</p>
</dd>
<dt>Timeout de Solicitud</dt>
<dd>
<p>N&uacute;mero de segundos antes de que se agote el timeout de una solicitud. Si la solicitud no se procesa antes de alcanzarse el valor de timeout, se ignorar&aacute; la solicitud. El valor por defecto es 30 segundos.</p>
</dd>
<dt>Tama&ntilde;o de Buffer de Env&iacute;o</dt>
<dd>
<p>Tama&ntilde;o en bytes del buffer de env&iacute;o. El valor por defecto es 8192 bytes.</p>
</dd>
<dt>Longitud de Buffer de Cabecera</dt>
<dd>
<p>Tama&ntilde;o en bytes del buffer utilizado por los threads de procesamiento de solicitudes para leer los datos de las solicitudes. El valor por defecto es 8192 bytes.</p>
</dd>
<dt>Tama&ntilde;o M&aacute;ximo de Publicaci&oacute;n</dt>
<dd>
<p>Tama&ntilde;o m&aacute;ximo en bytes de las acciones POST. El valor por defecto es 2097152 bytes.</p>
</dd>
<dt>Codificaci&oacute;n de URI</dt>
<dd>
<p>El nombre del juego de caracteres que se utiliza para decodificar los URI de solicitud recibidos. El valor debe ser un nombre de juego de caracteres IANA v&aacute;lido. El valor por defecto es UTF-8.</p>
</dd>
<dt>Versi&oacute;n</dt>
<dd>
<p>Versi&oacute;n del protocolo HTTP utilizado. El valor por defecto es HTTP/1.1.</p>
</dd>
<dt>Compresi&oacute;n</dt>
<dd>
<p>Especifica el uso de compresi&oacute;n GZIP HTTP/1.1 para ahorrar ancho de banda de servidor. Las opciones disponibles son:</p>
<dl>
<dt><code>on</code></dt>
<dd>
<p>Comprime datos.</p>
</dd>
<dt><code>off</code></dt>
<dd>
<p>Desactiva la compresi&oacute;n.</p>
</dd>
<dt><code>force</code></dt>
<dd>
<p>Fuerza la compresi&oacute;n de datos en todos los casos.</p>
</dd>
</dl>
<p>El valor por defecto es <code>off</code>.</p>
</dd>
<dt>Tipos MIME Comprimibles</dt>
<dd>
<p>Una lista separada por comas de los tipos MIME para los que se haya utilizado compresi&oacute;n HTTP. El valor por defecto es <code>text/html,text/xml,text/plain</code>.</p>
</dd>
<dt>Tama&ntilde;o M&iacute;nimo de Compresi&oacute;n</dt>
<dd>
<p>Tama&ntilde;o m&iacute;nimo de un archivo cuando se le aplica compresi&oacute;n. Este valor debe configurarse si Compresi&oacute;n se define en <code>on</code> o <code>force</code>. El valor por defecto es 2048 bytes.</p>
</dd>
<dt>Agentes de Usuario sin Compresi&oacute;n</dt>
<dd>
<p>Una lista separada por comas de expresiones regulares que coinciden con agentes de usuario de clientes HTTP para los que no se debe usar compresi&oacute;n. Por defecto, este valor es una cadena vac&iacute;a.</p>
</dd>
<dt>Agente de Usuario Restringido</dt>
<dd>
<p>Lista de agentes de usuario restringidos a los que se les aplica compresi&oacute;n HTTP. Si no se ha especificado ning&uacute;n agente de usuario, se aplica la compresi&oacute;n HTTP a todos los agentes de usuario. Por defecto, no hay agentes de usuario especificados.</p>
</dd>
<dt>Tipo de Respuesta por Defecto</dt>
<dd>
<p>Una cadena que especifica el tipo de respuesta por defecto. El formato es una cadena separada por punto y coma que incluye el tipo de contenido, la codificaci&oacute;n, el idioma y el juego de caracteres. El valor por defecto es <code>text/html; charset=iso-8859-1</code>.</p>
</dd>
<dt>Tipo de Respuesta Forzada</dt>
<dd>
<p>Cadena que especifica el tipo de solicitud utilizado en caso de que no haya ninguna asignaci&oacute;n MIME disponible que coincida con la extensi&oacute;n del archivo. El formato es una cadena separada por punto y coma que incluye el tipo de contenido, la codificaci&oacute;n, el idioma y el juego de caracteres. El valor por defecto es <code>text/html; charset=iso-8859-1</code>.</p>
</dd>
<dt>Adaptador</dt>
<dd>
<p>Nombre de clase del adaptador de recursos est&aacute;tico. El valor por defecto es <code>com.sun.grizzly.tcp.StaticResourcesAdapter</code>.</p>
</dd>
<dt>Soporte de Comet</dt>
<dd>
<p>Si esta opci&oacute;n se encuentra seleccionada, el soporte de Comet estar&aacute; activado para el listener de red que hace referencia a este protocolo. Por defecto, esta opci&oacute;n se encuentra desactivada. Si el servlet o la p&aacute;gina JSP utiliza tecnolog&iacute;a Comet, aseg&uacute;rese de que se ha inicializado cuando se inicia GlassFish Server al agregar el elemento <code>load-on-startup</code> al archivo <code>web.xml</code>. Por ejemplo:</p>
<pre>
&lt;servlet&gt;
&lt;servlet-name&gt;CheckIn&lt;/servlet-name&gt;
&lt;servlet-class&gt;CheckInServlet&lt;/servlet-class&gt;
&lt;load-on-startup&gt;0&lt;/load-on-startup&gt;
&lt;/servlet&gt;
</pre></dd>
<dt>B&uacute;squeda de DNS</dt>
<dd>
<p>Si est&aacute; opci&oacute;n se encuentra seleccionada, la b&uacute;squeda de DNS estar&aacute; activada. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>B&uacute;squeda de DNS</dt>
<dd>
<p>Si est&aacute; opci&oacute;n se encuentra seleccionada, la b&uacute;squeda de DNS estar&aacute; activada. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Soporte de RCM</dt>
<dd>
<p>Si esta opci&oacute;n se encuentra seleccionada, la Gesti&oacute;n de Configuraci&oacute;n de Recursos (RCM) est&aacute; activada. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Rastreo</dt>
<dd>
<p>Si esta opci&oacute;n se encuentra seleccionada, la operaci&oacute;n TRACE est&aacute; activada. Si esta opci&oacute;n se encuentra desactivada, GlassFish Server es menos susceptible de sufrir ataques de script entre sitios. Esta opci&oacute;n se encuentra activada por defecto.</p>
</dd>
<dt>Traspaso de Autenticaci&oacute;n</dt>
<dd>
<p>Si esta opci&oacute;n se encuentra seleccionada, eso indica que el listener de red que utiliza este protocolo recibe tr&aacute;fico desde un servidor proxy con terminaci&oacute;n SSL. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Fragmentaci&oacute;n</dt>
<dd>
<p>Si esta opci&oacute;n se encuentra seleccionada, la fragmentaci&oacute;n de respuesta HTTP est&aacute; activada. Esta opci&oacute;n se encuentra activada por defecto.</p>
</dd>
<dt>X-Powered-By</dt>
<dd>
<p>Si est&aacute; seleccionada esta opci&oacute;n, se utilizan estas cabeceras de <code>X-Powered-By</code> conforme a las especificaciones de Java Servlet 3.0 y Java Server Pages 2.0. Esta opci&oacute;n se encuentra activada por defecto.</p>
</dd>
<dt>Barra Inclinada Codificada</dt>
<dd>
<p>Si se selecciona esta opci&oacute;n, se permite que las URI contengan barras inclinadas codificadas. Esta opci&oacute;n se activada por defecto.</p>
</dd>
<dt>Soporte de Sockets Web</dt>
<dd>
<p>Si se selecciona esta opci&oacute;n, se soporta el protocolo sockets web. Esta opci&oacute;n se activada por defecto.</p>
</dd>
</dl>
<a id="sthref143" name="sthref143"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-protocolnew.html">Para crear un protocolo</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">Para editar un protocolo</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">Para editar la configuraci&oacute;n SSL para un protocolo</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">Para editar la configuraci&oacute;n HTTP para un protocolo</a></p>
</li>
<li>
<p><a href="task-protocolfilecacheedit.html">Para editar la configuraci&oacute;n de cach&eacute; de archivos para un protocolo</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">Para suprimir un protocolo</a></p>
</li>
</ul>
<a id="sthref144" name="sthref144"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00051"><code>create-protocol</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00195"><code>list-protocols</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00103"><code>delete-protocol</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
