<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-protocolnew" name="task-protocolnew"></a></p>

<h4><a id="sthref50" name="sthref50"></a>Para crear un protocolo</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Configuraci&oacute;n.</p>
</li>
<li>
<p>En el nodo Configuraci&oacute;n, ampl&iacute;e el nodo Configuraci&oacute;n de Red.</p>
</li>
<li>
<p>En el nodo Configuraci&oacute;n de Red, seleccione el nodo Protocolos.</p>
<p>Se abrir&aacute; la p&aacute;gina Protocolos.</p>
</li>
<li>
<p>En la p&aacute;gina Protocolos, haga clic en Nuevo.</p>
<p>Se abrir&aacute; la p&aacute;gina Nuevo Protocolo.</p>
</li>
<li>
<p>En el campo Nombre, introduzca un nombre &uacute;nico para el protocolo.</p>
</li>
<li>
<p>Active la casilla de control Seguridad activada para activar la seguridad del protocolo.</p>
<p>Esta opci&oacute;n se activada por defecto. Si activa la seguridad, puede utilizar el separador SSL de la p&aacute;gina Editar Protocolo para modificar la configuraci&oacute;n de seguridad.</p>
</li>
<li>
<p>Active la casilla de control Estado activado para activar la cach&eacute; de archivos.</p>
<p>Esta opci&oacute;n se encuentra activada por defecto.</p>
</li>
<li>
<p>En el campo Antig&uuml;edad M&aacute;xima, introduzca la antig&uuml;edad m&aacute;xima en segundos de una entrada de cach&eacute; v&aacute;lida.</p>
<p>Este par&aacute;metro controla el tiempo que se utiliza la informaci&oacute;n en cach&eacute; despu&eacute;s de que un archivo se haya almacenado en cach&eacute;. Una entrada m&aacute;s antigua que la antig&uuml;edad m&aacute;xima se sustituye por una nueva entrada para el mismo archivo. Si su contenido no cambia con frecuencia, aumente este valor para mejorar el rendimiento.</p>
<p>La antig&uuml;edad m&aacute;xima &oacute;ptima depende de si los archivos existentes se modifican con regularidad. Por ejemplo, si los archivos se modifican cuatro veces al d&iacute;a en intervalos regulares, plant&eacute;ese definir la antig&uuml;edad m&aacute;xima en 21.600 segundos (6 horas). De lo contrario, una vez que el archivo haya sido modificado, considere definir la antig&uuml;edad m&aacute;xima en el per&iacute;odo de tiempo mayor que desee servir a la versi&oacute;n anterior de un archivo.</p>
<p>El valor por defecto es 30.</p>
</li>
<li>
<p>En el campo Tama&ntilde;o de Cach&eacute; M&aacute;ximo, escriba el tama&ntilde;o m&aacute;ximo total (en bytes) de la cach&eacute; de archivos del disco.</p>
<p>El valor por defecto es 10485760.</p>
</li>
<li>
<p>En el campo Recuento M&aacute;ximo de Archivos, introduzca el n&uacute;mero m&aacute;ximo de archivos que se puede almacenar en la cach&eacute; de archivos.</p>
<p>Si el valor es demasiado grande, el servidor almacena en cach&eacute; archivos que no son estrictamente necesarios, lo que desperdicia memoria. Si el valor es demasiado peque&ntilde;o, no se aprovechan las ventajas del almacenamiento en cach&eacute;. Pruebe distintos valores de este atributo para determinar la soluci&oacute;n &oacute;ptima para aplicaciones espec&iacute;ficas.</p>
<p>El valor por defecto es 1024.</p>
</li>
<li>
<p>En el campo Nombre de Servidor, introduzca el nombre del host que se va a utilizar en las URL que el servidor env&iacute;a al cliente.</p>
<p>Este nombre es el nombre de alias si el servidor utiliza un alias. Si el servidor no utiliza un alias, deje vac&iacute;o este campo.</p>
<p>Este valor afecta a las URL que genera autom&aacute;ticamente el servidor; no afecta a las URL de los directorios y archivos almacenados en el servidor. Si el servidor utiliza un alias, el nombre-servidor deber&iacute;a ser el nombre de alias. Si se agregan dos puntos y un n&uacute;mero de puerto, dicho puerto se usar&aacute; en las URL que el servidor env&iacute;a al cliente.</p>
</li>
<li>
<p>En la lista desplegable Servidor Virtual por Defecto, seleccione el servidor virtual asociado a este protocolo.</p>
<p>Utilice la p&aacute;gina Servidores Virtuales para definir los servidores virtuales.</p>
</li>
<li>
<p>En el campo Puerto de Redireccionamientos, introduzca el valor del puerto que se utilizar&aacute; para redireccionar una solicitud a otro puerto.</p>
<p>GlassFish Server redirige autom&aacute;ticamente la solicitud si se dan estas dos condiciones:</p>
<ul>
<li>
<p>El listener de red que hace referencia a este protocolo soporta otras solicitudes que no son SSL.</p>
</li>
<li>
<p>Se recibe una solicitud para la que una restricci&oacute;n de seguridad coincidente requiere transporte SSL.</p>
</li>
</ul>
<p>Si no se especifica un puerto de redireccionamientos, GlassFish Server utiliza el n&uacute;mero de puerto especificado en la solicitud original. Por defecto, no se especifica ning&uacute;n puerto.</p>
</li>
<li>
<p>En el campo N&uacute;mero M&aacute;ximo de Conexiones, introduzca el n&uacute;mero m&aacute;ximo de solicitudes que se pueden canalizar hasta que el servidor cierra la conexi&oacute;n.</p>
<p>El subsistema de mantenimiento de conexiones sondea peri&oacute;dicamente las conexiones inactivas. El valor por defecto es 256.</p>
<p>Defina esta propiedad en 1 para desactivar el mantenimiento de conexiones HTTP/1.0, as&iacute; como la pipelining y el mantenimiento de conexiones HTTP/1.1. Un valor de 0 significa que las solicitudes ser&aacute;n siempre rechazadas. Un valor de -1 no define ning&uacute;n l&iacute;mite en cuanto al n&uacute;mero de conexiones del mantenimiento de conexiones.</p>
</li>
<li>
<p>En el campo Timeout, introduzca el tiempo m&aacute;ximo en segundos que una conexi&oacute;n puede considerarse inactiva y conservarse en estado de mantenimiento de conexiones.</p>
<p>Un valor de 0 o menos significa que las conexiones del mantenimiento de conexiones ese mantienen abiertas de forma indefinida. El valor por defecto es 30 segundos.</p>
</li>
<li>
<p>Active la casilla de control de activaci&oacute;n de timeout de carga para que la conexi&oacute;n de un servlet que lea bytes lentamente se cierre tras alcanzarse el l&iacute;mite indicado en Timeout de carga de conexi&oacute;n.</p>
<p>Si esta opci&oacute;n se encuentra desactivada, las conexiones del servlet no sufren un timeout. Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>En el campo Timeout de Carga de Conexi&oacute;n, introduzca el timeout de carga en milisegundos.</p>
<p>Este campo &uacute;nicamente se aplica si se ha activado la casilla de control de desactivaci&oacute;n de Timeout de Carga. El valor por defecto es 300000 milisegundos.</p>
</li>
<li>
<p>En el campo Timeout de Solicitud, introduzca el n&uacute;mero de segundos que deben transcurrir antes de que la solicitud sufra un timeout.</p>
<p>Si la solicitud no se procesa antes de alcanzarse el valor de timeout, se ignorar&aacute; la solicitud. El valor por defecto es 30 segundos.</p>
</li>
<li>
<p>En el campo Tama&ntilde;o de Buffer de Env&iacute;o, introduzca el tama&ntilde;o en bytes del buffer de env&iacute;o.</p>
<p>El valor por defecto es 8192 bytes.</p>
</li>
<li>
<p>En el campo Longitud de Buffer de Cabecera, introduzca el tama&ntilde;o en bytes del buffer que utilizan los threads de procesamiento de solicitudes para leer los datos de las solicitudes.</p>
<p>El valor por defecto es 8192 bytes.</p>
</li>
<li>
<p>En el campo Tama&ntilde;o M&aacute;ximo de Publicaci&oacute;n, especifique el tama&ntilde;o m&aacute;ximo en bytes de las acciones POST.</p>
<p>El valor por defecto es 2097152 bytes.</p>
</li>
<li>
<p>En el campo Codificaci&oacute;n de URI, escriba el nombre del juego de caracteres utilizado para descodificar los URI de solicitudes recibidos.</p>
<p>El valor debe ser un nombre de juego de caracteres IANA v&aacute;lido. El valor por defecto es UTF-8.</p>
</li>
<li>
<p>En el campo Versi&oacute;n, introduzca la versi&oacute;n del protocolo HTTP utilizado.</p>
<p>El valor por defecto es HTTP/1.1.</p>
</li>
<li>
<p>En la lista desplegable Compresi&oacute;n, seleccione la compresi&oacute;n GZIP HTTP/1.1 para ahorrar ancho de banda de servidor.</p>
<p>Las opciones disponibles son:</p>
<dl>
<dt><code>on</code></dt>
<dd>
<p>Comprime datos.</p>
</dd>
<dt><code>off</code></dt>
<dd>
<p>Desactiva la compresi&oacute;n.</p>
</dd>
<dt><code>force</code></dt>
<dd>
<p>Fuerza la compresi&oacute;n de datos en todos los casos.</p>
</dd>
</dl>
<p>El valor por defecto es <code>off</code>.</p>
</li>
<li>
<p>En el campo Tipos MIME Comprimibles, escriba una lista separada por comas de los tipos MIME para los que se utiliza la compresi&oacute;n HTTP.</p>
<p>El valor por defecto es <code>text/html,text/xml,text/plain</code>.</p>
</li>
<li>
<p>En el campo Tama&ntilde;o M&iacute;nimo de Compresi&oacute;n, escriba el tama&ntilde;o m&iacute;nimo de un archivo cuando se le aplica compresi&oacute;n.</p>
<p>Este valor debe configurarse si Compresi&oacute;n se define en <code>on</code> o <code>force</code>. El valor por defecto es 2048 bytes.</p>
</li>
<li>
<p>En el campo Agentes de Usuario sin Compresi&oacute;n, escriba una lista separada por comas de expresiones regulares que coinciden con agentes de usuario de clientes HTTP para los que no se debe usar compresi&oacute;n.</p>
<p>Por defecto, este valor es una cadena vac&iacute;a.</p>
</li>
<li>
<p>En el campo Agente de Usuario Restringido, escriba una lista de agentes de usuario restringidos a los que se les aplica compresi&oacute;n HTTP.</p>
<p>Si no se ha especificado ning&uacute;n agente de usuario, se aplica la compresi&oacute;n HTTP a todos los agentes de usuario. Por defecto, no hay agentes de usuario especificados.</p>
</li>
<li>
<p>En el campo Tipo de Respuesta por Defecto, escriba una cadena que especifique el tipo de respuesta por defecto.</p>
<p>El formato es una cadena separada por punto y coma que incluye el tipo de contenido, la codificaci&oacute;n, el idioma y el juego de caracteres. El valor por defecto es <code>text/html; charset=iso-8859-1</code>.</p>
</li>
<li>
<p>En el campo Tipo de Respuesta Forzada, escriba una cadena que especifique el tipo de solicitud utilizado en caso de que no haya ninguna asignaci&oacute;n MIME disponible que coincida con la extensi&oacute;n del archivo.</p>
<p>El formato es una cadena separada por punto y coma que incluye el tipo de contenido, la codificaci&oacute;n, el idioma y el juego de caracteres. El valor por defecto es <code>text/html; charset=iso-8859-1</code>.</p>
</li>
<li>
<p>En el campo Adaptador, escriba el nombre de clase del adaptador de recursos est&aacute;tico.</p>
<p>El valor por defecto es <code>com.sun.grizzly.tcp.StaticResourcesAdapter</code>.</p>
</li>
<li>
<p>Active la casilla de control de activaci&oacute;n de soporte de Comet para activar el soporte de Comet para el listener de red que hace referencia a este protocolo.</p>
<p>Por defecto, esta opci&oacute;n se encuentra desactivada. Si el servlet o la p&aacute;gina JSP utiliza tecnolog&iacute;a Comet, aseg&uacute;rese de que se ha inicializado cuando se inicia GlassFish Server al agregar el elemento <code>load-on-startup</code> al archivo <code>web.xml</code>. Por ejemplo:</p>
<pre>
&lt;servlet&gt;
&lt;servlet-name&gt;CheckIn&lt;/servlet-name&gt;
&lt;servlet-class&gt;CheckInServlet&lt;/servlet-class&gt;
&lt;load-on-startup&gt;0&lt;/load-on-startup&gt;
&lt;/servlet&gt;
</pre></li>
<li>
<p>Active la casilla de control de activaci&oacute;n de b&uacute;squeda de DNS para activar la b&uacute;squeda de DNS.</p>
<p>Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>Active la casilla de control de activaci&oacute;n de soporte de RCM para activar la Gesti&oacute;n de Configuraci&oacute;n de Recursos (RCM).</p>
<p>Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>Active la casilla de control de activaci&oacute;n de rastreo para activar la operaci&oacute;n TRACE.</p>
<p>Si esta opci&oacute;n se encuentra desactivada, GlassFish Server es menos susceptible de sufrir ataques de script entre sitios. Esta opci&oacute;n se encuentra activada por defecto.</p>
</li>
<li>
<p>Active la casilla de control de activaci&oacute;n de traspaso de autenticaci&oacute;n para indicar que el listener de red que utiliza este protocolo recibe tr&aacute;fico desde un servidor proxy con terminaci&oacute;n SSL.</p>
<p>Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>Active la casilla de control de activaci&oacute;n de fragmentaci&oacute;n para activar la fragmentaci&oacute;n de la respuesta HTTP.</p>
<p>Esta opci&oacute;n se encuentra activada por defecto.</p>
</li>
<li>
<p>Active la casilla de control de activaci&oacute;n de XPowered By para indicar a GlassFish Server que utilice las cabeceras de <code>X-Powered-By</code> conforme a las especificaciones de Java Servlet 3.0 y Java Server Pages 2.0.</p>
<p>Esta opci&oacute;n se encuentra activada por defecto.</p>
</li>
</ol>
<a id="sthref51" name="sthref51"></a>
<h5>Pasos Siguientes</h5>
<p>Despu&eacute;s de crear un protocolo, puede crear un listener de red que utilice el protocolo.</p>
<a id="sthref52" name="sthref52"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-networklistenernew.html">Para crear un listener de red</a></p>
</li>
<li>
<p><a href="task-networklisteneredit.html">Para editar un listener de red</a></p>
</li>
<li>
<p><a href="task-networklistenerdelete.html">Para suprimir un listener de red</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">Para editar un protocolo</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">Para editar la configuraci&oacute;n SSL para un protocolo</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">Para editar la configuraci&oacute;n HTTP para un protocolo</a></p>
</li>
<li>
<p><a href="task-protocolfilecacheedit.html">Para editar la configuraci&oacute;n de cach&eacute; de archivos para un protocolo</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">Para suprimir un protocolo</a></p>
</li>
<li>
<p><a href="task-transportnew.html">Para crear un transporte</a></p>
</li>
<li>
<p><a href="task-transportedit.html">Para editar un transporte</a></p>
</li>
<li>
<p><a href="task-transportdelete.html">Para suprimir un transporte</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
