<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-webcontaineravailability" name="task-webcontaineravailability"></a></p>

<h4><a id="sthref16" name="sthref16"></a><a id="sthref17" name="sthref17"></a><a id="sthref18" name="sthref18"></a><a id="sthref19" name="sthref19"></a>Para configurar la disponibilidad del contenedor web</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Configuraci&oacute;n.</p>
</li>
<li>
<p>Seleccione la configuraci&oacute;n que desea cambiar.</p>
</li>
<li>
<p>En el nodo de configuraci&oacute;n, seleccione el nodo Servicio de Disponibilidad.</p>
<p>Se abrir&aacute; la p&aacute;gina Servicio de disponibilidad.</p>
</li>
<li>
<p>En la p&aacute;gina Servicio de Disponibilidad, haga clic en el separador Disponibilidad de Contenedor Web.</p>
<p>Se abrir&aacute; la p&aacute;gina Disponibilidad de Contenedor Web.</p>
</li>
<li>
<p>En el campo Servicio de Disponibilidad, active la casilla Activado para activar la disponibilidad del contenedor web.</p>
<p>Para desactivar la disponibilidad, desactive la casilla Servicio de disponibilidad.</p>
</li>
<li>
<p>En la lista desplegable Tipo de Persistencia, seleccione el mecanismo de persistencia.</p>
<ul>
<li>
<p>Si Servicio de Disponibilidad Activado <i>no</i> est&aacute; activada, seleccione una de las siguientes opciones:</p>
<ul>
<li>
<p><code>memory</code> para ninguna persistencia de sesi&oacute;n</p>
</li>
<li>
<p><code>file</code> para la persistencia de sesi&oacute;n en funci&oacute;n del sistema de archivos que no es de alta disponibilidad</p>
</li>
</ul>
</li>
<li>
<p>Si la Activaci&oacute;n del Servicio de Disponibilidad est&aacute; activada, seleccione <code>replicated</code> para la persistencia de sesi&oacute;n en funci&oacute;n del failover del cluster que es de alta disponibilidad.</p>
</li>
</ul>
</li>
<li>
<p>En la lista desplegable Frecuencia de Persistencia, seleccione la frecuencia con la que se almacena la sesi&oacute;n HTTP:</p>
<ul>
<li>
<p><code>web-method</code> &mdash;: el estado de la sesi&oacute;n se almacena al final de cada solicitud web antes de enviar una respuesta al cliente. Este modo ofrece la mejor garant&iacute;a de que el estado de la sesi&oacute;n se actualizar&aacute; completamente en caso de fallo. &Eacute;ste es el valor por defecto.</p>
</li>
</ul>
<p>La frecuencia de persistencia s&oacute;lo es aplicable si el tipo de persistencia es <code>replicated</code>.</p>
</li>
<li>
<p>En la lista desplegable &Aacute;mbito de Persistencia, seleccione el &aacute;mbito de los cambios de la sesi&oacute;n HTTP necesarios para que se realice el almacenamiento:</p>
<ul>
<li>
<p><code>session</code> &mdash; se almacena el estado de la sesi&oacute;n completo cada vez. Este modo ofrece la mejor garant&iacute;a de que sus datos de sesi&oacute;n se almacenan correctamente para las aplicaciones web distribuibles.</p>
</li>
<li>
<p><code>modified-session</code> &mdash; el estado de la sesi&oacute;n completo se almacena si se ha modificado. Se considera que se ha modificado una sesi&oacute;n si se ha realizado una llamada a <code>HttpSession.setAttribute()</code> o <code>HttpSession.removeAttribute()</code>. Debe garantizar que se llama a <code>setAttribute()</code> cada vez que se cambia un atributo. Esto no es un requisito de especificaci&oacute;n de Java EE, pero es necesario para que este modo funcione correctamente.</p>
</li>
<li>
<p><code>modified-attribute</code> &mdash; s&oacute;lo se almacenan los atributos de sesi&oacute;n modificados. Para que este modo funcione correctamente, debe seguir estas directrices:</p>
<ul>
<li>
<p>Llame a <code>setAttribute()</code> cada vez que se modifique el estado de la sesi&oacute;n.</p>
</li>
<li>
<p>Aseg&uacute;rese de que no existen referencias cruzadas entre atributos. El gr&aacute;fico de objetos debajo de cada clave de atributo distinto se serializa y almacena por separado. Si hay referencias cruzadas de objetos entre los objetos de cada clave diferente, no est&aacute;n serializados ni deserializados correctamente.</p>
</li>
<li>
<p>Distribuya el estado de la sesi&oacute;n en varios atributos o por lo menos entre un atributo de s&oacute;lo lectura y uno modificable.</p>
</li>
</ul>
</li>
</ul>
<p>El &Aacute;mbito de Persistencia s&oacute;lo es aplicable si el Tipo de Persistencia es <code>replicated</code>.</p>
</li>
<li>
<p>En el campo Estado de Single-Sign-On, active la casilla Activado para que el estado de single sign-on est&eacute; disponible para el failover.</p>
<p>Para que el estado de single sign-on no est&eacute; disponible para el failover, desactive la casilla de activaci&oacute;n de estado de single-sign-on.</p>
</li>
<li>
<p>Para restaurar los valores por defecto de toda la configuraci&oacute;n, haga clic en el bot&oacute;n Cargar Valores por Defecto.</p>
</li>
<li>
<p>En la secci&oacute;n Propiedades Adicionales, especifique las propiedades adicionales.</p>
<p>GlassFish Server no define ninguna propiedad adicional para la disponibilidad de contenedor web.</p>
<ul>
<li>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, introduzca el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
</li>
<li>
<p>Para modificar una propiedad, edite el campo Valor.</p>
</li>
<li>
<p>Para suprimir una propiedad, active la casilla de control a la izquierda del campo Nombre de la propiedad que est&aacute; suprimiendo y, a continuaci&oacute;n, haga clic en el bot&oacute;n Suprimir Propiedades.</p>
</li>
</ul>
</li>
<li>
<p>Haga clic en Guardar.</p>
</li>
</ol>
<a id="sthref20" name="sthref20"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-webcontainergeneral.html">Para configurar las propiedades generales para el contenedor web</a></p>
</li>
<li>
<p><a href="task-webcontainersessiontimeout.html">Para configurar las propiedades de la sesi&oacute;n para el contenedor web</a></p>
</li>
<li>
<p><a href="task-webcontainermanagerprops.html">Para configurar propiedades del gestor para el contenedor web</a></p>
</li>
<li>
<p><a href="task-webcontainerstoreprops.html">Para configurar las propiedades del almac&eacute;n para el contenedor web</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
