<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-threadpoolnew" name="task-threadpoolnew"></a><a id="GHWEB00051" name="GHWEB00051"></a></p>

<h4><a id="sthref73" name="sthref73"></a>Para crear un pool de threads</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Los pools de threads los utilizan los listeners de red y el ORB. Normalmente, un listener de red utiliza uno de los dos pools de threads que se crean al instalar GlassFish Server y ORB utiliza el otro. Puede editar cualquiera de estos pools de threads por defecto para especificar la configuraci&oacute;n adecuada para sus aplicaciones o sistemas de hardware, o bien puede crear y utilizar un pool de threads con esta configuraci&oacute;n.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Configuraci&oacute;n.</p>
</li>
<li>
<p>En el nodo Configuraci&oacute;n, seleccione el nodo Pools de Threads.</p>
<p>Se abrir&aacute; la p&aacute;gina Pools de Threads.</p>
</li>
<li>
<p>En la p&aacute;gina Pools de Threads, haga clic en Nuevo.</p>
<p>Se abrir&aacute; la p&aacute;gina Nuevo Pool de Threads.</p>
</li>
<li>
<p>En el campo Nombre, escriba un nombre para el pool de threads.</p>
</li>
<li>
<p>En el campo Nombre de Clase, escriba el nombre de clase totalmente cualificado que implanta el pool de threads.</p>
<p>El valor por defecto es <code>com.sun.grizzly.http.StatsThreadPool</code> .</p>
</li>
<li>
<p>En el campo Tama&ntilde;o de Cola M&aacute;ximo, escriba el n&uacute;mero m&aacute;ximo de mensajes que pueden ponerse en cola hasta que haya threads disponibles para procesarlos.</p>
<p>Un valor de -1 indica que no hay l&iacute;mite en el tama&ntilde;o de la cola. El valor por defecto es 4096.</p>
</li>
<li>
<p>En el campo Tama&ntilde;o M&aacute;ximo del Pool de Threads, introduzca el n&uacute;mero m&aacute;ximo de threads que puede existir en un pool.</p>
<p>El valor por defecto es 5. &Eacute;ste es el valor recomendado de los pools de threads de listener de red.</p>
</li>
<li>
<p>En el campo Tama&ntilde;o M&iacute;nimo de Pool de Threads, introduzca el n&uacute;mero m&iacute;nimo de threads que puede existir en un pool.</p>
<p>Estos threads se crean cuando se instancia el pool de threads. El valor por defecto es 2.</p>
</li>
<li>
<p>En el campo Timeout de Thread Inactivo, introduzca el tiempo m&aacute;ximo en segundos que un thread puede permanecer inactivo en el pool.</p>
<p>Cuando transcurra este tiempo, el thread quedar&aacute; eliminado del pool. El valor por defecto es 900.</p>
</li>
<li>
<p>Haga clic en Aceptar.</p>
</li>
</ol>
<a id="sthref74" name="sthref74"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-threadpooledit.html">Para editar un pool de threads</a></p>
</li>
<li>
<p><a href="task-threadpooldelete.html">Para suprimir un pool de threads</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
