<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-accesslog" name="task-accesslog"></a><a id="GHWEB00035" name="GHWEB00035"></a></p>

<h4><a id="sthref21" name="sthref21"></a><a id="sthref22" name="sthref22"></a>Para configurar el servicio HTTP</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Configuraci&oacute;n.</p>
</li>
<li>
<p>Seleccione la configuraci&oacute;n que desea cambiar.</p>
</li>
<li>
<p>En el nodo Configuraci&oacute;n, seleccione el nodo Servicio HTTP.</p>
<p>Se abrir&aacute; la p&aacute;gina Servicio HTTP.</p>
</li>
<li>
<p>Active la casilla de control de activaci&oacute;n de SSO para activar por defecto el single sign-on para todas las aplicaciones web en todos los servidores virtuales de este servidor que se hayan configurado para el mismo dominio.</p>
<p>Puede sustituir esta configuraci&oacute;n para un servidor virtual individual. Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>Active la casilla de control de activaci&oacute;n de registro de acceso para activar el registro de acceso de todos los subelementos de servidores virtuales que no tengan especificada esta propiedad.</p>
<p>Si desactiva la casilla de control de activaci&oacute;n de registro de acceso, se desactivar&aacute; el registro de acceso de todos los subelementos de servidores virtuales que no tengan especificada esta propiedad. Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>Active la casilla de control de activaci&oacute;n de rotaci&oacute;n para activar la rotaci&oacute;n del archivo log.</p>
<p>Esta opci&oacute;n se encuentra activada por defecto.</p>
</li>
<li>
<p>En la lista desplegable Pol&iacute;tica de Rotaci&oacute;n, seleccione una pol&iacute;tica de rotaci&oacute;n.</p>
<p>La &uacute;nica pol&iacute;tica de rotaci&oacute;n disponible es <code>time</code>.</p>
</li>
<li>
<p>En el campo Intervalo de Rotaci&oacute;n, introduzca el n&uacute;mero de minutos entre las rotaciones del log de acceso.</p>
<p>Este campo s&oacute;lo es v&aacute;lido si la pol&iacute;tica de rotaci&oacute;n es <code>time</code>. El valor por defecto es 1.440 minutos (24 horas).</p>
</li>
<li>
<p>En el campo Sufijo de Rotaci&oacute;n, introduzca el valor de la cadena del sufijo que se va a agregar al final del nombre del archivo log tras la rotaci&oacute;n.</p>
<p>El valor por defecto es <code>aaaa-MM-dd</code>.</p>
<p>Aseg&uacute;rese de que el sufijo de rotaci&oacute;n contenga valores suficientes para crear un sufijo &uacute;nico para cada rotaci&oacute;n del log. Por ejemplo, si el log de acceso rota m&aacute;s de una vez al d&iacute;a, se incluye la hora del d&iacute;a en el sufijo de rotaci&oacute;n.</p>
<p>Es necesario un sufijo &uacute;nico para asegurar que el archivo log de acceso rota cada vez que transcurre el intervalo de rotaci&oacute;n. Si el sufijo de rotaci&oacute;n del nuevo archivo log de acceso es igual que el sufijo de rotaci&oacute;n del archivo log de acceso existente, el archivo no se rota.</p>
</li>
<li>
<p>En el campo Recuento M&aacute;ximo de Archivos, escriba el n&uacute;mero m&aacute;ximo de archivos log de acceso rotados que se deben guardar.</p>
<p>Un valor negativo indica que no hay l&iacute;mite en el recuento de archivos. El valor por defecto es -1.</p>
</li>
<li>
<p>En el campo Tama&ntilde;o de Buffer, introduzca el tama&ntilde;o en bytes del buffer del log de acceso.</p>
<p>Un valor inferior o igual a cero desactiva el almacenamiento en el buffer del log de acceso. El valor por defecto es 32768.</p>
</li>
<li>
<p>En el campo Intervalo de Escritura, introduzca el n&uacute;mero de segundos que deben transcurrir para que el log se escriba en el disco.</p>
<p>El log de acceso se escribe cuando el buffer est&aacute; lleno o cuando caduca el intervalo. Si el valor es menor o igual a cero, el buffer siempre se escribe aunque no est&eacute; lleno. Esto significa que cada vez que se accede al servidor, el mensaje de log se almacena directamente en el archivo. El valor por defecto es 300.</p>
</li>
<li>
<p>En el campo Formato, introduzca el valor de la cadena para especificar las propiedades siguientes del log de acceso:</p>
<ul>
<li>
<p>Informaci&oacute;n que se capturar&aacute; en el log de acceso</p>
</li>
<li>
<p>Orden en el que se capturar&aacute; la informaci&oacute;n</p>
</li>
</ul>
<p>El valor por defecto es el siguiente:</p>
<pre>
%client.name% %auth-user-name% %datetime% %request% %status% %response.length%
</pre>
<p>Los valores siguientes est&aacute;n disponibles para su inclusi&oacute;n en la cadena de formato:</p>
<dl>
<dt><code>%attribute.</code><i>nombre</i><code>%</code></dt>
<dd>
<p>Registra el valor (mediante una llamada a su m&eacute;todo <code>toString</code>) del atributo de la solicitud con el <i>nombre</i> indicado</p>
</dd>
<dt><code>%auth-user-name%</code></dt>
<dd>
<p>Nombre de usuario autorizado</p>
</dd>
<dt><code>%client.name%</code></dt>
<dd>
<p>Nombre de host del cliente</p>
</dd>
<dt><code>%client.dns%</code></dt>
<dd>
<p>DNS de cliente</p>
</dd>
<dt><code>%cookie.</code><i>nombre</i><code>%</code></dt>
<dd>
<p>El valor de la cookie de la solicitud con el <i>nombre</i> indicado</p>
</dd>
<dt><code>%cookie.value%</code></dt>
<dd>
<p>Valor de la primera cookie que se encuentra en la solicitud</p>
</dd>
<dt><code>%datetime%</code></dt>
<dd>
<p>Fecha del sistema</p>
</dd>
<dt><code>%request%</code></dt>
<dd>
<p>L&iacute;nea de solicitud HTTP completa</p>
</dd>
<dt><code>%status%</code></dt>
<dd>
<p>Estado</p>
</dd>
<dt><code>%response.length%</code></dt>
<dd>
<p>Longitud del contenido de respuesta</p>
</dd>
<dt><code>%header.referer%</code></dt>
<dd>
<p>Cabecera del referencia</p>
</dd>
<dt><code>%header.user-agent%</code></dt>
<dd>
<p>Cabecera del agente del usuario</p>
</dd>
<dt><code>%http-method%</code></dt>
<dd>
<p>M&eacute;todo HTTP</p>
</dd>
<dt><code>%http-uri%</code></dt>
<dd>
<p>URI de HTTP</p>
</dd>
<dt><code>%query-str%</code></dt>
<dd>
<p>Cadena de consulta HTTP</p>
</dd>
<dt><code>%http-version%</code></dt>
<dd>
<p>Versi&oacute;n de protocolo HTTP</p>
</dd>
<dt><code>%header.accept%</code></dt>
<dd>
<p>Cabecera de aceptaci&oacute;n</p>
</dd>
<dt><code>%header.date%</code></dt>
<dd>
<p>Cabecera de fecha</p>
</dd>
<dt><code>%header.if-mod-since%</code></dt>
<dd>
<p>Cabecera de fecha de modificaci&oacute;n</p>
</dd>
<dt><code>%header.auth%</code></dt>
<dd>
<p>Cabecera de autorizaci&oacute;n</p>
</dd>
<dt><code>%header.</code><i>cualquiera</i><code>%</code></dt>
<dd>
<p>Cualquier valor de cabecera HTTP v&aacute;lido definido en RFC 2616 (<code>cualquiera</code> tambi&eacute;n es un valor de cabecera v&aacute;lido; se especifica como variable aqu&iacute;)</p>
</dd>
<dt><code>%session.</code><i>nombre</i><code>%</code></dt>
<dd>
<p>El valor del atributo de la sesi&oacute;n con el nombre <i>nombre</i> o <code>NULL-SESSION-ATTRIBUTE-</code> si el atributo indicado no existe en la sesi&oacute;n, o <code>NULL-SESSION</code> si no existe ninguna sesi&oacute;n</p>
</dd>
<dt><code>%time-taken%</code></dt>
<dd>
<p>Tiempo (en milisegundos) que se tard&oacute; en prestar servicio a cada solicitud</p>
</dd>
<dt><code>%vs.id%</code></dt>
<dd>
<p>ID de servidor virtual</p>
</dd>
</dl>
</li>
<li>
<p>En la secci&oacute;n Propiedades Adicionales, especifique las propiedades adicionales.</p>
<p>Para obtener una descripci&oacute;n de las propiedades disponibles, consulte <a href="ref-httpserviceprops.html">Propiedades espec&iacute;ficas del servicio HTTP</a>.</p>
<ul>
<li>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, introduzca el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
</li>
<li>
<p>Para modificar una propiedad, edite el campo Valor.</p>
</li>
<li>
<p>Para suprimir una propiedad, active la casilla de control a la izquierda del campo Nombre de la propiedad que est&aacute; suprimiendo y, a continuaci&oacute;n, haga clic en el bot&oacute;n Suprimir Propiedades.</p>
</li>
</ul>
</li>
<li>
<p>Haga clic en Guardar.</p>

<hr>
<p><b>Sugerencia:</b></p>
Para volver a la configuraci&oacute;n por defecto, haga clic en el bot&oacute;n Cargar Valores por Defecto y, a continuaci&oacute;n, en Guardar.
<hr>

</li>
</ol>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
