<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-protocolfilecacheedit" name="task-protocolfilecacheedit"></a></p>

<h4><a id="sthref62" name="sthref62"></a><a id="sthref63" name="sthref63"></a>Para editar la configuraci&oacute;n de cach&eacute; de archivos para un protocolo</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Configuraci&oacute;n.</p>
</li>
<li>
<p>En el nodo Configuraci&oacute;n, ampl&iacute;e el nodo Configuraci&oacute;n de Red.</p>
</li>
<li>
<p>En el nodo Configuraci&oacute;n de Red, seleccione el nodo Protocolos.</p>
<p>Se abrir&aacute; la p&aacute;gina Protocolos.</p>
</li>
<li>
<p>En la p&aacute;gina Protocolos, haga clic en el nombre del protocolo que est&aacute; editando.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar Protocolo.</p>
</li>
<li>
<p>En la p&aacute;gina Editar Protocolo, haga clic en el separador Cach&eacute; de Archivos.</p>
<p>Se abrir&aacute; la p&aacute;gina Cach&eacute; de Archivos.</p>
</li>
<li>
<p>Active la casilla de control Estado activado para activar la cach&eacute; de archivos.</p>
<p>Esta opci&oacute;n est&aacute; activada por defecto.</p>
</li>
<li>
<p>En el campo Antig&uuml;edad M&aacute;xima, introduzca la antig&uuml;edad m&aacute;xima en segundos de una entrada de cach&eacute; v&aacute;lida.</p>
<p>Este par&aacute;metro controla el tiempo que se utiliza la informaci&oacute;n en cach&eacute; despu&eacute;s de que un archivo se haya almacenado en cach&eacute;. Una entrada m&aacute;s antigua que la antig&uuml;edad m&aacute;xima se sustituye por una nueva entrada para el mismo archivo. Si su contenido no cambia con frecuencia, aumente este valor para mejorar el rendimiento.</p>
<p>La antig&uuml;edad m&aacute;xima &oacute;ptima depende de si los archivos existentes se modifican con regularidad. Por ejemplo, si los archivos se modifican cuatro veces al d&iacute;a en intervalos regulares, plant&eacute;ese definir la antig&uuml;edad m&aacute;xima en 21.600 segundos (6 horas). De lo contrario, una vez que el archivo haya sido modificado, considere definir la antig&uuml;edad m&aacute;xima en el per&iacute;odo de tiempo mayor que desee servir a la versi&oacute;n anterior de un archivo.</p>
<p>El valor por defecto es 30.</p>
</li>
<li>
<p>En el campo Tama&ntilde;o de Cach&eacute; M&aacute;ximo, escriba el tama&ntilde;o m&aacute;ximo total (en bytes) de la cach&eacute; de archivos del disco.</p>
<p>El valor por defecto es 10485760.</p>
</li>
<li>
<p>En el campo Recuento M&aacute;ximo de Archivos, introduzca el n&uacute;mero m&aacute;ximo de archivos que se puede almacenar en la cach&eacute; de archivos.</p>
<p>Si el valor es demasiado grande, el servidor almacena en cach&eacute; archivos que no son estrictamente necesarios, lo que desperdicia memoria. Si el valor es demasiado peque&ntilde;o, no se aprovechan las ventajas del almacenamiento en cach&eacute;. Pruebe distintos valores de este atributo para determinar la soluci&oacute;n &oacute;ptima para aplicaciones espec&iacute;ficas.</p>
<p>El valor por defecto es 1024.</p>
</li>
<li>
<p>Haga clic en Guardar.</p>

<hr>
<p><b>Sugerencia:</b></p>
Para volver a la configuraci&oacute;n por defecto, haga clic en el bot&oacute;n Cargar Valores por Defecto y, a continuaci&oacute;n, en Guardar.
<hr>

</li>
</ol>
<a id="sthref64" name="sthref64"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-networklistenernew.html">Para crear un listener de red</a></p>
</li>
<li>
<p><a href="task-networklisteneredit.html">Para editar un listener de red</a></p>
</li>
<li>
<p><a href="task-networklistenerdelete.html">Para suprimir un listener de red</a></p>
</li>
<li>
<p><a href="task-protocolnew.html">Para crear un protocolo</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">Para editar un protocolo</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">Para editar la configuraci&oacute;n SSL para un protocolo</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">Para editar la configuraci&oacute;n HTTP para un protocolo</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">Para suprimir un protocolo</a></p>
</li>
<li>
<p><a href="task-transportnew.html">Para crear un transporte</a></p>
</li>
<li>
<p><a href="task-transportedit.html">Para editar un transporte</a></p>
</li>
<li>
<p><a href="task-transportdelete.html">Para suprimir un transporte</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
