<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-transportnew" name="task-transportnew"></a><a id="GHWEB00048" name="GHWEB00048"></a></p>

<h4><a id="sthref67" name="sthref67"></a>Para crear un transporte</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Configuraci&oacute;n.</p>
</li>
<li>
<p>En el nodo Configuraci&oacute;n, ampl&iacute;e el nodo Configuraci&oacute;n de Red.</p>
</li>
<li>
<p>En el nodo Configuraci&oacute;n de Red, seleccione el nodo Transportes.</p>
<p>Se abrir&aacute; la p&aacute;gina Transportes.</p>
</li>
<li>
<p>En la p&aacute;gina Transportes, haga clic en Nuevo.</p>
<p>Se abrir&aacute; la p&aacute;gina Nuevo Transporte.</p>
</li>
<li>
<p>En el campo Nombre, introduzca un nombre &uacute;nico para el transporte.</p>
</li>
<li>
<p>En el campo Nombre de Clase, escriba el nombre de clase de la implantaci&oacute;n del transporte.</p>
<p>El valor por defecto es <code>com.sun.grizzly.TCPSelectorHandler</code>.</p>
</li>
<li>
<p>En el campo Manejador de Clave de Selecci&oacute;n, escriba el nombre de clase del manejador de clave de selecci&oacute;n.</p>
<p>Un manejador de clave de selecci&oacute;n es una clase abstracta que gestiona el ciclo de vida de las claves de selecci&oacute;n. Si no se especifica ning&uacute;n valor, se utiliza una implantaci&oacute;n por defecto.</p>
</li>
<li>
<p>En la lista desplegable Tipo de Buffer de Bytes, seleccione el tipo de <code>ByteBuffer</code> que se va a utilizar.</p>
<p>Las opciones disponibles son <code>HEAP</code> y <code>DIRECT</code>. El valor por defecto es <code>HEAP</code>.</p>
</li>
<li>
<p>En el campo Threads de Responsable de Aceptaci&oacute;n, escriba el n&uacute;mero de procesadores del equipo.</p>
<p>Un valor de -1 indica que Grizzly calcular&aacute; por su cuenta el n&uacute;mero de threads del dispositivo de aceptaci&oacute;n seg&uacute;n el n&uacute;mero de procesadores de la m&aacute;quina. El valor por defecto es 1.</p>
<p>Para definir el n&uacute;mero de threads de procesamiento de solicitudes, defina el valor del Tama&ntilde;o M&aacute;ximo del Pool de Threads del pool de threads utilizado por un listener de red que emplea este transporte.</p>
</li>
<li>
<p>En el campo N&uacute;mero M&aacute;ximo de Conexiones, escriba el n&uacute;mero m&aacute;ximo de conexiones pendientes en un listener de red que utiliza este transporte.</p>
<p>El valor por defecto es 4096.</p>
</li>
<li>
<p>En el campo Tama&ntilde;o de Buffer, escriba el tama&ntilde;o (en bytes) del buffer que se proporciona para los flujos de entrada creados por un listener de red que utiliza este transporte.</p>
<p>El valor por defecto es 8192.</p>
</li>
<li>
<p>En el campo Timeout de Clave Inactiva, escriba el n&uacute;mero de segundos despu&eacute;s de los cuales se cancelar&aacute; una clave inactiva y se cerrar&aacute; el canal.</p>
<p>El valor por defecto es 30.</p>
</li>
<li>
<p>En el campo Timeout de Lectura, introduzca el n&uacute;mero de milisegundos que GlassFish Server esperar&aacute; durante la fase de an&aacute;lisis de cabecera y cuerpo de una operaci&oacute;n de lectura.</p>
<p>El valor por defecto es 30000.</p>
</li>
<li>
<p>En el campo Timeout de Sondeo de Selector, escriba el n&uacute;mero de milisegundos tras los cuales un selector NIO se bloquear&aacute; a la espera de eventos (solicitudes del usuario).</p>
<p>El valor por defecto es 1.000.</p>
</li>
<li>
<p>En el campo Timeout de Escritura, introduzca el n&uacute;mero de milisegundos que GlassFish Server espera antes de considerar que el cliente remoto est&aacute; desconectado al escribir la respuesta.</p>
<p>El valor por defecto es 30000.</p>
</li>
<li>
<p>Active la casilla de control de activaci&oacute;n de configuraci&oacute;n de pantalla para que la configuraci&oacute;n interna de Grizzly se descargue en los logs del servidor.</p>
<p>Esta opci&oacute;n puede proporcionar informaci&oacute;n &uacute;til para la depuraci&oacute;n. Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>Active la casilla de control de activaci&oacute;n de investigaci&oacute;n para que la informaci&oacute;n de la respuesta/solicitud se vuelque en el log del servidor.</p>
<p>Puede que esta opci&oacute;n proporcione informaci&oacute;n &uacute;til para realizar la depuraci&oacute;n, pero reduce significativamente el rendimiento. Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>Active la casilla de control TCP sin Retraso para activar la opci&oacute;n TCP_NODELAY (tambi&eacute;n llamada algoritmo de Nagle).</p>
<p>Esta opci&oacute;n se encuentra activada por defecto.</p>
</li>
<li>
<p>Haga clic en Aceptar.</p>
</li>
</ol>
<a id="sthref68" name="sthref68"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-networklistenernew.html">Para crear un listener de red</a></p>
</li>
<li>
<p><a href="task-networklisteneredit.html">Para editar un listener de red</a></p>
</li>
<li>
<p><a href="task-networklistenerdelete.html">Para suprimir un listener de red</a></p>
</li>
<li>
<p><a href="task-protocolnew.html">Para crear un protocolo</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">Para editar un protocolo</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">Para editar la configuraci&oacute;n SSL para un protocolo</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">Para editar la configuraci&oacute;n HTTP para un protocolo</a></p>
</li>
<li>
<p><a href="task-protocolfilecacheedit.html">Para editar la configuraci&oacute;n de cach&eacute; de archivos para un protocolo</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">Para suprimir un protocolo</a></p>
</li>
<li>
<p><a href="task-transportedit.html">Para editar un transporte</a></p>
</li>
<li>
<p><a href="task-transportdelete.html">Para suprimir un transporte</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
