<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-virtualserveredit" name="task-virtualserveredit"></a><a id="GHWEB00037" name="GHWEB00037"></a></p>

<h4><a id="sthref37" name="sthref37"></a>Para editar un servidor virtual</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Configuraci&oacute;n.</p>
</li>
<li>
<p>Seleccione la configuraci&oacute;n que desea cambiar.</p>
</li>
<li>
<p>En el nodo Configuraci&oacute;n, seleccione el nodo Servidores Virtuales.</p>
<p>Se abrir&aacute; la p&aacute;gina Servidores Virtuales.</p>
</li>
<li>
<p>En la p&aacute;gina Servidores Virtuales, haga clic en el nombre del servidor virtual que est&aacute; editando.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar Servidor Virtual.</p>
</li>
<li>
<p>En el campo Hosts, introduzca los nombres de host o las direcciones IP de la maquina en el que se est&aacute; ejecutando el servidor.</p>
<p>Utilice nombres de host reales o virtuales que est&eacute;n registrados en el servidor DNS de la red (y, en un sistema UNIX, en el archivo <code>/etc/hosts</code>). El valor por defecto es el valor de la propiedad del sistema <code>${com.sun.aas.hostName}</code>.</p>
</li>
<li>
<p>Seleccione una opci&oacute;n de estado para el servidor virtual.</p>
<p>El valor puede ser cualquiera de los siguientes:</p>
<dl>
<dt>Activado</dt>
<dd>
<p>El servidor virtual est&aacute; activo. &Eacute;ste es el valor por defecto.</p>
</dd>
<dt>Desactivado</dt>
<dd>
<p>El servidor virtual est&aacute; inactivo. Los intentos de acceder al servidor generar&aacute;n el c&oacute;digo de error 404 (recurso no disponible).</p>
</dd>
<dt>Desactivado</dt>
<dd>
<p>El servidor virtual est&aacute; desactivado. Los intentos de acceder al servidor generar&aacute;n el c&oacute;digo de error 403 (denegaci&oacute;n de cumplimiento de la solicitud).</p>
</dd>
</dl>
</li>
<li>
<p>Seleccione una opci&oacute;n SSO para el nuevo servidor virtual.</p>
<p>Por defecto, un servidor virtual hereda la configuraci&oacute;n de single sign-on (SSO) del servicio HTTP. Seleccione Activado o Desactivado para sustituir la configuraci&oacute;n del servicio HTTP activando o desactivando el single sign-on para este servidor virtual.</p>
<p>Los servlets y los archivos JSP soportan el single sign-on en las aplicaciones de GlassFish Server. Esta funci&oacute;n permite a varias aplicaciones que requieren la misma informaci&oacute;n de inicio de sesi&oacute;n compartir esta informaci&oacute;n de modo que el usuario no tenga que iniciar una sesi&oacute;n por separado para cada aplicaci&oacute;n.</p>
</li>
<li>
<p>Desde la lista desplegable Listeners de Red, seleccione uno o varios listeners de red o deje el campo en blanco.</p>
</li>
<li>
<p>En la lista desplegable M&oacute;dulo Web por Defecto, seleccione el m&oacute;dulo que va a responder a todas las solicitudes que no se pueden asignar a otros m&oacute;dulos web desplegados en el servidor virtual.</p>
<p>Si no se especifica un m&oacute;dulo web por defecto, se utiliza un m&oacute;dulo web con una ra&iacute;z de contexto vac&iacute;a. Si no hay ning&uacute;n m&oacute;dulo web con una ra&iacute;z de contexto vac&iacute;a, se crea y utiliza un m&oacute;dulo web por defecto del sistema.</p>
</li>
<li>
<p>En el campo Archivo Log, introduzca el nombre de ruta de acceso del archivo en el que aparecer&aacute;n los mensajes de registro de este servidor virtual.</p>
<p>Por defecto, los mensajes de registro se enviar&aacute;n al log del servidor por defecto, domain-dir<code>/logs/server.log</code>.</p>
</li>
<li>
<p>En el campo Ra&iacute;z de Documento, introduzca la ruta de acceso absoluta al directorio ra&iacute;z de documentos del servidor.</p>
<p>El valor por defecto es domain-dir<code>/docroot</code>.</p>
</li>
<li>
<p>Seleccione la opci&oacute;n Registro de Acceso para activar o desactivar el registro de acceso.</p>
<p>Por defecto, un servidor virtual hereda la configuraci&oacute;n de registro de acceso del servicio HTTP. Seleccione Activado o Desactivado para sustituir la configuraci&oacute;n del servicio HTTP activando o desactivando el registro de acceso para este servidor virtual.</p>
</li>
<li>
<p>En el campo Directorio, introduzca la ruta de acceso de directorio absoluta en los logs de acceso del servidor.</p>
<p>El valor por defecto es domain-dir<code>/logs/access</code>.</p>
</li>
<li>
<p>En la secci&oacute;n Propiedades Adicionales, especifique propiedades adicionales del servidor virtual.</p>
<p>Para obtener m&aacute;s informaci&oacute;n sobre las propiedades disponibles, consulte <a href="ref-virtualserverprops.html">Propiedades espec&iacute;ficas de servidores virtuales</a>.</p>
<ul>
<li>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, introduzca el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
</li>
<li>
<p>Para modificar una propiedad, edite el campo Valor.</p>
</li>
<li>
<p>Para suprimir una propiedad, active la casilla de control a la izquierda del campo Nombre de la propiedad que est&aacute; suprimiendo y, a continuaci&oacute;n, haga clic en el bot&oacute;n Suprimir Propiedades.</p>
</li>
</ul>
</li>
<li>
<p>Haga clic en Guardar.</p>

<hr>
<p><b>Sugerencia:</b></p>
Para volver a la configuraci&oacute;n por defecto, haga clic en el bot&oacute;n Cargar Valores por Defecto y, a continuaci&oacute;n, en Guardar.
<hr>

</li>
</ol>
<a id="sthref38" name="sthref38"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-virtualservercreate.html">Para crear un servidor virtual</a></p>
</li>
<li>
<p><a href="task-virtualserverdelete.html">Para suprimir un servidor virtual</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
