<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-httplistenerssl" name="task-httplistenerssl"></a></p>

<h4><a id="sthref31" name="sthref31"></a><a id="sthref32" name="sthref32"></a>Para editar la configuraci&oacute;n SSL para un listener HTTP</h4>
<a name="BEGIN" id="BEGIN"></a><a id="sthref33" name="sthref33"></a>
<h5>Antes de Empezar</h5>
<p>Esta tarea &uacute;nicamente tiene sentido si se ha activado la seguridad en el protocolo.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Configuraci&oacute;n.</p>
</li>
<li>
<p>En el nodo Configuraci&oacute;n, ampl&iacute;e el nodo Servicio HTTP.</p>
</li>
<li>
<p>En el nodo Configuraci&oacute;n de Red, seleccione el nodo Listeners HTTP.</p>
<p>Se abrir&aacute; la p&aacute;gina Listeners HTTP.</p>
</li>
<li>
<p>En la p&aacute;gina Listeners HTTP, haga clic en el nombre del listener HTTP que est&eacute; editando.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar Listener HTTP.</p>
</li>
<li>
<p>En la p&aacute;gina Editar Listener HTTP, haga clic en el separador SSL.</p>
<p>Se abrir&aacute; la p&aacute;gina SSL.</p>
</li>
<li>
<p>Active la casilla de control de activaci&oacute;n de SSL3 para activar SSL3.</p>
<p>Esta opci&oacute;n se encuentra activada por defecto.</p>
</li>
<li>
<p>Active la casilla de control de activaci&oacute;n de TLS para activar la seguridad a nivel de transporte (TLS).</p>
<p>Esta opci&oacute;n se encuentra activada por defecto.</p>
</li>
<li>
<p>Active la casilla de control de activaci&oacute;n de autenticaci&oacute;n de cliente para solicitar a los clientes que se identifiquen en el servidor con cada solicitud.</p>
<p>Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>En el campo Apodo de Certificado, introduzca el apodo del certificado del servidor en la base de datos de certificados o token PKCS#11.</p>
<p>En el certificado, el formato del nombre es <i>tokenname</i><code>:</code><i>nickname</i>. Incluir tokenname<code>:</code> parte del nombre de este atributo es opcional.</p>
</li>
<li>
<p>En el campo Almac&eacute;n de Claves, introduzca el nombre del archivo de almac&eacute;n de claves (por ejemplo, <code>keystore.jks</code>).</p>
</li>
<li>
<p>En el campo Algoritmo de Confianza, introduzca el nombre del algoritmo de gesti&oacute;n de confianza (por ejemplo, PKIX) que se utilizar&aacute; para la validaci&oacute;n de rutas de acceso de certificaci&oacute;n.</p>
</li>
<li>
<p>En el campo Longitud de Certificado M&aacute;xima, introduzca el n&uacute;mero m&aacute;ximo de certificados intermedios no emitidos autom&aacute;ticamente que puede haber en una ruta de acceso de certificaci&oacute;n.</p>
<p>Este campo s&oacute;lo se utiliza en caso de que el campo Algoritmo de Confianza est&eacute; definido en PKIX. Un valor de 0 implica que la ruta de acceso s&oacute;lo puede contener un certificado. Un valor de -1 implica que la longitud de la ruta de acceso no est&aacute; restringida (no hay un m&aacute;ximo). La configuraci&oacute;n en un valor inferior a -1 inicia una excepci&oacute;n.</p>
</li>
<li>
<p>En el campo Almac&eacute;n de Confianza, introduzca el nombre de un archivo del almac&eacute;n de confianza (por ejemplo, <code>cacerts.jks</code>).</p>
</li>
<li>
<p>En el &aacute;rea Conjuntos de Cifrado, especifique los conjuntos de cifrado que se utilizar&aacute;n.</p>
<p>Si no agrega ning&uacute;n conjunto de cifrado, se utilizar&aacute;n todos los conjuntos de cifrado.</p>
</li>
<li>
<p>Haga clic en Aceptar.</p>
</li>
</ol>
<a id="sthref34" name="sthref34"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-httplistenernew.html">Para crear un listener HTTP</a></p>
</li>
<li>
<p><a href="task-httplisteneredit.html">Para editar un listener HTTP</a></p>
</li>
<li>
<p><a href="task-httplistenerdelete.html">Para suprimir un listener HTTP</a></p>
</li>
<li>
<p><a href="task-virtualservercreate.html">Para crear un servidor virtual</a></p>
</li>
<li>
<p><a href="task-networklistenernew.html">Para crear un listener de red</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">Para editar la configuraci&oacute;n HTTP para un protocolo</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
