<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-networklistenernew" name="task-networklistenernew"></a></p>

<h4><a id="sthref41" name="sthref41"></a>Para crear un listener de red</h4>
<a name="BEGIN" id="BEGIN"></a><a id="sthref42" name="sthref42"></a>
<h5>Antes de Empezar</h5>
<p>Cuando se crea un listener de red, es posible crear simult&aacute;neamente un protocolo que utilizar&aacute; el listener de red o utilizar un protocolo que cree previamente. Normalmente, existe una relaci&oacute;n de uno a uno entre un listener de red y su protocolo asociado, pero no es necesario que sea as&iacute;.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Configuraci&oacute;n.</p>
</li>
<li>
<p>En el nodo Configuraci&oacute;n, ampl&iacute;e el nodo Configuraci&oacute;n de Red.</p>
</li>
<li>
<p>En el nodo Configuraci&oacute;n de Red, seleccione el nodo Listeners de Red.</p>
<p>Se abrir&aacute; la p&aacute;gina Listeners de Red.</p>
</li>
<li>
<p>En la p&aacute;gina Listeners de Red, haga clic en Nuevo.</p>
<p>Se abrir&aacute; la p&aacute;gina Nuevo Listener de Red.</p>
</li>
<li>
<p>En el campo Nombre, escriba un nombre para el listener de red.</p>
<p>Un nombre de listener de red no puede empezar con un n&uacute;mero.</p>
</li>
<li>
<p>En el campo Protocolo, especifique el protocolo que se va a asociar al listener de red.</p>
<ul>
<li>
<p>Seleccione Crear un Protocolo Nuevo para crear un nuevo protocolo con una configuraci&oacute;n por defecto. Adem&aacute;s, en la lista desplegable Servidor Virtual, seleccione el servidor virtual que se va a asociar al protocolo.</p>
<p>El nombre por defecto del protocolo es el nombre del listener de red con la terminaci&oacute;n <code>-protocol</code> agregada, pero es posible editar este valor.</p>
</li>
<li>
<p>Seleccione Usar un Protocolo Existente y, a continuaci&oacute;n, seleccione un protocolo de la lista desplegable. Para activar la seguridad del listener de red, elija un protocolo con la seguridad activada.</p>
<p>Si selecciona esta opci&oacute;n, por lo general habr&aacute; creado previamente el protocolo de este listener.</p>
</li>
</ul>
<p>Puede especificar el protocolo &uacute;nicamente si ha creado el listener de red. No puede cambiar el protocolo asociado m&aacute;s adelante. El protocolo determina si se ha activado la seguridad para el listener de red.</p>
</li>
<li>
<p>Active la casilla de control Estado activado para activar el listener de red.</p>
<p>Esta opci&oacute;n se encuentra activada por defecto. Si el listener se encuentra desactivado, cualquier intento de establecer una conexi&oacute;n con &eacute;l tiene como resultado una excepci&oacute;n de socket (<code>java.net.ConnectException</code>).</p>
<p>En las versiones anteriores a la 9.1 de GlassFish Server, un listener cuyo atributo activado se hubiera definido como false devolv&iacute;a un c&oacute;digo de respuesta 404 para cualquier solicitud que se le enviaba. Para lograr este comportamiento en la versi&oacute;n actual de GlassFish Server, defina el estado del listener en activado y defina cada estado de servidor virtual asociado como desactivado. Un servidor virtual incluye sus listeners asociados en la lista desplegable Listeners de Red.</p>
</li>
<li>
<p>La casilla de control Seguridad Activada, de s&oacute;lo lectura, indica si se ha activado la seguridad para el protocolo que utiliza el listener de red.</p>
<p>Si est&aacute; configurando el <code>admin-listener</code> para el servidor de administraci&oacute;n de dominio (DAS), que usa la configuraci&oacute;n <code>server-config</code>, esta opci&oacute;n ser&aacute; de s&oacute;lo lectura. Para activar la seguridad de este listener, debe activar primero la administraci&oacute;n segura. Consulte la secci&oacute;n <a href="../../../common/en/help/ref-securityadmin.html">Administraci&oacute;n Segura</a>.</p>
</li>
<li>
<p>Active la casilla de control de activaci&oacute;n de listener JK para especificar que el listener soporta el protocolo <code>mod-jk</code> de Apache.</p>
<p>El protocolo <code>mod-jk</code> es un protocolo de red/comunicaci&oacute;n de propiedad entre <code>httpd</code> de Apache (servidor web) y una instancia back-end de GlassFish Server. Si el listener soporta este protocolo, se supone que <code>httpd</code> maneja todo el contenido est&aacute;tico, mientras que cualquier solicitud de recursos din&aacute;micos (es decir, servlets y JSP) se direccionan al listener de red con el protocolo <code>mod jk</code> activado de GlassFish Server a trav&eacute;s del protocolo<code>mod-jk</code>. Esta opci&oacute;n se activada por defecto.</p>
</li>
<li>
<p>En el campo Puerto, introduzca el n&uacute;mero de puerto en el que recibir&aacute; el listener de red.</p>
<p>Los valores v&aacute;lidos se encuentran entre 1 y 65535. En un sistema UNIX, la creaci&oacute;n de sockets que reciben en los puertos 1-1024 requiere privilegios de superusuario.</p>
</li>
<li>
<p>En el campo Direcci&oacute;n, escriba la direcci&oacute;n IP en la que recibir&aacute; el listener de red.</p>
<p>La direcci&oacute;n se puede especificar en par punteado o notaci&oacute;n IPv6. Puede ser <code>cualquiera</code> (para <code>INADDR_ANY</code>) para recibir en todas las direcciones IP. Puede ser un nombre de host.</p>
</li>
<li>
<p>En la lista desplegable Pool de Threads, seleccione el pool de threads que se debe asociar al listener de red.</p>
<p>Normalmente, puede seleccionar uno de los dos pools de threads que est&aacute;n configurados cuando se instala GlassFish Server.</p>
</li>
<li>
<p>En la lista desplegable Transporte, seleccione el tipo de transporte que se debe utilizar en el listener de red.</p>
<p>Por defecto, la &uacute;nica alternativa es <code>tcp</code>.</p>
</li>
<li>
<p>Haga clic en Aceptar.</p>
</li>
</ol>
<a id="sthref43" name="sthref43"></a>
<h5>Pasos Siguientes</h5>
<p>Si ha activado la seguridad del protocolo utilizado por el listener de red, puede usar el separador SSL para editar la configuraci&oacute;n SSL de dicho protocolo.</p>
<a id="sthref44" name="sthref44"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-networklisteneredit.html">Para editar un listener de red</a></p>
</li>
<li>
<p><a href="task-networklistenerdelete.html">Para suprimir un listener de red</a></p>
</li>
<li>
<p><a href="task-protocolnew.html">Para crear un protocolo</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">Para editar un protocolo</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">Para editar la configuraci&oacute;n SSL para un protocolo</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">Para editar la configuraci&oacute;n HTTP para un protocolo</a></p>
</li>
<li>
<p><a href="task-protocolfilecacheedit.html">Para editar la configuraci&oacute;n de cach&eacute; de archivos para un protocolo</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">Para suprimir un protocolo</a></p>
</li>
<li>
<p><a href="task-transportnew.html">Para crear un transporte</a></p>
</li>
<li>
<p><a href="task-transportedit.html">Para editar un transporte</a></p>
</li>
<li>
<p><a href="task-transportdelete.html">Para suprimir un transporte</a></p>
</li>
<li>
<p><a href="task-virtualservercreate.html">Para crear un servidor virtual</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
