<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-scheduledexecutorservicenew" name="ref-scheduledexecutorservicenew"></a></p>

<h4>&#26032;&#24314;&#21463;&#31649;&#29702;&#25490;&#23450;&#30340;&#22519;&#34892;&#31243;&#24335;&#26381;&#21209;<a id="sthref31" name="sthref31"></a></h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#24744;&#21487;&#20197;&#20351;&#29992;&#12300;&#26032;&#24314;&#21463;&#31649;&#29702;&#25490;&#23450;&#30340;&#22519;&#34892;&#31243;&#24335;&#26381;&#21209;&#12301;&#38913;&#38754;&#20358;&#24314;&#31435;&#21463;&#31649;&#29702;&#25490;&#23450;&#30340;&#22519;&#34892;&#31243;&#24335;&#26381;&#21209;&#36039;&#28304;&#12290;</p>
<p>&#12300;&#26032;&#24314;&#21463;&#31649;&#29702;&#25490;&#23450;&#30340;&#22519;&#34892;&#31243;&#24335;&#26381;&#21209;&#12301;&#38913;&#38754;&#21253;&#21547;&#19979;&#21015;&#36984;&#38917;&#12290;</p>
<dl>
<dt>JNDI &#21517;&#31281;</dt>
<dd>
<p>&#21487;&#35672;&#21029;&#36039;&#28304;&#30340;&#21807;&#19968; JNDI &#21517;&#31281;&#12290;&#20381;&#24931;&#20363;&#26371;&#26159;&#20197;&#36039;&#28304;&#39006;&#22411;&#25351;&#31034;&#31526;&#33287;&#26012;&#32218;&#38283;&#38957;&#30340;&#21517;&#31281;&#65292;&#20363;&#22914; concurrent/&#12289;jdbc/ &#25110; jms/&#12290;</p>
</dd>
<dt>&#29872;&#22659;&#36039;&#35338;</dt>
<dd>
<p>&#35201;&#20659;&#36664;&#33267;&#32363;&#32218;&#30340;&#29872;&#22659;&#65306;Classloader&#12289;JNDI&#12289;Security &#25110; WorkArea&#12290;&#24744;&#21487;&#20197;&#21855;&#29992;&#25110;&#20572;&#29992;&#29872;&#22659;&#20659;&#36664;&#12290;&#22914;&#26524;&#21855;&#29992;&#65292;&#23601;&#26371;&#20659;&#36664;&#36984;&#21462;&#30340;&#29872;&#22659;&#12290;&#22914;&#26524;&#20572;&#29992;&#65292;&#23601;&#19981;&#26371;&#20659;&#36664;&#20219;&#20309;&#29872;&#22659; (&#21253;&#25324;&#36984;&#21462;&#30340;&#29872;&#22659;)&#12290;&#38928;&#35373;&#20540;&#28858;&#12300;&#21855;&#29992;&#12301;(&#21253;&#25324;&#20840;&#37096;&#30340;&#22235;&#20491;&#29872;&#22659;)&#12290;</p>
</dd>
<dt>&#29376;&#24907;</dt>
<dd>
<p>&#36039;&#28304;&#29376;&#24907;&#12290;&#24744;&#21487;&#21855;&#29992;&#25110;&#20572;&#29992;&#36039;&#28304;&#12290;&#38928;&#35373;&#20540;&#28858;&#12300;&#21855;&#29992;&#12301;&#12290;</p>
</dd>
<dt>&#32363;&#32218;&#20778;&#20808;&#38918;&#24207;</dt>
<dd>
<p>&#35201;&#25351;&#23450;&#32102;&#24050;&#24314;&#31435;&#32363;&#32218;&#30340;&#20778;&#20808;&#38918;&#24207;&#12290;&#38928;&#35373;&#20540;&#28858; 5&#12290;</p>
</dd>
<dt>&#38263;&#26178;&#38291;&#22519;&#34892;&#30340;&#24037;&#20316;</dt>
<dd>
<p>&#26159;&#21542;&#25033;&#35442;&#23559;&#36039;&#28304;&#20351;&#29992;&#26044;&#38263;&#26178;&#38291;&#22519;&#34892;&#30340;&#24037;&#20316;&#12290;&#22914;&#26524;&#21855;&#29992;&#65292;&#23601;&#19981;&#26371;&#23559;&#38263;&#26178;&#38291;&#22519;&#34892;&#30340;&#24037;&#20316;&#22577;&#21578;&#28858;&#38459;&#22622;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</dd>
<dt>&#20572;&#28399;&#21069;&#30340;&#26178;&#38291;</dt>
<dd>
<p>&#24037;&#20316;&#21487;&#20197;&#22519;&#34892;&#30340;&#31186;&#25976;&#65292;&#36229;&#36942;&#27492;&#26178;&#38291;&#20043;&#24460;&#21363;&#23559;&#24037;&#20316;&#35222;&#28858;&#28961;&#22238;&#25033;&#12290;&#38928;&#35373;&#20540;&#28858; 0&#12290;</p>
</dd>
<dt>&#25551;&#36848;</dt>
<dd>
<p>&#27492;&#36039;&#28304;&#30340;&#25551;&#36848;&#12290;</p>
</dd>
<dt>&#26680;&#24515;&#22823;&#23567;</dt>
<dd>
<p>&#35201;&#20445;&#30041;&#22312;&#32363;&#32218;&#38598;&#21312;&#20013;&#30340;&#32363;&#32218;&#25976;&#30446;&#12290;&#38928;&#35373;&#20540;&#28858; 0&#12290;</p>
</dd>
<dt>&#25345;&#32396;&#20316;&#29992;&#26178;&#38291;</dt>
<dd>
<p>&#30070;&#32363;&#32218;&#25976;&#30446;&#22823;&#26044;&#26680;&#24515;&#22823;&#23567;&#26178;&#65292;&#32363;&#32218;&#21487;&#20197;&#32173;&#25345;&#38290;&#32622;&#30340;&#31186;&#25976;&#12290;&#38928;&#35373;&#20540;&#28858; 60&#12290;</p>
</dd>
<dt>&#32363;&#32218;&#23384;&#30041;&#26178;&#38291;</dt>
<dd>
<p>&#32363;&#32218;&#22312;&#34987;&#28165;&#38500;&#20043;&#21069;&#21487;&#20445;&#30041;&#22312;&#32363;&#32218;&#38598;&#21312;&#20013;&#30340;&#31186;&#25976; (&#19981;&#35542;&#32363;&#32218;&#25976;&#30446;&#26159;&#21542;&#22823;&#26044;&#26680;&#24515;&#22823;&#23567;&#25110;&#32363;&#32218;&#26159;&#21542;&#28858;&#38290;&#32622;&#29376;&#24907;)&#12290;&#38928;&#35373;&#20540;&#28858; 0&#12290;</p>
</dd>
<dt>&#20854;&#20182;&#29305;&#24615;</dt>
<dd>
<p>&#36039;&#28304;&#30340;&#20854;&#20182;&#29305;&#24615;&#12290;GlassFish Server &#20006;&#26410;&#23450;&#32681;&#27492;&#36039;&#28304;&#39006;&#22411;&#30340;&#20219;&#20309;&#20854;&#20182;&#29305;&#24615;&#12290;&#27492;&#22806;&#65292;&#27492;&#36039;&#28304;&#39006;&#22411;&#30446;&#21069;&#20063;&#20006;&#26410;&#20351;&#29992;&#20219;&#20309;&#20854;&#20182;&#29305;&#24615;&#12290;</p>
</dd>
<dt>&#30446;&#27161;</dt>
<dd>
<p>(&#24050;&#22312;&#32178;&#22495;&#20013;&#24314;&#31435;&#21474;&#38598;&#25110;&#29544;&#31435;&#22519;&#34892;&#34389;&#29702;&#26178;&#25165;&#26371;&#39023;&#31034;&#27492;&#36984;&#38917;&#12290;)</p>
<p>&#36039;&#28304;&#30340;&#21474;&#38598;&#21644;&#29544;&#31435;&#22519;&#34892;&#34389;&#29702;&#12290;&#21487;&#20351;&#29992;&#12300;&#21152;&#20837;&#12301;&#33287;&#12300;&#20840;&#37096;&#21152;&#20837;&#12301;&#25353;&#37397;&#65292;&#23559;&#25152;&#38656;&#30340;&#30446;&#27161;&#31227;&#33267;&#12300;&#36984;&#21462;&#30340;&#30446;&#27161;&#12301;&#27396;&#12290;&#21487;&#20351;&#29992;&#12300;&#31227;&#38500;&#12301;&#33287;&#12300;&#20840;&#37096;&#31227;&#38500;&#12301;&#25353;&#37397;&#65292;&#23559;&#20219;&#20309;&#19981;&#38656;&#35201;&#30340;&#30446;&#27161;&#31227;&#33267;&#12300;&#21487;&#29992;&#30340;&#30446;&#27161;&#12301;&#27396;&#12290;</p>
</dd>
</dl>
<a id="sthref32" name="sthref32"></a>
<h5>&#30456;&#38364;&#20316;&#26989;</h5>
<ul>
<li>
<p><a href="task-managedscheduledexecutorservicecreate.html">&#24314;&#31435;&#21463;&#31649;&#29702;&#25490;&#23450;&#30340;&#22519;&#34892;&#31243;&#24335;&#26381;&#21209;</a></p>
</li>
<li>
<p><a href="task-managedscheduledexecutorserviceedit.html">&#32232;&#36655;&#21463;&#31649;&#29702;&#25490;&#23450;&#30340;&#22519;&#34892;&#31243;&#24335;&#26381;&#21209;</a></p>
</li>
<li>
<p><a href="task-managedscheduledexecutorservicedelete.html">&#21034;&#38500;&#21463;&#31649;&#29702;&#25490;&#23450;&#30340;&#22519;&#34892;&#31243;&#24335;&#26381;&#21209;</a></p>
</li>
</ul>
<a id="GHCON149" name="GHCON149"></a>
<h5>&#30456;&#38364;&#30340; asadmin &#21629;&#20196;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM680"><code>create-managed-scheduled-executor-service</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM873"><code>list-managed-scheduled-executor-services</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM850"><code>delete-managed-scheduled-executor-service</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
