<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-managedexecutorservicecreate" name="task-managedexecutorservicecreate"></a></p>

<h4>&#24314;&#31435;&#21463;&#31649;&#29702;&#22519;&#34892;&#31243;&#24335;&#26381;&#21209;<a id="sthref5" name="sthref5"></a></h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#25033;&#29992;&#31243;&#24335;&#26371;&#20351;&#29992;&#21463;&#31649;&#29702;&#22519;&#34892;&#31243;&#24335;&#26381;&#21209;&#65292;&#20197;&#38750;&#21516;&#27493;&#26041;&#24335;&#22519;&#34892;&#25552;&#20132;&#30340;&#24037;&#20316;&#12290;&#31995;&#32113;&#26371;&#22312;&#24050;&#21855;&#21205;&#19988;&#30001;&#23481;&#22120;&#31649;&#29702;&#30340;&#32363;&#32218;&#22519;&#34892;&#24037;&#20316;&#12290;&#31995;&#32113;&#26371;&#23559;&#23481;&#22120;&#30340;&#29872;&#22659;&#20659;&#36664;&#33267;&#22519;&#34892;&#24037;&#20316;&#30340;&#32363;&#32218;&#12290;</p>
<p>&#22312; GlassFish Server &#20013;&#65292;&#24744;&#21487;&#20197;&#32068;&#24907;&#21463;&#31649;&#29702;&#22519;&#34892;&#31243;&#24335;&#26381;&#21209;&#36039;&#28304;&#65292;&#28982;&#24460;&#23559;&#23427;&#25552;&#20379;&#32102;&#20687;&#26159; Servlet &#21644; EJB &#31561;&#30340;&#25033;&#29992;&#31243;&#24335;&#20803;&#20214;&#20351;&#29992;&#12290;</p>
<ol>
<li>
<p>&#22312;&#28687;&#35261;&#27193;&#29376;&#32080;&#27083;&#20013;&#65292;&#23637;&#38283;&#12300;&#36039;&#28304;&#12301;&#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#36039;&#28304;&#12301;&#31680;&#40670;&#19979;&#65292;&#23637;&#38283;&#12300;&#20006;&#34892;&#36039;&#28304;&#12301;&#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#20006;&#34892;&#36039;&#28304;&#12301;&#31680;&#40670;&#19979;&#65292;&#36984;&#21462;&#12300;&#21463;&#31649;&#29702;&#22519;&#34892;&#31243;&#24335;&#26381;&#21209;&#12301;&#12290;</p>
<p>&#23601;&#26371;&#38283;&#21855;&#12300;&#21463;&#31649;&#29702;&#22519;&#34892;&#31243;&#24335;&#26381;&#21209;&#12301;&#38913;&#38754;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#21463;&#31649;&#29702;&#22519;&#34892;&#31243;&#24335;&#26381;&#21209;&#12301;&#38913;&#38754;&#19978;&#25353;&#19968;&#19979;&#12300;&#26032;&#24314;&#12301;&#12290;</p>
<p>&#23601;&#26371;&#38283;&#21855;&#12300;&#26032;&#24314;&#21463;&#31649;&#29702;&#22519;&#34892;&#31243;&#24335;&#26381;&#21209;&#12301;&#38913;&#38754;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;JNDI &#21517;&#31281;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#35672;&#21029;&#36039;&#28304;&#30340;&#21807;&#19968;&#21517;&#31281;&#12290;</p>
<p>&#31995;&#32113;&#26371;&#22312; JNDI &#21629;&#21517;&#26381;&#21209;&#20013;&#35387;&#20874;&#27492; JNDI &#21517;&#31281;&#65292;&#20379;&#25033;&#29992;&#31243;&#24335;&#29992;&#20358;&#26597;&#35426;&#36039;&#28304;&#12290;&#20351;&#29992; <code>concurrent/</code><i>name</i> &#26684;&#24335;&#12290;&#20363;&#22914; <code>concurrent/myManagedExecutorService</code>&#12290;&#27492;&#21517;&#31281;&#21482;&#33021;&#21253;&#21547;&#23383;&#27597;&#25976;&#23383;&#12289;&#24213;&#32218;&#12289;&#30772;&#25240;&#34399;&#25110;&#40670;&#23383;&#20803;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#21855;&#29992;&#29872;&#22659;&#36039;&#35338;&#12301;&#26680;&#21462;&#26041;&#22602;&#21363;&#21487;&#23559;&#29872;&#22659;&#20659;&#36664;&#33267;&#32363;&#32218;&#65292;&#20006;&#36984;&#21462;&#24819;&#35201;&#20659;&#36664;&#30340;&#29872;&#22659;&#12290;</p>
<p>&#38928;&#35373;&#26371;&#21855;&#29992;&#27492;&#36984;&#38917;&#20006;&#36984;&#21462;&#25152;&#26377;&#29872;&#22659;&#12290;&#22914;&#26524;&#35201;&#36984;&#25799;&#22810;&#20491;&#29872;&#22659;&#65292;&#35531;&#22312;&#25353;&#20303; Shift &#37749;&#25110; Ctrl &#37749;&#30340;&#21516;&#26178;&#20197;&#28369;&#40736;&#40670;&#36984;&#29872;&#22659;&#12290;&#22914;&#26524;&#20572;&#29992;&#27492;&#36984;&#38917;&#65292;&#23601;&#19981;&#26371;&#20659;&#36664;&#20219;&#20309;&#29872;&#22659; (&#21253;&#25324;&#36984;&#21462;&#30340;&#29872;&#22659;)&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#21855;&#29992;&#29376;&#24907;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#20197;&#21855;&#29992;&#36039;&#28304;&#12290;</p>
<p>&#38928;&#35373;&#26371;&#21855;&#29992;&#27492;&#36984;&#38917;&#65292;&#34920;&#31034;&#24314;&#31435;&#36039;&#28304;&#20043;&#24460;&#21363;&#21487;&#20351;&#29992;&#36039;&#28304;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#32363;&#32218;&#20778;&#20808;&#38918;&#24207;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#35201;&#25351;&#23450;&#32102;&#24050;&#24314;&#31435;&#32363;&#32218;&#30340;&#20778;&#20808;&#38918;&#24207;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 5&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#21855;&#29992;&#38263;&#26178;&#38291;&#22519;&#34892;&#30340;&#24037;&#20316;&#12301;&#26680;&#21462;&#26041;&#22602;&#21363;&#21487;&#20351;&#29992;&#36039;&#28304;&#22519;&#34892;&#38263;&#26178;&#38291;&#22519;&#34892;&#30340;&#24037;&#20316;&#12290;</p>
<p>&#22914;&#26524;&#21855;&#29992;&#65292;&#23601;&#19981;&#26371;&#23559;&#38263;&#26178;&#38291;&#22519;&#34892;&#30340;&#24037;&#20316;&#22577;&#21578;&#28858;&#38459;&#22622;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#20572;&#28399;&#21069;&#30340;&#26178;&#38291;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#24037;&#20316;&#21487;&#20197;&#22519;&#34892;&#30340;&#31186;&#25976;&#65292;&#36229;&#36942;&#27492;&#26178;&#38291;&#20043;&#24460;&#21363;&#23559;&#24037;&#20316;&#35222;&#28858;&#28961;&#22238;&#25033;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 0&#65292;&#20195;&#34920;&#24037;&#20316;&#27704;&#36960;&#19981;&#26371;&#34987;&#35222;&#28858;&#27794;&#26377;&#22238;&#25033;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#25551;&#36848;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#36039;&#28304;&#30340;&#31777;&#30701;&#25551;&#36848;&#12290;</p>
<p>&#35442;&#25551;&#36848;&#26159;&#19968;&#20491;&#23383;&#20018;&#20540;&#65292;&#26368;&#22810;&#21487;&#20197;&#21253;&#21547; 250 &#20491;&#23383;&#20803;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#26680;&#24515;&#22823;&#23567;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#32363;&#32218;&#38598;&#21312;&#20013;&#21487;&#20445;&#30041;&#30340;&#32363;&#32218;&#25976;&#30446; (&#21253;&#25324;&#38290;&#32622;&#29376;&#24907;&#30340;&#32363;&#32218;)&#12290;</p>
<p>&#22914;&#26524;&#22519;&#34892;&#20013;&#32363;&#32218;&#25976;&#30446;&#22312;&#25552;&#20132;&#26032;&#24037;&#20316;&#26178;&#23567;&#26044;&#26680;&#24515;&#22823;&#23567;&#65292;&#23601;&#26371;&#24314;&#31435;&#26032;&#32363;&#32218;&#20358;&#34389;&#29702;&#35531;&#27714;&#12290;&#38928;&#35373;&#20540;&#28858; 0&#65292;&#34920;&#31034;&#38500;&#38750;&#24037;&#20316;&#20295;&#21015;&#24050;&#28415;&#25110;&#32773;&#36039;&#28304;&#20351;&#29992;&#30452;&#25509;&#25490;&#20837;&#20295;&#21015;&#65292;&#21542;&#21063;&#19968;&#24459;&#19981;&#26371;&#24314;&#31435;&#26032;&#32363;&#32218;&#12290;&#24037;&#20316;&#20295;&#21015;&#23481;&#37327;&#28858; 0 &#25110;&#24037;&#20316;&#20295;&#21015;&#23481;&#37327;&#28858; 2147483647 &#19988;&#26680;&#24515;&#22823;&#23567;&#28858; 0 &#26178;&#65292;&#23601;&#26371;&#30332;&#29983;&#30452;&#25509;&#25490;&#20837;&#20295;&#21015;&#24773;&#27841;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#38598;&#21312;&#30340;&#26368;&#22823;&#22823;&#23567;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#32363;&#32218;&#38598;&#21312;&#21487;&#20197;&#21253;&#21547;&#30340;&#32363;&#32218;&#25976;&#30446;&#19978;&#38480;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 2147483647&#65292;&#20195;&#34920;&#32363;&#32218;&#38598;&#21312;&#22522;&#26412;&#19978;&#28961;&#38480;&#21046;&#65292;&#21487;&#20197;&#21253;&#21547;&#20219;&#20309;&#25976;&#37327;&#30340;&#32363;&#32218;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#25345;&#32396;&#20316;&#29992;&#26178;&#38291;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#30070;&#32363;&#32218;&#25976;&#30446;&#22823;&#26044;&#26680;&#24515;&#22823;&#23567;&#26178;&#65292;&#32363;&#32218;&#21487;&#20197;&#32173;&#25345;&#38290;&#32622;&#30340;&#31186;&#25976;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 60&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#32363;&#32218;&#23384;&#30041;&#26178;&#38291;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#32363;&#32218;&#22312;&#34987;&#28165;&#38500;&#20043;&#21069;&#21487;&#20445;&#30041;&#22312;&#32363;&#32218;&#38598;&#21312;&#20013;&#30340;&#31186;&#25976; (&#19981;&#35542;&#32363;&#32218;&#25976;&#30446;&#26159;&#21542;&#22823;&#26044;&#26680;&#24515;&#22823;&#23567;&#25110;&#32363;&#32218;&#26159;&#21542;&#28858;&#38290;&#32622;&#29376;&#24907;)&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 0&#65292;&#20195;&#34920;&#32363;&#32218;&#27704;&#36960;&#19981;&#26371;&#34987;&#28165;&#38500;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#24037;&#20316;&#20295;&#21015;&#23481;&#37327;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#24037;&#20316;&#20295;&#21015;&#20013;&#21487;&#20786;&#23384;&#20043;&#31561;&#24453;&#22519;&#34892;&#30340;&#24050;&#25552;&#20132;&#24037;&#20316;&#25976;&#30446;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 2147483647&#65292;&#20195;&#34920;&#24037;&#20316;&#20295;&#21015;&#22522;&#26412;&#19978;&#28961;&#38480;&#21046;&#65292;&#21487;&#20197;&#20786;&#23384;&#20219;&#20309;&#25976;&#37327;&#30340;&#25552;&#20132;&#24037;&#20316;&#12290;</p>
</li>
<li>
<p>&#35531;&#21247;&#22312;&#12300;&#20854;&#20182;&#29305;&#24615;&#12301;&#21312;&#27573;&#20013;&#26032;&#22686;&#20219;&#20309;&#20854;&#20182;&#29305;&#24615;&#12290;</p>
<p>GlassFish Server &#20006;&#26410;&#23450;&#32681;&#20219;&#20309;&#27492;&#36039;&#28304;&#39006;&#22411;&#30340;&#20854;&#20182;&#29305;&#24615;&#12290;&#27492;&#22806;&#65292;&#27492;&#36039;&#28304;&#39006;&#22411;&#30446;&#21069;&#20063;&#20006;&#26410;&#20351;&#29992;&#20219;&#20309;&#20854;&#20182;&#29305;&#24615;&#12290;</p>
</li>
<li>
<p>&#25353;&#19968;&#19979;&#12300;&#30906;&#23450;&#12301;&#12290;</p>
</li>
</ol>
<a id="GHCON110" name="GHCON110"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-managedexecutorserviceedit.html">&#32232;&#36655;&#21463;&#31649;&#29702;&#22519;&#34892;&#31243;&#24335;&#26381;&#21209;</a></p>
</li>
<li>
<p><a href="task-managedexecutorservicedelete.html">&#21034;&#38500;&#21463;&#31649;&#29702;&#22519;&#34892;&#31243;&#24335;&#26381;&#21209;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
