<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jdbcconnpooladvanceattrtab" name="ref-jdbcconnpooladvanceattrtab"></a><a id="GHJDB00027" name="GHJDB00027"></a></p>

<h4><a id="sthref50" name="sthref50"></a>&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#35443;&#32048;&#23646;&#24615;&#12398;&#32232;&#38598;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#35443;&#32048;&#23646;&#24615;&#12398;&#32232;&#38598;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#25509;&#32154;&#12522;&#12540;&#12463;&#12398;&#35386;&#26029;&#12392;&#20351;&#12356;&#12420;&#12377;&#12373;&#12398;&#21521;&#19978;&#12395;&#24441;&#31435;&#12388;&#23646;&#24615;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#35443;&#32048;&#23646;&#24615;&#12398;&#32232;&#38598;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12489;</dt>
<dd>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12354;&#12427;&#35373;&#23450;&#12434;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12395;&#24489;&#20803;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12394;&#12356;&#35373;&#23450;&#12399;&#22793;&#26356;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>&#12503;&#12540;&#12523;&#21517;</dt>
<dd>
<p>&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#21517;&#21069;&#12290;&#21517;&#21069;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12501;&#12451;&#12540;&#12523;&#12489;&#12391;&#12377;&#12290;&#25509;&#32154;&#12503;&#12540;&#12523;&#21517;&#12399;&#12289;&#26032;&#35215;JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#20316;&#25104;&#26178;&#12395;&#12398;&#12415;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#25991;&#12398;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;</dt>
<dd>
<p>&#30064;&#24120;&#12395;&#38263;&#12356;&#26178;&#38291;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;&#21839;&#21512;&#12379;&#12434;&#32066;&#20102;&#12373;&#12379;&#12427;&#12414;&#12391;&#12398;&#26178;&#38291;&#12398;&#38263;&#12373;(&#31186;&#25968;)&#12290;GlassFish Server&#12399;&#12289;&#20316;&#25104;&#12373;&#12428;&#12427;&#25991;&#12395;<code>QueryTimeout</code>&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;&#20516;&#12398;-1&#12399;&#12289;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#28961;&#21177;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#31034;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;-1&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#25991;&#12398;&#12461;&#12515;&#12483;&#12471;&#12517;&#12539;&#12469;&#12452;&#12474;</dt>
<dd>
<p>LRU (&#26368;&#36817;&#12398;&#20351;&#29992;&#38971;&#24230;&#12364;&#26368;&#12418;&#20302;&#12356;)&#12461;&#12515;&#12483;&#12471;&#12517;&#12539;&#12513;&#12459;&#12491;&#12474;&#12512;&#12434;&#20351;&#29992;&#12375;&#12390;&#12461;&#12515;&#12483;&#12471;&#12517;&#12373;&#12428;&#12427;&#25991;&#12398;&#25968;&#12290;0&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#25991;&#12398;&#12461;&#12515;&#12483;&#12471;&#12517;&#12399;&#28961;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;0&#12391;&#12377;&#12290;</p>
</dd>
<dt>SQL&#12398;&#21021;&#26399;&#21270;</dt>
<dd>
<p>&#12503;&#12540;&#12523;&#12395;&#25509;&#32154;&#12364;&#20316;&#25104;&#12373;&#12428;&#12427;(&#20877;&#20351;&#29992;&#20197;&#22806;)&#12392;&#12365;&#12395;&#23455;&#34892;&#12373;&#12428;&#12427;SQL&#25991;&#23383;&#21015;&#12290;&#12371;&#12398;&#25991;&#23383;&#21015;&#12398;&#23455;&#34892;&#12391;&#12289;&#25509;&#32154;&#12398;&#29366;&#24907;&#12364;&#21021;&#26399;&#21270;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>SQL&#12488;&#12524;&#12540;&#12473;&#12539;&#12522;&#12473;&#12490;&#12540;</dt>
<dd>
<p>&#12522;&#12473;&#12490;&#12540;&#23455;&#35013;&#12463;&#12521;&#12473;&#21517;&#12398;&#12459;&#12531;&#12510;&#21306;&#20999;&#12426;&#12522;&#12473;&#12488;&#12290;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12424;&#12387;&#12390;&#23455;&#34892;&#12373;&#12428;&#12427;SQL&#25991;&#12434;&#12488;&#12524;&#12540;&#12473;&#12377;&#12427;&#12371;&#12392;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12522;&#12473;&#12490;&#12540;&#12539;&#12463;&#12521;&#12473;&#12399;<code>org.glassfish.api.jdbc.SQLTraceListener</code>&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12434;&#23455;&#35013;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12522;&#12473;&#12490;&#12540;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;SQL&#25991;&#12398;&#12525;&#12464;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12395;&#31777;&#21336;&#12395;&#12501;&#12451;&#12523;&#12479;&#12434;&#36969;&#29992;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12289;&#31649;&#29702;&#32773;&#12364;&#25991;&#12434;&#35299;&#26512;&#12377;&#12427;&#38555;&#12395;&#24441;&#31435;&#12385;&#12414;&#12377;&#12290;</p>
</dd>
<dt>JDBC&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12521;&#12483;&#12503;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;Statement&#12289;PreparedStatement&#12289;CallableStatement&#12289;ResultSet&#12289;DatabaseMetaData&#12395;&#23550;&#12375;&#12390;&#12521;&#12483;&#12503;&#12373;&#12428;&#12383;JDBC&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21462;&#24471;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12503;&#12540;&#12523;</dt>
<dd>
<p>&#12503;&#12540;&#12523;&#12398;&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#12391;1&#22238;&#26908;&#35388;</dt>
<dd>
<p>&#25509;&#32154;&#12434;&#26908;&#35388;&#12377;&#12427;&#12383;&#12417;&#12398;&#36899;&#32154;&#12375;&#12383;&#12522;&#12463;&#12456;&#12473;&#12488;&#12398;&#26178;&#38291;&#38291;&#38548;&#12434;&#31186;&#21336;&#20301;&#12391;&#19968;&#24230;&#12398;&#12415;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#23646;&#24615;&#12434;&#36969;&#20999;&#12394;&#20516;&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#25509;&#32154;&#12372;&#12392;&#12398;&#30906;&#35469;&#12522;&#12463;&#12456;&#12473;&#12488;&#22238;&#25968;&#12434;&#26368;&#23567;&#12395;&#12391;&#12365;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;0&#12391;&#12377;&#12290;&#12371;&#12398;&#23646;&#24615;&#12364;&#28961;&#21177;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#25509;&#32154;&#12522;&#12540;&#12463;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;</dt>
<dd>
<p>&#25509;&#32154;&#12503;&#12540;&#12523;&#20869;&#12398;&#25509;&#32154;&#12522;&#12540;&#12463;&#12434;&#36861;&#36321;&#12377;&#12427;&#26178;&#38291;(&#31186;)&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12424;&#12427;&#25509;&#32154;&#12522;&#12540;&#12463;&#12398;&#21487;&#33021;&#24615;&#12434;&#26908;&#20986;&#12375;&#12414;&#12377;&#12290;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#25351;&#23450;&#12373;&#12428;&#12383;&#26399;&#38291;&#20869;&#12395;&#25509;&#32154;&#12434;&#12503;&#12540;&#12523;&#12395;&#36820;&#12373;&#12394;&#12363;&#12387;&#12383;&#22580;&#21512;&#12289;&#12371;&#12398;&#25509;&#32154;&#12399;&#12522;&#12540;&#12463;&#12375;&#12390;&#12356;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12427;&#12392;&#12415;&#12394;&#12373;&#12428;&#12289;&#12467;&#12540;&#12523;&#20596;&#12398;&#12473;&#12479;&#12483;&#12463;&#12539;&#12488;&#12524;&#12540;&#12473;&#12364;&#12525;&#12464;&#12395;&#35352;&#37682;&#12373;&#12428;&#12414;&#12377;&#12290;0&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#25509;&#32154;&#12522;&#12540;&#12463;&#12398;&#12488;&#12524;&#12540;&#12473;&#12399;&#28961;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;0&#12391;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#12300;&#12522;&#12540;&#12463;&#20877;&#35201;&#27714;&#12301;&#12392;&#12392;&#12418;&#12395;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12424;&#12427;&#28508;&#22312;&#30340;&#12394;&#25509;&#32154;&#12522;&#12540;&#12463;&#12434;&#36991;&#12369;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#25509;&#32154;&#12522;&#12540;&#12463;&#20877;&#35201;&#27714;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12392;&#12289;&#12522;&#12540;&#12463;&#25509;&#32154;&#12398;&#36861;&#36321;&#12364;&#23436;&#20102;&#12375;&#12383;&#24460;&#12391;&#12289;&#12522;&#12540;&#12463;&#12375;&#12383;&#25509;&#32154;&#12364;&#12503;&#12540;&#12523;&#12395;&#24489;&#20803;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#25991;&#12398;&#12522;&#12540;&#12463;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;</dt>
<dd>
<p>&#25509;&#32154;&#12503;&#12540;&#12523;&#20869;&#12398;&#25991;&#12522;&#12540;&#12463;&#12434;&#36861;&#36321;&#12377;&#12427;&#26178;&#38291;(&#31186;)&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12424;&#12427;&#25991;&#12522;&#12540;&#12463;&#12398;&#21487;&#33021;&#24615;&#12434;&#26908;&#20986;&#12375;&#12414;&#12377;&#12290;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#25351;&#23450;&#12373;&#12428;&#12383;&#26399;&#38291;&#20869;&#12395;&#25991;&#12434;&#12503;&#12540;&#12523;&#12395;&#36820;&#12373;&#12394;&#12363;&#12387;&#12383;&#22580;&#21512;&#12289;&#12371;&#12398;&#25509;&#32154;&#12399;&#12522;&#12540;&#12463;&#12375;&#12390;&#12356;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12427;&#12392;&#12415;&#12394;&#12373;&#12428;&#12289;&#12467;&#12540;&#12523;&#20596;&#12398;&#12473;&#12479;&#12483;&#12463;&#12539;&#12488;&#12524;&#12540;&#12473;&#12364;&#12525;&#12464;&#12395;&#35352;&#37682;&#12373;&#12428;&#12414;&#12377;&#12290;0&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#25991;&#12522;&#12540;&#12463;&#12398;&#12488;&#12524;&#12540;&#12473;&#12399;&#28961;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;0&#12391;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#12300;&#25991;&#12398;&#12522;&#12540;&#12463;&#20877;&#35201;&#27714;&#12301;&#12392;&#12392;&#12418;&#12395;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12424;&#12427;&#28508;&#22312;&#30340;&#12394;&#25509;&#32154;&#12522;&#12540;&#12463;&#12434;&#36991;&#12369;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#25991;&#12398;&#12522;&#12540;&#12463;&#20877;&#35201;&#27714;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12392;&#12289;&#12522;&#12540;&#12463;&#25991;&#12398;&#36861;&#36321;&#12364;&#23436;&#20102;&#12375;&#12383;&#24460;&#12391;&#12289;&#12522;&#12540;&#12463;&#12375;&#12383;&#25991;&#12364;&#12503;&#12540;&#12523;&#12395;&#24489;&#20803;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#20316;&#25104;&#20877;&#35430;&#34892;&#22238;&#25968;</dt>
<dd>
<p>&#26032;&#35215;&#25509;&#32154;&#12398;&#20316;&#25104;&#12395;&#22833;&#25943;&#12375;&#12383;&#22580;&#21512;&#12395;&#34892;&#12431;&#12428;&#12427;&#35430;&#34892;&#12398;&#22238;&#25968;&#12290;0&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#25509;&#32154;&#12398;&#20316;&#25104;&#12399;&#20877;&#35430;&#34892;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;0&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#20877;&#35430;&#34892;&#38291;&#38548;</dt>
<dd>
<p>&#25509;&#32154;&#20316;&#25104;&#12398;&#35430;&#34892;&#12398;&#38291;&#38548;(&#31186;&#25968;)&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;10&#12391;&#12377;&#12290;&#12371;&#12398;&#23646;&#24615;&#12399;&#12289;&#12300;&#20316;&#25104;&#20877;&#35430;&#34892;&#22238;&#25968;&#12301;&#12364;1&#20197;&#19978;&#12398;&#22580;&#21512;&#12395;&#12398;&#12415;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#20351;&#29992;&#26178;&#12395;&#12398;&#12415;&#38306;&#36899;&#20184;&#12369;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12289;&#29289;&#29702;&#30340;&#12394;&#25509;&#32154;&#12399;&#12289;&#25509;&#32154;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#12392;&#12365;&#12395;&#12398;&#12415;&#35542;&#29702;&#30340;&#12394;&#25509;&#32154;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12414;&#12377;&#12290;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12364;&#23436;&#20102;&#12375;&#12390;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12539;&#12513;&#12477;&#12483;&#12489;&#12364;&#32066;&#20102;&#12375;&#12383;&#12392;&#12365;&#12395;&#38306;&#36899;&#20184;&#12369;&#12364;&#35299;&#38500;&#12373;&#12428;&#12427;&#12383;&#12417;&#12289;&#29289;&#29702;&#30340;&#12394;&#25509;&#32154;&#12434;&#20877;&#21033;&#29992;&#12375;&#12420;&#12377;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#20351;&#29992;&#26178;&#12395;&#12398;&#12415;&#25509;&#32154;&#12434;&#30331;&#37682;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12289;&#12522;&#12477;&#12540;&#12473;&#12399;&#23455;&#38555;&#12395;&#12513;&#12477;&#12483;&#12489;&#12391;&#20351;&#29992;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;&#12398;&#12415;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12395;&#30331;&#37682;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12473;&#12524;&#12483;&#12489;&#12392;&#12398;&#38306;&#36899;&#20184;&#12369;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12289;&#25509;&#32154;&#12392;&#12473;&#12524;&#12483;&#12489;&#12398;&#38291;&#12398;&#12450;&#12477;&#12471;&#12456;&#12540;&#12471;&#12519;&#12531;&#12364;&#20316;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12428;&#12395;&#12424;&#12426;&#12289;&#21516;&#12376;&#12473;&#12524;&#12483;&#12489;&#12364;&#25509;&#32154;&#12434;&#24517;&#35201;&#12392;&#12377;&#12427;&#12392;&#12365;&#12399;&#12289;&#12381;&#12398;&#12473;&#12524;&#12483;&#12489;&#12395;&#12377;&#12391;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12390;&#12356;&#12427;&#25509;&#32154;&#12434;&#20877;&#21033;&#29992;&#12391;&#12365;&#12427;&#12383;&#12417;&#12289;&#12503;&#12540;&#12523;&#12363;&#12425;&#25509;&#32154;&#12434;&#21462;&#24471;&#12377;&#12427;&#12458;&#12540;&#12496;&#12540;&#12504;&#12483;&#12489;&#12364;&#30330;&#29983;&#12375;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#25509;&#32154;&#12398;&#29031;&#21512;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12289;&#12503;&#12540;&#12523;&#12363;&#12425;&#36984;&#25246;&#12373;&#12428;&#12383;&#25509;&#32154;&#12399;&#12289;&#29305;&#23450;&#12398;&#36039;&#26684;&#35388;&#26126;&#12434;&#25345;&#12388;&#25509;&#32154;&#12392;&#19968;&#33268;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#35079;&#25968;&#12398;&#12518;&#12540;&#12470;&#12540;&#36039;&#26684;&#35388;&#26126;&#12434;&#25345;&#12388;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12424;&#12387;&#12390;&#25509;&#32154;&#12503;&#12540;&#12523;&#12364;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12503;&#12540;&#12523;&#20869;&#12398;&#25509;&#32154;&#12364;&#24120;&#12395;&#21516;&#12376;&#31278;&#39006;&#12391;&#12354;&#12426;&#12289;&#12503;&#12540;&#12523;&#12363;&#12425;&#36984;&#25246;&#12375;&#12383;&#25509;&#32154;&#12392;&#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12434;&#29031;&#21512;&#12377;&#12427;&#24517;&#35201;&#12364;&#12394;&#12356;&#12371;&#12392;&#12434;&#31649;&#29702;&#32773;&#12364;&#30906;&#35469;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#28961;&#21177;&#12395;&#12375;&#12390;&#12418;&#12363;&#12414;&#12356;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#25509;&#32154;&#20351;&#29992;&#25968;</dt>
<dd>
<p>&#25509;&#32154;&#12434;&#12503;&#12540;&#12523;&#12391;&#20877;&#21033;&#29992;&#12377;&#12427;&#22238;&#25968;&#12290;&#25351;&#23450;&#12373;&#12428;&#12383;&#22238;&#25968;&#12384;&#12369;&#20877;&#21033;&#29992;&#12373;&#12428;&#12427;&#12392;&#12289;&#12381;&#12398;&#25509;&#32154;&#12399;&#12463;&#12525;&#12540;&#12474;&#12373;&#12428;&#12414;&#12377;&#12290;&#25509;&#32154;&#12434;&#20877;&#21033;&#29992;&#12391;&#12365;&#12427;&#22238;&#25968;&#12434;&#21046;&#38480;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12426;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#25991;&#12434;&#38281;&#12376;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12395;&#12289;&#25991;&#12398;&#12522;&#12540;&#12463;&#12434;&#36991;&#12369;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#20516;&#12398;0&#12399;&#12289;&#12371;&#12398;&#23646;&#24615;&#12364;&#28961;&#21177;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;0&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#25509;&#32154;&#26908;&#35388;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12289;&#38556;&#23475;&#30330;&#29983;&#26178;&#12395;&#12469;&#12540;&#12496;&#12540;&#12364;&#20877;&#25509;&#32154;&#12377;&#12427;&#12383;&#12417;&#12398;&#25509;&#32154;&#26908;&#35388;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#26908;&#35388;&#26041;&#27861;</dt>
<dd>
<p>GlassFish Server&#12399;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#25509;&#32154;&#12434;&#27425;&#12398;&#26041;&#27861;&#12391;&#26908;&#35388;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<dl>
<dt><code>auto-commit</code>&#12362;&#12424;&#12403;<code>metadata</code></dt>
<dd>
<p>GlassFish Server&#12399;&#12289;<code>con.getAutoCommit</code>&#12414;&#12383;&#12399;<code>con.getMetaData</code>&#12513;&#12477;&#12483;&#12489;&#12434;&#12467;&#12540;&#12523;&#12375;&#12390;&#25509;&#32154;&#12434;&#26908;&#35388;&#12375;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
&#22810;&#25968;&#12398;JDBC&#12489;&#12521;&#12452;&#12496;&#12364;&#12289;&#12371;&#12428;&#12425;&#12398;&#12467;&#12540;&#12523;&#12398;&#32080;&#26524;&#12434;&#12461;&#12515;&#12483;&#12471;&#12517;&#12375;&#12414;&#12377;&#12290;&#12381;&#12398;&#32080;&#26524;&#12289;&#12371;&#12428;&#12425;&#12398;&#12467;&#12540;&#12523;&#12434;&#20351;&#29992;&#12377;&#12427;&#12392;&#12289;&#20449;&#38972;&#12391;&#12365;&#12427;&#26908;&#35388;&#12364;&#34892;&#12431;&#12428;&#12394;&#12356;&#22580;&#21512;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#12467;&#12540;&#12523;&#12364;&#12461;&#12515;&#12483;&#12471;&#12517;&#12373;&#12428;&#12427;&#12363;&#12393;&#12358;&#12363;&#12395;&#12388;&#12356;&#12390;&#12289;&#12489;&#12521;&#12452;&#12496;&#12539;&#12505;&#12531;&#12480;&#12540;&#12395;&#21839;&#12356;&#21512;&#12379;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
<hr>

</dd>
<dt><code>custom-validation</code></dt>
<dd>
<p>GlassFish Server&#12399;&#12289;&#12459;&#12473;&#12479;&#12512;&#23455;&#35013;&#12463;&#12521;&#12473;&#12391;&#12300;&#26908;&#35388;&#12463;&#12521;&#12473;&#21517;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#25351;&#23450;&#12375;&#12383;&#12289;&#12518;&#12540;&#12470;&#12540;&#23450;&#32681;&#12398;&#26908;&#35388;&#12513;&#12459;&#12491;&#12474;&#12512;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt><code>table</code></dt>
<dd>
<p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#25351;&#23450;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#34920;&#12395;&#21839;&#12356;&#21512;&#12379;&#12414;&#12377;&#12290;&#34920;&#12364;&#23384;&#22312;&#12375;&#12390;&#12356;&#12390;&#12450;&#12463;&#12475;&#12473;&#21487;&#33021;&#12391;&#12354;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;&#34892;&#12399;&#24517;&#35201;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#22810;&#12367;&#12398;&#34892;&#12434;&#25345;&#12388;&#26082;&#23384;&#12398;&#34920;&#12420;&#12289;&#12377;&#12391;&#12395;&#38971;&#32321;&#12395;&#12450;&#12463;&#12475;&#12473;&#12373;&#12428;&#12390;&#12356;&#12427;&#34920;&#12434;&#20351;&#29992;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</dd>
</dl>
</dd>
<dt>&#12486;&#12540;&#12502;&#12523;&#21517;</dt>
<dd>
<p>&#26908;&#35388;&#12395;&#20351;&#29992;&#12377;&#12427;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#34920;&#12398;&#21517;&#21069;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#12289;&#12300;&#26908;&#35388;&#26041;&#27861;&#12301;&#12364;<code>table</code>&#12395;&#35373;&#23450;&#12373;&#12428;&#12383;&#22580;&#21512;&#12395;&#12398;&#12415;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#21517;&#21069;&#12434;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#36984;&#25246;&#12377;&#12427;&#12363;&#12289;&#12414;&#12383;&#12399;&#20837;&#21147;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#26908;&#35388;&#12463;&#12521;&#12473;&#21517;</dt>
<dd>
<p>&#12459;&#12473;&#12479;&#12512;&#26908;&#35388;&#12398;&#23455;&#35013;&#12463;&#12521;&#12473;&#21517;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#12289;&#12300;&#26908;&#35388;&#26041;&#27861;&#12301;&#12364;<code>custom-validation</code>&#12395;&#35373;&#23450;&#12373;&#12428;&#12383;&#22580;&#21512;&#12395;&#12398;&#12415;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#25351;&#23450;&#12375;&#12383;&#12463;&#12521;&#12473;&#21517;&#12399;&#12289;GlassFish Server&#12363;&#12425;&#12450;&#12463;&#12475;&#12473;&#21487;&#33021;&#12391;&#12354;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#25351;&#23450;&#12375;&#12383;&#12463;&#12521;&#12473;&#12399;<code>org.glassfish.api.jdbc.ConnectionValidation</code>&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12434;&#23455;&#35013;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#21517;&#21069;&#12434;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#36984;&#25246;&#12377;&#12427;&#12363;&#12289;&#12414;&#12383;&#12399;&#20837;&#21147;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12377;&#12409;&#12390;&#12398;&#38556;&#23475;&#26178;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12289;&#12356;&#12378;&#12428;&#12363;&#12398;&#25509;&#32154;&#12364;&#22833;&#25943;&#12377;&#12427;&#12392;&#12289;GlassFish Server&#12399;&#12503;&#12540;&#12523;&#20869;&#12398;&#12377;&#12409;&#12390;&#12398;&#25509;&#32154;&#12434;&#38281;&#12376;&#12390;&#12289;&#12381;&#12428;&#12425;&#12434;&#20877;&#24230;&#30906;&#31435;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#28961;&#21177;&#12394;&#22580;&#21512;&#12289;&#20491;&#12293;&#12398;&#25509;&#32154;&#12399;&#12381;&#12428;&#12382;&#12428;&#12398;&#20351;&#29992;&#26178;&#12398;&#12415;&#20877;&#24230;&#30906;&#31435;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#21628;&#20986;&#12375;&#20596;&#20197;&#22806;&#12434;&#35377;&#21487;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12399;&#12289;&#12469;&#12540;&#12502;&#12524;&#12483;&#12488;&#12539;&#12501;&#12451;&#12523;&#12479;&#12420;&#20182;&#31038;&#12398;&#27704;&#32154;&#24615;&#12510;&#12493;&#12540;&#12472;&#12515;&#12394;&#12393;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#20197;&#22806;&#12398;&#12467;&#12540;&#12523;&#20596;&#12364;&#12503;&#12540;&#12523;&#12434;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12467;&#12540;&#12523;&#20596;&#20197;&#22806;&#12395;&#12424;&#12387;&#12390;&#21462;&#24471;&#12373;&#12428;&#12383;&#25509;&#32154;&#12399;&#12289;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#32066;&#12431;&#12426;&#12395;&#12467;&#12531;&#12486;&#12490;&#12395;&#12424;&#12387;&#12390;&#33258;&#21205;&#30340;&#12395;&#12463;&#12525;&#12540;&#12474;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12467;&#12540;&#12523;&#20596;&#12364;&#26126;&#31034;&#30340;&#12395;&#12463;&#12525;&#12540;&#12474;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<a id="sthref51" name="sthref51"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12450;&#12463;&#12475;&#12473;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">JDBC&#12489;&#12521;&#12452;&#12496;&#12434;&#32113;&#21512;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#19968;&#33324;&#35373;&#23450;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#35373;&#23450;&#12434;&#26908;&#35388;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#35443;&#32048;&#23646;&#24615;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref52" name="sthref52"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00001"><code>add-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00036"><code>create-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00088"><code>delete-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00135"><code>flush-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00173"><code>list-jdbc-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00214"><code>ping-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00234"><code>start-database</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00239"><code>stop-database</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
