<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jdbcresourcenew" name="ref-jdbcresourcenew"></a><a id="GHJDB00021" name="GHJDB00021"></a></p>

<h4><a id="sthref32" name="sthref32"></a>&#26032;&#35215;JDBC&#12522;&#12477;&#12540;&#12473;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12300;&#26032;&#35215;JDBC&#12522;&#12477;&#12540;&#12473;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#26032;&#35215;JDBC&#12522;&#12477;&#12540;&#12473;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26032;&#35215;JDBC&#12522;&#12477;&#12540;&#12473;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>JNDI&#21517;</dt>
<dd>
<p>JDBC&#12522;&#12477;&#12540;&#12473;&#12434;&#35672;&#21029;&#12377;&#12427;&#19968;&#24847;&#12398;&#21517;&#21069;&#12290;&#12459;&#12540;&#12489;&#24335;&#12398;&#30446;&#37682;&#12395;&#12424;&#12387;&#12390;&#22259;&#26360;&#39208;&#12398;&#34101;&#26360;&#12398;&#20998;&#39006;&#12392;&#20445;&#31649;&#22580;&#25152;&#12398;&#31649;&#29702;&#12434;&#34892;&#12358;&#22580;&#21512;&#12392;&#21516;&#27096;&#12398;&#26041;&#27861;&#12391;&#12289;&#20998;&#25955;&#12467;&#12531;&#12500;&#12517;&#12540;&#12486;&#12451;&#12531;&#12464;&#29872;&#22659;&#12395;&#37197;&#32622;&#12373;&#12428;&#12383;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#32232;&#25104;&#12392;&#22580;&#25152;&#12398;&#31649;&#29702;&#12364;JNDI&#21517;&#12395;&#12424;&#12387;&#12390;&#34892;&#12431;&#12428;&#12414;&#12377;&#12290;&#12381;&#12398;&#12383;&#12417;&#12289;JNDI&#21517;&#12399;JDBC&#12522;&#12477;&#12540;&#12473;&#12408;&#12398;&#37325;&#35201;&#12394;&#12450;&#12463;&#12475;&#12473;&#26041;&#27861;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;&#35215;&#21063;&#12395;&#12424;&#12426;&#12289;&#21517;&#21069;&#12399;<code>jdbc/</code>&#25991;&#23383;&#21015;&#12391;&#22987;&#12414;&#12426;&#12414;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;<code>jdbc/payrolldb</code>&#12394;&#12393;&#12391;&#12377;&#12290;&#12473;&#12521;&#12483;&#12471;&#12517;&#12434;&#24536;&#12428;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;&#21517;&#21069;&#12395;&#21547;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12398;&#12399;&#12289;&#33521;&#25968;&#23383;&#12289;&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#12289;&#12480;&#12483;&#12471;&#12517;&#12289;&#12414;&#12383;&#12399;&#12489;&#12483;&#12488;&#12398;&#21508;&#25991;&#23383;&#12398;&#12415;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12503;&#12540;&#12523;&#21517;</dt>
<dd>
<p>JDBC&#12522;&#12477;&#12540;&#12473;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12383;&#25509;&#32154;&#12503;&#12540;&#12523;&#12290;</p>
</dd>
<dt>&#35500;&#26126;</dt>
<dd>
<p>JDBC&#12522;&#12477;&#12540;&#12473;&#12398;&#31777;&#21336;&#12394;&#35500;&#26126;&#12290;</p>
</dd>
<dt>&#12473;&#12486;&#12540;&#12479;&#12473;</dt>
<dd>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12289;&#12522;&#12477;&#12540;&#12473;&#12399;&#23455;&#34892;&#26178;&#12395;&#20351;&#29992;&#21487;&#33021;&#12391;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;</dt>
<dd>
<p>JDBC&#12522;&#12477;&#12540;&#12473;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12290;GlassFish Server&#12399;JDBC&#12522;&#12477;&#12540;&#12473;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#23450;&#32681;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>&#12479;&#12540;&#12466;&#12483;&#12488;</dt>
<dd>
<p>JDBC&#12522;&#12477;&#12540;&#12473;&#12398;&#12463;&#12521;&#12473;&#12479;&#12362;&#12424;&#12403;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12290;&#24517;&#35201;&#12394;&#12479;&#12540;&#12466;&#12483;&#12488;&#12434;&#12300;&#36984;&#25246;&#12375;&#12383;&#12479;&#12540;&#12466;&#12483;&#12488;&#12301;&#21015;&#12395;&#31227;&#21205;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12414;&#12383;&#12399;&#12300;&#12377;&#12409;&#12390;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#19981;&#35201;&#12394;&#12479;&#12540;&#12466;&#12483;&#12488;&#12434;&#12300;&#20351;&#29992;&#21487;&#33021;&#12394;&#12479;&#12540;&#12466;&#12483;&#12488;&#12301;&#21015;&#12395;&#31227;&#21205;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#38500;&#21435;&#12301;&#12508;&#12479;&#12531;&#12414;&#12383;&#12399;&#12300;&#12377;&#12409;&#12390;&#38500;&#21435;&#12301;&#12508;&#12479;&#12531;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12489;&#12513;&#12452;&#12531;&#20869;&#12395;&#12463;&#12521;&#12473;&#12479;&#12414;&#12383;&#12399;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20316;&#25104;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<a id="sthref33" name="sthref33"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12450;&#12463;&#12475;&#12473;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">JDBC&#12489;&#12521;&#12452;&#12496;&#12434;&#32113;&#21512;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcenew.html">JDBC&#12522;&#12477;&#12540;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesedit.html">JDBC&#12522;&#12477;&#12540;&#12473;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesdelete.html">JDBC&#12522;&#12477;&#12540;&#12473;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref34" name="sthref34"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00001"><code>add-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00037"><code>create-jdbc-resource</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00089"><code>delete-jdbc-resource</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00174"><code>list-jdbc-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00036"><code>create-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00234"><code>start-database</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00239"><code>stop-database</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
