<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jdbcconnectionpools" name="ref-jdbcconnectionpools"></a><a id="GHJDB00023" name="GHJDB00023"></a></p>

<h4><a id="sthref35" name="sthref35"></a>&#25509;&#32154;&#12503;&#12540;&#12523;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12395;&#12399;&#12289;&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#30331;&#37682;&#26178;&#12395;&#20316;&#25104;&#12373;&#12428;&#12383;JDBC&#25509;&#32154;&#12398;&#12464;&#12523;&#12540;&#12503;&#12364;&#26684;&#32013;&#12373;&#12428;&#12414;&#12377;&#12290;&#25509;&#32154;&#12503;&#12540;&#12523;&#12399;&#12289;JDBC&#12489;&#12521;&#12452;&#12496;&#12434;&#20351;&#29992;&#12375;&#12390;&#29289;&#29702;&#30340;&#12394;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#25509;&#32154;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12289;&#25509;&#32154;&#12503;&#12540;&#12523;&#12363;&#12425;&#25509;&#32154;&#12434;&#20511;&#12426;&#12390;&#20351;&#29992;&#12375;&#12289;&#25509;&#32154;&#12434;&#12463;&#12525;&#12540;&#12474;&#12375;&#12390;&#25509;&#32154;&#12503;&#12540;&#12523;&#12395;&#36820;&#12375;&#12414;&#12377;&#12290;JDBC&#12522;&#12477;&#12540;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#38306;&#36899;&#12377;&#12427;&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#35079;&#25968;&#12398;JDBC&#12522;&#12477;&#12540;&#12473;&#12364;1&#12388;&#12398;&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<p>JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12392;&#12399;&#12289;&#29305;&#23450;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#12383;&#12417;&#12398;&#20877;&#21033;&#29992;&#21487;&#33021;&#12394;&#25509;&#32154;&#12398;&#12464;&#12523;&#12540;&#12503;&#12391;&#12377;&#12290;&#26032;&#35215;&#29289;&#29702;&#25509;&#32154;&#12434;&#12381;&#12428;&#12382;&#12428;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;&#26178;&#38291;&#12364;&#12363;&#12363;&#12427;&#12398;&#12391;&#12289;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#21521;&#19978;&#12398;&#12383;&#12417;&#12395;&#12469;&#12540;&#12496;&#12540;&#12399;&#20351;&#29992;&#21487;&#33021;&#12394;&#25509;&#32154;&#12398;&#12503;&#12540;&#12523;&#12434;&#20445;&#25345;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#25509;&#32154;&#12434;&#12522;&#12463;&#12456;&#12473;&#12488;&#12377;&#12427;&#12392;&#12289;&#12503;&#12540;&#12523;&#12363;&#12425;1&#12388;&#12398;&#25509;&#32154;&#12364;&#21462;&#24471;&#12373;&#12428;&#12414;&#12377;&#12290;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#25509;&#32154;&#12434;&#12463;&#12525;&#12540;&#12474;&#12377;&#12427;&#12392;&#12289;&#25509;&#32154;&#12399;&#12503;&#12540;&#12523;&#12395;&#36820;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<p>&#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12391;&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#12392;&#12289;&#29305;&#23450;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12408;&#12398;&#25509;&#32154;&#12398;&#38917;&#30446;&#12434;&#23450;&#32681;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
<p>&#12300;JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#27083;&#25104;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#25509;&#32154;&#12503;&#12540;&#12523;&#12372;&#12392;&#12395;&#12289;&#27425;&#12398;&#24773;&#22577;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12503;&#12540;&#12523;&#21517;</dt>
<dd>
<p>&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#21517;&#21069;&#12290;</p>
</dd>
<dt>&#12522;&#12477;&#12540;&#12473;&#12539;&#12479;&#12452;&#12503;</dt>
<dd>
<p>&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#12522;&#12477;&#12540;&#12473;&#12539;&#12479;&#12452;&#12503;&#12290;</p>
</dd>
<dt>&#12463;&#12521;&#12473;&#21517;</dt>
<dd>
<p><code>javax.sql.XADataSource</code>&#12289;<code>java.sql.ConnectionPoolDataSource</code>&#12289;<code>javax.sql.DataSource</code>&#12289;&#12414;&#12383;&#12399;<code>java.sql.Driver</code> API&#12434;&#23455;&#35013;&#12377;&#12427;&#12505;&#12531;&#12480;&#12540;&#22266;&#26377;&#12398;&#12463;&#12521;&#12473;&#21517;&#12290;</p>
</dd>
<dt>&#35500;&#26126;</dt>
<dd>
<p>&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#31777;&#21336;&#12394;&#35500;&#26126;&#12290;</p>
</dd>
</dl>
<p>&#12300;&#12503;&#12540;&#12523;&#12301;&#12398;&#34920;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12418;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#26032;&#35215;</dt>
<dd>
<p>&#26032;&#35215;&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
<dt>&#21066;&#38500;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#21066;&#38500;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
</dl>
<a id="sthref36" name="sthref36"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12450;&#12463;&#12475;&#12473;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">JDBC&#12489;&#12521;&#12452;&#12496;&#12434;&#32113;&#21512;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#19968;&#33324;&#35373;&#23450;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#35373;&#23450;&#12434;&#26908;&#35388;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#35443;&#32048;&#23646;&#24615;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref37" name="sthref37"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00001"><code>add-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00036"><code>create-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00088"><code>delete-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00135"><code>flush-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00173"><code>list-jdbc-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00214"><code>ping-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00234"><code>start-database</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00239"><code>stop-database</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
