<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jdbcconnectionpoolnew" name="task-jdbcconnectionpoolnew"></a></p>

<h4><a id="sthref14" name="sthref14"></a>JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12391;&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#12392;&#12289;&#29305;&#23450;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12408;&#12398;&#25509;&#32154;&#12398;&#38917;&#30446;&#12434;&#23450;&#32681;&#12377;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
<a id="sthref15" name="sthref15"></a>
<h5>&#38283;&#22987;&#21069;</h5>
<p>&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;JDBC API&#12434;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427;&#12489;&#12521;&#12452;&#12496;(JDBC&#12489;&#12521;&#12452;&#12496;)&#12434;&#26368;&#21021;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12289;&#32113;&#21512;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;<a href="task-integratejdbcdriver.html">JDBC&#12489;&#12521;&#12452;&#12496;&#12434;&#32113;&#21512;&#12377;&#12427;&#12395;&#12399;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#20316;&#25104;&#12395;&#12399;&#27425;&#12398;&#24773;&#22577;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;&#32154;&#34892;&#12377;&#12427;&#21069;&#12395;&#12371;&#12398;&#24773;&#22577;&#12434;&#21454;&#38598;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<ul>
<li>
<p>&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12489;&#12521;&#12452;&#12496;&#12398;&#12505;&#12531;&#12480;&#12540;&#21517;</p>
</li>
<li>
<p><code>javax.sql.DataSource</code>(&#12525;&#12540;&#12459;&#12523;&#12539;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#12415;)&#12289;<code>java.sql.ConnectionPoolDataSource</code>(&#12525;&#12540;&#12459;&#12523;&#12539;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12289;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#25913;&#21892;&#12364;&#21487;&#33021;)&#12289;<code>javax.sql.XADataSource</code>(&#12464;&#12525;&#12540;&#12496;&#12523;&#12539;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;)&#12289;&#12362;&#12424;&#12403;<code>java.sql.Driver</code>&#12394;&#12393;&#12398;&#12522;&#12477;&#12540;&#12473;&#12539;&#12479;&#12452;&#12503;</p>
</li>
<li>
<p>&#12487;&#12540;&#12479;&#12477;&#12540;&#12473;&#12539;&#12463;&#12521;&#12473;&#21517;</p>
</li>
<li>
<p>&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#21517;(URL)&#12289;&#12518;&#12540;&#12470;&#12540;&#21517;&#12289;&#12362;&#12424;&#12403;&#12497;&#12473;&#12527;&#12540;&#12489;&#12394;&#12393;&#12398;&#24517;&#35201;&#12394;&#12503;&#12525;&#12497;&#12486;&#12451;</p>
</li>
</ul>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#20849;&#36890;&#12479;&#12473;&#12463;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#20849;&#36890;&#12479;&#12473;&#12463;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20849;&#36890;&#12479;&#12473;&#12463;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;&#26032;&#35215;JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26032;&#35215;JDBC&#25509;&#32154;&#12503;&#12540;&#12523;(&#12473;&#12486;&#12483;&#12503;1/2)&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
&#12300;&#12522;&#12477;&#12540;&#12473;&#12301;&#12494;&#12540;&#12489;&#12362;&#12424;&#12403;&#12300;JDBC&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12289;&#12300;&#25509;&#32154;&#12503;&#12540;&#12523;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#12300;&#26032;&#35215;JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12301;&#12506;&#12540;&#12472;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;&#27425;&#12395;&#12289;&#12300;&#25509;&#32154;&#12503;&#12540;&#12523;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;&#26032;&#35215;&#12301;&#12434;&#36984;&#25246;&#12375;&#12390;&#26032;&#35215;&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;
<hr>

</li>
<li>
<p>&#12300;&#12503;&#12540;&#12523;&#21517;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#26032;&#35215;&#25509;&#32154;&#12501;&#12451;&#12540;&#12523;&#12489;&#12398;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#24517;&#38920;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12522;&#12477;&#12540;&#12473;&#12539;&#12479;&#12452;&#12503;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#12522;&#12477;&#12540;&#12473;&#12539;&#12479;&#12452;&#12503;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#36984;&#25246;&#12391;&#12365;&#12427;&#12398;&#12399;&#12289;<code>javax.sql.XADataSource</code>(&#12464;&#12525;&#12540;&#12496;&#12523;&#12539;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;)&#12289;<code>java.sql.ConnectionPoolDataSource</code>(&#12525;&#12540;&#12459;&#12523;&#12539;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12289;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#25913;&#21892;&#12364;&#21487;&#33021;)&#12289;<code>javax.sql.DataSource</code>(&#12525;&#12540;&#12459;&#12523;&#12539;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#12415;)&#12289;&#12362;&#12424;&#12403;<code>java.sql.Driver</code>&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12505;&#12531;&#12480;&#12540;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<ol type="a">
<li>
<p>&#12300;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12489;&#12521;&#12452;&#12496;&#12398;&#12505;&#12531;&#12480;&#12540;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12505;&#12531;&#12480;&#12540;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12505;&#12531;&#12480;&#12540;&#12364;&#12522;&#12473;&#12488;&#12395;&#34920;&#31034;&#12373;&#12428;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12300;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12489;&#12521;&#12452;&#12496;&#12398;&#12505;&#12531;&#12480;&#12540;&#12301;&#12486;&#12461;&#12473;&#12488;&#12539;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12505;&#12531;&#12480;&#12540;&#12398;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
</li>
<li>
<p>&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12489;&#12521;&#12452;&#12496;&#12434;&#12522;&#12477;&#12540;&#12473;&#12539;&#12479;&#12452;&#12503;&#12362;&#12424;&#12403;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12489;&#12521;&#12452;&#12496;&#12398;&#12505;&#12531;&#12480;&#12540;&#12395;&#22522;&#12389;&#12356;&#12390;&#20869;&#37096;&#26908;&#26619;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12452;&#12531;&#12488;&#12525;&#12473;&#12506;&#12463;&#12488;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12452;&#12531;&#12488;&#12525;&#12473;&#12506;&#12463;&#12471;&#12519;&#12531;&#12434;&#21205;&#20316;&#12373;&#12379;&#12427;&#12395;&#12399;&#12289;GlassFish Server&#12391;JDBC&#12489;&#12521;&#12452;&#12496;&#12434;&#20351;&#29992;&#12391;&#12365;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;<a href="task-integratejdbcdriver.html">JDBC&#12489;&#12521;&#12452;&#12496;&#12434;&#32113;&#21512;&#12377;&#12427;&#12395;&#12399;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
<li>
<p>&#12300;&#27425;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26032;&#35215;JDBC&#25509;&#32154;&#12503;&#12540;&#12523;(&#12473;&#12486;&#12483;&#12503;2/2)&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12487;&#12540;&#12479;&#12477;&#12540;&#12473;&#12539;&#12463;&#12521;&#12473;&#21517;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;<code>DataSource</code>&#12289;<code>ConnectionPoolDataSource</code>&#12289;&#12414;&#12383;&#12399;<code>XADataSource</code>&#12398;API&#12434;&#23455;&#35013;&#12377;&#12427;&#12505;&#12531;&#12480;&#12540;&#22266;&#26377;&#12398;&#12463;&#12521;&#12473;&#21517;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12452;&#12531;&#12488;&#12525;&#12473;&#12506;&#12463;&#12488;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12434;&#36984;&#25246;&#12375;&#12289;&#12487;&#12540;&#12479;&#12477;&#12540;&#12473;&#12539;&#12522;&#12477;&#12540;&#12473;&#12539;&#12479;&#12452;&#12503;&#12398;&#12356;&#12378;&#12428;&#12363;&#12434;&#36984;&#25246;&#12375;&#12383;&#22580;&#21512;&#12289;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12399;&#12289;&#36984;&#25246;&#12375;&#12383;&#12522;&#12477;&#12540;&#12473;&#12539;&#12479;&#12452;&#12503;&#12392;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12505;&#12531;&#12480;&#12540;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12383;&#12463;&#12521;&#12473;&#21517;&#12364;&#33258;&#21205;&#30340;&#12395;&#20837;&#21147;&#12373;&#12428;&#12414;&#12377;&#12290;<code>java.sql.Driver</code>&#12522;&#12477;&#12540;&#12473;&#12539;&#12479;&#12452;&#12503;&#12434;&#36984;&#25246;&#12375;&#12383;&#22580;&#21512;&#12289;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#28961;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12489;&#12521;&#12452;&#12496;&#12539;&#12463;&#12521;&#12473;&#21517;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;<code>java.sql.Driver</code> API&#12434;&#23455;&#35013;&#12377;&#12427;&#12505;&#12531;&#12480;&#12540;&#22266;&#26377;&#12398;&#12463;&#12521;&#12473;&#21517;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12452;&#12531;&#12488;&#12525;&#12473;&#12506;&#12463;&#12488;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12434;&#36984;&#25246;&#12377;&#12427;&#12363;&#12289;<code>java.sql.Driver</code>&#12522;&#12477;&#12540;&#12473;&#12539;&#12479;&#12452;&#12503;&#12434;&#36984;&#25246;&#12375;&#12383;&#22580;&#21512;&#12289;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12399;&#12289;&#36984;&#25246;&#12375;&#12383;&#12489;&#12521;&#12452;&#12496;&#12392;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12505;&#12531;&#12480;&#12540;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12383;&#12463;&#12521;&#12473;&#21517;&#12364;&#33258;&#21205;&#30340;&#12395;&#20837;&#21147;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12540;&#12479;&#12477;&#12540;&#12473;&#12539;&#12522;&#12477;&#12540;&#12473;&#12539;&#12479;&#12452;&#12503;&#12398;&#12356;&#12378;&#12428;&#12363;&#12434;&#36984;&#25246;&#12375;&#12383;&#22580;&#21512;&#12289;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#28961;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;Ping&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#12503;&#12540;&#12523;&#12398;&#20316;&#25104;&#12414;&#12383;&#12399;&#20877;&#27083;&#25104;&#26178;&#12395;&#12503;&#12540;&#12523;&#12395;&#23550;&#12375;&#12390;&#33258;&#21205;&#30340;&#12395;ping&#12434;&#23455;&#34892;&#12375;&#12289;&#35492;&#12387;&#12383;&#23646;&#24615;&#20516;&#12434;&#35672;&#21029;&#12362;&#12424;&#12403;&#35686;&#21578;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#35500;&#26126;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#31777;&#21336;&#12394;&#35500;&#26126;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#21021;&#26399;&#12362;&#12424;&#12403;&#26368;&#23567;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12371;&#12398;&#12503;&#12540;&#12523;&#12398;&#26368;&#23567;&#25509;&#32154;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#20516;&#12399;&#12289;&#12503;&#12540;&#12523;&#12434;&#26368;&#21021;&#12395;&#20316;&#25104;&#12375;&#12383;&#12426;&#12289;GlassFish Server&#12434;&#36215;&#21205;&#12375;&#12383;&#12392;&#12365;&#12398;&#12289;&#12503;&#12540;&#12523;&#12395;&#21547;&#12414;&#12428;&#12427;&#25509;&#32154;&#12398;&#25968;&#12418;&#21028;&#23450;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;8&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26368;&#22823;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12371;&#12398;&#12503;&#12540;&#12523;&#12398;&#26368;&#22823;&#25509;&#32154;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;32&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;&#22793;&#26356;&#37327;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;&#12398;&#22793;&#26356;&#12496;&#12483;&#12481;&#12372;&#12392;&#12398;&#25509;&#32154;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12503;&#12540;&#12523;&#12398;&#12469;&#12452;&#12474;&#12434;&#26368;&#22823;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;&#12362;&#12424;&#12403;&#26368;&#23567;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;&#12395;&#23550;&#12375;&#12390;&#12473;&#12465;&#12540;&#12523;&#12539;&#12450;&#12483;&#12503;&#12362;&#12424;&#12403;&#12473;&#12465;&#12540;&#12523;&#12539;&#12480;&#12454;&#12531;&#12377;&#12427;&#12392;&#12289;&#12496;&#12483;&#12481;&#12391;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;&#12364;&#22793;&#26356;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#20516;&#12399;&#12496;&#12483;&#12481;&#12391;&#12398;&#25509;&#32154;&#12398;&#25968;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#20516;&#12434;&#36942;&#22823;&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#25509;&#32154;&#12398;&#20316;&#25104;&#12392;&#20877;&#21033;&#29992;&#12364;&#36933;&#12428;&#12289;&#36942;&#23567;&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#21177;&#29575;&#12364;&#33853;&#12385;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;2&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12450;&#12452;&#12489;&#12523;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#25509;&#32154;&#12364;&#12503;&#12540;&#12523;&#20869;&#12395;&#12450;&#12452;&#12489;&#12523;&#29366;&#24907;&#12391;&#27531;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#26368;&#22823;&#26178;&#38291;&#12434;&#31186;&#21336;&#20301;&#12391;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#26178;&#38291;&#12434;&#36942;&#12366;&#12427;&#12392;&#12289;&#25509;&#32154;&#12399;&#12503;&#12540;&#12523;&#12363;&#12425;&#38500;&#21435;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;300&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26368;&#22823;&#24453;&#27231;&#26178;&#38291;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#25509;&#32154;&#12434;&#12522;&#12463;&#12456;&#12473;&#12488;&#12375;&#12390;&#12356;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#25509;&#32154;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12434;&#21463;&#12369;&#21462;&#12427;&#12414;&#12391;&#12395;&#24453;&#27231;&#12377;&#12427;&#26368;&#38263;&#26178;&#38291;&#12434;&#12511;&#12522;&#31186;&#21336;&#20301;&#12391;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;60,000&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#38750;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#25509;&#32154;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#38750;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#25509;&#32154;&#12434;&#36820;&#12377;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#20998;&#38626;&#12301;&#12398;&#12300;&#12524;&#12505;&#12523;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#12371;&#12398;&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#20998;&#38626;&#12524;&#12505;&#12523;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#25351;&#23450;&#12375;&#12394;&#12356;&#22580;&#21512;&#12289;&#25509;&#32154;&#12395;&#12399;JDBC&#12489;&#12521;&#12452;&#12496;&#12395;&#12424;&#12387;&#12390;&#35373;&#23450;&#12373;&#12428;&#12427;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#20998;&#38626;&#12524;&#12505;&#12523;&#12364;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p>&#12300;&#20998;&#38626;&#12524;&#12505;&#12523;&#12301;&#12398;&#12300;&#20445;&#35388;&#20184;&#12365;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#12503;&#12540;&#12523;&#12363;&#12425;&#21462;&#24471;&#12373;&#12428;&#12427;&#12377;&#12409;&#12390;&#12398;&#25509;&#32154;&#12364;&#21516;&#12376;&#20998;&#38626;&#12524;&#12505;&#12523;&#12395;&#12394;&#12427;&#12371;&#12392;&#12434;&#20445;&#35388;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12383;&#12392;&#12360;&#12400;&#12289;&#26368;&#24460;&#12398;&#20351;&#29992;&#26178;&#12395;<code>con.setTransactionIsolation</code>&#12434;&#20351;&#29992;&#12375;&#12390;&#25509;&#32154;&#12398;&#20998;&#38626;&#12524;&#12505;&#12523;&#12434;&#12503;&#12525;&#12464;&#12521;&#12512;&#30340;&#12395;&#22793;&#26356;&#12375;&#12383;&#22580;&#21512;&#12289;&#12371;&#12398;&#12513;&#12459;&#12491;&#12474;&#12512;&#12395;&#12424;&#12387;&#12390;&#12473;&#12486;&#12540;&#12479;&#12473;&#12364;&#25351;&#23450;&#12398;&#20998;&#38626;&#12524;&#12505;&#12523;&#12395;&#25147;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#35373;&#23450;&#12364;&#36969;&#29992;&#12373;&#12428;&#12427;&#12398;&#12399;&#12289;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#20998;&#38626;&#12524;&#12505;&#12523;&#12364;&#25351;&#23450;&#12373;&#12428;&#12383;&#22580;&#21512;&#12398;&#12415;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#12289;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#24517;&#38920;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20855;&#20307;&#20363;&#12399;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#21517;(URL)&#12289;&#12518;&#12540;&#12470;&#12540;&#21517;&#12289;&#12497;&#12473;&#12527;&#12540;&#12489;&#12394;&#12393;&#12391;&#12377;&#12290;&#36890;&#24120;&#12289;&#34920;&#12395;&#12399;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12505;&#12531;&#12480;&#12540;&#12364;&#20351;&#29992;&#12377;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;&#20351;&#29992;&#21487;&#33021;&#12394;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#35443;&#32048;&#12399;&#12289;<a href="ref-jdbc-properties.html">JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12395;&#22266;&#26377;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12434;&#25351;&#23450;&#12375;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#20316;&#25104;&#12364;&#32066;&#20102;&#12375;&#12383;&#12392;&#12365;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#34920;&#12363;&#12425;&#38500;&#21435;&#12373;&#12428;&#12414;&#12377;&#12290;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12434;&#12377;&#12368;&#12395;&#35373;&#23450;&#12379;&#12378;&#12289;&#24460;&#12391;&#35373;&#23450;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#34920;&#20869;&#12395;&#27531;&#12377;&#22580;&#21512;&#12399;&#12289;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#31354;&#12398;&#25324;&#24359;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<pre>
()
</pre>
<ul>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#34920;&#31034;&#12373;&#12428;&#12427;&#31354;&#30333;&#34892;&#12391;&#12289;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#21517;&#12434;&#20837;&#21147;&#12375;&#12289;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;&#12289;&#12381;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#32232;&#38598;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;&#12289;&#21066;&#38500;&#12377;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12398;&#24038;&#20596;&#12395;&#12354;&#12427;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21066;&#38500;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#32066;&#20102;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref16" name="sthref16"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12450;&#12463;&#12475;&#12473;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">JDBC&#12489;&#12521;&#12452;&#12496;&#12434;&#32113;&#21512;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcenew.html">JDBC&#12522;&#12477;&#12540;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesedit.html">JDBC&#12522;&#12477;&#12540;&#12473;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcetargets.html">JDBC&#12522;&#12477;&#12540;&#12473;&#12398;&#12479;&#12540;&#12466;&#12483;&#12488;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesdelete.html">JDBC&#12522;&#12477;&#12540;&#12473;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#19968;&#33324;&#35373;&#23450;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#35443;&#32048;&#23646;&#24615;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#35373;&#23450;&#12434;&#26908;&#35388;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
