<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jdbcresourcesedit" name="task-jdbcresourcesedit"></a><a id="GHJDB00033" name="GHJDB00033"></a></p>

<h4><a id="sthref8" name="sthref8"></a>JDBC&#12522;&#12477;&#12540;&#12473;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#12522;&#12477;&#12540;&#12473;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12522;&#12477;&#12540;&#12473;&#12301;&#12494;&#12540;&#12489;&#12391;&#12289;&#12300;JDBC&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;JDBC&#12301;&#12494;&#12540;&#12489;&#12391;&#12289;&#12300;JDBC&#12522;&#12477;&#12540;&#12473;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;JDBC&#12522;&#12477;&#12540;&#12473;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;JDBC&#12522;&#12477;&#12540;&#12473;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#32232;&#38598;&#12377;&#12427;&#12522;&#12477;&#12540;&#12473;&#12398;&#21517;&#21069;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;JDBC&#12522;&#12477;&#12540;&#12473;&#12434;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12503;&#12540;&#12523;&#21517;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#12371;&#12398;JDBC&#12522;&#12477;&#12540;&#12473;&#12395;&#38306;&#36899;&#20184;&#12369;&#12427;&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#35500;&#26126;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12391;&#12289;&#12371;&#12398;JDBC&#12522;&#12477;&#12540;&#12473;&#12398;&#31777;&#21336;&#12394;&#35500;&#26126;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#12289;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>GlassFish Server&#12399;JDBC&#12522;&#12477;&#12540;&#12473;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#23450;&#32681;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
<ul>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#34920;&#31034;&#12373;&#12428;&#12427;&#31354;&#30333;&#34892;&#12391;&#12289;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#21517;&#12434;&#20837;&#21147;&#12375;&#12289;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;&#12289;&#12381;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#32232;&#38598;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;&#12289;&#21066;&#38500;&#12377;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12398;&#24038;&#20596;&#12395;&#12354;&#12427;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21066;&#38500;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#12479;&#12540;&#12466;&#12483;&#12488;&#12301;&#12479;&#12502;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#12300;&#12522;&#12477;&#12540;&#12473;&#12539;&#12479;&#12540;&#12466;&#12483;&#12488;&#12301;&#12434;&#31649;&#29702;&#12375;&#12414;&#12377;&#12290;</p>
<ol type="a">
<li>
<p>&#24517;&#35201;&#12395;&#24540;&#12376;&#12390;&#12289;&#12522;&#12477;&#12540;&#12473;&#12398;&#23450;&#32681;&#28168;&#12479;&#12540;&#12466;&#12483;&#12488;&#12434;&#26377;&#21177;&#12414;&#12383;&#12399;&#28961;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12479;&#12540;&#12466;&#12483;&#12488;&#12398;&#31649;&#29702;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#12289;&#12522;&#12477;&#12540;&#12473;&#12398;&#12479;&#12540;&#12466;&#12483;&#12488;&#12434;&#36861;&#21152;&#12414;&#12383;&#12399;&#38500;&#21435;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<p>&#35443;&#32048;&#12399;&#12289;<a href="task-jdbcresourcetargets.html">JDBC&#12522;&#12477;&#12540;&#12473;&#12398;&#12479;&#12540;&#12466;&#12483;&#12488;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
<li>
<p>&#12300;&#19968;&#33324;&#12301;&#12479;&#12502;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#12289;&#12300;JDBC&#12522;&#12477;&#12540;&#12473;&#12434;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12395;&#25147;&#12426;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref9" name="sthref9"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12450;&#12463;&#12475;&#12473;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">JDBC&#12489;&#12521;&#12452;&#12496;&#12434;&#32113;&#21512;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcenew.html">JDBC&#12522;&#12477;&#12540;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcetargets.html">JDBC&#12522;&#12477;&#12540;&#12473;&#12398;&#12479;&#12540;&#12466;&#12483;&#12488;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesdelete.html">JDBC&#12522;&#12477;&#12540;&#12473;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#19968;&#33324;&#35373;&#23450;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#35443;&#32048;&#23646;&#24615;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#35373;&#23450;&#12434;&#26908;&#35388;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
