<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-setdbaccess" name="task-setdbaccess"></a><a id="GHJDB00030" name="GHJDB00030"></a></p>

<h4><a id="sthref2" name="sthref2"></a>&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12450;&#12463;&#12475;&#12473;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12487;&#12540;&#12479;&#12434;&#26684;&#32013;&#12289;&#32232;&#25104;&#12289;&#21462;&#24471;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#12411;&#12392;&#12435;&#12393;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12522;&#12524;&#12540;&#12471;&#12519;&#12490;&#12523;&#12539;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>GlassFish Server&#12395;&#12399;Java DB&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#12467;&#12500;&#12540;&#12364;&#21547;&#12414;&#12428;&#12289;&#12371;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#27231;&#33021;&#12364;&#20107;&#21069;&#12395;&#27083;&#25104;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
<ol>
<li>
<p>&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#35069;&#21697;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12427;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#12522;&#12473;&#12488;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRLN"><i>Oracle GlassFish Server&#12522;&#12522;&#12540;&#12473;&#12539;&#12494;&#12540;&#12488;</i></a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
<li>
<p>&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;JDBC API&#12434;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427;&#12489;&#12521;&#12452;&#12496;(JDBC&#12489;&#12521;&#12452;&#12496;)&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#25509;&#32154;&#12398;&#20316;&#25104;&#12395;&#20351;&#29992;&#12377;&#12427;&#12489;&#12521;&#12452;&#12496;&#12364;&#12289;&#12487;&#12540;&#12479;&#12477;&#12540;&#12473;&#12434;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12377;&#12409;&#12390;&#12398;&#12469;&#12540;&#12496;&#12540;&#12395;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
<li>
<p>&#12489;&#12521;&#12452;&#12496;&#12398;JAR&#12501;&#12449;&#12452;&#12523;&#12395;&#12399;&#12289;&#12489;&#12513;&#12452;&#12531;&#12398;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12363;&#12425;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12414;&#12377;&#12290;</p>
<p><a href="task-integratejdbcdriver.html">JDBC&#12489;&#12521;&#12452;&#12496;&#12434;&#32113;&#21512;&#12377;&#12427;&#12395;&#12399;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
<li>
<p>&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#36890;&#24120;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12364;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12434;&#20316;&#25104;&#12375;&#31227;&#34892;&#12377;&#12427;&#12383;&#12417;&#12398;&#12473;&#12463;&#12522;&#12503;&#12488;&#12434;&#37197;&#20449;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;</p>
<p><a href="task-jdbcconnectionpoolnew.html">JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
<li>
<p>&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#31034;&#12377;JDBC&#12522;&#12477;&#12540;&#12473;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;</p>
<p><a href="task-jdbcresourcenew.html">JDBC&#12522;&#12477;&#12540;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
</ol>
<a id="sthref3" name="sthref3"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-integratejdbcdriver.html">JDBC&#12489;&#12521;&#12452;&#12496;&#12434;&#32113;&#21512;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcenew.html">JDBC&#12522;&#12477;&#12540;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesedit.html">JDBC&#12522;&#12477;&#12540;&#12473;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesdelete.html">JDBC&#12522;&#12477;&#12540;&#12473;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#19968;&#33324;&#35373;&#23450;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#35443;&#32048;&#23646;&#24615;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#35373;&#23450;&#12434;&#26908;&#35388;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">JDBC&#25509;&#32154;&#12503;&#12540;&#12523;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
