<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsservice-additional-props" name="ref-jmsservice-additional-props"></a></p>

<h4><a id="sthref77" name="sthref77"></a><a id="sthref78" name="sthref78"></a>JMS &#49436;&#48708;&#49828; &#44288;&#47144; &#49549;&#49457;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>JMS &#49436;&#48708;&#49828;&#50640; &#45824;&#54644; &#45796;&#51020;&#44284; &#44057;&#51008; Oracle Message Queue &#48652;&#47196;&#52964; &#44396;&#49457; &#49549;&#49457;&#51012; &#49324;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt><code>instance-name</code></dt>
<dd>
<p>&#51204;&#52404; Message Queue &#48652;&#47196;&#52964; &#51064;&#49828;&#53556;&#49828; &#51060;&#47492;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>imqbroker</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>instance-name-suffix</code></dt>
<dd>
<p>&#51204;&#52404; Message Queue &#48652;&#47196;&#52964; &#51064;&#49828;&#53556;&#49828; &#51060;&#47492;&#50640; &#52628;&#44032;&#54624; &#51217;&#48120;&#50612;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;. &#51217;&#48120;&#50612;&#45716; &#48145;&#51460; &#47928;&#51088;(<code>_</code>)&#47196; &#51064;&#49828;&#53556;&#49828; &#51060;&#47492;&#44284; &#44396;&#48516;&#46121;&#45768;&#45796;. &#50696;&#47484; &#46308;&#50612; &#51064;&#49828;&#53556;&#49828; &#51060;&#47492;&#51060; <code>imqbroker</code>&#51064; &#44221;&#50864; &#51217;&#48120;&#50612; <code>xyz</code>&#47484; &#52628;&#44032;&#54616;&#47732; &#51064;&#49828;&#53556;&#49828; &#51060;&#47492;&#51060; <code>imqbroker_xyz</code>&#47196; &#48320;&#44221;&#46121;&#45768;&#45796;.</p>
</dd>
<dt><code>append-version</code></dt>
<dd>
<p><code>true</code>&#51064; &#44221;&#50864; &#51204;&#52404; Message Queue &#48652;&#47196;&#52964; &#51064;&#49828;&#53556;&#49828; &#51060;&#47492;&#50640; &#48145;&#51460; &#47928;&#51088;(<code>_</code>)&#50752; &#51452; &#48260;&#51204; &#48143; &#48512; &#48260;&#51204; &#48264;&#54840;&#44032; &#52628;&#44032;&#46121;&#45768;&#45796;. &#50696;&#47484; &#46308;&#50612; &#51064;&#49828;&#53556;&#49828; &#51060;&#47492;&#51060; <code>imqbroker</code>&#51064; &#44221;&#50864; &#48260;&#51204; &#48264;&#54840;&#47484; &#52628;&#44032;&#54616;&#47732; &#51064;&#49828;&#53556;&#49828; &#51060;&#47492;&#51060; <code>imqbroker_8_0</code>&#51004;&#47196; &#48320;&#44221;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>false</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>user-name</code></dt>
<dd>
<p>JMS &#51217;&#49549;&#51012; &#49373;&#49457;&#54616;&#44592; &#50948;&#54620; &#49324;&#50857;&#51088; &#51060;&#47492;&#51077;&#45768;&#45796;. &#48652;&#47196;&#52964;&#50640;&#49436; <code>guest</code>/<code>guest</code>&#51032; &#44592;&#48376; &#49324;&#50857;&#51088; &#51060;&#47492;/&#48708;&#48128;&#48264;&#54840;&#47484; &#49324;&#50857;&#54624; &#49688; &#50630;&#45716; &#44221;&#50864;&#50640;&#47564; &#54596;&#50836;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>guest</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>password</code></dt>
<dd>
<p>JMS &#51217;&#49549;&#51012; &#49373;&#49457;&#54616;&#44592; &#50948;&#54620; &#48708;&#48128;&#48264;&#54840;&#51077;&#45768;&#45796;. &#48652;&#47196;&#52964;&#50640;&#49436; <code>guest</code>/<code>guest</code>&#51032; &#44592;&#48376; &#49324;&#50857;&#51088; &#51060;&#47492;/&#48708;&#48128;&#48264;&#54840;&#47484; &#49324;&#50857;&#54624; &#49688; &#50630;&#45716; &#44221;&#50864;&#50640;&#47564; &#54596;&#50836;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>guest</code>&#51077;&#45768;&#45796;.</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
