<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsphysicaldestedit" name="ref-jmsphysicaldestedit"></a><a id="GHJMS00018" name="GHJMS00018"></a></p>

<h4><a id="sthref96" name="sthref96"></a><a id="sthref97" name="sthref97"></a>JMS &#47932;&#47532;&#51201; &#45824;&#49345; &#54200;&#51665;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[JMS &#47932;&#47532;&#51201; &#45824;&#49345; &#54200;&#51665;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; JMS &#47932;&#47532;&#51201; &#45824;&#49345;&#50640; &#45824;&#54620; &#49444;&#51221;&#51012; &#49688;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>[JMS &#47932;&#47532;&#51201; &#45824;&#49345; &#54200;&#51665;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#51060;&#47492;</dt>
<dd>
<p>&#47932;&#47532;&#51201; &#45824;&#49345;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51069;&#44592; &#51204;&#50857; &#54596;&#46300;&#51077;&#45768;&#45796;. JMS &#45824;&#49345; &#47532;&#49548;&#49828; &#46608;&#45716; &#47932;&#47532;&#51201; &#45824;&#49345;&#51012; &#49373;&#49457;&#54624; &#46412;&#47564; &#51060;&#47492;&#51012; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#50976;&#54805;</dt>
<dd>
<p>&#47932;&#47532;&#51201; &#45824;&#49345;&#51032; &#50976;&#54805;&#51077;&#45768;&#45796;. &#51069;&#44592; &#51204;&#50857; &#54596;&#46300;&#51077;&#45768;&#45796;. JMS &#45824;&#49345; &#47532;&#49548;&#49828; &#46608;&#45716; &#47932;&#47532;&#51201; &#45824;&#49345;&#51012; &#49373;&#49457;&#54624; &#46412;&#47564; &#50976;&#54805;&#51012; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#49324;&#50857;&#46104;&#51648; &#50506;&#51008; &#52572;&#45824; &#47700;&#49884;&#51648; &#49688;</dt>
<dd>
<p>&#45824;&#49345;&#50640; &#54728;&#50857;&#46108; &#49324;&#50857;&#46104;&#51648; &#50506;&#51008; &#52572;&#45824; &#47700;&#49884;&#51648; &#49688;&#51077;&#45768;&#45796;. &#44050;&#51060; &ndash;1&#51060;&#47732; &#49324;&#50857;&#46104;&#51648; &#50506;&#51008; &#47700;&#49884;&#51648; &#49688;&#50640; &#51228;&#54620;&#51060; &#50630;&#51020;&#51012; &#45208;&#53440;&#45253;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; -1&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#45824; &#47700;&#49884;&#51648; &#53356;&#44592;</dt>
<dd>
<p>&#45800;&#51068; &#47700;&#49884;&#51648;&#51032; &#52572;&#45824; &#53356;&#44592;(&#48148;&#51060;&#53944;)&#51077;&#45768;&#45796;. &#44050;&#51060; &ndash;1&#51060;&#47732; &#47700;&#49884;&#51648; &#53356;&#44592;&#50640; &#51228;&#54620;&#51060; &#50630;&#51020;&#51012; &#45208;&#53440;&#45253;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; -1&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#45824; &#51204;&#52404; &#47700;&#47784;&#47532;</dt>
<dd>
<p>&#49324;&#50857;&#46104;&#51648; &#50506;&#51008; &#47700;&#49884;&#51648;&#51032; &#52572;&#45824; &#51204;&#52404; &#47700;&#47784;&#47532;(&#48148;&#51060;&#53944;)&#51077;&#45768;&#45796;. &#44050;&#51060; &ndash;1&#51060;&#47732; &#49324;&#50857;&#46104;&#51648; &#50506;&#51008; &#47700;&#49884;&#51648;&#51032; &#47700;&#47784;&#47532; &#53356;&#44592;&#50640; &#51228;&#54620;&#51060; &#50630;&#51020;&#51012; &#45208;&#53440;&#45253;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; -1&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51076;&#44228;&#44050; &#51228;&#54620; &#46041;&#51089;</dt>
<dd>
<p>&#47700;&#47784;&#47532; &#51228;&#54620; &#51076;&#44228;&#44050;&#50640; &#46020;&#45804;&#54664;&#51012; &#46412; &#48652;&#47196;&#52964;&#44032; &#49688;&#54665;&#54624; &#46041;&#51089;&#51077;&#45768;&#45796;. &#49324;&#50857; &#44032;&#45733;&#54620; &#49440;&#53469; &#54637;&#47785;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#52572;&#49888; &#47700;&#49884;&#51648; &#44144;&#48512;</dt>
<dd>
<p>&#44032;&#51109; &#52572;&#49888; &#47700;&#49884;&#51648;&#47484; &#44144;&#48512;&#54616;&#44256; &#47700;&#49884;&#51648;&#44032; &#51648;&#49549;&#51201;&#51068; &#44221;&#50864;&#50640;&#47564; &#49373;&#49457; &#53364;&#46972;&#51060;&#50616;&#53944;&#50640; &#50696;&#50808; &#49324;&#54637;&#51012; &#50508;&#47549;&#45768;&#45796;. &#51060; &#44050;&#51008; &#44592;&#48376;&#44050;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49373;&#49457;&#51088; &#45712;&#47532;&#44172;</dt>
<dd>
<p>&#47700;&#49884;&#51648; &#49373;&#49457;&#51088;&#44032; &#47700;&#49884;&#51648;&#47484; &#48372;&#45236;&#45716; &#49549;&#46020;&#47484; &#45734;&#52645;&#45768;&#45796;.</p>
</dd>
<dt>&#44032;&#51109; &#50724;&#47000;&#46108; &#47700;&#49884;&#51648; &#49325;&#51228;</dt>
<dd>
<p>&#44032;&#51109; &#50724;&#47000;&#46108; &#47700;&#49884;&#51648;&#47484; &#49325;&#51228;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#50864;&#49440;&#49692;&#50948;&#44032; &#44032;&#51109; &#45230;&#51008; &#47700;&#49884;&#51648; &#49325;&#51228;</dt>
<dd>
<p>&#50864;&#49440;&#49692;&#50948;&#44032; &#44032;&#51109; &#45230;&#51008; &#47700;&#49884;&#51648;&#47484; &#49325;&#51228;&#54633;&#45768;&#45796;.</p>
</dd>
</dl>
<p>&#44050;&#51060; [&#44032;&#51109; &#50724;&#47000;&#46108; &#47700;&#49884;&#51648; &#49325;&#51228;] &#46608;&#45716; [&#50864;&#49440;&#49692;&#50948;&#44032; &#44032;&#51109; &#45230;&#51008; &#47700;&#49884;&#51648; &#49325;&#51228;]&#51060;&#44256; [&#49324;&#50857; &#48520;&#45733; &#47700;&#49884;&#51648; &#45824;&#44592;&#50676; &#49324;&#50857;]&#51012; true&#47196; &#49444;&#51221;&#54616;&#47732; &#48276;&#50948; &#48150; &#47700;&#49884;&#51648;&#44032; &#49324;&#50857; &#48520;&#45733; &#47700;&#49884;&#51648; &#45824;&#44592;&#50676;&#47196; &#51060;&#46041;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#45824; &#49373;&#49457;&#51088; &#49688;</dt>
<dd>
<p>&#51060; &#47932;&#47532;&#51201; &#45824;&#49345;&#44284; &#50672;&#44288;&#46112; &#49688; &#51080;&#45716; &#52572;&#45824; &#47700;&#49884;&#51648; &#49373;&#49457;&#51088; &#49688;&#51077;&#45768;&#45796;. &#51060; &#51228;&#54620;&#50640; &#46020;&#45804;&#54616;&#47732; &#49352; &#49373;&#49457;&#51088;&#47484; &#49373;&#49457;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#44050;&#51060; &ndash;1&#51060;&#47732; &#49373;&#49457;&#51088; &#49688;&#50640; &#51228;&#54620;&#51060; &#50630;&#51020;&#51012; &#45208;&#53440;&#45253;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 100&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#48176;&#52824; &#51204;&#45804; &#52572;&#45824; &#47700;&#49884;&#51648; &#49688;</dt>
<dd>
<p>&#45800;&#51068; &#48176;&#52824;&#47196; &#49324;&#50857;&#51088;&#50640;&#44172; &#51204;&#45804;&#54624; &#49688; &#51080;&#45716; &#52572;&#45824; &#47700;&#49884;&#51648; &#49688;&#51077;&#45768;&#45796;. &#44050;&#51060; -1&#51060;&#47732; &#47700;&#49884;&#51648; &#49688;&#50640; &#51228;&#54620;&#51060; &#50630;&#51020;&#51012; &#45208;&#53440;&#45253;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 1000&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49324;&#50857; &#48520;&#45733; &#47700;&#49884;&#51648; &#45824;&#44592;&#50676; &#49324;&#50857;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; &#49324;&#50857; &#48520;&#45733; &#47700;&#49884;&#51648;&#44032; &#49324;&#50857; &#48520;&#45733; &#47700;&#49884;&#51648; &#45824;&#44592;&#50676;&#50640; &#48176;&#52824;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51060; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#49324;&#50857; &#48520;&#45733; &#47700;&#49884;&#51648;&#44032; &#49325;&#51228;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>XML &#49828;&#53412;&#47560; &#44160;&#51613;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; Message Queue &#53364;&#46972;&#51060;&#50616;&#53944; &#47088;&#53440;&#51076;&#51008; XML &#47700;&#49884;&#51648;&#47484; &#48652;&#47196;&#52964;&#47196; &#48372;&#45236;&#44592; &#51204;&#50640; &#51648;&#51221;&#46108; XML &#49828;&#53412;&#47560; &#51221;&#51032;&#50640; &#45824;&#54644;(&#46608;&#45716; XSD&#44032; &#51648;&#51221;&#46104;&#51648; &#50506;&#51008; &#44221;&#50864; DTD&#50640; &#45824;&#54644;) XML &#47700;&#49884;&#51648;&#51032; &#44160;&#51613;&#51012; &#49884;&#46020;&#54633;&#45768;&#45796;. &#51648;&#51221;&#46108; &#49828;&#53412;&#47560;&#47484; &#52286;&#51012; &#49688; &#50630;&#44144;&#45208; &#47700;&#49884;&#51648;&#47484; &#44160;&#51613;&#54624; &#49688; &#50630;&#51004;&#47732; &#47700;&#49884;&#51648;&#44032; &#51204;&#49569;&#46104;&#51648; &#50506;&#44256; &#50696;&#50808; &#49324;&#54637;&#51060; &#48156;&#49373;&#54633;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>XML &#49828;&#53412;&#47560; URI &#47785;&#47197;</dt>
<dd>
<p>XSD(XML &#49828;&#53412;&#47560; &#51221;&#51032;) URI &#47928;&#51088;&#50676;&#51032; &#44277;&#48177;&#51004;&#47196; &#44396;&#48516;&#46108; &#47785;&#47197;&#51077;&#45768;&#45796;. XML &#49828;&#53412;&#47560; &#44160;&#51613;&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; URI&#45716; XML &#49828;&#53412;&#47560; &#44160;&#51613;&#50640; &#49324;&#50857;&#54624; &#54616;&#45208; &#51060;&#49345;&#51032; XSD &#50948;&#52824;&#47484; &#44032;&#47532;&#53429;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref98" name="sthref98"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-jmsservice.html">JMS &#49436;&#48708;&#49828;&#47484; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestnew.html">JMS &#47932;&#47532;&#51201; &#45824;&#49345;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestedit.html">JMS &#47932;&#47532;&#51201; &#45824;&#49345;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestdelete.html">JMS &#47932;&#47532;&#51201; &#45824;&#49345;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jmsflushmessages.html">JMS &#47932;&#47532;&#51201; &#45824;&#49345;&#50640;&#49436; &#47700;&#49884;&#51648;&#47484; &#51228;&#44144;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldeststats.html">JMS &#47932;&#47532;&#51201; &#45824;&#49345;&#50640; &#45824;&#54620; &#53685;&#44228;&#47484; &#48372;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref99" name="sthref99"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00038"><code>create-jmsdest</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00175"><code>list-jmsdest</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00090"><code>delete-jmsdest</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00136"><code>flush-jmsdest</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00144"><code>jms-ping</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
