<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsconnectionedit" name="ref-jmsconnectionedit"></a></p>

<h4><a id="sthref53" name="sthref53"></a><a id="sthref54" name="sthref54"></a>JMS &#51217;&#49549; &#54057;&#53664;&#47532; &#54200;&#51665;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[JMS &#51217;&#49549; &#54057;&#53664;&#47532; &#54200;&#51665;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; JMS &#51217;&#49549; &#54057;&#53664;&#47532;&#50640; &#45824;&#54620; &#49444;&#51221;&#51012; &#49688;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>[JMS &#51217;&#49549; &#54057;&#53664;&#47532; &#54200;&#51665;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44592;&#48376;&#44050; &#47196;&#46300;</dt>
<dd>
<p>&#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#45716; &#49444;&#51221;&#51012; &#44592;&#48376;&#44050;&#51004;&#47196; &#48373;&#50896;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#49444;&#51221;&#51008; &#48320;&#44221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>JNDI &#51060;&#47492;</dt>
<dd>
<p>&#47532;&#49548;&#49828;&#47484; &#49885;&#48324;&#54616;&#45716; &#44256;&#50976;&#54620; JNDI &#51060;&#47492;&#51077;&#45768;&#45796;. &#44288;&#47168;&#49345; &#51060; &#51060;&#47492;&#51008; &#47532;&#49548;&#49828; &#50976;&#54805; &#51648;&#49884;&#51088; &#48143; &#49836;&#47000;&#49884;&#47196; &#49884;&#51089;&#46121;&#45768;&#45796;(&#50696;: concurrent/, jdbc/ &#46608;&#45716; jms/). [JNDI &#51060;&#47492;]&#51008; &#51069;&#44592; &#51204;&#50857; &#54596;&#46300;&#51077;&#45768;&#45796;. &#49352; &#47532;&#49548;&#49828;&#47484; &#49373;&#49457;&#54624; &#46412;&#47564; JNDI &#51060;&#47492;&#51012; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;</p>
</dd>
<dt>&#45436;&#47532;&#51201; JNDI &#51060;&#47492;</dt>
<dd>
<p>&#47532;&#49548;&#49828;&#51032; &#45436;&#47532;&#51201; JNDI &#51060;&#47492;&#51077;&#45768;&#45796;. &#47532;&#49548;&#49828;&#50640; &#50529;&#49464;&#49828;&#54624; &#46412; &#49324;&#50857;&#54616;&#45716; Java EE &#54364;&#51456; &#51060;&#47492;&#51077;&#45768;&#45796;. [&#45436;&#47532;&#51201; JNDI &#51060;&#47492;]&#51008; &#51069;&#44592; &#51204;&#50857; &#54596;&#46300;&#51077;&#45768;&#45796;. &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="../../../common/en/help/ref-logicaljndinames.html">&#45436;&#47532;&#51201; JNDI &#51060;&#47492;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</dd>
<dt>&#47532;&#49548;&#49828; &#50976;&#54805;</dt>
<dd>
<p>&#51217;&#49549; &#54057;&#53664;&#47532;&#51032; &#50976;&#54805;&#51077;&#45768;&#45796;. &#47532;&#49548;&#49828; &#50976;&#54805;&#51008; &#51069;&#44592; &#51204;&#50857; &#54596;&#46300;&#51077;&#45768;&#45796;. &#49352; JMS &#51217;&#49549; &#54057;&#53664;&#47532;&#47484; &#49373;&#49457;&#54624; &#46412;&#47564; &#47532;&#49548;&#49828; &#50976;&#54805;&#51012; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#49444;&#47749;</dt>
<dd>
<p>&#51217;&#49549; &#54057;&#53664;&#47532;&#50640; &#45824;&#54620; &#49444;&#47749;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49345;&#53468;</dt>
<dd>
<p>&#47088;&#53440;&#51076;&#50640; &#47532;&#49548;&#49828;&#47484; &#49324;&#50857;&#54624; &#49688; &#51080;&#45716;&#51648; &#50668;&#48512;&#51077;&#45768;&#45796;.</p>
<p>&#44592;&#48376; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#51064; <code>server</code>&#44032; &#46020;&#47700;&#51064;&#50640; &#51316;&#51116;&#54616;&#45716; &#44221;&#50864;&#50640;&#47564; &#47532;&#49548;&#49828;&#51032; &#47088;&#53440;&#51076; &#44032;&#50857;&#49457;&#51012; &#49324;&#50857; &#46608;&#45716; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#47088;&#53440;&#51076; &#44032;&#50857;&#49457;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;.</p>
<p>&#46020;&#47700;&#51064;&#50640; &#53364;&#47084;&#49828;&#53552; &#46608;&#45716; &#46021;&#47549;&#54805; &#51064;&#49828;&#53556;&#49828;&#44032; &#49373;&#49457;&#46108; &#44221;&#50864; [&#45824;&#49345;] &#53485;&#51012; &#49324;&#50857;&#54616;&#50668; &#54644;&#45817; &#45824;&#49345;&#50640;&#49436; &#47532;&#49548;&#49828;&#51032; &#47088;&#53440;&#51076; &#44032;&#50857;&#49457;&#51012; &#51228;&#50612;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#52488;&#44592; &#48143; &#52572;&#49548; &#54400; &#53356;&#44592;</dt>
<dd>
<p>&#51217;&#49549; &#54057;&#53664;&#47532;&#50640; &#45824;&#54620; &#54400;&#51032; &#52572;&#49548; &#51217;&#49549; &#49688;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 8&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#45824; &#54400; &#53356;&#44592;</dt>
<dd>
<p>&#54400;&#51032; &#52572;&#45824; &#51217;&#49549; &#49688;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 32&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#54400; &#53356;&#44592; &#51312;&#51221; &#44060;&#49688;</dt>
<dd>
<p>&#54400; &#50976;&#55092; &#49884;&#44036; &#52488;&#44284;&#44032; &#47564;&#47308;&#46112; &#46412; &#51228;&#44144;&#54624; &#51217;&#49549; &#49688;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 2&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#50976;&#55092; &#49884;&#44036; &#52488;&#44284;</dt>
<dd>
<p>&#54400;&#50640;&#49436; &#51217;&#49549;&#51060; &#50976;&#55092; &#49345;&#53468;&#47196; &#51080;&#51012; &#49688; &#51080;&#45716; &#52572;&#45824; &#49884;&#44036;(&#52488;)&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 300&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#45824; &#45824;&#44592; &#49884;&#44036;</dt>
<dd>
<p>&#51217;&#49549;&#51012; &#50836;&#52397;&#54620; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#51217;&#49549; &#49884;&#44036; &#52488;&#44284;&#44620;&#51648; &#45824;&#44592;&#54616;&#45716; &#49884;&#44036;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 60000&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49892;&#54056; &#49884;</dt>
<dd>
<p>[&#47784;&#46304; &#51217;&#49549; &#45803;&#44592;] &#52404;&#53356; &#48149;&#49828;&#44032; &#49440;&#53469;&#46108; &#44221;&#50864; &#51217;&#49549;&#51060; &#54616;&#45208;&#46972;&#46020; &#49892;&#54056;&#54616;&#47732; GlassFish Server&#50640;&#49436; &#54400;&#51032; &#47784;&#46304; &#51217;&#49549;&#51012; &#45803;&#51008; &#54980; &#51116;&#49444;&#51221;&#54633;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#53944;&#47004;&#51117;&#49496; &#51648;&#50896;</dt>
<dd>
<p>&#45796;&#51020;&#44284; &#44057;&#51008; &#44050;&#51012; &#49324;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>XATransaction</dt>
<dd>
<p>&#53944;&#47004;&#51117;&#49496; &#48276;&#50948; &#45236;&#50640;&#49436; &#46168; &#51060;&#49345;&#51032; &#47532;&#49548;&#49828; &#49324;&#50857;&#44284; &#44288;&#47144;&#46108; &#53944;&#47004;&#51117;&#49496;&#50640; &#47532;&#49548;&#49828;&#47484; &#49324;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#44050;&#51008; JMS &#51217;&#49549; &#54057;&#53664;&#47532;&#51032; &#44592;&#48376;&#44050;&#51077;&#45768;&#45796;.</p>
<p>&#50696;&#47484; &#46308;&#50612; &#53944;&#47004;&#51117;&#49496;&#50640;&#45716; &#51060; &#47532;&#49548;&#49828;&#50752; JDBC &#47532;&#49548;&#49828;, &#52964;&#45349;&#53552; &#47532;&#49548;&#49828; &#46608;&#45716; &#45796;&#47480; JMS &#51217;&#49549; &#54057;&#53664;&#47532; &#47532;&#49548;&#49828;&#44032; &#54252;&#54632;&#46112; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#44050;&#51008; &#44032;&#51109; &#45458;&#51008; &#50976;&#50672;&#49457;&#51012; &#51228;&#44277;&#54633;&#45768;&#45796;. XATransaction&#51004;&#47196; &#44396;&#49457;&#46108; &#47532;&#49548;&#49828;&#45716; 2&#45800;&#44228; &#52964;&#48139; &#51089;&#50629;&#50640; &#52280;&#50668;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>LocalTransaction</dt>
<dd>
<p>&#47532;&#49548;&#49828;&#45716; &#53944;&#47004;&#51117;&#49496; &#48276;&#50948; &#45236;&#50640;&#49436; &#54616;&#45208;&#51032; &#47532;&#49548;&#49828;&#47564; &#44288;&#50668;&#54616;&#45716; &#53944;&#47004;&#51117;&#49496;&#50640; &#49324;&#50857;&#46104;&#44144;&#45208; &#46168; &#51060;&#49345;&#51032; XA &#47532;&#49548;&#49828;&#44032; &#44288;&#50668;&#54616;&#45716; &#48516;&#49328;&#46108; &#53944;&#47004;&#51117;&#49496;&#50640;&#49436; &#47560;&#51648;&#47561; &#50640;&#51060;&#51204;&#53944;&#47196; &#49324;&#50857;&#46112; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#51060; &#44050;&#51008; &#55016;&#50476; &#45458;&#51008; &#49457;&#45733;&#51012; &#51228;&#44277;&#54633;&#45768;&#45796;. LocalTransaction&#51004;&#47196; &#44396;&#49457;&#46108; &#47532;&#49548;&#49828;&#45716; 2&#45800;&#44228; &#52964;&#48139; &#51089;&#50629;&#50640; &#49324;&#50857;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>NoTransaction</dt>
<dd>
<p>&#47532;&#49548;&#49828;&#45716; &#53944;&#47004;&#51117;&#49496;&#50640; &#52280;&#50668;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#51060; &#49444;&#51221;&#51008; JMS &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640;&#49436; &#51228;&#54620;&#51201;&#51004;&#47196; &#49324;&#50857;&#46121;&#45768;&#45796;.</p>
</dd>
</dl>
</dd>
<dt>&#51217;&#49549; &#44160;&#51613;</dt>
<dd>
<p>[&#54596;&#50836;] &#52404;&#53356; &#48149;&#49828;&#44032; &#49440;&#53469;&#46108; &#44221;&#50864; &#51217;&#49549;&#51012; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#51204;&#45804;&#54616;&#44592; &#51204;&#50640; &#47676;&#51200; &#44160;&#51613;&#54633;&#45768;&#45796;. &#47532;&#49548;&#49828;&#51032; &#44160;&#51613;&#51060; &#49892;&#54056;&#54616;&#47732; &#47532;&#49548;&#49828;&#44032; &#49325;&#51228;&#46104;&#44256;, &#49352; &#47532;&#49548;&#49828;&#44032; &#49373;&#49457;&#46108; &#54980; &#48152;&#54872;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#52628;&#44032; &#49549;&#49457;</dt>
<dd>
<p>&#51217;&#49549; &#54057;&#53664;&#47532;&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51077;&#45768;&#45796;.</p>
<p>&#49324;&#50857; &#44032;&#45733;&#54620; &#49549;&#49457;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="ref-jmsconnectionproperties.html">JMS &#51217;&#49549; &#54057;&#53664;&#47532; &#44288;&#47144; &#49549;&#49457;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</dd>
</dl>
<a id="sthref55" name="sthref55"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-jmsconnectionnew.html">JMS &#51217;&#49549; &#54057;&#53664;&#47532; &#47532;&#49548;&#49828;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jmsconnectionedit.html">JMS &#51217;&#49549; &#54057;&#53664;&#47532; &#47532;&#49548;&#49828;&#47484; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">JMS &#51217;&#49549; &#54057;&#53664;&#47532; &#47532;&#49548;&#49828;&#47484; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref56" name="sthref56"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00040"><code>create-jms-resource</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00177"><code>list-jms-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00092"><code>delete-jms-resource</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
