<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsconnectionproperties" name="ref-jmsconnectionproperties"></a><a id="GHJMS00005" name="GHJMS00005"></a></p>

<h4><a id="sthref57" name="sthref57"></a><a id="sthref58" name="sthref58"></a>JMS &#51217;&#49549; &#54057;&#53664;&#47532; &#44288;&#47144; &#49549;&#49457;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>JMS &#51217;&#49549; &#54057;&#53664;&#47532;&#50640; &#49324;&#50857;&#54624; &#49688; &#51080;&#45716; &#52628;&#44032; &#49549;&#49457;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt><code>ClientId</code></dt>
<dd>
<p>&#50689;&#44396; &#44032;&#51077;&#51088;&#44032; &#49324;&#50857;&#54624; &#51217;&#49549; &#54057;&#53664;&#47532;&#50640; &#45824;&#54620; &#53364;&#46972;&#51060;&#50616;&#53944; ID&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
</dd>
<dt><code>AddressList</code></dt>
<dd>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#53685;&#49888;&#54624; &#47700;&#49884;&#51648; &#48652;&#47196;&#52964; &#51064;&#49828;&#53556;&#49828;&#51032; &#51060;&#47492;(&#48143; &#49440;&#53469;&#51201;&#51004;&#47196; &#54252;&#53944; &#48264;&#54840;)&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. &#47785;&#47197;&#51032; &#44033; &#51452;&#49548;&#45716; &#51217;&#49549;&#50640; &#45824;&#54620; &#54840;&#49828;&#53944; &#51060;&#47492;(&#44536;&#47532;&#44256; &#49440;&#53469;&#51201;&#51004;&#47196; &#54840;&#49828;&#53944; &#54252;&#53944; &#48143; &#51217;&#49549; &#49436;&#48708;&#49828;)&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. &#50696;&#47484; &#46308;&#50612; &#44050;&#51008; <code>earth</code> &#46608;&#45716; <code>earth:7677</code>&#51068; &#49688; &#51080;&#49845;&#45768;&#45796;. &#47700;&#49884;&#51648; &#48652;&#47196;&#52964;&#44032; &#44592;&#48376;&#44050;(7676) &#51060;&#50808;&#51032; &#54252;&#53944;&#50640;&#49436; &#49892;&#54665; &#51473;&#51064; &#44221;&#50864; &#54252;&#53944; &#48264;&#54840;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;. &#49549;&#49457; &#49444;&#51221;&#51060; &#53364;&#47084;&#49828;&#53552;&#46108; &#54872;&#44221;&#50640;&#49436; &#50668;&#47084; &#54840;&#49828;&#53944; &#48143; &#54252;&#53944;&#47484; &#51648;&#51221;&#54616;&#45716; &#44221;&#50864;, <code>AddressListBehavior</code> &#49549;&#49457;&#51060; <code>RANDOM</code>&#51004;&#47196; &#49444;&#51221;&#46104;&#51648; &#50506;&#51008; &#54620; &#47785;&#47197;&#50640;&#49436; &#49324;&#50857; &#44032;&#45733;&#54620; &#52395;&#48264;&#51704; &#54840;&#49828;&#53944;&#44032; &#49324;&#50857;&#46121;&#45768;&#45796;.</p>
<p>&#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <i>Message Queue Developer's Guide for Java Clients</i>&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
<p>&#44592;&#48376;&#44050;&#51008; &#47196;&#52972; &#54840;&#49828;&#53944; &#48143; &#44592;&#48376; &#54252;&#53944; &#48264;&#54840;(7676)&#51077;&#45768;&#45796;. &#53364;&#46972;&#51060;&#50616;&#53944;&#45716; &#47196;&#52972; &#54840;&#49828;&#53944;&#51032; &#54252;&#53944; 7676&#50640;&#49436; &#48652;&#47196;&#52964;&#50640; &#51217;&#49549;&#51012; &#49884;&#46020;&#54633;&#45768;&#45796;.</p>
</dd>
<dt><code>UserName</code></dt>
<dd>
<p>&#51217;&#49549; &#54057;&#53664;&#47532;&#50640; &#45824;&#54620; &#49324;&#50857;&#51088; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; <code>guest</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>Password</code></dt>
<dd>
<p>&#51217;&#49549; &#54057;&#53664;&#47532;&#50640; &#45824;&#54620; &#48708;&#48128;&#48264;&#54840;&#51077;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; <code>guest</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>ReconnectEnabled</code></dt>
<dd>
<p><code>true</code>&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#51217;&#49549;&#51060; &#45130;&#44592;&#47732; &#53364;&#46972;&#51060;&#50616;&#53944; &#47088;&#53440;&#51076;&#50640;&#49436; &#47700;&#49884;&#51648; &#49436;&#48260;(&#46608;&#45716; <code>AddressList</code>&#51032; &#51452;&#49548; &#47785;&#47197;)&#47196;&#51032; &#51116;&#51217;&#49549;&#51012; &#49884;&#46020;&#54616;&#46020;&#47197; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; <code>true</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>ReconnectAttempts</code></dt>
<dd>
<p>&#53364;&#46972;&#51060;&#50616;&#53944; &#47088;&#53440;&#51076;&#50640;&#49436; &#47785;&#47197;&#50640; &#51080;&#45716; &#45796;&#51020; &#51452;&#49548;&#47484; &#49884;&#46020;&#54616;&#44592; &#51204;&#50640; <code>AddressList</code>&#51032; &#44033; &#51452;&#49548;&#50640; &#45824;&#54644; &#49884;&#46020;&#54624; &#51217;&#49549;(&#46608;&#45716; &#51116;&#51217;&#49549;) &#54943;&#49688;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;. -1 &#44050;&#51008; &#51116;&#51217;&#49549; &#49884;&#46020; &#54943;&#49688;&#50640; &#51228;&#54620;&#51060; &#50630;&#51020;&#51012; &#45208;&#53440;&#45253;&#45768;&#45796;. &#53364;&#46972;&#51060;&#50616;&#53944; &#47088;&#53440;&#51076;&#51008; &#49457;&#44277;&#54624; &#46412;&#44620;&#51648; &#52395;&#48264;&#51704; &#51452;&#49548;&#50640; &#51217;&#49549;&#51012; &#49884;&#46020;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; 3&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>ReconnectInterval</code></dt>
<dd>
<p>&#51116;&#51217;&#49549; &#49884;&#46020; &#44036;&#51032; &#44036;&#44201;(&#48128;&#47532;&#52488; &#45800;&#50948;)&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. <code>AddressList</code>&#51032; &#44033; &#51452;&#49548;&#50640; &#45824;&#54620; &#49884;&#46020;&#50752; &#47785;&#47197;&#51032; &#50672;&#49549;&#46108; &#51452;&#49548;&#50640; &#51060; &#44050;&#51060; &#51201;&#50857;&#46121;&#45768;&#45796;. &#44036;&#44201;&#51060; &#45320;&#47924; &#51687;&#51004;&#47732; &#48652;&#47196;&#52964;&#44032; &#48373;&#44396;&#54624; &#49884;&#44036;&#51060; &#50630;&#49845;&#45768;&#45796;. &#45320;&#47924; &#44600; &#44221;&#50864;&#50640;&#45716; &#51648;&#50672;&#51060; &#51648;&#45208;&#52824;&#44172; &#44600;&#44172; &#45712;&#44788;&#51656; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; 30000&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>AddressListBehavior</code></dt>
<dd>
<p>&#51217;&#49549; &#49884;&#46020;&#47484; <code>AddressList</code> &#49549;&#49457;&#51032; &#51452;&#49548; &#49692;&#49436;(<code>PRIORITY</code>)&#47196; &#49688;&#54665;&#54624;&#51648; &#51076;&#51032; &#49692;&#49436;(<code>RANDOM</code>)&#47196; &#49688;&#54665;&#54624;&#51648; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<p><code>RANDOM</code>&#51008; &#51116;&#51217;&#49549;&#54624; &#46412; <code>AddressList</code>&#50640;&#49436; &#51076;&#51032;&#51032; &#51452;&#49548;&#47484; &#49440;&#53469;&#54620;&#45796;&#45716; &#51032;&#48120;&#51077;&#45768;&#45796;. &#50668;&#47084; &#53364;&#46972;&#51060;&#50616;&#53944;&#44032; &#44057;&#51008; &#51217;&#49549; &#54057;&#53664;&#47532;&#47484; &#49324;&#50857;&#54616;&#50668; &#51217;&#49549;&#51012; &#49884;&#46020;&#54624; &#44032;&#45733;&#49457;&#51060; &#45458;&#51008; &#44221;&#50864;, &#51060; &#44050;&#51008; &#47784;&#46160;&#44032; &#44057;&#51008; &#51452;&#49548;&#50640; &#51217;&#49549;&#46104;&#45716; &#44163;&#51012; &#48169;&#51648;&#54633;&#45768;&#45796;.</p>
<p><code>PRIORITY</code>&#45716; &#51116;&#51217;&#49549;&#54624; &#46412; &#54637;&#49345; <code>AddressList</code>&#50640; &#51080;&#45716; &#52395;&#48264;&#51704; &#49436;&#48260; &#51452;&#49548;&#50640; &#51217;&#49549;&#54616;&#44256; &#52395;&#48264;&#51704; &#48652;&#47196;&#52964;&#47484; &#49324;&#50857;&#54624; &#49688; &#50630;&#45716; &#44221;&#50864;&#50640;&#47564; &#45796;&#47480; &#51452;&#49548;&#47484; &#49324;&#50857;&#54620;&#45796;&#45716; &#51032;&#48120;&#51077;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; <code>RANDOM</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>AddressListIterations</code></dt>
<dd>
<p>&#53364;&#46972;&#51060;&#50616;&#53944; &#47088;&#53440;&#51076;&#50640;&#49436; &#51217;&#49549;&#51012; &#49444;&#51221;(&#46608;&#45716; &#51116;&#49444;&#51221;)&#54616;&#44592; &#50948;&#54644; <code>AddressList</code>&#47484; &#48152;&#48373;&#54616;&#45716; &#54943;&#49688;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;. -1 &#44050;&#51008; &#54943;&#49688;&#50640; &#51228;&#54620;&#51060; &#50630;&#51020;&#51012; &#45208;&#53440;&#45253;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; 3&#51077;&#45768;&#45796;.</p>
</dd>
</dl>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
