<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsavailability" name="ref-jmsavailability"></a></p>

<h4><a id="sthref71" name="sthref71"></a><a id="sthref72" name="sthref72"></a>JMS &#44032;&#50857;&#49457;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[JMS &#44032;&#50857;&#49457;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; GlassFish Server &#53364;&#47084;&#49828;&#53552;&#47484; &#51228;&#44277;&#54616;&#46020;&#47197; Message Queue &#51473;&#44060;&#51088; &#53364;&#47084;&#49828;&#53552;&#47484; &#44396;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>

<hr>
<p><b>&#51452;&#51032;:</b></p>
[JMS &#44032;&#50857;&#49457;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#44592;&#51316; &#53364;&#47084;&#49828;&#53552;&#47484; &#51116;&#44396;&#49457;&#54616;&#48064;&#47196; <i>Oracle GlassFish Server High Availability Administration Guide</i>&#51032; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSHAG00158">To Migrate Between Types of Embedded or Local Conventional Broker Clusters</a>&#50640; &#49444;&#47749;&#46108; &#44163;&#44284; &#44057;&#51060;, &#45796;&#47480; &#50976;&#54805;&#51032; &#51473;&#44060;&#51088; &#53364;&#47084;&#49828;&#53552;&#47196; &#47560;&#51060;&#44536;&#47112;&#51060;&#49496;&#54616;&#45716; &#53945;&#49688;&#54620; &#51208;&#52264;&#47484; &#46384;&#46972;&#50556; &#54633;&#45768;&#45796;. &#51060; &#53945;&#49688; &#51208;&#52264;&#47484; &#49688;&#54665;&#54616;&#45716; &#45936; &#49892;&#54056;&#54624; &#44221;&#50864; &#44592;&#51316; &#53364;&#47084;&#49828;&#53552;&#50640;&#49436; &#49688;&#54665;&#46104;&#45716; JMS &#51089;&#50629;&#50640; &#46384;&#46972; &#45936;&#51060;&#53552;&#44032; &#49552;&#49892; &#46608;&#45716; &#49552;&#49345;&#46104;&#44256; &#49900;&#51648;&#50612; &#49444;&#52824;&#47484; &#49324;&#50857;&#54616;&#51648; &#47803;&#54616;&#44172; &#46112; &#49688; &#51080;&#49845;&#45768;&#45796;.
<hr>

<p>[JMS &#44032;&#50857;&#49457;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>

<hr>
<p><b>&#51452;:</b></p>
&#51060; &#44396;&#49457;&#51012; &#49324;&#50857;&#54616;&#45716; &#51064;&#49828;&#53556;&#49828;&#44032; &#49892;&#54665; &#51473;&#51064; &#44221;&#50864; [JMS &#44032;&#50857;&#49457;] &#54168;&#51060;&#51648;&#50640; &#44221;&#44256;&#44032; &#54364;&#49884;&#46104;&#44256;, &#47784;&#46304; &#50741;&#49496;&#51060; &#51069;&#44592; &#51204;&#50857;&#51004;&#47196; &#54364;&#49884;&#46104;&#47728;, [&#51200;&#51109;] &#45800;&#52628;&#47484; &#49324;&#50857;&#54616;&#51648; &#47803;&#54616;&#44172; &#46121;&#45768;&#45796;.
<hr>

<dl>
<dt>JMS &#49436;&#48708;&#49828; &#50976;&#54805;</dt>
<dd>
<p>&#51473;&#44060;&#51088; &#53364;&#47084;&#49828;&#53552;&#50640; &#49324;&#50857;&#54624; &#51473;&#44060;&#51088;(GlassFish Server&#51032; JMS &#54840;&#49828;&#53944;)&#51032; &#50976;&#54805;&#51077;&#45768;&#45796;. &#49440;&#53469;&#54620; &#50976;&#54805;&#50640; &#46384;&#46972; &#49324;&#50857; &#44032;&#45733;&#54620; &#51473;&#44060;&#51088; &#53364;&#47084;&#49828;&#53552;&#51032; &#50976;&#54805;&#51060; &#44208;&#51221;&#46121;&#45768;&#45796;. &#51473;&#44060;&#51088; &#50976;&#54805;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>Embedded</dt>
<dd>
<p>&#51473;&#44060;&#51088; &#44396;&#49457; &#48143; &#49688;&#47749; &#51452;&#44592;&#45716; GlassFish Server&#50640;&#49436; &#44288;&#47532;&#54633;&#45768;&#45796;. Each GlassFish &#53364;&#47084;&#49828;&#53552;&#46108; &#51064;&#49828;&#53556;&#49828;&#45716; &#51064;&#49828;&#53556;&#49828;&#50752; &#46041;&#51068;&#54620; JVM&#50640;&#49436; &#49892;&#54665;&#46104;&#45716; &#51473;&#44060;&#51088;&#50640;&#49436; &#51228;&#44277;&#54633;&#45768;&#45796;.</p>
<p>[JMS &#49436;&#48708;&#49828; &#50976;&#54805;] &#50741;&#49496;&#51060; [Embedded]&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#44592;&#48376; Message Queue &#51473;&#44060;&#51088; &#53364;&#47084;&#49828;&#53552;&#47564; &#51648;&#50896;&#46121;&#45768;&#45796;. &#44592;&#48376; &#53364;&#47084;&#49828;&#53552;&#47484; &#44396;&#49457;&#54616;&#45716; &#50741;&#49496;&#51060; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#47196;&#52972;</dt>
<dd>
<p>&#51473;&#44060;&#51088; &#44396;&#49457; &#48143; &#49688;&#47749; &#51452;&#44592;&#45716; GlassFish Server&#50640;&#49436; &#44288;&#47532;&#54633;&#45768;&#45796;. Each GlassFish &#53364;&#47084;&#49828;&#53552;&#46108; &#51064;&#49828;&#53556;&#49828;&#45716; &#51064;&#49828;&#53556;&#49828;&#50752; &#46041;&#51068;&#54620; &#54840;&#49828;&#53944;&#50640; &#51080;&#45716; &#48324;&#46020;&#51032; JVM&#50640;&#49436; &#49892;&#54665;&#46104;&#45716; &#51473;&#44060;&#51088;&#50640;&#49436; &#51228;&#44277;&#54633;&#45768;&#45796;.</p>
<p>[JMS &#49436;&#48708;&#49828; &#50976;&#54805;] &#50741;&#49496;&#51060; [&#47196;&#52972;]&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#44592;&#48376; &#48143; Enhanced(HA) Message Queue &#51473;&#44060;&#51088; &#53364;&#47084;&#49828;&#53552;&#44032; &#47784;&#46160; &#51648;&#50896;&#46121;&#45768;&#45796;. &#53364;&#47084;&#49828;&#53552; &#50976;&#54805;&#51012; &#49440;&#53469;&#54616;&#44256; &#53364;&#47084;&#49828;&#53552;&#47484; &#44396;&#49457;&#54616;&#45716; &#50741;&#49496;&#51060; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#50896;&#44201;</dt>
<dd>
<p>&#51473;&#44060;&#51088;/&#51473;&#44060;&#51088; &#53364;&#47084;&#49828;&#53552; &#44396;&#49457; &#48143; &#49688;&#47749; &#51452;&#44592;&#45716; Message Queue &#44288;&#47532; &#53812;&#51012; &#49324;&#50857;&#54616;&#50668; &#44288;&#47532;&#46121;&#45768;&#45796;.</p>
<p>[JMS &#49436;&#48708;&#49828; &#50976;&#54805;] &#50741;&#49496;&#51060; [&#50896;&#44201;]&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#45796;&#47480; &#50741;&#49496;&#51060; &#54364;&#49884;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
</dl>
</dd>
<dt>JMS &#53364;&#47084;&#49828;&#53552; &#50976;&#54805;</dt>
<dd>
<p>GlassFish Server &#53364;&#47084;&#49828;&#53552;&#50640; &#49324;&#50857;&#54624; Message Queue &#51473;&#44060;&#51088; &#53364;&#47084;&#49828;&#53552;&#51032; &#50976;&#54805;&#51077;&#45768;&#45796;.</p>
<p>[JMS &#53364;&#47084;&#49828;&#53552; &#50976;&#54805;] &#50741;&#49496;&#51060; [&#44592;&#48376;]&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#45796;&#51020; &#50741;&#49496;&#51060; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>
<dl>
<dt>JMS &#44396;&#49457; &#51200;&#51109;&#49548; &#50976;&#54805;</dt>
<dd>
<p>&#44592;&#48376; &#53364;&#47084;&#49828;&#53552; &#44396;&#49457; &#45936;&#51060;&#53552;&#50640; &#49324;&#50857;&#54624; &#45936;&#51060;&#53552; &#51200;&#51109;&#49548;&#51032; &#50976;&#54805;&#51077;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51060; [&#47560;&#49828;&#53552; &#51473;&#44060;&#51088;]&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#53364;&#47084;&#49828;&#53552; &#45236;&#51032; &#54620; &#51473;&#44060;&#51088;&#44032; &#47560;&#49828;&#53552; &#51473;&#44060;&#51088;&#47196; &#51648;&#51221;&#46104;&#44256; &#47560;&#49828;&#53552; &#51473;&#44060;&#51088;&#50640; &#51032;&#54644; &#44396;&#49457; &#45936;&#51060;&#53552;&#44032; &#51200;&#51109;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51060; [&#44277;&#50976; DB]&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#47784;&#46304; &#51473;&#44060;&#51088;&#50640;&#49436; &#50529;&#49464;&#49828;&#54624; &#49688; &#51080;&#45716; JDBC &#45936;&#51060;&#53552; &#51200;&#51109;&#49548;&#50640; &#44396;&#49457; &#45936;&#51060;&#53552;&#44032; &#51200;&#51109;&#46121;&#45768;&#45796;. &#51060; &#44221;&#50864; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#44288;&#47144; &#50741;&#49496;&#51060; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>JMS &#47700;&#49884;&#51648; &#51200;&#51109;&#49548; &#50976;&#54805;</dt>
<dd>
<p>&#44033; &#51473;&#44060;&#51088;&#51032; &#47700;&#49884;&#51648; &#45936;&#51060;&#53552;&#47484; &#51200;&#51109;&#54616;&#45716; &#45936; &#49324;&#50857;&#46104;&#45716; &#45936;&#51060;&#53552; &#51200;&#51109;&#49548;&#51032; &#50976;&#54805;&#51077;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51060; [&#54028;&#51068;]&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#44033; &#51473;&#44060;&#51088;&#51032; &#47700;&#49884;&#51648; &#45936;&#51060;&#53552;&#44032; &#54028;&#51068; &#44592;&#48152; &#45936;&#51060;&#53552; &#51200;&#51109;&#49548;&#50640; &#51200;&#51109;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51060; [JDBC]&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#44033; &#51473;&#44060;&#51088;&#51032; &#47700;&#49884;&#51648; &#45936;&#51060;&#53552;&#44032; JDBC &#45936;&#51060;&#53552; &#51200;&#51109;&#49548;&#50640; &#51200;&#51109;&#46121;&#45768;&#45796;.</p>
</dd>
</dl>
<p>[JMS &#53364;&#47084;&#49828;&#53552; &#50976;&#54805;] &#50741;&#49496;&#51060; [Enhanced(HA)]&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#44288;&#47144; &#50741;&#49496;&#51060; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#44277;&#44553;&#50629;&#52404;</dt>
<dt>&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; URL</dt>
<dt>&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#49324;&#50857;&#51088;</dt>
<dd>
<p>&#45796;&#51020; &#44221;&#50864;&#50640; &#49324;&#50857;&#54624; JDBC &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#51032; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#44277;&#44553;&#50629;&#52404;, &#50529;&#49464;&#49828; URL &#48143; JDBC &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#51032; &#49324;&#50857;&#51088;&#51077;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#44592;&#48376; &#53364;&#47084;&#49828;&#53552;&#51032; &#44396;&#49457; &#51200;&#51109;&#49548; &#50976;&#54805;&#51060; &#44277;&#50976; DB&#47196; &#49444;&#51221;&#46108; &#44221;&#50864;</p>
</li>
<li>
<p>&#44592;&#48376; &#53364;&#47084;&#49828;&#53552;&#51032; &#47700;&#49884;&#51648; &#51200;&#51109;&#49548; &#50976;&#54805;&#51060; JDBC&#47196; &#49444;&#51221;&#46108; &#44221;&#50864;</p>
</li>
<li>
<p>&#53364;&#47084;&#49828;&#53552; &#50976;&#54805;&#51060; Enhanced(HA)&#47196; &#49444;&#51221;&#46108; &#44221;&#50864;</p>
</li>
</ul>
<p>&#51648;&#50896;&#46104;&#45716; &#44277;&#44553;&#50629;&#52404; &#48143; &#44033; &#44277;&#44553;&#50629;&#52404;&#51032; &#50529;&#49464;&#49828; URL &#54805;&#49885;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <i>Oracle GlassFish Server Message Queue Administration Guide</i>&#51032; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GMADG00244">JDBC-Based Persistence</a>&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</dd>
<dt>&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#51064;&#51613;</dt>
<dt>&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#48708;&#48128;&#48264;&#54840;</dt>
<dt>&#48708;&#48128;&#48264;&#54840; &#48324;&#52845;</dt>
<dd>
<p>&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#49324;&#50857;&#51088;&#50640; &#51648;&#51221;&#46108; JDBC &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#49324;&#50857;&#51088;&#51032; &#48708;&#48128;&#48264;&#54840; &#51221;&#48372;&#51077;&#45768;&#45796;.</p>
<p>[&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#51064;&#51613;]&#51060; [&#48708;&#48128;&#48264;&#54840;]&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; [&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#48708;&#48128;&#48264;&#54840;] &#50741;&#49496;&#51060; &#54364;&#49884;&#46121;&#45768;&#45796;. [&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#51064;&#51613;]&#51060; [&#48708;&#48128;&#48264;&#54840; &#48324;&#52845;]&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; [&#48708;&#48128;&#48264;&#54840; &#48324;&#52845;] &#50741;&#49496;&#51060; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#52628;&#44032; &#49549;&#49457;</dt>
<dd>
<p>JMS &#44032;&#50857;&#49457;&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51077;&#45768;&#45796;.</p>
<p>GlassFish Server&#50640;&#49436;&#45716; &#52628;&#44032; JMS &#44032;&#50857;&#49457; &#49549;&#49457;&#51012; &#48120;&#47532; &#51221;&#51032;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref73" name="sthref73"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<p><a href="task-jmsservice.html">JMS &#49436;&#48708;&#49828;&#47484; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
