<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsservice" name="ref-jmsservice"></a></p>

<h4><a id="sthref74" name="sthref74"></a>Java Message Service</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[JMS &#49436;&#48708;&#49828;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#44592;&#48376; JMS &#51228;&#44277;&#51088;, GlassFish Server Message Queue&#50640;&#49436; &#49324;&#50857;&#54624; &#49444;&#51221;&#51012; &#44396;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>JMS &#49436;&#48708;&#49828; &#44396;&#49457;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDVG00020"><i>Oracle GlassFish Server Application Development Guide</i>&#51032; 19&#51109;, <i>Using the Java Message Service</i></a>&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
<p>[JMS &#49436;&#48708;&#49828;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44592;&#48376;&#44050; &#47196;&#46300;</dt>
<dd>
<p>&#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#45716; &#49444;&#51221;&#51012; &#44592;&#48376;&#44050;&#51004;&#47196; &#48373;&#50896;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#49444;&#51221;&#51008; &#48320;&#44221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#54609;</dt>
<dd>
<p>JMS &#49436;&#48708;&#49828;&#44032; &#44592;&#48376; JMS &#54840;&#49828;&#53944;&#50640;&#49436; &#49892;&#54665; &#51473;&#51064;&#51648; &#54869;&#51064;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. JMS &#49436;&#48708;&#49828;&#44032; &#49892;&#54665; &#51473;&#51060;&#47732; &#54609;&#51060; &#49457;&#44277;&#54664;&#45796;&#45716; &#47700;&#49884;&#51648;&#44032; &#48372;&#44256;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#44396;&#49457; &#51060;&#47492;</dt>
<dd>
<p>&#51060; &#54168;&#51060;&#51648;&#51032; &#49444;&#51221;&#51060; &#51201;&#50857;&#46104;&#45716; &#44396;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#50976;&#54805;</dt>
<dd>
<p>JMS &#49436;&#48708;&#49828;&#50640; &#45824;&#54620; &#50529;&#49464;&#49828; &#50976;&#54805;&#51077;&#45768;&#45796;. &#49324;&#50857; &#44032;&#45733;&#54620; &#49440;&#53469; &#54637;&#47785;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>EMBEDDED</dt>
<dd>
<p>&#47196;&#52972; &#54840;&#49828;&#53944;&#51032; JMS &#49436;&#48708;&#49828;&#50640; &#50529;&#49464;&#49828;&#54633;&#45768;&#45796;. JMS &#49436;&#48708;&#49828;&#45716; GlassFish Server&#50752; &#46041;&#51068;&#54620; JVM &#49884;&#49828;&#53596;&#50640;&#49436; &#49884;&#51089;&#46121;&#45768;&#45796;. &#52488;&#44592;&#54868; &#51648;&#50672;&#51008; GlassFish Server&#44032; &#49884;&#51089;&#46112; &#46412;&#44032; &#50500;&#45772; JMS &#49436;&#48708;&#49828;&#50640; &#52376;&#51020;&#50640; &#50529;&#49464;&#49828;&#54624; &#46412; &#44592;&#48376; &#54252;&#54632;&#46108; &#48652;&#47196;&#52964;&#47484; &#49884;&#51089;&#54633;&#45768;&#45796;. JMS &#49436;&#48708;&#49828;&#51032; &#44592;&#48376; &#50976;&#54805;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>LOCAL</dt>
<dd>
<p>&#47196;&#52972; &#54840;&#49828;&#53944;&#51032; JMS &#49436;&#48708;&#49828;&#50640; &#50529;&#49464;&#49828;&#54633;&#45768;&#45796;. JMS &#51228;&#44277;&#51088;&#45716; GlassFish Server&#50752; &#54632;&#44760; &#49884;&#51089;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>REMOTE</dt>
<dd>
<p>&#45796;&#47480; &#49884;&#49828;&#53596;&#51032; JMS &#49436;&#48708;&#49828;&#50640; &#50529;&#49464;&#49828;&#54633;&#45768;&#45796;. REMOTE&#47484; &#49440;&#53469;&#54616;&#47732; &#45796;&#51020;&#50640; &#49436;&#48260;&#44032; &#49884;&#51089;&#46112; &#46412; JMS &#49436;&#48708;&#49828;&#44032; GlassFish Server&#50640;&#49436; &#49884;&#51089;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;. &#45824;&#49888; JMS &#49436;&#48708;&#49828;&#45716; Message Queue&#50640; &#51032;&#54644; &#49884;&#51089; &#48143; &#44288;&#47532;&#46104;&#48064;&#47196; Message Queue &#48652;&#47196;&#52964;&#47484; &#48324;&#46020;&#47196; &#49884;&#51089;&#54644;&#50556; &#54633;&#45768;&#45796;. &#48652;&#47196;&#52964; &#49884;&#51089;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GMADG00227"><i>Oracle GlassFish Server Message Queue Administration Guide</i>&#51032; <i>Starting Brokers</i></a>&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;. &#51060; &#44050;&#51012; &#49440;&#53469;&#54616;&#44256; &#50896;&#44201; &#54840;&#49828;&#53944;&#47484; &#49324;&#50857; &#51473;&#51064; &#44221;&#50864;&#50640;&#45716; <a href="task-jmshostedit.html">JMS &#54840;&#49828;&#53944;&#47484; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a>&#51032; &#51648;&#52840;&#50640; &#46384;&#46972; &#50896;&#44201; &#54840;&#49828;&#53944;&#51032; &#51060;&#47492;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
</dd>
</dl>
</dd>
<dt>&#49884;&#51089; &#49884;&#44036; &#52488;&#44284;</dt>
<dd>
<p>GlassFish Server&#44032; &#49884;&#51089;&#51012; &#51473;&#51648;&#54616;&#44592; &#51204;&#50640; JMS &#49436;&#48708;&#49828;&#44032; &#49884;&#51089;&#46104;&#44592;&#47484; &#44592;&#45796;&#47532;&#45716; &#49884;&#44036;(&#52488;)&#51077;&#45768;&#45796;. &#45712;&#47532;&#44144;&#45208; &#48512;&#54616;&#44032; &#47566;&#51008; &#49884;&#49828;&#53596;&#50640;&#49436;&#45716; &#44050;&#51012; &#44592;&#48376;&#44050;&#48372;&#45796; &#53356;&#44172; &#45720;&#47532;&#49901;&#49884;&#50724;. &#44592;&#48376;&#44050;&#51008; 60&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49884;&#51089; &#51064;&#49688;</dt>
<dd>
<p>JMS &#49436;&#48708;&#49828; &#49884;&#51089;&#51012; &#49324;&#50857;&#51088; &#51221;&#51032;&#54616;&#45716; &#51064;&#49688;&#51077;&#45768;&#45796;. as-install-parent<code>/mq/bin/imqbrokerd</code> &#47749;&#47161;&#51012; &#53685;&#54644; &#49324;&#50857; &#44032;&#45733;&#54620; &#47784;&#46304; &#51064;&#49688;&#47484; &#49324;&#50857;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#45796;&#49884; &#51217;&#49549;</dt>
<dd>
<p>[&#51116;&#51217;&#49549; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#44032; &#49440;&#53469;&#46108; &#44221;&#50864; JMS &#49436;&#48708;&#49828;&#45716; &#51217;&#49549;&#51060; &#45130;&#50612;&#51276;&#51012; &#46412; &#47700;&#49884;&#51648; &#49436;&#48260;(&#46608;&#45716; AddressList&#51032; &#51452;&#49548; &#47785;&#47197;)&#50640; &#51116;&#51217;&#49549;&#51012; &#49884;&#46020;&#54633;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#45796;&#49884; &#51217;&#49549; &#44036;&#44201;</dt>
<dd>
<p>&#51116;&#51217;&#49549; &#49884;&#46020; &#44036;&#44201;(&#52488;)&#51077;&#45768;&#45796;. AddressList&#51032; &#44033; &#51452;&#49548;&#50640; &#45824;&#54620; &#49884;&#46020;&#50752; &#47785;&#47197;&#51032; &#50672;&#49549;&#46108; &#51452;&#49548;&#50640; &#51060; &#44036;&#44201;&#51060; &#51201;&#50857;&#46121;&#45768;&#45796;. &#51060; &#49884;&#44036; &#44036;&#44201;&#51060; &#45320;&#47924; &#51687;&#51012; &#44221;&#50864; &#48652;&#47196;&#52964;&#50640;&#44172; &#48373;&#44396;&#54624; &#49884;&#44036;&#51060; &#50630;&#49845;&#45768;&#45796;. &#45320;&#47924; &#44600; &#44221;&#50864;&#50640;&#45716; &#51648;&#50672;&#51060; &#51648;&#45208;&#52824;&#44172; &#44600;&#44172; &#45712;&#44788;&#51656; &#49688; &#51080;&#49845;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 5&#52488;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51116;&#51217;&#49549; &#49884;&#46020;</dt>
<dd>
<p>&#53364;&#46972;&#51060;&#50616;&#53944; &#47088;&#53440;&#51076;&#50640;&#49436; &#47785;&#47197;&#50640; &#51080;&#45716; &#45796;&#51020; &#51452;&#49548;&#47484; &#49884;&#46020;&#54616;&#44592; &#51204;&#50640; AddressList&#51032; &#44033; &#51452;&#49548;&#50640; &#45824;&#54644; &#49884;&#46020;&#54624; &#51217;&#49549;(&#46608;&#45716; &#51116;&#51217;&#49549;) &#54943;&#49688;&#51077;&#45768;&#45796;. -1 &#44050;&#51008; &#51116;&#51217;&#49549; &#49884;&#46020; &#54943;&#49688;&#50640; &#51228;&#54620;&#51060; &#50630;&#51020;&#51012; &#45208;&#53440;&#45253;&#45768;&#45796;. &#53364;&#46972;&#51060;&#50616;&#53944; &#47088;&#53440;&#51076;&#51008; &#49457;&#44277;&#54624; &#46412;&#44620;&#51648; &#52395;&#48264;&#51704; &#51452;&#49548;&#50640; &#51217;&#49549;&#51012; &#49884;&#46020;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 3&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#44592;&#48376; JMS &#54840;&#49828;&#53944;</dt>
<dd>
<p>&#44592;&#48376; JMS &#54840;&#49828;&#53944;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>default_JMS_host</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#47560;&#49828;&#53552; &#51473;&#44060;&#51088;</dt>
<dd>
<p>Message Queue &#51473;&#44060;&#51088; &#53364;&#47084;&#49828;&#53552;&#50640;&#49436; &#50672;&#44288;&#46108; Message Queue &#51473;&#44060;&#51088;&#47484; &#47560;&#49828;&#53552; &#51473;&#44060;&#51088;&#47196; &#49324;&#50857;&#54616;&#45716; GlassFish Server &#53364;&#47084;&#49828;&#53552;&#46108; &#51064;&#49828;&#53556;&#49828;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. GlassFish Server&#50640;&#49436; &#51088;&#46041;&#51004;&#47196; &#47560;&#49828;&#53552; &#51473;&#44060;&#51088;&#47484; &#51648;&#51221;&#54616;&#46020;&#47197; &#54616;&#47140;&#47732; &#51060; &#54596;&#46300;&#47484; &#48708;&#50892; &#46177;&#45768;&#45796;.</p>
<p>&#51060; &#44050;&#51012; &#48320;&#44221;&#54616;&#47732; &#51060; &#44396;&#49457;&#51012; &#49324;&#50857;&#54616;&#45716; GlassFish Server &#53364;&#47084;&#49828;&#53552;&#47484; &#51116;&#49884;&#51089;&#54644;&#50556; &#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#51452;&#49548; &#47785;&#47197; &#46041;&#51089;</dt>
<dd>
<p>&#51217;&#49549; &#49884;&#46020; &#49692;&#49436;&#51077;&#45768;&#45796;. &#49324;&#50857; &#44032;&#45733;&#54620; &#49440;&#53469; &#54637;&#47785;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt><code>random</code></dt>
<dd>
<p>AddressList&#50640;&#49436; &#51452;&#49548;&#47484; &#51076;&#51032;&#47196; &#49440;&#53469;&#54633;&#45768;&#45796;. &#46041;&#51068;&#54620; &#51217;&#49549; &#54057;&#53664;&#47532;&#47484; &#49324;&#50857;&#54616;&#50668; &#51217;&#49549;&#51012; &#49884;&#46020;&#54616;&#45716; &#53364;&#46972;&#51060;&#50616;&#53944;&#44032; &#47566;&#51012; &#44221;&#50864; <code>random</code>&#51012; &#51648;&#51221;&#54616;&#50668; &#53364;&#46972;&#51060;&#50616;&#53944;&#44032; &#47784;&#46160; &#44057;&#51008; &#51452;&#49548;&#50640; &#51217;&#49549;&#46104;&#51648; &#47803;&#54616;&#46020;&#47197; &#54633;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#44050;&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>priority</code></dt>
<dd>
<p>&#51116;&#51217;&#49549;&#54624; &#46412;&#50640;&#45716; &#54637;&#49345; AddressList&#50640; &#51080;&#45716; &#52395;&#48264;&#51704; &#49436;&#48260; &#51452;&#49548;&#50640; &#51217;&#49549;&#54616;&#44256; &#52395;&#48264;&#51704; &#48652;&#47196;&#52964;&#47484; &#49324;&#50857;&#54624; &#49688; &#50630;&#45716; &#44221;&#50864;&#50640;&#47564; &#45796;&#47480; &#51452;&#49548;&#47484; &#49324;&#50857;&#54633;&#45768;&#45796;.</p>
</dd>
</dl>
</dd>
<dt>&#51452;&#49548; &#47785;&#47197; &#48152;&#48373;</dt>
<dd>
<p>JMS &#49436;&#48708;&#49828;&#50640;&#49436; &#51217;&#49549;&#51012; &#49444;&#51221;(&#46608;&#45716; &#51116;&#49444;&#51221;)&#54616;&#44592; &#50948;&#54644; AddressList&#47484; &#48152;&#48373;&#54616;&#45716; &#54943;&#49688;&#51077;&#45768;&#45796;. -1 &#44050;&#51008; &#54943;&#49688;&#50640; &#51228;&#54620;&#51060; &#50630;&#51020;&#51012; &#45208;&#53440;&#45253;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 3&#51077;&#45768;&#45796;.</p>
</dd>
<dt>MQ &#52404;&#44228; &#48143; MQ &#49436;&#48708;&#49828;</dt>
<dd>
<p>&#44592;&#48376;&#44050;&#51060; &#50500;&#45772; &#52404;&#44228; &#46608;&#45716; &#49436;&#48708;&#49828;&#47484; &#49324;&#50857;&#54624; &#44221;&#50864;&#51032; Message Queue &#51452;&#49548; &#52404;&#44228; &#51060;&#47492; &#48143; Message Queue &#51217;&#49549; &#49436;&#48708;&#49828; &#51060;&#47492;&#51077;&#45768;&#45796;. &#44396;&#47928; &#51221;&#48372;&#45716; <a href="ref-mqschemeservice.html">MQ &#52404;&#44228; &#48143; MQ &#49436;&#48708;&#49828; &#51452;&#49548; &#44396;&#47928;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</dd>
<dt>&#52628;&#44032; &#49549;&#49457;</dt>
<dd>
<p>JMS &#49436;&#48708;&#49828;&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51077;&#45768;&#45796;.</p>
<p>&#49324;&#50857; &#44032;&#45733;&#54620; &#49549;&#49457;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="ref-jmsservice-additional-props.html">JMS &#49436;&#48708;&#49828; &#44288;&#47144; &#49549;&#49457;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</dd>
</dl>
<a id="sthref75" name="sthref75"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-jmsservice.html">JMS &#49436;&#48708;&#49828;&#47484; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jmshostnew.html">JMS &#54840;&#49828;&#53944;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jmshostedit.html">JMS &#54840;&#49828;&#53944;&#47484; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jmshostdelete.html">JMS &#54840;&#49828;&#53944;&#47484; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref76" name="sthref76"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00144"><code>jms-ping</code>(1)</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
