<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsservice" name="task-jmsservice"></a></p>

<h4><a id="sthref20" name="sthref20"></a>JMS &#49436;&#48708;&#49828;&#47484; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[JMS &#49436;&#48708;&#49828;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#47784;&#46304; JMS &#51217;&#49549;&#50640;&#49436; &#49324;&#50857;&#54624; &#49444;&#51221;&#51012; &#44396;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>JMS &#49436;&#48708;&#49828; &#44396;&#49457;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDVG00020"><i>Oracle GlassFish Server Application Development Guide</i>&#51032; 19&#51109;, <i>Using the Java Message Service</i></a>&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
<ol>
<li>
<p>&#53456;&#49353; &#53944;&#47532;&#50640;&#49436; [&#44396;&#49457;] &#45432;&#46300;&#47484; &#54869;&#51109;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#44396;&#49457;&#54624; &#51064;&#49828;&#53556;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#53945;&#51221; &#51064;&#49828;&#53556;&#49828;&#47484; &#44396;&#49457;&#54616;&#47140;&#47732; &#54644;&#45817; &#51064;&#49828;&#53556;&#49828;&#51032; &#44396;&#49457; &#45432;&#46300;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;. &#50696;&#47484; &#46308;&#50612;, &#44592;&#48376; &#51064;&#49828;&#53556;&#49828; <code>server</code>&#51032; &#44221;&#50864; <code>server-config</code> &#45432;&#46300;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p><code>default-config</code> &#48373;&#49324;&#48376;&#51012; &#49324;&#50857;&#54616;&#45716; &#54693;&#54980; &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54644; &#44592;&#48376; &#49444;&#51221;&#51012; &#44396;&#49457;&#54616;&#47140;&#47732; <code>default-config</code> &#45432;&#46300;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</li>
</ul>
</li>
<li>
<p>[&#44396;&#49457;] &#45432;&#46300;&#50640;&#49436; Java Message Service &#45432;&#46300;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>[JMS &#49436;&#48708;&#49828;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#50976;&#54805;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#45796;&#51020;&#51012; &#49688;&#54665;&#54633;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#47196;&#52972; &#54840;&#49828;&#53944;&#51032; JMS &#49436;&#48708;&#49828;&#50640; &#50529;&#49464;&#49828;&#54616;&#47140;&#47732; EMBEDDED&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>JMS &#49436;&#48708;&#49828;&#45716; GlassFish Server&#50752; &#46041;&#51068;&#54620; JVM &#49884;&#49828;&#53596;&#50640;&#49436; &#49884;&#51089;&#46121;&#45768;&#45796;. &#52488;&#44592;&#54868; &#51648;&#50672;&#51008; GlassFish Server&#44032; &#49884;&#51089;&#46112; &#46412;&#44032; &#50500;&#45772; JMS &#49436;&#48708;&#49828;&#50640; &#52376;&#51020;&#50640; &#50529;&#49464;&#49828;&#54624; &#46412; &#44592;&#48376; &#54252;&#54632;&#46108; &#48652;&#47196;&#52964;&#47484; &#49884;&#51089;&#54633;&#45768;&#45796;. JMS &#49436;&#48708;&#49828;&#51032; &#44592;&#48376; &#50976;&#54805;&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>&#47196;&#52972; &#54840;&#49828;&#53944;&#51032; JMS &#49436;&#48708;&#49828;&#50640; &#50529;&#49464;&#49828;&#54616;&#47140;&#47732; LOCAL&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>JMS &#49436;&#48708;&#49828;&#45716; GlassFish Server&#50752; &#54632;&#44760; &#49884;&#51089;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>&#45796;&#47480; &#49884;&#49828;&#53596; &#46608;&#45716; &#53364;&#47084;&#49828;&#53552;&#50640; &#51080;&#45716; JMS &#49436;&#48708;&#49828;&#50640; &#50529;&#49464;&#49828;&#54616;&#47140;&#47732; REMOTE&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>REMOTE&#47484; &#49440;&#53469;&#54616;&#47732; &#45796;&#51020;&#50640; &#49436;&#48260;&#44032; &#49884;&#51089;&#46112; &#46412; JMS &#49436;&#48708;&#49828;&#44032; GlassFish Server&#50640;&#49436; &#49884;&#51089;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;. &#45824;&#49888; JMS &#49436;&#48708;&#49828;&#45716; Message Queue&#50640; &#51032;&#54644; &#49884;&#51089; &#48143; &#44288;&#47532;&#46104;&#48064;&#47196; Message Queue &#48652;&#47196;&#52964;&#47484; &#48324;&#46020;&#47196; &#49884;&#51089;&#54644;&#50556; &#54633;&#45768;&#45796;. &#48652;&#47196;&#52964; &#49884;&#51089;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GMADG00227"><i>Oracle GlassFish Server Message Queue Administration Guide</i>&#51032; <i>Starting Brokers</i></a>&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;. &#51060; &#44050;&#51012; &#49440;&#53469;&#54616;&#44256; &#50896;&#44201; &#54840;&#49828;&#53944;&#47484; &#49324;&#50857; &#51473;&#51064; &#44221;&#50864;&#50640;&#45716; <a href="task-jmshostedit.html">JMS &#54840;&#49828;&#53944;&#47484; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a>&#51032; &#51648;&#52840;&#50640; &#46384;&#46972; &#50896;&#44201; &#54840;&#49828;&#53944;&#51032; &#51060;&#47492;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
</li>
</ul>
</li>
<li>
<p>[&#49884;&#51089; &#49884;&#44036; &#52488;&#44284;] &#54596;&#46300;&#50640; GlassFish Server&#44032; &#49884;&#51089;&#51012; &#51473;&#51648;&#54616;&#44592; &#51204;&#50640; JMS &#49436;&#48708;&#49828;&#44032; &#49884;&#51089;&#46104;&#44592;&#47484; &#44592;&#45796;&#47532;&#45716; &#49884;&#44036;(&#52488;)&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#45712;&#47532;&#44144;&#45208; &#48512;&#54616;&#44032; &#47566;&#51008; &#49884;&#49828;&#53596;&#50640;&#49436;&#45716; &#44050;&#51012; &#44592;&#48376;&#44050;&#48372;&#45796; &#53356;&#44172; &#45720;&#47532;&#49901;&#49884;&#50724;. &#44592;&#48376;&#44050;&#51008; 60&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#49884;&#51089; &#51064;&#49688;] &#54596;&#46300;&#50640; JMS &#49436;&#48708;&#49828; &#49884;&#51089;&#51012; &#49324;&#50857;&#51088; &#51221;&#51032;&#54624; &#51064;&#49688;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>as-install-parent<code>/mq/bin/imqbrokerd</code> &#47749;&#47161;&#51012; &#53685;&#54644; &#49324;&#50857; &#44032;&#45733;&#54620; &#47784;&#46304; &#51064;&#49688;&#47484; &#49324;&#50857;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51116;&#51217;&#49549; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#50668; &#51217;&#49549;&#51060; &#45130;&#50612;&#51652; &#44221;&#50864; JMS &#49436;&#48708;&#49828;&#50640;&#49436; &#47700;&#49884;&#51648; &#49436;&#48260;(&#46608;&#45716; AddressList&#51032; &#51452;&#49548; &#47785;&#47197;)&#50640; &#51116;&#51217;&#49549;&#51012; &#49884;&#46020;&#54616;&#46020;&#47197; &#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#45796;&#49884; &#51217;&#49549; &#44036;&#44201;] &#54596;&#46300;&#50640;&#49436; &#51116;&#51217;&#49549; &#49884;&#46020; &#44036;&#51032; &#49884;&#44036;(&#52488; &#45800;&#50948;)&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>AddressList&#51032; &#44033; &#51452;&#49548;&#50640; &#45824;&#54620; &#49884;&#46020;&#50752; &#47785;&#47197;&#51032; &#50672;&#49549;&#46108; &#51452;&#49548;&#50640; &#51060; &#44036;&#44201;&#51060; &#51201;&#50857;&#46121;&#45768;&#45796;. &#51060; &#49884;&#44036; &#44036;&#44201;&#51060; &#45320;&#47924; &#51687;&#51012; &#44221;&#50864; &#48652;&#47196;&#52964;&#50640;&#44172; &#48373;&#44396;&#54624; &#49884;&#44036;&#51060; &#50630;&#49845;&#45768;&#45796;. &#45320;&#47924; &#44600; &#44221;&#50864;&#50640;&#45716; &#51648;&#50672;&#51060; &#51648;&#45208;&#52824;&#44172; &#44600;&#44172; &#45712;&#44788;&#51656; &#49688; &#51080;&#49845;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 5&#52488;&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>&#53364;&#46972;&#51060;&#50616;&#53944; &#47088;&#53440;&#51076;&#50640;&#49436; AddressList&#51032; &#51452;&#49548;&#50640; &#51217;&#49549;(&#46608;&#45716; &#51116;&#51217;&#49549;)&#51012; &#47751; &#48264; &#49884;&#46020;&#54620; &#54980; &#54644;&#45817; &#47785;&#47197;&#51032; &#45796;&#51020; &#51452;&#49548;&#47196; &#51217;&#49549;&#51012; &#49884;&#46020;&#54624;&#51648;&#47484; [&#51116;&#51217;&#49549; &#49884;&#46020;] &#54596;&#46300;&#50640; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>-1 &#44050;&#51008; &#51116;&#51217;&#49549; &#49884;&#46020; &#54943;&#49688;&#50640; &#51228;&#54620;&#51060; &#50630;&#51020;&#51012; &#45208;&#53440;&#45253;&#45768;&#45796;. &#53364;&#46972;&#51060;&#50616;&#53944; &#47088;&#53440;&#51076;&#51008; &#49457;&#44277;&#54624; &#46412;&#44620;&#51648; &#52395;&#48264;&#51704; &#51452;&#49548;&#50640; &#51217;&#49549;&#51012; &#49884;&#46020;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 3&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#44592;&#48376; JMS &#54840;&#49828;&#53944;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#44592;&#48376; JMS &#54840;&#49828;&#53944;&#51032; &#51060;&#47492;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; <code>default_JMS_host</code>&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51452;&#49548; &#47785;&#47197; &#46041;&#51089;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#51217;&#49549; &#49884;&#46020; &#49692;&#49436;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<ul>
<li>
<p><code>random</code>&#51008; AddressList&#50640;&#49436; &#51452;&#49548;&#47484; &#51076;&#51032;&#47196; &#49440;&#53469;&#54620;&#45796;&#45716; &#51032;&#48120;&#51077;&#45768;&#45796;.</p>
<p>&#46041;&#51068;&#54620; &#51217;&#49549; &#54057;&#53664;&#47532;&#47484; &#49324;&#50857;&#54616;&#50668; &#51217;&#49549;&#51012; &#49884;&#46020;&#54616;&#45716; &#53364;&#46972;&#51060;&#50616;&#53944;&#44032; &#47566;&#51012; &#44221;&#50864; <code>random</code>&#51012; &#51648;&#51221;&#54616;&#50668; &#53364;&#46972;&#51060;&#50616;&#53944;&#44032; &#47784;&#46160; &#44057;&#51008; &#51452;&#49548;&#50640; &#51217;&#49549;&#46104;&#51648; &#47803;&#54616;&#46020;&#47197; &#54633;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#44050;&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p><code>priority</code>&#45716; &#51116;&#51217;&#49549;&#54624; &#46412; &#54637;&#49345; AddressList&#50640; &#51080;&#45716; &#52395;&#48264;&#51704; &#49436;&#48260; &#51452;&#49548;&#50640; &#51217;&#49549;&#54616;&#44256; &#52395;&#48264;&#51704; &#48652;&#47196;&#52964;&#47484; &#49324;&#50857;&#54624; &#49688; &#50630;&#45716; &#44221;&#50864;&#50640;&#47564; &#45796;&#47480; &#51452;&#49548;&#47484; &#49324;&#50857;&#54620;&#45796;&#45716; &#51032;&#48120;&#51077;&#45768;&#45796;.</p>
</li>
</ul>
</li>
<li>
<p>[&#51452;&#49548; &#47785;&#47197; &#48152;&#48373;] &#54596;&#46300;&#50640; &#51217;&#49549;&#51012; &#49444;&#51221;&#54616;&#44144;&#45208; &#51116;&#49444;&#51221;&#54624; &#46412; JMS &#49436;&#48708;&#49828;&#44032; AddressList&#47484; &#48152;&#48373;&#54616;&#45716; &#54943;&#49688;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>-1 &#44050;&#51008; &#54943;&#49688;&#50640; &#51228;&#54620;&#51060; &#50630;&#51020;&#51012; &#45208;&#53440;&#45253;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 3&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>&#44592;&#48376;&#44050;&#51060; &#50500;&#45772; &#52404;&#44228;&#45208; &#49436;&#48708;&#49828;&#47484; &#49324;&#50857;&#54624; &#44221;&#50864; MQ &#52404;&#44228; &#48143; MQ &#49436;&#48708;&#49828; &#54596;&#46300;&#50640; Message Queue &#51452;&#49548; &#52404;&#44228; &#51060;&#47492;&#44284; Message Queue &#51217;&#49549; &#49436;&#48708;&#49828; &#51060;&#47492;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#44396;&#47928; &#51221;&#48372;&#45716; <a href="ref-mqschemeservice.html">MQ &#52404;&#44228; &#48143; MQ &#49436;&#48708;&#49828; &#51452;&#49548; &#44396;&#47928;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</li>
<li>
<p>[&#52628;&#44032; &#49549;&#49457;] &#50689;&#50669;&#50640;&#49436; JMS &#49436;&#48708;&#49828;&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#49324;&#50857; &#44032;&#45733;&#54620; &#49549;&#49457;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="ref-jmsservice-additional-props.html">JMS &#49436;&#48708;&#49828; &#44288;&#47144; &#49549;&#49457;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
<ul>
<li>
<p>&#49549;&#49457;&#51012; &#52628;&#44032;&#54616;&#47140;&#47732; [&#49549;&#49457; &#52628;&#44032;] &#45800;&#52628;&#47484; &#45572;&#47493;&#45768;&#45796;. &#48712; &#54665;&#51060; &#54364;&#49884;&#46104;&#47732; [&#51060;&#47492;] &#54596;&#46300;&#50640; &#49549;&#49457; &#51060;&#47492;&#51012; &#51077;&#47141;&#54616;&#44256; [&#44050;] &#54596;&#46300;&#50640; &#49549;&#49457;&#44050;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#49549;&#49457;&#51012; &#49688;&#51221;&#54616;&#47140;&#47732; &#49549;&#49457;&#51032; [&#44050;] &#54596;&#46300;&#47484; &#54200;&#51665;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#49549;&#49457;&#51012; &#49325;&#51228;&#54616;&#47140;&#47732; &#49325;&#51228;&#54624; &#49549;&#49457;&#51032; [&#51060;&#47492;] &#54596;&#46300; &#50812;&#51901;&#50640; &#51080;&#45716; &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54620; &#45796;&#51020; [&#49549;&#49457; &#49325;&#51228;] &#45800;&#52628;&#47484; &#45572;&#47493;&#45768;&#45796;.</p>
</li>
</ul>
</li>
<li>
<p>JMS &#49436;&#48708;&#49828;&#44032; &#44592;&#48376; JMS &#54840;&#49828;&#53944;&#50640;&#49436; &#49892;&#54665; &#51473;&#51064;&#51648; &#54869;&#51064;&#54616;&#47140;&#47732; [&#54609;]&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
<p>JMS &#49436;&#48708;&#49828;&#44032; &#49892;&#54665; &#51473;&#51060;&#47732; &#54609;&#51060; &#49457;&#44277;&#54664;&#45796;&#45716; &#47700;&#49884;&#51648;&#44032; &#48372;&#44256;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51200;&#51109;]&#51012; &#45572;&#47493;&#45768;&#45796;.</p>

<hr>
<p><b>&#54017;:</b></p>
&#44592;&#48376; &#49444;&#51221;&#51004;&#47196; &#46028;&#50500;&#44032;&#47140;&#47732; [&#44592;&#48376;&#44050; &#47196;&#46300;] &#45800;&#52628;&#47484; &#45572;&#47480; &#45796;&#51020; [&#51200;&#51109;]&#51012; &#45572;&#47493;&#45768;&#45796;.
<hr>

</li>
</ol>
<a id="sthref21" name="sthref21"></a>
<h5>&#50896;&#44201; &#49436;&#48260; &#50529;&#49464;&#49828;</h5>
<p>&#51228;&#44277;&#51088;&#50752; &#54840;&#49828;&#53944;&#47484; &#50896;&#44201; &#49884;&#49828;&#53596;&#51004;&#47196; &#48320;&#44221;&#54616;&#47732; &#47784;&#46304; JMS &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#50896;&#44201; &#49436;&#48260;&#50640;&#49436; &#49892;&#54665;&#46121;&#45768;&#45796;. &#47196;&#52972; &#49436;&#48260;&#50752; &#54616;&#45208; &#51060;&#49345;&#51032; &#50896;&#44201; &#49436;&#48260;&#47484; &#47784;&#46160; &#49324;&#50857;&#54616;&#47140;&#47732; &#50896;&#44201; &#49436;&#48260;&#50640; &#50529;&#49464;&#49828;&#54616;&#45716; &#51217;&#49549;&#51012; &#49373;&#49457;&#54616;&#45716; <code>AddressList</code> &#49549;&#49457;&#51012; &#49324;&#50857;&#54616;&#50668; &#51217;&#49549; &#54057;&#53664;&#47532; &#47532;&#49548;&#49828;&#47484; &#49373;&#49457;&#54633;&#45768;&#45796;. <a href="task-jmsconnectionnew.html">JMS &#51217;&#49549; &#54057;&#53664;&#47532; &#47532;&#49548;&#49828;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
<a id="sthref22" name="sthref22"></a>
<h5>&#54644;&#45817; asadmin &#47749;&#47161;</h5>
<p><code>jms-ping</code></p>
<a id="sthref23" name="sthref23"></a>
<h5>&#44288;&#47144; &#54637;&#47785;</h5>
<ul>
<li>
<p><a href="task-jmshostnew.html">JMS &#54840;&#49828;&#53944;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jmshostedit.html">JMS &#54840;&#49828;&#53944;&#47484; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jmshostdelete.html">JMS &#54840;&#49828;&#53944;&#47484; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestnew.html">JMS &#47932;&#47532;&#51201; &#45824;&#49345;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestedit.html">JMS &#47932;&#47532;&#51201; &#45824;&#49345;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestdelete.html">JMS &#47932;&#47532;&#51201; &#45824;&#49345;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jmsflushmessages.html">JMS &#47932;&#47532;&#51201; &#45824;&#49345;&#50640;&#49436; &#47700;&#49884;&#51648;&#47484; &#51228;&#44144;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldeststats.html">JMS &#47932;&#47532;&#51201; &#45824;&#49345;&#50640; &#45824;&#54620; &#53685;&#44228;&#47484; &#48372;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
