<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsphysicaldestnew" name="task-jmsphysicaldestnew"></a><a id="GHJMS00030" name="GHJMS00030"></a></p>

<h4><a id="sthref30" name="sthref30"></a><a id="sthref31" name="sthref31"></a>JMS &#47932;&#47532;&#51201; &#45824;&#49345;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>JMS &#45824;&#49345; &#47532;&#49548;&#49828;&#47484; &#49373;&#49457;&#54624; &#46412; &#47932;&#47532;&#51201; &#45824;&#49345; &#51060;&#47492;&#51012; &#51648;&#51221;&#54616;&#44256;, GlassFish Server&#50640;&#49436;&#45716; &#54596;&#50836;&#54624; &#46412; &#51088;&#46041;&#51004;&#47196; &#47932;&#47532;&#51201; &#45824;&#49345;&#51012; &#49373;&#49457;&#54616;&#44592; &#46412;&#47928;&#50640; &#45824;&#44060;&#45716; &#47932;&#47532;&#51201; &#45824;&#49345;&#51012; &#49373;&#49457;&#54624; &#54596;&#50836;&#44032; &#50630;&#49845;&#45768;&#45796;.</p>
<ol>
<li>
<p>&#53456;&#49353; &#53944;&#47532;&#50640;&#49436; [&#44396;&#49457;] &#45432;&#46300;&#47484; &#54869;&#51109;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#44396;&#49457;&#54624; &#51064;&#49828;&#53556;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#53945;&#51221; &#51064;&#49828;&#53556;&#49828;&#47484; &#44396;&#49457;&#54616;&#47140;&#47732; &#54644;&#45817; &#51064;&#49828;&#53556;&#49828;&#51032; &#44396;&#49457; &#45432;&#46300;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;. &#50696;&#47484; &#46308;&#50612;, &#44592;&#48376; &#51064;&#49828;&#53556;&#49828; <code>server</code>&#51032; &#44221;&#50864; <code>server-config</code> &#45432;&#46300;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p><code>default-config</code> &#48373;&#49324;&#48376;&#51012; &#49324;&#50857;&#54616;&#45716; &#54693;&#54980; &#51064;&#49828;&#53556;&#49828;&#50640; &#45824;&#54644; &#44592;&#48376; &#49444;&#51221;&#51012; &#44396;&#49457;&#54616;&#47140;&#47732; <code>default-config</code> &#45432;&#46300;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</li>
</ul>
</li>
<li>
<p>[&#44396;&#49457;] &#45432;&#46300;&#50640;&#49436; Java Message Service &#45432;&#46300;&#47484; &#54869;&#51109;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>Java Message Service &#45432;&#46300;&#50640;&#49436; [&#47932;&#47532;&#51201; &#45824;&#49345;] &#45432;&#46300;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>[&#47932;&#47532;&#51201; &#45824;&#49345;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#47932;&#47532;&#51201; &#45824;&#49345;] &#54168;&#51060;&#51648;&#50640;&#49436; [&#49352;&#47196; &#47564;&#46308;&#44592;]&#47484; &#45572;&#47493;&#45768;&#45796;.</p>
<p>[&#49352; &#47932;&#47532;&#51201; &#45824;&#49345;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51060;&#47492;] &#54596;&#46300;&#50640; &#47932;&#47532;&#51201; &#45824;&#49345;&#51032; &#51060;&#47492;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#50976;&#54805;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; <code>javax.jms.Topic</code> &#46608;&#45716; <code>javax.jms.Queue</code>&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#49324;&#50857;&#46104;&#51648; &#50506;&#51008; &#52572;&#45824; &#47700;&#49884;&#51648; &#49688;] &#54596;&#46300;&#50640; &#45824;&#49345;&#50640; &#54728;&#50857;&#46108; &#49324;&#50857;&#46104;&#51648; &#50506;&#51008; &#52572;&#45824; &#47700;&#49884;&#51648; &#49688;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#44050;&#51060; &ndash;1&#51060;&#47732; &#49324;&#50857;&#46104;&#51648; &#50506;&#51008; &#47700;&#49884;&#51648; &#49688;&#50640; &#51228;&#54620;&#51060; &#50630;&#51020;&#51012; &#45208;&#53440;&#45253;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; -1&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#52572;&#45824; &#47700;&#49884;&#51648; &#53356;&#44592;] &#54596;&#46300;&#50640; &#45800;&#51068; &#47700;&#49884;&#51648;&#51032; &#52572;&#45824; &#53356;&#44592;(&#48148;&#51060;&#53944;)&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#44050;&#51060; &ndash;1&#51060;&#47732; &#47700;&#49884;&#51648; &#53356;&#44592;&#50640; &#51228;&#54620;&#51060; &#50630;&#51020;&#51012; &#45208;&#53440;&#45253;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; -1&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#52572;&#45824; &#51204;&#52404; &#47700;&#47784;&#47532;] &#54596;&#46300;&#50640; &#49324;&#50857;&#46104;&#51648; &#50506;&#51008; &#47700;&#49884;&#51648;&#51032; &#52572;&#45824; &#51204;&#52404; &#47700;&#47784;&#47532;(&#48148;&#51060;&#53944;)&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#44050;&#51060; &ndash;1&#51060;&#47732; &#49324;&#50857;&#46104;&#51648; &#50506;&#51008; &#47700;&#49884;&#51648;&#51032; &#47700;&#47784;&#47532; &#53356;&#44592;&#50640; &#51228;&#54620;&#51060; &#50630;&#51020;&#51012; &#45208;&#53440;&#45253;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; -1&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51076;&#44228;&#44050; &#51228;&#54620; &#46041;&#51089;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#47700;&#47784;&#47532; &#51228;&#54620; &#51076;&#44228;&#44050;&#50640; &#46020;&#45804;&#54664;&#51012; &#46412; &#48652;&#47196;&#52964;&#44032; &#49688;&#54665;&#54624; &#46041;&#51089;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<ul>
<li>
<p><code>&#52572;&#49888; &#47700;&#49884;&#51648; &#44144;&#48512;</code>&#45716; &#48652;&#47196;&#52964;&#44032; &#44032;&#51109; &#52572;&#49888; &#47700;&#49884;&#51648;&#47484; &#44144;&#48512;&#54616;&#44256; &#47700;&#49884;&#51648;&#44032; &#51648;&#49549;&#51201;&#51068; &#44221;&#50864;&#50640;&#47564; &#49373;&#49457; &#53364;&#46972;&#51060;&#50616;&#53944;&#50640; &#50696;&#50808; &#49324;&#54637;&#51012; &#50508;&#47532;&#46020;&#47197; &#54633;&#45768;&#45796;.</p>
<p><code>&#52572;&#49888; &#47700;&#49884;&#51648; &#44144;&#48512;</code>&#45716; &#44592;&#48376;&#44050;&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p><code>&#49373;&#49457;&#51088; &#45712;&#47532;&#44172;</code>&#45716; &#48652;&#47196;&#52964;&#44032; &#47700;&#49884;&#51648; &#49373;&#49457;&#51088;&#44032; &#47700;&#49884;&#51648;&#47484; &#48372;&#45236;&#45716; &#49549;&#46020;&#47484; &#45734;&#52628;&#46020;&#47197; &#54633;&#45768;&#45796;.</p>
</li>
<li>
<p><code>&#44032;&#51109; &#50724;&#47000;&#46108; &#47700;&#49884;&#51648; &#49325;&#51228;</code>&#45716; &#48652;&#47196;&#52964;&#44032; &#44032;&#51109; &#50724;&#47000;&#46108; &#47700;&#49884;&#51648;&#47484; &#49325;&#51228;&#54616;&#46020;&#47197; &#54633;&#45768;&#45796;.</p>
</li>
<li>
<p><code>&#50864;&#49440;&#49692;&#50948;&#44032; &#44032;&#51109; &#45230;&#51008; &#47700;&#49884;&#51648; &#49325;&#51228;</code>&#45716; &#48652;&#47196;&#52964;&#44032; &#50864;&#49440;&#49692;&#50948;&#44032; &#44032;&#51109; &#45230;&#51008; &#47700;&#49884;&#51648;&#47484; &#49325;&#51228;&#54616;&#46020;&#47197; &#54633;&#45768;&#45796;.</p>
</li>
</ul>
<p>&#44050;&#51060; <code>&#44032;&#51109; &#50724;&#47000;&#46108; &#47700;&#49884;&#51648; &#49325;&#51228;</code> &#46608;&#45716; <code>&#50864;&#49440;&#49692;&#50948;&#44032; &#44032;&#51109; &#45230;&#51008; &#47700;&#49884;&#51648; &#49325;&#51228;</code>&#51060;&#44256; [&#49324;&#50857; &#48520;&#45733; &#47700;&#49884;&#51648; &#45824;&#44592;&#50676; &#49324;&#50857;]&#51012; True&#47196; &#49444;&#51221;&#54616;&#47732; &#48276;&#50948; &#48150; &#47700;&#49884;&#51648;&#44032; &#49324;&#50857; &#48520;&#45733; &#47700;&#49884;&#51648; &#45824;&#44592;&#50676;&#47196; &#51060;&#46041;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#52572;&#45824; &#49373;&#49457;&#51088; &#49688;] &#54596;&#46300;&#50640; &#51060; &#47932;&#47532;&#51201; &#45824;&#49345;&#44284; &#50672;&#44288;&#46112; &#49688; &#51080;&#45716; &#52572;&#45824; &#47700;&#49884;&#51648; &#49373;&#49457;&#51088; &#49688;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#51228;&#54620;&#50640; &#46020;&#45804;&#54616;&#47732; &#49352; &#49373;&#49457;&#51088;&#47484; &#49373;&#49457;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. &#44050;&#51060; &ndash;1&#51060;&#47732; &#49373;&#49457;&#51088; &#49688;&#50640; &#51228;&#54620;&#51060; &#50630;&#51020;&#51012; &#45208;&#53440;&#45253;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 100&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#48176;&#52824; &#51204;&#45804; &#52572;&#45824; &#47700;&#49884;&#51648; &#49688;] &#54596;&#46300;&#50640; &#45800;&#51068; &#48176;&#52824;&#47196; &#49324;&#50857;&#51088;&#50640;&#44172; &#51204;&#45804;&#54624; &#49688; &#51080;&#45716; &#52572;&#45824; &#47700;&#49884;&#51648; &#49688;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#44050;&#51060; -1&#51060;&#47732; &#47700;&#49884;&#51648; &#49688;&#50640; &#51228;&#54620;&#51060; &#50630;&#51020;&#51012; &#45208;&#53440;&#45253;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 1000&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#49324;&#50857; &#48520;&#45733; &#47700;&#49884;&#51648; &#45824;&#44592;&#50676; &#49324;&#50857;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; True&#47484; &#49440;&#53469;&#54616;&#50668; &#49324;&#50857; &#48520;&#45733; &#47700;&#49884;&#51648;&#47484; &#49324;&#50857; &#48520;&#45733; &#47700;&#49884;&#51648; &#45824;&#44592;&#50676;&#50640; &#48176;&#52824;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#44050;&#51012; False&#47196; &#49444;&#51221;&#54616;&#47732; &#49324;&#50857; &#48520;&#45733; &#47700;&#49884;&#51648;&#45716; &#49325;&#51228;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; True&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>[XML &#49828;&#53412;&#47560; &#44160;&#51613; &#49324;&#50857;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; True&#47484; &#49440;&#53469;&#54616;&#50668; &#45824;&#49345;&#50640; &#45824;&#54620; XML &#49828;&#53412;&#47560; &#44160;&#51613;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#44050;&#51012; True&#47196; &#49444;&#51221;&#54616;&#47732; Message Queue &#53364;&#46972;&#51060;&#50616;&#53944; &#47088;&#53440;&#51076;&#51008; XML &#47700;&#49884;&#51648;&#47484; &#48652;&#47196;&#52964;&#47196; &#48372;&#45236;&#44592; &#51204;&#50640; &#51648;&#51221;&#46108; XML &#49828;&#53412;&#47560; &#51221;&#51032;&#50640; &#45824;&#54644;(&#46608;&#45716; XSD&#44032; &#51648;&#51221;&#46104;&#51648; &#50506;&#51008; &#44221;&#50864; DTD&#50640; &#45824;&#54644;) XML &#47700;&#49884;&#51648;&#51032; &#44160;&#51613;&#51012; &#49884;&#46020;&#54633;&#45768;&#45796;. &#51648;&#51221;&#46108; &#49828;&#53412;&#47560;&#47484; &#52286;&#51012; &#49688; &#50630;&#44144;&#45208; &#47700;&#49884;&#51648;&#47484; &#44160;&#51613;&#54624; &#49688; &#50630;&#51004;&#47732; &#47700;&#49884;&#51648;&#44032; &#51204;&#49569;&#46104;&#51648; &#50506;&#44256; &#50696;&#50808; &#49324;&#54637;&#51060; &#48156;&#49373;&#54633;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; False&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>[XML &#49828;&#53412;&#47560; URI &#47785;&#47197;] &#54596;&#46300;&#50640; XSD(XML &#49828;&#53412;&#47560; &#51221;&#51032;) URI &#47928;&#51088;&#50676;&#51032; &#44277;&#48177;&#51004;&#47196; &#44396;&#48516;&#46108; &#47785;&#47197;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>XML &#49828;&#53412;&#47560; &#44160;&#51613;&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; URI&#45716; XML &#49828;&#53412;&#47560; &#44160;&#51613;&#50640; &#49324;&#50857;&#54624; &#54616;&#45208; &#51060;&#49345;&#51032; XSD &#50948;&#52824;&#47484; &#44032;&#47532;&#53429;&#45768;&#45796;.</p>
</li>
</ol>
<a id="sthref32" name="sthref32"></a>
<h5>&#44288;&#47144; &#54637;&#47785;</h5>
<ul>
<li>
<p><a href="task-jmsservice.html">JMS &#49436;&#48708;&#49828;&#47484; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jmshostnew.html">JMS &#54840;&#49828;&#53944;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jmshostedit.html">JMS &#54840;&#49828;&#53944;&#47484; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jmshostdelete.html">JMS &#54840;&#49828;&#53944;&#47484; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestedit.html">JMS &#47932;&#47532;&#51201; &#45824;&#49345;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestdelete.html">JMS &#47932;&#47532;&#51201; &#45824;&#49345;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jmsflushmessages.html">JMS &#47932;&#47532;&#51201; &#45824;&#49345;&#50640;&#49436; &#47700;&#49884;&#51648;&#47484; &#51228;&#44144;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldeststats.html">JMS &#47932;&#47532;&#51201; &#45824;&#49345;&#50640; &#45824;&#54620; &#53685;&#44228;&#47484; &#48372;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
