<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsconnectionnew" name="task-jmsconnectionnew"></a><a id="GHJMS00020" name="GHJMS00020"></a></p>

<h4><a id="sthref2" name="sthref2"></a><a id="sthref3" name="sthref3"></a>JMS &#51217;&#49549; &#54057;&#53664;&#47532; &#47532;&#49548;&#49828;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>JMS &#51217;&#49549; &#54057;&#53664;&#47532;&#47484; &#49373;&#49457;&#54624; &#46412; GlassFish Server&#50640;&#49436;&#45716; &#51217;&#49549; &#54057;&#53664;&#47532;&#50640; &#45824;&#54620; &#52964;&#45349;&#53552; &#51217;&#49549; &#54400; &#48143; &#52964;&#45349;&#53552; &#47532;&#49548;&#49828;&#47484; &#49373;&#49457;&#54633;&#45768;&#45796;. &#51060;&#47084;&#54620; &#44061;&#52404;&#45716; [&#52964;&#45349;&#53552;] &#45432;&#46300; &#50500;&#47000;&#50640;&#49436; &#48380; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<ol>
<li>
<p>&#53456;&#49353; &#53944;&#47532;&#50640;&#49436; [&#47532;&#49548;&#49828;] &#45432;&#46300;&#47484; &#54869;&#51109;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#47532;&#49548;&#49828;] &#45432;&#46300;&#50640;&#49436; [JMS &#47532;&#49548;&#49828;] &#45432;&#46300;&#47484; &#54869;&#51109;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[JMS &#47532;&#49548;&#49828;] &#45432;&#46300;&#50640;&#49436; [JMS &#51217;&#49549; &#54057;&#53664;&#47532;] &#45432;&#46300;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>[JMS &#51217;&#49549; &#54057;&#53664;&#47532;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[JMS &#51217;&#49549; &#54057;&#53664;&#47532;] &#54168;&#51060;&#51648;&#50640;&#49436; [&#49352;&#47196; &#47564;&#46308;&#44592;]&#47484; &#45572;&#47493;&#45768;&#45796;.</p>
<p>[&#49352; JMS &#51217;&#49549; &#54057;&#53664;&#47532;] &#54168;&#51060;&#51648;&#44032; &#45208;&#53440;&#45225;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#54400; &#51060;&#47492;] &#54596;&#46300;&#50640; &#51217;&#49549; &#54057;&#53664;&#47532;&#51032; &#44256;&#50976;&#54620; &#51060;&#47492;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>GlassFish Server&#50640;&#49436;&#45716; &#51217;&#49549; &#54057;&#53664;&#47532;&#51032; JNDI &#51060;&#47492;&#51012; &#51060; &#44050;&#51004;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#47532;&#49548;&#49828; &#50976;&#54805;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; <code>javax.jms.ConnectionFactory</code>, <code>javax.jms.QueueConnectionFactory</code> &#46608;&#45716; <code>javax.jms.TopicConnectionFactory</code>&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#49444;&#47749;] &#54596;&#46300;&#50640; &#51217;&#49549; &#54057;&#53664;&#47532;&#50640; &#45824;&#54620; &#49444;&#47749;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#47088;&#53440;&#51076;&#50640; &#47532;&#49548;&#49828;&#47484; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47140;&#47732; [&#49345;&#53468; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#52488;&#44592; &#48143; &#52572;&#49548; &#54400; &#53356;&#44592;] &#54596;&#46300;&#50640; &#54400;&#51032; &#52572;&#49548; &#51217;&#49549; &#49688;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; 8&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#52572;&#45824; &#54400; &#53356;&#44592;] &#54596;&#46300;&#50640; &#54400;&#51032; &#52572;&#45824; &#51217;&#49549; &#49688;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; 32&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#54400; &#53356;&#44592; &#51312;&#51221; &#44060;&#49688;] &#54596;&#46300;&#50640; &#54400; &#50976;&#55092; &#49884;&#44036; &#52488;&#44284;&#44032; &#47564;&#47308;&#46112; &#46412; &#51228;&#44144;&#54624; &#51217;&#49549; &#49688;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; 2&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#50976;&#55092; &#49884;&#44036; &#52488;&#44284;] &#54596;&#46300;&#50640; &#54400;&#50640;&#49436; &#51217;&#49549;&#51060; &#50976;&#55092; &#49345;&#53468;&#47196; &#50976;&#51648;&#46112; &#49688; &#51080;&#45716; &#52572;&#45824; &#49884;&#44036;(&#52488;)&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; 300&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#52572;&#45824; &#45824;&#44592; &#49884;&#44036;] &#54596;&#46300;&#50640; &#51217;&#49549;&#51012; &#50836;&#52397;&#54616;&#45716; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#51217;&#49549; &#49884;&#44036; &#52488;&#44284;&#44620;&#51648; &#45824;&#44592;&#54616;&#45716; &#49884;&#44036;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; 60000&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#49892;&#54056; &#49884; &#47784;&#46304; &#51217;&#49549; &#45803;&#44592;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#50668; &#45800;&#51068; &#51217;&#49549;&#51060; &#49892;&#54056;&#54624; &#44221;&#50864; GlassFish Server&#50640;&#49436; &#54400;&#51032; &#47784;&#46304; &#51217;&#49549;&#51012; &#45803;&#51008; &#54980; &#51116;&#49444;&#51221;&#54616;&#46020;&#47197; &#54633;&#45768;&#45796;.</p>
<p>&#51060; &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#51648; &#50506;&#51004;&#47732; &#44060;&#48324; &#51217;&#49549;&#51012; &#49324;&#50857;&#54624; &#44221;&#50864;&#50640;&#47564; &#51217;&#49549;&#51060; &#45796;&#49884; &#49444;&#51221;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>JMS &#51217;&#49549; &#54057;&#53664;&#47532; &#47532;&#49548;&#49828;&#51032; &#44221;&#50864; &#53944;&#47004;&#51117;&#49496; &#51648;&#50896; &#47112;&#48296;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#49440;&#53469;&#46108; &#44050;&#51008; &#47532;&#49548;&#49828; &#50612;&#45841;&#53552;&#51032; &#53944;&#47004;&#51117;&#49496; &#51648;&#50896; &#49549;&#49457;&#51012; &#54616;&#54693; &#54840;&#54872; &#48169;&#49885;&#51004;&#47196; &#44217;&#52432;&#50433;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#53944;&#47004;&#51117;&#49496; &#48276;&#50948; &#45236;&#50640;&#49436; &#46168; &#51060;&#49345;&#51032; &#47532;&#49548;&#49828; &#49324;&#50857;&#44284; &#44288;&#47144;&#46108; &#53944;&#47004;&#51117;&#49496;&#50640; &#49324;&#50857;&#54624; &#49688; &#51080;&#45716; &#47532;&#49548;&#49828;&#50640; &#45824;&#54644; XATransaction(JMS &#47532;&#49548;&#49828; &#50612;&#45841;&#53552;&#51032; &#44592;&#48376;&#44050;)&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#50696;&#47484; &#46308;&#50612; &#53944;&#47004;&#51117;&#49496;&#50640;&#45716; &#51060; &#47532;&#49548;&#49828;&#50752; JDBC &#47532;&#49548;&#49828;, &#52964;&#45349;&#53552; &#47532;&#49548;&#49828; &#46608;&#45716; &#45796;&#47480; JMS &#51217;&#49549; &#54057;&#53664;&#47532; &#47532;&#49548;&#49828;&#44032; &#54252;&#54632;&#46112; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#44050;&#51008; &#44032;&#51109; &#45458;&#51008; &#50976;&#50672;&#49457;&#51012; &#51228;&#44277;&#54633;&#45768;&#45796;. XATransaction&#51004;&#47196; &#44396;&#49457;&#46108; &#47532;&#49548;&#49828;&#45716; 2&#45800;&#44228; &#52964;&#48139; &#51089;&#50629;&#50640; &#52280;&#50668;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#53944;&#47004;&#51117;&#49496; &#48276;&#50948; &#45236;&#50640;&#49436; &#54616;&#45208;&#51032; &#47532;&#49548;&#49828;&#47564; &#44288;&#50668;&#54616;&#45716; &#53944;&#47004;&#51117;&#49496;&#50640; &#49324;&#50857;&#46104;&#44144;&#45208; &#46168; &#51060;&#49345;&#51032; XA &#47532;&#49548;&#49828;&#44032; &#44288;&#50668;&#54616;&#45716; &#48516;&#49328;&#46108; &#53944;&#47004;&#51117;&#49496;&#50640;&#49436; &#47560;&#51648;&#47561; &#50640;&#51060;&#51204;&#53944;&#47196; &#49324;&#50857;&#46112; &#49688; &#51080;&#45716; &#47532;&#49548;&#49828;&#50640; &#45824;&#54644; LocalTransaction&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#44050;&#51008; &#55016;&#50476; &#45458;&#51008; &#49457;&#45733;&#51012; &#51228;&#44277;&#54633;&#45768;&#45796;. LocalTransaction&#51004;&#47196; &#44396;&#49457;&#46108; &#47532;&#49548;&#49828;&#45716; 2&#45800;&#44228; &#52964;&#48139; &#51089;&#50629;&#50640; &#49324;&#50857;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>&#53944;&#47004;&#51117;&#49496;&#50640; &#51208;&#45824;&#47196; &#52280;&#50668;&#54616;&#51648; &#50506;&#51012; &#47532;&#49548;&#49828;&#50640; &#45824;&#54644; NoTransaction&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#49444;&#51221;&#51008; JMS &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640;&#49436; &#51228;&#54620;&#51201;&#51004;&#47196; &#49324;&#50857;&#46121;&#45768;&#45796;.</p>
</li>
</ul>
</li>
<li>
<p>[&#51217;&#49549; &#44160;&#51613; &#54596;&#50836;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#50668; &#51217;&#49549; &#44160;&#51613;&#51012; &#49324;&#50857;&#54616;&#46020;&#47197; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51060; &#49440;&#53469;&#46108; &#44221;&#50864; &#51217;&#49549;&#51012; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#51204;&#45804;&#54616;&#44592; &#51204;&#50640; &#47676;&#51200; &#44160;&#51613;&#54633;&#45768;&#45796;. &#47532;&#49548;&#49828;&#51032; &#44160;&#51613;&#51060; &#49892;&#54056;&#54616;&#47732; &#47532;&#49548;&#49828;&#44032; &#49325;&#51228;&#46104;&#44256;, &#49352; &#47532;&#49548;&#49828;&#44032; &#49373;&#49457;&#46108; &#54980; &#48152;&#54872;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#52628;&#44032; &#49549;&#49457;] &#49465;&#49496;&#50640;&#49436; &#51217;&#49549; &#54057;&#53664;&#47532;&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#49324;&#50857; &#44032;&#45733;&#54620; &#49549;&#49457;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="ref-jmsconnectionproperties.html">JMS &#51217;&#49549; &#54057;&#53664;&#47532; &#44288;&#47144; &#49549;&#49457;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
<p>&#49549;&#49457;&#51012; &#52628;&#44032;&#54616;&#47140;&#47732; [&#49549;&#49457; &#52628;&#44032;] &#45800;&#52628;&#47484; &#45572;&#47493;&#45768;&#45796;. &#48712; &#54665;&#51060; &#54364;&#49884;&#46104;&#47732; [&#51060;&#47492;] &#54596;&#46300;&#50640; &#49549;&#49457; &#51060;&#47492;&#51012; &#51077;&#47141;&#54616;&#44256; [&#44050;] &#54596;&#46300;&#50640; &#49549;&#49457;&#44050;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#45824;&#49345;] &#50689;&#50669;&#50640;&#49436; &#45796;&#51020;&#51012; &#49688;&#54665;&#54633;&#45768;&#45796;.</p>
<ol type="a">
<li>
<p>[&#49324;&#50857; &#44032;&#45733;] &#50676;&#50640;&#49436; &#47532;&#49548;&#49828;&#47484; &#49324;&#50857;&#54616;&#45716; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#48176;&#52824;&#46112; &#45824;&#49345;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#49324;&#50857; &#44032;&#45733;&#54620; &#45824;&#49345;&#50640;&#45716; &#44592;&#48376; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#51064; <code>&#49436;&#48260;</code>&#49104; &#50500;&#45768;&#46972; &#49324;&#50857; &#44032;&#45733;&#54620; &#53364;&#47084;&#49828;&#53552; &#48143; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#44032; &#54252;&#54632;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#52628;&#44032;]&#47484; &#45580;&#47084; &#45824;&#49345;&#51012; [&#49440;&#53469;&#46120;] &#50676;&#47196; &#51060;&#46041;&#54633;&#45768;&#45796;.</p>
</li>
</ol>
</li>
<li>
<p>[&#54869;&#51064;]&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
</li>
</ol>
<a id="sthref4" name="sthref4"></a>
<h5>&#44288;&#47144; &#54637;&#47785;</h5>
<ul>
<li>
<p><a href="task-jmsconnectionedit.html">JMS &#51217;&#49549; &#54057;&#53664;&#47532; &#47532;&#49548;&#49828;&#47484; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">JMS &#51217;&#49549; &#54057;&#53664;&#47532; &#47532;&#49548;&#49828;&#47484; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jmsdestinationnew.html">JMS &#45824;&#49345; &#47532;&#49548;&#49828;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jmsdestinationedit.html">JMS &#45824;&#49345; &#47532;&#49548;&#49828;&#47484; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jmsdestinationdelete.html">JMS &#45824;&#49345; &#47532;&#49548;&#49828;&#47484; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
