<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jdbcconnectionpoolnew2" name="ref-jdbcconnectionpoolnew2"></a></p>

<h4><a id="sthref44" name="sthref44"></a>&#26032;&#24314; JDBC &#36830;&#25509;&#27744; (&#31532; 2 &#27493;&#65292;&#20849; 2 &#27493;)</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&ldquo;&#26032;&#24314; JDBC &#36830;&#25509;&#27744; (&#31532; 2 &#27493;&#65292;&#20849; 2 &#27493;)&rdquo;&#39029;&#21487;&#20197;&#21019;&#24314;&#26032;&#30340; JDBC &#36830;&#25509;&#27744;&#12290;</p>
<p>&ldquo;&#26032;&#24314; JDBC &#36830;&#25509;&#27744; (&#31532; 2 &#27493;&#65292;&#20849; 2 &#27493;)&rdquo;&#39029;&#21253;&#21547;&#20197;&#19979;&#36873;&#39033;&#12290;</p>
<dl>
<dt>&#25968;&#25454;&#28304;&#31867;&#21517;&#31216;</dt>
<dd>
<p>&#23454;&#29616; <code>DataSource</code>&#12289;<code>ConnectionPoolDataSource</code> &#25110; <code>XADataSource</code> API &#30340;&#29305;&#23450;&#20110;&#25552;&#20379;&#26041;&#30340;&#31867;&#21517;&#31216;&#12290;&#22914;&#26524;&#21551;&#29992;&#20102;&ldquo;&#33258;&#27979;&rdquo;&#36873;&#39033;&#24182;&#36873;&#25321;&#20102;&#19968;&#31181;&#25968;&#25454;&#28304;&#36164;&#28304;&#31867;&#22411;&#65292;&#21017;&#27492;&#23383;&#27573;&#20250;&#33258;&#21160;&#22635;&#20805;&#19982;&#24744;&#36873;&#25321;&#30340;&#36164;&#28304;&#31867;&#22411;&#21644;&#25968;&#25454;&#24211;&#20379;&#24212;&#21830;&#20851;&#32852;&#30340;&#31867;&#21517;&#12290;&#22914;&#26524;&#36873;&#25321;&#20102; <code>java.sql.Driver</code> &#36164;&#28304;&#31867;&#22411;&#65292;&#21017;&#27492;&#23383;&#27573;&#23558;&#34987;&#31105;&#29992;&#12290;</p>
</dd>
<dt>&#39537;&#21160;&#31243;&#24207;&#31867;&#21517;&#31216;</dt>
<dd>
<p>&#25552;&#20379;&#26041;&#25552;&#20379;&#30340; JDBC &#39537;&#21160;&#31243;&#24207;&#31867;&#21517;&#31216;&#12290;&#22914;&#26524;&#21551;&#29992;&#20102;&ldquo;&#33258;&#27979;&rdquo;&#36873;&#39033;&#24182;&#36873;&#25321;&#20102; <code>java.sql.Driver</code> &#36164;&#28304;&#31867;&#22411;&#65292;&#21017;&#27492;&#23383;&#27573;&#20250;&#33258;&#21160;&#22635;&#20805;&#19982;&#24744;&#36873;&#25321;&#30340;&#39537;&#21160;&#31243;&#24207;&#21644;&#25968;&#25454;&#24211;&#20379;&#24212;&#21830;&#20851;&#32852;&#30340;&#31867;&#21517;&#12290;&#22914;&#26524;&#36873;&#25321;&#20102;&#19968;&#31181;&#25968;&#25454;&#28304;&#36164;&#28304;&#31867;&#22411;&#65292;&#21017;&#27492;&#23383;&#27573;&#23558;&#34987;&#31105;&#29992;&#12290;</p>
</dd>
<dt>&#35797;&#36890;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&#27492;&#36873;&#39033;&#65292;&#21017;&#22312;&#27744;&#21019;&#24314;&#25110;&#37325;&#26032;&#37197;&#32622;&#36807;&#31243;&#20013;&#65292;&#23558;&#33258;&#21160;&#23545;&#27744;&#36827;&#34892;&#35797;&#36890;&#25805;&#20316;&#65292;&#20197;&#35782;&#21035;&#20219;&#20309;&#38169;&#35823;&#23646;&#24615;&#20540;&#24182;&#21457;&#20986;&#35686;&#21578;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#35828;&#26126;</dt>
<dd>
<p>&#36830;&#25509;&#27744;&#30340;&#31616;&#30701;&#35828;&#26126;&#12290;</p>
</dd>
<dt>&#21021;&#22987;&#21644;&#26368;&#23567;&#27744;&#22823;&#23567;</dt>
<dd>
<p>&#27744;&#20013;&#36830;&#25509;&#30340;&#26368;&#23567;&#25968;&#37327;&#12290;&#35813;&#20540;&#36824;&#30830;&#23450;&#20102;&#39318;&#27425;&#21019;&#24314;&#27744;&#25110; GlassFish Server &#21551;&#21160;&#26102;&#65292;&#32622;&#20110;&#27744;&#20013;&#30340;&#36830;&#25509;&#30340;&#25968;&#37327;&#12290;&#40664;&#35748;&#20540;&#20026; 8&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#27744;&#22823;&#23567;</dt>
<dd>
<p>&#27744;&#20013;&#36830;&#25509;&#30340;&#26368;&#22823;&#25968;&#37327;&#12290;&#40664;&#35748;&#20540;&#20026; 32&#12290;</p>
</dd>
<dt>&#27744;&#35843;&#25972;&#22823;&#23567;&#25968;&#37327;</dt>
<dd>
<p>&#24403;&#27744;&#26681;&#25454;&#26368;&#22823;&#21644;&#26368;&#23567;&#27744;&#22823;&#23567;&#36827;&#34892;&#30456;&#24212;&#25193;&#22823;&#25110;&#32553;&#23567;&#26102;&#65292;&#23558;&#20197;&#25209;&#22788;&#29702;&#26041;&#24335;&#35843;&#25972;&#20854;&#22823;&#23567;&#12290;&#27492;&#20540;&#30830;&#23450;&#25209;&#22788;&#29702;&#20013;&#30340;&#36830;&#25509;&#25968;&#37327;&#12290;&#22914;&#26524;&#23558;&#35813;&#20540;&#35774;&#32622;&#24471;&#36807;&#22823;&#65292;&#21017;&#20250;&#24310;&#36831;&#36830;&#25509;&#21019;&#24314;&#21644;&#22238;&#25910;&#65307;&#22914;&#26524;&#23558;&#35813;&#20540;&#35774;&#32622;&#24471;&#36807;&#23567;&#65292;&#21017;&#20250;&#38477;&#20302;&#25928;&#29575;&#12290;&#40664;&#35748;&#20540;&#20026; 2&#12290;</p>
</dd>
<dt>&#31354;&#38386;&#36229;&#26102;</dt>
<dd>
<p>&#36830;&#25509;&#22312;&#27744;&#20013;&#20445;&#25345;&#31354;&#38386;&#30340;&#26368;&#38271;&#26102;&#38388; (&#31186;)&#12290;&#19968;&#26086;&#36229;&#36807;&#27492;&#26102;&#38388;&#65292;&#21363;&#20174;&#27744;&#20013;&#21024;&#38500;&#35813;&#36830;&#25509;&#12290;&#40664;&#35748;&#20540;&#20026; 300&#12290;</p>
</dd>
<dt>&#26368;&#38271;&#31561;&#24453;&#26102;&#38388;</dt>
<dd>
<p>&#35831;&#27714;&#36830;&#25509;&#30340;&#24212;&#29992;&#31243;&#24207;&#22312;&#36830;&#25509;&#36229;&#26102;&#20043;&#21069;&#31561;&#24453;&#30340;&#26368;&#38271;&#26102;&#38388; (&#27627;&#31186;)&#12290;&#40664;&#35748;&#20540;&#20026; 60,000&#12290;</p>
</dd>
<dt>&#38750;&#20107;&#21153;&#22788;&#29702;&#36830;&#25509;</dt>
<dd>
<p>&#22914;&#26524;&#21551;&#29992;&#20102;&#27492;&#36873;&#39033;&#65292;&#23558;&#36820;&#22238;&#38750;&#20107;&#21153;&#22788;&#29702;&#36830;&#25509;&#12290;</p>
</dd>
<dt>&#20107;&#21153;&#22788;&#29702;&#38548;&#31163;</dt>
<dd>
<p>&#22914;&#26524;&#25351;&#23450;&#20107;&#21153;&#22788;&#29702;&#38548;&#31163;&#32423;&#21035;&#65292;&#27492;&#27744;&#20013;&#30340;&#36830;&#25509;&#23558;&#20197;&#25351;&#23450;&#32423;&#21035;&#36827;&#34892;&#25805;&#20316;&#12290;&#21542;&#21017;&#65292;&#36830;&#25509;&#23558;&#20351;&#29992; JDBC &#39537;&#21160;&#31243;&#24207;&#25552;&#20379;&#30340;&#40664;&#35748;&#38548;&#31163;&#32423;&#21035;&#36827;&#34892;&#25805;&#20316;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#26410;&#25351;&#23450;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#38548;&#31163;&#32423;&#21035;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&ldquo;&#20445;&#35777;&rdquo;&#22797;&#36873;&#26694;&#65292;&#21017;&#20174;&#27744;&#20013;&#33719;&#21462;&#30340;&#25152;&#26377;&#36830;&#25509;&#37117;&#20855;&#26377;&#30456;&#21516;&#30340;&#38548;&#31163;&#32423;&#21035;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#19978;&#27425;&#20351;&#29992;&#36830;&#25509;&#26102;&#36890;&#36807;&#32534;&#31243;&#26041;&#24335; (&#20351;&#29992; <code>con.setTransactionIsolation</code>) &#26356;&#25913;&#20102;&#36830;&#25509;&#30340;&#38548;&#31163;&#32423;&#21035;&#65292;&#27492;&#26426;&#21046;&#20250;&#23558;&#29366;&#24577;&#26356;&#25913;&#22238;&#25351;&#23450;&#30340;&#38548;&#31163;&#32423;&#21035;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#21551;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
<p>&#20165;&#24403;&#24050;&#25351;&#23450;&#20107;&#21153;&#22788;&#29702;&#38548;&#31163;&#32423;&#21035;&#26102;&#65292;&#27492;&#35774;&#32622;&#25165;&#36866;&#29992;&#12290;</p>
</dd>
<dt>&#20854;&#20182;&#23646;&#24615;</dt>
<dd>
<p>JDBC &#36830;&#25509;&#27744;&#30340;&#20854;&#20182;&#23646;&#24615;&#12290;&#36825;&#20123;&#23646;&#24615;&#21487;&#33021;&#21253;&#25324;&#25968;&#25454;&#24211;&#21517;&#31216; (URL)&#12289;&#29992;&#25143;&#21517;&#21644;&#21475;&#20196;&#12290;&#35813;&#34920;&#36890;&#24120;&#21253;&#21547;&#25968;&#25454;&#24211;&#20379;&#24212;&#21830;&#20351;&#29992;&#30340;&#23646;&#24615;&#12290;</p>
<p>&#26377;&#20851;&#26576;&#20123;&#21487;&#29992;&#23646;&#24615;&#30340;&#35828;&#26126;&#65292;&#35831;&#21442;&#38405;<a href="ref-jdbc-properties.html">&#29305;&#23450;&#20110; JDBC &#36830;&#25509;&#27744;&#30340;&#23646;&#24615;</a>&#12290;</p>
<p>&#22914;&#26524;&#24744;&#19981;&#25351;&#23450;&#26576;&#20010;&#23646;&#24615;&#30340;&#20540;&#65292;&#21017;&#22312;&#21019;&#24314;&#23436;&#36830;&#25509;&#27744;&#26102;&#65292;&#35813;&#23646;&#24615;&#23558;&#20174;&#34920;&#20013;&#21024;&#38500;&#12290;&#22914;&#26524;&#24744;&#29616;&#22312;&#19981;&#24076;&#26395;&#35774;&#32622;&#26576;&#20010;&#23646;&#24615;&#30340;&#20540;&#65292;&#20294;&#24076;&#26395;&#23558;&#35813;&#23646;&#24615;&#20445;&#30041;&#22312;&#34920;&#20013;&#20197;&#20415;&#22312;&#20197;&#21518;&#35774;&#32622;&#20540;&#65292;&#35831;&#22312;&ldquo;&#20540;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#19968;&#23545;&#31354;&#25324;&#21495;&#65306;</p>
<pre>
()
</pre></dd>
</dl>
<a id="sthref45" name="sthref45"></a>
<h5>&#30456;&#20851;&#20219;&#21153;</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">&#35774;&#32622;&#25968;&#25454;&#24211;&#35775;&#38382;</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">&#38598;&#25104; JDBC &#39537;&#21160;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">&#21019;&#24314; JDBC &#36830;&#25509;&#27744;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">&#32534;&#36753; JDBC &#36830;&#25509;&#27744;&#24120;&#35268;&#35774;&#32622;</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">&#39564;&#35777;&#36830;&#25509;&#27744;&#35774;&#32622;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">&#32534;&#36753; JDBC &#36830;&#25509;&#27744;&#39640;&#32423;&#23646;&#24615;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">&#32534;&#36753; JDBC &#36830;&#25509;&#27744;&#23646;&#24615;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">&#21024;&#38500; JDBC &#36830;&#25509;&#27744;</a></p>
</li>
</ul>
<a id="sthref46" name="sthref46"></a>
<h5>&#30456;&#20851;&#30340; asadmin &#21629;&#20196;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00001"><code>add-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00036"><code>create-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00088"><code>delete-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00135"><code>flush-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00173"><code>list-jdbc-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00214"><code>ping-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00234"><code>start-database</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00239"><code>stop-database</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
