<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jdbcconnectionpooladvance" name="task-jdbcconnectionpooladvance"></a></p>

<h4><a id="sthref18" name="sthref18"></a>&#32534;&#36753; JDBC &#36830;&#25509;&#27744;&#39640;&#32423;&#23646;&#24615;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#23548;&#33322;&#26641;&#20013;&#65292;&#23637;&#24320;&ldquo;&#36164;&#28304;&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#36164;&#28304;&rdquo;&#33410;&#28857;&#19979;&#65292;&#36873;&#25321;&ldquo;JDBC&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;JDBC&rdquo;&#33410;&#28857;&#19979;&#65292;&#36873;&#25321;&ldquo;&#36830;&#25509;&#27744;&rdquo;&#33410;&#28857;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#36830;&#25509;&#27744;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#36830;&#25509;&#27744;&rdquo;&#39029;&#19978;&#65292;&#21333;&#20987;&#35201;&#32534;&#36753;&#30340;&#27744;&#30340;&#21517;&#31216;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#32534;&#36753;&#36830;&#25509;&#27744;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#32534;&#36753;&#36830;&#25509;&#27744;&rdquo;&#39029;&#19978;&#65292;&#21333;&#20987;&ldquo;&#39640;&#32423;&rdquo;&#36873;&#39033;&#21345;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#32534;&#36753;&#36830;&#25509;&#27744;&#39640;&#32423;&#23646;&#24615;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;Statement &#36229;&#26102;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#20197;&#31186;&#20026;&#21333;&#20301;&#30340;&#19968;&#27573;&#26102;&#38388;&#65292;&#32463;&#36807;&#36825;&#27573;&#26102;&#38388;&#21518;&#65292;&#23558;&#32456;&#27490;&#36816;&#34892;&#26102;&#38388;&#24322;&#24120;&#38271;&#30340;&#26597;&#35810;&#12290;</p>
<p>GlassFish Server &#23558;&#23545;&#21019;&#24314;&#30340;&#35821;&#21477;&#35774;&#32622; <code>QueryTimeout</code>&#12290;&#23558;&#35813;&#20540;&#35774;&#32622;&#20026; -1 &#21487;&#20197;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;&#40664;&#35748;&#20540;&#20026; -1&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#35821;&#21477;&#39640;&#36895;&#32531;&#23384;&#22823;&#23567;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#35201;&#20351;&#29992; LRU (&#26368;&#36817;&#26368;&#23569;&#20351;&#29992;) &#39640;&#36895;&#32531;&#23384;&#26426;&#21046;&#26469;&#39640;&#36895;&#32531;&#23384;&#30340;&#35821;&#21477;&#25968;&#12290;</p>
<p>&#35201;&#31105;&#29992;&#35821;&#21477;&#39640;&#36895;&#32531;&#23384;&#65292;&#35831;&#25351;&#23450;&#20540; 0&#12290;&#40664;&#35748;&#20540;&#20026; 0&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#21021;&#22987; SQL&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#27599;&#27425;&#22312;&#27744;&#20013;&#21019;&#24314; (&#19981;&#26159;&#37325;&#22797;&#20351;&#29992;) &#36830;&#25509;&#26102;&#35201;&#25191;&#34892;&#30340; SQL &#23383;&#31526;&#20018;&#12290;</p>
<p>&#25191;&#34892;&#27492;&#23383;&#31526;&#20018;&#21487;&#20197;&#21021;&#22987;&#21270;&#36830;&#25509;&#30340;&#29366;&#24577;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;SQL &#36319;&#36394;&#30417;&#21548;&#31243;&#24207;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#25351;&#23450;&#23558;&#36319;&#36394;&#24212;&#29992;&#31243;&#24207;&#25152;&#25191;&#34892; SQL &#35821;&#21477;&#30340;&#36887;&#21495;&#20998;&#38548;&#30340;&#30417;&#21548;&#31243;&#24207;&#23454;&#29616;&#31867;&#21517;&#21015;&#34920;&#12290;</p>
<p>&#30417;&#21548;&#31243;&#24207;&#31867;&#24517;&#39035;&#23454;&#29616; <code>org.glassfish.api.jdbc.SQLTraceListener</code> &#25509;&#21475;&#12290;&#20351;&#29992;&#30417;&#21548;&#31243;&#24207;&#21487;&#20197;&#36731;&#26494;&#22320;&#36807;&#28388; SQL &#35821;&#21477;&#30340;&#26085;&#24535;&#28040;&#24687;&#65292;&#24182;&#24110;&#21161;&#31649;&#29702;&#21592;&#20998;&#26512;&#35821;&#21477;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#21551;&#29992;&#21253;&#35013; JDBC &#23545;&#35937;&rdquo;&#22797;&#36873;&#26694;&#21487;&#20197;&#20351;&#24212;&#29992;&#31243;&#24207;&#33719;&#21462; <code>Statement</code>&#12289;<code>PreparedStatement</code>&#12289;<code>CallableStatement</code>&#12289;<code>ResultSet</code>&#12289;<code>DatabaseMetaData</code> &#30340;&#21253;&#35013; JDBC &#23545;&#35937;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#21551;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#20849;&#20139;&rdquo;&#22797;&#36873;&#26694;&#21487;&#20197;&#21551;&#29992;&#27744;&#30340;&#36830;&#25509;&#20849;&#20139;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#21551;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26368;&#22810;&#39564;&#35777;&#19968;&#27425;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#20197;&#31186;&#20026;&#21333;&#20301;&#30340;&#19968;&#27573;&#26102;&#38388;&#65292;&#32463;&#36807;&#36825;&#27573;&#26102;&#38388;&#21518;&#65292;&#26368;&#22810;&#39564;&#35777;&#36830;&#25509;&#19968;&#27425;&#12290;</p>
<p>&#23558;&#35813;&#23646;&#24615;&#35774;&#32622;&#20026;&#36866;&#24403;&#30340;&#20540;&#21487;&#20197;&#26368;&#22823;&#31243;&#24230;&#20943;&#23569;&#36830;&#25509;&#30340;&#39564;&#35777;&#35831;&#27714;&#25968;&#12290;&#40664;&#35748;&#20540;&#20026; 0&#65292;&#34920;&#31034;&#26410;&#21551;&#29992;&#35813;&#23646;&#24615;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#36830;&#25509;&#27844;&#28431;&#36229;&#26102;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#29992;&#20110;&#22312;&#36830;&#25509;&#27744;&#20013;&#36319;&#36394;&#36830;&#25509;&#27844;&#28431;&#30340;&#26102;&#38388;&#38271;&#24230; (&#31186;)&#12290;</p>
<p>&#20351;&#29992;&#27492;&#23383;&#27573;&#21487;&#20197;&#26816;&#27979;&#24212;&#29992;&#31243;&#24207;&#30340;&#28508;&#22312;&#36830;&#25509;&#27844;&#28431;&#12290;&#22914;&#26524;&#24212;&#29992;&#31243;&#24207;&#26410;&#22312;&#25351;&#23450;&#26102;&#38388;&#27573;&#20869;&#23558;&#36830;&#25509;&#36820;&#22238;&#21040;&#27744;&#65292;&#21017;&#20551;&#23450;&#35813;&#36830;&#25509;&#21487;&#33021;&#21457;&#29983;&#20102;&#27844;&#28431;&#65292;&#24182;&#23558;&#35760;&#24405;&#35843;&#29992;&#26041;&#30340;&#22534;&#26632;&#36319;&#36394;&#12290;&#23558;&#27492;&#20540;&#35774;&#32622;&#20026; 0 &#20250;&#31105;&#29992;&#36830;&#25509;&#27844;&#28431;&#36319;&#36394;&#12290;&#40664;&#35748;&#20540;&#20026; 0&#12290;</p>
<p>&#20351;&#29992;&#27492;&#23383;&#27573;&#21644;&ldquo;&#36830;&#25509;&#27844;&#28431;&#22238;&#25910;&rdquo;&#21487;&#20197;&#36991;&#20813;&#24212;&#29992;&#31243;&#24207;&#30340;&#28508;&#22312;&#36830;&#25509;&#27844;&#28431;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#36830;&#25509;&#27844;&#28431;&#22238;&#25910;&rdquo;&#22797;&#36873;&#26694;&#21487;&#22312;&#23436;&#25104;&#27844;&#28431;&#36830;&#25509;&#36319;&#36394;&#21518;&#23558;&#27844;&#28431;&#30340;&#36830;&#25509;&#36824;&#21407;&#21040;&#27744;&#20013;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#35821;&#21477;&#27844;&#28431;&#36229;&#26102;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#29992;&#20110;&#22312;&#36830;&#25509;&#27744;&#20013;&#36319;&#36394;&#35821;&#21477;&#27844;&#28431;&#30340;&#26102;&#38388;&#38271;&#24230; (&#31186;)&#12290;</p>
<p>&#20351;&#29992;&#27492;&#23383;&#27573;&#21487;&#20197;&#26816;&#27979;&#24212;&#29992;&#31243;&#24207;&#30340;&#28508;&#22312;&#35821;&#21477;&#27844;&#28431;&#12290;&#22914;&#26524;&#24212;&#29992;&#31243;&#24207;&#26410;&#22312;&#25351;&#23450;&#26102;&#38388;&#27573;&#20869;&#23558;&#35821;&#21477;&#36820;&#22238;&#21040;&#27744;&#65292;&#21017;&#20551;&#23450;&#35813;&#35821;&#21477;&#21487;&#33021;&#21457;&#29983;&#20102;&#27844;&#28431;&#65292;&#24182;&#23558;&#35760;&#24405;&#35843;&#29992;&#26041;&#30340;&#22534;&#26632;&#36319;&#36394;&#12290;&#23558;&#27492;&#20540;&#35774;&#32622;&#20026; 0 &#20250;&#31105;&#29992;&#35821;&#21477;&#27844;&#28431;&#36319;&#36394;&#12290;&#40664;&#35748;&#20540;&#20026; 0&#12290;</p>
<p>&#20351;&#29992;&#27492;&#23383;&#27573;&#21644;&ldquo;&#35821;&#21477;&#27844;&#28431;&#22238;&#25910;&rdquo;&#21487;&#20197;&#36991;&#20813;&#24212;&#29992;&#31243;&#24207;&#30340;&#28508;&#22312;&#35821;&#21477;&#27844;&#28431;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#35821;&#21477;&#27844;&#28431;&#22238;&#25910;&rdquo;&#22797;&#36873;&#26694;&#21487;&#22312;&#23436;&#25104;&#27844;&#28431;&#35821;&#21477;&#36319;&#36394;&#21518;&#23558;&#27844;&#28431;&#30340;&#35821;&#21477;&#36824;&#21407;&#21040;&#27744;&#20013;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#21019;&#24314;&#37325;&#35797;&#23581;&#35797;&#27425;&#25968;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#21019;&#24314;&#26032;&#30340;&#36830;&#25509;&#22833;&#36133;&#21518;&#36827;&#34892;&#23581;&#35797;&#30340;&#27425;&#25968;&#12290;</p>
<p>&#23558;&#27492;&#20540;&#35774;&#32622;&#20026; 0 &#21363;&#19981;&#20877;&#23581;&#35797;&#21019;&#24314;&#36830;&#25509;&#12290;&#40664;&#35748;&#20540;&#20026; 0&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#37325;&#35797;&#26102;&#38388;&#38388;&#38548;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#20004;&#27425;&#23581;&#35797;&#21019;&#24314;&#36830;&#25509;&#20043;&#38388;&#30340;&#26102;&#38388;&#38388;&#38548; (&#31186;)&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 10&#12290;&#20165;&#24403;&ldquo;&#21019;&#24314;&#37325;&#35797;&#23581;&#35797;&#27425;&#25968;&rdquo;&#30340;&#20540;&#22823;&#20110; 0 &#26102;&#25165;&#20351;&#29992;&#27492;&#23646;&#24615;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#21551;&#29992;&#24310;&#36831;&#20851;&#32852;&rdquo;&#22797;&#36873;&#26694;&#65292;&#20165;&#22312;&#20351;&#29992;&#36830;&#25509;&#26102;&#25165;&#23558;&#29289;&#29702;&#36830;&#25509;&#19982;&#36923;&#36753;&#36830;&#25509;&#20851;&#32852;&#12290;</p>
<p>&#24403;&#23436;&#25104;&#20107;&#21153;&#22788;&#29702;&#24182;&#19988;&#32467;&#26463;&#32452;&#20214;&#26041;&#27861;&#26102;&#65292;&#23545;&#36830;&#25509;&#21462;&#28040;&#20851;&#32852;&#65292;&#36825;&#26377;&#21161;&#20110;&#37325;&#26032;&#20351;&#29992;&#29289;&#29702;&#36830;&#25509;&#12290;&#22914;&#26524;&#31105;&#29992;&#27492;&#36873;&#39033;&#65292;&#21017;&#22312;&#20351;&#29992;&#36830;&#25509;&#20043;&#21069;&#65292;&#29289;&#29702;&#36830;&#25509;&#23601;&#19982;&#36923;&#36753;&#36830;&#25509;&#20851;&#32852;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#21551;&#29992;&#24310;&#36831;&#36830;&#25509;&#30331;&#35760;&rdquo;&#22797;&#36873;&#26694;&#65292;&#20165;&#24403;&#22312;&#26041;&#27861;&#20013;&#23454;&#38469;&#20351;&#29992;&#36164;&#28304;&#26102;&#25165;&#23558;&#36164;&#28304;&#28155;&#21152;&#33267;&#20107;&#21153;&#22788;&#29702;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#21551;&#29992;&#19982;&#32447;&#31243;&#20851;&#32852;&rdquo;&#22797;&#36873;&#26694;&#21487;&#20197;&#22312;&#36830;&#25509;&#21644;&#32447;&#31243;&#20043;&#38388;&#21019;&#24314;&#20851;&#32852;&#12290;</p>
<p>&#22914;&#26524;&#20854;&#20182;&#36830;&#25509;&#38656;&#35201;&#21516;&#19968;&#20010;&#32447;&#31243;&#65292;&#21017;&#27492;&#36873;&#39033;&#23558;&#37325;&#26032;&#20351;&#29992;&#24050;&#19982;&#35813;&#32447;&#31243;&#30456;&#20851;&#32852;&#30340;&#36830;&#25509;&#65292;&#22240;&#27492;&#19981;&#20250;&#23548;&#33268;&#20174;&#27744;&#20013;&#33719;&#21462;&#20854;&#20182;&#36830;&#25509;&#30340;&#24320;&#38144;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#21551;&#29992;&#21305;&#37197;&#36830;&#25509;&rdquo;&#22797;&#36873;&#26694;&#21487;&#20197;&#20026;&#27744;&#21551;&#29992;&#36830;&#25509;&#21305;&#37197;&#12290;</p>
<p>&#22914;&#26524;&#21551;&#29992;&#27492;&#36873;&#39033;&#65292;&#21017;&#20174;&#27744;&#20013;&#36873;&#25321;&#30340;&#36830;&#25509;&#24212;&#19982;&#20855;&#26377;&#29305;&#23450;&#36523;&#20221;&#35777;&#26126;&#30340;&#36830;&#25509;&#30456;&#21305;&#37197;&#12290;&#22914;&#26524;&#36830;&#25509;&#27744;&#30001;&#20855;&#26377;&#22810;&#20010;&#29992;&#25143;&#36523;&#20221;&#35777;&#26126;&#30340;&#24212;&#29992;&#31243;&#24207;&#20351;&#29992;&#65292;&#21017;&#24517;&#39035;&#21551;&#29992;&#27492;&#36873;&#39033;&#12290;&#22914;&#26524;&#31649;&#29702;&#21592;&#30693;&#36947;&#27744;&#20013;&#30340;&#36830;&#25509;&#22987;&#32456;&#21516;&#26500;&#65292;&#22240;&#27492;&#20174;&#27744;&#20013;&#36873;&#25321;&#30340;&#36830;&#25509;&#19981;&#38656;&#35201;&#30001;&#36164;&#28304;&#36866;&#37197;&#22120;&#36827;&#34892;&#21305;&#37197;&#65292;&#21017;&#21487;&#31105;&#29992;&#35813;&#36873;&#39033;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26368;&#22823;&#36830;&#25509;&#20351;&#29992;&#27425;&#25968;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#27744;&#21487;&#20197;&#37325;&#26032;&#20351;&#29992;&#36830;&#25509;&#30340;&#27425;&#25968;&#12290;</p>
<p>&#36830;&#25509;&#22312;&#37325;&#22797;&#20351;&#29992;&#25351;&#23450;&#30340;&#27425;&#25968;&#21518;&#23558;&#34987;&#20851;&#38381;&#12290;&#36890;&#36807;&#38480;&#21046;&#21487;&#20197;&#37325;&#22797;&#20351;&#29992;&#36830;&#25509;&#30340;&#27425;&#25968;&#65292;&#21487;&#22312;&#24212;&#29992;&#31243;&#24207;&#27809;&#26377;&#20851;&#38381;&#35821;&#21477;&#30340;&#24773;&#20917;&#19979;&#36991;&#20813;&#35821;&#21477;&#27844;&#28431;&#12290;&#23558;&#20540;&#35774;&#32622;&#20026; 0 &#21487;&#20197;&#31105;&#29992;&#27492;&#23646;&#24615;&#12290;&#40664;&#35748;&#20540;&#20026; 0&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#38656;&#35201;&#36830;&#25509;&#39564;&#35777;&rdquo;&#22797;&#36873;&#26694;&#65292;&#20197;&#21551;&#29992;&#36830;&#25509;&#39564;&#35777;&#12290;</p>
<p>&#36830;&#25509;&#39564;&#35777;&#20801;&#35768;&#26381;&#21153;&#22120;&#22312;&#20986;&#29616;&#25925;&#38556;&#26102;&#37325;&#26032;&#36830;&#25509;&#12290;</p>
</li>
<li>
<p>&#20174;&ldquo;&#39564;&#35777;&#26041;&#27861;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&#19968;&#31181;&#39564;&#35777;&#26041;&#27861;&#12290;</p>
<p>GlassFish Server &#21487;&#20197;&#36890;&#36807;&#20197;&#19979;&#26041;&#24335;&#39564;&#35777;&#25968;&#25454;&#24211;&#36830;&#25509;&#12290;</p>
<dl>
<dt><code>auto-commit</code> &#21644; <code>metadata</code></dt>
<dd>
<p>GlassFish Server &#36890;&#36807;&#35843;&#29992; <code>con.getAutoCommit</code> &#21644; <code>con.getMetaData</code> &#26041;&#27861;&#26469;&#39564;&#35777;&#36830;&#25509;&#12290;</p>

<hr>
<p><b>&#27880;:</b></p>
&#35768;&#22810; JDBC &#39537;&#21160;&#31243;&#24207;&#37117;&#20250;&#39640;&#36895;&#32531;&#23384;&#36825;&#20123;&#35843;&#29992;&#30340;&#32467;&#26524;&#12290;&#22240;&#27492;&#65292;&#20351;&#29992;&#36825;&#20123;&#35843;&#29992;&#21487;&#33021;&#26080;&#27861;&#22987;&#32456;&#25552;&#20379;&#21487;&#38752;&#30340;&#39564;&#35777;&#12290;&#35831;&#19982;&#39537;&#21160;&#31243;&#24207;&#25552;&#20379;&#26041;&#36827;&#34892;&#26680;&#23454;&#65292;&#20197;&#30830;&#23450;&#36825;&#20123;&#35843;&#29992;&#26159;&#21542;&#34987;&#39640;&#36895;&#32531;&#23384;&#12290;
<hr>

</dd>
<dt><code>custom-validation</code></dt>
<dd>
<p>GlassFish Server &#20351;&#29992;&#30001;&ldquo;&#39564;&#35777;&#31867;&#21517;&rdquo;&#23383;&#27573;&#20013;&#30340;&#23450;&#21046;&#23454;&#29616;&#31867;&#25351;&#23450;&#30340;&#29992;&#25143;&#23450;&#20041;&#39564;&#35777;&#26426;&#21046;&#12290;</p>
</dd>
<dt><code>table</code></dt>
<dd>
<p>&#24212;&#29992;&#31243;&#24207;&#23558;&#26597;&#35810;&#25351;&#23450;&#30340;&#25968;&#25454;&#24211;&#34920;&#12290;&#34920;&#24517;&#39035;&#23384;&#22312;&#24182;&#19988;&#21487;&#20197;&#35775;&#38382;&#65292;&#20294;&#20854;&#20013;&#19981;&#24517;&#21547;&#26377;&#20219;&#20309;&#34892;&#12290;&#35831;&#21247;&#20351;&#29992;&#21253;&#21547;&#35768;&#22810;&#34892;&#30340;&#29616;&#26377;&#34920;&#25110;&#24050;&#34987;&#32463;&#24120;&#35775;&#38382;&#30340;&#34920;&#12290;</p>
</dd>
</dl>
</li>
<li>
<p>&#22914;&#26524;&#22312;&ldquo;&#39564;&#35777;&#26041;&#27861;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#36873;&#25321;&#20102; <code>table</code>&#65292;&#35831;&#38190;&#20837;&#25968;&#25454;&#24211;&#34920;&#30340;&#21517;&#31216;&#25110;&#20174;&ldquo;&#34920;&#21517;&#31216;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#36873;&#25321;&#35813;&#21517;&#31216;&#12290;</p>
</li>
<li>
<p>&#22914;&#26524;&#22312;&ldquo;&#39564;&#35777;&#26041;&#27861;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#36873;&#25321;&#20102; <code>custom-validation</code>&#65292;&#35831;&#38190;&#20837;&#23450;&#21046;&#39564;&#35777;&#23454;&#29616;&#31867;&#21517;&#25110;&#20174;&ldquo;&#39564;&#35777;&#31867;&#21517;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#36873;&#25321;&#35813;&#21517;&#31216;&#12290;</p>
<p>&#25552;&#20379;&#30340;&#31867;&#21517;&#24517;&#39035;&#21487;&#20379; GlassFish Server &#35775;&#38382;&#12290;&#25351;&#23450;&#31867;&#24517;&#39035;&#23454;&#29616; <code>org.glassfish.api.jdbc.ConnectionValidation</code> &#25509;&#21475;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#19968;&#26086;&#22833;&#36133;&#21017;&#20851;&#38381;&#25152;&#26377;&#36830;&#25509;&rdquo;&#22797;&#36873;&#26694;&#65292;&#21487;&#20197;&#20351;&#26381;&#21153;&#22120;&#22312;&#26576;&#20010;&#36830;&#25509;&#22833;&#36133;&#26102;&#20851;&#38381;&#27744;&#20013;&#30340;&#25152;&#26377;&#36830;&#25509;&#24182;&#37325;&#26032;&#24314;&#31435;&#36825;&#20123;&#36830;&#25509;&#12290;</p>
<p>&#22914;&#26524;&#31105;&#29992;&#27492;&#36873;&#39033;&#65292;&#21017;&#20165;&#22312;&#20351;&#29992;&#21508;&#20010;&#36830;&#25509;&#26102;&#25165;&#37325;&#26032;&#24314;&#31435;&#36825;&#20123;&#36830;&#25509;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#21551;&#29992;&#20801;&#35768;&#38750;&#32452;&#20214;&#35843;&#29992;&#26041;&rdquo;&#22797;&#36873;&#26694;&#65292;&#20197;&#20415;&#27744;&#21487;&#30001;&#38750;&#32452;&#20214;&#35843;&#29992;&#26041; (&#20363;&#22914; Servlet &#36807;&#28388;&#22120;&#21644;&#31532;&#19977;&#26041;&#25345;&#20037;&#24615;&#31649;&#29702;&#22120;) &#20351;&#29992;&#12290;</p>
<p>&#22312;&#20107;&#21153;&#22788;&#29702;&#32467;&#26463;&#26102;&#65292;&#23481;&#22120;&#19981;&#20250;&#33258;&#21160;&#20851;&#38381;&#38750;&#32452;&#20214;&#35843;&#29992;&#26041;&#33719;&#21462;&#30340;&#36830;&#25509;&#12290;&#36825;&#20123;&#36830;&#25509;&#24517;&#39035;&#30001;&#35843;&#29992;&#26041;&#26174;&#24335;&#20851;&#38381;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#21333;&#20987;&ldquo;&#24120;&#35268;&rdquo;&#36873;&#39033;&#21345;&#19978;&#30340;&ldquo;&#21047;&#26032;&rdquo;&#25353;&#38062;&#65292;&#21047;&#26032;&#35813;&#27744;&#30340;&#25152;&#26377;&#36830;&#25509;&#12290;</p>
<p>&#21333;&#20987;&ldquo;&#21047;&#26032;&rdquo;&#25353;&#38062;&#21487;&#20197;&#38144;&#27585;&#20219;&#20309;&#29616;&#26377;&#36830;&#25509;&#65292;&#37325;&#26032;&#21019;&#24314;&#20026;&#27744;&#24314;&#31435;&#30340;&#36830;&#25509;&#65292;&#24182;&#23558;&#27744;&#36824;&#21407;&#21040;&#20854;&#21021;&#22987;&#21644;&#26368;&#23567;&#27744;&#22823;&#23567;&#12290;</p>
</li>
<li>
<p>&#21333;&#20987;&ldquo;&#20445;&#23384;&rdquo;&#12290;</p>

<hr>
<p><b>&#25552;&#31034;:</b></p>
&#35201;&#36820;&#22238;&#21040;&#40664;&#35748;&#35774;&#32622;&#65292;&#35831;&#21333;&#20987;&ldquo;&#21152;&#36733;&#40664;&#35748;&#20540;&rdquo;&#25353;&#38062;&#65292;&#28982;&#21518;&#21333;&#20987;&ldquo;&#20445;&#23384;&rdquo;&#12290;<br />
<hr>

</li>
</ol>
<a id="sthref19" name="sthref19"></a>
<h5>&#21478;&#35831;&#21442;&#38405;</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">&#35774;&#32622;&#25968;&#25454;&#24211;&#35775;&#38382;</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">&#38598;&#25104; JDBC &#39537;&#21160;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcenew.html">&#21019;&#24314; JDBC &#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesedit.html">&#32534;&#36753; JDBC &#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcetargets.html">&#32534;&#36753; JDBC &#36164;&#28304;&#30446;&#26631;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesdelete.html">&#21024;&#38500; JDBC &#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">&#21019;&#24314; JDBC &#36830;&#25509;&#27744;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">&#32534;&#36753; JDBC &#36830;&#25509;&#27744;&#24120;&#35268;&#35774;&#32622;</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">&#39564;&#35777;&#36830;&#25509;&#27744;&#35774;&#32622;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">&#32534;&#36753; JDBC &#36830;&#25509;&#27744;&#23646;&#24615;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">&#21024;&#38500; JDBC &#36830;&#25509;&#27744;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
