<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jdbcconnectionpooledit" name="task-jdbcconnectionpooledit"></a></p>

<h4><a id="sthref16" name="sthref16"></a>&#32534;&#36753; JDBC &#36830;&#25509;&#27744;&#24120;&#35268;&#35774;&#32622;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#23548;&#33322;&#26641;&#20013;&#65292;&#23637;&#24320;&ldquo;&#36164;&#28304;&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#36164;&#28304;&rdquo;&#33410;&#28857;&#19979;&#65292;&#23637;&#24320;&ldquo;JDBC&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;JDBC&rdquo;&#33410;&#28857;&#19979;&#65292;&#36873;&#25321;&ldquo;&#36830;&#25509;&#27744;&rdquo;&#33410;&#28857;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#36830;&#25509;&#27744;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#21333;&#20987;&#24744;&#35201;&#32534;&#36753;&#30340;&#36830;&#25509;&#27744;&#30340;&#21517;&#31216;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#32534;&#36753;&#36830;&#25509;&#27744;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#20174;&ldquo;&#36164;&#28304;&#31867;&#22411;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&#19968;&#31181;&#36164;&#28304;&#31867;&#22411;&#12290;</p>
<p>&#36873;&#39033;&#21253;&#25324; <code>javax.sql.DataSource</code> (&#20165;&#26412;&#22320;&#20107;&#21153;&#22788;&#29702;)&#12289;<code>javax.sql.XADataSource</code> (&#20840;&#23616;&#20107;&#21153;&#22788;&#29702;) &#21644; <code>java.sql.ConnectionPoolDataSource</code> (&#26412;&#22320;&#20107;&#21153;&#22788;&#29702;&#65292;&#24615;&#33021;&#21487;&#33021;&#20250;&#25552;&#39640;)&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#25968;&#25454;&#28304;&#31867;&#21517;&#31216;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#23454;&#29616; <code>DataSource</code>&#12289;<code>ConnectionPoolDataSource</code> &#25110; <code>XADataSource</code> API &#30340;&#29305;&#23450;&#20110;&#25552;&#20379;&#26041;&#30340;&#31867;&#21517;&#31216;&#12290;</p>
<p>&#22914;&#26524;&#36873;&#25321;&#20102;&#19968;&#31181;&#25968;&#25454;&#28304;&#36164;&#28304;&#31867;&#22411;&#65292;&#21017;&#27492;&#23383;&#27573;&#36890;&#24120;&#20250;&#33258;&#21160;&#22635;&#20805;&#19982;&#24744;&#36873;&#25321;&#30340;&#36164;&#28304;&#31867;&#22411;&#21644;&#25968;&#25454;&#24211;&#20379;&#24212;&#21830;&#20851;&#32852;&#30340;&#31867;&#21517;&#12290;&#22914;&#26524;&#36873;&#25321;&#20102; <code>java.sql.Driver</code> &#36164;&#28304;&#31867;&#22411;&#65292;&#21017;&#27492;&#23383;&#27573;&#23558;&#34987;&#31105;&#29992;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#39537;&#21160;&#31243;&#24207;&#31867;&#21517;&#31216;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#23454;&#29616; <code>java.sql.Driver</code> API &#30340;&#29305;&#23450;&#20110;&#25552;&#20379;&#26041;&#30340;&#31867;&#21517;&#31216;&#12290;</p>
<p>&#22914;&#26524;&#36873;&#25321;&#20102; <code>java.sql.Driver</code> &#36164;&#28304;&#31867;&#22411;&#65292;&#21017;&#36890;&#24120;&#20250;&#20351;&#29992;&#19982;&#24744;&#36873;&#25321;&#30340;&#39537;&#21160;&#31243;&#24207;&#21644;&#25968;&#25454;&#24211;&#20379;&#24212;&#21830;&#20851;&#32852;&#30340;&#31867;&#21517;&#33258;&#21160;&#22635;&#20805;&#27492;&#23383;&#27573;&#12290;&#22914;&#26524;&#36873;&#25321;&#20102;&#19968;&#31181;&#25968;&#25454;&#28304;&#36164;&#28304;&#31867;&#22411;&#65292;&#21017;&#27492;&#23383;&#27573;&#23558;&#34987;&#31105;&#29992;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#21551;&#29992;&#35797;&#36890;&rdquo;&#22797;&#36873;&#26694;&#65292;&#22312;&#27744;&#21019;&#24314;&#25110;&#37325;&#26032;&#37197;&#32622;&#36807;&#31243;&#20013;&#33258;&#21160;&#23545;&#27744;&#36827;&#34892;&#35797;&#36890;&#25805;&#20316;&#65292;&#20197;&#35782;&#21035;&#20219;&#20309;&#38169;&#35823;&#23646;&#24615;&#20540;&#24182;&#21457;&#20986;&#35686;&#21578;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#35828;&#26126;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#36830;&#25509;&#27744;&#30340;&#31616;&#30701;&#35828;&#26126;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#21021;&#22987;&#21644;&#26368;&#23567;&#27744;&#22823;&#23567;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#27492;&#27744;&#30340;&#26368;&#23567;&#36830;&#25509;&#25968;&#12290;</p>
<p>&#35813;&#20540;&#36824;&#30830;&#23450;&#20102;&#39318;&#27425;&#21019;&#24314;&#27744;&#25110; GlassFish Server &#21551;&#21160;&#26102;&#65292;&#32622;&#20110;&#27744;&#20013;&#30340;&#36830;&#25509;&#30340;&#25968;&#37327;&#12290;&#40664;&#35748;&#20540;&#20026; 8&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26368;&#22823;&#27744;&#22823;&#23567;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#27492;&#27744;&#30340;&#26368;&#22823;&#36830;&#25509;&#25968;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 32&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#27744;&#35843;&#25972;&#22823;&#23567;&#25968;&#37327;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#27599;&#20010;&#27744;&#22823;&#23567;&#35843;&#25972;&#25209;&#22788;&#29702;&#20013;&#30340;&#36830;&#25509;&#25968;&#12290;</p>
<p>&#24403;&#27744;&#26681;&#25454;&#26368;&#22823;&#21644;&#26368;&#23567;&#27744;&#22823;&#23567;&#36827;&#34892;&#30456;&#24212;&#25193;&#22823;&#25110;&#32553;&#23567;&#26102;&#65292;&#23558;&#20197;&#25209;&#22788;&#29702;&#26041;&#24335;&#35843;&#25972;&#20854;&#22823;&#23567;&#12290;&#27492;&#20540;&#30830;&#23450;&#25209;&#22788;&#29702;&#20013;&#30340;&#36830;&#25509;&#25968;&#37327;&#12290;&#22914;&#26524;&#23558;&#35813;&#20540;&#35774;&#32622;&#24471;&#36807;&#22823;&#65292;&#21017;&#20250;&#24310;&#36831;&#36830;&#25509;&#21019;&#24314;&#21644;&#22238;&#25910;&#65307;&#22914;&#26524;&#23558;&#35813;&#20540;&#35774;&#32622;&#24471;&#36807;&#23567;&#65292;&#21017;&#20250;&#38477;&#20302;&#25928;&#29575;&#12290;&#40664;&#35748;&#20540;&#20026; 2&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#31354;&#38386;&#36229;&#26102;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#36830;&#25509;&#21487;&#22312;&#27744;&#20013;&#20445;&#25345;&#31354;&#38386;&#30340;&#26368;&#38271;&#26102;&#38388; (&#31186;)&#12290;</p>
<p>&#19968;&#26086;&#36229;&#36807;&#27492;&#26102;&#38388;&#65292;&#21363;&#20174;&#27744;&#20013;&#21024;&#38500;&#35813;&#36830;&#25509;&#12290;&#40664;&#35748;&#20540;&#20026; 300&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26368;&#38271;&#31561;&#24453;&#26102;&#38388;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#35831;&#27714;&#36830;&#25509;&#30340;&#24212;&#29992;&#31243;&#24207;&#22312;&#36830;&#25509;&#36229;&#26102;&#20043;&#21069;&#31561;&#24453;&#30340;&#26368;&#38271;&#26102;&#38388; (&#27627;&#31186;)&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 60,000&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#21551;&#29992;&#38750;&#20107;&#21153;&#22788;&#29702;&#36830;&#25509;&rdquo;&#22797;&#36873;&#26694;&#65292;&#20197;&#36820;&#22238;&#38750;&#20107;&#21153;&#22788;&#29702;&#36830;&#25509;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#20174;&#19979;&#25289;&#21015;&#34920;&#20013;&#36873;&#25321;&#36830;&#25509;&#27744;&#30340;&#20107;&#21153;&#22788;&#29702;&#38548;&#31163;&#32423;&#21035;&#12290;</p>
<p>&#22914;&#26524;&#19981;&#25351;&#23450;&#27492;&#21442;&#25968;&#65292;&#36830;&#25509;&#23558;&#20351;&#29992; JDBC &#39537;&#21160;&#31243;&#24207;&#25552;&#20379;&#30340;&#40664;&#35748;&#38548;&#31163;&#32423;&#21035;&#36827;&#34892;&#25805;&#20316;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#26410;&#25351;&#23450;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#20445;&#35777;&#38548;&#31163;&#32423;&#21035;&rdquo;&#22797;&#36873;&#26694;&#65292;&#20197;&#20415;&#20174;&#27744;&#20013;&#33719;&#21462;&#30340;&#25152;&#26377;&#36830;&#25509;&#37117;&#20855;&#26377;&#30456;&#21516;&#30340;&#38548;&#31163;&#32423;&#21035;&#12290;</p>
<p>&#20363;&#22914;&#65292;&#22914;&#26524;&#19978;&#27425;&#20351;&#29992;&#36830;&#25509;&#26102;&#36890;&#36807;&#32534;&#31243;&#26041;&#24335; (&#20351;&#29992; <code>con.setTransactionIsolation</code>) &#26356;&#25913;&#20102;&#36830;&#25509;&#30340;&#38548;&#31163;&#32423;&#21035;&#65292;&#27492;&#26426;&#21046;&#20250;&#23558;&#29366;&#24577;&#26356;&#25913;&#22238;&#25351;&#23450;&#30340;&#38548;&#31163;&#32423;&#21035;&#12290;</p>
<p>&#20165;&#24403;&#24050;&#25351;&#23450;&#20107;&#21153;&#22788;&#29702;&#38548;&#31163;&#32423;&#21035;&#26102;&#65292;&#27492;&#35774;&#32622;&#25165;&#36866;&#29992;&#12290;</p>
</li>
<li>
<p>&#21333;&#20987;&ldquo;&#35797;&#36890;&rdquo;&#25353;&#38062;&#65292;&#39564;&#35777;&#25968;&#25454;&#24211;&#36830;&#25509;&#12290;</p>
<p>&#31649;&#29702;&#25511;&#21046;&#21488;&#23558;&#23581;&#35797;&#36830;&#25509;&#21040;&#25968;&#25454;&#24211;&#12290;&#22914;&#26524;&#20986;&#29616;&#38169;&#35823;&#28040;&#24687;&#65292;&#35831;&#26816;&#26597;&#25968;&#25454;&#24211;&#26381;&#21153;&#22120;&#26159;&#21542;&#24050;&#21551;&#21160;&#12290;</p>
</li>
<li>
<p>&#21333;&#20987;&ldquo;&#21047;&#26032;&rdquo;&#25353;&#38062;&#65292;&#23558;&#36830;&#25509;&#27744;&#37325;&#32622;&#20026;&#21021;&#22987;&#29366;&#24577;&#12290;</p>
<p>&#23558;&#38144;&#27585;&#25152;&#26377;&#29616;&#26377;&#27963;&#21160;&#36830;&#25509;&#65292;&#36825;&#24847;&#21619;&#30528;&#19982;&#36825;&#20123;&#36830;&#25509;&#30456;&#20851;&#32852;&#30340;&#20107;&#21153;&#22788;&#29702;&#37117;&#23558;&#20002;&#22833;&#12290;&#35813;&#23376;&#21629;&#20196;&#38543;&#21518;&#23558;&#37325;&#26032;&#21019;&#24314;&#35813;&#27744;&#30340;&#21021;&#22987;&#36830;&#25509;&#65292;&#24182;&#23558;&#35813;&#27744;&#36824;&#21407;&#21040;&#20854;&#31283;&#23450;&#27744;&#22823;&#23567;&#12290;</p>
</li>
<li>
<p>&#21333;&#20987;&ldquo;&#20445;&#23384;&rdquo;&#12290;</p>

<hr>
<p><b>&#25552;&#31034;:</b></p>
&#35201;&#36820;&#22238;&#21040;&#40664;&#35748;&#35774;&#32622;&#65292;&#35831;&#21333;&#20987;&ldquo;&#21152;&#36733;&#40664;&#35748;&#20540;&rdquo;&#25353;&#38062;&#65292;&#28982;&#21518;&#21333;&#20987;&ldquo;&#20445;&#23384;&rdquo;&#12290;<br />
<hr>

</li>
</ol>
<a id="sthref17" name="sthref17"></a>
<h5>&#21478;&#35831;&#21442;&#38405;</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">&#35774;&#32622;&#25968;&#25454;&#24211;&#35775;&#38382;</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">&#38598;&#25104; JDBC &#39537;&#21160;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcenew.html">&#21019;&#24314; JDBC &#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesedit.html">&#32534;&#36753; JDBC &#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcetargets.html">&#32534;&#36753; JDBC &#36164;&#28304;&#30446;&#26631;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesdelete.html">&#21024;&#38500; JDBC &#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">&#21019;&#24314; JDBC &#36830;&#25509;&#27744;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">&#32534;&#36753; JDBC &#36830;&#25509;&#27744;&#39640;&#32423;&#23646;&#24615;</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">&#39564;&#35777;&#36830;&#25509;&#27744;&#35774;&#32622;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">&#32534;&#36753; JDBC &#36830;&#25509;&#27744;&#23646;&#24615;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">&#21024;&#38500; JDBC &#36830;&#25509;&#27744;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
