<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jdbcconnectionpoolnew" name="task-jdbcconnectionpoolnew"></a></p>

<h4>&#21019;&#24314; JDBC &#36830;&#25509;&#27744;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&#31649;&#29702;&#25511;&#21046;&#21488;&#21019;&#24314;&#36830;&#25509;&#27744;&#26102;&#65292;&#24744;&#26159;&#22312;&#23450;&#20041;&#19982;&#29305;&#23450;&#25968;&#25454;&#24211;&#30340;&#36830;&#25509;&#30340;&#21508;&#20010;&#26041;&#38754;&#12290;</p>
<a id="sthref14" name="sthref14"></a>
<h5>&#24320;&#22987;&#20043;&#21069;</h5>
<p>&#35201;&#21019;&#24314;&#36830;&#25509;&#27744;&#65292;&#24517;&#39035;&#20808;&#23433;&#35013;&#21644;&#38598;&#25104;&#19968;&#20010;&#25903;&#25345; JDBC API &#30340;&#39537;&#21160;&#31243;&#24207; (JDBC &#39537;&#21160;&#31243;&#24207;)&#12290;&#35831;&#21442;&#38405;<a href="task-integratejdbcdriver.html">&#38598;&#25104; JDBC &#39537;&#21160;&#31243;&#24207;</a>&#12290;</p>
<p>&#20197;&#19979;&#20449;&#24687;&#26159;&#21019;&#24314; JDBC &#36830;&#25509;&#27744;&#25152;&#24517;&#38656;&#30340;&#12290;&#35831;&#20808;&#25910;&#38598;&#36825;&#20123;&#20449;&#24687;&#65292;&#28982;&#21518;&#20877;&#32487;&#32493;&#65306;</p>
<ul>
<li>
<p>&#25968;&#25454;&#24211;&#39537;&#21160;&#31243;&#24207;&#20379;&#24212;&#21830;&#21517;&#31216;</p>
</li>
<li>
<p>&#36164;&#28304;&#31867;&#22411;&#65292;&#22914; <code>javax.sql.DataSource</code> (&#20165;&#26412;&#22320;&#20107;&#21153;&#22788;&#29702;)&#12289;<code>java.sql.ConnectionPoolDataSource</code> (&#26412;&#22320;&#20107;&#21153;&#22788;&#29702;&#65292;&#24615;&#33021;&#21487;&#33021;&#20250;&#25552;&#39640;)&#12289;<code>javax.sql.XADataSource</code> (&#20840;&#23616;&#20107;&#21153;&#22788;&#29702;) &#21644; <code>java.sql.Driver</code></p>
</li>
<li>
<p>&#25968;&#25454;&#28304;&#31867;&#21517;&#31216;</p>
</li>
<li>
<p>&#24517;&#38656;&#30340;&#23646;&#24615;&#65292;&#22914;&#25968;&#25454;&#24211;&#21517;&#31216; (URL)&#12289;&#29992;&#25143;&#21517;&#21644;&#21475;&#20196;</p>
</li>
</ul>
<ol>
<li>
<p>&#22312;&#23548;&#33322;&#26641;&#20013;&#65292;&#36873;&#25321;&ldquo;&#24120;&#35265;&#20219;&#21153;&rdquo;&#33410;&#28857;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#24120;&#35265;&#20219;&#21153;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#24120;&#35265;&#20219;&#21153;&rdquo;&#39029;&#19978;&#65292;&#21333;&#20987;&ldquo;&#21019;&#24314;&#26032; JDBC &#36830;&#25509;&#27744;&rdquo;&#25353;&#38062;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#26032;&#24314; JDBC &#36830;&#25509;&#27744; (&#31532; 1 &#27493;&#65292;&#20849; 2 &#27493;)&rdquo;&#39029;&#12290;</p>

<hr>
<p><b>&#27880;:</b></p>
&#24744;&#36824;&#21487;&#20197;&#36890;&#36807;&#20197;&#19979;&#26041;&#27861;&#35775;&#38382;&ldquo;&#26032;&#24314; JDBC &#36830;&#25509;&#27744;&rdquo;&#39029;&#65306;&#23637;&#24320;&ldquo;&#36164;&#28304;&rdquo;&#33410;&#28857;&#21644;&ldquo;JDBC&rdquo;&#33410;&#28857;&#65292;&#28982;&#21518;&#36873;&#25321;&ldquo;&#36830;&#25509;&#27744;&rdquo;&#33410;&#28857;&#12290;&#28982;&#21518;&#65292;&#20174;&ldquo;&#36830;&#25509;&#27744;&rdquo;&#39029;&#20013;&#65292;&#21333;&#20987;&ldquo;&#26032;&#24314;&rdquo;&#26469;&#21019;&#24314;&#26032;&#30340;&#36830;&#25509;&#27744;&#12290;
<hr>

</li>
<li>
<p>&#22312;&ldquo;&#27744;&#21517;&#31216;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#26032;&#36830;&#25509;&#27744;&#30340;&#21517;&#31216;&#12290;</p>
<p>&#36825;&#26159;&#24517;&#38656;&#23383;&#27573;&#12290;</p>
</li>
<li>
<p>&#20174;&ldquo;&#36164;&#28304;&#31867;&#22411;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&#19968;&#31181;&#36164;&#28304;&#31867;&#22411;&#12290;</p>
<p>&#36873;&#39033;&#21253;&#25324; <code>javax.sql.XADataSource</code> (&#20840;&#23616;&#20107;&#21153;&#22788;&#29702;)&#12289;<code>java.sql.ConnectionPoolDataSource</code> (&#26412;&#22320;&#20107;&#21153;&#22788;&#29702;&#65292;&#24615;&#33021;&#21487;&#33021;&#20250;&#25552;&#39640;)&#12289;<code>javax.sql.DataSource</code> (&#20165;&#26412;&#22320;&#20107;&#21153;&#22788;&#29702;) &#21644; <code>java.sql.Driver</code>&#12290;</p>
</li>
<li>
<p>&#25351;&#23450;&#25968;&#25454;&#24211;&#20379;&#24212;&#21830;&#65306;</p>
<ol type="a">
<li>
<p>&#20174;&ldquo;&#25968;&#25454;&#24211;&#39537;&#21160;&#31243;&#24207;&#20379;&#24212;&#21830;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&#25968;&#25454;&#24211;&#20379;&#24212;&#21830;&#12290;</p>
</li>
<li>
<p>&#22914;&#26524;&#25968;&#25454;&#24211;&#20379;&#24212;&#21830;&#27809;&#26377;&#20986;&#29616;&#22312;&#21015;&#34920;&#20013;&#65292;&#35831;&#22312;&ldquo;&#25968;&#25454;&#24211;&#39537;&#21160;&#31243;&#24207;&#20379;&#24212;&#21830;&rdquo;&#25991;&#26412;&#23383;&#27573;&#20013;&#38190;&#20837;&#25552;&#20379;&#26041;&#30340;&#21517;&#31216;&#12290;</p>
</li>
</ol>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#24050;&#21551;&#29992;&#33258;&#27979;&rdquo;&#22797;&#36873;&#26694;&#21487;&#26681;&#25454;&ldquo;&#36164;&#28304;&#31867;&#22411;&rdquo;&#21644;&ldquo;&#25968;&#25454;&#24211;&#39537;&#21160;&#31243;&#24207;&#20379;&#24212;&#21830;&rdquo;&#23545;&#25968;&#25454;&#24211;&#39537;&#21160;&#31243;&#24207;&#36827;&#34892;&#33258;&#27979;&#12290;</p>
<p>&#20026;&#20102;&#20351;&#33258;&#27979;&#27491;&#24120;&#24037;&#20316;&#65292;&#24517;&#39035;&#20026; GlassFish Server &#25552;&#20379; JDBC &#39537;&#21160;&#31243;&#24207;&#12290;&#35831;&#21442;&#38405;<a href="task-integratejdbcdriver.html">&#38598;&#25104; JDBC &#39537;&#21160;&#31243;&#24207;</a>&#12290;</p>
</li>
<li>
<p>&#21333;&#20987;&ldquo;&#19979;&#19968;&#27493;&rdquo;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#26032;&#24314; JDBC &#36830;&#25509;&#27744; (&#31532; 2 &#27493;&#65292;&#20849; 2 &#27493;)&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#25968;&#25454;&#28304;&#31867;&#21517;&#31216;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#23454;&#29616; <code>DataSource</code>&#12289;<code>ConnectionPoolDataSource</code> &#25110; <code>XADataSource</code> API &#30340;&#29305;&#23450;&#20110;&#25552;&#20379;&#26041;&#30340;&#31867;&#21517;&#31216;&#12290;</p>
<p>&#22914;&#26524;&#36873;&#25321;&#20102;&ldquo;&#24050;&#21551;&#29992;&#33258;&#27979;&rdquo;&#21644;&#19968;&#31181;&#25968;&#25454;&#28304;&#36164;&#28304;&#31867;&#22411;&#65292;&#21017;&#27492;&#23383;&#27573;&#20250;&#33258;&#21160;&#22635;&#20805;&#19982;&#24744;&#36873;&#25321;&#30340;&#36164;&#28304;&#31867;&#22411;&#21644;&#25968;&#25454;&#24211;&#20379;&#24212;&#21830;&#20851;&#32852;&#30340;&#31867;&#21517;&#12290;&#22914;&#26524;&#36873;&#25321;&#20102; <code>java.sql.Driver</code> &#36164;&#28304;&#31867;&#22411;&#65292;&#21017;&#27492;&#23383;&#27573;&#23558;&#34987;&#31105;&#29992;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#39537;&#21160;&#31243;&#24207;&#31867;&#21517;&#31216;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#23454;&#29616; <code>java.sql.Driver</code> API &#30340;&#29305;&#23450;&#20110;&#25552;&#20379;&#26041;&#30340;&#31867;&#21517;&#31216;&#12290;</p>
<p>&#22914;&#26524;&#36873;&#25321;&#20102;&ldquo;&#24050;&#21551;&#29992;&#33258;&#27979;&rdquo;&#25110; <code>java.sql.Driver</code> &#36164;&#28304;&#31867;&#22411;&#65292;&#21017;&#27492;&#23383;&#27573;&#20250;&#33258;&#21160;&#22635;&#20805;&#19982;&#24744;&#36873;&#25321;&#30340;&#39537;&#21160;&#31243;&#24207;&#21644;&#25968;&#25454;&#24211;&#20379;&#24212;&#21830;&#20851;&#32852;&#30340;&#31867;&#21517;&#12290;&#22914;&#26524;&#36873;&#25321;&#20102;&#19968;&#31181;&#25968;&#25454;&#28304;&#36164;&#28304;&#31867;&#22411;&#65292;&#21017;&#27492;&#23383;&#27573;&#23558;&#34987;&#31105;&#29992;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#21551;&#29992;&#35797;&#36890;&rdquo;&#22797;&#36873;&#26694;&#65292;&#22312;&#27744;&#21019;&#24314;&#25110;&#37325;&#26032;&#37197;&#32622;&#36807;&#31243;&#20013;&#33258;&#21160;&#23545;&#27744;&#36827;&#34892;&#35797;&#36890;&#25805;&#20316;&#65292;&#20197;&#35782;&#21035;&#20219;&#20309;&#38169;&#35823;&#23646;&#24615;&#20540;&#24182;&#21457;&#20986;&#35686;&#21578;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#35828;&#26126;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#36830;&#25509;&#27744;&#30340;&#31616;&#30701;&#35828;&#26126;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#21021;&#22987;&#21644;&#26368;&#23567;&#27744;&#22823;&#23567;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#27492;&#27744;&#30340;&#26368;&#23567;&#36830;&#25509;&#25968;&#12290;</p>
<p>&#35813;&#20540;&#36824;&#30830;&#23450;&#20102;&#39318;&#27425;&#21019;&#24314;&#27744;&#25110; GlassFish Server &#21551;&#21160;&#26102;&#65292;&#32622;&#20110;&#27744;&#20013;&#30340;&#36830;&#25509;&#30340;&#25968;&#37327;&#12290;&#40664;&#35748;&#20540;&#20026; 8&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26368;&#22823;&#27744;&#22823;&#23567;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#27492;&#27744;&#30340;&#26368;&#22823;&#36830;&#25509;&#25968;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 32&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#27744;&#35843;&#25972;&#22823;&#23567;&#25968;&#37327;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#27599;&#20010;&#27744;&#22823;&#23567;&#35843;&#25972;&#25209;&#22788;&#29702;&#20013;&#30340;&#36830;&#25509;&#25968;&#12290;</p>
<p>&#24403;&#27744;&#26681;&#25454;&#26368;&#22823;&#21644;&#26368;&#23567;&#27744;&#22823;&#23567;&#36827;&#34892;&#30456;&#24212;&#25193;&#22823;&#25110;&#32553;&#23567;&#26102;&#65292;&#23558;&#20197;&#25209;&#22788;&#29702;&#26041;&#24335;&#35843;&#25972;&#20854;&#22823;&#23567;&#12290;&#27492;&#20540;&#30830;&#23450;&#25209;&#22788;&#29702;&#20013;&#30340;&#36830;&#25509;&#25968;&#37327;&#12290;&#22914;&#26524;&#23558;&#35813;&#20540;&#35774;&#32622;&#24471;&#36807;&#22823;&#65292;&#21017;&#20250;&#24310;&#36831;&#36830;&#25509;&#21019;&#24314;&#21644;&#22238;&#25910;&#65307;&#22914;&#26524;&#23558;&#35813;&#20540;&#35774;&#32622;&#24471;&#36807;&#23567;&#65292;&#21017;&#20250;&#38477;&#20302;&#25928;&#29575;&#12290;&#40664;&#35748;&#20540;&#20026; 2&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#31354;&#38386;&#36229;&#26102;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#36830;&#25509;&#21487;&#22312;&#27744;&#20013;&#20445;&#25345;&#31354;&#38386;&#29366;&#24577;&#30340;&#26368;&#38271;&#26102;&#38388; (&#31186;)&#12290;</p>
<p>&#19968;&#26086;&#36229;&#36807;&#27492;&#26102;&#38388;&#65292;&#21363;&#20174;&#27744;&#20013;&#21024;&#38500;&#35813;&#36830;&#25509;&#12290;&#40664;&#35748;&#20540;&#20026; 300&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26368;&#38271;&#31561;&#24453;&#26102;&#38388;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#35831;&#27714;&#36830;&#25509;&#30340;&#24212;&#29992;&#31243;&#24207;&#22312;&#36830;&#25509;&#36229;&#26102;&#20043;&#21069;&#31561;&#24453;&#30340;&#26368;&#38271;&#26102;&#38388; (&#27627;&#31186;)&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 60,000&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#21551;&#29992;&#38750;&#20107;&#21153;&#22788;&#29702;&#36830;&#25509;&rdquo;&#22797;&#36873;&#26694;&#65292;&#20197;&#36820;&#22238;&#38750;&#20107;&#21153;&#22788;&#29702;&#36830;&#25509;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#20174;&ldquo;&#20107;&#21153;&#22788;&#29702;&#38548;&#31163;&#32423;&#21035;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&#27492;&#36830;&#25509;&#27744;&#30340;&#20107;&#21153;&#22788;&#29702;&#38548;&#31163;&#32423;&#21035;&#12290;</p>
<p>&#22914;&#26524;&#19981;&#25351;&#23450;&#27492;&#21442;&#25968;&#65292;&#36830;&#25509;&#23558;&#20351;&#29992; JDBC &#39537;&#21160;&#31243;&#24207;&#25552;&#20379;&#30340;&#40664;&#35748;&#38548;&#31163;&#32423;&#21035;&#36827;&#34892;&#25805;&#20316;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#26410;&#25351;&#23450;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#20445;&#35777;&#38548;&#31163;&#32423;&#21035;&rdquo;&#22797;&#36873;&#26694;&#65292;&#30830;&#20445;&#20174;&#27744;&#20013;&#33719;&#21462;&#30340;&#25152;&#26377;&#36830;&#25509;&#37117;&#20855;&#26377;&#30456;&#21516;&#30340;&#38548;&#31163;&#32423;&#21035;&#12290;</p>
<p>&#20363;&#22914;&#65292;&#22914;&#26524;&#19978;&#27425;&#20351;&#29992;&#36830;&#25509;&#26102;&#36890;&#36807;&#32534;&#31243;&#26041;&#24335; (&#20351;&#29992; <code>con.setTransactionIsolation</code>) &#26356;&#25913;&#20102;&#36830;&#25509;&#30340;&#38548;&#31163;&#32423;&#21035;&#65292;&#27492;&#26426;&#21046;&#20250;&#23558;&#29366;&#24577;&#26356;&#25913;&#22238;&#25351;&#23450;&#30340;&#38548;&#31163;&#32423;&#21035;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#21551;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
<p>&#20165;&#24403;&#24050;&#25351;&#23450;&#20107;&#21153;&#22788;&#29702;&#38548;&#31163;&#32423;&#21035;&#26102;&#65292;&#27492;&#35774;&#32622;&#25165;&#36866;&#29992;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#20854;&#20182;&#23646;&#24615;&rdquo;&#37096;&#20998;&#20013;&#65292;&#25351;&#23450;&#20854;&#20182;&#23646;&#24615;&#12290;</p>
<p>&#24517;&#38656;&#23646;&#24615;&#30340;&#31034;&#20363;&#21253;&#25324;&#25968;&#25454;&#24211;&#21517;&#31216; (URL)&#12289;&#29992;&#25143;&#21517;&#21644;&#21475;&#20196;&#12290;&#35813;&#34920;&#36890;&#24120;&#21253;&#21547;&#25968;&#25454;&#24211;&#20379;&#24212;&#21830;&#20351;&#29992;&#30340;&#23646;&#24615;&#12290;&#26377;&#20851;&#26576;&#20123;&#21487;&#29992;&#23646;&#24615;&#30340;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405;<a href="ref-jdbc-properties.html">&#29305;&#23450;&#20110; JDBC &#36830;&#25509;&#27744;&#30340;&#23646;&#24615;</a>&#12290;</p>
<p>&#22914;&#26524;&#24744;&#19981;&#25351;&#23450;&#26576;&#20010;&#23646;&#24615;&#30340;&#20540;&#65292;&#21017;&#22312;&#21019;&#24314;&#23436;&#36830;&#25509;&#27744;&#26102;&#65292;&#35813;&#23646;&#24615;&#23558;&#20174;&#34920;&#20013;&#21024;&#38500;&#12290;&#22914;&#26524;&#24744;&#29616;&#22312;&#19981;&#24076;&#26395;&#35774;&#32622;&#26576;&#20010;&#23646;&#24615;&#30340;&#20540;&#65292;&#20294;&#24076;&#26395;&#23558;&#35813;&#23646;&#24615;&#20445;&#30041;&#22312;&#34920;&#20013;&#20197;&#20415;&#22312;&#20197;&#21518;&#35774;&#32622;&#20540;&#65292;&#35831;&#22312;&ldquo;&#20540;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#19968;&#23545;&#31354;&#25324;&#21495;&#65306;</p>
<pre>
()
</pre>
<ul>
<li>
<p>&#35201;&#28155;&#21152;&#23646;&#24615;&#65292;&#35831;&#21333;&#20987;&ldquo;&#28155;&#21152;&#23646;&#24615;&rdquo;&#25353;&#38062;&#12290;&#22312;&#26174;&#31034;&#30340;&#31354;&#30333;&#34892;&#20013;&#65292;&#22312;&ldquo;&#21517;&#31216;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#23646;&#24615;&#21517;&#31216;&#65292;&#22312;&ldquo;&#20540;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#23646;&#24615;&#20540;&#12290;</p>
</li>
<li>
<p>&#35201;&#20462;&#25913;&#23646;&#24615;&#65292;&#35831;&#32534;&#36753;&#35813;&#23646;&#24615;&#30340;&ldquo;&#20540;&rdquo;&#23383;&#27573;&#12290;</p>
</li>
<li>
<p>&#35201;&#21024;&#38500;&#23646;&#24615;&#65292;&#35831;&#36873;&#20013;&#20301;&#20110;&#24744;&#35201;&#21024;&#38500;&#23646;&#24615;&#30340;&ldquo;&#21517;&#31216;&rdquo;&#23383;&#27573;&#24038;&#36793;&#30340;&#22797;&#36873;&#26694;&#65292;&#28982;&#21518;&#21333;&#20987;&ldquo;&#21024;&#38500;&#23646;&#24615;&rdquo;&#25353;&#38062;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#21333;&#20987;&ldquo;&#23436;&#25104;&rdquo;&#12290;</p>
</li>
</ol>
<a id="sthref15" name="sthref15"></a>
<h5>&#21478;&#35831;&#21442;&#38405;</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">&#35774;&#32622;&#25968;&#25454;&#24211;&#35775;&#38382;</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">&#38598;&#25104; JDBC &#39537;&#21160;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcenew.html">&#21019;&#24314; JDBC &#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesedit.html">&#32534;&#36753; JDBC &#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcetargets.html">&#32534;&#36753; JDBC &#36164;&#28304;&#30446;&#26631;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesdelete.html">&#21024;&#38500; JDBC &#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">&#32534;&#36753; JDBC &#36830;&#25509;&#27744;&#24120;&#35268;&#35774;&#32622;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">&#32534;&#36753; JDBC &#36830;&#25509;&#27744;&#39640;&#32423;&#23646;&#24615;</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">&#39564;&#35777;&#36830;&#25509;&#27744;&#35774;&#32622;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">&#32534;&#36753; JDBC &#36830;&#25509;&#27744;&#23646;&#24615;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">&#21024;&#38500; JDBC &#36830;&#25509;&#27744;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
