<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-orb" name="ref-orb"></a><a id="GHCOR00001" name="GHCOR00001"></a></p>

<h4><a id="sthref14" name="sthref14"></a><a id="sthref15" name="sthref15"></a>ORB</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilize a p&aacute;gina ORB para configurar o Object Request Broker.</p>
<p>O ORB oferece a infraestrutura para identificar e localizar objetos, processar o gerenciamento de conex&otilde;es, entregar dados e solicitar comunica&ccedil;&otilde;es. Clientes remotos de enterprise beans (m&oacute;dulos EJB) se comunicam com o GlassFish Server utilizando o ORB.</p>
<p>A p&aacute;gina ORB cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Carregar Defaults</dt>
<dd>
<p>Bot&atilde;o para restaurar defini&ccedil;&otilde;es para seus valores default. Defini&ccedil;&otilde;es que n&atilde;o tiveram seus valores default alterados.</p>
</dd>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>ID do Pool de Threads</dt>
<dd>
<p>O pool de threads utilizado pelo ORB. O ORB utiliza pools de threads para responder a solicita&ccedil;&otilde;es de clientes remotos de enterprise beans e outros clientes que se comunicam utilizando RMI-IIOP. O pool de thread default do ORB &eacute; <code>thread-pool-1</code>, que usa defaults adequados para solicita&ccedil;&otilde;es de RMI/IIOP.</p>
</dd>
<dt>Tamanho M&aacute;x. Fragmento Mensagem</dt>
<dd>
<p>O tamanho m&aacute;ximo de fragmento da mensagem para mensagens IIOP. As mensagens com tamanho maior do que o m&aacute;ximo permitido s&atilde;o fragmentadas. O valor default &eacute; 1024 bytes.</p>
</dd>
<dt>Total de Conex&otilde;es</dt>
<dd>
<p>O n&uacute;mero m&aacute;ximo de conex&otilde;es de entrada para todos os listeners de IIOP. O valor default &eacute; 1024.</p>
</dd>
<dt>Autentica&ccedil;&atilde;o de Cliente IIOP</dt>
<dd>
<p>Se a caixa de sele&ccedil;&atilde;o Ativado estiver marcada, o servidor rejeitar&aacute; solicita&ccedil;&otilde;es n&atilde;o autenticadas e insir&aacute; um bit de autentica&ccedil;&atilde;o-necess&aacute;ria nas Refer&ecirc;ncias de Objeto Interoper&aacute;veis (IORs) enviadas para clientes. A autentica&ccedil;&atilde;o do cliente IIOP pode ser ativada ou desativada. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Propriedades Adicionais</dt>
<dd>
<p>Propriedades adicionais do ORB. O GlassFish Server n&atilde;o define propriedades adicionais para o ORB.</p>
</dd>
</dl>
<a id="sthref16" name="sthref16"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-orb.html">Para Configurar o ORB</a></p>
</li>
<li>
<p><a href="task-iioplistenernew.html">Para Criar um Listener IIOP</a></p>
</li>
<li>
<p><a href="task-iioplisteneredit.html">Para Editar um Listener IIOP</a></p>
</li>
<li>
<p><a href="task-editiiopssl.html">Para Editar Defini&ccedil;&otilde;es SSL de um Listener IIOP Seguro</a></p>
</li>
<li>
<p><a href="task-iioplistenerdelete.html">Para Deletar um Listener IIOP</a></p>
</li>
</ul>
<a id="sthref17" name="sthref17"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00032"><code>create-iiop-listener</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00169"><code>list-iiop-listeners</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00084"><code>delete-iiop-listener</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00058"><code>create-ssl</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00109"><code>delete-ssl</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
