<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-iioplistenernew" name="task-iioplistenernew"></a></p>

<h4><a id="sthref5" name="sthref5"></a>Para Criar um Listener IIOP</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>No componente da &aacute;rvore, expanda o n&oacute; Configura&ccedil;&atilde;o.</p>
</li>
<li>
<p>Selecione a inst&acirc;ncia que ser&aacute; configurada:</p>
<ul>
<li>
<p>Para configurar uma inst&acirc;ncia espec&iacute;fica, selecione o n&oacute; de configura&ccedil;&atilde;o da inst&acirc;ncia. Por exemplo, para a inst&acirc;ncia default, <code>server</code>, selecione o n&oacute; <code>server-config</code>.</p>
</li>
<li>
<p>Para configura as defini&ccedil;&otilde;es default das futuras inst&acirc;ncias que utilizam uma c&oacute;pia de <code>default-config</code>, selecione o n&oacute; <code>default-config</code>.</p>
</li>
</ul>
</li>
<li>
<p>No n&oacute; Configura&ccedil;&atilde;o, expanda o n&oacute; ORB.</p>
</li>
<li>
<p>Selecione Listeners IIOP.</p>
<p>A p&aacute;gina Listeners IIOP &eacute; aberta.</p>
</li>
<li>
<p>Clique em Novo.</p>
</li>
<li>
<p>No campo Nome, digite um nome para identificar o listener.</p>
</li>
<li>
<p>No campo Endere&ccedil;o de Rede, digite o endere&ccedil;o de rede do listener.</p>
<p>Voc&ecirc; pode digitar um endere&ccedil;o IP ou um nome de host resol&uacute;vel de DNS.</p>
</li>
<li>
<p>No campo Porta do Listener, digite o n&uacute;mero da porta que o listener IIOP utilizar&aacute;.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Listener Ativado para ativar conex&otilde;es de entrada IIOP do ORB com o GlassFish Server.</p>
<p>Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Seguran&ccedil;a Ativada para ativar SSL para o listener IIOP.</p>
<p>Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>Na se&ccedil;&atilde;o Propriedades Adicionais, especifique as propriedades adicionais.</p>
<p>O GlassFish Server n&atilde;o define propriedades adicionais para listeners IIOP.</p>
<p>Para adicionar uma propriedade, clique no bot&atilde;o Adicionar Propriedade. Na linha em branco que for exibida, digite o nome da propriedade no campo Nome e digite o valor da propriedade no campo Valor.</p>
</li>
<li>
<p>Clique em OK.</p>
</li>
<li>
<p>Caso voc&ecirc; tenha marcado a caixa de sele&ccedil;&atilde;o Seguran&ccedil;a Ativada, siga as etapas contidas em <a href="task-editiiopssl.html">Para Editar Defini&ccedil;&otilde;es SSL de um Listener IIOP Seguro</a>.</p>
</li>
</ol>
<a id="sthref6" name="sthref6"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-orb.html">Para Configurar o ORB</a></p>
</li>
<li>
<p><a href="task-iioplisteneredit.html">Para Editar um Listener IIOP</a></p>
</li>
<li>
<p><a href="task-editiiopssl.html">Para Editar Defini&ccedil;&otilde;es SSL de um Listener IIOP Seguro</a></p>
</li>
<li>
<p><a href="task-iioplistenerdelete.html">Para Deletar um Listener IIOP</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
