<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-threadfactoryedit" name="ref-threadfactoryedit"></a></p>

<h4>&#44288;&#47532; &#45824;&#49345; &#49828;&#47112;&#46300; &#54057;&#53664;&#47532; &#54200;&#51665;<a id="sthref40" name="sthref40"></a></h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#44288;&#47532; &#45824;&#49345; &#49828;&#47112;&#46300; &#54057;&#53664;&#47532; &#54200;&#51665;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#44288;&#47532; &#45824;&#49345; &#49828;&#47112;&#46300; &#54057;&#53664;&#47532; &#47532;&#49548;&#49828;&#47484; &#54200;&#51665;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>[&#44288;&#47532; &#45824;&#49345; &#49828;&#47112;&#46300; &#54057;&#53664;&#47532; &#54200;&#51665;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44592;&#48376;&#44050; &#47196;&#46300;</dt>
<dd>
<p>&#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#45716; &#49444;&#51221;&#51012; &#44592;&#48376;&#44050;&#51004;&#47196; &#48373;&#50896;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#49444;&#51221;&#51008; &#48320;&#44221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>JNDI &#51060;&#47492;</dt>
<dd>
<p>&#47532;&#49548;&#49828;&#47484; &#49885;&#48324;&#54616;&#45716; &#44256;&#50976;&#54620; &#51060;&#47492;&#51077;&#45768;&#45796;. [JNDI &#51060;&#47492;]&#51008; &#51069;&#44592; &#51204;&#50857; &#54596;&#46300;&#51077;&#45768;&#45796;. &#49352; &#47532;&#49548;&#49828;&#47484; &#49373;&#49457;&#54624; &#46412;&#47564; JNDI &#51060;&#47492;&#51012; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#45436;&#47532;&#51201; JNDI &#51060;&#47492;</dt>
<dd>
<p>&#47532;&#49548;&#49828;&#51032; &#45436;&#47532;&#51201; JNDI &#51060;&#47492;&#51077;&#45768;&#45796;. &#47532;&#49548;&#49828;&#50640; &#50529;&#49464;&#49828;&#54624; &#46412; &#49324;&#50857;&#54616;&#45716; Java EE &#54364;&#51456; &#51060;&#47492;&#51077;&#45768;&#45796;. [&#45436;&#47532;&#51201; JNDI &#51060;&#47492;]&#51008; &#51069;&#44592; &#51204;&#50857; &#54596;&#46300;&#51077;&#45768;&#45796;. &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="../../../common/en/help/ref-logicaljndinames.html">&#45436;&#47532;&#51201; JNDI &#51060;&#47492;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</dd>
<dt>&#52968;&#53581;&#49828;&#53944; &#51221;&#48372;</dt>
<dd>
<p>&#49828;&#47112;&#46300;&#47196; &#51204;&#45804;&#54624; &#52968;&#53581;&#49828;&#53944;&#51077;&#45768;&#45796;(Classloader, JNDI, Security &#46608;&#45716; WorkArea). &#52968;&#53581;&#49828;&#53944; &#51204;&#45804;&#51008; &#49324;&#50857; &#46608;&#45716; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#47732; &#49440;&#53469;&#46108; &#52968;&#53581;&#49828;&#53944;&#44032; &#51204;&#45804;&#46121;&#45768;&#45796;. &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#47732; &#49440;&#53469;&#46108; &#52968;&#53581;&#49828;&#53944;&#47484; &#54252;&#54632;&#54616;&#50668; &#50612;&#46500; &#52968;&#53581;&#49828;&#53944;&#46020; &#51204;&#45804;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; [&#49324;&#50857;]&#51060;&#47728; 4&#44032;&#51648; &#52968;&#53581;&#49828;&#53944;&#44032; &#47784;&#46160; &#49440;&#53469;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#49345;&#53468;</dt>
<dd>
<p>&#47088;&#53440;&#51076;&#50640; &#47532;&#49548;&#49828;&#47484; &#49324;&#50857;&#54624; &#49688; &#51080;&#45716;&#51648; &#50668;&#48512;&#51077;&#45768;&#45796;.</p>
<p>&#44592;&#48376; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#51064; <code>server</code>&#44032; &#46020;&#47700;&#51064;&#50640; &#51316;&#51116;&#54616;&#45716; &#44221;&#50864;&#50640;&#47564; &#47532;&#49548;&#49828;&#51032; &#47088;&#53440;&#51076; &#44032;&#50857;&#49457;&#51012; &#49324;&#50857; &#46608;&#45716; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#47088;&#53440;&#51076; &#44032;&#50857;&#49457;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;.</p>
<p>&#46020;&#47700;&#51064;&#50640; &#53364;&#47084;&#49828;&#53552; &#46608;&#45716; &#46021;&#47549;&#54805; &#51064;&#49828;&#53556;&#49828;&#44032; &#49373;&#49457;&#46108; &#44221;&#50864; [&#45824;&#49345;] &#53485;&#51012; &#49324;&#50857;&#54616;&#50668; &#54644;&#45817; &#45824;&#49345;&#50640;&#49436; &#47532;&#49548;&#49828;&#51032; &#47088;&#53440;&#51076; &#44032;&#50857;&#49457;&#51012; &#51228;&#50612;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#49828;&#47112;&#46300; &#50864;&#49440;&#49692;&#50948;</dt>
<dd>
<p>&#49373;&#49457;&#46108; &#49828;&#47112;&#46300;&#50640; &#51648;&#51221;&#46104;&#45716; &#50864;&#49440;&#49692;&#50948;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 5&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#48176;&#52824; &#49692;&#49436;</dt>
<dd>
<p>&#51060; &#47532;&#49548;&#49828;&#51032; &#48176;&#52824; &#49692;&#49436;&#51077;&#45768;&#45796;. &#49436;&#48260; &#49884;&#51089; &#49884; &#45230;&#51008; &#48264;&#54840;&#51032; &#47532;&#49548;&#49828;&#44032; &#47676;&#51200; &#47196;&#46300;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 100&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49444;&#47749;</dt>
<dd>
<p>&#54644;&#45817; &#47532;&#49548;&#49828;&#50640; &#45824;&#54620; &#49444;&#47749;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52628;&#44032; &#49549;&#49457;</dt>
<dd>
<p>&#47532;&#49548;&#49828;&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51077;&#45768;&#45796;. GlassFish Server&#50640;&#49436;&#45716; &#51060; &#47532;&#49548;&#49828; &#50976;&#54805;&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51012; &#51221;&#51032;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;. &#46608;&#54620; &#54788;&#51116; &#51060; &#47532;&#49548;&#49828; &#50976;&#54805;&#51008; &#52628;&#44032; &#49549;&#49457;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref41" name="sthref41"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-managedthreadfactorynew.html">&#44288;&#47532; &#45824;&#49345; &#49828;&#47112;&#46300; &#54057;&#53664;&#47532;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-managedthreadfactoryedit.html">&#44288;&#47532; &#45824;&#49345; &#49828;&#47112;&#46300; &#54057;&#53664;&#47532;&#47484; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-managedthreadfactorydelete.html">&#44288;&#47532; &#45824;&#49345; &#49828;&#47112;&#46300; &#54057;&#53664;&#47532;&#47484; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="GHCON158" name="GHCON158"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM842"><code>create-managed-thread-factory</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM875"><code>list-managed-thread-factories</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM852"><code>delete-managed-thread-factory</code>(1)</a></p>
</li>
</ul>






<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
