<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-scheduledexecutorservicenew" name="ref-scheduledexecutorservicenew"></a></p>

<h4>&#49352; &#44288;&#47532; &#45824;&#49345; &#50696;&#50557;&#46108; &#49892;&#54665;&#44592; &#49436;&#48708;&#49828;<a id="sthref31" name="sthref31"></a></h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#49352; &#44288;&#47532; &#45824;&#49345; &#50696;&#50557;&#46108; &#49892;&#54665;&#44592; &#49436;&#48708;&#49828;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#44288;&#47532; &#45824;&#49345; &#50696;&#50557;&#46108; &#49892;&#54665;&#44592; &#49436;&#48708;&#49828; &#47532;&#49548;&#49828;&#47484; &#49373;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>[&#49352; &#44288;&#47532; &#45824;&#49345; &#50696;&#50557;&#46108; &#49892;&#54665;&#44592; &#49436;&#48708;&#49828;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>JNDI &#51060;&#47492;</dt>
<dd>
<p>&#47532;&#49548;&#49828;&#47484; &#49885;&#48324;&#54616;&#45716; &#44256;&#50976;&#54620; JNDI &#51060;&#47492;&#51077;&#45768;&#45796;. &#44288;&#47168;&#49345; &#51060; &#51060;&#47492;&#51008; &#47532;&#49548;&#49828; &#50976;&#54805; &#51648;&#49884;&#51088; &#48143; &#49836;&#47000;&#49884;&#47196; &#49884;&#51089;&#46121;&#45768;&#45796;(&#50696;: concurrent/, jdbc/ &#46608;&#45716; jms/).</p>
</dd>
<dt>&#52968;&#53581;&#49828;&#53944; &#51221;&#48372;</dt>
<dd>
<p>&#49828;&#47112;&#46300;&#47196; &#51204;&#45804;&#54624; &#52968;&#53581;&#49828;&#53944;&#51077;&#45768;&#45796;(Classloader, JNDI, Security &#46608;&#45716; WorkArea). &#52968;&#53581;&#49828;&#53944; &#51204;&#45804;&#51008; &#49324;&#50857; &#46608;&#45716; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#47732; &#49440;&#53469;&#46108; &#52968;&#53581;&#49828;&#53944;&#44032; &#51204;&#45804;&#46121;&#45768;&#45796;. &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#47732; &#49440;&#53469;&#46108; &#52968;&#53581;&#49828;&#53944;&#47484; &#54252;&#54632;&#54616;&#50668; &#50612;&#46500; &#52968;&#53581;&#49828;&#53944;&#46020; &#51204;&#45804;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; [&#49324;&#50857;]&#51060;&#47728; 4&#44032;&#51648; &#52968;&#53581;&#49828;&#53944;&#44032; &#47784;&#46160; &#49440;&#53469;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#49345;&#53468;</dt>
<dd>
<p>&#47532;&#49548;&#49828;&#51032; &#49345;&#53468;&#51077;&#45768;&#45796;. &#47532;&#49548;&#49828;&#45716; &#49324;&#50857; &#46608;&#45716; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; &#49324;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49828;&#47112;&#46300; &#50864;&#49440;&#49692;&#50948;</dt>
<dd>
<p>&#49373;&#49457;&#46108; &#49828;&#47112;&#46300;&#50640; &#51648;&#51221;&#46104;&#45716; &#50864;&#49440;&#49692;&#50948;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 5&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#50724;&#47019;&#46041;&#50504; &#49892;&#54665; &#51473;&#51064; &#51089;&#50629;</dt>
<dd>
<p>&#47532;&#49548;&#49828;&#47484; &#50724;&#47019;&#46041;&#50504; &#49892;&#54665; &#51473;&#51064; &#51089;&#50629;&#50640; &#49324;&#50857;&#54624;&#51648; &#50668;&#48512;&#51077;&#45768;&#45796;. &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#47732; &#50724;&#47019;&#46041;&#50504; &#49892;&#54665; &#51473;&#51064; &#51089;&#50629;&#51060; &#51221;&#51648;&#46108; &#44163;&#51004;&#47196; &#48372;&#44256;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#51089;&#50629; &#51221;&#51648; &#44036;&#51452; &#49884;&#44036;</dt>
<dd>
<p>&#51025;&#45813;&#51060; &#50630;&#45716; &#44163;&#51004;&#47196; &#44036;&#51452;&#46104;&#44592; &#51204;&#50640; &#51089;&#50629;&#51012; &#49892;&#54665;&#54624; &#49688; &#51080;&#45716; &#49884;&#44036;(&#52488;)&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 0&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49444;&#47749;</dt>
<dd>
<p>&#54644;&#45817; &#47532;&#49548;&#49828;&#50640; &#45824;&#54620; &#49444;&#47749;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#53076;&#50612; &#53356;&#44592;</dt>
<dd>
<p>&#49828;&#47112;&#46300; &#54400;&#50640; &#48372;&#51316;&#54624; &#49828;&#47112;&#46300; &#49688;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 0&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#50672;&#44208; &#50976;&#51648;</dt>
<dd>
<p>&#49828;&#47112;&#46300; &#49688;&#44032; &#53076;&#50612; &#53356;&#44592;&#48372;&#45796; &#53364; &#44221;&#50864; &#49828;&#47112;&#46300;&#44032; &#50976;&#55092; &#49345;&#53468;&#47196; &#45224;&#50500; &#51080;&#51012; &#49688; &#51080;&#45716; &#49884;&#44036;(&#52488;)&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 60&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49828;&#47112;&#46300; &#49688;&#47749;</dt>
<dd>
<p>&#49828;&#47112;&#46300; &#49688;&#44032; &#53076;&#50612; &#53356;&#44592;&#48372;&#45796; &#53360;&#51648; &#50668;&#48512; &#46608;&#45716; &#49828;&#47112;&#46300;&#44032; &#50976;&#55092; &#49345;&#53468;&#51064;&#51648; &#50668;&#48512;&#50640; &#44288;&#44228;&#50630;&#51060; &#48708;&#50864;&#44592; &#51204;&#50640; &#49828;&#47112;&#46300;&#44032; &#49828;&#47112;&#46300; &#54400;&#50640; &#45224;&#50500; &#51080;&#51012; &#49688; &#51080;&#45716; &#49884;&#44036;(&#52488;)&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 0&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52628;&#44032; &#49549;&#49457;</dt>
<dd>
<p>&#47532;&#49548;&#49828;&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51077;&#45768;&#45796;. GlassFish Server&#50640;&#49436;&#45716; &#51060; &#47532;&#49548;&#49828; &#50976;&#54805;&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51012; &#51221;&#51032;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;. &#46608;&#54620; &#54788;&#51116; &#51060; &#47532;&#49548;&#49828; &#50976;&#54805;&#51008; &#52628;&#44032; &#49549;&#49457;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#45824;&#49345;</dt>
<dd>
<p>(&#51060; &#50741;&#49496;&#51008; &#53364;&#47084;&#49828;&#53552;&#45208; &#46021;&#47549;&#54805; &#51064;&#49828;&#53556;&#49828;&#44032; &#46020;&#47700;&#51064;&#50640; &#49373;&#49457;&#46108; &#44221;&#50864;&#50640; &#54364;&#49884;&#46121;&#45768;&#45796;.)</p>
<p>&#47532;&#49548;&#49828;&#50640; &#45824;&#54620; &#53364;&#47084;&#49828;&#53552; &#48143; &#46021;&#47549;&#54805; &#51064;&#49828;&#53556;&#49828;&#51077;&#45768;&#45796;. &#50896;&#54616;&#45716; &#45824;&#49345;&#51012; [&#49440;&#53469;&#54620; &#45824;&#49345;] &#50676;&#47196; &#51060;&#46041;&#54616;&#47140;&#47732; [&#52628;&#44032;] &#48143; [&#47784;&#46160; &#52628;&#44032;] &#45800;&#52628;&#47484; &#49324;&#50857;&#54633;&#45768;&#45796;. &#54596;&#50836;&#54616;&#51648; &#50506;&#51008; &#45824;&#49345;&#51012; [&#49324;&#50857; &#44032;&#45733;&#54620; &#45824;&#49345;] &#50676;&#47196; &#51060;&#46041;&#54616;&#47140;&#47732; [&#51228;&#44144;] &#48143; [&#47784;&#46160; &#51228;&#44144;] &#45800;&#52628;&#47484; &#49324;&#50857;&#54633;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref32" name="sthref32"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-managedscheduledexecutorservicecreate.html">&#44288;&#47532; &#45824;&#49345; &#50696;&#50557;&#46108; &#49892;&#54665;&#44592; &#49436;&#48708;&#49828;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-managedscheduledexecutorserviceedit.html">&#44288;&#47532; &#45824;&#49345; &#50696;&#50557;&#46108; &#49892;&#54665;&#44592; &#49436;&#48708;&#49828;&#47484; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-managedscheduledexecutorservicedelete.html">&#44288;&#47532; &#45824;&#49345; &#50696;&#50557;&#46108; &#49892;&#54665;&#44592; &#49436;&#48708;&#49828;&#47484; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="GHCON149" name="GHCON149"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM680"><code>create-managed-scheduled-executor-service</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM873"><code>list-managed-scheduled-executor-services</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM850"><code>delete-managed-scheduled-executor-service</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
