<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-managedexecutorserviceedit" name="task-managedexecutorserviceedit"></a></p>

<h4>&#44288;&#47532; &#45824;&#49345; &#49892;&#54665;&#44592; &#49436;&#48708;&#49828;&#47484; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;<a id="sthref6" name="sthref6"></a></h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#53456;&#49353; &#53944;&#47532;&#50640;&#49436; [&#47532;&#49548;&#49828;] &#45432;&#46300;&#47484; &#54869;&#51109;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#47532;&#49548;&#49828;] &#45432;&#46300;&#50640;&#49436; [&#46041;&#49884; &#47532;&#49548;&#49828;] &#45432;&#46300;&#47484; &#54869;&#51109;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#46041;&#49884; &#47532;&#49548;&#49828;] &#45432;&#46300;&#50640;&#49436; [&#44288;&#47532; &#45824;&#49345; &#49892;&#54665;&#44592; &#49436;&#48708;&#49828;]&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>[&#44288;&#47532; &#45824;&#49345; &#49892;&#54665;&#44592; &#49436;&#48708;&#49828;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#44288;&#47532; &#45824;&#49345; &#49892;&#54665;&#44592; &#49436;&#48708;&#49828;] &#54168;&#51060;&#51648;&#50640;&#49436; &#54200;&#51665;&#54624; &#47532;&#49548;&#49828;&#51032; &#51060;&#47492;&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
<p>[&#44288;&#47532; &#45824;&#49345; &#49892;&#54665;&#44592; &#49436;&#48708;&#49828; &#54200;&#51665;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>

<hr>
<p><b>&#51452;:</b></p>
[JNDI &#51060;&#47492;]&#51008; &#51069;&#44592; &#51204;&#50857; &#54596;&#46300;&#51077;&#45768;&#45796;. &#49352; &#47532;&#49548;&#49828;&#47484; &#49373;&#49457;&#54624; &#46412;&#47564; JNDI &#51060;&#47492;&#51012; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. [&#45436;&#47532;&#51201; JNDI &#51060;&#47492;]&#46020; &#51069;&#44592; &#51204;&#50857; &#54596;&#46300;&#51077;&#45768;&#45796;.
<hr>

</li>
<li>
<p>&#52968;&#53581;&#49828;&#53944;&#47484; &#49828;&#47112;&#46300;&#50640; &#51204;&#45804;&#54616;&#47140;&#47732; [&#52968;&#53581;&#49828;&#53944; &#51221;&#48372; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#44256; &#51204;&#45804;&#54624; &#52968;&#53581;&#49828;&#53944;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#51201;&#51004;&#47196; &#51060; &#50741;&#49496;&#51008; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#44256; &#47784;&#46304; &#52968;&#53581;&#49828;&#53944;&#44032; &#49440;&#53469;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;. &#52968;&#53581;&#49828;&#53944;&#47484; &#50668;&#47084; &#44060; &#49440;&#53469;&#54616;&#47140;&#47732; Shift &#46608;&#45716; Ctrl &#53412;&#47484; &#45572;&#47480; &#52292;&#47196; &#45572;&#47476;&#49901;&#49884;&#50724;. &#51060; &#50741;&#49496;&#51012; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; &#52968;&#53581;&#49828;&#53944;&#44032; &#49440;&#53469;&#46108; &#44221;&#50864;&#50640;&#46020; &#51204;&#45804;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>&#47532;&#49548;&#49828;&#47484; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47140;&#47732; [&#49345;&#53468; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#49828;&#47112;&#46300; &#50864;&#49440;&#49692;&#50948;] &#54596;&#46300;&#50640; &#49373;&#49457;&#46108; &#49828;&#47112;&#46300;&#50640; &#51648;&#51221;&#54624; &#50864;&#49440;&#49692;&#50948;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; 5&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>&#47532;&#49548;&#49828;&#47484; &#50724;&#47019;&#46041;&#50504; &#49892;&#54665; &#51473;&#51064; &#51089;&#50629;&#50640; &#49324;&#50857;&#54616;&#47140;&#47732; [&#50724;&#47019;&#46041;&#50504; &#49892;&#54665; &#51473;&#51064; &#51089;&#50629; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#47732; &#50724;&#47019;&#46041;&#50504; &#49892;&#54665; &#51473;&#51064; &#51089;&#50629;&#51060; &#51221;&#51648;&#46108; &#44163;&#51004;&#47196; &#48372;&#44256;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51089;&#50629; &#51221;&#51648; &#44036;&#51452; &#49884;&#44036;] &#54596;&#46300;&#50640; &#51025;&#45813;&#51060; &#50630;&#45716; &#44163;&#51004;&#47196; &#44036;&#51452;&#46104;&#44592; &#51204;&#50640; &#51089;&#50629;&#51012; &#49892;&#54665;&#54624; &#49688; &#51080;&#45716; &#49884;&#44036;(&#52488;)&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; 0&#51004;&#47196;, &#51060; &#44221;&#50864; &#51089;&#50629;&#51060; &#51025;&#45813;&#51060; &#50630;&#45716; &#44163;&#51004;&#47196; &#44036;&#51452;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#48176;&#52824; &#49692;&#49436;] &#54596;&#46300;&#50640; &#47532;&#49548;&#49828;&#51032; &#48176;&#52824; &#49692;&#49436;&#47484; &#51648;&#51221;&#54616;&#45716; &#49707;&#51088;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#49436;&#48260; &#49884;&#51089; &#49884; &#45230;&#51008; &#48264;&#54840;&#51032; &#47532;&#49548;&#49828;&#44032; &#47676;&#51200; &#47196;&#46300;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 100&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#49444;&#47749;] &#54596;&#46300;&#50640; &#47532;&#49548;&#49828;&#50640; &#45824;&#54620; &#44036;&#45800;&#54620; &#49444;&#47749;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#49444;&#47749;&#51008; &#52572;&#45824; 250&#51088;&#44032; &#54252;&#54632;&#46112; &#49688; &#51080;&#45716; &#47928;&#51088;&#50676; &#44050;&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#53076;&#50612; &#53356;&#44592;] &#54596;&#46300;&#50640; &#49828;&#47112;&#46300;&#51032; &#50976;&#55092; &#49345;&#53468; &#50668;&#48512;&#50640; &#44288;&#44228;&#50630;&#51060; &#49828;&#47112;&#46300; &#54400;&#50640; &#50976;&#51648;&#54624; &#49828;&#47112;&#46300; &#49688;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#49352; &#51089;&#50629;&#51060; &#51228;&#52636;&#46104;&#44256; &#49892;&#54665; &#51473;&#51064; &#49828;&#47112;&#46300; &#49688;&#44032; &#53076;&#50612; &#53356;&#44592;&#48372;&#45796; &#51201;&#51004;&#47732; &#49352; &#49828;&#47112;&#46300;&#44032; &#49373;&#49457;&#46104;&#50612; &#50836;&#52397;&#51012; &#52376;&#47532;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 0&#51004;&#47196;, &#51060; &#44221;&#50864; &#51089;&#50629; &#45824;&#44592;&#50676;&#51060; &#44873; &#52284;&#44144;&#45208; &#47532;&#49548;&#49828;&#44032; &#51649;&#51217; &#45824;&#44592;&#50676; &#51648;&#51221;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#54620; &#49352; &#49828;&#47112;&#46300;&#44032; &#49373;&#49457;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;. &#51649;&#51217; &#45824;&#44592;&#50676; &#51648;&#51221;&#51008; &#51089;&#50629; &#45824;&#44592;&#50676; &#50857;&#47049;&#51060; 0&#51060;&#44144;&#45208;, &#51089;&#50629; &#45824;&#44592;&#50676; &#50857;&#47049;&#51060; 2147483647&#51060;&#44256; &#53076;&#50612; &#53356;&#44592;&#44032; 0&#51068; &#46412; &#48156;&#49373;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#52572;&#45824; &#54400; &#53356;&#44592;] &#54596;&#46300;&#50640; &#49828;&#47112;&#46300; &#54400;&#51060; &#54252;&#54632;&#54624; &#49688; &#51080;&#45716; &#52572;&#45824; &#49828;&#47112;&#46300; &#49688;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; 2147483647&#47196;, &#51060; &#44221;&#50864; &#49828;&#47112;&#46300; &#54400;&#50640; &#48376;&#51656;&#51201;&#51004;&#47196; &#51228;&#54620;&#51060; &#50630;&#51004;&#48064;&#47196; &#44060;&#49688;&#50640; &#44288;&#44228;&#50630;&#51060; &#49828;&#47112;&#46300;&#47484; &#54252;&#54632;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#50672;&#44208; &#50976;&#51648;] &#54596;&#46300;&#50640; &#49828;&#47112;&#46300; &#49688;&#44032; &#53076;&#50612; &#53356;&#44592;&#48372;&#45796; &#53360; &#44221;&#50864; &#49828;&#47112;&#46300;&#44032; &#50976;&#55092; &#49345;&#53468;&#47196; &#45224;&#50500; &#51080;&#51012; &#49688; &#51080;&#45716; &#49884;&#44036;(&#52488;)&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; 60&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#49828;&#47112;&#46300; &#49688;&#47749;] &#54596;&#46300;&#50640; &#49828;&#47112;&#46300; &#49688;&#44032; &#53076;&#50612; &#53356;&#44592;&#48372;&#45796; &#53360;&#51648; &#50668;&#48512; &#46608;&#45716; &#49828;&#47112;&#46300;&#44032; &#50976;&#55092; &#49345;&#53468;&#51064;&#51648; &#50668;&#48512;&#50640; &#44288;&#44228;&#50630;&#51060; &#48708;&#50864;&#44592; &#51204;&#50640; &#49828;&#47112;&#46300;&#44032; &#49828;&#47112;&#46300; &#54400;&#50640; &#45224;&#50500; &#51080;&#51012; &#49688; &#51080;&#45716; &#49884;&#44036;(&#52488;)&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; 0&#51004;&#47196;, &#51060; &#44221;&#50864; &#49828;&#47112;&#46300;&#47484; &#48708;&#50864;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51089;&#50629; &#45824;&#44592;&#50676; &#50857;&#47049;] &#54596;&#46300;&#50640; &#49892;&#54665; &#45824;&#44592; &#49345;&#53468;&#47196; &#51089;&#50629; &#45824;&#44592;&#50676;&#50640; &#51200;&#51109;&#54624; &#49688; &#51080;&#45716; &#51228;&#52636;&#46108; &#51089;&#50629; &#49688;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; 2147483647&#47196;, &#51060; &#44221;&#50864; &#51089;&#50629; &#45824;&#44592;&#50676;&#50640; &#48376;&#51656;&#51201;&#51004;&#47196; &#51228;&#54620;&#51060; &#50630;&#51004;&#48064;&#47196; &#44060;&#49688;&#50640; &#44288;&#44228;&#50630;&#51060; &#51228;&#52636;&#46108; &#51089;&#50629;&#51012; &#51200;&#51109;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#52628;&#44032; &#49549;&#49457;] &#49465;&#49496;&#50640;&#49436; &#49549;&#49457;&#51012; &#52628;&#44032;&#54616;&#51648; &#47560;&#49901;&#49884;&#50724;.</p>
<p>GlassFish Server&#50640;&#49436;&#45716; &#51060; &#47532;&#49548;&#49828; &#50976;&#54805;&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51012; &#51221;&#51032;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;. &#46608;&#54620; &#54788;&#51116; &#51060; &#47532;&#49548;&#49828; &#50976;&#54805;&#51008; &#52628;&#44032; &#49549;&#49457;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51200;&#51109;]&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
</li>
</ol>
<a id="GHCON112" name="GHCON112"></a>
<h5>&#44288;&#47144; &#54637;&#47785;</h5>
<ul>
<li>
<p><a href="task-managedexecutorservicecreate.html">&#44288;&#47532; &#45824;&#49345; &#49892;&#54665;&#44592; &#49436;&#48708;&#49828;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-managedexecutorservicedelete.html">&#44288;&#47532; &#45824;&#49345; &#49892;&#54665;&#44592; &#49436;&#48708;&#49828;&#47484; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
