<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-connectorconnectionpooladvance" name="ref-connectorconnectionpooladvance"></a></p>

<h4><a id="sthref75" name="sthref75"></a>&#32534;&#36753;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&#39640;&#32423;&#23646;&#24615;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&ldquo;&#32534;&#36753;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&#39640;&#32423;&#23646;&#24615;&rdquo;&#39029;&#21487;&#20197;&#20462;&#25913;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&#30340;&#39640;&#32423;&#35774;&#32622;&#12290;</p>
<p>&ldquo;&#32534;&#36753;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&#39640;&#32423;&#23646;&#24615;&rdquo;&#39029;&#21253;&#21547;&#20197;&#19979;&#36873;&#39033;&#12290;</p>
<dl>
<dt>&#21152;&#36733;&#40664;&#35748;&#20540;</dt>
<dd>
<p>&#29992;&#20110;&#23558;&#20855;&#26377;&#40664;&#35748;&#20540;&#30340;&#35774;&#32622;&#36824;&#21407;&#20026;&#20854;&#40664;&#35748;&#20540;&#30340;&#25353;&#38062;&#12290;&#27809;&#26377;&#40664;&#35748;&#20540;&#30340;&#35774;&#32622;&#19981;&#21457;&#29983;&#26356;&#25913;&#12290;</p>
</dd>
<dt>&#26368;&#22810;&#39564;&#35777;&#19968;&#27425;</dt>
<dd>
<p>&#25351;&#23450;&#36830;&#32493;&#35831;&#27714;&#39564;&#35777;&#36830;&#25509; (&#26368;&#22810;&#19968;&#27425;) &#20043;&#38388;&#30340;&#26102;&#38388;&#38388;&#38548; (&#31186;)&#12290;&#40664;&#35748;&#20540;&#20026; 0&#65292;&#34920;&#31034;&#26410;&#21551;&#29992;&#35813;&#23646;&#24615;&#12290;</p>
</dd>
<dt>&#27844;&#28431;&#36229;&#26102;</dt>
<dd>
<p>&#29992;&#20110;&#22312;&#36830;&#25509;&#27744;&#20013;&#36319;&#36394;&#36830;&#25509;&#27844;&#28431;&#30340;&#26102;&#38388;&#38271;&#24230; (&#31186;)&#12290;&#22914;&#26524;&#20540;&#20026; 0&#65292;&#21017;&#34920;&#31034;&#31105;&#29992;&#36830;&#25509;&#27844;&#28431;&#36319;&#36394;&#12290;&#40664;&#35748;&#20540;&#20026; 0&#12290;</p>
</dd>
<dt>&#27844;&#28431;&#22238;&#25910;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&#27492;&#36873;&#39033;&#65292;&#21017;&#27844;&#28431;&#30340;&#36830;&#25509;&#23558;&#22312;&#27844;&#28431;&#36830;&#25509;&#36319;&#36394;&#23436;&#25104;&#21518;&#36824;&#21407;&#21040;&#27744;&#20013;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#21019;&#24314;&#37325;&#35797;&#23581;&#35797;&#27425;&#25968;</dt>
<dd>
<p>&#24403;&#21019;&#24314;&#26032;&#30340;&#36830;&#25509;&#22833;&#36133;&#21518;&#65292;&#36827;&#34892;&#23581;&#35797;&#30340;&#27425;&#25968;&#12290;&#22914;&#26524;&#20540;&#20026; 0&#65292;&#21017;&#34920;&#31034;&#19981;&#20250;&#23581;&#35797;&#20877;&#27425;&#21019;&#24314;&#36830;&#25509;&#12290;&#40664;&#35748;&#20540;&#20026; 0&#12290;</p>
</dd>
<dt>&#37325;&#35797;&#26102;&#38388;&#38388;&#38548;</dt>
<dd>
<p>&#20004;&#27425;&#23581;&#35797;&#21019;&#24314;&#36830;&#25509;&#20043;&#38388;&#30340;&#26102;&#38388;&#38388;&#38548; (&#31186;)&#12290;&#20165;&#24403;&ldquo;&#21019;&#24314;&#37325;&#35797;&#23581;&#35797;&#27425;&#25968;&rdquo;&#30340;&#20540;&#22823;&#20110; 0 &#26102;&#25165;&#20351;&#29992;&#27492;&#23646;&#24615;&#12290;&#40664;&#35748;&#20540;&#20026; 10 &#31186;&#12290;</p>
</dd>
<dt>&#20849;&#20139;</dt>
<dd>
<p>&#21551;&#29992;&#27744;&#30340;&#36830;&#25509;&#20849;&#20139;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#21551;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#24310;&#36831;&#20851;&#32852;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&#27492;&#36873;&#39033;&#65292;&#21017;&#23545;&#36830;&#25509;&#25191;&#34892;&#25805;&#20316;&#26102;&#65292;&#36830;&#25509;&#23558;&#24310;&#36831;&#20851;&#32852;&#12290;&#24403;&#23436;&#25104;&#20107;&#21153;&#22788;&#29702;&#24182;&#19988;&#32467;&#26463;&#32452;&#20214;&#26041;&#27861;&#26102;&#65292;&#23545;&#36830;&#25509;&#21462;&#28040;&#20851;&#32852;&#65292;&#36825;&#26377;&#21161;&#20110;&#37325;&#26032;&#20351;&#29992;&#29289;&#29702;&#36830;&#25509;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#24310;&#36831;&#36830;&#25509;&#30331;&#35760;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&#27492;&#36873;&#39033;&#65292;&#21017;&#20165;&#24403;&#22312;&#26041;&#27861;&#20013;&#23454;&#38469;&#20351;&#29992;&#26576;&#20010;&#36164;&#28304;&#26102;&#65292;&#25165;&#23558;&#35813;&#36164;&#28304;&#30331;&#35760;&#21040;&#20107;&#21153;&#22788;&#29702;&#20013;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#19982;&#32447;&#31243;&#20851;&#32852;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&#27492;&#36873;&#39033;&#65292;&#21017;&#36830;&#25509;&#23558;&#19982;&#32447;&#31243;&#20851;&#32852;&#12290;&#22914;&#26524;&#21516;&#19968;&#20010;&#32447;&#31243;&#38656;&#35201;&#36830;&#25509;&#65292;&#21017;&#35813;&#32447;&#31243;&#21487;&#20197;&#37325;&#26032;&#20351;&#29992;&#24050;&#19982;&#20854;&#20851;&#32852;&#30340;&#36830;&#25509;&#65292;&#22240;&#27492;&#19981;&#20250;&#23548;&#33268;&#20174;&#27744;&#20013;&#33719;&#21462;&#36830;&#25509;&#30340;&#24320;&#38144;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#21305;&#37197;&#36830;&#25509;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&#27492;&#36873;&#39033;&#65292;&#21017;&#23558;&#20026;&#27744;&#21551;&#29992;&#36830;&#25509;&#21305;&#37197;&#12290;&#22914;&#26524;&#24744;&#30693;&#36947;&#27744;&#20013;&#30340;&#36830;&#25509;&#23558;&#22987;&#32456;&#21516;&#26500;&#65292;&#22240;&#27492;&#20174;&#27744;&#20013;&#36873;&#25321;&#30340;&#36830;&#25509;&#19981;&#38656;&#35201;&#30001;&#36164;&#28304;&#36866;&#37197;&#22120;&#36827;&#34892;&#21305;&#37197;&#65292;&#21017;&#21487;&#20197;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#21551;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#21305;&#37197;&#36830;&#25509;&#20351;&#29992;&#27425;&#25968;</dt>
<dd>
<p>&#27744;&#21487;&#20197;&#37325;&#26032;&#20351;&#29992;&#36830;&#25509;&#30340;&#27425;&#25968;&#12290;&#36830;&#25509;&#22312;&#37325;&#22797;&#20351;&#29992;&#25351;&#23450;&#30340;&#27425;&#25968;&#21518;&#23558;&#34987;&#20851;&#38381;&#12290;&#22914;&#26524;&#20540;&#20026; 0&#65292;&#21017;&#34920;&#31034;&#19981;&#21551;&#29992;&#27492;&#23646;&#24615;&#12290;&#40664;&#35748;&#20540;&#20026; 0&#12290;</p>
</dd>
</dl>
<a id="sthref76" name="sthref76"></a>
<h5>&#30456;&#20851;&#20219;&#21153;</h5>
<ul>
<li>
<p><a href="task-connectorconnectionpoolnew.html">&#21019;&#24314;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">&#32534;&#36753;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">&#32534;&#36753;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&#39640;&#32423;&#23646;&#24615;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">&#32534;&#36753;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&#23646;&#24615;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">&#21019;&#24314;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&#30340;&#23433;&#20840;&#26144;&#23556;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">&#32534;&#36753;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&#30340;&#23433;&#20840;&#26144;&#23556;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">&#21024;&#38500;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&#30340;&#23433;&#20840;&#26144;&#23556;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">&#21024;&#38500;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;</a></p>
</li>
</ul>
<a id="sthref77" name="sthref77"></a>
<h5>&#30456;&#20851;&#30340; asadmin &#21629;&#20196;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00018"><code>create-connector-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00157"><code>list-connector-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00070"><code>delete-connector-connection-pool</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
