<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-connectorconnectionpoolnew2" name="ref-connectorconnectionpoolnew2"></a></p>

<h4><a id="sthref72" name="sthref72"></a>&#26032;&#24314;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744; (&#31532; 2 &#27493;&#65292;&#20849; 2 &#27493;)</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&ldquo;&#26032;&#24314;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744; (&#31532; 2 &#27493;&#65292;&#20849; 2 &#27493;)&rdquo;&#39029;&#21487;&#20197;&#21019;&#24314;&#26032;&#30340;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&#12290;</p>
<p>&ldquo;&#26032;&#24314;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744; (&#31532; 2 &#27493;&#65292;&#20849; 2 &#27493;)&rdquo;&#39029;&#21253;&#21547;&#20197;&#19979;&#36873;&#39033;&#12290;</p>
<dl>
<dt>&#35797;&#36890;</dt>
<dd>
<p>&#22914;&#26524;&#21551;&#29992;&#27492;&#36873;&#39033;&#65292;&#21017;&#22312;&#21019;&#24314;&#25110;&#37325;&#26032;&#37197;&#32622;&#36807;&#31243;&#20013;&#65292;&#23558;&#23545;&#36830;&#25509;&#27744;&#36827;&#34892;&#35797;&#36890;&#25805;&#20316;&#65292;&#20197;&#35782;&#21035;&#20854;&#23646;&#24615;&#30340;&#20219;&#20309;&#38169;&#35823;&#20540;&#24182;&#21457;&#20986;&#35686;&#21578;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#35828;&#26126;</dt>
<dd>
<p>&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&#30340;&#35828;&#26126;&#12290;</p>
</dd>
<dt>&#21021;&#22987;&#21644;&#26368;&#23567;&#27744;&#22823;&#23567;</dt>
<dd>
<p>&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&#20013;&#36830;&#25509;&#30340;&#26368;&#23567;&#25968;&#37327;&#12290;&#40664;&#35748;&#20540;&#20026; 8&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#27744;&#22823;&#23567;</dt>
<dd>
<p>&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&#20013;&#36830;&#25509;&#30340;&#26368;&#22823;&#25968;&#37327;&#12290;&#40664;&#35748;&#20540;&#20026; 32&#12290;</p>
</dd>
<dt>&#27744;&#35843;&#25972;&#22823;&#23567;&#25968;&#37327;</dt>
<dd>
<p>&#27744;&#31354;&#38386;&#36229;&#26102;&#21040;&#26399;&#26102;&#35201;&#21024;&#38500;&#30340;&#36830;&#25509;&#30340;&#25968;&#37327;&#12290;&#40664;&#35748;&#20540;&#20026; 2&#12290;</p>
</dd>
<dt>&#31354;&#38386;&#36229;&#26102;</dt>
<dd>
<p>&#36830;&#25509;&#22312;&#27744;&#20013;&#20445;&#25345;&#31354;&#38386;&#30340;&#26368;&#38271;&#26102;&#38388; (&#31186;)&#12290;&#40664;&#35748;&#20540;&#20026; 300&#12290;</p>
</dd>
<dt>&#26368;&#38271;&#31561;&#24453;&#26102;&#38388;</dt>
<dd>
<p>&#22312;&#36798;&#21040;&#36830;&#25509;&#36229;&#26102;&#20043;&#21069;&#65292;&#35831;&#27714;&#36830;&#25509;&#30340;&#24212;&#29992;&#31243;&#24207;&#25152;&#31561;&#24453;&#30340;&#26102;&#38388;&#12290;&#40664;&#35748;&#20540;&#20026; 60000&#12290;</p>
</dd>
<dt>&#36830;&#25509;&#39564;&#35777;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&ldquo;&#24517;&#38656;&#30340;&rdquo;&#22797;&#36873;&#26694;&#65292;&#21017;&#20808;&#39564;&#35777;&#36830;&#25509;&#65292;&#28982;&#21518;&#25165;&#23558;&#20854;&#25552;&#20379;&#32473;&#24212;&#29992;&#31243;&#24207;&#12290;&#22914;&#26524;&#36164;&#28304;&#39564;&#35777;&#22833;&#36133;&#65292;&#21017;&#38144;&#27585;&#27492;&#36164;&#28304;&#65292;&#28982;&#21518;&#21019;&#24314;&#24182;&#36820;&#22238;&#19968;&#20010;&#26032;&#30340;&#36164;&#28304;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#19968;&#26086;&#22833;&#36133;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&ldquo;&#20851;&#38381;&#25152;&#26377;&#36830;&#25509;&rdquo;&#22797;&#36873;&#26694;&#65292;&#21017; GlassFish Server &#23558;&#22312;&#26576;&#20010;&#36830;&#25509;&#22833;&#36133;&#26102;&#20851;&#38381;&#27744;&#20013;&#30340;&#25152;&#26377;&#36830;&#25509;&#24182;&#37325;&#26032;&#24314;&#31435;&#36825;&#20123;&#36830;&#25509;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#20107;&#21153;&#22788;&#29702;&#25903;&#25345;</dt>
<dd>
<p>&#36873;&#25321;&#30340;&#20107;&#21153;&#22788;&#29702;&#25903;&#25345;&#23558;&#20197;&#21521;&#19979;&#20860;&#23481;&#26041;&#24335;&#35206;&#30422;&#19982;&#27492;&#36830;&#25509;&#27744;&#20851;&#32852;&#30340;&#36164;&#28304;&#36866;&#37197;&#22120;&#20013;&#30340;&#20107;&#21153;&#22788;&#29702;&#25903;&#25345;&#23646;&#24615;&#12290;&#20063;&#23601;&#26159;&#35828;&#65292;&#23427;&#25903;&#25345;&#30340;&#20107;&#21153;&#22788;&#29702;&#32423;&#21035;&#21487;&#20197;&#27604;&#36164;&#28304;&#36866;&#37197;&#22120;&#20013;&#25351;&#23450;&#30340;&#20107;&#21153;&#22788;&#29702;&#32423;&#21035;&#20302;&#25110;&#19982;&#20854;&#30456;&#21516;&#65292;&#20294;&#19981;&#33021;&#25351;&#23450;&#26356;&#39640;&#30340;&#32423;&#21035;&#12290;</p>
<p>&#20540;&#21487;&#20026;&#20197;&#19979;&#20219;&#24847;&#19968;&#31181;&#65306;</p>
<dl>
<dt>XATransaction</dt>
<dd>
<p>&#36164;&#28304;&#36866;&#37197;&#22120;&#36890;&#36807;&#23454;&#29616; LocalTransaction &#21644; XAResource &#25509;&#21475;&#26469;&#25903;&#25345;&#36164;&#28304;&#31649;&#29702;&#22120;&#26412;&#22320;&#20107;&#21153;&#22788;&#29702;&#21644; JTA &#20107;&#21153;&#22788;&#29702;&#12290;XA &#20107;&#21153;&#22788;&#29702;&#30001;&#20107;&#21153;&#22788;&#29702;&#31649;&#29702;&#22120;&#22312;&#36164;&#28304;&#31649;&#29702;&#22120;&#22806;&#37096;&#36827;&#34892;&#25511;&#21046;&#21644;&#35843;&#25972;&#12290;</p>
</dd>
<dt>LocalTransaction</dt>
<dd>
<p>&#36164;&#28304;&#36866;&#37197;&#22120;&#36890;&#36807;&#23454;&#29616; LocalTransaction &#25509;&#21475;&#26469;&#25903;&#25345;&#26412;&#22320;&#20107;&#21153;&#22788;&#29702;&#12290;&#26412;&#22320;&#20107;&#21153;&#22788;&#29702;&#30340;&#31649;&#29702;&#22312;&#36164;&#28304;&#31649;&#29702;&#22120;&#20869;&#37096;&#36827;&#34892;&#65292;&#19981;&#28041;&#21450;&#20219;&#20309;&#22806;&#37096;&#20107;&#21153;&#22788;&#29702;&#31649;&#29702;&#22120;&#12290;</p>
</dd>
<dt>NoTransaction</dt>
<dd>
<p>&#36164;&#28304;&#36866;&#37197;&#22120;&#19981;&#25903;&#25345;&#36164;&#28304;&#31649;&#29702;&#22120;&#26412;&#22320;&#20107;&#21153;&#22788;&#29702;&#25110; JTA &#20107;&#21153;&#22788;&#29702;&#65292;&#20063;&#19981;&#23454;&#29616; XAResource &#25110; LocalTransaction &#25509;&#21475;&#12290;</p>
</dd>
</dl>
</dd>
<dt>&#20854;&#20182;&#23646;&#24615;</dt>
<dd>
<p>&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&#30340;&#20854;&#20182;&#23646;&#24615;&#12290;&#21487;&#29992;&#23646;&#24615;&#21462;&#20915;&#20110;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&#30340;&#36164;&#28304;&#36866;&#37197;&#22120;&#12290;&#21487;&#20197;&#20351;&#29992;&#22312;&#27492;&#34920;&#20013;&#25351;&#23450;&#30340;&#21517;&#31216;/&#20540;&#23545;&#65292;&#35206;&#30422;&#30001;&#36164;&#28304;&#36866;&#37197;&#22120;&#25552;&#20379;&#26041;&#23450;&#20041;&#30340;&#23646;&#24615;&#40664;&#35748;&#20540;&#12290;</p>
<p>&#22914;&#26524;&#24744;&#20026;&#23646;&#24615;&#25351;&#23450;&#20102;&#21517;&#31216;&#32780;&#27809;&#26377;&#25351;&#23450;&#20540;&#65292;&#21017;&#22312;&#21019;&#24314;&#23436;&#36830;&#25509;&#27744;&#26102;&#65292;&#35813;&#23646;&#24615;&#23558;&#20174;&#34920;&#20013;&#21024;&#38500;&#12290;&#22914;&#26524;&#24744;&#29616;&#22312;&#19981;&#24076;&#26395;&#35774;&#32622;&#26576;&#20010;&#23646;&#24615;&#30340;&#20540;&#65292;&#20294;&#24076;&#26395;&#23558;&#35813;&#23646;&#24615;&#20445;&#30041;&#22312;&#34920;&#20013;&#20197;&#20415;&#22312;&#20197;&#21518;&#35774;&#32622;&#20540;&#65292;&#35831;&#22312;&ldquo;&#20540;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#19968;&#23545;&#31354;&#25324;&#21495;&#65306;</p>
<pre>
()
</pre></dd>
</dl>
<a id="sthref73" name="sthref73"></a>
<h5>&#30456;&#20851;&#20219;&#21153;</h5>
<ul>
<li>
<p><a href="task-connectorconnectionpoolnew.html">&#21019;&#24314;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">&#32534;&#36753;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">&#32534;&#36753;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&#39640;&#32423;&#23646;&#24615;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">&#32534;&#36753;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&#23646;&#24615;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">&#21019;&#24314;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&#30340;&#23433;&#20840;&#26144;&#23556;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">&#32534;&#36753;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&#30340;&#23433;&#20840;&#26144;&#23556;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">&#21024;&#38500;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&#30340;&#23433;&#20840;&#26144;&#23556;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">&#21024;&#38500;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;</a></p>
</li>
</ul>
<a id="sthref74" name="sthref74"></a>
<h5>&#30456;&#20851;&#30340; asadmin &#21629;&#20196;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00018"><code>create-connector-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00157"><code>list-connector-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00070"><code>delete-connector-connection-pool</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
