<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-connectorconnectionpooladvance" name="task-connectorconnectionpooladvance"></a></p>

<h4><a id="sthref14" name="sthref14"></a>&#32534;&#36753;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&#39640;&#32423;&#23646;&#24615;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#23548;&#33322;&#26641;&#20013;&#65292;&#23637;&#24320;&ldquo;&#36164;&#28304;&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#23637;&#24320;&ldquo;&#36830;&#25509;&#22120;&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#36830;&#25509;&#22120;&rdquo;&#33410;&#28857;&#19979;&#65292;&#36873;&#25321;&ldquo;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&rdquo;&#33410;&#28857;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&rdquo;&#39029;&#19978;&#65292;&#21333;&#20987;&#35201;&#32534;&#36753;&#30340;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&#30340;&#21517;&#31216;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#32534;&#36753;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#32534;&#36753;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&rdquo;&#39029;&#19978;&#65292;&#21333;&#20987;&ldquo;&#39640;&#32423;&rdquo;&#36873;&#39033;&#21345;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#32534;&#36753;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&#39640;&#32423;&#23646;&#24615;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26368;&#22810;&#39564;&#35777;&#19968;&#27425;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#20197;&#31186;&#20026;&#21333;&#20301;&#30340;&#19968;&#27573;&#26102;&#38388;&#65292;&#32463;&#36807;&#36825;&#27573;&#26102;&#38388;&#21518;&#65292;&#26368;&#22810;&#39564;&#35777;&#36830;&#25509;&#19968;&#27425;&#12290;</p>
<p>&#23558;&#35813;&#23646;&#24615;&#35774;&#32622;&#20026;&#36866;&#24403;&#30340;&#20540;&#21487;&#20197;&#26368;&#22823;&#31243;&#24230;&#20943;&#23569;&#36830;&#25509;&#30340;&#39564;&#35777;&#35831;&#27714;&#25968;&#12290;&#40664;&#35748;&#20540;&#20026; 0&#65292;&#34920;&#31034;&#26410;&#21551;&#29992;&#35813;&#23646;&#24615;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#27844;&#28431;&#36229;&#26102;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#29992;&#20110;&#22312;&#36830;&#25509;&#27744;&#20013;&#36319;&#36394;&#36830;&#25509;&#27844;&#28431;&#30340;&#26102;&#38388;&#38271;&#24230; (&#31186;)&#12290;</p>
<p>&#22914;&#26524;&#20540;&#20026; 0&#65292;&#21017;&#34920;&#31034;&#31105;&#29992;&#36830;&#25509;&#27844;&#28431;&#36319;&#36394;&#12290;&#40664;&#35748;&#20540;&#20026; 0&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#27844;&#28431;&#22238;&#25910;&rdquo;&#22797;&#36873;&#26694;&#65292;&#22312;&#23436;&#25104;&#27844;&#28431;&#36830;&#25509;&#36319;&#36394;&#21518;&#23558;&#27844;&#28431;&#30340;&#36830;&#25509;&#36824;&#21407;&#21040;&#27744;&#20013;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#21019;&#24314;&#37325;&#35797;&#23581;&#35797;&#27425;&#25968;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#21019;&#24314;&#26032;&#30340;&#36830;&#25509;&#22833;&#36133;&#21518;&#36827;&#34892;&#23581;&#35797;&#30340;&#27425;&#25968;&#12290;</p>
<p>&#22914;&#26524;&#20540;&#20026; 0&#65292;&#21017;&#34920;&#31034;&#19981;&#20250;&#23581;&#35797;&#20877;&#27425;&#21019;&#24314;&#36830;&#25509;&#12290;&#40664;&#35748;&#20540;&#20026; 0&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#37325;&#35797;&#26102;&#38388;&#38388;&#38548;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#20004;&#27425;&#23581;&#35797;&#21019;&#24314;&#36830;&#25509;&#20043;&#38388;&#30340;&#26102;&#38388;&#38388;&#38548; (&#31186;)&#12290;</p>
<p>&#20165;&#24403;&ldquo;&#21019;&#24314;&#37325;&#35797;&#23581;&#35797;&#27425;&#25968;&rdquo;&#30340;&#20540;&#22823;&#20110; 0 &#26102;&#25165;&#20351;&#29992;&#27492;&#23646;&#24615;&#12290;&#40664;&#35748;&#20540;&#20026; 10 &#31186;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#20849;&#20139;&rdquo;&#22797;&#36873;&#26694;&#21487;&#20197;&#21551;&#29992;&#27744;&#30340;&#36830;&#25509;&#20849;&#20139;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#21551;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#24310;&#36831;&#20851;&#32852;&rdquo;&#22797;&#36873;&#26694;&#65292;&#20197;&#20415;&#22312;&#23545;&#36830;&#25509;&#25191;&#34892;&#25805;&#20316;&#26102;&#65292;&#24310;&#36831;&#20851;&#32852;&#36830;&#25509;&#12290;</p>
<p>&#24403;&#23436;&#25104;&#20107;&#21153;&#22788;&#29702;&#24182;&#19988;&#32467;&#26463;&#32452;&#20214;&#26041;&#27861;&#26102;&#65292;&#23545;&#36830;&#25509;&#21462;&#28040;&#20851;&#32852;&#65292;&#36825;&#26377;&#21161;&#20110;&#37325;&#26032;&#20351;&#29992;&#29289;&#29702;&#36830;&#25509;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#24310;&#36831;&#36830;&#25509;&#30331;&#35760;&rdquo;&#22797;&#36873;&#26694;&#65292;&#20165;&#24403;&#22312;&#26041;&#27861;&#20013;&#23454;&#38469;&#20351;&#29992;&#36164;&#28304;&#26102;&#25165;&#23558;&#36164;&#28304;&#28155;&#21152;&#33267;&#20107;&#21153;&#22788;&#29702;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#19982;&#32447;&#31243;&#20851;&#32852;&rdquo;&#22797;&#36873;&#26694;&#65292;&#20197;&#23558;&#36830;&#25509;&#19982;&#32447;&#31243;&#20851;&#32852;&#12290;</p>
<p>&#22914;&#26524;&#21516;&#19968;&#20010;&#32447;&#31243;&#38656;&#35201;&#36830;&#25509;&#65292;&#21017;&#35813;&#32447;&#31243;&#21487;&#20197;&#37325;&#26032;&#20351;&#29992;&#24050;&#19982;&#20854;&#20851;&#32852;&#30340;&#36830;&#25509;&#65292;&#22240;&#27492;&#19981;&#20250;&#23548;&#33268;&#20174;&#27744;&#20013;&#33719;&#21462;&#36830;&#25509;&#30340;&#24320;&#38144;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#21305;&#37197;&#36830;&#25509;&rdquo;&#22797;&#36873;&#26694;&#65292;&#20026;&#27744;&#21551;&#29992;&#36830;&#25509;&#21305;&#37197;&#12290;</p>
<p>&#22914;&#26524;&#24744;&#30693;&#36947;&#27744;&#20013;&#30340;&#36830;&#25509;&#23558;&#22987;&#32456;&#21516;&#26500;&#65292;&#22240;&#27492;&#20174;&#27744;&#20013;&#36873;&#25321;&#30340;&#36830;&#25509;&#19981;&#38656;&#35201;&#30001;&#36164;&#28304;&#36866;&#37197;&#22120;&#36827;&#34892;&#21305;&#37197;&#65292;&#35831;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#21551;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#21305;&#37197;&#36830;&#25509;&#20351;&#29992;&#27425;&#25968;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#27744;&#21487;&#20197;&#37325;&#26032;&#20351;&#29992;&#36830;&#25509;&#30340;&#27425;&#25968;&#12290;</p>
<p>&#36830;&#25509;&#22312;&#37325;&#22797;&#20351;&#29992;&#25351;&#23450;&#30340;&#27425;&#25968;&#21518;&#23558;&#34987;&#20851;&#38381;&#12290;&#22914;&#26524;&#20540;&#20026; 0&#65292;&#21017;&#34920;&#31034;&#19981;&#21551;&#29992;&#27492;&#23646;&#24615;&#12290;&#40664;&#35748;&#20540;&#20026; 0&#12290;</p>
</li>
<li>
<p>&#21333;&#20987;&ldquo;&#20445;&#23384;&rdquo;&#12290;</p>

<hr>
<p><b>&#25552;&#31034;:</b></p>
&#35201;&#36820;&#22238;&#21040;&#40664;&#35748;&#35774;&#32622;&#65292;&#35831;&#21333;&#20987;&ldquo;&#21152;&#36733;&#40664;&#35748;&#20540;&rdquo;&#25353;&#38062;&#65292;&#28982;&#21518;&#21333;&#20987;&ldquo;&#20445;&#23384;&rdquo;&#12290;<br />
<hr>

</li>
</ol>
<a id="sthref15" name="sthref15"></a>
<h5>&#21478;&#35831;&#21442;&#38405;</h5>
<ul>
<li>
<p><a href="task-connectorresourcenew.html">&#21019;&#24314;&#36830;&#25509;&#22120;&#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-connectorresourceedit.html">&#32534;&#36753;&#36830;&#25509;&#22120;&#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-connectorresourcesdelete.html">&#21024;&#38500;&#36830;&#25509;&#22120;&#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolnew.html">&#21019;&#24314;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">&#32534;&#36753;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">&#32534;&#36753;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&#23646;&#24615;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">&#21019;&#24314;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&#30340;&#23433;&#20840;&#26144;&#23556;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">&#32534;&#36753;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&#30340;&#23433;&#20840;&#26144;&#23556;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">&#21024;&#38500;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;&#30340;&#23433;&#20840;&#26144;&#23556;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">&#21024;&#38500;&#36830;&#25509;&#22120;&#36830;&#25509;&#27744;</a></p>
</li>
<li>
<p><a href="task-setupeisaccess.html">&#35774;&#32622; EIS &#35775;&#38382;&#26435;&#38480;</a></p>
</li>
<li>
<p><a href="task-adminobjectnew.html">&#21019;&#24314;&#21463;&#31649;&#29702;&#23545;&#35937;&#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-adminobjectedit.html">&#32534;&#36753;&#21463;&#31649;&#29702;&#23545;&#35937;&#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-administeredobjectresourcedelete.html">&#21024;&#38500;&#21463;&#31649;&#29702;&#23545;&#35937;&#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-worksecuritymapnew.html">&#21019;&#24314;&#24037;&#20316;&#23433;&#20840;&#26144;&#23556;</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">&#32534;&#36753;&#24037;&#20316;&#23433;&#20840;&#26144;&#23556;</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">&#21024;&#38500;&#24037;&#20316;&#23433;&#20840;&#26144;&#23556;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
