<!DOCTYPE html PUBLIC "-//Tigris//DTD XHTML 1.0 Transitional//EN" "http://style.tigris.org/nonav/tigris_transitional.dtd">
<html>
<head>
  <title>Das GlassFish-Projekt &ndash; Erste Schritte</title>
  <meta http-equiv="Content-Type"

 content="text/html; charset=windows-1252">
  <meta http-equiv="CONTENT-TYPE" content="text/html; charset=utf-8">
</head>
<body style="color: rgb(0, 0, 0); background-color: rgb(255, 255, 255);">
<div id="projecthome" class="app"><font size="+1"><span

 style="font-weight: bold;">Erstellung des GlassFish-Projekts</span></font><br> <a href="#pre_req">Voraussetzungen f&uuml;r die Erstellung von GlassFish</a><br> <a

 href="http://wiki.glassfish.java.net/Wiki.jsp?page=BuildInformation#qs">Kurzanleitung</a><span style="font-weight: bold;"></span><br> <a href="#Complete_Instructions_on_how_to_Build">Vollst&auml;ndige Anweisungen zur Erstellung</a><br> <a href="http://www.netbeans.org/kb/41/glassfish.html">GlassFish-Erstellung mit NetBeans IDE</a><br> <a href="BuildGlassFish.html#Branch">Erstellung auf Basis eines bestimmten Zweiges</a><br> <a href="#maven_goals">&Uuml;berblick &uuml;ber die Maven-Goals von GlassFish</a><br> <br> Auf dieser Seite wird beschrieben, wie GlassFish erstellt wird. &Uuml;ber die nachfolgenden Links k&ouml;nnen Sie <a

 href="https://glassfish.dev.java.net/public/NewtoGlsasFish.html#Submit_a_Bug">einen Bug melden</a> oder <a

 href="https://glassfish.dev.java.net/public/NewtoGlsasFish.html#Request_a_Feature">ein Feature anfordern</a>. Die Projektrichtlinien finden Sie <a

 href="https://glassfish.dev.java.net/public/GovernancePolicy.html">hier</a>.<br>
<p><span style="font-weight: bold;"></span></p>
<h3><a name="Complete_Instructions_on_how_to_Build"></a>Vollst&auml;ndige Anweisungen zur Erstellung von GlassFish</h3>
GlassFish kann mithilfe von NetBeans oder unter Verwendung von Befehlszeilenoptionen erstellt werden. Der folgende Artikel enth&auml;lt weiterf&uuml;hrende Informationen zu <a

 href="http://www.netbeans.org/kb/41/glassfish.html">Erstellung und Entwicklung des GlassFish-Projekts mit NetBeans</a>. Befehlszeilenoptionen f&uuml;r die Erstellung von GlassFish finden Sie unten.<br> <br> <span style="font-weight: bold;"><a name="pre_req"></a>Voraussetzungen f&uuml;r die Erstellung von GlassFish </span><br>
<ul>
  <li>Der Benutzer muss <a

 href="http://maven.apache.org/maven-1.x/start/download.html">Maven</a> (1.0.2) installiert haben: Auf diese Weise wird das lokale Repository erstellt, das Maven zur Speicherung von GlassFish-Abh&auml;ngigkeiten ben&ouml;tigt.</li>
  <li>Der Benutzer muss &uuml;ber ein Login auf java.net verf&uuml;gen und Zugriff auf das CVS-Repository f&uuml;r das GlassFish-Projekt besitzen.</li>
  <li>Der Benutzer muss sich einmalig am GlassFish-CVS-Repository anmelden (damit CVS das Passwort in der .cvspass-Datei im Basisverzeichnis des Benutzers speichert).</li>
  <li><a href="http://java.sun.com/j2se/1.5.0/download.jsp">J2SE 5.0</a> (1.5.0_12) muss installiert, als JAVA_HOME-Umgebungsvariable und im Suchpfad f&uuml;r die ausf&uuml;hrbaren Dateien konfiguriert sein. Es wird empfohlen, die neueste Version zu verwenden.<br>
  </li>
  <li>Der <a

 href="https://glassfish.dev.java.net/servlets/ProjectSource#wincvs">CVS-Client</a> muss gem&auml;&szlig; den Anweisungen auf java.net eingerichtet werden.<br>
  </li>
</ul>
<span style="font-weight: bold;">Schritte zur Erstellung von GlassFish:</span><br>
<ol>
</ol>
<div style="margin-left: 40px;">Der erste Schritt besteht darin, die Modulabh&auml;ngigkeiten und gemeinsam genutzten Dateien auszuchecken, die im Build-System verwendet werden, und die Eigenschaftendatei zu bearbeiten.</div>
<ol>
  <pre>% mkdir workspace<br>% cd workspace<br>% cvs -d :pserver:&lt;userid&gt;@cvs.dev.java.net:/cvs checkout glassfish/bootstrap<br></pre>
Dadurch werden project.xml, maven.xml, project.properties und alle gemeinsam genutzten Dateien heruntergeladen, die in project.xml referenziert werden.<br>
</ol>
<div style="margin-left: 40px;">Erstellen Sie &quot;workspace/glassfish/bootstrap/build.properties&quot;, oder erstellen Sie f&uuml;r eine wiederverwendbare GlassFish-Arbeitsumgebung &quot;${HOME}/build.properties&quot; (Unix) oder &quot;%HOMEPATH%\build.properties&quot; (Windows), und setzen Sie die folgenden Variablen: (Sie k&ouml;nnen den Wert f&uuml;r &quot;%HOMEPATH%&quot; &uuml;ber den folgenden Befehl abrufen: echo %HOMEPATH% oder Ausf&uuml;hrung von &quot;set&quot; und Suchen nach der HOMEPATH-Variable [Windows])<br> Definieren Sie zwei GlassFish-Variablen: glassfish.os.name, glassfish.cvs.username, <a href="BuildGlassFish.html#configuration">wie oben</a>.<br> glassfish.os.name= &lt;Betriebssystemname &ndash; m&ouml;gliche Werte sind WINNT, SunOS, Linux, SunOS_X86, Darwin&gt;<br> glassfish.cvs.username= &lt;java.net id&gt;<br>
</div>
<ol>
Beispiel f&uuml;r Windows XP Professional<br> <code>glassfish.os.name=WINNT<br> glassfish.cvs.username=carlavmott<br></code> <br>
  <li>Als N&auml;chstes checken Sie die Quellen aus.</li>
  <pre>% cd glassfish/bootstrap<br>% maven checkout<br></pre>
Bekannte Einschr&auml;nkung: Einige der f&uuml;r die Erstellung von GlassFish erforderlichen Quellen stehen auf java.net m&ouml;glicherweise nicht direkt zur Verf&uuml;gung (beispielsweise MQ, ORB, JWSDP 2.0 usw.). Diese werden vorl&auml;ufig als bin&auml;re Abh&auml;ngigkeiten behandelt. (Verwendung bin&auml;rer Abh&auml;ngigkeiten siehe n&auml;chster Schritt.) Sie k&ouml;nnen durch den folgenden Aufruf auch nur ausgew&auml;hlte Module auschecken:<br>
  <pre>% maven checkout -Dmodules=<span style="font-family: monospace;">[</span>Durch Komma getrennte Liste der Modulnamen]   </pre>
  <p>Die Modulnamen finden Sie auf dieser <a

 href="http://wiki.java.net/bin/view/Projects/GlassFishModuleOwners">Seite</a>.<span

 style="font-family: monospace;"></span></p>
  <li>F&uuml;hren Sie ein Bootstrap des Server-Image durch (eine Sammlung aus Skripts und JAR-Dateien zur Ausf&uuml;hrung von GlassFish). Entwickler k&ouml;nnen die Option &quot;bootstrap&quot; w&auml;hlen, &uuml;ber die der vorgefertigte Server heruntergeladen und nur ein Teilsatz der Module erstellt wird. Alternativ kann &uuml;ber die Option &quot;bootstrap-all&quot; der Server von Grund auf neu erstellt werden. Erstellen Sie anschlie&szlig;end alle Module, um Versions&auml;nderungen in Modul- oder bin&auml;ren Abh&auml;ngigkeiten zu &uuml;berpr&uuml;fen.<br>
  </li>
  <span style="font-weight: bold;"><br>Option </span><b>bootstrap-all</b>: Erstellt alle Module aus den Quellen.<br>
  <pre>% maven bootstrap-all </pre>
  Option <b>bootstrap</b>: Erstellen Sie Ihr eigenes Modul unter Verwendung des vorgefertigten Servers<br>
  <pre>% maven bootstrap</pre>
Dieser Schritt ist optional, wenn Sie bereits einen Promoted-Build von GlassFish installiert haben. Zur Verwendung des Promoted-Build m&uuml;ssen Sie die Eigenschaft in &quot;glassfish/project.properties&quot; setzen.
  <pre wrap="">glassfish.image.version=&lt;&lt;Build-Version&gt;&gt;</pre>
Auf diese Weise &quot;zeigt&quot; das Build-System auf diese Installation. Diese Eigenschaft kann auch zu &quot;${HOME}/build.properties&quot; hinzugef&uuml;gt werden.<br> <br>
  <li>Erstellen Sie den ausgecheckten Quellcode. Die Reihenfolge der Kompilierung wird durch eine allgemeine Konfigurationsdatei vorgegeben, die in Schritt 2 ausgecheckt wurde. <strong>Durch diesen Schritt wird das installierte Image nach jeder Modulkompilierung aktualisiert</strong>.<br>
  </li>
  <pre>% maven build<br></pre>
Sie k&ouml;nnen durch den folgenden Aufruf jederzeit ausgew&auml;hlte Module erstellen:<br>
  <pre>% maven build -Dmodules<i style="font-style: italic;">=</i><span

 style="font-family: monospace;">[</span>Durch Komma getrennte Liste der Modulnamen] </pre>
oder wechseln Sie zu ../[Modulname], und f&uuml;hren Sie folgenden Befehl aus:<br>
  <pre>% maven build<br></pre>
  <li>Konfigurieren Sie die Laufzeitumgebung f&uuml;r den GlassFish-Server. In diesem Schritt wird das asadmin-Skript erstellt, create-domain ausgef&uuml;hrt usw., um den GlassFish-Server ausf&uuml;hren zu k&ouml;nnen.<br>
  </li>
  <pre>% maven configure-runtime   (Standard ist die stille Installation) </pre>
Wenn Sie allgemeine Konfigurationsinformationen angeben m&ouml;chten (z. B. Portnummern usw.), verwenden Sie configure-runtime im ausf&uuml;hrlichen Modus. &nbsp;
  <pre>% maven configure-runtime -Dinteractive<br></pre>
Im Allgemeinen muss dieser Befehl nur einmalig ausgef&uuml;hrt werden. Bei &Auml;nderung der Dom&auml;nenumgebung muss eine Neukonfiguration vorgenommen werden, siehe hierzu die h&auml;ufig gestellten Fragen. Standardwerte f&uuml;r die Laufzeitkonfiguration befinden sich in &quot;glassfish/bootstrap/project.properties&quot;:<br>
  <pre>domain.name=&quot;domain1&quot;<br>instance.name=&quot;server&quot;<br>admin.user=&quot;admin&quot;<br>admin.password=&quot;adminadmin&quot;<br>admin.port=&quot;4848&quot;<br>instance.port&quot;=&quot;8080&quot;<br>orb.port=&quot;3700&quot;<br>imq.port=&quot;7676&quot;<br>https.port=&quot;8181&quot; <br></pre>
Maven-Goal 'configure-runtime' erstellt eine Dom&auml;ne mit einer einzelnen Instanz, &auml;hnlich wie GlassFish V1. Wenn Sie die Cluster-Modus-Dom&auml;ne von GlassFish V2 erstellen m&ouml;chten, f&uuml;hren Sie den folgenden Befehl aus:<br> <code>% maven configure-cluster</code><br>
  <li>
    <p>Starten Sie den Server unter Verwendung des folgenden Befehls. Alle GlassFish-Serverbefehle befinden sich im Verzeichnis &quot;&lt;glassfish.root&gt;/publish/bin&quot;. Eine weiterf&uuml;hrende Dokumentation zur Serververwaltung finden Sie in der <a href="http://docs.sun.com/source/819-1004/QuickStart.html">Dokumentation</a> zu Sun Java System Application Server PE, Versionsreihe 8. Ein Gro&szlig;teil der hier enthaltenen Informationen gilt auch f&uuml;r Version 9. Hinweis: Derzeit unterst&uuml;tzt GlassFish ausschlie&szlig;lich Befehlszeilenoptionen f&uuml;r alle Plattformen.<br>
    </p>
  </li>
  <pre>% asadmin start-domain</pre>
  <li>
    <p>Server bereinigen. <br>
    </p>
  </li>
  <pre>% maven clobber<br></pre>
Auf diese Weise werden alle Skripts und JAR-Dateien entfernt, die zur Ausf&uuml;hrung des Servers ben&ouml;tigt werden. Es werden alle Elemente unterhalb von &quot;glassfish.home&quot; entfernt, und nach Abschluss der Bereinigung m&uuml;ssen Sie zu Schritt 2 zur&uuml;ckkehren.<br> <br>
  <li>Build/Server bereinigen<span style="font-weight: bold;">: </span>Sie k&ouml;nnen w&auml;hrend der Entwicklung ein beliebiges der drei oben gezeigten Goals verwenden. Aktualisieren Sie die Quellen unter Verwendung Ihrer bevorzugten IDE, und verwenden Sie einen der folgenden Befehle f&uuml;r eine bereits erstellte Arbeitsumgebung, um die Arbeitsumgebung in ihren urspr&uuml;nglichen Zustand zur&uuml;ckzuversetzen und die vorgenommenen &Auml;nderungen zu &uuml;berpr&uuml;fen. </li>
  <ul>
    <li>Sie bereinigen die Module, indem Sie vom Build generierte Dateien wie .class, .properties l&ouml;schen und eine Neukompilierung vorbereiten. F&uuml;hren Sie dazu den folgenden Befehl aus:
      <pre>% maven clean (oder maven -Dmodules=mail,activation clean)</pre>
    </li>
    <li>Um den in Schritt 5 konfigurierten Server zu bereinigen, verwenden Sie den nachstehenden Befehl. Auf diese Weise werden der Administrationsserver und domain1 gel&ouml;scht und der Server wird in den urspr&uuml;nglichen Installationszustand zur&uuml;ckversetzt.  (L&ouml;scht neu generierte, per Token ersetzte Dateien in ${glassfish.home}/bin und config-Verzeichnissen.)
      <pre>% maven clean-config</pre>
    </li>
    <li>Sie k&ouml;nnen &quot;maven clean-config&quot; verwenden, wenn Sie Ihre &Auml;nderungen in Bezug auf Dom&auml;nen- und Administrationsserverstart &uuml;berpr&uuml;fen m&ouml;chten. Das Goal &quot;clobber&quot; kann zum L&ouml;schen des Servers verwendet werden, wenn Sie einen neuen Server erstellen m&ouml;chten. Durch Verwendung von &quot;clean&quot; werden Build-Dateien gel&ouml;scht und eine Kompilierung vorbereitet.<br>
    </li>
  </ul>
  <br>
  <li><span style="font-weight: bold;">F&uuml;hren Sie Quicklook-Tests aus</span>: Quicklook-Tests erm&ouml;glichen es dem Entwickler, einen Gro&szlig;teil der Funktionalit&auml;t im Anwendungsserver zu testen und einen Basischeck auszuf&uuml;hren, um sicherzustellen, dass keine schwer wiegenden Fehler vorliegen. <br>
  </li>
  <ul>
    <li>Laden Sie die erforderlichen Testf&auml;lle von &quot;glassfish/appserv-tests&quot; herunter, wie nachstehend beschrieben.<br>
    </li>
    <pre>% cd glassfish/bootstrap<br>% maven checkout-quicklook</pre>
    <li>Setzen Sie <code>APS_HOME</code>. Dies ist das Verzeichnis, in dem Sie die Arbeitsumgebung einschlie&szlig;lich Root-Name der Arbeitsumgebung ausgecheckt haben (z. B. <code>/workspace/appserv-tests</code>)</li>
    <li>Setzen Sie <code>S1AS_HOME</code>. Hierbei handelt es sich um das Installationsverzeichnis f&uuml;r den GlassFish-Server (z. B. <code>/workspace/publish/glassfish</code>)</li>
    <li>Die Installationseigenschaften befinden sich in Abstimmung auf Ihre Installation unter <code>${APS_HOME}/config.properties</code> (z. B. <code>admin.password</code>, <code>http.port</code> usw.). Wenn Sie die Standardwerte ge&auml;ndert haben, bearbeiten Sie diese config.properties-Datei.</li>
    <li>Stellen Sie sicher, dass der Server NICHT ausgef&uuml;hrt wird, wenn Sie die Tests ausf&uuml;hren. Wird der Server bereits ausgef&uuml;hrt, halten Sie ihn an.<br>
    </li>
    <li>F&uuml;hren Sie den Test aus:
      <pre>% cd $APS_HOME<br>% maven runtest<br></pre>
    </li>
    <li>&Ouml;ffnen Sie die Datei <code>${APS_HOME}/test_results.html</code> in einem Browser, und pr&uuml;fen Sie die Ergebnisse.</li>
  </ul>
  <ul>
    <li>Detaillierte Anweisungen zur Ausf&uuml;hrung von Quicklook-Tests finden Sie <a

 href="https://glassfish.dev.java.net/public/GuidelinesandConventions.html#Quicklook_Tests">HIER</a>.</li>
  </ul>
</ol>
<p>Bei Problemen finden Sie im Wiki <a

 href="http://wiki.java.net/bin/view/Projects/GlassFishBuildQuestions">H&auml;ufig gestellte Fragen zur GlassFish-Erstellung</a> weitere Informationen.</p>
<p><b>IDE-Unterst&uuml;tzung</b><br> <br> <font color="#000080"><a href="http://community.java.net/netbeans"><font

 color="#000080"><img src="image/builds-bestSmaller.png" name="Graphic2"

 align="bottom" border="1" height="38" width="75"></font></a></font><a

 href="http://community.java.net/netbeans"> </a><a

 href="http://www.netbeans.org/kb/41/glassfish.html">Erstellung und Entwicklung von GlassFish</a> mit NetBeans 4.1.<br> <br> Weitere Informationen finden Sie in den <a

 href="https://glassfish.dev.java.net/public/GuidelinesandConventions.html#Workspace_Guidelines">Richtlinien zur Arbeitsumgebung</a> und in den <a

 href="https://glassfish.dev.java.net/public/GuidelinesandConventions.html#Commit_Procedures">Hinweisen zum Arbeitsverfahren</a>.&nbsp;Dar&uuml;ber hinaus k&ouml;nnen Sie mithilfe von <a

 href="http://fisheye.cenqua.com/java.net/viewrep/cvs/glassfish">FishEye</a> die &Auml;nderungen in Ihrer Arbeitsumgebung verfolgen.</p>
<p><span style="font-weight: bold;"><a name="Branch"></a><big>Erstellung von Glassfish f&uuml;r FCS, SJSAS91_FCS_BRANCH : </big></span><br>
</p>
<span style="font-weight: bold;"></span>
<p>Nachfolgend werden die Schritte zur Erstellung von GlassFish auf der Basis eines bestimmten Zweiges beschrieben:<br> <code>% mkdir workspace<br> % cd workspace<br> % cvs -d :pserver:&lt;userid&gt;@cvs.dev.java.net:/cvs checkout -r <b>SJSAS91_FCS_BRANCH</b> glassfish/bootstrap</code>
</p>
<p>Da der Zweig &quot;glassfish/bootstrap/project.properties from SJSAS91_FCS_BRANCH&quot; &uuml;ber die Variable &quot;glassfish.cvstag&quot; verf&uuml;gt, setzen Sie &quot;glassfish.cvstag=SJSAS91_FCS_BRANCH&quot;. Die FCS-Zweigquellen werden ausgecheckt und entsprechend erstellt.
</p>
<p>Definieren Sie zwei GlassFish-Variablen: glassfish.os.name, glassfish.cvs.username, <a href="BuildGlassFish.html#configuration">wie oben</a>.
</p>
<p>Anschlie&szlig;end f&uuml;hren Sie folgenden Befehl aus:<br> <code>% cd glassfish/bootstrap<br> % maven checkout <b>bootstrap-all</b> build configure-runtime</code>
</p>
<p>Sie k&ouml;nnen entscheiden, welches Goal Sie zwischen bootstrap und bootstrap-all in den obigen Befehlen ausf&uuml;hren, detaillierte Informationen finden Sie <a

 href="BuildGlassFish.html#maven_goals">hier</a>.</p>
<a name="maven_goals"></a><big><span style="font-weight: bold;">&Uuml;berblick &uuml;ber die Maven-Goals von GlassFish:</span></big><br> <br>
<table style="text-align: left; width: 743px; height: 328px;" border="1"

 cellpadding="2" cellspacing="2">
  <tbody>
    <tr>
      <td

 style="vertical-align: top; font-weight: bold; background-color: rgb(204, 204, 204);">Goal-Name<br>
      </td>
      <td

 style="vertical-align: top; font-weight: bold; background-color: rgb(204, 204, 204);">H&auml;ufig verwendeter Befehl<br>
      </td>
      <td

 style="vertical-align: top; font-weight: bold; background-color: rgb(204, 204, 204);">Beschreibung<br>
      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">bootstrap<br>
      </td>
      <td style="vertical-align: top;">maven -Dmodules=admin <span

 style="font-weight: bold;">bootstrap</span> checkout build<br>
      </td>
      <td style="vertical-align: top;"> Download der Datei &quot;glassfish-image-SNAPSHOT.jar&quot; und extrahieren der Datei unter &quot;${glassfish.home}(Server-Image)&quot;, um individuelle Module zu erstellen<br>
      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">bootstrap-all<br>
      </td>
      <td style="vertical-align: top;">maven checkout <span

 style="font-weight: bold;">bootstrap-all</span> build<br>
      </td>
      <td style="vertical-align: top;">Installieren eines leeren GlassFish-Image, das nur die bin&auml;ren Abh&auml;ngigkeiten enth&auml;lt. Anschlie&szlig;end Download der individuellen bin&auml;ren Abh&auml;ngigkeiten und extrahieren in &quot;${glassfish.home}&quot; sowie Erstellung aller Module aus den Quellen.<br>
      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">checkout </td>
      <td style="vertical-align: top;">maven <span

 style="font-weight: bold;">checkout</span><br>
      </td>
      <td style="vertical-align: top;"> Auschecken eines Moduls<br>
      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">build<br>
      </td>
      <td style="vertical-align: top;">maven <span

 style="font-weight: bold;">build</span><br>
      </td>
      <td style="vertical-align: top;"> Erstellen des Moduls</td>
    </tr>
    <tr>
      <td style="vertical-align: top;">configure-runtime</td>
      <td style="vertical-align: top;">maven <span

 style="font-weight: bold;">configure-runtime</span><br>
      </td>
      <td style="vertical-align: top;"> Konfigurieren von &quot;${glassfish.home}&quot; mit einer Einzelinstanzdom&auml;ne<br>
      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">configure-cluster<br>
      </td>
      <td style="vertical-align: top;">maven <span

 style="font-weight: bold;">configure-cluster</span><br>
      </td>
      <td style="vertical-align: top;">Konfigurieren der Dom&auml;ne mit Clusterfunktionen f&uuml;r GlassFish V2<br>
      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">clean </td>
      <td style="vertical-align: top;">maven <span

 style="font-weight: bold;">clean</span> clobber<br>
      </td>
      <td style="vertical-align: top;"> Bereinigen des Moduls</td>
    </tr>
    <tr>
      <td style="vertical-align: top;">clobber<br>
      </td>
      <td style="vertical-align: top;">maven <span

 style="font-weight: bold;">clobber</span><br>
      </td>
      <td style="vertical-align: top;">Bereinigt das GlassFish-Server-Image &ndash; l&ouml;scht das Verzeichnis &quot;${glassfish.home&quot;. Muss mit &quot;bootstrap-all&quot;. Muss verwendet werden, um ein neues Image f&uuml;r die Bereinigung eines besch&auml;digten Server-Image zu erhalten.<br>
      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">clean-config<br>
      </td>
      <td style="vertical-align: top;">maven <span

 style="font-weight: bold;">clean-config</span><br>
      </td>
      <td style="vertical-align: top;">Bereinigt den Server. L&ouml;scht domain1 und per Token ersetzte Dateien in den bin- und config-Verzeichnissen.<br>
      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">-Dmodules=<br>
      </td>
      <td style="vertical-align: top;">maven <span

 style="font-weight: bold;">-Dmodules</span>=admin bootstrap checkout build</td>
      <td style="vertical-align: top;"> Bereinigen/Auschecken/Erstellen einzelner Module: maven -Dmodules={Durch Komma getrennte Liste} goal name</td>
    </tr>
  </tbody>
</table>
<br> <br> <!--EndFragment--></div>
</body>
</html>
