<!DOCTYPE html PUBLIC "-//Tigris//DTD XHTML 1.0 Transitional//EN" "http://style.tigris.org/nonav/tigris_transitional.dtd">

<html>

<head>
<!-- Inserted by TRADOS: --><META HTTP-EQUIV="content-type" CONTENT="text/html; charset=windows-1252">

  <link rel="SHORTCUT ICON" href="../image/glassfish_favicon.gif">

  <title>GlassFish-Entwickler</title>

</head>

<body>
<div class="app">
<p>
Wenn Sie als Entwickler t&auml;tig sind und Teil der Community werden m&ouml;chten, die den ersten kompatiblen Java EE 5-Anwendungsserver implementiert hat, dann sind Sie bei Projekt GlassFish genau richtig!

<p>
Mitglieder der GlassFish-Community werden dazu aufgerufen, sich f&uuml;r eine selbstverwaltete <a href="http://wiki.java.net/bin/view/Projects/GlassFishPeoplePage">Mitgliederseite</a> im GlassFish-Wiki zu registrieren.

Es gibt auch eine etwas sch&ouml;ner gestaltete Seite f&uuml;r die <a href="developers.html">Suche nach Entwicklern</a>, die st&auml;ndig erweitert werden soll.
</p>

<h3>Verstehen des Codes</h3>

<p>
Die Entwicklung eines Anwendungsservers ist ein gro&szlig;es Unterfangen. Die nachstehenden Links erm&ouml;glichen es uns, ein Projekt dieser Gr&ouml;&szlig;enordnung zu organisieren.

<ul>

  <li>Das GlassFish-Projekt ist in <a

 href="https://glassfish.dev.java.net/public/ServerModules.html">Module</a> unterteilt<br>

  </li>

  <li>Lesen Sie die <a

 href="https://glassfish.dev.java.net/nonav/javaee5/api/index.html">javadocs</a>, die mit jedem Promoted-Build aktualisiert werden</li>

  <li><a

 href="https://glassfish.dev.java.net/servlets/ProjectMailingListList">Tauschen Sie sich mit anderen GlassFish-Entwicklern aus</a>, und besprechen Sie in den Mailingslisten Details zur Implementierung. Sie sollten sich in jedem Fall alle verf&uuml;gbaren Mailinglisten anschauen.</li>

  <li>Pr&uuml;fen Sie die Liste der <a

 href="https://glassfish.dev.java.net/public/GuidelinesandConventions.html#Module_Owners">Modulbesitzer</a></li>

  <li>Zeigen Sie eine Aufstellung der <a

 href="https://glassfish.dev.java.net/public/ServerModules.html#Related_GlassFish_Technologies_">Technologien</a> an, die Bestandteil von GlassFish sind<br>

  </li>

</ul>

<h3>Erstellung</h3>

<p>
Die Build-Infrastruktur von GlassFish basiert auf Maven und Ant. Derzeit suchen wir Entwickler, die uns bei der Verbesserung der Build-Infrastruktur helfen, um weniger abh&auml;ngig von Ant zu sein.

<ul>

  <li>Die <a

 href="http://wiki.glassfish.java.net/Wiki.jsp?page=BuildInformation#qs">Kurzanleitung</a> umfasst eine kurze Liste der Schritte, die zum Erstellen des Servers n&ouml;tig sind</li>

  <li>Die <a

 href="BuildGlassFish.html#Complete_Instructions_on_how_to_Build">vollst&auml;ndigen Anweisungen</a> beschreiben die Erstellung von GlassFish im Detail<br>

  </li>

</ul>

<h3>Testen</h3>

<p>In GlassFish stehen derzeit verschiedene Tests zur Verf&uuml;gung. QuickLook-Tests weisen eine kurze Ausf&uuml;hrungszeit auf und decken eine breite Palette an Features im Anwendungsserver ab. Entwicklertests f&uuml;r die verschiedenen Module stehen ebenfalls zur Verf&uuml;gung. Jedes Modul umfasst weitere Informationen zur Ausf&uuml;hrung dieser Tests.</p>

<p>Weitere Informationen finden Sie im <a href="http://wiki.java.net/bin/view/Projects/GlassFishQuality">GlassFish-Qualit&auml;tsportal</a>.</p>

<ul>

  <li>Hier finden Sie einen Nightly- oder Promoted-Build f&uuml;r den <a

 href="https://glassfish.dev.java.net/public/downloadsindex.html">Download</a></li>

  <li>F&uuml;hren Sie einen der verf&uuml;gbaren <a

 href="https://glassfish.dev.java.net/public/GuidelinesandConventions.html#Quicklook_Tests">QuickLook-Tests</a> aus</li>

  <li>Treten Sie dem <a href="http://wiki.java.net/bin/view/Projects/CATfish">CATfish-Programm</a> bei<br></li>

  <li><a

 href="https://glassfish.dev.java.net/public/NewtoGlassFish.html#Submit_a_Bug">Melden Sie einen Bug</a></li>

</ul>

<h3>Code beitragen</h3>

<p>
Sie k&ouml;nnen auf verschiedene Weise zum Projekt GlassFish beitragen: durch Bugfixes, Erweiterungen, neue Features oder sogar ganze Module.

<ul>

  <li>Alle Mitwirkenden m&uuml;ssen eine <a href="https://glassfish.dev.java.net/public/GovernancePolicy.html#SCA_Policy">Vereinbarung f&uuml;r Mitwirkende</a> unterschreiben und einsenden</li>

  <li>Weitere Informationen zu Rollen und Verantwortlichkeiten finden Sie in den <a href="https://glassfish.dev.java.net/public/GovernancePolicy.html">Projektrichtlinien</a> </li>

  <li>S&auml;mtlicher Code, der in die Arbeitsumgebung eingecheckt wird, muss den <a href="https://glassfish.dev.java.net/public/GuidelinesandConventions.html#Coding_Conventions">Codierungkonventionen</a> entsprechen</li>

  <li>Wenn Sie noch nicht als Entwickler registriert sind, lesen Sie die <a href="https://glassfish.dev.java.net/public/GuidelinesandConventions.html#Submit_a_Patch">Vorgehensweise zum Einreichen von Patches</a></li>

  <li>Entwickler m&uuml;ssen sich an die <a href="https://glassfish.dev.java.net/public/GuidelinesandConventions.html#Commit_Procedures">Hinweise zum Arbeitsverfahren</a> halten, wenn sie die Arbeitsumgebung aktualisieren</li>
</ul>

<h3>Beispiele beitragen</h3>

<p>
Wir freuen uns &uuml;ber alle qualitativ hochwertigen Beispiele, die ein Feature oder einen Aspekt von GlassFish oder der Java EE 5-Technologie sinnvoll veranschaulichen. Treten Sie dem <a href="glassfish-samples.dev.java.net">Projekt f&uuml;r GlassFish-Beispiele</a> bei, und bringen Sie das Projekt durch Ihren Beitrag voran.

<p>
Schauen Sie sich auch die Seite <a href="https://glassfish-samples.dev.java.net/new_samples.html">Entwickeln von Beispielen f&uuml;r spezifische Bereiche</a> an

Informieren Sie sich au&szlig;erdem &uuml;ber das <a href="blueprints.dev.java.net">Java Blueprints-Projekt</a> zum Schreiben von Best Practices-Anwendungen.

<p>
Alle Mitwirkenden m&uuml;ssen eine <a href="https://glassfish.dev.java.net/public/GovernancePolicy.html#SCA_Policy">Vereinbarung f&uuml;r Mitwirkende</a> unterschreiben und einsenden



<h3>Dokumentation</h3>

<p>
Ein wichtiger Bestandteil eines Qualit&auml;tsprodukts ist die begleitende Dokumentation. Entw&uuml;rfe verschiedener Handb&uuml;cher des Dokumentationssatzes stehen nun f&uuml;r den Review bereit.

<p>
Detaillierte Informationen zu den als Entwurf verf&uuml;gbaren Handb&uuml;chern finden Sie auf der <a
 href="http://glassfish.dev.java.net/javaee5/docs/DocsIndex.html">Dokumentationsseite</a>. Pr&uuml;fen Sie auch die wachsende <a href="TipsandBlogs.html">Liste der technischen Tipps und Blogs</a> zu Beispielen. Wir freuen uns &uuml;ber Ihr Feedback!

</div>

</body>

</html>

