<!DOCTYPE html PUBLIC "-//Tigris//DTD XHTML 1.0 Transitional//EN" "http://style.tigris.org/nonav/tigris_transitional.dtd">
<html><head>
  <link rel="SHORTCUT ICON" href="../image/glassfish_favicon.gif">
  <style>
   body
   {
    color: black; padding:0px; margin:0px;
    font-size: 0.8em;
    font-family: Verdana, "Verdana CE",  Arial, "Arial CE", "Lucida Grande CE", lucida, "Helvetica CE", sans-serif;
    background-color: #ffffff;
    background-image: none;
    margin: 10px;
   }
   h1
   {
    color: #ee6b00;
    font-weight: normal;
    font-size: 200%;
    padding: 5px 0 0 0;
    margin: 0 5px 0 0;
    border: 0;
   }
   h2
   {
    font-weight: normal;
    font-size: 150%;
   }
   p,h2,h3,h4
   {
    color: black;
    padding: 0 0 5px 0;
    margin: 0;
    border: 0;
   }
   div.buttons
   {
    padding: 10px 0 20px 0;
    border: 0;
   }
   .blue
   {
    color: #1E2A60;
   }

.app H3 {
clear: none;
}
.axial {
display: none;
}
#apphead {
display: none;
}
  </style><title>GlassFish-Benutzer und Anwendungsentwickler</title>

  <meta http-equiv="Content-Type" content="text/html; charset=windows-1252"></head>
<body>
<p>GlassFish ist ein kostenloser Open Source-Anwendungsserver, der die neuesten Features der Java EE 5-Plattform implementiert. Die Java EE 5-Plattform umfasst neueste Versionen von Technologien wie JavaServer Pages (JSP) 2.1, JavaServer Faces (JSF) 1.2, Servlet 2.4, Enterprise JavaBeans 3.0, Java API for Web Services (JAX-WS) 2.0, Java Architecture for XML Binding (JAXB) 2.0, Web Services Metadata f&uuml;r Java 1.0 sowie zahlreiche weitere Technologien. <p>
<br>
<p>Neu bei GlassFish?&nbsp;Erfahren Sie, wie Sie GlassFish herunterladen und installieren, machen Sie erste Schritte mit GlassFish, zeigen Sie einige Screencasts an, und testen Sie die Beispiele im Lernprogramm. Hier finden Sie einen <a href="getstarted.html">&Uuml;berblick &uuml;ber die GlassFish-Seite</a>.</p>
<div id="projecthome" class="app">
<h3>Sie m&ouml;chten...?</h3>
<a href="getstarted.html">Einen &Uuml;berblick anzeigen</a><br> <a href="#Download_and_Run_">Zur Downloadseite wechseln</a><br> <a href="#Learn_and_Write_Applications_with_the">Anwendungen kennenlernen und schreiben</a><br> <a href="#GlassFish_Documentation_Drafts">Die Dokumentation anzeigen</a> <br> <a href="#Contribute_to_the_GlassFish_Community_">Zu GlassFish beitragen</a><br> <a href="#Run_popular_open_source_frameworks_or">G&auml;ngige Open Source-Frameworks oder -Anwendungen ausf&uuml;hren</a><br> <br>
<h3><a name="Download_and_Run_"></a>Download und Ausf&uuml;hrung<br>
</h3>
Sie k&ouml;nnen die stabile oder neuesten Early-Access-Versionen des GlassFish-Anwendungsservers herunterladen. Der Download umfasst eine Bin&auml;rversion des GlassFish Java EE 5-Anwendungsservers, Sie m&uuml;ssen lediglich den Anweisungen folgen und den Server ausf&uuml;hren. Es stehen Downloads f&uuml;r die Ausf&uuml;hrung auf allen g&auml;ngigen Betriebssystemen bereit.<br>
<ul>
  <li>Hier gelangen Sie zum <a href="downloadsindex.html">Download</a>.<br>
  </li>
</ul>
<h3><a name="Learn_and_Write_Applications_with_the"></a>Kennenlernen und Schreiben von Anwendungen mit den neuesten Java EE 5-Technologien</h3>
Der GlassFish-Anwendungsserver implementiert s&auml;mtliche neueste <a href="http://java.sun.com/javaee/5/javatech.html">Java EE 5-Technologien</a>. Schreiben Sie beispielsweise eine Anwendung unter Verwendung aktuellster Web-Tier-Technologien wie z. B. JSF 1.2. Zus&auml;tzlich zu den aktuellsten Technologien k&ouml;nnen Sie vorhandene J2EE 1.4-Anwendungen (oder fr&uuml;here Versionen) auf GlassFish testen und eine Migration durchf&uuml;hren.

<ul>
  <li>Lesen Sie die Informationen im Dokument <a href="http://glassfish.dev.java.net/downloads/quickstart/index.html">Erste Schritte</a> mit GlassFish. Hier finden Sie Anweisungen f&uuml;r die Installation und Ausf&uuml;hrung des GlassFish-Servers sowie eine kleine Beispielanwendung f&uuml;r die Bereitstellung. </li>
  <li>
    Auf der <a href="http://java.sun.com/reference/blueprints/index.html">Java BluePrints-Seite</a> finden Sie Beispiele zur Verwendung von Java EE 5, etwa BluePrints f&uuml;r die Erstellung von AJAX-Anwendungen auf der Java EE 5-Plattform.
  </li>

  <li>
    Entwickeln Sie Java EE-Anwendungen <a href="http://glassfish.dev.java.net/public/netbeans/index.html">mit NetBeans</a> unter Verwendung zweier Lernprogramme, einer einfachen Hello World-Anwendung und einer erweiterten Anwendung mit Nutzung der Java EE 5 Persistence-API.</li><li>In den <a href="https://glassfish.dev.java.net/nonav/javaee5/api/index.html">javadocs</a> k&ouml;nnen Sie sich online informieren, diese werden mit jedem Promoted-Build aktualisiert.</li>
<li>
    Im <a href="http://forums.java.net/jive/forum.jspa?forumID=56">Forum</a> haben Sie die M&ouml;glichkeit, Fragen zu stellen
  </li><li>Die <a href="TipsandBlogs.html">Liste der technischen Tipps und Blogs</a> stellt Beispiele zur Verwendung der Java EE 5-Technologien in GlassFish bereit.</li>
  <li>In <a href="http://blogs.sun.com/roller/page/theaquarium">The Aquarium</a> finden Sie Nachrichten zu anderen Technologien mit Bezug zu GlassFish.<br>
  </li>

</ul>
<div id="projecthome" class="app">
<h3><a name="GlassFish_Documentation_Drafts"></a>GlassFish-Dokumentationsentw&uuml;rfe</h3>
Das GlassFish-Team umfasst auch Dokumentationsautoren, die ihre Entw&uuml;rfe f&uuml;r die Community bereitstellen. Die Dokumente werden w&auml;hrend der Entwicklung von Release V2 aktualisiert, um zus&auml;tzliche Features aufzunehmen.<br>
<ul>
  <li>Auf der <a href="https://glassfish.dev.java.net/javaee5/docs/DocsIndex.html">Dokumentationsseite</a> finden Sie Verweise auf die verf&uuml;gbare Dokumentation. Wir freuen uns &uuml;ber Ihr Feedback!</li>
</ul>
<h3><a name="Contribute_to_the_GlassFish_Community_"></a>Tragen Sie zur GlassFish-Community bei<br>
</h3>
Wir w&uuml;rden uns freuen, wenn Sie sich am Projekt GlassFish beteiligen. Sie haben dazu verschiedene M&ouml;glichkeiten:
    <ul>
      <li><a href="mailto:feedback@glassfish.dev.java.net">Lassen Sie es uns wissen</a>, wenn Sie Ihre Java EE-Anwendung auf GlassFish ausf&uuml;hren<br>
      </li>
      <li><a href="http://forums.java.net/jive/forum.jspa?forumID=56">Nehmen Sie an einer Diskussion im Forum teil</a>, und tauschen Sie sich mit anderen GlassFish-Benutzern aus</li>
      <li><a href="https://glassfish.dev.java.net/public/NewtoGlassFish.html#Submit_a_Bug">Melden Sie einen Bug</a></li>
      <li><a href="https://glassfish.dev.java.net/public/NewtoGlassFish.html#Request_a_Feature">Fordern Sie ein Feature an</a></li>
      <li><a href="http://wiki.java.net/bin/view/Projects/GlassFishQuality">Entwickeln Sie Tests</a> -- weitere Informationen finden Sie im GlassFish-Qualit&auml;tsportal</li>
      <li><a href="devindex.html">Einchecken von Code</a> f&uuml;r den GlassFish-Anwendungsserver</li>
      <li><a href="https://glassfish-samples.dev.java.net">Zu GlassFish beitragen/Entwicklen von Java EE-Beispielen</a></li>
       <li>Treten Sie dem <a href="http://wiki.java.net/bin/view/Projects/CATfish">CATfish-Programm</a> bei<br>
  </li>

    </ul>
<h3><a name="Run_popular_open_source_frameworks_or"></a>Ausf&uuml;hren g&auml;ngiger Open Source-Frameworks oder -Anwendungen</h3>
Auf GlassFish k&ouml;nnen viele g&auml;ngige Open Source-Frameworks und -Anwendungen ausgef&uuml;hrt werden. <a href="http://wiki.java.net/bin/view/Projects/GlassFishExtras">Pr&uuml;fen Sie, ob Ihre bevorzugte Anwendung</a> getestet wurde. Sie k&ouml;nnen Ihre Anwendung nicht finden? Versuchen Sie es, und lassen Sie uns das Ergebnis wissen.<br> <br>
</div>
</div>
</body></html>
