<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-ejbgeneralproperties" name="ref-ejbgeneralproperties"></a></p>

<h4>EJB &#52968;&#53580;&#51060;&#45320; &#44288;&#47144; &#49549;&#49457;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>EJB &#52968;&#53580;&#51060;&#45320;&#47484; &#44396;&#49457;&#54616;&#45716; &#45936; &#49324;&#50857;&#54624; &#49688; &#51080;&#45716; &#49549;&#49457;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;. &#49828;&#47112;&#46300; &#44288;&#47144; &#49549;&#49457;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="http://docs.oracle.com/javase/6/docs/api/java/util/concurrent/ThreadPoolExecutor.html"><code>http://docs.oracle.com/javase/6/docs/api/java/util/concurrent/ThreadPoolExecutor.html</code></a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
<dl>
<dt><code>thread-core-pool-size</code></dt>
<dd>
<p>EJB &#52968;&#53580;&#51060;&#45320; &#44277;&#53685; &#49828;&#47112;&#46300; &#54400;&#51032; &#53076;&#50612; &#49828;&#47112;&#46300; &#49688;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>16</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>thread-max-pool-size</code></dt>
<dd>
<p>EJB &#52968;&#53580;&#51060;&#45320; &#44277;&#53685; &#49828;&#47112;&#46300; &#54400;&#51032; &#52572;&#45824; &#49828;&#47112;&#46300; &#49688;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>32</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>thread-queue-capacity</code></dt>
<dd>
<p><code>thread-core-pool-size</code>&#47484; &#52488;&#44284;&#54616;&#45716; &#49828;&#47112;&#46300;&#44032; &#49892;&#54665; &#51473;&#51064; &#44221;&#50864; &#49352; &#50836;&#52397;&#51012; &#51200;&#51109;&#54616;&#45716; &#49828;&#47112;&#46300; &#54400; &#45824;&#44592;&#50676;&#51032; &#53356;&#44592;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>Integer.MAX_VALUE</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>thread-keep-alive-seconds</code></dt>
<dd>
<p><code>thread-core-pool-size</code>&#47484; &#52488;&#44284;&#54616;&#45716; &#49828;&#47112;&#46300;&#44032; &#51333;&#47308;&#46108; &#44221;&#44284; &#49884;&#44036;(&#52488;)&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>60</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>allow-core-thread-timeout</code></dt>
<dd>
<p><code>true</code>&#47196; &#49444;&#51221;&#46108; &#44221;&#50864;, <code>thread-keep-alive-seconds</code> &#54980; &#53076;&#50612; &#49828;&#47112;&#46300;&#47484; &#48708;&#47215;&#54620; &#47784;&#46304; &#49828;&#47112;&#46300;&#44032; &#51333;&#47308;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>false</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>prestart-all-core-threads</code></dt>
<dd>
<p><code>true</code>&#47196; &#49444;&#51221;&#46108; &#44221;&#50864;, EJB &#52968;&#53580;&#51060;&#45320; &#44277;&#53685; &#49828;&#47112;&#46300; &#54400;&#50640; &#51080;&#45716; &#47784;&#46304; &#53076;&#50612; &#49828;&#47112;&#46300;&#44032; &#49884;&#51089;&#46104;&#50612; &#51089;&#50629;&#51012; &#44592;&#45796;&#47549;&#45768;&#45796;. <code>false</code>&#47196; &#49444;&#51221;&#46108; &#44221;&#50864;, &#49352; &#50836;&#52397;&#51060; &#46020;&#45804;&#54624; &#46412;&#44620;&#51648; &#49828;&#47112;&#46300;&#44032; &#49884;&#51089;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>false</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>disable-nonportable-jndi-names</code></dt>
<dd>
<p><code>true</code>&#47196; &#49444;&#51221;&#46108; &#44221;&#50864;, EJB &#47784;&#46280;&#50640; &#45824;&#54620; GlassFish Server &#53945;&#51221; JNDI &#51060;&#47492;&#51060; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>false</code>&#51077;&#45768;&#45796;.</p>
<p>EJB 3.1 &#49324;&#50577;&#50640;&#45716; &#51060;&#49885; &#44032;&#45733;&#54620; EJB JNDI &#51060;&#47492;&#51060; &#51221;&#51032;&#46104;&#50612; &#51080;&#51004;&#48064;&#47196;, GlassFish Server &#53945;&#51221; JNDI &#51060;&#47492;&#51060; &#54596;&#50836;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; &#50669;&#54840;&#54872;&#49457;&#51012; &#50948;&#54644; GlassFish Server &#53945;&#51221; &#44592;&#48376; JNDI &#51060;&#47492;&#51060; &#51088;&#46041;&#51004;&#47196; &#51201;&#50857;&#46121;&#45768;&#45796;.</p>
</dd>
</dl>





<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
