<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-ejbgeneral" name="ref-ejbgeneral"></a></p>

<h4><a id="sthref5" name="sthref5"></a><a id="sthref6" name="sthref6"></a>EJB(Enterprise Java Bean)</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>EJB(Enterprise Java Bean) &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; EJB &#52968;&#53580;&#51060;&#45320;&#51032; &#49444;&#51221;&#51012; &#44396;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#50644;&#53552;&#54532;&#46972;&#51060;&#51592; Bean&#51032; &#51068;&#48152; &#49444;&#51221; &#50808;&#50640;&#46020; &#54400; &#49444;&#51221; &#48143; &#52880;&#49884; &#49444;&#51221;&#51012; &#44396;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<ul>
<li>
<p>&#54400; &#49444;&#51221;&#51008; Stateless Session Bean&#50640;&#47564; &#51201;&#50857;&#46121;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; &#52968;&#53580;&#51060;&#45320;&#45716; Bean&#51012; &#49373;&#49457;&#54624; &#46412; &#49457;&#45733;&#50640; &#50689;&#54693;&#51012; &#48120;&#52824;&#51648; &#50506;&#44256; &#53364;&#46972;&#51060;&#50616;&#53944; &#50836;&#52397;&#50640; &#51025;&#45813;&#54616;&#44592; &#50948;&#54644; &#50644;&#53552;&#54532;&#46972;&#51060;&#51592; Bean&#51032; &#54400;&#51012; &#50976;&#51648; &#44288;&#47532;&#54633;&#45768;&#45796;.</p>
<p>&#48176;&#52824;&#46108; &#50644;&#53552;&#54532;&#46972;&#51060;&#51592; Bean&#51012; &#49324;&#50857;&#54616;&#45716; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640;&#49436; &#49457;&#45733; &#47928;&#51228;&#44032; &#48156;&#49373;&#54616;&#45716; &#44221;&#50864;&#50640;&#45716; &#54400;&#51012; &#49373;&#49457;&#54624;&#44144;&#45208; &#44592;&#51316; &#54400;&#50640;&#49436; &#50976;&#51648; &#44288;&#47532;&#54616;&#45716; Bean &#49688;&#47484; &#51613;&#44032;&#49884;&#53412;&#47732; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51032; &#49457;&#45733;&#51012; &#54693;&#49345;&#49884;&#53420; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>&#52880;&#49884; &#49444;&#51221;&#51008; Stateful Session Bean&#50640;&#47564; &#51201;&#50857;&#46121;&#45768;&#45796;. &#52968;&#53580;&#51060;&#45320;&#45716; &#51088;&#51452; &#49324;&#50857;&#46104;&#45716; &#50644;&#53552;&#54532;&#46972;&#51060;&#51592; Bean&#50640; &#45824;&#54644; &#50644;&#53552;&#54532;&#46972;&#51060;&#51592; Bean &#45936;&#51060;&#53552; &#52880;&#49884;&#47484; &#50976;&#51648; &#44288;&#47532;&#54633;&#45768;&#45796;. &#51060;&#47111;&#44172; &#54616;&#47732; &#52968;&#53580;&#51060;&#45320;&#44032; &#45796;&#47480; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#47784;&#46280;&#51032; &#50644;&#53552;&#54532;&#46972;&#51060;&#51592; Bean &#45936;&#51060;&#53552; &#50836;&#52397;&#50640; &#48372;&#45796; &#48744;&#47532; &#51025;&#45813;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#52880;&#49884;&#46108; &#50644;&#53552;&#54532;&#46972;&#51060;&#51592; Bean&#51032; &#49345;&#53468;&#45716; &#54876;&#49457;, &#50976;&#55092; &#48143; &#48708;&#54876;&#49457; &#46321;&#51032; &#49464; &#44032;&#51648; &#51473; &#54616;&#45208;&#51077;&#45768;&#45796;. &#54876;&#49457; &#50644;&#53552;&#54532;&#46972;&#51060;&#51592; Bean&#50640;&#45716; &#54788;&#51116; &#53364;&#46972;&#51060;&#50616;&#53944;&#44032; &#50529;&#49464;&#49828;&#54616;&#44256; &#51080;&#49845;&#45768;&#45796;. &#50976;&#55092; &#50644;&#53552;&#54532;&#46972;&#51060;&#51592; Bean&#51032; &#45936;&#51060;&#53552;&#45716; &#54788;&#51116; &#52880;&#49884;&#50640; &#51080;&#51648;&#47564; &#51060; Bean&#50640; &#50529;&#49464;&#49828;&#54616;&#44256; &#51080;&#45716; &#53364;&#46972;&#51060;&#50616;&#53944;&#45716; &#50630;&#49845;&#45768;&#45796;. &#48708;&#54876;&#49457;&#54868;&#46108; Bean&#51032; &#45936;&#51060;&#53552;&#45716; &#51076;&#49884;&#47196; &#51200;&#51109;&#46104;&#50612; &#53364;&#46972;&#51060;&#50616;&#53944;&#50640;&#49436; Bean&#51012; &#50836;&#52397;&#54616;&#45716; &#44221;&#50864; &#52880;&#49884;&#47196; &#45796;&#49884; &#51069;&#54784;&#51665;&#45768;&#45796;.</p>
</li>
</ul>
<p>EJB(Enterprise Java Bean) &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44592;&#48376;&#44050; &#47196;&#46300;</dt>
<dd>
<p>&#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#45716; &#49444;&#51221;&#51012; &#44592;&#48376;&#44050;&#51004;&#47196; &#48373;&#50896;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#49444;&#51221;&#51008; &#48320;&#44221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#44396;&#49457; &#51060;&#47492;</dt>
<dd>
<p>&#51060; &#54168;&#51060;&#51648;&#51032; &#49444;&#51221;&#51060; &#51201;&#50857;&#46104;&#45716; &#44396;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49464;&#49496; &#51200;&#51109; &#50948;&#52824;</dt>
<dd>
<p>&#54028;&#51068; &#49884;&#49828;&#53596;&#50640;&#49436; &#48708;&#54876;&#49457;&#54868;&#46108; Stateful Session Bean &#48143; &#50689;&#44396; HTTP &#49464;&#49496;&#51060; &#51200;&#51109;&#46104;&#50612; &#51080;&#45716; &#46356;&#47113;&#53664;&#47532;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>${com.sun.aas.instanceRoot}/session-store</code>&#51077;&#45768;&#45796;.</p>
<p>&#48708;&#54876;&#49457;&#54868;&#46108; Bean&#51008; &#54028;&#51068; &#49884;&#49828;&#53596;&#51032; &#54028;&#51068;&#50640; &#49345;&#53468;&#47484; &#44592;&#47197;&#54620; Stateful Session Bean&#51077;&#45768;&#45796;. &#48708;&#54876;&#49457;&#54868;&#46108; Bean&#51008; &#51068;&#48152;&#51201;&#51004;&#47196; &#53945;&#51221; &#49884;&#44036; &#46041;&#50504; &#50976;&#55092; &#49345;&#53468;&#50688;&#51004;&#47728; &#54788;&#51116; &#53364;&#46972;&#51060;&#50616;&#53944;&#44032; &#50529;&#49464;&#49828;&#54616;&#44256; &#51080;&#51648; &#50506;&#51008; Bean&#51077;&#45768;&#45796;. &#47560;&#52268;&#44032;&#51648;&#47196; &#50689;&#44396; HTTP &#49464;&#49496;&#51008; &#54028;&#51068; &#49884;&#49828;&#53596;&#51032; &#54028;&#51068;&#50640; &#51088;&#49888;&#51032; &#49345;&#53468;&#47484; &#44592;&#47197;&#54620; &#44060;&#48324; &#50937; &#49464;&#49496;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52964;&#48139; &#50741;&#49496;</dt>
<dd>
<p>&#52968;&#53580;&#51060;&#45320;&#44032; &#53944;&#47004;&#51117;&#49496; &#44036;&#50640; &#48708;&#54876;&#49457;&#54868;&#46108; Bean &#51064;&#49828;&#53556;&#49828;&#47484; &#52880;&#49884;&#54616;&#45716; &#48169;&#49885;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. &#50741;&#49496; B(&#44592;&#48376;&#44050;)&#47484; &#49440;&#53469;&#54616;&#47732; &#52968;&#53580;&#51060;&#45320;&#45716; &#53944;&#47004;&#51117;&#49496; &#44036;&#50640; &#51456;&#48708; &#51064;&#49828;&#53556;&#49828;&#47484; &#52880;&#49884;&#54633;&#45768;&#45796;. &#50741;&#49496; C&#47484; &#49440;&#53469;&#54616;&#47732; &#52968;&#53580;&#51060;&#45320;&#45716; &#53944;&#47004;&#51117;&#49496; &#44036;&#50640; &#51456;&#48708; &#51064;&#49828;&#53556;&#49828;&#47484; &#52880;&#49884;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#52488;&#44592; &#48143; &#52572;&#49548; &#54400; &#53356;&#44592;</dt>
<dd>
<p>&#54400;&#50640;&#49436; &#50976;&#51648;&#54624; &#52572;&#49548; Bean &#49688;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 0&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#45824; &#54400; &#53356;&#44592;</dt>
<dd>
<p>&#52968;&#53580;&#51060;&#45320;&#44032; &#54620; &#48264;&#50640; &#54400;&#50640;&#49436; &#50976;&#51648;&#54624; &#49688; &#51080;&#45716; &#52572;&#45824; Bean &#49688;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 32&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#54400; &#53356;&#44592; &#51312;&#51221; &#44060;&#49688;</dt>
<dd>
<p>Bean&#51060; [&#54400; &#50976;&#55092; &#49884;&#44036; &#52488;&#44284;] &#54596;&#46300;&#50640; &#51648;&#51221;&#46108; &#49884;&#44036; &#51060;&#49345; &#46041;&#50504; &#50976;&#55092; &#49345;&#53468;&#51064; &#44221;&#50864; &#54400;&#50640;&#49436; &#51228;&#44144;&#46104;&#45716; Bean &#49688;&#51077;&#45768;&#45796;. &#51060; &#44050;&#51008; 0&#48372;&#45796; &#53356;&#44144;&#45208; &#44057;&#44256; &#52572;&#45824; &#54400; &#53356;&#44592; &#44050;&#48372;&#45796; &#51089;&#50500;&#50556; &#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 8&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#54400; &#50976;&#55092; &#49884;&#44036; &#52488;&#44284;</dt>
<dd>
<p>&#54400;&#51032; Bean&#51060; &#54400;&#50640;&#49436; &#51228;&#44144;&#46104;&#44592; &#51204;&#44620;&#51648; &#50976;&#55092; &#49345;&#53468;&#47484; &#51648;&#49549;&#54624; &#49688; &#51080;&#45716; &#49884;&#44036;(&#52488;)&#51077;&#45768;&#45796;. &#51060; &#49884;&#44036;&#51060; &#51648;&#45208;&#47732; Bean&#51008; &#49325;&#51228;&#46121;&#45768;&#45796;. &#51060; &#44050;&#51012; 0&#51004;&#47196; &#51648;&#51221;&#54616;&#47732; Bean&#51008; &#47924;&#44592;&#54620; &#50976;&#55092; &#49345;&#53468;&#47484; &#50976;&#51648;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 600&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#45824; &#52880;&#49884; &#53356;&#44592;</dt>
<dd>
<p>&#52880;&#49884;&#50640; &#51200;&#51109;&#54624; &#49688; &#51080;&#45716; &#52572;&#45824; Bean &#49688;&#51077;&#45768;&#45796;. Bean &#49373;&#49457; &#48143; &#49325;&#51228;&#51032; &#50724;&#48260;&#54756;&#46300;&#47484; &#51228;&#44144;&#54616;&#47140;&#47732; &#52880;&#49884;&#54624; &#52572;&#45824; Bean &#49688;&#47484; &#45720;&#47549;&#45768;&#45796;. &#54616;&#51648;&#47564; &#52880;&#49884;&#44032; &#51613;&#44032;&#54616;&#47732; &#49436;&#48260;&#45716; &#45908; &#47566;&#51008; &#47700;&#47784;&#47532;&#50752; &#47532;&#49548;&#49828;&#47484; &#49324;&#50857;&#54633;&#45768;&#45796;. &#50868;&#50689; &#52404;&#51228;&#44032; &#52880;&#49884; &#49444;&#51221;&#50640; &#52649;&#48516;&#54620;&#51648; &#54869;&#51064;&#54616;&#49901;&#49884;&#50724;. &#44050;&#51012; 0&#51004;&#47196; &#51648;&#51221;&#54616;&#47732; &#52880;&#49884;&#50640; &#51228;&#54620;&#51060; &#50630;&#51020;&#51012; &#45208;&#53440;&#45253;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 512&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52880;&#49884; &#53356;&#44592; &#51312;&#51221; &#44060;&#49688;</dt>
<dd>
<p>&#52880;&#49884;&#44032; &#44032;&#46301; &#52268; &#44221;&#50864; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54624; Bean &#49688;&#51077;&#45768;&#45796;. &#52880;&#49884;&#46104;&#45716; Bean&#51032; &#52572;&#45824; &#44060;&#49688;&#50640; &#46020;&#45804;&#54616;&#47732; &#52968;&#53580;&#51060;&#45320;&#45716; &#48177;&#50629; &#51200;&#51109;&#49548;&#50640;&#49436; &#48708;&#54876;&#49457;&#54868;&#46108; &#50668;&#47084; &#44060;&#51032; Bean&#51012; &#51228;&#44144;&#54633;&#45768;&#45796;. &#51060; &#44050;&#51008; &#46608;&#54620; &#54400;&#50640; &#49324;&#50857; &#44032;&#45733;&#54620; Bean&#51060; &#50630;&#51012; &#46412; &#50836;&#52397;&#51060; &#46020;&#52265;&#54616;&#45716; &#44221;&#50864; &#49373;&#49457;&#54624; Bean&#51032; &#44060;&#49688;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;. &#51060; &#44050;&#51008; 1&#48372;&#45796; &#53356;&#44256; &#52572;&#45824; &#52880;&#49884; &#53356;&#44592; &#44050;&#48372;&#45796; &#51089;&#50500;&#50556; &#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 32&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51228;&#44144; &#49884;&#44036; &#52488;&#44284;</dt>
<dd>
<p>&#48708;&#54876;&#49457;&#54868;&#46108; Bean&#51060; &#49464;&#49496; &#51200;&#51109;&#49548;&#50640;&#49436; &#51228;&#44144;&#46104;&#44592; &#51204;&#50640; &#45824;&#44592;&#54616;&#45716; &#49884;&#44036;(&#52488;)&#51077;&#45768;&#45796;. &#51060; &#44050;&#51012; 0&#51004;&#47196; &#51648;&#51221;&#54616;&#47732; &#52968;&#53580;&#51060;&#45320;&#44032; &#48708;&#54876;&#49457; Bean&#51012; &#51088;&#46041;&#51004;&#47196; &#51228;&#44144;&#54616;&#51648; &#50506;&#51020;&#51012; &#45208;&#53440;&#45253;&#45768;&#45796;. &#51228;&#44144; &#49884;&#44036; &#52488;&#44284; &#44050;&#51060; &#52880;&#49884; &#50976;&#55092; &#49884;&#44036; &#52488;&#44284; &#44050;&#48372;&#45796; &#51089;&#44144;&#45208; &#44057;&#51008; &#44221;&#50864; Bean&#51008; &#48708;&#54876;&#49457;&#54868;&#46104;&#51648; &#50506;&#44256; &#48148;&#47196; &#51228;&#44144;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 5400&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51228;&#44144; &#49440;&#53469; &#51221;&#52293;</dt>
<dd>
<p>&#52880;&#49884;&#50640;&#49436; Stateful Session Bean&#51012; &#51228;&#44144;&#54616;&#44592; &#50948;&#54644; &#52968;&#53580;&#51060;&#45320;&#44032; &#49324;&#50857;&#54616;&#45716; &#51221;&#52293;&#51077;&#45768;&#45796;. &#50741;&#49496;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#52572;&#44540;&#50640; &#49324;&#50857;&#46104;&#51648; &#50506;&#51020;(NRU)</dt>
<dd>
<p>&#52572;&#44540;&#50640; &#49324;&#50857;&#46104;&#51648; &#50506;&#51008; Bean&#51012; &#51228;&#44144;&#54633;&#45768;&#45796;. &#51060; &#44050;&#51008; &#44592;&#48376;&#44050;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49440;&#51077;&#49440;&#52636;(FIFO)</dt>
<dd>
<p>&#52880;&#49884;&#50640;&#49436; &#44032;&#51109; &#50724;&#47000;&#46108; Bean&#51012; &#51228;&#44144;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#44032;&#51109; &#50724;&#47000; &#51204;&#50640; &#49324;&#50857;&#46120;(LRU)</dt>
<dd>
<p>&#44032;&#51109; &#50724;&#47000; &#51204;&#50640; &#50529;&#49464;&#49828;&#54620; Bean&#51012; &#51228;&#44144;&#54633;&#45768;&#45796;.</p>
</dd>
</dl>
</dd>
<dt>&#52880;&#49884; &#50976;&#55092; &#49884;&#44036; &#52488;&#44284;</dt>
<dd>
<p>Bean&#51060; &#52880;&#49884;&#50640;&#49436; &#50976;&#55092; &#49345;&#53468;&#47484; &#51648;&#49549;&#54624; &#49688; &#51080;&#45716; &#52572;&#45824; &#49884;&#44036;(&#52488;)&#51077;&#45768;&#45796;. &#51060; &#49884;&#44036;&#51060; &#51648;&#45208;&#47732; &#52968;&#53580;&#51060;&#45320;&#45716; &#51060; Bean&#51012; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#44050;&#51012; 0&#51004;&#47196; &#51648;&#51221;&#54616;&#47732; &#54644;&#45817; Bean&#51008; &#48708;&#54876;&#49457;&#54868; &#54980;&#48372;&#44032; &#46104;&#51648; &#50506;&#49845;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 600&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52628;&#44032; &#49549;&#49457;</dt>
<dd>
<p>EJB &#52968;&#53580;&#51060;&#45320;&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51077;&#45768;&#45796;.</p>
<p>&#49324;&#50857; &#44032;&#45733;&#54620; &#49549;&#49457;&#50640; &#45824;&#54620; &#49444;&#47749;&#51008; <a href="ref-ejbgeneralproperties.html">EJB &#52968;&#53580;&#51060;&#45320; &#44288;&#47144; &#49549;&#49457;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</dd>
</dl>
<a id="sthref7" name="sthref7"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-ejbgeneral.html">EJB &#49444;&#51221;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbmdbpoolsettings.html">MDB &#54400; &#49444;&#51221;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbtimerservice.html">EJB &#53440;&#51060;&#47672; &#49436;&#48708;&#49828; &#44396;&#49457;</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbcontaineravailability.html">EJB &#52968;&#53580;&#51060;&#45320; &#44032;&#50857;&#49457; &#49444;&#51221;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref8" name="sthref8"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<p>&#50630;&#51020;</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
