<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsconnectionproperties" name="ref-jmsconnectionproperties"></a></p>

<h4><a id="sthref57" name="sthref57"></a><a id="sthref58" name="sthref58"></a>Propriedades Espec&iacute;ficas para F&aacute;bricas de Conex&otilde;es JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>As propriedades adicionais a seguir est&atilde;o dispon&iacute;veis para uma f&aacute;brica de conex&otilde;es JMS.</p>
<dl>
<dt><code>ClientId</code></dt>
<dd>
<p>Especifica um ID de cliente para uma f&aacute;brica de conex&otilde;es que ser&aacute; usada por um assinante permanente.</p>
</dd>
<dt><code>AddressList</code></dt>
<dd>
<p>Especifica os nomes (e, opcionalmente, n&uacute;meros de porta) de uma inst&acirc;ncia ou inst&acirc;ncias de broker de mensagem com as quais as aplica&ccedil;&otilde;es v&atilde;o se comunicar. Cada endere&ccedil;o na lista especifica o nome do host (e, opcionalmente, porta do host e servi&ccedil;o de conex&atilde;o) para a conex&atilde;o. Por exemplo, o valor pode ser <code>earth</code> ou <code>earth:7677</code>. Especifique o n&uacute;mero da porta se o broker de mensagem estiver em execu&ccedil;&atilde;o em uma porta que n&atilde;o seja a default (7676). Se a defini&ccedil;&atilde;o da propriedade especificar v&aacute;rios hosts e portas em um ambiente clusterizado, o primeiro host dispon&iacute;vel na lista ser&aacute; usado, a n&atilde;o ser que a propriedade <code>AddressListBehavior</code> esteja definida como <code>RANDOM</code></p>
<p>Para obter detalhes, consulte o <i>Message Queue Developer's Guide for Java Clients</i>.</p>
<p>O valor default &eacute; o host local e o n&uacute;mero da porta local (7676). O cliente tentar&aacute; uma conex&atilde;o com um broker na porta 7676 do host local.</p>
</dd>
<dt><code>UserName</code></dt>
<dd>
<p>O nome de usu&aacute;rio para a f&aacute;brica de conex&otilde;es.</p>
<p>O valor default &eacute; <code>guest</code>.</p>
</dd>
<dt><code>Password</code></dt>
<dd>
<p>A senha para a f&aacute;brica de conex&otilde;es.</p>
<p>O valor default &eacute; <code>guest</code>.</p>
</dd>
<dt><code>ReconnectEnabled</code></dt>
<dd>
<p>Se definido como <code>true</code>, especifica que o runtime do cliente tenta reconectar-se a um servidor de mensagem (ou &agrave; lista de endere&ccedil;os na <code>AddressList</code> quando uma conex&atilde;o &eacute; perdida.</p>
<p>O valor default &eacute; <code>true</code>.</p>
</dd>
<dt><code>ReconnectAttempts</code></dt>
<dd>
<p>Especifica o n&uacute;mero de tentativas para conectar-se (ou reconectar-se) para cada endere&ccedil;o na <code>AddressList</code> antes de o runtime do cliente tentar o novo endere&ccedil;o na lista. Um valor de -1 indica que o n&uacute;mero de tentativas de reconex&atilde;o &eacute; ilimitado (o runtime do cliente tenta conectar-se ao primeiro endere&ccedil;o at&eacute; conseguir).</p>
<p>O valor default &eacute; 3.</p>
</dd>
<dt><code>ReconnectInterval</code></dt>
<dd>
<p>Especifica o intervalo em milissegundos entre tentativas de reconex&atilde;o. Isso aplica-se a tentativas em cada endere&ccedil;o na <code>AddressList</code> e para endere&ccedil;os sucessivos na lista. Se o intervalo for muito curto, o broker n&atilde;o tem tempo para recuperar-se. Se for muito longo, a reconex&atilde;o pode representar um atraso inaceit&aacute;vel.</p>
<p>O valor default &eacute; 30000.</p>
</dd>
<dt><code>AddressListBehavior</code></dt>
<dd>
<p>Especifica se as tentativas de conex&atilde;o est&atilde;o na ordem de endere&ccedil;os no atributo da <code>AddressList</code> (<code>PRIORITY</code>) ou em uma ordem aleat&oacute;ria (<code>RANDOM</code>).</p>
<p><code>RANDOM</code> significa que a reconex&atilde;o escolhe um endere&ccedil;o aleat&oacute;rio na <code>AddressList</code>. Na probabilidade de v&aacute;rios clientes tentarem uma conex&atilde;o usando a mesma f&aacute;brica de conex&otilde;es, esse valor os impede de conectar-se ao mesmo endere&ccedil;o.</p>
<p><code>PRIORITY</code> significa que a reconex&atilde;o sempre tenta conectar-se ao primeiro endere&ccedil;o do servidor na <code>AddressList</code> e usa outro endere&ccedil;o somente se o primeiro broker n&atilde;o estiver dispon&iacute;vel.</p>
<p>O valor default &eacute; <code>RANDOM</code>.</p>
</dd>
<dt><code>AddressListIterations</code></dt>
<dd>
<p>Especifica o n&uacute;mero de vezes que o runtime do cliente itera atrav&eacute;s da <code>AddressList</code>, em um esfor&ccedil;o para estabelecer (ou restabelecer) uma conex&atilde;o. Um valor de -1 indica que o n&uacute;mero de tentativas &eacute; ilimitado.</p>
<p>O valor default &eacute; 3.</p>
</dd>
</dl>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
