<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsphysicaldestnew" name="ref-jmsphysicaldestnew"></a><a id="GHJMS00017" name="GHJMS00017"></a></p>

<h4><a id="sthref92" name="sthref92"></a><a id="sthref93" name="sthref93"></a>Novo Destino F&iacute;sico JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilize a p&aacute;gina Novo Destino F&iacute;sico JMS para criar um novo destino f&iacute;sico JMS.</p>
<p>Normalmente n&atilde;o &eacute; preciso criar destinos f&iacute;sicos, porque voc&ecirc; especifica um nome de destino f&iacute;sico quando cria um recurso de destino JMS e o GlassFish Server cria o destino f&iacute;sico automaticamente quando &eacute; necess&aacute;rio.</p>
<p>A p&aacute;gina Novo Destino F&iacute;sico JMS cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Nome</dt>
<dd>
<p>O nome do destino f&iacute;sico.</p>
</dd>
<dt>Tipo</dt>
<dd>
<p>O tipo do destino f&iacute;sico. As escolhas dispon&iacute;veis s&atilde;o <code>javax.jms.Topic</code> e <code>javax.jms.Queue</code>.</p>
</dd>
<dt>N&uacute;mero M&aacute;ximo de Mensagens N&atilde;o Consumidas</dt>
<dd>
<p>O n&uacute;mero m&aacute;ximo de mensagens n&atilde;o consumidas permitido para o destino. Um valor de -1 indica que n&atilde;o h&aacute; limite para o n&uacute;mero de mensagens n&atilde;o consumidas. O valor default &eacute; -1.</p>
</dd>
<dt>Tamanho M&aacute;ximo da Mensagem</dt>
<dd>
<p>O tamanho m&aacute;ximo, em bytes, de uma &uacute;nica mensagem. Um valor de -1 significa um tamanho de mensagem ilimitado. O valor default &eacute; -1.</p>
</dd>
<dt>Total M&aacute;ximo de Mem&oacute;ria</dt>
<dd>
<p>O total m&aacute;ximo de mem&oacute;ria, em bytes, para mensagens n&atilde;o consumidas. Um valor de -1 indica que n&atilde;o h&aacute; limite para o tamanho da mem&oacute;ria de mensagens n&atilde;o consumidas. O valor default &eacute; -1.</p>
</dd>
<dt>Comportamento para Limite</dt>
<dd>
<p>O comportamento que o broker deve seguir quando o limite de mem&oacute;ria &eacute; atingido. As op&ccedil;&otilde;es dispon&iacute;veis s&atilde;o:</p>
<dl>
<dt>Rejeitar mensagens mais recentes</dt>
<dd>
<p>Rejeita as mensagens mais recentes e notifica o cliente de produ&ccedil;&atilde;o com uma exce&ccedil;&atilde;o somente se a mensagem for persistente. Este &eacute; o valor default.</p>
</dd>
<dt>Diminuir a taxa de produtores</dt>
<dd>
<p>Diminui a taxa com que produtores de mensagem enviam mensagens.</p>
</dd>
<dt>Rejeitar mais antiga</dt>
<dd>
<p>Descarta as mensagens mais antigas.</p>
</dd>
<dt>Rejeitar mensagens de prioridade mais baixa</dt>
<dd>
<p>Descarta as mensagens com a prioridade mais baixa.</p>
</dd>
</dl>
<p>Se o valor for Rejeitar mais antiga ou Rejeitar mensagens de prioridade mais baixa e se a op&ccedil;&atilde;o Usar Fila de Mensagens Inativas estiver definida como Verdadeira, as mensagens em excesso ser&atilde;o movidas para a fila de mensagens inativas.</p>
</dd>
<dt>N&uacute;mero M&aacute;ximo de Produtores</dt>
<dd>
<p>O n&uacute;mero m&aacute;ximo de produtores de mensagens que pode ser associado a este destino f&iacute;sico. Quando esse limite &eacute; atingido, nenhum novo produtor pode ser criado. Um valor de -1 denota um n&uacute;mero ilimitado de produtores. O valor default &eacute; 100.</p>
</dd>
<dt>Contagem M&aacute;xima Mensagens para Entrega Batch</dt>
<dd>
<p>O n&uacute;mero m&aacute;ximo de mensagens que podem ser entregues para consumidores em um &uacute;nico batch. Um valor de -1 denota um n&uacute;mero ilimitado de mensagens. O valor default &eacute; 1000.</p>
</dd>
<dt>Usar Fila de Mensagens Inativas</dt>
<dd>
<p>Se o valor for definido como Verdadeiro, as mensagens inativas ser&atilde;o colocadas na fila de mensagens inativas. Se o valor for definido como Falso, mensagens inativas ser&atilde;o descartadas. Por default, essa op&ccedil;&atilde;o &eacute; definida como Verdadeiro.</p>
</dd>
<dt>Validar Esquema XML</dt>
<dd>
<p>Se o valor for definido como Verdadeiro, o runtime do cliente do Message Queue tentar&aacute; validar uma mensagem XML contra as Defini&ccedil;&otilde;es de esquema XML especificadas (ou contra o DTD, se nenhuma XSD estiver especificado) antes de envi&aacute;-la para o broker. Se o esquema especificado n&atilde;o pode ser localizado ou a mensagem n&atilde;o pode ser validada, a mensagem n&atilde;o &eacute; enviada e uma exce&ccedil;&atilde;o &eacute; lan&ccedil;ada. Por default, essa op&ccedil;&atilde;o &eacute; definida como Falso.</p>
</dd>
<dt>Lista de URIs de Esquema XML</dt>
<dd>
<p>Uma lista separada por espa&ccedil;os de strings de URI de Defini&ccedil;&atilde;o de Esquema XML (XSD). Se a valida&ccedil;&atilde;o de esquema XML estiver ativada, os URIs apontam para o local de uma ou mais XSDs a serem usados para a valida&ccedil;&atilde;o do esquema XML.</p>
</dd>
</dl>
<a id="sthref94" name="sthref94"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-jmsservice.html">Para Configurar o Servi&ccedil;o JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestnew.html">Para Criar um Destino F&iacute;sico JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestedit.html">Para Editar um Destino F&iacute;sico JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestdelete.html">Para Deletar um Destino F&iacute;sico JMS</a></p>
</li>
<li>
<p><a href="task-jmsflushmessages.html">Para Remover Mensagens de um Destino F&iacute;sico JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldeststats.html">Para Exibir Estat&iacute;sticas de um Destino F&iacute;sico JMS</a></p>
</li>
</ul>
<a id="sthref95" name="sthref95"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00038"><code>create-jmsdest</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00175"><code>list-jmsdest</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00090"><code>delete-jmsdest</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00136"><code>flush-jmsdest</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00144"><code>jms-ping</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
