<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsservice-additional-props" name="ref-jmsservice-additional-props"></a><a id="GHJMS00012" name="GHJMS00012"></a></p>

<h4><a id="sthref77" name="sthref77"></a><a id="sthref78" name="sthref78"></a>Propriedades Espec&iacute;ficas para o Servi&ccedil;o JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>As propriedades de configura&ccedil;&atilde;o do broker do Message Queue do Oracle a seguir est&atilde;o dispon&iacute;veis para o servi&ccedil;o JMS.</p>
<dl>
<dt><code>instance-name</code></dt>
<dd>
<p>Especifica o nome da inst&acirc;ncia do broker do Message Queue. O default &eacute; <code>imqbroker</code>.</p>
</dd>
<dt><code>instance-name-suffix</code></dt>
<dd>
<p>Especifica um sufixo a ser adicionado ao nome completo da inst&acirc;ncia do broker do Message Queue. O sufixo &eacute; separado do nome da inst&acirc;ncia por um caractere sublinhado (<code>_</code>). Por exemplo, se o nome da inst&acirc;ncia for <code>imqbroker</code>, acrescentar o sufixo <code>xyz</code> altera o nome da inst&acirc;ncia para <code>imqbroker_xyz</code>.</p>
</dd>
<dt><code>append-version</code></dt>
<dd>
<p>Se for <code>verdadeiro</code>, acrescenta os n&uacute;meros da vers&atilde;o menor e da maior, precedidos de caracteres sublinhados (<code>_</code>), at&eacute; o nome da inst&acirc;ncia do broker do Message Queue. Por exemplo, se o nome da inst&acirc;ncia for <code>imqbroker</code>, acrescentar os n&uacute;meros da vers&atilde;o altera o nome da inst&acirc;ncia para <code>imqbroker_8_0</code>. O default &eacute; <code>false</code>.</p>
</dd>
<dt><code>user-name</code></dt>
<dd>
<p>O nome de usu&aacute;rio para a cria&ccedil;&atilde;o da conex&atilde;o JMS. &Eacute; necess&aacute;rio somente se nome de usu&aacute;rio/senha do <code>convidado</code>/<code>convidado</code> n&atilde;o estiver dispon&iacute;vel no controlador. O valor default &eacute; <code>guest</code>.</p>
</dd>
<dt><code>password</code></dt>
<dd>
<p>A senha para a cria&ccedil;&atilde;o da conex&atilde;o JMS. &Eacute; necess&aacute;rio somente se nome de usu&aacute;rio/senha do <code>convidado</code>/<code>convidado</code> n&atilde;o estiver dispon&iacute;vel no controlador. O valor default &eacute; <code>guest</code>.</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
