<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsavailability" name="ref-jmsavailability"></a></p>

<h4><a id="sthref71" name="sthref71"></a><a id="sthref72" name="sthref72"></a>Disponibilidade de JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Disponibilidade do JMS para configurar o cluster do broker do the Message Queue para atender o cluster do GlassFish Server.</p>

<hr>
<p><b>Cuidado:</b></p>
Antes de usar a p&aacute;gina Disponibilidade do JMS para reconfigurar um cluster existente, voc&ecirc; deve seguir os procedimentos especiais para migrar para outro tipo de cluster do broker, conforme descrito em <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSHAG00158">To Migrate Between Types of Embedded or Local Conventional Broker Clusters</a> em<i>Oracle GlassFish Server High Availability Administration Guide</i>. Se esses procedimentos especiais n&atilde;o forem seguidos, pode ocorrer perda ou corrompimento de dados e at&eacute; mesmo a inutiliza&ccedil;&atilde;o da sua configura&ccedil;&atilde;o, dependendo das opera&ccedil;&otilde;es do JMS executadas no cluster existente.
<hr>

<p>A p&aacute;gina de Disponibilidade do JMS cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>

<hr>
<p><b>Observa&ccedil;&atilde;o:</b></p>
Se quaisquer inst&acirc;ncias que utilizam a configura&ccedil;&atilde;o estiverem sendo executadas, a p&aacute;gina Disponibilidade do JMS exibir&aacute; uma advert&ecirc;ncia, definir&aacute; todas as op&ccedil;&otilde;es como somente para leitura e desativar&aacute; o bot&atilde;o Salvar.
<hr>

<dl>
<dt>Tipo de Servi&ccedil;o JMS</dt>
<dd>
<p>Os tipos de brokers (chamados hosts JMS no GlassFish Server) a serem usados no cluster do broker. O tipo escolhido determina quais tipos de clusters do broker est&atilde;o dispon&iacute;veis. Os tipos de broker s&atilde;o os seguintes:</p>
<dl>
<dt>Incorporado</dt>
<dd>
<p>A configura&ccedil;&atilde;o e o ciclo de vida do broker s&atilde;o gerenciados pelo GlassFish Server. Cada inst&acirc;ncia clusterizada do GlassFish &eacute; atendida por um broker executado na mesma JVM da inst&acirc;ncia.</p>
<p>Se a op&ccedil;&atilde;o Tipo de Servi&ccedil;o JMS for definida como Incorporado, apenas clusters do broker convencionais do Message Queue ser&atilde;o suportados. As op&ccedil;&otilde;es para configura&ccedil;&atilde;o do cluster convencional s&atilde;o exibidas.</p>
</dd>
<dt>Local</dt>
<dd>
<p>A configura&ccedil;&atilde;o e o ciclo de vida do broker s&atilde;o gerenciados pelo GlassFish Server. Cada inst&acirc;ncia clusterizada do GlassFish &eacute; atendida por um broker executado em uma JVM separada no mesmo host da inst&acirc;ncia.</p>
<p>Se a op&ccedil;&atilde;o Tipo de Servi&ccedil;o JMS estiver definida como Local, os clusters do broker convencional e aprimorado (altamente dispon&iacute;vel) do Message Queue ser&atilde;o suportados. As op&ccedil;&otilde;es para sele&ccedil;&atilde;o do tipo de cluster e configura&ccedil;&atilde;o do cluster s&atilde;o exibidas.</p>
</dd>
<dt>Remoto</dt>
<dd>
<p>O configura&ccedil;&atilde;o e o ciclo de vida do broker e do cluster do broker s&atilde;o gerenciados usando as ferramentas administrativas do Message Queue.</p>
<p>Se a op&ccedil;&atilde;o Tipo de Servi&ccedil;o JMS estiver definida como Remoto, nenhuma outra op&ccedil;&atilde;o ser&aacute; exibida.</p>
</dd>
</dl>
</dd>
<dt>Tipo de Cluster JMS</dt>
<dd>
<p>O tipo de cluster do broker do Message Queue a ser usado para o cluster do GlassFish Server.</p>
<p>Se a op&ccedil;&atilde;o Tipo de Cluster JMS estiver definida como Convencional, as seguintes op&ccedil;&otilde;es ser&atilde;o exibidas.</p>
<dl>
<dt>Tipo de Armazenamento da Configura&ccedil;&atilde;o JMS</dt>
<dd>
<p>O tipo de armazenamento de dados a ser usado para os dados de configura&ccedil;&atilde;o do cluster convencional. Se esta op&ccedil;&atilde;o estiver definida como Broker Mestre, um broker no cluster ser&aacute; designado como broker mestre e os dados de configura&ccedil;&atilde;o ser&atilde;o armazenados por ele. Se esta op&ccedil;&atilde;o estiver definida como Banco de Dados Compartilhado, os dados de configura&ccedil;&atilde;o ser&atilde;o armazenados em um armazenamento de dados JDBC acess&iacute;vel a todos os brokers. Neste caso, as op&ccedil;&otilde;es relacionadas ao banco de dados ser&atilde;o exibidas.</p>
</dd>
<dt>Tipo de Armazenamento da Mensagem JMS</dt>
<dd>
<p>O tipo de armazenamento de dados que cada broker usar&aacute; para armazenar seus dados de mensagem. Se esta op&ccedil;&atilde;o estiver definida como Arquivar, cada broker armazenar&aacute; seus dados de mensagens em um armazenamento de dados baseado em arquivo. Se esta op&ccedil;&atilde;o estiver definida como JDBC, cada broker armazenar&aacute; seus dados de mensagens em um armazenamento de dados JDBC.</p>
</dd>
</dl>
<p>Se a op&ccedil;&atilde;o Tipo de Cluster JMS estiver definida como Aprimorado (Altamente Dispon&iacute;vel), ser&atilde;o exibidas as op&ccedil;&otilde;es relacionadas ao banco de dados.</p>
</dd>
<dt>Fornecedor do Banco de Dados</dt>
<dt>URL do Banco de Dados</dt>
<dt>Usu&aacute;rio do Banco de Dados</dt>
<dd>
<p>O fornecedor do banco de dados, URL de acesso e o banco de dados JDBC a ser usado em qualquer uma destas situa&ccedil;&otilde;es:</p>
<ul>
<li>
<p>Quando o tipo de armazenamento da configura&ccedil;&atilde;o de um cluster convencional estiver definido como Banco de Dados Compartilhado</p>
</li>
<li>
<p>Quando o tipo de armazenamento de mensagens de um cluster convencional estiver definido como JDBC</p>
</li>
<li>
<p>Quando o tipo de cluster estiver definido como Aprimorado (Altamente Dispon&iacute;vel)</p>
</li>
</ul>
<p>Para obter informa&ccedil;&otilde;es sobre os fornecedores suportados e os formatos de URLs de acesso para cada fornecedor, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GMADG00244">PJDBC-Based Persistence</a> em <i>Oracle GlassFish Server Message Queue Administration Guide</i>.</p>
</dd>
<dt>Autentica&ccedil;&atilde;o do Banco de Dados</dt>
<dt>Senha do Banco de Dados</dt>
<dt>Alias da Senha</dt>
<dd>
<p>As informa&ccedil;&otilde;es da senha para o usu&aacute;rio do banco de dados JDBC especificado em Usu&aacute;rio do Banco de Dados.</p>
<p>Se Autentica&ccedil;&atilde;o do Banco de Dados estiver definida como Senha, a op&ccedil;&atilde;o Senha do Banco de Dados ser&aacute; exibida. Se Autentica&ccedil;&atilde;o do Banco de Dados estiver definida como Alias da Senha, a op&ccedil;&atilde;o Alias da Senha ser&aacute; exibida.</p>
</dd>
<dt>Propriedades Adicionais</dt>
<dd>
<p>Propriedades adicionais para disponibilidade do JMS.</p>
<p>GlassFish Server n&atilde;o predefine nenhuma propriedade de disponibilidade de JMS adicional.</p>
</dd>
</dl>
<a id="sthref73" name="sthref73"></a>
<h5>Tarefas Relacionadas</h5>
<p><a href="task-jmsservice.html">Para Configurar o Servi&ccedil;o JMS</a></p>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
