<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsdestinationedit" name="ref-jmsdestinationedit"></a></p>

<h4><a id="sthref67" name="sthref67"></a><a id="sthref68" name="sthref68"></a>Editar Recurso de Destino JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilize a p&aacute;gina Editar Recurso de Destino JMS para modificar as defini&ccedil;&otilde;es de um recurso de destino JMS.</p>
<p>A p&aacute;gina Editar Recurso de Destino JMS cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Carregar Defaults</dt>
<dd>
<p>Bot&atilde;o para restaurar defini&ccedil;&otilde;es para seus valores default. Defini&ccedil;&otilde;es que n&atilde;o tiveram seus valores default alterados.</p>
</dd>
<dt>Nome JNDI</dt>
<dd>
<p>Um nome exclusivo que identifica o recurso de destino. O nome JNDI &eacute; um campo somente para leitura. Voc&ecirc; pode especificar o nome JNDI somente quando cria um novo recurso de destino JMS.</p>
</dd>
<dt>Nome de Destino F&iacute;sico</dt>
<dd>
<p>O nome do destino f&iacute;sico associado a esse recurso.</p>
<p>O GlassFish Server cria o destino f&iacute;sico automaticamente quando necess&aacute;rio e o deleta quando voc&ecirc; deleta o recurso de destino.</p>
</dd>
<dt>Tipo de Recurso</dt>
<dd>
<p>O tipo do recurso de destino. As escolhas dispon&iacute;veis s&atilde;o <code>javax.jms.Topic</code> e <code>javax.jms.Queue</code>.</p>
</dd>
<dt>Ordem de Implanta&ccedil;&atilde;o</dt>
<dd>
<p>A ordem de implanta&ccedil;&atilde;o do recurso de destino.</p>
</dd>
<dt>Descri&ccedil;&atilde;o</dt>
<dd>
<p>Uma descri&ccedil;&atilde;o do recurso de destino.</p>
</dd>
<dt>Status</dt>
<dd>
<p>Se o recurso est&aacute; dispon&iacute;vel no runtime.</p>
<p>Se apenas a inst&acirc;ncia do servidor default, <code>server</code>, existir no dom&iacute;nio, a disponibilidade de runtime do recurso poder&aacute; ser ativada ou desativada. A disponibilidade de runtime est&aacute; ativada por default.</p>
<p>Se clusters ou inst&acirc;ncias standalone tiverem sido criados no dom&iacute;nio, utilize a guia Alvo para controlar a disponibilidade de runtime do recurso em seus alvos.</p>
</dd>
<dt>Propriedades Adicionais</dt>
<dd>
<p>Propriedades adicionais para o recurso de destino. O GlassFish Server n&atilde;o define propriedades adicionais para recursos do destino JMS.</p>
</dd>
</dl>
<a id="sthref69" name="sthref69"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-jmsdestinationnew.html">Para Criar um Recurso de Destino JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationedit.html">Para Editar um Recurso de Destino JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationdelete.html">Para Deletar um Recurso de Destino JMS</a></p>
</li>
</ul>
<a id="sthref70" name="sthref70"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00040"><code>create-jms-resource</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00177"><code>list-jms-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00092"><code>delete-jms-resource</code>(1)</a></p>
</li>
</ul>





<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
