<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsservice" name="ref-jmsservice"></a></p>

<h4><a id="sthref74" name="sthref74"></a>Servi&ccedil;o JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Servi&ccedil;o JMS para configurar as defini&ccedil;&otilde;es a serem usadas pelo provedor JMS default, GlassFish Server Message Queue.</p>
<p>Para obter mais informa&ccedil;&otilde;es sobre como configurar o Servi&ccedil;o JMS, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDVG00020">Cap&iacute;tulo 19, <i>Using the Java Message Service,</i> em <i>Oracle GlassFish Server Application Development Guide</i></a>.</p>
<p>A p&aacute;gina Servi&ccedil;o JMS cont&eacute;m as seguintes op&ccedil;&otilde;es:</p>
<dl>
<dt>Carregar Defaults</dt>
<dd>
<p>Bot&atilde;o para restaurar defini&ccedil;&otilde;es para seus valores default. Defini&ccedil;&otilde;es que n&atilde;o tiveram seus valores default alterados.</p>
</dd>
<dt>Ping</dt>
<dd>
<p>Bot&atilde;o utilizado para verificar que o servi&ccedil;o JMS est&aacute; sendo executado no host default JMS. Se o servi&ccedil;o JMS estiver em execu&ccedil;&atilde;o, uma mensagem informa que o ping foi bem-sucedido.</p>
</dd>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Tipo</dt>
<dd>
<p>O tipo de acesso para o servi&ccedil;o JMS. As op&ccedil;&otilde;es dispon&iacute;veis s&atilde;o:</p>
<dl>
<dt>EMBEDDED</dt>
<dd>
<p>Acessa o servi&ccedil;o JMS no host local. O servi&ccedil;o JMS &eacute; iniciado na mesma m&aacute;quina JVM que o GlassFish Server. A inicializa&ccedil;&atilde;o lenta inicia o broker default incorporado no primeiro acesso aos servi&ccedil;os JMS, em vez de na inicializa&ccedil;&atilde;o do GlassFish Server. Esse &eacute; o tipo default do Servi&ccedil;o JMS.</p>
</dd>
<dt>LOCAL</dt>
<dd>
<p>Acessa o servi&ccedil;o JMS no host local. O provedor JMS &eacute; iniciado juntamente com o GlassFish Server.</p>
</dd>
<dt>REMOTE</dt>
<dd>
<p>Acessa o servi&ccedil;o JMS em outro sistema. Se escolher REMOTE, o servi&ccedil;o JMS n&atilde;o ser&aacute; iniciado pelo GlassFish Server na pr&oacute;xima vez que o servidor for iniciado. Em vez disso, o servi&ccedil;o JMS &eacute; iniciado e gerenciado pelo Message Queue, de forma que ser&aacute; necess&aacute;rio iniciar o broker do Message Queue separadamente. Para obter mais informa&ccedil;&otilde;es sobre como iniciar o controlador, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GMADG00227"><i>Starting Brokers</i> em <i>Oracle GlassFish Server Message Queue Administration Guide</i></a>. Se voc&ecirc; escolher este valor e est&aacute; usando um host remoto, siga as instru&ccedil;&otilde;es em <a href="task-jmshostedit.html">Para Editar um Host JMS</a> para especificar o nome do host remoto.</p>
</dd>
</dl>
</dd>
<dt>Time-out para Inicializa&ccedil;&atilde;o</dt>
<dd>
<p>O n&uacute;mero de segundos que o GlassFish Server aguarda o servi&ccedil;o JMS ser iniciado antes de abortar a inicializa&ccedil;&atilde;o. Em um sistema lento e sobrecarregado, aumente o valor a partir do default. O valor default &eacute; 60.</p>
</dd>
<dt>Argumentos de Inicializa&ccedil;&atilde;o</dt>
<dd>
<p>Argumentos para personalizar a inicializa&ccedil;&atilde;o do servi&ccedil;o JMS. Utilize qualquer argumento dispon&iacute;vel por meio do comando as-install-parent<code>/mq/bin/imqbrokerd</code>.</p>
</dd>
<dt>Reconectar</dt>
<dd>
<p>Se a caixa de sele&ccedil;&atilde;o Reconex&atilde;o Ativada estiver marcada, o servi&ccedil;o JMS tentar&aacute; reconectar-se a um servidor de mensagens (ou &agrave; lista de endere&ccedil;os na AddressList) quando uma conex&atilde;o for perdida. Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</dd>
<dt>Intervalo de Reconex&atilde;o</dt>
<dd>
<p>O n&uacute;mero de segundos entre tentativas de reconex&atilde;o. Esse intervalo aplica-se a tentativas em cada endere&ccedil;o na lista AddressList e a endere&ccedil;os sucessivos na lista. Se for muito curto, esse intervalo de tempo n&atilde;o d&aacute; ao broker tempo para ser recuperar. Se for muito longo, a reconex&atilde;o pode representar um atraso inaceit&aacute;vel. O valor default &eacute; 5 segundos.</p>
</dd>
<dt>Tentativas de Reconex&atilde;o</dt>
<dd>
<p>O n&uacute;mero de tentativas de conex&atilde;o (ou reconex&atilde;o) para cada endere&ccedil;o na AddressList antes de o runtime do cliente tentar o pr&oacute;ximo endere&ccedil;o na lista. Um valor de -1 indica que o n&uacute;mero de tentativas de reconex&atilde;o &eacute; ilimitado (o runtime do cliente tenta conectar-se ao primeiro endere&ccedil;o at&eacute; conseguir). O valor default &eacute; 3.</p>
</dd>
<dt>Host JMS Default</dt>
<dd>
<p>O nome do host JMS default. O valor default &eacute; <code>default_JMS_host</code>.</p>
</dd>
<dt>Broker Mestre</dt>
<dd>
<p>O nome da inst&acirc;ncia clusterizada do GlassFish Server cujo broker associado do Message Queue ser&aacute; usado como broker mestre no cluster broker do Message Queue. Deixe este campo em branco para permitir que o GlassFish Server designe automaticamente um broker mestre.</p>
<p>Se voc&ecirc; alterar este valor, ser&aacute; necess&aacute;rio reiniciar o cluster do GlassFish Server que utiliza a configura&ccedil;&atilde;o.</p>
</dd>
<dt>Comportamento da Lista de Endere&ccedil;os</dt>
<dd>
<p>A ordem de tentativas de conex&atilde;o. As op&ccedil;&otilde;es dispon&iacute;veis s&atilde;o:</p>
<dl>
<dt><code>random</code></dt>
<dd>
<p>Selecione um endere&ccedil;o na AddressList aleatoriamente. Se houver muitos clientes tentando conectar-se usando a mesma f&aacute;brica de conex&otilde;es, especifique <code>random</code> para impedi-los de conectarem-se ao mesmo endere&ccedil;o. Essa &eacute; a op&ccedil;&atilde;o default.</p>
</dd>
<dt><code>priority</code></dt>
<dd>
<p>A reconex&atilde;o sempre tenta conectar-se ao primeiro endere&ccedil;o do servidor na AddressList e usa outro somente se o primeiro broker n&atilde;o estiver dispon&iacute;vel.</p>
</dd>
</dl>
</dd>
<dt>Itera&ccedil;&otilde;es da Lista de Endere&ccedil;os</dt>
<dd>
<p>O n&uacute;mero de vezes que o servi&ccedil;o JMS itera atrav&eacute;s da AddressList em um esfor&ccedil;o de estabelecer (ou restabelecer) uma conex&atilde;o. Um valor de -1 indica que o n&uacute;mero de tentativas &eacute; ilimitado. O valor default &eacute; 3.</p>
</dd>
<dt>Esquema MQ e Servi&ccedil;o MQ</dt>
<dd>
<p>O nome do esquema de endere&ccedil;os e do nome do servi&ccedil;o do Message Queue, se um esquema ou servi&ccedil;o n&atilde;o default for utilizado. Consulte <a href="ref-mqschemeservice.html">Sintaxe de Endere&ccedil;os do Esquema MQ e Servi&ccedil;o MQ</a> para informa&ccedil;&otilde;es de sintaxe.</p>
</dd>
<dt>Propriedades Adicionais</dt>
<dd>
<p>Propriedades adicionais para o Servi&ccedil;o JMS.</p>
<p>Para obter informa&ccedil;&otilde;es sobre propriedades dispon&iacute;veis, consulte <a href="ref-jmsservice-additional-props.html">Propriedades Espec&iacute;ficas para o Servi&ccedil;o JMS</a>.</p>
</dd>
</dl>
<a id="sthref75" name="sthref75"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-jmsservice.html">Para Configurar o Servi&ccedil;o JMS</a></p>
</li>
<li>
<p><a href="task-jmshostnew.html">Para Criar um Host JMS</a></p>
</li>
<li>
<p><a href="task-jmshostedit.html">Para Editar um Host JMS</a></p>
</li>
<li>
<p><a href="task-jmshostdelete.html">Para Deletar um Host JMS</a></p>
</li>
</ul>
<a id="sthref76" name="sthref76"></a>
<h5>Comandos asadmin Relacionados</h5>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00144"><code>jms-ping</code>(1)</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
