<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsconnectionedit" name="ref-jmsconnectionedit"></a></p>

<h4><a id="sthref53" name="sthref53"></a><a id="sthref54" name="sthref54"></a>Editar F&aacute;brica de Conex&otilde;es JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilize a p&aacute;gina Editar F&aacute;brica de Conex&otilde;es JMS para modificar as defini&ccedil;&otilde;es de uma F&aacute;brica de Conex&otilde;es JMS.</p>
<p>A p&aacute;gina Editar F&aacute;brica de Conex&otilde;es JMS cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Carregar Defaults</dt>
<dd>
<p>Bot&atilde;o para restaurar defini&ccedil;&otilde;es para seus valores default. Defini&ccedil;&otilde;es que n&atilde;o tiveram seus valores default alterados.</p>
</dd>
<dt>Nome JNDI</dt>
<dd>
<p>Um nome JNDI exclusivo que identifica o recurso. Por conven&ccedil;&atilde;o, o nome come&ccedil;a com um indicador de tipo de recurso e uma barra, tais como concurrent/, jdbc/ ou jms/. O nome JNDI &eacute; um campo somente para leitura. Voc&ecirc; pode especificar o nome JNDI ao criar um novo recurso</p>
</dd>
<dt>Nome L&oacute;gico JNDI</dt>
<dd>
<p>O nome l&oacute;gico JNDI para o recurso. Este &eacute; um nome padr&atilde;o do Java EE pelo qual o recurso pode ser acessado. O nome JNDI l&oacute;gico tamb&eacute;m &eacute; um campo somente para leitura. Consulte <a href="../../../common/en/help/ref-logicaljndinames.html">Nomes L&oacute;gicos JNDI</a> para obter mais informa&ccedil;&otilde;es.</p>
</dd>
<dt>Tipo de Recurso</dt>
<dd>
<p>O tipo de f&aacute;brica de conex&otilde;es. O tipo do recurso &eacute; um campo somente para leitura. Voc&ecirc; s&oacute; poder&aacute; especificar o tipo do recurso quando criar uma nova f&aacute;brica de conex&otilde;es JMS.</p>
</dd>
<dt>Descri&ccedil;&atilde;o</dt>
<dd>
<p>Uma descri&ccedil;&atilde;o da f&aacute;brica de conex&otilde;es.</p>
</dd>
<dt>Status</dt>
<dd>
<p>Se o recurso est&aacute; dispon&iacute;vel no runtime.</p>
<p>Se apenas a inst&acirc;ncia do servidor default, <code>server</code>, existir no dom&iacute;nio, a disponibilidade de runtime do recurso poder&aacute; ser ativada ou desativada. A disponibilidade de runtime est&aacute; ativada por default.</p>
<p>Se clusters ou inst&acirc;ncias standalone tiverem sido criados no dom&iacute;nio, utilize a guia Alvo para controlar a disponibilidade de runtime do recurso em seus alvos.</p>
</dd>
<dt>Tamanho Inicial e M&iacute;nimo do Pool</dt>
<dd>
<p>O n&uacute;mero m&iacute;nimo de conex&otilde;es do pool para a f&aacute;brica de conex&otilde;es. O valor default &eacute; 8.</p>
</dd>
<dt>Tamanho M&aacute;ximo do Pool</dt>
<dd>
<p>O n&uacute;mero m&aacute;ximo de conex&otilde;es no pool. O valor default &eacute; 32.</p>
</dd>
<dt>Quantidade de Redimensionamento do Pool</dt>
<dd>
<p>O n&uacute;mero de conex&otilde;es a serem removidas quando o time-out para inatividade do pool expirar. O valor default &eacute; 2.</p>
</dd>
<dt>Time-out para Ociosidade</dt>
<dd>
<p>A quantidade m&aacute;xima de tempo, em segundos, que uma conex&atilde;o pode permanecer inativa no pool. O valor default &eacute; 300.</p>
</dd>
<dt>Tempo M&aacute;ximo de Espera</dt>
<dd>
<p>O tempo que a aplica&ccedil;&atilde;o solicitante de uma conex&atilde;o aguardar&aacute; at&eacute; obter um time-out. O valor default &eacute; 60000.</p>
</dd>
<dt>Em Caso de Falha</dt>
<dd>
<p>Se a caixa de sele&ccedil;&atilde;o Fechar Todas as Conex&otilde;es estiver marcada, o GlassFish Server fechar&aacute; todas as conex&otilde;es no pool e as restabelecer&aacute; se uma &uacute;nica conex&atilde;o falhar. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Suporte &agrave; Transa&ccedil;&atilde;o</dt>
<dd>
<p>O valor pode ser um dos seguintes:</p>
<dl>
<dt>XATransaction</dt>
<dd>
<p>O recurso pode ser usado para transa&ccedil;&otilde;es que envolvem o uso de mais de um recurso dentro de um escopo de transa&ccedil;&atilde;o. Esse valor &eacute; o default de uma f&aacute;brica de conex&otilde;es JMS.</p>
<p>Por exemplo, transa&ccedil;&otilde;es podem envolver este recurso mais um recurso JDBC, um recurso de conector ou outro recurso de f&aacute;brica de conex&otilde;es JMS. Esse valor oferece a maior flexibilidade. Um recurso que n&atilde;o seja configurado como XATransaction participar&aacute; de opera&ccedil;&otilde;es de confirma&ccedil;&atilde;o em duas fases.</p>
</dd>
<dt>LocalTransaction</dt>
<dd>
<p>O recurso pode ser usado para transa&ccedil;&otilde;es que envolvem somente um recurso dentro do escopo de transa&ccedil;&atilde;o ou como o &uacute;ltimo broker em uma transa&ccedil;&atilde;o distribu&iacute;da que envolve mais de um recurso XA.</p>
<p>Esse valor oferece um desempenho significativamente melhor. Um recurso configurado como LocalTransaction n&atilde;o ser&aacute; usado em opera&ccedil;&otilde;es de confirma&ccedil;&atilde;o em duas fases.</p>
</dd>
<dt>NoTransaction</dt>
<dd>
<p>O recurso nunca pode participar de transa&ccedil;&otilde;es. Essa defini&ccedil;&atilde;o tem uso limitado em aplica&ccedil;&otilde;es JMS.</p>
</dd>
</dl>
</dd>
<dt>Valida&ccedil;&atilde;o da Conex&atilde;o</dt>
<dd>
<p>Se a caixa de sele&ccedil;&atilde;o Obrigat&oacute;rio estiver marcada, as conex&otilde;es ser&atilde;o validadas antes de serem enviadas &agrave; aplica&ccedil;&atilde;o. Se uma valida&ccedil;&atilde;o de recurso falhar, ela ser&aacute; destru&iacute;da e um novo recurso ser&aacute; criado e retornado. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Propriedades Adicionais</dt>
<dd>
<p>Propriedades adicionais para a f&aacute;brica de conex&otilde;es.</p>
<p>Para obter informa&ccedil;&otilde;es sobre propriedades dispon&iacute;veis, consulte <a href="ref-jmsconnectionproperties.html">Propriedades Espec&iacute;ficas para F&aacute;bricas de Conex&otilde;es JMS</a>.</p>
</dd>
</dl>
<a id="sthref55" name="sthref55"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-jmsconnectionnew.html">Para Criar um Recurso de F&aacute;brica de Conex&atilde;o JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectionedit.html">Para Editar um Recurso de F&aacute;brica de Conex&atilde;o JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">Para Deletar um Recurso de F&aacute;brica de Conex&atilde;o JMS</a></p>
</li>
</ul>
<a id="sthref56" name="sthref56"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00040"><code>create-jms-resource</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00177"><code>list-jms-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00092"><code>delete-jms-resource</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
