<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsdestinationnew" name="task-jmsdestinationnew"></a></p>

<h4><a id="sthref11" name="sthref11"></a><a id="sthref12" name="sthref12"></a>Para Criar um Recurso de Destino JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Quando voc&ecirc; cria um recurso de destino JMS, o GlassFish Server cria um recurso de objeto de admin para o recurso de destino. Voc&ecirc; pode exibir esse recurso no n&oacute; Conectores.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Recursos.</p>
</li>
<li>
<p>No n&oacute; Recursos, expanda o n&oacute; Recursos JMS.</p>
</li>
<li>
<p>No n&oacute; Recursos JMS, selecione o n&oacute; Recursos de Destino JMS.</p>
<p>A p&aacute;gina Recursos de Destino JMS &eacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Recursos de Destino JMS, clique em Novo.</p>
<p>A p&aacute;gina Novo Recurso de Destino JMS &eacute; aberta.</p>
</li>
<li>
<p>No campo Nome JNDI, digite o nome JNDI do recurso.</p>
<p>Recomenda-se usar o prefixo de subcontexto de nomea&ccedil;&atilde;o <code>jms/</code> para recursos do JMS. Por exemplo: <code>jms/Queue</code>.</p>
</li>
<li>
<p>No campo Nome do Destino F&iacute;sico, digite o nome do destino f&iacute;sico associado a esse recurso.</p>
<p>O GlassFish Server cria um destino f&iacute;sico automaticamente quando necess&aacute;rio e o deleta quando voc&ecirc; deleta o recurso de destino.</p>
</li>
<li>
<p>Na lista drop-down Tipo de Recurso, selecione <code>javax.jms.Topic</code> ou <code>javax.jms.Queue</code>.</p>
</li>
<li>
<p>No campo Descri&ccedil;&atilde;o, digite uma descri&ccedil;&atilde;o do recurso de destino.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Status Ativado para ativar o recurso durante o runtime.</p>
<p>Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</li>
<li>
<p>Na se&ccedil;&atilde;o Propriedades Adicionais, especifique propriedades adicionais do servidor de destino.</p>
<p>O GlassFish Server n&atilde;o define quaisquer propriedades adicionais para recursos de destino JMS.</p>
<p>Para adicionar uma propriedade, clique no bot&atilde;o Adicionar Propriedade. Na linha em branco que for exibida, digite o nome da propriedade no campo Nome e digite o valor da propriedade no campo Valor.</p>
</li>
<li>
<p>Na &aacute;rea Alvos, fa&ccedil;a o seguinte:</p>
<ol type="a">
<li>
<p>Na coluna Dispon&iacute;vel, selecione o alvo ou os alvos aos quais as aplica&ccedil;&otilde;es que usam o recurso ser&atilde;o implantadas.</p>
<p>Os alvos dispon&iacute;veis incluem os clusters dispon&iacute;veis e as inst&acirc;ncias do servidor, bem como a inst&acirc;ncia do servidor default, <code>server</code>.</p>
</li>
<li>
<p>Clique em Adicionar para mover o alvo para a coluna Selecionado.</p>
</li>
</ol>
</li>
<li>
<p>Clique em OK.</p>
</li>
</ol>
<a id="sthref13" name="sthref13"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-jmsconnectionnew.html">Para Criar um Recurso de F&aacute;brica de Conex&atilde;o JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectionedit.html">Para Editar um Recurso de F&aacute;brica de Conex&atilde;o JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">Para Deletar um Recurso de F&aacute;brica de Conex&atilde;o JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationedit.html">Para Editar um Recurso de Destino JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationdelete.html">Para Deletar um Recurso de Destino JMS</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
