<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmshostedit" name="task-jmshostedit"></a></p>

<h4><a id="sthref26" name="sthref26"></a>Para Editar um Host JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&atilde;o.</p>
</li>
<li>
<p>Selecione a inst&acirc;ncia que ser&aacute; configurada:</p>
<ul>
<li>
<p>Para configurar uma inst&acirc;ncia espec&iacute;fica, selecione o n&oacute; de configura&ccedil;&atilde;o da inst&acirc;ncia. Por exemplo, para a inst&acirc;ncia default, <code>server</code>, selecione o n&oacute; <code>server-config</code>.</p>
</li>
<li>
<p>Para configura as defini&ccedil;&otilde;es default das futuras inst&acirc;ncias que utilizam uma c&oacute;pia de <code>default-config</code>, selecione o n&oacute; <code>default-config</code>.</p>
</li>
</ul>
</li>
<li>
<p>No n&oacute; Configura&ccedil;&atilde;o, expanda o n&oacute; do Servi&ccedil;o JMS.</p>
</li>
<li>
<p>No n&oacute; do Servi&ccedil;o JMS, selecione o n&oacute; Hosts JMS.</p>
<p>A p&aacute;gina Hosts JMS &eacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Hosts JMS, selecione o host que est&aacute; sendo editado.</p>
<p>A p&aacute;gina Editar Host JMS &eacute; aberta.</p>
</li>
<li>
<p>No campo Host, digite o nome ou o endere&ccedil;o do Protocolo Internet (IP) do sistema em que o host JMS ser&aacute; executado (<code>localhost</code> ou o nome do sistema local ou remoto).</p>
</li>
<li>
<p>No campo Porta, digite o n&uacute;mero da porta do servi&ccedil;o JMS.</p>
<p>Altere esse campo somente se o servi&ccedil;o JMS a ser utilizado estiver sendo executado em uma porta n&atilde;o default. A porta default &eacute; 7676.</p>
</li>
<li>
<p>Nos campos Nome de Usu&aacute;rio e Senha Admin, digite o nome de usu&aacute;rio e a senha do broker do Message Queue.</p>
<p>S&atilde;o diferentes do nome de usu&aacute;rio e da senha do GlassFish Server. Edite esses campos somente se os valores do broker do Message Queue tiverem sido alterados com o comando as-install-parent<code>/mq/bin/imqusermgr</code>. Os valores default s&atilde;o <code>admin</code> e <code>admin</code>.</p>
</li>
<li>
<p>Clique em Salvar.</p>

<hr>
<p><b>Dica:</b></p>
Para voltar &agrave;s defini&ccedil;&otilde;es default, clique no bot&atilde;o Carregar Defaults e depois em Salvar.
<hr>

</li>
</ol>
<a id="sthref27" name="sthref27"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-jmsservice.html">Para Configurar o Servi&ccedil;o JMS</a></p>
</li>
<li>
<p><a href="task-jmshostnew.html">Para Criar um Host JMS</a></p>
</li>
<li>
<p><a href="task-jmshostdelete.html">Para Deletar um Host JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestnew.html">Para Criar um Destino F&iacute;sico JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestedit.html">Para Editar um Destino F&iacute;sico JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestdelete.html">Para Deletar um Destino F&iacute;sico JMS</a></p>
</li>
<li>
<p><a href="task-jmsflushmessages.html">Para Remover Mensagens de um Destino F&iacute;sico JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldeststats.html">Para Exibir Estat&iacute;sticas de um Destino F&iacute;sico JMS</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
