<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsconnectionnew" name="task-jmsconnectionnew"></a><a id="GHJMS00020" name="GHJMS00020"></a></p>

<h4><a id="sthref2" name="sthref2"></a><a id="sthref3" name="sthref3"></a>Para Criar um Recurso de F&aacute;brica de Conex&atilde;o JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Quando voc&ecirc; cria uma f&aacute;brica de conex&otilde;es JMS, o GlassFish Server cria um pool de conex&otilde;es com o conector e um recurso de conector para a f&aacute;brica de conex&otilde;es. Voc&ecirc; pode exibir esses objetos no n&oacute; Conectores.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Recursos.</p>
</li>
<li>
<p>No n&oacute; Recursos, expanda o n&oacute; Recursos JMS.</p>
</li>
<li>
<p>No n&oacute; Recursos JMS, selecione o n&oacute; F&aacute;bricas de Conex&otilde;es JMS.</p>
<p>A p&aacute;gina F&aacute;bricas de Conex&otilde;es JMS &eacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina F&aacute;bricas de Conex&otilde;es JMS, clique em Novo.</p>
<p>A p&aacute;gina Nova F&aacute;brica de Conex&otilde;es JMS ser&aacute; aberta.</p>
</li>
<li>
<p>No campo Nome do Pool, digite o nome exclusivo da f&aacute;brica de conex&otilde;es.</p>
<p>O GlassFish Server define o nome JNDI da f&aacute;brica de conex&otilde;es para este valor.</p>
</li>
<li>
<p>Na lista drop-down Tipo de Recurso, selecione <code>javax.jms.ConnectionFactory</code>, <code>javax.jms.QueueConnectionFactory</code> ou <code>javax.jms.TopicConnectionFactory</code>.</p>
</li>
<li>
<p>No campo Descri&ccedil;&atilde;o, digite uma descri&ccedil;&atilde;o da f&aacute;brica de conex&otilde;es.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Status Ativado para ativar o recurso durante o runtime.</p>
<p>Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</li>
<li>
<p>No campo Tamanho Inicial e M&iacute;nimo do Pool, especifique o n&uacute;mero m&iacute;nimo de conex&otilde;es no Pool.</p>
<p>O valor default &eacute; 8.</p>
</li>
<li>
<p>No campo Tamanho M&aacute;ximo do Pool, especifique o n&uacute;mero m&aacute;ximo de conex&otilde;es no pool.</p>
<p>O valor default &eacute; 32.</p>
</li>
<li>
<p>No campo Quantidade de Redimensionamento do Pool, especifique o n&uacute;mero de conex&otilde;es a serem removidas quando o time-out para inatividade do pool expirar.</p>
<p>O valor default &eacute; 2.</p>
</li>
<li>
<p>No campo Time-out para Ociosidade, especifique a quantidade m&aacute;xima de tempo, em segundos, para que uma conex&atilde;o permane&ccedil;a ociosa no pool.</p>
<p>O valor default &eacute; 300.</p>
</li>
<li>
<p>No campo Tempo M&aacute;ximo de Espera, especifique o tempo m&aacute;ximo que a aplica&ccedil;&atilde;o solicitante da conex&atilde;o aguardar&aacute; at&eacute; obter um time-out.</p>
<p>O valor default &eacute; 60000.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Em Caso de Falha Fechar Todas as Conex&otilde;es para que o GlassFish Server feche todas as conex&otilde;es no pool e as restabele&ccedil;a de uma &uacute;nica conex&atilde;o falhar.</p>
<p>Se voc&ecirc; n&atilde;o marcar a caixa de sele&ccedil;&atilde;o, as conex&otilde;es individuais s&oacute; ser&atilde;o restabelecidas quando forem usadas. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>Para um recurso de f&aacute;brica de conex&otilde;es JMS, selecione o n&iacute;vel de Suporte &agrave; Transa&ccedil;&atilde;o.</p>
<p>O valor selecionado substitui o atributo do suporte de transa&ccedil;&atilde;o no Adaptador de Recursos de forma a assegurar compatibilidade com n&iacute;veis inferiores.</p>
<ul>
<li>
<p>Selecione XATransaction (o valor default para o Adaptador de Recursos JMS) para um recurso que pode ser usado para transa&ccedil;&otilde;es que envolvem o uso de mais de um recurso dentro de um escopo de transa&ccedil;&atilde;o.</p>
<p>Por exemplo, transa&ccedil;&otilde;es podem envolver este recurso mais um recurso JDBC, um recurso de conector ou outro recurso de f&aacute;brica de conex&otilde;es JMS. Esse valor oferece a maior flexibilidade. Um recurso que n&atilde;o seja configurado como XATransaction participar&aacute; de opera&ccedil;&otilde;es de confirma&ccedil;&atilde;o em duas fases.</p>
</li>
<li>
<p>Selecione LocalTransaction para um recurso que pode ser usado para transa&ccedil;&otilde;es que envolvem somente um recurso dentro do escopo de transa&ccedil;&atilde;o ou como o &uacute;ltimo agente em uma transa&ccedil;&atilde;o distribu&iacute;da que envolve mais de um recurso XA.</p>
<p>Esse valor oferece um desempenho significativamente melhor. Um recurso configurado como LocalTransaction n&atilde;o ser&aacute; usado em opera&ccedil;&otilde;es de confirma&ccedil;&atilde;o em duas fases.</p>
</li>
<li>
<p>Selecione NoTransaction para um recurso que nunca pode participar de transa&ccedil;&otilde;es.</p>
<p>Essa defini&ccedil;&atilde;o tem uso limitado em aplica&ccedil;&otilde;es JMS.</p>
</li>
</ul>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Valida&ccedil;&atilde;o de Conex&atilde;o Obrigat&oacute;ria para ativar a valida&ccedil;&atilde;o de conex&atilde;o.</p>
<p>Se essa op&ccedil;&atilde;o &eacute; selecionada, as conex&otilde;es s&atilde;o validadas antes de serem enviadas &agrave; aplica&ccedil;&atilde;o. Se uma valida&ccedil;&atilde;o de recurso falhar, ela ser&aacute; destru&iacute;da e um novo recurso ser&aacute; criado e retornado. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>Na se&ccedil;&atilde;o Propriedades Adicionais, especifique propriedades adicionais da f&aacute;brica de conex&otilde;es.</p>
<p>Para obter informa&ccedil;&otilde;es sobre propriedades dispon&iacute;veis, consulte <a href="ref-jmsconnectionproperties.html">Propriedades Espec&iacute;ficas para F&aacute;bricas de Conex&otilde;es JMS</a>.</p>
<p>Para adicionar uma propriedade, clique no bot&atilde;o Adicionar Propriedade. Na linha em branco que for exibida, digite o nome da propriedade no campo Nome e digite o valor da propriedade no campo Valor.</p>
</li>
<li>
<p>Na &aacute;rea Alvos, fa&ccedil;a o seguinte:</p>
<ol type="a">
<li>
<p>Na coluna Dispon&iacute;vel, selecione o alvo ou os alvos aos quais as aplica&ccedil;&otilde;es que usam o recurso ser&atilde;o implantadas.</p>
<p>Os alvos dispon&iacute;veis incluem os clusters dispon&iacute;veis e as inst&acirc;ncias do servidor, bem como a inst&acirc;ncia do servidor default, <code>server</code>.</p>
</li>
<li>
<p>Clique em Adicionar para mover o alvo para a coluna Selecionado.</p>
</li>
</ol>
</li>
<li>
<p>Clique em OK.</p>
</li>
</ol>
<a id="sthref4" name="sthref4"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-jmsconnectionedit.html">Para Editar um Recurso de F&aacute;brica de Conex&atilde;o JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">Para Deletar um Recurso de F&aacute;brica de Conex&atilde;o JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationnew.html">Para Criar um Recurso de Destino JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationedit.html">Para Editar um Recurso de Destino JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationdelete.html">Para Deletar um Recurso de Destino JMS</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
