<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsphysicaldestnew" name="task-jmsphysicaldestnew"></a><a id="GHJMS00030" name="GHJMS00030"></a></p>

<h4><a id="sthref30" name="sthref30"></a><a id="sthref31" name="sthref31"></a>Para Criar um Destino F&iacute;sico JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Normalmente n&atilde;o &eacute; preciso criar destinos f&iacute;sicos, porque voc&ecirc; especifica um nome de destino f&iacute;sico quando cria um recurso de destino JMS e o GlassFish Server cria o destino f&iacute;sico automaticamente quando &eacute; necess&aacute;rio.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&atilde;o.</p>
</li>
<li>
<p>Selecione a inst&acirc;ncia que ser&aacute; configurada:</p>
<ul>
<li>
<p>Para configurar uma inst&acirc;ncia espec&iacute;fica, selecione o n&oacute; de configura&ccedil;&atilde;o da inst&acirc;ncia. Por exemplo, para a inst&acirc;ncia default, <code>server</code>, selecione o n&oacute; <code>server-config</code>.</p>
</li>
<li>
<p>Para configura as defini&ccedil;&otilde;es default das futuras inst&acirc;ncias que utilizam uma c&oacute;pia de <code>default-config</code>, selecione o n&oacute; <code>default-config</code>.</p>
</li>
</ul>
</li>
<li>
<p>No n&oacute; Configura&ccedil;&atilde;o, expanda o n&oacute; do Servi&ccedil;o JMS.</p>
</li>
<li>
<p>No n&oacute; Servi&ccedil;o JMS, selecione o n&oacute; Destinos F&iacute;sicos.</p>
<p>A p&aacute;gina Destinos F&iacute;sicos &eacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Destinos F&iacute;sicos, clique em Novo.</p>
<p>A p&aacute;gina Novo Destino F&iacute;sico &eacute; aberta.</p>
</li>
<li>
<p>No campo Nome, digite o nome do destino f&iacute;sico.</p>
</li>
<li>
<p>Na lista drop-down Tipo, selecione <code>javax.jms.Topic</code> ou <code>javax.jms.Queue</code>.</p>
</li>
<li>
<p>No campo N&uacute;mero M&aacute;ximo de Mensagens N&atilde;o Consumidas, digite o n&uacute;mero m&aacute;ximo de mensagens n&atilde;o consumidas permitido para o destino.</p>
<p>Um valor de -1 indica que n&atilde;o h&aacute; limite para o n&uacute;mero de mensagens n&atilde;o consumidas. O valor default &eacute; -1.</p>
</li>
<li>
<p>No campo Tamanho M&aacute;ximo da Mensagem, digite o tamanho m&aacute;ximo, em bytes, de uma &uacute;nica mensagem.</p>
<p>Um valor de -1 significa um tamanho de mensagem ilimitado. O valor default &eacute; -1.</p>
</li>
<li>
<p>No campo Total M&aacute;ximo de Mem&oacute;ria, digite o total m&aacute;ximo de mem&oacute;ria, em bytes, para mensagens n&atilde;o consumidas.</p>
<p>Um valor de -1 indica que n&atilde;o h&aacute; limite para o tamanho da mem&oacute;ria de mensagens n&atilde;o consumidas. O valor default &eacute; -1.</p>
</li>
<li>
<p>Na lista drop-down Comportamento para Limite, selecione o comportamento que o broker deve seguir quando o limite de mem&oacute;ria for atingido.</p>
<ul>
<li>
<p><code>Rejeitar mensagens mais recentes</code> informa ao broker que rejeite mensagens recentes e notifique o cliente produtor com uma exce&ccedil;&atilde;o somente se a mensagem for persistente.</p>
<p><code>Rejeitar mensagens mais recentes</code> &eacute; o valor default.</p>
</li>
<li>
<p><code>Diminuir a taxa de produtores</code> informa ao broker que diminua a taxa na qual produtores de mensagem enviam mensagens.</p>
</li>
<li>
<p><code>Rejeitar mais antiga</code> informa ao broker que descarte as mensagens mais antigas.</p>
</li>
<li>
<p><code>Rejeitar mensagens de prioridade mais baixa</code> informa ao broker que descarte as mensagens com a prioridade mais baixa.</p>
</li>
</ul>
<p>Se o valor for <code>Rejeitar mais antiga</code> ou <code>Rejeitar mensagens de prioridade mais baixa</code> e se a op&ccedil;&atilde;o Usar Fila de Mensagens Inativas estiver definida como Verdadeira, as mensagens em excesso ser&atilde;o movidas para a fila de mensagens inativas.</p>
</li>
<li>
<p>No campo N&uacute;mero M&aacute;ximo de Produtores, digite o n&uacute;mero m&aacute;ximo de produtores de mensagem que pode ser associados a esse destino f&iacute;sico.</p>
<p>Quando esse limite &eacute; atingido, nenhum novo produtor pode ser criado. Um valor de -1 denota um n&uacute;mero ilimitado de produtores. O valor default &eacute; 100.</p>
</li>
<li>
<p>No campo Contagem M&aacute;xima Mensagens para Entrega Batch, digite o n&uacute;mero m&aacute;ximo de mensagens que podem ser entregues a consumidores em um &uacute;nico batch.</p>
<p>Um valor de -1 denota um n&uacute;mero ilimitado de mensagens. O valor default &eacute; 1000.</p>
</li>
<li>
<p>Na lista drop-down Usar Fila de Mensagens Inativas, selecione Verdadeiro para colocar as mensagens inativas na fila de mensagens inativas.</p>
<p>Se o valor for definido como Falso, mensagens inativas ser&atilde;o descartadas. Por default, essa op&ccedil;&atilde;o &eacute; definida como Verdadeiro.</p>
</li>
<li>
<p>Na lista drop-down Validar Esquema XML Ativado, selecione Verdadeiro para ativar a valida&ccedil;&atilde;o do esquema XML para o destino.</p>
<p>Se o valor for definido como Verdadeiro, o runtime do cliente do Message Queue tentar&aacute; validar uma mensagem XML contra as Defini&ccedil;&otilde;es de esquema XML especificadas (ou contra o DTD, se nenhuma XSD estiver especificado) antes de envi&aacute;-la para o broker. Se o esquema especificado n&atilde;o pode ser localizado ou a mensagem n&atilde;o pode ser validada, a mensagem n&atilde;o &eacute; enviada e uma exce&ccedil;&atilde;o &eacute; lan&ccedil;ada. Por default, essa op&ccedil;&atilde;o &eacute; definida como Falso.</p>
</li>
<li>
<p>No campo Lista de URIs de Esquema XML, digite uma lista separada por espa&ccedil;os de strings URI de Defini&ccedil;&atilde;o de Esquema XML (XSD).</p>
<p>Se a valida&ccedil;&atilde;o de esquema XML estiver ativada, os URIs apontam para o local de uma ou mais XSDs a serem usados para a valida&ccedil;&atilde;o do esquema XML.</p>
</li>
</ol>
<a id="sthref32" name="sthref32"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-jmsservice.html">Para Configurar o Servi&ccedil;o JMS</a></p>
</li>
<li>
<p><a href="task-jmshostnew.html">Para Criar um Host JMS</a></p>
</li>
<li>
<p><a href="task-jmshostedit.html">Para Editar um Host JMS</a></p>
</li>
<li>
<p><a href="task-jmshostdelete.html">Para Deletar um Host JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestedit.html">Para Editar um Destino F&iacute;sico JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestdelete.html">Para Deletar um Destino F&iacute;sico JMS</a></p>
</li>
<li>
<p><a href="task-jmsflushmessages.html">Para Remover Mensagens de um Destino F&iacute;sico JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldeststats.html">Para Exibir Estat&iacute;sticas de um Destino F&iacute;sico JMS</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
