<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsservice" name="task-jmsservice"></a></p>

<h4><a id="sthref20" name="sthref20"></a>Para Configurar o Servi&ccedil;o JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Servi&ccedil;o JMS para configurar as defini&ccedil;&otilde;es a serem utilizadas por todas as conex&otilde;es JMS.</p>
<p>Para obter mais informa&ccedil;&otilde;es sobre como configurar o Servi&ccedil;o JMS, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDVG00020">Cap&iacute;tulo 19, <i>Using the Java Message Service,</i> em <i>Oracle GlassFish Server Application Development Guide</i></a>.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&atilde;o.</p>
</li>
<li>
<p>Selecione a inst&acirc;ncia que ser&aacute; configurada:</p>
<ul>
<li>
<p>Para configurar uma inst&acirc;ncia espec&iacute;fica, selecione o n&oacute; de configura&ccedil;&atilde;o da inst&acirc;ncia. Por exemplo, para a inst&acirc;ncia default, <code>server</code>, selecione o n&oacute; <code>server-config</code>.</p>
</li>
<li>
<p>Para configura as defini&ccedil;&otilde;es default das futuras inst&acirc;ncias que utilizam uma c&oacute;pia de <code>default-config</code>, selecione o n&oacute; <code>default-config</code>.</p>
</li>
</ul>
</li>
<li>
<p>No n&oacute; Configura&ccedil;&atilde;o, selecione o n&oacute; Servi&ccedil;o JMS.</p>
<p>A p&aacute;gina Servi&ccedil;o JMS &eacute; aberta.</p>
</li>
<li>
<p>Na lista drop-down Tipo:</p>
<ul>
<li>
<p>Selecione EMBEDDED para acessar o servi&ccedil;o JMS no host local.</p>
<p>O servi&ccedil;o JMS &eacute; iniciado na mesma m&aacute;quina JVM que o GlassFish Server. A inicializa&ccedil;&atilde;o lenta inicia o broker default incorporado no primeiro acesso aos servi&ccedil;os JMS, em vez de na inicializa&ccedil;&atilde;o do GlassFish Server. Esse &eacute; o tipo default do Servi&ccedil;o JMS.</p>
</li>
<li>
<p>Selecione LOCAL para acessar o servi&ccedil;o JMS no host local.</p>
<p>O servi&ccedil;o JMS &eacute; iniciado juntamente com o GlassFish Server.</p>
</li>
<li>
<p>Selecione REMOTE para acessar o servi&ccedil;o JMS em outro sistema ou em um cluster.</p>
<p>Se escolher REMOTE, o servi&ccedil;o JMS n&atilde;o ser&aacute; iniciado pelo GlassFish Server na pr&oacute;xima vez que o servidor for iniciado. Em vez disso, o servi&ccedil;o JMS &eacute; iniciado e gerenciado pelo Message Queue, de forma que ser&aacute; necess&aacute;rio iniciar o broker do Message Queue separadamente. Para obter mais informa&ccedil;&otilde;es sobre como iniciar o controlador, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GMADG00227"><i>Starting Brokers</i> em <i>Oracle GlassFish Server Message Queue Administration Guide</i></a>. Se voc&ecirc; escolher este valor e est&aacute; usando um host remoto, siga as instru&ccedil;&otilde;es em <a href="task-jmshostedit.html">Para Editar um Host JMS</a> para especificar o nome do host remoto.</p>
</li>
</ul>
</li>
<li>
<p>No campo Time-out para Inicializa&ccedil;&atilde;o, digite o n&uacute;mero de segundos que o GlassFish Server aguarda o servi&ccedil;o JMS ser iniciado antes de abortar a inicializa&ccedil;&atilde;o.</p>
<p>Em um sistema lento e sobrecarregado, aumente o valor a partir do default. O valor default &eacute; 60.</p>
</li>
<li>
<p>No campo Argumentos de Inicializa&ccedil;&atilde;o, digite argumentos para personalizar a inicializa&ccedil;&atilde;o do servi&ccedil;o JMS.</p>
<p>Utilize qualquer argumento dispon&iacute;vel por meio do comando as-install-parent<code>/mq/bin/imqbrokerd</code>.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Reconex&atilde;o Ativada para que o servi&ccedil;o JMS tente reconectar-se a um servidor de mensagens (ou a lista de endere&ccedil;os na AddressList) quando uma conex&atilde;o &eacute; perdida.</p>
<p>Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</li>
<li>
<p>No campo Intervalo para Reconectar, digite o n&uacute;mero de segundos entre as tentativas de reconex&atilde;o.</p>
<p>Esse intervalo aplica-se a tentativas em cada endere&ccedil;o na lista AddressList e a endere&ccedil;os sucessivos na lista. Se for muito curto, esse intervalo de tempo n&atilde;o d&aacute; ao broker tempo para ser recuperar. Se for muito longo, a reconex&atilde;o pode representar um atraso inaceit&aacute;vel. O valor default &eacute; 5 segundos.</p>
</li>
<li>
<p>No campo Tentativas de Reconex&atilde;o, digite o n&uacute;mero de tentativas de conex&atilde;o (ou reconex&atilde;o) para cada endere&ccedil;o na AddressList antes de o runtime do cliente tentar o pr&oacute;ximo endere&ccedil;o na lista.</p>
<p>Um valor de -1 indica que o n&uacute;mero de tentativas de reconex&atilde;o &eacute; ilimitado (o runtime do cliente tenta conectar-se ao primeiro endere&ccedil;o at&eacute; conseguir). O valor default &eacute; 3.</p>
</li>
<li>
<p>Na lista drop-down Host JMS Default, selecione o nome do host JMS default.</p>
<p>O valor default &eacute; <code>default_JMS_host</code>.</p>
</li>
<li>
<p>Na lista drop-down Comportamento da Lista de Endere&ccedil;os, selecione a ordem de tentativas de conex&atilde;o.</p>
<ul>
<li>
<p><code>random</code> significa selecionar um endere&ccedil;o na AddressList aleatoriamente.</p>
<p>Se houver muitos clientes tentando conectar-se usando a mesma f&aacute;brica de conex&otilde;es, especifique <code>random</code> para impedi-los de conectarem-se ao mesmo endere&ccedil;o. Essa &eacute; a op&ccedil;&atilde;o default.</p>
</li>
<li>
<p><code>priority</code> significa que a reconex&atilde;o sempre tenta conectar-se ao primeiro endere&ccedil;o do servidor na AddressList e utiliza outro somente se o primeiro broker n&atilde;o estiver dispon&iacute;vel.</p>
</li>
</ul>
</li>
<li>
<p>No campo Itera&ccedil;&otilde;es da Lista de Endere&ccedil;os, digite o n&uacute;mero de vezes que o servi&ccedil;o JMS itera atrav&eacute;s da AddressList em um esfor&ccedil;o para estabelecer (ou restabelecer) uma conex&atilde;o.</p>
<p>Um valor de -1 indica que o n&uacute;mero de tentativas &eacute; ilimitado. O valor default &eacute; 3.</p>
</li>
<li>
<p>Nos campos Esquema MQ e Servi&ccedil;o MQ, digite o nome do esquema de endere&ccedil;o e do servi&ccedil;o de conex&atilde;o doMessage Queue, se um esquema ou servi&ccedil;o n&atilde;o default for utilizado.</p>
<p>Consulte <a href="ref-mqschemeservice.html">Sintaxe de Endere&ccedil;os do Esquema MQ e Servi&ccedil;o MQ</a> para informa&ccedil;&otilde;es de sintaxe.</p>
</li>
<li>
<p>Na se&ccedil;&atilde;o Propriedades Adicionais, especifique propriedades adicionais do servi&ccedil;o JMS.</p>
<p>Para obter informa&ccedil;&otilde;es sobre propriedades dispon&iacute;veis, consulte <a href="ref-jmsservice-additional-props.html">Propriedades Espec&iacute;ficas para o Servi&ccedil;o JMS</a>.</p>
<ul>
<li>
<p>Para adicionar uma propriedade, clique no bot&atilde;o Adicionar Propriedade. Na linha em branco que for exibida, digite o nome da propriedade no campo Nome e digite o valor da propriedade no campo Valor.</p>
</li>
<li>
<p>Para modificar uma propriedade, edite o campo Valor da propriedade.</p>
</li>
<li>
<p>Para deletar uma propriedade, marque a caixa de sele&ccedil;&atilde;o &agrave; esquerda do campo Nome da Propriedade a ser deletada. Clique no bot&atilde;o Deletar Propriedades.</p>
</li>
</ul>
</li>
<li>
<p>Clique em Ping para verificar se o servi&ccedil;o JMS est&aacute; sendo executado no host default JMS.</p>
<p>Se o servi&ccedil;o JMS estiver em execu&ccedil;&atilde;o, uma mensagem informa que o ping foi bem-sucedido.</p>
</li>
<li>
<p>Clique em Salvar.</p>

<hr>
<p><b>Dica:</b></p>
Para voltar &agrave;s defini&ccedil;&otilde;es default, clique no bot&atilde;o Carregar Defaults e depois em Salvar.
<hr>

</li>
</ol>
<a id="sthref21" name="sthref21"></a>
<h5>Acessando Servidores Remotos</h5>
<p>A mudan&ccedil;a de um provedor e um host para um sistema remoto faz com que todas as aplica&ccedil;&otilde;es JMS sejam executadas no servidor remoto. Para utilizar o servidor local e um ou mais servidores remotos, crie um recurso de f&aacute;brica de conex&otilde;es com a propriedade <code>AddressList</code> para criar conex&otilde;es que acessem servidores remotos. Consulte <a href="task-jmsconnectionnew.html">Para Criar um Recurso de F&aacute;brica de Conex&atilde;o JMS</a>.</p>
<a id="sthref22" name="sthref22"></a>
<h5>Comando asadmin equivalente</h5>
<p><code>jms-ping</code></p>
<a id="sthref23" name="sthref23"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-jmshostnew.html">Para Criar um Host JMS</a></p>
</li>
<li>
<p><a href="task-jmshostedit.html">Para Editar um Host JMS</a></p>
</li>
<li>
<p><a href="task-jmshostdelete.html">Para Deletar um Host JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestnew.html">Para Criar um Destino F&iacute;sico JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestedit.html">Para Editar um Destino F&iacute;sico JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestdelete.html">Para Deletar um Destino F&iacute;sico JMS</a></p>
</li>
<li>
<p><a href="task-jmsflushmessages.html">Para Remover Mensagens de um Destino F&iacute;sico JMS</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldeststats.html">Para Exibir Estat&iacute;sticas de um Destino F&iacute;sico JMS</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
