<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsconnectionedit" name="task-jmsconnectionedit"></a></p>

<h4><a id="sthref5" name="sthref5"></a><a id="sthref6" name="sthref6"></a>Para Editar um Recurso de F&aacute;brica de Conex&atilde;o JMS</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Recursos.</p>
</li>
<li>
<p>No n&oacute; Recursos, expanda o n&oacute; Recursos JMS.</p>
</li>
<li>
<p>No n&oacute; Recursos JMS, selecione o n&oacute; F&aacute;bricas de Conex&otilde;es JMS.</p>
<p>A p&aacute;gina F&aacute;bricas de Conex&otilde;es JMS &eacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina F&aacute;bricas de Conex&otilde;es JMS, clique no nome da f&aacute;brica de conex&otilde;es que est&aacute; sendo editada.</p>
<p>A p&aacute;gina Editar F&aacute;brica de Conex&otilde;es JMS &eacute; aberta.</p>
</li>
<li>
<p>No campo Descri&ccedil;&atilde;o, digite uma descri&ccedil;&atilde;o da f&aacute;brica de conex&otilde;es.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Status Ativado para ativar o recurso durante o runtime.</p>
<p>Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</li>
<li>
<p>No campo Tamanho Inicial e M&iacute;nimo do Pool, especifique o n&uacute;mero m&iacute;nimo de conex&otilde;es no Pool.</p>
<p>O valor default &eacute; 8.</p>
</li>
<li>
<p>No campo Tamanho M&aacute;ximo do Pool, especifique o n&uacute;mero m&aacute;ximo de conex&otilde;es no pool.</p>
<p>O valor default &eacute; 32.</p>
</li>
<li>
<p>No campo Quantidade de Redimensionamento do Pool, especifique o n&uacute;mero de conex&otilde;es a serem removidas quando o time-out para inatividade do pool expirar.</p>
<p>O valor default &eacute; 2.</p>
</li>
<li>
<p>No campo Time-out para Ociosidade, especifique a quantidade m&aacute;xima de tempo, em segundos, para que uma conex&atilde;o permane&ccedil;a ociosa no pool.</p>
<p>O valor default &eacute; 300.</p>
</li>
<li>
<p>No campo Tempo M&aacute;ximo de Espera, especifique o tempo m&aacute;ximo que a aplica&ccedil;&atilde;o solicitante da conex&atilde;o aguardar&aacute; at&eacute; obter um time-out.</p>
<p>O valor default &eacute; 60000.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Em Caso de Falha Fechar Todas as Conex&otilde;es para que o GlassFish Server feche todas as conex&otilde;es no pool e as restabele&ccedil;a de uma &uacute;nica conex&atilde;o falhar.</p>
<p>Se voc&ecirc; n&atilde;o marcar a caixa de sele&ccedil;&atilde;o, as conex&otilde;es individuais s&oacute; ser&atilde;o restabelecidas quando forem usadas.</p>
</li>
<li>
<p>Para um recurso de f&aacute;brica de conex&otilde;es JMS, especifique o valor do Suporte de Transa&ccedil;&atilde;o como a seguir:</p>
<ul>
<li>
<p>Especifique <code>XATransaction</code> (o valor default) para um recurso que pode ser usado para transa&ccedil;&otilde;es que envolvam o uso de mais de um recurso dentro do escopo de uma transa&ccedil;&atilde;o.</p>
<p>Por exemplo, esse recurso mais um recurso JDBC, um recurso de conector ou outro recurso de f&aacute;brica de conex&otilde;es JMS. Esse valor oferece a maior flexibilidade. Um recurso que &eacute; configurado como <code>XATransaction</code> participar&aacute; de opera&ccedil;&otilde;es de confirma&ccedil;&atilde;o em duas fases.</p>
</li>
<li>
<p>Especifique <code>LocalTransaction</code> para um recurso que pode ser usado para transa&ccedil;&otilde;es que envolvem somente um recurso dentro do escopo de transa&ccedil;&atilde;o ou como o &uacute;ltimo agente em uma transa&ccedil;&atilde;o distribu&iacute;da que envolve mais de um recurso XA.</p>
<p>Esse valor oferece um desempenho significativamente melhor. Um recurso configurado como <code>LocalTransaction</code> n&atilde;o ser&aacute; utilizado em opera&ccedil;&otilde;es de confirma&ccedil;&atilde;o em duas fases.</p>
</li>
<li>
<p>Especifique <code>NoTransaction</code> para um recurso que nunca pode participar de transa&ccedil;&otilde;es.</p>
<p>Essa defini&ccedil;&atilde;o tem uso limitado em aplica&ccedil;&otilde;es JMS.</p>
</li>
</ul>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Valida&ccedil;&atilde;o de Conex&atilde;o para ativar a valida&ccedil;&atilde;o de conex&atilde;o.</p>
<p>Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>Na se&ccedil;&atilde;o Propriedades Adicionais, especifique propriedades adicionais da f&aacute;brica de conex&otilde;es.</p>
<p>Para obter informa&ccedil;&otilde;es sobre propriedades dispon&iacute;veis, consulte <a href="ref-jmsconnectionproperties.html">Propriedades Espec&iacute;ficas para F&aacute;bricas de Conex&otilde;es JMS</a>.</p>
<ul>
<li>
<p>Para adicionar uma propriedade, clique no bot&atilde;o Adicionar Propriedade. Na linha em branco que for exibida, digite o nome da propriedade no campo Nome e digite o valor da propriedade no campo Valor.</p>
</li>
<li>
<p>Para modificar uma propriedade, edite o campo Valor da propriedade.</p>
</li>
<li>
<p>Para deletar uma propriedade, marque a caixa de sele&ccedil;&atilde;o &agrave; esquerda do campo Nome da Propriedade a ser deletada. Clique no bot&atilde;o Deletar Propriedades.</p>
</li>
</ul>
</li>
<li>
<p>Como op&ccedil;&atilde;o, clique na guia Alvos para acessar a p&aacute;gina Alvos do Recurso da F&aacute;brica de Conex&otilde;es de JMS. Nesta p&aacute;gina, fa&ccedil;a o seguinte:</p>
<ol type="a">
<li>
<p>Clique em Gerenciar Alvos para abrir a p&aacute;gina Gerenciar Alvos do Recurso.</p>
<p>Nesta p&aacute;gina, mova os alvos entre a coluna Dispon&iacute;vel e a coluna Selecionado. Certifique-se de posicionar na coluna Selecionado o alvo ou alvos aos quais as aplica&ccedil;&otilde;es que usam o recurso ser&atilde;o implantadas. Os alvos dispon&iacute;veis incluem os clusters dispon&iacute;veis e as inst&acirc;ncias do servidor, bem como a inst&acirc;ncia do servidor default, <code>server</code>. Clique em OK para salvar as altera&ccedil;&otilde;es.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o de um alvo e, em seguida, clique em Ativar ou Desativar para ativar ou desativar o recurso para esse alvo.</p>
</li>
</ol>
</li>
<li>
<p>Clique em Salvar.</p>

<hr>
<p><b>Dica:</b></p>
Para voltar &agrave;s defini&ccedil;&otilde;es default, clique no bot&atilde;o Carregar Defaults e depois em Salvar.
<hr>

</li>
</ol>
<a id="sthref7" name="sthref7"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-jmsconnectionnew.html">Para Criar um Recurso de F&aacute;brica de Conex&atilde;o JMS</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">Para Deletar um Recurso de F&aacute;brica de Conex&atilde;o JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationnew.html">Para Criar um Recurso de Destino JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationedit.html">Para Editar um Recurso de Destino JMS</a></p>
</li>
<li>
<p><a href="task-jmsdestinationdelete.html">Para Deletar um Recurso de Destino JMS</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
