<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<h4>GlassFish Server 4.0</h4>
<p><a name="BEGIN" id="BEGIN"></a></p>
<p>Web &#32852;&#26426;&#24110;&#21161;</p>
<p></p>

<p>2013 &#24180; 4 &#26376;</p>
<p>&#26412;&#25991;&#26723;&#25552;&#20379; GlassFish Server &#31649;&#29702;&#25511;&#21046;&#21488;&#30340; Web &#27169;&#22359;&#30340;&#21442;&#32771;&#21644;&#20219;&#21153;&#32852;&#26426;&#24110;&#21161;&#20027;&#39064;&#12290;</p>
<p><a id="sthref1" name="sthref1"></a></p>
<hr />
<p>GlassFish Server 4.0 Web &#32852;&#26426;&#24110;&#21161;</p>

<p>Copyright &copy; 2013&#65292;&nbsp;Oracle &#21644;/&#25110;&#20854;&#38468;&#23646;&#20844;&#21496;&#12290;&#20445;&#30041;&#25152;&#26377;&#26435;&#21033;&#12290;</p>
<p>&#26412;&#36719;&#20214;&#21644;&#30456;&#20851;&#25991;&#26723;&#26159;&#26681;&#25454;&#35768;&#21487;&#35777;&#21327;&#35758;&#25552;&#20379;&#30340;&#65292;&#35813;&#35768;&#21487;&#35777;&#21327;&#35758;&#20013;&#35268;&#23450;&#20102;&#20851;&#20110;&#20351;&#29992;&#21644;&#20844;&#24320;&#26412;&#36719;&#20214;&#30340;&#21508;&#31181;&#38480;&#21046;&#65292;&#24182;&#21463;&#30693;&#35782;&#20135;&#26435;&#27861;&#24459;&#30340;&#20445;&#25252;&#12290;&#38500;&#38750;&#35768;&#21487;&#35777;&#21327;&#35758;&#20013;&#26126;&#30830;&#35768;&#21487;&#25110;&#27861;&#24459;&#20801;&#35768;&#65292;&#21542;&#21017;&#19981;&#24471;&#20197;&#20219;&#20309;&#24418;&#24335;&#12289;&#20219;&#20309;&#25163;&#27573;&#20351;&#29992;&#12289;&#22797;&#21360;&#12289;&#22797;&#21046;&#12289;&#32763;&#35793;&#12289;&#20256;&#25773;&#12289;&#20462;&#25913;&#12289;&#35768;&#21487;&#12289;&#20256;&#36755;&#12289;&#20998;&#21457;&#12289;&#23637;&#31034;&#12289;&#25191;&#34892;&#12289;&#21457;&#24067;&#25110;&#26174;&#31034;&#26412;&#36719;&#20214;&#30340;&#20219;&#20309;&#37096;&#20998;&#12290;&#38500;&#38750;&#24212;&#27861;&#24459;&#35201;&#27714;&#38656;&#35201;&#23454;&#29616;&#20114;&#25805;&#20316;&#65292;&#21542;&#21017;&#20005;&#31105;&#23545;&#26412;&#36719;&#20214;&#36827;&#34892;&#36870;&#21521;&#24037;&#31243;&#35774;&#35745;&#12289;&#21453;&#27719;&#32534;&#25110;&#21453;&#32534;&#35793;&#12290;</p>
<p>&#27492;&#25991;&#26723;&#25152;&#21547;&#20449;&#24687;&#21487;&#38543;&#26102;&#20462;&#25913;&#65292;&#24661;&#19981;&#21478;&#34892;&#36890;&#30693;&#12290;&#25105;&#20204;&#19981;&#20445;&#35777;&#27492;&#25991;&#26723;&#20013;&#27809;&#26377;&#38169;&#35823;&#12290;&#22914;&#26524;&#36149;&#26041;&#22312;&#27492;&#25991;&#26723;&#20013;&#21457;&#29616;&#20219;&#20309;&#38382;&#39064;&#65292;&#35831;&#20070;&#38754;&#36890;&#30693;&#25105;&#20204;&#12290;</p>
<p>&#22914;&#26524;&#23558;&#26412;&#36719;&#20214;&#25110;&#30456;&#20851;&#25991;&#26723;&#20132;&#20184;&#32473;&#32654;&#22269;&#25919;&#24220;&#65292;&#25110;&#32773;&#20132;&#20184;&#32473;&#20197;&#32654;&#22269;&#25919;&#24220;&#21517;&#20041;&#33719;&#24471;&#35768;&#21487;&#35777;&#30340;&#20219;&#20309;&#26426;&#26500;&#65292;&#24517;&#39035;&#31526;&#21512;&#20197;&#19979;&#35268;&#23450;&#65306;</p>
<p>U.S. GOVERNMENT RIGHTS Programs, software, databases, and related documentation and technical data delivered to U.S. Government customers are "commercial computer software" or "commercial technical data" pursuant to the applicable Federal Acquisition Regulation and agency-specific supplemental regulations. As such, the use, duplication, disclosure, modification, and adaptation shall be subject to the restrictions and license terms set forth in the applicable Government contract, and, to the extent applicable by the terms of the Government contract, the additional rights set forth in FAR 52.227-19, Commercial Computer Software License (December 2007). Oracle America, Inc., 500 Oracle Parkway, Redwood City, CA 94065.</p>
<p>&#26412;&#36719;&#20214;&#25110;&#30828;&#20214;&#30340;&#24320;&#21457;&#26159;&#29992;&#20110;&#21508;&#31181;&#20449;&#24687;&#31649;&#29702;&#24212;&#29992;&#39046;&#22495;&#30340;&#19968;&#33324;&#29992;&#36884;&#65292;&#19981;&#26159;&#29992;&#20110;&#20219;&#20309;&#23384;&#22312;&#28508;&#22312;&#21361;&#38505;&#30340;&#24212;&#29992;&#39046;&#22495;&#65292;&#21253;&#25324;&#21487;&#33021;&#20135;&#29983;&#20154;&#36523;&#20260;&#23475;&#39118;&#38505;&#30340;&#24212;&#29992;&#39046;&#22495;&#12290;&#22914;&#26524;&#23558;&#26412;&#36719;&#20214;&#25110;&#30828;&#20214;&#29992;&#20110;&#21361;&#38505;&#30340;&#24212;&#29992;&#39046;&#22495;&#20013;&#65292;&#24744;&#24212;&#36127;&#36131;&#37319;&#21462;&#25152;&#26377;&#36866;&#24403;&#30340;&#38450;&#33539;&#25514;&#26045;&#65292;&#21253;&#25324;&#22791;&#20221;&#12289;&#20887;&#20313;&#21644;&#20854;&#23427;&#30830;&#20445;&#23433;&#20840;&#20351;&#29992;&#26412;&#36719;&#20214;&#30340;&#25514;&#26045;&#12290;&#23545;&#20110;&#22240;&#22312;&#21361;&#38505;&#30340;&#24212;&#29992;&#39046;&#22495;&#20013;&#20351;&#29992;&#26412;&#36719;&#20214;&#25110;&#30828;&#20214;&#25152;&#36896;&#25104;&#30340;&#19968;&#20999;&#25439;&#22833;&#25110;&#25439;&#23475;&#65292;Oracle &#21450;&#20854;&#23376;&#20844;&#21496;&#27010;&#19981;&#36127;&#36131;&#12290;</p>
<p>Oracle &#21644; Java &#26159; Oracle &#21644;/&#25110;&#20854;&#38468;&#23646;&#20844;&#21496;&#30340;&#27880;&#20876;&#21830;&#26631;&#12290;&#20854;&#23427;&#21517;&#31216;&#21487;&#33021;&#26159;&#21508;&#33258;&#25152;&#26377;&#32773;&#30340;&#21830;&#26631;&#12290;</p>
<p>Intel &#21644; Intel Xeon &#26159; Intel Corporation &#30340;&#21830;&#26631;&#25110;&#27880;&#20876;&#21830;&#26631;&#12290;&#25152;&#26377; SPARC &#21830;&#26631;&#22343;&#26159; SPARC International, Inc &#30340;&#21830;&#26631;&#25110;&#27880;&#20876;&#21830;&#26631;&#65292;&#24182;&#24212;&#25353;&#29031;&#35768;&#21487;&#35777;&#30340;&#35268;&#23450;&#20351;&#29992;&#12290;AMD&#12289;Opteron&#12289;AMD &#24509;&#26631;&#21644; AMD Opteron &#24509;&#26631;&#26159; Advanced Micro Devices &#30340;&#21830;&#26631;&#25110;&#27880;&#20876;&#21830;&#26631;&#12290;UNIX &#26159; The Open Group &#30340;&#27880;&#20876;&#21830;&#26631;&#12290;</p>
<p>&#26412;&#36719;&#20214;&#25110;&#30828;&#20214;&#21644;&#25991;&#26723;&#21487;&#33021;&#25552;&#20379;&#20102;&#23545;&#31532;&#19977;&#26041;&#20869;&#23481;&#12289;&#20135;&#21697;&#21644;&#26381;&#21153;&#30340;&#35775;&#38382;&#25110;&#19982;&#20854;&#30456;&#20851;&#30340;&#20449;&#24687;&#12290;Oracle &#21450;&#20854;&#23376;&#20844;&#21496;&#23545;&#31532;&#19977;&#26041;&#20869;&#23481;&#12289;&#20135;&#21697;&#21644;&#26381;&#21153;&#27010;&#19981;&#36127;&#36131;&#12290;Oracle &#21450;&#20854;&#23376;&#20844;&#21496;&#23545;&#36149;&#26041;&#22240;&#35775;&#38382;&#25110;&#20351;&#29992;&#31532;&#19977;&#26041;&#20869;&#23481;&#12289;&#20135;&#21697;&#21644;&#26381;&#21153;&#25152;&#23548;&#33268;&#30340;&#20219;&#20309;&#25439;&#22833;&#12289;&#36153;&#29992;&#25110;&#25439;&#23475;&#27010;&#19981;&#36127;&#36131;&#12290;</p>
