<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-threadpools" name="ref-threadpools"></a></p>

<h4><a id="sthref168" name="sthref168"></a><a id="sthref169" name="sthref169"></a>&#32447;&#31243;&#27744;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&ldquo;&#32447;&#31243;&#27744;&rdquo;&#39029;&#21487;&#20197;&#37197;&#32622;&#32447;&#31243;&#27744;&#12290;</p>
<p>&#20351;&#29992;&#32447;&#31243;&#27744;&#21487;&#23558;&#26381;&#21153;&#38480;&#21046;&#21040;&#29305;&#23450;&#25968;&#37327;&#30340;&#24182;&#21457;&#32447;&#31243;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#22312;&#24744;&#31532;&#19968;&#27425;&#23433;&#35013; GlassFish Server &#26102;&#65292;&#23384;&#22312;&#20004;&#20010;&#32447;&#31243;&#27744;&#12290;&#21517;&#20026; <code>http-thread-pool</code> &#30340;&#32447;&#31243;&#27744;&#37197;&#32622;&#20026;&#20379;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;&#20351;&#29992;&#65292;&#32780;&#21517;&#20026; <code>thread-pool-1</code> &#30340;&#32447;&#31243;&#27744;&#21017;&#37197;&#32622;&#20026;&#20379; ORB &#29992;&#20110;&#22788;&#29702; RMI/IIOP &#35831;&#27714;&#12290;&#24744;&#21487;&#33021;&#38656;&#35201;&#21019;&#24314;&#19968;&#20010;&#20855;&#26377;&#19981;&#21516;&#35774;&#32622;&#30340;&#32447;&#31243;&#27744;&#65292;&#20197;&#20379;&#29305;&#23450;&#31867;&#22411;&#30340;&#24212;&#29992;&#31243;&#24207;&#21644;&#29305;&#23450;&#30340;&#30828;&#20214;&#31995;&#32479;&#20351;&#29992;&#65292;&#25110;&#32773;&#35843;&#33410;&#40664;&#35748;&#32447;&#31243;&#27744;&#20197;&#28385;&#36275;&#24744;&#30340;&#38656;&#27714;&#12290;</p>
<p>Java &#34394;&#25311;&#26426; (JVM) &#21487;&#20197;&#25903;&#25345;&#19968;&#27425;&#25191;&#34892;&#22810;&#20010;&#32447;&#31243;&#12290;&#20026;&#20102;&#25552;&#39640;&#24615;&#33021;&#65292;GlassFish Server &#32500;&#25252;&#19968;&#20010;&#25110;&#22810;&#20010;&#32447;&#31243;&#27744;&#12290;&#21487;&#20197;&#23558;&#29305;&#23450;&#32447;&#31243;&#27744;&#20998;&#37197;&#33267;&#29305;&#23450;&#26381;&#21153;&#12290;</p>
<p>&#19968;&#20010;&#32447;&#31243;&#27744;&#21487;&#20197;&#20026;&#22810;&#39033;&#26381;&#21153;&#25552;&#20379;&#26381;&#21153;&#12290;&#35831;&#27714;&#32447;&#31243;&#22788;&#29702;&#29992;&#25143;&#35831;&#27714;&#12290;&#26381;&#21153;&#22120;&#25509;&#25910;&#21040;&#35831;&#27714;&#26102;&#65292;&#23427;&#20250;&#23558;&#35831;&#27714;&#25351;&#23450;&#32473;&#32447;&#31243;&#27744;&#20013;&#30340;&#31354;&#38386;&#32447;&#31243;&#12290;&#35813;&#32447;&#31243;&#25191;&#34892;&#23458;&#25143;&#26426;&#30340;&#35831;&#27714;&#24182;&#36820;&#22238;&#32467;&#26524;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#35831;&#27714;&#38656;&#35201;&#20351;&#29992;&#30340;&#31995;&#32479;&#36164;&#28304;&#24403;&#21069;&#27491;&#22788;&#20110;&#24537;&#30860;&#29366;&#24577;&#65292;&#21017;&#32447;&#31243;&#20250;&#22312;&#20801;&#35768;&#35831;&#27714;&#20351;&#29992;&#35813;&#36164;&#28304;&#21069;&#65292;&#31561;&#24453;&#36164;&#28304;&#22238;&#21040;&#31354;&#38386;&#29366;&#24577;&#12290;</p>
<p>&#25351;&#23450;&#35201;&#39044;&#30041;&#32473;&#35831;&#27714;&#30340;&#26368;&#23567;&#32447;&#31243;&#25968;&#21644;&#26368;&#22823;&#32447;&#31243;&#25968;&#12290;&#32447;&#31243;&#27744;&#22312;&#36825;&#20004;&#20010;&#20540;&#20043;&#38388;&#21160;&#24577;&#35843;&#25972;&#12290;&#25351;&#23450;&#26368;&#23567;&#32447;&#31243;&#27744;&#22823;&#23567;&#21518;&#65292;&#31995;&#32479;&#23558;&#36890;&#30693;&#26381;&#21153;&#22120;&#33267;&#23569;&#20998;&#37197;&#35813;&#22823;&#23567;&#30340;&#39044;&#30041;&#32473;&#35831;&#27714;&#30340;&#32447;&#31243;&#25968;&#12290;&#21487;&#20197;&#23558;&#32447;&#31243;&#25968;&#22686;&#21152;&#21040;&#25152;&#25351;&#23450;&#30340;&#26368;&#22823;&#32447;&#31243;&#27744;&#22823;&#23567;&#12290;</p>
<p>&#22914;&#26524;&#22686;&#21152;&#21487;&#20379;&#36827;&#31243;&#20351;&#29992;&#30340;&#32447;&#31243;&#25968;&#65292;&#21017;&#35813;&#36827;&#31243;&#21487;&#20197;&#21516;&#26102;&#23545;&#26356;&#22810;&#30340;&#35831;&#27714;&#36827;&#34892;&#21709;&#24212;&#12290;</p>
<p>&#23545;&#20110;&#27599;&#20010;&#32447;&#31243;&#27744;&#65292;&#23558;&#25552;&#20379;&#20197;&#19979;&#20449;&#24687;&#12290;</p>
<dl>
<dt>&#32447;&#31243;&#27744; ID</dt>
<dd>
<p>&#32447;&#31243;&#27744;&#21517;&#31216;&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#32447;&#31243;&#27744;&#22823;&#23567;</dt>
<dd>
<p>&#32447;&#31243;&#27744;&#20013;&#32447;&#31243;&#30340;&#26368;&#22823;&#25968;&#37327;&#12290;</p>
</dd>
<dt>&#26368;&#23567;&#32447;&#31243;&#27744;&#22823;&#23567;</dt>
<dd>
<p>&#32447;&#31243;&#27744;&#20013;&#32447;&#31243;&#30340;&#26368;&#23567;&#25968;&#37327;&#12290;&#36825;&#20123;&#32447;&#31243;&#26159;&#22312;&#23545;&#32447;&#31243;&#27744;&#36827;&#34892;&#23454;&#20363;&#21270;&#26102;&#21019;&#24314;&#30340;&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#38431;&#21015;&#22823;&#23567;</dt>
<dd>
<p>&#22312;&#26377;&#32447;&#31243;&#21487;&#29992;&#26469;&#22788;&#29702;&#28040;&#24687;&#20043;&#21069;&#65292;&#21487;&#20197;&#25490;&#38431;&#30340;&#26368;&#22823;&#28040;&#24687;&#25968;&#12290;</p>
</dd>
<dt>&#31354;&#38386;&#32447;&#31243;&#36229;&#26102;</dt>
<dd>
<p>&#20174;&#27744;&#20013;&#21024;&#38500;&#31354;&#38386;&#32447;&#31243;&#20043;&#21069;&#32463;&#36807;&#30340;&#26102;&#38388; (&#31186;)&#12290;</p>
</dd>
</dl>
<p>&ldquo;&#32447;&#31243;&#27744;&rdquo;&#34920;&#36824;&#21253;&#21547;&#20197;&#19979;&#36873;&#39033;&#12290;</p>
<dl>
<dt>&#26032;&#24314;</dt>
<dd>
<p>&#29992;&#20110;&#21019;&#24314;&#26032;&#32447;&#31243;&#27744;&#30340;&#25353;&#38062;&#12290;</p>
</dd>
<dt>&#21024;&#38500;</dt>
<dd>
<p>&#29992;&#20110;&#21024;&#38500;&#19968;&#20010;&#25110;&#22810;&#20010;&#25152;&#36873;&#32447;&#31243;&#27744;&#30340;&#25353;&#38062;&#12290;</p>
</dd>
</dl>
<a id="sthref170" name="sthref170"></a>
<h5>&#30456;&#20851;&#20219;&#21153;</h5>
<ul>
<li>
<p><a href="task-threadpoolnew.html">&#21019;&#24314;&#32447;&#31243;&#27744;</a></p>
</li>
<li>
<p><a href="task-threadpooledit.html">&#32534;&#36753;&#32447;&#31243;&#27744;</a></p>
</li>
<li>
<p><a href="task-threadpooldelete.html">&#21024;&#38500;&#32447;&#31243;&#27744;</a></p>
</li>
</ul>
<a id="sthref171" name="sthref171"></a>
<h5>&#30456;&#20851;&#30340; asadmin &#21629;&#20196;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00060"><code>create-threadpool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00204"><code>list-threadpools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00111"><code>delete-threadpool</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
