<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-networklistenernew" name="ref-networklistenernew"></a><a id="GHWEB00016" name="GHWEB00016"></a></p>

<h4><a id="sthref132" name="sthref132"></a>&#26032;&#24314;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&ldquo;&#26032;&#24314;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;&rdquo;&#39029;&#21487;&#20197;&#21019;&#24314;&#26032;&#30340;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;&#12290;</p>
<p>&#22312;&#21019;&#24314;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;&#26102;&#65292;&#21487;&#20197;&#21516;&#26102;&#21019;&#24314;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;&#23558;&#20351;&#29992;&#30340;&#21327;&#35758;&#65292;&#20063;&#21487;&#20197;&#20351;&#29992;&#26368;&#21021;&#21019;&#24314;&#30340;&#21327;&#35758;&#12290;&#36890;&#24120;&#65292;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;&#19982;&#20854;&#20851;&#32852;&#21327;&#35758;&#20043;&#38388;&#23384;&#22312;&#19968;&#23545;&#19968;&#20851;&#31995;&#65292;&#20294;&#36825;&#24182;&#19981;&#26159;&#24517;&#38656;&#30340;&#12290;</p>
<p>&ldquo;&#26032;&#24314;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;&rdquo;&#39029;&#21253;&#21547;&#20197;&#19979;&#36873;&#39033;&#12290;</p>
<dl>
<dt>&#37197;&#32622;&#21517;&#31216;</dt>
<dd>
<p>&#27492;&#39029;&#19978;&#30340;&#35774;&#32622;&#24212;&#29992;&#21040;&#30340;&#37197;&#32622;&#30340;&#21517;&#31216;&#12290;&#27492;&#23383;&#27573;&#20026;&#21482;&#35835;&#12290;</p>
</dd>
<dt>&#21517;&#31216;</dt>
<dd>
<p>&#21807;&#19968;&#30340;&#30417;&#21548;&#31243;&#24207;&#21517;&#31216;&#12290;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;&#21517;&#31216;&#19981;&#33021;&#20197;&#25968;&#23383;&#24320;&#22836;&#12290;</p>
</dd>
<dt>&#21327;&#35758;</dt>
<dd>
<p>&#19982;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;&#20851;&#32852;&#30340;&#21327;&#35758;&#12290;&#20197;&#19979;&#36873;&#39033;&#25351;&#23450;&#26159;&#21019;&#24314;&#21327;&#35758;&#36824;&#26159;&#20351;&#29992;&#29616;&#26377;&#21327;&#35758;&#12290;</p>
<dl>
<dt>&#21019;&#24314;&#26032;&#30340;&#21327;&#35758;</dt>
<dd>
<p>&#20026;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;&#21019;&#24314;&#20351;&#29992;&#40664;&#35748;&#35774;&#32622;&#30340;&#26032;&#21327;&#35758;&#12290;&#21327;&#35758;&#30340;&#40664;&#35748;&#21517;&#31216;&#20026;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;&#21517;&#31216;&#38468;&#21152; <code>-protocol</code>&#65292;&#20294;&#24744;&#21487;&#20197;&#32534;&#36753;&#35813;&#20540;&#12290;</p>
<dl>
<dt>&#34394;&#25311;&#26381;&#21153;&#22120;</dt>
<dd>
<p>&#23545;&#20110;&#26032;&#21327;&#35758;&#65292;&#27492;&#36873;&#39033;&#20026;&#35201;&#19982;&#21327;&#35758;&#20851;&#32852;&#30340;&#34394;&#25311;&#26381;&#21153;&#22120;&#12290;</p>
</dd>
</dl>
</dd>
<dt>&#20351;&#29992;&#29616;&#26377;&#30340;&#21327;&#35758;</dt>
<dd>
<p>&#20351;&#29992;&#25152;&#36873;&#21327;&#35758;&#12290;&#21327;&#35758;&#20915;&#23450;&#20102;&#26159;&#21542;&#20026;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;&#21551;&#29992;&#23433;&#20840;&#24615;&#12290;</p>
</dd>
</dl>
</dd>
<dt>&#29366;&#24577;</dt>
<dd>
<p>&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;&#29366;&#24577;&#12290;&#30417;&#21548;&#31243;&#24207;&#21487;&#33021;&#24050;&#21551;&#29992;&#25110;&#24050;&#31105;&#29992;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#21551;&#29992;&#27492;&#36873;&#39033;&#12290;&#22914;&#26524;&#31105;&#29992;&#20102;&#30417;&#21548;&#31243;&#24207;&#65292;&#21017;&#21482;&#35201;&#23581;&#35797;&#36830;&#25509;&#21040;&#30417;&#21548;&#31243;&#24207;&#65292;&#20415;&#20250;&#23548;&#33268;&#22871;&#25509;&#23383;&#24322;&#24120; (<code>java.net.ConnectException</code>)&#12290;</p>
<p>&#22312; GlassFish Server 9.1 &#20197;&#21069;&#30340;&#29256;&#26412;&#20013;&#65292;&#22914;&#26524;&#30417;&#21548;&#31243;&#24207;&#30340;&ldquo;&#24050;&#21551;&#29992;&rdquo;&#23646;&#24615;&#35774;&#32622;&#20026;&ldquo;&#20551;&rdquo;&#65292;&#21017;&#23545;&#20110;&#21457;&#36865;&#32473;&#23427;&#30340;&#20219;&#20309;&#35831;&#27714;&#65292;&#23427;&#37117;&#23558;&#36820;&#22238; 404 &#21709;&#24212;&#20195;&#30721;&#12290;&#35201;&#22312;&#24403;&#21069; GlassFish Server &#29256;&#26412;&#20013;&#23454;&#29616;&#27492;&#34892;&#20026;&#65292;&#35831;&#23558;&#30417;&#21548;&#31243;&#24207;&#30340;&#29366;&#24577;&#35774;&#32622;&#20026;&ldquo;&#24050;&#21551;&#29992;&rdquo;&#65292;&#24182;&#23558;&#27599;&#20010;&#20851;&#32852;&#34394;&#25311;&#26381;&#21153;&#22120;&#30340;&#29366;&#24577;&#35774;&#32622;&#20026;&ldquo;&#20851;&#38381;&rdquo;&#12290;&#34394;&#25311;&#26381;&#21153;&#22120;&#20250;&#22312;&ldquo;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#21015;&#20986;&#20851;&#32852;&#30417;&#21548;&#31243;&#24207;&#12290;</p>
</dd>
<dt>&#23433;&#20840;&#24615;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&#27492;&#36873;&#39033;&#65292;&#21017;&#23558;&#20026;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;&#20351;&#29992;&#30340;&#21327;&#35758;&#21551;&#29992;&#23433;&#20840;&#24615;&#12290;&ldquo;&#23433;&#20840;&#24615;&rdquo;&#23383;&#27573;&#26159;&#21482;&#35835;&#23383;&#27573;&#12290;</p>
<p>&#22914;&#26524;&#27491;&#22312;&#20026;&#22495;&#31649;&#29702;&#26381;&#21153;&#22120; (DAS) &#37197;&#32622; <code>admin-listener</code>&#65292;&#32780;&#35813;&#26381;&#21153;&#22120;&#20351;&#29992; <code>server-config</code> &#37197;&#32622;&#65292;&#21017;&#27492;&#36873;&#39033;&#26159;&#21482;&#35835;&#30340;&#12290;&#35201;&#20026;&#27492;&#30417;&#21548;&#31243;&#24207;&#21551;&#29992;&#23433;&#20840;&#24615;&#65292;&#24517;&#39035;&#21551;&#29992;&#23433;&#20840;&#31649;&#29702;&#12290;&#35831;&#21442;&#38405;<a href="../../../common/en/help/ref-securityadmin.html">&#23433;&#20840;&#31649;&#29702;</a>&#12290;</p>
</dd>
<dt>JK &#30417;&#21548;&#31243;&#24207;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&#27492;&#36873;&#39033;&#65292;&#21017;&#30417;&#21548;&#31243;&#24207;&#25903;&#25345; Apache &#30340; <code>mod-jk</code> &#21327;&#35758;&#12290;<code>mod-jk</code> &#21327;&#35758;&#26159; Apache &#30340; <code>httpd</code> (Web &#26381;&#21153;&#22120;) &#19982; GlassFish Server &#21518;&#31471;&#23454;&#20363;&#20043;&#38388;&#30340;&#19987;&#26377;&#36890;&#20449;/&#32593;&#32476;&#21327;&#35758;&#12290;&#22914;&#26524;&#30417;&#21548;&#31243;&#24207;&#25903;&#25345;&#27492;&#21327;&#35758;&#65292;&#21017;&#20551;&#23450; <code>httpd</code> &#22788;&#29702;&#25152;&#26377;&#38745;&#24577;&#20869;&#23481;&#65292;&#32780;&#38024;&#23545;&#21160;&#24577;&#36164;&#28304; (&#21363; Servlet &#21644; JSP) &#30340;&#20219;&#20309;&#35831;&#27714;&#65292;&#37117;&#23558;&#20351;&#29992; <code>mod-jk</code> &#21327;&#35758;&#36335;&#30001;&#21040; GlassFish Server &#30340;&#21551;&#29992; <code>mod-jk</code> &#30340;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#31471;&#21475;</dt>
<dd>
<p>&#30417;&#21548;&#31243;&#24207;&#23558;&#30417;&#21548;&#30340;&#31471;&#21475;&#21495;&#12290;&#21512;&#27861;&#20540;&#20026; 1 &#21040; 65535&#12290;&#22312; UNIX &#31995;&#32479;&#19978;&#65292;&#21019;&#24314;&#29992;&#20110;&#30417;&#21548; 1 &#21040; 1024 &#31471;&#21475;&#30340;&#22871;&#25509;&#23383;&#38656;&#35201;&#36229;&#32423;&#29992;&#25143;&#26435;&#38480;&#12290;</p>
</dd>
<dt>&#22320;&#22336;</dt>
<dd>
<p>&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;&#23558;&#30417;&#21548;&#30340; IP &#22320;&#22336;&#12290;&#35813;&#22320;&#22336;&#21487;&#20197;&#37319;&#29992;&#28857;&#23545;&#24418;&#24335;&#25110; IPv6 &#34920;&#31034;&#27861;&#12290;&#23427;&#21487;&#20197;&#20026; <code>any</code> (&#23545;&#20110; <code>INADDR_ANY</code>)&#65292;&#30417;&#21548;&#25152;&#26377; IP &#22320;&#22336;&#12290;&#23427;&#21487;&#20197;&#20026;&#20027;&#26426;&#21517;&#12290;</p>
</dd>
<dt>&#32447;&#31243;&#27744;</dt>
<dd>
<p>&#19982;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;&#20851;&#32852;&#30340;&#32447;&#31243;&#27744;&#12290;&#36890;&#24120;&#65292;&#24744;&#20250;&#36873;&#25321;&#22312;&#23433;&#35013; GlassFish Server &#26102;&#37197;&#32622;&#30340;&#20004;&#20010;&#32447;&#31243;&#27744;&#20013;&#30340;&#19968;&#20010;&#12290;</p>
</dd>
<dt>&#20256;&#36755;</dt>
<dd>
<p>&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;&#30340;&#20256;&#36755;&#31867;&#22411;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#21807;&#19968;&#36873;&#25321;&#20026; <code>tcp</code>&#12290;</p>
</dd>
</dl>
<a id="sthref133" name="sthref133"></a>
<h5>&#30456;&#20851;&#20219;&#21153;</h5>
<ul>
<li>
<p><a href="task-networklistenernew.html">&#21019;&#24314;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-networklisteneredit.html">&#32534;&#36753;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-networklistenerdelete.html">&#21024;&#38500;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-protocolnew.html">&#21019;&#24314;&#21327;&#35758;</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">&#32534;&#36753;&#21327;&#35758;</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">&#32534;&#36753;&#21327;&#35758;&#30340; SSL &#35774;&#32622;</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">&#32534;&#36753;&#21327;&#35758;&#30340; HTTP &#35774;&#32622;</a></p>
</li>
<li>
<p><a href="task-protocolfilecacheedit.html">&#32534;&#36753;&#21327;&#35758;&#30340;&#25991;&#20214;&#39640;&#36895;&#32531;&#23384;&#35774;&#32622;</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">&#21024;&#38500;&#21327;&#35758;</a></p>
</li>
<li>
<p><a href="task-virtualservercreate.html">&#21019;&#24314;&#34394;&#25311;&#26381;&#21153;&#22120;</a></p>
</li>
</ul>
<a id="sthref134" name="sthref134"></a>
<h5>&#30456;&#20851;&#30340; asadmin &#21629;&#20196;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00046"><code>create-network-listener</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00186"><code>list-network-listeners</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00098"><code>delete-network-listener</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
