<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-virtualserverprops" name="ref-virtualserverprops"></a></p>

<h4><a id="sthref124" name="sthref124"></a><a id="sthref125" name="sthref125"></a>&#29305;&#23450;&#20110;&#34394;&#25311;&#26381;&#21153;&#22120;&#30340;&#23646;&#24615;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20197;&#19979;&#20854;&#20182;&#23646;&#24615;&#21487;&#29992;&#20110;&#34394;&#25311;&#26381;&#21153;&#22120;&#12290;</p>
<dl>
<dt><code>sso-max-inactive-seconds</code></dt>
<dd>
<p>&#25351;&#23450;&#22914;&#26524;&#26410;&#25509;&#25910;&#21040;&#20219;&#20309;&#23458;&#25143;&#26426;&#27963;&#21160;&#65292;&#22312;&#21487;&#20197;&#28165;&#38500;&#29992;&#25143;&#30340;&#21333;&#28857;&#30331;&#24405;&#35760;&#24405;&#20043;&#21069;&#31561;&#24453;&#30340;&#31186;&#25968;&#12290;&#30001;&#20110;&#21333;&#28857;&#30331;&#24405;&#24212;&#29992;&#21040;&#21516;&#19968;&#21488;&#34394;&#25311;&#26381;&#21153;&#22120;&#19978;&#30340;&#22810;&#20010;&#24212;&#29992;&#31243;&#24207;&#65292;&#22240;&#27492;&#23545;&#20854;&#20013;&#20219;&#20309;&#19968;&#20010;&#24212;&#29992;&#31243;&#24207;&#30340;&#35775;&#38382;&#37117;&#21487;&#20197;&#20351;&#21333;&#28857;&#30331;&#24405;&#35760;&#24405;&#20445;&#25345;&#27963;&#21160;&#29366;&#24577;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#26159; 300 &#31186; (5 &#20998;&#38047;)&#12290;&#36739;&#39640;&#30340;&#20540;&#20026;&#29992;&#25143;&#25552;&#20379;&#20102;&#36739;&#38271;&#30340;&#21333;&#28857;&#30331;&#24405;&#25345;&#20037;&#24615;&#65292;&#20294;&#20250;&#21344;&#29992;&#26381;&#21153;&#22120;&#30340;&#26356;&#22810;&#20869;&#23384;&#12290;</p>
</dd>
<dt><code>sso-reap-interval-seconds</code></dt>
<dd>
<p>&#25351;&#23450;&#28165;&#38500;&#21040;&#26399;&#30340;&#21333;&#28857;&#30331;&#24405;&#35760;&#24405;&#30340;&#26102;&#38388;&#38388;&#38548; (&#31186;)&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 60&#12290;</p>
</dd>
<dt><code>ssoCookieSecure</code></dt>
<dd>
<p>&#35774;&#32622;&#19982;&#37096;&#32626;&#21040;&#27492;&#34394;&#25311;&#26381;&#21153;&#22120;&#30340; Web &#24212;&#29992;&#31243;&#24207;&#20851;&#32852;&#30340;&#20219;&#20309; <code>JSESSIONIDSSO</code> cookie &#30340; <code>Secure</code> &#23646;&#24615;&#12290;&#21482;&#26377;&#22312;&#21551;&#29992;&#21333;&#28857;&#30331;&#24405;&#26102;&#65292;&#27492;&#23646;&#24615;&#25165;&#36866;&#29992;&#12290;&#20801;&#35768;&#30340;&#20540;&#21253;&#25324;&#65306;</p>
<dl>
<dt><code>&#30495;</code></dt>
<dd>
<p>&#23558; <code>Secure</code> &#35774;&#32622;&#20026;&#30495;&#12290;</p>
</dd>
<dt><code>&#20551;</code></dt>
<dd>
<p>&#23558; <code>Secure</code> &#35774;&#32622;&#20026;&#20551;&#12290;</p>
</dd>
<dt><code>dynamic</code></dt>
<dd>
<p><code>JSESSIONIDSSO</code> cookie &#32487;&#25215;&#21442;&#19982; SSO &#30340;&#31532;&#19968;&#20010;&#20250;&#35805;&#30340; <code>Secure</code> &#35774;&#32622;&#12290;</p>
</dd>
</dl>
<p>&#35201;&#35774;&#32622; <code>JSESSIONID</code> cookie &#30340; Secure &#23646;&#24615;&#65292;&#35831;&#20351;&#29992; <code>sun-web.xml</code> &#25991;&#20214;&#20013;&#30340; <code>cookieSecure</code> <code>cookie-properties</code> &#23646;&#24615;&#12290;&#26377;&#20851;&#35814;&#32454;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00130"><i>Oracle GlassFish Server Application Deployment Guide</i> &#20013;&#30340; <i>cookie-properties</i></a>&#12290;</p>
</dd>
<dt><code>setCacheControl</code></dt>
<dd>
<p>&#25351;&#23450; <code>Cache-Control</code> &#21709;&#24212;&#25351;&#20196;&#30340;&#36887;&#21495;&#20998;&#38548;&#21015;&#34920;&#12290;&#26377;&#20851;&#26377;&#25928;&#25351;&#20196;&#30340;&#21015;&#34920;&#65292;&#35831;&#21442;&#38405;&#20301;&#20110; http://www.ietf.org/rfc/rfc2616.txt (<code><a href="http://www.ietf.org/rfc/rfc2616.txt">http://www.ietf.org/rfc/rfc2616.txt</a></code>) &#30340;&#25991;&#26723;&#30340;&#31532; 14.9 &#33410;&#12290;</p>
</dd>
<dt><code>accessLogBufferSize</code></dt>
<dd>
<p>&#25351;&#23450;&#23384;&#20648;&#35775;&#38382;&#26085;&#24535;&#35843;&#29992;&#30340;&#32531;&#20914;&#21306;&#30340;&#22823;&#23567; (&#23383;&#33410;)&#12290;&#22914;&#26524;&#35813;&#20540;&#23567;&#20110; 5120&#65292;&#21017;&#31995;&#32479;&#20250;&#21457;&#20986;&#35686;&#21578;&#28040;&#24687;&#65292;&#24182;&#23558;&#35813;&#20540;&#35774;&#32622;&#20026; 5120&#12290;&#40664;&#35748;&#20540;&#20026; 32768&#12290;</p>
</dd>
<dt><code>accessLogWriterInterval</code></dt>
<dd>
<p>&#25351;&#23450;&#22312;&#23558;&#26085;&#24535;&#20889;&#20837;&#30913;&#30424;&#20043;&#21069;&#32463;&#36807;&#30340;&#31186;&#25968;&#12290;&#32531;&#20914;&#21306;&#24050;&#28385;&#25110;&#36229;&#36807;&#26102;&#38388;&#38388;&#38548;&#26102;&#20889;&#20837;&#35775;&#38382;&#26085;&#24535;&#12290;&#22914;&#26524;&#35813;&#20540;&#20026; 0&#65292;&#21017;&#31995;&#32479;&#22987;&#32456;&#20250;&#23558;&#25968;&#25454;&#20889;&#20837;&#32531;&#20914;&#21306;&#65292;&#21363;&#20351;&#32531;&#20914;&#21306;&#26410;&#28385;&#20063;&#26159;&#22914;&#27492;&#12290;&#36825;&#24847;&#21619;&#30528;&#27599;&#27425;&#35775;&#38382;&#26381;&#21153;&#22120;&#26102;&#37117;&#23558;&#26085;&#24535;&#28040;&#24687;&#30452;&#25509;&#23384;&#20648;&#21040;&#35813;&#25991;&#20214;&#20013;&#12290;&#40664;&#35748;&#20540;&#20026; 300&#12290;</p>
</dd>
<dt><code>allowRemoteAddress</code></dt>
<dd>
<p>&#25351;&#23450;&#29992;&#20110;&#27604;&#36739;&#36828;&#31243;&#23458;&#25143;&#26426; IP &#22320;&#22336;&#30340;&#27491;&#21017;&#34920;&#36798;&#24335;&#27169;&#24335;&#30340;&#36887;&#21495;&#20998;&#38548;&#21015;&#34920;&#12290;&#22914;&#26524;&#25351;&#23450;&#20102;&#27492;&#23646;&#24615;&#65292;&#21017;&#36828;&#31243;&#22320;&#22336;<i>&#24517;&#39035;</i>&#21305;&#37197;&#65292;&#25165;&#20250;&#25509;&#21463;&#27492;&#35831;&#27714;&#12290;&#22914;&#26524;&#26410;&#25351;&#23450;&#27492;&#23646;&#24615;&#65292;&#21017;&#20250;&#25509;&#21463;&#25152;&#26377;&#35831;&#27714;&#65292;<i>&#38500;&#38750;</i>&#36828;&#31243;&#22320;&#22336;&#19982; <code>denyRemoteAddress</code> &#27169;&#24335;&#21305;&#37197;&#12290;</p>
</dd>
<dt><code>denyRemoteAddress</code></dt>
<dd>
<p>&#25351;&#23450;&#29992;&#20110;&#27604;&#36739;&#36828;&#31243;&#23458;&#25143;&#26426; IP &#22320;&#22336;&#30340;&#27491;&#21017;&#34920;&#36798;&#24335;&#27169;&#24335;&#30340;&#36887;&#21495;&#20998;&#38548;&#21015;&#34920;&#12290;&#22914;&#26524;&#25351;&#23450;&#20102;&#27492;&#23646;&#24615;&#65292;&#21017;&#36828;&#31243;&#22320;&#22336;&#24517;&#39035;<i>&#19981;</i>&#21305;&#37197;&#65292;&#25165;&#20250;&#25509;&#21463;&#27492;&#35831;&#27714;&#12290;&#22914;&#26524;&#26410;&#25351;&#23450;&#27492;&#23646;&#24615;&#65292;&#23558;&#20165;&#30001; <code>allowRemoteAddress</code> &#23646;&#24615;&#26469;&#25511;&#21046;&#26159;&#21542;&#25509;&#21463;&#35831;&#27714;&#12290;</p>
</dd>
<dt><code>allowRemoteHost</code></dt>
<dd>
<p>&#25351;&#23450;&#29992;&#20110;&#27604;&#36739;&#36828;&#31243;&#23458;&#25143;&#26426;&#20027;&#26426;&#21517; (&#30001; <code>[java.net.]Socket.getInetAddress().getHostName()</code> &#36820;&#22238;) &#30340;&#27491;&#21017;&#34920;&#36798;&#24335;&#27169;&#24335;&#30340;&#36887;&#21495;&#20998;&#38548;&#21015;&#34920;&#12290;&#22914;&#26524;&#25351;&#23450;&#20102;&#27492;&#23646;&#24615;&#65292;&#21017;&#36828;&#31243;&#20027;&#26426;&#21517;<i>&#24517;&#39035;</i>&#21305;&#37197;&#65292;&#25165;&#20250;&#25509;&#21463;&#27492;&#35831;&#27714;&#12290;&#22914;&#26524;&#26410;&#25351;&#23450;&#27492;&#23646;&#24615;&#65292;&#21017;&#20250;&#25509;&#21463;&#25152;&#26377;&#35831;&#27714;&#65292;<i>&#38500;&#38750;</i>&#36828;&#31243;&#20027;&#26426;&#21517;&#19982; <code>denyRemoteHost</code> &#27169;&#24335;&#21305;&#37197;&#12290;</p>
</dd>
<dt><code>denyRemoteHost</code></dt>
<dd>
<p>&#25351;&#23450;&#29992;&#20110;&#27604;&#36739;&#36828;&#31243;&#23458;&#25143;&#26426;&#20027;&#26426;&#21517; (&#30001; <code>[java.net.]Socket.getInetAddress().getHostName()</code> &#36820;&#22238;) &#30340;&#27491;&#21017;&#34920;&#36798;&#24335;&#27169;&#24335;&#30340;&#36887;&#21495;&#20998;&#38548;&#21015;&#34920;&#12290;&#22914;&#26524;&#25351;&#23450;&#20102;&#27492;&#23646;&#24615;&#65292;&#21017;&#36828;&#31243;&#20027;&#26426;&#21517;&#24517;&#39035;<i>&#19981;</i>&#21305;&#37197;&#65292;&#25165;&#20250;&#25509;&#21463;&#27492;&#35831;&#27714;&#12290;&#22914;&#26524;&#26410;&#25351;&#23450;&#27492;&#23646;&#24615;&#65292;&#23558;&#20165;&#30001; <code>allowRemoteHost</code> &#23646;&#24615;&#26469;&#25511;&#21046;&#26159;&#21542;&#25509;&#21463;&#35831;&#27714;&#12290;</p>
<p>&#22914;&#26524;&#36890;&#36807;&#21551;&#29992;&#20102;&ldquo;JK &#30417;&#21548;&#31243;&#24207;&rdquo;&#36873;&#39033;&#30340;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;&#35775;&#38382; GlassFish Server &#22495;&#65292;&#21017;&#35774;&#32622;&#27492;&#23646;&#24615;&#23558;&#19981;&#36215;&#20316;&#29992;&#12290;</p>
</dd>
<dt><code>authRealm</code></dt>
<dd>
<p>&#25351;&#23450;&#39564;&#35777;&#39046;&#22495;&#30340;&#21517;&#31216;&#65292;&#35813;&#39046;&#22495;&#23558;&#35206;&#30422;&#24050;&#37096;&#32626;&#33267;&#27492;&#34394;&#25311;&#26381;&#21153;&#22120;&#30340;&#29420;&#31435; Web &#24212;&#29992;&#31243;&#24207;&#30340;&#26381;&#21153;&#22120;&#23454;&#20363;&#40664;&#35748;&#39046;&#22495;&#12290;&#22312;&#29420;&#31435; Web &#24212;&#29992;&#31243;&#24207;&#30340; <code>web.xml</code> &#25991;&#20214;&#20013;&#23450;&#20041;&#30340;&#39046;&#22495;&#20250;&#35206;&#30422;&#34394;&#25311;&#26381;&#21153;&#22120;&#30340;&#39046;&#22495;&#12290;&#26377;&#20851;&#35814;&#32454;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405;<a href="../../../common/en/help/ref-realms.html">&#39046;&#22495;</a>&#12290;</p>
</dd>
<dt><code>securePagesWithPragma</code></dt>
<dd>
<p>&#23558;&#27492;&#23646;&#24615;&#35774;&#32622;&#20026;<code>&#20551;</code>&#65292;&#21487;&#20197;&#30830;&#20445;&#27492;&#34394;&#25311;&#26381;&#21153;&#22120;&#19978;&#30340;&#25152;&#26377; Web &#24212;&#29992;&#31243;&#24207;&#21487;&#22312; Internet Explorer &#20013;&#20351;&#29992; SSL &#27491;&#24120;&#36827;&#34892;&#25991;&#20214;&#19979;&#36733;&#25805;&#20316;&#12290;</p>
<p>&#36890;&#36807;&#20351;&#29992; <code>sun-web.xml</code> &#25991;&#20214;&#20013;&#30340; <code>sun-web-app</code> &#20803;&#32032;&#65292;&#21508;&#20010; Web &#24212;&#29992;&#31243;&#24207;&#22343;&#21487;&#20197;&#35206;&#30422;&#35813;&#35774;&#32622;&#12290;&#26377;&#20851;&#35814;&#32454;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>Oracle GlassFish Server Application Deployment Guide</i> &#20013;&#30340; <i>glassfish-web-app</i></a>&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026;<code>&#30495;</code>&#12290;</p>
</dd>
<dt><code>alternatedocroot_</code><i>n</i></dt>
<dd>
<p>&#25351;&#23450;&#22791;&#29992;&#25991;&#26723;&#26681;&#30446;&#24405; (docroot)&#65292;&#20854;&#20013; <i>n</i> &#20026;&#20801;&#35768;&#25351;&#23450;&#22810;&#20010;&#26681;&#30446;&#24405;&#30340;&#27491;&#25972;&#25968;&#12290;&#36890;&#36807;&#22791;&#29992;&#25991;&#26723;&#26681;&#30446;&#24405;&#65292;Web &#24212;&#29992;&#31243;&#24207;&#21487;&#26681;&#25454;&#35831;&#27714;&#26159;&#21542;&#19982;&#19968;&#20010; (&#25110;&#22810;&#20010;) Web &#24212;&#29992;&#31243;&#24207;&#22791;&#29992;&#25991;&#26723;&#26681;&#30446;&#24405;&#30340; URI &#27169;&#24335;&#30456;&#21305;&#37197;&#65292;&#26469;&#20026;&#33258;&#36523;&#25991;&#26723;&#26681;&#30446;&#24405;&#20043;&#22806;&#30340;&#26576;&#20123;&#36164;&#28304;&#30340;&#35831;&#27714;&#25552;&#20379;&#26381;&#21153;&#12290;</p>
<p>&#22914;&#26524;&#35831;&#27714;&#19982;&#19968;&#20010;&#22791;&#29992;&#25991;&#26723;&#26681;&#30446;&#24405;&#30340; URI &#27169;&#24335;&#21305;&#37197;&#65292;&#21017;&#31995;&#32479;&#20250;&#36890;&#36807;&#23558;&#35831;&#27714; URI (&#21435;&#25481; Web &#24212;&#29992;&#31243;&#24207;&#30340;&#19978;&#19979;&#25991;&#26681;&#30446;&#24405;) &#38468;&#21152;&#21040;&#22791;&#29992;&#25991;&#26723;&#26681;&#30446;&#24405;&#30340;&#29289;&#29702;&#20301;&#32622; (&#30446;&#24405;) &#26469;&#23558;&#35831;&#27714;&#26144;&#23556;&#21040;&#22791;&#29992;&#25991;&#26723;&#26681;&#30446;&#24405;&#12290;&#22914;&#26524;&#35831;&#27714;&#19982;&#22810;&#20010; URI &#27169;&#24335;&#21305;&#37197;&#65292;&#21017;&#25353;&#29031;&#20197;&#19979;&#20248;&#20808;&#39034;&#24207;&#26469;&#30830;&#23450;&#22791;&#29992;&#25991;&#26723;&#26681;&#30446;&#24405;&#65306;</p>
<ul>
<li>
<p>&#23436;&#20840;&#21305;&#37197;</p>
</li>
<li>
<p>&#26368;&#38271;&#36335;&#24452;&#21305;&#37197;</p>
</li>
<li>
<p>&#25193;&#23637;&#21517;&#21305;&#37197;</p>
</li>
</ul>
<p>&#20363;&#22914;&#65292;&#20197;&#19979;&#23646;&#24615;&#25351;&#23450;&#20102;&#19977;&#20010;&#22791;&#29992;&#25991;&#26723;&#26681;&#30446;&#24405;&#12290;&#31532;&#19968;&#20010;&#22791;&#29992;&#25991;&#26723;&#26681;&#30446;&#24405;&#30340; URI &#27169;&#24335;&#20351;&#29992;&#23436;&#20840;&#21305;&#37197;&#65292;&#32780;&#31532;&#20108;&#21644;&#31532;&#19977;&#20010;&#22791;&#29992;&#25991;&#26723;&#26681;&#30446;&#24405;&#30340; URI &#27169;&#24335;&#21017;&#20998;&#21035;&#20351;&#29992;&#25193;&#23637;&#21517;&#21305;&#37197;&#21644;&#26368;&#38271;&#36335;&#24452;&#21069;&#32512;&#21305;&#37197;&#12290;</p>
<pre>
&lt;property name="alternatedocroot_1" 
   value="from=/my.jpg dir=/srv/images/jpg"
&lt;property name="alternatedocroot_2" 
   value="from=*.jpg dir=/srv/images/jpg"
&lt;property name="alternatedocroot_3" 
   value="from=/jpg/* dir=/src/images"
</pre>
<p>&#27599;&#20010;&#22791;&#29992;&#25991;&#26723;&#26681;&#30446;&#24405;&#30340; <code>value</code> &#22343;&#26377;&#20004;&#20010;&#32452;&#20214;&#65306;&#31532;&#19968;&#20010;&#32452;&#20214; <code>from</code> &#25351;&#23450;&#22791;&#29992;&#25991;&#26723;&#26681;&#30446;&#24405;&#30340; URI &#27169;&#24335;&#65292;&#32780;&#31532;&#20108;&#20010;&#32452;&#20214; <code>dir</code> &#21017;&#25351;&#23450;&#22791;&#29992;&#25991;&#26723;&#26681;&#30446;&#24405;&#30340;&#29289;&#29702;&#20301;&#32622; (&#30446;&#24405;)&#12290;<code>dir</code> &#32452;&#20214;&#20013;&#20801;&#35768;&#20351;&#29992;&#31354;&#26684;&#12290;</p>
<p>&#36890;&#36807;&#20351;&#29992; <code>sun-web.xml</code> &#25991;&#20214;&#20013;&#30340; <code>sun-web-app</code> &#20803;&#32032;&#65292;&#21508;&#20010; Web &#24212;&#29992;&#31243;&#24207;&#22343;&#21487;&#20197;&#35206;&#30422;&#35813;&#35774;&#32622;&#12290;&#26377;&#20851;&#35814;&#32454;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>Oracle GlassFish Server Application Deployment Guide</i> &#20013;&#30340; <i>glassfish-web-app</i></a>&#12290;</p>
</dd>
<dt><code>contextXmlDefault</code></dt>
<dd>
<p>&#25351;&#23450;&#27492;&#34394;&#25311;&#26381;&#21153;&#22120;&#30340; <code>context.xml</code> &#25991;&#20214; (&#22914;&#26524;&#20351;&#29992;&#30340;&#35805;) &#30456;&#23545;&#20110; domain-dir &#30340;&#20301;&#32622;&#12290;&#26377;&#20851; <code>context.xml</code> &#25991;&#20214;&#30340;&#35814;&#32454;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405;&#19978;&#19979;&#25991;&#23481;&#22120; (<code><a href="http://tomcat.apache.org/tomcat-5.5-doc/config/context.html">http://tomcat.apache.org/tomcat-5.5-doc/config/context.html</a></code>)&#12290;</p>
</dd>
<dt><code>allowLinking</code></dt>
<dd>
<p>&#22914;&#26524;&#35774;&#32622;&#20026;<code>&#30495;</code>&#65292;&#23558;&#20026;&#37096;&#32626;&#21040;&#35813;&#34394;&#25311;&#26381;&#21153;&#22120;&#19978;&#30340;&#25152;&#26377; Web &#24212;&#29992;&#31243;&#24207;&#25552;&#20379;&#31526;&#21495;&#38142;&#25509;&#36164;&#28304;&#12290;&#36890;&#36807;&#20351;&#29992; <code>sun-web.xml</code> &#25991;&#20214;&#20013;&#30340; <code>sun-web-app</code> &#23646;&#24615; <code>allowLinking</code>&#65292;&#21508;&#20010; Web &#24212;&#29992;&#31243;&#24207;&#22343;&#21487;&#20197;&#35206;&#30422;&#35813;&#35774;&#32622;&#65306;</p>
<pre>
&lt;sun-web-app&gt;
   &lt;property name="allowLinking" 
      value="{true|false}"
&lt;/sun-web-app&gt;
</pre>
<p>&#26377;&#20851;&#35814;&#32454;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>Oracle GlassFish Server Application Deployment Guide</i> &#20013;&#30340; <i>glassfish-web-app</i></a>&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026;<code>&#20551;</code>&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
&#22312; Windows &#31995;&#32479;&#19978;&#23558;&#27492;&#23646;&#24615;&#35774;&#32622;&#20026;&#30495;&#21487;&#20197;&#20844;&#24320; JSP &#28304;&#20195;&#30721;&#12290;
<hr>

</dd>
<dt><code>send-error_</code><i>n</i></dt>
<dd>
<p>&#25351;&#23450;&#34394;&#25311;&#26381;&#21153;&#22120;&#30340;&#23450;&#21046;&#38169;&#35823;&#39029;&#26144;&#23556;&#65292;&#36825;&#20123;&#26144;&#23556;&#23558;&#30001;&#34394;&#25311;&#26381;&#21153;&#22120;&#19978;&#37096;&#32626;&#30340;&#25152;&#26377; Web &#24212;&#29992;&#31243;&#24207;&#32487;&#25215;&#12290;Web &#24212;&#29992;&#31243;&#24207;&#21487;&#22312;&#20854; <code>web.xml</code> &#37096;&#32626;&#25551;&#36848;&#31526;&#20013;&#35206;&#30422;&#36825;&#20123;&#23450;&#21046;&#38169;&#35823;&#39029;&#26144;&#23556;&#12290;&#27599;&#20010; <code>send-error_</code><i>n</i> &#23646;&#24615;&#30340;&#20540;&#22343;&#26377;&#19977;&#20010;&#32452;&#20214;&#65292;&#36825;&#20123;&#32452;&#20214;&#21487;&#25353;&#20219;&#24847;&#39034;&#24207;&#25351;&#23450;&#65306;</p>
<ul>
<li>
<p>&#31532;&#19968;&#20010;&#32452;&#20214; <code>code</code> &#25351;&#23450;&#21709;&#24212;&#20013;&#24212;&#36820;&#22238;&#30340;&#23450;&#21046;&#38169;&#35823;&#39029;&#30340;&#19977;&#20301;&#25968; HTTP &#21709;&#24212;&#29366;&#24577;&#20195;&#30721;&#12290;</p>
</li>
<li>
<p>&#31532;&#20108;&#20010;&#32452;&#20214; <code>path</code> &#25351;&#23450;&#23450;&#21046;&#38169;&#35823;&#39029;&#30340;&#32477;&#23545;&#25110;&#30456;&#23545;&#25991;&#20214;&#31995;&#32479;&#36335;&#24452;&#12290;&#30456;&#23545;&#25991;&#20214;&#31995;&#32479;&#36335;&#24452;&#35299;&#37322;&#20026;&#30456;&#23545;&#20110; domain-dir<code>/config</code> &#30446;&#24405;&#12290;</p>
</li>
<li>
<p>&#31532;&#19977;&#20010;&#32452;&#20214; <code>reason</code> &#26159;&#21487;&#36873;&#30340;&#65292;&#23427;&#25351;&#23450;&#35201;&#36820;&#22238;&#30340;&#21407;&#22240;&#23383;&#31526;&#20018;&#25991;&#26412; (&#20363;&#22914; <code>Unauthorized</code> &#25110; <code>Forbidden</code>)&#12290;</p>
</li>
</ul>
<p>&#20363;&#22914;&#65306;</p>
<pre>
&lt;property name="send-error_1"
   value="code=401 path=/myhost/401.html reason=MY-401-REASON"
</pre>
<p>&#27492;&#31034;&#20363;&#23646;&#24615;&#23450;&#20041;&#23558;&#20250;&#36820;&#22238; <code>/myhost/401.html</code> &#30340;&#20869;&#23481;&#12289;401 &#21709;&#24212;&#21644;&#20197;&#19979;&#21709;&#24212;&#34892;&#65306;</p>
<pre>
HTTP/1.1 401 MY-401-REASON
</pre></dd>
<dt><code>redirect_</code><i>n</i></dt>
<dd>
<p>&#25351;&#23450;&#23558;&#26087; URL &#30340;&#35831;&#27714;&#22788;&#29702;&#25104;&#26032; URL &#30340;&#35831;&#27714;&#12290;&#36825;&#20123;&#23646;&#24615;&#23558;&#30001;&#34394;&#25311;&#26381;&#21153;&#22120;&#19978;&#37096;&#32626;&#30340;&#25152;&#26377; Web &#24212;&#29992;&#31243;&#24207;&#32487;&#25215;&#12290;&#27599;&#20010; <code>redirect_</code><i>n</i> &#23646;&#24615;&#30340;&#20540;&#22343;&#26377;&#20004;&#20010;&#32452;&#20214;&#65292;&#36825;&#20123;&#32452;&#20214;&#21487;&#25353;&#20219;&#24847;&#39034;&#24207;&#25351;&#23450;&#65306;</p>
<ul>
<li>
<p>&#31532;&#19968;&#20010;&#32452;&#20214; <code>from</code> &#25351;&#23450;&#35201;&#21305;&#37197;&#30340;&#35831;&#27714; URI &#21069;&#32512;&#12290;</p>
</li>
<li>
<p>&#31532;&#20108;&#20010;&#32452;&#20214; <code>url-prefix</code> &#25351;&#23450;&#35201;&#36820;&#22238;&#32473;&#23458;&#25143;&#26426;&#30340;&#26032; URL &#21069;&#32512;&#12290;&#27492; URL &#21069;&#32512;&#23558;&#26367;&#25442; <code>from</code> &#21069;&#32512;&#12290;</p>
</li>
</ul>
<p>&#20363;&#22914;&#65306;</p>
<pre>
&lt;property name="redirect_1" 
  value="from=/dummy url-prefix=http://etude"
</pre></dd>
<dt><code>valve_</code><i>n</i></dt>
<dd>
<p>&#25351;&#23450;&#23450;&#21046;&#35843;&#33410;&#22120;&#30340;&#20840;&#38480;&#23450;&#31867;&#21517;&#65292;&#20854;&#20013; <i>n</i> &#20026;&#27491;&#25972;&#25968;&#65292;&#20801;&#35768;&#25351;&#23450;&#22810;&#20010;&#20840;&#38480;&#23450;&#31867;&#21517;&#12290;valve &#31867;&#24517;&#39035;&#20174; Tomcat &#25110;&#26089;&#26399;&#21457;&#34892;&#29256;&#30340; GlassFish Server &#23454;&#29616; <code>org.apache.catalina.Valve</code> &#25509;&#21475;&#65292;&#25110;&#20174;&#24403;&#21069; GlassFish Server &#21457;&#34892;&#29256;&#23454;&#29616; <code>org.glassfish.web.valve.GlassFishValve</code> &#25509;&#21475;&#12290;&#20363;&#22914;&#65306;</p>
<pre>
&lt;property name="valve_1"
value="org.glassfish.extension.Valve"
</pre>
<p>&#21487;&#20197;&#20026;&#29305;&#23450; Web &#24212;&#29992;&#31243;&#24207;&#35774;&#32622;&#27492;&#23646;&#24615;&#12290;&#26377;&#20851;&#35814;&#32454;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>Oracle GlassFish Server Application Deployment Guide</i> &#20013;&#30340; <i>glassfish-web-app</i></a>&#12290;</p>
</dd>
<dt><code>listener_</code><i>n</i></dt>
<dd>
<p>&#25351;&#23450;&#23450;&#21046; Catalina &#30417;&#21548;&#31243;&#24207;&#30340;&#20840;&#38480;&#23450;&#31867;&#21517;&#65292;&#20854;&#20013; <i>n</i> &#20026;&#27491;&#25972;&#25968;&#65292;&#20801;&#35768;&#25351;&#23450;&#22810;&#20010;&#20840;&#38480;&#23450;&#31867;&#21517;&#12290;listener &#31867;&#24517;&#39035;&#23454;&#29616; <code>org.apache.catalina.ContainerListener</code> &#25110; <code>org.apache.catalina.LifecycleListener</code> &#25509;&#21475;&#12290;&#20363;&#22914;&#65306;</p>
<pre>
&lt;property name="listener_1"
value="org.glassfish.extension.MyLifecycleListener"
</pre>
<p>&#21487;&#20197;&#20026;&#29305;&#23450; Web &#24212;&#29992;&#31243;&#24207;&#35774;&#32622;&#27492;&#23646;&#24615;&#12290;&#26377;&#20851;&#35814;&#32454;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>Oracle GlassFish Server Application Deployment Guide</i> &#20013;&#30340; <i>glassfish-web-app</i></a>&#12290;</p>
</dd>
<dt><code>errorReportValve</code></dt>
<dd>
<p>&#25351;&#23450;&#23450;&#21046;&#35843;&#33410;&#22120;&#30340;&#20840;&#38480;&#23450;&#31867;&#21517;&#65292;&#35813;&#35843;&#33410;&#22120;&#22312;&#27492;&#34394;&#25311;&#26381;&#21153;&#22120;&#19978;&#29983;&#25104;&#24212;&#29992;&#31243;&#24207;&#30340;&#40664;&#35748;&#38169;&#35823;&#39029;&#12290;&#25351;&#23450;&#31354;&#23383;&#31526;&#20018;&#21487;&#20197;&#31105;&#29992;&#27492;&#34394;&#25311;&#26381;&#21153;&#22120;&#30340;&#40664;&#35748;&#38169;&#35823;&#39029;&#26426;&#21046;&#12290;</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
