<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-accesslog" name="task-accesslog"></a></p>

<h4><a id="sthref21" name="sthref21"></a><a id="sthref22" name="sthref22"></a>&#37197;&#32622; HTTP &#26381;&#21153;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#23548;&#33322;&#26641;&#20013;&#65292;&#23637;&#24320;&ldquo;&#37197;&#32622;&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#36873;&#25321;&#24744;&#35201;&#26356;&#25913;&#30340;&#37197;&#32622;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#37197;&#32622;&rdquo;&#33410;&#28857;&#19979;&#65292;&#36873;&#25321;&ldquo;HTTP &#26381;&#21153;&rdquo;&#33410;&#28857;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;HTTP &#26381;&#21153;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#21551;&#29992; SSO&rdquo;&#22797;&#36873;&#26694;&#65292;&#21487;&#20197;&#22312;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#20026;&#27492;&#26381;&#21153;&#22120;&#19978;&#38024;&#23545;&#21516;&#19968;&#39046;&#22495;&#37197;&#32622;&#30340;&#25152;&#26377;&#34394;&#25311;&#26381;&#21153;&#22120;&#19978;&#30340;&#25152;&#26377; Web &#24212;&#29992;&#31243;&#24207;&#21551;&#29992;&#21333;&#28857;&#30331;&#24405;&#12290;</p>
<p>&#24744;&#21487;&#20197;&#35206;&#30422;&#21333;&#21488;&#34394;&#25311;&#26381;&#21153;&#22120;&#30340;&#27492;&#39033;&#35774;&#32622;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#21551;&#29992;&#35775;&#38382;&#26085;&#24535;&#35760;&#24405;&rdquo;&#22797;&#36873;&#26694;&#65292;&#20197;&#23545;&#25152;&#26377;&#26410;&#25351;&#23450;&#27492;&#23646;&#24615;&#30340;&#34394;&#25311;&#26381;&#21153;&#22120;&#23376;&#20803;&#32032;&#21551;&#29992;&#35775;&#38382;&#26085;&#24535;&#35760;&#24405;&#12290;</p>
<p>&#22914;&#26524;&#21462;&#28040;&#36873;&#25321;&ldquo;&#21551;&#29992;&#35775;&#38382;&#26085;&#24535;&#35760;&#24405;&rdquo;&#22797;&#36873;&#26694;&#65292;&#21017;&#23545;&#25152;&#26377;&#26410;&#25351;&#23450;&#27492;&#23646;&#24615;&#30340;&#34394;&#25311;&#26381;&#21153;&#22120;&#23376;&#20803;&#32032;&#31105;&#29992;&#35775;&#38382;&#26085;&#24535;&#35760;&#24405;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#21551;&#29992;&#28378;&#21160;&rdquo;&#22797;&#36873;&#26694;&#65292;&#20197;&#21551;&#29992;&#26085;&#24535;&#25991;&#20214;&#28378;&#21160;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#21551;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#20174;&ldquo;&#28378;&#21160;&#31574;&#30053;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&#19968;&#31181;&#28378;&#21160;&#31574;&#30053;&#12290;</p>
<p>&#21807;&#19968;&#21487;&#29992;&#30340;&#28378;&#21160;&#31574;&#30053;&#26159; <code>time</code>&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#28378;&#21160;&#38388;&#38548;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#35775;&#38382;&#26085;&#24535;&#30340;&#28378;&#21160;&#38388;&#38548;&#30340;&#20998;&#38047;&#25968;&#12290;</p>
<p>&#20165;&#24403;&#28378;&#21160;&#31574;&#30053;&#20026; <code>time</code> &#26102;&#65292;&#27492;&#23383;&#27573;&#25165;&#26377;&#25928;&#12290;&#40664;&#35748;&#20540;&#20026; 1,440 &#20998;&#38047; (24 &#23567;&#26102;)&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#28378;&#21160;&#21518;&#32512;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#35201;&#22312;&#28378;&#21160;&#21518;&#28155;&#21152;&#21040;&#26085;&#24535;&#25991;&#20214;&#21517;&#26411;&#23614;&#30340;&#23383;&#31526;&#20018;&#20540;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; <code>yyyy-MM-dd</code>&#12290;</p>
<p>&#30830;&#20445;&#28378;&#21160;&#21518;&#32512;&#21253;&#21547;&#36275;&#22815;&#30340;&#20540;&#26469;&#20026;&#27599;&#20010;&#26085;&#24535;&#28378;&#21160;&#21019;&#24314;&#19968;&#20010;&#21807;&#19968;&#30340;&#21518;&#32512;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#35775;&#38382;&#26085;&#24535;&#27599;&#22825;&#28378;&#21160;&#22810;&#27425;&#65292;&#35831;&#22312;&#28378;&#21160;&#21518;&#32512;&#20013;&#21253;&#25324;&#28378;&#21160;&#30340;&#26102;&#21051;&#12290;</p>
<p>&#38656;&#35201;&#19968;&#20010;&#21807;&#19968;&#30340;&#21518;&#32512;&#30830;&#20445;&#35775;&#38382;&#26085;&#24535;&#25991;&#20214;&#22312;&#27599;&#32463;&#36807;&#19968;&#20010;&#28378;&#21160;&#38388;&#38548;&#21518;&#37117;&#36827;&#34892;&#28378;&#21160;&#12290;&#22914;&#26524;&#26032;&#35775;&#38382;&#26085;&#24535;&#25991;&#20214;&#30340;&#28378;&#21160;&#21518;&#32512;&#19982;&#29616;&#26377;&#35775;&#38382;&#26085;&#24535;&#25991;&#20214;&#30340;&#28378;&#21160;&#21518;&#32512;&#30456;&#21516;&#65292;&#21017;&#26032;&#25991;&#20214;&#23558;&#19981;&#28378;&#21160;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26368;&#22823;&#25991;&#20214;&#25968;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#35201;&#20445;&#30041;&#30340;&#28378;&#21160;&#35775;&#38382;&#26085;&#24535;&#25991;&#20214;&#30340;&#26368;&#22823;&#25968;&#37327;&#12290;</p>
<p>&#36127;&#20540;&#34920;&#31034;&#25991;&#20214;&#25968;&#19981;&#21463;&#38480;&#21046;&#12290;&#40664;&#35748;&#20540;&#20026; -1&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#32531;&#20914;&#21306;&#22823;&#23567;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#35775;&#38382;&#26085;&#24535;&#32531;&#20914;&#21306;&#30340;&#22823;&#23567; (&#23383;&#33410;)&#12290;</p>
<p>&#22914;&#26524;&#20540;&#23567;&#20110;&#25110;&#31561;&#20110; 0&#65292;&#21017;&#23558;&#31105;&#29992;&#35775;&#38382;&#26085;&#24535;&#32531;&#20914;&#12290;&#40664;&#35748;&#20540;&#20026; 32768&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#20889;&#20837;&#38388;&#38548;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#22312;&#23558;&#26085;&#24535;&#20889;&#20837;&#30913;&#30424;&#20043;&#21069;&#32463;&#36807;&#30340;&#31186;&#25968;&#12290;</p>
<p>&#32531;&#20914;&#21306;&#24050;&#28385;&#25110;&#36229;&#36807;&#26102;&#38388;&#38388;&#38548;&#26102;&#20889;&#20837;&#35775;&#38382;&#26085;&#24535;&#12290;&#22914;&#26524;&#35813;&#20540;&#23567;&#20110;&#25110;&#31561;&#20110; 0&#65292;&#21017;&#31995;&#32479;&#22987;&#32456;&#20250;&#23558;&#25968;&#25454;&#20889;&#20837;&#32531;&#20914;&#21306;&#65292;&#21363;&#20351;&#32531;&#20914;&#21306;&#26410;&#28385;&#20063;&#26159;&#22914;&#27492;&#12290;&#36825;&#24847;&#21619;&#30528;&#27599;&#27425;&#35775;&#38382;&#26381;&#21153;&#22120;&#26102;&#37117;&#23558;&#26085;&#24535;&#28040;&#24687;&#30452;&#25509;&#23384;&#20648;&#21040;&#35813;&#25991;&#20214;&#20013;&#12290;&#40664;&#35748;&#20540;&#20026; 300&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26684;&#24335;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#29992;&#20110;&#25351;&#23450;&#35775;&#38382;&#26085;&#24535;&#30340;&#20197;&#19979;&#23646;&#24615;&#30340;&#23383;&#31526;&#20018;&#20540;&#65306;</p>
<ul>
<li>
<p>&#35201;&#22312;&#35775;&#38382;&#26085;&#24535;&#20013;&#25429;&#33719;&#30340;&#20449;&#24687;</p>
</li>
<li>
<p>&#20449;&#24687;&#25429;&#33719;&#30340;&#39034;&#24207;</p>
</li>
</ul>
<p>&#40664;&#35748;&#20540;&#22914;&#19979;&#65306;</p>
<pre>
%client.name% %auth-user-name% %datetime% %request% %status% %response.length%
</pre>
<p>&#20197;&#19979;&#20540;&#21487;&#20197;&#21253;&#21547;&#22312;&#26684;&#24335;&#23383;&#31526;&#20018;&#20013;&#65306;</p>
<dl>
<dt><code>%attribute.</code><i>name</i><code>%</code></dt>
<dd>
<p>&#35760;&#24405;&#20855;&#26377;&#32473;&#23450; <i>name</i> &#30340;&#35831;&#27714;&#23646;&#24615;&#30340;&#20540; (&#36890;&#36807;&#35843;&#29992;&#20854; <code>toString</code> &#26041;&#27861;)</p>
</dd>
<dt><code>%auth-user-name%</code></dt>
<dd>
<p>&#25480;&#26435;&#29992;&#25143;&#30340;&#21517;&#31216;</p>
</dd>
<dt><code>%client.name%</code></dt>
<dd>
<p>&#23458;&#25143;&#26426;&#20027;&#26426;&#21517;</p>
</dd>
<dt><code>%client.dns%</code></dt>
<dd>
<p>&#23458;&#25143;&#26426; DNS</p>
</dd>
<dt><code>%cookie.</code><i>name</i><code>%</code></dt>
<dd>
<p>&#20855;&#26377;&#32473;&#23450; <i>name</i> &#30340;&#35831;&#27714; cookie &#30340;&#20540;</p>
</dd>
<dt><code>%cookie.value%</code></dt>
<dd>
<p>&#22312;&#35831;&#27714;&#20013;&#25214;&#21040;&#30340;&#31532;&#19968;&#20010; cookie &#30340;&#20540;</p>
</dd>
<dt><code>%datetime%</code></dt>
<dd>
<p>&#31995;&#32479;&#26085;&#26399;</p>
</dd>
<dt><code>%request%</code></dt>
<dd>
<p>&#23436;&#25972; HTTP &#35831;&#27714;&#34892;</p>
</dd>
<dt><code>%status%</code></dt>
<dd>
<p>&#29366;&#24577;</p>
</dd>
<dt><code>%response.length%</code></dt>
<dd>
<p>&#21709;&#24212;&#20869;&#23481;&#38271;&#24230;</p>
</dd>
<dt><code>%header.referer%</code></dt>
<dd>
<p>Referer &#26631;&#22836;</p>
</dd>
<dt><code>%header.user-agent%</code></dt>
<dd>
<p>User-Agent &#26631;&#22836;</p>
</dd>
<dt><code>%http-method%</code></dt>
<dd>
<p>HTTP &#26041;&#27861;</p>
</dd>
<dt><code>%http-uri%</code></dt>
<dd>
<p>HTTP URI</p>
</dd>
<dt><code>%query-str%</code></dt>
<dd>
<p>HTTP &#26597;&#35810;&#23383;&#31526;&#20018;</p>
</dd>
<dt><code>%http-version%</code></dt>
<dd>
<p>HTTP &#21327;&#35758;&#29256;&#26412;</p>
</dd>
<dt><code>%header.accept%</code></dt>
<dd>
<p>Accept &#26631;&#22836;</p>
</dd>
<dt><code>%header.date%</code></dt>
<dd>
<p>Date &#26631;&#22836;</p>
</dd>
<dt><code>%header.if-mod-since%</code></dt>
<dd>
<p>If-Modified-Since &#26631;&#22836;</p>
</dd>
<dt><code>%header.auth%</code></dt>
<dd>
<p>Authorization &#26631;&#22836;</p>
</dd>
<dt><code>%header.</code><i>any</i><code>%</code></dt>
<dd>
<p>&#25353;&#29031; RFC 2616 &#23450;&#20041;&#30340;&#20219;&#20309;&#26377;&#25928; HTTP &#26631;&#22836;&#20540; (<code>any</code> &#20063;&#26159;&#26377;&#25928;&#30340;&#26631;&#22836;&#20540;&#65307;&#27492;&#22788;&#23558;&#20854;&#25351;&#23450;&#20026;&#21464;&#37327;)</p>
</dd>
<dt><code>%session.</code><i>name</i><code>%</code></dt>
<dd>
<p>&#20855;&#26377;&#21517;&#31216; <i>name</i> &#30340;&#20250;&#35805;&#23646;&#24615;&#30340;&#20540;&#65307;&#22914;&#26524;&#20250;&#35805;&#20013;&#19981;&#23384;&#22312;&#21629;&#21517;&#23646;&#24615;&#65292;&#21017;&#20026; <code>NULL-SESSION-ATTRIBUTE-</code>name&#65307;&#22914;&#26524;&#27809;&#26377;&#20250;&#35805;&#23384;&#22312;&#65292;&#21017;&#20026; <code>NULL-SESSION</code></p>
</dd>
<dt><code>%time-taken%</code></dt>
<dd>
<p>&#22788;&#29702;&#27599;&#20010;&#35831;&#27714;&#25152;&#29992;&#30340;&#26102;&#38388; (&#27627;&#31186;)</p>
</dd>
<dt><code>%vs.id%</code></dt>
<dd>
<p>&#34394;&#25311;&#26381;&#21153;&#22120; ID</p>
</dd>
</dl>
</li>
<li>
<p>&#22312;&ldquo;&#20854;&#20182;&#23646;&#24615;&rdquo;&#37096;&#20998;&#20013;&#65292;&#25351;&#23450;&#20854;&#20182;&#23646;&#24615;&#12290;</p>
<p>&#26377;&#20851;&#21487;&#29992;&#23646;&#24615;&#30340;&#35828;&#26126;&#65292;&#35831;&#21442;&#38405;<a href="ref-httpserviceprops.html">&#29305;&#23450;&#20110; HTTP &#26381;&#21153;&#30340;&#23646;&#24615;</a>&#12290;</p>
<ul>
<li>
<p>&#35201;&#28155;&#21152;&#23646;&#24615;&#65292;&#35831;&#21333;&#20987;&ldquo;&#28155;&#21152;&#23646;&#24615;&rdquo;&#25353;&#38062;&#12290;&#22312;&#26174;&#31034;&#30340;&#31354;&#30333;&#34892;&#20013;&#65292;&#22312;&ldquo;&#21517;&#31216;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#23646;&#24615;&#21517;&#31216;&#65292;&#22312;&ldquo;&#20540;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#23646;&#24615;&#20540;&#12290;</p>
</li>
<li>
<p>&#35201;&#20462;&#25913;&#23646;&#24615;&#65292;&#35831;&#32534;&#36753;&#35813;&#23646;&#24615;&#30340;&ldquo;&#20540;&rdquo;&#23383;&#27573;&#12290;</p>
</li>
<li>
<p>&#35201;&#21024;&#38500;&#23646;&#24615;&#65292;&#35831;&#36873;&#20013;&#20301;&#20110;&#24744;&#35201;&#21024;&#38500;&#23646;&#24615;&#30340;&ldquo;&#21517;&#31216;&rdquo;&#23383;&#27573;&#24038;&#36793;&#30340;&#22797;&#36873;&#26694;&#65292;&#28982;&#21518;&#21333;&#20987;&ldquo;&#21024;&#38500;&#23646;&#24615;&rdquo;&#25353;&#38062;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#21333;&#20987;&ldquo;&#20445;&#23384;&rdquo;&#12290;</p>

<hr>
<p><b>&#25552;&#31034;:</b></p>
&#35201;&#36820;&#22238;&#21040;&#40664;&#35748;&#35774;&#32622;&#65292;&#35831;&#21333;&#20987;&ldquo;&#21152;&#36733;&#40664;&#35748;&#20540;&rdquo;&#25353;&#38062;&#65292;&#28982;&#21518;&#21333;&#20987;&ldquo;&#20445;&#23384;&rdquo;&#12290;<br />
<hr>

</li>
</ol>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
