<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-protocolfilecacheedit" name="task-protocolfilecacheedit"></a></p>

<h4><a id="sthref61" name="sthref61"></a><a id="sthref62" name="sthref62"></a>&#32534;&#36753;&#21327;&#35758;&#30340;&#25991;&#20214;&#39640;&#36895;&#32531;&#23384;&#35774;&#32622;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#23548;&#33322;&#26641;&#20013;&#65292;&#23637;&#24320;&ldquo;&#37197;&#32622;&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#37197;&#32622;&rdquo;&#33410;&#28857;&#19979;&#65292;&#23637;&#24320;&ldquo;&#32593;&#32476;&#37197;&#32622;&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#32593;&#32476;&#37197;&#32622;&rdquo;&#33410;&#28857;&#19979;&#65292;&#36873;&#25321;&ldquo;&#21327;&#35758;&rdquo;&#33410;&#28857;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#21327;&#35758;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#21327;&#35758;&rdquo;&#39029;&#19978;&#65292;&#21333;&#20987;&#35201;&#32534;&#36753;&#30340;&#21327;&#35758;&#30340;&#21517;&#31216;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#32534;&#36753;&#21327;&#35758;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#32534;&#36753;&#21327;&#35758;&rdquo;&#39029;&#19978;&#65292;&#21333;&#20987;&ldquo;&#25991;&#20214;&#39640;&#36895;&#32531;&#23384;&rdquo;&#36873;&#39033;&#21345;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#25991;&#20214;&#39640;&#36895;&#32531;&#23384;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#36873;&#25321;&ldquo;&#21551;&#29992;&#29366;&#24577;&rdquo;&#22797;&#36873;&#26694;&#20197;&#21551;&#29992;&#25991;&#20214;&#39640;&#36895;&#32531;&#23384;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#27492;&#36873;&#39033;&#24050;&#36873;&#20013;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26368;&#38271;&#23384;&#27963;&#26102;&#38388;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#26377;&#25928;&#39640;&#36895;&#32531;&#23384;&#26465;&#30446;&#30340;&#26368;&#38271;&#23384;&#27963;&#26102;&#38388; (&#31186;)&#12290;</p>
<p>&#35813;&#21442;&#25968;&#29992;&#20110;&#25511;&#21046;&#25991;&#20214;&#32463;&#36807;&#39640;&#36895;&#32531;&#23384;&#20043;&#21518;&#65292;&#20351;&#29992;&#39640;&#36895;&#32531;&#23384;&#20449;&#24687;&#30340;&#26102;&#38388;&#12290;&#26102;&#38388;&#38271;&#20110;&#26368;&#38271;&#23384;&#27963;&#26102;&#38388;&#30340;&#26465;&#30446;&#23558;&#29992;&#21516;&#19968;&#25991;&#20214;&#30340;&#26032;&#26465;&#30446;&#26367;&#20195;&#12290;&#22914;&#26524;&#24744;&#30340;&#20869;&#23481;&#24456;&#23569;&#21457;&#29983;&#26356;&#25913;&#65292;&#35831;&#22686;&#22823;&#35813;&#20540;&#20197;&#25913;&#21892;&#24615;&#33021;&#12290;</p>
<p>&#26368;&#20248;&#30340;&#26368;&#38271;&#23384;&#27963;&#26102;&#38388;&#21462;&#20915;&#20110;&#29616;&#26377;&#25991;&#20214;&#26159;&#21542;&#34987;&#39057;&#32321;&#20462;&#25913;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#20197;&#22266;&#23450;&#30340;&#26102;&#38388;&#38388;&#38548;&#19968;&#22825;&#20462;&#25913;&#25991;&#20214;&#22235;&#27425;&#65292;&#21017;&#21487;&#20197;&#32771;&#34385;&#23558;&#26368;&#38271;&#23384;&#27963;&#26102;&#38388;&#35774;&#32622;&#20026; 21600 &#31186; (6 &#23567;&#26102;)&#12290;&#21542;&#21017;&#65292;&#21487;&#20197;&#32771;&#34385;&#23558;&#26368;&#38271;&#23384;&#27963;&#26102;&#38388;&#35774;&#32622;&#20026;&#24744;&#24076;&#26395;&#22312;&#19978;&#19968;&#29256;&#26412;&#30340;&#25991;&#20214;&#20462;&#25913;&#21518;&#65292;&#22788;&#29702;&#35813;&#25991;&#20214;&#30340;&#26368;&#38271;&#26102;&#38388;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 30&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26368;&#22823;&#39640;&#36895;&#32531;&#23384;&#22823;&#23567;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#30913;&#30424;&#19978;&#25991;&#20214;&#39640;&#36895;&#32531;&#23384;&#30340;&#26368;&#22823;&#24635;&#22823;&#23567; (&#23383;&#33410;)&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 10485760&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26368;&#22823;&#25991;&#20214;&#35745;&#25968;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#25991;&#20214;&#39640;&#36895;&#32531;&#23384;&#20013;&#21487;&#20197;&#23384;&#20648;&#30340;&#25991;&#20214;&#30340;&#26368;&#22823;&#25968;&#37327;&#12290;</p>
<p>&#22914;&#26524;&#35813;&#20540;&#36807;&#22823;&#65292;&#26381;&#21153;&#22120;&#23558;&#39640;&#36895;&#32531;&#23384;&#36739;&#23569;&#20351;&#29992;&#30340;&#25991;&#20214;&#65292;&#36825;&#26679;&#20250;&#28010;&#36153;&#20869;&#23384;&#12290;&#22914;&#26524;&#35813;&#20540;&#36807;&#23567;&#65292;&#23558;&#26080;&#27861;&#20307;&#29616;&#39640;&#36895;&#32531;&#23384;&#30340;&#20248;&#28857;&#12290;&#23581;&#35797;&#20026;&#35813;&#23646;&#24615;&#35774;&#32622;&#19981;&#21516;&#30340;&#20540;&#65292;&#20197;&#23547;&#25214;&#36866;&#21512;&#29305;&#23450;&#24212;&#29992;&#31243;&#24207;&#30340;&#26368;&#20339;&#35299;&#20915;&#26041;&#26696;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 1024&#12290;</p>
</li>
<li>
<p>&#21333;&#20987;&ldquo;&#20445;&#23384;&rdquo;&#12290;</p>

<hr>
<p><b>&#25552;&#31034;:</b></p>
&#35201;&#36820;&#22238;&#21040;&#40664;&#35748;&#35774;&#32622;&#65292;&#35831;&#21333;&#20987;&ldquo;&#21152;&#36733;&#40664;&#35748;&#20540;&rdquo;&#25353;&#38062;&#65292;&#28982;&#21518;&#21333;&#20987;&ldquo;&#20445;&#23384;&rdquo;&#12290;<br />
<hr>

</li>
</ol>
<a id="sthref63" name="sthref63"></a>
<h5>&#21478;&#35831;&#21442;&#38405;</h5>
<ul>
<li>
<p><a href="task-networklistenernew.html">&#21019;&#24314;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-networklisteneredit.html">&#32534;&#36753;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-networklistenerdelete.html">&#21024;&#38500;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-protocolnew.html">&#21019;&#24314;&#21327;&#35758;</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">&#32534;&#36753;&#21327;&#35758;</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">&#32534;&#36753;&#21327;&#35758;&#30340; SSL &#35774;&#32622;</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">&#32534;&#36753;&#21327;&#35758;&#30340; HTTP &#35774;&#32622;</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">&#21024;&#38500;&#21327;&#35758;</a></p>
</li>
<li>
<p><a href="task-transportnew.html">&#21019;&#24314;&#20256;&#36755;</a></p>
</li>
<li>
<p><a href="task-transportedit.html">&#32534;&#36753;&#20256;&#36755;</a></p>
</li>
<li>
<p><a href="task-transportdelete.html">&#21024;&#38500;&#20256;&#36755;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
