<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-webcontaineravailability" name="task-webcontaineravailability"></a></p>

<h4><a id="sthref16" name="sthref16"></a><a id="sthref17" name="sthref17"></a><a id="sthref18" name="sthref18"></a><a id="sthref19" name="sthref19"></a>&#37197;&#32622; Web &#23481;&#22120;&#30340;&#21487;&#29992;&#24615;&#35774;&#32622;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#23548;&#33322;&#26641;&#20013;&#65292;&#23637;&#24320;&ldquo;&#37197;&#32622;&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#36873;&#25321;&#24744;&#35201;&#26356;&#25913;&#30340;&#37197;&#32622;&#12290;</p>
</li>
<li>
<p>&#22312;&#37197;&#32622;&#30340;&#33410;&#28857;&#19979;&#65292;&#36873;&#25321;&ldquo;&#21487;&#29992;&#24615;&#26381;&#21153;&rdquo;&#33410;&#28857;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#21487;&#29992;&#24615;&#26381;&#21153;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#21487;&#29992;&#24615;&#26381;&#21153;&rdquo;&#39029;&#19978;&#65292;&#21333;&#20987;&ldquo;Web &#23481;&#22120;&#21487;&#29992;&#24615;&rdquo;&#36873;&#39033;&#21345;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;Web &#23481;&#22120;&#21487;&#29992;&#24615;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#21487;&#29992;&#24615;&#26381;&#21153;&rdquo;&#23383;&#27573;&#20013;&#65292;&#36873;&#20013;&ldquo;&#24050;&#21551;&#29992;&rdquo;&#26694;&#20197;&#21551;&#29992; Web &#23481;&#22120;&#30340;&#21487;&#29992;&#24615;&#12290;</p>
<p>&#35201;&#31105;&#29992;&#21487;&#29992;&#24615;&#65292;&#35831;&#28165;&#38500;&ldquo;&#21487;&#29992;&#24615;&#26381;&#21153;&rdquo;&#30340;&ldquo;&#24050;&#21551;&#29992;&rdquo;&#26694;&#20013;&#30340;&#22797;&#36873;&#26631;&#35760;&#12290;</p>
</li>
<li>
<p>&#20174;&ldquo;&#25345;&#20037;&#31867;&#22411;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&#25345;&#20037;&#24615;&#26426;&#21046;&#12290;</p>
<ul>
<li>
<p>&#22914;&#26524;<i>&#26410;</i>&#36873;&#20013;&ldquo;&#24050;&#21551;&#29992;&#21487;&#29992;&#24615;&#26381;&#21153;&rdquo;&#65292;&#35831;&#36873;&#25321;&#20197;&#19979;&#36873;&#39033;&#20043;&#19968;&#65306;</p>
<ul>
<li>
<p><code>&#20869;&#23384;</code>&#65292;&#19981;&#25552;&#20379;&#20219;&#20309;&#20250;&#35805;&#25345;&#20037;&#24615;</p>
</li>
<li>
<p><code>&#25991;&#20214;</code>&#65292;&#25552;&#20379;&#22522;&#20110;&#38750;&#39640;&#21487;&#29992;&#24615;&#25991;&#20214;&#31995;&#32479;&#30340;&#20250;&#35805;&#25345;&#20037;&#24615;</p>
</li>
</ul>
</li>
<li>
<p>&#22914;&#26524;&#36873;&#20013;&ldquo;&#24050;&#21551;&#29992;&#21487;&#29992;&#24615;&#26381;&#21153;&rdquo;&#65292;&#35831;&#36873;&#25321; <code>replicated</code> &#20197;&#25552;&#20379;&#22522;&#20110;&#39640;&#21487;&#29992;&#24615;&#38598;&#32676;&#25925;&#38556;&#36716;&#31227;&#30340;&#20250;&#35805;&#25345;&#20037;&#24615;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#20174;&ldquo;&#25345;&#20037;&#24615;&#39057;&#29575;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&#23384;&#20648; HTTP &#20250;&#35805;&#30340;&#39057;&#29575;&#65306;</p>
<ul>
<li>
<p><code>web-method</code> &mdash; &#23558;&#21709;&#24212;&#21457;&#36865;&#22238;&#23458;&#25143;&#26426;&#20043;&#21069;&#65292;&#22312;&#27599;&#20010; Web &#35831;&#27714;&#32467;&#26463;&#26102;&#23384;&#20648;&#20250;&#35805;&#29366;&#24577;&#12290;&#27492;&#27169;&#24335;&#20026;&#21457;&#29983;&#25925;&#38556;&#26102;&#23436;&#20840;&#26356;&#26032;&#20250;&#35805;&#29366;&#24577;&#25552;&#20379;&#20102;&#26368;&#22909;&#30340;&#20445;&#35777;&#12290;&#36825;&#26159;&#40664;&#35748;&#36873;&#39033;&#12290;</p>
</li>
</ul>
<p>&#20165;&#24403;&ldquo;&#25345;&#20037;&#31867;&#22411;&rdquo;&#20026; <code>replicated</code> &#26102;&#65292;&ldquo;&#25345;&#20037;&#24615;&#39057;&#29575;&rdquo;&#25165;&#36866;&#29992;&#12290;</p>
</li>
<li>
<p>&#20174;&ldquo;&#25345;&#20037;&#24615;&#33539;&#22260;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&#21457;&#29983;&#23384;&#20648;&#26102;&#25152;&#38656;&#30340; HTTP &#20250;&#35805;&#26356;&#25913;&#30340;&#33539;&#22260;&#65306;</p>
<ul>
<li>
<p><code>&#20250;&#35805;</code> &mdash; &#27599;&#27425;&#37117;&#23384;&#20648;&#25972;&#20010;&#20250;&#35805;&#29366;&#24577;&#12290;&#27492;&#27169;&#24335;&#20026;&#27491;&#30830;&#23384;&#20648;&#20219;&#20309;&#21487;&#20998;&#27966; Web &#24212;&#29992;&#31243;&#24207;&#30340;&#20250;&#35805;&#25968;&#25454;&#25552;&#20379;&#20102;&#26368;&#22909;&#30340;&#20445;&#35777;&#12290;</p>
</li>
<li>
<p><code>modified-session</code> &mdash; &#22914;&#26524;&#20250;&#35805;&#29366;&#24577;&#24050;&#20462;&#25913;&#65292;&#21017;&#23384;&#20648;&#25972;&#20010;&#20250;&#35805;&#29366;&#24577;&#12290;&#22914;&#26524;&#35843;&#29992;&#20102; <code>HttpSession.setAttribute()</code> &#25110; <code>HttpSession.removeAttribute()</code>&#65292;&#21017;&#31995;&#32479;&#23558;&#35748;&#20026;&#20250;&#35805;&#24050;&#34987;&#20462;&#25913;&#12290;&#24744;&#24517;&#39035;&#20445;&#35777;&#27599;&#27425;&#26356;&#25913;&#23646;&#24615;&#26102;&#37117;&#35843;&#29992; <code>setAttribute()</code>&#12290;&#36825;&#19981;&#26159; Java EE &#35268;&#33539;&#30340;&#35201;&#27714;&#65292;&#20294;&#26159;&#27492;&#27169;&#24335;&#38656;&#35201;&#36825;&#26679;&#20570;&#25165;&#33021;&#27491;&#24120;&#24037;&#20316;&#12290;</p>
</li>
<li>
<p><code>modified-attribute</code> &mdash; &#20165;&#23384;&#20648;&#20462;&#25913;&#21518;&#30340;&#20250;&#35805;&#23646;&#24615;&#12290;&#35201;&#20351;&#27492;&#27169;&#24335;&#27491;&#24120;&#24037;&#20316;&#65292;&#24744;&#24517;&#39035;&#36981;&#24490;&#20197;&#19979;&#25351;&#23548;&#21407;&#21017;&#65306;</p>
<ul>
<li>
<p>&#27599;&#27425;&#20462;&#25913;&#20250;&#35805;&#29366;&#24577;&#26102;&#37117;&#35843;&#29992; <code>setAttribute()</code>&#12290;</p>
</li>
<li>
<p>&#30830;&#20445;&#21508;&#23646;&#24615;&#20043;&#38388;&#27809;&#26377;&#20132;&#21449;&#24341;&#29992;&#12290;&#31995;&#32479;&#23558;&#23545;&#27599;&#20010;&#19981;&#21516;&#30340;&#23646;&#24615;&#20851;&#38190;&#23383;&#30340;&#23545;&#35937;&#22270;&#24418;&#21333;&#29420;&#36827;&#34892;&#24207;&#21015;&#21270;&#24182;&#21333;&#29420;&#23384;&#20648;&#12290;&#22914;&#26524;&#27599;&#20010;&#21333;&#29420;&#30340;&#20851;&#38190;&#23383;&#19979;&#30340;&#23545;&#35937;&#20043;&#38388;&#26377;&#23545;&#35937;&#20132;&#21449;&#24341;&#29992;&#65292;&#21017;&#23427;&#20204;&#23558;&#19981;&#20250;&#34987;&#27491;&#30830;&#24207;&#21015;&#21270;&#21644;&#21453;&#24207;&#21015;&#21270;&#12290;</p>
</li>
<li>
<p>&#22312;&#22810;&#20010;&#23646;&#24615;&#20043;&#38388;&#20998;&#24067;&#20250;&#35805;&#29366;&#24577;&#65292;&#25110;&#32773;&#33267;&#23569;&#22312;&#21482;&#35835;&#23646;&#24615;&#21644;&#21487;&#20462;&#25913;&#23646;&#24615;&#20043;&#38388;&#20998;&#24067;&#20250;&#35805;&#29366;&#24577;&#12290;</p>
</li>
</ul>
</li>
</ul>
<p>&#20165;&#24403;&ldquo;&#25345;&#20037;&#31867;&#22411;&rdquo;&#20026; <code>replicated</code> &#26102;&#65292;&ldquo;&#25345;&#20037;&#24615;&#33539;&#22260;&rdquo;&#25165;&#36866;&#29992;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#21333;&#28857;&#30331;&#24405;&#29366;&#24577;&rdquo;&#23383;&#27573;&#20013;&#65292;&#36873;&#20013;&ldquo;&#24050;&#21551;&#29992;&rdquo;&#26694;&#65292;&#20351;&#21333;&#28857;&#30331;&#24405;&#29366;&#24577;&#21487;&#29992;&#20110;&#25925;&#38556;&#36716;&#31227;&#12290;</p>
<p>&#35201;&#20351;&#21333;&#28857;&#30331;&#24405;&#29366;&#24577;&#23545;&#25925;&#38556;&#36716;&#31227;&#19981;&#21487;&#29992;&#65292;&#35831;&#21462;&#28040;&#36873;&#25321;&ldquo;&#24050;&#21551;&#29992;&#21333;&#28857;&#30331;&#24405;&#29366;&#24577;&rdquo;&#22797;&#36873;&#26694;&#12290;</p>
</li>
<li>
<p>&#35201;&#36824;&#21407;&#25152;&#26377;&#35774;&#32622;&#30340;&#40664;&#35748;&#20540;&#65292;&#35831;&#21333;&#20987;&ldquo;&#21152;&#36733;&#40664;&#35748;&#20540;&rdquo;&#25353;&#38062;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#20854;&#20182;&#23646;&#24615;&rdquo;&#37096;&#20998;&#20013;&#65292;&#25351;&#23450;&#20854;&#20182;&#23646;&#24615;&#12290;</p>
<p>GlassFish Server &#19981;&#23450;&#20041;&#20219;&#20309;&#20854;&#20182; Web &#23481;&#22120;&#21487;&#29992;&#24615;&#23646;&#24615;&#12290;</p>
<ul>
<li>
<p>&#35201;&#28155;&#21152;&#23646;&#24615;&#65292;&#35831;&#21333;&#20987;&ldquo;&#28155;&#21152;&#23646;&#24615;&rdquo;&#25353;&#38062;&#12290;&#22312;&#26174;&#31034;&#30340;&#31354;&#30333;&#34892;&#20013;&#65292;&#22312;&ldquo;&#21517;&#31216;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#23646;&#24615;&#21517;&#31216;&#65292;&#22312;&ldquo;&#20540;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#23646;&#24615;&#20540;&#12290;</p>
</li>
<li>
<p>&#35201;&#20462;&#25913;&#23646;&#24615;&#65292;&#35831;&#32534;&#36753;&#35813;&#23646;&#24615;&#30340;&ldquo;&#20540;&rdquo;&#23383;&#27573;&#12290;</p>
</li>
<li>
<p>&#35201;&#21024;&#38500;&#23646;&#24615;&#65292;&#35831;&#36873;&#20013;&#20301;&#20110;&#24744;&#35201;&#21024;&#38500;&#23646;&#24615;&#30340;&ldquo;&#21517;&#31216;&rdquo;&#23383;&#27573;&#24038;&#36793;&#30340;&#22797;&#36873;&#26694;&#65292;&#28982;&#21518;&#21333;&#20987;&ldquo;&#21024;&#38500;&#23646;&#24615;&rdquo;&#25353;&#38062;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#21333;&#20987;&ldquo;&#20445;&#23384;&rdquo;&#12290;</p>
</li>
</ol>
<a id="sthref20" name="sthref20"></a>
<h5>&#21478;&#35831;&#21442;&#38405;</h5>
<ul>
<li>
<p><a href="task-webcontainergeneral.html">&#37197;&#32622; Web &#23481;&#22120;&#30340;&#24120;&#35268;&#23646;&#24615;</a></p>
</li>
<li>
<p><a href="task-webcontainersessiontimeout.html">&#37197;&#32622; Web &#23481;&#22120;&#30340;&#20250;&#35805;&#23646;&#24615;</a></p>
</li>
<li>
<p><a href="task-webcontainermanagerprops.html">&#37197;&#32622; Web &#23481;&#22120;&#30340;&#31649;&#29702;&#22120;&#23646;&#24615;</a></p>
</li>
<li>
<p><a href="task-webcontainerstoreprops.html">&#37197;&#32622; Web &#23481;&#22120;&#30340;&#23384;&#20648;&#23646;&#24615;</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
