<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-virtualservercreate" name="task-virtualservercreate"></a><a id="GHWEB00036" name="GHWEB00036"></a></p>

<h4><a id="sthref34" name="sthref34"></a>&#21019;&#24314;&#34394;&#25311;&#26381;&#21153;&#22120;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#23548;&#33322;&#26641;&#20013;&#65292;&#23637;&#24320;&ldquo;&#37197;&#32622;&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#36873;&#25321;&#24744;&#35201;&#26356;&#25913;&#30340;&#37197;&#32622;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#37197;&#32622;&rdquo;&#33410;&#28857;&#19979;&#65292;&#36873;&#25321;&ldquo;&#34394;&#25311;&#26381;&#21153;&#22120;&rdquo;&#33410;&#28857;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#34394;&#25311;&#26381;&#21153;&#22120;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#34394;&#25311;&#26381;&#21153;&#22120;&rdquo;&#39029;&#19978;&#65292;&#21333;&#20987;&ldquo;&#26032;&#24314;&rdquo;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#26032;&#24314;&#34394;&#25311;&#26381;&#21153;&#22120;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;ID&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#23558;&#22312;&#20869;&#37096;&#26631;&#35782;&#34394;&#25311;&#26381;&#21153;&#22120;&#30340;&#20540;&#12290;</p>
<p>&#27492;&#20540;&#19981;&#20250;&#21521; HTTP &#23458;&#25143;&#26426;&#20844;&#24320;&#12290;&#24517;&#39035;&#22312;&ldquo;&#20027;&#26426;&rdquo;&#23383;&#27573;&#20013;&#25351;&#23450;&#21521; HTTP &#23458;&#25143;&#26426;&#20844;&#24320;&#30340;&#20027;&#26426;&#21517;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#20027;&#26426;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#36816;&#34892;&#26381;&#21153;&#22120;&#30340;&#35745;&#31639;&#26426;&#30340;&#20027;&#26426;&#21517;&#25110; IP &#22320;&#22336;&#12290;</p>
<p>&#35831;&#20351;&#29992;&#24050;&#21521;&#32593;&#32476;&#30340; DNS &#26381;&#21153;&#22120;&#27880;&#20876; (&#32780;&#19988;&#22312; UNIX &#31995;&#32479;&#19978;&#65292;&#20301;&#20110; <code>/etc/hosts</code> &#25991;&#20214;&#20013;) &#30340;&#23454;&#38469;&#20027;&#26426;&#21517;&#25110;&#34394;&#25311;&#20027;&#26426;&#21517;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026;&#31995;&#32479;&#23646;&#24615;&#20540; <code>${com.sun.aas.hostName}</code>&#12290;</p>
</li>
<li>
<p>&#20026;&#26032;&#30340;&#34394;&#25311;&#26381;&#21153;&#22120;&#36873;&#25321;&ldquo;&#29366;&#24577;&rdquo;&#36873;&#39033;&#12290;</p>
<p>&#34394;&#25311;&#26381;&#21153;&#22120;&#21487;&#20197;&#22788;&#20110;&ldquo;&#25171;&#24320;&rdquo;(&#21363;&#27963;&#21160;)&#12289;&ldquo;&#20851;&#38381;&rdquo;&#25110;&ldquo;&#24050;&#31105;&#29992;&rdquo;&#29366;&#24577;&#12290;&#40664;&#35748;&#20540;&#20026;&ldquo;&#25171;&#24320;&rdquo;&#12290;</p>
</li>
<li>
<p>&#20026;&#26032;&#30340;&#34394;&#25311;&#26381;&#21153;&#22120;&#36873;&#25321; SSO &#36873;&#39033;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#34394;&#25311;&#26381;&#21153;&#22120;&#32487;&#25215; HTTP &#26381;&#21153;&#30340;&#21333;&#28857;&#30331;&#24405; (SSO) &#35774;&#32622;&#12290;&#36873;&#25321;&ldquo;&#24050;&#21551;&#29992;&rdquo;&#25110;&ldquo;&#24050;&#31105;&#29992;&rdquo;&#65292;&#20197;&#21551;&#29992;&#25110;&#31105;&#29992;&#27492;&#34394;&#25311;&#26381;&#21153;&#22120;&#30340;&#21333;&#28857;&#30331;&#24405;&#65292;&#20174;&#32780;&#35206;&#30422; HTTP &#26381;&#21153;&#35774;&#32622;&#12290;</p>
<p>Servlet &#21644; JSP &#25991;&#20214;&#25903;&#25345;&#22312; GlassFish Server &#19978;&#36328;&#24212;&#29992;&#31243;&#24207;&#30340;&#21333;&#28857;&#30331;&#24405;&#12290;&#27492;&#21151;&#33021;&#20801;&#35768;&#38656;&#35201;&#21516;&#19968;&#29992;&#25143;&#30331;&#24405;&#20449;&#24687;&#30340;&#22810;&#20010;&#24212;&#29992;&#31243;&#24207;&#20849;&#20139;&#30331;&#24405;&#20449;&#24687;&#65292;&#29992;&#25143;&#19981;&#24517;&#22312;&#20351;&#29992;&#27599;&#20010;&#24212;&#29992;&#31243;&#24207;&#26102;&#37117;&#20998;&#21035;&#36827;&#34892;&#30331;&#24405;&#12290;</p>
</li>
<li>
<p>&#20174;&ldquo;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&#19968;&#20010;&#25110;&#22810;&#20010;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;&#65292;&#25110;&#23558;&#35813;&#23383;&#27573;&#30041;&#31354;&#12290;</p>
</li>
<li>
<p>&#20174;&ldquo;&#40664;&#35748; Web &#27169;&#22359;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&#19968;&#20010;&#27169;&#22359;&#65292;&#27492;&#27169;&#22359;&#23558;&#21709;&#24212;&#25152;&#26377;&#26080;&#27861;&#26144;&#23556;&#21040;&#24050;&#37096;&#32626;&#21040;&#34394;&#25311;&#26381;&#21153;&#22120;&#20013;&#30340;&#20854;&#20182; Web &#27169;&#22359;&#30340;&#35831;&#27714;&#12290;</p>
<p>&#22914;&#26524;&#26410;&#25351;&#23450;&#40664;&#35748; Web &#27169;&#22359;&#65292;&#31995;&#32479;&#23558;&#20351;&#29992;&#20855;&#26377;&#31354;&#19978;&#19979;&#25991;&#26681;&#30446;&#24405;&#30340; Web &#27169;&#22359;&#12290;&#22914;&#26524;&#19981;&#23384;&#22312;&#21253;&#21547;&#31354;&#19978;&#19979;&#25991;&#26681;&#30446;&#24405;&#30340; Web &#27169;&#22359;&#65292;&#31995;&#32479;&#23558;&#21019;&#24314;&#24182;&#20351;&#29992;&#40664;&#35748; Web &#27169;&#22359;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26085;&#24535;&#25991;&#20214;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#26469;&#33258;&#27492;&#34394;&#25311;&#26381;&#21153;&#22120;&#30340;&#26085;&#24535;&#35760;&#24405;&#28040;&#24687;&#25152;&#22312;&#30340;&#25991;&#20214;&#30340;&#36335;&#24452;&#21517;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#26085;&#24535;&#35760;&#24405;&#28040;&#24687;&#23558;&#21457;&#36865;&#33267;&#40664;&#35748;&#26381;&#21153;&#22120;&#26085;&#24535; domain-dir<code>/logs/server.log</code>&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#25991;&#26723;&#26681;&#30446;&#24405;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#26381;&#21153;&#22120;&#30340;&#25991;&#26723;&#26681;&#30446;&#24405;&#30340;&#32477;&#23545;&#36335;&#24452;&#12290;</p>
<p>&#22914;&#26524;&#23558;&#27492;&#23383;&#27573;&#20445;&#30041;&#20026;&#31354;&#65292;&#23558;&#20351;&#29992; domain-dir<code>/docroot</code>&#12290;</p>
</li>
<li>
<p>&#36873;&#25321;&ldquo;&#35775;&#38382;&#26085;&#24535;&#35760;&#24405;&rdquo;&#36873;&#39033;&#65292;&#20197;&#21551;&#29992;&#25110;&#31105;&#29992;&#35775;&#38382;&#26085;&#24535;&#35760;&#24405;&#12290;</p>
<p>&#27492;&#22806;&#65292;&#24744;&#21487;&#20197;&#25351;&#23450;&#26159;&#21542;&#20174; HTTP &#26381;&#21153;&#32487;&#25215;&#35775;&#38382;&#26085;&#24535;&#35760;&#24405;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#20250;&#20174; HTTP &#26381;&#21153;&#32487;&#25215;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#30446;&#24405;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#26381;&#21153;&#22120;&#35775;&#38382;&#26085;&#24535;&#30340;&#32477;&#23545;&#30446;&#24405;&#36335;&#24452;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; domain-dir<code>/logs/access</code>&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#20854;&#20182;&#23646;&#24615;&rdquo;&#37096;&#20998;&#20013;&#65292;&#25351;&#23450;&#34394;&#25311;&#26381;&#21153;&#22120;&#30340;&#20854;&#20182;&#23646;&#24615;&#12290;</p>
<p>&#26377;&#20851;&#21487;&#29992;&#23646;&#24615;&#30340;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405;<a href="ref-virtualserverprops.html">&#29305;&#23450;&#20110;&#34394;&#25311;&#26381;&#21153;&#22120;&#30340;&#23646;&#24615;</a>&#12290;</p>
<p>&#35201;&#28155;&#21152;&#23646;&#24615;&#65292;&#35831;&#21333;&#20987;&ldquo;&#28155;&#21152;&#23646;&#24615;&rdquo;&#25353;&#38062;&#12290;&#22312;&#26174;&#31034;&#30340;&#31354;&#30333;&#34892;&#20013;&#65292;&#22312;&ldquo;&#21517;&#31216;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#23646;&#24615;&#21517;&#31216;&#65292;&#22312;&ldquo;&#20540;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#23646;&#24615;&#20540;&#12290;</p>
</li>
<li>
<p>&#21333;&#20987;&ldquo;&#30830;&#23450;&rdquo;&#12290;</p>
</li>
</ol>
<a id="sthref35" name="sthref35"></a>
<h5>&#21478;&#35831;&#21442;&#38405;</h5>
<ul>
<li>
<p><a href="task-virtualserveredit.html">&#32534;&#36753;&#34394;&#25311;&#26381;&#21153;&#22120;</a></p>
</li>
<li>
<p><a href="task-virtualserverdelete.html">&#21024;&#38500;&#34394;&#25311;&#26381;&#21153;&#22120;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
