<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-webcontainermanagerprops" name="task-webcontainermanagerprops"></a></p>

<h4><a id="sthref7" name="sthref7"></a><a id="sthref8" name="sthref8"></a><a id="sthref9" name="sthref9"></a>&#37197;&#32622; Web &#23481;&#22120;&#30340;&#31649;&#29702;&#22120;&#23646;&#24615;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20250;&#35805;&#31649;&#29702;&#22120;&#25552;&#20379;&#20102;&#29992;&#20110;&#37197;&#32622;&#20250;&#35805;&#30340;&#21019;&#24314;&#21644;&#38144;&#27585;&#26041;&#24335;&#12289;&#23384;&#20648;&#20250;&#35805;&#29366;&#24577;&#30340;&#20301;&#32622;&#20197;&#21450;&#21487;&#29992;&#20250;&#35805;&#30340;&#26368;&#22823;&#25968;&#37327;&#30340;&#26041;&#27861;&#12290;</p>
<ol>
<li>
<p>&#22312;&#23548;&#33322;&#26641;&#20013;&#65292;&#23637;&#24320;&ldquo;&#37197;&#32622;&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#36873;&#25321;&#24744;&#35201;&#26356;&#25913;&#30340;&#37197;&#32622;&#12290;</p>
</li>
<li>
<p>&#22312;&#37197;&#32622;&#30340;&#33410;&#28857;&#19979;&#65292;&#36873;&#25321;&ldquo;Web &#23481;&#22120;&rdquo;&#33410;&#28857;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#24120;&#35268;&#23646;&#24615;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#24120;&#35268;&#23646;&#24615;&rdquo;&#39029;&#19978;&#65292;&#21333;&#20987;&ldquo;&#31649;&#29702;&#22120;&#23646;&#24615;&rdquo;&#36873;&#39033;&#21345;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#31649;&#29702;&#22120;&#23646;&#24615;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#28165;&#38500;&#26102;&#38388;&#38388;&#38548;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#20174;&#23384;&#20648;&#20013;&#21024;&#38500;&#38750;&#27963;&#21160;&#20250;&#35805;&#25968;&#25454;&#20043;&#21069;&#32463;&#36807;&#30340;&#31186;&#25968;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 60&#12290;</p>
<p>&#23558;&#27492;&#20540;&#35774;&#32622;&#20026;&#20302;&#20110;&#20250;&#35805;&#25968;&#25454;&#26356;&#25913;&#39057;&#29575;&#30340;&#20540;&#12290;&#20363;&#22914;&#65292;&#23545;&#20110;&#19968;&#20010;&#39057;&#32321;&#35775;&#38382;&#30340; Web &#31449;&#28857;&#30340;&#21629;&#20013;&#35745;&#25968;&#22120; Servlet&#65292;&#27492;&#20540;&#24212;&#35813;&#23613;&#21487;&#33021;&#20302; (1 &#31186;)&#65307;&#21542;&#21017;&#65292;&#22312;&#27599;&#27425;&#37325;&#26032;&#21551;&#21160;&#26381;&#21153;&#22120;&#26102;&#21487;&#33021;&#20002;&#22833;&#26368;&#36817;&#20960;&#27425;&#21629;&#20013;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26368;&#22823;&#20250;&#35805;&#25968;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#39640;&#36895;&#32531;&#23384;&#20013;&#21487;&#20197;&#23384;&#20648;&#30340;&#26368;&#22823;&#20250;&#35805;&#25968;&#12290;</p>
<p>&#22914;&#26524;&#20540;&#20026; -1&#65292;&#21017;&#34920;&#31034;&#20250;&#35805;&#25968;&#19981;&#21463;&#38480;&#21046;&#12290;&#40664;&#35748;&#20540;&#20026; -1&#12290;</p>
<p>&#21040;&#36798;&#38480;&#21046;&#21518;&#65292;&#22914;&#26524;&#23581;&#35797;&#21019;&#24314;&#26032;&#20250;&#35805;&#65292;&#21017;&#20250;&#23548;&#33268;&#31995;&#32479;&#25243;&#20986; <code>IllegalStateException</code>&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#20250;&#35805;&#25991;&#20214;&#21517;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#24212;&#29992;&#31243;&#24207;&#37325;&#26032;&#21551;&#21160;&#20043;&#38388;&#20445;&#30041;&#20250;&#35805;&#29366;&#24577;&#30340;&#30446;&#24405;&#30340;&#32477;&#23545;&#25110;&#30456;&#23545;&#36335;&#24452; (&#22914;&#26524;&#21487;&#20197;&#20445;&#30041;&#29366;&#24577;)&#12290;</p>
<p>&#22914;&#26524;&#26410;&#35774;&#32622;&#27492;&#36335;&#24452;&#65292;&#21017;&#20250;&#35805;&#29366;&#24577;&#19981;&#20250;&#20445;&#30041;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#26410;&#35774;&#32622;&#27492;&#36335;&#24452;&#12290;</p>
<p>&#30456;&#23545;&#36335;&#24452;&#26159;&#30456;&#23545;&#20110;&#27492; Web &#24212;&#29992;&#31243;&#24207;&#30340;&#20020;&#26102;&#30446;&#24405;&#30340;&#36335;&#24452;&#12290;</p>
<p>&#20165;&#24403;&ldquo;&#25345;&#20037;&#31867;&#22411;&rdquo;&#20026;<code>&#20869;&#23384;</code>&#26102;&#65292;&#35813;&#35774;&#32622;&#25165;&#36866;&#29992;&#12290;&#35201;&#35774;&#32622;&#25345;&#20037;&#31867;&#22411;&#65292;&#35831;&#21442;&#38405;<a href="task-webcontaineravailability.html">&#37197;&#32622; Web &#23481;&#22120;&#30340;&#21487;&#29992;&#24615;&#35774;&#32622;</a>&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#20854;&#20182;&#23646;&#24615;&rdquo;&#37096;&#20998;&#20013;&#65292;&#25351;&#23450;&#20854;&#20182;&#23646;&#24615;&#12290;</p>
<p>GlassFish Server &#19981;&#23450;&#20041;&#20250;&#35805;&#31649;&#29702;&#22120;&#30340;&#20219;&#20309;&#20854;&#20182;&#23646;&#24615;&#12290;</p>
<ul>
<li>
<p>&#35201;&#28155;&#21152;&#23646;&#24615;&#65292;&#35831;&#21333;&#20987;&ldquo;&#28155;&#21152;&#23646;&#24615;&rdquo;&#25353;&#38062;&#12290;&#22312;&#26174;&#31034;&#30340;&#31354;&#30333;&#34892;&#20013;&#65292;&#22312;&ldquo;&#21517;&#31216;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#23646;&#24615;&#21517;&#31216;&#65292;&#22312;&ldquo;&#20540;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#23646;&#24615;&#20540;&#12290;</p>
</li>
<li>
<p>&#35201;&#20462;&#25913;&#23646;&#24615;&#65292;&#35831;&#32534;&#36753;&#35813;&#23646;&#24615;&#30340;&ldquo;&#20540;&rdquo;&#23383;&#27573;&#12290;</p>
</li>
<li>
<p>&#35201;&#21024;&#38500;&#23646;&#24615;&#65292;&#35831;&#36873;&#20013;&#20301;&#20110;&#24744;&#35201;&#21024;&#38500;&#23646;&#24615;&#30340;&ldquo;&#21517;&#31216;&rdquo;&#23383;&#27573;&#24038;&#36793;&#30340;&#22797;&#36873;&#26694;&#65292;&#28982;&#21518;&#21333;&#20987;&ldquo;&#21024;&#38500;&#23646;&#24615;&rdquo;&#25353;&#38062;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#21333;&#20987;&ldquo;&#20445;&#23384;&rdquo;&#12290;</p>

<hr>
<p><b>&#25552;&#31034;:</b></p>
&#35201;&#36820;&#22238;&#21040;&#40664;&#35748;&#35774;&#32622;&#65292;&#35831;&#21333;&#20987;&ldquo;&#21152;&#36733;&#40664;&#35748;&#20540;&rdquo;&#25353;&#38062;&#65292;&#28982;&#21518;&#21333;&#20987;&ldquo;&#20445;&#23384;&rdquo;&#12290;<br />
<hr>

</li>
</ol>
<a id="sthref10" name="sthref10"></a>
<h5>&#21478;&#35831;&#21442;&#38405;</h5>
<ul>
<li>
<p><a href="task-webcontainergeneral.html">&#37197;&#32622; Web &#23481;&#22120;&#30340;&#24120;&#35268;&#23646;&#24615;</a></p>
</li>
<li>
<p><a href="task-webcontainersessiontimeout.html">&#37197;&#32622; Web &#23481;&#22120;&#30340;&#20250;&#35805;&#23646;&#24615;</a></p>
</li>
<li>
<p><a href="task-webcontainerstoreprops.html">&#37197;&#32622; Web &#23481;&#22120;&#30340;&#23384;&#20648;&#23646;&#24615;</a></p>
</li>
<li>
<p><a href="task-webcontaineravailability.html">&#37197;&#32622; Web &#23481;&#22120;&#30340;&#21487;&#29992;&#24615;&#35774;&#32622;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
