<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-protocolnew" name="task-protocolnew"></a></p>

<h4><a id="sthref49" name="sthref49"></a>&#21019;&#24314;&#21327;&#35758;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#23548;&#33322;&#26641;&#20013;&#65292;&#23637;&#24320;&ldquo;&#37197;&#32622;&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#37197;&#32622;&rdquo;&#33410;&#28857;&#19979;&#65292;&#23637;&#24320;&ldquo;&#32593;&#32476;&#37197;&#32622;&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#32593;&#32476;&#37197;&#32622;&rdquo;&#33410;&#28857;&#19979;&#65292;&#36873;&#25321;&ldquo;&#21327;&#35758;&rdquo;&#33410;&#28857;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#21327;&#35758;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#21327;&#35758;&rdquo;&#39029;&#19978;&#65292;&#21333;&#20987;&ldquo;&#26032;&#24314;&rdquo;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#26032;&#24314;&#21327;&#35758;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#21517;&#31216;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#21327;&#35758;&#30340;&#21807;&#19968;&#21517;&#31216;&#12290;</p>
</li>
<li>
<p>&#36873;&#25321;&ldquo;&#24050;&#21551;&#29992;&#23433;&#20840;&#24615;&rdquo;&#22797;&#36873;&#26694;&#20197;&#20026;&#21327;&#35758;&#21551;&#29992;&#23433;&#20840;&#24615;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;&#22914;&#26524;&#21551;&#29992;&#23433;&#20840;&#24615;&#65292;&#21017;&#21487;&#20197;&#20351;&#29992;&ldquo;&#32534;&#36753;&#21327;&#35758;&rdquo;&#39029;&#30340; SSL &#36873;&#39033;&#21345;&#26469;&#20462;&#25913;&#23433;&#20840;&#24615;&#35774;&#32622;&#12290;</p>
</li>
<li>
<p>&#36873;&#25321;&ldquo;&#21551;&#29992;&#29366;&#24577;&rdquo;&#22797;&#36873;&#26694;&#20197;&#21551;&#29992;&#25991;&#20214;&#39640;&#36895;&#32531;&#23384;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#21551;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26368;&#38271;&#23384;&#27963;&#26102;&#38388;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#26377;&#25928;&#39640;&#36895;&#32531;&#23384;&#26465;&#30446;&#30340;&#26368;&#38271;&#23384;&#27963;&#26102;&#38388; (&#31186;)&#12290;</p>
<p>&#35813;&#21442;&#25968;&#29992;&#20110;&#25511;&#21046;&#25991;&#20214;&#32463;&#36807;&#39640;&#36895;&#32531;&#23384;&#20043;&#21518;&#65292;&#20351;&#29992;&#39640;&#36895;&#32531;&#23384;&#20449;&#24687;&#30340;&#26102;&#38388;&#12290;&#26102;&#38388;&#38271;&#20110;&#26368;&#38271;&#23384;&#27963;&#26102;&#38388;&#30340;&#26465;&#30446;&#23558;&#29992;&#21516;&#19968;&#25991;&#20214;&#30340;&#26032;&#26465;&#30446;&#26367;&#20195;&#12290;&#22914;&#26524;&#24744;&#30340;&#20869;&#23481;&#24456;&#23569;&#21457;&#29983;&#26356;&#25913;&#65292;&#35831;&#22686;&#22823;&#35813;&#20540;&#20197;&#25913;&#21892;&#24615;&#33021;&#12290;</p>
<p>&#26368;&#20248;&#30340;&#26368;&#38271;&#23384;&#27963;&#26102;&#38388;&#21462;&#20915;&#20110;&#29616;&#26377;&#25991;&#20214;&#26159;&#21542;&#34987;&#39057;&#32321;&#20462;&#25913;&#12290;&#20363;&#22914;&#65292;&#22914;&#26524;&#20197;&#22266;&#23450;&#30340;&#26102;&#38388;&#38388;&#38548;&#19968;&#22825;&#20462;&#25913;&#25991;&#20214;&#22235;&#27425;&#65292;&#21017;&#21487;&#20197;&#32771;&#34385;&#23558;&#26368;&#38271;&#23384;&#27963;&#26102;&#38388;&#35774;&#32622;&#20026; 21600 &#31186; (6 &#23567;&#26102;)&#12290;&#21542;&#21017;&#65292;&#21487;&#20197;&#32771;&#34385;&#23558;&#26368;&#38271;&#23384;&#27963;&#26102;&#38388;&#35774;&#32622;&#20026;&#24744;&#24076;&#26395;&#22312;&#19978;&#19968;&#29256;&#26412;&#30340;&#25991;&#20214;&#20462;&#25913;&#21518;&#65292;&#22788;&#29702;&#35813;&#25991;&#20214;&#30340;&#26368;&#38271;&#26102;&#38388;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 30&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26368;&#22823;&#39640;&#36895;&#32531;&#23384;&#22823;&#23567;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#30913;&#30424;&#19978;&#25991;&#20214;&#39640;&#36895;&#32531;&#23384;&#30340;&#26368;&#22823;&#24635;&#22823;&#23567; (&#23383;&#33410;)&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 10485760&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26368;&#22823;&#25991;&#20214;&#35745;&#25968;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#25991;&#20214;&#39640;&#36895;&#32531;&#23384;&#20013;&#21487;&#20197;&#23384;&#20648;&#30340;&#25991;&#20214;&#30340;&#26368;&#22823;&#25968;&#37327;&#12290;</p>
<p>&#22914;&#26524;&#35813;&#20540;&#36807;&#22823;&#65292;&#26381;&#21153;&#22120;&#23558;&#39640;&#36895;&#32531;&#23384;&#36739;&#23569;&#20351;&#29992;&#30340;&#25991;&#20214;&#65292;&#36825;&#26679;&#20250;&#28010;&#36153;&#20869;&#23384;&#12290;&#22914;&#26524;&#35813;&#20540;&#36807;&#23567;&#65292;&#23558;&#26080;&#27861;&#20307;&#29616;&#39640;&#36895;&#32531;&#23384;&#30340;&#20248;&#28857;&#12290;&#23581;&#35797;&#20026;&#35813;&#23646;&#24615;&#35774;&#32622;&#19981;&#21516;&#30340;&#20540;&#65292;&#20197;&#23547;&#25214;&#36866;&#21512;&#29305;&#23450;&#24212;&#29992;&#31243;&#24207;&#30340;&#26368;&#20339;&#35299;&#20915;&#26041;&#26696;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 1024&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26381;&#21153;&#22120;&#21517;&#31216;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#35201;&#22312;&#26381;&#21153;&#22120;&#21457;&#36865;&#32473;&#23458;&#25143;&#26426;&#30340; URL &#20013;&#20351;&#29992;&#30340;&#20027;&#26426;&#21517;&#12290;</p>
<p>&#22914;&#26524;&#26381;&#21153;&#22120;&#20351;&#29992;&#21035;&#21517;&#65292;&#21017;&#27492;&#21517;&#31216;&#20026;&#21035;&#21517;&#12290;&#22914;&#26524;&#26381;&#21153;&#22120;&#26410;&#20351;&#29992;&#21035;&#21517;&#65292;&#35831;&#23558;&#27492;&#23383;&#27573;&#20445;&#30041;&#20026;&#31354;&#12290;</p>
<p>&#27492;&#20540;&#20250;&#24433;&#21709;&#26381;&#21153;&#22120;&#33258;&#21160;&#29983;&#25104;&#30340; URL&#65292;&#20294;&#19981;&#20250;&#24433;&#21709;&#23384;&#20648;&#22312;&#26381;&#21153;&#22120;&#20013;&#30340;&#30446;&#24405;&#21644;&#25991;&#20214;&#30340; URL&#12290;&#22914;&#26524;&#26381;&#21153;&#22120;&#20351;&#29992;&#21035;&#21517;&#65292;&#21017;&#26381;&#21153;&#22120;&#21517;&#31216;&#24212;&#20026;&#21035;&#21517;&#12290;&#22914;&#26524;&#38468;&#21152;&#20102;&#20882;&#21495;&#21644;&#31471;&#21475;&#21495;&#65292;&#21017;&#22312;&#26381;&#21153;&#22120;&#21457;&#36865;&#32473;&#23458;&#25143;&#26426;&#30340; URL &#20013;&#23558;&#20351;&#29992;&#35813;&#31471;&#21475;&#12290;</p>
</li>
<li>
<p>&#20174;&ldquo;&#40664;&#35748;&#34394;&#25311;&#26381;&#21153;&#22120;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&#35201;&#19982;&#27492;&#21327;&#35758;&#20851;&#32852;&#30340;&#34394;&#25311;&#26381;&#21153;&#22120;&#12290;</p>
<p>&#20351;&#29992;&ldquo;&#34394;&#25311;&#26381;&#21153;&#22120;&rdquo;&#39029;&#21487;&#20197;&#23450;&#20041;&#34394;&#25311;&#26381;&#21153;&#22120;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#37325;&#23450;&#21521;&#31471;&#21475;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#35201;&#29992;&#20110;&#23558;&#35831;&#27714;&#37325;&#23450;&#21521;&#33267;&#21478;&#19968;&#31471;&#21475;&#30340;&#31471;&#21475;&#20540;&#12290;</p>
<p>&#22914;&#26524;&#28385;&#36275;&#20197;&#19979;&#20004;&#20010;&#26465;&#20214;&#65292;GlassFish Server &#23558;&#33258;&#21160;&#37325;&#23450;&#21521;&#35831;&#27714;&#65306;</p>
<ul>
<li>
<p>&#24341;&#29992;&#27492;&#21327;&#35758;&#30340;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;&#25903;&#25345;&#38750; SSL &#35831;&#27714;&#12290;</p>
</li>
<li>
<p>&#25509;&#25910;&#21305;&#37197;&#23433;&#20840;&#24615;&#32422;&#26463;&#26465;&#20214;&#38656;&#35201; SSL &#20256;&#36755;&#30340;&#35831;&#27714;&#12290;</p>
</li>
</ul>
<p>&#22914;&#26524;&#26410;&#25351;&#23450;&#37325;&#23450;&#21521;&#31471;&#21475;&#65292;&#21017; GlassFish Server &#20250;&#20351;&#29992;&#21407;&#22987;&#35831;&#27714;&#20013;&#25351;&#23450;&#30340;&#31471;&#21475;&#21495;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#26410;&#25351;&#23450;&#20219;&#20309;&#31471;&#21475;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26368;&#22823;&#36830;&#25509;&#25968;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#22312;&#26381;&#21153;&#22120;&#20851;&#38381;&#36830;&#25509;&#20043;&#21069;&#21487;&#20197;&#36830;&#32493;&#22788;&#29702;&#30340;&#26368;&#22823;&#35831;&#27714;&#25968;&#12290;</p>
<p>&#20445;&#25345;&#27963;&#21160;&#23376;&#31995;&#32479;&#20250;&#23450;&#26399;&#36718;&#35810;&#31354;&#38386;&#36830;&#25509;&#12290;&#40664;&#35748;&#20540;&#20026; 256&#12290;</p>
<p>&#23558;&#27492;&#23646;&#24615;&#35774;&#32622;&#20026; 1 &#21487;&#31105;&#29992; HTTP/1.0 &#30340;&#20445;&#25345;&#27963;&#21160;&#21151;&#33021;&#20197;&#21450; HTTP/1.1 &#30340;&#20445;&#25345;&#27963;&#21160;&#21644;&#31649;&#36947;&#21151;&#33021;&#12290;&#22914;&#26524;&#20540;&#20026; 0&#65292;&#21017;&#34920;&#31034;&#22987;&#32456;&#25298;&#32477;&#35831;&#27714;&#12290;&#22914;&#26524;&#20540;&#20026; -1&#65292;&#21017;&#19981;&#38480;&#21046;&#20445;&#25345;&#27963;&#21160;&#36830;&#25509;&#30340;&#25968;&#37327;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#36229;&#26102;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#21487;&#20197;&#35748;&#20026;&#36830;&#25509;&#22788;&#20110;&#31354;&#38386;&#29366;&#24577;&#24182;&#32500;&#25345;&#22312;&#20445;&#25345;&#27963;&#21160;&#29366;&#24577;&#30340;&#26368;&#38271;&#26102;&#38388; (&#31186;)&#12290;</p>
<p>&#22914;&#26524;&#20540;&#20026; 0 &#25110;&#23567;&#20110; 0&#65292;&#21017;&#34920;&#31034;&#20445;&#25345;&#27963;&#21160;&#36830;&#25509;&#23558;&#26080;&#38480;&#26399;&#22320;&#20445;&#25345;&#25171;&#24320;&#29366;&#24577;&#12290;&#40664;&#35748;&#20540;&#20026; 30 &#31186;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#21551;&#29992;&#19978;&#36733;&#36229;&#26102;&rdquo;&#22797;&#36873;&#26694;&#65292;&#21487;&#20197;&#22312;&#21040;&#36798;&ldquo;&#36830;&#25509;&#19978;&#36733;&#36229;&#26102;&rdquo;&#38480;&#21046;&#20043;&#21518;&#65292;&#20851;&#38381;&#32531;&#24930;&#35835;&#21462;&#23383;&#33410;&#30340; Servlet &#36830;&#25509;&#12290;</p>
<p>&#22914;&#26524;&#31105;&#29992;&#27492;&#36873;&#39033;&#65292;&#21017; Servlet &#36830;&#25509;&#23558;&#19981;&#20250;&#36229;&#26102;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#36830;&#25509;&#19978;&#36733;&#36229;&#26102;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#19978;&#36733;&#30340;&#36229;&#26102; (&#27627;&#31186;)&#12290;</p>
<p>&#21482;&#26377;&#22312;&#36873;&#20013;&ldquo;&#21551;&#29992;&#19978;&#36733;&#36229;&#26102;&rdquo;&#22797;&#36873;&#26694;&#26102;&#65292;&#27492;&#23383;&#27573;&#25165;&#21487;&#29992;&#12290;&#40664;&#35748;&#20540;&#20026; 300000 &#27627;&#31186;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#35831;&#27714;&#36229;&#26102;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#35831;&#27714;&#36229;&#26102;&#20043;&#21069;&#32463;&#36807;&#30340;&#31186;&#25968;&#12290;</p>
<p>&#22914;&#26524;&#22312;&#21040;&#36798;&#36229;&#26102;&#20540;&#20043;&#21069;&#26410;&#22788;&#29702;&#35831;&#27714;&#65292;&#21017;&#35831;&#27714;&#23558;&#34987;&#24573;&#30053;&#12290;&#40664;&#35748;&#20540;&#20026; 30 &#31186;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#21457;&#36865;&#32531;&#20914;&#21306;&#22823;&#23567;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#21457;&#36865;&#32531;&#20914;&#21306;&#30340;&#22823;&#23567; (&#23383;&#33410;)&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 8192 &#23383;&#33410;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26631;&#22836;&#32531;&#20914;&#21306;&#38271;&#24230;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#35831;&#27714;&#22788;&#29702;&#32447;&#31243;&#29992;&#20110;&#35835;&#21462;&#35831;&#27714;&#25968;&#25454;&#30340;&#32531;&#20914;&#21306;&#30340;&#22823;&#23567; (&#23383;&#33410;)&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 8192 &#23383;&#33410;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26368;&#22823; POST &#22823;&#23567;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837; POST &#25805;&#20316;&#30340;&#26368;&#22823;&#22823;&#23567; (&#23383;&#33410;)&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 2097152 &#23383;&#33410;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;URI &#32534;&#30721;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#29992;&#26469;&#23545;&#25910;&#21040;&#30340;&#35831;&#27714; URI &#36827;&#34892;&#35299;&#30721;&#30340;&#23383;&#31526;&#38598;&#30340;&#21517;&#31216;&#12290;</p>
<p>&#35813;&#20540;&#24517;&#39035;&#26159;&#26377;&#25928;&#30340; IANA &#23383;&#31526;&#38598;&#21517;&#31216;&#12290;&#40664;&#35748;&#20540;&#20026; UTF-8&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#29256;&#26412;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#25152;&#29992;&#30340; HTTP &#21327;&#35758;&#30340;&#29256;&#26412;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; HTTP/1.1&#12290;</p>
</li>
<li>
<p>&#20174;&ldquo;&#21387;&#32553;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&#20351;&#29992; HTTP/1.1 GZIP &#21387;&#32553;&#20197;&#33410;&#30465;&#26381;&#21153;&#22120;&#24102;&#23485;&#12290;</p>
<p>&#21487;&#29992;&#36873;&#39033;&#20026;&#65306;</p>
<dl>
<dt><code>on</code></dt>
<dd>
<p>&#21387;&#32553;&#25968;&#25454;&#12290;</p>
</dd>
<dt><code>off</code></dt>
<dd>
<p>&#31105;&#29992;&#21387;&#32553;&#12290;</p>
</dd>
<dt><code>force</code></dt>
<dd>
<p>&#22312;&#25152;&#26377;&#24773;&#20917;&#19979;&#24378;&#21046;&#25191;&#34892;&#25968;&#25454;&#21387;&#32553;&#12290;</p>
</dd>
</dl>
<p>&#40664;&#35748;&#20540;&#20026; <code>off</code>&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#21487;&#21387;&#32553; Mime &#31867;&#22411;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#20351;&#29992; HTTP &#21387;&#32553;&#30340; MIME &#31867;&#22411;&#30340;&#36887;&#21495;&#20998;&#38548;&#21015;&#34920;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; <code>text/html,text/xml,text/plain</code>&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#21387;&#32553;&#26368;&#23567;&#22823;&#23567;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#24212;&#29992;&#21387;&#32553;&#26102;&#65292;&#25991;&#20214;&#30340;&#26368;&#23567;&#22823;&#23567;&#12290;</p>
<p>&#22914;&#26524;&ldquo;&#21387;&#32553;&rdquo;&#35774;&#32622;&#20026; <code>on</code> &#25110; <code>force</code>&#65292;&#21017;&#24517;&#39035;&#35774;&#32622;&#27492;&#20540;&#12290;&#40664;&#35748;&#20540;&#20026; 2048 &#23383;&#33410;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26080;&#21387;&#32553;&#29992;&#25143;&#20195;&#29702;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#23545;&#24212;&#37027;&#20123;&#19981;&#20351;&#29992;&#21387;&#32553;&#30340; HTTP &#23458;&#25143;&#26426;&#30340;&#29992;&#25143;&#20195;&#29702;&#30340;&#12289;&#20197;&#36887;&#21495;&#20998;&#38548;&#30340;&#27491;&#21017;&#34920;&#36798;&#24335;&#21015;&#34920;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#27492;&#20540;&#20026;&#31354;&#23383;&#31526;&#20018;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#21463;&#38480;&#30340;&#29992;&#25143;&#20195;&#29702;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#24212;&#29992;&#20102; HTTP &#21387;&#32553;&#30340;&#21463;&#38480;&#29992;&#25143;&#20195;&#29702;&#30340;&#21015;&#34920;&#12290;</p>
<p>&#22914;&#26524;&#26410;&#25351;&#23450;&#29992;&#25143;&#20195;&#29702;&#65292;&#21017; HTTP &#21387;&#32553;&#23558;&#24212;&#29992;&#21040;&#25152;&#26377;&#29992;&#25143;&#20195;&#29702;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#26410;&#25351;&#23450;&#29992;&#25143;&#20195;&#29702;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#40664;&#35748;&#21709;&#24212;&#31867;&#22411;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#25351;&#23450;&#40664;&#35748;&#21709;&#24212;&#31867;&#22411;&#30340;&#23383;&#31526;&#20018;&#12290;</p>
<p>&#27492;&#26684;&#24335;&#26159;&#20197;&#20998;&#21495;&#20998;&#38548;&#30340;&#23383;&#31526;&#20018;&#65292;&#30001;&#20869;&#23481;&#31867;&#22411;&#12289;&#32534;&#30721;&#12289;&#35821;&#35328;&#21644;&#23383;&#31526;&#38598;&#32452;&#25104;&#12290;&#40664;&#35748;&#20540;&#20026; <code>text/html; charset=iso-8859-1</code>&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#24378;&#21046;&#21709;&#24212;&#31867;&#22411;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#19968;&#20010;&#23383;&#31526;&#20018;&#65292;&#35813;&#23383;&#31526;&#20018;&#25351;&#23450;&#22312;&#27809;&#26377;&#19982;&#25991;&#20214;&#25193;&#23637;&#21517;&#21305;&#37197;&#30340; MIME &#26144;&#23556;&#26102;&#20351;&#29992;&#30340;&#35831;&#27714;&#31867;&#22411;&#12290;</p>
<p>&#27492;&#26684;&#24335;&#26159;&#20197;&#20998;&#21495;&#20998;&#38548;&#30340;&#23383;&#31526;&#20018;&#65292;&#30001;&#20869;&#23481;&#31867;&#22411;&#12289;&#32534;&#30721;&#12289;&#35821;&#35328;&#21644;&#23383;&#31526;&#38598;&#32452;&#25104;&#12290;&#40664;&#35748;&#20540;&#20026; <code>text/html; charset=iso-8859-1</code>&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#36866;&#37197;&#22120;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#38745;&#24577;&#36164;&#28304;&#36866;&#37197;&#22120;&#30340;&#31867;&#21517;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; <code>com.sun.grizzly.tcp.StaticResourcesAdapter</code>&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#21551;&#29992; Comet &#25903;&#25345;&rdquo;&#22797;&#36873;&#26694;&#65292;&#20026;&#24341;&#29992;&#27492;&#21327;&#35758;&#30340;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;&#21551;&#29992; Comet &#25903;&#25345;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;&#22914;&#26524; Servlet &#25110; JSP &#39029;&#20351;&#29992; Comet &#25216;&#26415;&#65292;&#35831;&#23558; <code>load-on-startup</code> &#20803;&#32032;&#28155;&#21152;&#21040; <code>web.xml</code> &#25991;&#20214;&#20013;&#65292;&#20197;&#30830;&#20445;&#35813;&#39029;&#22312; GlassFish Server &#21551;&#21160;&#26102;&#36827;&#34892;&#21021;&#22987;&#21270;&#12290;&#20363;&#22914;&#65306;</p>
<pre>
&lt;servlet&gt;
&lt;servlet-name&gt;CheckIn&lt;/servlet-name&gt;
&lt;servlet-class&gt;CheckInServlet&lt;/servlet-class&gt;
&lt;load-on-startup&gt;0&lt;/load-on-startup&gt;
&lt;/servlet&gt;
</pre></li>
<li>
<p>&#36873;&#20013;&ldquo;&#21551;&#29992; DNS &#26597;&#25214;&rdquo;&#22797;&#36873;&#26694;&#20197;&#21551;&#29992; DNS &#26597;&#25214;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#21551;&#29992; RCM &#25903;&#25345;&rdquo;&#22797;&#36873;&#26694;&#20197;&#21551;&#29992;&#36164;&#28304;&#37197;&#32622;&#31649;&#29702; (RCM)&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#21551;&#29992;&#36319;&#36394;&rdquo;&#22797;&#36873;&#26694;&#20197;&#21551;&#29992;&#36319;&#36394;&#25805;&#20316;&#12290;</p>
<p>&#22914;&#26524;&#31105;&#29992;&#27492;&#36873;&#39033;&#65292;&#21017; GlassFish Server &#23558;&#19981;&#26131;&#21463;&#21040;&#36328;&#31449;&#28857;&#33050;&#26412;&#25915;&#20987;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#21551;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#21551;&#29992;&#20256;&#36882;&#39564;&#35777;&rdquo;&#22797;&#36873;&#26694;&#65292;&#20197;&#25351;&#31034;&#20351;&#29992;&#27492;&#21327;&#35758;&#30340;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;&#25509;&#25910;&#26469;&#33258; SSL &#32456;&#31471;&#20195;&#29702;&#26381;&#21153;&#22120;&#30340;&#27969;&#37327;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#21551;&#29992;&#20998;&#22359;&rdquo;&#22797;&#36873;&#26694;&#20197;&#21551;&#29992; HTTP &#21709;&#24212;&#20998;&#22359;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#21551;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#21551;&#29992; XPowered By&rdquo;&#22797;&#36873;&#26694;&#65292;&#20197;&#25351;&#31034; GlassFish Server &#26681;&#25454; Java Servlet 3.0 &#21644; Java Server Pages 2.0 &#35268;&#33539;&#20351;&#29992; <code>X-Powered-By</code> &#26631;&#22836;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#21551;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
</ol>
<a id="sthref50" name="sthref50"></a>
<h5>&#21518;&#32493;&#27493;&#39588;</h5>
<p>&#21019;&#24314;&#21327;&#35758;&#21518;&#65292;&#24744;&#21487;&#20197;&#21019;&#24314;&#20351;&#29992;&#35813;&#21327;&#35758;&#30340;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;&#12290;</p>
<a id="sthref51" name="sthref51"></a>
<h5>&#21478;&#35831;&#21442;&#38405;</h5>
<ul>
<li>
<p><a href="task-networklistenernew.html">&#21019;&#24314;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-networklisteneredit.html">&#32534;&#36753;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-networklistenerdelete.html">&#21024;&#38500;&#32593;&#32476;&#30417;&#21548;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">&#32534;&#36753;&#21327;&#35758;</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">&#32534;&#36753;&#21327;&#35758;&#30340; SSL &#35774;&#32622;</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">&#32534;&#36753;&#21327;&#35758;&#30340; HTTP &#35774;&#32622;</a></p>
</li>
<li>
<p><a href="task-protocolfilecacheedit.html">&#32534;&#36753;&#21327;&#35758;&#30340;&#25991;&#20214;&#39640;&#36895;&#32531;&#23384;&#35774;&#32622;</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">&#21024;&#38500;&#21327;&#35758;</a></p>
</li>
<li>
<p><a href="task-transportnew.html">&#21019;&#24314;&#20256;&#36755;</a></p>
</li>
<li>
<p><a href="task-transportedit.html">&#32534;&#36753;&#20256;&#36755;</a></p>
</li>
<li>
<p><a href="task-transportdelete.html">&#21024;&#38500;&#20256;&#36755;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
