<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-connectorconnectionpooledit" name="ref-connectorconnectionpooledit"></a></p>

<h4><a id="sthref71" name="sthref71"></a>&#52964;&#45349;&#53552; &#51217;&#49549; &#54400; &#54200;&#51665;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#52964;&#45349;&#53552; &#51217;&#49549; &#54400; &#54200;&#51665;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#50640; &#45824;&#54620; &#49444;&#51221;&#51012; &#49688;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>[&#52964;&#45349;&#53552; &#51217;&#49549; &#54400; &#54200;&#51665;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44592;&#48376;&#44050; &#47196;&#46300;</dt>
<dd>
<p>&#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#45716; &#49444;&#51221;&#51012; &#44592;&#48376;&#44050;&#51004;&#47196; &#48373;&#50896;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#49444;&#51221;&#51008; &#48320;&#44221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#48708;&#50864;&#44592;</dt>
<dd>
<p>&#51217;&#49549; &#54400;&#51032; &#51217;&#49549;&#51012; &#45796;&#49884; &#52488;&#44592;&#54868;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#51060; &#45800;&#52628;&#47484; &#45572;&#47476;&#47732; &#44592;&#51316;&#51032; &#47784;&#46304; &#51217;&#49549;&#51060; &#49325;&#51228;&#46104;&#44256; &#54400;&#50640; &#49444;&#51221;&#46108; &#51217;&#49549;&#51060; &#45796;&#49884; &#49373;&#49457;&#46108; &#54980; &#54400;&#51060; &#52488;&#44592; &#48143; &#52572;&#49548; &#54400; &#53356;&#44592;&#47196; &#48373;&#50896;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#54609;</dt>
<dd>
<p>&#51217;&#49549; &#54400;&#51012; &#49324;&#50857;&#54624; &#49688; &#51080;&#45716;&#51648; &#54869;&#51064;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#54400; &#51060;&#47492;</dt>
<dd>
<p>&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#51012; &#49885;&#48324;&#54616;&#45716; &#44256;&#50976;&#54620; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51069;&#44592; &#51204;&#50857; &#54596;&#46300;&#51077;&#45768;&#45796;. &#49352; &#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#51012; &#49373;&#49457;&#54624; &#46412;&#47564; &#54400; &#51060;&#47492;&#51012; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#47532;&#49548;&#49828; &#50612;&#45841;&#53552;</dt>
<dd>
<p>&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#44284; &#50672;&#44288;&#46108; &#47532;&#49548;&#49828; &#50612;&#45841;&#53552;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51217;&#49549; &#51221;&#51032;</dt>
<dd>
<p>&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#50640; &#45824;&#54620; &#51217;&#49549; &#51221;&#51032;&#51077;&#45768;&#45796;. &#47785;&#47197;&#51032; &#49440;&#53469; &#54637;&#47785;&#51008; &#49440;&#53469;&#54620; &#47532;&#49548;&#49828; &#50612;&#45841;&#53552;&#50640; &#46384;&#46972; &#45796;&#47493;&#45768;&#45796;. &#51217;&#49549; &#51221;&#51032;&#45716; <code>ra.xml</code> &#54028;&#51068;&#50640;&#49436; &#47532;&#49548;&#49828; &#50612;&#45841;&#53552;&#51032; <code>connection-definition</code> &#50836;&#49548;&#47484; &#49885;&#48324;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#54609;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; &#49373;&#49457; &#46608;&#45716; &#51116;&#44396;&#49457; &#51473;&#50640; &#51217;&#49549; &#54400;&#51012; &#54609;&#54616;&#50668; &#49549;&#49457;&#50640; &#45824;&#54620; &#47784;&#46304; &#50724;&#47448; &#44050;&#51012; &#49885;&#48324;&#54616;&#44256; &#44221;&#44256;&#54633;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#49444;&#47749;</dt>
<dd>
<p>&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#50640; &#45824;&#54620; &#49444;&#47749;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52488;&#44592; &#48143; &#52572;&#49548; &#54400; &#53356;&#44592;</dt>
<dd>
<p>&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#51032; &#52572;&#49548; &#51217;&#49549; &#49688;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 8&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#45824; &#54400; &#53356;&#44592;</dt>
<dd>
<p>&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#51032; &#52572;&#45824; &#51217;&#49549; &#49688;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 32&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#54400; &#53356;&#44592; &#51312;&#51221; &#44060;&#49688;</dt>
<dd>
<p>&#54400; &#50976;&#55092; &#49884;&#44036; &#52488;&#44284;&#44032; &#47564;&#47308;&#46112; &#46412; &#51228;&#44144;&#54624; &#51217;&#49549; &#49688;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 2&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#50976;&#55092; &#49884;&#44036; &#52488;&#44284;</dt>
<dd>
<p>&#54400;&#50640;&#49436; &#51217;&#49549;&#51060; &#50976;&#55092; &#49345;&#53468;&#47196; &#51080;&#51012; &#49688; &#51080;&#45716; &#52572;&#45824; &#49884;&#44036;(&#52488;)&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 300&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#45824; &#45824;&#44592; &#49884;&#44036;</dt>
<dd>
<p>&#51217;&#49549;&#51012; &#50836;&#52397;&#54620; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#51217;&#49549; &#49884;&#44036; &#52488;&#44284;&#44620;&#51648; &#45824;&#44592;&#54616;&#45716; &#49884;&#44036;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 60000&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51217;&#49549; &#44160;&#51613;</dt>
<dd>
<p>[&#54596;&#50836;] &#52404;&#53356; &#48149;&#49828;&#44032; &#49440;&#53469;&#46108; &#44221;&#50864; &#51217;&#49549;&#51012; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#51204;&#45804;&#54616;&#44592; &#51204;&#50640; &#47676;&#51200; &#44160;&#51613;&#54633;&#45768;&#45796;. &#47532;&#49548;&#49828;&#51032; &#44160;&#51613;&#51060; &#49892;&#54056;&#54616;&#47732; &#47532;&#49548;&#49828;&#44032; &#49325;&#51228;&#46104;&#44256;, &#49352; &#47532;&#49548;&#49828;&#44032; &#49373;&#49457;&#46108; &#54980; &#48152;&#54872;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#49892;&#54056; &#49884;</dt>
<dd>
<p>[&#47784;&#46304; &#51217;&#49549; &#45803;&#44592;] &#52404;&#53356; &#48149;&#49828;&#44032; &#49440;&#53469;&#46108; &#44221;&#50864; &#51217;&#49549;&#51060; &#54616;&#45208;&#46972;&#46020; &#49892;&#54056;&#54616;&#47732; GlassFish Server&#50640;&#49436; &#54400;&#51032; &#47784;&#46304; &#51217;&#49549;&#51012; &#45803;&#51008; &#54980; &#51116;&#49444;&#51221;&#54633;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#53944;&#47004;&#51117;&#49496; &#51648;&#50896;</dt>
<dd>
<p>&#49440;&#53469;&#54620; &#53944;&#47004;&#51117;&#49496; &#51648;&#50896;&#51008; &#51060; &#51217;&#49549; &#54400;&#44284; &#50672;&#44288;&#46108; &#47532;&#49548;&#49828; &#50612;&#45841;&#53552;&#51032; &#53944;&#47004;&#51117;&#49496; &#51648;&#50896; &#49549;&#49457;&#51012; &#50669;&#54840;&#54872; &#48169;&#49885;&#51004;&#47196; &#45824;&#52404;&#54633;&#45768;&#45796;. &#51593;, &#47532;&#49548;&#49828; &#50612;&#45841;&#53552;&#50640; &#51648;&#51221;&#54620; &#47112;&#48296;&#48372;&#45796; &#45230;&#51008; &#53944;&#47004;&#51117;&#49496; &#47112;&#48296;&#51012; &#51648;&#50896;&#54616;&#44144;&#45208; &#47532;&#49548;&#49828; &#50612;&#45841;&#53552;&#50640;&#49436; &#51648;&#51221;&#54620; &#44163;&#44284; &#44057;&#51008; &#53944;&#47004;&#51117;&#49496; &#47112;&#48296;&#51012; &#51648;&#50896;&#54624; &#49688; &#51080;&#51648;&#47564; &#45908; &#45458;&#51008; &#47112;&#48296;&#51008; &#51648;&#51221;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.</p>
<p>&#45796;&#51020;&#44284; &#44057;&#51008; &#44050;&#51012; &#49324;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>XATransaction</dt>
<dd>
<p>&#51060; &#47532;&#49548;&#49828; &#50612;&#45841;&#53552;&#45716; LocalTransaction &#48143; XAResource &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#44396;&#54788;&#54616;&#50668; &#47532;&#49548;&#49828; &#44288;&#47532;&#51088; &#47196;&#52972; &#48143; JTA &#53944;&#47004;&#51117;&#49496;&#51012; &#51648;&#50896;&#54633;&#45768;&#45796;. XA &#53944;&#47004;&#51117;&#49496;&#51008; &#47532;&#49548;&#49828; &#44288;&#47532;&#51088; &#50808;&#48512;&#50640; &#51080;&#45716; &#53944;&#47004;&#51117;&#49496; &#44288;&#47532;&#51088;&#44032; &#51228;&#50612; &#48143; &#51312;&#51221;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>LocalTransaction</dt>
<dd>
<p>&#51060; &#47532;&#49548;&#49828; &#50612;&#45841;&#53552;&#45716; LocalTransaction &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#44396;&#54788;&#54616;&#50668; &#47196;&#52972; &#53944;&#47004;&#51117;&#49496;&#51012; &#51648;&#50896;&#54633;&#45768;&#45796;. &#47196;&#52972; &#53944;&#47004;&#51117;&#49496;&#51008; &#47532;&#49548;&#49828; &#44288;&#47532;&#51088; &#45236;&#48512;&#47196; &#44288;&#47532;&#46104;&#47728; &#50808;&#48512; &#53944;&#47004;&#51117;&#49496; &#44288;&#47532;&#51088;&#47484; &#54252;&#54632;&#49884;&#53412;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>NoTransaction</dt>
<dd>
<p>&#51060; &#47532;&#49548;&#49828; &#50612;&#45841;&#53552;&#45716; &#47532;&#49548;&#49828; &#44288;&#47532;&#51088; &#47196;&#52972; &#46608;&#45716; JTA &#53944;&#47004;&#51117;&#49496;&#51012; &#51648;&#50896;&#54616;&#51648; &#50506;&#51004;&#47728; XAResource &#46608;&#45716; LocalTransaction &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#44396;&#54788;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref72" name="sthref72"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-connectorconnectionpoolnew.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400; &#44256;&#44553; &#49549;&#49457;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400; &#49549;&#49457;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#50640; &#45824;&#54620; &#48372;&#50504; &#47605;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#50640; &#45824;&#54620; &#48372;&#50504; &#47605;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#50640; &#45824;&#54620; &#48372;&#50504; &#47605;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref73" name="sthref73"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00018"><code>create-connector-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00157"><code>list-connector-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00070"><code>delete-connector-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00135"><code>flush-connection-pool</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
