<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-connectorsecuritymaps" name="ref-connectorsecuritymaps"></a><a id="GHJCA00047" name="GHJCA00047"></a></p>

<h4><a id="sthref81" name="sthref81"></a><a id="sthref82" name="sthref82"></a>&#52964;&#45349;&#53552; &#51217;&#49549; &#54400; &#48372;&#50504; &#47605;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#52964;&#45349;&#53552; &#51217;&#49549; &#54400; &#48372;&#50504; &#47605;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#50640; &#45824;&#54620; &#48372;&#50504; &#47605;&#51012; &#44288;&#47532;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#52964;&#45349;&#53552; &#51217;&#49549; &#54400; &#48372;&#50504; &#47605;&#51012; &#49324;&#50857;&#54616;&#47732; Java EE &#49324;&#50857;&#51088;&#50752; &#44536;&#47353;, EIS &#49324;&#50857;&#51088;&#50752; &#44536;&#47353; &#44036;&#51032; &#47588;&#54609;&#51012; &#49373;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#48372;&#50504; &#47605;&#51008; &#49436;&#48660;&#47551; &#46608;&#45716; EJB &#51064;&#51613; &#51473;&#50640; &#48155;&#51008; &#51452;&#52404;&#47484; EIS&#50640;&#49436; &#49688;&#46973;&#54620; &#51064;&#51613;&#49436;&#50640; &#47588;&#54609;&#54633;&#45768;&#45796;. &#50668;&#47084; GlassFish Server &#51452;&#52404;&#47484; &#46041;&#51068;&#54620; &#48177;&#50644;&#46300; &#51452;&#52404;&#50640; &#47588;&#54609;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#51217;&#49549; &#54400;&#50640; &#45824;&#54620; &#48372;&#50504; &#47605;&#51008; &#46308;&#50612;&#50724;&#45716; &#51089;&#50629; &#51064;&#49828;&#53556;&#49828;&#50752; &#50672;&#44288;&#46108; &#51452;&#52404;&#47484; GlassFish Server &#46020;&#47700;&#51064;&#51032; &#48372;&#50504; &#50689;&#50669;&#50640; &#51080;&#45716; &#51452;&#52404;&#50640; &#47588;&#54609;&#54616;&#45716; &#52964;&#45349;&#53552; &#51089;&#50629; &#48372;&#50504; &#47605;&#44284; &#45796;&#47493;&#45768;&#45796;. &#52964;&#45349;&#53552; &#51089;&#50629; &#48372;&#50504; &#47605;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="ref-worksecuritymaps.html">&#51089;&#50629; &#48372;&#50504; &#47605;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
<p>&#44033; &#48372;&#50504; &#47605;&#50640; &#45824;&#54644; &#51228;&#44277;&#46104;&#45716; &#51221;&#48372;&#45716; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#51060;&#47492;</dt>
<dd>
<p>&#48372;&#50504; &#47605;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
<p>&#48372;&#50504; &#47605; &#53580;&#51060;&#48660;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#46020; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#49352;&#47196; &#47564;&#46308;&#44592;</dt>
<dd>
<p>&#49352; &#48372;&#50504; &#47605;&#51012; &#49373;&#49457;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49325;&#51228;</dt>
<dd>
<p>&#49440;&#53469;&#54620; &#48372;&#50504; &#47605;&#51012; &#54616;&#45208; &#51060;&#49345; &#49325;&#51228;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref83" name="sthref83"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-connectorconnectionpoolnew.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400; &#44256;&#44553; &#49549;&#49457;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400; &#49549;&#49457;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#50640; &#45824;&#54620; &#48372;&#50504; &#47605;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#50640; &#45824;&#54620; &#48372;&#50504; &#47605;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#50640; &#45824;&#54620; &#48372;&#50504; &#47605;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref84" name="sthref84"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00020"><code>create-connector-security-map</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00159"><code>list-connector-security-maps</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00072"><code>delete-connector-security-map</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00252"><code>update-connector-security-map</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
