<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-connectorconnectionpooladvance" name="ref-connectorconnectionpooladvance"></a></p>

<h4><a id="sthref74" name="sthref74"></a>&#52964;&#45349;&#53552; &#51217;&#49549; &#54400; &#44256;&#44553; &#49549;&#49457; &#54200;&#51665;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#52964;&#45349;&#53552; &#51217;&#49549; &#54400; &#44256;&#44553; &#49549;&#49457; &#54200;&#51665;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#50640; &#45824;&#54620; &#44256;&#44553; &#49444;&#51221;&#51012; &#49688;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>[&#52964;&#45349;&#53552; &#51217;&#49549; &#54400; &#44256;&#44553; &#49549;&#49457; &#54200;&#51665;] &#54168;&#51060;&#51648;&#50640; &#54252;&#54632;&#46108; &#50741;&#49496;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44592;&#48376;&#44050; &#47196;&#46300;</dt>
<dd>
<p>&#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#45716; &#49444;&#51221;&#51012; &#44592;&#48376;&#44050;&#51004;&#47196; &#48373;&#50896;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#49444;&#51221;&#51008; &#48320;&#44221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#45824; 1&#54924; &#44160;&#51613; &#44592;&#44036;</dt>
<dd>
<p>&#51217;&#49549;&#51012; &#52572;&#45824; &#54620; &#48264; &#44160;&#51613;&#54616;&#44592; &#50948;&#54644; &#50672;&#49549;&#46108; &#50836;&#52397; &#44036;&#51032; &#49884;&#44036; &#44036;&#44201;(&#52488;)&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 0&#51077;&#45768;&#45796;. &#44050;&#51060; 0&#51060;&#47732; &#49549;&#49457;&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#45572;&#49688; &#49884;&#44036; &#52488;&#44284;</dt>
<dd>
<p>&#51217;&#49549; &#54400;&#51032; &#51217;&#49549; &#45572;&#49688;&#47484; &#52628;&#51201;&#54616;&#45716; &#49884;&#44036;(&#52488;)&#51077;&#45768;&#45796;. &#44050;&#51060; 0&#51060;&#47732; &#51217;&#49549; &#45572;&#49688; &#52628;&#51201;&#51012; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#51020;&#51012; &#45208;&#53440;&#45253;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 0&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#45572;&#49688; &#51116;&#49373;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; &#45572;&#49688;&#46108; &#51217;&#49549;&#51060; &#45572;&#49688; &#51217;&#49549; &#52628;&#51201; &#50756;&#47308; &#54980; &#54400;&#47196; &#48373;&#50896;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#49373;&#49457; &#51116;&#49884;&#46020; &#54943;&#49688;</dt>
<dd>
<p>&#49352; &#51217;&#49549; &#49373;&#49457;&#50640; &#49892;&#54056;&#54620; &#44221;&#50864; &#51116;&#49884;&#46020;&#54616;&#45716; &#54943;&#49688;&#51077;&#45768;&#45796;. &#44050;&#51060; 0&#51060;&#47732; &#51217;&#49549; &#49373;&#49457;&#51012; &#45796;&#49884; &#49884;&#46020;&#54616;&#51648; &#50506;&#51020;&#51012; &#51032;&#48120;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 0&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51116;&#49884;&#46020; &#44036;&#44201;</dt>
<dd>
<p>&#51217;&#49549;&#51012; &#49373;&#49457;&#54616;&#44592; &#50948;&#54620; &#46160; &#49884;&#46020; &#44036;&#51032; &#44036;&#44201;(&#52488;)&#51077;&#45768;&#45796;. &#51060; &#49549;&#49457;&#51008; &#49373;&#49457; &#51116;&#49884;&#46020; &#54943;&#49688;&#51032; &#44050;&#51060; 0&#48372;&#45796; &#53360; &#44221;&#50864;&#50640;&#47564; &#49324;&#50857;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 10&#52488;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#54400;&#47553;</dt>
<dd>
<p>&#54400;&#50640; &#45824;&#54620; &#51217;&#49549; &#54400;&#47553;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#45712;&#47536; &#50672;&#44208;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; &#51217;&#49549;&#50640;&#49436; &#51089;&#50629;&#51012; &#49688;&#54665;&#54624; &#46412; &#51217;&#49549;&#51060; &#51648;&#50672;&#46121;&#45768;&#45796;. &#53944;&#47004;&#51117;&#49496;&#51060; &#50756;&#47308;&#46104;&#44256; &#44396;&#49457; &#50836;&#49548; &#47700;&#49548;&#46300;&#44032; &#51333;&#47308;&#46104;&#47732; &#51217;&#49549;&#51060; &#54644;&#51228;&#46104;&#50612; &#47932;&#47532;&#51201; &#51217;&#49549;&#51012; &#51116;&#49324;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#51648;&#50672; &#51217;&#49549; &#52280;&#50668;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; &#47532;&#49548;&#49828;&#44032; &#47700;&#49548;&#46300;&#50640;&#49436; &#49892;&#51228;&#47196; &#49324;&#50857;&#46112; &#46412;&#47564; &#53944;&#47004;&#51117;&#49496;&#50640; &#46321;&#47197;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#49828;&#47112;&#46300;&#50752; &#50672;&#44208;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; &#51217;&#49549;&#51060; &#49828;&#47112;&#46300;&#50752; &#51217;&#49549;&#46121;&#45768;&#45796;. &#46041;&#51068;&#54620; &#49828;&#47112;&#46300;&#50640;&#49436; &#51217;&#49549;&#51012; &#54596;&#50836;&#47196; &#54616;&#45716; &#44221;&#50864; &#51060;&#48120; &#50672;&#44288;&#46108; &#51217;&#49549;&#51012; &#45796;&#49884; &#49324;&#50857;&#54624; &#49688; &#51080;&#51004;&#48064;&#47196; &#54400;&#50640;&#49436; &#51217;&#49549;&#51012; &#44032;&#51256;&#50724;&#44592; &#50948;&#54620; &#50724;&#48260;&#54756;&#46300;&#44032; &#48156;&#49373;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#51217;&#49549; &#51068;&#52824;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; &#54400;&#50640; &#45824;&#54644; &#51217;&#49549; &#51068;&#52824;&#44032; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;. &#54400;&#51032; &#51217;&#49549;&#51060; &#54637;&#49345; &#44057;&#51008; &#51333;&#47448;&#51060;&#47728; &#46384;&#46972;&#49436; &#54400;&#50640;&#49436; &#49440;&#53469;&#46108; &#51217;&#49549;&#51012; &#47532;&#49548;&#49828; &#50612;&#45841;&#53552;&#50752; &#51068;&#52824;&#49884;&#53420; &#54596;&#50836;&#44032; &#50630;&#51020;&#51012; &#50508;&#44256; &#51080;&#45716; &#44221;&#50864; &#51060; &#50741;&#49496;&#51012; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#51217;&#49549; &#49324;&#50857; &#51068;&#52824;</dt>
<dd>
<p>&#54400;&#50640;&#49436; &#51217;&#49549;&#51012; &#51116;&#49324;&#50857;&#54624; &#54943;&#49688;&#51077;&#45768;&#45796;. &#51217;&#49549;&#51012; &#51648;&#51221;&#46108; &#54943;&#49688;&#47564;&#53372; &#51116;&#49324;&#50857;&#54620; &#45796;&#51020;&#50640;&#45716; &#54644;&#45817; &#51217;&#49549;&#51060; &#45803;&#55193;&#45768;&#45796;. &#44050;&#51060; 0&#51060;&#47732; &#51060; &#49549;&#49457;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#51020;&#51012; &#45208;&#53440;&#45253;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 0&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref75" name="sthref75"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-connectorconnectionpoolnew.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400; &#44256;&#44553; &#49549;&#49457;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400; &#49549;&#49457;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#50640; &#45824;&#54620; &#48372;&#50504; &#47605;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#50640; &#45824;&#54620; &#48372;&#50504; &#47605;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#50640; &#45824;&#54620; &#48372;&#50504; &#47605;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref76" name="sthref76"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00018"><code>create-connector-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00157"><code>list-connector-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00070"><code>delete-connector-connection-pool</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
