<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-connectionservice" name="ref-connectionservice"></a></p>

<h4><a id="sthref121" name="sthref121"></a>&#52964;&#45349;&#53552; &#49436;&#48708;&#49828;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#52964;&#45349;&#53552; &#49436;&#48708;&#49828;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#47532;&#49548;&#49828; &#50612;&#45841;&#53552;&#47484; &#51228;&#50612;&#54616;&#45716; &#52964;&#45349;&#53552; &#49436;&#48708;&#49828;&#50640; &#45824;&#54620; &#51068;&#48152; &#49444;&#51221;&#51012; &#49688;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>[&#52964;&#45349;&#53552; &#49436;&#48708;&#49828;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44592;&#48376;&#44050; &#47196;&#46300;</dt>
<dd>
<p>&#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#45716; &#49444;&#51221;&#51012; &#44592;&#48376;&#44050;&#51004;&#47196; &#48373;&#50896;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#49444;&#51221;&#51008; &#48320;&#44221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#44396;&#49457; &#51060;&#47492;</dt>
<dd>
<p>&#51060; &#54168;&#51060;&#51648;&#51032; &#49444;&#51221;&#51060; &#51201;&#50857;&#46104;&#45716; &#44396;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51333;&#47308; &#49884;&#44036; &#52488;&#44284;</dt>
<dd>
<p>GlassFish Server &#51333;&#47308; &#51473; &#52964;&#45349;&#53552; &#47784;&#46280; &#51064;&#49828;&#53556;&#49828;&#51032; <code>ResourceAdapter.stop</code> &#47700;&#49548;&#46300;&#44032; &#50756;&#47308;&#46112; &#46412;&#44620;&#51648; &#54728;&#50857;&#46104;&#45716; &#52572;&#45824; &#49884;&#44036;(&#52488;)&#51077;&#45768;&#45796;. &#51333;&#47308;&#54616;&#45716; &#45936; &#49884;&#44036;&#51060; &#45908; &#50724;&#47000; &#44152;&#47532;&#45716; &#47532;&#49548;&#49828; &#50612;&#45841;&#53552;&#45716; &#47924;&#49884;&#46104;&#47728; GlassFish Server &#51333;&#47308;&#44032; &#44228;&#49549;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 30&#52488;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52964;&#45349;&#53552; &#53364;&#47000;&#49828; &#47196;&#46300; &#51221;&#52293;</dt>
<dd>
<p>&#53364;&#47000;&#49828;&#47484; &#47196;&#46300;&#54616;&#45716; &#45936; &#49324;&#50857;&#54624; &#51221;&#52293;&#51077;&#45768;&#45796;. &#49324;&#50857; &#44032;&#45733;&#54620; &#49440;&#53469; &#54637;&#47785;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt><code>derived</code></dt>
<dd>
<p>&#47532;&#49548;&#49828; &#50612;&#45841;&#53552;&#51032; &#47532;&#49548;&#49828;&#50640; &#45824;&#54620; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51032; &#52280;&#51312;&#50640; &#46384;&#46972; &#47532;&#49548;&#49828; &#50612;&#45841;&#53552;&#44032; &#51228;&#44277;&#46120;&#51012; &#45208;&#53440;&#45253;&#45768;&#45796;. &#51060; &#51221;&#52293;&#51008; &#44592;&#48376;&#44050;&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>global</code></dt>
<dd>
<p>&#47784;&#46304; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#47784;&#46304; &#47532;&#49548;&#49828; &#50612;&#45841;&#53552;&#44032; &#54364;&#49884;&#46120;&#51012; &#45208;&#53440;&#45253;&#45768;&#45796;.</p>
</dd>
</dl>
<p>&#51060; &#51221;&#52293;&#51008; &#54637;&#49345; &#47784;&#46304; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#54364;&#49884;&#46104;&#45716; &#49324;&#51204; &#49444;&#52824;&#46108; JMS &#49884;&#49828;&#53596; &#47532;&#49548;&#49828; &#50612;&#45841;&#53552; <code>jmsra</code>&#50640;&#45716; &#51201;&#50857;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref122" name="sthref122"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-connectionservice.html">&#52964;&#45349;&#53552; &#49436;&#48708;&#49828;&#47484; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="../../../common/en/help/task-appdeployconn.html">&#52964;&#45349;&#53552; &#47784;&#46280;&#51012; &#48176;&#52824;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref123" name="sthref123"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<p>&#50630;&#51020;</p>





<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
