<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-worksecuritymaps" name="ref-worksecuritymaps"></a></p>

<h4><a id="sthref106" name="sthref106"></a><a id="sthref107" name="sthref107"></a>&#51089;&#50629; &#48372;&#50504; &#47605;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#51089;&#50629; &#48372;&#50504; &#47605;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#47532;&#49548;&#49828; &#50612;&#45841;&#53552;&#50640; &#45824;&#54620; &#51089;&#50629; &#48372;&#50504; &#47605;&#51012; &#44396;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#52964;&#45349;&#53552; &#51089;&#50629; &#48372;&#50504; &#47605;&#51008; &#47532;&#49548;&#49828; &#50612;&#45841;&#53552; EIS &#51452;&#52404; &#46608;&#45716; EIS &#49324;&#50857;&#51088; &#44536;&#47353;&#51060; &#51228;&#52636;&#54620; &#51089;&#50629;&#51032; &#54840;&#52636;&#51088; ID&#47484; GlassFish Server &#48372;&#50504; &#46020;&#47700;&#51064;&#51032; &#51201;&#51208;&#54620; &#51452;&#52404; &#46608;&#45716; &#49324;&#50857;&#51088; &#44536;&#47353;&#50640; &#47588;&#54609;&#54633;&#45768;&#45796;. &#54616;&#45208; &#51060;&#49345;&#51032; &#51089;&#50629; &#48372;&#50504; &#47605;&#51012; &#47532;&#49548;&#49828; &#50612;&#45841;&#53552;&#50752; &#50672;&#44208;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#52964;&#45349;&#53552; &#51089;&#50629; &#48372;&#50504; &#47605; &#44396;&#49457;&#51008; &#47784;&#46304; &#49324;&#50857;&#51088; &#46608;&#45716; &#47784;&#46304; &#49324;&#50857;&#51088; &#44536;&#47353;&#51012; &#45208;&#53440;&#45244; &#49688; &#51080;&#46020;&#47197; &#50752;&#51068;&#46300;&#52852;&#46300; &#48324;&#54364;(<code>*</code>)&#51032; &#49324;&#50857;&#51012; &#51648;&#50896;&#54633;&#45768;&#45796;.</p>
<p>&#51089;&#50629; &#48372;&#50504; &#47605;&#51008; &#49436;&#48660;&#47551; &#46608;&#45716; EJB &#51064;&#51613; &#51473;&#50640; &#48155;&#51008; &#51452;&#52404;&#47484; EIS&#50640;&#49436; &#49688;&#46973;&#54620; &#51064;&#51613;&#49436;&#50640; &#47588;&#54609;&#54616;&#45716; &#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#50640; &#45824;&#54620; &#48372;&#50504; &#47605;&#44284; &#45796;&#47493;&#45768;&#45796;. &#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#51032; &#48372;&#50504; &#47605;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="ref-connectorsecuritymaps.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400; &#48372;&#50504; &#47605;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
<p>EIS(Enterprise Information System)&#45716; &#51312;&#51649;&#51032; &#45936;&#51060;&#53552;&#47484; &#48372;&#44288;&#54616;&#45716; &#49884;&#49828;&#53596;&#51077;&#45768;&#45796;. &#51060;&#45716; &#47700;&#51064;&#54532;&#47112;&#51076;, &#47700;&#49884;&#51669; &#49884;&#49828;&#53596;, &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#49884;&#49828;&#53596; &#46608;&#45716; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51068; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>&#44033; &#51089;&#50629; &#48372;&#50504; &#47605;&#50640; &#45824;&#54644; &#51228;&#44277;&#46104;&#45716; &#51221;&#48372;&#45716; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#51060;&#47492;</dt>
<dd>
<p>&#51089;&#50629; &#48372;&#50504; &#47605;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
<p>&#51089;&#50629; &#48372;&#50504; &#47605; &#53580;&#51060;&#48660;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#46020; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#49352;&#47196; &#47564;&#46308;&#44592;</dt>
<dd>
<p>&#49352; &#51089;&#50629; &#48372;&#50504; &#47605;&#51012; &#49373;&#49457;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49325;&#51228;</dt>
<dd>
<p>&#49440;&#53469;&#54620; &#51089;&#50629; &#48372;&#50504; &#47605;&#51012; &#54616;&#45208; &#51060;&#49345; &#49325;&#51228;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref108" name="sthref108"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-worksecuritymapnew.html">&#51089;&#50629; &#48372;&#50504; &#47605;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">&#51089;&#50629; &#48372;&#50504; &#47605;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">&#51089;&#50629; &#48372;&#50504; &#47605;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref109" name="sthref109"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00021"><code>create-connector-work-security-map</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00160"><code>list-connector-work-security-maps</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00073"><code>delete-connector-work-security-map</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00253"><code>update-connector-work-security-map</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
