<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-connectorconnectionpoolnew" name="task-connectorconnectionpoolnew"></a></p>

<h4><a id="sthref9" name="sthref9"></a>&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</h4>
<a name="BEGIN" id="BEGIN"></a><a id="sthref10" name="sthref10"></a>
<h5>&#49884;&#51089;&#54616;&#44592; &#51204;&#50640;</h5>
<p>&#54400;&#51012; &#49373;&#49457;&#54616;&#44592; &#51204;&#50640; &#54400;&#44284; &#50672;&#44288;&#46108; &#52964;&#45349;&#53552; &#47784;&#46280;(&#47532;&#49548;&#49828; &#50612;&#45841;&#53552;)&#51012; &#48176;&#52824;&#54633;&#45768;&#45796;. &#49352; &#54400;&#50640; &#45824;&#54644; &#51648;&#51221;&#46104;&#45716; &#44050;&#51008; &#48176;&#52824;&#46108; &#52964;&#45349;&#53552; &#47784;&#46280;&#50640; &#46384;&#46972; &#45796;&#47493;&#45768;&#45796;.</p>
<ol>
<li>
<p>&#53456;&#49353; &#53944;&#47532;&#50640;&#49436; [&#47532;&#49548;&#49828;] &#45432;&#46300;&#47484; &#54869;&#51109;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#52964;&#45349;&#53552;] &#45432;&#46300;&#47484; &#54869;&#51109;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#52964;&#45349;&#53552;] &#45432;&#46300;&#50640;&#49436; [&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;] &#45432;&#46300;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>[&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;] &#54168;&#51060;&#51648;&#50640;&#49436; [&#45796;&#51020;]&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
<p>[&#49352; &#52964;&#45349;&#53552; &#51217;&#49549; &#54400;(&#45800;&#44228; 1/2)] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#54400; &#51060;&#47492;] &#54596;&#46300;&#50640; &#54400;&#51032; &#44256;&#50976;&#54620; &#51060;&#47492;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#52964;&#45349;&#53552; &#47532;&#49548;&#49828;&#47484; &#49373;&#49457;&#54624; &#46412; &#51060; &#51060;&#47492;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#47532;&#49548;&#49828; &#50612;&#45841;&#53552;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#48176;&#52824;&#46108; &#47532;&#49548;&#49828; &#50612;&#45841;&#53552;(&#52964;&#45349;&#53552; &#47784;&#46280;)&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51217;&#49549; &#51221;&#51032;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#50640; &#45824;&#54620; &#51217;&#49549; &#51221;&#51032;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#47785;&#47197;&#51032; &#49440;&#53469; &#54637;&#47785;&#51008; &#49440;&#53469;&#54620; &#47532;&#49548;&#49828; &#50612;&#45841;&#53552;&#50640; &#46384;&#46972; &#45796;&#47493;&#45768;&#45796;. &#51217;&#49549; &#51221;&#51032;&#45716; <code>ra.xml</code> &#54028;&#51068;&#50640;&#49436; &#47532;&#49548;&#49828; &#50612;&#45841;&#53552;&#51032; <code>connection-definition</code> &#50836;&#49548;&#47484; &#49885;&#48324;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#45796;&#51020;]&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
<p>[&#49352; &#52964;&#45349;&#53552; &#51217;&#49549; &#54400;(&#45800;&#44228; 2/2)] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#54609; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#47732; &#49373;&#49457; &#46608;&#45716; &#51116;&#44396;&#49457; &#51473;&#50640; &#51217;&#49549; &#54400;&#51012; &#54609;&#54616;&#50668; &#49549;&#49457;&#50640; &#45824;&#54620; &#47784;&#46304; &#50724;&#47448; &#44050;&#51012; &#49885;&#48324;&#54616;&#44256; &#44221;&#44256;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#49444;&#47749;] &#54596;&#46300;&#50640; &#51217;&#49549; &#54400;&#50640; &#45824;&#54620; &#49444;&#47749;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#52488;&#44592; &#48143; &#52572;&#49548; &#54400; &#53356;&#44592;] &#54596;&#46300;&#50640; &#54400;&#51032; &#52572;&#49548; &#51217;&#49549; &#49688;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; 8&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#52572;&#45824; &#54400; &#53356;&#44592;] &#54596;&#46300;&#50640; &#54400;&#51032; &#52572;&#45824; &#51217;&#49549; &#49688;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; 32&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#54400; &#53356;&#44592; &#51312;&#51221; &#44060;&#49688;] &#54596;&#46300;&#50640; &#54400; &#50976;&#55092; &#49884;&#44036; &#52488;&#44284;&#44032; &#47564;&#47308;&#46112; &#46412; &#51228;&#44144;&#54624; &#51217;&#49549; &#49688;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; 2&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#50976;&#55092; &#49884;&#44036; &#52488;&#44284;] &#54596;&#46300;&#50640; &#54400;&#50640;&#49436; &#51217;&#49549;&#51060; &#50976;&#55092; &#49345;&#53468;&#47196; &#50976;&#51648;&#46112; &#49688; &#51080;&#45716; &#52572;&#45824; &#49884;&#44036;(&#52488;)&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; 300&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#52572;&#45824; &#45824;&#44592; &#49884;&#44036;] &#54596;&#46300;&#50640; &#51217;&#49549;&#51012; &#50836;&#52397;&#54616;&#45716; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#51217;&#49549; &#49884;&#44036; &#52488;&#44284;&#44620;&#51648; &#45824;&#44592;&#54616;&#45716; &#49884;&#44036;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; 60000&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51217;&#49549; &#44160;&#51613; &#54596;&#50836;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#50668; &#51217;&#49549; &#44160;&#51613;&#51012; &#49324;&#50857;&#54616;&#46020;&#47197; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
<p>[&#54596;&#50836;] &#52404;&#53356; &#48149;&#49828;&#44032; &#49440;&#53469;&#46108; &#44221;&#50864; &#51217;&#49549;&#51012; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#51204;&#45804;&#54616;&#44592; &#51204;&#50640; &#47676;&#51200; &#44160;&#51613;&#54633;&#45768;&#45796;. &#47532;&#49548;&#49828;&#51032; &#44160;&#51613;&#51060; &#49892;&#54056;&#54616;&#47732; &#47532;&#49548;&#49828;&#44032; &#49325;&#51228;&#46104;&#44256;, &#49352; &#47532;&#49548;&#49828;&#44032; &#49373;&#49457;&#46108; &#54980; &#48152;&#54872;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#49892;&#54056; &#49884; &#47784;&#46304; &#51217;&#49549; &#45803;&#44592;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#50668; &#45800;&#51068; &#51217;&#49549;&#51060; &#49892;&#54056;&#54624; &#44221;&#50864; GlassFish Server&#50640;&#49436; &#54400;&#51032; &#47784;&#46304; &#51217;&#49549;&#51012; &#45803;&#51008; &#54980; &#51116;&#49444;&#51221;&#54616;&#46020;&#47197; &#54633;&#45768;&#45796;.</p>
<p>&#51060; &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#51648; &#50506;&#51004;&#47732; &#44060;&#48324; &#51217;&#49549;&#51012; &#49324;&#50857;&#54624; &#44221;&#50864;&#50640;&#47564; &#51217;&#49549;&#51060; &#45796;&#49884; &#49444;&#51221;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#53944;&#47004;&#51117;&#49496; &#51648;&#50896;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#51217;&#49549; &#54400;&#50640; &#45824;&#54620; &#53944;&#47004;&#51117;&#49496; &#51648;&#50896;&#51032; &#50976;&#54805;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#49440;&#53469;&#54620; &#53944;&#47004;&#51117;&#49496; &#51648;&#50896;&#51008; &#51060; &#51217;&#49549; &#54400;&#44284; &#50672;&#44288;&#46108; &#47532;&#49548;&#49828; &#50612;&#45841;&#53552;&#51032; &#53944;&#47004;&#51117;&#49496; &#51648;&#50896; &#49549;&#49457;&#51012; &#50669;&#54840;&#54872; &#48169;&#49885;&#51004;&#47196; &#45824;&#52404;&#54633;&#45768;&#45796;. &#51593;, &#47532;&#49548;&#49828; &#50612;&#45841;&#53552;&#50640; &#51648;&#51221;&#54620; &#47112;&#48296;&#48372;&#45796; &#45230;&#51008; &#53944;&#47004;&#51117;&#49496; &#47112;&#48296;&#51012; &#51648;&#50896;&#54616;&#44144;&#45208; &#47532;&#49548;&#49828; &#50612;&#45841;&#53552;&#50640;&#49436; &#51648;&#51221;&#54620; &#44163;&#44284; &#44057;&#51008; &#53944;&#47004;&#51117;&#49496; &#47112;&#48296;&#51012; &#51648;&#50896;&#54624; &#49688; &#51080;&#51648;&#47564; &#45908; &#45458;&#51008; &#47112;&#48296;&#51008; &#51648;&#51221;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.</p>
<p>&#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#49324;&#50857;&#54624; &#49688; &#51080;&#45716; &#50741;&#49496;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<ul>
<li>
<p>NoTransaction: &#47532;&#49548;&#49828; &#50612;&#45841;&#53552;&#44032; &#47532;&#49548;&#49828; &#44288;&#47532;&#51088; &#47196;&#52972; &#46608;&#45716; JTA &#53944;&#47004;&#51117;&#49496;&#51012; &#51648;&#50896;&#54616;&#51648; &#50506;&#51004;&#47728; XAResource &#46608;&#45716; LocalTransaction &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#44396;&#54788;&#54616;&#51648; &#50506;&#51020;&#51012; &#45208;&#53440;&#45253;&#45768;&#45796;.</p>
</li>
<li>
<p>LocalTransaction: &#47532;&#49548;&#49828; &#50612;&#45841;&#53552;&#44032; LocalTransaction &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#44396;&#54788;&#54616;&#50668; &#47196;&#52972; &#53944;&#47004;&#51117;&#49496;&#51012; &#51648;&#50896;&#54632;&#51012; &#45208;&#53440;&#45253;&#45768;&#45796;.</p>
<p>&#47196;&#52972; &#53944;&#47004;&#51117;&#49496;&#51008; &#47532;&#49548;&#49828; &#44288;&#47532;&#51088; &#45236;&#48512;&#47196; &#44288;&#47532;&#46104;&#47728; &#50808;&#48512; &#53944;&#47004;&#51117;&#49496; &#44288;&#47532;&#51088;&#47484; &#54252;&#54632;&#49884;&#53412;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>XATransaction: &#47532;&#49548;&#49828; &#50612;&#45841;&#53552;&#44032; LocalTransaction &#48143; XAResource &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#44396;&#54788;&#54616;&#50668; &#47532;&#49548;&#49828; &#44288;&#47532;&#51088; &#47196;&#52972; &#48143; JTA &#53944;&#47004;&#51117;&#49496;&#51012; &#51648;&#50896;&#54632;&#51012; &#45208;&#53440;&#45253;&#45768;&#45796;.</p>
<p>XA &#53944;&#47004;&#51117;&#49496;&#51008; &#47532;&#49548;&#49828; &#44288;&#47532;&#51088; &#50808;&#48512;&#50640; &#51080;&#45716; &#53944;&#47004;&#51117;&#49496; &#44288;&#47532;&#51088;&#44032; &#51228;&#50612; &#48143; &#51312;&#51221;&#54633;&#45768;&#45796;.</p>
</li>
</ul>
</li>
<li>
<p>[&#52628;&#44032; &#49549;&#49457;] &#49465;&#49496;&#50640;&#49436; &#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#49324;&#50857; &#44032;&#45733;&#54620; &#49549;&#49457;&#51008; &#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#51032; &#47532;&#49548;&#49828; &#50612;&#45841;&#53552;&#50640; &#46384;&#46972; &#45796;&#47493;&#45768;&#45796;.</p>
<p>&#49549;&#49457;&#51012; &#52628;&#44032;&#54616;&#47140;&#47732; [&#49549;&#49457; &#52628;&#44032;] &#45800;&#52628;&#47484; &#45572;&#47493;&#45768;&#45796;. &#48712; &#54665;&#51060; &#54364;&#49884;&#46104;&#47732; [&#51060;&#47492;] &#54596;&#46300;&#50640; &#49549;&#49457; &#51060;&#47492;&#51012; &#51077;&#47141;&#54616;&#44256; [&#44050;] &#54596;&#46300;&#50640; &#49549;&#49457;&#44050;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#49549;&#49457;&#51032; &#51060;&#47492;&#51008; &#51648;&#51221;&#54616;&#44256; &#44050;&#51008; &#51648;&#51221;&#54616;&#51648; &#50506;&#51004;&#47732; &#51217;&#49549; &#54400; &#49373;&#49457;&#51012; &#47560;&#52832; &#46412; &#49549;&#49457;&#51060; &#53580;&#51060;&#48660;&#50640;&#49436; &#51228;&#44144;&#46121;&#45768;&#45796;. &#51648;&#44552;&#51008; &#49549;&#49457;&#44050;&#51012; &#49444;&#51221;&#54616;&#51648; &#50506;&#51648;&#47564; &#45208;&#51473;&#50640; &#49444;&#51221;&#54624; &#49688; &#51080;&#46020;&#47197; &#49549;&#49457;&#51012; &#53580;&#51060;&#48660;&#50640; &#50976;&#51648;&#54616;&#47140;&#47732; [&#44050;] &#54596;&#46300;&#50640; &#51068;&#47144;&#51032; &#48712; &#44292;&#54840;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<pre>
()
</pre></li>
<li>
<p>[&#54869;&#51064;]&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
</li>
</ol>
<a id="sthref11" name="sthref11"></a>
<h5>&#44288;&#47144; &#54637;&#47785;</h5>
<ul>
<li>
<p><a href="task-connectorresourcenew.html">&#52964;&#45349;&#53552; &#47532;&#49548;&#49828;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-connectorresourceedit.html">&#52964;&#45349;&#53552; &#47532;&#49548;&#49828;&#47484; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-connectorresourcesdelete.html">&#52964;&#45349;&#53552; &#47532;&#49548;&#49828;&#47484; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400; &#44256;&#44553; &#49549;&#49457;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400; &#49549;&#49457;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#50640; &#45824;&#54620; &#48372;&#50504; &#47605;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#50640; &#45824;&#54620; &#48372;&#50504; &#47605;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#50640; &#45824;&#54620; &#48372;&#50504; &#47605;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">&#52964;&#45349;&#53552; &#51217;&#49549; &#54400;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-setupeisaccess.html">EIS &#50529;&#49464;&#49828;&#47484; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-adminobjectnew.html">&#44288;&#47532; &#44061;&#52404; &#47532;&#49548;&#49828;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-adminobjectedit.html">&#44288;&#47532; &#44061;&#52404; &#47532;&#49548;&#49828;&#47484; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-administeredobjectresourcedelete.html">&#44288;&#47532; &#44061;&#52404; &#47532;&#49548;&#49828;&#47484; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-worksecuritymapnew.html">&#51089;&#50629; &#48372;&#50504; &#47605;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">&#51089;&#50629; &#48372;&#50504; &#47605;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">&#51089;&#50629; &#48372;&#50504; &#47605;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
