<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-ejbgeneral" name="task-ejbgeneral"></a></p>

<h4><a id="sthref2" name="sthref2"></a><a id="sthref3" name="sthref3"></a>So werden EJB-Einstellungen konfiguriert</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>W&auml;hlen Sie in der Navigationsbaumstruktur den Knoten "Konfiguration".</p>
</li>
<li>
<p>W&auml;hlen Sie den Knoten "EJB-Container".</p>
<p>Die Seite "Enterprise Java Beans (EJB)" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Geben Sie im Feld "Sessionspeicherverzeichnis" einen neuen Wert f&uuml;r das Sessionspeicherverzeichnis ein.</p>
<p>Dieses Feld gibt das Verzeichnis an, in dem passivierte Stateful Session-Beans und persistente SFSB-Checkpoint-Status im Dateisystem gespeichert werden. Der Standardwert ist <code>${com.sun.aas.instanceRoot}/session-store</code>.</p>
<p>Passivierte Beans sind Stateful Session-Beans, deren Status in eine Datei auf dem Dateisystem geschrieben wurde. Passivierte Beans befinden sich typischerweise f&uuml;r eine bestimmte Zeitspanne im Leerlauf und es wird nicht durch einen Client auf sie zugegriffen. Persistente SFSB-Checkpoint-Status sind individuelle SFSBs, deren Status in eine Datei auf dem Dateisystem geschrieben wurde.</p>
<p>Diese Einstellung gilt nur dann f&uuml;r SFSB-Checkpoint-Status, wenn die EJB-Container-Verf&uuml;gbarkeit deaktiviert ist. Informationen zum Deaktivieren der Verf&uuml;gbarkeit finden Sie unter <a href="../../../ejb/en/help/task-ejbcontaineravailability.html">So werden Verf&uuml;gbarkeitseinstellungen f&uuml;r den EJB-Container konfiguriert</a>.</p>
</li>
<li>
<p>Aktivieren Sie das Optionsfeld "Option B" oder "Option C", um die Commit-Option festzulegen.</p>
<p>Die Commit-Option gibt an, wie der Container passivierte Bean-Instanzen zwischen Transaktionen cacht.</p>
<ul>
<li>
<p>Wenn Sie "Option B" (Standardeinstellung) w&auml;hlen, cacht der Container eine bereite Instanz zwischen Transaktionen.</p>
</li>
<li>
<p>Wenn Sie "Option C" w&auml;hlen, wird vom Container keine bereite Instanz zwischen Transaktionen gecacht.</p>
</li>
</ul>
</li>
<li>
<p>Geben Sie im Feld "Urspr&uuml;ngliche und minimale Poolgr&ouml;&szlig;e" die Mindestanzahl an Beans ein, die im Pool enthalten sein sollen.</p>
<p>Der Standardwert ist 0.</p>
</li>
<li>
<p>Geben Sie im Feld "Maximale Poolgr&ouml;&szlig;e" die maximale Anzahl an Beans ein, die der Container parallel im Pool verwalten kann.</p>
<p>Der Standardwert ist 32.</p>
</li>
<li>
<p>Geben Sie im Feld "Umfang der Gr&ouml;&szlig;en&auml;nderungen des Pools" die Anzahl an Beans ein, die aus dem Pool entfernt werden, wenn sie sich l&auml;nger als im Feld "Poolleerlaufzeit" angegeben im Leerlauf befinden.</p>
<p>Der Wert muss gr&ouml;&szlig;er oder gleich 0 und kleiner als der Wert f&uuml;r die maximale Poolgr&ouml;&szlig;e sein. Der Standardwert ist 8.</p>
</li>
<li>
<p>Geben Sie im Feld "Poolleerlaufzeit" die Zeit in Sekunden an, die sich ein Bean im Pool im Leerlauf befinden kann, bevor es aus dem Pool entfernt wird.</p>
<p>Nach diesem Zeitraum wird das Bean endg&uuml;ltig gel&ouml;scht. Der Wert 0 bedeutet, dass sich ein Bean zeitlich unbegrenzt im Leerlauf befinden kann. Der Standardwert ist 600.</p>
</li>
<li>
<p>Geben Sie im Feld "Maximale Cachegr&ouml;&szlig;e" die maximale Anzahl an Beans ein, die im Cache vorhanden sein k&ouml;nnen.</p>
<p>Erh&ouml;hen Sie die maximale Anzahl an Beans, die gecacht werden, um den Overhead f&uuml;r das Erstellen und endg&uuml;ltige L&ouml;schen von Beans zu reduzieren. Beachten Sie jedoch, dass die Erh&ouml;hung des Cachewerts dazu f&uuml;hrt, dass der Server mehr Arbeitsspeicher und Ressourcen belegt. Stellen Sie sicher, dass die Betriebsumgebung die gew&auml;hlten Cacheeinstellungen unterst&uuml;tzt. Der Wert 0 bedeutet einen nicht gebundenen Cache. Der Standardwert ist 512.</p>
</li>
<li>
<p>Geben Sie im Feld "Umfang der Gr&ouml;&szlig;en&auml;nderungen des Cache" die Anzahl an Beans, die passiviert werden sollen, wenn der Cache voll ist.</p>
<p>Wenn die maximale Anzahl an gecachten Beans erreicht ist, entfernt der Container eine bestimmte Anzahl an passivierten Beans aus dem Backupspeicher. Dieser Wert gibt zudem die Anzahl der Beans an, die erstellt werden m&uuml;ssen, wenn eine Anforderung eingeht und im Pool keine Beans verf&uuml;gbar sind. Der Wert muss gr&ouml;&szlig;er als 1 und kleiner als der Wert f&uuml;r die maximale Cachegr&ouml;&szlig;e sein. Der Standardwert ist 32.</p>
</li>
<li>
<p>Geben Sie im Feld "Timeout beim Entfernen" die Anzahl Sekunden ein, nach der ein passiviertes Bean aus dem Sessionspeicher entfernt wird.</p>
<p>Der Wert 0 bedeutet, dass inaktive Beans vom Container nicht automatisch entfernt werden. Wenn der Wert f&uuml;r das Timeout beim Entfernen kleiner oder gleich dem Wert f&uuml;r die Cacheleerlaufzeit ist, werden Beans ohne Passivieren sofort entfernt. Der Standardwert ist 5400.</p>
</li>
<li>
<p>W&auml;hlen Sie in der Liste "Policy f&uuml;r Auswahl beim Entfernen" die Policy, gem&auml;&szlig; der der Container Stateful Session-Beans aus dem Cache entfernt.</p>
<p>Folgende Optionen stehen zur Auswahl:</p>
<dl>
<dt>Nicht in j&uuml;ngerer Zeit verwendet</dt>
<dd>
<p>(Standardwert) Entfernt ein Bean, das in letzter Zeit nicht verwendet wurde.</p>
</dd>
<dt>First In First Out (FIFO)</dt>
<dd>
<p>Entfernt das &auml;lteste Bean im Cache.</p>
</dd>
<dt>Zuletzt verwendet (Least Recently Used (LRU))</dt>
<dd>
<p>Entfernt das zuletzt verwendete Bean.</p>
</dd>
</dl>
</li>
<li>
<p>Geben Sie im Feld "Cacheleerlaufzeit" die maximale Anzahl Sekunden ein, die ein Bean im Cache im Leerlauf verbleiben kann.</p>
<p>Nach diesem Zeitraum kann der Container dieses Bean passivieren. Der Wert 0 bedeutet, dass Beans nie f&uuml;r eine Passivierung in Frage kommen. Der Standardwert ist 600.</p>
</li>
<li>
<p>Geben Sie im Abschnitt "Weitere Eigenschaften" weitere Eigenschaften an.</p>
<p>Eine Beschreibung der verf&uuml;gbaren Eigenschaften finden Sie unter <a href="ref-ejbgeneralproperties.html">F&uuml;r den EJB-Container spezifische Eigenschaften</a>.</p>
<ul>
<li>
<p>Um eine Eigenschaft hinzuzuf&uuml;gen, klicken Sie auf die Schaltfl&auml;che "Eigenschaft hinzuf&uuml;gen". Geben Sie in die daraufhin angezeigte leere Zeile den Eigenschaftsnamen in das Feld "Name" und den Eigenschaftswert in das Feld "Wert" ein.</p>
</li>
<li>
<p>Um eine Eigenschaft zu &auml;ndern, bearbeiten Sie das Feld "Wert" dieser Eigenschaft.</p>
</li>
<li>
<p>Um eine Eigenschaft zu l&ouml;schen, aktivieren Sie das Kontrollk&auml;stchen links neben dem Feld "Name" der zu l&ouml;schenden Eigenschaft und klicken anschlie&szlig;end auf die Schaltfl&auml;che "Eigenschaften l&ouml;schen".</p>
</li>
</ul>
</li>
<li>
<p>Klicken Sie auf "Speichern".</p>

<hr>
<p><b>Tipp:</b></p>
Um zu den Standardeinstellungen zur&uuml;ckzukehren, klicken Sie auf die Schaltfl&auml;che "Standardwerte laden" und anschlie&szlig;end auf "Speichern".
<hr>

</li>
<li>
<p>Starten Sie GlassFish Server neu.</p>
</li>
</ol>
<a id="sthref4" name="sthref4"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="../../../ejb/en/help/task-ejbmdbpoolsettings.html">So werden MDB-Pooleinstellungen konfiguriert</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbtimerservice.html">So wird der EJB-Timerservice konfiguriert</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbcontaineravailability.html">So werden Verf&uuml;gbarkeitseinstellungen f&uuml;r den EJB-Container konfiguriert</a></p>
</li>
</ul>




<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
