<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-transactionsvcproperties" name="ref-transactionsvcproperties"></a><a id="GHJTS00003" name="GHJTS00003"></a></p>

<h4><a id="sthref16" name="sthref16"></a><a id="sthref17" name="sthref17"></a>Propri&eacute;t&eacute;s propres au service de transaction</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Les propri&eacute;t&eacute;s suivantes sont disponibles pour la configuration du service de transaction.</p>
<dl>
<dt><code>oracle-xa-recovery-workaround</code></dt>
<dd>
<p>Si cette propri&eacute;t&eacute; a la valeur <code>true</code>, la solution de contournement Oracle XA Resource est utilis&eacute;e pour la r&eacute;cup&eacute;ration des transactions. La valeur par d&eacute;faut est <code>true</code>.</p>
</dd>
<dt><code>disable-distributed-transaction-logging</code></dt>
<dd>
<p>Si cette propri&eacute;t&eacute; a la valeur <code>true</code>, la journalisation des transactions est d&eacute;sactiv&eacute;e, ce qui peut am&eacute;liorer les performances. Si la case Activ&eacute; du champ Au red&eacute;marrage est coch&eacute;e, cette propri&eacute;t&eacute; est ignor&eacute;e. La valeur par d&eacute;faut est <code>false</code>.</p>
</dd>
<dt><code>xaresource-txn-timeout</code></dt>
<dd>
<p>Modifie la temporisation de <code>XAResource</code>. Dans certains cas, la valeur d'expiration par d&eacute;faut de <code>XAResource</code> peut entra&icirc;ner l'abandon des transactions, il est donc pr&eacute;f&eacute;rable de la modifier. La valeur par d&eacute;faut d&eacute;pend de l'&eacute;l&eacute;ment <code>XAResource</code> utilis&eacute;.</p>
</dd>
<dt><code>pending-txn-cleanup-interval</code></dt>
<dd>
<p>Sp&eacute;cifie l'intervalle, en secondes, auquel un thread asynchrone v&eacute;rifie les transactions en attente et les termine. Si cette propri&eacute;t&eacute; n'est pas sp&eacute;cifi&eacute;e, il n'y a pas de valeur par d&eacute;faut. Si cette propri&eacute;t&eacute; est pr&eacute;sente mais n'a pas de valeur, la valeur par d&eacute;faut est 60.</p>
</dd>
<dt><code>use-last-agent-optimization</code></dt>
<dd>
<p>Si cette propri&eacute;t&eacute; a la valeur <code>true</code>, l'optimisation du dernier agent est activ&eacute;e, ce qui am&eacute;liore la capacit&eacute; de traitement des transactions. Si une ressource non-XA est utilis&eacute;e avec des ressources XA dans la m&ecirc;me transaction, la ressource non-XA est le dernier agent. La valeur par d&eacute;faut est <code>true</code>.</p>
</dd>
<dt><code>delegated-recovery</code></dt>
<dd>
<p>Si cette propri&eacute;t&eacute; a la valeur <code>true</code>, la r&eacute;cup&eacute;ration d&eacute;l&eacute;gu&eacute;e &agrave; l'&eacute;chelle du cluster est activ&eacute;e. La valeur par d&eacute;faut est False.</p>
</dd>
<dt><code>wait-time-before-recovery-insec</code></dt>
<dd>
<p>Sp&eacute;cifie le d&eacute;lai d'attente, en secondes, au-del&agrave; duquel une instance lance la r&eacute;cup&eacute;ration d'une instance bloqu&eacute;e.</p>
</dd>
<dt><code>db-logging-resource</code></dt>
<dd>
<p>Sp&eacute;cifie le nom JNDI de la ressource JDBC pour la base de donn&eacute;es dans laquelle les transactions sont journalis&eacute;es. Pour plus d'informations, reportez-vous au <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDVG00018">chapitre 17, <i>Using the Transaction Service</i>, du manuel <i>Oracle GlassFish Server Application Development Guide</i></a>. Il n'y a pas de valeur par d&eacute;faut.</p>
</dd>
<dt><code>xa-servername</code></dt>
<dd>
<p>Sp&eacute;cifie le nom d'h&ocirc;te utilis&eacute; par le service de transaction pour identifier les transactions g&eacute;r&eacute;es par le serveur GlassFish Server install&eacute;. Cela peut parfois s'av&eacute;rer utile pour la r&eacute;cup&eacute;ration de transactions &agrave; partir d'un fichier journal cr&eacute;&eacute; sur un h&ocirc;te diff&eacute;rent ex&eacute;cutant GlassFish Server.</p>
</dd>
</dl>




<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
