<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-settranstimeout" name="task-settranstimeout"></a></p>

<h4><a id="sthref6" name="sthref6"></a>D&eacute;finition d'une valeur de temporisation de transaction</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Par d&eacute;faut, le serveur n'applique aucune temporisation aux transactions. Le serveur attend ind&eacute;finiment l'ex&eacute;cution de la transaction. Si vous avez d&eacute;fini une valeur de temporisation pour les transactions et qu'une transaction n'est pas termin&eacute;e dans le d&eacute;lai configur&eacute;, celle-ci est annul&eacute;e (rollback) par GlassFish Server.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Configuration.</p>
</li>
<li>
<p>S&eacute;lectionnez l'instance &agrave; configurer :</p>
<ul>
<li>
<p>Pour configurer une instance sp&eacute;cifique, s&eacute;lectionnez le noeud de configuration de l'instance. Par exemple, pour l'instance par d&eacute;faut, <code>server</code>, s&eacute;lectionnez le noeud <code>server-config</code>.</p>
</li>
<li>
<p>Pour configurer les param&egrave;tres par d&eacute;faut pour toutes les instances, s&eacute;lectionnez le noeud <code>default-config</code>.</p>
</li>
</ul>
</li>
<li>
<p>S&eacute;lectionnez le noeud Service de transaction.</p>
<p>La page Service de transaction appara&icirc;t.</p>
</li>
<li>
<p>Dans le champ Expiration de transaction, saisissez le nombre de secondes devant s'&eacute;couler avant la temporisation de la transaction.</p>
<p>La valeur par d&eacute;faut est 0. Cette valeur d&eacute;sactive la temporisation des transactions.</p>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>
</li>
<li>
<p>Red&eacute;marrez GlassFish Server.</p>
</li>
</ol>
<a id="sthref7" name="sthref7"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-configtransservice.html">Configuration du service de transaction</a></p>
</li>
<li>
<p><a href="task-configtransrecovery.html">Configuration de la r&eacute;cup&eacute;ration des transactions par GlassFish Server</a></p>
</li>
<li>
<p><a href="task-settranslog.html">D&eacute;finition de l'emplacement des journaux des transactions</a></p>
</li>
<li>
<p><a href="task-setkeyptinterval.html">D&eacute;finition de l'intervalle entre points cl&eacute;s</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
