<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-settranslog" name="task-settranslog"></a><a id="GHJTS00007" name="GHJTS00007"></a></p>

<h4><a id="sthref8" name="sthref8"></a><a id="sthref9" name="sthref9"></a>D&eacute;finition de l'emplacement des journaux des transactions</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Les journaux des transactions enregistrent les informations sur chaque transaction afin de garantir l'int&eacute;grit&eacute; des donn&eacute;es des ressources impliqu&eacute;es et de r&eacute;cup&eacute;rer les donn&eacute;es en cas de panne. Les journaux des transactions sont conserv&eacute;s dans le sous-r&eacute;pertoire <code>tx</code> du r&eacute;pertoire sp&eacute;cifi&eacute; dans le champ Emplacement des journaux des transactions. Ces journaux ne sont pas lisibles par l'homme.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Configuration.</p>
</li>
<li>
<p>S&eacute;lectionnez l'instance &agrave; configurer :</p>
<ul>
<li>
<p>Pour configurer une instance sp&eacute;cifique, s&eacute;lectionnez le noeud de configuration de l'instance. Par exemple, pour l'instance par d&eacute;faut, <code>server</code>, s&eacute;lectionnez le noeud <code>server-config</code>.</p>
</li>
<li>
<p>Pour configurer les param&egrave;tres par d&eacute;faut pour toutes les instances, s&eacute;lectionnez le noeud <code>default-config</code>.</p>
</li>
</ul>
</li>
<li>
<p>S&eacute;lectionnez le noeud Service de transaction.</p>
<p>La page Service de transaction appara&icirc;t.</p>
</li>
<li>
<p>Dans le champ Emplacement des journaux des transactions, saisissez l'emplacement des journaux des transactions.</p>
<p>Un sous-r&eacute;pertoire <code>tx</code> est cr&eacute;&eacute; pour y conserver les journaux des transactions.</p>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>
</li>
</ol>
<a id="sthref10" name="sthref10"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-configtransservice.html">Configuration du service de transaction</a></p>
</li>
<li>
<p><a href="task-configtransrecovery.html">Configuration de la r&eacute;cup&eacute;ration des transactions par GlassFish Server</a></p>
</li>
<li>
<p><a href="task-settranstimeout.html">D&eacute;finition d'une valeur de temporisation de transaction</a></p>
</li>
<li>
<p><a href="task-setkeyptinterval.html">D&eacute;finition de l'intervalle entre points cl&eacute;s</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
