<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-setkeyptinterval" name="task-setkeyptinterval"></a></p>

<h4><a id="sthref11" name="sthref11"></a><a id="sthref12" name="sthref12"></a>D&eacute;finition de l'intervalle entre points cl&eacute;s</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Les op&eacute;rations de point cl&eacute; permettent de compresser les fichiers journaux des transactions. L'intervalle entre points cl&eacute;s d&eacute;signe le nombre de transactions effectu&eacute;es entre les op&eacute;rations de point cl&eacute; dans le journal. Les op&eacute;rations de point cl&eacute; permettent de r&eacute;duire la taille des fichiers journaux des transactions. Plus le nombre d'intervalles entre points cl&eacute;s est &eacute;lev&eacute;, plus la taille des fichiers journaux est importante, ce qui peut alt&eacute;rer les performances. Un nombre plus faible d'intervalles entre points cl&eacute;s (par exemple, 256) g&eacute;n&egrave;re des fichiers journaux plus petits, mais diminue l&eacute;g&egrave;rement les performances en raison du plus grand nombre d'op&eacute;rations de point cl&eacute;.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Configuration.</p>
</li>
<li>
<p>S&eacute;lectionnez l'instance &agrave; configurer :</p>
<ul>
<li>
<p>Pour configurer une instance sp&eacute;cifique, s&eacute;lectionnez le noeud de configuration de l'instance. Par exemple, pour l'instance par d&eacute;faut, <code>server</code>, s&eacute;lectionnez le noeud <code>server-config</code>.</p>
</li>
<li>
<p>Pour configurer les param&egrave;tres par d&eacute;faut pour toutes les instances, s&eacute;lectionnez le noeud <code>default-config</code>.</p>
</li>
</ul>
</li>
<li>
<p>S&eacute;lectionnez le noeud Service de transaction.</p>
<p>La page Service de transaction appara&icirc;t.</p>
</li>
<li>
<p>Dans le champ Intervalle de point cl&eacute;, saisissez le nombre de transactions entre les op&eacute;rations de point cl&eacute;.</p>
<p>La valeur par d&eacute;faut est 65 536.</p>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>
</li>
</ol>
<a id="sthref13" name="sthref13"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-configtransservice.html">Configuration du service de transaction</a></p>
</li>
<li>
<p><a href="task-configtransrecovery.html">Configuration de la r&eacute;cup&eacute;ration des transactions par GlassFish Server</a></p>
</li>
<li>
<p><a href="task-settranstimeout.html">D&eacute;finition d'une valeur de temporisation de transaction</a></p>
</li>
<li>
<p><a href="task-settranslog.html">D&eacute;finition de l'emplacement des journaux des transactions</a></p>
</li>
</ul>




<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
