<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-configtransservice" name="task-configtransservice"></a></p>

<h4><a id="sthref2" name="sthref2"></a>Configuration du service de transaction</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Configuration.</p>
</li>
<li>
<p>S&eacute;lectionnez l'instance &agrave; configurer :</p>
<ul>
<li>
<p>Pour configurer une instance sp&eacute;cifique, s&eacute;lectionnez le noeud de configuration de l'instance. Par exemple, pour l'instance par d&eacute;faut, <code>server</code>, s&eacute;lectionnez le noeud <code>server-config</code>.</p>
</li>
<li>
<p>Pour configurer les param&egrave;tres par d&eacute;faut pour toutes les instances, s&eacute;lectionnez le noeud <code>default-config</code>.</p>
</li>
</ul>
</li>
<li>
<p>S&eacute;lectionnez le noeud Service de transaction.</p>
<p>La page Service de transaction appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Service de transaction, cochez la case Au red&eacute;marrage pour activer la r&eacute;cup&eacute;ration des transactions incompl&egrave;tes au red&eacute;marrage du serveur.</p>
<p>Cette option est d&eacute;sactiv&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Dans le champ Expiration de transaction, entrez la dur&eacute;e d'attente (en secondes) du serveur avant d'annuler (rollback) une transaction qui n'a pas &eacute;t&eacute; termin&eacute;e.</p>
<p>La valeur 0 d&eacute;sactive la temporisation des transactions. La valeur par d&eacute;faut est 0. Elle signifie que le serveur attend la fin d'une transaction pendant une dur&eacute;e ind&eacute;termin&eacute;e.</p>
</li>
<li>
<p>Dans le champ Expiration des tentatives, saisissez le nombre de secondes pendant lesquelles GlassFish Server tente de se connecter &agrave; un serveur inaccessible.</p>
<p>La valeur par d&eacute;faut est 600 (10 minutes).</p>
</li>
<li>
<p>Dans le champ Emplacement des journaux des transactions, entrez le nom du r&eacute;pertoire dans lequel sont conserv&eacute;s les journaux de serveur.</p>
<p>Les journaux de transaction sont conserv&eacute;s dans le sous-r&eacute;pertoire <code>tx</code> du r&eacute;pertoire sp&eacute;cifi&eacute; dans ce champ. La valeur par d&eacute;faut correspond au r&eacute;pertoire sp&eacute;cifi&eacute; dans le champ Racine journal de la page Attributs de domaine, qui se trouve dans l'onglet Avanc&eacute; du noeud GlassFish Server.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante D&eacute;cision heuristique, s&eacute;lectionnez la r&egrave;gle &agrave; suivre lorsque le r&eacute;sultat d'une transaction distribu&eacute;e ne peut pas &ecirc;tre d&eacute;termin&eacute; en raison de l'inaccessibilit&eacute; d'autres participants.</p>
<p>A moins d'avoir une bonne raison de s&eacute;lectionner Valider, laissez l'option D&eacute;cision heuristique d&eacute;finie sur Annuler (par d&eacute;faut). La validation (commit) des transactions ind&eacute;termin&eacute;es risque de compromettre l'int&eacute;grit&eacute; des donn&eacute;es dans votre application.</p>
</li>
<li>
<p>Dans le champ Intervalle de point cl&eacute;, saisissez le nombre de transactions entre les op&eacute;rations de point cl&eacute;.</p>
<p>Les op&eacute;rations de point cl&eacute; permettent de compresser les fichiers journaux des transactions. La valeur par d&eacute;faut est 65 536.</p>
</li>
<li>
<p>Dans la section Autres propri&eacute;t&eacute;s, sp&eacute;cifiez les propri&eacute;t&eacute;s suppl&eacute;mentaires.</p>
<p>Pour obtenir une description des propri&eacute;t&eacute;s disponibles, reportez-vous &agrave; <a href="ref-transactionsvcproperties.html">Propri&eacute;t&eacute;s propres au service de transaction</a>.</p>
<ul>
<li>
<p>Pour ajouter une propri&eacute;t&eacute;, cliquez sur le bouton Ajouter une propri&eacute;t&eacute;. Sur la ligne vide qui appara&icirc;t, saisissez le nom de la propri&eacute;t&eacute; dans le champ Nom et la valeur de la propri&eacute;t&eacute; dans le champ Valeur.</p>
</li>
<li>
<p>Pour modifier une propri&eacute;t&eacute;, modifiez le champ Valeur de cette propri&eacute;t&eacute;.</p>
</li>
<li>
<p>Pour supprimer une propri&eacute;t&eacute;, s&eacute;lectionnez la case situ&eacute;e &agrave; gauche du champ Nom de la propri&eacute;t&eacute; &agrave; supprimer, puis cliquez sur le bouton Supprimer des propri&eacute;t&eacute;s.</p>
</li>
</ul>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>

<hr>
<p><b>Conseil:</b></p>
Pour revenir aux param&egrave;tres par d&eacute;faut, cliquez sur le bouton Charger les valeurs par d&eacute;faut, puis sur Enregistrer.
<hr>

</li>
<li>
<p>Red&eacute;marrez GlassFish Server.</p>
</li>
</ol>
<a id="sthref3" name="sthref3"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-configtransrecovery.html">Configuration de la r&eacute;cup&eacute;ration des transactions par GlassFish Server</a></p>
</li>
<li>
<p><a href="task-settranstimeout.html">D&eacute;finition d'une valeur de temporisation de transaction</a></p>
</li>
<li>
<p><a href="task-settranslog.html">D&eacute;finition de l'emplacement des journaux des transactions</a></p>
</li>
<li>
<p><a href="task-setkeyptinterval.html">D&eacute;finition de l'intervalle entre points cl&eacute;s</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
