<!DOCTYPE html PUBLIC "-//Tigris//DTD XHTML 1.0 Transitional//EN" "http://style.tigris.org/nonav/tigris_transitional.dtd">

<html>

<head>
<!-- Inserted by TRADOS: --><META HTTP-EQUIV="content-type" CONTENT="text/html; charset=windows-1252">

  <link rel="SHORTCUT ICON" href="../image/glassfish_favicon.gif">

  <title>D&eacute;veloppeurs de GlassFish</title>

</head>

<body>
<div class="app">
<p>
Si vous &ecirc;tes d&eacute;veloppeur et que vous souhaitez faire partie de la communaut&eacute; ayant impl&eacute;ment&eacute; le premier serveur d'application compatible Java EE 5, alors rejoignez le projet GlassFish.

<p>
Nous encourageons les membres de la communaut&eacute; GlassFish &agrave; s'enregistrer sur la <a href="http://wiki.java.net/bin/view/Projects/GlassFishPeoplePage">page des membres</a> autonome de notre site wiki.

Nous proposons &eacute;galement une autre page, conviviale et en constante &eacute;volution, utilis&eacute;e pour <a href="developers.html">pr&eacute;senter les d&eacute;veloppeurs</a>.
</p>

<h3>Compr&eacute;hension du code</h3>

<p>
Le d&eacute;veloppement d'un serveur d'application est un processus complexe. Voici une liste des liens nous aidant &agrave; organiser la mise en &oelig;uvre d'un projet d'une telle envergure.

<ul>

  <li>Le projet GlassFish se divise en <a   href="https://glassfish.dev.java.net/public/ServerModules.html">modules</a><br>

  </li>

  <li>Consultez les <a   href="https://glassfish.dev.java.net/nonav/javaee5/api/index.html">documents Java</a>

mis &agrave; jour pour chaque version promue</li>

  <li><a   href="https://glassfish.dev.java.net/servlets/ProjectMailingListList">Discutez

avec d'autres d&eacute;veloppeurs de GlassFish</a> &agrave; propos des d&eacute;tails d'impl&eacute;mentation sur

nos listes de diffusion. N'oubliez pas

de vous identifier pour pouvoir visualiser toutes les listes de diffusion disponibles.</li>

  <li>Consultez la liste des <a   href="https://glassfish.dev.java.net/public/GuidelinesandConventions.html#Module_Owners">propri&eacute;taires de

module</a></li>

  <li>D&eacute;couvrez les <a   href="https://glassfish.dev.java.net/public/ServerModules.html#Related_GlassFish_Technologies_">technologies

associ&eacute;es</a> faisant partie du projet GlassFish<br>

  </li>

</ul>

<h3>Construction</h3>

<p>
L'infrastructure de construction de GlassFish utilise Maven et Ant. Nous recherchons actuellement des d&eacute;veloppeurs pouvant nous aider &agrave; am&eacute;liorer l'infrastructure de construction de mani&egrave;re &agrave; &ecirc;tre moins d&eacute;pendant de Ant.

<ul>

  <li>Le <a   href="http://wiki.glassfish.java.net/Wiki.jsp?page=BuildInformation#qs">guide de

d&eacute;marrage rapide</a> propose une courte liste d'&eacute;tapes n&eacute;cessaires &agrave; la construction du serveur</li>

  <li>Les <a   href="BuildGlassFish.html#Complete_Instructions_on_how_to_Build">instructions

compl&egrave;tes</a> pr&eacute;sentent en d&eacute;tails la proc&eacute;dure de construction de GlassFish<br>

  </li>

</ul>

<h3>Test</h3>

<p>GlassFish propose plusieurs tests de diff&eacute;rents types.  Les tests QuickLook sont rapides et couvrent un vaste ensemble de fonctionnalit&eacute;s dans le serveur d'application. Des tests d&eacute;veloppeur sont &eacute;galement disponibles pour les diff&eacute;rents modules. Chaque module comporte de plus amples informations sur le mode d'ex&eacute;cution de ces tests.</p>

<p>Pour plus d'informations, reportez-vous au <a href="http://wiki.java.net/bin/view/Projects/GlassFishQuality">portail qualit&eacute; de GlassFish</a>.</p>

<ul>

  <li><a   href="https://glassfish.dev.java.net/public/downloadsindex.html">T&eacute;l&eacute;chargez</a>

un nightly build ou une version promue</li>

  <li>Ex&eacute;cutez les <a   href="https://glassfish.dev.java.net/public/GuidelinesandConventions.html#Quicklook_Tests">tests

QuickLook</a></li>

  <li>Rejoignez le <a href="http://wiki.java.net/bin/view/Projects/CATfish">programme

CATfish</a><br>

  </li>

  <li><a   href="https://glassfish.dev.java.net/public/NewtoGlassFish.html#Submit_a_Bug">Signalez

un bogue</a></li>

</ul>

<h3>Participation au code</h3>

<p>
Vous pouvez participer au projet GlassFish de diverses mani&egrave;res : en apportant des r&eacute;solutions de bogues, des am&eacute;liorations, de nouvelles fonctionnalit&eacute;s, voire m&ecirc;me des modules complets.

<ul>

  <li>Tous les intervenants doivent signer et retourner un <a href="https://glassfish.dev.java.net/public/GovernancePolicy.html#SCA_Policy">accord de participation</a></li>

  <li>Consultez notre <a href="https://glassfish.dev.java.net/public/GovernancePolicy.html">politique de gouvernance </a>pour obtenir de plus amples informations sur les r&ocirc;les et responsabilit&eacute;s </li>

  <li>Le code extrait dans l'espace de travail doit respecter les <a href="https://glassfish.dev.java.net/public/GuidelinesandConventions.html#Coding_Conventions">conventions de code</a></li>

  <li>Si vous ne disposez pas encore de r&ocirc;le d&eacute;veloppeur, reportez-vous au <a href="https://glassfish.dev.java.net/public/GuidelinesandConventions.html#Submit_a_Patch">processus de transfert de patch</a></li>

  <li>Les d&eacute;veloppeurs doivent respecter les <a href="https://glassfish.dev.java.net/public/GuidelinesandConventions.html#Commit_Procedures">proc&eacute;dures de validation</a> lors de la mise &agrave; jour de l'espace de travail</li>
</ul>

<h3>Participation aux exemples</h3>

<p>
Nous sommes toujours heureux de recevoir des exemples de bonne qualit&eacute; d&eacute;montrant une fonctionnalit&eacute; ou un aspect de GlassFish ou de la technologie Java EE 5. Rejoignez le <a href="glassfish-samples.dev.java.net">projet d'exemples de GlassFish </a> et observez les effets positifs de votre participation.

<p>
Consultez cette page pour d&eacute;couvrir <a href="https://glassfish-samples.dev.java.net/new_samples.html">les besoins d'exemple dans diff&eacute;rents domaines</a>

Reportez-vous &eacute;galement au <a href="blueprints.dev.java.net">projet Java Blueprints</a> pour observer les diverses contributions &agrave; une meilleure utilisation des applications.

<p>
Tous les intervenants doivent signer et retourner un <a href="https://glassfish.dev.java.net/public/GovernancePolicy.html#SCA_Policy">accord de participation</a>



<h3>Documentation</h3>

<p>
Un produit de qualit&eacute; n'existe pas sans une documentation compl&egrave;te.  Les premi&egrave;res versions des divers manuels sont d&eacute;sormais disponibles pour une r&eacute;vision.

<p>
Consultez la <a  href="http://glassfish.dev.java.net/javaee5/docs/DocsIndex.html">page de documentation</a> pour obtenir plus de d&eacute;tails sur ces divers ouvrages. En outre, reportez-vous &agrave; la <a href="TipsandBlogs.html">liste croissante d'astuces et de blogs techniques</a> pour obtenir des exemples.  Tout commentaire sera le bienvenu.

</div>

</body>

</html>

