<!DOCTYPE html PUBLIC "-//Tigris//DTD XHTML 1.0 Transitional//EN" "http://style.tigris.org/nonav/tigris_transitional.dtd">
<html>
<head>
  <link rel="SHORTCUT ICON" href="../image/glassfish_favicon.gif">
  <title>Utilisateurs et d&eacute;veloppeurs d'application GlassFish</title>
  <meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
</head>
<body>
GlassFish est un serveur d'application open source libre, permettant d'impl&eacute;menter les fonctionnalit&eacute;s les plus r&eacute;centes dans la plate-forme Java EE 5. La plate-forme Java EE 5 inclut les derni&egrave;res versions de technologie, telles que JavaServer Pages(JSP) 2.1, JavaServer Faces(JSF) 1.2, Servlet 2,4, Enterprise JavaBeans 3.0, Java API for Web Services(JAX-WS) 2.0, Java Architecture for XML Binding(JAXB) 2.0, Web Services Metadata for the Java Platform 1.0, et bien d'autres. <br> <br> Vous ne connaissez pas encore GlassFish ? Apprenez comment le t&eacute;l&eacute;charger et l'installer, consultez son guide de d&eacute;marrage rapide, visualisez des screencasts (captures vid&eacute;o) ou testez des exemples du didacticiel. Consultez la page de mise en route. <br> <a href="#Learn_and_Write_Applications_with_the"></a>
<div id="projecthome" class="app">
<h3>T&eacute;l&eacute;chargement et ex&eacute;cution<br>
</h3>
Vous pouvez t&eacute;l&eacute;charger des versions d'acc&egrave;s r&eacute;centes du serveur d'application GlassFish. Le t&eacute;l&eacute;chargement comprend une version binaire du serveur d'application GlassFish Java EE 5, il vous suffit donc de le d&eacute;compresser et de l'ex&eacute;cuter. Les versions du t&eacute;l&eacute;chargement sont compatibles sur tous les syst&egrave;mes d'exploitation standard. <br> <br><a href="downloadsindex.html">T&eacute;l&eacute;chargez</a> maintenant.<br>
<ul>
</ul>
<h3>Guide de d&eacute;marrage rapide de GlassFish </h3>
Ce guide comprend les instructions d'installation et d'ex&eacute;cution du serveur GlassFish. En outre, il inclut un exemple d'application simple &agrave; d&eacute;ployer et &agrave; tester.<br> <br> Consultez le <a  href="http://glassfish.dev.java.net/downloads/quickstart/index.html">guide</a> maintenant.<br>
<h3>Screencast (capture vid&eacute;o)</h3>
Commencez votre exp&eacute;rience GlassFish en regardant un film.<br>
<ul>
  <li><a  href="http://download.java.net/javaee5/screencasts/sdk-intro/index.html">Introduction &agrave; Java EE 5 SDK</a> (21 f&eacute;vrier 2006)</li>
  <li><a  href="http://download.java.net/javaee5/screencasts/admin-console/index.html">Pr&eacute;sentation de la console d'administration</a> (21 f&eacute;vrier 2006)</li>
  <li><a  href="http://download.java.net/javaee5/screencasts/deployment/index.html">D&eacute;ploiement des archives et des applications Web de l'entreprise</a> (21 f&eacute;vrier 2006)</li>
  <li><a href="http://www.netbeans.org/kb/articles/flash.html">D&eacute;mos Flash de NetBeans IDE</a> (f&eacute;vrier 2006)<br>
  </li>
</ul>
<h3>Didacticiel</h3>
D&eacute;couvrez les technologies Java EE 5, EJB 3.0, JavaServer Faces, Java Persistence API, Servlets, JAX-WS JAXB, Java Message Services ainsi que les transactions pour n'en citer que quelques-unes. Cr&eacute;ez des exemples simples et d&eacute;ployez-les sur GlassFish.<br> <br> Consultez le <a  href="http://java.sun.com/javaee/5/docs/tutorial/doc/index.html">didacticiel</a> maintenant.<br>
<div id="projecthome" class="app"><br>
<h3>Communaut&eacute; GlassFish<br>
</h3>
Nous estimons et encourageons votre participation &agrave; ce projet.&nbsp;<br>
<ul>
  <li><a href="mailto:feedback@glassfish.dev.java.net">Contactez-nous</a> une fois que vous aurez ex&eacute;cut&eacute; votre application Java EE sous GlassFish<br>
  </li>
  <li><a href="http://forums.java.net/jive/forum.jspa?forumID=56">Rejoignez une discussion sur nos forums</a> avec d'autres utilisateurs de GlassFish</li>
</ul>
</div>
</div>
</body>
</html>
