<!DOCTYPE html PUBLIC "-//Tigris//DTD XHTML 1.0 Transitional//EN" "http://style.tigris.org/nonav/tigris_transitional.dtd">
<html><head>
  <link rel="SHORTCUT ICON" href="../image/glassfish_favicon.gif">
  <style>
   body
   {
    color: black; padding:0px; margin:0px;
    font-size: 0.8em;
    font-family: Verdana, "Verdana CE",  Arial, "Arial CE", "Lucida Grande CE", lucida, "Helvetica CE", sans-serif;
    background-color: #ffffff;
    background-image: none;
    margin: 10px;
   }
   h1
   {
    color: #ee6b00;
    font-weight: normal;
    font-size: 200%;
    padding: 5px 0 0 0;
    margin: 0 5px 0 0;
    border: 0;
   }
   h2
   {
    font-weight: normal;
    font-size: 150%;
   }
   p,h2,h3,h4
   {
    color: black;
    padding: 0 0 5px 0;
    margin: 0;
    border: 0;
   }
   div.buttons
   {
    padding: 10px 0 20px 0;
    border: 0;
   }
   .blue
   {
    color: #1E2A60;
   }

.app H3 {
clear: none;
}
.axial {
display: none;
}
#apphead {
display: none;
}
  </style><title>Utilisateurs et d&eacute;veloppeurs d'application GlassFish</title>

  <meta http-equiv="Content-Type" content="text/html; charset=windows-1252"></head>
<body>
<p>GlassFish est un serveur d'application open source libre, permettant d'impl&eacute;menter les fonctionnalit&eacute;s les plus r&eacute;centes dans la plate-forme Java EE 5. La plate-forme Java EE 5 inclut les derni&egrave;res versions de technologie, telles que JavaServer Pages(JSP) 2.1, JavaServer Faces(JSF) 1.2, Servlet 2.5, Enterprise JavaBeans 3.0, Java API for Web Services(JAX-WS) 2.0, Java Architecture for XML Binding(JAXB) 2.0, Web Services Metadata for the Java Platform 1.0, et bien d'autres. <p>
<br>
<p>Vous ne connaissez pas encore GlassFish ? Apprenez comment le t&eacute;l&eacute;charger et l'installer, consultez son guide de d&eacute;marrage rapide, visualisez des screencasts (captures vid&eacute;o) ou testez des exemples du didacticiel. Consultez la page de <a href="getstarted.html">pr&eacute;sentation de GlassFish</a>.</p>
<div id="projecthome" class="app">
<h3>Vous souhaitez...</h3>
<a href="getstarted.html">Obtenir un aper&ccedil;u rapide</a><br> <a href="#Download_and_Run_">T&eacute;l&eacute;charger</a><br> <a href="#Learn_and_Write_Applications_with_the">D&eacute;couvrir et &eacute;crire des applications</a><br> <a href="#GlassFish_Documentation_Drafts">Consulter la documentation</a> <br> <a href="#Contribute_to_the_GlassFish_Community_">Soutenir GlassFish</a><br> <a href="#Run_popular_open_source_frameworks_or">Ex&eacute;cuter des structures ou des applications open source standard</a><br> <br>
<h3><a name="Download_and_Run_"></a>T&eacute;l&eacute;chargement et ex&eacute;cution<br>
</h3>
Vous pouvez t&eacute;l&eacute;charger la version stable ou la toute derni&egrave;re version d'acc&egrave;s du serveur d'application GlassFish. Le t&eacute;l&eacute;chargement comprend une version binaire du serveur d'application GlassFish Java EE 5, il vous suffit donc de suivre les instructions donn&eacute;es et de l'ex&eacute;cuter. Les versions du t&eacute;l&eacute;chargement sont compatibles sur tous les syst&egrave;mes d'exploitation standard.<br>
<ul>
  <li><a href="downloadsindex.html">T&eacute;l&eacute;chargez</a> maintenant<br>
  </li>
</ul>
<h3><a name="Learn_and_Write_Applications_with_the"></a>Apprentissage et &eacute;criture d'applications avec les derni&egrave;res technologies Java EE 5</h3>
Le serveur d'application GlassFish impl&eacute;mente les <a href="http://java.sun.com/javaee/5/javatech.html">technologies Java EE 5</a> les plus r&eacute;centes. Par exemple, vous pouvez &eacute;crire une application &agrave; l'aide des derni&egrave;res technologies tiers Web, telles que JSF1.2. En outre, vous avez la possibilit&eacute; d'exploiter vos applications J2EE 1.4 (ou version ant&eacute;rieure) existantes sur GlassFish et d'&eacute;tablir de bonnes bases pour la migration.

<ul>
  <li>D&eacute;couvrez le <a href="http://glassfish.dev.java.net/downloads/quickstart/index.html">guide de d&eacute;marrage rapide</a> de GlassFish. Celui-ci comprend les instructions d'installation et d'ex&eacute;cution du serveur GlassFish, ainsi qu'un exemple simple d'application pour un d&eacute;ploiement. </li>
  <li>
    Consultez la <a href="http://java.sun.com/reference/blueprints/index.html">page d'accueil de Java BluePrints</a> pour les t&acirc;ches associ&eacute;es &agrave; Java EE 5. Celle-ci contient notamment des informations relatives &agrave; la cr&eacute;ation d'applications AJAX sur la plate-forme Java EE 5.
  </li>

  <li>
    D&eacute;veloppez des applications Java EE <a href="http://glassfish.dev.java.net/public/netbeans/index.html">&agrave; l'aide de NetBeans</a> en suivant l'un de ces deux didacticiels, une simple application hello world et une application plus complexe utilisant la persistance Java EE 5.</li><li>Les <a href="https://glassfish.dev.java.net/nonav/javaee5/api/index.html">documents Java</a> sont en ligne. Ils ont &eacute;t&eacute; mis &agrave; jour pour chaque version promue.</li>
<li>
    Postez toutes vos questions sur notre <a href="http://forums.java.net/jive/forum.jspa?forumID=56"> forum</a>.
  </li><li>Consultez la <a href="TipsandBlogs.html">liste croissante d'astuces et de blogs techniques</a>, comportant des exemples d'utilisation des technologies Java EE 5 dans GlassFish.</li>
  <li>Consultez <a href="http://blogs.sun.com/roller/page/theaquarium">The Aquarium</a> pour d&eacute;couvrir toutes les actualit&eacute;s relatives aux technologies associ&eacute;es &agrave; GlassFish.<br>
  </li>

</ul>
<div id="projecthome" class="app">
<h3><a name="GlassFish_Documentation_Drafts"></a>Premi&egrave;re documentation GlassFish</h3>
L'&eacute;quipe GlassFish inclut des auteurs qui ont mis en &oelig;uvre une documentation technique.  Ces documents seront mis &agrave; jour pour la V2 afin de pr&eacute;senter les nouvelles fonctionnalit&eacute;s.<br>
<ul>
  <li>Reportez-vous &agrave; la <a href="https://glassfish.dev.java.net/javaee5/docs/DocsIndex.html">page d'accueil de la documentation</a> pour d&eacute;couvrir la documentation disponible et envoyez-nous vos commentaires.</li>
</ul>
<h3><a name="Contribute_to_the_GlassFish_Community_"></a>Soutien de la communaut&eacute; GlassFish<br>
</h3>
Nous estimons et encourageons votre participation &agrave; ce projet. En voici quelques exemples :
    <ul>
      <li><a href="mailto:feedback@glassfish.dev.java.net">Contactez-nous</a> une fois que vous aurez ex&eacute;cut&eacute; votre application Java EE sous GlassFish<br>
      </li>
      <li><a href="http://forums.java.net/jive/forum.jspa?forumID=56">Rejoignez une discussion sur nos forums</a> avec d'autres utilisateurs de GlassFish</li>
      <li><a href="https://glassfish.dev.java.net/public/NewtoGlassFish.html#Submit_a_Bug">Signalez un bogue</a></li>
      <li><a href="https://glassfish.dev.java.net/public/NewtoGlassFish.html#Request_a_Feature">Proposez une fonctionnalit&eacute;</a></li>
      <li><a href="http://wiki.java.net/bin/view/Projects/GlassFishQuality">Participez aux tests</a> -- pour cela,         consultez le portail qualit&eacute; de GlassFish</li>
      <li><a href="devindex.html">Enregistrez votre code</a> pour le serveur d'application GlassFish</li>
      <li><a href="https://glassfish-samples.dev.java.net">Participez aux exemples GlassFish/Java EE</a></li>
       <li>Rejoignez le <a href="http://wiki.java.net/bin/view/Projects/CATfish">programme CATfish</a><br>
  </li>

    </ul>
<h3><a name="Run_popular_open_source_frameworks_or"></a>Ex&eacute;cution de structures ou d'applications open source standard</h3>
De nombreuses structures et applications open source standard sont prises en charge sur GlassFish. <a href="http://wiki.java.net/bin/view/Projects/GlassFishExtras">V&eacute;rifiez si votre application favorite</a> a &eacute;t&eacute; test&eacute;e. Ce n'est pas le cas ? Testez-la et communiquez nous vos r&eacute;sultats.<br> <br>
</div>
</div>
</body></html>
