<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsphysicaldestnew" name="ref-jmsphysicaldestnew"></a><a id="GHJMS00017" name="GHJMS00017"></a></p>

<h4><a id="sthref92" name="sthref92"></a><a id="sthref93" name="sthref93"></a>&#26032;&#35215;JMS&#29289;&#29702;&#23451;&#20808;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#26032;&#35215;JMS&#29289;&#29702;&#23451;&#20808;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#26032;&#35215;JMS&#29289;&#29702;&#23451;&#20808;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#36890;&#24120;&#12399;&#12289;JMS&#23451;&#20808;&#12522;&#12477;&#12540;&#12473;&#12398;&#20316;&#25104;&#26178;&#12395;&#29289;&#29702;&#23451;&#20808;&#21517;&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;GlassFish Server&#12364;&#24517;&#35201;&#12394;&#12392;&#12365;&#12395;&#29289;&#29702;&#23451;&#20808;&#12434;&#33258;&#21205;&#30340;&#12395;&#20316;&#25104;&#12377;&#12427;&#12383;&#12417;&#12289;&#29289;&#29702;&#23451;&#20808;&#12434;&#20316;&#25104;&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;</p>
<p>&#12300;&#26032;&#35215;JMS&#29289;&#29702;&#23451;&#20808;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#21517;&#21069;</dt>
<dd>
<p>&#29289;&#29702;&#23451;&#20808;&#12398;&#21517;&#21069;&#12290;</p>
</dd>
<dt>&#12479;&#12452;&#12503;</dt>
<dd>
<p>&#29289;&#29702;&#23451;&#20808;&#12398;&#12479;&#12452;&#12503;&#12290;&#36984;&#25246;&#21487;&#33021;&#12394;&#20516;&#12399;&#12289;<code>javax.jms.Topic</code>&#12392;<code>javax.jms.Queue</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#28040;&#36027;&#12375;&#12390;&#12356;&#12394;&#12356;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#26368;&#22823;&#25968;</dt>
<dd>
<p>&#23451;&#20808;&#12391;&#35377;&#21487;&#12373;&#12428;&#12390;&#12356;&#12427;&#26410;&#28040;&#36027;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#26368;&#22823;&#25968;&#12290;-1&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#26410;&#28040;&#36027;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#25968;&#12399;&#21046;&#38480;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;-1&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12469;&#12452;&#12474;</dt>
<dd>
<p>&#21336;&#19968;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#26368;&#22823;&#12469;&#12452;&#12474;(&#12496;&#12452;&#12488;&#21336;&#20301;)&#12290;-1&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#12469;&#12452;&#12474;&#12399;&#21046;&#38480;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;-1&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#21512;&#35336;&#12513;&#12514;&#12522;&#12540;</dt>
<dd>
<p>&#26410;&#28040;&#36027;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#26368;&#22823;&#21512;&#35336;&#12513;&#12514;&#12522;&#12540;(&#12496;&#12452;&#12488;&#21336;&#20301;)&#12290;-1&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#26410;&#28040;&#36027;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#12513;&#12514;&#12522;&#12540;&#12539;&#12469;&#12452;&#12474;&#12399;&#21046;&#38480;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;-1&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12375;&#12365;&#12356;&#20516;&#21046;&#38480;&#12398;&#21205;&#20316;</dt>
<dd>
<p>&#12513;&#12514;&#12522;&#12540;&#21046;&#38480;&#12398;&#12375;&#12365;&#12356;&#20516;&#12395;&#36948;&#12375;&#12383;&#12392;&#12365;&#12398;&#12502;&#12525;&#12540;&#12459;&#12398;&#21205;&#20316;&#12290;&#36984;&#25246;&#21487;&#33021;&#12394;&#20516;&#12399;&#27425;&#12398;&#12392;&#12362;&#12426;&#12391;&#12377;:</p>
<dl>
<dt>&#26368;&#26032;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#25298;&#21542;</dt>
<dd>
<p>&#26368;&#26032;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#25298;&#21542;&#12375;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#20445;&#25345;&#12377;&#12427;&#22580;&#21512;&#12398;&#12415;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#29983;&#25104;&#12375;&#12390;&#12356;&#12427;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12395;&#20363;&#22806;&#12434;&#36890;&#30693;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#20516;&#12364;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12503;&#12525;&#12487;&#12517;&#12540;&#12469;&#12398;&#12473;&#12525;&#12540;&#12539;&#12480;&#12454;&#12531;</dt>
<dd>
<p>&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12503;&#12525;&#12487;&#12517;&#12540;&#12469;&#12364;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#36865;&#20449;&#12377;&#12427;&#38971;&#24230;&#12434;&#19979;&#12370;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#26368;&#12418;&#21476;&#12356;&#12418;&#12398;&#12434;&#12473;&#12525;&#12540;</dt>
<dd>
<p>&#26368;&#12418;&#21476;&#12356;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#30772;&#26820;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#26368;&#12418;&#20778;&#20808;&#24230;&#12364;&#20302;&#12356;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#12473;&#12525;&#12540;</dt>
<dd>
<p>&#20778;&#20808;&#24230;&#12398;&#26368;&#12418;&#20302;&#12356;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#30772;&#26820;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<p>&#20516;&#12364;&#12300;&#26368;&#12418;&#21476;&#12356;&#12418;&#12398;&#12434;&#12473;&#12525;&#12540;&#12301;&#12414;&#12383;&#12399;&#12300;&#26368;&#12418;&#20778;&#20808;&#24230;&#12364;&#20302;&#12356;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#12473;&#12525;&#12540;&#12301;&#12391;&#12289;&#12300;&#12487;&#12483;&#12489;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12461;&#12517;&#12540;&#12434;&#20351;&#29992;&#12301;&#12364;true&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#36229;&#36942;&#12375;&#12383;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#12487;&#12483;&#12489;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12461;&#12517;&#12540;&#12395;&#36865;&#12425;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12503;&#12525;&#12487;&#12517;&#12540;&#12469;&#12398;&#26368;&#22823;&#25968;</dt>
<dd>
<p>&#12371;&#12398;&#29289;&#29702;&#23451;&#20808;&#12395;&#38306;&#36899;&#20184;&#12369;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12503;&#12525;&#12487;&#12517;&#12540;&#12469;&#12398;&#26368;&#22823;&#25968;&#12290;&#12371;&#12398;&#21046;&#38480;&#12395;&#36948;&#12377;&#12427;&#12392;&#12289;&#26032;&#12375;&#12356;&#12503;&#12525;&#12487;&#12517;&#12540;&#12469;&#12434;&#20316;&#25104;&#12391;&#12365;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;-1&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12503;&#12525;&#12487;&#12517;&#12540;&#12469;&#12398;&#25968;&#12399;&#21046;&#38480;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;100&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12496;&#12483;&#12481;&#37197;&#20449;&#12398;&#26368;&#22823;&#12513;&#12483;&#12475;&#12540;&#12472;&#25968;</dt>
<dd>
<p>&#21336;&#19968;&#12398;&#12496;&#12483;&#12481;&#12391;&#12467;&#12531;&#12471;&#12517;&#12540;&#12510;&#12395;&#37197;&#36865;&#21487;&#33021;&#12394;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#26368;&#22823;&#25968;&#12290;-1&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#25968;&#12399;&#21046;&#38480;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;1000&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12487;&#12483;&#12489;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12461;&#12517;&#12540;&#12434;&#20351;&#29992;</dt>
<dd>
<p>&#20516;&#12434;true&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#12487;&#12483;&#12489;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#12487;&#12483;&#12489;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12461;&#12517;&#12540;&#12395;&#36865;&#12425;&#12428;&#12414;&#12377;&#12290;&#20516;&#12434;false&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#12487;&#12483;&#12489;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#30772;&#26820;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;true&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>XML&#12473;&#12461;&#12540;&#12510;&#12398;&#26908;&#35388;</dt>
<dd>
<p>&#20516;&#12434;true&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;Message Queue&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12521;&#12531;&#12479;&#12452;&#12512;&#12399;XML&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#12502;&#12525;&#12540;&#12459;&#12395;&#36865;&#20449;&#12377;&#12427;&#21069;&#12395;&#12289;&#25351;&#23450;&#12375;&#12383;XML Schema Definition (XSD&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12399;DTD)&#12434;&#20351;&#29992;&#12375;&#12390;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#26908;&#35388;&#12434;&#34892;&#12356;&#12414;&#12377;&#12290;&#25351;&#23450;&#12375;&#12383;&#12473;&#12461;&#12540;&#12510;&#12364;&#35211;&#12388;&#12363;&#12425;&#12394;&#12356;&#12363;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#26908;&#35388;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#36865;&#20449;&#12373;&#12428;&#12378;&#20363;&#22806;&#12364;&#12473;&#12525;&#12540;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;false&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>XML&#12473;&#12461;&#12540;&#12510;URI&#12522;&#12473;&#12488;</dt>
<dd>
<p>XML Schema Definition (XSD) URI&#25991;&#23383;&#21015;&#12398;&#31354;&#30333;&#21306;&#20999;&#12426;&#12398;&#12522;&#12473;&#12488;&#12290;XML&#12473;&#12461;&#12540;&#12510;&#26908;&#35388;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12289;URI&#12399;XML&#12473;&#12461;&#12540;&#12510;&#26908;&#35388;&#12395;&#20351;&#29992;&#12377;&#12427;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;XSD&#12398;&#22580;&#25152;&#12434;&#25351;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<a id="sthref94" name="sthref94"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-jmsservice.html">JMS&#12469;&#12540;&#12499;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestnew.html">JMS&#29289;&#29702;&#23451;&#20808;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestedit.html">JMS&#29289;&#29702;&#23451;&#20808;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestdelete.html">JMS&#29289;&#29702;&#23451;&#20808;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmsflushmessages.html">JMS&#29289;&#29702;&#23451;&#20808;&#12363;&#12425;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#38500;&#21435;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldeststats.html">JMS&#29289;&#29702;&#23451;&#20808;&#12398;&#32113;&#35336;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref95" name="sthref95"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00038"><code>create-jmsdest</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00175"><code>list-jmsdest</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00090"><code>delete-jmsdest</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00136"><code>flush-jmsdest</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00144"><code>jms-ping</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
