<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsconnectionproperties" name="ref-jmsconnectionproperties"></a><a id="GHJMS00005" name="GHJMS00005"></a></p>

<h4><a id="sthref57" name="sthref57"></a><a id="sthref58" name="sthref58"></a>JMS&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12395;&#22266;&#26377;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>JMS&#25509;&#32154;&#12503;&#12525;&#12497;&#12486;&#12451;&#12391;&#20351;&#29992;&#12391;&#12365;&#12427;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#27425;&#12398;&#12392;&#12362;&#12426;&#12391;&#12377;&#12290;</p>
<dl>
<dt><code>ClientId</code></dt>
<dd>
<p>&#27704;&#32154;&#30340;&#12394;&#12469;&#12502;&#12473;&#12463;&#12521;&#12452;&#12496;&#12364;&#20351;&#29992;&#12377;&#12427;&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;ID&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt><code>AddressList</code></dt>
<dd>
<p>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#36890;&#20449;&#12377;&#12427;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12502;&#12525;&#12540;&#12459;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#21517;&#21069;(&#12362;&#12424;&#12403;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#12509;&#12540;&#12488;&#30058;&#21495;)&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12522;&#12473;&#12488;&#20869;&#12398;&#21508;&#12450;&#12489;&#12524;&#12473;&#12399;&#25509;&#32154;&#29992;&#12398;&#12507;&#12473;&#12488;&#21517;&#12289;&#12362;&#12424;&#12403;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#12507;&#12473;&#12488;&#12539;&#12509;&#12540;&#12488;&#12392;&#25509;&#32154;&#12469;&#12540;&#12499;&#12473;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#21487;&#33021;&#12394;&#20516;&#12395;&#12399;<code>earth</code>&#12420;<code>earth:7677</code>&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12502;&#12525;&#12540;&#12459;&#12364;&#12487;&#12501;&#12457;&#12523;&#12488;(7676)&#20197;&#22806;&#12398;&#12509;&#12540;&#12488;&#12391;&#23455;&#34892;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12509;&#12540;&#12488;&#30058;&#21495;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12503;&#12525;&#12497;&#12486;&#12451;&#35373;&#23450;&#12391;&#12463;&#12521;&#12473;&#12479;&#29872;&#22659;&#20869;&#12398;&#35079;&#25968;&#12398;&#12507;&#12473;&#12488;&#12392;&#12509;&#12540;&#12488;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;<code>AddressListBehavior</code>&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;<code>RANDOM</code>&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12392;&#12289;&#12522;&#12473;&#12488;&#20869;&#12398;&#26368;&#21021;&#12398;&#20351;&#29992;&#21487;&#33021;&#12507;&#12473;&#12488;&#12364;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<p>&#35443;&#32048;&#12399;&#12289;<i>Message Queue Java&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#38283;&#30330;&#32773;&#12460;&#12452;&#12489;</i>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12289;&#12525;&#12540;&#12459;&#12523;&#12539;&#12507;&#12473;&#12488;&#12362;&#12424;&#12403;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12509;&#12540;&#12488;&#30058;&#21495;(7676)&#12391;&#12377;&#12290;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12399;&#12289;&#12525;&#12540;&#12459;&#12523;&#12539;&#12507;&#12473;&#12488;&#12398;&#12509;&#12540;&#12488;7676&#12398;&#12502;&#12525;&#12540;&#12459;&#12408;&#12398;&#25509;&#32154;&#12434;&#35430;&#34892;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt><code>UserName</code></dt>
<dd>
<p>&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12398;&#12518;&#12540;&#12470;&#12540;&#21517;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>guest</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt><code>Password</code></dt>
<dd>
<p>&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12398;&#12497;&#12473;&#12527;&#12540;&#12489;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>guest</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt><code>ReconnectEnabled</code></dt>
<dd>
<p><code>true</code>&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#25509;&#32154;&#12364;&#22833;&#12431;&#12428;&#12383;&#12392;&#12365;&#12395;&#12289;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12521;&#12531;&#12479;&#12452;&#12512;&#12364;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12469;&#12540;&#12496;&#12540;(&#12414;&#12383;&#12399;<code>AddressList</code>&#12391;&#25351;&#23450;&#12375;&#12383;&#12450;&#12489;&#12524;&#12473;&#12398;&#12522;&#12473;&#12488;)&#12395;&#20877;&#25509;&#32154;&#12434;&#35430;&#12415;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>true</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt><code>ReconnectAttempts</code></dt>
<dd>
<p>&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12521;&#12531;&#12479;&#12452;&#12512;&#12364;&#12522;&#12473;&#12488;&#12398;&#27425;&#12398;&#12450;&#12489;&#12524;&#12473;&#12434;&#35430;&#34892;&#12377;&#12427;&#21069;&#12395;&#12289;<code>AddressList</code>&#12395;&#25351;&#23450;&#12375;&#12383;&#21508;&#12450;&#12489;&#12524;&#12473;&#12408;&#12398;&#25509;&#32154;(&#12414;&#12383;&#12399;&#20877;&#25509;&#32154;)&#12434;&#35430;&#34892;&#12377;&#12427;&#22238;&#25968;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#20516;-1&#12399;&#12289;&#20877;&#35430;&#34892;&#22238;&#25968;&#12364;&#28961;&#21046;&#38480;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12521;&#12531;&#12479;&#12452;&#12512;&#12399;&#12289;&#25509;&#32154;&#12364;&#25104;&#21151;&#12377;&#12427;&#12414;&#12391;&#26368;&#21021;&#12398;&#12450;&#12489;&#12524;&#12473;&#12408;&#12398;&#25509;&#32154;&#12434;&#35430;&#12415;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;3&#12391;&#12377;&#12290;</p>
</dd>
<dt><code>ReconnectInterval</code></dt>
<dd>
<p>&#20877;&#25509;&#32154;&#12434;&#35430;&#34892;&#12377;&#12427;&#38291;&#38548;&#12434;&#12511;&#12522;&#31186;&#21336;&#20301;&#12391;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12289;<code>AddressList</code>&#12391;&#25351;&#23450;&#12375;&#12383;&#21508;&#12450;&#12489;&#12524;&#12473;&#12362;&#12424;&#12403;&#12522;&#12473;&#12488;&#12398;&#27425;&#12398;&#12450;&#12489;&#12524;&#12473;&#12408;&#12398;&#35430;&#34892;&#12395;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#38291;&#38548;&#12364;&#30701;&#12377;&#12366;&#12427;&#12392;&#12289;&#12502;&#12525;&#12540;&#12459;&#12364;&#12522;&#12459;&#12496;&#12522;&#12377;&#12427;&#26178;&#38291;&#12364;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;&#38263;&#12377;&#12366;&#12427;&#12392;&#12289;&#20877;&#25509;&#32154;&#12364;&#21463;&#12369;&#20837;&#12428;&#12425;&#12428;&#12394;&#12356;&#36933;&#24310;&#12434;&#31034;&#12377;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;30000&#12391;&#12377;&#12290;</p>
</dd>
<dt><code>AddressListBehavior</code></dt>
<dd>
<p>&#25509;&#32154;&#12398;&#35430;&#34892;&#12434;<code>AddressList</code>&#23646;&#24615;&#12391;&#25351;&#23450;&#12375;&#12383;&#12450;&#12489;&#12524;&#12473;&#12398;&#38918;&#24207;(<code>PRIORITY</code>)&#12391;&#34892;&#12358;&#12363;&#12289;&#12414;&#12383;&#12399;&#12521;&#12531;&#12480;&#12512;&#12394;&#38918;&#24207;(<code>RANDOM</code>)&#12391;&#34892;&#12358;&#12363;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p><code>RANDOM</code>&#12399;&#12289;&#20877;&#25509;&#32154;&#12391;<code>AddressList</code>&#12363;&#12425;&#20219;&#24847;&#12398;&#12450;&#12489;&#12524;&#12473;&#12364;&#36984;&#25246;&#12373;&#12428;&#12383;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290;&#22810;&#25968;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12364;&#21516;&#12376;&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12434;&#20351;&#29992;&#12375;&#12390;&#25509;&#32154;&#12434;&#35430;&#34892;&#12377;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12427;&#22580;&#21512;&#12399;&#12289;&#12371;&#12398;&#20516;&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12395;&#12424;&#12426;&#12377;&#12409;&#12390;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12364;&#21516;&#12376;&#12450;&#12489;&#12524;&#12473;&#12395;&#25509;&#32154;&#12375;&#12394;&#12356;&#12424;&#12358;&#12395;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<p><code>PRIORITY</code>&#12399;&#12289;&#20877;&#25509;&#32154;&#12364;&#24120;&#12395;<code>AddressList</code>&#12395;&#25351;&#23450;&#12375;&#12383;&#26368;&#21021;&#12398;&#12469;&#12540;&#12496;&#12540;&#12398;&#12450;&#12489;&#12524;&#12473;&#12408;&#12398;&#25509;&#32154;&#12434;&#35430;&#34892;&#12375;&#12289;&#26368;&#21021;&#12398;&#12502;&#12525;&#12540;&#12459;&#12364;&#20351;&#29992;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;&#12395;&#12398;&#12415;&#20182;&#12398;&#12450;&#12489;&#12524;&#12473;&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>RANDOM</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt><code>AddressListIterations</code></dt>
<dd>
<p>&#25509;&#32154;&#12398;&#30906;&#31435;(&#12414;&#12383;&#12399;&#20877;&#30906;&#31435;)&#12398;&#12383;&#12417;&#12395;&#12289;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12521;&#12531;&#12479;&#12452;&#12512;&#12364;<code>AddressList</code>&#12434;&#20171;&#12375;&#12390;&#21453;&#24489;&#12377;&#12427;&#22238;&#25968;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#20516;-1&#12399;&#35430;&#34892;&#22238;&#25968;&#12364;&#28961;&#21046;&#38480;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;3&#12391;&#12377;&#12290;</p>
</dd>
</dl>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
