<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsservice" name="ref-jmsservice"></a></p>

<h4><a id="sthref74" name="sthref74"></a>Java Message Service</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;JMS&#12503;&#12525;&#12496;&#12452;&#12480;&#12391;&#12354;&#12427;GlassFish Server Message Queue&#12391;&#20351;&#29992;&#12373;&#12428;&#12427;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;JMS&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>JMS&#12469;&#12540;&#12499;&#12473;&#12398;&#27083;&#25104;&#12398;&#35443;&#32048;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDVG00020"><i>Oracle GlassFish Server&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#38283;&#30330;&#12460;&#12452;&#12489;</i>&#12398;&#31532;19&#31456;&#12289;<i>Using the Java Message Service</i></a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>&#12300;JMS&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12489;</dt>
<dd>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12354;&#12427;&#35373;&#23450;&#12434;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12395;&#24489;&#20803;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12394;&#12356;&#35373;&#23450;&#12399;&#22793;&#26356;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>Ping</dt>
<dd>
<p>JMS&#12469;&#12540;&#12499;&#12473;&#12364;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;JMS&#12507;&#12473;&#12488;&#12391;&#31292;&#20685;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;JMS&#12469;&#12540;&#12499;&#12473;&#12364;&#31292;&#20685;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;ping&#12398;&#25104;&#21151;&#12434;&#31034;&#12377;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#27083;&#25104;&#21517;</dt>
<dd>
<p>&#12371;&#12398;&#12506;&#12540;&#12472;&#12398;&#35373;&#23450;&#12364;&#36969;&#29992;&#12373;&#12428;&#12427;&#27083;&#25104;&#12398;&#21517;&#21069;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12479;&#12452;&#12503;</dt>
<dd>
<p>JMS&#12469;&#12540;&#12499;&#12473;&#12398;&#12450;&#12463;&#12475;&#12473;&#12398;&#12479;&#12452;&#12503;&#12290;&#36984;&#25246;&#21487;&#33021;&#12394;&#20516;&#12399;&#27425;&#12398;&#12392;&#12362;&#12426;&#12391;&#12377;:</p>
<dl>
<dt>EMBEDDED</dt>
<dd>
<p>&#12525;&#12540;&#12459;&#12523;&#12539;&#12507;&#12473;&#12488;&#12398;JMS&#12469;&#12540;&#12499;&#12473;&#12395;&#12450;&#12463;&#12475;&#12473;&#12375;&#12414;&#12377;&#12290;JMS&#12469;&#12540;&#12499;&#12473;&#12399;GlassFish Server&#12392;&#21516;&#12376;JVM&#12510;&#12471;&#12531;&#12391;&#36215;&#21205;&#12373;&#12428;&#12414;&#12377;&#12290;&#36933;&#24310;&#21021;&#26399;&#21270;&#12395;&#12424;&#12387;&#12390;&#12289;GlassFish Server&#12398;&#36215;&#21205;&#26178;&#12391;&#12399;&#12394;&#12367;&#12289;JMS&#12469;&#12540;&#12499;&#12473;&#12395;&#26368;&#21021;&#12395;&#12450;&#12463;&#12475;&#12473;&#12375;&#12383;&#12392;&#12365;&#12395;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#22475;&#36796;&#12415;&#12502;&#12525;&#12540;&#12459;&#12434;&#36215;&#21205;&#12375;&#12414;&#12377;&#12290;JMS&#12469;&#12540;&#12499;&#12473;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12479;&#12452;&#12503;&#12391;&#12377;&#12290;</p>
</dd>
<dt>LOCAL</dt>
<dd>
<p>&#12525;&#12540;&#12459;&#12523;&#12539;&#12507;&#12473;&#12488;&#12398;JMS&#12469;&#12540;&#12499;&#12473;&#12395;&#12450;&#12463;&#12475;&#12473;&#12375;&#12414;&#12377;&#12290;JMS&#12503;&#12525;&#12496;&#12452;&#12480;&#12399;GlassFish Server&#12392;&#12392;&#12418;&#12395;&#36215;&#21205;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>REMOTE</dt>
<dd>
<p>&#21029;&#12398;&#12471;&#12473;&#12486;&#12512;&#12398;JMS&#12469;&#12540;&#12499;&#12473;&#12395;&#12450;&#12463;&#12475;&#12473;&#12375;&#12414;&#12377;&#12290;REMOTE&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;JMS&#12469;&#12540;&#12499;&#12473;&#12399;&#27425;&#12398;&#12469;&#12540;&#12496;&#12540;&#12398;&#36215;&#21205;&#26178;&#12395;GlassFish Server&#12395;&#12424;&#12387;&#12390;&#36215;&#21205;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;JMS&#12469;&#12540;&#12499;&#12473;&#12399;Message Queue&#12395;&#12424;&#12387;&#12390;&#36215;&#21205;&#12362;&#12424;&#12403;&#31649;&#29702;&#12373;&#12428;&#12427;&#12383;&#12417;&#12289;Message Queue&#12502;&#12525;&#12540;&#12459;&#12434;&#21029;&#12395;&#36215;&#21205;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12502;&#12525;&#12540;&#12459;&#12398;&#36215;&#21205;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GMADG00227"><i>Oracle GlassFish Server Message Queue&#31649;&#29702;&#12460;&#12452;&#12489;</i>&#12398;<i>Starting Brokers</i></a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12371;&#12398;&#20516;&#12434;&#36984;&#25246;&#12375;&#12289;&#12363;&#12388;&#12522;&#12514;&#12540;&#12488;&#12539;&#12507;&#12473;&#12488;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;<a href="task-jmshostedit.html">JMS&#12507;&#12473;&#12488;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a>&#12391;&#35500;&#26126;&#12377;&#12427;&#25163;&#38918;&#12395;&#24467;&#12387;&#12390;&#12289;&#12522;&#12514;&#12540;&#12488;&#12539;&#12507;&#12473;&#12488;&#12398;&#21517;&#21069;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
</dd>
<dt>&#36215;&#21205;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;</dt>
<dd>
<p>&#36215;&#21205;&#12364;&#20013;&#26029;&#12373;&#12428;&#12427;&#12414;&#12391;&#12395;&#12289;GlassFish Server&#12364;JMS&#12469;&#12540;&#12499;&#12473;&#12398;&#36215;&#21205;&#12434;&#24453;&#27231;&#12377;&#12427;&#26178;&#38291;(&#31186;&#21336;&#20301;)&#12290;&#20966;&#29702;&#36895;&#24230;&#12398;&#36933;&#12356;&#12471;&#12473;&#12486;&#12512;&#12420;&#12458;&#12540;&#12496;&#12540;&#12525;&#12540;&#12489;&#12375;&#12383;&#12471;&#12473;&#12486;&#12512;&#12391;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12424;&#12426;&#12418;&#22823;&#12365;&#12367;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;60&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#36215;&#21205;&#24341;&#25968;</dt>
<dd>
<p>JMS&#12469;&#12540;&#12499;&#12473;&#12398;&#36215;&#21205;&#12434;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;&#12377;&#12427;&#24341;&#25968;&#12290;as-install-parent<code>/mq/bin/imqbrokerd</code>&#12467;&#12510;&#12531;&#12489;&#12391;&#20351;&#29992;&#12391;&#12365;&#12427;&#24341;&#25968;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#20877;&#25509;&#32154;</dt>
<dd>
<p>&#12300;&#20877;&#25509;&#32154;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#25509;&#32154;&#12364;&#22833;&#12431;&#12428;&#12383;&#12392;&#12365;&#12395;JMS&#12469;&#12540;&#12499;&#12473;&#12364;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12469;&#12540;&#12496;&#12540;&#12414;&#12383;&#12399;AddressList&#12391;&#25351;&#23450;&#12375;&#12383;&#12450;&#12489;&#12524;&#12473;&#12398;&#12522;&#12473;&#12488;&#12395;&#20877;&#25509;&#32154;&#12434;&#35430;&#12415;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#20877;&#25509;&#32154;&#38291;&#38548;</dt>
<dd>
<p>&#20877;&#25509;&#32154;&#12434;&#35430;&#34892;&#12377;&#12427;&#38291;&#38548;(&#31186;&#21336;&#20301;)&#12290;&#12371;&#12398;&#38291;&#38548;&#12399;&#12289;AddressList&#12391;&#25351;&#23450;&#12375;&#12383;&#21508;&#12450;&#12489;&#12524;&#12473;&#12362;&#12424;&#12403;&#12522;&#12473;&#12488;&#12398;&#27425;&#12398;&#12450;&#12489;&#12524;&#12473;&#12408;&#12398;&#35430;&#34892;&#12395;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#30701;&#12377;&#12366;&#12427;&#12392;&#12289;&#12502;&#12525;&#12540;&#12459;&#12395;&#12522;&#12459;&#12496;&#12522;&#12377;&#12427;&#26178;&#38291;&#12364;&#19982;&#12360;&#12425;&#12428;&#12414;&#12379;&#12435;&#12290;&#38263;&#12377;&#12366;&#12427;&#12392;&#12289;&#20877;&#25509;&#32154;&#12364;&#21463;&#12369;&#20837;&#12428;&#12425;&#12428;&#12394;&#12356;&#36933;&#24310;&#12434;&#31034;&#12377;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;5&#31186;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#20877;&#25509;&#32154;&#35430;&#34892;</dt>
<dd>
<p>&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12521;&#12531;&#12479;&#12452;&#12512;&#12364;&#12522;&#12473;&#12488;&#12398;&#27425;&#12398;&#12450;&#12489;&#12524;&#12473;&#12434;&#35430;&#34892;&#12377;&#12427;&#21069;&#12395;&#12289;AddressList&#12395;&#25351;&#23450;&#12375;&#12383;&#21508;&#12450;&#12489;&#12524;&#12473;&#12408;&#12398;&#25509;&#32154;(&#12414;&#12383;&#12399;&#20877;&#25509;&#32154;)&#12434;&#35430;&#34892;&#12377;&#12427;&#22238;&#25968;&#12290;&#20516;-1&#12399;&#12289;&#20877;&#35430;&#34892;&#22238;&#25968;&#12364;&#28961;&#21046;&#38480;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12521;&#12531;&#12479;&#12452;&#12512;&#12399;&#12289;&#25509;&#32154;&#12364;&#25104;&#21151;&#12377;&#12427;&#12414;&#12391;&#26368;&#21021;&#12398;&#12450;&#12489;&#12524;&#12473;&#12408;&#12398;&#25509;&#32154;&#12434;&#35430;&#12415;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;3&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12487;&#12501;&#12457;&#12523;&#12488;JMS&#12507;&#12473;&#12488;</dt>
<dd>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;JMS&#12507;&#12473;&#12488;&#12398;&#21517;&#21069;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>default_JMS_host</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12510;&#12473;&#12479;&#12540;&#12539;&#12502;&#12525;&#12540;&#12459;</dt>
<dd>
<p>&#38306;&#36899;&#12377;&#12427;Message Queue&#12502;&#12525;&#12540;&#12459;&#12364;Message Queue&#12502;&#12525;&#12540;&#12459;&#12539;&#12463;&#12521;&#12473;&#12479;&#20869;&#12391;&#12510;&#12473;&#12479;&#12540;&#12539;&#12502;&#12525;&#12540;&#12459;&#12392;&#12375;&#12390;&#20351;&#29992;&#12373;&#12428;&#12427;&#12289;GlassFish Server&#12398;&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#21517;&#21069;&#12290;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#31354;&#30333;&#12398;&#12414;&#12414;&#12395;&#12377;&#12427;&#12392;&#12289;GlassFish Server &#12395;&#12424;&#12387;&#12390;&#12510;&#12473;&#12479;&#12540;&#12539;&#12502;&#12525;&#12540;&#12459;&#12364;&#33258;&#21205;&#30340;&#12395;&#25351;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#20516;&#12434;&#22793;&#26356;&#12375;&#12383;&#22580;&#21512;&#12399;&#12289;&#27083;&#25104;&#12434;&#20351;&#29992;&#12377;&#12427;GlassFish Server&#12463;&#12521;&#12473;&#12479;&#12434;&#20877;&#36215;&#21205;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12450;&#12489;&#12524;&#12473;&#12539;&#12522;&#12473;&#12488;&#12398;&#21205;&#20316;</dt>
<dd>
<p>&#25509;&#32154;&#12434;&#35430;&#34892;&#12377;&#12427;&#38918;&#24207;&#12290;&#36984;&#25246;&#21487;&#33021;&#12394;&#20516;&#12399;&#27425;&#12398;&#12392;&#12362;&#12426;&#12391;&#12377;:</p>
<dl>
<dt><code>random</code></dt>
<dd>
<p>AddressList&#12363;&#12425;&#12450;&#12489;&#12524;&#12473;&#12434;&#12521;&#12531;&#12480;&#12512;&#12395;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#22810;&#25968;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12364;&#21516;&#12376;&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12434;&#20351;&#29992;&#12375;&#12390;&#25509;&#32154;&#12434;&#35430;&#34892;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12364;&#21516;&#12376;&#12450;&#12489;&#12524;&#12473;&#12395;&#25509;&#32154;&#12375;&#12394;&#12356;&#12424;&#12358;&#12395;<code>random</code>&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12377;&#12290;</p>
</dd>
<dt><code>priority</code></dt>
<dd>
<p>&#20877;&#25509;&#32154;&#12391;&#12399;&#24120;&#12395;AddressList&#12395;&#25351;&#23450;&#12375;&#12383;&#26368;&#21021;&#12398;&#12469;&#12540;&#12496;&#12540;&#12398;&#12450;&#12489;&#12524;&#12473;&#12408;&#12398;&#25509;&#32154;&#12434;&#35430;&#34892;&#12375;&#12289;&#26368;&#21021;&#12398;&#12502;&#12525;&#12540;&#12459;&#12364;&#20351;&#29992;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;&#12395;&#12398;&#12415;&#20182;&#12398;&#12450;&#12489;&#12524;&#12473;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
</dd>
<dt>&#12450;&#12489;&#12524;&#12473;&#12539;&#12522;&#12473;&#12488;&#12398;&#32368;&#36820;&#12375;</dt>
<dd>
<p>&#25509;&#32154;&#12398;&#30906;&#31435;(&#12414;&#12383;&#12399;&#20877;&#30906;&#31435;)&#12398;&#12383;&#12417;&#12395;&#12289;JMS&#12469;&#12540;&#12499;&#12473;&#12364;AddressList&#12434;&#21453;&#24489;&#12377;&#12427;&#22238;&#25968;&#12290;&#20516;-1&#12399;&#35430;&#34892;&#22238;&#25968;&#12364;&#28961;&#21046;&#38480;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;3&#12391;&#12377;&#12290;</p>
</dd>
<dt>MQ&#12473;&#12461;&#12540;&#12512;&#12289;MQ&#12469;&#12540;&#12499;&#12473;</dt>
<dd>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20197;&#22806;&#12398;&#12473;&#12461;&#12540;&#12512;&#12414;&#12383;&#12399;&#12469;&#12540;&#12499;&#12473;&#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12398;&#12289;Message Queue&#12450;&#12489;&#12524;&#12473;&#12539;&#12473;&#12461;&#12540;&#12512;&#21517;&#12392;Message Queue&#25509;&#32154;&#12469;&#12540;&#12499;&#12473;&#21517;&#12290;&#27083;&#25991;&#24773;&#22577;&#12399;&#12289;<a href="ref-mqschemeservice.html">MQ&#12473;&#12461;&#12540;&#12512;&#12392;MQ&#12469;&#12540;&#12499;&#12473;&#12398;&#12450;&#12489;&#12524;&#12473;&#12398;&#27083;&#25991;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</dd>
<dt>&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;</dt>
<dd>
<p>JMS&#12469;&#12540;&#12499;&#12473;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12290;</p>
<p>&#20351;&#29992;&#21487;&#33021;&#12394;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#35443;&#32048;&#12399;&#12289;<a href="ref-jmsservice-additional-props.html">JMS&#12469;&#12540;&#12499;&#12473;&#12395;&#22266;&#26377;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</dd>
</dl>
<a id="sthref75" name="sthref75"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-jmsservice.html">JMS&#12469;&#12540;&#12499;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmshostnew.html">JMS&#12507;&#12473;&#12488;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmshostedit.html">JMS&#12507;&#12473;&#12488;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmshostdelete.html">JMS&#12507;&#12473;&#12488;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref76" name="sthref76"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00144"><code>jms-ping</code>(1)</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
