<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsconnectionnew" name="ref-jmsconnectionnew"></a></p>

<h4><a id="sthref49" name="sthref49"></a><a id="sthref50" name="sthref50"></a>&#26032;&#35215;JMS&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#26032;&#35215;JMS&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#26032;&#35215;JMS&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26032;&#35215;JMS&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12503;&#12540;&#12523;&#21517;</dt>
<dd>
<p>&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12434;&#35672;&#21029;&#12377;&#12427;&#19968;&#24847;&#12398;&#21517;&#21069;&#12290;GlassFish Server&#12391;&#12399;&#12289;&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12398;JNDI&#21517;&#12434;&#12371;&#12398;&#20516;&#12395;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12522;&#12477;&#12540;&#12473;&#12539;&#12479;&#12452;&#12503;</dt>
<dd>
<p>&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12398;&#12479;&#12452;&#12503;&#12290;&#36984;&#25246;&#21487;&#33021;&#12394;&#20516;&#12399;&#12289;<code>javax.jms.ConnectionFactory</code>&#12289;<code>javax.jms.QueueConnectionFactory</code>&#12289;&#12362;&#12424;&#12403;<code>javax.jms.TopicConnectionFactory</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#35500;&#26126;</dt>
<dd>
<p>&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12398;&#35500;&#26126;&#12290;</p>
</dd>
<dt>&#12473;&#12486;&#12540;&#12479;&#12473;</dt>
<dd>
<p>&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12398;&#12473;&#12486;&#12540;&#12479;&#12473;&#12290;&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12399;&#12289;&#26377;&#21177;&#12414;&#12383;&#12399;&#28961;&#21177;&#12398;&#29366;&#24907;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#21021;&#26399;&#12362;&#12424;&#12403;&#26368;&#23567;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;</dt>
<dd>
<p>&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12398;&#12503;&#12540;&#12523;&#12395;&#21547;&#12414;&#12428;&#12427;&#25509;&#32154;&#12398;&#26368;&#23567;&#25968;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;8&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;</dt>
<dd>
<p>&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12398;&#12503;&#12540;&#12523;&#12395;&#21547;&#12414;&#12428;&#12427;&#25509;&#32154;&#12398;&#26368;&#22823;&#25968;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;32&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;&#22793;&#26356;&#37327;</dt>
<dd>
<p>&#12503;&#12540;&#12523;&#12398;&#12450;&#12452;&#12489;&#12523;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12395;&#36948;&#12375;&#12383;&#12392;&#12365;&#12395;&#38500;&#21435;&#12373;&#12428;&#12427;&#25509;&#32154;&#12398;&#25968;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;2&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12450;&#12452;&#12489;&#12523;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;</dt>
<dd>
<p>&#12503;&#12540;&#12523;&#12391;&#25509;&#32154;&#12364;&#12450;&#12452;&#12489;&#12523;&#29366;&#24907;&#12398;&#12414;&#12414;&#12391;&#12356;&#12425;&#12428;&#12427;&#26368;&#38263;&#26178;&#38291;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;300&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#24453;&#27231;&#26178;&#38291;</dt>
<dd>
<p>&#25509;&#32154;&#12434;&#12522;&#12463;&#12456;&#12473;&#12488;&#12377;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#25509;&#32154;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12395;&#12394;&#12427;&#12414;&#12391;&#12395;&#24453;&#27231;&#12377;&#12427;&#26178;&#38291;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;60000&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12377;&#12409;&#12390;&#12398;&#38556;&#23475;&#26178;</dt>
<dd>
<p>&#12300;&#12377;&#12409;&#12390;&#12398;&#25509;&#32154;&#12434;&#38281;&#12376;&#12427;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#25509;&#32154;&#12398;&#12358;&#12385;&#12398;1&#12388;&#12395;&#38556;&#23475;&#12364;&#30330;&#29983;&#12375;&#12383;&#22580;&#21512;&#12395;&#12289;GlassFish Server&#12399;&#12503;&#12540;&#12523;&#20869;&#12398;&#12377;&#12409;&#12390;&#12398;&#25509;&#32154;&#12434;&#38281;&#12376;&#12390;&#12289;&#12371;&#12428;&#12425;&#12434;&#20877;&#30906;&#31435;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12469;&#12509;&#12540;&#12488;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12469;&#12509;&#12540;&#12488;&#12399;&#12289;&#25509;&#32154;&#12503;&#12540;&#12523;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12383;&#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12469;&#12509;&#12540;&#12488;&#12434;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12375;&#12289;&#19979;&#20301;&#20114;&#25563;&#24615;&#12434;&#32173;&#25345;&#12375;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;&#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12395;&#25351;&#23450;&#12375;&#12383;&#12524;&#12505;&#12523;&#12424;&#12426;&#20302;&#12356;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12524;&#12505;&#12523;&#12289;&#12414;&#12383;&#12399;&#12522;&#12477;&#12540;&#12473;&#12539;&#12450;&#12480;&#12503;&#12479;&#12395;&#25351;&#23450;&#12375;&#12383;&#12524;&#12505;&#12523;&#12392;&#21516;&#12376;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12524;&#12505;&#12523;&#12399;&#12469;&#12509;&#12540;&#12488;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;&#12381;&#12428;&#12424;&#12426;&#39640;&#12356;&#12524;&#12505;&#12523;&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;</p>
<p>&#20516;&#12399;&#27425;&#12398;&#12356;&#12378;&#12428;&#12363;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
<dl>
<dt>XATransaction</dt>
<dd>
<p>&#12522;&#12477;&#12540;&#12473;&#12399;&#12289;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12473;&#12467;&#12540;&#12503;&#20869;&#12391;&#35079;&#25968;&#12398;&#12522;&#12477;&#12540;&#12473;&#12434;&#20351;&#29992;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12391;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;JMS&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12391;&#12399;&#12289;&#12371;&#12398;&#20516;&#12364;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12377;&#12290;</p>
<p>&#12383;&#12392;&#12360;&#12400;&#12289;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12391;&#12399;&#12371;&#12398;&#12522;&#12477;&#12540;&#12473;&#12398;&#20182;&#12395;&#12289;JDBC&#12522;&#12477;&#12540;&#12473;&#12289;&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;&#12289;&#12381;&#12398;&#20182;&#12398;JMS&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12539;&#12522;&#12477;&#12540;&#12473;&#12418;&#24517;&#35201;&#12394;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#20516;&#12395;&#12424;&#12426;&#12289;&#26368;&#39640;&#12398;&#26580;&#36575;&#24615;&#12364;&#25552;&#20379;&#12373;&#12428;&#12414;&#12377;&#12290;XATransaction&#12392;&#12375;&#12390;&#27083;&#25104;&#12373;&#12428;&#12427;&#12522;&#12477;&#12540;&#12473;&#12399;&#12289;2&#12501;&#12455;&#12540;&#12474;&#12539;&#12467;&#12511;&#12483;&#12488;&#25805;&#20316;&#12395;&#38306;&#19982;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>LocalTransaction</dt>
<dd>
<p>&#12522;&#12477;&#12540;&#12473;&#12399;&#12289;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12473;&#12467;&#12540;&#12503;&#20869;&#12391;&#12522;&#12477;&#12540;&#12473;&#12434;1&#12388;&#12398;&#12415;&#24517;&#35201;&#12392;&#12377;&#12427;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12391;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;&#35079;&#25968;&#12398;XA&#12522;&#12477;&#12540;&#12473;&#12364;&#24517;&#35201;&#12392;&#12394;&#12427;&#20998;&#25955;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#26368;&#32066;&#12456;&#12540;&#12472;&#12455;&#12531;&#12488;&#12392;&#12375;&#12390;&#12418;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#20516;&#12395;&#12424;&#12426;&#12289;&#22823;&#24133;&#12394;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#21521;&#19978;&#12364;&#24471;&#12425;&#12428;&#12414;&#12377;&#12290;LocalTransaction&#12392;&#12375;&#12390;&#27083;&#25104;&#12373;&#12428;&#12427;&#12522;&#12477;&#12540;&#12473;&#12399;&#12289;2&#12501;&#12455;&#12540;&#12474;&#12539;&#12467;&#12511;&#12483;&#12488;&#25805;&#20316;&#12395;&#20351;&#29992;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>NoTransaction</dt>
<dd>
<p>&#12522;&#12477;&#12540;&#12473;&#12399;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12391;&#20351;&#29992;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#35373;&#23450;&#12399;JMS&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12398;&#20351;&#29992;&#12395;&#38480;&#12425;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
</dd>
<dt>&#25509;&#32154;&#26908;&#35388;</dt>
<dd>
<p>&#12300;&#24517;&#38920;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#25552;&#20379;&#12373;&#12428;&#12427;&#21069;&#12395;&#25509;&#32154;&#12364;&#26908;&#35388;&#12373;&#12428;&#12414;&#12377;&#12290;&#12522;&#12477;&#12540;&#12473;&#12398;&#26908;&#35388;&#12395;&#22833;&#25943;&#12375;&#12383;&#22580;&#21512;&#12399;&#12289;&#12522;&#12477;&#12540;&#12473;&#12364;&#30772;&#26820;&#12373;&#12428;&#12289;&#26032;&#12375;&#12356;&#12522;&#12477;&#12540;&#12473;&#12364;&#20316;&#25104;&#12373;&#12428;&#12390;&#36820;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;</dt>
<dd>
<p>&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12290;</p>
<p>&#20351;&#29992;&#21487;&#33021;&#12394;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#35443;&#32048;&#12399;&#12289;<a href="ref-jmsconnectionproperties.html">JMS&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12395;&#22266;&#26377;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</dd>
<dt>&#12479;&#12540;&#12466;&#12483;&#12488;</dt>
<dd>
<p>&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12398;&#12463;&#12521;&#12473;&#12479;&#12362;&#12424;&#12403;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12290;&#24517;&#35201;&#12394;&#12479;&#12540;&#12466;&#12483;&#12488;&#12434;&#12300;&#36984;&#25246;&#12375;&#12383;&#12479;&#12540;&#12466;&#12483;&#12488;&#12301;&#21015;&#12395;&#31227;&#21205;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12414;&#12383;&#12399;&#12300;&#12377;&#12409;&#12390;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#19981;&#35201;&#12394;&#12479;&#12540;&#12466;&#12483;&#12488;&#12434;&#12300;&#20351;&#29992;&#21487;&#33021;&#12394;&#12479;&#12540;&#12466;&#12483;&#12488;&#12301;&#21015;&#12395;&#31227;&#21205;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#38500;&#21435;&#12301;&#12508;&#12479;&#12531;&#12414;&#12383;&#12399;&#12300;&#12377;&#12409;&#12390;&#38500;&#21435;&#12301;&#12508;&#12479;&#12531;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12489;&#12513;&#12452;&#12531;&#20869;&#12395;&#12463;&#12521;&#12473;&#12479;&#12414;&#12383;&#12399;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20316;&#25104;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<a id="sthref51" name="sthref51"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-jmsconnectionnew.html">JMS&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmsconnectionedit.html">JMS&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">JMS&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="sthref52" name="sthref52"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00040"><code>create-jms-resource</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00177"><code>list-jms-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00092"><code>delete-jms-resource</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
