<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmshostedit" name="task-jmshostedit"></a><a id="GHJMS00028" name="GHJMS00028"></a></p>

<h4><a id="sthref26" name="sthref26"></a>JMS&#12507;&#12473;&#12488;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#27083;&#25104;&#12377;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;:</p>
<ul>
<li>
<p>&#29305;&#23450;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12381;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#27083;&#25104;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;<code>server</code>&#12398;&#22580;&#21512;&#12399;&#12289;<code>server-config</code>&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p><code>default-config</code>&#12398;&#12467;&#12500;&#12540;&#12434;&#20351;&#29992;&#12377;&#12427;&#23558;&#26469;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12383;&#12417;&#12395;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#35373;&#23450;&#20516;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;<code>default-config</code>&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12391;&#12289;&#12300;Java&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;Java&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12494;&#12540;&#12489;&#12391;&#12289;&#12300;JMS&#12507;&#12473;&#12488;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;JMS&#12507;&#12473;&#12488;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;JMS&#12507;&#12473;&#12488;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#32232;&#38598;&#12377;&#12427;&#12507;&#12473;&#12488;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;JMS&#12507;&#12473;&#12488;&#12434;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12507;&#12473;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;JMS&#12507;&#12473;&#12488;&#12434;&#23455;&#34892;&#12377;&#12427;&#12471;&#12473;&#12486;&#12512;&#12398;&#21517;&#21069;(<code>localhost</code>&#12414;&#12383;&#12399;&#12525;&#12540;&#12459;&#12523;&#12354;&#12427;&#12356;&#12399;&#12522;&#12514;&#12540;&#12488;&#12539;&#12471;&#12473;&#12486;&#12512;&#12398;&#21517;&#21069;)&#12414;&#12383;&#12399;IP(Internet Protocol)&#12450;&#12489;&#12524;&#12473;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12509;&#12540;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;JMS&#12469;&#12540;&#12499;&#12473;&#12398;&#12509;&#12540;&#12488;&#30058;&#21495;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#20351;&#29992;&#12377;&#12427;JMS&#12469;&#12540;&#12499;&#12473;&#12434;&#12487;&#12501;&#12457;&#12523;&#12488;&#20197;&#22806;&#12398;&#12509;&#12540;&#12488;&#12391;&#23455;&#34892;&#12377;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#12289;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#22793;&#26356;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12509;&#12540;&#12488;&#12399;7676&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#31649;&#29702;&#12518;&#12540;&#12470;&#12540;&#21517;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12392;&#12300;&#31649;&#29702;&#12497;&#12473;&#12527;&#12540;&#12489;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;Message Queue&#12502;&#12525;&#12540;&#12459;&#12398;&#12518;&#12540;&#12470;&#12540;&#21517;&#12392;&#12497;&#12473;&#12527;&#12540;&#12489;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12428;&#12425;&#12399;&#12289;GlassFish Server&#12398;&#12518;&#12540;&#12470;&#12540;&#21517;&#12362;&#12424;&#12403;&#12497;&#12473;&#12527;&#12540;&#12489;&#12392;&#12399;&#30064;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#32232;&#38598;&#12377;&#12427;&#12398;&#12399;&#12289;as-install-parent<code>/mq/bin/imqusermgr</code>&#12467;&#12510;&#12531;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;Message Queue&#12502;&#12525;&#12540;&#12459;&#12398;&#20516;&#12434;&#22793;&#26356;&#12375;&#12383;&#22580;&#21512;&#12398;&#12415;&#12391;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>admin</code>&#12392;<code>admin</code>&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#12498;&#12531;&#12488;:</b></p>
&#12487;&#12501;&#12457;&#12523;&#12488;&#35373;&#23450;&#12395;&#36820;&#12377;&#12395;&#12399;&#12289;&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12489;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12289;&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;<br />
<hr>

</li>
</ol>
<a id="sthref27" name="sthref27"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-jmsservice.html">JMS&#12469;&#12540;&#12499;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmshostnew.html">JMS&#12507;&#12473;&#12488;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmshostdelete.html">JMS&#12507;&#12473;&#12488;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestnew.html">JMS&#29289;&#29702;&#23451;&#20808;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestedit.html">JMS&#29289;&#29702;&#23451;&#20808;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestdelete.html">JMS&#29289;&#29702;&#23451;&#20808;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmsflushmessages.html">JMS&#29289;&#29702;&#23451;&#20808;&#12363;&#12425;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#38500;&#21435;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldeststats.html">JMS&#29289;&#29702;&#23451;&#20808;&#12398;&#32113;&#35336;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
