<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsphysicaldestnew" name="task-jmsphysicaldestnew"></a></p>

<h4><a id="sthref30" name="sthref30"></a><a id="sthref31" name="sthref31"></a>JMS&#29289;&#29702;&#23451;&#20808;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#36890;&#24120;&#12399;&#12289;JMS&#23451;&#20808;&#12522;&#12477;&#12540;&#12473;&#12398;&#20316;&#25104;&#26178;&#12395;&#29289;&#29702;&#23451;&#20808;&#21517;&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;GlassFish Server&#12364;&#24517;&#35201;&#12394;&#12392;&#12365;&#12395;&#29289;&#29702;&#23451;&#20808;&#12434;&#33258;&#21205;&#30340;&#12395;&#20316;&#25104;&#12377;&#12427;&#12383;&#12417;&#12289;&#29289;&#29702;&#23451;&#20808;&#12434;&#20316;&#25104;&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;</p>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#27083;&#25104;&#12377;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;:</p>
<ul>
<li>
<p>&#29305;&#23450;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12381;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#27083;&#25104;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;<code>server</code>&#12398;&#22580;&#21512;&#12399;&#12289;<code>server-config</code>&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p><code>default-config</code>&#12398;&#12467;&#12500;&#12540;&#12434;&#20351;&#29992;&#12377;&#12427;&#23558;&#26469;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12383;&#12417;&#12395;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#35373;&#23450;&#20516;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;<code>default-config</code>&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12391;&#12289;&#12300;Java&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;Java&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12494;&#12540;&#12489;&#12391;&#12289;&#12300;&#29289;&#29702;&#23451;&#20808;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#29289;&#29702;&#23451;&#20808;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#29289;&#29702;&#23451;&#20808;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;&#26032;&#35215;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26032;&#35215;&#29289;&#29702;&#23451;&#20808;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#29289;&#29702;&#23451;&#20808;&#12398;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12479;&#12452;&#12503;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;<code>javax.jms.Topic</code>&#12414;&#12383;&#12399;<code>javax.jms.Queue</code>&#12398;&#12356;&#12378;&#12428;&#12363;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#28040;&#36027;&#12375;&#12390;&#12356;&#12394;&#12356;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#26368;&#22823;&#25968;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#23451;&#20808;&#12391;&#35377;&#21487;&#12373;&#12428;&#12390;&#12356;&#12427;&#26410;&#28040;&#36027;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#26368;&#22823;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>-1&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#26410;&#28040;&#36027;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#25968;&#12399;&#21046;&#38480;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;-1&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26368;&#22823;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12469;&#12452;&#12474;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#21336;&#19968;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#26368;&#22823;&#12469;&#12452;&#12474;&#12434;&#12496;&#12452;&#12488;&#21336;&#20301;&#12391;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>-1&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#12469;&#12452;&#12474;&#12399;&#21046;&#38480;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;-1&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26368;&#22823;&#32207;&#12513;&#12514;&#12522;&#12540;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#26410;&#28040;&#36027;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#26368;&#22823;&#21512;&#35336;&#12513;&#12514;&#12522;&#12540;&#12434;&#12496;&#12452;&#12488;&#21336;&#20301;&#12391;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>-1&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#26410;&#28040;&#36027;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#12513;&#12514;&#12522;&#12540;&#12539;&#12469;&#12452;&#12474;&#12399;&#21046;&#38480;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;-1&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12375;&#12365;&#12356;&#20516;&#21046;&#38480;&#12398;&#21205;&#20316;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#12513;&#12514;&#12522;&#12540;&#21046;&#38480;&#12398;&#12375;&#12365;&#12356;&#20516;&#12395;&#36948;&#12375;&#12383;&#12392;&#12365;&#12398;&#12502;&#12525;&#12540;&#12459;&#12398;&#21205;&#20316;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p><code>Reject newest messages</code>&#12399;&#12289;&#26368;&#26032;&#12398;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#25298;&#21542;&#12375;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#20445;&#25345;&#12377;&#12427;&#22580;&#21512;&#12398;&#12415;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#29983;&#25104;&#12375;&#12390;&#12356;&#12427;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12395;&#20363;&#22806;&#12434;&#36890;&#30693;&#12377;&#12427;&#12424;&#12358;&#12395;&#12502;&#12525;&#12540;&#12459;&#12395;&#25351;&#31034;&#12375;&#12414;&#12377;&#12290;</p>
<p><code>Reject newest messages</code>&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p><code>Slow down producers</code>&#12399;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12503;&#12525;&#12487;&#12517;&#12540;&#12469;&#12364;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#36865;&#20449;&#12377;&#12427;&#38971;&#24230;&#12434;&#19979;&#12370;&#12427;&#12424;&#12358;&#12395;&#12502;&#12525;&#12540;&#12459;&#12395;&#25351;&#31034;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p><code>Throw out oldest</code>&#12399;&#12289;&#26368;&#12418;&#21476;&#12356;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#30772;&#26820;&#12377;&#12427;&#12424;&#12358;&#12395;&#12502;&#12525;&#12540;&#12459;&#12395;&#25351;&#31034;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p><code>Throw out lowest-priority messages</code>&#12399;&#12289;&#20778;&#20808;&#24230;&#12398;&#26368;&#12418;&#20302;&#12356;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#30772;&#26820;&#12377;&#12427;&#12424;&#12358;&#12395;&#12502;&#12525;&#12540;&#12459;&#12395;&#25351;&#31034;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
<p>&#20516;&#12364;<code>Throw out oldest</code>&#12414;&#12383;&#12399;<code>Throw out lowest-priority messages</code>&#12391;&#12289;&#12300;&#12487;&#12483;&#12489;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12461;&#12517;&#12540;&#12434;&#20351;&#29992;&#12301;&#12364;true&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#36229;&#36942;&#12375;&#12383;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#12487;&#12483;&#12489;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12461;&#12517;&#12540;&#12395;&#36865;&#12425;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12503;&#12525;&#12487;&#12517;&#12540;&#12469;&#12398;&#26368;&#22823;&#25968;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12371;&#12398;&#29289;&#29702;&#23451;&#20808;&#12395;&#38306;&#36899;&#20184;&#12369;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12503;&#12525;&#12487;&#12517;&#12540;&#12469;&#12398;&#26368;&#22823;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#21046;&#38480;&#12395;&#36948;&#12377;&#12427;&#12392;&#12289;&#26032;&#12375;&#12356;&#12503;&#12525;&#12487;&#12517;&#12540;&#12469;&#12434;&#20316;&#25104;&#12391;&#12365;&#12394;&#12367;&#12394;&#12426;&#12414;&#12377;&#12290;-1&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12503;&#12525;&#12487;&#12517;&#12540;&#12469;&#12398;&#25968;&#12399;&#21046;&#38480;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;100&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12496;&#12483;&#12481;&#37197;&#20449;&#12398;&#26368;&#22823;&#12513;&#12483;&#12475;&#12540;&#12472;&#25968;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#21336;&#19968;&#12398;&#12496;&#12483;&#12481;&#12391;&#12467;&#12531;&#12471;&#12517;&#12540;&#12510;&#12395;&#37197;&#36865;&#21487;&#33021;&#12394;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#26368;&#22823;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>-1&#12434;&#25351;&#23450;&#12377;&#12427;&#12392;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#25968;&#12399;&#21046;&#38480;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;1000&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12487;&#12483;&#12489;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12461;&#12517;&#12540;&#12434;&#20351;&#29992;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;true&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#12487;&#12483;&#12489;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#12487;&#12483;&#12489;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12461;&#12517;&#12540;&#12395;&#36865;&#12426;&#12414;&#12377;&#12290;</p>
<p>&#20516;&#12434;false&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;&#12487;&#12483;&#12489;&#12539;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#30772;&#26820;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;true&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;XML&#12473;&#12461;&#12540;&#12510;&#12398;&#26908;&#35388;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;true&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#23451;&#20808;&#12391;&#12398;XML&#12473;&#12461;&#12540;&#12510;&#12398;&#22949;&#24403;&#24615;&#26908;&#26619;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#20516;&#12434;true&#12395;&#35373;&#23450;&#12377;&#12427;&#12392;&#12289;Message Queue&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12521;&#12531;&#12479;&#12452;&#12512;&#12399;XML&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#12502;&#12525;&#12540;&#12459;&#12395;&#36865;&#20449;&#12377;&#12427;&#21069;&#12395;&#12289;&#25351;&#23450;&#12375;&#12383;XML Schema Definition (XSD&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12399;DTD)&#12434;&#20351;&#29992;&#12375;&#12390;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#26908;&#35388;&#12434;&#34892;&#12356;&#12414;&#12377;&#12290;&#25351;&#23450;&#12375;&#12383;&#12473;&#12461;&#12540;&#12510;&#12364;&#35211;&#12388;&#12363;&#12425;&#12394;&#12356;&#12363;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#26908;&#35388;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12399;&#36865;&#20449;&#12373;&#12428;&#12378;&#20363;&#22806;&#12364;&#12473;&#12525;&#12540;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;false&#12395;&#35373;&#23450;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;XML&#12473;&#12461;&#12540;&#12510;URI&#12522;&#12473;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;XML Schema Definition(XSD)URI&#25991;&#23383;&#21015;&#12434;&#31354;&#30333;&#21306;&#20999;&#12426;&#12398;&#12522;&#12473;&#12488;&#12391;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>XML&#12473;&#12461;&#12540;&#12510;&#26908;&#35388;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12289;URI&#12399;XML&#12473;&#12461;&#12540;&#12510;&#26908;&#35388;&#12395;&#20351;&#29992;&#12377;&#12427;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;XSD&#12398;&#22580;&#25152;&#12434;&#25351;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref32" name="sthref32"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-jmsservice.html">JMS&#12469;&#12540;&#12499;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmshostnew.html">JMS&#12507;&#12473;&#12488;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmshostedit.html">JMS&#12507;&#12473;&#12488;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmshostdelete.html">JMS&#12507;&#12473;&#12488;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestedit.html">JMS&#29289;&#29702;&#23451;&#20808;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestdelete.html">JMS&#29289;&#29702;&#23451;&#20808;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmsflushmessages.html">JMS&#29289;&#29702;&#23451;&#20808;&#12363;&#12425;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#38500;&#21435;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldeststats.html">JMS&#29289;&#29702;&#23451;&#20808;&#12398;&#32113;&#35336;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
