<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsservice" name="task-jmsservice"></a><a id="GHJMS00026" name="GHJMS00026"></a></p>

<h4><a id="sthref20" name="sthref20"></a>JMS&#12469;&#12540;&#12499;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12377;&#12409;&#12390;&#12398;JMS&#25509;&#32154;&#12391;&#20351;&#29992;&#12377;&#12427;&#35373;&#23450;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;JMS&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>JMS&#12469;&#12540;&#12499;&#12473;&#12398;&#27083;&#25104;&#12398;&#35443;&#32048;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDVG00020"><i>Oracle GlassFish Server&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#38283;&#30330;&#12460;&#12452;&#12489;</i>&#12398;&#31532;19&#31456;&#12289;<i>Using the Java Message Service</i></a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#27083;&#25104;&#12377;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;:</p>
<ul>
<li>
<p>&#29305;&#23450;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12381;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#27083;&#25104;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;<code>server</code>&#12398;&#22580;&#21512;&#12399;&#12289;<code>server-config</code>&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p><code>default-config</code>&#12398;&#12467;&#12500;&#12540;&#12434;&#20351;&#29992;&#12377;&#12427;&#23558;&#26469;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12383;&#12417;&#12395;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#35373;&#23450;&#20516;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;<code>default-config</code>&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12391;&#12289;&#12300;Java&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;JMS&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12479;&#12452;&#12503;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;:</p>
<ul>
<li>
<p>&#12525;&#12540;&#12459;&#12523;&#12539;&#12507;&#12473;&#12488;&#12398;JMS&#12469;&#12540;&#12499;&#12473;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12300;EMBEDDED&#12301;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>JMS&#12469;&#12540;&#12499;&#12473;&#12399;GlassFish Server&#12392;&#21516;&#12376;JVM&#12510;&#12471;&#12531;&#12391;&#36215;&#21205;&#12373;&#12428;&#12414;&#12377;&#12290;&#36933;&#24310;&#21021;&#26399;&#21270;&#12395;&#12424;&#12387;&#12390;&#12289;GlassFish Server&#12398;&#36215;&#21205;&#26178;&#12391;&#12399;&#12394;&#12367;&#12289;JMS&#12469;&#12540;&#12499;&#12473;&#12395;&#26368;&#21021;&#12395;&#12450;&#12463;&#12475;&#12473;&#12375;&#12383;&#12392;&#12365;&#12395;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#22475;&#36796;&#12415;&#12502;&#12525;&#12540;&#12459;&#12434;&#36215;&#21205;&#12375;&#12414;&#12377;&#12290;JMS&#12469;&#12540;&#12499;&#12473;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12479;&#12452;&#12503;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12525;&#12540;&#12459;&#12523;&#12539;&#12507;&#12473;&#12488;&#12398;JMS&#12469;&#12540;&#12499;&#12473;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12300;LOCAL&#12301;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>JMS&#12469;&#12540;&#12499;&#12473;&#12399;GlassFish Server&#12392;&#12392;&#12418;&#12395;&#36215;&#21205;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#21029;&#12398;&#12471;&#12473;&#12486;&#12512;&#12414;&#12383;&#12399;&#12463;&#12521;&#12473;&#12479;&#12398;JMS&#12469;&#12540;&#12499;&#12473;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12300;REMOTE&#12301;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>REMOTE&#12434;&#36984;&#25246;&#12377;&#12427;&#12392;&#12289;JMS&#12469;&#12540;&#12499;&#12473;&#12399;&#27425;&#12398;&#12469;&#12540;&#12496;&#12540;&#12398;&#36215;&#21205;&#26178;&#12395;GlassFish Server&#12395;&#12424;&#12387;&#12390;&#36215;&#21205;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;JMS&#12469;&#12540;&#12499;&#12473;&#12399;Message Queue&#12395;&#12424;&#12387;&#12390;&#36215;&#21205;&#12362;&#12424;&#12403;&#31649;&#29702;&#12373;&#12428;&#12427;&#12383;&#12417;&#12289;Message Queue&#12502;&#12525;&#12540;&#12459;&#12434;&#21029;&#12395;&#36215;&#21205;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12502;&#12525;&#12540;&#12459;&#12398;&#36215;&#21205;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GMADG00227"><i>Oracle GlassFish Server Message Queue&#31649;&#29702;&#12460;&#12452;&#12489;</i>&#12398;<i>Starting Brokers</i></a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12371;&#12398;&#20516;&#12434;&#36984;&#25246;&#12375;&#12289;&#12363;&#12388;&#12522;&#12514;&#12540;&#12488;&#12539;&#12507;&#12473;&#12488;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;<a href="task-jmshostedit.html">JMS&#12507;&#12473;&#12488;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a>&#12391;&#35500;&#26126;&#12377;&#12427;&#25163;&#38918;&#12395;&#24467;&#12387;&#12390;&#12289;&#12522;&#12514;&#12540;&#12488;&#12539;&#12507;&#12473;&#12488;&#12398;&#21517;&#21069;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#36215;&#21205;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#36215;&#21205;&#12364;&#20013;&#26029;&#12373;&#12428;&#12427;&#12414;&#12391;&#12395;&#12289;GlassFish Server&#12364;JMS&#12469;&#12540;&#12499;&#12473;&#12398;&#36215;&#21205;&#12434;&#24453;&#27231;&#12377;&#12427;&#26178;&#38291;&#12434;&#31186;&#21336;&#20301;&#12391;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#20966;&#29702;&#36895;&#24230;&#12398;&#36933;&#12356;&#12471;&#12473;&#12486;&#12512;&#12420;&#12458;&#12540;&#12496;&#12540;&#12525;&#12540;&#12489;&#12375;&#12383;&#12471;&#12473;&#12486;&#12512;&#12391;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12424;&#12426;&#12418;&#22823;&#12365;&#12367;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;60&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#36215;&#21205;&#24341;&#25968;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;JMS&#12469;&#12540;&#12499;&#12473;&#12398;&#36215;&#21205;&#12434;&#12459;&#12473;&#12479;&#12510;&#12452;&#12474;&#12377;&#12427;&#24341;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>as-install-parent<code>/mq/bin/imqbrokerd</code>&#12467;&#12510;&#12531;&#12489;&#12391;&#20351;&#29992;&#12391;&#12365;&#12427;&#24341;&#25968;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20877;&#25509;&#32154;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#25509;&#32154;&#12364;&#22833;&#12431;&#12428;&#12383;&#12392;&#12365;&#12395;JMS&#12469;&#12540;&#12499;&#12473;&#12364;&#12513;&#12483;&#12475;&#12540;&#12472;&#12539;&#12469;&#12540;&#12496;&#12540;&#12414;&#12383;&#12399;AddressList&#12391;&#25351;&#23450;&#12375;&#12383;&#12450;&#12489;&#12524;&#12473;&#12398;&#12522;&#12473;&#12488;&#12395;&#20877;&#25509;&#32154;&#12434;&#35430;&#12415;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20877;&#25509;&#32154;&#12398;&#38291;&#38548;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#20877;&#25509;&#32154;&#12434;&#35430;&#34892;&#12377;&#12427;&#38291;&#38548;&#12434;&#31186;&#25968;&#12391;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#38291;&#38548;&#12399;&#12289;AddressList&#12391;&#25351;&#23450;&#12375;&#12383;&#21508;&#12450;&#12489;&#12524;&#12473;&#12362;&#12424;&#12403;&#12522;&#12473;&#12488;&#12398;&#27425;&#12398;&#12450;&#12489;&#12524;&#12473;&#12408;&#12398;&#35430;&#34892;&#12395;&#36969;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#30701;&#12377;&#12366;&#12427;&#12392;&#12289;&#12502;&#12525;&#12540;&#12459;&#12395;&#12522;&#12459;&#12496;&#12522;&#12377;&#12427;&#26178;&#38291;&#12364;&#19982;&#12360;&#12425;&#12428;&#12414;&#12379;&#12435;&#12290;&#38263;&#12377;&#12366;&#12427;&#12392;&#12289;&#20877;&#25509;&#32154;&#12364;&#21463;&#12369;&#20837;&#12428;&#12425;&#12428;&#12394;&#12356;&#36933;&#24310;&#12434;&#31034;&#12377;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;5&#31186;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20877;&#25509;&#32154;&#12398;&#35430;&#34892;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12391;&#12289;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12521;&#12531;&#12479;&#12452;&#12512;&#12364;&#12522;&#12473;&#12488;&#12398;&#27425;&#12398;&#12450;&#12489;&#12524;&#12473;&#12434;&#35430;&#34892;&#12377;&#12427;&#21069;&#12395;&#12289;AddressList&#12395;&#25351;&#23450;&#12375;&#12383;&#21508;&#12450;&#12489;&#12524;&#12473;&#12408;&#12398;&#25509;&#32154;(&#12414;&#12383;&#12399;&#20877;&#25509;&#32154;)&#12434;&#35430;&#34892;&#12377;&#12427;&#22238;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#20516;-1&#12399;&#12289;&#20877;&#35430;&#34892;&#22238;&#25968;&#12364;&#28961;&#21046;&#38480;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12539;&#12521;&#12531;&#12479;&#12452;&#12512;&#12399;&#12289;&#25509;&#32154;&#12364;&#25104;&#21151;&#12377;&#12427;&#12414;&#12391;&#26368;&#21021;&#12398;&#12450;&#12489;&#12524;&#12473;&#12408;&#12398;&#25509;&#32154;&#12434;&#35430;&#12415;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;3&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;JMS&#12507;&#12473;&#12488;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;JMS&#12507;&#12473;&#12488;&#12398;&#21517;&#21069;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>default_JMS_host</code>&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12450;&#12489;&#12524;&#12473;&#12539;&#12522;&#12473;&#12488;&#12398;&#21205;&#20316;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#25509;&#32154;&#12434;&#35430;&#34892;&#12377;&#12427;&#38918;&#24207;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p><code>random</code>&#12399;&#12289;AddressList&#12363;&#12425;&#12521;&#12531;&#12480;&#12512;&#12394;&#38918;&#24207;&#12391;&#12450;&#12489;&#12524;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#22810;&#25968;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12364;&#21516;&#12376;&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12434;&#20351;&#29992;&#12375;&#12390;&#25509;&#32154;&#12434;&#35430;&#34892;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12364;&#21516;&#12376;&#12450;&#12489;&#12524;&#12473;&#12395;&#25509;&#32154;&#12375;&#12394;&#12356;&#12424;&#12358;&#12395;<code>random</code>&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p><code>priority</code>&#12399;&#12289;&#20877;&#25509;&#32154;&#12364;&#24120;&#12395;AddressList&#12395;&#25351;&#23450;&#12375;&#12383;&#26368;&#21021;&#12398;&#12469;&#12540;&#12496;&#12540;&#12398;&#12450;&#12489;&#12524;&#12473;&#12408;&#12398;&#25509;&#32154;&#12434;&#35430;&#34892;&#12375;&#12289;&#26368;&#21021;&#12398;&#12502;&#12525;&#12540;&#12459;&#12364;&#20351;&#29992;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;&#12395;&#12398;&#12415;&#20182;&#12398;&#12450;&#12489;&#12524;&#12473;&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#12450;&#12489;&#12524;&#12473;&#12539;&#12522;&#12473;&#12488;&#12398;&#21453;&#24489;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12391;&#12289;&#25509;&#32154;&#12398;&#30906;&#31435;&#12414;&#12383;&#12399;&#20877;&#30906;&#31435;&#12398;&#12383;&#12417;&#12395;&#12289;AddressList&#12434;&#20171;&#12375;&#12390;JMS&#12469;&#12540;&#12499;&#12473;&#12364;&#21453;&#24489;&#12377;&#12427;&#22238;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#20516;-1&#12399;&#35430;&#34892;&#22238;&#25968;&#12364;&#28961;&#21046;&#38480;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;3&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20197;&#22806;&#12398;&#12473;&#12461;&#12540;&#12512;&#12414;&#12383;&#12399;&#12469;&#12540;&#12499;&#12473;&#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12300;MQ&#12473;&#12461;&#12540;&#12512;&#12301;&#12362;&#12424;&#12403;&#12300;MQ&#12469;&#12540;&#12499;&#12473;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;Message Queue&#12450;&#12489;&#12524;&#12473;&#12539;&#12473;&#12461;&#12540;&#12512;&#21517;&#12392;Message Queue&#25509;&#32154;&#12469;&#12540;&#12499;&#12473;&#21517;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#27083;&#25991;&#24773;&#22577;&#12399;&#12289;<a href="ref-mqschemeservice.html">MQ&#12473;&#12461;&#12540;&#12512;&#12392;MQ&#12469;&#12540;&#12499;&#12473;&#12398;&#12450;&#12489;&#12524;&#12473;&#12398;&#27083;&#25991;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</li>
<li>
<p>&#12300;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#38936;&#22495;&#12391;&#12289;JMS&#12469;&#12540;&#12499;&#12473;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#20351;&#29992;&#21487;&#33021;&#12394;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#35443;&#32048;&#12399;&#12289;<a href="ref-jmsservice-additional-props.html">JMS&#12469;&#12540;&#12499;&#12473;&#12395;&#22266;&#26377;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<ul>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#34920;&#31034;&#12373;&#12428;&#12427;&#31354;&#30333;&#34892;&#12391;&#12289;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#21517;&#12434;&#20837;&#21147;&#12375;&#12289;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;&#12289;&#12381;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#32232;&#38598;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;&#12289;&#21066;&#38500;&#12377;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12398;&#24038;&#20596;&#12395;&#12354;&#12427;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21066;&#38500;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;Ping&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#12289;JMS&#12469;&#12540;&#12499;&#12473;&#12364;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;JMS&#12507;&#12473;&#12488;&#12391;&#23455;&#34892;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12414;&#12377;&#12290;</p>
<p>JMS&#12469;&#12540;&#12499;&#12473;&#12364;&#31292;&#20685;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;ping&#12398;&#25104;&#21151;&#12434;&#31034;&#12377;&#12513;&#12483;&#12475;&#12540;&#12472;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#12498;&#12531;&#12488;:</b></p>
&#12487;&#12501;&#12457;&#12523;&#12488;&#35373;&#23450;&#12395;&#36820;&#12377;&#12395;&#12399;&#12289;&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12489;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12289;&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;<br />
<hr>

</li>
</ol>
<a id="sthref21" name="sthref21"></a>
<h5>&#12522;&#12514;&#12540;&#12488;&#12539;&#12469;&#12540;&#12496;&#12540;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;</h5>
<p>&#12503;&#12525;&#12496;&#12452;&#12480;&#12392;&#12507;&#12473;&#12488;&#12434;&#12522;&#12514;&#12540;&#12488;&#12539;&#12471;&#12473;&#12486;&#12512;&#12395;&#22793;&#26356;&#12377;&#12427;&#12392;&#12289;&#12377;&#12409;&#12390;&#12398;JMS&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12522;&#12514;&#12540;&#12488;&#12539;&#12469;&#12540;&#12496;&#12540;&#12391;&#23455;&#34892;&#12377;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12525;&#12540;&#12459;&#12523;&#12539;&#12469;&#12540;&#12496;&#12540;&#12392;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12522;&#12514;&#12540;&#12488;&#12539;&#12469;&#12540;&#12496;&#12540;&#12434;&#20351;&#29992;&#12377;&#12427;&#12395;&#12399;&#12289;&#12522;&#12514;&#12540;&#12488;&#12539;&#12469;&#12540;&#12496;&#12540;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#25509;&#32154;&#12434;&#20316;&#25104;&#12377;&#12427;<code>AddressList</code>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;<a href="task-jmsconnectionnew.html">JMS&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<a id="sthref22" name="sthref22"></a>
<h5>&#21516;&#31561;&#12398;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<p><code>jms-ping</code></p>
<a id="sthref23" name="sthref23"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-jmshostnew.html">JMS&#12507;&#12473;&#12488;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmshostedit.html">JMS&#12507;&#12473;&#12488;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmshostdelete.html">JMS&#12507;&#12473;&#12488;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestnew.html">JMS&#29289;&#29702;&#23451;&#20808;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestedit.html">JMS&#29289;&#29702;&#23451;&#20808;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestdelete.html">JMS&#29289;&#29702;&#23451;&#20808;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmsflushmessages.html">JMS&#29289;&#29702;&#23451;&#20808;&#12363;&#12425;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#38500;&#21435;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldeststats.html">JMS&#29289;&#29702;&#23451;&#20808;&#12398;&#32113;&#35336;&#12434;&#34920;&#31034;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
