<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsconnectionedit" name="task-jmsconnectionedit"></a></p>

<h4><a id="sthref5" name="sthref5"></a><a id="sthref6" name="sthref6"></a>JMS&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#12522;&#12477;&#12540;&#12473;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12522;&#12477;&#12540;&#12473;&#12301;&#12494;&#12540;&#12489;&#12391;&#12289;&#12300;JMS&#12522;&#12477;&#12540;&#12473;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;JMS&#12522;&#12477;&#12540;&#12473;&#12301;&#12494;&#12540;&#12489;&#12391;&#12289;&#12300;JMS&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;JMS&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;JMS&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#32232;&#38598;&#12377;&#12427;&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12398;&#21517;&#21069;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;JMS&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12434;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#35500;&#26126;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12398;&#35500;&#26126;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#23455;&#34892;&#26178;&#12395;&#12522;&#12477;&#12540;&#12473;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12473;&#12486;&#12540;&#12479;&#12473;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#21021;&#26399;&#12362;&#12424;&#12403;&#26368;&#23567;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12503;&#12540;&#12523;&#12398;&#26368;&#23567;&#25509;&#32154;&#25968;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;8&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26368;&#22823;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12503;&#12540;&#12523;&#12398;&#26368;&#22823;&#25509;&#32154;&#25968;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;32&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;&#22793;&#26356;&#37327;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12503;&#12540;&#12523;&#12398;&#12450;&#12452;&#12489;&#12523;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12395;&#36948;&#12375;&#12383;&#12392;&#12365;&#12395;&#38500;&#21435;&#12377;&#12427;&#25509;&#32154;&#12398;&#25968;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;2&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12450;&#12452;&#12489;&#12523;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#25509;&#32154;&#12364;&#12503;&#12540;&#12523;&#20869;&#12391;&#12450;&#12452;&#12489;&#12523;&#29366;&#24907;&#12434;&#32173;&#25345;&#12391;&#12365;&#12427;&#26368;&#22823;&#26178;&#38291;&#12434;&#31186;&#21336;&#20301;&#12391;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;300&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26368;&#22823;&#24453;&#27231;&#26178;&#38291;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#25509;&#32154;&#12434;&#12522;&#12463;&#12456;&#12473;&#12488;&#12375;&#12390;&#12356;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#25509;&#32154;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12395;&#12394;&#12427;&#12414;&#12391;&#12398;&#26368;&#22823;&#26178;&#38291;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;60000&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12377;&#12409;&#12390;&#12398;&#38556;&#23475;&#26178;&#12301;&#12398;&#12300;&#12377;&#12409;&#12390;&#12398;&#25509;&#32154;&#12434;&#38281;&#12376;&#12427;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#25509;&#32154;&#12398;&#12358;&#12385;&#12398;1&#12388;&#12395;&#38556;&#23475;&#12364;&#30330;&#29983;&#12375;&#12383;&#22580;&#21512;&#12395;&#12289;GlassFish Server&#12364;&#12503;&#12540;&#12523;&#20869;&#12398;&#12377;&#12409;&#12390;&#12398;&#25509;&#32154;&#12434;&#38281;&#12376;&#12390;&#12289;&#12371;&#12428;&#12425;&#12434;&#20877;&#30906;&#31435;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#20351;&#29992;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;&#12398;&#12415;&#20491;&#12293;&#12398;&#25509;&#32154;&#12364;&#20877;&#30906;&#31435;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>JMS&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12539;&#12522;&#12477;&#12540;&#12473;&#12398;&#12300;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12469;&#12509;&#12540;&#12488;&#12301;&#12398;&#20516;&#12434;&#12289;&#27425;&#12398;&#12424;&#12358;&#12395;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<ul>
<li>
<p>&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12473;&#12467;&#12540;&#12503;&#20869;&#12391;&#35079;&#25968;&#12398;&#12522;&#12477;&#12540;&#12473;&#12398;&#20351;&#29992;&#12364;&#24517;&#35201;&#12392;&#12394;&#12427;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12392;&#12375;&#12390;&#20351;&#29992;&#21487;&#33021;&#12394;&#12522;&#12477;&#12540;&#12473;&#12395;<code>XATransaction</code>(&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;)&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12383;&#12392;&#12360;&#12400;&#12289;&#12371;&#12398;&#12522;&#12477;&#12540;&#12473;&#12395;&#12399;&#12289;JDBC&#12522;&#12477;&#12540;&#12473;&#12289;&#12467;&#12493;&#12463;&#12479;&#12539;&#12522;&#12477;&#12540;&#12473;&#12289;&#12414;&#12383;&#12399;&#12381;&#12398;&#20182;&#12398;JMS&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12539;&#12522;&#12477;&#12540;&#12473;&#12418;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#20516;&#12395;&#12424;&#12426;&#12289;&#26368;&#39640;&#12398;&#26580;&#36575;&#24615;&#12364;&#25552;&#20379;&#12373;&#12428;&#12414;&#12377;&#12290;<code>XATransaction</code>&#12392;&#12375;&#12390;&#27083;&#25104;&#12373;&#12428;&#12427;&#12522;&#12477;&#12540;&#12473;&#12399;&#12289;2&#12501;&#12455;&#12540;&#12474;&#12539;&#12467;&#12511;&#12483;&#12488;&#25805;&#20316;&#12395;&#38306;&#19982;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12473;&#12467;&#12540;&#12503;&#20869;&#12398;&#12522;&#12477;&#12540;&#12473;&#12364;1&#12388;&#12398;&#12415;&#24517;&#35201;&#12392;&#12394;&#12427;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;&#20351;&#29992;&#21487;&#33021;&#12394;&#12522;&#12477;&#12540;&#12473;&#12289;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;XA&#12522;&#12477;&#12540;&#12473;&#12364;&#24517;&#35201;&#12392;&#12394;&#12427;&#20998;&#25955;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#26368;&#32066;&#12456;&#12540;&#12472;&#12455;&#12531;&#12488;&#12392;&#12375;&#12390;&#20351;&#29992;&#21487;&#33021;&#12394;&#12522;&#12477;&#12540;&#12473;&#12395;<code>LocalTransaction</code>&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#20516;&#12395;&#12424;&#12426;&#12289;&#22823;&#24133;&#12394;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#21521;&#19978;&#12364;&#24471;&#12425;&#12428;&#12414;&#12377;&#12290;<code>LocalTransaction</code>&#12392;&#12375;&#12390;&#27083;&#25104;&#12373;&#12428;&#12427;&#12522;&#12477;&#12540;&#12473;&#12399;&#12289;2&#12501;&#12455;&#12540;&#12474;&#12539;&#12467;&#12511;&#12483;&#12488;&#25805;&#20316;&#12395;&#20351;&#29992;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p>&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12395;&#12414;&#12387;&#12383;&#12367;&#38306;&#19982;&#12375;&#12394;&#12356;&#12522;&#12477;&#12540;&#12473;&#12395;<code>NoTransaction</code>&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#35373;&#23450;&#12399;JMS&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12398;&#20351;&#29992;&#12395;&#38480;&#12425;&#12428;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#25509;&#32154;&#26908;&#35388;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#25509;&#32154;&#26908;&#35388;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12398;&#34920;&#12391;&#12289;&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#20351;&#29992;&#21487;&#33021;&#12394;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#35443;&#32048;&#12399;&#12289;<a href="ref-jmsconnectionproperties.html">JMS&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12395;&#22266;&#26377;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<ul>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#34920;&#31034;&#12373;&#12428;&#12427;&#31354;&#30333;&#34892;&#12391;&#12289;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#21517;&#12434;&#20837;&#21147;&#12375;&#12289;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;&#12289;&#12381;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#32232;&#38598;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;&#12289;&#21066;&#38500;&#12377;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12398;&#24038;&#20596;&#12395;&#12354;&#12427;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21066;&#38500;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#12289;&#12300;&#12479;&#12540;&#12466;&#12483;&#12488;&#12301;&#12479;&#12502;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;JMS&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12539;&#12522;&#12477;&#12540;&#12473;&#12539;&#12479;&#12540;&#12466;&#12483;&#12488;&#12539;&#12506;&#12540;&#12472;&#12395;&#31227;&#21205;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12506;&#12540;&#12472;&#12391;&#12289;&#27425;&#12434;&#34892;&#12356;&#12414;&#12377;:</p>
<ol type="a">
<li>
<p>&#12300;&#12479;&#12540;&#12466;&#12483;&#12488;&#12398;&#31649;&#29702;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#12300;&#12522;&#12477;&#12540;&#12473;&#12539;&#12479;&#12540;&#12466;&#12483;&#12488;&#12398;&#31649;&#29702;&#12301;&#12506;&#12540;&#12472;&#12434;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;&#20351;&#29992;&#21487;&#33021;&#12301;&#21015;&#12392;&#36984;&#25246;&#21015;&#12392;&#12398;&#38291;&#12391;&#12479;&#12540;&#12466;&#12483;&#12488;&#12434;&#31227;&#21205;&#12375;&#12414;&#12377;&#12290;&#12522;&#12477;&#12540;&#12473;&#12434;&#20351;&#29992;&#12377;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12487;&#12503;&#12525;&#12452;&#12377;&#12427;&#12479;&#12540;&#12466;&#12483;&#12488;(&#35079;&#25968;&#21487;)&#12434;&#36984;&#25246;&#21015;&#12395;&#37197;&#32622;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#20351;&#29992;&#21487;&#33021;&#12394;&#12479;&#12540;&#12466;&#12483;&#12488;&#12395;&#12399;&#12289;&#20351;&#29992;&#21487;&#33021;&#12394;&#12463;&#12521;&#12473;&#12479;&#12362;&#12424;&#12403;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#21152;&#12360;&#12390;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;<code>server</code>&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;&#12300;OK&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#22793;&#26356;&#12434;&#20445;&#23384;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12479;&#12540;&#12466;&#12483;&#12488;&#12398;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12383;&#24460;&#12289;&#12300;&#26377;&#21177;&#12301;&#12414;&#12383;&#12399;&#12300;&#28961;&#21177;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12390;&#12289;&#12381;&#12398;&#12479;&#12540;&#12466;&#12483;&#12488;&#12398;&#12522;&#12477;&#12540;&#12473;&#12434;&#26377;&#21177;&#12414;&#12383;&#12399;&#28961;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#12498;&#12531;&#12488;:</b></p>
&#12487;&#12501;&#12457;&#12523;&#12488;&#35373;&#23450;&#12395;&#36820;&#12377;&#12395;&#12399;&#12289;&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12489;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12289;&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;<br />
<hr>

</li>
</ol>
<a id="sthref7" name="sthref7"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-jmsconnectionnew.html">JMS&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">JMS&#25509;&#32154;&#12501;&#12449;&#12463;&#12488;&#12522;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmsdestinationnew.html">JMS&#23451;&#20808;&#12522;&#12477;&#12540;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmsdestinationedit.html">JMS&#23451;&#20808;&#12522;&#12477;&#12540;&#12473;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-jmsdestinationdelete.html">JMS&#23451;&#20808;&#12522;&#12477;&#12540;&#12473;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
