<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-generaltab" name="ref-generaltab"></a></p>

<h4><a id="sthref233" name="sthref233"></a><a id="sthref234" name="sthref234"></a>&#19968;&#33324;&#36039;&#35338;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>GlassFish Server &#22312;&#23433;&#35037;&#26178;&#26371;&#24314;&#31435;&#19968;&#20491;&#21517;&#31281;&#28858; <code>server</code> &#30340;&#25033;&#29992;&#31243;&#24335;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#12290;&#22914;&#26377;&#38656;&#35201;&#65292;&#24744;&#21487;&#20197;&#21034;&#38500;&#35442;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#65292;&#20006;&#20351;&#29992;&#20854;&#20182;&#21517;&#31281;&#24314;&#31435;&#19968;&#20491;&#26032;&#30340;&#22519;&#34892;&#34389;&#29702;&#12290;</p>
<p>&#27599;&#20491; GlassFish Server &#22519;&#34892;&#34389;&#29702;&#22343;&#26377;&#33258;&#24049;&#30340; Java &#32068;&#24907;&#12289;Java &#36039;&#28304;&#12289;&#25033;&#29992;&#31243;&#24335;&#24314;&#32622;&#21312;&#22495;&#20197;&#21450;&#20282;&#26381;&#22120;&#32068;&#24907;&#35373;&#23450;&#12290;&#35722;&#26356;&#26576;&#20491;&#25033;&#29992;&#31243;&#24335;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#20006;&#19981;&#26371;&#24433;&#38911;&#20854;&#20182;&#25033;&#29992;&#31243;&#24335;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#12290;&#19968;&#20491;&#31649;&#29702;&#32178;&#22495;&#20013;&#21487;&#26377;&#19968;&#20491;&#25033;&#29992;&#31243;&#24335;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#12290;</p>
<p>&#23565;&#22810;&#25976;&#20351;&#29992;&#32773;&#32780;&#35328;&#65292;&#19968;&#20491;&#25033;&#29992;&#31243;&#24335;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#24050;&#21487;&#28415;&#36275;&#20854;&#38656;&#27714;&#12290;&#19981;&#36942;&#65292;&#20381;&#25818;&#24744;&#30340;&#29872;&#22659;&#65292;&#24744;&#21487;&#33021;&#24819;&#24314;&#31435;&#19968;&#25110;&#22810;&#20491;&#38989;&#22806;&#30340;&#25033;&#29992;&#31243;&#24335;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#12290;&#20363;&#22914;&#65292;&#22312;&#38283;&#30332;&#29872;&#22659;&#19979;&#65292;&#24744;&#21487;&#20197;&#20351;&#29992;&#19981;&#21516;&#30340;&#25033;&#29992;&#31243;&#24335;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#20358;&#28204;&#35430;&#19981;&#21516;&#30340; GlassFish Server &#32068;&#24907;&#65292;&#25110;&#32773;&#26159;&#27604;&#36611;&#21644;&#28204;&#35430;&#19981;&#21516;&#30340;&#25033;&#29992;&#31243;&#24335;&#24314;&#32622;&#12290;&#30001;&#26044;&#21487;&#20197;&#36629;&#39686;&#22320;&#22686;&#21152;&#25110;&#21034;&#38500;&#25033;&#29992;&#31243;&#24335;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#65292;&#22240;&#27492;&#24744;&#21487;&#20197;&#20351;&#29992;&#36889;&#20123;&#22519;&#34892;&#34389;&#29702;&#24314;&#31435;&#26283;&#26178;&#30340;&#12300;&#27801;&#31665;&#12301;&#21312;&#22495;&#65292;&#22312;&#38283;&#30332;&#26178;&#36914;&#34892;&#23526;&#39511;&#12290;</p>
<p>&#27492;&#22806;&#65292;&#24744;&#20063;&#21487;&#20197;&#28858;&#27599;&#20491;&#25033;&#29992;&#31243;&#24335;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#24314;&#31435;&#34395;&#25836;&#20282;&#26381;&#22120;&#12290;&#22312;&#21934;&#19968;&#23433;&#35037;&#30340;&#25033;&#29992;&#31243;&#24335;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#20013;&#65292;&#24744;&#21487;&#20197;&#25552;&#20379;&#20844;&#21496;&#25110;&#20491;&#20154;&#30340;&#32178;&#22495;&#21517;&#31281;&#12289;IP &#20301;&#22336;&#20197;&#21450;&#19968;&#20123;&#31649;&#29702;&#21151;&#33021;&#12290;&#23565;&#20351;&#29992;&#32773;&#32780;&#35328;&#65292;&#36889;&#23601;&#20687;&#26159;&#25793;&#26377;&#33258;&#24049;&#30340; Web &#20282;&#26381;&#22120;&#65292;&#21371;&#19981;&#38656;&#35201;&#36914;&#34892;&#30828;&#39636;&#33287;&#22522;&#26412;&#30340;&#20282;&#26381;&#22120;&#32173;&#35703;&#12290;&#34395;&#25836;&#20282;&#26381;&#22120;&#28961;&#27861;&#36328;&#25033;&#29992;&#31243;&#24335;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#20351;&#29992;&#12290;&#22914;&#38656;&#26377;&#38364;&#34395;&#25836;&#20282;&#26381;&#22120;&#30340;&#35443;&#32048;&#36039;&#35338;&#65292;&#35531;&#21443;&#38321;<a href="ref-serverinstjvmgeneral.html">JVM &#19968;&#33324;&#35373;&#23450;</a>&#12290;</p>
<p>&#22312;&#20316;&#26989;&#29992;&#30340;&#24314;&#32622;&#19978;&#65292;&#24744;&#21487;&#20197;&#37341;&#23565;&#22810;&#31278;&#29992;&#36884;&#20351;&#29992;&#34395;&#25836;&#20282;&#26381;&#22120;&#20358;&#26367;&#20195;&#22810;&#20491;&#25033;&#29992;&#31243;&#24335;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#12290;&#19981;&#36942;&#65292;&#33509;&#34395;&#25836;&#20282;&#26381;&#22120;&#19981;&#31526;&#21512;&#24744;&#30340;&#38656;&#27714;&#65292;&#24744;&#20063;&#21487;&#20351;&#29992;&#22810;&#20491;&#25033;&#29992;&#31243;&#24335;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#12290;</p>
<p>GlassFish Server &#22519;&#34892;&#34389;&#29702;&#19981;&#26371;&#33258;&#21205;&#21855;&#21205;&#12290;&#19968;&#26086;&#21855;&#21205;&#22519;&#34892;&#34389;&#29702;&#65292;&#22519;&#34892;&#34389;&#29702;&#26371;&#25345;&#32396;&#22519;&#34892;&#30452;&#21040;&#24744;&#23559;&#20854;&#20572;&#27490;&#28858;&#27490;&#12290;&#20572;&#27490;&#25033;&#29992;&#31243;&#24335;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#24460;&#65292;&#23601;&#26371;&#20572;&#27490;&#25509;&#21463;&#26032;&#36899;&#32218;&#65292;&#20006;&#31561;&#24453;&#25152;&#26377;&#26410;&#34389;&#29702;&#30340;&#36899;&#32218;&#23436;&#25104;&#12290;&#33509;&#24744;&#30340;&#27231;&#22120;&#30070;&#27231;&#25110;&#38626;&#32218;&#65292;&#20282;&#26381;&#22120;&#23601;&#26371;&#32080;&#26463;&#65292;&#20006;&#19988;&#26371;&#36986;&#22833;&#27491;&#22312;&#34389;&#29702;&#30340;&#20219;&#20309;&#35531;&#27714;&#12290;</p>
<p>&#20351;&#29992;&#12300;&#19968;&#33324;&#36039;&#35338;&#12301;&#38913;&#38754;&#21487;&#39511;&#35657; GlassFish Server &#35373;&#23450;&#20197;&#21450;&#27298;&#35222; Java &#34395;&#25836;&#27231;&#22120;&#36039;&#26009;&#12290;</p>
<p>&#12300;&#19968;&#33324;&#36039;&#35338;&#12301;&#38913;&#38754;&#21253;&#21547;&#20197;&#19979;&#36039;&#35338;&#12290;</p>
<dl>
<dt>&#20572;&#27490;&#25353;&#37397;</dt>
<dd>
<p>&#25353;&#19968;&#19979;&#12300;&#20572;&#27490;&#12301;&#25353;&#37397;&#20197;&#20572;&#27490; GlassFish Server&#12290;</p>
</dd>
<dt>&#37325;&#26032;&#21855;&#21205;&#25353;&#37397;</dt>
<dd>
<p>&#25353;&#19968;&#19979;&#12300;&#37325;&#26032;&#21855;&#21205;&#12301;&#25353;&#37397;&#20197;&#37325;&#26032;&#21855;&#21205; GlassFish Server&#12290;</p>
</dd>
<dt>&#27298;&#35222;&#26085;&#35468;&#27284;&#25353;&#37397;</dt>
<dd>
<p>&#25353;&#19968;&#19979;&#12300;&#27298;&#35222;&#26085;&#35468;&#27284;&#12301;&#25353;&#37397;&#65292;&#21487;&#27298;&#35222; GlassFish Server &#22519;&#34892;&#34389;&#29702;&#25110;&#21474;&#38598;&#30340;&#26085;&#35468;&#27284;&#12290;</p>
</dd>
<dt>&#24490;&#29872;&#26085;&#35468;&#25353;&#37397;</dt>
<dd>
<p>&#25353;&#19968;&#19979;&#12300;&#24490;&#29872;&#26085;&#35468;&#12301;&#25353;&#37397;&#65292;&#21487;&#24490;&#29872;&#31649;&#29702;&#20282;&#26381;&#22120; (&#21517;&#28858; <code>server</code>) &#30340;&#26085;&#35468;&#27284;&#12290;</p>
</dd>
<dt>&#24489;&#21407;&#20316;&#26989;&#20107;&#20214;&#25353;&#37397;</dt>
<dd>
<p>&#25353;&#19968;&#19979;&#12300;&#24489;&#21407;&#20316;&#26989;&#20107;&#20214;&#12301;&#25353;&#37397;&#65292;&#21487;&#24489;&#21407;<a href="ref-recovertransactions.html">&#24489;&#21407;&#20316;&#26989;&#20107;&#20214;</a>&#38913;&#38754;&#19978;&#31649;&#29702;&#20282;&#26381;&#22120; (&#21517;&#28858; <code>server</code>) &#30340;&#20316;&#26989;&#20107;&#20214;&#12290;</p>
</dd>
<dt>&#23433;&#20840;&#31649;&#29702;&#25353;&#37397;</dt>
<dd>
<p>&#22312;<a href="ref-securityadmin.html">&#23433;&#20840;&#31649;&#29702;</a>&#38913;&#38754;&#19978;&#25353;&#19968;&#19979;&#12300;&#23433;&#20840;&#31649;&#29702;&#12301;&#25353;&#37397;&#65292;&#21487;&#21855;&#29992;&#25110;&#20572;&#29992;&#23433;&#20840;&#31649;&#29702;&#12290;</p>
</dd>
<dt>&#21517;&#31281;</dt>
<dd>
<p>&#30446;&#21069;&#20282;&#26381;&#22120;&#30340;&#21517;&#31281;&#12290;</p>
</dd>
<dt>&#29376;&#24907;</dt>
<dd>
<p>&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#30340;&#30446;&#21069;&#29376;&#24907;&#12290;&#20282;&#26381;&#22120;&#21487;&#20197;&#26159;&#24050;&#20572;&#27490;&#12289;&#24050;&#21855;&#21205;&#25110;&#22519;&#34892;&#20013;&#12290;</p>
</dd>
<dt>&#27491;&#24120;&#22519;&#34892;&#26178;&#38291;</dt>
<dd>
<p>&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#24050;&#36899;&#32396;&#22519;&#34892;&#30340;&#23567;&#26178;&#33287;&#20998;&#37912;&#25976;&#12290;&#36889;&#26159;&#21807;&#35712;&#27396;&#20301;&#12290;</p>
</dd>
<dt>HTTP &#36000;&#36617;&#24179;&#34913;&#31243;&#24335;</dt>
<dd>
<p>&#36000;&#36617;&#24179;&#34913;&#31243;&#24335;&#30340;&#21517;&#31281; (&#22914;&#26524;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#24050;&#21855;&#29992;&#36000;&#36617;&#24179;&#34913;&#31243;&#24335;&#30340;&#35441;)&#12290;</p>
</dd>
<dt>JVM</dt>
<dd>
<p>&#22914;&#26524;&#25353;&#19968;&#19979;&#12300;JVM &#22577;&#21578;&#12301;&#65292;&#26371;&#38283;&#21855;&#21478;&#22806;&#19968;&#20491;&#35222;&#31383;&#20006;&#39023;&#31034; Java &#34395;&#25836;&#27231;&#22120;&#30340;&#30456;&#38364;&#22577;&#21578;&#65292;&#21253;&#25324;&#25688;&#35201;&#22577;&#21578;&#12289;&#35352;&#25014;&#39636;&#31649;&#29702;&#21644;&#36039;&#28304;&#22238;&#25910;&#22577;&#21578;&#12289;&#39006;&#21029;&#36617;&#20837;&#22577;&#21578;&#20197;&#21450;&#30446;&#21069;&#32363;&#32218;&#20670;&#21360;&#12290;</p>
</dd>
<dt>&#32068;&#24907;&#30446;&#37636;</dt>
<dd>
<p>&#20027;&#27231;&#38651;&#33126;&#19978;&#21253;&#21547;&#32068;&#24907;&#27284;&#26696; (&#22914; <code>domain.xml</code>) &#30340;&#30446;&#37636;&#12290;</p>
</dd>
<dt>&#23433;&#35037;&#30340;&#29256;&#26412;</dt>
<dd>
<p>&#29986;&#21697;&#29256;&#26412;&#35672;&#21029;&#30908;&#12290;</p>
</dd>
<dt>&#23433;&#20840;&#31649;&#29702;</dt>
<dd>
<p>&#23433;&#20840;&#31649;&#29702;&#30340;&#30446;&#21069;&#29376;&#24907;&#12290;&#21487;&#33021;&#30340;&#20540;&#28858;&#12300;&#24050;&#21855;&#29992;&#12301;&#33287;&#12300;&#26410;&#21855;&#29992;&#12301;&#12290;</p>
</dd>
<dt>&#38500;&#37679;</dt>
<dd>
<p>&#30906;&#23450;&#26159;&#21542;&#24050;&#21855;&#29992;&#38500;&#37679;&#21151;&#33021;&#12290;&#33509;&#24050;&#21855;&#29992;&#38500;&#37679;&#21151;&#33021;&#65292;&#21063;&#26371;&#21516;&#26178;&#39023;&#31034;&#36899;&#25509;&#22496;&#34399;&#30908;&#12290;</p>
</dd>
<dt>HTTP &#36899;&#25509;&#22496;</dt>
<dd>
<p>&#30446;&#21069;&#32068;&#24907;&#29992;&#26044; HTTP &#35531;&#27714;&#33287;&#22238;&#25033;&#30340;&#36899;&#25509;&#22496;&#12290;</p>
</dd>
<dt>IIOP &#36899;&#25509;&#22496;</dt>
<dd>
<p>&#30446;&#21069;&#32068;&#24907;&#29992;&#26044; IIOP &#35531;&#27714;&#33287;&#22238;&#25033;&#30340;&#36899;&#25509;&#22496;&#12290;</p>
</dd>
</dl>
<a id="sthref235" name="sthref235"></a>
<h5>&#30456;&#38364;&#20316;&#26989;</h5>
<ul>
<li>
<p><a href="task-generaltab.html">&#27298;&#35222; DAS &#30340;&#19968;&#33324;&#36039;&#35338;</a></p>
</li>
<li>
<p><a href="task-logviewer.html">&#27298;&#35222; DAS &#30340;&#26085;&#35468;&#27284;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
