<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-uc-concepts" name="ref-uc-concepts"></a><a id="GHCOM00133" name="GHCOM00133"></a></p>

<h4><a id="sthref466" name="sthref466"></a>&#26356;&#26032;&#24037;&#20855;&#37325;&#35201;&#27010;&#24565;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#26356;&#26032;&#24037;&#20855;&#31649;&#29702; GlassFish Server &#36575;&#39636;&#20803;&#20214;&#30340;&#23433;&#35037;&#20316;&#26989;&#65292;&#22312;&#31995;&#32113;&#30340;&#21934;&#19968;&#27284;&#26696;&#31995;&#32113;&#30446;&#37636;&#19979;&#21253;&#21547;&#36889;&#20123;&#20803;&#20214;&#12290;</p>
<p>&#26356;&#26032;&#24037;&#20855;&#30340;&#31649;&#29702;&#20027;&#25511;&#21488;&#29256;&#26412;&#33021;&#35731;&#24744;&#36914;&#34892;&#20197;&#19979;&#20316;&#26989;&#65306;</p>
<ul>
<li>
<p>&#23433;&#35037;&#38468;&#21152;&#20803;&#20214;</p>
</li>
<li>
<p>&#27298;&#35222;&#24050;&#23433;&#35037;&#20803;&#20214;&#30340;&#26356;&#26032;</p>
</li>
<li>
<p>&#27298;&#35222;&#24050;&#23433;&#35037;&#30340;&#20803;&#20214;</p>
</li>
</ul>
<p>&#33509;&#35201;&#26356;&#26032;&#25110;&#31227;&#38500;&#24050;&#23433;&#35037;&#30340;&#20803;&#20214;&#65292;&#24744;&#24517;&#38920;&#20572;&#27490; GlassFish Server &#32178;&#22495;&#65292;&#28982;&#24460;&#20351;&#29992;&#19979;&#21015;&#20854;&#20013;&#19968;&#20491;&#21629;&#20196;&#65306;</p>
<ul>
<li>
<p><i>as-install-parent</i><code>/bin/updatetool</code>&#65292;&#36889;&#26371;&#21855;&#21205;&#26356;&#26032;&#24037;&#20855;&#22294;&#24418;&#21270;&#20844;&#29992;&#31243;&#24335;</p>
</li>
<li>
<p><i>as-install-parent</i><code>/bin/pkg</code>&#65292;&#36889;&#26159;&#21629;&#20196;&#34892;&#29256;&#26412;&#30340;&#26356;&#26032;&#24037;&#20855;</p>
</li>
</ul>
<p>&#19979;&#21015;&#31456;&#31680;&#35498;&#26126;&#26356;&#26032;&#24037;&#20855;&#30340;&#37325;&#35201;&#27010;&#24565;&#12290;</p>
<a id="ref-uc-about-component" name="ref-uc-about-component"></a>
<h5>&#20803;&#20214;</h5>
<p>&#20803;&#20214;&#26159;&#26356;&#26032;&#24037;&#20855;&#25152;&#31649;&#29702;&#30340;&#21487;&#23433;&#35037;&#21934;&#20803;&#12290;&#20803;&#20214;&#30001;&#23433;&#35037;&#24433;&#20687;&#20839;&#23433;&#35037;&#28858;&#31995;&#32113;&#21934;&#20803;&#30340;&#27284;&#26696;&#25152;&#32068;&#25104;&#12290;</p>
<a id="ref-uc-about-image" name="ref-uc-about-image"></a>
<h5>&#23433;&#35037;&#24433;&#20687;</h5>
<p>&#23433;&#35037;&#24433;&#20687;&#26159;&#21253;&#21547;&#36575;&#39636;&#20803;&#20214;&#30340;&#30446;&#37636;&#65292;&#21253;&#25324;&#30446;&#37636;&#30340;&#20839;&#23481;&#12290;&#19979;&#36617;&#21450;&#23433;&#35037; GlassFish Server &#36575;&#39636;&#20043;&#24460;&#65292;&#21363;&#26371;&#23559;&#23433;&#35037;&#24433;&#20687;&#22686;&#21152;&#33267;&#26356;&#26032;&#24037;&#20855;&#12290;&#33509;&#35201;&#21855;&#29992; GlassFish Server &#36575;&#39636;&#20803;&#20214;&#30340;&#26032;&#22686;&#21644;&#26356;&#26032;&#21151;&#33021;&#65292;&#27599;&#20491;&#23433;&#35037;&#24433;&#20687;&#24517;&#38920;&#21253;&#21547;&#26377;&#38364;&#36889;&#20123;&#20803;&#20214;&#30340;&#23433;&#35037;&#36039;&#35338;&#12290;</p>
<a id="ref-uc-about-repository" name="ref-uc-about-repository"></a>
<h5>&#32178;&#36335;&#20786;&#23384;&#24235;</h5>
<p>&#32178;&#36335;&#20786;&#23384;&#24235;&#21253;&#21547;&#19979;&#21015;&#38917;&#30446;&#65306;</p>
<ul>
<li>
<p>&#21487;&#22686;&#21152;&#33267;&#23433;&#35037;&#24433;&#20687;&#30340;&#20803;&#20214;</p>
</li>
<li>
<p>&#23565;&#23433;&#35037;&#24433;&#20687;&#20013;&#29694;&#26377;&#20803;&#20214;&#30340;&#26356;&#26032;</p>
</li>
</ul>
<p>&#23433;&#35037;&#24433;&#20687;&#26371;&#33287;&#19968;&#25110;&#22810;&#20491;&#32178;&#36335;&#20786;&#23384;&#24235;&#30456;&#38364;&#12290;&#27599;&#20491;&#32178;&#36335;&#20786;&#23384;&#24235;&#26371;&#20197;&#21517;&#31281;&#21644;&#30456;&#38364;&#30340; URL &#34920;&#31034;&#12290;&#27599;&#20491;&#23433;&#35037;&#24433;&#20687;&#30342;&#20855;&#26377;&#21807;&#19968;&#30340;&#20786;&#23384;&#24235;&#21517;&#31281;&#65292;&#27492;&#21517;&#31281;&#20195;&#34920;&#31649;&#29702;&#20786;&#23384;&#24235;&#30340;&#32068;&#32340;&#25110;&#23560;&#26696;&#65292;&#20197;&#21450;&#26126;&#30906;&#30340;&#20839;&#23481;&#31684;&#22285;&#12290;&#22914;&#38656;&#30637;&#35299;&#26356;&#22810;&#38928;&#20808;&#28858; GlassFish Server &#32068;&#24907;&#30340;&#32178;&#36335;&#20786;&#23384;&#24235;&#30456;&#38364;&#36039;&#35338;&#65292;&#35531;&#21443;&#38321; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSADG00569"><i>Oracle GlassFish Server Administration Guide</i> &#20013;&#30340; <i>Preconfigured Repositories for GlassFish Server</i></a>&#12290;</p>
<a id="ref-uc-about-addon" name="ref-uc-about-addon"></a>
<h5>&#38468;&#21152;&#20803;&#20214;</h5>
<p>&#38468;&#21152;&#20803;&#20214;&#26159;&#23578;&#26410;&#23433;&#35037;&#30340;&#23433;&#35037;&#24433;&#20687;&#20803;&#20214;&#12290;</p>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
