<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-serverinstappsconfig" name="ref-serverinstappsconfig"></a><a id="GHCOM00053" name="GHCOM00053"></a></p>

<h4><a id="sthref227" name="sthref227"></a><a id="sthref228" name="sthref228"></a><a id="sthref229" name="sthref229"></a><a id="sthref230" name="sthref230"></a><a id="sthref231" name="sthref231"></a>&#25033;&#29992;&#31243;&#24335;&#32068;&#24907;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992; &#12300;&#25033;&#29992;&#31243;&#24335;&#32068;&#24907;&#12301; &#38913;&#38754;&#21487;&#35373;&#23450;&#29305;&#24615;&#65292;&#30906;&#20445;&#26371;&#20597;&#28204;&#21040;&#23565;&#24050;&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;&#25152;&#20570;&#30340;&#35722;&#26356;&#65292;&#20006;&#26371;&#37325;&#26032;&#36617;&#20837;&#20462;&#25913;&#30340;&#39006;&#21029;&#12290;</p>
<p>&#12300;&#25033;&#29992;&#31243;&#24335;&#32068;&#24907;&#12301; &#38913;&#38754;&#21253;&#21547;&#19979;&#21015;&#36984;&#38917;&#12290;</p>
<dl>
<dt>&#36617;&#20837;&#38928;&#35373;&#20540;</dt>
<dd>
<p>&#29992;&#26044;&#23559;&#20855;&#26377;&#38928;&#35373;&#20540;&#30340;&#35373;&#23450;&#24489;&#21407;&#25104;&#20854;&#38928;&#35373;&#20540;&#30340;&#25353;&#37397;&#12290;&#27794;&#26377;&#38928;&#35373;&#20540;&#30340;&#35373;&#23450;&#20445;&#25345;&#19981;&#35722;&#12290;</p>
</dd>
<dt>&#37325;&#26032;&#36617;&#20837;</dt>
<dd>
<p>&#33509;&#21855;&#29992;&#27492;&#36984;&#38917;&#65292;&#21063;&#26371;&#21205;&#24907;&#37325;&#26032;&#36617;&#20837;&#20462;&#25913;&#30340;&#39006;&#21029;&#12290;&#20282;&#26381;&#22120;&#26371;&#23450;&#26399;&#27298;&#26597;&#24314;&#32622;&#30446;&#37636;&#20013;&#30340;&#35722;&#26356;&#65292;&#28982;&#24460;&#33258;&#21205;&#19988;&#21205;&#24907;&#22320;&#37325;&#26032;&#36617;&#20837;&#24050;&#26377;&#35722;&#26356;&#30340;&#25033;&#29992;&#31243;&#24335;&#12290;&#21205;&#24907;&#37325;&#26032;&#36617;&#20837;&#22312;&#38283;&#30332;&#29872;&#22659;&#20013;&#38750;&#24120;&#26377;&#29992;&#65292;&#22240;&#28858;&#23427;&#33021;&#24555;&#36895;&#28204;&#35430;&#31243;&#24335;&#30908;&#35722;&#26356;&#12290;&#20294;&#22312;&#29983;&#29986;&#29872;&#22659;&#20013;&#65292;&#21205;&#24907;&#37325;&#26032;&#36617;&#20837;&#21487;&#33021;&#26371;&#20351;&#25928;&#33021;&#38477;&#20302;&#12290;&#21478;&#22806;&#65292;&#27599;&#30070;&#37325;&#26032;&#36617;&#20837;&#23436;&#25104;&#26178;&#65292;&#36681;&#25563;&#26178;&#38291;&#20839;&#30340;&#38542;&#27573;&#20316;&#26989;&#37117;&#26371;&#35722;&#24471;&#28961;&#25928;&#12290;&#29992;&#25142;&#31471;&#24517;&#38920;&#37325;&#26032;&#21855;&#21205;&#38542;&#27573;&#20316;&#26989;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#21855;&#29992;&#12290;</p>
</dd>
<dt>&#37325;&#26032;&#36617;&#20837;&#36650;&#35426;&#38291;&#38548;</dt>
<dd>
<p>&#27770;&#23450;&#20282;&#26381;&#22120;&#27298;&#26597;&#24050;&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;&#21644;&#27169;&#32068;&#20013;&#30340;&#31243;&#24335;&#30908;&#26377;&#28961;&#35722;&#26356;&#30340;&#38971;&#29575;&#12290;&#38928;&#35373;&#20540;&#28858; 2&#12290;</p>
</dd>
<dt>&#31649;&#29702;&#38542;&#27573;&#20316;&#26989;&#36926;&#26178;</dt>
<dd>
<p>&#27770;&#23450;&#31649;&#29702;&#20027;&#25511;&#21488;&#36926;&#26178;&#32780;&#24517;&#38920;&#37325;&#26032;&#30331;&#20837;&#20043;&#21069;&#65292;&#38656;&#31561;&#20505;&#30340;&#26410;&#20351;&#29992;&#20998;&#37912;&#25976;&#12290;&#38928;&#35373;&#20540;&#28858; 60&#12290;</p>
</dd>
<dt>&#33258;&#21205;&#24314;&#32622;</dt>
<dd>
<p>&#33509;&#21855;&#29992;&#27492;&#36984;&#38917;&#65292;&#33258;&#21205;&#24314;&#32622;&#30446;&#37636;&#20013;&#30340;&#25033;&#29992;&#31243;&#24335;&#23559;&#26371;&#33258;&#21205;&#24314;&#32622;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#21855;&#29992;&#12290;</p>
</dd>
<dt>&#33258;&#21205;&#24314;&#32622;&#36650;&#35426;&#38291;&#38548;</dt>
<dd>
<p>&#25351;&#23450;&#20282;&#26381;&#22120;&#27298;&#26597;&#33258;&#21205;&#24314;&#32622;&#30446;&#37636;&#20013;&#26377;&#28961;&#25033;&#29992;&#31243;&#24335;&#25110;&#27169;&#32068;&#35722;&#26356;&#30340;&#38971;&#29575;&#12290;&#35722;&#26356;&#36650;&#35426;&#38291;&#38548;&#19981;&#26371;&#24433;&#38911;&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;&#25110;&#27169;&#32068;&#25152;&#29992;&#30340;&#26178;&#38291;&#12290;&#38928;&#35373;&#20540;&#28858; 2&#12290;</p>
</dd>
<dt>&#33258;&#21205;&#24314;&#32622;&#37325;&#35430;&#36926;&#26178;</dt>
<dd>
<p>&#25351;&#23450;&#30332;&#29983;&#37679;&#35492;&#20043;&#21069;&#65292;&#37096;&#20998;&#35079;&#35069;&#30340;&#27284;&#26696;&#21487;&#32173;&#25345;&#22823;&#23567;&#19981;&#35722;&#30340;&#31186;&#25976;&#12290;&#38928;&#35373;&#20540;&#28858; 4&#12290;</p>
<p>&#33509;&#27284;&#26696;&#32233;&#24930;&#22320;&#35079;&#35069;&#21040;&#33258;&#21205;&#24314;&#32622;&#30446;&#37636;&#65292;&#21063;&#22312;&#35079;&#35069;&#25972;&#20491;&#27284;&#26696;&#20043;&#21069;&#21487;&#33021;&#26371;&#20986;&#29694;&#35442;&#27284;&#26696;&#12290;&#22240;&#27492;&#65292;&#22039;&#35430;&#33258;&#21205;&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;&#26371;&#22833;&#25943;&#12290;&#33509;&#22039;&#35430;&#33258;&#21205;&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;&#22240;&#28858;&#27492;&#21407;&#22240;&#32780;&#22833;&#25943;&#65292;GlassFish Server &#26371;&#37325;&#26032;&#22039;&#35430;&#24314;&#32622;&#35442;&#25033;&#29992;&#31243;&#24335;&#12290;&#33509;&#37096;&#20998;&#35079;&#35069;&#30340;&#27284;&#26696;&#22312;&#25351;&#23450;&#30340;&#26178;&#27573;&#20839;&#22823;&#23567;&#32173;&#25345;&#19981;&#35722;&#65292;&#21363;&#26371;&#20986;&#29694;&#37679;&#35492;&#12290;</p>
</dd>
<dt>&#33258;&#21205;&#24314;&#32622;&#30446;&#37636;</dt>
<dd>
<p>&#25351;&#23450;&#33258;&#21205;&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;&#21151;&#33021;&#25152;&#35201;&#30435;&#35222;&#30340;&#30446;&#37636;&#12290;&#38928;&#35373;&#20540;&#28858; <i>domain-dir</i><code>/autodeploy</code>&#12290;</p>
</dd>
<dt>XML &#39511;&#35657;</dt>
<dd>
<p>&#25351;&#23450;&#35201;&#37341;&#23565;&#27161;&#28310;&#21644; GlassFish Server &#24314;&#32622;&#25551;&#36848;&#20803;&#22519;&#34892;&#30340; XML &#39511;&#35657;&#39006;&#22411;&#12290;&#39006;&#22411;&#21487;&#33021;&#28858;&#19979;&#21015;&#20854;&#20013;&#20043;&#19968;&#65306;</p>
<dl>
<dt>&#23436;&#25972;</dt>
<dd>
<p>&#22914;&#26524; XML &#39511;&#35657;&#22833;&#25943;&#65292;&#24314;&#32622;&#20063;&#23559;&#22833;&#25943;&#12290;&#27492;&#28858;&#38928;&#35373;&#20540;&#12290;</p>
</dd>
<dt>&#21078;&#26512;</dt>
<dd>
<p>&#22238;&#22577; XML &#39511;&#35657;&#37679;&#35492;&#65292;&#20294;&#24314;&#32622;&#20173;&#26371;&#22519;&#34892;&#12290;</p>
</dd>
<dt>&#28961;</dt>
<dd>
<p>&#19981;&#22519;&#34892; XML &#39511;&#35657;&#12290;</p>
</dd>
</dl>
</dd>
<dt>&#27298;&#39511;&#22120;</dt>
<dd>
<p>&#33509;&#21855;&#29992;&#27492;&#36984;&#38917;&#65292;&#21063;&#26371;&#22312;&#33258;&#21205;&#24314;&#32622;&#20043;&#21069;&#22519;&#34892;&#27298;&#39511;&#22120;&#12290;&#33509;&#27298;&#39511;&#22833;&#25943;&#65292;&#21063;&#19981;&#26371;&#22519;&#34892;&#24314;&#32622;&#12290;&#27298;&#39511;&#22120;&#23559;&#27298;&#26597;&#27284;&#26696;&#30340;&#32080;&#27083;&#21644;&#20839;&#23481;&#12290;&#27298;&#39511;&#22823;&#22411;&#25033;&#29992;&#31243;&#24335;&#36890;&#24120;&#38750;&#24120;&#36027;&#26178;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</dd>
<dt>&#38928;&#32232;&#35695;</dt>
<dd>
<p>&#33509;&#21855;&#29992;&#27492;&#36984;&#38917;&#65292;&#21063;&#26371;&#38928;&#32232;&#35695; JavaServer Pages (JSP) &#27284;&#26696;&#12290;&#33509;&#20572;&#29992;&#27492;&#36984;&#38917;&#65292;&#21063;&#39318;&#27425;&#23384;&#21462; JSP &#27284;&#26696;&#26178;&#26371;&#26044;&#22519;&#34892;&#38542;&#27573;&#32232;&#35695;&#36889;&#20123;&#27284;&#26696;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</dd>
<dt>&#20854;&#20182;&#29305;&#24615;</dt>
<dd>
<p>&#25033;&#29992;&#31243;&#24335;&#30340;&#20854;&#20182;&#29305;&#24615;&#12290;GlassFish Server &#26410;&#23450;&#32681;&#25033;&#29992;&#31243;&#24335;&#30340;&#20219;&#20309;&#20854;&#20182;&#29305;&#24615;&#12290;</p>
</dd>
</dl>
<a id="sthref232" name="sthref232"></a>
<h5>&#30456;&#38364;&#20316;&#26989;</h5>
<ul>
<li>
<p><a href="task-setadvanceappconfig.html">&#35373;&#23450;&#25033;&#29992;&#31243;&#24335;&#32068;&#24907;</a></p>
</li>
<li>
<p><a href="task-setadvancedomainattributes.html">&#35373;&#23450;&#32178;&#22495;&#23660;&#24615;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
