<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-logviewer" name="ref-logviewer"></a><a id="GHCOM00059" name="GHCOM00059"></a></p>

<h4><a id="sthref250" name="sthref250"></a><a id="sthref251" name="sthref251"></a><a id="sthref252" name="sthref252"></a>&#35352;&#37636;&#27298;&#35222;&#22120;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&#12300;&#35352;&#37636;&#27298;&#35222;&#22120;&#12301;&#38913;&#38754;&#65292;&#21487;&#27298;&#35222;&#25152;&#36984; GlassFish Server &#23526;&#20363;&#33287;&#21474;&#38598;&#30340;&#35352;&#37636;&#27284;&#65292;&#20006;&#33258;&#35330;&#35352;&#37636;&#30340;&#39023;&#31034;&#26041;&#24335;&#12290;</p>
<p>&#12300;&#35352;&#37636;&#27298;&#35222;&#22120;&#12301; &#38913;&#38754;&#21253;&#21547;&#22235;&#20491;&#21312;&#22495;&#65306;</p>
<ul>
<li>
<p>&#25628;&#23563;&#26781;&#20214;</p>
</li>
<li>
<p>&#36914;&#38542;&#25628;&#23563;</p>
</li>
<li>
<p>&#20462;&#25913;&#25628;&#23563;</p>
</li>
<li>
<p>&#25628;&#23563;&#32080;&#26524;</p>
</li>
</ul>
<p>&#12300;&#25628;&#23563;&#26781;&#20214;&#12301; &#21312;&#22495;&#21253;&#21547;&#19979;&#21015;&#36984;&#38917;&#12290;</p>
<dl>
<dt>&#36914;&#38542;&#25628;&#23563;</dt>
<dd>
<p>&#25353;&#19968;&#19979;&#27492;&#36899;&#32080;&#21487;&#38283;&#21855;&#21312;&#22495;&#65292;&#35731;&#24744;&#36914;&#19968;&#27493;&#32302;&#23567;&#35352;&#37636;&#27298;&#35222;&#22120;&#30340;&#25628;&#23563;&#31684;&#22285;&#12290;</p>
</dd>
<dt>&#26178;&#38291;&#25139;&#35352;</dt>
<dd>
<p>&#12300;&#26368;&#36817;&#12301; &#21934;&#36984;&#25353;&#37397;&#26371;&#39023;&#31034;&#26368;&#26032;&#30340;&#35338;&#24687;&#12290;&#12300;&#25351;&#23450;&#31684;&#22285;&#12301; &#21934;&#36984;&#25353;&#37397;&#26371;&#38283;&#21855; &#12300;&#24478;&#12301; &#21644; &#12300;&#21040;&#12301; &#27396;&#20301;&#65292;&#35731;&#24744;&#21482;&#27298;&#35222;&#26576;&#19968;&#27573;&#26178;&#38291;&#20839;&#30340;&#35338;&#24687;&#12290;</p>
<p>&#26178;&#38291;&#20540;&#24517;&#38920;&#25505;&#29992;&#20197;&#19979;&#35486;&#27861;&#26684;&#24335;&#34920;&#31034; (<i>SSS</i> &#34920;&#31034;&#27627;&#31186;)&#65306;</p>
<pre>
<i>hh</i>:<i>mm</i>:<i>ss</i>.<i>SSS</i>
</pre>
<p>&#20363;&#22914;&#65072;</p>
<pre>
17:10:00.000
</pre>
<p>&#22914;&#26524; &#12300;&#24478;&#12301; &#27396;&#20301;&#20013;&#30340;&#26178;&#38291;&#20540;&#36978;&#26044; &#12300;&#21040;&#12301; &#27396;&#20301;&#20013;&#30340;&#26178;&#38291;&#20540;&#65292;&#23559;&#39023;&#31034;&#37679;&#35492;&#35338;&#24687;&#12290;</p>
</dd>
<dt>&#35352;&#37636;&#23652;&#32026;</dt>
<dd>
<p>&#36984;&#25799;&#36914;&#34892;&#31721;&#36984;&#30340;&#35352;&#37636;&#23652;&#32026;&#12290;&#20381;&#38928;&#35373;&#65292;&#23559;&#39023;&#31034;&#20282;&#26381;&#22120;&#35352;&#37636;&#20013;&#36984;&#21462;&#35352;&#37636;&#23652;&#32026;&#21644;&#26356;&#39640;&#23652;&#32026;&#30340;&#25152;&#26377;&#35338;&#24687;&#12290;&#36984;&#21462;&#27161;&#26377;&#12300;&#35531;&#21247;&#21253;&#21547;&#26356;&#22810;&#22196;&#37325;&#35338;&#24687;&#12301;&#30340;&#26680;&#21462;&#26041;&#22602;&#65292;&#20677;&#39023;&#31034;&#25152;&#36984;&#23652;&#32026;&#30340;&#35338;&#24687;&#12290;</p>
<p>&#28858;&#30906;&#20445;&#35201;&#27298;&#35222;&#30340;&#35338;&#24687;&#37117;&#39023;&#31034;&#22312;&#20282;&#26381;&#22120;&#35352;&#37636;&#20013;&#65292;&#35531;&#20808;&#22312; &#12300;&#27169;&#32068;&#35352;&#37636;&#23652;&#32026;&#12301; &#38913;&#38754;&#19978;&#35373;&#23450;&#36969;&#30070;&#30340;&#35352;&#37636;&#23652;&#32026;&#12290;&#35531;&#21443;&#38321;<a href="task-eelogginglevels.html">&#32068;&#24907;&#35352;&#37636;&#23652;&#32026;</a>&#12290;</p>
<p>&#22914;&#26524;&#24744;&#36984;&#25799;&#26681;&#25818;&#35352;&#37636;&#23652;&#32026;&#20358;&#31721;&#36984;&#35352;&#37636;&#35338;&#24687;&#65292;&#21063;&#20677;&#26371;&#39023;&#31034;&#31526;&#21512;&#25351;&#23450;&#31721;&#36984;&#26781;&#20214;&#30340;&#35338;&#24687;&#12290;&#19981;&#36942;&#65292;&#27492;&#31721;&#36984;&#19981;&#24433;&#38911;&#37027;&#20123;&#35352;&#37636;&#21040;&#20282;&#26381;&#22120;&#35352;&#37636;&#20013;&#30340;&#35338;&#24687;&#12290;</p>
</dd>
</dl>
<p>&#12300;&#36914;&#38542;&#25628;&#23563;&#12301; &#21312;&#22495;&#21253;&#21547;&#19979;&#21015;&#36984;&#38917;&#12290;</p>
<dl>
<dt>&#35352;&#37636;&#31243;&#24335;</dt>
<dd>
<p>&#29992;&#20358;&#20381;&#27169;&#32068;&#31721;&#36984;&#30340;&#35352;&#37636;&#31243;&#24335;&#21517;&#31281;&#31354;&#38291;&#12290;&#22914;&#26524;&#35201;&#36984;&#25799;&#22810;&#20491;&#21517;&#31281;&#31354;&#38291;&#65292;&#35531;&#22312;&#25353;&#20303; Shift &#37749;&#25110; Ctrl &#37749;&#30340;&#21516;&#26178;&#20197;&#28369;&#40736;&#40670;&#36984;&#12290;</p>
<p>&#36984;&#21462;&#36611;&#39640;&#23652;&#32026;&#30340;&#21517;&#31281;&#31354;&#38291;&#26178;&#65292;&#20063;&#26371;&#36899;&#24118;&#36984;&#21462;&#19979;&#23652;&#30340;&#25152;&#26377;&#21517;&#31281;&#31354;&#38291;&#12290;&#20363;&#22914;&#65292;&#36984;&#21462; &#12300;<code>javax.enterprise.system</code>&#12301; &#30340;&#21516;&#26178;&#20063;&#23601;&#36984;&#21462;&#20102;&#35442;&#21517;&#31281;&#31354;&#38291;&#19979;&#25152;&#26377;&#27169;&#32068;&#30340;&#35352;&#37636;&#31243;&#24335;&#65072;<code>javax.enterprise.system.core</code>&#12289;<code>javax.enterprise.system.tools.admin</code> &#31561;&#31561;&#12290;</p>
</dd>
<dt>&#33258;&#35330;&#35352;&#37636;&#31243;&#24335;</dt>
<dd>
<p>&#29305;&#23450;&#25033;&#29992;&#31243;&#24335;&#23560;&#23660;&#30340;&#35352;&#37636;&#31243;&#24335;&#65292;&#27599;&#34892;&#21015;&#20986;&#19968;&#20491;&#12290;</p>
<p>&#22914;&#26524;&#25033;&#29992;&#31243;&#24335;&#20855;&#26377;&#22810;&#20491;&#27169;&#32068;&#65292;&#21063;&#21487;&#20197;&#27298;&#35222;&#20854;&#20013;&#20219;&#24847;&#19968;&#20491;&#27169;&#32068;&#25110;&#32773;&#20840;&#37096;&#27169;&#32068;&#12290;&#20363;&#22914;&#65292;&#20551;&#35373;&#25033;&#29992;&#31243;&#24335;&#20855;&#26377;&#20351;&#29992;&#20197;&#19979;&#21517;&#31281;&#30340;&#35352;&#37636;&#31243;&#24335;&#65306;</p>
<pre>
com.mycompany.myapp.module1
com.mycompany.myapp.module2
com.mycompany.myapp.module3
</pre>
<p>&#33509;&#35201;&#27298;&#35222;&#25033;&#29992;&#31243;&#24335;&#20013;&#25152;&#26377;&#27169;&#32068;&#30340;&#35338;&#24687;&#65292;&#35531;&#37749;&#20837; <code>com.mycompany.myapp</code>&#12290;&#33509;&#35201;&#20677;&#27298;&#35222; <code>module2</code> &#30340;&#35338;&#24687;&#65292;&#35531;&#37749;&#20837; <code>com.mycompany.myapp.module2</code>&#12290;</p>
<p>&#22914;&#26524;&#25351;&#23450;&#20102;&#19968;&#20491;&#25110;&#22810;&#20491;&#33258;&#35330;&#35352;&#37636;&#31243;&#24335;&#65292;&#21063;&#20677;&#30070;&#22312; &#12300;&#35352;&#37636;&#31243;&#24335;&#12301; &#21312;&#22495;&#20013;&#26126;&#30906;&#25351;&#23450; GlassFish Server &#27169;&#32068;&#26178;&#65292;&#25165;&#26371;&#39023;&#31034;&#36889;&#20123;&#27169;&#32068;&#30340;&#35338;&#24687;&#12290;</p>
</dd>
<dt>&#39023;&#31034;</dt>
<dd>
<p>&#19968;&#27425;&#27298;&#35222;&#30340;&#35338;&#24687;&#25976;&#30446;&#12290;&#39023;&#31034;&#30340;&#38928;&#35373;&#35338;&#24687;&#25976;&#30446;&#28858; 40&#12290;&#20854;&#20182;&#36984;&#38917;&#21253;&#25324; 100&#12289;250 &#21644; 1000&#12290;</p>
<p>&#33509;&#35201;&#27298;&#35222;&#22534;&#30090;&#36861;&#36452;&#65292;&#35531;&#21462;&#28040;&#36984;&#21462;&#12300;&#38480;&#21046;&#36942;&#38263;&#35338;&#24687;&#12301;&#26680;&#21462;&#26041;&#22602;&#12290;&#20381;&#38928;&#35373;&#65292;&#22534;&#30090;&#36861;&#36452;&#19981;&#22312;&#27298;&#35222;&#22120;&#20013;&#39023;&#31034;&#65307;&#33509;&#35201;&#27298;&#35222;&#23427;&#20497;&#65292;&#35531;&#25353;&#19968;&#19979;&#35338;&#24687;&#30340; &#12300;<code>(details)</code>&#12301; &#36899;&#32080;&#12290;</p>
</dd>
</dl>
<p>&#12300;&#20462;&#25913;&#25628;&#23563;&#12301; &#21312;&#22495;&#21487;&#35731;&#24744;&#25351;&#23450;&#20282;&#26381;&#22120;&#23526;&#20363;&#25110;&#21474;&#38598;&#65292;&#20197;&#21450;&#35201;&#27298;&#35222;&#30340;&#30456;&#38364;&#32879;&#35352;&#37636;&#27284;&#21517;&#31281;&#12290;</p>
<dl>
<dt>&#23526;&#20363;</dt>
<dd>
<p>&#23559;&#28858;&#20854;&#39023;&#31034;&#35352;&#37636;&#30340;&#20282;&#26381;&#22120;&#23526;&#20363;&#25110;&#21474;&#38598;&#12290;&#38928;&#35373;&#20540;&#28858;&#20282;&#26381;&#22120;&#12290;&#20854;&#20182;&#36984;&#38917;&#21462;&#27770;&#26044;&#21487;&#33021;&#28858;&#32178;&#22495;&#23450;&#32681;&#21644;&#21855;&#29992;&#30340;&#21474;&#38598;&#33287;&#23526;&#20363;&#12290;</p>
</dd>
<dt>&#35352;&#37636;&#27284;</dt>
<dd>
<p>&#24744;&#35201;&#39023;&#31034;&#30340;&#35352;&#37636;&#27284;&#21517;&#31281;&#12290;&#38928;&#35373;&#28858; <code>server.log</code>&#12290;&#20854;&#20182;&#36984;&#38917;&#21462;&#27770;&#26044;&#25152;&#36984;&#21462;&#30446;&#27161;&#30340;&#35352;&#37636;&#35373;&#23450;&#12290;</p>
</dd>
</dl>
<p>&#12300;&#35352;&#37636;&#27298;&#35222;&#22120;&#32080;&#26524;&#12301; &#34920;&#26684;&#26371;&#39023;&#31034;&#20282;&#26381;&#22120;&#35352;&#37636;&#35338;&#24687;&#12290;&#20351;&#29992;&#34920;&#26684;&#38914;&#31471;&#30340; &#12300;&#20043;&#21069;&#30340;&#35352;&#37636;&#12301; &#33287; &#12300;&#20043;&#24460;&#30340;&#35352;&#37636;&#12301; &#25353;&#37397;&#65292;&#21487;&#20197;&#36984;&#25799;&#24076;&#26395;&#27298;&#35222;&#30340;&#35352;&#37636;&#31684;&#22285;&#12290;</p>
<p>&#12300;&#35352;&#37636;&#27298;&#35222;&#22120;&#32080;&#26524;&#12301; &#34920;&#26684;&#21253;&#21547;&#27599;&#21063;&#35338;&#24687;&#30340;&#19979;&#21015;&#36039;&#35338;&#12290;</p>
<dl>
<dt>&#26781;&#30446;&#34399;&#30908;</dt>
<dd>
<p>&#35338;&#24687;&#22312;&#20282;&#26381;&#22120;&#35352;&#37636;&#20013;&#30340;&#34399;&#30908;&#12290;</p>
</dd>
<dt>&#35352;&#37636;&#23652;&#32026;</dt>
<dd>
<p>&#35338;&#24687;&#30340;&#35352;&#37636;&#23652;&#32026;&#12290;</p>
</dd>
<dt>&#35338;&#24687;</dt>
<dd>
<p>&#35352;&#37636;&#35338;&#24687;&#30340;&#31777;&#30701;&#25991;&#23383;&#12290;&#25353;&#19968;&#19979; &#12300;<code>(details)</code>&#12301; &#36899;&#32080;&#21487;&#27298;&#35222;&#35338;&#24687;&#30340;&#26684;&#24335;&#21270;&#29256;&#26412;&#12290;</p>
</dd>
<dt>&#35352;&#37636;&#31243;&#24335;</dt>
<dd>
<p>&#29986;&#29983;&#35352;&#37636;&#35338;&#24687;&#30340;&#35352;&#37636;&#31243;&#24335;&#27169;&#32068;&#12290;</p>
</dd>
<dt>&#26178;&#38291;&#25139;&#35352;</dt>
<dd>
<p>&#30332;&#20986;&#35352;&#37636;&#35338;&#24687;&#30340;&#26085;&#26399;&#21644;&#26178;&#38291;&#12290;</p>
</dd>
<dt>&#21517;&#31281;/&#20540;&#32068;</dt>
<dd>
<p>&#35352;&#37636;&#35338;&#24687;&#30340;&#22519;&#34892;&#32210;&#21517;&#31281;&#21644; ID&#12290;</p>
</dd>
</dl>
<a id="sthref253" name="sthref253"></a>
<h5>&#30456;&#38364;&#20316;&#26989;</h5>
<ul>
<li>
<p><a href="task-eelogging.html">&#32068;&#24907;&#19968;&#33324;&#35352;&#37636;&#35373;&#23450;</a></p>
</li>
<li>
<p><a href="task-eelogginglevels.html">&#32068;&#24907;&#35352;&#37636;&#23652;&#32026;</a></p>
</li>
<li>
<p><a href="task-logviewer.html">&#27298;&#35222; DAS &#30340;&#35352;&#37636;&#27284;</a></p>
</li>
<li>
<p><a href="task-rawlogviewer.html">&#27298;&#35222; DAS &#30340;&#21407;&#22987;&#35352;&#37636;&#27284;</a></p>
</li>
</ul>
<a id="sthref254" name="sthref254"></a>
<h5>&#30456;&#38364;&#30340; asadmin &#21629;&#20196;</h5>
<ul>
<li>
<p><code>set-log-level</code></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00224"><code>rotate-log</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
