<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-filter-logs" name="task-filter-logs"></a><a id="GHCOM00148" name="GHCOM00148"></a></p>

<h4>&#31721;&#36984;&#39023;&#31034;&#30340;&#35352;&#37636;</h4>
<a name="BEGIN" id="BEGIN"></a><a id="sthref29" name="sthref29"></a>
<h5>&#38283;&#22987;&#21069;</h5>
<p>&#30906;&#23450;&#24744;&#27491;&#22312;&#27298;&#35222;&#32178;&#22495;&#31649;&#29702;&#20282;&#26381;&#22120; (DAS)&#12289;&#21474;&#38598; GlassFish Server &#23526;&#20363;&#25110;&#29544;&#31435;&#23526;&#20363;&#30340;&#35352;&#37636;&#27284;&#12290;&#22914;&#38656;&#26356;&#22810;&#36039;&#35338;&#65292;&#35531;&#21443;&#38321;&#20197;&#19979;&#20027;&#38988;&#65306;</p>
<ul>
<li>
<p><a href="task-logviewer.html">&#27298;&#35222; DAS &#30340;&#35352;&#37636;&#27284;</a></p>
</li>
<li>
<p><a href="../../../cluster/zh_TW/help/missingtopic.html">&#27298;&#35222;&#21474;&#38598; GlassFish Server &#23526;&#20363;&#30340;&#35352;&#37636;&#27284;</a></p>
</li>
<li>
<p><a href="../../../cluster/zh_TW/help/missingtopic.html">&#27298;&#35222;&#29544;&#31435; GlassFish Server &#23526;&#20363;&#30340;&#35352;&#37636;&#27284;</a></p>
</li>
</ul>
<ol>
<li>
<p>&#22312; &#12300;&#25628;&#23563;&#26781;&#20214;&#12301; &#21312;&#22495;&#20013;&#65292;&#20381;&#25818;&#20839;&#23481;&#12289;&#26178;&#27573;&#21450;&#35352;&#37636;&#23652;&#32026;&#20358;&#31721;&#36984;&#35352;&#37636;&#12290;</p>
<ol type="a">
<li>
<p>&#33509;&#35201;&#20677;&#39023;&#31034;&#21253;&#21547;&#29305;&#23450;&#25991;&#23383;&#30340;&#35352;&#37636;&#65292;&#35531;&#22312; &#12300;&#25991;&#23383;&#25628;&#23563;&#12301; &#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#35442;&#25991;&#23383;&#12290;</p>
<p>&#25628;&#23563;&#26371;&#21312;&#20998;&#22823;&#23567;&#23531;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#36984;&#21462;&#39023;&#31034;&#35352;&#37636;&#30340;&#26178;&#27573;&#65292;&#35531;&#20351;&#29992; &#12300;&#26178;&#38291;&#25139;&#35352;&#12301; &#36984;&#38917;&#12290;</p>
<ul>
<li>
<p>&#33509;&#35201;&#27298;&#35222;&#26368;&#36817;&#35338;&#24687;&#65292;&#35531;&#36984;&#21462; &#12300;&#26368;&#36817;&#12301; (&#38928;&#35373;&#20540;)&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#20677;&#27298;&#35222;&#29305;&#23450;&#26178;&#27573;&#20839;&#30340;&#35338;&#24687;&#65292;&#35531;&#36984;&#21462; &#12300;&#25351;&#23450;&#31684;&#22285;&#12301;&#65292;&#28982;&#24460;&#22312;&#25152;&#39023;&#31034;&#30340; &#12300;&#24478;&#12301; &#21644; &#12300;&#21040;&#12301; &#27396;&#20301;&#20013;&#37749;&#20837;&#26085;&#26399;&#21644;&#26178;&#38291;&#20540;&#12290;</p>
<p>&#12300;&#26085;&#26399;&#12301; &#20540;&#24517;&#38920;&#25505;&#29992;&#20197;&#19979;&#26684;&#24335;&#65306;</p>
<pre>
<i>MM</i>/<i>DD</i>/<i>YY</i>
</pre>
<p><code><i>MM</i></code> &#26159;&#31684;&#22285; 1-12 &#20195;&#34920;&#26376;&#20221;&#30340;&#25972;&#25976;&#65292;&#20363;&#22914; 1 &#34920;&#31034;&#19968;&#26376;&#65292;&#32780; 10 &#34920;&#31034;&#21313;&#26376;&#12290;<code><i>DD</i></code> &#26159;&#31684;&#22285; 1-31 &#20195;&#34920;&#30070;&#26376;&#26576;&#22825;&#30340;&#25972;&#25976;&#12290;<code><i>YY</i></code> &#26159;&#24180;&#20221;&#30340;&#24460;&#20841;&#20491;&#25976;&#23383;&#65292;&#20363;&#22914; 11 &#20195;&#34920; 2011 &#24180;&#12290;</p>
<p>&#20363;&#22914;&#65292;&#33509;&#35201;&#25351;&#23450;&#30340;&#26085;&#26399;&#28858; 2011 &#24180; 2 &#26376; 1 &#26085;&#65292;&#35531;&#22312;&#12300;&#26085;&#26399;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837; <code>2/1/11</code>&#12290;</p>
<p>&#12300;&#26178;&#38291;&#12301; &#20540;&#24517;&#38920;&#25505;&#29992;&#20197;&#19979;&#26684;&#24335;&#65306;</p>
<pre>
<i>hh</i>:<i>mm</i>:<i>ss</i>.<i>SSS</i>
</pre>
<p><code><i>hh</i></code> &#26159;&#31684;&#22285; 0-23 &#20195;&#34920;&#23567;&#26178;&#30340;&#25972;&#25976;&#12290;&#23565;&#26044;&#19979;&#21320;&#30340;&#26178;&#38291;&#65292;&#35531;&#20351;&#29992;&#31684;&#22285; 12-23 &#30340;&#25972;&#25976;&#65292;&#20363;&#22914; 14 &#20195;&#34920;&#19979;&#21320; 2 &#40670;&#12290;<code><i>mm</i></code> &#26159;&#31684;&#22285; 0-59 &#30340;&#25972;&#25976;&#65292;&#20195;&#34920;&#35442;&#23567;&#26178;&#24050;&#36942;&#21435;&#30340;&#20998;&#37912;&#25976;&#12290;<code><i>ss</i></code> &#26159;&#31684;&#22285; 0-59 &#30340;&#25972;&#25976;&#65292;&#20195;&#34920;&#31186;&#25976;&#12290;<code><i>SSS</i></code> &#26159;&#31684;&#22285; 000-999 &#30340;&#19977;&#20301;&#25972;&#25976; (&#24517;&#35201;&#26178;&#21487;&#21152;&#20837;&#21069;&#23566;&#38646;)&#65292;&#20195;&#34920;&#27627;&#31186;&#25976;&#12290;</p>
<p>&#20363;&#22914;&#65292;&#33509;&#35201;&#25351;&#23450;&#26178;&#38291;&#28858;&#19979;&#21320; 5 &#40670; 10 &#20998;&#65292;&#35531;&#22312; &#12300;&#26178;&#38291;&#12301; &#27396;&#20301;&#20013;&#37749;&#20837; <code>17:10:00.000</code>&#12290;</p>
<p>&#22914;&#26524; &#12300;&#24478;&#12301; &#27396;&#20301;&#20013;&#30340;&#26178;&#38291;&#20540;&#36978;&#26044; &#12300;&#21040;&#12301; &#27396;&#20301;&#20013;&#30340;&#26178;&#38291;&#20540;&#65292;&#23559;&#39023;&#31034;&#37679;&#35492;&#35338;&#24687;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#20381;&#25818;&#35352;&#37636;&#23652;&#32026;&#31721;&#36984;&#35338;&#24687;&#12290;</p>
<p>&#28858;&#30906;&#20445;&#35201;&#27298;&#35222;&#30340;&#35338;&#24687;&#39023;&#31034;&#22312;&#20282;&#26381;&#22120;&#35352;&#37636;&#20013;&#65292;&#35531;&#20808;&#22312;&#12300;&#27169;&#32068;&#35352;&#37636;&#23652;&#32026;&#12301;&#38913;&#38754;&#19978;&#35373;&#23450;&#36969;&#30070;&#30340;&#35352;&#37636;&#23652;&#32026;&#12290;&#22914;&#38656;&#35498;&#26126;&#65292;&#35531;&#21443;&#38321;<a href="task-eelogginglevels.html">&#32068;&#24907;&#35352;&#37636;&#23652;&#32026;</a>&#12290;</p>
<p>&#22914;&#26524;&#36984;&#25799;&#20381;&#25818;&#35352;&#37636;&#23652;&#32026;&#31721;&#36984;&#35352;&#37636;&#35338;&#24687;&#65292;&#21063;&#21482;&#26371;&#39023;&#31034;&#31526;&#21512;&#25351;&#23450;&#31721;&#36984;&#26781;&#20214;&#30340;&#35338;&#24687;&#12290;&#19981;&#36942;&#65292;&#27492;&#31721;&#36984;&#19981;&#24433;&#38911;&#37027;&#20123;&#35352;&#37636;&#21040;&#20282;&#26381;&#22120;&#35352;&#37636;&#20013;&#30340;&#35338;&#24687;&#12290;</p>
<ol>
<li>
<p>&#24478; &#12300;&#35352;&#37636;&#23652;&#32026;&#12301; &#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#36984;&#21462;&#35352;&#37636;&#23652;&#32026;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#20677;&#39023;&#31034;&#25152;&#36984;&#23652;&#32026;&#30340;&#35338;&#24687;&#65292;&#35531;&#36984;&#21462; &#12300;&#35531;&#21247;&#21253;&#21547;&#26356;&#22810;&#22196;&#37325;&#35338;&#24687;&#12301; &#36984;&#38917;&#12290;</p>
<p>&#20381;&#38928;&#35373;&#65292;&#26371;&#39023;&#31034;&#20282;&#26381;&#22120;&#35352;&#37636;&#20013;&#25152;&#36984;&#25799;&#35352;&#37636;&#23652;&#32026;&#33287;&#26356;&#22196;&#37325;&#23652;&#32026;&#30340;&#25152;&#26377;&#35338;&#24687;&#12290;</p>
</li>
</ol>
</li>
</ol>
</li>
<li>
<p>&#22312; &#12300;&#36914;&#38542;&#25628;&#23563;&#12301; &#21312;&#22495;&#20013;&#65292;&#20381;&#25818;&#35352;&#37636;&#31243;&#24335;&#21517;&#31281;&#31354;&#38291;&#31721;&#36984;&#35352;&#37636;&#65292;&#28982;&#24460;&#36984;&#21462;&#35201;&#39023;&#31034;&#30340;&#36039;&#35338;&#37327;&#12290;</p>
<ol type="a">
<li>
<p>&#25353;&#19968;&#19979; &#12300;&#36914;&#38542;&#25628;&#23563;&#12301; &#36899;&#32080;&#12290;</p>
<p>&#26371;&#23559; &#12300;&#36914;&#38542;&#25628;&#23563;&#12301; &#21312;&#22495;&#22686;&#21152;&#33267; &#12300;&#35352;&#37636;&#27298;&#35222;&#22120;&#12301; &#35222;&#31383;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#20381;&#25818;&#27169;&#32068;&#36914;&#34892;&#31721;&#36984;&#65292;&#35531;&#24478; &#12300;&#35352;&#37636;&#31243;&#24335;&#12301; &#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#36984;&#21462;&#19968;&#25110;&#22810;&#20491;&#21517;&#31281;&#31354;&#38291;&#12290;</p>
<p>&#22914;&#26524;&#35201;&#36984;&#25799;&#22810;&#20491;&#21517;&#31281;&#31354;&#38291;&#65292;&#35531;&#22312;&#25353;&#20303; Shift &#37749;&#25110; Ctrl &#37749;&#30340;&#21516;&#26178;&#20197;&#28369;&#40736;&#40670;&#36984;&#12290;</p>
<p>&#36984;&#21462;&#36611;&#39640;&#23652;&#32026;&#30340;&#21517;&#31281;&#31354;&#38291;&#26178;&#65292;&#20063;&#26371;&#36899;&#24118;&#36984;&#21462;&#19979;&#23652;&#30340;&#25152;&#26377;&#21517;&#31281;&#31354;&#38291;&#12290;&#20363;&#22914;&#65292;&#36984;&#21462; <code>javax.enterprise.system</code> &#30340;&#21516;&#26178;&#20063;&#23601;&#36984;&#21462;&#20102;&#35442;&#21517;&#31281;&#31354;&#38291;&#19979;&#25152;&#26377;&#27169;&#32068;&#30340;&#35352;&#37636;&#31243;&#24335;&#65292;&#20363;&#22914; <code>javax.enterprise.system.core</code>&#12289;<code>javax.enterprise.system.tools.admin</code> &#31561;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#27298;&#35222;&#29305;&#23450;&#25033;&#29992;&#31243;&#24335;&#20043;&#35352;&#37636;&#31243;&#24335;&#30340;&#35338;&#24687;&#65292;&#35531;&#22312; &#12300;&#33258;&#35330;&#35352;&#37636;&#31243;&#24335;&#12301; &#27396;&#20301;&#20013;&#65292;&#20998;&#34892;&#37749;&#20837;&#27599;&#20491;&#35352;&#37636;&#31243;&#24335;&#30340;&#21517;&#31281;&#12290;</p>
<p>&#22914;&#26524;&#25033;&#29992;&#31243;&#24335;&#20855;&#26377;&#22810;&#20491;&#27169;&#32068;&#65292;&#24744;&#21487;&#20197;&#27298;&#35222;&#20219;&#19968;&#27169;&#32068;&#65292;&#20063;&#21487;&#20197;&#27298;&#35222;&#25152;&#26377;&#27169;&#32068;&#12290;&#20363;&#22914;&#65292;&#25033;&#29992;&#31243;&#24335;&#21487;&#33021;&#26371;&#26377;&#19979;&#21015;&#35352;&#37636;&#31243;&#24335;&#65306;</p>
<pre>
com.example.myapp.module1
com.example.myapp.module2
com.example.myapp.module3
</pre>
<p>&#33509;&#35201;&#27298;&#35222;&#25033;&#29992;&#31243;&#24335;&#20013;&#25152;&#26377;&#27169;&#32068;&#30340;&#35338;&#24687;&#65292;&#35531;&#37749;&#20837; <code>com.mycompany.myapp</code>&#12290;&#33509;&#35201;&#20677;&#27298;&#35222; <code>module2</code> &#30340;&#35338;&#24687;&#65292;&#35531;&#37749;&#20837; <code>com.example.myapp.module2</code>&#12290;</p>
<p>&#22914;&#26524;&#25351;&#23450;&#20102;&#19968;&#20491;&#25110;&#22810;&#20491;&#33258;&#35330;&#35352;&#37636;&#31243;&#24335;&#65292;&#21063;&#20677;&#30070;&#22312; &#12300;&#35352;&#37636;&#31243;&#24335;&#12301; &#21312;&#22495;&#20013;&#26126;&#30906;&#25351;&#23450; GlassFish Server &#27169;&#32068;&#26178;&#65292;&#25165;&#26371;&#39023;&#31034;&#36889;&#20123;&#27169;&#32068;&#30340;&#35338;&#24687;&#12290;</p>
</li>
<li>
<p>&#24478; &#12300;&#39023;&#31034;&#12301; &#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#35201;&#39023;&#31034;&#30340;&#35338;&#24687;&#25976;&#30446;&#12290;</p>
<p>&#39023;&#31034;&#30340;&#38928;&#35373;&#35338;&#24687;&#25976;&#30446;&#28858; 40&#12290;&#20854;&#20182;&#36984;&#38917;&#21253;&#25324; 100&#12289;250 &#21644; 1000&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#27298;&#35222;&#22534;&#30090;&#36861;&#36452;&#65292;&#35531;&#21462;&#28040;&#36984;&#21462; &#12300;&#38480;&#21046;&#36942;&#38263;&#35338;&#24687;&#12301; &#36984;&#38917;&#12290;</p>
<p>&#20381;&#38928;&#35373;&#65292;&#22534;&#30090;&#36861;&#36452;&#19981;&#26371;&#20986;&#29694;&#22312;&#27298;&#35222;&#22120;&#20013;&#12290;&#33509;&#35201;&#27298;&#35222;&#22534;&#30090;&#36861;&#36452;&#65292;&#35531;&#25353;&#19968;&#19979;&#35338;&#24687;&#30340; (&#35443;&#32048;&#36039;&#35338;) &#36899;&#32080;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#38577;&#34255; &#12300;&#36914;&#38542;&#25628;&#23563;&#12301; &#21312;&#22495;&#65292;&#35531;&#25353;&#19968;&#19979; &#12300;&#22522;&#26412;&#25628;&#23563;&#12301; &#36899;&#32080;&#12290;</p>
</li>
</ol>
</li>
<li>
<p>&#33509;&#35201;&#25351;&#23450;&#24076;&#26395;&#27298;&#35222;&#30340;&#23526;&#20363;&#21450;&#30456;&#38364;&#32879;&#30340;&#35352;&#37636;&#27284;&#65292;&#35531;&#20351;&#29992; &#12300;&#20462;&#25913;&#25628;&#23563;&#12301; &#21312;&#22495;&#12290;</p>
<ul>
<li>
<p>&#24478; &#12300;&#23526;&#20363;&#12301; &#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#36984;&#21462;&#23526;&#20363;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858;&#24744;&#26368;&#21021;&#36984;&#21462;&#35201;&#27298;&#35222;&#35352;&#37636;&#27284;&#30340;&#23526;&#20363;&#12290;&#22914;&#26524;&#24744;&#26368;&#21021;&#36984;&#21462;&#35201;&#27298;&#35222;&#32178;&#22495;&#31649;&#29702;&#20282;&#26381;&#22120; (DAS) &#30340;&#35352;&#37636;&#27284;&#65292;&#21063;&#38928;&#35373;&#20540;&#28858;&#20195;&#34920; DAS &#30340;&#20282;&#26381;&#22120;&#12290;</p>
</li>
<li>
<p>&#24478; &#12300;&#35352;&#37636;&#27284;&#12301; &#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#36984;&#21462;&#35352;&#37636;&#27284;&#12290;</p>
<p>&#38928;&#35373;&#28858; <code>server.log</code>&#12290;&#20854;&#20182;&#36984;&#38917;&#21462;&#27770;&#26044;&#25152;&#36984;&#21462;&#30446;&#27161;&#30340;&#35352;&#37636;&#35373;&#23450;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#22312; &#12300;&#25628;&#23563;&#32080;&#26524;&#12301; &#21312;&#22495;&#20013;&#65292;&#33258;&#35330;&#35352;&#37636;&#35338;&#24687;&#30340;&#39023;&#31034;&#12290;</p>
<p>&#12300;&#25628;&#23563;&#32080;&#26524;&#12301; &#21312;&#22495;&#26371;&#36879;&#36942; &#12300;&#35352;&#37636;&#35373;&#23450;&#12301; &#33287; &#12300;&#35352;&#37636;&#23652;&#32026;&#12301; &#38913;&#38754;&#20013;&#30340;&#35373;&#23450;&#65292;&#39023;&#31034;&#20282;&#26381;&#22120;&#35352;&#37636;&#20013;&#26368;&#26032;&#30340; 40 &#20491;&#38917;&#30446;&#12290;</p>
<ul>
<li>
<p>&#33509;&#35201;&#20197;&#19981;&#21516;&#26041;&#24335;&#23565;&#35338;&#24687;&#25490;&#24207;&#65292;&#35531;&#25353;&#19968;&#19979;&#27396;&#20013;&#30340;&#31661;&#38957;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#27298;&#35222;&#35338;&#24687;&#30340;&#26684;&#24335;&#21270;&#29256;&#26412;&#65292;&#35531;&#25353;&#19968;&#19979;&#35338;&#24687;&#30340; (&#35443;&#32048;&#36039;&#35338;) &#36899;&#32080;&#12290;</p>
<p>&#38568;&#21363;&#26371;&#38283;&#21855;&#21253;&#21547;&#35338;&#24687;&#26684;&#24335;&#21270;&#29256;&#26412;&#30340; &#12300;&#35352;&#37636;&#38917;&#30446;&#35443;&#32048;&#36039;&#35338;&#12301; &#35222;&#31383;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#27298;&#35222;&#35352;&#37636;&#27284;&#20013;&#36611;&#33290;&#25110;&#36611;&#26032;&#30340;&#38917;&#30446;&#65292;&#35531;&#25353;&#19968;&#19979;&#34920;&#26684;&#38914;&#31471;&#30340; &#12300;&#20043;&#21069;&#30340;&#35352;&#37636;&#12301; &#33287; &#12300;&#20043;&#24460;&#30340;&#35352;&#37636;&#12301;&#12290;</p>
</li>
</ul>
</li>
</ol>
<a id="sthref30" name="sthref30"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-eelogging.html">&#32068;&#24907;&#19968;&#33324;&#35352;&#37636;&#35373;&#23450;</a></p>
</li>
<li>
<p><a href="task-eelogginglevels.html">&#32068;&#24907;&#35352;&#37636;&#23652;&#32026;</a></p>
</li>
<li>
<p><a href="task-logviewer.html">&#27298;&#35222; DAS &#30340;&#35352;&#37636;&#27284;</a></p>
</li>
<li>
<p><a href="../../../cluster/zh_TW/help/missingtopic.html">&#27298;&#35222;&#21474;&#38598; GlassFish Server &#23526;&#20363;&#30340;&#35352;&#37636;&#27284;</a></p>
</li>
<li>
<p><a href="../../../cluster/zh_TW/help/missingtopic.html">&#27298;&#35222;&#29544;&#31435; GlassFish Server &#23526;&#20363;&#30340;&#35352;&#37636;&#27284;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
