<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-setadvanceappconfig" name="task-setadvanceappconfig"></a><a id="GHCOM00144" name="GHCOM00144"></a></p>

<h4><a id="sthref6" name="sthref6"></a><a id="sthref7" name="sthref7"></a><a id="sthref8" name="sthref8"></a><a id="sthref9" name="sthref9"></a><a id="sthref10" name="sthref10"></a>&#35373;&#23450;&#25033;&#29992;&#31243;&#24335;&#32068;&#24907;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992; &#12300;&#25033;&#29992;&#31243;&#24335;&#32068;&#24907;&#12301; &#38913;&#38754;&#21487;&#35373;&#23450;&#29305;&#24615;&#65292;&#30906;&#20445;&#26371;&#20597;&#28204;&#21040;&#23565;&#24050;&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;&#25152;&#20570;&#30340;&#35722;&#26356;&#65292;&#20006;&#26371;&#37325;&#26032;&#36617;&#20837;&#20462;&#25913;&#30340;&#39006;&#21029;&#12290;</p>
<ol>
<li>
<p>&#22312;&#28687;&#35261;&#27193;&#29376;&#32080;&#27083;&#20013;&#65292;&#36984;&#21462;&#12300;&#32178;&#22495;&#12301;&#31680;&#40670;&#12290;</p>
<p>&#12300;&#32178;&#22495;&#23660;&#24615;&#12301; &#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#25033;&#29992;&#31243;&#24335;&#32068;&#24907;&#12301;&#27161;&#31844;&#12290;</p>
<p>&#12300;&#25033;&#29992;&#31243;&#24335;&#32068;&#24907;&#12301; &#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#37325;&#26032;&#36617;&#20837;&#12301;&#30340;&#12300;&#24050;&#21855;&#29992;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#21855;&#29992;&#21205;&#24907;&#37325;&#26032;&#36617;&#20837;&#25033;&#29992;&#31243;&#24335;&#12290;</p>
<p>&#21855;&#29992;&#21205;&#24907;&#37325;&#26032;&#36617;&#20837;&#20043;&#24460;&#65292;&#30070;&#24744;&#35722;&#26356;&#25033;&#29992;&#31243;&#24335;&#25110;&#27169;&#32068;&#30340;&#31243;&#24335;&#30908;&#25110;&#24314;&#32622;&#25551;&#36848;&#20803;&#26178;&#65292;&#23601;&#28961;&#38920;&#37325;&#26032;&#24314;&#32622;&#35442;&#25033;&#29992;&#31243;&#24335;&#25110;&#27169;&#32068;&#12290;&#24744;&#21482;&#38656;&#35201;&#23559;&#35722;&#26356;&#36942;&#30340; JavaServer Pages (JSP) &#25110;&#39006;&#21029;&#27284;&#26696;&#35079;&#35069;&#21040;&#25033;&#29992;&#31243;&#24335;&#25110;&#27169;&#32068;&#30340;&#24314;&#32622;&#30446;&#37636;&#21363;&#21487;&#12290;&#20282;&#26381;&#22120;&#26371;&#23450;&#26399;&#27298;&#26597;&#24314;&#32622;&#30446;&#37636;&#20013;&#30340;&#35722;&#26356;&#65292;&#28982;&#24460;&#33258;&#21205;&#19988;&#21205;&#24907;&#22320;&#37325;&#26032;&#36617;&#20837;&#24050;&#26377;&#35722;&#26356;&#30340;&#25033;&#29992;&#31243;&#24335;&#12290;&#21205;&#24907;&#37325;&#26032;&#36617;&#20837;&#22312;&#38283;&#30332;&#29872;&#22659;&#20013;&#38750;&#24120;&#26377;&#29992;&#65292;&#22240;&#28858;&#23427;&#33021;&#24555;&#36895;&#28204;&#35430;&#31243;&#24335;&#30908;&#35722;&#26356;&#12290;&#20294;&#22312;&#29983;&#29986;&#29872;&#22659;&#20013;&#65292;&#21205;&#24907;&#37325;&#26032;&#36617;&#20837;&#21487;&#33021;&#26371;&#20351;&#25928;&#33021;&#38477;&#20302;&#12290;&#21478;&#22806;&#65292;&#27599;&#30070;&#37325;&#26032;&#36617;&#20837;&#23436;&#25104;&#26178;&#65292;&#36681;&#25563;&#26178;&#38291;&#20839;&#30340;&#38542;&#27573;&#20316;&#26989;&#37117;&#26371;&#35722;&#24471;&#28961;&#25928;&#12290;&#29992;&#25142;&#31471;&#24517;&#38920;&#37325;&#26032;&#21855;&#21205;&#38542;&#27573;&#20316;&#26989;&#12290;</p>
<p>&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#21855;&#29992;&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#37325;&#26032;&#36617;&#20837;&#36650;&#35426;&#38291;&#38548;&#12301; &#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#35201;&#27298;&#26597;&#25033;&#29992;&#31243;&#24335;&#21644;&#27169;&#32068;&#30340;&#31243;&#24335;&#30908;&#35722;&#26356;&#65292;&#28982;&#24460;&#21205;&#24907;&#37325;&#26032;&#36617;&#20837;&#30340;&#38291;&#38548;&#38263;&#24230; (&#20197;&#31186;&#28858;&#21934;&#20301;)&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 2&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#31649;&#29702;&#38542;&#27573;&#20316;&#26989;&#36926;&#26178;&#12301; &#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#26410;&#20351;&#29992;&#20197;&#33268;&#31649;&#29702;&#20027;&#25511;&#21488;&#38542;&#27573;&#20316;&#26989;&#36926;&#26178;&#30340;&#20998;&#37912;&#25976;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 60&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#33258;&#21205;&#24314;&#32622;&#12301;&#30340;&#12300;&#24050;&#21855;&#29992;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#20197;&#33258;&#21205;&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;&#12290;</p>
<p>&#22914;&#26524;&#24744;&#23559;&#25033;&#29992;&#31243;&#24335;&#25110;&#27169;&#32068;&#27284;&#26696; (JAR&#12289;WAR&#12289;RAR &#25110; EAR) &#35079;&#35069;&#21040;&#29305;&#27530;&#30446;&#37636;&#65292;&#28982;&#24460;&#21855;&#29992;&#33258;&#21205;&#24314;&#32622;&#65292;GlassFish Server &#26371;&#33258;&#21205;&#24314;&#32622;&#35442;&#25033;&#29992;&#31243;&#24335;&#25110;&#27169;&#32068;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#21855;&#29992;&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#33258;&#21205;&#24314;&#32622;&#36650;&#35426;&#38291;&#38548;&#12301; &#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#35201;&#27298;&#26597;&#25033;&#29992;&#31243;&#24335;&#21644;&#27169;&#32068;&#30340;&#31243;&#24335;&#30908;&#35722;&#26356;&#65292;&#28982;&#24460;&#21205;&#24907;&#37325;&#26032;&#36617;&#20837;&#30340;&#38291;&#38548;&#38263;&#24230; (&#20197;&#31186;&#28858;&#21934;&#20301;)&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 2&#12290;&#35722;&#26356;&#36650;&#35426;&#38291;&#38548;&#19981;&#26371;&#24433;&#38911;&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;&#25110;&#27169;&#32068;&#25152;&#29992;&#30340;&#26178;&#38291;&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#33258;&#21205;&#24314;&#32622;&#37325;&#35430;&#36926;&#26178;&#12301; &#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#22312;&#30332;&#29983;&#37679;&#35492;&#20043;&#21069;&#65292;&#37096;&#20998;&#35079;&#35069;&#30340;&#27284;&#26696;&#32173;&#25345;&#22823;&#23567;&#19981;&#35722;&#30340;&#31186;&#25976;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 4&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#33258;&#21205;&#24314;&#32622;&#30446;&#37636;&#12301; &#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#38656;&#35201;&#30435;&#35222;&#30340;&#30446;&#37636;&#23436;&#25972;&#36335;&#24465;&#65292;&#20197;&#33258;&#21205;&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; <i>domain-dir</i><code>/autodeploy</code>&#12290;</p>
</li>
<li>
<p>&#24478; &#12300;XML &#39511;&#35657;&#12301; &#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#35201;&#37341;&#23565;&#27161;&#28310;&#21644; GlassFish Server &#24314;&#32622;&#25551;&#36848;&#20803;&#22519;&#34892;&#30340; XML &#39511;&#35657;&#39006;&#22411;&#12290;</p>
<p>&#39006;&#22411;&#21487;&#33021;&#28858;&#19979;&#21015;&#20854;&#20013;&#20043;&#19968;&#65306;</p>
<dl>
<dt><code>full</code></dt>
<dd>
<p>&#22914;&#26524; XML &#39511;&#35657;&#22833;&#25943;&#65292;&#24314;&#32622;&#20063;&#23559;&#22833;&#25943;&#12290;&#27492;&#28858;&#38928;&#35373;&#20540;&#12290;</p>
</dd>
<dt><code>parsing</code></dt>
<dd>
<p>&#22238;&#22577; XML &#39511;&#35657;&#37679;&#35492;&#65292;&#20294;&#24314;&#32622;&#20173;&#26371;&#22519;&#34892;&#12290;</p>
</dd>
<dt><code>none</code></dt>
<dd>
<p>&#19981;&#22519;&#34892; XML &#39511;&#35657;&#12290;</p>
</dd>
</dl>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#27298;&#39511;&#22120;&#12301;&#30340;&#12300;&#24050;&#21855;&#29992;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#39511;&#35657;&#24744;&#30340;&#24314;&#32622;&#25551;&#36848;&#20803;&#27284;&#26696;&#12290;</p>
<p>&#27298;&#39511;&#22120;&#26371;&#22312;&#33258;&#21205;&#24314;&#32622;&#20043;&#21069;&#65292;&#27298;&#26597;&#27284;&#26696;&#30340;&#32080;&#27083;&#21644;&#20839;&#23481;&#12290;&#33509;&#27298;&#39511;&#22833;&#25943;&#65292;&#21063;&#19981;&#26371;&#22519;&#34892;&#24314;&#32622;&#12290;&#27298;&#39511;&#22823;&#22411;&#25033;&#29992;&#31243;&#24335;&#36890;&#24120;&#38750;&#24120;&#36027;&#26178;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#38928;&#32232;&#35695;&#12301;&#30340;&#12300;&#24050;&#21855;&#29992;&#12301;&#26680;&#21462;&#26041;&#22602;&#21363;&#21487;&#38928;&#32232;&#35695;&#25152;&#26377; JSP &#27284;&#26696;&#12290;</p>
<p>&#33509;&#20572;&#29992;&#27492;&#36984;&#38917;&#65292;&#21063;&#39318;&#27425;&#23384;&#21462; JSP &#27284;&#26696;&#26178;&#26371;&#26044;&#22519;&#34892;&#38542;&#27573;&#32232;&#35695;&#36889;&#20123;&#27284;&#26696;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#20854;&#20182;&#29305;&#24615;&#12301; &#21312;&#27573;&#20013;&#65292;&#25351;&#23450;&#20854;&#20182;&#29305;&#24615;&#12290;</p>
<p>GlassFish Server &#26410;&#23450;&#32681;&#25033;&#29992;&#31243;&#24335;&#30340;&#20219;&#20309;&#20854;&#20182;&#29305;&#24615;&#12290;</p>
<ul>
<li>
<p>&#33509;&#35201;&#22686;&#21152;&#29305;&#24615;&#65292;&#35531;&#25353;&#19968;&#19979; &#12300;&#22686;&#21152;&#29305;&#24615;&#12301; &#25353;&#37397;&#12290;&#22312;&#20986;&#29694;&#30340;&#31354;&#30333;&#21015;&#20013;&#65292;&#26044; &#12300;&#21517;&#31281;&#12301; &#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#21517;&#31281;&#65292;&#28982;&#24460;&#22312; &#12300;&#20540;&#12301; &#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#20540;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#20462;&#25913;&#29305;&#24615;&#65292;&#35531;&#32232;&#36655;&#29305;&#24615;&#30340; &#12300;&#20540;&#12301; &#27396;&#20301;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#21034;&#38500;&#29305;&#24615;&#65292;&#35531;&#36984;&#21462;&#24744;&#35201;&#21034;&#38500;&#20043;&#29305;&#24615; &#12300;&#21517;&#31281;&#12301; &#27396;&#20301;&#24038;&#20596;&#30340;&#26680;&#21462;&#26041;&#22602;&#65292;&#28982;&#24460;&#25353;&#19968;&#19979; &#12300;&#21034;&#38500;&#29305;&#24615;&#12301; &#25353;&#37397;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#25353;&#19968;&#19979; &#12300;&#20786;&#23384;&#12301;&#12290;</p>

<hr>
<p><b>&#31192;&#35363;:</b></p>
&#33509;&#35201;&#22238;&#21040;&#38928;&#35373;&#35373;&#23450;&#65292;&#35531;&#25353;&#19968;&#19979; &#12300;&#36617;&#20837;&#38928;&#35373;&#20540;&#12301; &#25353;&#37397;&#65292;&#28982;&#24460;&#25353;&#19968;&#19979; &#12300;&#20786;&#23384;&#12301;&#12290;
<hr>

</li>
<li>
<p>&#37325;&#26032;&#21855;&#21205;&#20282;&#26381;&#22120;&#12290;</p>
</li>
</ol>
<a id="sthref11" name="sthref11"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-generaltab.html">&#27298;&#35222; DAS &#30340;&#19968;&#33324;&#36039;&#35338;</a></p>
</li>
<li>
<p><a href="task-logviewer.html">&#27298;&#35222; DAS &#30340;&#35352;&#37636;&#27284;</a></p>
</li>
<li>
<p><a href="task-filter-logs.html">&#31721;&#36984;&#39023;&#31034;&#30340;&#35352;&#37636;</a></p>
</li>
<li>
<p><a href="task-setadvancedomainattributes.html">&#35373;&#23450;&#32178;&#22495;&#23660;&#24615;</a></p>
</li>
<li>
<p><a href="task-collectdomainlogs.html">&#25910;&#38598;&#21644;&#19979;&#36617;&#32178;&#22495;&#35352;&#37636;</a></p>
</li>
<li>
<p><a href="task-setadminpassword.html">&#35722;&#26356;&#31649;&#29702;&#21729;&#23494;&#30908;</a></p>
</li>
<li>
<p><a href="task-systemproperties.html">&#31649;&#29702;&#31995;&#32113;&#29305;&#24615;</a></p>
</li>
<li>
<p><a href="task-appmonitoringdata.html">&#27298;&#35222;&#25033;&#29992;&#31243;&#24335;&#30435;&#35222;&#36039;&#26009;</a></p>
</li>
<li>
<p><a href="task-servermonitoringdata.html">&#27298;&#35222;&#20282;&#26381;&#22120;&#30435;&#35222;&#36039;&#26009;</a></p>
</li>
<li>
<p><a href="task-resourcemonitoringdata.html">&#27298;&#35222;&#36039;&#28304;&#30435;&#35222;&#36039;&#26009;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
