<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-uc-addon" name="task-uc-addon"></a><a id="GHCOM00214" name="GHCOM00214"></a></p>

<h4><a id="sthref209" name="sthref209"></a><a id="sthref210" name="sthref210"></a>&#23433;&#35037;&#38468;&#21152;&#20803;&#20214;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#23433;&#35037;&#38468;&#21152;&#20803;&#20214;&#21253;&#25324;&#19979;&#21015;&#20316;&#26989;&#65306;</p>
<ul>
<li>
<p>&#24478;&#32178;&#36335;&#20786;&#23384;&#24235;&#20659;&#36865;&#20803;&#20214;&#30340;&#20839;&#23481;&#21644;&#20803;&#20214;&#30340;&#30456;&#20381;&#24615;</p>
</li>
<li>
<p>&#22312;&#31995;&#32113;&#19978;&#23433;&#35037; GlassFish Server &#23433;&#35037;&#24433;&#20687;&#19979;&#30340;&#20803;&#20214;</p>
</li>
</ul>
<p>&#22914;&#26524;&#20803;&#20214;&#38656;&#35201;&#20219;&#20309;&#20854;&#20182;&#23578;&#26410;&#23433;&#35037;&#30340;&#20803;&#20214;&#65292;&#20063;&#26371;&#19968;&#20341;&#23433;&#35037;&#25152;&#38656;&#30340;&#20803;&#20214;&#12290;</p>
<ol>
<li>
<p>&#22312;&#28687;&#35261;&#27193;&#29376;&#32080;&#27083;&#20013;&#65292;&#36984;&#21462; &#12300;&#26356;&#26032;&#24037;&#20855;&#12301; &#31680;&#40670;&#12290;</p>
<p>&#12300;&#21487;&#29992;&#30340;&#38468;&#21152;&#20803;&#20214;&#12301; &#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#21487;&#29992;&#30340;&#38468;&#21152;&#20803;&#20214;&#12301; &#38913;&#38754;&#19978;&#65292;&#26044;&#21487;&#29992;&#38468;&#21152;&#20803;&#20214;&#30340;&#34920;&#26684;&#20013;&#65292;&#36984;&#21462;&#24744;&#35201;&#23433;&#35037;&#30340;&#20803;&#20214;&#12290;</p>
<p>&#22914;&#26524;&#27794;&#26377;&#21487;&#29992;&#30340;&#38468;&#21152;&#20803;&#20214;&#65292;&#34920;&#26684;&#26371;&#26159;&#31354;&#30340;&#12290;</p>
<ul>
<li>
<p>&#33509;&#35201;&#36984;&#21462;&#20491;&#21029;&#20803;&#20214;&#65292;&#35531;&#36984;&#21462;&#20803;&#20214;&#21517;&#31281;&#26049;&#30340;&#26680;&#21462;&#26041;&#22602;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#36984;&#21462;&#25152;&#26377;&#20803;&#20214;&#65292;&#35531;&#25353;&#19968;&#19979;&#34920;&#26684;&#27161;&#38957;&#20013;&#30340; &#12300;&#20840;&#36984;&#12301; &#22294;&#31034;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#21462;&#28040;&#36984;&#21462;&#25152;&#26377;&#20803;&#20214;&#65292;&#35531;&#25353;&#19968;&#19979;&#34920;&#26684;&#27161;&#38957;&#20013;&#30340; &#12300;&#20840;&#19981;&#36984;&#12301; &#22294;&#31034;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#25353;&#19968;&#19979; &#12300;&#23433;&#35037;&#12301;&#12290;</p>
<p>&#26371;&#20986;&#29694;&#23565;&#35441;&#26041;&#22602;&#35531;&#24744;&#30906;&#35469;&#25152;&#36984;&#25033;&#23433;&#35037;&#30340;&#20803;&#20214;&#21450;&#20854;&#25152;&#38656;&#30340;&#20803;&#20214;&#12290;</p>
</li>
<li>
<p>&#22312;&#23565;&#35441;&#26041;&#22602;&#20013;&#65292;&#25353;&#19968;&#19979; &#12300;&#30906;&#23450;&#12301;&#12290;</p>
<p>&#31995;&#32113;&#26371;&#35426;&#21839;&#24744;&#26159;&#21542;&#25509;&#21463;&#27491;&#22312;&#23433;&#35037;&#20043;&#20803;&#20214;&#30340;&#25480;&#27402;&#21512;&#32004;&#12290;</p>
</li>
<li>
<p>&#25509;&#21463;&#27491;&#22312;&#23433;&#35037;&#20043;&#20803;&#20214;&#30340;&#25480;&#27402;&#21512;&#32004;&#12290;</p>
<p>GlassFish Server &#26371;&#30906;&#35469;&#23433;&#35037;&#24050;&#23436;&#25104;&#12290;&#20877;&#24478;&#38468;&#21152;&#20803;&#20214;&#34920;&#26684;&#20013;&#31227;&#38500;&#20803;&#20214;&#65292;&#20006;&#22312; &#12300;&#24050;&#23433;&#35037;&#30340;&#20803;&#20214;&#12301; &#38913;&#38754;&#19978;&#65292;&#23559;&#36889;&#20123;&#20803;&#20214;&#22686;&#21152;&#33267;&#23433;&#35037;&#30340;&#20803;&#20214;&#34920;&#26684;&#20013;&#12290;</p>
</li>
<li>
<p>&#37325;&#26032;&#21855;&#21205;&#20282;&#26381;&#22120;&#12290;</p>
<p>&#22914;&#38656;&#35443;&#32048;&#35498;&#26126;&#65292;&#35531;&#21443;&#38321;&#19979;&#21015;&#25991;&#20214;&#65306;</p>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSADG00336"><i>Oracle GlassFish Server Administration Guide</i>&#20013;&#30340;<i>To Stop a Domain</i></a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSADG00335"><i>Oracle GlassFish Server Administration Guide</i>&#20013;&#30340;<i>To Start a Domain</i></a></p>
</li>
</ul>
</li>
</ol>
<a id="sthref211" name="sthref211"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-uc-update.html">&#27298;&#35222;&#20803;&#20214;&#30340;&#21487;&#29992;&#26356;&#26032;</a></p>
</li>
<li>
<p><a href="task-uc-installed-remove.html">&#27298;&#35222;&#24050;&#23433;&#35037;&#30340;&#20803;&#20214;</a></p>
</li>
<li>
<p><a href="task-uc-pkgdetails.html">&#27298;&#35222;&#20803;&#20214;&#30340;&#35443;&#32048;&#36039;&#35338;</a></p>
</li>
<li>
<p><a href="task-uc-set-proxy.html">&#32068;&#24907;&#29992;&#26044;&#23384;&#21462;&#32178;&#36335;&#20786;&#23384;&#24235;&#30340;&#32178;&#36335;&#20195;&#29702;&#20282;&#26381;&#22120;&#35373;&#23450;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
