<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-eelogging" name="task-eelogging"></a><a id="GHCOM00177" name="GHCOM00177"></a></p>

<h4><a id="sthref120" name="sthref120"></a>&#32068;&#24907;&#19968;&#33324;&#35352;&#37636;&#35373;&#23450;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#28687;&#35261;&#27193;&#29376;&#32080;&#27083;&#20013;&#65292;&#23637;&#38283; &#12300;&#32068;&#24907;&#12301; &#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#32068;&#24907;&#12301; &#31680;&#40670;&#19979;&#65292;&#25353;&#19968;&#19979;&#24744;&#35201;&#32068;&#24907; &#12300;&#35352;&#37636;&#31243;&#24335;&#35373;&#23450;&#12301; &#30340;&#20282;&#26381;&#22120;&#23526;&#20363;&#25110;&#21474;&#38598;&#32068;&#24907;&#12290;</p>
<p>&#12300;&#32068;&#24907;&#12301; &#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#32068;&#24907;&#12301; &#38913;&#38754;&#19978;&#65292;&#25353;&#19968;&#19979; &#12300;&#35352;&#37636;&#31243;&#24335;&#35373;&#23450;&#12301;&#12290;</p>
<p>&#25152;&#36984;&#21462;&#32068;&#24907;&#30446;&#27161;&#30340; &#12300;&#35352;&#37636;&#31243;&#24335;&#35373;&#23450;&#12301; &#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#23531;&#20837;&#33267;&#31995;&#32113;&#35352;&#37636;&#12301;&#30340;&#12300;&#24050;&#21855;&#29992;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#20197;&#20415;&#38500;&#20102;&#20282;&#26381;&#22120;&#35352;&#37636;&#22806;&#65292;&#36996;&#23559;&#35352;&#37636;&#36664;&#20986;&#20659;&#36865;&#21040; <code>syslog</code> &#21151;&#33021;&#12290;</p>
<p>&#27492;&#21151;&#33021;&#20677;&#36969;&#29992;&#26044; Solaris &#21644; Linux &#31995;&#32113;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#35352;&#37636;&#27284;&#12301; &#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#20282;&#26381;&#22120;&#35352;&#37636;&#27284;&#30340;&#26367;&#20195;&#21517;&#31281;&#25110;&#20301;&#32622;&#12290;</p>
<p>&#38928;&#35373;&#20301;&#32622;&#28858; <code>${com.sun.aas.instanceRoot}/logs/server.log</code>&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#35352;&#37636;&#34389;&#29702;&#31243;&#24335;&#12301; &#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#33258;&#35330;&#35352;&#37636;&#34389;&#29702;&#31243;&#24335;&#30340;&#32085;&#23565;&#39006;&#21029;&#21517;&#31281;&#12290;</p>
<p>&#33258;&#35330;&#35352;&#37636;&#34389;&#29702;&#31243;&#24335;&#21487;&#35731;&#24744;&#23559;&#35352;&#37636;&#20659;&#36865;&#21040; <code>server.log</code> &#25110; <code>syslog</code> &#20197;&#22806;&#30340;&#30446;&#30340;&#22320;&#12290;&#33258;&#35330;&#34389;&#29702;&#31243;&#24335;&#24517;&#38920;&#24310;&#20280; <code>java.util.logging.ConsoleHandler</code> &#39006;&#21029; (&#33287; JSR 047 &#30456;&#23481;&#30340; API)&#12290;&#35531;&#23559;&#34389;&#29702;&#31243;&#24335;&#39006;&#21029;&#32622;&#26044; GlassFish Server &#39006;&#21029;&#36335;&#24465;&#20013;&#65292;&#20197;&#20415;&#22312;&#20282;&#26381;&#22120;&#21855;&#21205;&#26399;&#38291;&#23433;&#35037;&#35442;&#34389;&#29702;&#31243;&#24335;&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#27284;&#26696;&#33258;&#21205;&#37325;&#24314;&#38480;&#21046;&#12301; &#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#20282;&#26381;&#22120;&#35352;&#37636;&#27284;&#24517;&#38920;&#36948;&#21040;&#27492;&#20301;&#20803;&#32068;&#22823;&#23567;&#24460;&#65292;&#25165;&#26371;&#33258;&#21205;&#37325;&#24314;&#12290;</p>
<p>&#30070;&#20282;&#26381;&#22120;&#35352;&#37636;&#36948;&#21040;&#25351;&#23450;&#22823;&#23567;&#26178;&#65292;GlassFish Server &#26371;&#26032;&#24314;&#19968;&#20491;&#21517;&#28858; <code>server.log</code> &#30340;&#31354;&#27284;&#26696;&#65292;&#20006;&#23559;&#33290;&#27284;&#26696;&#37325;&#26032;&#21629;&#21517;&#28858; <code>server.log_</code><i>date</i>&#65292;&#20854;&#20013; <i>date</i> &#28858;&#33258;&#21205;&#37325;&#24314;&#27284;&#26696;&#30340;&#26085;&#26399;&#21644;&#26178;&#38291;&#12290;&#38928;&#35373;&#20540;&#28858; 2 &#30334;&#33836;&#20301;&#20803;&#32068;&#12290;&#26368;&#23567;&#38480;&#23450;&#20540;&#28858; 500 KB&#65307;&#22914;&#26524;&#24744;&#25351;&#23450;&#20102;&#36611;&#20302;&#30340;&#20540;&#65292;&#21063;&#35201;&#22312;&#36948;&#21040; 500 KB &#26178;&#35442;&#27284;&#26696;&#25165;&#33258;&#21205;&#37325;&#24314;&#12290;&#33509;&#35201;&#38364;&#38281;&#35352;&#37636;&#27284;&#33258;&#21205;&#37325;&#24314;&#65292;&#35531;&#23559;&#35442;&#20540;&#35373;&#23450;&#28858; 0&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#27284;&#26696;&#33258;&#21205;&#37325;&#24314;&#26178;&#38291;&#38480;&#21046;&#12301; &#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#20282;&#26381;&#22120;&#35352;&#37636;&#24517;&#38920;&#33258;&#21205;&#37325;&#24314;&#20043;&#21069;&#25152;&#31561;&#20505;&#30340;&#20998;&#37912;&#25976;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 0&#65292;&#36889;&#34920;&#31034;&#30070;&#27284;&#26696;&#36948;&#21040; &#12300;&#27284;&#26696;&#33258;&#21205;&#37325;&#24314;&#38480;&#21046;&#12301; &#27396;&#20301;&#20013;&#25351;&#23450;&#30340;&#22823;&#23567;&#26178;&#21363;&#33258;&#21205;&#37325;&#24314;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
&#22914;&#26524;&#25351;&#23450;&#19968;&#25110;&#22810;&#20998;&#37912;&#65292;&#27492;&#26178;&#38291;&#38480;&#21046;&#26371;&#20778;&#20808;&#26044; &#12300;&#27284;&#26696;&#33258;&#21205;&#37325;&#24314;&#38480;&#21046;&#12301; &#27396;&#20301;&#20013;&#25351;&#23450;&#30340;&#22823;&#23567;&#38480;&#21046;&#12290;
<hr>

</li>
<li>
<p>&#22312; &#12300;&#28165;&#38500;&#38971;&#29575;&#12301; &#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#19968;&#27425;&#21487;&#24478;&#20295;&#21015;&#23531;&#20837;&#21040;&#20282;&#26381;&#22120;&#35352;&#37636;&#30340;&#35338;&#24687;&#26368;&#22823;&#25976;&#30446;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 1&#12290;</p>
</li>
<li>
<p>&#25353;&#19968;&#19979; &#12300;&#20786;&#23384;&#12301;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
&#26681;&#25818;&#21855;&#29992;&#35352;&#37636;&#21151;&#33021;&#30340;&#32068;&#24907;&#65292;&#21487;&#33021;&#38656;&#35201;&#37325;&#26032;&#21855;&#21205;&#20282;&#26381;&#22120;&#12290;
<p>&#22914;&#26524;&#35722;&#26356;&#38928;&#35373;&#35373;&#23450;&#30340;&#35352;&#37636;&#27284;&#21517;&#31281;&#65292;&#20063;&#21487;&#33021;&#38656;&#35201;&#37325;&#26032;&#21855;&#21205;&#20282;&#26381;&#22120;&#12290;&#22914;&#26524;&#38656;&#35201;&#37325;&#26032;&#21855;&#21205;&#20282;&#26381;&#22120;&#65292;&#31649;&#29702;&#20027;&#25511;&#21488;&#30340;&#21491;&#19978;&#35282;&#20415;&#26371;&#39023;&#31034; &#12300;<code>Restart required</code>&#12301; &#35338;&#24687;&#12290;</p>

<hr>

</li>
</ol>
<a id="sthref121" name="sthref121"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-eelogginglevels.html">&#32068;&#24907;&#35352;&#37636;&#23652;&#32026;</a></p>
</li>
<li>
<p><a href="task-logging-max-logfiles.html">&#35722;&#26356;&#33258;&#21205;&#37325;&#24314;&#30340;&#35352;&#37636;&#27284;&#25976;&#30446;&#38480;&#21046;</a></p>
</li>
<li>
<p><a href="task-logviewer.html">&#27298;&#35222; DAS &#30340;&#35352;&#37636;&#27284;</a></p>
</li>
<li>
<p><a href="task-logging-collectlogfiles.html">&#24314;&#31435;&#25152;&#26377;&#35352;&#37636;&#27284;&#30340; ZIP &#27512;&#27284;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
