<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-securitysettings" name="task-securitysettings"></a><a id="GHCOM00181" name="GHCOM00181"></a></p>

<h4><a id="sthref134" name="sthref134"></a><a id="sthref135" name="sthref135"></a>&#32068;&#24907;&#23433;&#20840;&#24615;&#35373;&#23450;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#31649;&#29702;&#20027;&#25511;&#21488;&#21487;&#20379;&#24744;&#35373;&#23450;&#25972;&#20491;&#31995;&#32113;&#30340;&#21508;&#31278;&#23433;&#20840;&#24615;&#35373;&#23450;&#12290;</p>
<ol>
<li>
<p>&#22312;&#28687;&#35261;&#27193;&#29376;&#32080;&#27083;&#20013;&#65292;&#23637;&#38283; &#12300;&#32068;&#24907;&#12301; &#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#32068;&#24907;&#12301; &#31680;&#40670;&#19979;&#65292;&#25353;&#19968;&#19979;&#24744;&#35201;&#32068;&#24907; &#12300;&#23433;&#20840;&#24615;&#12301; &#35373;&#23450;&#30340;&#20282;&#26381;&#22120;&#23526;&#20363;&#25110;&#21474;&#38598;&#32068;&#24907;&#12290;</p>
<p>&#12300;&#32068;&#24907;&#12301; &#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#32068;&#24907;&#12301; &#38913;&#38754;&#19978;&#65292;&#25353;&#19968;&#19979; &#12300;&#23433;&#20840;&#24615;&#12301;&#12290;</p>
<p>&#25152;&#36984;&#21462;&#32068;&#24907;&#30446;&#27161;&#30340; &#12300;&#23433;&#20840;&#24615;&#35373;&#23450;&#12301; &#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#23433;&#20840;&#24615;&#31649;&#29702;&#21729;&#12301;&#30340;&#12300;&#24050;&#21855;&#29992;&#12301;&#26680;&#21462;&#26041;&#22602;&#20197;&#21855;&#21205;&#23433;&#20840;&#24615;&#31649;&#29702;&#21729;&#12290;</p>
<p>&#22914;&#26524;&#21855;&#29992;&#27492;&#36984;&#38917;&#65292;JVM &#36984;&#38917; <code>-Djava.security.manager</code> &#26371;&#22686;&#21152;&#21040; GlassFish Server &#30340; JVM &#35373;&#23450;&#12290;&#35531;&#21443;&#38321;<a href="task-jvmoptions.html">&#32068;&#24907; JVM &#36984;&#38917;</a>&#12290;&#24744;&#24517;&#38920;&#37325;&#26032;&#21855;&#21205;&#20282;&#26381;&#22120;&#25165;&#33021;&#21855;&#29992;&#27492;&#35722;&#26356;&#12290;</p>
<p>&#30906;&#20445;&#25152;&#26377;&#25033;&#29992;&#31243;&#24335;&#37117;&#24050;&#25480;&#20104;&#27491;&#30906;&#30340;&#27402;&#38480;&#12290;&#24744;&#21487;&#20197;&#38364;&#38281;&#23433;&#20840;&#24615;&#31649;&#29702;&#21729;&#20197;&#25552;&#26119;&#25928;&#33021;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#31293;&#26680;&#35352;&#37636;&#12301;&#30340;&#12300;&#24050;&#21855;&#29992;&#12301;&#26680;&#21462;&#26041;&#22602;&#20197;&#21855;&#21205;&#31293;&#26680;&#35352;&#37636;&#12290;</p>
<p>&#33509;&#21855;&#29992;&#27492;&#36984;&#38917;&#65292;&#20282;&#26381;&#22120;&#23559;&#26371;&#36617;&#20837;&#20006;&#22519;&#34892;&#25152;&#26377;&#22312; &#12300;&#31293;&#26680;&#27169;&#32068;&#12301; &#28165;&#21934;&#20013;&#36984;&#21462;&#30340;&#31293;&#26680;&#27169;&#32068;&#12290;&#33509;&#20572;&#29992;&#27492;&#36984;&#38917;&#65292;&#20282;&#26381;&#22120;&#23559;&#28961;&#27861;&#23384;&#21462;&#31293;&#26680;&#27169;&#32068;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</li>
<li>
<p>&#24478; &#12300;&#38928;&#35373;&#31684;&#22285;&#12301; &#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#20282;&#26381;&#22120;&#23559;&#29992;&#26044;&#39511;&#35657;&#30340;&#20351;&#29992;&#20013;&#31684;&#22285;&#12290;</p>
<p>&#38500;&#38750;&#25033;&#29992;&#31243;&#24335;&#30340;&#24314;&#32622;&#25551;&#36848;&#20803;&#25351;&#23450;&#20102;&#19981;&#21516;&#30340;&#31684;&#22285;&#65292;&#21542;&#21063;&#25033;&#29992;&#31243;&#24335;&#26371;&#20351;&#29992;&#27492;&#31684;&#22285;&#12290;&#25152;&#26377;&#24050;&#32068;&#24907;&#30340;&#31684;&#22285;&#37117;&#26371;&#39023;&#31034;&#22312;&#28165;&#21934;&#20013;&#12290;&#38928;&#35373;&#20540;&#28858; <code>file</code>&#12290;</p>
</li>
<li>
<p>&#25351;&#23450; &#12300;&#38928;&#35373;&#20027;&#39636;&#12301; &#36039;&#35338;&#12290;</p>
<ol type="a">
<li>
<p>&#22312; &#12300;&#38928;&#35373;&#20027;&#39636;&#12301; &#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#38928;&#35373;&#20351;&#29992;&#32773;&#21517;&#31281;&#12290;</p>
<p>&#33509;&#26410;&#25552;&#20379;&#20219;&#20309;&#20854;&#20182;&#20027;&#39636;&#65292;&#20282;&#26381;&#22120;&#26371;&#20351;&#29992;&#27492;&#20351;&#29992;&#32773;&#21517;&#31281;&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#38928;&#35373;&#20027;&#39636;&#23494;&#30908;&#12301; &#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#22312; &#12300;&#38928;&#35373;&#20027;&#39636;&#12301; &#27396;&#20301;&#20013;&#25351;&#23450;&#20043;&#38928;&#35373;&#20027;&#39636;&#30340;&#23494;&#30908;&#12290;</p>
</li>
</ol>
<p>&#19968;&#33324;&#20282;&#26381;&#22120;&#20316;&#26989;&#19981;&#38656;&#35201;&#38928;&#35373;&#20027;&#39636;&#12290;</p>
</li>
<li>
<p>&#24478; &#12300;JACC&#12301; &#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#24050;&#32068;&#24907;&#30340; JACC &#25552;&#20379;&#32773;&#21517;&#31281;&#12290;</p>
<p>&#38928;&#35373;&#36984;&#25799;&#21253;&#25324; <code>default</code> &#21644; <code>simple</code>&#12290;&#38928;&#35373;&#36984;&#38917;&#28858; <code>default</code>&#12290;&#22914;&#38656;&#26377;&#38364;&#24314;&#31435;&#26032; JACC &#25552;&#20379;&#32773;&#30340;&#36039;&#35338;&#65292;&#35531;&#21443;&#38321; ***&#12290;</p>
</li>
<li>
<p>&#24478; &#12300;&#31293;&#26680;&#27169;&#32068;&#12301; &#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#33509;&#21855;&#29992;&#31293;&#26680;&#35352;&#37636;&#65292;&#23559;&#30001;&#31293;&#26680;&#23376;&#31995;&#32113;&#20351;&#29992;&#21738;&#20491;&#31293;&#26680;&#25552;&#20379;&#32773;&#27169;&#32068;&#12290;</p>
<p>&#20381;&#38928;&#35373;&#65292;&#20282;&#26381;&#22120;&#20351;&#29992;&#21517;&#28858; <code>default</code> &#30340;&#31293;&#26680;&#27169;&#32068;&#12290;&#22914;&#38656;&#26377;&#38364;&#24314;&#31435;&#26032;&#31293;&#26680;&#27169;&#32068;&#30340;&#36039;&#35338;&#65292;&#35531;&#21443;&#38321;<a href="task-auditmodulenew.html">&#24314;&#31435;&#31293;&#26680;&#27169;&#32068;</a>&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#38928;&#35373;&#20027;&#39636;&#33267;&#35282;&#33394;&#23565;&#26144;&#12301;&#30340;&#12300;&#24050;&#21855;&#29992;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#23559;&#38928;&#35373;&#30340;&#20027;&#39636;&#33267;&#35282;&#33394;&#23565;&#26144;&#22871;&#29992;&#26044;&#27794;&#26377;&#25033;&#29992;&#31243;&#24335;&#23560;&#29992;&#23565;&#26144;&#30340;&#25033;&#29992;&#31243;&#24335;&#12290;</p>
</li>
<li>
<p>&#22914;&#26524;&#21855;&#29992;&#20102;&#38928;&#35373;&#20027;&#39636;&#33267;&#35282;&#33394;&#23565;&#26144;&#65292;&#22312; &#12300;&#23565;&#26144;&#30340;&#20027;&#39636;&#39006;&#21029;&#12301; &#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#23559;&#29992;&#26044;&#38928;&#35373;&#20027;&#39636;&#33267;&#35282;&#33394;&#23565;&#26144;&#30340;&#33258;&#35330; <code>java.security.Principal</code> &#23526;&#20316;&#39006;&#21029;&#21517;&#31281;&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#20854;&#20182;&#29305;&#24615;&#12301; &#21312;&#27573;&#20013;&#65292;&#25351;&#23450;&#20854;&#20182;&#29305;&#24615;&#12290;</p>
<p>&#26377;&#25928;&#29305;&#24615;&#21462;&#27770;&#26044;&#22312; &#12300;&#38928;&#35373;&#31684;&#22285;&#12301; &#27396;&#20301;&#20013;&#36984;&#21462;&#30340;&#31684;&#22285;&#39006;&#22411;&#12290;&#22914;&#38656;&#30637;&#35299;&#35201;&#32068;&#24907;&#31684;&#22285;&#30340;&#39006;&#22411;&#65292;&#35531;&#21443;&#38321;&#20197;&#19979;&#28165;&#21934;&#20013;&#30340;&#36969;&#30070;&#38917;&#30446;&#12290;</p>
<ul>
<li>
<p><a href="ref-editfile-adminrealm.html"><code>FileRealm</code> &#39006;&#21029;&#29305;&#23450;&#30340;&#29305;&#24615;</a></p>
</li>
<li>
<p><a href="ref-editcertrealm.html"><code>CertificateRealm</code> &#39006;&#21029;&#29305;&#23450;&#30340;&#29305;&#24615;</a></p>
</li>
<li>
<p><a href="ref-editjdbcrealm.html"><code>JDBCRealm</code> &#39006;&#21029;&#29305;&#23450;&#30340;&#29305;&#24615;</a></p>
</li>
<li>
<p><a href="ref-ldaprealmprop.html"><code>LDAPRealm</code> &#39006;&#21029;&#29305;&#23450;&#30340;&#29305;&#24615;</a></p>
</li>
<li>
<p><a href="ref-solarisrealmprop.html"><code>SolarisRealm</code> &#39006;&#21029;&#29305;&#23450;&#30340;&#29305;&#24615;</a></p>
</li>
<li>
<p><a href="ref-pamrealmprop.html"><code>PamRealm</code> &#39006;&#21029;&#29305;&#23450;&#30340;&#29305;&#24615;</a></p>
</li>
</ul>
<ul>
<li>
<p>&#33509;&#35201;&#22686;&#21152;&#29305;&#24615;&#65292;&#35531;&#25353;&#19968;&#19979; &#12300;&#22686;&#21152;&#29305;&#24615;&#12301; &#25353;&#37397;&#12290;&#22312;&#20986;&#29694;&#30340;&#31354;&#30333;&#21015;&#20013;&#65292;&#26044; &#12300;&#21517;&#31281;&#12301; &#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#21517;&#31281;&#65292;&#28982;&#24460;&#22312; &#12300;&#20540;&#12301; &#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#20540;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#20462;&#25913;&#29305;&#24615;&#65292;&#35531;&#32232;&#36655;&#29305;&#24615;&#30340; &#12300;&#20540;&#12301; &#27396;&#20301;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#21034;&#38500;&#29305;&#24615;&#65292;&#35531;&#36984;&#21462;&#24744;&#35201;&#21034;&#38500;&#20043;&#29305;&#24615; &#12300;&#21517;&#31281;&#12301; &#27396;&#20301;&#24038;&#20596;&#30340;&#26680;&#21462;&#26041;&#22602;&#65292;&#28982;&#24460;&#25353;&#19968;&#19979; &#12300;&#21034;&#38500;&#29305;&#24615;&#12301; &#25353;&#37397;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#25353;&#19968;&#19979; &#12300;&#20786;&#23384;&#12301;&#12290;</p>
</li>
</ol>
<a id="sthref136" name="sthref136"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-accessadmintools.html">&#25480;&#33287;&#31649;&#29702;&#24037;&#20855;&#30340;&#23384;&#21462;&#27402;</a></p>
</li>
<li>
<p><a href="task-changeadminpasswd.html">&#35722;&#26356;&#31649;&#29702;&#31684;&#22285;&#20013;&#20351;&#29992;&#32773;&#30340;&#23494;&#30908;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
