<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-messagesecurityconfigedit" name="task-messagesecurityconfigedit"></a><a id="GHCOM00205" name="GHCOM00205"></a></p>

<h4><a id="sthref185" name="sthref185"></a>&#32232;&#36655;&#35338;&#24687;&#23433;&#20840;&#24615;&#32068;&#24907;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#33509;&#35201;&#28858;&#24314;&#32622;&#26044; GlassFish Server &#20013;&#30340; Web &#26381;&#21209;&#31471;&#40670;&#21855;&#29992;&#35338;&#24687;&#23433;&#20840;&#24615;&#65292;&#24517;&#38920;&#25351;&#23450;&#35201;&#22312;&#20282;&#26381;&#22120;&#31471;&#20381;&#38928;&#35373;&#20351;&#29992;&#30340;&#25552;&#20379;&#32773;&#12290;&#22914;&#26524;&#35201;&#21855;&#29992;&#35338;&#24687;&#23433;&#20840;&#24615;&#30340;&#38928;&#35373;&#25552;&#20379;&#32773;&#65292;&#24744;&#36996;&#38656;&#35201;&#21855;&#29992;&#24314;&#32622;&#26044; GlassFish Server &#20013;&#30340; Web &#26381;&#21209;&#20043;&#29992;&#25142;&#31471;&#25152;&#20351;&#29992;&#30340;&#25552;&#20379;&#32773;&#12290;&#26377;&#38364;&#21855;&#29992;&#29992;&#25142;&#31471;&#25152;&#29992;&#20043;&#25552;&#20379;&#32773;&#30340;&#36039;&#35338;&#65292;&#23559;&#22312;<a href="task-enablemesec4appclients.html">&#21855;&#29992;&#25033;&#29992;&#31243;&#24335;&#29992;&#25142;&#31471;&#30340;&#35338;&#24687;&#23433;&#20840;&#24615;</a>&#20013;&#35342;&#35542;&#12290;</p>
<p>&#33509;&#35201;&#21855;&#29992;&#28304;&#33258;&#24050;&#24314;&#32622;&#31471;&#40670;&#30340; Web &#26381;&#21209;&#21628;&#21483;&#20043;&#35338;&#24687;&#23433;&#20840;&#24615;&#65292;&#24744;&#24517;&#38920;&#25351;&#23450;&#38928;&#35373;&#29992;&#25142;&#31471;&#25552;&#20379;&#32773;&#12290;&#22914;&#26524;&#24050;&#28858; GlassFish Server &#21855;&#29992;&#20102;&#38928;&#35373;&#29992;&#25142;&#31471;&#25552;&#20379;&#32773;&#65292;&#21063;&#24517;&#38920;&#30906;&#20445;&#24478; GlassFish Server &#20013;&#24314;&#32622;&#30340;&#31471;&#40670;&#21628;&#21483;&#30340;&#20219;&#20309;&#26381;&#21209;&#22343;&#32068;&#24907;&#28858;&#33287;&#35338;&#24687;&#23652;&#23433;&#20840;&#24615;&#30456;&#23481;&#12290;</p>
<ol>
<li>
<p>&#22312;&#28687;&#35261;&#27193;&#29376;&#32080;&#27083;&#20013;&#65292;&#23637;&#38283; &#12300;&#32068;&#24907;&#12301; &#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#23637;&#38283; &#12300;&#23433;&#20840;&#24615;&#12301; &#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462; &#12300;&#35338;&#24687;&#23433;&#20840;&#24615;&#12301; &#31680;&#40670;&#12290;</p>
<p>&#12300;&#35338;&#24687;&#23433;&#20840;&#24615;&#32068;&#24907;&#12301; &#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#35338;&#24687;&#23433;&#20840;&#24615;&#32068;&#24907;&#12301; &#38913;&#38754;&#19978;&#65292;&#25353;&#19968;&#19979;&#35201;&#32232;&#36655;&#20043;&#32068;&#24907;&#30340;&#35469;&#35657;&#23652;&#21517;&#31281;&#12290;</p>
<p>&#26681;&#25818;&#38928;&#35373;&#65292;&#21807;&#19968;&#32068;&#24907;&#30340;&#35338;&#24687;&#23433;&#20840;&#24615;&#32068;&#24907;&#28858; SOAP&#12290;</p>
<p>&#12300;&#32232;&#36655;&#35338;&#24687;&#23433;&#20840;&#24615;&#32068;&#24907;&#12301; &#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#32232;&#36655;&#35338;&#24687;&#23433;&#20840;&#24615;&#32068;&#24907;&#12301; &#38913;&#38754;&#30340; &#12300;&#38928;&#35373;&#25552;&#20379;&#32773;&#12301; &#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#20282;&#26381;&#22120;&#31471;&#25552;&#20379;&#32773;&#12290;</p>
<p>&#38928;&#35373;&#20282;&#26381;&#22120;&#25552;&#20379;&#32773;&#20063;&#31281;&#28858;&#38928;&#35373;&#25552;&#20379;&#32773;&#65292;&#21487;&#37341;&#23565;&#26410;&#25351;&#23450;&#29305;&#23450;&#20282;&#26381;&#22120;&#25552;&#20379;&#32773;&#30340;&#25033;&#29992;&#31243;&#24335;&#65292;&#25351;&#23450;&#21628;&#21483;&#30340;&#20282;&#26381;&#22120;&#25552;&#20379;&#32773;&#12290;&#21487;&#29992;&#30340;&#36984;&#38917;&#21253;&#25324; <code>ServerProvider</code>&#12289;<code>XWS_ServerProvider</code> &#25110;&#28961;&#12290;&#26681;&#25818;&#38928;&#35373;&#65292;&#19981;&#26371;&#36984;&#21462;&#20219;&#20309;&#25552;&#20379;&#32773;&#65292;&#22240;&#27492; GlassFish Server &#23559;&#19981;&#26371;&#22312;&#20282;&#26381;&#22120;&#31471;&#21628;&#21483;&#35338;&#24687;&#23433;&#20840;&#24615;&#25552;&#20379;&#32773;&#12290;&#19968;&#33324;&#20358;&#35498;&#65292;&#35531;&#36984;&#21462; <code>ServerProvider</code> &#20316;&#28858;&#38928;&#35373;&#25552;&#20379;&#32773;&#12290;</p>
</li>
<li>
<p>&#24478; &#12300;&#38928;&#35373;&#29992;&#25142;&#31471;&#25552;&#20379;&#32773;&#12301; &#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#29992;&#25142;&#31471;&#25552;&#20379;&#32773;&#12290;</p>
<p>&#25033;&#29992;&#31243;&#24335;&#28961;&#27861;&#25351;&#23450;&#29305;&#23450;&#29992;&#25142;&#31471;&#25552;&#20379;&#32773;&#26178;&#65292;&#38928;&#35373;&#29992;&#25142;&#31471;&#25552;&#20379;&#32773;&#21363;&#21487;&#28858;&#20854;&#25351;&#23450;&#25033;&#21628;&#21483;&#30340;&#29992;&#25142;&#31471;&#25552;&#20379;&#32773;&#12290;&#21487;&#29992;&#30340;&#36984;&#38917;&#21253;&#25324; <code>ClientProvider</code>&#12289;<code>XWS_ClientProvider</code> &#25110;&#28961;&#12290;&#26681;&#25818;&#38928;&#35373;&#65292;&#19981;&#26371;&#36984;&#21462;&#20219;&#20309;&#25552;&#20379;&#32773;&#65292;&#22240;&#27492; GlassFish Server &#23559;&#19981;&#26371;&#22312;&#29992;&#25142;&#31471;&#21628;&#21483;&#35338;&#24687;&#23433;&#20840;&#24615;&#25552;&#20379;&#32773;&#12290;&#19968;&#33324;&#20358;&#35498;&#65292;&#35531;&#36984;&#21462; &#12300;&#28961;&#12301; &#20316;&#28858;&#38928;&#35373;&#29992;&#25142;&#31471;&#25552;&#20379;&#32773;&#12290;&#36984;&#21462; &#12300;<code>ClientProvider</code>&#12301; &#20197;&#21855;&#29992;&#38928;&#35373;&#25552;&#20379;&#32773;&#21644;&#35338;&#24687;&#20445;&#35703;&#31574;&#30053;&#65292;&#20197;&#22871;&#29992;&#26044;&#30001; GlassFish Server &#19978;&#24314;&#32622;&#30340; Web &#26381;&#21209;&#31471;&#40670;&#30332;&#20986;&#30340; Web &#26381;&#21209;&#21628;&#21483;&#12290;</p>
</li>
<li>
<p>&#25353;&#19968;&#19979; &#12300;&#20786;&#23384;&#12301;&#12290;</p>
</li>
<li>
<p>&#22914;&#38656;&#35498;&#26126;&#22914;&#20309;&#20462;&#25913;&#24050;&#21855;&#29992;&#30340;&#29992;&#25142;&#31471;&#25552;&#20379;&#32773;&#25110;&#20282;&#26381;&#22120;&#25552;&#20379;&#32773;&#20043;&#35338;&#24687;&#20445;&#35703;&#31574;&#30053;&#65292;&#35531;&#21443;&#38321;<a href="task-messagesecurityproviderconfigedit.html">&#32232;&#36655;&#35338;&#24687;&#23433;&#20840;&#24615;&#25552;&#20379;&#32773;&#32068;&#24907;</a>&#12290;</p>
</li>
</ol>
<a id="sthref186" name="sthref186"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">&#32068;&#24907;&#35338;&#24687;&#23433;&#20840;&#24615;&#25552;&#20379;&#32773;&#25152;&#20351;&#29992;&#30340; GlassFish Server &#21151;&#33021;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">&#24314;&#31435;&#35338;&#24687;&#23433;&#20840;&#24615;&#32068;&#24907;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">&#21034;&#38500;&#35338;&#24687;&#23433;&#20840;&#24615;&#32068;&#24907;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">&#24314;&#31435;&#35338;&#24687;&#23433;&#20840;&#24615;&#25552;&#20379;&#32773;&#32068;&#24907;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">&#32232;&#36655;&#35338;&#24687;&#23433;&#20840;&#24615;&#25552;&#20379;&#32773;&#32068;&#24907;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">&#21034;&#38500;&#35338;&#24687;&#23433;&#20840;&#24615;&#25552;&#20379;&#32773;&#32068;&#24907;</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">&#21855;&#29992;&#25033;&#29992;&#31243;&#24335;&#29992;&#25142;&#31471;&#30340;&#35338;&#24687;&#23433;&#20840;&#24615;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
