<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-confmonitor" name="task-confmonitor"></a><a id="GHCOM00213" name="GHCOM00213"></a></p>

<h4><a id="sthref206" name="sthref206"></a>&#32068;&#24907;&#30435;&#35222;&#26381;&#21209;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#33509;&#35201;&#38283;&#21855;&#12300;&#30435;&#35222;&#26381;&#21209;&#12301;&#38913;&#38754;&#65292;&#35531;&#22519;&#34892;&#19979;&#21015;&#20854;&#20013;&#19968;&#38917;&#65306;</p>
<ul>
<li>
<p>&#36984;&#21462;&#12300;&#30435;&#35222;&#36039;&#26009;&#12301;&#31680;&#40670;&#65292;&#20006;&#25353;&#19968;&#19979;&#24744;&#35201;&#28858;&#20854;&#32068;&#24907;&#30435;&#35222;&#20043;&#20282;&#26381;&#22120;&#23526;&#20363;&#30340;&#12300;&#37197;&#32622;&#30435;&#35222;&#12301;&#36899;&#32080;&#12290;&#33509;&#35201;&#32068;&#24907;&#21474;&#38598;&#30340;&#30435;&#35222;&#65292;&#35531;&#36984;&#25799;&#21474;&#38598;&#20013;&#30340;&#20219;&#19968;&#23526;&#20363;&#12290;</p>
</li>
</ul>
<ul>
<li>
<p>&#22312;&#12300;&#37197;&#32622;&#12301;&#31680;&#40670;&#19979;&#65292;&#23637;&#38283;&#20320;&#35201;&#37197;&#32622;&#30435;&#35222;&#21151;&#33021;&#30340;&#20282;&#26381;&#22120;&#23526;&#20363;&#25110;&#21474;&#38598;&#32068;&#24907;&#65292;&#20006;&#23637;&#38283;&#12300;&#30435;&#35222;&#12301;&#31680;&#40670;&#12290;</p>
</li>
</ul>
<p>&#12300;&#30435;&#35222;&#26381;&#21209;&#12301; &#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#30435;&#35222;&#26381;&#21209;&#12301;&#30340;&#12300;&#24050;&#21855;&#29992;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#28858; GlassFish Server &#21855;&#29992;&#30435;&#35222;&#65292;&#25110;&#21462;&#28040;&#36984;&#21462;&#26680;&#21462;&#26041;&#22602;&#20197;&#20572;&#29992;&#30435;&#35222;&#12290;</p>
<p>&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#21855;&#29992;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#30435;&#35222; MBean&#12301;&#30340;&#12300;&#24050;&#21855;&#29992;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#24314;&#32622;&#30435;&#35222;&#38656;&#35201;&#30340;&#25152;&#26377; MBeans&#65292;&#25110;&#21462;&#28040;&#36984;&#21462;&#26680;&#21462;&#26041;&#22602;&#20197;&#23559;&#36889;&#20123; MBeans &#35299;&#38500;&#24314;&#32622;&#12290;</p>
<p>&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#21855;&#29992;&#12290;</p>
<p>&#22914;&#26524;&#27794;&#26377;&#36984;&#21462;&#27492;&#26680;&#21462;&#26041;&#22602;&#65292;&#21363;&#20351;&#24050;&#36984;&#21462; &#12300;&#30435;&#35222;&#26381;&#21209;&#12301; &#26680;&#21462;&#26041;&#22602;&#65292;&#24744;&#20063;&#28961;&#27861;&#22312;&#31649;&#29702;&#20027;&#25511;&#21488;&#19978;&#27298;&#35222;&#30435;&#35222;&#36039;&#26009;&#12290;&#24744;&#24517;&#38920;&#20351;&#29992;&#21629;&#20196;&#34892;&#20358;&#27298;&#35222;&#30435;&#35222;&#36039;&#26009;&#12290;&#22914;&#26524;&#24744;&#21462;&#28040;&#36984;&#21462;&#27492;&#26680;&#21462;&#26041;&#22602;&#65292;GlassFish Server &#30340;&#35352;&#25014;&#39636;&#20351;&#29992;&#37327;&#26371;&#28187;&#23569;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462; DTrace &#30340;&#12300;&#24050;&#21855;&#29992;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#21855;&#29992; Solaris DTrace &#21151;&#33021;&#12290;</p>
<p>&#33509;&#35201;&#20351;&#29992; Solaris DTrace &#21151;&#33021;&#65292;&#24744;&#20063;&#24517;&#38920;&#20855;&#26377; Oracle Enterprise Manager DTrace Monitoring&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</li>
<li>
<p>&#22312;&#34920;&#26684;&#20013;&#65292;&#22519;&#34892;&#19979;&#21015;&#20854;&#20013;&#19968;&#20491;&#21205;&#20316;&#12290;</p>
<ul>
<li>
<p>&#22312; &#12300;&#30435;&#35222;&#23652;&#32026;&#12301; &#27396;&#20013;&#65292;&#37341;&#23565; &#12300;&#20803;&#20214;&#12301; &#27396;&#20013;&#30340;&#19968;&#20491;&#25110;&#22810;&#20491;&#20803;&#20214;&#65292;&#24478;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#36984;&#21462; &#12300;&#20302;&#12301; &#25110; &#12300;&#39640;&#12301;&#65292;&#20197;&#21855;&#29992;&#36889;&#20123;&#20803;&#20214;&#30340;&#30435;&#35222;&#21151;&#33021;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#19968;&#20491;&#25110;&#22810;&#20491;&#20803;&#20214;&#26049;&#30340;&#26680;&#21462;&#26041;&#22602;&#65292;&#28982;&#24460;&#24478;&#34920;&#26684;&#38914;&#31471;&#30340; &#12300;&#23652;&#32026;&#12301; &#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#36984;&#21462; &#12300;&#20302;&#12301; &#25110; &#12300;&#39640;&#12301;&#65292;&#20877;&#25353;&#19968;&#19979; &#12300;&#35722;&#26356;&#23652;&#32026;&#12301; &#25353;&#37397;&#65292;&#23559;&#25152;&#26377;&#20803;&#20214;&#30340;&#30435;&#35222;&#23652;&#32026;&#35373;&#28858;&#35442;&#20540;&#12290;</p>
</li>
</ul>
<p>&#22312;&#27492;&#30332;&#34892;&#29256;&#26412;&#20013;&#65292;&#12300;&#20302;&#12301; &#33287; &#12300;&#39640;&#12301; &#36984;&#38917;&#25152;&#25552;&#20379;&#30340;&#30435;&#35222;&#23652;&#32026;&#20006;&#28961;&#19981;&#21516;&#12290;&#33509;&#35201;&#20572;&#29992;&#19968;&#20491;&#25110;&#22810;&#20491;&#20803;&#20214;&#30340;&#30435;&#35222;&#65292;&#35531;&#36984;&#21462; &#12300;&#38364;&#38281;&#12301;&#12290;&#38928;&#35373;&#20540;&#28858; &#12300;OFF&#12301;&#12290;</p>
<p>&#24744;&#24517;&#38920;&#20808;&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;&#12289;&#20803;&#20214;&#25110;&#26381;&#21209;&#65292;&#25165;&#33021;&#28858;&#20854;&#32068;&#24907;&#30435;&#35222;&#12290;</p>
</li>
<li>
<p>&#25353;&#19968;&#19979; &#12300;&#20786;&#23384;&#12301;&#12290;</p>
</li>
</ol>
<a id="sthref207" name="sthref207"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-appmonitoringdata.html">&#27298;&#35222;&#25033;&#29992;&#31243;&#24335;&#30435;&#35222;&#36039;&#26009;</a></p>
</li>
<li>
<p><a href="task-servermonitoringdata.html">&#27298;&#35222;&#20282;&#26381;&#22120;&#30435;&#35222;&#36039;&#26009;</a></p>
</li>
<li>
<p><a href="task-resourcemonitoringdata.html">&#27298;&#35222;&#36039;&#28304;&#30435;&#35222;&#36039;&#26009;</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
