<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-appedit" name="task-appedit"></a><a id="GHCOM00161" name="GHCOM00161"></a></p>

<h4><a id="sthref74" name="sthref74"></a>&#32232;&#36655;&#24050;&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#28687;&#35261;&#27193;&#29376;&#32080;&#27083;&#20013;&#65292;&#36984;&#21462; &#12300;&#25033;&#29992;&#31243;&#24335;&#12301; &#31680;&#40670;&#12290;</p>
<p>&#12300;&#25033;&#29992;&#31243;&#24335;&#12301; &#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#24478; &#12300;&#24050;&#24314;&#32622;&#30340;&#25033;&#29992;&#31243;&#24335;&#12301; &#34920;&#26684;&#20013;&#65292;&#25353;&#19968;&#19979;&#24744;&#35201;&#32232;&#36655;&#30340;&#25033;&#29992;&#31243;&#24335;&#21517;&#31281;&#12290;</p>
<p>&#21517;&#31281;&#20013;&#21487;&#20197;&#21253;&#21547;&#19968;&#20491;&#36984;&#25799;&#24615;&#30340;&#29256;&#26412;&#35672;&#21029;&#30908;&#65292;&#24460;&#38754;&#25509;&#33879;&#21517;&#31281;&#65292;&#20841;&#32773;&#38291;&#29992;&#20882;&#34399; (<code>:</code>) &#38548;&#38283;&#12290; &#22914;&#38656;&#26377;&#38364;&#27169;&#32068;&#33287;&#25033;&#29992;&#31243;&#24335;&#29256;&#26412;&#30340;&#26356;&#22810;&#36039;&#35338;&#65292;&#35531;&#21443;&#38321; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Oracle GlassFish Server Application Deployment Guide</i> &#20013;&#30340; <i>Module and Application Versions</i></a>&#12290;</p>
<p>&#12300;&#32232;&#36655;&#25033;&#29992;&#31243;&#24335;&#12301; &#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#21462;&#28040;&#36984;&#21462;&#12300;&#29376;&#24907;&#12301;&#30340;&#12300;&#24050;&#21855;&#29992;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#20197;&#20572;&#29992;&#25033;&#29992;&#31243;&#24335;&#29376;&#24907;&#65292;&#20351;&#20854;&#28961;&#27861;&#20351;&#29992;&#12290;</p>
<p>&#25033;&#29992;&#31243;&#24335;&#22312;&#24314;&#32622;&#24460;&#30340;&#29376;&#24907;&#38928;&#35373;&#28858; &#12300;&#24050;&#21855;&#29992;&#12301;&#12290;</p>
</li>
<li>
<p>&#33509;&#28858; Web &#25033;&#29992;&#31243;&#24335;&#65292;&#35531;&#22312; &#12300;&#29872;&#22659;&#26681;&#30446;&#37636;&#12301; &#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#35442;&#25033;&#29992;&#31243;&#24335;&#30340;&#36335;&#24465;&#12290;</p>
<p>&#22312; Web &#25033;&#29992;&#31243;&#24335;&#30340; URL &#20013;&#65292;&#29872;&#22659;&#26681;&#30446;&#37636;&#32202;&#25509;&#22312;&#36899;&#25509;&#22496;&#34399;&#30908;&#20043;&#24460; (<code>http://</code><i>host</i><code>:</code><i>port</i><code>/</code><i>context-root</i><code>/...</code>)&#12290;&#35531;&#30906;&#23450;&#29872;&#22659;&#26681;&#30446;&#37636;&#30340;&#38283;&#38957;&#26159;&#27491;&#26012;&#32218;&#65292;&#20363;&#22914; <code>/hello</code>&#12290;</p>
</li>
<li>
<p>&#21462;&#28040;&#36984;&#21462;&#12300;&#21487;&#29992;&#24615;&#12301;&#30340;&#12300;&#24050;&#21855;&#29992;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#20572;&#29992;&#25033;&#29992;&#31243;&#24335;&#30340;&#38542;&#27573;&#20316;&#26989;&#25345;&#32396;&#24615;&#33287; SFSB &#27298;&#26597;&#40670;&#12290;</p>
<p>&#33509;&#36984;&#21462; &#12300;&#24050;&#21855;&#29992;&#12301; &#26680;&#21462;&#26041;&#22602;&#65292;&#21063;&#26371;&#23565; Web &#38542;&#27573;&#20316;&#26989;&#12289;&#26377;&#29376;&#24907;&#30340;&#38542;&#27573;&#20316;&#26989; Bean (SFSB) &#27298;&#26597;&#40670;&#21450;&#28507;&#22312;&#30340;&#37389;&#21270;&#21855;&#29992;&#39640;&#21487;&#29992;&#24615;&#12290;&#22914;&#26524;&#35373;&#23450;&#28858; false (&#38928;&#35373;&#20540;)&#65292;&#23559;&#23565;&#25351;&#23450;&#30340;&#25033;&#29992;&#31243;&#24335;&#12289;Web &#25033;&#29992;&#31243;&#24335;&#25110; EJB &#27169;&#32068;&#20572;&#29992;&#25152;&#26377; Web &#38542;&#27573;&#20316;&#26989;&#20786;&#23384;&#21450; SFSB &#27298;&#26597;&#40670;&#12290;&#22914;&#26524;&#35373;&#23450;&#28858; true&#65292;&#23559;&#21855;&#29992;&#25351;&#23450;&#30340;&#25033;&#29992;&#31243;&#24335;&#25110;&#27169;&#32068;&#20197;&#29554;&#24471;&#39640;&#21487;&#29992;&#24615;&#12290;&#20677;&#22312;&#36611;&#39640;&#23652;&#32026; (&#20363;&#22914;&#20282;&#26381;&#22120;&#21644;&#23481;&#22120;&#23652;&#32026;) &#32068;&#24907;&#21644;&#21855;&#29992;&#39640;&#21487;&#29992;&#24615;&#26178;&#25165;&#21487;&#23559;&#27492;&#36984;&#38917;&#35373;&#23450;&#28858; true&#12290;</p>
<p>&#22914;&#26524;&#23384;&#22312;&#38928;&#35373;&#20282;&#26381;&#22120;&#23526;&#20363; (<code>server</code>) &#20197;&#22806;&#30340;&#21474;&#38598;&#25110;&#29544;&#31435;&#20282;&#26381;&#22120;&#23526;&#20363;&#65292;&#20415;&#26371;&#39023;&#31034;&#27492;&#36984;&#38917;&#12290;</p>
</li>
<li>
<p>&#24478; &#12300;&#34395;&#25836;&#20282;&#26381;&#22120;&#12301; &#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#35201;&#33287;&#27492;&#25033;&#29992;&#31243;&#24335;&#38364;&#32879;&#30340;&#34395;&#25836;&#20282;&#26381;&#22120;&#12290;</p>
<p>&#21807;&#26377;&#38928;&#35373;&#20282;&#26381;&#22120;&#23526;&#20363; <code>server</code> &#23384;&#22312;&#26178;&#65292;&#25165;&#26371;&#39023;&#31034; &#12300;&#34395;&#25836;&#20282;&#26381;&#22120;&#12301; &#36984;&#38917;&#12290;&#22914;&#26524;&#26377;&#21474;&#38598;&#25110;&#20854;&#20182;&#29544;&#31435;&#20282;&#26381;&#22120;&#23526;&#20363;&#23384;&#22312;&#65292;&#24744;&#21487;&#20197;&#22312;&#24314;&#32622;&#20043;&#24460;&#36984;&#21462;&#34395;&#25836;&#20282;&#26381;&#22120;&#12290;&#35531;&#31227;&#33267; &#12300;&#32232;&#36655;&#25033;&#29992;&#31243;&#24335;&#12301; &#38913;&#38754;&#65292;&#36984;&#21462; &#12300;&#30446;&#27161;&#12301; &#27161;&#31844;&#65292;&#28982;&#24460;&#36984;&#21462;&#25152;&#38656;&#30446;&#27161;&#30340; &#12300;&#31649;&#29702; VirtualServer&#12301;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462; Java Web Start &#30340;&#12300;&#24050;&#21855;&#29992;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#20197;&#20351;&#29992; Java Web Start &#36575;&#39636;&#20358;&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;&#12290;</p>
<p>&#27492;&#36984;&#38917;&#26681;&#25818;&#21407;&#22987;&#24314;&#32622;&#26178;&#30340;&#35373;&#23450;&#38928;&#35373;&#28858;&#21855;&#29992;&#25110;&#20572;&#29992;&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#35498;&#26126;&#12301; &#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#27492;&#25033;&#29992;&#31243;&#24335;&#30340;&#35498;&#26126;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#27298;&#35222;&#25033;&#29992;&#31243;&#24335;&#30340;&#27169;&#32068;&#25551;&#36848;&#20803;&#28165;&#21934;&#65292;&#35531;&#25353;&#19968;&#19979; &#12300;&#35498;&#26126;&#12301; &#27161;&#31844;&#12290;&#22914;&#38656;&#26356;&#22810;&#35443;&#32048;&#36039;&#35338;&#65292;&#35531;&#21443;&#38321;<a href="task-appviewdesc.html">&#27298;&#35222;&#25033;&#29992;&#31243;&#24335;&#30340;&#25551;&#36848;&#20803;</a></p>
</li>
<li>
<p>&#20381;&#38928;&#35373;&#65292;&#25152;&#26377;&#30446;&#27161;&#19978;&#30340;&#25033;&#29992;&#31243;&#24335; &#12300;&#29376;&#24907;&#12301; &#22343;&#28858; &#12300;&#24050;&#21855;&#29992;&#12301;&#12290;&#33509;&#35201;&#27298;&#35222;&#21855;&#29992;&#20102;&#25033;&#29992;&#31243;&#24335;&#30340;&#30446;&#27161;&#65292;&#35531;&#25353;&#19968;&#19979; &#12300;&#30446;&#27161;&#12301; &#27161;&#31844;&#12290;&#24744;&#21487;&#20197;&#22312;&#19968;&#20491;&#25110;&#22810;&#20491;&#30446;&#27161;&#19978;&#21855;&#29992;&#25110;&#20572;&#29992;&#25033;&#29992;&#31243;&#24335;&#12290;&#35531;&#21443;&#38321;<a href="task-appviewtargets.html">&#27298;&#35222;&#25033;&#29992;&#31243;&#24335;&#30446;&#27161;</a>&#12290;</p>
</li>
<li>
<p>&#25353;&#19968;&#19979; &#12300;&#20786;&#23384;&#12301;&#12290;</p>
</li>
</ol>
<a id="sthref75" name="sthref75"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-applistdeployed.html">&#27298;&#35222;&#24050;&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;&#30340;&#28165;&#21934;</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">&#24314;&#32622; Web &#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">&#24314;&#32622;&#20225;&#26989;&#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;&#29992;&#25142;&#31471;</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">&#24314;&#32622;&#36899;&#25509;&#22120;&#27169;&#32068;</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">&#24314;&#32622; EJB Jar</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">&#27298;&#35222;&#25033;&#29992;&#31243;&#24335;&#30340;&#25551;&#36848;&#20803;</a></p>
</li>
<li>
<p><a href="task-appviewtargets.html">&#27298;&#35222;&#25033;&#29992;&#31243;&#24335;&#30446;&#27161;</a></p>
</li>
<li>
<p><a href="task-endpoint.html">&#27298;&#35222; Web &#26381;&#21209;&#30340;&#31471;&#40670;&#36039;&#35338;</a></p>
</li>
<li>
<p><a href="task-applaunch.html">&#21855;&#21205;&#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">&#21855;&#21205;&#25033;&#29992;&#31243;&#24335;&#29992;&#25142;&#31471;</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">&#19979;&#36617;&#25033;&#29992;&#31243;&#24335;&#29992;&#25142;&#31471; Stub</a></p>
</li>
<li>
<p><a href="task-appredeploy.html">&#37325;&#26032;&#24314;&#32622;&#24050;&#24314;&#32622;&#30340;&#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-apprestart.html">&#37325;&#26032;&#36617;&#20837;&#24050;&#24314;&#32622;&#30340;&#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="ref-appscopedresourcesview.html">&#27298;&#35222;&#25033;&#29992;&#31243;&#24335;&#31684;&#22285;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="ref-appscopedresourcesedit.html">&#20462;&#25913;&#25033;&#29992;&#31243;&#24335;&#31684;&#22285;&#36039;&#28304;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
