<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-appredeploy" name="task-appredeploy"></a><a id="GHCOM00167" name="GHCOM00167"></a></p>

<h4><a id="sthref95" name="sthref95"></a><a id="sthref96" name="sthref96"></a>&#37325;&#26032;&#24314;&#32622;&#24050;&#24314;&#32622;&#30340;&#25033;&#29992;&#31243;&#24335;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#37325;&#26032;&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;&#26371;&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;&#30340;&#26032;&#29256;&#26412;&#65292;&#21516;&#26178;&#20445;&#30041;&#25033;&#29992;&#31243;&#24335;&#26368;&#21021;&#24314;&#32622;&#26178;&#30340;&#35373;&#23450;&#21450;&#20854;&#20182;&#36984;&#38917;&#12290;</p>
<a id="sthref97" name="sthref97"></a>
<h5>&#38283;&#22987;&#21069;</h5>
<p>&#35531;&#30906;&#23450;&#24744;&#35201;&#37325;&#26032;&#24314;&#32622;&#30340;&#25033;&#29992;&#31243;&#24335;&#24050;&#24314;&#32622;&#23436;&#25104;&#12290;</p>
<ol>
<li>
<p>&#22312;&#28687;&#35261;&#27193;&#29376;&#32080;&#27083;&#20013;&#65292;&#36984;&#21462; &#12300;&#25033;&#29992;&#31243;&#24335;&#12301; &#31680;&#40670;&#12290;</p>
<p>&#12300;&#25033;&#29992;&#31243;&#24335;&#12301; &#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#24050;&#24314;&#32622;&#30340;&#25033;&#29992;&#31243;&#24335;&#12301; &#34920;&#26684;&#20013;&#65292;&#26044;&#24744;&#35201;&#37325;&#26032;&#24314;&#32622;&#20043;&#25033;&#29992;&#31243;&#24335;&#30340;&#21015;&#20013;&#25353;&#19968;&#19979; &#12300;&#37325;&#26032;&#24314;&#32622;&#12301;&#12290;</p>
<p>&#25033;&#29992;&#31243;&#24335;&#21517;&#31281;&#20013;&#21487;&#20197;&#21253;&#21547;&#19968;&#20491;&#36984;&#25799;&#24615;&#30340;&#29256;&#26412;&#35672;&#21029;&#30908;&#65292;&#20301;&#26044;&#21517;&#31281;&#20043;&#24460;&#65292;&#20841;&#32773;&#38291;&#29992;&#20882;&#34399; (<code>:</code>) &#38548;&#38283;&#12290;&#22914;&#38656;&#26377;&#38364;&#27169;&#32068;&#33287;&#25033;&#29992;&#31243;&#24335;&#29256;&#26412;&#30340;&#26356;&#22810;&#36039;&#35338;&#65292;&#35531;&#21443;&#38321; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Oracle GlassFish Server Application Deployment Guide</i> &#20013;&#30340; <i>Module and Application Versions</i></a>&#12290;</p>
<p>&#12300;&#37325;&#26032;&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;&#25110;&#27169;&#32068;&#12301; &#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#25351;&#23450;&#35201;&#37325;&#26032;&#24314;&#32622;&#30340;&#25033;&#29992;&#31243;&#24335;&#20301;&#32622;&#12290;</p>
<ul>
<li>
<p>&#22914;&#26524;&#25033;&#29992;&#31243;&#24335;&#26159;&#24120;&#39376;&#22312;&#29992;&#25142;&#31471;&#27231;&#22120;&#19978;&#25110;&#21487;&#24478;&#29992;&#25142;&#31471;&#27231;&#22120;&#23384;&#21462;&#30340;&#27512;&#27284;&#27284;&#26696;&#65292;&#35531;&#36984;&#21462; &#12300;&#35201;&#19978;&#20659;&#33267;&#20282;&#26381;&#22120;&#30340;&#23553;&#35037;&#27284;&#26696;&#12301; &#36984;&#38917;&#12290;</p>
<p>&#29992;&#25142;&#31471;&#26159;&#24744;&#35201;&#22312;&#20854;&#19978;&#36879;&#36942;&#28687;&#35261;&#22120;&#27298;&#35222;&#31649;&#29702;&#20027;&#25511;&#21488;&#30340;&#20027;&#27231;&#12290;</p>
<p>&#25353;&#19968;&#19979; &#12300;&#28687;&#35261;&#12301; &#20197;&#28687;&#35261;&#33267;&#35442;&#27284;&#26696;&#65292;&#25110;&#32773;&#37749;&#20837;&#35442;&#27284;&#26696;&#30340;&#23436;&#25972;&#36335;&#24465;&#12290;</p>
</li>
<li>
<p>&#22914;&#26524;&#25033;&#29992;&#31243;&#24335;&#26159;&#24120;&#39376;&#22312;&#20282;&#26381;&#22120;&#27231;&#22120;&#19978;&#30340;&#27512;&#27284;&#27284;&#26696;&#65292;&#25110;&#26159;&#23637;&#38283;&#30340;&#30446;&#37636;&#20013;&#26410;&#23553;&#35037;&#30340;&#25033;&#29992;&#31243;&#24335;&#65292;&#35531;&#36984;&#21462; &#12300;&#21487;&#24478; GlassFish Server &#23384;&#21462;&#30340;&#26412;&#27231;&#23553;&#35037;&#27284;&#26696;&#25110;&#30446;&#37636;&#12301; &#36984;&#38917;&#12290;</p>
<p>&#20282;&#26381;&#22120;&#27231;&#22120;&#26159;&#22519;&#34892;&#32178;&#22495;&#31649;&#29702;&#20282;&#26381;&#22120; (DAS) &#30340;&#20027;&#27231;&#12290;</p>
<p>&#25353;&#19968;&#19979; &#12300;&#28687;&#35261;&#27284;&#26696;&#12301; &#20197;&#28687;&#35261;&#33267;&#27284;&#26696;&#65292;&#25110;&#25353;&#19968;&#19979; &#12300;&#28687;&#35261;&#36039;&#26009;&#22846;&#12301; &#20197;&#28687;&#35261;&#33267;&#30446;&#37636;&#12290;&#25110;&#32773;&#65292;&#37749;&#20837;&#27284;&#26696;&#25110;&#30446;&#37636;&#30340;&#23436;&#25972;&#36335;&#24465;&#21517;&#31281;&#12290;&#24478;&#23637;&#38283;&#30340;&#30446;&#37636;&#24314;&#32622;&#36969;&#29992;&#26044;&#36914;&#38542;&#38283;&#30332;&#32773;&#65292;&#20294;&#19981;&#24314;&#35696;&#22312;&#29983;&#29986;&#29872;&#22659;&#19979;&#36914;&#34892;&#35442;&#20316;&#26989;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#21487;&#29992;&#24615;&#12301;&#30340;&#12300;&#24050;&#21855;&#29992;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#21855;&#29992;&#25033;&#29992;&#31243;&#24335;&#30340;&#38542;&#27573;&#20316;&#26989;&#25345;&#32396;&#24615;&#33287; SFSB &#27298;&#26597;&#40670;&#12290;</p>
<p>&#33509;&#36984;&#21462; &#12300;&#24050;&#21855;&#29992;&#12301; &#26680;&#21462;&#26041;&#22602;&#65292;&#21063;&#26371;&#23565; Web &#38542;&#27573;&#20316;&#26989;&#12289;&#26377;&#29376;&#24907;&#30340;&#38542;&#27573;&#20316;&#26989; Bean (SFSB) &#27298;&#26597;&#40670;&#21450;&#28507;&#22312;&#30340;&#37389;&#21270;&#21855;&#29992;&#39640;&#21487;&#29992;&#24615;&#12290;&#22914;&#26524;&#35373;&#23450;&#28858; false (&#38928;&#35373;&#20540;)&#65292;&#23559;&#23565;&#25351;&#23450;&#30340;&#25033;&#29992;&#31243;&#24335;&#20572;&#29992;&#25152;&#26377; Web &#38542;&#27573;&#20316;&#26989;&#20786;&#23384;&#21450; SFSB &#27298;&#26597;&#40670;&#12290;&#22914;&#26524;&#35373;&#23450;&#28858; true&#65292;&#20415;&#26371;&#21855;&#29992;&#25351;&#23450;&#30340;&#25033;&#29992;&#31243;&#24335;&#20197;&#29554;&#24471;&#39640;&#21487;&#29992;&#24615;&#12290;&#20677;&#22312;&#36611;&#39640;&#23652;&#32026; (&#20363;&#22914;&#20282;&#26381;&#22120;&#21644;&#23481;&#22120;&#23652;&#32026;) &#32068;&#24907;&#21644;&#21855;&#29992;&#39640;&#21487;&#29992;&#24615;&#26178;&#25165;&#21487;&#23559;&#27492;&#36984;&#38917;&#35373;&#23450;&#28858; true&#12290;</p>
<p>&#22914;&#26524;&#23384;&#22312;&#38928;&#35373;&#20282;&#26381;&#22120;&#23526;&#20363; (<code>server</code>) &#20197;&#22806;&#30340;&#21474;&#38598;&#25110;&#29544;&#31435;&#20282;&#26381;&#22120;&#23526;&#20363;&#65292;&#20415;&#26371;&#39023;&#31034;&#27492;&#36984;&#38917;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462; &#12300;&#38928;&#32232;&#35695; JSP&#12301; &#26680;&#21462;&#26041;&#22602;&#65292;&#20197;&#38928;&#32232;&#35695; JavaServer Pages (JSP) &#27284;&#26696;&#12290;</p>
<p>&#33509;&#20572;&#29992;&#27492;&#36984;&#38917;&#65292;&#21063;&#39318;&#27425;&#23384;&#21462; JSP &#27284;&#26696;&#26178;&#26371;&#26044;&#22519;&#34892;&#38542;&#27573;&#32232;&#35695;&#36889;&#20123;&#27284;&#26696;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462; &#12300;&#22519;&#34892;&#27298;&#39511;&#22120;&#12301; &#26680;&#21462;&#26041;&#22602;&#65292;&#22312;&#36914;&#34892;&#37325;&#26032;&#24314;&#32622;&#20043;&#21069;&#39511;&#35657;&#24314;&#32622;&#25551;&#36848;&#20803;&#12290;</p>
<p>&#22914;&#26524;&#36984;&#21462;&#27492;&#36984;&#38917;&#20006;&#19988;&#27298;&#39511;&#22833;&#25943;&#65292;&#21063;&#19981;&#26371;&#22519;&#34892;&#37325;&#26032;&#24314;&#32622;&#12290;&#27298;&#39511;&#22120;&#23559;&#27298;&#26597;&#24314;&#32622;&#25551;&#36848;&#20803;&#30340;&#32080;&#27083;&#21644;&#20839;&#23481;&#12290;&#27298;&#39511;&#22823;&#22411;&#25033;&#29992;&#31243;&#24335;&#36890;&#24120;&#38750;&#24120;&#36027;&#26178;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
<p>&#24744;&#24517;&#38920;&#24478;&#26356;&#26032;&#24037;&#20855;&#23433;&#35037;&#27298;&#39511;&#22120;&#22871;&#20214;&#65292;&#21542;&#21063;&#26371;&#35352;&#37636;&#19968;&#21063;&#35686;&#21578;&#20006;&#24573;&#30053;&#27492;&#36984;&#38917;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462; &#12300;Java Web Start&#12301; &#26680;&#21462;&#26041;&#22602;&#65292;&#35731;&#25033;&#29992;&#31243;&#24335;&#29992;&#25142;&#31471;&#27169;&#32068;&#23384;&#21462; Java Web Start&#12290;</p>
<p>&#27492;&#36984;&#38917;&#26681;&#25818;&#21407;&#22987;&#24314;&#32622;&#26178;&#30340;&#35373;&#23450;&#38928;&#35373;&#28858;&#21855;&#29992;&#25110;&#20572;&#29992;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462; &#12300;&#20445;&#25345;&#29376;&#24907;&#12301; &#26680;&#21462;&#26041;&#22602;&#65292;&#22312;&#37325;&#26032;&#24314;&#32622;&#20043;&#38291;&#20445;&#30041; Web &#38542;&#27573;&#20316;&#26989;&#12289;SFSB &#23526;&#20363;&#21450;&#36899;&#32396;&#24314;&#31435;&#30340; EJB &#35336;&#26178;&#22120;&#12290;</p>
<p>&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;&#21482;&#26377;&#21517;&#28858; <code>server</code> &#30340;&#38928;&#35373;&#20282;&#26381;&#22120;&#23526;&#20363;&#25165;&#25903;&#25588;&#27492;&#36984;&#38917;&#12290;&#20219;&#20309;&#20854;&#20182;&#30446;&#27161;&#22343;&#19981;&#25903;&#25588;&#65292;&#20006;&#26371;&#24573;&#30053;&#27492;&#36984;&#38917;&#12290;</p>
<p>&#22312;&#37325;&#26032;&#24314;&#32622;&#20043;&#38291;&#23565;&#25033;&#29992;&#31243;&#24335;&#36914;&#34892;&#30340;&#26576;&#20123;&#35722;&#26356;&#65292;&#26371;&#35731;&#27492;&#21151;&#33021;&#28961;&#27861;&#27491;&#24120;&#36939;&#20316;&#12290;&#20363;&#22914;&#65292;&#35531;&#21247;&#35722;&#26356; SFSB Bean &#39006;&#21029;&#20013;&#30340;&#35442;&#32068;&#23526;&#20363;&#35722;&#25976;&#12290;</p>
<p>&#23565;&#26044; Web &#25033;&#29992;&#31243;&#24335;&#65292;&#21807;&#26377;&#30070; <code>glassfish-web-app.xml</code> &#27284;&#26696;&#20013; <code>session-manager</code> &#20803;&#32032;&#30340; <code>persistence-type</code> &#23660;&#24615;&#28858; <code>file</code> &#26178;&#65292;&#27492;&#21151;&#33021;&#25165;&#36969;&#29992;&#12290;</p>
<p>&#23565;&#26044;&#26377;&#29376;&#24907;&#30340;&#38542;&#27573;&#20316;&#26989; Bean &#23526;&#20363;&#65292;&#22312;&#20282;&#26381;&#22120;&#20013;&#26371;&#35373;&#23450;&#19981;&#20855;&#39640;&#21487;&#29992;&#24615;&#30340;&#25345;&#32396;&#24615;&#39006;&#22411; (&#12300;SFSB &#25345;&#32396;&#24615;&#39006;&#22411;&#12301; &#36984;&#38917;)&#65292;&#19988;&#24517;&#38920;&#23559;&#27492;&#39006;&#22411;&#35373;&#23450;&#28858; <code>file</code> (&#38928;&#35373;&#20540;&#33287;&#24314;&#35696;&#20540;)&#12290;</p>
<p>&#22914;&#26524;&#20219;&#20309;&#20351;&#29992;&#20013;&#30340; Web &#38542;&#27573;&#20316;&#26989;&#12289;SFSB &#23526;&#20363;&#25110; EJB &#35336;&#26178;&#22120;&#28961;&#27861;&#20445;&#30041;&#25110;&#24489;&#21407;&#65292;&#21063;&#36889;&#20123;&#38917;&#30446;&#22312;&#37325;&#26032;&#24314;&#32622;&#23436;&#25104;&#26178;&#23559;<i>&#28961;&#19968;</i>&#21487;&#29992;&#12290;&#20294;&#26159;&#65292;&#37325;&#26032;&#24314;&#32622;&#26371;&#32380;&#32396;&#20006;&#35352;&#37636;&#19968;&#21063;&#35686;&#21578;&#12290;</p>
<p>&#33509;&#35201;&#20445;&#30041;&#20351;&#29992;&#20013;&#30340;&#29376;&#24907;&#36039;&#26009;&#65292;GlassFish Server &#26371;&#20018;&#21015;&#21270;&#36039;&#26009;&#20006;&#23559;&#20043;&#20786;&#23384;&#21040;&#35352;&#25014;&#39636;&#20013;&#12290;&#33509;&#35201;&#24489;&#21407;&#36039;&#26009;&#65292;&#26032;&#37325;&#26032;&#24314;&#32622;&#20043;&#25033;&#29992;&#31243;&#24335;&#30340;&#39006;&#21029;&#36617;&#20837;&#22120;&#26371;&#21462;&#28040;&#20018;&#21015;&#21270;&#20219;&#20309;&#20808;&#21069;&#20786;&#23384;&#30340;&#36039;&#26009;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462; &#12300;&#20445;&#30041;&#25033;&#29992;&#31243;&#24335;&#31684;&#22285;&#36039;&#28304;&#12301; &#26680;&#21462;&#26041;&#22602;&#65292;&#20445;&#30041;&#20219;&#20309;&#25033;&#29992;&#31243;&#24335;&#31684;&#22285;&#36039;&#28304;&#65292;&#20006;&#22312;&#37325;&#26032;&#24314;&#32622;&#26399;&#38291;&#20104;&#20197;&#24489;&#21407;&#12290;</p>
<p>&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</li>
<li>
<p>&#25353;&#19968;&#19979; &#12300;&#30906;&#23450;&#12301;&#12290;</p>
</li>
</ol>
<a id="sthref98" name="sthref98"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-applistdeployed.html">&#27298;&#35222;&#24050;&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;&#30340;&#28165;&#21934;</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">&#24314;&#32622; Web &#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">&#24314;&#32622;&#20225;&#26989;&#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;&#29992;&#25142;&#31471;</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">&#24314;&#32622;&#36899;&#25509;&#22120;&#27169;&#32068;</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">&#24314;&#32622; EJB Jar</a></p>
</li>
<li>
<p><a href="task-appedit.html">&#32232;&#36655;&#24050;&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">&#27298;&#35222;&#25033;&#29992;&#31243;&#24335;&#30340;&#25551;&#36848;&#20803;</a></p>
</li>
<li>
<p><a href="task-appviewtargets.html">&#27298;&#35222;&#25033;&#29992;&#31243;&#24335;&#30446;&#27161;</a></p>
</li>
<li>
<p><a href="task-endpoint.html">&#27298;&#35222; Web &#26381;&#21209;&#30340;&#31471;&#40670;&#36039;&#35338;</a></p>
</li>
<li>
<p><a href="task-applaunch.html">&#21855;&#21205;&#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">&#21855;&#21205;&#25033;&#29992;&#31243;&#24335;&#29992;&#25142;&#31471;</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">&#19979;&#36617;&#25033;&#29992;&#31243;&#24335;&#29992;&#25142;&#31471; Stub</a></p>
</li>
<li>
<p><a href="task-apprestart.html">&#37325;&#26032;&#36617;&#20837;&#24050;&#24314;&#32622;&#30340;&#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="ref-appscopedresourcesview.html">&#27298;&#35222;&#25033;&#29992;&#31243;&#24335;&#31684;&#22285;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="ref-appscopedresourcesedit.html">&#20462;&#25913;&#25033;&#29992;&#31243;&#24335;&#31684;&#22285;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="../../../ejb/zh_TW/help/missingtopic.html">&#28858; EJB &#23481;&#22120;&#32068;&#24907;&#21487;&#29992;&#24615;&#35373;&#23450;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
