<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-messagesecurityproviderconfignew" name="task-messagesecurityproviderconfignew"></a><a id="GHCOM00207" name="GHCOM00207"></a></p>

<h4><a id="sthref189" name="sthref189"></a>&#24314;&#31435;&#35338;&#24687;&#23433;&#20840;&#24615;&#25552;&#20379;&#32773;&#32068;&#24907;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#33509;&#35201;&#24314;&#31435;&#26032;&#30340;&#35338;&#24687;&#23433;&#20840;&#24615;&#25552;&#20379;&#32773;&#32068;&#24907;&#65292;&#35531;&#22519;&#34892;&#20197;&#19979;&#27493;&#39519;&#65306;</p>
<a id="sthref190" name="sthref190"></a>
<h5>&#38283;&#22987;&#21069;</h5>
<p>&#28961;&#27861;&#24314;&#31435;&#25110;&#21034;&#38500;&#38928;&#35373; <code>server-config</code> &#32068;&#24907;&#30340;&#35338;&#24687;&#23433;&#20840;&#24615;&#25552;&#20379;&#32773;&#12290;&#38928;&#35373; <code>server-config</code> &#25152;&#25903;&#25588;&#30340;&#35338;&#24687;&#23433;&#20840;&#24615;&#25552;&#20379;&#32773;&#21482;&#26377; SOAP &#33287; HttpServlet&#12290;&#22240;&#28858;&#23433;&#35037; GlassFish Server &#26178;&#65292;&#38928;&#35373;&#24050;&#32147;&#24314;&#31435;&#36889;&#20841;&#20491;&#35338;&#24687;&#25552;&#20379;&#32773;&#65292;&#25152;&#20197;&#22312;&#38928;&#35373; <code>server-config</code> &#30340; &#12300;&#35338;&#24687;&#23433;&#20840;&#24615;&#32068;&#24907;&#12301; &#38913;&#38754;&#19978;&#65292;&#12300;&#26032;&#22686;&#12301; &#25353;&#37397;&#39023;&#31034;&#28858;&#28784;&#33394;&#12290;</p>
<ol>
<li>
<p>&#22312;&#28687;&#35261;&#27193;&#29376;&#32080;&#27083;&#20013;&#65292;&#23637;&#38283; &#12300;&#32068;&#24907;&#12301; &#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#23637;&#38283; &#12300;&#23433;&#20840;&#24615;&#12301; &#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462; &#12300;&#35338;&#24687;&#23433;&#20840;&#24615;&#12301; &#31680;&#40670;&#12290;</p>
<p>&#12300;&#35338;&#24687;&#23433;&#20840;&#24615;&#32068;&#24907;&#12301; &#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#35338;&#24687;&#23433;&#20840;&#24615;&#32068;&#24907;&#12301; &#38913;&#38754;&#19978;&#65292;&#25353;&#19968;&#19979;&#35201;&#32232;&#36655;&#20043;&#32068;&#24907;&#30340;&#35469;&#35657;&#23652;&#21517;&#31281;&#12290;</p>
<p>&#26681;&#25818;&#38928;&#35373;&#65292;&#21807;&#19968;&#32068;&#24907;&#30340;&#35338;&#24687;&#23433;&#20840;&#24615;&#32068;&#24907;&#28858; SOAP&#12290;</p>
<p>&#12300;&#32232;&#36655;&#35338;&#24687;&#23433;&#20840;&#24615;&#32068;&#24907;&#12301; &#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#25353;&#19968;&#19979; &#12300;&#25552;&#20379;&#32773;&#12301; &#27161;&#31844;&#12290;</p>
<p>&#12300;&#25552;&#20379;&#32773;&#32068;&#24907;&#12301; &#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#25552;&#20379;&#32773;&#32068;&#24907;&#12301; &#38913;&#38754;&#19978;&#25353;&#19968;&#19979; &#12300;&#26032;&#24314;&#12301;&#12290;</p>
<p>&#23559;&#39023;&#31034; &#12300;&#26032;&#24314;&#25552;&#20379;&#32773;&#32068;&#24907;&#12301; &#38913;&#38754;&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#26032;&#24314;&#25552;&#20379;&#32773;&#32068;&#24907;&#12301; &#38913;&#38754;&#30340; &#12300;&#25552;&#20379;&#32773; ID&#12301; &#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#25552;&#20379;&#32773;&#32068;&#24907;&#30340;&#21807;&#19968;&#21517;&#31281;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462; &#12300;&#38928;&#35373;&#25552;&#20379;&#32773;&#12301; &#26680;&#21462;&#26041;&#22602;&#65292;&#23559;&#27492;&#25552;&#20379;&#32773;&#35373;&#28858;&#38928;&#35373;&#25552;&#20379;&#32773;&#12290;</p>
<p>&#25033;&#29992;&#31243;&#24335;&#28961;&#27861;&#25351;&#23450;&#29305;&#23450;&#25552;&#20379;&#32773;&#26178;&#65292;&#21363;&#26371;&#21628;&#21483;&#38928;&#35373;&#25552;&#20379;&#32773;&#12290;&#12300;&#25552;&#20379;&#32773;&#39006;&#22411;&#12301; &#27770;&#23450;&#25552;&#20379;&#32773;&#26159;&#38928;&#35373;&#29992;&#25142;&#31471;&#25552;&#20379;&#32773;&#12289;&#38928;&#35373;&#20282;&#26381;&#22120;&#25552;&#20379;&#32773;&#65292;&#36996;&#26159;&#20841;&#32773;&#30342;&#26159;&#12290;</p>
</li>
<li>
<p>&#24478; &#12300;&#25552;&#20379;&#32773;&#39006;&#22411;&#12301; &#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#25552;&#20379;&#32773;&#39006;&#22411;&#12290;</p>
<p>&#21487;&#29992;&#30340;&#36984;&#38917;&#21253;&#25324;&#65306;</p>
<dl>
<dt><code>client</code></dt>
<dd>
<p>&#25351;&#23450;&#25552;&#20379;&#32773;&#26159;&#29992;&#25142;&#31471;&#35469;&#35657;&#25552;&#20379;&#32773;&#12290;</p>
</dd>
<dt><code>server</code></dt>
<dd>
<p>&#25351;&#23450;&#25552;&#20379;&#32773;&#26159;&#20282;&#26381;&#22120;&#35469;&#35657;&#25552;&#20379;&#32773;&#12290;</p>
</dd>
<dt><code>client-server</code></dt>
<dd>
<p>&#25351;&#23450;&#25552;&#20379;&#32773;&#26082;&#26159;&#29992;&#25142;&#31471;&#35469;&#35657;&#25552;&#20379;&#32773;&#65292;&#20063;&#26159;&#20282;&#26381;&#22120;&#35469;&#35657;&#25552;&#20379;&#32773;&#12290;</p>
</dd>
</dl>
</li>
<li>
<p>&#22312; &#12300;&#39006;&#21029;&#21517;&#31281;&#12301; &#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#25552;&#20379;&#32773;&#30340; Java &#23526;&#20316;&#39006;&#21029;&#21517;&#31281;&#12290;</p>
<p>&#29992;&#25142;&#31471;&#35469;&#35657;&#25552;&#20379;&#32773;&#24517;&#38920;&#23526;&#20316; <code>com.sun.enterprise.security.jauth.ClientAuthModule</code> &#20171;&#38754;&#12290;&#20282;&#26381;&#22120;&#31471;&#25552;&#20379;&#32773;&#24517;&#38920;&#23526;&#20316; <code>com.sun.enterprise.security.jauth.ServerAuthModule</code> &#20171;&#38754;&#12290;&#20027;&#24478;&#24335;&#25552;&#20379;&#32773;&#24517;&#38920;&#23526;&#20316;&#36889;&#20841;&#20491;&#20171;&#38754;&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#35531;&#27714;&#31574;&#30053;&#12301; &#21312;&#22495;&#30340; &#12300;&#35469;&#35657;&#20358;&#28304;&#12301; &#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#35531;&#27714;&#31574;&#30053;&#25152;&#38656;&#35469;&#35657;&#30340;&#39006;&#22411;&#12290;</p>
<p>&#35531;&#27714;&#31574;&#30053;&#26371;&#27770;&#23450;&#35469;&#35657;&#25552;&#20379;&#32773;&#22519;&#34892;&#30340;&#35531;&#27714;&#34389;&#29702;&#26041;&#24335;&#12290;&#35531;&#27714;&#31574;&#30053;&#27396;&#20301;&#26159;&#36984;&#25799;&#24615;&#27396;&#20301;&#65292;&#20294;&#26159;&#22914;&#26524;&#26410;&#36914;&#34892;&#25351;&#23450;&#65292;&#35469;&#35657;&#25552;&#20379;&#32773;&#20415;&#19981;&#26371;&#35469;&#35657;&#35531;&#27714;&#35338;&#24687;&#12290;</p>
<p>&#36984;&#21462; &#12300;<code>sender</code>&#12301; &#21487;&#20197;&#25351;&#23450;&#35531;&#27714;&#35338;&#24687;&#30340;&#35338;&#24687;&#23652;&#20659;&#36865;&#32773;&#35469;&#35657; (&#20363;&#22914;&#20351;&#29992;&#32773;&#21517;&#31281;&#21644;&#23494;&#30908;)&#12290;&#36984;&#21462; &#12300;<code>content</code>&#12301; &#21487;&#20197;&#25351;&#23450;&#35531;&#27714;&#35338;&#24687;&#30340;&#20839;&#23481;&#35469;&#35657; (&#20363;&#22914;&#25976;&#20301;&#31805;&#21517;)&#12290;&#20445;&#30041;&#27396;&#20301;&#31354;&#30333;&#34920;&#31034;&#19981;&#35469;&#35657;&#35531;&#27714;&#20358;&#28304;&#12290;&#26681;&#25818;&#38928;&#35373;&#65292;&#19981;&#26371;&#36984;&#21462;&#20219;&#20309;&#35469;&#35657;&#39006;&#22411;&#12290;</p>
<p>&#22914;&#38656;&#26377;&#38364; SOAP &#35338;&#24687;&#23433;&#20840;&#24615;&#25552;&#20379;&#32773;&#22519;&#34892;&#30340;&#21205;&#20316;&#20043;&#35498;&#26126;&#65292;&#35531;&#21443;&#38321;<a href="ref-configreq-respolicy.html">&#35531;&#27714;&#21644;&#22238;&#25033;&#31574;&#30053;&#32068;&#24907;</a>&#12290;</p>
</li>
<li>
<p>&#24478; &#12300;&#35469;&#35657;&#25509;&#25910;&#32773;&#12301; &#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#25509;&#25910;&#32773;&#35469;&#35657;&#20316;&#26989;&#35201;&#22312;&#35531;&#27714;&#31574;&#30053;&#30340;&#20839;&#23481;&#35469;&#35657;&#20043;&#21069;&#36996;&#26159;&#20043;&#24460;&#22519;&#34892;&#12290;</p>
<p>&#36984;&#21462; &#12300;<code>before-content</code>&#12301; &#25110; &#12300;<code>after-content</code>&#12301; &#21487;&#20197;&#35201;&#27714;&#23559;&#35531;&#27714;&#35338;&#24687;&#30340;&#25509;&#25910;&#32773;&#35338;&#24687;&#23652;&#35469;&#35657;&#21040;&#35338;&#24687;&#30340;&#20659;&#36865;&#32773; (&#36879;&#36942; XML &#21152;&#23494;)&#12290;&#33509;&#26410;&#25351;&#23450;&#27492;&#20540;&#65292;&#38928;&#35373;&#28858; <code>after-content</code>&#12290;&#31574;&#30053;&#20197;&#35338;&#24687;&#20659;&#36865;&#32773;&#30340;&#38918;&#24207;&#34920;&#36848;&#65292;&#22240;&#27492; <code>after-content</code> &#24847;&#21619;&#33879;&#35338;&#24687;&#25509;&#25910;&#32773;&#39318;&#20808;&#23565;&#35338;&#24687;&#36914;&#34892;&#35299;&#23494;&#65292;&#28982;&#24460;&#20877;&#39511;&#35657;&#31805;&#21517;&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#22238;&#25033;&#31574;&#30053;&#12301; &#21312;&#22495;&#30340; &#12300;&#35469;&#35657;&#20358;&#28304;&#12301; &#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#22238;&#25033;&#31574;&#30053;&#25152;&#38656;&#35469;&#35657;&#30340;&#39006;&#22411;&#12290;</p>
<p>&#22238;&#25033;&#31574;&#30053;&#26371;&#27770;&#23450;&#35469;&#35657;&#25552;&#20379;&#32773;&#22519;&#34892;&#30340;&#22238;&#25033;&#34389;&#29702;&#26041;&#24335;&#12290;&#22238;&#25033;&#31574;&#30053;&#27396;&#20301;&#26159;&#36984;&#25799;&#24615;&#27396;&#20301;&#65292;&#20294;&#26159;&#22914;&#26524;&#26410;&#36914;&#34892;&#25351;&#23450;&#65292;&#20415;&#19981;&#26371;&#22871;&#29992;&#35469;&#35657;&#21040;&#22238;&#25033;&#35338;&#24687;&#12290;</p>
<p>&#36984;&#21462; &#12300;<code>sender</code>&#12301; &#21487;&#20197;&#25351;&#23450;&#22238;&#25033;&#35338;&#24687;&#30340;&#35338;&#24687;&#23652;&#20659;&#36865;&#32773;&#35469;&#35657; (&#20363;&#22914;&#20351;&#29992;&#32773;&#21517;&#31281;&#21644;&#23494;&#30908;)&#12290;&#36984;&#21462; &#12300;<code>content</code>&#12301; &#21487;&#20197;&#25351;&#23450;&#22238;&#25033;&#35338;&#24687;&#30340;&#20839;&#23481;&#35469;&#35657; (&#20363;&#22914;&#25976;&#20301;&#31805;&#21517;)&#12290;&#20445;&#30041;&#27396;&#20301;&#31354;&#30333;&#34920;&#31034;&#19981;&#35469;&#35657;&#22238;&#25033;&#20358;&#28304;&#12290;&#26681;&#25818;&#38928;&#35373;&#65292;&#19981;&#26371;&#36984;&#21462;&#20219;&#20309;&#35469;&#35657;&#39006;&#22411;&#12290;</p>
<p>&#22914;&#38656;&#26377;&#38364; SOAP &#35338;&#24687;&#23433;&#20840;&#24615;&#25552;&#20379;&#32773;&#22519;&#34892;&#30340;&#21205;&#20316;&#20043;&#35498;&#26126;&#65292;&#35531;&#21443;&#38321;<a href="ref-configreq-respolicy.html">&#35531;&#27714;&#21644;&#22238;&#25033;&#31574;&#30053;&#32068;&#24907;</a>&#12290;</p>
</li>
<li>
<p>&#24478; &#12300;&#35469;&#35657;&#25509;&#25910;&#32773;&#12301; &#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#25509;&#25910;&#32773;&#35469;&#35657;&#20316;&#26989;&#35201;&#22238;&#25033;&#31574;&#30053;&#30340;&#20839;&#23481;&#35469;&#35657;&#20043;&#21069;&#36996;&#26159;&#20043;&#24460;&#22519;&#34892;&#12290;</p>
<p>&#36984;&#21462; &#12300;<code>before-content</code>&#12301; &#25110; &#12300;<code>after-content</code>&#12301; &#21487;&#20197;&#35201;&#27714;&#23559;&#22238;&#25033;&#35338;&#24687;&#30340;&#25509;&#25910;&#32773;&#35338;&#24687;&#23652;&#35469;&#35657;&#21040;&#35338;&#24687;&#30340;&#20659;&#36865;&#32773; (&#36879;&#36942; XML &#21152;&#23494;)&#12290;&#33509;&#26410;&#25351;&#23450;&#27492;&#20540;&#65292;&#38928;&#35373;&#28858; <code>after-content</code>&#12290;&#31574;&#30053;&#20197;&#35338;&#24687;&#20659;&#36865;&#32773;&#30340;&#38918;&#24207;&#34920;&#36848;&#65292;&#22240;&#27492; <code>after-content</code> &#24847;&#21619;&#33879;&#35338;&#24687;&#25509;&#25910;&#32773;&#39318;&#20808;&#23565;&#35338;&#24687;&#36914;&#34892;&#35299;&#23494;&#65292;&#28982;&#24460;&#20877;&#39511;&#35657;&#31805;&#21517;&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#20854;&#20182;&#29305;&#24615;&#12301; &#21312;&#27573;&#20013;&#65292;&#25351;&#23450;&#20854;&#20182;&#29305;&#24615;&#12290;</p>
<p>&#33509;&#35201;&#22686;&#21152;&#29305;&#24615;&#65292;&#35531;&#25353;&#19968;&#19979; &#12300;&#22686;&#21152;&#29305;&#24615;&#12301; &#25353;&#37397;&#12290;&#22312;&#20986;&#29694;&#30340;&#31354;&#30333;&#21015;&#20013;&#65292;&#26044; &#12300;&#21517;&#31281;&#12301; &#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#21517;&#31281;&#65292;&#28982;&#24460;&#22312; &#12300;&#20540;&#12301; &#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#20540;&#12290;</p>
<p>&#22914;&#38656;&#36969;&#29992;&#26044;&#25552;&#20379;&#32773;&#32068;&#24907;&#20043;&#20854;&#20182;&#29305;&#24615;&#30340;&#35498;&#26126;&#65292;&#35531;&#21443;&#38321;<a href="ref-messagesecurityproviderconfigprops.html">&#35338;&#24687;&#23433;&#20840;&#24615;&#25552;&#20379;&#32773;&#32068;&#24907;&#29305;&#23450;&#30340;&#29305;&#24615;</a>&#12290;</p>
</li>
<li>
<p>&#25353;&#19968;&#19979; &#12300;&#30906;&#23450;&#12301;&#12290;</p>
</li>
</ol>
<a id="sthref191" name="sthref191"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">&#32068;&#24907;&#35338;&#24687;&#23433;&#20840;&#24615;&#25552;&#20379;&#32773;&#25152;&#20351;&#29992;&#30340; GlassFish Server &#21151;&#33021;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">&#24314;&#31435;&#35338;&#24687;&#23433;&#20840;&#24615;&#32068;&#24907;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">&#32232;&#36655;&#35338;&#24687;&#23433;&#20840;&#24615;&#32068;&#24907;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">&#21034;&#38500;&#35338;&#24687;&#23433;&#20840;&#24615;&#32068;&#24907;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">&#32232;&#36655;&#35338;&#24687;&#23433;&#20840;&#24615;&#25552;&#20379;&#32773;&#32068;&#24907;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">&#21034;&#38500;&#35338;&#24687;&#23433;&#20840;&#24615;&#25552;&#20379;&#32773;&#32068;&#24907;</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">&#21855;&#29992;&#25033;&#29992;&#31243;&#24335;&#29992;&#25142;&#31471;&#30340;&#35338;&#24687;&#23433;&#20840;&#24615;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
