<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-auditmoduleedit" name="task-auditmoduleedit"></a><a id="GHCOM00195" name="GHCOM00195"></a></p>

<h4><a id="sthref164" name="sthref164"></a>&#32232;&#36655;&#31293;&#26680;&#27169;&#32068;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20381;&#38928;&#35373;&#65292;&#31293;&#26680;&#27169;&#32068;&#26410;&#38283;&#21855;&#12290;&#22914;&#38656;&#26377;&#38364;&#22914;&#20309;&#21855;&#29992;&#31293;&#26680;&#27169;&#32068;&#30340;&#26356;&#22810;&#36039;&#35338;&#65292;&#35531;&#21443;&#38321;<a href="task-enabledisableauditmod.html">&#21855;&#29992;&#25110;&#20572;&#29992;&#31293;&#26680;&#27169;&#32068;</a>&#12290;</p>
<ol>
<li>
<p>&#22312;&#28687;&#35261;&#27193;&#29376;&#32080;&#27083;&#20013;&#65292;&#23637;&#38283; &#12300;&#32068;&#24907;&#12301; &#31680;&#40670;&#12290;</p>
</li>
<li>
<p>Select the instance to configure:</p>
<ul>
<li>
<p>To configure a particular instance, expand the instance's config node. For example, the default instance, <code>server</code>, expand the <code>server-config</code> node.</p>
</li>
<li>
<p>To configure the default settings for all instances, expand the <code>default-config</code> node.</p>
</li>
</ul>
</li>
<li>
<p>&#22312; &#12300;&#32068;&#24907;&#12301; &#31680;&#40670;&#19979;&#65292;&#23637;&#38283; &#12300;&#23433;&#20840;&#24615;&#12301; &#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#23433;&#20840;&#24615;&#12301; &#31680;&#40670;&#19979;&#65292;&#36984;&#21462; &#12300;&#31293;&#26680;&#27169;&#32068;&#12301; &#31680;&#40670;&#12290;</p>
<p>&#12300;&#31293;&#26680;&#27169;&#32068;&#12301; &#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#31293;&#26680;&#27169;&#32068;&#12301; &#38913;&#38754;&#19978;&#65292;&#25353;&#19968;&#19979;&#24744;&#35201;&#32232;&#36655;&#30340;&#31293;&#26680;&#27169;&#32068;&#21517;&#31281;&#12290;</p>
<p>&#12300;&#32232;&#36655;&#31293;&#26680;&#27169;&#32068;&#12301; &#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#32232;&#36655;&#31293;&#26680;&#27169;&#32068;&#12301; &#38913;&#38754;&#30340; &#12300;&#39006;&#21029;&#21517;&#31281;&#12301; &#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#26032;&#20540;&#20197;&#20462;&#25913;&#39006;&#21029;&#21517;&#31281;&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#20854;&#20182;&#29305;&#24615;&#12301; &#21312;&#27573;&#20013;&#65292;&#25351;&#23450;&#20854;&#20182;&#29305;&#24615;&#12290;</p>
<p>&#22914;&#38656;&#36969;&#29992;&#26044;&#31293;&#26680;&#27169;&#32068;&#20043;&#20854;&#20182;&#29305;&#24615;&#30340;&#35498;&#26126;&#65292;&#35531;&#21443;&#38321;<a href="ref-auditmoduleprop.html">&#31293;&#26680;&#27169;&#32068;&#29305;&#23450;&#30340;&#29305;&#24615;</a>&#12290;</p>
<ul>
<li>
<p>&#33509;&#35201;&#22686;&#21152;&#29305;&#24615;&#65292;&#35531;&#25353;&#19968;&#19979; &#12300;&#22686;&#21152;&#29305;&#24615;&#12301; &#25353;&#37397;&#12290;&#22312;&#20986;&#29694;&#30340;&#31354;&#30333;&#21015;&#20013;&#65292;&#26044; &#12300;&#21517;&#31281;&#12301; &#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#21517;&#31281;&#65292;&#28982;&#24460;&#22312; &#12300;&#20540;&#12301; &#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#20540;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#20462;&#25913;&#29305;&#24615;&#65292;&#35531;&#32232;&#36655;&#29305;&#24615;&#30340; &#12300;&#20540;&#12301; &#27396;&#20301;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#21034;&#38500;&#29305;&#24615;&#65292;&#35531;&#36984;&#21462;&#24744;&#35201;&#21034;&#38500;&#20043;&#29305;&#24615; &#12300;&#21517;&#31281;&#12301; &#27396;&#20301;&#24038;&#20596;&#30340;&#26680;&#21462;&#26041;&#22602;&#65292;&#28982;&#24460;&#25353;&#19968;&#19979; &#12300;&#21034;&#38500;&#29305;&#24615;&#12301; &#25353;&#37397;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#25353;&#19968;&#19979; &#12300;&#20786;&#23384;&#12301;&#12290;</p>
</li>
</ol>
<a id="sthref165" name="sthref165"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-auditmodulenew.html">&#24314;&#31435;&#31293;&#26680;&#27169;&#32068;</a></p>
</li>
<li>
<p><a href="task-auditmoduledelete.html">&#21034;&#38500;&#31293;&#26680;&#27169;&#32068;</a></p>
</li>
<li>
<p><a href="task-enabledisableauditmod.html">&#21855;&#29992;&#25110;&#20572;&#29992;&#31293;&#26680;&#27169;&#32068;</a></p>
</li>
<li>
<p><a href="task-setactiveauditmod.html">&#35373;&#23450;&#20351;&#29992;&#20013;&#31293;&#26680;&#27169;&#32068;</a></p>
</li>
<li>
<p><a href="task-usedefaultauditmod.html">&#20351;&#29992;&#38928;&#35373;&#31293;&#26680;&#27169;&#32068;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
