<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-appviewtargets" name="task-appviewtargets"></a><a id="GHCOM00164" name="GHCOM00164"></a></p>

<h4>&#27298;&#35222;&#25033;&#29992;&#31243;&#24335;&#30446;&#27161;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#28687;&#35261;&#27193;&#29376;&#32080;&#27083;&#20013;&#65292;&#36984;&#21462; &#12300;&#25033;&#29992;&#31243;&#24335;&#12301; &#31680;&#40670;&#12290;</p>
<p>&#12300;&#25033;&#29992;&#31243;&#24335;&#12301; &#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#24744;&#35201;&#27298;&#35222;&#30446;&#27161;&#30340;&#25033;&#29992;&#31243;&#24335;&#12290;</p>
<p>&#25033;&#29992;&#31243;&#24335;&#21517;&#31281;&#20013;&#21487;&#20197;&#21253;&#21547;&#19968;&#20491;&#36984;&#25799;&#24615;&#30340;&#29256;&#26412;&#35672;&#21029;&#30908;&#65292;&#20301;&#26044;&#21517;&#31281;&#20043;&#24460;&#65292;&#20841;&#32773;&#38291;&#29992;&#20882;&#34399; (<code>:</code>) &#38548;&#38283;&#12290;&#22914;&#38656;&#26377;&#38364;&#27169;&#32068;&#33287;&#25033;&#29992;&#31243;&#24335;&#29256;&#26412;&#30340;&#26356;&#22810;&#36039;&#35338;&#65292;&#35531;&#21443;&#38321; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Oracle GlassFish Server Application Deployment Guide</i> &#20013;&#30340; <i>Module and Application Versions</i></a>&#12290;</p>
<p>&#35442;&#25033;&#29992;&#31243;&#24335;&#30340;&#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462; &#12300;&#30446;&#27161;&#12301; &#27161;&#31844;&#12290;</p>
<p>&#12300;&#25033;&#29992;&#31243;&#24335;&#30446;&#27161;&#12301; &#38913;&#38754;&#38568;&#21363;&#26371;&#38283;&#21855;&#65292;&#39023;&#31034;&#30446;&#21069;&#25351;&#23450;&#32102;&#25033;&#29992;&#31243;&#24335;&#30340;&#30446;&#27161;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#21855;&#29992;&#25110;&#20572;&#29992;&#29305;&#23450;&#30446;&#27161;&#23526;&#20363;&#25110;&#21474;&#38598;&#19978;&#30340;&#25033;&#29992;&#31243;&#24335;&#65292;&#35531;&#25353;&#19968;&#19979;&#35442;&#30446;&#27161;&#26049;&#30340;&#26680;&#21462;&#26041;&#22602;&#65292;&#28982;&#24460;&#24478; &#12300;&#26356;&#22810;&#21205;&#20316;&#12301; &#19979;&#25289;&#24335;&#21151;&#33021;&#34920;&#20013;&#36984;&#21462; &#12300;&#21855;&#29992;&#12301; &#25110; &#12300;&#20572;&#29992;&#12301;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#35731;&#30446;&#27161;&#22312;&#29305;&#23450;&#30446;&#27161;&#23526;&#20363;&#25110;&#21474;&#38598;&#19978;&#36914;&#34892;&#36000;&#36617;&#24179;&#34913;&#65292;&#35531;&#25353;&#19968;&#19979;&#35442;&#30446;&#27161;&#26049;&#30340;&#26680;&#21462;&#26041;&#22602;&#65292;&#28982;&#24460;&#24478; &#12300;&#26356;&#22810;&#21205;&#20316;&#12301; &#19979;&#25289;&#24335;&#21151;&#33021;&#34920;&#20013;&#36984;&#21462; &#12300;&#36000;&#36617;&#24179;&#34913;&#31243;&#24335;&#21855;&#29992;&#12301; &#25110; &#12300;&#36000;&#36617;&#24179;&#34913;&#31243;&#24335;&#20572;&#29992;&#12301;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#35731;&#25033;&#29992;&#31243;&#24335;&#33287;&#29305;&#23450;&#34395;&#25836;&#20282;&#26381;&#22120;&#24314;&#31435;&#38364;&#32879;&#65292;&#35531;&#28858;&#25152;&#38656;&#30340;&#30446;&#27161;&#23526;&#20363;&#25110;&#21474;&#38598;&#36984;&#21462; &#12300;&#31649;&#29702; VirtualServer&#12301;&#12290;</p>
<p>&#12300;&#34395;&#25836;&#20282;&#26381;&#22120;&#30446;&#27161;&#12301; &#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
<p>&#33509;&#35201;&#22686;&#21152;&#30446;&#27161;&#34395;&#25836;&#20282;&#26381;&#22120;&#65292;&#35531;&#24478; &#12300;&#21487;&#29992;&#30340;&#30446;&#27161;&#12301; &#28165;&#21934;&#20013;&#21152;&#20197;&#36984;&#21462;&#65292;&#28982;&#24460;&#20351;&#29992; &#12300;&#21152;&#20837;&#12301; &#25353;&#37397;&#65292;&#23559;&#20854;&#31227;&#33267; &#12300;&#36984;&#21462;&#30340;&#30446;&#27161;&#12301; &#28165;&#21934;&#12290;</p>
<p>&#20381;&#38928;&#35373;&#65292;&#27169;&#32068;&#25110;&#25033;&#29992;&#31243;&#24335;&#26371;&#33287;&#21517;&#28858; <code>server</code> &#30340;&#38928;&#35373;&#34395;&#25836;&#20282;&#26381;&#22120;&#29986;&#29983;&#38364;&#32879;&#12290;&#20351;&#29992; &#12300;&#20840;&#37096;&#21152;&#20837;&#12301; &#25353;&#37397;&#21487;&#21152;&#20837;&#25152;&#26377;&#30446;&#27161;&#12290;&#20351;&#29992; &#12300;&#31227;&#38500;&#12301; &#33287; &#12300;&#20840;&#37096;&#31227;&#38500;&#12301; &#25353;&#37397;&#21487;&#24478; &#12300;&#36984;&#21462;&#30340;&#30446;&#27161;&#12301; &#28165;&#21934;&#20013;&#31227;&#38500;&#30446;&#27161;&#12290;</p>
<p>&#36984;&#21462; &#12300;&#20786;&#23384;&#12301; &#21487;&#20197;&#22238;&#21040; &#12300;&#25033;&#29992;&#31243;&#24335;&#30446;&#27161;&#12301; &#38913;&#38754;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#22686;&#21152;&#25110;&#21034;&#38500;&#25033;&#29992;&#31243;&#24335;&#30340;&#30446;&#27161;&#23526;&#20363;&#25110;&#21474;&#38598;&#65292;&#35531;&#36984;&#21462; &#12300;&#31649;&#29702;&#30446;&#27161;&#12301;&#12290;</p>
<p>&#12300;&#31649;&#29702;&#30446;&#27161;&#12301; &#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
<p>&#33509;&#35201;&#22686;&#21152;&#30446;&#27161;&#65292;&#35531;&#24478; &#12300;&#21487;&#29992;&#30340;&#30446;&#27161;&#12301; &#28165;&#21934;&#20013;&#21152;&#20197;&#36984;&#21462;&#65292;&#28982;&#24460;&#20351;&#29992; &#12300;&#21152;&#20837;&#12301; &#25353;&#37397;&#65292;&#23559;&#20854;&#31227;&#33267; &#12300;&#36984;&#21462;&#30340;&#30446;&#27161;&#12301; &#28165;&#21934;&#12290;</p>
<p>&#20351;&#29992; &#12300;&#20840;&#37096;&#21152;&#20837;&#12301; &#25353;&#37397;&#21487;&#21152;&#20837;&#25152;&#26377;&#30446;&#27161;&#12290;&#20351;&#29992; &#12300;&#31227;&#38500;&#12301; &#33287; &#12300;&#20840;&#37096;&#31227;&#38500;&#12301; &#25353;&#37397;&#21487;&#24478; &#12300;&#36984;&#21462;&#30340;&#30446;&#27161;&#12301; &#28165;&#21934;&#20013;&#31227;&#38500;&#30446;&#27161;&#12290;</p>
<p>&#36984;&#21462; &#12300;&#20786;&#23384;&#12301; &#21487;&#20197;&#22238;&#21040; &#12300;&#25033;&#29992;&#31243;&#24335;&#30446;&#27161;&#12301; &#38913;&#38754;&#12290;</p>
</li>
<li>
<p>&#25353;&#19968;&#19979; &#12300;&#20786;&#23384;&#12301;&#12290;</p>
<p>&#20462;&#35330;&#30340;&#30446;&#27161;&#28165;&#21934;&#20013;&#29694;&#22312;&#21487;&#25552;&#20379;&#35442;&#25033;&#29992;&#31243;&#24335;&#12290;</p>
</li>
</ol>
<a id="sthref83" name="sthref83"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-appedit.html">&#32232;&#36655;&#24050;&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">&#27298;&#35222;&#25033;&#29992;&#31243;&#24335;&#30340;&#25551;&#36848;&#20803;</a></p>
</li>
<li>
<p><a href="task-applaunch.html">&#21855;&#21205;&#25033;&#29992;&#31243;&#24335;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
