<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2012 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-appdeployclient" name="task-appdeployclient"></a><a id="GHCOM00158" name="GHCOM00158"></a></p>

<h4><a id="sthref62" name="sthref62"></a><a id="sthref63" name="sthref63"></a><a id="sthref64" name="sthref64"></a>&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;&#29992;&#25142;&#31471;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#28687;&#35261;&#27193;&#29376;&#32080;&#27083;&#20013;&#65292;&#36984;&#21462; &#12300;&#25033;&#29992;&#31243;&#24335;&#12301; &#31680;&#40670;&#12290;</p>
<p>&#12300;&#25033;&#29992;&#31243;&#24335;&#12301; &#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#24050;&#24314;&#32622;&#30340;&#25033;&#29992;&#31243;&#24335;&#12301; &#34920;&#26684;&#20013;&#65292;&#25353;&#19968;&#19979; &#12300;&#24314;&#32622;&#12301; &#25353;&#37397;&#12290;</p>
<p>&#12300;&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;&#25110;&#27169;&#32068;&#12301; &#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#25351;&#23450;&#35201;&#24314;&#32622;&#30340;&#25033;&#29992;&#31243;&#24335;&#20301;&#32622;&#12290;</p>
<ul>
<li>
<p>&#22914;&#26524;&#25033;&#29992;&#31243;&#24335;&#26159;&#24120;&#39376;&#22312;&#29992;&#25142;&#31471;&#27231;&#22120;&#19978;&#25110;&#21487;&#24478;&#29992;&#25142;&#31471;&#27231;&#22120;&#23384;&#21462;&#30340;&#27512;&#27284;&#27284;&#26696;&#65292;&#35531;&#36984;&#21462; &#12300;&#35201;&#19978;&#20659;&#33267;&#20282;&#26381;&#22120;&#30340;&#23553;&#35037;&#27284;&#26696;&#12301; &#36984;&#38917;&#12290;</p>
<p>&#29992;&#25142;&#31471;&#26159;&#24744;&#35201;&#22312;&#20854;&#19978;&#36879;&#36942;&#28687;&#35261;&#22120;&#27298;&#35222;&#31649;&#29702;&#20027;&#25511;&#21488;&#30340;&#20027;&#27231;&#12290;</p>
<p>&#25353;&#19968;&#19979; &#12300;&#28687;&#35261;&#12301; &#20197;&#28687;&#35261;&#33267;&#35442;&#27284;&#26696;&#65292;&#25110;&#32773;&#37749;&#20837;&#35442;&#27284;&#26696;&#30340;&#23436;&#25972;&#36335;&#24465;&#12290;</p>
</li>
<li>
<p>&#22914;&#26524;&#25033;&#29992;&#31243;&#24335;&#26159;&#24120;&#39376;&#22312;&#20282;&#26381;&#22120;&#27231;&#22120;&#19978;&#30340;&#27512;&#27284;&#27284;&#26696;&#65292;&#25110;&#26159;&#23637;&#38283;&#30340;&#30446;&#37636;&#20013;&#26410;&#23553;&#35037;&#30340;&#25033;&#29992;&#31243;&#24335;&#65292;&#35531;&#36984;&#21462; &#12300;&#21487;&#24478; GlassFish Server &#23384;&#21462;&#30340;&#26412;&#27231;&#23553;&#35037;&#27284;&#26696;&#25110;&#30446;&#37636;&#12301; &#36984;&#38917;&#12290;</p>
<p>&#20282;&#26381;&#22120;&#27231;&#22120;&#26159;&#22519;&#34892;&#32178;&#22495;&#31649;&#29702;&#20282;&#26381;&#22120; (DAS) &#30340;&#20027;&#27231;&#12290;</p>
<p>&#25353;&#19968;&#19979; &#12300;&#28687;&#35261;&#27284;&#26696;&#12301; &#20197;&#28687;&#35261;&#33267;&#27284;&#26696;&#65292;&#25110;&#25353;&#19968;&#19979; &#12300;&#28687;&#35261;&#36039;&#26009;&#22846;&#12301; &#20197;&#28687;&#35261;&#33267;&#30446;&#37636;&#12290;&#25110;&#32773;&#65292;&#37749;&#20837;&#27284;&#26696;&#25110;&#30446;&#37636;&#30340;&#23436;&#25972;&#36335;&#24465;&#21517;&#31281;&#12290;&#24478;&#23637;&#38283;&#30340;&#30446;&#37636;&#24314;&#32622;&#36969;&#29992;&#26044;&#36914;&#38542;&#38283;&#30332;&#32773;&#65292;&#20294;&#19981;&#24314;&#35696;&#22312;&#29983;&#29986;&#29872;&#22659;&#19979;&#36914;&#34892;&#35442;&#20316;&#26989;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#24478; &#12300;&#39006;&#22411;&#12301; &#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462; &#12300;&#25033;&#29992;&#31243;&#24335;&#29992;&#25142;&#31471;&#12301;&#12290;</p>
<p>&#22914;&#26524;&#24050;&#25351;&#23450; &#12300;&#35201;&#19978;&#20659;&#33267;&#20282;&#26381;&#22120;&#30340;&#23553;&#35037;&#27284;&#26696;&#12301; &#25110; &#12300;&#21487;&#24478; GlassFish Server &#23384;&#21462;&#30340;&#26412;&#27231;&#23553;&#35037;&#27284;&#26696;&#12301;&#65292;&#21063;&#26371;&#33258;&#21205;&#20597;&#28204;&#25033;&#29992;&#31243;&#24335;&#39006;&#22411;&#12290;&#22914;&#26524;&#24050;&#25351;&#23450; &#12300;&#21487;&#24478; GlassFish Server &#23384;&#21462;&#30340;&#30446;&#37636;&#12301;&#65292;&#24744;&#24517;&#38920;&#25163;&#21205;&#25351;&#23450;&#39006;&#22411;&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#25033;&#29992;&#31243;&#24335;&#21517;&#31281;&#12301; &#27396;&#20301;&#20013;&#65292;&#20445;&#30041;&#38928;&#35373;&#21517;&#31281; (&#21363;&#30446;&#37636;&#21517;&#31281;&#25110;&#27284;&#26696;&#21517;&#31281;&#30340;&#21069;&#32180;)&#65292;&#25110;&#37749;&#20837;&#20854;&#20182;&#21517;&#31281;&#12290;</p>
<p>&#22914;&#26524;&#24744;&#36984;&#25799;&#19978;&#20659;&#27284;&#26696;&#65292;&#21063;&#26371;&#39023;&#31034;&#38928;&#35373;&#21517;&#31281;&#12290;&#25033;&#29992;&#31243;&#24335;&#21517;&#31281;&#19981;&#24471;&#37325;&#35079;&#12290;</p>
<p>&#21517;&#31281;&#20013;&#21487;&#20197;&#21253;&#21547;&#19968;&#20491;&#36984;&#25799;&#24615;&#30340;&#29256;&#26412;&#35672;&#21029;&#30908;&#65292;&#24460;&#38754;&#25509;&#33879;&#21517;&#31281;&#65292;&#20841;&#32773;&#38291;&#29992;&#20882;&#34399; (<code>:</code>) &#38548;&#38283;&#12290; &#29256;&#26412;&#35672;&#21029;&#30908;&#24517;&#38920;&#20197;&#23383;&#27597;&#25110;&#25976;&#23383;&#38283;&#38957;&#12290;&#30070;&#20013;&#21487;&#20197;&#21253;&#21547;&#33521;&#25976;&#23383;&#20803;&#65292;&#20063;&#21487;&#20197;&#21152;&#19978;&#24213;&#32218; (<code>_</code>)&#12289;&#30772;&#25240;&#34399; (<code>-</code>)&#12289;&#21644;&#23567;&#25976;&#40670;&#34399; (<code>.</code>) &#23383;&#20803;&#12290;&#22914;&#38656;&#26377;&#38364;&#27169;&#32068;&#33287;&#25033;&#29992;&#31243;&#24335;&#29256;&#26412;&#30340;&#26356;&#22810;&#36039;&#35338;&#65292;&#35531;&#21443;&#38321; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Oracle GlassFish Server Application Deployment Guide</i> &#20013;&#30340; <i>Module and Application Versions</i></a>&#12290;</p>
</li>
<li>
<p>&#36984;&#21462; &#12300;Java Web Start&#12301; &#26680;&#21462;&#26041;&#22602;&#65292;&#35731;&#25033;&#29992;&#31243;&#24335;&#29992;&#25142;&#31471;&#27169;&#32068;&#23384;&#21462; Java Web Start&#12290;</p>
<p>&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#21855;&#29992;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462; &#12300;&#22519;&#34892;&#27298;&#39511;&#22120;&#12301; &#26680;&#21462;&#26041;&#22602;&#65292;&#22312;&#36914;&#34892;&#24314;&#32622;&#20043;&#21069;&#39511;&#35657;&#24314;&#32622;&#25551;&#36848;&#20803;&#12290;</p>
<p>&#22914;&#26524;&#36984;&#21462;&#27492;&#36984;&#38917;&#20006;&#19988;&#27298;&#39511;&#22833;&#25943;&#65292;&#21063;&#19981;&#26371;&#22519;&#34892;&#24314;&#32622;&#12290;&#27298;&#39511;&#22120;&#23559;&#27298;&#26597;&#24314;&#32622;&#25551;&#36848;&#20803;&#30340;&#32080;&#27083;&#21644;&#20839;&#23481;&#12290;&#27298;&#39511;&#22823;&#22411;&#25033;&#29992;&#31243;&#24335;&#36890;&#24120;&#38750;&#24120;&#36027;&#26178;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
<p>&#24744;&#24517;&#38920;&#24478;&#26356;&#26032;&#24037;&#20855;&#23433;&#35037;&#27298;&#39511;&#22120;&#22871;&#20214;&#65292;&#21542;&#21063;&#26371;&#35352;&#37636;&#19968;&#21063;&#35686;&#21578;&#20006;&#24573;&#30053;&#27492;&#36984;&#38917;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462; &#12300;&#24375;&#21046;&#37325;&#26032;&#24314;&#32622;&#12301; &#26680;&#21462;&#26041;&#22602;&#65292;&#20197;&#24375;&#21046;&#37325;&#26032;&#24314;&#32622;&#24050;&#24314;&#32622;&#30340;&#25033;&#29992;&#31243;&#24335;&#12290;</p>
<p>&#33509;&#26410;&#36984;&#21462;&#27492;&#36984;&#38917;&#65292;&#21063;&#22039;&#35430;&#24314;&#32622;&#24050;&#24314;&#32622;&#30340;&#25033;&#29992;&#31243;&#24335;&#26371;&#29986;&#29983;&#37679;&#35492;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</li>
<li>
<p>&#22312; &#12300;&#35498;&#26126;&#12301; &#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#27492;&#25033;&#29992;&#31243;&#24335;&#30340;&#35498;&#26126;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#22686;&#21152;&#35201;&#24314;&#32622;&#27169;&#32068;&#25110;&#25033;&#29992;&#31243;&#24335;&#30340;&#30446;&#27161;&#20282;&#26381;&#22120;&#23526;&#20363;&#33287;&#21474;&#38598;&#65292;&#35531;&#24478; &#12300;&#21487;&#29992;&#30340;&#30446;&#27161;&#12301; &#28165;&#21934;&#20013;&#21152;&#20197;&#36984;&#21462;&#65292;&#28982;&#24460;&#20351;&#29992; &#12300;&#21152;&#20837;&#12301; &#25353;&#37397;&#65292;&#23559;&#20854;&#31227;&#33267; &#12300;&#36984;&#21462;&#30340;&#30446;&#27161;&#12301; &#28165;&#21934;&#12290;</p>
<p>&#22914;&#26524;&#26377;&#38928;&#35373;&#20282;&#26381;&#22120;&#23526;&#20363; (<code>server</code>) &#20197;&#22806;&#30340;&#21474;&#38598;&#25110;&#29544;&#31435;&#20282;&#26381;&#22120;&#23526;&#20363;&#23384;&#22312;&#65292;&#20415;&#26371;&#39023;&#31034; &#12300;&#30446;&#27161;&#12301; &#36984;&#38917;&#12290;&#20381;&#38928;&#35373;&#65292;&#26371;&#23559;&#27169;&#32068;&#25110;&#25033;&#29992;&#31243;&#24335;&#24314;&#32622;&#33267;&#21517;&#28858; <code>server</code> &#30340;&#38928;&#35373;&#20282;&#26381;&#22120;&#23526;&#20363;&#12290;&#20351;&#29992; &#12300;&#20840;&#37096;&#21152;&#20837;&#12301; &#25353;&#37397;&#21487;&#24314;&#32622;&#33267;&#25152;&#26377;&#30446;&#27161;&#12290;&#20351;&#29992; &#12300;&#31227;&#38500;&#12301; &#33287; &#12300;&#20840;&#37096;&#31227;&#38500;&#12301; &#25353;&#37397;&#21487;&#24478; &#12300;&#36984;&#21462;&#30340;&#30446;&#27161;&#12301; &#28165;&#21934;&#20013;&#31227;&#38500;&#30446;&#27161;&#12290;</p>
</li>
<li>
<p>&#25353;&#19968;&#19979; &#12300;&#30906;&#23450;&#12301;&#12290;</p>
</li>
</ol>
<a id="sthref65" name="sthref65"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-applistdeployed.html">&#27298;&#35222;&#24050;&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;&#30340;&#28165;&#21934;</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">&#24314;&#32622; Web &#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">&#24314;&#32622;&#20225;&#26989;&#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">&#24314;&#32622;&#36899;&#25509;&#22120;&#27169;&#32068;</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">&#24314;&#32622; EJB Jar</a></p>
</li>
<li>
<p><a href="task-appedit.html">&#32232;&#36655;&#24050;&#24314;&#32622;&#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">&#27298;&#35222;&#25033;&#29992;&#31243;&#24335;&#30340;&#25551;&#36848;&#20803;</a></p>
</li>
<li>
<p><a href="task-endpoint.html">&#27298;&#35222; Web &#26381;&#21209;&#30340;&#31471;&#40670;&#36039;&#35338;</a></p>
</li>
<li>
<p><a href="task-applaunch.html">&#21855;&#21205;&#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">&#21855;&#21205;&#25033;&#29992;&#31243;&#24335;&#29992;&#25142;&#31471;</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">&#19979;&#36617;&#25033;&#29992;&#31243;&#24335;&#29992;&#25142;&#31471; Stub</a></p>
</li>
<li>
<p><a href="task-appredeploy.html">&#37325;&#26032;&#24314;&#32622;&#24050;&#24314;&#32622;&#30340;&#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-apprestart.html">&#37325;&#26032;&#36617;&#20837;&#24050;&#24314;&#32622;&#30340;&#25033;&#29992;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="ref-appscopedresourcesview.html">&#27298;&#35222;&#25033;&#29992;&#31243;&#24335;&#31684;&#22285;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="ref-appscopedresourcesedit.html">&#20462;&#25913;&#25033;&#29992;&#31243;&#24335;&#31684;&#22285;&#36039;&#28304;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2012, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
