<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-batchjobslisting" name="ref-batchjobslisting"></a></p>

<h4>Batchjobausf&uuml;hrungen</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>GlassFish Server bietet eine Batchlaufzeit f&uuml;r die Planung und Ausf&uuml;hrung von Batchjobs. Batchjobs haben in der Regel eine lange Ausf&uuml;hrungszeit und sind auf die Massenverarbeitung von Tasks ausgerichtet, die eine Reihe von Schritten enthalten. Batchanwendungen leiten Jobs an die Batchlaufzeit weiter und liefern Anweisungen, wie und wann die Schritte ausgef&uuml;hrt werden sollen. Die Batchlaufzeit verarbeitet die Schritte und speichert Informationen zu den Jobs in einem Job-Repository. In GlassFish Server ist das Job-Repository eine Datenbank.</p>
<p>Auf der Seite "Batchjobausf&uuml;hrungen" k&ouml;nnen Sie Details zu aufgezeichneten Ausf&uuml;hrungen von Batchjobs anzeigen.</p>
<p>Die Seite "Batchjobausf&uuml;hrungen" enth&auml;lt die folgenden Informationen.</p>
<dl>
<dt>Instanzname</dt>
<dt>Clustername</dt>
<dd>
<p>Der Name des GlassFish-Clusters oder der GlassFish-Serverinstanz, auf das bzw. auf die sich die Konfiguration bezieht.</p>
</dd>
<dt>Batchjobs</dt>
<dd>
<p>Eine Liste der aufgezeichneten Batchjobausf&uuml;hrungen f&uuml;r die Instanz oder das Cluster. F&uuml;r jede Ausf&uuml;hrung werden folgende Informationen angezeigt:</p>
<dl>
<dt>Ausf&uuml;hrungs-ID</dt>
<dd>
<p>Die ID, die der Ausf&uuml;hrung des Batchjobs zugewiesen ist. Wenn Sie auf die Ausf&uuml;hrungs-ID klicken, wird die Seite "Details zur Batchjobausf&uuml;hrung" f&uuml;r die jeweilige Ausf&uuml;hrung angezeigt. Beim erstmaligen Starten eines Jobs und bei jedem Neustart der vorhandenen Ausf&uuml;hrung wird eine neue Ausf&uuml;hrung erstellt.</p>
</dd>
<dt>Jobname</dt>
<dd>
<p>Der Name des Jobs.</p>
</dd>
<dt>Batchstatus</dt>
<dd>
<p>Der von der Batchlaufzeit festgelegte Status der Ausf&uuml;hrung.</p>
</dd>
<dt>Beendigungsstatus</dt>
<dd>
<p>Der Status der Ausf&uuml;hrung, der von der Job-XML f&uuml;r den Job oder von der Batchanwendung festgelegt wurde. Standardm&auml;&szlig;ig sind Beendigungsstatus und Batchstatus identisch, es sei denn, der Beendigungsstatus wird explizit &uuml;berschrieben.</p>
</dd>
<dt>Instanz-ID</dt>
<dd>
<p>Die ID, die der Instanz des Batchjobs zugewiesen ist. Die Instanz eines Batchjobs kann mehrere Ausf&uuml;hrungen haben.</p>
</dd>
<dt>Startzeit</dt>
<dd>
<p>Der Zeitpunkt, an dem die Ausf&uuml;hrung gestartet wurde.</p>
</dd>
<dt>Endzeit</dt>
<dd>
<p>Der Zeitpunkt, an dem die Ausf&uuml;hrung abgeschlossen wurde.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref26" name="sthref26"></a>
<h5>Verwandte Aufgaben</h5>
<ul>
<li>
<p><a href="tasks-topic-group002.html#CEGEIGCJ">So zeigen Sie Batchjobausf&uuml;hrungen an</a></p>
</li>
<li>
<p><a href="tasks-topic-group004.html#CEGEEGBB">So konfigurieren Sie die Batchlaufzeit</a></p>
</li>
</ul>
<a id="GHJML141" name="GHJML141"></a>
<h5>Zugeh&ouml;rige asadmin-Befehle</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM861"><code>list-batch-jobs</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM884"><code>list-batch-job-executions</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM895"><code>list-batch-job-steps</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM863"><code>list-batch-runtime-configuration</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM897"><code>set-batch-runtime-configuration</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
