<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-batchjobsconfiguration" name="ref-batchjobsconfiguration"></a></p>

<h4>Konfiguration der Batchlaufzeit</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>GlassFish Server bietet eine Batchlaufzeit f&uuml;r die Planung und Ausf&uuml;hrung von Batchjobs. Batchjobs haben in der Regel eine lange Ausf&uuml;hrungszeit und sind auf die Massenverarbeitung von Tasks ausgerichtet, die eine Reihe von Schritten enthalten. Batchanwendungen leiten Jobs an die Batchlaufzeit weiter und liefern Anweisungen, wie und wann die Schritte ausgef&uuml;hrt werden sollen. Die Batchlaufzeit verarbeitet die Schritte und speichert Informationen zu den Jobs in einem Job-Repository. In GlassFish Server ist das Job-Repository eine Datenbank.</p>
<p>Auf der Seite "Konfiguration der Batchlaufzeit" k&ouml;nnen Sie die Konfiguration der Batchlaufzeit anzeigen und &auml;ndern. Die Batchlaufzeit verwendet einen Managed Executor-Service sowie eine Datenquelle zur Ausf&uuml;hrung von Batchjobs. Der Managed Executor-Service stellt Threads f&uuml;r Jobs bereit, und die Datenquelle speichert Jobinformationen. Konfigurationsdaten der Batchlaufzeit werden im Element <code>config</code> in der Datei <code>domain.xml</code> gespeichert.</p>
<p>Die Seite "Konfiguration der Batchlaufzeit" enth&auml;lt die folgenden Informationen.</p>
<dl>
<dt>Instanzname</dt>
<dt>Clustername</dt>
<dd>
<p>Der Name des GlassFish-Clusters oder der GlassFish-Serverinstanz, auf das bzw. auf die sich die Konfiguration bezieht. Dies ist ein schreibgesch&uuml;tztes Feld.</p>
</dd>
<dt>Lookup-Name des Executor-Service</dt>
<dd>
<p>Der JNDI-Lookup-Name des Managed Executor-Service, der Threads f&uuml;r Batchjobs bereitstellt. Der Managed Executor-Standardservice lautet <code>concurrent/__defaultManagedExecutorService</code>.</p>
<p>Der Managed Executor-Service kann nach Weiterleitung eines Batchjobs an die Batchlaufzeit ge&auml;ndert werden, ohne die Ausf&uuml;hrung des Jobs zu beeintr&auml;chtigen.</p>
</dd>
<dt>Lookup-Name der Datenquelle</dt>
<dd>
<p>Der JNDI-Lookup-Name der Datenquelle, in der Informationen zu aktuellen und vergangenen Batchjobs gespeichert sind. Die Standarddatenquelle lautet <code>jdbc/__TimerPool</code>.</p>
<p>Sobald der erste Batchjob an die Batchlaufzeit zur Ausf&uuml;hrung weitergeleitet wurde, d&uuml;rfen Sie die Datenquelle nicht mehr &auml;ndern. Wenn die Datenquelle ge&auml;ndert werden muss, stoppen Sie die Domain, und starten Sie sie anschlie&szlig;end neu, und nehmen Sie dann die notwendigen &Auml;nderungen vor, bevor Sie Jobs starten bzw. neu starten. Sobald die Datenquelle jedoch ge&auml;ndert wurde, kann auf Informationen in der vorherigen Datenquelle nicht mehr zugegriffen werden.</p>
</dd>
</dl>
<a id="sthref31" name="sthref31"></a>
<h5>Verwandte Aufgaben</h5>
<ul>
<li>
<p><a href="tasks-topic-group004.html#CEGEEGBB">So konfigurieren Sie die Batchlaufzeit</a></p>
</li>
<li>
<p><a href="tasks-topic-group002.html#CEGEIGCJ">So zeigen Sie Batchjobausf&uuml;hrungen an</a></p>
</li>
</ul>
<a id="sthref32" name="sthref32"></a>
<h5>Zugeh&ouml;rige asadmin-Befehle</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM897"><code>set-batch-runtime-configuration</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM863"><code>list-batch-runtime-configuration</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM861"><code>list-batch-jobs</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM884"><code>list-batch-job-executions</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM895"><code>list-batch-job-steps</code>(1)</a></p>
</li>
</ul>




<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
