<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-javamailsessioncreate" name="ref-javamailsessioncreate"></a></p>

<h4><a id="sthref19" name="sthref19"></a>Neue JavaMail-Session</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Auf der Seite "Neue JavaMail-Session" k&ouml;nnen Sie eine JavaMail-Sessionressource erstellen.</p>
<p>Die Seite "Neue JavaMail-Session" enth&auml;lt die folgenden Optionen.</p>
<dl>
<dt>JNDI-Name</dt>
<dd>
<p>Ein eindeutiger Name, der die Mailsession identifiziert. Verwenden Sie das sub-context-Namenspr&auml;fix <code>mail/</code> f&uuml;r JavaMail-Ressourcen. Beispiel: <code>mail/MySession</code>. Der Name darf ausschlie&szlig;lich alphanumerische Zeichen, Unterstriche, Gedankenstriche oder Punkte enthalten.</p>
</dd>
<dt>Mailhost</dt>
<dd>
<p>Der Hostname des Standard-Mailservers. Die Verbindungsmethoden der Speicher- und Transportobjekte verwenden diesen Wert, wenn keine protokollspezifische Hosteigenschaft angegeben ist. Der Name muss in einen tats&auml;chlichen Hostnamen aufl&ouml;sbar sein.</p>
</dd>
<dt>Standardbenutzer</dt>
<dd>
<p>Der Benutzername, der bei der Verbindungsherstellung zu einem Mailserver angegeben werden muss. Die Verbindungsmethode der Speicher- und Transportobjekte verwendet diesen Wert, wenn keine protokollspezifische Benutzernamenseigenschaft angegeben ist. Der Benutzername darf nur alphanumerische Zeichen, Unterstriche, Gedankenstriche oder Punkte enthalten.</p>
</dd>
<dt>Standardabsenderadresse</dt>
<dd>
<p>Die E-Mail-Adresse des Standardbenutzers. Das Format ist <i>username</i><code>@</code><i>host</i>.<i>domain</i>.</p>
</dd>
<dt>Beschreibung</dt>
<dd>
<p>Eine Beschreibung der Mailsession.</p>
</dd>
<dt>Status</dt>
<dd>
<p>Der Status der Mailsession. Die Mailsession kann aktiviert oder deaktiviert sein. Der Standardwert ist "Aktiviert".</p>
</dd>
<dt>Speicherprotokoll</dt>
<dd>
<p>Der Speicherprotokollservice, der eine Verbindung zu einem Mailserver herstellt, Nachrichten abruft und Nachrichten in mindestens einem Ordner speichert. Zul&auml;ssige Werte sind <code>imap</code>, <code>pop3</code>, <code>imaps</code>und <code>pop3s</code>. Der Standardwert ist <code>imap</code>.</p>
</dd>
<dt>Speicherprotokollklasse</dt>
<dd>
<p>Die Serviceprovider-Implementierungsklasse f&uuml;r die Speicherung. Zul&auml;ssige Werte sind:</p>
<ul>
<li>
<p><code>com.sun.mail.imap.IMAPStore</code></p>
</li>
<li>
<p><code>com.sun.mail.pop3.POP3Store</code></p>
</li>
<li>
<p><code>com.sun.mail.imap.IMAPSSLStore</code></p>
</li>
<li>
<p><code>com.sun.mail.pop3.POP3SSLStore</code></p>
</li>
</ul>
<p>Der Standardwert ist <code>com.sun.mail.imap.IMAPStore</code>.</p>
</dd>
<dt>Transportprotokoll</dt>
<dd>
<p>Der Transportprotokollservice, der Nachrichten sendet. Zul&auml;ssige Werte sind <code>smtp</code> und <code>smtps</code>. Der Standardwert ist <code>smtp</code>.</p>
</dd>
<dt>Transportprotokollklasse</dt>
<dd>
<p>Die Serviceprovider-Implementierungsklasse f&uuml;r den Transport. Zul&auml;ssige Werte sind:</p>
<ul>
<li>
<p><code>com.sun.mail.smtp.SMTPTransport</code></p>
</li>
<li>
<p><code>com.sun.mail.smtp.SMTPSSLTransport</code></p>
</li>
</ul>
<p>Der Standardwert ist <code>com.sun.mail.smtp.SMTPTransport</code>.</p>
</dd>
<dt>Debug</dt>
<dd>
<p>Bei aktivierter Option ist das Debugging f&uuml;r diese Ressource aktiviert. Wenn die JavaMail-Logebene auf <code>FINE</code> (Genau) oder h&ouml;her festgelegt ist, wird eine Debugging-Ausgabe generiert und in die Systemlogdatei geschrieben. Weitere Informationen zur Festlegung der Logebene finden Sie unter <a href="../../../common/en/help/task-eelogginglevels.html">So konfigurieren Sie Logebenen</a>.</p>
</dd>
<dt>Weitere Eigenschaften</dt>
<dd>
<p>Zus&auml;tzliche Eigenschaften f&uuml;r die JavaMail-Session. Eine Liste der verf&uuml;gbaren Eigenschaften finden Sie in der JavaMail-API-Dokumentation (<code><a href="http://java.sun.com/products/javamail/javadocs/index.html">http://java.sun.com/products/javamail/javadocs/index.html</a></code>). Zus&auml;tzliche Eigenschaften m&uuml;ssen mit <code>mail-</code> beginnen und Bindestriche anstelle von Punkten als Trennzeichen verwenden. Beispiel: Richtig ist <code>mail-debug</code>, w&auml;hrend <code>mail.debug</code> falsch ist. Das GlassFish Server-Backend wandelt die Bindestriche in die von der JavaMail-API erwarteten Punkte um.</p>
</dd>
<dt>Ziele</dt>
<dd>
<p>Cluster und Standalone-Instanzen f&uuml;r die JavaMail-Session. Mithilfe der Schaltfl&auml;chen "Hinzuf&uuml;gen" und "Alle hinzuf&uuml;gen" verschieben Sie die ben&ouml;tigten Ziele in die Spalte "Ausgew&auml;hlte Ziele". Verschieben Sie die nicht ben&ouml;tigten Ziele in die Spalte "Verf&uuml;gbare Ziele" mithilfe der Schaltfl&auml;chen "Entfernen" und "Alle entfernen".</p>
<p>Diese Option wird nur dann angezeigt, wenn in der Domain Cluster oder Standalone-Instanzen erstellt wurden.</p>
</dd>
</dl>
<a id="GHJML119" name="GHJML119"></a>
<h5>Verwandte Aufgaben</h5>
<ul>
<li>
<p><a href="task-javamailsessioncreate.html">So wird eine JavaMail-Session erstellt</a></p>
</li>
<li>
<p><a href="task-javamailsessionsedit.html">So wird eine JavaMail-Session bearbeitet</a></p>
</li>
<li>
<p><a href="task-javamailsessionsdelete.html">So wird eine JavaMail-Session gel&ouml;scht</a></p>
</li>
</ul>
<a id="GHJML120" name="GHJML120"></a>
<h5>Zugeh&ouml;rige asadmin-Befehle</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00035"><code>create-javamail-resource</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00172"><code>list-javamail-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00087"><code>delete-javamail-resource</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
