<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-javamailsessionsedit" name="task-javamailsessionsedit"></a></p>

<h4><a id="sthref9" name="sthref9"></a>So wird eine JavaMail-Session bearbeitet</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Blenden Sie in der Navigationsbaumstruktur den Knoten "Ressourcen" ein.</p>
</li>
<li>
<p>W&auml;hlen Sie unter dem Ressourcenknoten den Knoten "JavaMail-Sessions" aus.</p>
<p>Die Seite "JavaMail-Sessions" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie auf der Seite "JavaMail-Sessions" auf den Namen der zu bearbeitenden Session.</p>
<p>Die Seite "JavaMail-Session bearbeiten" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Geben Sie im Feld "Mail-Host" den Hostnamen des standardm&auml;&szlig;igen Mailservers an.</p>
<p>Die Verbindungsmethoden der Speicher- und Transportobjekte verwenden diesen Wert, wenn keine protokollspezifische Hosteigenschaft angegeben ist. Der Name muss in einen tats&auml;chlichen Hostnamen aufl&ouml;sbar sein.</p>
</li>
<li>
<p>Geben Sie im Feld "Standardbenutzer" einen anderen Benutzernamen ein, der bei der Verbindungsherstellung mit einem Mailserver angegeben werden soll.</p>
<p>Die Verbindungsmethode der Speicher- und Transportobjekte verwendet diesen Wert, wenn keine protokollspezifische Benutzernamenseigenschaft angegeben ist. Der Benutzername darf nur alphanumerische Zeichen, Unterstriche, Gedankenstriche oder Punkte enthalten.</p>
</li>
<li>
<p>Geben Sie im Feld "Standardm&auml;&szlig;ige Absenderadresse" die E-Mail-Adresse des Standardbenutzers ein.</p>
<p>Das Format ist <i>username</i><code>@</code><i>host</i>.<i>domain</i>.</p>
</li>
<li>
<p>Geben Sie im Feld "Deployment-Reihenfolge" eine Nummer ein, um die Deployment-Reihenfolge der JavaMail-Sessionressource anzugeben.</p>
<p>Ressourcen mit einer niedrigeren Nummer werden beim Hochfahren des Servers zuerst geladen. Der Standardwert ist 100.</p>
</li>
<li>
<p>&Auml;ndern Sie im Feld "Beschreibung" die Beschreibung f&uuml;r die Mailsession.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Status", um die Mailsession zu aktivieren.</p>
<p>Der Standardwert ist "Aktiviert".</p>
</li>
<li>
<p>Legen Sie im Feld "Speicherprotokoll" die zu verwendende Kommunikationsmethode f&uuml;r das Speicherobjekt fest.</p>
<p>Standardm&auml;&szlig;ig wird das Speicherprotokoll <code>imap</code> verwendet.</p>
</li>
<li>
<p>Geben Sie im Feld "Speicherprotokollklasse" die Kommunikationsmethodenklasse f&uuml;r die Speicherung an, die das gew&uuml;nschte Speicherprotokoll implementiert.</p>
<p>Standardm&auml;&szlig;ig lautet die Speicherprotokollklasse <code>com.sun.mail.imap.IMAPStore</code>.</p>
</li>
<li>
<p>Geben Sie im Feld "Transportprotokoll" die Kommunikationsmethode f&uuml;r den Transport an.</p>
<p>Standardm&auml;&szlig;ig wird das Transportprotokoll <code>smtp</code> verwendet.</p>
</li>
<li>
<p>Geben Sie im Feld "Transportprotokollklasse" die Kommunikationsmethodenklasse f&uuml;r den Transport an</p>
<p>Standardm&auml;&szlig;ig lautet die Transportprotokollklasse <code>com.sun.mail.smtp.SMTPTransport</code>.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Debug", um eine zus&auml;tzliche Debugging-Ausgabe einschlie&szlig;lich einem Protokoll-Tracing f&uuml;r diese Mailsession zu aktivieren.</p>
<p>Wenn die JavaMail-Logebene auf <code>FINE</code> (Genau) oder h&ouml;her festgelegt ist, wird eine Debugging-Ausgabe generiert und in die Systemlogdatei geschrieben. Weitere Informationen zur Festlegung der Logebene finden Sie unter <a href="../../../common/en/help/task-eelogginglevels.html">So konfigurieren Sie Logebenen</a>.</p>
</li>
<li>
<p>Geben Sie in der Tabelle "Weitere Eigenschaften" zus&auml;tzliche Eigenschaften an, die von Anwendungen ben&ouml;tigt werden, wie z.B. eine Eigenschaft f&uuml;r einen protokollspezifischen Host oder Benutzernamen.</p>
<p>Eine Liste der verf&uuml;gbaren Eigenschaften finden Sie in der JavaMail-API-Dokumentation (<code><a href="http://java.sun.com/products/javamail/javadocs/index.html">http://java.sun.com/products/javamail/javadocs/index.html</a></code>). Zus&auml;tzliche Eigenschaften m&uuml;ssen mit <code>mail-</code> beginnen und Bindestriche anstelle von Punkten als Trennzeichen verwenden. Beispiel: Richtig ist <code>mail-debug</code>, w&auml;hrend <code>mail.debug</code> falsch ist. Das GlassFish Server-Backend wandelt die Bindestriche in die von der JavaMail-API erwarteten Punkte um.</p>
<ul>
<li>
<p>Um eine Eigenschaft hinzuzuf&uuml;gen, klicken Sie auf die Schaltfl&auml;che "Eigenschaft hinzuf&uuml;gen". Geben Sie in die daraufhin angezeigte leere Zeile den Eigenschaftsnamen in das Feld "Name" und den Eigenschaftswert in das Feld "Wert" ein.</p>
</li>
<li>
<p>Um eine Eigenschaft zu &auml;ndern, bearbeiten Sie das Feld "Wert" dieser Eigenschaft.</p>
</li>
<li>
<p>Um eine Eigenschaft zu l&ouml;schen, aktivieren Sie das Kontrollk&auml;stchen links neben dem Feld "Name" der zu l&ouml;schenden Eigenschaft und klicken anschlie&szlig;end auf die Schaltfl&auml;che "Eigenschaften l&ouml;schen".</p>
</li>
</ul>
</li>
<li>
<p>Klicken Sie auf "Speichern".</p>

<hr>
<p><b>Tipp:</b></p>
Um zu den Standardeinstellungen zur&uuml;ckzukehren, klicken Sie auf die Schaltfl&auml;che "Standardwerte laden" und anschlie&szlig;end auf "Speichern".
<hr>

</li>
</ol>
<a id="GHJML104" name="GHJML104"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-javamailsessioncreate.html">So wird eine JavaMail-Session erstellt</a></p>
</li>
<li>
<p><a href="task-javamailsessionsdelete.html">So wird eine JavaMail-Session gel&ouml;scht</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
