<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-orb" name="ref-orb"></a><a id="GHCOR00001" name="GHCOR00001"></a></p>

<h4><a id="sthref14" name="sthref14"></a><a id="sthref15" name="sthref15"></a>ORB</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Auf der Seite "ORB" k&ouml;nnen Sie den Object Request Broker konfigurieren.</p>
<p>Der ORB stellt die erforderliche Infrastruktur zum Identifizieren und Suchen von Objekten, Abwickeln der Verbindungsverwaltung, &Uuml;bermitteln von Daten und f&uuml;r Kommunikationsanforderungen bereit. Remote-Clients von Enterprise Beans (EJB-Module) kommunizieren mit GlassFish Server &uuml;ber den ORB.</p>
<p>Die Seite "ORB" umfasst die folgenden Optionen.</p>
<dl>
<dt>Standardeinstellungen laden</dt>
<dd>
<p>Schaltfl&auml;che zur Wiederherstellung der Standardwerte von Einstellungen, die Standardwerte haben. Einstellungen, die keine Standardwerte haben, werden nicht ge&auml;ndert.</p>
</dd>
<dt>Name der Konfiguration</dt>
<dd>
<p>Der Name der Konfiguration, f&uuml;r die die Einstellungen auf dieser Seite angewendet werden. Dieses Feld ist schreibgesch&uuml;tzt.</p>
</dd>
<dt>Threadpool-ID</dt>
<dd>
<p>Der vom ORB verwendete Threadpool. Der ORB verwendet Threadpools, um auf Anforderungen von Remote-Clients von Enterprise Beans und anderen Clients zu reagieren, die &uuml;ber RMI-IIOP kommunizieren. Der standardm&auml;&szlig;ige Threadpool f&uuml;r den ORB ist <code>thread-pool-1</code>, der Standardwerte speziell f&uuml;r RMI/IIOP-Anforderungen verwendet.</p>
</dd>
<dt>Max. Nachrichtenfragmentgr&ouml;&szlig;e</dt>
<dd>
<p>Die maximale Fragmentgr&ouml;&szlig;e f&uuml;r IIOP-Nachrichten. Gr&ouml;&szlig;ere Nachrichten werden fragmentiert. Der Standardwert ist 1024 Byte.</p>
</dd>
<dt>Gesamtanzahl Verbindungen</dt>
<dd>
<p>Die maximale Anzahl eingehender Verbindungen f&uuml;r alle IIOP-Listener. Der Standardwert ist 1024.</p>
</dd>
<dt>IIOP-Clientauthentifizierung</dt>
<dd>
<p>Wenn das Kontrollk&auml;stchen "Aktiviert" aktiviert ist, weist der Server nicht authentifizierte Anfragen zur&uuml;ck und f&uuml;gt ein Bit f&uuml;r die Authentifizierungserfordernis in die an Clients gesendeten Interoperable Object References (IORs) ein. Die IIOP-Clientauthentifizierung kann aktiviert oder deaktiviert sein. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>Weitere Eigenschaften</dt>
<dd>
<p>Weitere Eigenschaften f&uuml;r den ORB. Der GlassFish Server definiert keine zus&auml;tzlichen Eigenschaften f&uuml;r den ORB.</p>
</dd>
</dl>
<a id="sthref16" name="sthref16"></a>
<h5>Verwandte Aufgaben</h5>
<ul>
<li>
<p><a href="task-orb.html">So wird ORB konfiguriert</a></p>
</li>
<li>
<p><a href="task-iioplistenernew.html">So wird ein IIOP-Listener erstellt</a></p>
</li>
<li>
<p><a href="task-iioplisteneredit.html">So wird ein IIOP-Listener bearbeitet</a></p>
</li>
<li>
<p><a href="task-editiiopssl.html">So werden SSL-Einstellungen f&uuml;r einen sicheren IIOP-Listener bearbeitet</a></p>
</li>
<li>
<p><a href="task-iioplistenerdelete.html">So wird ein IIOP-Listener gel&ouml;scht</a></p>
</li>
</ul>
<a id="sthref17" name="sthref17"></a>
<h5>Zugeh&ouml;rige asadmin-Befehle</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00032"><code>create-iiop-listener</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00169"><code>list-iiop-listeners</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00084"><code>delete-iiop-listener</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00058"><code>create-ssl</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00109"><code>delete-ssl</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
