<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-iioplisteneredit" name="task-iioplisteneredit"></a></p>

<h4><a id="sthref7" name="sthref7"></a>So wird ein IIOP-Listener bearbeitet</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Blenden Sie in der Baumkomponente den Knoten "Konfiguration" ein.</p>
</li>
<li>
<p>W&auml;hlen Sie die zu konfigurierende Instanz:</p>
<ul>
<li>
<p>Um eine bestimmte Instanz zu konfigurieren, w&auml;hlen Sie den Konfigurationsknoten der Instanz. Beispiel: F&uuml;r die Standardinstanz <code>server</code> w&auml;hlen Sie den Knoten <code>server-config</code>.</p>
</li>
<li>
<p>Um die Standardeinstellungen f&uuml;r zuk&uuml;nftige Instanzen zu konfigurieren, die eine Kopie von <code>default-config</code> verwenden, w&auml;hlen Sie den Knoten <code>default-config</code>.</p>
</li>
</ul>
</li>
<li>
<p>Blenden Sie unter dem Knoten "Konfiguration" den Knoten "ORB" ein.</p>
</li>
<li>
<p>W&auml;hlen Sie den Knoten "IIOP-Listener".</p>
<p>Die Seite "IIOP-Listener" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie in der Tabelle auf den Namen des zu bearbeitenden Listeners.</p>
<p>Die Seite "IIOP-Listener bearbeiten" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Geben Sie im Feld "Netzwerkadresse" die Netzwerkadresse des Listeners ein.</p>
<p>Sie k&ouml;nnen eine IP-Adresse oder einen Hostnamen eingeben, der vom DNS aufgel&ouml;st werden kann.</p>
</li>
<li>
<p>Geben Sie im Feld "Listener-Port" die Portnummer ein, die der IIOP-Listener abruft.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Listener aktiviert", um eingehende IIOP-Verbindungen vom ORB zum GlassFish Server zu aktivieren.</p>
<p>Diese Option ist standardm&auml;&szlig;ig aktiviert.</p>
</li>
<li>
<p>W&auml;hlen Sie das Kontrollk&auml;stchen "Sicherheit aktiviert", um SSL f&uuml;r den IIOP-Listener zu aktivieren.</p>
<p>Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Geben Sie im Abschnitt "Weitere Eigenschaften" weitere Eigenschaften an.</p>
<p>Der GlassFish Server definiert keine zus&auml;tzlichen Eigenschaften f&uuml;r die IIOP-Listener.</p>
<ul>
<li>
<p>Um eine Eigenschaft hinzuzuf&uuml;gen, klicken Sie auf die Schaltfl&auml;che "Eigenschaft hinzuf&uuml;gen". Geben Sie in die daraufhin angezeigte leere Zeile den Eigenschaftsnamen in das Feld "Name" und den Eigenschaftswert in das Feld "Wert" ein.</p>
</li>
<li>
<p>Um eine Eigenschaft zu &auml;ndern, bearbeiten Sie das Feld "Wert" dieser Eigenschaft.</p>
</li>
<li>
<p>Um eine Eigenschaft zu l&ouml;schen, aktivieren Sie das Kontrollk&auml;stchen links neben dem Feld "Name" der zu l&ouml;schenden Eigenschaft und klicken anschlie&szlig;end auf die Schaltfl&auml;che "Eigenschaften l&ouml;schen".</p>
</li>
</ul>
</li>
<li>
<p>Klicken Sie auf "Speichern".</p>

<hr>
<p><b>Tipp:</b></p>
Um zu den Standardeinstellungen zur&uuml;ckzukehren, klicken Sie auf die Schaltfl&auml;che "Standardwerte laden" und anschlie&szlig;end auf "Speichern".
<hr>

</li>
<li>
<p>Wenn das Kontrollk&auml;stchen "Sicherheit aktiviert" aktiviert ist, klicken Sie auf den Fensterbereich mit Registerkarten f&uuml;r SSL, um die SSL-Einstellungen (Secure Socket Layer) dieses IIOP-Listener zu &auml;ndern.</p>
<p>Weitere Einzelheiten finden Sie unter <a href="task-editiiopssl.html">So werden SSL-Einstellungen f&uuml;r einen sicheren IIOP-Listener bearbeitet</a>.</p>
</li>
<li>
<p>Wenn Sie die Portnummer des Listeners &auml;ndern, starten Sie den GlassFish Server neu.</p>
</li>
</ol>
<a id="sthref8" name="sthref8"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-orb.html">So wird ORB konfiguriert</a></p>
</li>
<li>
<p><a href="task-iioplistenernew.html">So wird ein IIOP-Listener erstellt</a></p>
</li>
<li>
<p><a href="task-editiiopssl.html">So werden SSL-Einstellungen f&uuml;r einen sicheren IIOP-Listener bearbeitet</a></p>
</li>
<li>
<p><a href="task-iioplistenerdelete.html">So wird ein IIOP-Listener gel&ouml;scht</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
