<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-batchjobsconfiguration" name="ref-batchjobsconfiguration"></a></p>

<h4>&#25209;&#22788;&#29702;&#36816;&#34892;&#26102;&#37197;&#32622;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>GlassFish Server &#25552;&#20379;&#20102;&#25209;&#22788;&#29702;&#36816;&#34892;&#26102;&#29992;&#20110;&#25209;&#22788;&#29702;&#20316;&#19994;&#30340;&#35843;&#24230;&#21644;&#25191;&#34892;&#12290;&#25209;&#22788;&#29702;&#20316;&#19994;&#36890;&#24120;&#26159;&#38271;&#26102;&#38388;&#36816;&#34892;&#30340;&#12289;&#25209;&#37327;&#25191;&#34892;&#30340;&#20219;&#21153;&#65292;&#20854;&#20013;&#21253;&#21547;&#19968;&#31995;&#21015;&#27493;&#39588;&#12290;&#25209;&#22788;&#29702;&#24212;&#29992;&#31243;&#24207;&#23558;&#20316;&#19994;&#25552;&#20132;&#32473;&#25209;&#22788;&#29702;&#36816;&#34892;&#26102;&#65292;&#24182;&#25552;&#20379;&#26377;&#20851;&#25191;&#34892;&#27493;&#39588;&#30340;&#26041;&#27861;&#21644;&#26102;&#38388;&#30340;&#25351;&#31034;&#12290;&#25209;&#22788;&#29702;&#36816;&#34892;&#26102;&#22788;&#29702;&#27493;&#39588;&#24182;&#23558;&#26377;&#20851;&#20316;&#19994;&#30340;&#20449;&#24687;&#23384;&#20648;&#22312;&#20316;&#19994;&#36164;&#26009;&#26723;&#26696;&#24211;&#20013;&#12290;&#22312; GlassFish Server &#20013;&#65292;&#20316;&#19994;&#36164;&#26009;&#26723;&#26696;&#24211;&#26159;&#25968;&#25454;&#24211;&#12290;</p>
<p>&#20351;&#29992;&ldquo;&#25209;&#22788;&#29702;&#36816;&#34892;&#26102;&#37197;&#32622;&rdquo;&#39029;&#21487;&#20197;&#26597;&#30475;&#21644;&#26356;&#25913;&#25209;&#22788;&#29702;&#36816;&#34892;&#26102;&#30340;&#37197;&#32622;&#12290;&#25209;&#22788;&#29702;&#36816;&#34892;&#26102;&#20351;&#29992;&#25176;&#31649;&#25191;&#34892;&#31243;&#24207;&#26381;&#21153;&#21644;&#25968;&#25454;&#28304;&#26469;&#25191;&#34892;&#25209;&#22788;&#29702;&#20316;&#19994;&#12290;&#25176;&#31649;&#25191;&#34892;&#31243;&#24207;&#26381;&#21153;&#21521;&#20316;&#19994;&#25552;&#20379;&#32447;&#31243;&#65292;&#32780;&#25968;&#25454;&#28304;&#21017;&#20250;&#23384;&#20648;&#20316;&#19994;&#20449;&#24687;&#12290;&#25209;&#22788;&#29702;&#36816;&#34892;&#26102;&#37197;&#32622;&#25968;&#25454;&#23384;&#20648;&#22312; <code>domain.xml</code> &#30340; <code>config</code> &#20803;&#32032;&#20013;&#12290;</p>
<p>&ldquo;&#25209;&#22788;&#29702;&#36816;&#34892;&#26102;&#37197;&#32622;&rdquo;&#39029;&#21253;&#21547;&#20197;&#19979;&#20449;&#24687;&#12290;</p>
<dl>
<dt>&#23454;&#20363;&#21517;&#31216;</dt>
<dt>&#38598;&#32676;&#21517;&#31216;</dt>
<dd>
<p>&#35813;&#37197;&#32622;&#24212;&#29992;&#21040;&#30340; GlassFish &#38598;&#32676;&#25110;&#26381;&#21153;&#22120;&#23454;&#20363;&#30340;&#21517;&#31216;&#12290;&#36825;&#26159;&#21482;&#35835;&#23383;&#27573;&#12290;</p>
</dd>
<dt>&#25191;&#34892;&#31243;&#24207;&#26381;&#21153;&#26597;&#25214;&#21517;&#31216;</dt>
<dd>
<p>&#21521;&#25209;&#22788;&#29702;&#20316;&#19994;&#25552;&#20379;&#32447;&#31243;&#30340;&#25176;&#31649;&#25191;&#34892;&#31243;&#24207;&#26381;&#21153;&#30340; JNDI &#26597;&#25214;&#21517;&#31216;&#12290;&#40664;&#35748;&#25176;&#31649;&#25191;&#34892;&#31243;&#24207;&#26381;&#21153;&#20026; <code>concurrent/__defaultManagedExecutorService</code>&#12290;</p>
<p>&#22312;&#25209;&#22788;&#29702;&#20316;&#19994;&#24050;&#25552;&#20132;&#21040;&#25209;&#22788;&#29702;&#36816;&#34892;&#26102;&#20043;&#21518;&#65292;&#21487;&#20197;&#26356;&#25913;&#25176;&#31649;&#25191;&#34892;&#31243;&#24207;&#26381;&#21153;&#32780;&#19981;&#20250;&#24433;&#21709;&#20316;&#19994;&#30340;&#25191;&#34892;&#12290;</p>
</dd>
<dt>&#25968;&#25454;&#28304;&#26597;&#25214;&#21517;&#31216;</dt>
<dd>
<p>&#23384;&#20648;&#26377;&#20851;&#24403;&#21069;&#21644;&#36807;&#21435;&#25209;&#22788;&#29702;&#20316;&#19994;&#30340;&#20449;&#24687;&#30340;&#25968;&#25454;&#28304;&#30340; JNDI &#26597;&#25214;&#21517;&#31216;&#12290;&#40664;&#35748;&#25968;&#25454;&#28304;&#20026; <code>jdbc/__TimerPool</code>&#12290;</p>
<p>&#22312;&#31532;&#19968;&#20010;&#25209;&#22788;&#29702;&#20316;&#19994;&#24050;&#25552;&#20132;&#21040;&#25209;&#22788;&#29702;&#36816;&#34892;&#26102;&#20197;&#20379;&#25191;&#34892;&#21518;&#65292;&#35831;&#21247;&#26356;&#25913;&#25968;&#25454;&#28304;&#12290;&#22914;&#26524;&#24517;&#39035;&#26356;&#25913;&#25968;&#25454;&#28304;&#65292;&#35831;&#20572;&#27490;&#24182;&#37325;&#26032;&#21551;&#21160;&#22495;&#65292;&#28982;&#21518;&#22312;&#20219;&#20309;&#20316;&#19994;&#21551;&#21160;&#25110;&#37325;&#26032;&#21551;&#21160;&#20043;&#21069;&#36827;&#34892;&#26356;&#25913;&#12290;&#20294;&#26159;&#65292;&#19968;&#26086;&#26356;&#25913;&#20102;&#25968;&#25454;&#28304;&#65292;&#23384;&#20648;&#22312;&#20197;&#21069;&#25968;&#25454;&#28304;&#20013;&#30340;&#20449;&#24687;&#23558;&#19981;&#21487;&#35775;&#38382;&#12290;</p>
</dd>
</dl>
<a id="sthref31" name="sthref31"></a>
<h5>&#30456;&#20851;&#20219;&#21153;</h5>
<ul>
<li>
<p><a href="tasks-topic-group004.html#CEGEEGBB">&#37197;&#32622;&#25209;&#22788;&#29702;&#36816;&#34892;&#26102;</a></p>
</li>
<li>
<p><a href="tasks-topic-group002.html#CEGEIGCJ">&#26597;&#30475;&#25209;&#22788;&#29702;&#20316;&#19994;&#25191;&#34892;</a></p>
</li>
</ul>
<a id="sthref32" name="sthref32"></a>
<h5>&#30456;&#20851;&#30340; asadmin &#21629;&#20196;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM897"><code>set-batch-runtime-configuration</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM863"><code>list-batch-runtime-configuration</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM861"><code>list-batch-jobs</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM884"><code>list-batch-job-executions</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM895"><code>list-batch-job-steps</code>(1)</a></p>
</li>
</ul>




<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
