<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-javamailsessioncreate" name="task-javamailsessioncreate"></a><a id="GHJML00011" name="GHJML00011"></a></p>

<h4><a id="sthref2" name="sthref2"></a>&#21019;&#24314; JavaMail &#20250;&#35805;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#23548;&#33322;&#26641;&#20013;&#65292;&#23637;&#24320;&ldquo;&#36164;&#28304;&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#36164;&#28304;&rdquo;&#33410;&#28857;&#19979;&#65292;&#36873;&#25321;&ldquo;JavaMail &#20250;&#35805;&rdquo;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;JavaMail &#20250;&#35805;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#20250;&#35805;&rdquo;&#34920;&#20013;&#65292;&#21333;&#20987;&ldquo;&#26032;&#24314;&rdquo;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#26032;&#24314; JavaMail &#20250;&#35805;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;JNDI &#21517;&#31216;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#37038;&#20214;&#20250;&#35805;&#36164;&#28304;&#30340;&#21807;&#19968;&#21517;&#31216;&#12290;</p>
<p>&#23558;&#21629;&#21517;&#23376;&#19978;&#19979;&#25991;&#21069;&#32512; <code>mail/</code> &#29992;&#20110; JavaMail &#36164;&#28304;&#12290;&#20363;&#22914;&#65306;<code>mail/MySession</code>&#12290;&#21517;&#31216;&#21482;&#33021;&#21253;&#21547;&#23383;&#27597;&#25968;&#23383;&#12289;&#19979;&#21010;&#32447;&#12289;&#30701;&#21010;&#32447;&#25110;&#28857;&#23383;&#31526;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#37038;&#20214;&#20027;&#26426;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#40664;&#35748;&#37038;&#20214;&#26381;&#21153;&#22120;&#30340;&#20027;&#26426;&#21517;&#12290;</p>
<p>&#22914;&#26524;&#26410;&#25552;&#20379;&#29305;&#23450;&#20110;&#21327;&#35758;&#30340;&#20027;&#26426;&#23646;&#24615;&#65292;&#21017; Store &#21644; Transport &#23545;&#35937;&#30340;&#36830;&#25509;&#26041;&#27861;&#20351;&#29992;&#35813;&#20540;&#12290;&#21517;&#31216;&#24517;&#39035;&#21487;&#20197;&#35299;&#26512;&#20026;&#23454;&#38469;&#30340;&#20027;&#26426;&#21517;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#40664;&#35748;&#29992;&#25143;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#36830;&#25509;&#21040;&#37038;&#20214;&#26381;&#21153;&#22120;&#26102;&#35201;&#25552;&#20379;&#30340;&#29992;&#25143;&#21517;&#12290;</p>
<p>&#22914;&#26524;&#26410;&#25552;&#20379;&#29305;&#23450;&#20110;&#21327;&#35758;&#30340;&#29992;&#25143;&#21517;&#23646;&#24615;&#65292;Store &#21644; Transport &#23545;&#35937;&#30340;&#36830;&#25509;&#26041;&#27861;&#20351;&#29992;&#35813;&#20540;&#12290;&#29992;&#25143;&#21517;&#21482;&#33021;&#21253;&#21547;&#23383;&#27597;&#25968;&#23383;&#12289;&#19979;&#21010;&#32447;&#12289;&#30701;&#21010;&#32447;&#25110;&#28857;&#23383;&#31526;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#40664;&#35748;&#21457;&#20214;&#20154;&#22320;&#22336;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#40664;&#35748;&#29992;&#25143;&#30340;&#30005;&#23376;&#37038;&#20214;&#22320;&#22336;&#12290;</p>
<p>&#26684;&#24335;&#20026; <i>username</i><code>@</code><i>host</i>.<i>domain</i>&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#35828;&#26126;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#27492;&#37038;&#20214;&#20250;&#35805;&#30340;&#35828;&#26126;&#12290;</p>
</li>
<li>
<p>&#36873;&#25321;&ldquo;&#21551;&#29992;&#29366;&#24577;&rdquo;&#22797;&#36873;&#26694;&#20197;&#21551;&#29992;&#37038;&#20214;&#20250;&#35805;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026;&ldquo;&#24050;&#21551;&#29992;&rdquo;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#23384;&#20648;&#21327;&#35758;&rdquo;&#23383;&#27573;&#20013;&#65292;&#23450;&#20041;&#35201;&#20351;&#29992;&#30340;&#23384;&#20648;&#21327;&#35758;&#26381;&#21153;&#12290;</p>
<p>&#23384;&#20648;&#21327;&#35758;&#26381;&#21153;&#21487;&#20197;&#36830;&#25509;&#21040;&#37038;&#20214;&#26381;&#21153;&#22120;&#12289;&#26816;&#32034;&#37038;&#20214;&#65292;&#20197;&#21450;&#23558;&#37038;&#20214;&#20445;&#23384;&#22312;&#19968;&#20010;&#25110;&#22810;&#20010;&#25991;&#20214;&#22841;&#20013;&#12290;&#20801;&#35768;&#30340;&#20540;&#20026; <code>imap</code>&#12289;<code>pop3</code>&#12289;<code>imaps</code> &#21644; <code>pop3s</code>&#12290;&#40664;&#35748;&#20540;&#20026; <code>imap</code>&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#23384;&#20648;&#21327;&#35758;&#31867;&rdquo;&#23383;&#27573;&#20013;&#65292;&#25351;&#23450;&#29992;&#20110;&#23384;&#20648;&#30340;&#26381;&#21153;&#25552;&#20379;&#26041;&#23454;&#29616;&#31867;&#12290;</p>
<p>&#20801;&#35768;&#30340;&#20540;&#21253;&#25324;&#65306;</p>
<ul>
<li>
<p><code>com.sun.mail.imap.IMAPStore</code></p>
</li>
<li>
<p><code>com.sun.mail.pop3.POP3Store</code></p>
</li>
<li>
<p><code>com.sun.mail.imap.IMAPSSLStore</code></p>
</li>
<li>
<p><code>com.sun.mail.pop3.POP3SSLStore</code></p>
</li>
</ul>
<p>&#40664;&#35748;&#20540;&#20026; <code>com.sun.mail.imap.IMAPStore</code>&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#20256;&#36755;&#21327;&#35758;&rdquo;&#23383;&#27573;&#20013;&#65292;&#25351;&#23450;&#20256;&#36755;&#36890;&#20449;&#26041;&#27861;&#12290;</p>
<p>&#20256;&#36755;&#21327;&#35758;&#26381;&#21153;&#21487;&#20197;&#21457;&#36865;&#37038;&#20214;&#12290;&#20801;&#35768;&#30340;&#20540;&#20026; <code>smtp</code> &#21644; <code>smtps</code>&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#20256;&#36755;&#21327;&#35758;&#20026; <code>smtp</code>&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#20256;&#36755;&#21327;&#35758;&#31867;&rdquo;&#23383;&#27573;&#20013;&#65292;&#25351;&#23450;&#29992;&#20110;&#20256;&#36755;&#30340;&#26381;&#21153;&#25552;&#20379;&#26041;&#23454;&#29616;&#31867;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; <code>com.sun.mail.smtp.SMTPTransport</code>&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#35843;&#35797;&rdquo;&#22797;&#36873;&#26694;&#20197;&#21551;&#29992;&#27492;&#37038;&#20214;&#20250;&#35805;&#30340;&#38468;&#21152;&#35843;&#35797;&#36755;&#20986; (&#21253;&#21547;&#21327;&#35758;&#36319;&#36394;)&#12290;</p>
<p>&#22914;&#26524;&#23558; JavaMail &#26085;&#24535;&#32423;&#21035;&#35774;&#32622;&#20026;<code>&#35814;&#32454;</code>&#25110;&ldquo;&#26356;&#35814;&#32454;&rdquo;&#65292;&#23558;&#29983;&#25104;&#35843;&#35797;&#36755;&#20986;&#65292;&#24182;&#19988;&#27492;&#36755;&#20986;&#23558;&#21253;&#21547;&#22312;&#31995;&#32479;&#26085;&#24535;&#25991;&#20214;&#20013;&#12290;&#26377;&#20851;&#35774;&#32622;&#26085;&#24535;&#32423;&#21035;&#30340;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405;<a href="../../../common/en/help/task-eelogginglevels.html">&#37197;&#32622;&#26085;&#24535;&#32423;&#21035;</a>&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#20854;&#20182;&#23646;&#24615;&rdquo;&#34920;&#20013;&#65292;&#25351;&#23450;&#24212;&#29992;&#31243;&#24207;&#25152;&#38656;&#30340;&#20854;&#20182;&#23646;&#24615;&#65292;&#22914;&#29305;&#23450;&#20110;&#21327;&#35758;&#30340;&#20027;&#26426;&#25110;&#29992;&#25143;&#21517;&#23646;&#24615;&#12290;</p>
<p>&#26377;&#20851;&#21487;&#29992;&#23646;&#24615;&#30340;&#21015;&#34920;&#65292;&#35831;&#21442;&#38405; JavaMail API &#25991;&#26723; (<code><a href="http://java.sun.com/products/javamail/javadocs/index.html">http://java.sun.com/products/javamail/javadocs/index.html</a></code>)&#12290;&#20854;&#20182;&#23646;&#24615;&#24517;&#39035;&#20197; <code>mail-</code> &#24320;&#22836;&#65292;&#24182;&#19988;&#24517;&#39035;&#20351;&#29992;&#36830;&#23383;&#31526; (&#19981;&#33021;&#20351;&#29992;&#21477;&#28857;) &#20316;&#20026;&#20998;&#38548;&#31526;&#12290;&#20363;&#22914;&#65292;<code>mail-debug</code> &#26159;&#27491;&#30830;&#30340;&#65292;&#32780; <code>mail.debug</code> &#26159;&#38169;&#35823;&#30340;&#12290;GlassFish Server &#21518;&#31471;&#20250;&#23558;&#36830;&#23383;&#31526;&#36716;&#25442;&#20026; JavaMail API &#25152;&#38656;&#35201;&#30340;&#21477;&#28857;&#12290;</p>
<p>&#35201;&#28155;&#21152;&#23646;&#24615;&#65292;&#35831;&#21333;&#20987;&ldquo;&#28155;&#21152;&#23646;&#24615;&rdquo;&#25353;&#38062;&#12290;&#22312;&#26174;&#31034;&#30340;&#31354;&#30333;&#34892;&#20013;&#65292;&#22312;&ldquo;&#21517;&#31216;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#23646;&#24615;&#21517;&#31216;&#65292;&#22312;&ldquo;&#20540;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#23646;&#24615;&#20540;&#12290;</p>
</li>
<li>
<p>&#20174;&#21487;&#29992;&#30446;&#26631;&#30340;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&#35201;&#37197;&#32622;&#37038;&#20214;&#20250;&#35805;&#30340;&#19968;&#20010;&#25110;&#22810;&#20010;&#30446;&#26631;&#65292;&#28982;&#21518;&#21333;&#20987;&ldquo;&#28155;&#21152;&rdquo;&#12290;</p>
<p>&#30446;&#26631;&#21487;&#20197;&#26159;&#38598;&#32676;&#25110;&#29420;&#31435;&#26381;&#21153;&#22120;&#23454;&#20363;&#12290;&#22914;&#26524;&#27809;&#26377;&#36873;&#25321;&#20219;&#20309;&#30446;&#26631;&#65292;&#21017;&#20250;&#23558;&#20250;&#35805;&#37197;&#32622;&#20026;&#40664;&#35748;&#30340;&#26381;&#21153;&#22120;&#23454;&#20363; <code>server</code>&#12290;</p>
</li>
<li>
<p>&#21333;&#20987;&ldquo;&#30830;&#23450;&rdquo;&#12290;</p>
</li>
</ol>
<a id="GHJML103" name="GHJML103"></a>
<h5>&#21478;&#35831;&#21442;&#38405;</h5>
<ul>
<li>
<p><a href="task-javamailsessionsedit.html">&#32534;&#36753; JavaMail &#20250;&#35805;</a></p>
</li>
<li>
<p><a href="task-javamailsessionsdelete.html">&#21024;&#38500; JavaMail &#20250;&#35805;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
