<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-javamailsessionsedit" name="task-javamailsessionsedit"></a></p>

<h4><a id="sthref3" name="sthref3"></a>&#32534;&#36753; JavaMail &#20250;&#35805;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#23548;&#33322;&#26641;&#20013;&#65292;&#23637;&#24320;&ldquo;&#36164;&#28304;&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#36164;&#28304;&rdquo;&#33410;&#28857;&#19979;&#65292;&#36873;&#25321;&ldquo;JavaMail &#20250;&#35805;&rdquo;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;JavaMail &#20250;&#35805;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;JavaMail &#20250;&#35805;&rdquo;&#39029;&#19978;&#65292;&#21333;&#20987;&#24744;&#35201;&#32534;&#36753;&#30340;&#20250;&#35805;&#30340;&#21517;&#31216;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#32534;&#36753; JavaMail &#20250;&#35805;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#37038;&#20214;&#20027;&#26426;&rdquo;&#23383;&#27573;&#20013;&#65292;&#25351;&#23450;&#40664;&#35748;&#37038;&#20214;&#26381;&#21153;&#22120;&#30340;&#20027;&#26426;&#21517;&#12290;</p>
<p>&#22914;&#26524;&#26410;&#25552;&#20379;&#29305;&#23450;&#20110;&#21327;&#35758;&#30340;&#20027;&#26426;&#23646;&#24615;&#65292;&#21017; Store &#21644; Transport &#23545;&#35937;&#30340;&#36830;&#25509;&#26041;&#27861;&#20351;&#29992;&#35813;&#20540;&#12290;&#21517;&#31216;&#24517;&#39035;&#21487;&#20197;&#35299;&#26512;&#20026;&#23454;&#38469;&#30340;&#20027;&#26426;&#21517;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#40664;&#35748;&#29992;&#25143;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#36830;&#25509;&#21040;&#37038;&#20214;&#26381;&#21153;&#22120;&#26102;&#35201;&#25552;&#20379;&#30340;&#20854;&#20182;&#29992;&#25143;&#21517;&#12290;</p>
<p>&#22914;&#26524;&#26410;&#25552;&#20379;&#29305;&#23450;&#20110;&#21327;&#35758;&#30340;&#29992;&#25143;&#21517;&#23646;&#24615;&#65292;Store &#21644; Transport &#23545;&#35937;&#30340;&#36830;&#25509;&#26041;&#27861;&#20351;&#29992;&#35813;&#20540;&#12290;&#29992;&#25143;&#21517;&#21482;&#33021;&#21253;&#21547;&#23383;&#27597;&#25968;&#23383;&#12289;&#19979;&#21010;&#32447;&#12289;&#30701;&#21010;&#32447;&#25110;&#28857;&#23383;&#31526;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#40664;&#35748;&#21457;&#20214;&#20154;&#22320;&#22336;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#40664;&#35748;&#29992;&#25143;&#30340;&#30005;&#23376;&#37038;&#20214;&#22320;&#22336;&#12290;</p>
<p>&#26684;&#24335;&#20026; <i>username</i><code>@</code><i>host</i>.<i>domain</i>&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#35828;&#26126;&rdquo;&#23383;&#27573;&#20013;&#65292;&#26356;&#25913;&#37038;&#20214;&#20250;&#35805;&#30340;&#35828;&#26126;&#12290;</p>
</li>
<li>
<p>&#36873;&#25321;&ldquo;&#21551;&#29992;&#29366;&#24577;&rdquo;&#22797;&#36873;&#26694;&#20197;&#21551;&#29992;&#37038;&#20214;&#20250;&#35805;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026;&ldquo;&#24050;&#21551;&#29992;&rdquo;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#23384;&#20648;&#21327;&#35758;&rdquo;&#23383;&#27573;&#20013;&#65292;&#23450;&#20041;&#35201;&#20351;&#29992;&#30340;&#23384;&#20648;&#23545;&#35937;&#36890;&#20449;&#26041;&#27861;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#23384;&#20648;&#21327;&#35758;&#20026; <code>imap</code>&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#23384;&#20648;&#21327;&#35758;&#31867;&rdquo;&#23383;&#27573;&#20013;&#65292;&#25351;&#23450;&#23454;&#29616;&#25152;&#38656;&#23384;&#20648;&#21327;&#35758;&#30340;&#23384;&#20648;&#36890;&#20449;&#26041;&#27861;&#31867;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#23384;&#20648;&#21327;&#35758;&#31867;&#20026; <code>com.sun.mail.imap.IMAPStore</code>&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#20256;&#36755;&#21327;&#35758;&rdquo;&#23383;&#27573;&#20013;&#65292;&#25351;&#23450;&#20256;&#36755;&#36890;&#20449;&#26041;&#27861;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#20256;&#36755;&#21327;&#35758;&#20026; <code>smtp</code>&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#20256;&#36755;&#21327;&#35758;&#31867;&rdquo;&#23383;&#27573;&#20013;&#65292;&#25351;&#23450;&#20256;&#36755;&#31867;&#30340;&#36890;&#20449;&#26041;&#27861;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#20256;&#36755;&#21327;&#35758;&#31867;&#20026; <code>com.sun.mail.smtp.SMTPTransport</code>&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#35843;&#35797;&rdquo;&#22797;&#36873;&#26694;&#20197;&#21551;&#29992;&#27492;&#37038;&#20214;&#20250;&#35805;&#30340;&#38468;&#21152;&#35843;&#35797;&#36755;&#20986; (&#21253;&#21547;&#21327;&#35758;&#36319;&#36394;)&#12290;</p>
<p>&#22914;&#26524;&#23558; JavaMail &#26085;&#24535;&#32423;&#21035;&#35774;&#32622;&#20026;<code>&#35814;&#32454;</code>&#25110;&ldquo;&#26356;&#35814;&#32454;&rdquo;&#65292;&#23558;&#29983;&#25104;&#35843;&#35797;&#36755;&#20986;&#65292;&#24182;&#19988;&#27492;&#36755;&#20986;&#23558;&#21253;&#21547;&#22312;&#31995;&#32479;&#26085;&#24535;&#25991;&#20214;&#20013;&#12290;&#26377;&#20851;&#35774;&#32622;&#26085;&#24535;&#32423;&#21035;&#30340;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405;<a href="../../../common/en/help/task-eelogginglevels.html">&#37197;&#32622;&#26085;&#24535;&#32423;&#21035;</a>&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#20854;&#20182;&#23646;&#24615;&rdquo;&#34920;&#20013;&#65292;&#25351;&#23450;&#24212;&#29992;&#31243;&#24207;&#25152;&#38656;&#30340;&#20854;&#20182;&#23646;&#24615;&#65292;&#22914;&#29305;&#23450;&#20110;&#21327;&#35758;&#30340;&#20027;&#26426;&#25110;&#29992;&#25143;&#21517;&#23646;&#24615;&#12290;</p>
<p>&#26377;&#20851;&#21487;&#29992;&#23646;&#24615;&#30340;&#21015;&#34920;&#65292;&#35831;&#21442;&#38405; JavaMail API &#25991;&#26723; (<code><a href="http://java.sun.com/products/javamail/javadocs/index.html">http://java.sun.com/products/javamail/javadocs/index.html</a></code>)&#12290;&#20854;&#20182;&#23646;&#24615;&#24517;&#39035;&#20197; <code>mail-</code> &#24320;&#22836;&#65292;&#24182;&#19988;&#24517;&#39035;&#20351;&#29992;&#36830;&#23383;&#31526; (&#19981;&#33021;&#20351;&#29992;&#21477;&#28857;) &#20316;&#20026;&#20998;&#38548;&#31526;&#12290;&#20363;&#22914;&#65292;<code>mail-debug</code> &#26159;&#27491;&#30830;&#30340;&#65292;&#32780; <code>mail.debug</code> &#26159;&#38169;&#35823;&#30340;&#12290;GlassFish Server &#21518;&#31471;&#20250;&#23558;&#36830;&#23383;&#31526;&#36716;&#25442;&#20026; JavaMail API &#25152;&#38656;&#35201;&#30340;&#21477;&#28857;&#12290;</p>
<ul>
<li>
<p>&#35201;&#28155;&#21152;&#23646;&#24615;&#65292;&#35831;&#21333;&#20987;&ldquo;&#28155;&#21152;&#23646;&#24615;&rdquo;&#25353;&#38062;&#12290;&#22312;&#26174;&#31034;&#30340;&#31354;&#30333;&#34892;&#20013;&#65292;&#22312;&ldquo;&#21517;&#31216;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#23646;&#24615;&#21517;&#31216;&#65292;&#22312;&ldquo;&#20540;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#23646;&#24615;&#20540;&#12290;</p>
</li>
<li>
<p>&#35201;&#20462;&#25913;&#23646;&#24615;&#65292;&#35831;&#32534;&#36753;&#35813;&#23646;&#24615;&#30340;&ldquo;&#20540;&rdquo;&#23383;&#27573;&#12290;</p>
</li>
<li>
<p>&#35201;&#21024;&#38500;&#23646;&#24615;&#65292;&#35831;&#36873;&#20013;&#20301;&#20110;&#24744;&#35201;&#21024;&#38500;&#23646;&#24615;&#30340;&ldquo;&#21517;&#31216;&rdquo;&#23383;&#27573;&#24038;&#36793;&#30340;&#22797;&#36873;&#26694;&#65292;&#28982;&#21518;&#21333;&#20987;&ldquo;&#21024;&#38500;&#23646;&#24615;&rdquo;&#25353;&#38062;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#21333;&#20987;&ldquo;&#20445;&#23384;&rdquo;&#12290;</p>

<hr>
<p><b>&#25552;&#31034;:</b></p>
&#35201;&#36820;&#22238;&#21040;&#40664;&#35748;&#35774;&#32622;&#65292;&#35831;&#21333;&#20987;&ldquo;&#21152;&#36733;&#40664;&#35748;&#20540;&rdquo;&#25353;&#38062;&#65292;&#28982;&#21518;&#21333;&#20987;&ldquo;&#20445;&#23384;&rdquo;&#12290;<br />
<hr>

</li>
</ol>
<a id="GHJML104" name="GHJML104"></a>
<h5>&#21478;&#35831;&#21442;&#38405;</h5>
<ul>
<li>
<p><a href="task-javamailsessioncreate.html">&#21019;&#24314; JavaMail &#20250;&#35805;</a></p>
</li>
<li>
<p><a href="task-javamailsessionsdelete.html">&#21024;&#38500; JavaMail &#20250;&#35805;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
