<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-ejbgeneral" name="ref-ejbgeneral"></a><a id="GHEJL00001" name="GHEJL00001"></a></p>

<h4><a id="sthref5" name="sthref5"></a><a id="sthref6" name="sthref6"></a>Enterprise Java Beans (EJB)</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Enterprise Java Beans (EJB) permet de configurer les param&egrave;tres du conteneur EJB.</p>
<p>Outre les param&egrave;tres g&eacute;n&eacute;raux des Enterprise Beans, vous pouvez configurer les param&egrave;tres de pool et de cache.</p>
<ul>
<li>
<p>Les param&egrave;tres de pool ne s'appliquent qu'aux beans Session sans conservation de statut. Par d&eacute;faut, le conteneur conserve un pool d'Enterprise Beans afin de r&eacute;pondre aux demandes des clients sans subir la baisse de performances habituellement li&eacute;e &agrave; la cr&eacute;ation des beans.</p>
<p>Si les performances d'une application utilisant des Enterprise Beans d&eacute;ploy&eacute;s sont r&eacute;duites, vous pouvez les am&eacute;liorer en cr&eacute;ant un pool ou en augmentant le nombre de beans g&eacute;r&eacute;s par un pool existant.</p>
</li>
<li>
<p>Les param&egrave;tres de cache ne s'appliquent qu'aux beans Session avec conservation de statut. Le conteneur g&egrave;re un cache des donn&eacute;es des Enterprise Beans les plus utilis&eacute;s. Ce cache permet au conteneur de r&eacute;pondre plus rapidement aux demandes de donn&eacute;es provenant des Enterprise Beans par d'autres modules d'application.</p>
<p>Les Enterprise Beans mis en cache se trouvent dans l'un des trois &eacute;tats suivants : actif, inactif et passiv&eacute;. Un Enterprise Bean actif est un bean auquel des clients acc&egrave;dent actuellement. Les donn&eacute;es d'un Enterprise Bean inactif sont actuellement mises en cache, mais aucun client n'y acc&egrave;de. Les donn&eacute;es d'un bean passiv&eacute; sont stock&eacute;es temporairement et sont remises dans le cache lorsqu'un client demande le bean en question.</p>
</li>
</ul>
<p>La page Enterprise Java Beans (EJB) contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Charger les valeurs par d&eacute;faut</dt>
<dd>
<p>Bouton permettant de restaurer les valeurs par d&eacute;faut des param&egrave;tres qui en ont. Les param&egrave;tres qui n'ont pas de valeurs par d&eacute;faut ne sont pas modifi&eacute;s.</p>
</dd>
<dt>Nom de configuration</dt>
<dd>
<p>Nom de la configuration &agrave; laquelle s'appliquent les param&egrave;tres de cette page. Ce champ est en lecture seule.</p>
</dd>
<dt>Emplacement de stockage des sessions</dt>
<dd>
<p>R&eacute;pertoire du syst&egrave;me de fichiers dans lequel sont stock&eacute;s les beans Session avec conservation de statut passiv&eacute;s et les sessions HTTP persistantes. La valeur par d&eacute;faut est <code>${com.sun.aas.instanceRoot}/session-store</code>.</p>
<p>Les beans passiv&eacute;s sont des beans Session avec conservation de statut dont l'&eacute;tat a &eacute;t&eacute; &eacute;crit dans un fichier du syst&egrave;me. G&eacute;n&eacute;ralement, ces beans sont rest&eacute;s inactifs pendant un certain temps et ne sont pas consult&eacute;s actuellement par les clients. De m&ecirc;me, les sessions HTTP persistantes sont des sessions Web individuelles dont l'&eacute;tat a &eacute;t&eacute; &eacute;crit dans un fichier du syst&egrave;me.</p>
</dd>
<dt>Option de validation</dt>
<dd>
<p>Indique la m&eacute;thode utilis&eacute;e par le conteneur pour mettre en cache les instances de bean passiv&eacute;es entre les transactions. Si vous s&eacute;lectionnez Option B (option par d&eacute;faut), le conteneur met en cache une instance pr&ecirc;te entre les transactions. Si vous s&eacute;lectionnez Option C, le conteneur ne met pas en cache une instance pr&ecirc;te entre les transactions.</p>
</dd>
<dt>Taille initiale et minimale du pool</dt>
<dd>
<p>Nombre minimal de beans &agrave; conserver dans le pool. La valeur par d&eacute;faut est 0.</p>
</dd>
<dt>Taille maximale du pool</dt>
<dd>
<p>Nombre maximal de beans pouvant &ecirc;tre conserv&eacute;s par le conteneur dans le pool &agrave; un moment donn&eacute;. La valeur par d&eacute;faut est 32.</p>
</dd>
<dt>Valeur de redimensionnement du pool</dt>
<dd>
<p>Nombre de beans enlev&eacute;s du pool s'ils sont inactifs pass&eacute;e la dur&eacute;e sp&eacute;cifi&eacute;e dans le champ D&eacute;lai d'inactivit&eacute; du pool. La valeur doit &ecirc;tre comprise entre 0 et la valeur indiqu&eacute;e dans le champ Taille maximale du pool. La valeur par d&eacute;faut est 8.</p>
</dd>
<dt>D&eacute;lai d'inactivit&eacute; du pool</dt>
<dd>
<p>D&eacute;lai, en secondes, au-del&agrave; duquel un bean inactif est enlev&eacute; du pool. Au-del&agrave; de cette p&eacute;riode, le bean est d&eacute;truit. La valeur 0 signifie qu'un bean peut rester inactif pendant une dur&eacute;e ind&eacute;finie. La valeur par d&eacute;faut est 600.</p>
</dd>
<dt>Taille max. du cache</dt>
<dd>
<p>Nombre maximal de beans conserv&eacute;s dans le cache. Augmentez le nombre maximal de beans &agrave; mettre en cache pour &eacute;liminer le temps syst&egrave;me de cr&eacute;ation et de destruction des beans. Cependant, si le cache est augment&eacute;, le serveur consomme une plus grande quantit&eacute; de m&eacute;moire et de ressources. V&eacute;rifiez que votre environnement d'exploitation est suffisant pour vos param&egrave;tres de cache. La valeur 0 indique un cache illimit&eacute;. La valeur par d&eacute;faut est 512.</p>
</dd>
<dt>Valeur de redimensionnement du cache</dt>
<dd>
<p>Nombre de beans &agrave; passiver lorsque le cache est satur&eacute;. Lorsque le nombre maximal de beans mis en cache est atteint, le conteneur enl&egrave;ve un certain nombre de beans passiv&eacute;s dans l'emplacement de stockage de sauvegarde. Cette valeur indique &eacute;galement le nombre de beans &agrave; cr&eacute;er si une demande arrive alors que le pool ne comporte aucun bean disponible. La valeur doit &ecirc;tre sup&eacute;rieure &agrave; 1 et inf&eacute;rieure &agrave; la valeur indiqu&eacute;e dans le champ Taille max. du cache. La valeur par d&eacute;faut est 32.</p>
</dd>
<dt>D&eacute;lai avant suppression</dt>
<dd>
<p>D&eacute;lai, en secondes, au-del&agrave; duquel un bean passiv&eacute; est enlev&eacute; de l'emplacement de stockage des sessions. La valeur 0 indique que le conteneur n'enl&egrave;ve pas les beans inactifs automatiquement. Si la valeur indiqu&eacute;e dans le champ D&eacute;lai avant suppression est inf&eacute;rieure ou &eacute;gale &agrave; la valeur indiqu&eacute;e dans D&eacute;lai d'inactivit&eacute; du cache, les beans sont imm&eacute;diatement enlev&eacute;s sans &ecirc;tre passiv&eacute;s. La valeur par d&eacute;faut est 5 400.</p>
</dd>
<dt>R&egrave;gle de s&eacute;lection pour suppression</dt>
<dd>
<p>R&egrave;gle utilis&eacute;e par le conteneur pour enlever les beans Session avec conservation de statut du cache. Les options sont les suivantes :</p>
<dl>
<dt>Non utilis&eacute; r&eacute;cemment (NRU)</dt>
<dd>
<p>Enl&egrave;ve un bean qui n'a pas &eacute;t&eacute; utilis&eacute; r&eacute;cemment. Il s'agit de la valeur par d&eacute;faut.</p>
</dd>
<dt>Premier entr&eacute;, premier sorti (FIFO)</dt>
<dd>
<p>Enl&egrave;ve le bean le plus ancien du cache.</p>
</dd>
<dt>Utilis&eacute; le moins r&eacute;cemment (LRU)</dt>
<dd>
<p>Enl&egrave;ve le bean le moins r&eacute;cemment consult&eacute;.</p>
</dd>
</dl>
</dd>
<dt>D&eacute;lai d'inactivit&eacute; du cache</dt>
<dd>
<p>Dur&eacute;e maximale, en secondes, pendant laquelle un bean peut rester inactif dans le cache. Pass&eacute; ce d&eacute;lai, le conteneur peut passiver ce bean. La valeur 0 indique que les beans ne peuvent jamais &ecirc;tre passiv&eacute;s. La valeur par d&eacute;faut est 600.</p>
</dd>
<dt>Autres propri&eacute;t&eacute;s</dt>
<dd>
<p>Propri&eacute;t&eacute;s suppl&eacute;mentaires du conteneur EJB.</p>
<p>Pour obtenir une description des propri&eacute;t&eacute;s disponibles, reportez-vous &agrave; <a href="ref-ejbgeneralproperties.html">Propri&eacute;t&eacute;s propres au conteneur EJB</a>.</p>
</dd>
</dl>
<a id="sthref7" name="sthref7"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-ejbgeneral.html">Configuration des param&egrave;tres EJB</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbmdbpoolsettings.html">Configuration des param&egrave;tres de pool MDB</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbtimerservice.html">Configuration du service d'horloge EJB</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbcontaineravailability.html">Configuration des param&egrave;tres de disponibilit&eacute; du conteneur EJB</a></p>
</li>
</ul>
<a id="sthref8" name="sthref8"></a>
<h5>Commandes asadmin connexes</h5>
<p>Aucune.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
