<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-ejbgeneralproperties" name="ref-ejbgeneralproperties"></a></p>

<h4>Propri&eacute;t&eacute;s propres au conteneur EJB</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Les propri&eacute;t&eacute;s suivantes sont disponibles pour la configuration du conteneur EJB. Pour plus d'informations sur les propri&eacute;t&eacute;s associ&eacute;es aux threads, rendez-vous &agrave; l'adresse suivante : <a href="http://docs.oracle.com/javase/6/docs/api/java/util/concurrent/ThreadPoolExecutor.html"><code>http://docs.oracle.com/javase/6/docs/api/java/util/concurrent/ThreadPoolExecutor.html</code></a>.</p>
<dl>
<dt><code>thread-core-pool-size</code></dt>
<dd>
<p>Indique le nombre de threads de serveur de base dans le pool de threads commun du conteneur EJB. La valeur par d&eacute;faut est <code>16</code>.</p>
</dd>
<dt><code>thread-max-pool-size</code></dt>
<dd>
<p>Indique le nombre maximal de threads dans le pool de threads commun du conteneur EJB. La valeur par d&eacute;faut est <code>32</code>.</p>
</dd>
<dt><code>thread-queue-capacity</code></dt>
<dd>
<p>Indique la taille de la file d'attente du pool de threads, qui stocke les nouvelles demandes si le nombre de threads en cours d'ex&eacute;cution d&eacute;passe la valeur d&eacute;finie pour l'&eacute;l&eacute;ment <code>thread-core-pool-size</code>. La valeur par d&eacute;faut est <code>Integer.MAX_VALUE</code>.</p>
</dd>
<dt><code>thread-keep-alive-seconds</code></dt>
<dd>
<p>Indique le d&eacute;lai, en secondes, au-del&agrave; duquel les threads d&eacute;passant la valeur d&eacute;finie pour l'&eacute;l&eacute;ment <code>thread-core-pool-size</code> sont abandonn&eacute;s. La valeur par d&eacute;faut est <code>60</code>.</p>
</dd>
<dt><code>allow-core-thread-timeout</code></dt>
<dd>
<p>Si cet &eacute;l&eacute;ment a la valeur <code>true</code>, tous les threads, y compris les threads de serveur de base, sont abandonn&eacute;s une fois le d&eacute;lai d&eacute;fini pour l'&eacute;l&eacute;ment <code>thread-keep-alive-seconds</code> &eacute;coul&eacute;. La valeur par d&eacute;faut est <code>false</code>.</p>
</dd>
<dt><code>prestart-all-core-threads</code></dt>
<dd>
<p>Si cet &eacute;l&eacute;ment a la valeur <code>true</code>, tous les threads de serveur de base du pool de threads commun du conteneur EJB sont d&eacute;marr&eacute;s et mis en attente. Si cet &eacute;l&eacute;ment a la valeur <code>false</code>, les threads ne sont pas d&eacute;marr&eacute;s avant que de nouvelles demandes arrivent. La valeur par d&eacute;faut est <code>false</code>.</p>
</dd>
<dt><code>disable-nonportable-jndi-names</code></dt>
<dd>
<p>Si la valeur est <code>true</code>, les noms JNDI propres &agrave; GlassFish Server pour un module EJB sont d&eacute;sactiv&eacute;s. La valeur par d&eacute;faut est <code>false</code>.</p>
<p>La sp&eacute;cification EJB 3.1 d&eacute;finissant les noms JNDI EJB portables, les noms JNDI propres &agrave; GlassFish Server n&eacute;cessaires sont moins nombreux. Par d&eacute;faut, les noms JNDI par d&eacute;faut propres &agrave; GlassFish Server sont appliqu&eacute;s automatiquement &agrave; des fins de compatibilit&eacute; descendante.</p>
</dd>
</dl>





<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
