<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-ejbgeneral" name="task-ejbgeneral"></a><a id="GHEJL00002" name="GHEJL00002"></a></p>

<h4><a id="sthref2" name="sthref2"></a><a id="sthref3" name="sthref3"></a>Configuration des param&egrave;tres EJB</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, s&eacute;lectionnez le noeud Configuration.</p>
</li>
<li>
<p>S&eacute;lectionnez le noeud Conteneur EJB.</p>
<p>La page Enterprise Java Beans (EJB) appara&icirc;t.</p>
</li>
<li>
<p>Dans le champ Emplacement de stockage des sessions, entrez une nouvelle valeur pour l'emplacement de stockage des sessions.</p>
<p>Ce champ indique le r&eacute;pertoire du syst&egrave;me de fichiers dans lequel sont stock&eacute;s les beans Session avec conservation de statut passiv&eacute;s et les &eacute;tats de point de reprise SFSB persistants. La valeur par d&eacute;faut est <code>${com.sun.aas.instanceRoot}/session-store</code>.</p>
<p>Les beans passiv&eacute;s sont des beans Session avec conservation de statut dont l'&eacute;tat a &eacute;t&eacute; &eacute;crit dans un fichier du syst&egrave;me. G&eacute;n&eacute;ralement, ces beans sont rest&eacute;s inactifs pendant un certain temps et ne sont pas consult&eacute;s actuellement par les clients. De m&ecirc;me, les &eacute;tats de point de reprise SFSB persistants sont des SFSB individuels dont l'&eacute;tat a &eacute;t&eacute; &eacute;crit dans un fichier du syst&egrave;me.</p>
<p>Ce param&egrave;tre s'applique aux &eacute;tats de point de reprise SFSB uniquement si la disponibilit&eacute; du conteneur EJB est d&eacute;sactiv&eacute;e. Pour d&eacute;sactiver la disponibilit&eacute;, reportez-vous &agrave; <a href="../../../ejb/en/help/task-ejbcontaineravailability.html">Configuration des param&egrave;tres de disponiblit&eacute; du conteneur EJB</a>.</p>
</li>
<li>
<p>S&eacute;lectionnez le bouton radio Option B ou Option C pour d&eacute;finir le champ Option de validation.</p>
<p>Le champ Option de validation indique la m&eacute;thode utilis&eacute;e par le conteneur pour mettre en cache les instances de bean passiv&eacute;es entre les transactions.</p>
<ul>
<li>
<p>Si vous s&eacute;lectionnez Option B (option par d&eacute;faut), le conteneur met en cache une instance pr&ecirc;te entre les transactions.</p>
</li>
<li>
<p>Si vous s&eacute;lectionnez Option C, le conteneur ne met pas en cache une instance pr&ecirc;te entre les transactions.</p>
</li>
</ul>
</li>
<li>
<p>Dans le champ Taille initiale et minimale du pool, indiquez le nombre minimal de beans &agrave; conserver dans le pool.</p>
<p>La valeur par d&eacute;faut est 0.</p>
</li>
<li>
<p>Dans le champ Taille maximale du pool, indiquez le nombre maximal de beans pouvant &ecirc;tre conserv&eacute;s par le conteneur dans le pool &agrave; un moment donn&eacute;.</p>
<p>La valeur par d&eacute;faut est 32.</p>
</li>
<li>
<p>Dans le champ Valeur de redimensionnement du pool, indiquez le nombre de beans &agrave; enlever du pool s'ils sont inactifs pendant une dur&eacute;e sup&eacute;rieure &agrave; celle sp&eacute;cifi&eacute;e dans le champ D&eacute;lai d'inactivit&eacute; du pool.</p>
<p>La valeur doit &ecirc;tre comprise entre 0 et la valeur indiqu&eacute;e dans le champ Taille maximale du pool. La valeur par d&eacute;faut est 8.</p>
</li>
<li>
<p>Dans le champ D&eacute;lai d'inactivit&eacute; du pool, indiquez le d&eacute;lai, en secondes, au-del&agrave; duquel un bean inactif est enlev&eacute; du pool.</p>
<p>Au-del&agrave; de cette p&eacute;riode, le bean est d&eacute;truit. La valeur 0 signifie qu'un bean peut rester inactif pendant une dur&eacute;e ind&eacute;finie. La valeur par d&eacute;faut est 600.</p>
</li>
<li>
<p>Dans le champ Taille max. du cache, indiquez le nombre maximal de beans &agrave; conserver dans le cache.</p>
<p>Augmentez le nombre maximal de beans &agrave; mettre en cache pour &eacute;liminer le temps syst&egrave;me de cr&eacute;ation et de destruction des beans. Cependant, si le cache est augment&eacute;, le serveur consomme une plus grande quantit&eacute; de m&eacute;moire et de ressources. V&eacute;rifiez que votre environnement d'exploitation est suffisant pour vos param&egrave;tres de cache. La valeur 0 indique un cache illimit&eacute;. La valeur par d&eacute;faut est 512.</p>
</li>
<li>
<p>Dans le champ Valeur de redimensionnement du cache, indiquez le nombre de beans &agrave; passiver lorsque le cache est satur&eacute;.</p>
<p>Lorsque le nombre maximal de beans mis en cache est atteint, le conteneur enl&egrave;ve un certain nombre de beans passiv&eacute;s dans l'emplacement de stockage de sauvegarde. Cette valeur indique &eacute;galement le nombre de beans &agrave; cr&eacute;er si une demande arrive alors que le pool ne comporte aucun bean disponible. La valeur doit &ecirc;tre sup&eacute;rieure &agrave; 1 et inf&eacute;rieure &agrave; la valeur indiqu&eacute;e dans le champ Taille max. du cache. La valeur par d&eacute;faut est 32.</p>
</li>
<li>
<p>Dans le champ D&eacute;lai avant suppression, indiquez le d&eacute;lai, en secondes, au-del&agrave; duquel un bean passiv&eacute; est enlev&eacute; de l'emplacement de stockage des sessions.</p>
<p>La valeur 0 indique que le conteneur n'enl&egrave;ve pas les beans inactifs automatiquement. Si la valeur indiqu&eacute;e dans le champ D&eacute;lai avant suppression est inf&eacute;rieure ou &eacute;gale &agrave; la valeur indiqu&eacute;e dans D&eacute;lai d'inactivit&eacute; du cache, les beans sont imm&eacute;diatement enlev&eacute;s sans &ecirc;tre passiv&eacute;s. La valeur par d&eacute;faut est 5 400.</p>
</li>
<li>
<p>Dans la liste d&eacute;roulante R&egrave;gle de s&eacute;lection pour suppression, s&eacute;lectionnez la r&egrave;gle utilis&eacute;e par le conteneur pour enlever les beans Session avec conservation de statut du cache.</p>
<p>Les options sont les suivantes :</p>
<dl>
<dt>Non utilis&eacute; r&eacute;cemment (NRU)</dt>
<dd>
<p>(Valeur par d&eacute;faut) Enl&egrave;ve un bean qui n'a pas &eacute;t&eacute; utilis&eacute; r&eacute;cemment.</p>
</dd>
<dt>Premier entr&eacute;, premier sorti (FIFO)</dt>
<dd>
<p>Enl&egrave;ve le bean le plus ancien du cache.</p>
</dd>
<dt>Utilis&eacute; le moins r&eacute;cemment (LRU)</dt>
<dd>
<p>Enl&egrave;ve le bean le moins r&eacute;cemment consult&eacute;.</p>
</dd>
</dl>
</li>
<li>
<p>Dans le champ D&eacute;lai d'inactivit&eacute; du cache, entrez la dur&eacute;e maximale, en secondes, pendant laquelle un bean peut rester inactif dans le cache.</p>
<p>Pass&eacute; ce d&eacute;lai, le conteneur peut passiver ce bean. La valeur 0 indique que les beans ne peuvent jamais &ecirc;tre passiv&eacute;s. La valeur par d&eacute;faut est 600.</p>
</li>
<li>
<p>Dans la section Autres propri&eacute;t&eacute;s, sp&eacute;cifiez les propri&eacute;t&eacute;s suppl&eacute;mentaires.</p>
<p>Pour obtenir une description des propri&eacute;t&eacute;s disponibles, reportez-vous &agrave; <a href="ref-ejbgeneralproperties.html">Propri&eacute;t&eacute;s propres au conteneur EJB</a>.</p>
<ul>
<li>
<p>Pour ajouter une propri&eacute;t&eacute;, cliquez sur le bouton Ajouter une propri&eacute;t&eacute;. Sur la ligne vide qui appara&icirc;t, saisissez le nom de la propri&eacute;t&eacute; dans le champ Nom et la valeur de la propri&eacute;t&eacute; dans le champ Valeur.</p>
</li>
<li>
<p>Pour modifier une propri&eacute;t&eacute;, modifiez le champ Valeur de cette propri&eacute;t&eacute;.</p>
</li>
<li>
<p>Pour supprimer une propri&eacute;t&eacute;, s&eacute;lectionnez la case situ&eacute;e &agrave; gauche du champ Nom de la propri&eacute;t&eacute; &agrave; supprimer, puis cliquez sur le bouton Supprimer des propri&eacute;t&eacute;s.</p>
</li>
</ul>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>

<hr>
<p><b>Conseil:</b></p>
Pour revenir aux param&egrave;tres par d&eacute;faut, cliquez sur le bouton Charger les valeurs par d&eacute;faut, puis sur Enregistrer.
<hr>

</li>
<li>
<p>Red&eacute;marrez GlassFish Server.</p>
</li>
</ol>
<a id="sthref4" name="sthref4"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="../../../ejb/en/help/task-ejbmdbpoolsettings.html">Configuration des param&egrave;tres de pool MDB</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbtimerservice.html">Configuration du service d'horloge EJB</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbcontaineravailability.html">Configuration des param&egrave;tres de disponibilit&eacute; du conteneur EJB</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
