<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-connectorconnectionpoolnew2" name="ref-connectorconnectionpoolnew2"></a></p>

<h4><a id="sthref72" name="sthref72"></a>Neuer Connector Connection-Pool (Schritt 2 von 2)</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Sie verwenden die Seite "Neuer Connector Connection-Pool (Schritt 2 von 2)" zum Erstellen eines neuen Connector Connection-Pools.</p>
<p>Die Seite "Neuer Connector Connection-Pool (Schritt 2 von 2)" enth&auml;lt die folgenden Optionen.</p>
<dl>
<dt>Ping</dt>
<dd>
<p>Wenn diese Option aktiviert ist, wird bei der Erstellung oder Neukonfiguration eines Connection-Pools automatisch ein Ping-Signal an den Pool gesendet, um falsche Attributwerte zu ermitteln und eine diesbez&uuml;gliche Warnung auszugeben. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>Beschreibung</dt>
<dd>
<p>Eine Beschreibung des Connector Connection-Pools.</p>
</dd>
<dt>Urspr&uuml;ngliche und minimale Poolgr&ouml;&szlig;e</dt>
<dd>
<p>Die Mindestanzahl Verbindungen im Connector Connection-Pool. Der Standardwert ist 8.</p>
</dd>
<dt>Maximale Poolgr&ouml;&szlig;e</dt>
<dd>
<p>Die maximale Anzahl an Verbindungen im Connector Connection-Pool. Der Standardwert ist 32.</p>
</dd>
<dt>Anzahl der Gr&ouml;&szlig;en&auml;nderungen des Pools</dt>
<dd>
<p>Die Anzahl an Verbindungen, die nach Ablauf der Poolleerlaufzeit entfernt werden sollen. Der Standardwert ist 2.</p>
</dd>
<dt>Leerlauftimeout</dt>
<dd>
<p>Die maximale Zeit in Sekunden, die sich eine Verbindung im Pool im Leerlauf befinden kann. Der Standardwert ist 300.</p>
</dd>
<dt>Max. Wartezeit</dt>
<dd>
<p>Die Zeitspanne, die eine Anwendung nach dem Anfordern einer Verbindung abwartet, bevor ein Verbindungstimeout ausgegeben wird. Der Standardwert ist 60000.</p>
</dd>
<dt>Verbindungsvalidierung</dt>
<dd>
<p>Wenn das Kontrollk&auml;stchen "Erforderlich" aktiviert ist, werden Verbindungen vor der &Uuml;bergabe an die Anwendung validiert. Wenn die Validierung einer Ressource nicht erfolgreich verl&auml;uft, wird die Ressource endg&uuml;ltig gel&ouml;scht, und eine neue Ressource wird erstellt und zur&uuml;ckgegeben. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>Bei einem beliebigen Fehler</dt>
<dd>
<p>Wenn das Kontrollk&auml;stchen "Alle Verbindungen trennen" aktiviert ist, schlie&szlig;t GlassFish Server bei einem einzigen Verbindungsabbruch alle Verbindungen im Pool und stellt sie wieder her. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>Transaktionsunterst&uuml;tzung</dt>
<dd>
<p>Die gew&auml;hlte Transaktionsunterst&uuml;tzung &uuml;berschreibt das Transaktionsunterst&uuml;tzungsattribut des mit diesem Connection-Pool verkn&uuml;pften Ressourcenadapters in einer Weise, mit der Abw&auml;rtskompatibilit&auml;t gew&auml;hrleistet wird. Anders ausgedr&uuml;ckt: Es kann dieselbe oder eine niedrigere Transaktionsebene unterst&uuml;tzt werden als die im Ressourcenadapter angegebene, jedoch keine h&ouml;here Transaktionsebene.</p>
<p>Folgende Werte sind m&ouml;glich:</p>
<dl>
<dt>XATransaction</dt>
<dd>
<p>Der Ressourcenadapter unterst&uuml;tzt lokale und JTA-Transaktionen des Ressourcenmanagers durch Implementierung der LocalTransaction- und XAResource-Schnittstellen. XA-Transaktionen werden durch einen externen Transaktionsmanager gesteuert und koordiniert.</p>
</dd>
<dt>LocalTransaction</dt>
<dd>
<p>Der Ressourcenadapter unterst&uuml;tzt lokale Transaktionen durch Implementierung der LocalTransaction-Schnittstelle. Lokale Transaktionen werden intern durch einen Ressourcenmanager verwaltet und beziehen keinen externen Transaktionsmanager ein.</p>
</dd>
<dt>NoTransaction</dt>
<dd>
<p>Der Ressourcenadapter unterst&uuml;tzt lokale oder JTA-Transaktionen des Ressourcenmanagers nicht und implementiert die XAResource- oder LocalTransaction-Schnittstellen nicht.</p>
</dd>
</dl>
</dd>
<dt>Weitere Eigenschaften</dt>
<dd>
<p>Weitere Eigenschaften f&uuml;r den Connector Connection-Pool. Die verf&uuml;gbaren Eigenschaften richten sich nach dem Ressourcenadapter, der von dem Connector Connection-Pool verwendet wird. Mit den in dieser Tabelle angegebenen Name/Werte-Paaren k&ouml;nnen die vom Ressourcenadapterprovider definierten Standardwerte f&uuml;r die Eigenschaften &uuml;berschrieben werden.</p>
<p>Wenn Sie f&uuml;r eine Eigenschaft einen Namen, aber keinen Wert angeben, wird die Eigenschaft nach Abschluss der Erstellung des Connection-Pools aus der Tabelle entfernt. Falls Sie zum jetzigen Zeitpunkt keinen Wert f&uuml;r eine Eigenschaft festlegen m&ouml;chten, die Eigenschaft jedoch in der Tabelle verbleiben soll, damit Sie den Wert sp&auml;ter angeben k&ouml;nnen, geben Sie ein leeres Klammernpaar in das Wertefeld ein:</p>
<pre>
()
</pre></dd>
</dl>
<a id="sthref73" name="sthref73"></a>
<h5>Verwandte Aufgaben</h5>
<ul>
<li>
<p><a href="task-connectorconnectionpoolnew.html">So wird ein Connector Connection-Pool erstellt</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">So wird ein Connector Connection-Pool bearbeitet</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">So werden erweiterte Attribute des Connector Connection-Pools bearbeitet</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">So werden Eigenschaften des Connector Connection-Pools bearbeitet</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">So erstellen Sie eine Sicherheitszuordnung f&uuml;r einen Connector Connection-Pool</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">So wird eine Sicherheitszuordnung f&uuml;r einen Connector Connection-Pool bearbeitet</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">So wird eine Sicherheitszuordnung f&uuml;r einen Connector Connection-Pool gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">So wird ein Connector Connection-Pool gel&ouml;scht</a></p>
</li>
</ul>
<a id="sthref74" name="sthref74"></a>
<h5>Zugeh&ouml;rige asadmin-Befehle</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00018"><code>create-connector-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00157"><code>list-connector-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00070"><code>delete-connector-connection-pool</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
