<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-connectorconnectionpoolnew" name="task-connectorconnectionpoolnew"></a><a id="GHJCA00063" name="GHJCA00063"></a></p>

<h4><a id="sthref9" name="sthref9"></a>So wird ein Connector Connection-Pool erstellt</h4>
<a name="BEGIN" id="BEGIN"></a><a id="sthref10" name="sthref10"></a>
<h5>Bevor Sie beginnen</h5>
<p>Vor dem Erstellen des Pools muss das mit dem Pool verbundene Connector-Modul (Ressourcenadapter) bereitgestellt werden. Die f&uuml;r den neuen Pool angegebenen Werte richten sich nach dem bereitgestellten Connector-Modul.</p>
<ol>
<li>
<p>Blenden Sie in der Navigationsbaumstruktur den Knoten "Ressourcen" ein.</p>
</li>
<li>
<p>Blenden Sie den Knoten "Connector" ein.</p>
</li>
<li>
<p>W&auml;hlen Sie unter dem Knoten "Connector" den Knoten "Connector Connection-Pools".</p>
<p>Die Seite "Connector Connection-Pools" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie auf der Seite "Connector Connection-Pool" auf "Neu".</p>
<p>Die Seite "Neuer Connector Connection-Pool (Schritt 1 von 2)" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Geben Sie im Feld "Poolname" einen eindeutigen Namen f&uuml;r den Pool ein.</p>
<p>Geben Sie diesen Namen an, wenn Sie eine Connector-Ressource erstellen.</p>
</li>
<li>
<p>W&auml;hlen Sie in der Dropdown-Liste "Ressourcenadapter" eine Option aus der Liste der bereitgestellten Ressourcenadapter (Connector-Module).</p>
</li>
<li>
<p>W&auml;hlen Sie in der Dropdown-Liste "Verbindungsdefinition" die Verbindungsdefinition f&uuml;r den Connector Connection-Pool.</p>
<p>Die Auswahloptionen in der Liste richten sich nach dem gew&auml;hlten Ressourcenadapter. Die Verbindungsdefinition gibt das Element <code>connection-definition</code> eines Ressourcenadapters in der Datei <code>ra.xml</code> an.</p>
</li>
<li>
<p>Klicken Sie auf "Weiter".</p>
<p>Die Seite "Neuer Connector Connection-Pool (Schritt 2 von 2)" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Ping", um bei der Erstellung oder Neukonfiguration eines Connection-Pools automatisch ein Ping-Signal an den Pool zu senden, um falsche Attributwerte zu ermitteln und eine diesbez&uuml;gliche Warnung auszugeben.</p>
<p>Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Geben Sie im Feld "Beschreibung" eine Beschreibung des Connection-Pools ein.</p>
</li>
<li>
<p>Geben Sie im Feld "Urspr&uuml;ngliche und minimale Poolgr&ouml;&szlig;e" die Mindestanzahl an Verbindungen im Pool ein.</p>
<p>Der Standardwert ist 8.</p>
</li>
<li>
<p>Geben Sie im Feld "Maximale Poolgr&ouml;&szlig;e" die maximale Anzahl an Verbindungen im Pool ein.</p>
<p>Der Standardwert ist 32.</p>
</li>
<li>
<p>Geben Sie im Feld "Umfang der Gr&ouml;&szlig;en&auml;nderungen des Pools" die Anzahl an Verbindungen ein, die nach Ablauf der Pool-Leerlaufzeit entfernt werden sollen.</p>
<p>Der Standardwert ist 2.</p>
</li>
<li>
<p>Geben Sie im Feld "Leerlauftimeout" die maximale Dauer (in Sekunden) an, die eine Verbindung im Leerlauf im Pool verbleiben kann.</p>
<p>Der Standardwert ist 300.</p>
</li>
<li>
<p>Geben Sie im Feld "Maximale Wartezeit" die maximale Zeitspanne an, die eine Anwendung nach dem Anfordern einer Verbindung wartet, bevor ein Verbindungstimeout ausgegeben wird.</p>
<p>Der Standardwert ist 60000.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Verbindungs&uuml;berpr&uuml;fung erforderlich", um die Verbindungs&uuml;berpr&uuml;fung zu aktivieren.</p>
<p>Wenn das Kontrollk&auml;stchen "Erforderlich" aktiviert ist, werden Verbindungen vor der &Uuml;bergabe an die Anwendung validiert. Wenn die Validierung einer Ressource nicht erfolgreich verl&auml;uft, wird die Ressource endg&uuml;ltig gel&ouml;scht, und eine neue Ressource wird erstellt und zur&uuml;ckgegeben. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Aktivieren Sie f&uuml;r "Bei Fehlern" das Kontrollk&auml;stchen "S&auml;mtliche Verbindungen trennen", damit GlassFish Server bei einem einzigen Verbindungsabbruch alle Verbindungen im Pool schlie&szlig;t und anschlie&szlig;end wiederherstellt.</p>
<p>Wenn Sie dieses Kontrollk&auml;stchen nicht aktivieren, werden einzelne Verbindungen nur neu aufgebaut, wenn sie verwendet werden. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>W&auml;hlen Sie in der Liste "Transaktionsunterst&uuml;tzung" die gew&uuml;nschte Art der Transaktionsunterst&uuml;tzung f&uuml;r den Connection-Pool.</p>
<p>Die gew&auml;hlte Transaktionsunterst&uuml;tzung &uuml;berschreibt das Transaktionsunterst&uuml;tzungsattribut des mit diesem Connection-Pool verkn&uuml;pften Ressourcenadapters in einer Weise, mit der Abw&auml;rtskompatibilit&auml;t gew&auml;hrleistet wird. Anders ausgedr&uuml;ckt: Es kann dieselbe oder eine niedrigere Transaktionsebene unterst&uuml;tzt werden als die im Ressourcenadapter angegebene, jedoch keine h&ouml;here Transaktionsebene.</p>
<p>Die folgenden Optionen stehen in der Dropdown-Liste zur Verf&uuml;gung:</p>
<ul>
<li>
<p>NoTransaction: Der Ressourcenadapter unterst&uuml;tzt keine lokalen oder JTA-Transaktionen des Ressourcenmanagers und implementiert die Schnittstellen XAResource und LocalTransaction nicht.</p>
</li>
<li>
<p>LocalTransaction: Der Ressourcenadapter unterst&uuml;tzt lokale Transaktionen durch Implementierung der Schnittstelle "LocalTransaction".</p>
<p>Lokale Transaktionen werden intern durch einen Ressourcenmanager verwaltet und beziehen keinen externen Transaktionsmanager ein.</p>
</li>
<li>
<p>XATransaction: Der Ressourcenadapter unterst&uuml;tzt lokale und JTA-Transaktionen des Ressourcenmanangers durch Implementierung der Schnittstellen "LocalTransaction" und "XAResource".</p>
<p>XA-Transaktionen werden durch einen externen Transaktionsmanager gesteuert und koordiniert.</p>
</li>
</ul>
</li>
<li>
<p>Geben Sie im Abschnitt "Weitere Eigenschaften" zus&auml;tzliche Eigenschaften f&uuml;r den Connector Connection-Pool an.</p>
<p>Die verf&uuml;gbaren Eigenschaften richten sich nach dem Ressourcenadapter, der von dem Connector Connection-Pool verwendet wird.</p>
<p>Um eine Eigenschaft hinzuzuf&uuml;gen, klicken Sie auf die Schaltfl&auml;che "Eigenschaft hinzuf&uuml;gen". Geben Sie in die daraufhin angezeigte leere Zeile den Eigenschaftsnamen in das Feld "Name" und den Eigenschaftswert in das Feld "Wert" ein.</p>
<p>Wenn Sie f&uuml;r eine Eigenschaft einen Namen, aber keinen Wert angeben, wird die Eigenschaft nach Abschluss der Erstellung des Connection-Pools aus der Tabelle entfernt. Falls Sie zum jetzigen Zeitpunkt keinen Wert f&uuml;r eine Eigenschaft festlegen m&ouml;chten, die Eigenschaft jedoch in der Tabelle verbleiben soll, damit Sie den Wert sp&auml;ter angeben k&ouml;nnen, geben Sie ein leeres Klammernpaar in das Wertefeld ein:</p>
<pre>
()
</pre></li>
<li>
<p>Klicken Sie auf "OK".</p>
</li>
</ol>
<a id="sthref11" name="sthref11"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-connectorresourcenew.html">So wird eine Connector-Ressource erstellt</a></p>
</li>
<li>
<p><a href="task-connectorresourceedit.html">So wird eine Connector-Ressource bearbeitet</a></p>
</li>
<li>
<p><a href="task-connectorresourcesdelete.html">So wird eine Connector-Ressource gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">So wird ein Connector Connection-Pool bearbeitet</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">So werden erweiterte Attribute des Connector Connection-Pools bearbeitet</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">So werden Eigenschaften des Connector Connection-Pools bearbeitet</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">So erstellen Sie eine Sicherheitszuordnung f&uuml;r einen Connector Connection-Pool</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">So wird eine Sicherheitszuordnung f&uuml;r einen Connector Connection-Pool bearbeitet</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">So wird eine Sicherheitszuordnung f&uuml;r einen Connector Connection-Pool gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">So wird ein Connector Connection-Pool gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-setupeisaccess.html">So wird der EIS-Zugriff eingerichtet</a></p>
</li>
<li>
<p><a href="task-adminobjectnew.html">So wird eine verwaltete Objektressource erstellt</a></p>
</li>
<li>
<p><a href="task-adminobjectedit.html">So wird eine verwaltete Objektressource bearbeitet</a></p>
</li>
<li>
<p><a href="task-administeredobjectresourcedelete.html">So wird eine verwaltete Objektressource gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-worksecuritymapnew.html">So wird eine Arbeitssicherheitszuordnung erstellt</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">So wird eine Arbeitssicherheitszuordnung bearbeitet</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">So wird eine Arbeitssicherheitszuordnung gel&ouml;scht</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
