<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-connectorconnectionpooladvance" name="task-connectorconnectionpooladvance"></a></p>

<h4><a id="sthref14" name="sthref14"></a>So werden erweiterte Attribute des Connector Connection-Pools bearbeitet</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Blenden Sie in der Navigationsbaumstruktur den Knoten "Ressourcen" ein.</p>
</li>
<li>
<p>Blenden Sie den Knoten "Connector" ein.</p>
</li>
<li>
<p>W&auml;hlen Sie unter dem Knoten "Connector" den Knoten "Connector Connection-Pools".</p>
<p>Die Seite "Connector Connection-Pools" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie auf der Seite "Connector Connection-Pools" auf den Namen des zu bearbeitenden Connector Connection-Pools.</p>
<p>Die Seite "Connector Connection-Pool bearbeiten" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie auf der Seite "Connector Connection-Pool bearbeiten" auf die Registerkarte "Erweitert".</p>
<p>Die Seite "Erweiterte Attribute des Connector Connection-Pools bearbeiten" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Geben Sie in das Feld "H&ouml;chstens einmal &uuml;berpr&uuml;fen" die Dauer (in Sekunden) ein, nach der eine Verbindung h&ouml;chstens einmal &uuml;berpr&uuml;ft wird.</p>
<p>Wenn Sie dieses Attribut auf einen angemessenen Wert setzen, wird die Anzahl der von einer Verbindung ausgegebenen Validierungsanforderungen minimiert. Der Standardwert ist 0, d.h. das Attribut ist nicht aktiviert.</p>
</li>
<li>
<p>Geben Sie in das Feld "Lecktimeout" die Dauer (in Sekunden) ein, die zum Ermitteln von Verbindungslecks in einem Connection-Pool erforderlich ist.</p>
<p>Der Wert 0 bedeutet, dass die Verfolgung von Verbindungslecks deaktiviert ist. Der Standardwert ist 0.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Leck zur&uuml;ckfordern", um Verbindungen mit Leck im Pool wiederherzustellen, wenn die Verfolgung von Verbindungslecks abgeschlossen ist.</p>
<p>Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Geben Sie in das Feld "Erstellungswiederholungsversuche" die Anzahl der Versuche ein, die bei Fehlern zum Herstellen einer Verbindung unternommen werden.</p>
<p>Der Wert 0 bedeutet, dass keine Neuversuche zur Verbindungserstellung unternommen werden. Der Standardwert ist 0.</p>
</li>
<li>
<p>Geben Sie in das Feld "Wiederholungsintervall" das Intervall in Sekunden zwischen zwei Verbindungsversuchen ein.</p>
<p>Dieses Attribut wird nur verwendet, wenn der Wert von "Erstellungswiederholungsversuche" gr&ouml;&szlig;er als 0 ist. Der Standardwert ist 10 Sekunden.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Pooling", um das Connection Pooling f&uuml;r den Pool zu aktivieren.</p>
<p>Diese Option ist standardm&auml;&szlig;ig aktiviert.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Verz&ouml;gerte Verkn&uuml;pfung", damit Verbindungen verz&ouml;gert verkn&uuml;pft werden, wenn ein Vorgang f&uuml;r sie durchgef&uuml;hrt wird.</p>
<p>Die Verkn&uuml;pfung wird wieder aufgehoben, wenn die Transaktion abgeschlossen ist und eine Komponentenmethode beendet wird. Auf diese Weise wird die Wiederverwendung der physischen Verbindungen vereinfacht. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Eintragung verz&ouml;gerter Verbindungen", um eine Ressource f&uuml;r die Transaktion nur dann einzutragen, wenn sie tats&auml;chlich in einer Methode verwendet wird.</p>
<p>Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Mit Thread verkn&uuml;pfen", um eine Verbindung mit einem Thread zu verkn&uuml;pfen.</p>
<p>Wenn derselbe Thread eine Verbindung ben&ouml;tigt, kann er die bereits mit diesem Thread verkn&uuml;pfte Verbindung wiederverwenden, wodurch die zus&auml;tzliche Belastung durch das Abrufen einer Verbindung aus dem Pool vermieden wird. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Verbindungen abgleichen", um den Verbindungsabgleich f&uuml;r den Pool zu aktivieren.</p>
<p>Deaktivieren Sie diese Option, wenn Sie wissen, dass die Verbindungen im Pool immer homogen sind und eine aus dem Pool abgerufene Verbindung daher nicht vom Ressourcenadapter abgeglichen werden muss. Diese Option ist standardm&auml;&szlig;ig aktiviert.</p>
</li>
<li>
<p>Geben Sie im Feld "Max. Verbindungsnutzung" ein, wie h&auml;ufig eine Verbindung durch den Pool wiederverwendet werden soll.</p>
<p>Nachdem eine Verbindung so h&auml;ufig wie angegeben wiederverwendet wurde, wird sie geschlossen. Der Wert 0 bedeutet, dass dieses Attribut deaktiviert ist. Der Standardwert ist 0.</p>
</li>
<li>
<p>Klicken Sie auf "Speichern".</p>

<hr>
<p><b>Tipp:</b></p>
Um zu den Standardeinstellungen zur&uuml;ckzukehren, klicken Sie auf die Schaltfl&auml;che "Standardwerte laden" und anschlie&szlig;end auf "Speichern".
<hr>

</li>
</ol>
<a id="sthref15" name="sthref15"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-connectorresourcenew.html">So wird eine Connector-Ressource erstellt</a></p>
</li>
<li>
<p><a href="task-connectorresourceedit.html">So wird eine Connector-Ressource bearbeitet</a></p>
</li>
<li>
<p><a href="task-connectorresourcesdelete.html">So wird eine Connector-Ressource gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolnew.html">So wird ein Connector Connection-Pool erstellt</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">So wird ein Connector Connection-Pool bearbeitet</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">So werden Eigenschaften des Connector Connection-Pools bearbeitet</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">So erstellen Sie eine Sicherheitszuordnung f&uuml;r einen Connector Connection-Pool</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">So wird eine Sicherheitszuordnung f&uuml;r einen Connector Connection-Pool bearbeitet</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">So wird eine Sicherheitszuordnung f&uuml;r einen Connector Connection-Pool gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">So wird ein Connector Connection-Pool gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-setupeisaccess.html">So wird der EIS-Zugriff eingerichtet</a></p>
</li>
<li>
<p><a href="task-adminobjectnew.html">So wird eine verwaltete Objektressource erstellt</a></p>
</li>
<li>
<p><a href="task-adminobjectedit.html">So wird eine verwaltete Objektressource bearbeitet</a></p>
</li>
<li>
<p><a href="task-administeredobjectresourcedelete.html">So wird eine verwaltete Objektressource gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-worksecuritymapnew.html">So wird eine Arbeitssicherheitszuordnung erstellt</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">So wird eine Arbeitssicherheitszuordnung bearbeitet</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">So wird eine Arbeitssicherheitszuordnung gel&ouml;scht</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
