<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-connectorconnectionpooladvance" name="ref-connectorconnectionpooladvance"></a></p>

<h4><a id="sthref78" name="sthref78"></a>Modifica attributi avanzati del connection pool connettore</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilizzare la pagina Modifica attributi avanzati del connection pool connettore per modificare le impostazioni avanzate per un connection pool del connettore.</p>
<p>La pagina Modifica attributi avanzati del connection pool connettore contiene le opzioni riportate di seguito.</p>
<dl>
<dt>Carica impostazioni predefinite</dt>
<dd>
<p>Pulsante per ripristinare i valori predefiniti delle impostazioni che dispongono di valori predefiniti. Le impostazioni che non dispongono di valori predefiniti non vengono modificate.</p>
</dd>
<dt>Convalida al massimo una volta</dt>
<dd>
<p>Specifica l'intervallo di tempo, in secondi, tra le richieste successive per convalidare una connessione al massimo una volta. Il valore predefinito &egrave; 0, che indica che l'attributo non &egrave; abilitato.</p>
</dd>
<dt>Timeout perdite</dt>
<dd>
<p>Il periodo di tempo, in secondi, necessario per eseguire il trace delle perdite di connessione in un connection pool. Il valore 0 indica che il trace delle perdite di connessione &egrave; disabilitato. Il valore predefinito &egrave; 0.</p>
</dd>
<dt>Recupero perdite</dt>
<dd>
<p>Se questa opzione &egrave; selezionata, le connessioni perse verranno ripristinate nel pool al termine del trace delle perdite di connessione. Questa opzione &egrave; disabilitata per impostazione predefinita.</p>
</dd>
<dt>Numero di nuovi tentativi di creazione</dt>
<dd>
<p>Il numero di tentativi che verranno eseguiti in caso di errore durante la creazione di una nuova connessione. Il valore 0 indica che non verranno effettuati tentativi per ricreare la connessione. Il valore predefinito &egrave; 0.</p>
</dd>
<dt>Intervallo tentativi</dt>
<dd>
<p>L'intervallo, in secondi, tra due tentativi di creazione di una connessione. Questo attributo viene utilizzato solo se il valore Numero di nuovi tentativi di creazione &egrave; maggiore di 0. Il valore predefinito &egrave; 10 secondi.</p>
</dd>
<dt>Pooling</dt>
<dd>
<p>Abilita il connection pooling per il pool. Questa opzione &egrave; abilitata per impostazione predefinita.</p>
</dd>
<dt>Associazione ritardata</dt>
<dd>
<p>Se questa opzione &egrave; selezionata, le connessioni verranno associate in modo ritardato quando vi si esegue un'operazione. Le connessioni vengono disassociate quando la transazione &egrave; completa e viene terminato un metodo del componente. In tal modo il riutilizzo delle connessioni fisiche risulta pi&ugrave; agevole. Questa opzione &egrave; disabilitata per impostazione predefinita.</p>
</dd>
<dt>Partecipazione alla transazione connessioni ritardate</dt>
<dd>
<p>Se questa opzione &egrave; selezionata, una risorsa viene integrata nella transazione solo quando &egrave; effettivamente utilizzata in un metodo. Questa opzione &egrave; disabilitata per impostazione predefinita.</p>
</dd>
<dt>Associa a thread</dt>
<dd>
<p>Se questa opzione &egrave; selezionata, una connessione viene associata a un thread. Quando lo stesso thread necessita di una connessione, pu&ograve; riutilizzare la connessione gi&agrave; associata, senza provocare il sovraccarico dovuto alla necessit&agrave; di ottenere una connessione dal pool. Questa opzione &egrave; disabilitata per impostazione predefinita.</p>
</dd>
<dt>Corrispondenza connessioni</dt>
<dd>
<p>Se questa opzione &egrave; selezionata, la corrispondenza delle connessioni &egrave; abilitata per il pool. &Egrave; possibile disabilitare questa opzione se si sa che le connessioni nel pool saranno sempre omogenee e che quindi non &egrave; necessario che una connessione selezionata dal pool debba essere abbinata dal Resource Adapter. Questa opzione &egrave; abilitata per impostazione predefinita.</p>
</dd>
<dt>Utilizzo max connessioni</dt>
<dd>
<p>Il numero di volte in cui una connessione deve essere riutilizzata dal pool. Dopo essere stata riutilizzata per il numero di volte specificato, la connessione viene chiusa. Il valore 0 indica che questo attributo non &egrave; abilitato. Il valore predefinito &egrave; 0.</p>
</dd>
</dl>
<a id="sthref79" name="sthref79"></a>
<h5>Task correlati</h5>
<ul>
<li>
<p><a href="task-connectorconnectionpoolnew.html">Per creare un connection pool del connettore</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">Per modificare un connection pool del connettore</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">Per modificare gli attributi avanzati del connection pool connettore</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">Per modifica le propriet&agrave; del connection pool connettore</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">Per creare una mappa di sicurezza per un connection pool connettore</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">Per modificare una mappa di sicurezza per un connection pool connettore</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">Per eliminare una mappa di sicurezza per un connection pool connettore</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">Per eliminare un connection pool connettore</a></p>
</li>
</ul>
<a id="sthref80" name="sthref80"></a>
<h5>Comandi asadmin correlati</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00018"><code>create-connector-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00157"><code>list-connector-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00070"><code>delete-connector-connection-pool</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
