<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-connectorconnectionpoolproperty" name="task-connectorconnectionpoolproperty"></a></p>

<h4><a id="sthref16" name="sthref16"></a><a id="sthref17" name="sthref17"></a>Per modifica le propriet&agrave; del connection pool connettore</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Espandere il nodo Risorse nell'albero di navigazione.</p>
</li>
<li>
<p>Espandere il nodo Connettori.</p>
</li>
<li>
<p>Nel nodo Connettori selezionare il nodo Connection pool connettore.</p>
<p>Viene visualizzata la pagina Connection pool connettore.</p>
</li>
<li>
<p>Nella pagina Connection pool connettore fare clic sul nome del connection pool del connettore da modificare.</p>
<p>Viene visualizzata la pagina Modifica connection pool connettore.</p>
</li>
<li>
<p>Nella pagina Modifica connection pool connettore fare clic sulla scheda Propriet&agrave; aggiuntive.</p>
<p>Viene visualizzata la pagina Modifica propriet&agrave; connection pool connettore.</p>
</li>
<li>
<p>Nella tabella Propriet&agrave; aggiuntive specificare le propriet&agrave; aggiuntive per il connection pool del connettore.</p>
<p>Le propriet&agrave; specificate dipendono dal Resource Adapter utilizzato dal pool. Le coppie nome-valore specificate dall'utente mediante questa tabella possono essere utilizzate per sostituire i valori predefiniti per le propriet&agrave; specificate dal fornitore del Resource Adapter.</p>
<p>Se non si specifica un valore per una propriet&agrave;, la propriet&agrave; interessata verr&agrave; rimossa dalla tabella al termine della modifica del connection pool. Se non si desidera impostare il valore di una propriet&agrave; in questa fase, conservando tuttavia la propriet&agrave; nella tabella in modo da impostarne il valore in un secondo momento, digitare un set di parentesi vuote nel campo Valore:</p>
<pre>
()
</pre>
<ul>
<li>
<p>Per aggiungere una propriet&agrave;, fare clic sul pulsante Aggiungi propriet&agrave;. Nella riga vuota visualizzata, digitare il nome della propriet&agrave; nel campo Nome e il valore della propriet&agrave; nel campo Valore.</p>
</li>
<li>
<p>Per modificare una propriet&agrave;, &egrave; necessario modificare il valore del campo Valore della propriet&agrave;.</p>
</li>
<li>
<p>Per eliminare una propriet&agrave;, selezionare la casella di controllo a sinistra del campo Nome corrispondente alla propriet&agrave; da eliminare, quindi fare clic sul pulsante Elimina propriet&agrave;.</p>
</li>
</ul>
</li>
<li>
<p>Fare clic su Salva.</p>
</li>
</ol>
<a id="sthref18" name="sthref18"></a>
<h5>Vedere anche</h5>
<ul>
<li>
<p><a href="task-connectorresourcenew.html">Per creare una risorsa connettore</a></p>
</li>
<li>
<p><a href="task-connectorresourceedit.html">Per modificare una risorsa connettore</a></p>
</li>
<li>
<p><a href="task-connectorresourcesdelete.html">Per eliminare una risorsa connettore</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolnew.html">Per creare un connection pool del connettore</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">Per modificare un connection pool del connettore</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">Per modificare gli attributi avanzati del connection pool connettore</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">Per creare una mappa di sicurezza per un connection pool connettore</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">Per modificare una mappa di sicurezza per un connection pool connettore</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">Per eliminare una mappa di sicurezza per un connection pool connettore</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">Per eliminare un connection pool connettore</a></p>
</li>
<li>
<p><a href="task-setupeisaccess.html">Per impostare l'accesso a un sistema EIS</a></p>
</li>
<li>
<p><a href="task-adminobjectnew.html">Per creare una risorsa oggetto amministrato</a></p>
</li>
<li>
<p><a href="task-adminobjectedit.html">Per modificare una risorsa oggetto amministrato</a></p>
</li>
<li>
<p><a href="task-administeredobjectresourcedelete.html">Per eliminare una risorsa oggetto amministrato</a></p>
</li>
<li>
<p><a href="task-worksecuritymapnew.html">Per creare una mappa di sicurezza lavoro</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">Per modificare una mappa di sicurezza lavoro</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">Per eliminare una mappa di sicurezza lavoro</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
