<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-connectorconnectionpoolproperty" name="ref-connectorconnectionpoolproperty"></a></p>

<h4><a id="sthref81" name="sthref81"></a><a id="sthref82" name="sthref82"></a>Editar Propriedades do Pool de Conex&otilde;es do Conector</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Editar Propriedades do Pool de Conex&otilde;es do Conector para modificar as propriedades do pool de conex&otilde;es de um conector.</p>
<p>A p&aacute;gina Editar Propriedades do Pool de Conex&otilde;es do Conector cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Propriedades Adicionais</dt>
<dd>
<p>Propriedades adicionais do pool de conex&otilde;es do conector. As propriedades dispon&iacute;veis dependem do adaptador de recursos para o pool de conex&otilde;es do conector. Os pares de nome e valor especificados nessa tabela podem ser usados para substituir os valores default definidos pelo fornecedor do adaptador de recurso.</p>
<p>Se voc&ecirc; n&atilde;o especificar um valor para uma propriedade, ela ser&aacute; removida da tabela quando voc&ecirc; finalizar a edi&ccedil;&atilde;o do pool de conex&otilde;es. Caso n&atilde;o deseje definir agora um valor para uma propriedade, mas deseja que a propriedade permane&ccedil;a na tabela, para que o valor possa ser definido em outro momento, digite um conjunto de par&ecirc;nteses vazios no campo Valor:</p>
<pre>
()
</pre></dd>
</dl>
<a id="sthref83" name="sthref83"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-connectorconnectionpoolnew.html">Para Criar um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">Para Editar um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">Editar Atributos Avan&ccedil;ados do Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">Para Editar Propriedades do Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">Para Criar um Mapa de Seguran&ccedil;a para um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">Para Editar um Mapa de Seguran&ccedil;a de um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">Para Deletar um Mapa de Seguran&ccedil;a de um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">Para Deletar um Pool de Conex&otilde;es do Conector</a></p>
</li>
</ul>
<a id="sthref84" name="sthref84"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00018"><code>create-connector-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00157"><code>list-connector-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00070"><code>delete-connector-connection-pool</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
