<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-connectorconnectionpooledit" name="ref-connectorconnectionpooledit"></a><a id="GHJCA00044" name="GHJCA00044"></a></p>

<h4><a id="sthref71" name="sthref71"></a>Editar Pool de Conex&otilde;es do Conector</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Editar Pool de Conex&otilde;es do Conector para modificar as defini&ccedil;&otilde;es do pool de conex&otilde;es do conector.</p>
<p>A p&aacute;gina Editar Pool de Conex&otilde;es do Conector cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Carregar Defaults</dt>
<dd>
<p>Bot&atilde;o para restaurar defini&ccedil;&otilde;es para seus valores default. Defini&ccedil;&otilde;es que n&atilde;o tiveram seus valores default alterados.</p>
</dd>
<dt>Esvaziar</dt>
<dd>
<p>Bot&atilde;o para reinicializar as conex&otilde;es no pool de conex&otilde;es. Clicar nesse bot&atilde;o destr&oacute;i quaisquer conex&otilde;es existentes, recria as conex&otilde;es estabelecidas para o pool e restaura o pool para seu tamanho inicial e m&iacute;nimo.</p>
</dd>
<dt>Ping</dt>
<dd>
<p>Bot&atilde;o utilizado para verificar se o pool de conex&otilde;es &eacute; utiliz&aacute;vel.</p>
</dd>
<dt>Nome do Pool</dt>
<dd>
<p>Um nome exclusivo que identifica o pool de conex&otilde;es do conector. Este &eacute; um campo somente para leitura. Voc&ecirc; s&oacute; pode especificar o nome do pool ao criar um novo pool de conex&otilde;es do conector.</p>
</dd>
<dt>Adaptador do Recurso</dt>
<dd>
<p>O adaptador do recurso associado ao pool de conex&otilde;es do conector.</p>
</dd>
<dt>Defini&ccedil;&atilde;o da Conex&atilde;o</dt>
<dd>
<p>A defini&ccedil;&atilde;o da conex&atilde;o para o pool de conex&otilde;es do conector. As escolhas na lista dependem do adaptador de recurso selecionado. A defini&ccedil;&atilde;o da conex&atilde;o identifica um elemento <code>connection-definition</code> do adaptador de recurso no arquivo <code>ra.xml</code>.</p>
</dd>
<dt>Ping</dt>
<dd>
<p>Se essa op&ccedil;&atilde;o for selecionada, ser&aacute; efetuado o ping autom&aacute;tico no pool de conex&otilde;es durante a cria&ccedil;&atilde;o ou reconfigura&ccedil;&atilde;o, para identificar e avisar sobre valores de atributos com erros. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Descri&ccedil;&atilde;o</dt>
<dd>
<p>Uma descri&ccedil;&atilde;o do pool de conex&otilde;es do conector.</p>
</dd>
<dt>Tamanho Inicial e M&iacute;nimo do Pool</dt>
<dd>
<p>O n&uacute;mero m&iacute;nimo de conex&otilde;es no pool de conex&otilde;es do conector. O valor default &eacute; 8.</p>
</dd>
<dt>Tamanho M&aacute;ximo do Pool</dt>
<dd>
<p>O n&uacute;mero m&aacute;ximo de conex&otilde;es no pool de conex&otilde;es do conector. O valor default &eacute; 32.</p>
</dd>
<dt>Quantidade de Redimensionamento do Pool</dt>
<dd>
<p>O n&uacute;mero de conex&otilde;es a serem removidas quando o time-out para inatividade do pool expirar. O valor default &eacute; 2.</p>
</dd>
<dt>Time-out para Ociosidade</dt>
<dd>
<p>A quantidade m&aacute;xima de tempo, em segundos, que uma conex&atilde;o pode permanecer inativa no pool. O valor default &eacute; 300.</p>
</dd>
<dt>Tempo M&aacute;ximo de Espera</dt>
<dd>
<p>O tempo que a aplica&ccedil;&atilde;o solicitante de uma conex&atilde;o aguardar&aacute; at&eacute; obter um time-out. O valor default &eacute; 60000.</p>
</dd>
<dt>Valida&ccedil;&atilde;o da Conex&atilde;o</dt>
<dd>
<p>Se a caixa de sele&ccedil;&atilde;o Obrigat&oacute;rio estiver marcada, as conex&otilde;es ser&atilde;o validadas antes de serem enviadas &agrave; aplica&ccedil;&atilde;o. Se uma valida&ccedil;&atilde;o de recurso falhar, ela ser&aacute; destru&iacute;da e um novo recurso ser&aacute; criado e retornado. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Em Caso de Falha</dt>
<dd>
<p>Se a caixa de sele&ccedil;&atilde;o Fechar Todas as Conex&otilde;es estiver marcada, o GlassFish Server fechar&aacute; todas as conex&otilde;es no pool e as restabelecer&aacute; se uma &uacute;nica conex&atilde;o falhar. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Suporte &agrave; Transa&ccedil;&atilde;o</dt>
<dd>
<p>O suporte &agrave; transa&ccedil;&atilde;o escolhido substitui o atributo do suporte de transa&ccedil;&atilde;o no adaptador de recursos associado a esse pool de conex&otilde;es de uma forma compat&iacute;vel com descend&ecirc;ncia. Em outras palavras, pode dar suporte a um n&iacute;vel de transa&ccedil;&atilde;o mais baixo do que o especificado no adaptador de recurso, ou ao mesmo n&iacute;vel de transa&ccedil;&atilde;o especificado no adaptador de recurso, mas n&atilde;o pode especificar um n&iacute;vel mais alto.</p>
<p>O valor pode ser um dos seguintes:</p>
<dl>
<dt>XATransaction</dt>
<dd>
<p>O adaptador de recursos suporta transa&ccedil;&otilde;es locais e de JTA do gerenciador de recursos implementando interfaces de LocalTransaction e XAResource. As transa&ccedil;&otilde;es XA s&atilde;o controladas e coordenadas por um gerenciador de transa&ccedil;&otilde;es externo ao gerenciador de recursos.</p>
</dd>
<dt>LocalTransaction</dt>
<dd>
<p>O adaptador do recurso suporta transa&ccedil;&otilde;es locais implementando a interface do LocalTransaction. As transa&ccedil;&otilde;es locais s&atilde;o gerenciadas internamente a um gerenciador de recursos e n&atilde;o envolve nenhum gerenciador de transa&ccedil;&otilde;es.</p>
</dd>
<dt>NoTransaction</dt>
<dd>
<p>O adaptador de recursos n&atilde;o suporta transa&ccedil;&otilde;es locais ou de JTA do gerenciador de recursos e n&atilde;o implementa as interfaces XAResource ou LocalTransaction.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref72" name="sthref72"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-connectorconnectionpoolnew.html">Para Criar um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">Para Editar um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">Editar Atributos Avan&ccedil;ados do Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">Para Editar Propriedades do Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">Para Criar um Mapa de Seguran&ccedil;a para um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">Para Editar um Mapa de Seguran&ccedil;a de um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">Para Deletar um Mapa de Seguran&ccedil;a de um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">Para Deletar um Pool de Conex&otilde;es do Conector</a></p>
</li>
</ul>
<a id="sthref73" name="sthref73"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00018"><code>create-connector-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00157"><code>list-connector-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00070"><code>delete-connector-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00135"><code>flush-connection-pool</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
