<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-worksecuritymapedit" name="ref-worksecuritymapedit"></a><a id="GHJCA00055" name="GHJCA00055"></a></p>

<h4>Editar o Mapa de Seguran&ccedil;a de Trabalho</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Editar o Mapa de Seguran&ccedil;a de Trabalho para modificar as defini&ccedil;&otilde;es de um mapa de seguran&ccedil;a do trabalho.</p>
<p>A p&aacute;gina Editar o Mapa de Seguran&ccedil;a de Trabalho cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Nome do Mapa de Seguran&ccedil;a</dt>
<dd>
<p>O nome do mapa de seguran&ccedil;a de trabalho. O nome &eacute; um campo somente para leitura. Voc&ecirc; pode apenas especificar um Nome do Mapa de Seguran&ccedil;a quando cria um novo mapa de seguran&ccedil;a.</p>
</dd>
<dt>Grupo</dt>
<dd>
<p>Se o bot&atilde;o de r&aacute;dio Grupo for selecionado, o campo de texto precisar&aacute; especificar um mapa de cada grupo de usu&aacute;rios EIS back-end para o correspondente grupo de usu&aacute;rios definido no dom&iacute;nio de seguran&ccedil;a do GlassFish Server. Use uma lista separada por v&iacute;rgulas para especificar mais de um mapeamento. Por exemplo:</p>
<pre>
eis-group-1=server-group-1,eis-group-2=server-group-2
</pre></dd>
<dt>Principal</dt>
<dd>
<p>Se o bot&atilde;o de op&ccedil;&atilde;o Principal for selecionado, o campo de texto precisar&aacute; especificar um mapa para cada principal EIS back-end para o correspondente principal definido no dom&iacute;nio de seguran&ccedil;a do GlassFish Server. Use uma lista separada por v&iacute;rgulas para especificar mais de um mapeamento. Por exemplo:</p>
<pre>
eis-principal-1=server-principal-1,eis-principal-2=server-principal-2
</pre></dd>
<dt>Adaptador do Recurso</dt>
<dd>
<p>O adaptador de recurso para o EIS.</p>
</dd>
<dt>Descri&ccedil;&atilde;o</dt>
<dd>
<p>Uma descri&ccedil;&atilde;o para o mapa de seguran&ccedil;a do trabalho.</p>
</dd>
<dt>Status</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o est&aacute; selecionada, o mapa de seguran&ccedil;a do trabalho ser&aacute; ativado. Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</dd>
</dl>
<a id="sthref110" name="sthref110"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-worksecuritymapnew.html">Para Criar um Mapa de Seguran&ccedil;a de Trabalho</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">Para Editar um Mapa de Seguran&ccedil;a de Trabalho</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">Para Deletar um Mapa de Seguran&ccedil;a de Trabalho</a></p>
</li>
</ul>
<a id="sthref111" name="sthref111"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00021"><code>create-connector-work-security-map</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00160"><code>list-connector-work-security-maps</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00073"><code>delete-connector-work-security-map</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00253"><code>update-connector-work-security-map</code>(1)</a></p>
</li>
</ul>




<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
