<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-adminobjectedit" name="ref-adminobjectedit"></a><a id="GHJCA00052" name="GHJCA00052"></a></p>

<h4><a id="sthref99" name="sthref99"></a>Editar o Recurso de Objeto Administrado</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Editar o Recurso de Objeto Administrado para modificar as defini&ccedil;&otilde;es de um recurso de objeto administrado.</p>
<p>A p&aacute;gina Editar o Recurso de Objeto Administrado cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Carregar Defaults</dt>
<dd>
<p>Bot&atilde;o para restaurar defini&ccedil;&otilde;es para seus valores default. Defini&ccedil;&otilde;es que n&atilde;o tiveram seus valores default alterados.</p>
</dd>
<dt>Nome JNDI</dt>
<dd>
<p>Um nome exclusivo que identifica o recurso do objeto administrado. O nome JNDI &eacute; um campo somente para leitura. Voc&ecirc; s&oacute; pode especificar o nome JNDI ao criar um novo recurso de objeto administrado.</p>
</dd>
<dt>Adaptador do Recurso</dt>
<dd>
<p>O adaptador de recurso para o recurso do objeto administrado.</p>
</dd>
<dt>Tipo de Recurso</dt>
<dd>
<p>O tipo Java do recurso de objeto administrado (ou por exemplo,<code>javax.jms.Topic</code>).</p>
</dd>
<dt>Nome da Classe</dt>
<dd>
<p>O nome da classe de implementa&ccedil;&atilde;o associada com o tipo de recurso.</p>
</dd>
<dt>Descri&ccedil;&atilde;o</dt>
<dd>
<p>A descri&ccedil;&atilde;o do recurso do objeto administrado.</p>
</dd>
<dt>Status</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o est&aacute; selecionada, o recurso do objeto administrado ser&aacute; ativado. Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</dd>
<dt>Propriedades Adicionais</dt>
<dd>
<p>Propriedades adicionais para o recurso do objeto administrado. As propriedades dispon&iacute;veis dependem do adaptador de recursos para o pool de conex&otilde;es do conector. Os pares de nome e valor especificados nessa tabela podem ser usados para substituir os valores default definidos pelo fornecedor do adaptador de recurso.</p>
</dd>
</dl>
<a id="sthref100" name="sthref100"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-adminobjectnew.html">Para Criar um Recurso do Objeto Administrado</a></p>
</li>
<li>
<p><a href="task-adminobjectedit.html">Para Editar um Recurso do Objeto Administrado</a></p>
</li>
<li>
<p><a href="task-administeredobjectresourcedelete.html">Para Deletar um Recurso de Objeto Administrado</a></p>
</li>
</ul>
<a id="sthref101" name="sthref101"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00012"><code>create-admin-object</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00146"><code>list-admin-objects</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00063"><code>delete-admin-object</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
