<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-resourceadapterconfig" name="ref-resourceadapterconfig"></a></p>

<h4><a id="sthref112" name="sthref112"></a>Configura&ccedil;&otilde;es do Adaptador de Recursos</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Configura&ccedil;&otilde;es do Adaptador de Recursos para gerenciar as configura&ccedil;&otilde;es do conector (adaptador de recurso).</p>
<p>A configura&ccedil;&atilde;o do adaptador de recursos fornece informa&ccedil;&otilde;es de configura&ccedil;&atilde;o para um adaptador de recursos. Com a Console de Administra&ccedil;&atilde;o, voc&ecirc; cria um config de adaptador de recursos ap&oacute;s a implanta&ccedil;&atilde;o do adaptador de recurso. Nesse caso, o adaptador de recurso &eacute; reiniciado com a nova configura&ccedil;&atilde;o. Para criar uma configura&ccedil;&atilde;o do adaptador de recursos antes de implantar o adaptador de recursos, use o comando <code>asadmin create-resource-adapter-config</code>.</p>
<p>Antes de poder criar uma configura&ccedil;&atilde;o do adaptador de recursos, &eacute; preciso criar um pool de threads para que o adaptador de recursos a utilize.</p>
<p>Para cada config do adaptador de recursos, as seguintes informa&ccedil;&otilde;es s&atilde;o fornecidas.</p>
<dl>
<dt>Nome</dt>
<dd>
<p>O nome do adaptador de recursos.</p>
</dd>
</dl>
<p>A tabela Configura&ccedil;&otilde;es tamb&eacute;m cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Novo</dt>
<dd>
<p>Bot&atilde;o para criar uma nova configura&ccedil;&atilde;o do adaptador de recursos.</p>
</dd>
<dt>Deletar</dt>
<dd>
<p>Bot&atilde;o para deletar uma ou mais configura&ccedil;&otilde;es do adaptador de recursos selecionados.</p>
</dd>
</dl>
<a id="sthref113" name="sthref113"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-resourceadapterconfignew.html">Para Criar uma Configura&ccedil;&atilde;o do Adaptador de Recursos</a></p>
</li>
<li>
<p><a href="task-resourceadapterconfigedit.html">Para Editar uma Configura&ccedil;&atilde;o do Adaptador de Recursos</a></p>
</li>
<li>
<p><a href="task-resourceadapterconfigdelete.html">Para Deletar uma Configura&ccedil;&atilde;o do Adaptador de Recursos</a></p>
</li>
</ul>
<a id="sthref114" name="sthref114"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00054"><code>create-resource-adapter-config</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00196"><code>list-resource-adapter-configs</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00106"><code>delete-resource-adapter-config</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
