<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-worksecuritymaps" name="ref-worksecuritymaps"></a></p>

<h4><a id="sthref102" name="sthref102"></a><a id="sthref103" name="sthref103"></a>Mapas de Seguran&ccedil;a de Trabalho</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Mapas de Seguran&ccedil;a de Trabalho para definir os mapas de seguran&ccedil;a para os adaptadores de recursos.</p>
<p>Um mapa de seguran&ccedil;a de trabalho do conector, mapeia a identidade do chamador do trabalho submetido por um adaptador de recurso principal EIS ou por um grupo de usu&aacute;rios EIS para um principal ou grupo de usu&aacute;rios adequado no dom&iacute;nio de seguran&ccedil;a do GlassFish Server. Um ou mais mapas de seguran&ccedil;a do trabalho podem ser associados com um adaptador de recurso. A configura&ccedil;&atilde;o do mapa de seguran&ccedil;a do trabalho do conector suporta o uso do asterisco coringa (<code>*</code>) para indicar todos os usu&aacute;rios ou todos os grupos de usu&aacute;rios.</p>
<p>Um mapa de seguran&ccedil;a do trabalho &eacute; diferente de uma mapa de seguran&ccedil;a para um pool de conex&otilde;es do conector, que mapeia o principal recuperado durante a autentica&ccedil;&atilde;o do servlet ou EJB, para as credenciais aceitas pelo EIS. Consulte <a href="ref-connectorsecuritymaps.html">Mapas de Seguran&ccedil;a do Pool de Conex&otilde;es do Conector</a> para obter informa&ccedil;&otilde;es sobre mapas de seguran&ccedil;a para pools de conex&otilde;es do conector.</p>
<p>O sistema de informa&ccedil;&otilde;es corporativas (EIS) &eacute; um sistema que armazena os dados de uma empresa. Ele pode ser um mainframe, um sistema de mensagens, um sistema de banco de dados ou uma aplica&ccedil;&atilde;o.</p>
<p>Para cada mapa de seguran&ccedil;a do trabalho, as seguintes informa&ccedil;&otilde;es s&atilde;o fornecidas.</p>
<dl>
<dt>Nome</dt>
<dd>
<p>O nome do mapa de seguran&ccedil;a de trabalho.</p>
</dd>
</dl>
<p>A tabela Mapas de Seguran&ccedil;a do Trabalho tamb&eacute;m cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Novo</dt>
<dd>
<p>Bot&atilde;o para criar um novo mapa de seguran&ccedil;a do trabalho.</p>
</dd>
<dt>Deletar</dt>
<dd>
<p>Bot&atilde;o para deletar um ou mais mapas de seguran&ccedil;a do trabalho selecionados.</p>
</dd>
</dl>
<a id="sthref104" name="sthref104"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-worksecuritymapnew.html">Para Criar um Mapa de Seguran&ccedil;a de Trabalho</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">Para Editar um Mapa de Seguran&ccedil;a de Trabalho</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">Para Deletar um Mapa de Seguran&ccedil;a de Trabalho</a></p>
</li>
</ul>
<a id="sthref105" name="sthref105"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00021"><code>create-connector-work-security-map</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00160"><code>list-connector-work-security-maps</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00073"><code>delete-connector-work-security-map</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00253"><code>update-connector-work-security-map</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
