<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-connectionservice" name="ref-connectionservice"></a></p>

<h4><a id="sthref125" name="sthref125"></a>Servi&ccedil;o do Conector</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Servi&ccedil;o de Conector para modificar as defini&ccedil;&otilde;es gerais para o servi&ccedil;o de conector que governa os adaptadores de recursos.</p>
<p>A p&aacute;gina Servi&ccedil;o de Conector cont&eacute;m as seguintes op&ccedil;&otilde;es:</p>
<dl>
<dt>Carregar Defaults</dt>
<dd>
<p>Bot&atilde;o para restaurar defini&ccedil;&otilde;es para seus valores default. Defini&ccedil;&otilde;es que n&atilde;o tiveram seus valores default alterados.</p>
</dd>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Time-out para Shutdown</dt>
<dd>
<p>O n&uacute;mero m&aacute;ximo de segundos permitidos durante o shutdown do GlassFish Server, para que o m&eacute;todo <code>ResourceAdapter.stop</code> de uma inst&acirc;ncia do m&oacute;dulo do conector seja completada. Os adaptadores de recursos que levam mais tempo para serem submetidos a shutdown s&atilde;o ignorados e o shutdown do GlassFish Server continua. O valor default &eacute; 30 segundos.</p>
</dd>
<dt>Pol&iacute;tica de Carga de Classes para Conector</dt>
<dd>
<p>A pol&iacute;tica a ser usada para a carga de classes. As op&ccedil;&otilde;es dispon&iacute;veis s&atilde;o:</p>
<dl>
<dt><code>derived</code></dt>
<dd>
<p>Indica que os adaptadores de recursos s&atilde;o fornecidos de acordo com as refer&ecirc;ncias da aplica&ccedil;&atilde;o para qualquer um dos recursos do adaptador de recursos. Essa pol&iacute;tica &eacute; a default.</p>
</dd>
<dt><code>global</code></dt>
<dd>
<p>Indica que todos os adaptadores de recursos estar&atilde;o vis&iacute;veis para todas as aplica&ccedil;&otilde;es.</p>
</dd>
</dl>
<p>Esta pol&iacute;tica n&atilde;o se aplica ao adaptador de recursos JMS pr&eacute;-instalado, <code>jmsra</code>, que sempre est&aacute; vis&iacute;vel para todas as aplica&ccedil;&otilde;es.</p>
</dd>
</dl>
<a id="sthref126" name="sthref126"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-connectionservice.html">Para Configurar o Servi&ccedil;o de Conector</a></p>
</li>
<li>
<p><a href="../../../common/en/help/task-appdeployconn.html">Para Implantar um M&oacute;dulo do Conector</a></p>
</li>
</ul>
<a id="sthref127" name="sthref127"></a>
<h5>Comandos asadmin Relacionados</h5>
<p>Nenhum.</p>





<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
