<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-connectorconnectionpooladvance" name="ref-connectorconnectionpooladvance"></a><a id="GHJCA00045" name="GHJCA00045"></a></p>

<h4><a id="sthref74" name="sthref74"></a>Editar Atributos Avan&ccedil;ados do Pool de Conex&otilde;es do Conector</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Editar Pool de Conex&otilde;es do Conector para modificar as defini&ccedil;&otilde;es avan&ccedil;adas do pool de conex&otilde;es do conector.</p>
<p>A p&aacute;gina Editar Atributos Avan&ccedil;ados do Pool de Conex&otilde;es do Conector cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Carregar Defaults</dt>
<dd>
<p>Bot&atilde;o para restaurar defini&ccedil;&otilde;es para seus valores default. Defini&ccedil;&otilde;es que n&atilde;o tiveram seus valores default alterados.</p>
</dd>
<dt>Validar no M&aacute;ximo uma Vez</dt>
<dd>
<p>Especifica o intervalo de tempo, em segundos, entre sucessivas solicita&ccedil;&otilde;es para validar uma conex&atilde;o no m&aacute;ximo uma vez. O valor default &eacute; 0, o que significa que o atributo n&atilde;o est&aacute; ativado.</p>
</dd>
<dt>Time-out para Perda de Conex&atilde;o</dt>
<dd>
<p>Per&iacute;odo em segundos para rastrear as perdas de conex&atilde;o em um pool de conex&otilde;es. Um valor de 0 indica que o rastreamento da perda de conex&atilde;o est&aacute; desativado. O valor default &eacute; 0.</p>
</dd>
<dt>Reclama&ccedil;&atilde;o de Perda</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o est&aacute; selecionada, as conex&otilde;es perdidas ser&atilde;o restauradas no pool ap&oacute;s a conclus&atilde;o do rastreamento de perda da conex&atilde;o. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Novas Tentativas de Cria&ccedil;&atilde;o</dt>
<dd>
<p>O n&uacute;mero de tentativas a serem feitas se houver uma falha na cria&ccedil;&atilde;o de uma nova conex&atilde;o. O valor de 0 indica que nenhuma tentativa ser&aacute; feita para criar a conex&atilde;o novamente. O valor default &eacute; 0.</p>
</dd>
<dt>Intervalo para Nova Tentativa</dt>
<dd>
<p>O intervalo de tempo, em segundos, entre duas tentativas de criar uma conex&atilde;o. Esse atributo s&oacute; ser&aacute; usado se o valor Novas Tentativas de Cria&ccedil;&atilde;o for maior que 0. O valor default &eacute; 10 segundos.</p>
</dd>
<dt>Agrupamento</dt>
<dd>
<p>Permite agrupamento de conex&otilde;es para o pool. Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</dd>
<dt>Associa&ccedil;&atilde;o Lenta</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o est&aacute; selecionada, as conex&otilde;es ser&atilde;o associadas lentamente quando uma opera&ccedil;&atilde;o for executada nelas. As conex&otilde;es ser&atilde;o desassociadas quando a transa&ccedil;&atilde;o for conclu&iacute;da e um m&eacute;todo de componente for finalizado, o que ajuda a reutilizar as conex&otilde;es f&iacute;sicas. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Aloca&ccedil;&atilde;o para Conex&atilde;o Lenta</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o estiver selecionada, um recurso para a transa&ccedil;&atilde;o ser&aacute; alocada somente quando a transa&ccedil;&atilde;o for realmente usada em um m&eacute;todo. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Associar a Thread</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o for selecionada, uma conex&atilde;o ser&aacute; associada a um thread. Quando o mesmo thread for necess&aacute;rio a uma conex&atilde;o, a conex&atilde;o j&aacute; associada ao thread poder&aacute; ser reutilizada, n&atilde;o incorrendo, portanto, na sobrecarga para obten&ccedil;&atilde;o de outra conex&atilde;o do pool. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Correspond&ecirc;ncia de Conex&otilde;es</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o for selecionada, a correspond&ecirc;ncia de conex&otilde;es ser&aacute; ativada para o pool. Essa op&ccedil;&atilde;o poder&aacute; ser desativada se voc&ecirc; souber que as conex&otilde;es no pool ser&atilde;o sempre homog&ecirc;neas e, portanto, uma conex&atilde;o selecionada no pool n&atilde;o precisar&aacute; coincidir com o adaptador de recurso. Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</dd>
<dt>Uso da Correspond&ecirc;ncia de Conex&otilde;es</dt>
<dd>
<p>O n&uacute;mero de vezes que uma conex&atilde;o deve ser reutilizada pelo pool. Depois que uma conex&atilde;o &eacute; reutilizada por um n&uacute;mero especificado de vezes, ela ser&aacute; fechada. O valor de 0 indica que o atributo est&aacute; desativado. O valor default &eacute; 0.</p>
</dd>
</dl>
<a id="sthref75" name="sthref75"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-connectorconnectionpoolnew.html">Para Criar um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">Para Editar um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">Editar Atributos Avan&ccedil;ados do Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">Para Editar Propriedades do Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">Para Criar um Mapa de Seguran&ccedil;a para um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">Para Editar um Mapa de Seguran&ccedil;a de um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">Para Deletar um Mapa de Seguran&ccedil;a de um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">Para Deletar um Pool de Conex&otilde;es do Conector</a></p>
</li>
</ul>
<a id="sthref76" name="sthref76"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00018"><code>create-connector-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00157"><code>list-connector-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00070"><code>delete-connector-connection-pool</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
