<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-connectionservice" name="task-connectionservice"></a><a id="GHJCA00081" name="GHJCA00081"></a></p>

<h4><a id="sthref50" name="sthref50"></a>Para Configurar o Servi&ccedil;o de Conector</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&atilde;o.</p>
</li>
<li>
<p>Sob o n&oacute; Configura&ccedil;&atilde;o, selecione o n&oacute; Servi&ccedil;o de Conector.</p>
<p>A p&aacute;gina Servi&ccedil;o de Conector ser&aacute; aberta.</p>
</li>
<li>
<p>No campo Time-out para Shutdown, digite o n&uacute;mero m&aacute;ximo de segundos permitidos durante o shutdwon do GlassFish Server, para que o m&eacute;todo <code>ResourceAdapter.stop</code> da inst&acirc;ncia do m&oacute;dulo do conector seja completado.</p>
<p>Os adaptadores de recursos que levam mais tempo para serem submetidos a shutdown s&atilde;o ignorados e o shutdown do GlassFish Server continua. O valor default &eacute; 30 segundos.</p>
</li>
<li>
<p>Na lista drop-down Pol&iacute;tica de Carga de Classes para o Conector, selecione a pol&iacute;tica a ser usada.</p>
<ul>
<li>
<p>Selecione <code>derived</code>, para especificar que os adaptadores de recursos s&atilde;o fornecidos de acordo com as refer&ecirc;ncias de uma aplica&ccedil;&atilde;o para qualquer um dos recursos do adaptador de recursos.</p>
<p>Essa pol&iacute;tica &eacute; a default.</p>
</li>
<li>
<p>Selecione <code>global</code>, para especificar que todos os adaptadores de recursos estar&atilde;o vis&iacute;veis para todas as aplica&ccedil;&otilde;es.</p>
</li>
</ul>
<p>Esta pol&iacute;tica n&atilde;o se aplica ao adaptador de recursos JMS pr&eacute;-instalado, <code>jmsra</code>, que sempre est&aacute; vis&iacute;vel para todas as aplica&ccedil;&otilde;es.</p>
</li>
<li>
<p>Clique em Salvar.</p>

<hr>
<p><b>Dica:</b></p>
Para voltar &agrave;s defini&ccedil;&otilde;es default, clique no bot&atilde;o Carregar Defaults e depois em Salvar.
<hr>

</li>
</ol>
<a id="sthref51" name="sthref51"></a>
<h5>Consulte Tamb&eacute;m</h5>
<p><a href="../../../common/en/help/task-appdeployconn.html">Para Implantar um M&oacute;dulo do Conector</a></p>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
