<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-connectorresourceedit" name="task-connectorresourceedit"></a></p>

<h4><a id="sthref5" name="sthref5"></a>Para Editar um Recurso do Conector</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Recursos.</p>
</li>
<li>
<p>Expanda o n&oacute; Conectores.</p>
</li>
<li>
<p>Sob o n&oacute; Conectores, selecione o n&oacute; Recursos do Conector.</p>
<p>A p&aacute;gina Recursos do Conector &eacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Recursos do Conector, clique no nome do recurso a ser editado.</p>
<p>A p&aacute;gina Editar Recurso Conector &eacute; aberta.</p>
</li>
<li>
<p>Na lista drop-down Nome do Pool, selecione um pool de conex&otilde;es ao qual pertence o recurso do conector.</p>
</li>
<li>
<p>No campo Ordem de Implanta&ccedil;&atilde;o, digite um n&uacute;mero para especificar a ordem de implanta&ccedil;&atilde;o do recurso conector.</p>
<p>Recursos com um n&uacute;mero mais baixo s&atilde;o carregados primeiro na inicializa&ccedil;&atilde;o do servidor. O valor default &eacute; 100.</p>
</li>
<li>
<p>No campo Descri&ccedil;&atilde;o, digite uma descri&ccedil;&atilde;o do recurso do conector.</p>
</li>
<li>
<p>Na guia Alvo, selecione os alvos necess&aacute;rios e clique em Ativar ou Desativar.</p>
<p>Para adicionar ou remover alvo da lista, selecione Gerenciar Alvos.</p>
<p>Volte &agrave; p&aacute;gina Editar Recurso Conector clicando na guia Geral.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Status Ativado para ativar o recurso do conector durante o runtime.</p>
<p>Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</li>
<li>
<p>Na se&ccedil;&atilde;o Propriedades |Adicionais, especifique propriedades adicionais para o recurso do conector.</p>
<p>As propriedades dispon&iacute;veis dependem do adaptador de recursos para o pool de conex&otilde;es do conector.</p>
<ul>
<li>
<p>Para adicionar uma propriedade, clique no bot&atilde;o Adicionar Propriedade. Na linha em branco que for exibida, digite o nome da propriedade no campo Nome e digite o valor da propriedade no campo Valor.</p>
</li>
<li>
<p>Para modificar uma propriedade, edite o campo Valor da propriedade.</p>
</li>
<li>
<p>Para deletar uma propriedade, marque a caixa de sele&ccedil;&atilde;o &agrave; esquerda do campo Nome da Propriedade a ser deletada. Clique no bot&atilde;o Deletar Propriedades.</p>
</li>
</ul>
</li>
<li>
<p>Clique em Salvar.</p>

<hr>
<p><b>Dica:</b></p>
Para voltar &agrave;s defini&ccedil;&otilde;es default, clique no bot&atilde;o Carregar Defaults e depois em Salvar.
<hr>

</li>
</ol>
<a id="sthref6" name="sthref6"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-connectorresourcenew.html">Para Criar um Recurso do Conector</a></p>
</li>
<li>
<p><a href="task-connectorresourcesdelete.html">Para Deletar um Recurso Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolnew.html">Para Criar um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">Para Editar um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">Editar Atributos Avan&ccedil;ados do Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">Para Editar Propriedades do Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">Para Criar um Mapa de Seguran&ccedil;a para um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">Para Editar um Mapa de Seguran&ccedil;a de um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">Para Deletar um Mapa de Seguran&ccedil;a de um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">Para Deletar um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-setupeisaccess.html">Para Configurar Acesso ao EIS</a></p>
</li>
<li>
<p><a href="task-adminobjectnew.html">Para Criar um Recurso do Objeto Administrado</a></p>
</li>
<li>
<p><a href="task-adminobjectedit.html">Para Editar um Recurso do Objeto Administrado</a></p>
</li>
<li>
<p><a href="task-administeredobjectresourcedelete.html">Para Deletar um Recurso de Objeto Administrado</a></p>
</li>
<li>
<p><a href="task-worksecuritymapnew.html">Para Criar um Mapa de Seguran&ccedil;a de Trabalho</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">Para Editar um Mapa de Seguran&ccedil;a de Trabalho</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">Para Deletar um Mapa de Seguran&ccedil;a de Trabalho</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
