<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-connectorconnectionpooladvance" name="task-connectorconnectionpooladvance"></a><a id="GHJCA00065" name="GHJCA00065"></a></p>

<h4><a id="sthref14" name="sthref14"></a>Editar Atributos Avan&ccedil;ados do Pool de Conex&otilde;es do Conector</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Recursos.</p>
</li>
<li>
<p>Expanda o n&oacute; Conectores.</p>
</li>
<li>
<p>Sob o n&oacute; Conectores, selecione o n&oacute; Pools de Conex&otilde;es do Conector.</p>
<p>A p&aacute;gina Pools de Conex&otilde;es do Conector ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Pools de Conex&otilde;es do Conector, clique no nome do pool de conex&otilde;es do conector a ser editado.</p>
<p>A p&aacute;gina Editar Pool de Conex&otilde;es do Conector ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Editar Pool de Conex&otilde;es do Conector, clique na guia Avan&ccedil;ado.</p>
<p>A p&aacute;gina Editar Atributos Avan&ccedil;ados do Pool de Conex&otilde;es do Conector ser&aacute; exibida.</p>
</li>
<li>
<p>No campo Validar no M&aacute;ximo uma Vez, digite o per&iacute;odo, em segundos, ap&oacute;s o qual uma conex&atilde;o ser&aacute; validada no m&aacute;ximo uma vez.</p>
<p>A defini&ccedil;&atilde;o desse atributo para um valor apropriado minimiza o n&uacute;mero de solicita&ccedil;&otilde;es de valida&ccedil;&atilde;o feitos por uma conex&atilde;o. O valor default &eacute; 0, o que significa que o atributo n&atilde;o est&aacute; ativado.</p>
</li>
<li>
<p>No campo Time-out para Perda, digite o tempo, em segundos, para rastrear perdas de conex&atilde;o em um pool de conex&otilde;es.</p>
<p>Um valor de 0 indica que o rastreamento da perda de conex&atilde;o est&aacute; desativado. O valor default &eacute; 0.</p>
</li>
<li>
<p>Selecione a op&ccedil;&atilde;o Reclama&ccedil;&atilde;o de Perda, para permitir que as conex&otilde;es perdidas sejam restauradas no pool ap&oacute;s a conclus&atilde;o do rastreamento de perda da conex&atilde;o.</p>
<p>Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>No campo Novas Tentativas de Cria&ccedil;&atilde;o, digite o n&uacute;mero de tentativas a serem feitas se houver uma falha ao criar uma nova conex&atilde;o.</p>
<p>O valor de 0 indica que nenhuma tentativa ser&aacute; feita para criar a conex&atilde;o novamente. O valor default &eacute; 0.</p>
</li>
<li>
<p>No campo Intervalo para Nova Tentativa, digite o intervalo, em segundos, entre duas tentativas de criar uma conex&atilde;o.</p>
<p>Esse atributo s&oacute; ser&aacute; usado se o valor Novas Tentativas de Cria&ccedil;&atilde;o for maior que 0. O valor default &eacute; 10 segundos.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Agrupamento para ativar o agrupamento de conex&otilde;es para o pool.</p>
<p>Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Associa&ccedil;&atilde;o Lenta para permitir que as conex&otilde;es sejam lentamente associadas quando uma opera&ccedil;&atilde;o for executada na mesmas.</p>
<p>As conex&otilde;es ser&atilde;o desassociadas quando a transa&ccedil;&atilde;o for conclu&iacute;da e um m&eacute;todo de componente for finalizado, o que ajuda a reutilizar as conex&otilde;es f&iacute;sicas. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Aloca&ccedil;&atilde;o para Conex&atilde;o Lenta, para inscrever um recurso para a transa&ccedil;&atilde;o somente quando ele for efetivamente utilizado em um m&eacute;todo.</p>
<p>Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Associate with Thread, para associar a conex&atilde;o a um thread.</p>
<p>Quando o mesmo thread for necess&aacute;rio a uma conex&atilde;o, a conex&atilde;o j&aacute; associada ao thread poder&aacute; ser reutilizada, n&atilde;o incorrendo, portanto, na sobrecarga para obten&ccedil;&atilde;o de outra conex&atilde;o do pool. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Correspond&ecirc;ncia de Conex&otilde;es, para ativar a correspond&ecirc;ncia de conex&otilde;es para o pool.</p>
<p>Desative esta op&ccedil;&atilde;o se voc&ecirc; souber que as conex&otilde;es no pool ser&atilde;o sempre homog&ecirc;neas e, portanto, uma conex&atilde;o selecionada no pool n&atilde;o precisar&aacute; coincidir com o adaptador de recurso. Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</li>
<li>
<p>No campo Uso da Correspond&ecirc;ncia de Conex&otilde;es, digite o n&uacute;mero de vezes que uma conex&atilde;o deve ser reutilizada pelo pool.</p>
<p>Depois que uma conex&atilde;o &eacute; reutilizada por um n&uacute;mero especificado de vezes, ela ser&aacute; fechada. O valor de 0 indica que o atributo est&aacute; desativado. O valor default &eacute; 0.</p>
</li>
<li>
<p>Clique em Salvar.</p>

<hr>
<p><b>Dica:</b></p>
Para voltar &agrave;s defini&ccedil;&otilde;es default, clique no bot&atilde;o Carregar Defaults e depois em Salvar.
<hr>

</li>
</ol>
<a id="sthref15" name="sthref15"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-connectorresourcenew.html">Para Criar um Recurso do Conector</a></p>
</li>
<li>
<p><a href="task-connectorresourceedit.html">Para Editar um Recurso do Conector</a></p>
</li>
<li>
<p><a href="task-connectorresourcesdelete.html">Para Deletar um Recurso Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolnew.html">Para Criar um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">Para Editar um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">Para Editar Propriedades do Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">Para Criar um Mapa de Seguran&ccedil;a para um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">Para Editar um Mapa de Seguran&ccedil;a de um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">Para Deletar um Mapa de Seguran&ccedil;a de um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">Para Deletar um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-setupeisaccess.html">Para Configurar Acesso ao EIS</a></p>
</li>
<li>
<p><a href="task-adminobjectnew.html">Para Criar um Recurso do Objeto Administrado</a></p>
</li>
<li>
<p><a href="task-adminobjectedit.html">Para Editar um Recurso do Objeto Administrado</a></p>
</li>
<li>
<p><a href="task-administeredobjectresourcedelete.html">Para Deletar um Recurso de Objeto Administrado</a></p>
</li>
<li>
<p><a href="task-worksecuritymapnew.html">Para Criar um Mapa de Seguran&ccedil;a de Trabalho</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">Para Editar um Mapa de Seguran&ccedil;a de Trabalho</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">Para Deletar um Mapa de Seguran&ccedil;a de Trabalho</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
