<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-connectorconnectionpoolnew" name="task-connectorconnectionpoolnew"></a><a id="GHJCA00063" name="GHJCA00063"></a></p>

<h4><a id="sthref9" name="sthref9"></a>Para Criar um Pool de Conex&otilde;es do Conector</h4>
<a name="BEGIN" id="BEGIN"></a><a id="sthref10" name="sthref10"></a>
<h5>Antes de Come&ccedil;ar</h5>
<p>Antes de criar o pool, implante o m&oacute;dulo conector (adaptador de recursos) associado ao pool. Os valores especificados para o novo pool dependem do m&oacute;dulo conector que &eacute; implantado.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Recursos.</p>
</li>
<li>
<p>Expanda o n&oacute; Conectores.</p>
</li>
<li>
<p>Sob o n&oacute; Conectores, selecione o n&oacute; Pools de Conex&otilde;es do Conector.</p>
<p>A p&aacute;gina Pools de Conex&otilde;es do Conector ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Pools de Conex&otilde;es do Conector, clique em Novo.</p>
<p>A p&aacute;gina Novo Pool de Conex&otilde;es do Conector (Etapa 1 de 2) ser&aacute; aberta.</p>
</li>
<li>
<p>No campo Nome do Pool, digite um nome exclusivo para o pool.</p>
<p>Especifique esse nome ao criar um recurso do conector.</p>
</li>
<li>
<p>Na lista drop-down Adaptador de Recursos, selecione entre os adaptadores de recursos implantado (m&oacute;dulos de conector).</p>
</li>
<li>
<p>Na lista drop-down Defini&ccedil;&atilde;o da Conex&atilde;o, selecione a defini&ccedil;&atilde;o de conex&atilde;o relativa ao pool de conex&otilde;es do conector.</p>
<p>As escolhas na lista dependem do adaptador de recurso selecionado. A defini&ccedil;&atilde;o da conex&atilde;o identifica um elemento <code>connection-definition</code> do adaptador de recurso no arquivo <code>ra.xml</code>.</p>
</li>
<li>
<p>Clique em Pr&oacute;ximo.</p>
<p>A p&aacute;gina Novo Pool de Conex&otilde;es do Conector (Etapa 2 de 2) ser&aacute; aberta.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Ping Ativado, para efetuar o ping no pool de conex&otilde;es durante a cria&ccedil;&atilde;o ou reconfigura&ccedil;&atilde;o, para identificar e avisar sobre valores de atributos com erros.</p>
<p>Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>No campo Descri&ccedil;&atilde;o, digite uma descri&ccedil;&atilde;o para o pool de conex&otilde;es.</p>
</li>
<li>
<p>No campo Tamanho Inicial e M&iacute;nimo do Pool, especifique o n&uacute;mero m&iacute;nimo de conex&otilde;es no Pool.</p>
<p>O valor default &eacute; 8.</p>
</li>
<li>
<p>No campo Tamanho M&aacute;ximo do Pool, especifique o n&uacute;mero m&aacute;ximo de conex&otilde;es no pool.</p>
<p>O valor default &eacute; 32.</p>
</li>
<li>
<p>No campo Quantidade de Redimensionamento do Pool, especifique o n&uacute;mero de conex&otilde;es a serem removidas quando o time-out para inatividade do pool expirar.</p>
<p>O valor default &eacute; 2.</p>
</li>
<li>
<p>No campo Time-out para Ociosidade, especifique a quantidade m&aacute;xima de tempo, em segundos, para que uma conex&atilde;o permane&ccedil;a ociosa no pool.</p>
<p>O valor default &eacute; 300.</p>
</li>
<li>
<p>No campo Tempo M&aacute;ximo de Espera, especifique o tempo m&aacute;ximo que a aplica&ccedil;&atilde;o solicitante da conex&atilde;o aguardar&aacute; at&eacute; obter um time-out.</p>
<p>O valor default &eacute; 60000.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Valida&ccedil;&atilde;o de Conex&atilde;o Obrigat&oacute;ria para ativar a valida&ccedil;&atilde;o de conex&atilde;o.</p>
<p>Se a caixa de sele&ccedil;&atilde;o Obrigat&oacute;rio estiver marcada, as conex&otilde;es ser&atilde;o validadas antes de serem enviadas &agrave; aplica&ccedil;&atilde;o. Se uma valida&ccedil;&atilde;o de recurso falhar, ela ser&aacute; destru&iacute;da e um novo recurso ser&aacute; criado e retornado. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Em Caso de Falha Fechar Todas as Conex&otilde;es para que o GlassFish Server feche todas as conex&otilde;es no pool e as restabele&ccedil;a de uma &uacute;nica conex&atilde;o falhar.</p>
<p>Se voc&ecirc; n&atilde;o marcar a caixa de sele&ccedil;&atilde;o, as conex&otilde;es individuais s&oacute; ser&atilde;o restabelecidas quando forem usadas. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>Na lista drop-down Suporte &agrave; Transa&ccedil;&atilde;o, selecione o tipo de suporte da transa&ccedil;&atilde;o para o pool de conex&otilde;es.</p>
<p>O suporte &agrave; transa&ccedil;&atilde;o escolhido substitui o atributo do suporte de transa&ccedil;&atilde;o no adaptador de recursos associado a esse pool de conex&otilde;es de uma forma compat&iacute;vel com descend&ecirc;ncia. Em outras palavras, pode dar suporte a um n&iacute;vel de transa&ccedil;&atilde;o mais baixo do que o especificado no adaptador de recurso, ou ao mesmo n&iacute;vel de transa&ccedil;&atilde;o especificado no adaptador de recurso, mas n&atilde;o pode especificar um n&iacute;vel mais alto.</p>
<p>As op&ccedil;&otilde;es a seguir est&atilde;o dispon&iacute;veis na lista drop-down:</p>
<ul>
<li>
<p>NoTransaction: indica que o adaptador de recursos n&atilde;o suporta transa&ccedil;&otilde;es locais ou de JTA do gerenciador de recursos e n&atilde;o implementa as interfaces XAResource ou LocalTransaction.</p>
</li>
<li>
<p>LocalTransaction: indica que o adaptador de recursos suporta as transa&ccedil;&otilde;es locais ao implementar a interface LocalTransaction.</p>
<p>As transa&ccedil;&otilde;es locais s&atilde;o gerenciadas internamente a um gerenciador de recursos e n&atilde;o envolve nenhum gerenciador de transa&ccedil;&otilde;es.</p>
</li>
<li>
<p>XATransaction: indica que o adaptador de recurso suporta o gerenciador de recursos local e as transa&ccedil;&otilde;es JTA ao implementar as interfaces LocalTransaction e XAResource.</p>
<p>As transa&ccedil;&otilde;es XA s&atilde;o controladas e coordenadas por um gerenciador de transa&ccedil;&otilde;es externo ao gerenciador de recursos.</p>
</li>
</ul>
</li>
<li>
<p>Na se&ccedil;&atilde;o Propriedades Adicionais, especifique propriedades adicionais para o pool de conex&otilde;es do conector.</p>
<p>As propriedades dispon&iacute;veis dependem do adaptador de recursos para o pool de conex&otilde;es do conector.</p>
<p>Para adicionar uma propriedade, clique no bot&atilde;o Adicionar Propriedade. Na linha em branco que for exibida, digite o nome da propriedade no campo Nome e digite o valor da propriedade no campo Valor.</p>
<p>Se voc&ecirc; n&atilde;o especificar um nome para uma propriedade, ela ser&aacute; removida da tabela quando voc&ecirc; finalizar a cria&ccedil;&atilde;o do pool de conex&otilde;es. Caso n&atilde;o deseje definir agora um valor para uma propriedade, mas deseja que a propriedade permane&ccedil;a na tabela, para que o valor possa ser definido em outro momento, digite um conjunto de par&ecirc;nteses vazios no campo Valor:</p>
<pre>
()
</pre></li>
<li>
<p>Clique em OK.</p>
</li>
</ol>
<a id="sthref11" name="sthref11"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-connectorresourcenew.html">Para Criar um Recurso do Conector</a></p>
</li>
<li>
<p><a href="task-connectorresourceedit.html">Para Editar um Recurso do Conector</a></p>
</li>
<li>
<p><a href="task-connectorresourcesdelete.html">Para Deletar um Recurso Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">Para Editar um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">Editar Atributos Avan&ccedil;ados do Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">Para Editar Propriedades do Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">Para Criar um Mapa de Seguran&ccedil;a para um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">Para Editar um Mapa de Seguran&ccedil;a de um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">Para Deletar um Mapa de Seguran&ccedil;a de um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">Para Deletar um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-setupeisaccess.html">Para Configurar Acesso ao EIS</a></p>
</li>
<li>
<p><a href="task-adminobjectnew.html">Para Criar um Recurso do Objeto Administrado</a></p>
</li>
<li>
<p><a href="task-adminobjectedit.html">Para Editar um Recurso do Objeto Administrado</a></p>
</li>
<li>
<p><a href="task-administeredobjectresourcedelete.html">Para Deletar um Recurso de Objeto Administrado</a></p>
</li>
<li>
<p><a href="task-worksecuritymapnew.html">Para Criar um Mapa de Seguran&ccedil;a de Trabalho</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">Para Editar um Mapa de Seguran&ccedil;a de Trabalho</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">Para Deletar um Mapa de Seguran&ccedil;a de Trabalho</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
