<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-resourceadapterconfignew" name="task-resourceadapterconfignew"></a></p>

<h4><a id="sthref48" name="sthref48"></a>Para Criar uma Configura&ccedil;&atilde;o do Adaptador de Recursos</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Recursos.</p>
</li>
<li>
<p>No n&oacute; Recursos, selecione o n&oacute; Configura&ccedil;&otilde;es do Adaptador de Recursos.</p>
<p>A p&aacute;gina Configura&ccedil;&otilde;es do Adaptador de Recursos ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Configura&ccedil;&otilde;es do Adaptador de Recursos, clique em Novo.</p>
<p>A p&aacute;gina Configura&ccedil;&otilde;es do Adaptador de Recursos ser&aacute; aberta.</p>
</li>
<li>
<p>Na lista drop-down Nome do Adaptador de Recursos, selecione o adaptador de recursos.</p>
</li>
<li>
<p>Na lista drop-down ID do Pool de Threads, selecione o Pool de Threads a ser usado para a configura&ccedil;&atilde;o do adaptador de recursos.</p>
</li>
<li>
<p>Na se&ccedil;&atilde;o Propriedades Adicionais, especifique propriedades adicionais para o adaptador de recursos.</p>
<p>As propriedades dispon&iacute;veis s&atilde;o os nomes dos m&eacute;todos setter da classe referenciada pelo elemento <code>resourceadapter-class</code> no arquivo <code>ra.xml</code>, que define o nome da classe do componente JavaBeans do adaptador de recursos. Quaisquer modifica&ccedil;&otilde;es das propriedades aqui definidas substituem os valores presentes no <code>ra.xml</code></p>
<ul>
<li>
<p>Para adicionar uma propriedade, clique no bot&atilde;o Adicionar Propriedade. Na linha em branco que for exibida, digite o nome da propriedade no campo Nome e digite o valor da propriedade no campo Valor.</p>
</li>
<li>
<p>Para modificar uma propriedade, edite o campo Valor da propriedade.</p>
</li>
<li>
<p>Para deletar uma propriedade, marque a caixa de sele&ccedil;&atilde;o &agrave; esquerda do campo Nome da Propriedade a ser deletada. Clique no bot&atilde;o Deletar Propriedades.</p>
</li>
</ul>
</li>
<li>
<p>Clique em OK.</p>
</li>
</ol>
<a id="sthref49" name="sthref49"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-resourceadapterconfigedit.html">Para Editar uma Configura&ccedil;&atilde;o do Adaptador de Recursos</a></p>
</li>
<li>
<p><a href="task-resourceadapterconfigdelete.html">Para Deletar uma Configura&ccedil;&atilde;o do Adaptador de Recursos</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
