<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-connectorconnectionpoolproperty" name="task-connectorconnectionpoolproperty"></a><a id="GHJCA00066" name="GHJCA00066"></a></p>

<h4><a id="sthref16" name="sthref16"></a><a id="sthref17" name="sthref17"></a>Para Editar Propriedades do Pool de Conex&otilde;es do Conector</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Recursos.</p>
</li>
<li>
<p>Expanda o n&oacute; Conectores.</p>
</li>
<li>
<p>Sob o n&oacute; Conectores, selecione o n&oacute; Pools de Conex&otilde;es do Conector.</p>
<p>A p&aacute;gina Pools de Conex&otilde;es do Conector ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Pools de Conex&otilde;es do Conector, clique no nome do pool de conex&otilde;es do conector a ser editado.</p>
<p>A p&aacute;gina Editar Pool de Conex&otilde;es do Conector ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Editar Pool de Conex&otilde;es do Conector, clique na guia Propriedades Adicionais.</p>
<p>A p&aacute;gina Editar Propriedades do Pool de Conex&otilde;es do Conector ser&aacute; aberta.</p>
</li>
<li>
<p>Na tabela Propriedades Adicionais, especifique propriedades adicionais para o pool de conex&otilde;es do conector.</p>
<p>As propriedades especificadas dependem do adaptador de recursos usado por este pool. Os pares de nome e valor especificados nessa tabela, podem ser usados para substituir os valores default definidos pelo fornecedor do adaptador de recursos.</p>
<p>Se voc&ecirc; n&atilde;o especificar um valor para uma propriedade, ela ser&aacute; removida da tabela quando voc&ecirc; finalizar a edi&ccedil;&atilde;o do pool de conex&otilde;es. Caso n&atilde;o deseje definir agora um valor para uma propriedade, mas deseja que a propriedade permane&ccedil;a na tabela, para que o valor possa ser definido em outro momento, digite um conjunto de par&ecirc;nteses vazios no campo Valor:</p>
<pre>
()
</pre>
<ul>
<li>
<p>Para adicionar uma propriedade, clique no bot&atilde;o Adicionar Propriedade. Na linha em branco que for exibida, digite o nome da propriedade no campo Nome e digite o valor da propriedade no campo Valor.</p>
</li>
<li>
<p>Para modificar uma propriedade, edite o campo Valor da propriedade.</p>
</li>
<li>
<p>Para deletar uma propriedade, marque a caixa de sele&ccedil;&atilde;o &agrave; esquerda do campo Nome da Propriedade a ser deletada. Clique no bot&atilde;o Deletar Propriedades.</p>
</li>
</ul>
</li>
<li>
<p>Clique em Salvar.</p>
</li>
</ol>
<a id="sthref18" name="sthref18"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-connectorresourcenew.html">Para Criar um Recurso do Conector</a></p>
</li>
<li>
<p><a href="task-connectorresourceedit.html">Para Editar um Recurso do Conector</a></p>
</li>
<li>
<p><a href="task-connectorresourcesdelete.html">Para Deletar um Recurso Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolnew.html">Para Criar um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">Para Editar um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">Editar Atributos Avan&ccedil;ados do Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">Para Criar um Mapa de Seguran&ccedil;a para um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">Para Editar um Mapa de Seguran&ccedil;a de um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">Para Deletar um Mapa de Seguran&ccedil;a de um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">Para Deletar um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-setupeisaccess.html">Para Configurar Acesso ao EIS</a></p>
</li>
<li>
<p><a href="task-adminobjectnew.html">Para Criar um Recurso do Objeto Administrado</a></p>
</li>
<li>
<p><a href="task-adminobjectedit.html">Para Editar um Recurso do Objeto Administrado</a></p>
</li>
<li>
<p><a href="task-administeredobjectresourcedelete.html">Para Deletar um Recurso de Objeto Administrado</a></p>
</li>
<li>
<p><a href="task-worksecuritymapnew.html">Para Criar um Mapa de Seguran&ccedil;a de Trabalho</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">Para Editar um Mapa de Seguran&ccedil;a de Trabalho</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">Para Deletar um Mapa de Seguran&ccedil;a de Trabalho</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
