<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-worksecuritymapnew" name="task-worksecuritymapnew"></a></p>

<h4><a id="sthref36" name="sthref36"></a><a id="sthref37" name="sthref37"></a>Para Criar um Mapa de Seguran&ccedil;a de Trabalho</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Recursos.</p>
</li>
<li>
<p>Expanda o n&oacute; Conectores.</p>
</li>
<li>
<p>No n&oacute; Conectores, selecione o n&oacute; Mapas de Seguran&ccedil;a de Trabalho.</p>
<p>A p&aacute;gina Mapas de Seguran&ccedil;a de Trabalho ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Mapas de Seguran&ccedil;a de Trabalho, clique em Novo.</p>
<p>A p&aacute;gina Novo Mapa de Seguran&ccedil;a de Trabalho ser&aacute; aberta.</p>
</li>
<li>
<p>No campo Nome do Mapa de Seguran&ccedil;a, digite um nome para o mapa de seguran&ccedil;a de trabalho.</p>
</li>
<li>
<p>Use o campo Grupo ou o Principal, como a seguir.</p>
<ul>
<li>
<p>Se o bot&atilde;o de op&ccedil;&atilde;o Grupo for selecionado, digite um mapa de cada grupo de usu&aacute;rios EIS back-end para o correspondente grupo de usu&aacute;rios definido no dom&iacute;nio de seguran&ccedil;a do GlassFish Server.</p>
<p>Use uma lista separada por v&iacute;rgulas para especificar mais de um mapeamento. Por exemplo:</p>
<pre>
eis-group-1=server-group-1,eis-group-2=server-group-2
</pre></li>
<li>
<p>Se o bot&atilde;o de op&ccedil;&atilde;o Principal for selecionado, digite um mapa de principal EIS back-end para o correspondente principal definido no dom&iacute;nio de seguran&ccedil;a do GlassFish Server.</p>
<p>Use uma lista separada por v&iacute;rgulas para especificar mais de um mapeamento. Por exemplo:</p>
<pre>
eis-principal-1=server-principal-1,eis-principal-2=server-principal-2
</pre></li>
</ul>
</li>
<li>
<p>Na lista drop-down Adaptador de Recursos, selecione o adaptador de recursos para o EIS.</p>
</li>
<li>
<p>No campo Descri&ccedil;&atilde;o, digite uma descri&ccedil;&atilde;o do mapa de seguran&ccedil;a do trabalho.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Status Ativado para ativar o mapa de seguran&ccedil;a de trabalho.</p>
<p>Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</li>
<li>
<p>Clique em OK.</p>
</li>
</ol>
<a id="sthref38" name="sthref38"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-connectorresourcenew.html">Para Criar um Recurso do Conector</a></p>
</li>
<li>
<p><a href="task-connectorresourceedit.html">Para Editar um Recurso do Conector</a></p>
</li>
<li>
<p><a href="task-connectorresourcesdelete.html">Para Deletar um Recurso Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolnew.html">Para Criar um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">Para Editar um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">Editar Atributos Avan&ccedil;ados do Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">Para Editar Propriedades do Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">Para Criar um Mapa de Seguran&ccedil;a para um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">Para Editar um Mapa de Seguran&ccedil;a de um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">Para Deletar um Mapa de Seguran&ccedil;a de um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">Para Deletar um Pool de Conex&otilde;es do Conector</a></p>
</li>
<li>
<p><a href="task-setupeisaccess.html">Para Configurar Acesso ao EIS</a></p>
</li>
<li>
<p><a href="task-adminobjectnew.html">Para Criar um Recurso do Objeto Administrado</a></p>
</li>
<li>
<p><a href="task-adminobjectedit.html">Para Editar um Recurso do Objeto Administrado</a></p>
</li>
<li>
<p><a href="task-administeredobjectresourcedelete.html">Para Deletar um Recurso de Objeto Administrado</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">Para Editar um Mapa de Seguran&ccedil;a de Trabalho</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">Para Deletar um Mapa de Seguran&ccedil;a de Trabalho</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
