<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-transactionservice" name="ref-transactionservice"></a><a id="GHJTS00002" name="GHJTS00002"></a></p>

<h4><a id="sthref14" name="sthref14"></a>&#53944;&#47004;&#51117;&#49496; &#49436;&#48708;&#49828;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#53944;&#47004;&#51117;&#49496; &#49436;&#48708;&#49828;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#53944;&#47004;&#51117;&#49496; &#48373;&#44396;, &#49884;&#44036; &#52488;&#44284; &#48143; &#47196;&#44613;&#51012; &#44396;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>[&#53944;&#47004;&#51117;&#49496; &#49436;&#48708;&#49828;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44592;&#48376;&#44050; &#47196;&#46300;</dt>
<dd>
<p>&#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#45716; &#49444;&#51221;&#51012; &#44592;&#48376;&#44050;&#51004;&#47196; &#48373;&#50896;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#49444;&#51221;&#51008; &#48320;&#44221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#44396;&#49457; &#51060;&#47492;</dt>
<dd>
<p>&#51060; &#54168;&#51060;&#51648;&#51032; &#49444;&#51221;&#51060; &#51201;&#50857;&#46104;&#45716; &#44396;&#49457;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#51069;&#44592; &#51204;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51116;&#49884;&#51089; &#49884;</dt>
<dd>
<p>[&#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#44032; &#49440;&#53469;&#46104;&#50612; &#51080;&#51004;&#47732; GlassFish Server&#50640;&#49436; &#49436;&#48260;&#44032; &#51116;&#49884;&#51089;&#54624; &#46412; &#50756;&#47308;&#46104;&#51648; &#50506;&#51008; &#53944;&#47004;&#51117;&#49496;&#51012; &#48373;&#44396;&#54616;&#47140; &#54633;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#53944;&#47004;&#51117;&#49496; &#49884;&#44036; &#52488;&#44284;</dt>
<dd>
<p>&#49436;&#48260;&#44032; &#50756;&#47308;&#46104;&#51648; &#50506;&#51008; &#53944;&#47004;&#51117;&#49496;&#51012; &#47204;&#48177;&#54616;&#44592; &#51204;&#50640; &#45824;&#44592;&#54616;&#45716; &#49884;&#44036;(&#52488;)&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 0&#51060;&#47728;, &#51060;&#46412; &#49436;&#48260;&#45716; &#53944;&#47004;&#51117;&#49496;&#51060; &#50756;&#47308;&#46112; &#46412;&#44620;&#51648; &#47924;&#44592;&#54620; &#44592;&#45796;&#47549;&#45768;&#45796;.</p>
</dd>
<dt>&#51116;&#49884;&#46020; &#49884;&#44036; &#52488;&#44284;</dt>
<dd>
<p>GlassFish Server&#50640;&#49436; &#51217;&#49549;&#54624; &#49688; &#50630;&#45716; &#49436;&#48260;&#50640; &#51217;&#49549;&#51012; &#49884;&#46020;&#54616;&#45716; &#49884;&#44036;(&#52488;)&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 600(10&#48516;)&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#53944;&#47004;&#51117;&#49496; &#47196;&#44536; &#50948;&#52824;</dt>
<dd>
<p>&#49436;&#48260; &#47196;&#44536;&#44032; &#51200;&#51109;&#46104;&#45716; &#46356;&#47113;&#53664;&#47532;&#51077;&#45768;&#45796;. &#53944;&#47004;&#51117;&#49496; &#47196;&#44536;&#45716; &#51060; &#54596;&#46300;&#50640;&#49436; &#51648;&#51221;&#54620; &#46356;&#47113;&#53664;&#47532;&#51032; <code>tx</code> &#54616;&#50948; &#46356;&#47113;&#53664;&#47532;&#50640; &#51200;&#51109;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; GlassFish Server &#45432;&#46300;&#51032; [&#44256;&#44553;] &#53485; &#50500;&#47000;&#50640; &#51080;&#45716; [&#46020;&#47700;&#51064; &#49549;&#49457;] &#54168;&#51060;&#51648;&#51032; [&#47196;&#44536; &#47336;&#53944;] &#54596;&#46300;&#50640; &#51648;&#51221;&#46108; &#46356;&#47113;&#53664;&#47532;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#48156;&#44204;&#51201; &#54032;&#45800;</dt>
<dd>
<p>&#50672;&#44208;&#54624; &#49688; &#50630;&#45716; &#49436;&#48260;&#50752; &#44288;&#47144;&#46108; &#53944;&#47004;&#51117;&#49496;&#51012; &#52964;&#48139;&#54624;&#51648; &#46608;&#45716; &#47204;&#48177;&#54624;&#51648; &#50668;&#48512;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; &#47204;&#48177;&#51077;&#45768;&#45796;. &#54869;&#51221;&#46104;&#51648; &#50506;&#51008; &#53944;&#47004;&#51117;&#49496;&#51012; &#52964;&#48139;&#54616;&#47732; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51032; &#45936;&#51060;&#53552; &#47924;&#44208;&#49457;&#51060; &#49552;&#49345;&#46112; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#53412;&#54252;&#51064;&#53944; &#44036;&#44201;</dt>
<dd>
<p>&#53944;&#47004;&#51117;&#49496; &#47196;&#44536; &#54028;&#51068;&#51012; &#50517;&#52629;&#54616;&#45716; &#53412;&#54252;&#51064;&#53944; &#51089;&#50629; &#44036;&#51032; &#53944;&#47004;&#51117;&#49496; &#49688;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 65,536&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52628;&#44032; &#49549;&#49457;</dt>
<dd>
<p>&#53944;&#47004;&#51117;&#49496; &#49436;&#48708;&#49828;&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51077;&#45768;&#45796;.</p>
<p>&#49324;&#50857; &#44032;&#45733;&#54620; &#49549;&#49457;&#50640; &#45824;&#54620; &#49444;&#47749;&#51008; <a href="ref-transactionsvcproperties.html">&#53944;&#47004;&#51117;&#49496; &#49436;&#48708;&#49828; &#44288;&#47144; &#49549;&#49457;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</dd>
</dl>
<a id="sthref15" name="sthref15"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-configtransservice.html">&#53944;&#47004;&#51117;&#49496; &#49436;&#48708;&#49828;&#47484; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-configtransrecovery.html">GlassFish Server&#51032; &#53944;&#47004;&#51117;&#49496; &#48373;&#44396; &#48169;&#49885;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-settranstimeout.html">&#53944;&#47004;&#51117;&#49496; &#49884;&#44036; &#52488;&#44284; &#44050;&#51012; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-settranslog.html">&#53944;&#47004;&#51117;&#49496; &#47196;&#44536; &#50948;&#52824;&#47484; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-setkeyptinterval.html">&#53412;&#54252;&#51064;&#53944; &#44036;&#44201;&#51012; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
