<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-transactionsvcproperties" name="ref-transactionsvcproperties"></a></p>

<h4><a id="sthref16" name="sthref16"></a><a id="sthref17" name="sthref17"></a>&#53944;&#47004;&#51117;&#49496; &#49436;&#48708;&#49828; &#44288;&#47144; &#49549;&#49457;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#53944;&#47004;&#51117;&#49496; &#49436;&#48708;&#49828;&#47484; &#44396;&#49457;&#54616;&#45716; &#45936; &#49324;&#50857;&#54624; &#49688; &#51080;&#45716; &#49549;&#49457;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt><code>oracle-xa-recovery-workaround</code></dt>
<dd>
<p><code>true</code>&#47196; &#49444;&#51221;&#54616;&#47732; &#53944;&#47004;&#51117;&#49496; &#48373;&#44396;&#50640; Oracle XA &#47532;&#49548;&#49828; &#54644;&#44208; &#48169;&#48277;&#51060; &#49324;&#50857;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>true</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>disable-distributed-transaction-logging</code></dt>
<dd>
<p><code>true</code>&#47196; &#49444;&#51221;&#54616;&#47732; &#53944;&#47004;&#51117;&#49496; &#47196;&#44613;&#51012; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54616;&#50668; &#49457;&#45733;&#51012; &#54693;&#49345;&#49884;&#53420; &#49688; &#51080;&#49845;&#45768;&#45796;. [&#51116;&#49884;&#51089; &#49884; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#44032; &#49440;&#53469;&#46104;&#50612; &#51080;&#51004;&#47732; &#51060; &#49549;&#49457;&#51008; &#47924;&#49884;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>false</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>xaresource-txn-timeout</code></dt>
<dd>
<p><code>XAResource</code> &#49884;&#44036; &#52488;&#44284;&#47484; &#48320;&#44221;&#54633;&#45768;&#45796;. <code>XAResource</code> &#44592;&#48376; &#49884;&#44036; &#52488;&#44284;&#47484; &#49324;&#50857;&#54624; &#44221;&#50864; &#53944;&#47004;&#51117;&#49496;&#51060; &#51473;&#45800;&#46112; &#49688; &#51080;&#45716;&#45936;, &#51060; &#44221;&#50864; &#49884;&#44036; &#52488;&#44284;&#47484; &#48320;&#44221;&#54616;&#45716; &#44163;&#51060; &#51339;&#49845;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; &#49324;&#50857;&#46108; <code>XAResource</code>&#50640;&#47564; &#51201;&#50857;&#46121;&#45768;&#45796;.</p>
</dd>
<dt><code>pending-txn-cleanup-interval</code></dt>
<dd>
<p>&#48708;&#46041;&#44592; &#49828;&#47112;&#46300;&#50640;&#49436; &#48372;&#47448; &#51473;&#51064; &#53944;&#47004;&#51117;&#49496;&#51012; &#54869;&#51064;&#54616;&#44256; &#50756;&#47308;&#54616;&#45716; &#44036;&#44201;(&#52488;)&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. &#51060; &#49549;&#49457;&#51012; &#51648;&#51221;&#54616;&#51648; &#50506;&#51012; &#44221;&#50864; &#49324;&#50857;&#46104;&#45716; &#44592;&#48376;&#44050;&#51008; &#50630;&#49845;&#45768;&#45796;. &#51060; &#49549;&#49457;&#51060; &#51080;&#51648;&#47564; &#44050;&#51060; &#50630;&#45716; &#44221;&#50864;&#51032; &#44592;&#48376;&#44050;&#51008; 60&#51077;&#51060;&#45796;.</p>
</dd>
<dt><code>use-last-agent-optimization</code></dt>
<dd>
<p><code>true</code>&#47196; &#49444;&#51221;&#54616;&#47732; &#47560;&#51648;&#47561; &#50640;&#51060;&#51204;&#53944; &#52572;&#51201;&#54868;&#47484; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#50668; &#53944;&#47004;&#51117;&#49496; &#52376;&#47532;&#47049;&#51012; &#54693;&#49345;&#49884;&#53429;&#45768;&#45796;. &#44057;&#51008; &#53944;&#47004;&#51117;&#49496;&#50640;&#49436; XA &#47532;&#49548;&#49828;&#50752; &#54632;&#44760; XA&#44032; &#50500;&#45772; &#47532;&#49548;&#49828;&#47484; &#49324;&#50857;&#54620; &#44221;&#50864;&#50640;&#45716; XA&#44032; &#50500;&#45772; &#47532;&#49548;&#49828;&#44032; &#47560;&#51648;&#47561; &#50640;&#51060;&#51204;&#53944;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>true</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>delegated-recovery</code></dt>
<dd>
<p><code>true</code>&#47196; &#49444;&#51221;&#54616;&#47732; &#53364;&#47084;&#49828;&#53552; &#51204;&#52404;&#51032; &#50948;&#51076; &#48373;&#44396;&#44032; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; false&#51077;&#45768;&#45796;.</p>
</dd>
<dt><code>wait-time-before-recovery-insec</code></dt>
<dd>
<p>&#49324;&#50857; &#48520;&#45733; &#49345;&#53468;&#51064; &#51064;&#49828;&#53556;&#49828;&#51032; &#48373;&#44396;&#47484; &#49884;&#51089;&#54624; &#46412;&#44620;&#51648; &#45824;&#44592;&#54616;&#45716; &#49884;&#44036;(&#52488;)&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
</dd>
<dt><code>db-logging-resource</code></dt>
<dd>
<p>&#53944;&#47004;&#51117;&#49496;&#51012; &#47196;&#44613;&#54616;&#45716; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#51032; JDBC &#47532;&#49548;&#49828;&#50640; &#45824;&#54644; JNDI &#51060;&#47492;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDVG00018"><i>Oracle GlassFish Server Application Development Guide</i>&#51032; 17&#51109;, <i>Using the Transaction Service</i></a>&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;. &#44592;&#48376;&#44050;&#51008; &#50630;&#49845;&#45768;&#45796;.</p>
</dd>
<dt><code>xa-servername</code></dt>
<dd>
<p>&#49444;&#52824;&#46108; GlassFish Server&#50640;&#49436; &#44288;&#47532;&#54616;&#45716; &#53944;&#47004;&#51117;&#49496;&#51012; &#49885;&#48324;&#54624; &#46412; &#53944;&#47004;&#51117;&#49496; &#49436;&#48708;&#49828;&#50640;&#49436; &#49324;&#50857;&#54616;&#45716; &#54840;&#49828;&#53944; &#51060;&#47492;&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. &#51060;&#45716; GlassFish Server&#47484; &#49892;&#54665;&#54616;&#45716; &#45796;&#47480; &#54840;&#49828;&#53944;&#50640;&#49436; &#49373;&#49457;&#54620; &#47196;&#44536; &#54028;&#51068;&#47196;&#48512;&#53552; &#53944;&#47004;&#51117;&#49496;&#51012; &#48373;&#44396;&#54624; &#44221;&#50864;&#50640; &#50976;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
</dl>





<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
