<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-appedit" name="ref-appedit"></a></p>

<h4><a id="sthref159" name="sthref159"></a>&#32534;&#36753;&#24212;&#29992;&#31243;&#24207;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&ldquo;&#32534;&#36753;&#24212;&#29992;&#31243;&#24207;&rdquo;&#39029;&#21487;&#20197;&#20462;&#25913;&#29616;&#26377;&#30340;&#24212;&#29992;&#31243;&#24207;&#12290;</p>
<p>&ldquo;&#32534;&#36753;&#24212;&#29992;&#31243;&#24207;&rdquo;&#39029;&#21253;&#25324;&#20197;&#19979;&#37096;&#20998;&#25110;&#20840;&#37096;&#36873;&#39033;&#65292;&#20855;&#20307;&#21462;&#20915;&#20110;&#24212;&#29992;&#31243;&#24207;&#31867;&#22411;&#12290;</p>
<dl>
<dt>&#21517;&#31216;</dt>
<dd>
<p>&#26174;&#31034;&#25152;&#32534;&#36753;&#30340;&#24212;&#29992;&#31243;&#24207;&#21517;&#31216;&#30340;&#21482;&#35835;&#23383;&#27573;&#12290;</p>
<p>&#21517;&#31216;&#21487;&#21253;&#21547;&#21487;&#36873;&#30340;&#29256;&#26412;&#26631;&#35782;&#31526;&#65292;&#23427;&#36319;&#22312;&#21517;&#31216;&#21518;&#38754;&#65292;&#24182;&#19982;&#21517;&#31216;&#20197;&#20882;&#21495; (<code>:</code>) &#20998;&#38548;&#12290;&#26377;&#20851;&#27169;&#22359;&#21644;&#24212;&#29992;&#31243;&#24207;&#29256;&#26412;&#30340;&#35814;&#32454;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Oracle GlassFish Server Application Deployment Guide</i> &#20013;&#30340; <i>Module and Application Versions</i></a>&#12290;</p>
</dd>
<dt>&#29366;&#24577;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&ldquo;&#24050;&#21551;&#29992;&rdquo;&#22797;&#36873;&#26694;&#65292;&#21017;&#23558;&#21551;&#29992;&#24212;&#29992;&#31243;&#24207;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#27492;&#36873;&#39033;&#24050;&#36873;&#20013;&#12290;</p>
</dd>
<dt>&#19978;&#19979;&#25991;&#26681;&#30446;&#24405;</dt>
<dd>
<p>&#23545;&#20110; Web &#24212;&#29992;&#31243;&#24207;&#65292;&#25351;&#23450;&#24212;&#29992;&#31243;&#24207;&#36335;&#24452;&#12290;&#22312; Web &#24212;&#29992;&#31243;&#24207;&#30340; URL &#20013;&#65292;&#19978;&#19979;&#25991;&#26681;&#30446;&#24405;&#35201;&#32039;&#36319;&#30528;&#31471;&#21475;&#21495; (<code>http://</code><i>host</i><code>:</code><i>port</i><code>/</code><i>context-root</i><code>/...</code>)&#12290;&#19978;&#19979;&#25991;&#26681;&#30446;&#24405;&#24517;&#39035;&#20197;&#27491;&#26012;&#26464;&#24320;&#22836;&#65292;&#20363;&#22914;&#65306;<code>/hello</code>&#12290;</p>
</dd>
<dt>&#21487;&#29992;&#24615;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&ldquo;&#24050;&#21551;&#29992;&rdquo;&#22797;&#36873;&#26694;&#65292;&#21017;&#20026; Web &#20250;&#35805;&#21644;&#26377;&#29366;&#24577;&#20250;&#35805; Bean (SFSB) &#26816;&#26597;&#28857;&#25805;&#20316;&#21644;&#28508;&#22312;&#38045;&#21270;&#21551;&#29992;&#39640;&#21487;&#29992;&#24615;&#12290;&#22914;&#26524;&#35774;&#32622;&#20026;&ldquo;&#20551;&rdquo;(&#40664;&#35748;&#20540;)&#65292;&#21017;&#23545;&#25351;&#23450;&#24212;&#29992;&#31243;&#24207;&#12289;Web &#24212;&#29992;&#31243;&#24207;&#25110; EJB &#27169;&#22359;&#31105;&#29992;&#25152;&#26377; Web &#20250;&#35805;&#20445;&#23384;&#21644; SFSB &#26816;&#26597;&#28857;&#25805;&#20316;&#12290;&#22914;&#26524;&#35774;&#32622;&#20026;&ldquo;&#30495;&rdquo;&#65292;&#21017;&#20026;&#25351;&#23450;&#30340;&#24212;&#29992;&#31243;&#24207;&#25110;&#27169;&#22359;&#21551;&#29992;&#39640;&#21487;&#29992;&#24615;&#12290;&#20165;&#24403;&#22312;&#26356;&#39640;&#32423;&#21035;&#19978; (&#20363;&#22914;&#26381;&#21153;&#22120;&#32423;&#21035;&#21644;&#23481;&#22120;&#32423;&#21035;) &#37197;&#32622;&#21644;&#21551;&#29992;&#39640;&#21487;&#29992;&#24615;&#26102;&#65292;&#27492;&#36873;&#39033;&#25165;&#35774;&#32622;&#20026;&ldquo;&#30495;&rdquo;&#12290;</p>
<p>&#22914;&#26524;&#38500;&#40664;&#35748;&#26381;&#21153;&#22120;&#23454;&#20363; (<code>server</code>) &#20197;&#22806;&#36824;&#23384;&#22312;&#38598;&#32676;&#25110;&#29420;&#31435;&#26381;&#21153;&#22120;&#23454;&#20363;&#65292;&#21017;&#20250;&#26174;&#31034;&#35813;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#34394;&#25311;&#26381;&#21153;&#22120;</dt>
<dd>
<p>&#19982;&#27492;&#24212;&#29992;&#31243;&#24207;&#30456;&#20851;&#32852;&#30340;&#34394;&#25311;&#26381;&#21153;&#22120;&#12290;</p>
<p>&#20165;&#24403;&#23384;&#22312;&#40664;&#35748;&#26381;&#21153;&#22120;&#23454;&#20363; <code>server</code> &#26102;&#65292;&#25165;&#20250;&#26174;&#31034;&ldquo;&#34394;&#25311;&#26381;&#21153;&#22120;&rdquo;&#36873;&#39033;&#12290;&#22914;&#26524;&#23384;&#22312;&#38598;&#32676;&#25110;&#20854;&#20182;&#29420;&#31435;&#26381;&#21153;&#22120;&#23454;&#20363;&#65292;&#21017;&#21487;&#20197;&#22312;&#37096;&#32626;&#21518;&#36873;&#25321;&#34394;&#25311;&#26381;&#21153;&#22120;&#12290;&#36716;&#33267;&ldquo;&#32534;&#36753;&#24212;&#29992;&#31243;&#24207;&rdquo;&#39029;&#65292;&#36873;&#25321;&ldquo;&#30446;&#26631;&rdquo;&#36873;&#39033;&#21345;&#65292;&#28982;&#21518;&#20026;&#25152;&#38656;&#30446;&#26631;&#36873;&#25321;&ldquo;&#31649;&#29702;&#34394;&#25311;&#26381;&#21153;&#22120;&rdquo;&#12290;</p>
</dd>
<dt>Java Web Start</dt>
<dd>
<p>(&#23545;&#20110;&#26576;&#20123;&#24212;&#29992;&#31243;&#24207;&#31867;&#22411;) &#22914;&#26524;&#36873;&#20013;&ldquo;&#24050;&#21551;&#29992;&rdquo;&#22797;&#36873;&#26694;&#65292;&#21017;&#24212;&#29992;&#31243;&#24207;&#23558;&#20351;&#29992; Java Web Start &#36719;&#20214;&#12290;Java Web Start &#25552;&#20379;&#20102;&#19968;&#31181;&#19982;&#27983;&#35272;&#22120;&#26080;&#20851;&#30340;&#37096;&#32626;&#26041;&#24335;&#65292;&#21487;&#23558; Java &#24212;&#29992;&#31243;&#24207;&#37096;&#32626;&#20026;&#22312;&#19987;&#29992; Java &#34394;&#25311;&#26426;&#20013;&#36816;&#34892;&#12290;</p>
</dd>
<dt>&#35828;&#26126;</dt>
<dd>
<p>&#24212;&#29992;&#31243;&#24207;&#30340;&#31616;&#35201;&#35828;&#26126;&#12290;</p>
</dd>
<dt>&#20301;&#32622;</dt>
<dd>
<p>&#24050;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;&#30340;&#20301;&#32622;&#12290;&#36825;&#26159;&#21482;&#35835;&#23383;&#27573;&#12290;</p>
</dd>
<dt>&#37096;&#32626;&#39034;&#24207;</dt>
<dd>
<p>&#24212;&#29992;&#31243;&#24207;&#30340;&#37096;&#32626;&#39034;&#24207;&#12290;</p>
<p>&#22312;&#26381;&#21153;&#22120;&#21551;&#21160;&#26102;&#20808;&#21152;&#36733;&#32534;&#21495;&#36739;&#20302;&#30340;&#24212;&#29992;&#31243;&#24207;&#12290;&#37096;&#32626;&#39034;&#24207;&#20026; 102 &#30340;&#24212;&#29992;&#31243;&#24207;&#22312;&#37096;&#32626;&#39034;&#24207;&#20026; 110 &#30340;&#24212;&#29992;&#31243;&#24207;&#20043;&#21069;&#21152;&#36733;&#12290;&#22914;&#26524;&#22312;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#26102;&#26410;&#25351;&#23450;&#37096;&#32626;&#39034;&#24207;&#65292;&#23558;&#20998;&#37197;&#40664;&#35748;&#37096;&#32626;&#39034;&#24207; 100&#12290;&#22914;&#26524;&#20004;&#20010;&#24212;&#29992;&#31243;&#24207;&#30340;&#37096;&#32626;&#39034;&#24207;&#30456;&#21516;&#65292;&#21017;&#39318;&#20808;&#21152;&#36733;&#20808;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;&#12290;&#22914;&#26524;&#24212;&#29992;&#31243;&#24207;&#20855;&#26377;&#30456;&#20851;&#24615;&#19988;&#24517;&#39035;&#25353;&#29305;&#23450;&#39034;&#24207;&#21152;&#36733;&#65292;&#21017;&#25351;&#23450;&#37096;&#32626;&#39034;&#24207;&#38750;&#24120;&#26377;&#29992;&#12290;</p>
</dd>
<dt>&#24211;</dt>
<dd>
<p>&#24212;&#29992;&#31243;&#24207;&#25152;&#38656;&#30340;&#24211; JAR &#25991;&#20214;&#12290;&#36825;&#26159;&#21482;&#35835;&#23383;&#27573;&#12290;</p>
</dd>
<dt>&#27169;&#22359;&#21644;&#32452;&#20214;</dt>
<dd>
<p>&#26174;&#31034;&#24212;&#29992;&#31243;&#24207;&#27169;&#22359;&#21450;&#20854;&#24341;&#25806;&#21517;&#31216;&#30340;&#34920;&#12290;&#23545;&#20110; Web &#26381;&#21153;&#31471;&#28857;&#65292;&#21487;&#20197;&#36873;&#25321;&ldquo;&#26597;&#30475;&#31471;&#28857;&rdquo;&#26469;&#26174;&#31034;&ldquo;Web &#26381;&#21153;&#31471;&#28857;&#20449;&#24687;&rdquo;&#39029;&#12290;&#23545;&#20110;&#24212;&#29992;&#31243;&#24207;&#23458;&#25143;&#26426;&#65292;&#21487;&#20197;&#36873;&#25321;&ldquo;&#21551;&#21160;&rdquo;&#26469;&#26174;&#31034;&ldquo;&#24212;&#29992;&#31243;&#24207;&#23458;&#25143;&#26426;&#21551;&#21160;&rdquo;&#39029;&#25110;&#36873;&#25321;&ldquo;&#19979;&#36733;&rdquo;&#26469;&#19979;&#36733;&#23458;&#25143;&#26426;&#23384;&#26681;&#12290;</p>
</dd>
</dl>
<a id="GHCOM368" name="GHCOM368"></a>
<h5>&#30456;&#20851;&#20219;&#21153;</h5>
<ul>
<li>
<p><a href="task-appedit.html">&#32534;&#36753;&#24050;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-applistdeployed.html">&#26597;&#30475;&#24050;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#21015;&#34920;</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">&#37096;&#32626; Web &#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">&#37096;&#32626;&#20225;&#19994;&#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#23458;&#25143;&#26426;</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">&#37096;&#32626;&#36830;&#25509;&#22120;&#27169;&#22359;</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">&#37096;&#32626; EJB Jar</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">&#26597;&#30475;&#24212;&#29992;&#31243;&#24207;&#30340;&#25551;&#36848;&#31526;</a></p>
</li>
<li>
<p><a href="task-appviewtargets.html">&#26597;&#30475;&#24212;&#29992;&#31243;&#24207;&#30446;&#26631;</a></p>
</li>
<li>
<p><a href="task-endpoint.html">&#26597;&#30475; Web &#26381;&#21153;&#31471;&#28857;&#20449;&#24687;</a></p>
</li>
<li>
<p><a href="task-applaunch.html">&#21551;&#21160;&#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">&#21551;&#21160;&#24212;&#29992;&#31243;&#24207;&#23458;&#25143;&#26426;</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">&#19979;&#36733;&#24212;&#29992;&#31243;&#24207;&#23458;&#25143;&#26426;&#23384;&#26681;</a></p>
</li>
<li>
<p><a href="task-appredeploy.html">&#37325;&#26032;&#37096;&#32626;&#24050;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-apprestart.html">&#37325;&#26032;&#21152;&#36733;&#24050;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">&#26597;&#30475;&#24212;&#29992;&#31243;&#24207;&#33539;&#22260;&#30340;&#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">&#20462;&#25913;&#24212;&#29992;&#31243;&#24207;&#33539;&#22260;&#30340;&#36164;&#28304;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
