<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-messagesecurityconfigedit" name="ref-messagesecurityconfigedit"></a></p>

<h4><a id="sthref229" name="sthref229"></a>&#32534;&#36753;&#28040;&#24687;&#23433;&#20840;&#37197;&#32622;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&ldquo;&#32534;&#36753;&#28040;&#24687;&#23433;&#20840;&#37197;&#32622;&rdquo;&#39029;&#21487;&#20197;&#20026;&#28040;&#24687;&#23433;&#20840;&#21551;&#29992;&#25552;&#20379;&#26041;&#12290;</p>
<p>&#35201;&#20026;&#22312; GlassFish Server &#20013;&#37096;&#32626;&#30340; Web &#26381;&#21153;&#31471;&#28857;&#21551;&#29992;&#28040;&#24687;&#23433;&#20840;&#65292;&#24517;&#39035;&#25351;&#23450;&#35201;&#22312;&#26381;&#21153;&#22120;&#31471;&#40664;&#35748;&#20351;&#29992;&#30340;&#25552;&#20379;&#26041;&#12290;&#22914;&#26524;&#20026;&#28040;&#24687;&#23433;&#20840;&#21551;&#29992;&#20102;&#40664;&#35748;&#25552;&#20379;&#26041;&#65292;&#24744;&#36824;&#38656;&#35201;&#21551;&#29992;&#35201;&#30001; GlassFish Server &#20013;&#37096;&#32626;&#30340; Web &#26381;&#21153;&#23458;&#25143;&#26426;&#25152;&#20351;&#29992;&#30340;&#25552;&#20379;&#26041;&#12290;<a href="task-enablemesec4appclients.html">&#20026;&#24212;&#29992;&#31243;&#24207;&#23458;&#25143;&#26426;&#21551;&#29992;&#28040;&#24687;&#23433;&#20840;</a>&#20013;&#20171;&#32461;&#20102;&#26377;&#20851;&#21551;&#29992;&#30001;&#23458;&#25143;&#26426;&#20351;&#29992;&#30340;&#25552;&#20379;&#26041;&#30340;&#20449;&#24687;&#12290;</p>
<p>&#35201;&#20026;&#28304;&#20110;&#24050;&#37096;&#32626;&#30340;&#31471;&#28857;&#30340; Web &#26381;&#21153;&#35843;&#29992;&#21551;&#29992;&#28040;&#24687;&#23433;&#20840;&#65292;&#24744;&#24517;&#39035;&#25351;&#23450;&#40664;&#35748;&#30340;&#23458;&#25143;&#26426;&#25552;&#20379;&#26041;&#12290;&#22914;&#26524;&#24050;&#20026; GlassFish Server &#21551;&#29992;&#20102;&#40664;&#35748;&#30340;&#23458;&#25143;&#26426;&#25552;&#20379;&#26041;&#65292;&#21017;&#24517;&#39035;&#30830;&#20445;&#20174; GlassFish Server &#20013;&#37096;&#32626;&#30340;&#31471;&#28857;&#20013;&#35843;&#29992;&#30340;&#25152;&#26377;&#26381;&#21153;&#22343;&#24050;&#37197;&#32622;&#20026;&#19982;&#28040;&#24687;&#23618;&#23433;&#20840;&#24615;&#20860;&#23481;&#12290;</p>
<p>&ldquo;&#32534;&#36753;&#28040;&#24687;&#23433;&#20840;&#37197;&#32622;&rdquo;&#39029;&#21253;&#21547;&#20197;&#19979;&#36873;&#39033;&#12290;</p>
<dl>
<dt>&#37197;&#32622;&#21517;&#31216;</dt>
<dd>
<p>&#27492;&#39029;&#19978;&#30340;&#35774;&#32622;&#24212;&#29992;&#21040;&#30340;&#37197;&#32622;&#30340;&#21517;&#31216;&#12290;&#27492;&#23383;&#27573;&#20026;&#21482;&#35835;&#12290;</p>
</dd>
<dt>&#39564;&#35777;&#23618;</dt>
<dd>
<p>&#25191;&#34892;&#39564;&#35777;&#30340;&#28040;&#24687;&#23618;&#12290;&#36825;&#26159;&#21482;&#35835;&#23383;&#27573;&#12290;&#27492;&#20540;&#20026; <code>SOAP</code> (&#23545;&#20110;&#40664;&#35748;&#28040;&#24687;&#23433;&#20840;&#37197;&#32622;) &#25110; <code>HttpServlet</code>&#12290;</p>
</dd>
<dt>&#40664;&#35748;&#25552;&#20379;&#26041;</dt>
<dd>
<p>&#40664;&#35748;&#26381;&#21153;&#22120;&#31471;&#25552;&#20379;&#26041; (&#22914;&#26524;&#26377;)&#12290;&#23545;&#20110;&#27809;&#26377;&#25351;&#23450;&#29305;&#23450;&#26381;&#21153;&#22120;&#25552;&#20379;&#26041;&#30340;&#24212;&#29992;&#31243;&#24207;&#65292;&#40664;&#35748;&#26381;&#21153;&#22120;&#25552;&#20379;&#26041; (&#20063;&#31216;&#20026;&#40664;&#35748;&#25552;&#20379;&#26041;) &#23601;&#20250;&#34987;&#25351;&#23450;&#20026;&#20026;&#20854;&#35843;&#29992;&#30340;&#26381;&#21153;&#22120;&#25552;&#20379;&#26041;&#12290;&#21487;&#29992;&#36873;&#39033;&#20026; <code>ServerProvider</code>&#12289;<code>XWS_ServerProvider</code> &#25110;&ldquo;&#26080;&rdquo;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#26410;&#36873;&#25321;&#25552;&#20379;&#26041;&#65292;&#22240;&#27492; GlassFish Server &#23558;&#19981;&#20250;&#22312;&#26381;&#21153;&#22120;&#31471;&#35843;&#29992;&#28040;&#24687;&#23433;&#20840;&#25552;&#20379;&#26041;&#12290;&#36890;&#24120;&#65292;&#35831;&#36873;&#25321; <code>ServerProvider</code> &#20316;&#20026;&#40664;&#35748;&#25552;&#20379;&#26041;&#12290;</p>
</dd>
<dt>&#40664;&#35748;&#30340;&#23458;&#25143;&#26426;&#25552;&#20379;&#26041;</dt>
<dd>
<p>&#40664;&#35748;&#30340;&#23458;&#25143;&#26426;&#25552;&#20379;&#26041; (&#22914;&#26524;&#26377;)&#12290;&#23545;&#20110;&#27809;&#26377;&#25351;&#23450;&#29305;&#23450;&#23458;&#25143;&#26426;&#25552;&#20379;&#26041;&#30340;&#24212;&#29992;&#31243;&#24207;&#65292;&#40664;&#35748;&#30340;&#23458;&#25143;&#26426;&#25552;&#20379;&#26041;&#23601;&#20250;&#34987;&#25351;&#23450;&#20026;&#20026;&#20854;&#35843;&#29992;&#30340;&#23458;&#25143;&#26426;&#25552;&#20379;&#26041;&#12290;&#21487;&#29992;&#36873;&#39033;&#20026; <code>ClientProvider</code>&#12289;<code>XWS_ClientProvider</code> &#25110;&ldquo;&#26080;&rdquo;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#26410;&#36873;&#25321;&#25552;&#20379;&#26041;&#65292;&#22240;&#27492; GlassFish Server &#23558;&#19981;&#20250;&#22312;&#23458;&#25143;&#26426;&#31471;&#35843;&#29992;&#28040;&#24687;&#23433;&#20840;&#25552;&#20379;&#26041;&#12290;&#36890;&#24120;&#65292;&#35831;&#20026;&#40664;&#35748;&#30340;&#23458;&#25143;&#26426;&#25552;&#20379;&#26041;&#36873;&#25321;&ldquo;&#26080;&rdquo;&#12290;&#35201;&#21551;&#29992;&#40664;&#35748;&#25552;&#20379;&#26041;&#21644;&#28040;&#24687;&#20445;&#25252;&#31574;&#30053;&#20197;&#24212;&#29992;&#21040;&#28304;&#20110; GlassFish Server &#19978;&#25152;&#37096;&#32626;&#30340; Web &#26381;&#21153;&#31471;&#28857;&#30340; Web &#26381;&#21153;&#35843;&#29992;&#65292;&#35831;&#36873;&#25321; <code>ClientProvider</code>&#12290;</p>
</dd>
</dl>
<a id="GHCOM461" name="GHCOM461"></a>
<h5>&#30456;&#20851;&#20219;&#21153;</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">&#23558; GlassFish Server &#24037;&#20855;&#37197;&#32622;&#20026;&#20379;&#28040;&#24687;&#23433;&#20840;&#25552;&#20379;&#26041;&#20351;&#29992;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">&#21019;&#24314;&#28040;&#24687;&#23433;&#20840;&#37197;&#32622;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">&#32534;&#36753;&#28040;&#24687;&#23433;&#20840;&#37197;&#32622;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">&#21024;&#38500;&#28040;&#24687;&#23433;&#20840;&#37197;&#32622;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfignew.html">&#21019;&#24314;&#28040;&#24687;&#23433;&#20840;&#25552;&#20379;&#26041;&#37197;&#32622;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">&#32534;&#36753;&#28040;&#24687;&#23433;&#20840;&#25552;&#20379;&#26041;&#37197;&#32622;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">&#21024;&#38500;&#28040;&#24687;&#23433;&#20840;&#25552;&#20379;&#26041;&#37197;&#32622;</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">&#20026;&#24212;&#29992;&#31243;&#24207;&#23458;&#25143;&#26426;&#21551;&#29992;&#28040;&#24687;&#23433;&#20840;</a></p>
</li>
</ul>
<a id="GHCOM462" name="GHCOM462"></a>
<h5>&#30456;&#20851;&#30340; asadmin &#21629;&#20196;</h5>
<p>&#20351;&#29992; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00226"><code>set</code>(1)</a> &#21629;&#20196;&#21487;&#20197;&#20462;&#25913;&#28040;&#24687;&#23433;&#20840;&#37197;&#32622;&#12290;</p>
<ul>
<li>
<p>&#35201;&#25351;&#23450;&#40664;&#35748;&#30340;&#26381;&#21153;&#22120;&#25552;&#20379;&#26041;&#65292;&#35831;&#20351;&#29992;&#65306;</p>
<pre>
asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
default_provider=ServerProvider
</pre></li>
<li>
<p>&#35201;&#25351;&#23450;&#40664;&#35748;&#30340;&#23458;&#25143;&#26426;&#25552;&#20379;&#26041;&#65292;&#35831;&#20351;&#29992;&#65306;</p>
<pre>
asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
default_client_provider=ClientProvider
</pre></li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
