<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-generaltab" name="ref-generaltab"></a></p>

<h4><a id="sthref137" name="sthref137"></a><a id="sthref138" name="sthref138"></a>&#19968;&#33324;&#20449;&#24687;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#22312;&#23433;&#35013; GlassFish Server &#26102;&#65292;&#23558;&#21019;&#24314;&#19968;&#20010;&#31216;&#20026; <code>server</code> &#30340;&#24212;&#29992;&#31243;&#24207;&#26381;&#21153;&#22120;&#23454;&#20363;&#12290;&#22914;&#26524;&#38656;&#35201;&#65292;&#21487;&#20197;&#21024;&#38500;&#35813;&#26381;&#21153;&#22120;&#23454;&#20363;&#65292;&#24182;&#20351;&#29992;&#20854;&#20182;&#21517;&#31216;&#21019;&#24314;&#19968;&#20010;&#26032;&#23454;&#20363;&#12290;</p>
<p>&#27599;&#20010; GlassFish Server &#23454;&#20363;&#37117;&#20855;&#26377;&#21508;&#33258;&#30340; Java &#37197;&#32622;&#12289;Java &#36164;&#28304;&#12289;&#24212;&#29992;&#31243;&#24207;&#37096;&#32626;&#21306;&#22495;&#21644;&#26381;&#21153;&#22120;&#37197;&#32622;&#35774;&#32622;&#12290;&#23545;&#19968;&#20010;&#24212;&#29992;&#31243;&#24207;&#26381;&#21153;&#22120;&#23454;&#20363;&#30340;&#26356;&#25913;&#19981;&#20250;&#24433;&#21709;&#21040;&#20854;&#20182;&#24212;&#29992;&#31243;&#24207;&#26381;&#21153;&#22120;&#23454;&#20363;&#12290;&#19968;&#20010;&#31649;&#29702;&#22495;&#20013;&#21487;&#20197;&#26377;&#19968;&#20010;&#24212;&#29992;&#31243;&#24207;&#26381;&#21153;&#22120;&#23454;&#20363;&#12290;</p>
<p>&#23545;&#20110;&#35768;&#22810;&#29992;&#25143;&#26469;&#35828;&#65292;&#19968;&#20010;&#24212;&#29992;&#31243;&#24207;&#26381;&#21153;&#22120;&#23454;&#20363;&#21363;&#21487;&#28385;&#36275;&#20182;&#20204;&#30340;&#38656;&#35201;&#12290;&#20294;&#26159;&#65292;&#26681;&#25454;&#29992;&#25143;&#29615;&#22659;&#30340;&#19981;&#21516;&#65292;&#21487;&#33021;&#38656;&#35201;&#21019;&#24314;&#19968;&#20010;&#25110;&#22810;&#20010;&#38468;&#21152;&#24212;&#29992;&#31243;&#24207;&#26381;&#21153;&#22120;&#23454;&#20363;&#12290;&#20363;&#22914;&#65292;&#22312;&#24320;&#21457;&#29615;&#22659;&#20013;&#65292;&#21487;&#33021;&#38656;&#35201;&#20351;&#29992;&#19981;&#21516;&#30340;&#24212;&#29992;&#31243;&#24207;&#26381;&#21153;&#22120;&#23454;&#20363;&#26469;&#27979;&#35797;&#19981;&#21516;&#30340; GlassFish Server &#37197;&#32622;&#65292;&#25110;&#27604;&#36739;&#21644;&#27979;&#35797;&#19981;&#21516;&#30340;&#24212;&#29992;&#31243;&#24207;&#37096;&#32626;&#12290;&#30001;&#20110;&#21487;&#20197;&#36731;&#26494;&#22320;&#28155;&#21152;&#25110;&#21024;&#38500;&#24212;&#29992;&#31243;&#24207;&#26381;&#21153;&#22120;&#23454;&#20363;&#65292;&#22240;&#27492;&#22312;&#24320;&#21457;&#36807;&#31243;&#20013;&#21487;&#20197;&#20351;&#29992;&#36825;&#20123;&#23454;&#20363;&#21019;&#24314;&#20020;&#26102;&ldquo;&#27801;&#30418;&rdquo;&#21306;&#26469;&#36827;&#34892;&#35797;&#39564;&#12290;</p>
<p>&#27492;&#22806;&#65292;&#23545;&#20110;&#27599;&#20010;&#24212;&#29992;&#31243;&#24207;&#26381;&#21153;&#22120;&#23454;&#20363;&#65292;&#24744;&#36824;&#21487;&#20197;&#21019;&#24314;&#34394;&#25311;&#26381;&#21153;&#22120;&#12290;&#22312;&#23433;&#35013;&#30340;&#21333;&#20010;&#24212;&#29992;&#31243;&#24207;&#26381;&#21153;&#22120;&#23454;&#20363;&#20013;&#65292;&#21487;&#20197;&#25552;&#20379;&#20844;&#21496;&#25110;&#20010;&#20154;&#30340;&#22495;&#21517;&#12289;IP &#22320;&#22336;&#21644;&#26576;&#20123;&#31649;&#29702;&#21151;&#33021;&#12290;&#23545;&#20110;&#29992;&#25143;&#65292;&#36825;&#38750;&#24120;&#36817;&#20284;&#20110;&#20182;&#20204;&#25317;&#26377;&#33258;&#24049;&#30340; Web &#26381;&#21153;&#22120;&#65292;&#20294;&#19981;&#38656;&#35201;&#30828;&#20214;&#21644;&#22522;&#26412;&#30340;&#26381;&#21153;&#22120;&#32500;&#25252;&#12290;&#36825;&#20123;&#34394;&#25311;&#26381;&#21153;&#22120;&#19981;&#36328;&#24212;&#29992;&#31243;&#24207;&#26381;&#21153;&#22120;&#23454;&#20363;&#12290;&#26377;&#20851;&#34394;&#25311;&#26381;&#21153;&#22120;&#30340;&#35814;&#32454;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405;<a href="ref-serverinstjvmgeneral.html">JVM &#24120;&#35268;&#35774;&#32622;</a>&#12290;</p>
<p>&#22312;&#36816;&#33829;&#37096;&#32626;&#20013;&#65292;&#20986;&#20110;&#24456;&#22810;&#21407;&#22240;&#65292;&#21487;&#20351;&#29992;&#34394;&#25311;&#26381;&#21153;&#22120;&#26469;&#20195;&#26367;&#22810;&#20010;&#24212;&#29992;&#31243;&#24207;&#26381;&#21153;&#22120;&#23454;&#20363;&#12290;&#19981;&#36807;&#65292;&#22914;&#26524;&#34394;&#25311;&#26381;&#21153;&#22120;&#19981;&#28385;&#36275;&#24744;&#30340;&#38656;&#27714;&#65292;&#20063;&#21487;&#20197;&#20351;&#29992;&#22810;&#20010;&#24212;&#29992;&#31243;&#24207;&#26381;&#21153;&#22120;&#23454;&#20363;&#12290;</p>
<p>GlassFish Server &#23454;&#20363;&#19981;&#20250;&#33258;&#21160;&#21551;&#21160;&#12290;&#21551;&#21160;&#23454;&#20363;&#21518;&#65292;&#23454;&#20363;&#20250;&#19968;&#30452;&#36816;&#34892;&#65292;&#30452;&#21040;&#24744;&#20572;&#27490;&#23427;&#20026;&#27490;&#12290;&#20572;&#27490;&#24212;&#29992;&#31243;&#24207;&#26381;&#21153;&#22120;&#23454;&#20363;&#26102;&#65292;&#23427;&#23558;&#19981;&#20877;&#25509;&#21463;&#26032;&#30340;&#36830;&#25509;&#65292;&#28982;&#21518;&#31561;&#24453;&#25152;&#26377;&#26410;&#23436;&#25104;&#30340;&#36830;&#25509;&#23436;&#25104;&#12290;&#22914;&#26524;&#35745;&#31639;&#26426;&#23849;&#28291;&#25110;&#33073;&#26426;&#65292;&#21017;&#26381;&#21153;&#22120;&#23558;&#36864;&#20986;&#65292;&#24182;&#19988;&#23427;&#25152;&#22788;&#29702;&#30340;&#20219;&#20309;&#35831;&#27714;&#21487;&#33021;&#20250;&#20002;&#22833;&#12290;</p>
<p>&#20351;&#29992;&ldquo;&#19968;&#33324;&#20449;&#24687;&rdquo;&#39029;&#21487;&#20197;&#39564;&#35777; GlassFish Server &#35774;&#32622;&#20197;&#21450;&#26597;&#30475; Java &#34394;&#25311;&#26426;&#25968;&#25454;&#12290;</p>
<p>&ldquo;&#19968;&#33324;&#20449;&#24687;&rdquo;&#39029;&#21253;&#21547;&#20197;&#19979;&#20449;&#24687;&#12290;</p>
<dl>
<dt>&ldquo;&#20572;&#27490;&rdquo;&#25353;&#38062;</dt>
<dd>
<p>&#21333;&#20987;&ldquo;&#20572;&#27490;&rdquo;&#25353;&#38062;&#20197;&#20572;&#27490; GlassFish Server&#12290;</p>
</dd>
<dt>&ldquo;&#37325;&#26032;&#21551;&#21160;&rdquo;&#25353;&#38062;</dt>
<dd>
<p>&#21333;&#20987;&ldquo;&#37325;&#26032;&#21551;&#21160;&rdquo;&#25353;&#38062;&#20197;&#37325;&#26032;&#21551;&#21160; GlassFish Server&#12290;</p>
</dd>
<dt>&ldquo;&#26597;&#30475;&#26085;&#24535;&#25991;&#20214;&rdquo;&#25353;&#38062;</dt>
<dd>
<p>&#21333;&#20987;&ldquo;&#26597;&#30475;&#26085;&#24535;&#25991;&#20214;&rdquo;&#25353;&#38062;&#21487;&#26597;&#30475; GlassFish Server &#23454;&#20363;&#25110;&#38598;&#32676;&#30340;&#26085;&#24535;&#25991;&#20214;&#12290;</p>
</dd>
<dt>&ldquo;&#28378;&#21160;&#26085;&#24535;&rdquo;&#25353;&#38062;</dt>
<dd>
<p>&#21333;&#20987;&ldquo;&#28378;&#21160;&#26085;&#24535;&rdquo;&#25353;&#38062;&#21487;&#20197;&#28378;&#21160;&#31649;&#29702;&#26381;&#21153;&#22120; (&#21517;&#20026; <code>server</code>) &#30340;&#26085;&#24535;&#25991;&#20214;&#12290;</p>
</dd>
<dt>&ldquo;&#24674;&#22797;&#20107;&#21153;&#22788;&#29702;&rdquo;&#25353;&#38062;</dt>
<dd>
<p>&#21333;&#20987;&ldquo;&#24674;&#22797;&#20107;&#21153;&#22788;&#29702;&rdquo;&#25353;&#38062;&#21487;&#22312;&ldquo;<a href="ref-recovertransactions.html">&#24674;&#22797;&#20107;&#21153;&#22788;&#29702;</a>&rdquo;&#39029;&#19978;&#24674;&#22797;&#31649;&#29702;&#26381;&#21153;&#22120; (&#21517;&#20026; <code>server</code>) &#30340;&#20107;&#21153;&#22788;&#29702;&#12290;</p>
</dd>
<dt>&ldquo;&#23433;&#20840;&#31649;&#29702;&rdquo;&#25353;&#38062;</dt>
<dd>
<p>&#21333;&#20987;&ldquo;&#23433;&#20840;&#31649;&#29702;&rdquo;&#25353;&#38062;&#21487;&#22312;&ldquo;<a href="ref-securityadmin.html">&#23433;&#20840;&#31649;&#29702;</a>&rdquo;&#39029;&#19978;&#21551;&#29992;&#25110;&#31105;&#29992;&#23433;&#20840;&#31649;&#29702;&#12290;</p>
</dd>
<dt>&#21517;&#31216;</dt>
<dd>
<p>&#24403;&#21069;&#26381;&#21153;&#22120;&#30340;&#21517;&#31216;&#12290;</p>
</dd>
<dt>&#29366;&#24577;</dt>
<dd>
<p>&#26381;&#21153;&#22120;&#23454;&#20363;&#30340;&#24403;&#21069;&#29366;&#24577;&#12290;&#26381;&#21153;&#22120;&#21487;&#33021;&#24050;&#20572;&#27490;&#12289;&#24050;&#21551;&#21160;&#25110;&#27491;&#22312;&#36816;&#34892;&#12290;</p>
</dd>
<dt>&#27491;&#24120;&#36816;&#34892;&#26102;&#38388;</dt>
<dd>
<p>&#26381;&#21153;&#22120;&#23454;&#20363;&#24050;&#36830;&#32493;&#36816;&#34892;&#30340;&#23567;&#26102;&#21644;&#20998;&#38047;&#25968;&#12290;&#36825;&#26159;&#21482;&#35835;&#20449;&#24687;&#12290;</p>
</dd>
<dt>HTTP &#36127;&#36733;&#24179;&#34913;&#22120;</dt>
<dd>
<p>&#36127;&#36733;&#24179;&#34913;&#22120;&#30340;&#21517;&#31216; (&#22914;&#26524;&#24050;&#20026;&#26381;&#21153;&#22120;&#23454;&#20363;&#21551;&#29992;&#20102;&#36127;&#36733;&#24179;&#34913;&#22120;)&#12290;</p>
</dd>
<dt>JVM</dt>
<dd>
<p>&#22914;&#26524;&#21333;&#20987;&ldquo;JVM &#25253;&#21578;&rdquo;&#65292;&#21017;&#20250;&#25171;&#24320;&#19968;&#20010;&#21333;&#29420;&#30340;&#31383;&#21475;&#65292;&#27492;&#31383;&#21475;&#26174;&#31034;&#26377;&#20851; Java &#34394;&#25311;&#26426;&#30340;&#25253;&#21578;&#65292;&#21253;&#25324;&#27010;&#35201;&#25253;&#21578;&#12289;&#20869;&#23384;&#31649;&#29702;&#21644;&#22403;&#22334;&#25910;&#38598;&#25253;&#21578;&#12289;&#31867;&#21152;&#36733;&#25253;&#21578;&#21644;&#24403;&#21069;&#32447;&#31243;&#36716;&#20648;&#12290;</p>
</dd>
<dt>&#37197;&#32622;&#30446;&#24405;</dt>
<dd>
<p>&#20027;&#26426;&#19978;&#21253;&#21547;&#37197;&#32622;&#25991;&#20214; (&#20363;&#22914; <code>domain.xml</code>) &#30340;&#30446;&#24405;&#12290;</p>
</dd>
<dt>&#24050;&#23433;&#35013;&#30340;&#29256;&#26412;</dt>
<dd>
<p>&#20135;&#21697;&#29256;&#26412;&#26631;&#35782;&#31526;&#12290;</p>
</dd>
<dt>&#23433;&#20840;&#31649;&#29702;</dt>
<dd>
<p>&#23433;&#20840;&#31649;&#29702;&#30340;&#24403;&#21069;&#29366;&#24577;&#12290;&#21487;&#33021;&#30340;&#20540;&#20026;&ldquo;&#24050;&#21551;&#29992;&rdquo;&#25110;&ldquo;&#26410;&#21551;&#29992;&rdquo;&#12290;</p>
</dd>
<dt>&#35843;&#35797;</dt>
<dd>
<p>&#26631;&#35782;&#26159;&#21542;&#24050;&#21551;&#29992;&#35843;&#35797;&#12290;&#22914;&#26524;&#24050;&#21551;&#29992;&#35843;&#35797;&#65292;&#21017;&#36824;&#20250;&#26174;&#31034;&#31471;&#21475;&#21495;&#12290;</p>
</dd>
<dt>HTTP &#31471;&#21475;</dt>
<dd>
<p>&#24403;&#21069;&#37197;&#32622;&#30340;&#29992;&#20110; HTTP &#35831;&#27714;&#21644;&#21709;&#24212;&#30340;&#31471;&#21475;&#12290;</p>
</dd>
<dt>IIOP &#31471;&#21475;</dt>
<dd>
<p>&#24403;&#21069;&#37197;&#32622;&#30340;&#29992;&#20110; IIOP &#35831;&#27714;&#21644;&#21709;&#24212;&#30340;&#31471;&#21475;&#12290;</p>
</dd>
</dl>
<a id="GHCOM353" name="GHCOM353"></a>
<h5>&#30456;&#20851;&#20219;&#21153;</h5>
<ul>
<li>
<p><a href="task-generaltab.html">&#26597;&#30475; DAS &#30340;&#19968;&#33324;&#20449;&#24687;</a></p>
</li>
<li>
<p><a href="task-logviewer.html">&#26597;&#30475; DAS &#30340;&#26085;&#24535;&#25991;&#20214;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
