<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-logviewer" name="ref-logviewer"></a></p>

<h4><a id="sthref236" name="sthref236"></a><a id="sthref237" name="sthref237"></a><a id="sthref238" name="sthref238"></a>&#26085;&#24535;&#26597;&#30475;&#22120;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&ldquo;&#26085;&#24535;&#26597;&#30475;&#22120;&rdquo;&#39029;&#21487;&#26597;&#30475;&#25152;&#36873; GlassFish Server &#23454;&#20363;&#21644;&#38598;&#32676;&#30340;&#26085;&#24535;&#25991;&#20214;&#65292;&#20197;&#21450;&#23450;&#21046;&#26085;&#24535;&#26174;&#31034;&#12290;</p>
<p>&ldquo;&#26085;&#24535;&#26597;&#30475;&#22120;&rdquo;&#39029;&#21253;&#21547;&#22235;&#20010;&#21306;&#22495;&#65306;</p>
<ul>
<li>
<p>&#25628;&#32034;&#26631;&#20934;</p>
</li>
<li>
<p>&#39640;&#32423;&#25628;&#32034;</p>
</li>
<li>
<p>&#20462;&#25913;&#25628;&#32034;</p>
</li>
<li>
<p>&#25628;&#32034;&#32467;&#26524;</p>
</li>
</ul>
<p>&ldquo;&#25628;&#32034;&#26631;&#20934;&rdquo;&#21306;&#22495;&#21253;&#21547;&#20197;&#19979;&#36873;&#39033;&#12290;</p>
<dl>
<dt>&#39640;&#32423;&#25628;&#32034;</dt>
<dd>
<p>&#21333;&#20987;&#27492;&#38142;&#25509;&#21487;&#20197;&#25171;&#24320;&#19968;&#20010;&#21487;&#35753;&#24744;&#36827;&#19968;&#27493;&#32454;&#21270;&#26085;&#24535;&#26597;&#30475;&#22120;&#25628;&#32034;&#26631;&#20934;&#30340;&#21306;&#22495;&#12290;</p>
</dd>
<dt>&#26102;&#38388;&#25139;</dt>
<dd>
<p>&#21333;&#20987;&ldquo;&#26368;&#36817;&rdquo;&#21333;&#36873;&#25353;&#38062;&#21487;&#20197;&#26174;&#31034;&#26368;&#36817;&#30340;&#28040;&#24687;&#12290;&#21333;&#20987;&ldquo;&#29305;&#23450;&#33539;&#22260;&rdquo;&#21333;&#36873;&#25353;&#38062;&#21487;&#20197;&#25171;&#24320;&ldquo;&#20174;&rdquo;&#23383;&#27573;&#21644;&ldquo;&#21040;&rdquo;&#23383;&#27573;&#65292;&#36890;&#36807;&#36825;&#20004;&#20010;&#23383;&#27573;&#65292;&#21487;&#20197;&#21482;&#26597;&#30475;&#29305;&#23450;&#26102;&#38388;&#27573;&#20869;&#30340;&#28040;&#24687;&#12290;</p>
<p>&#23545;&#20110;&#26102;&#38388;&#20540;&#65292;&#20854;&#35821;&#27861;&#24517;&#39035;&#37319;&#29992;&#20197;&#19979;&#26684;&#24335; (<i>SSS</i> &#34920;&#31034;&#27627;&#31186;)&#65306;</p>
<pre>
<i>hh</i>:<i>mm</i>:<i>ss</i>.<i>SSS</i>
</pre>
<p>&#20363;&#22914;&#65306;</p>
<pre>
17:10:00.000
</pre>
<p>&#22914;&#26524;&ldquo;&#20174;&rdquo;&#23383;&#27573;&#20013;&#30340;&#26102;&#38388;&#20540;&#36831;&#20110;&ldquo;&#21040;&rdquo;&#23383;&#27573;&#20013;&#30340;&#26102;&#38388;&#20540;&#65292;&#23558;&#26174;&#31034;&#38169;&#35823;&#28040;&#24687;&#12290;</p>
</dd>
<dt>&#26085;&#24535;&#32423;&#21035;</dt>
<dd>
<p>&#20026;&#36807;&#28388;&#36873;&#25321;&#30340;&#26085;&#24535;&#32423;&#21035;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#23558;&#26174;&#31034;&#26381;&#21153;&#22120;&#26085;&#24535;&#20013;&#25152;&#36873;&#26085;&#24535;&#32423;&#21035;&#21644;&#26356;&#39640;&#26085;&#24535;&#32423;&#21035;&#30340;&#25152;&#26377;&#28040;&#24687;&#12290;&#36873;&#20013;&#26631;&#26377;&ldquo;&#35831;&#21247;&#21253;&#25324;&#26356;&#20005;&#37325;&#30340;&#28040;&#24687;&rdquo;&#30340;&#22797;&#36873;&#26694;&#23558;&#20165;&#26174;&#31034;&#25152;&#36873;&#32423;&#21035;&#30340;&#28040;&#24687;&#12290;</p>
<p>&#20026;&#30830;&#20445;&#35201;&#26597;&#30475;&#30340;&#28040;&#24687;&#37117;&#26174;&#31034;&#22312;&#26381;&#21153;&#22120;&#26085;&#24535;&#20013;&#65292;&#35831;&#20808;&#22312;&ldquo;&#27169;&#22359;&#26085;&#24535;&#32423;&#21035;&rdquo;&#39029;&#19978;&#35774;&#32622;&#36866;&#24403;&#30340;&#26085;&#24535;&#32423;&#21035;&#12290;&#35831;&#21442;&#38405;<a href="task-eelogginglevels.html">&#37197;&#32622;&#26085;&#24535;&#32423;&#21035;</a>&#12290;</p>
<p>&#22914;&#26524;&#36873;&#25321;&#22522;&#20110;&#26085;&#24535;&#32423;&#21035;&#36807;&#28388;&#26085;&#24535;&#28040;&#24687;&#65292;&#21017;&#23558;&#21482;&#26174;&#31034;&#31526;&#21512;&#25351;&#23450;&#36807;&#28388;&#26465;&#20214;&#30340;&#28040;&#24687;&#12290;&#19981;&#36807;&#65292;&#36825;&#31181;&#36807;&#28388;&#19981;&#24433;&#21709;&#23558;&#21738;&#20123;&#28040;&#24687;&#35760;&#24405;&#21040;&#26381;&#21153;&#22120;&#26085;&#24535;&#20013;&#12290;</p>
</dd>
</dl>
<p>&ldquo;&#39640;&#32423;&#25628;&#32034;&rdquo;&#21306;&#22495;&#21253;&#21547;&#20197;&#19979;&#36873;&#39033;&#12290;</p>
<dl>
<dt>&#26085;&#24535;&#35760;&#24405;&#31243;&#24207;</dt>
<dd>
<p>&#35201;&#26681;&#25454;&#27169;&#22359;&#36807;&#28388;&#30340;&#26085;&#24535;&#35760;&#24405;&#31243;&#24207;&#21517;&#31216;&#31354;&#38388;&#12290;&#36890;&#36807;&#25353;&#20303; Shift &#38190;&#21333;&#20987;&#25110;&#25353;&#20303; Ctrl &#38190;&#21333;&#20987;&#36873;&#25321;&#22810;&#20010;&#21517;&#31216;&#31354;&#38388;&#12290;</p>
<p>&#36873;&#25321;&#36739;&#39640;&#32423;&#21035;&#30340;&#21517;&#31216;&#31354;&#38388;&#20063;&#23601;&#36873;&#25321;&#20102;&#35813;&#21517;&#31216;&#31354;&#38388;&#19979;&#30340;&#25152;&#26377;&#21517;&#31216;&#31354;&#38388;&#12290;&#20363;&#22914;&#65292;&#36873;&#25321; <code>javax.enterprise.system</code> &#30340;&#21516;&#26102;&#20063;&#23601;&#36873;&#25321;&#20102;&#35813;&#21517;&#31216;&#31354;&#38388;&#19979;&#25152;&#26377;&#27169;&#22359;&#30340;&#26085;&#24535;&#35760;&#24405;&#31243;&#24207;&#65306;<code>javax.enterprise.system.core</code>&#12289;<code>javax.enterprise.system.tools.admin</code> &#31561;&#31561;&#12290;</p>
</dd>
<dt>&#23450;&#21046;&#26085;&#24535;&#35760;&#24405;&#31243;&#24207;</dt>
<dd>
<p>&#29305;&#23450;&#20110;&#29305;&#23450;&#24212;&#29992;&#31243;&#24207;&#30340;&#26085;&#24535;&#35760;&#24405;&#31243;&#24207; (&#19968;&#34892;&#19968;&#20010;)&#12290;</p>
<p>&#22914;&#26524;&#24212;&#29992;&#31243;&#24207;&#20855;&#26377;&#22810;&#20010;&#27169;&#22359;&#65292;&#24744;&#21487;&#20197;&#26597;&#30475;&#20219;&#20309;&#27169;&#22359;&#65292;&#20063;&#21487;&#20197;&#26597;&#30475;&#25152;&#26377;&#27169;&#22359;&#12290;&#20363;&#22914;&#65292;&#20551;&#23450;&#24212;&#29992;&#31243;&#24207;&#20855;&#26377;&#20351;&#29992;&#20197;&#19979;&#21517;&#31216;&#30340;&#26085;&#24535;&#35760;&#24405;&#31243;&#24207;&#65306;</p>
<pre>
com.mycompany.myapp.module1
com.mycompany.myapp.module2
com.mycompany.myapp.module3
</pre>
<p>&#35201;&#26597;&#30475;&#24212;&#29992;&#31243;&#24207;&#20013;&#25152;&#26377;&#27169;&#22359;&#30340;&#28040;&#24687;&#65292;&#35831;&#38190;&#20837; <code>com.mycompany.myapp</code>&#12290;&#35201;&#21482;&#26597;&#30475; <code>module2</code> &#30340;&#28040;&#24687;&#65292;&#35831;&#38190;&#20837; <code>com.mycompany.myapp.module2</code>&#12290;</p>
<p>&#25351;&#23450;&#19968;&#20010;&#25110;&#22810;&#20010;&#23450;&#21046;&#26085;&#24535;&#35760;&#24405;&#31243;&#24207;&#26102;&#65292;&#20165;&#24403;&#22312;&ldquo;&#26085;&#24535;&#35760;&#24405;&#31243;&#24207;&rdquo;&#21306;&#22495;&#20013;&#26174;&#24335;&#25351;&#23450;&#20102; GlassFish Server &#27169;&#22359;&#30340;&#28040;&#24687;&#65292;&#25165;&#20250;&#26174;&#31034;&#36825;&#20123;&#28040;&#24687;&#12290;</p>
</dd>
<dt>&#26174;&#31034;</dt>
<dd>
<p>&#19968;&#27425;&#26597;&#30475;&#30340;&#28040;&#24687;&#25968;&#37327;&#12290;&#25152;&#26174;&#31034;&#28040;&#24687;&#30340;&#40664;&#35748;&#25968;&#37327;&#20026; 40&#12290;&#20854;&#20182;&#36873;&#39033;&#20026; 100&#12289;250 &#21644; 1000&#12290;</p>
<p>&#35201;&#26597;&#30475;&#22534;&#26632;&#36319;&#36394;&#65292;&#35831;&#21462;&#28040;&#36873;&#20013;&ldquo;&#38480;&#21046;&#36807;&#38271;&#30340;&#28040;&#24687;&rdquo;&#22797;&#36873;&#26694;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#26597;&#30475;&#22120;&#20013;&#19981;&#20250;&#26174;&#31034;&#22534;&#26632;&#36319;&#36394;&#65292;&#35201;&#26597;&#30475;&#22534;&#26632;&#36319;&#36394;&#65292;&#35831;&#21333;&#20987;&#28040;&#24687;&#30340; <code>(&#35814;&#32454;&#20449;&#24687;)</code> &#38142;&#25509;&#12290;</p>
</dd>
</dl>
<p>&ldquo;&#20462;&#25913;&#25628;&#32034;&rdquo;&#21306;&#22495;&#29992;&#20110;&#25351;&#23450;&#26381;&#21153;&#22120;&#23454;&#20363;&#25110;&#38598;&#32676;&#20197;&#21450;&#35201;&#26597;&#30475;&#30340;&#20851;&#32852;&#26085;&#24535;&#25991;&#20214;&#30340;&#21517;&#31216;&#12290;</p>
<dl>
<dt>&#23454;&#20363;</dt>
<dd>
<p>&#35201;&#26174;&#31034;&#26085;&#24535;&#35760;&#24405;&#30340;&#26381;&#21153;&#22120;&#23454;&#20363;&#25110;&#38598;&#32676;&#12290;&#40664;&#35748;&#30446;&#26631;&#20026;&#26381;&#21153;&#22120;&#12290;&#20854;&#20182;&#36873;&#39033;&#21462;&#20915;&#20110;&#20026;&#22495;&#23450;&#20041;&#24182;&#21551;&#29992;&#30340;&#38598;&#32676;&#21644;&#23454;&#20363;&#12290;</p>
</dd>
<dt>&#26085;&#24535;&#25991;&#20214;</dt>
<dd>
<p>&#35201;&#26174;&#31034;&#30340;&#26085;&#24535;&#25991;&#20214;&#30340;&#21517;&#31216;&#12290;&#40664;&#35748;&#21517;&#31216;&#20026; <code>server.log</code>&#12290;&#20854;&#20182;&#36873;&#39033;&#21462;&#20915;&#20110;&#25152;&#36873;&#30446;&#26631;&#30340;&#26085;&#24535;&#35774;&#32622;&#12290;</p>
</dd>
</dl>
<p>&ldquo;&#26085;&#24535;&#26597;&#30475;&#22120;&#32467;&#26524;&rdquo;&#34920;&#26174;&#31034;&#26381;&#21153;&#22120;&#26085;&#24535;&#28040;&#24687;&#12290;&#20351;&#29992;&#35813;&#34920;&#39030;&#37096;&#30340;&ldquo;&#35760;&#24405;&#26089;&#20110;&rdquo;&#21644;&ldquo;&#35760;&#24405;&#26202;&#20110;&rdquo;&#25353;&#38062;&#21487;&#36873;&#25321;&#24744;&#35201;&#26597;&#30475;&#30340;&#35760;&#24405;&#33539;&#22260;&#12290;</p>
<p>&#23545;&#20110;&#27599;&#26465;&#28040;&#24687;&#65292;&ldquo;&#26085;&#24535;&#26597;&#30475;&#22120;&#32467;&#26524;&rdquo;&#34920;&#21253;&#21547;&#20197;&#19979;&#20449;&#24687;&#12290;</p>
<dl>
<dt>&#35760;&#24405;&#32534;&#21495;</dt>
<dd>
<p>&#26381;&#21153;&#22120;&#26085;&#24535;&#20013;&#30340;&#28040;&#24687;&#32534;&#21495;&#12290;</p>
</dd>
<dt>&#26085;&#24535;&#32423;&#21035;</dt>
<dd>
<p>&#28040;&#24687;&#30340;&#26085;&#24535;&#32423;&#21035;&#12290;</p>
</dd>
<dt>&#28040;&#24687;</dt>
<dd>
<p>&#26085;&#24535;&#28040;&#24687;&#30340;&#31616;&#30701;&#25991;&#26412;&#12290;&#21333;&#20987; <code>(&#35814;&#32454;&#20449;&#24687;)</code> &#38142;&#25509;&#21487;&#20197;&#26597;&#30475;&#28040;&#24687;&#30340;&#26684;&#24335;&#21270;&#29256;&#26412;&#12290;</p>
</dd>
<dt>&#26085;&#24535;&#35760;&#24405;&#31243;&#24207;</dt>
<dd>
<p>&#29983;&#25104;&#26085;&#24535;&#28040;&#24687;&#30340;&#26085;&#24535;&#35760;&#24405;&#31243;&#24207;&#27169;&#22359;&#12290;</p>
</dd>
<dt>&#26102;&#38388;&#25139;</dt>
<dd>
<p>&#21457;&#24067;&#26085;&#24535;&#28040;&#24687;&#30340;&#26085;&#26399;&#21644;&#26102;&#38388;&#12290;</p>
</dd>
<dt>&#21517;&#31216;/&#20540;&#23545;</dt>
<dd>
<p>&#26085;&#24535;&#28040;&#24687;&#30340;&#32447;&#31243;&#21517;&#31216;&#21644; ID&#12290;</p>
</dd>
</dl>
<a id="sthref239" name="sthref239"></a>
<h5>&#30456;&#20851;&#20219;&#21153;</h5>
<ul>
<li>
<p><a href="task-eelogging.html">&#37197;&#32622;&#24120;&#35268;&#26085;&#24535;&#35760;&#24405;&#35774;&#32622;</a></p>
</li>
<li>
<p><a href="task-eelogginglevels.html">&#37197;&#32622;&#26085;&#24535;&#32423;&#21035;</a></p>
</li>
<li>
<p><a href="task-logviewer.html">&#26597;&#30475; DAS &#30340;&#26085;&#24535;&#25991;&#20214;</a></p>
</li>
</ul>
<a id="sthref240" name="sthref240"></a>
<h5>&#30456;&#20851;&#30340; asadmin &#21629;&#20196;</h5>
<ul>
<li>
<p><code>set-log-level</code></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00224"><code>rotate-log</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
