<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-eelogging" name="ref-eelogging"></a><a id="GHCOM00094" name="GHCOM00094"></a></p>

<h4><a id="sthref336" name="sthref336"></a>&#26085;&#24535;&#35760;&#24405;&#31243;&#24207;&#35774;&#32622;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&ldquo;&#26085;&#24535;&#35760;&#24405;&#31243;&#24207;&#35774;&#32622;&rdquo;&#39029;&#21487;&#20026;&#25152;&#36873; GlassFish Server &#23454;&#20363;&#25110;&#38598;&#32676;&#37197;&#32622;&#26085;&#24535;&#35760;&#24405;&#12290;</p>
<p>&ldquo;&#26085;&#24535;&#35760;&#24405;&#31243;&#24207;&#35774;&#32622;&rdquo;&#39029;&#21253;&#21547;&#20197;&#19979;&#36873;&#39033;&#12290;</p>
<dl>
<dt>&#37197;&#32622;&#21517;&#31216;</dt>
<dd>
<p>&#27492;&#39029;&#19978;&#30340;&#35774;&#32622;&#24212;&#29992;&#21040;&#30340;&#37197;&#32622;&#30340;&#21517;&#31216;&#12290;&#27492;&#23383;&#27573;&#20026;&#21482;&#35835;&#12290;</p>
</dd>
<dt>&#20889;&#20837;&#31995;&#32479;&#26085;&#24535;</dt>
<dd>
<p>&#22914;&#26524;&#21551;&#29992;&#35813;&#36873;&#39033;&#65292;&#21017;&#38500;&#20102;&#26381;&#21153;&#22120;&#26085;&#24535;&#20197;&#22806;&#65292;&#31995;&#32479;&#36824;&#20250;&#23558;&#26085;&#24535;&#35760;&#24405;&#36755;&#20986;&#21457;&#36865;&#21040; <code>syslog</code> &#24037;&#20855;&#12290;&#27492;&#21151;&#33021;&#20165;&#22312; Solaris &#21644; Linux &#31995;&#32479;&#19978;&#21487;&#29992;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#35760;&#24405;&#21040;&#25511;&#21046;&#21488;</dt>
<dd>
<p>&#22914;&#26524;&#21551;&#29992;&#35813;&#36873;&#39033;&#65292;&#21017;&#20250;&#23558;&#26085;&#24535;&#35760;&#24405;&#36755;&#20986;&#21457;&#36865;&#21040;&#31995;&#32479;&#25511;&#21046;&#21488;&#12290;</p>
</dd>
<dt>&#26085;&#26399;&#26356;&#25913;&#26102;&#28378;&#21160;</dt>
<dd>
<p>&#22914;&#26524;&#21551;&#29992;&#35813;&#36873;&#39033;&#65292; GlassFish Server &#23558;&#22312;&#27599;&#22825;&#21320;&#22812;&#28378;&#21160;&#26085;&#24535;&#25991;&#20214;&#12290;</p>
</dd>
<dt>&#22810;&#34892;&#27169;&#24335;</dt>
<dd>
<p>&#22914;&#26524;&#21551;&#29992;&#35813;&#36873;&#39033;&#65292;&#23558;&#20197;&#26131;&#20110;&#38405;&#35835;&#30340;&#26041;&#24335;&#35774;&#32622;&#26085;&#24535;&#28040;&#24687;&#26684;&#24335;&#12290;&#26085;&#24535;&#28040;&#24687;&#27491;&#25991;&#23558;&#32553;&#36827;&#24182;&#22312;&#26032;&#34892;&#19978;&#24320;&#22987;&#12290;</p>
</dd>
<dt>&#25511;&#21046;&#21488;&#26085;&#24535;&#35760;&#24405;&#26684;&#24335;</dt>
<dd>
<p>&#35760;&#24405;&#21040;&#25511;&#21046;&#21488;&#30340;&#26085;&#24535;&#35760;&#24405;&#26684;&#24335;&#12290;&#21487;&#29992;&#36873;&#39033;&#20026; ULF (UniformLogFormatter) &#21644; ODL (Oracle &#35786;&#26029;&#26085;&#24535;&#35760;&#24405;)&#12290;&#40664;&#35748;&#20540;&#20026; ODL&#12290;</p>
</dd>
<dt>&#26085;&#24535;&#25991;&#20214;&#26085;&#24535;&#35760;&#24405;&#26684;&#24335;</dt>
<dd>
<p>&#35760;&#24405;&#21040;&#26381;&#21153;&#22120;&#26085;&#24535;&#25991;&#20214;&#30340;&#26085;&#24535;&#35760;&#24405;&#26684;&#24335;&#12290;&#21487;&#29992;&#36873;&#39033;&#20026; ULF &#21644; ODL&#12290;&#40664;&#35748;&#20540;&#20026; ODL&#12290;</p>
</dd>
<dt>&#25991;&#20214;&#28378;&#21160;&#38480;&#21046;</dt>
<dd>
<p>&#22312;&#28378;&#21160;&#20043;&#21069;&#65292;&#26381;&#21153;&#22120;&#26085;&#24535;&#25991;&#20214;&#24517;&#39035;&#36798;&#21040;&#30340;&#22823;&#23567; (&#23383;&#33410;)&#12290;&#26381;&#21153;&#22120;&#26085;&#24535;&#36798;&#21040;&#25351;&#23450;&#22823;&#23567;&#26102;&#65292;GlassFish Server &#23558;&#21019;&#24314;&#19968;&#20010;&#26032;&#30340;&#21517;&#20026; <code>server.log</code> &#30340;&#31354;&#25991;&#20214;&#65292;&#24182;&#23558;&#26087;&#25991;&#20214;&#37325;&#21629;&#21517;&#20026; <code>server.log_</code><i>date</i>&#65292;&#20854;&#20013; <i>date</i> &#26159;&#25991;&#20214;&#28378;&#21160;&#30340;&#26085;&#26399;&#21644;&#26102;&#38388;&#12290;&#40664;&#35748;&#20540;&#20026; 2 &#20806;&#23383;&#33410;&#12290;&#35813;&#38480;&#21046;&#30340;&#26368;&#23567;&#20540;&#20026; 500 &#21315;&#23383;&#33410;&#65307;&#22914;&#26524;&#25351;&#23450;&#26356;&#20302;&#30340;&#20540;&#65292;&#21017;&#35201;&#22312;&#36798;&#21040; 500 &#21315;&#23383;&#33410;&#26102;&#35813;&#25991;&#20214;&#25165;&#28378;&#21160;&#12290;&#35201;&#20851;&#38381;&#26085;&#24535;&#25991;&#20214;&#28378;&#21160;&#65292;&#35831;&#23558;&#35813;&#20540;&#35774;&#32622;&#20026; 0&#12290;</p>
</dd>
<dt>&#25991;&#20214;&#28378;&#21160;&#26102;&#38388;&#38480;&#21046;</dt>
<dd>
<p>&#26381;&#21153;&#22120;&#26085;&#24535;&#24517;&#39035;&#28378;&#21160;&#20043;&#21069;&#30340;&#20998;&#38047;&#25968;&#12290;&#40664;&#35748;&#20540;&#20026; 0&#65292;&#34920;&#31034;&#25991;&#20214;&#36798;&#21040;&ldquo;&#25991;&#20214;&#28378;&#21160;&#38480;&#21046;&rdquo;&#23383;&#27573;&#20013;&#25351;&#23450;&#30340;&#22823;&#23567;&#26102;&#36827;&#34892;&#28378;&#21160;&#12290;&#22914;&#26524;&#25351;&#23450;&#19968;&#20998;&#38047;&#25110;&#33509;&#24178;&#20998;&#38047;&#65292;&#21017;&#26102;&#38388;&#38480;&#21046;&#23558;&#20248;&#20808;&#20110;&ldquo;&#25991;&#20214;&#28378;&#21160;&#38480;&#21046;&rdquo;&#23383;&#27573;&#25351;&#23450;&#30340;&#22823;&#23567;&#38480;&#21046;&#12290;</p>
</dd>
<dt>&#21047;&#26032;&#39057;&#29575;</dt>
<dd>
<p>&#19968;&#27425;&#20174;&#38431;&#21015;&#20889;&#20837;&#21040;&#26381;&#21153;&#22120;&#26085;&#24535;&#30340;&#26368;&#22823;&#28040;&#24687;&#25968;&#12290;&#40664;&#35748;&#20540;&#20026; 1&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#21382;&#21490;&#35760;&#24405;&#25991;&#20214;&#25968;</dt>
<dd>
<p>GlassFish Server &#22312;&#21024;&#38500;&#26368;&#26087;&#25991;&#20214;&#20043;&#21069;&#20445;&#30041;&#30340;&#26368;&#22823;&#26085;&#24535;&#25991;&#20214;&#25968;&#12290;&#22914;&#26524;&#23558;&#27492;&#20540;&#35774;&#32622;&#20026;&#38646; (0)&#65292;GlassFish Server &#19981;&#20250;&#21024;&#38500;&#20219;&#20309;&#26087;&#26085;&#24535;&#25991;&#20214;&#12290;</p>
</dd>
<dt>&#26085;&#24535;&#25991;&#20214;</dt>
<dd>
<p>&#26381;&#21153;&#22120;&#26085;&#24535;&#25991;&#20214;&#30340;&#26367;&#20195;&#21517;&#31216;&#25110;&#20301;&#32622;&#12290;&#40664;&#35748;&#20301;&#32622;&#20026; domain-dir<code>/logs/server.log</code>&#12290;</p>
</dd>
<dt>&#26085;&#24535;&#22788;&#29702;&#31243;&#24207;</dt>
<dd>
<p>&#23450;&#21046;&#26085;&#24535;&#22788;&#29702;&#31243;&#24207;&#30340;&#32477;&#23545;&#31867;&#21517;&#12290;&#20351;&#29992;&#23450;&#21046;&#26085;&#24535;&#22788;&#29702;&#31243;&#24207;&#21487;&#23558;&#26085;&#24535;&#21457;&#36865;&#21040;&#38500;&#20102; <code>server.log</code> &#25110; <code>syslog</code> &#20197;&#22806;&#30340;&#20854;&#20182;&#30446;&#26631;&#12290;&#23450;&#21046;&#22788;&#29702;&#31243;&#24207;&#24517;&#39035;&#25193;&#23637; <code>java.util.logging.Handler</code> &#31867; (&#31526;&#21512; JSR 047 &#30340; API)&#12290;&#23558;&#22788;&#29702;&#31243;&#24207;&#31867;&#32622;&#20110; GlassFish Server &#31867;&#36335;&#24452;&#20013;&#65292;&#20197;&#20415;&#22312;&#26381;&#21153;&#22120;&#21551;&#21160;&#36807;&#31243;&#20013;&#23433;&#35013;&#35813;&#22788;&#29702;&#31243;&#24207;&#12290;</p>
</dd>
</dl>
<a id="sthref337" name="sthref337"></a>
<h5>&#30456;&#20851;&#20219;&#21153;</h5>
<ul>
<li>
<p><a href="task-eelogging.html">&#37197;&#32622;&#24120;&#35268;&#26085;&#24535;&#35760;&#24405;&#35774;&#32622;</a></p>
</li>
<li>
<p><a href="task-eelogginglevels.html">&#37197;&#32622;&#26085;&#24535;&#32423;&#21035;</a></p>
</li>
<li>
<p><a href="task-logviewer.html">&#26597;&#30475; DAS &#30340;&#26085;&#24535;&#25991;&#20214;</a></p>
</li>
</ul>
<a id="sthref338" name="sthref338"></a>
<h5>&#30456;&#20851;&#30340; asadmin &#21629;&#20196;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00007"><code>collect-log-files</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00183"><code>list-log-levels</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00224"><code>rotate-log</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00228"><code>set-log-levels</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
