<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-serverinstappsconfig" name="ref-serverinstappsconfig"></a></p>

<h4><a id="sthref125" name="sthref125"></a><a id="sthref126" name="sthref126"></a><a id="sthref127" name="sthref127"></a><a id="sthref128" name="sthref128"></a><a id="sthref129" name="sthref129"></a>&#24212;&#29992;&#31243;&#24207;&#37197;&#32622;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&ldquo;&#24212;&#29992;&#31243;&#24207;&#37197;&#32622;&rdquo;&#39029;&#21487;&#20197;&#35774;&#32622;&#19968;&#20123;&#23646;&#24615;&#65292;&#36890;&#36807;&#36825;&#20123;&#23646;&#24615;&#21487;&#24110;&#21161;&#30830;&#20445;&#33021;&#22815;&#26816;&#27979;&#21040;&#23545;&#24050;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;&#25152;&#20570;&#30340;&#26356;&#25913;&#24182;&#37325;&#26032;&#21152;&#36733;&#24050;&#20462;&#25913;&#30340;&#31867;&#12290;</p>
<p>&ldquo;&#24212;&#29992;&#31243;&#24207;&#37197;&#32622;&rdquo;&#39029;&#21253;&#21547;&#20197;&#19979;&#36873;&#39033;&#12290;</p>
<dl>
<dt>&#21152;&#36733;&#40664;&#35748;&#20540;</dt>
<dd>
<p>&#29992;&#20110;&#23558;&#20855;&#26377;&#40664;&#35748;&#20540;&#30340;&#35774;&#32622;&#36824;&#21407;&#20026;&#20854;&#40664;&#35748;&#20540;&#30340;&#25353;&#38062;&#12290;&#27809;&#26377;&#40664;&#35748;&#20540;&#30340;&#35774;&#32622;&#19981;&#21457;&#29983;&#26356;&#25913;&#12290;</p>
</dd>
<dt>&#37325;&#26032;&#21152;&#36733;</dt>
<dd>
<p>&#22914;&#26524;&#21551;&#29992;&#20102;&#27492;&#36873;&#39033;&#65292;&#21017;&#21160;&#24577;&#37325;&#26032;&#21152;&#36733;&#24050;&#20462;&#25913;&#30340;&#31867;&#12290;&#26381;&#21153;&#22120;&#23558;&#23450;&#26399;&#26816;&#26597;&#37096;&#32626;&#30446;&#24405;&#20013;&#30340;&#26356;&#25913;&#65292;&#24182;&#33258;&#21160;&#20351;&#29992;&#36825;&#20123;&#26356;&#25913;&#21160;&#24577;&#37325;&#26032;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#12290;&#36825;&#22312;&#24320;&#21457;&#29615;&#22659;&#20013;&#24456;&#26377;&#29992;&#65292;&#22240;&#20026;&#23427;&#20801;&#35768;&#24555;&#36895;&#27979;&#35797;&#20195;&#30721;&#26356;&#25913;&#12290;&#20294;&#22312;&#29983;&#20135;&#29615;&#22659;&#20013;&#65292;&#21160;&#24577;&#37325;&#26032;&#21152;&#36733;&#21487;&#33021;&#20250;&#20351;&#24615;&#33021;&#38477;&#20302;&#12290;&#27492;&#22806;&#65292;&#27599;&#24403;&#23436;&#25104;&#37325;&#26032;&#21152;&#36733;&#26102;&#65292;&#24403;&#26102;&#30340;&#20250;&#35805;&#37117;&#23558;&#26080;&#25928;&#12290;&#23458;&#25143;&#26426;&#24517;&#39035;&#37325;&#26032;&#21551;&#21160;&#35813;&#20250;&#35805;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#21551;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#37325;&#26032;&#21152;&#36733;&#36718;&#35810;&#26102;&#38388;&#38388;&#38548;</dt>
<dd>
<p>&#30830;&#23450;&#26381;&#21153;&#22120;&#24212;&#26816;&#26597;&#24050;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;&#21644;&#27169;&#22359;&#20013;&#30340;&#20195;&#30721;&#26356;&#25913;&#30340;&#39057;&#29575;&#12290;&#40664;&#35748;&#20540;&#20026; 2&#12290;</p>
</dd>
<dt>&#31649;&#29702;&#20250;&#35805;&#36229;&#26102;</dt>
<dd>
<p>&#30830;&#23450;&#22312;&#31649;&#29702;&#25511;&#21046;&#21488;&#36229;&#26102;&#20174;&#32780;&#24744;&#24517;&#39035;&#20877;&#27425;&#30331;&#24405;&#20043;&#21069;&#22788;&#20110;&#38750;&#27963;&#21160;&#29366;&#24577;&#30340;&#20998;&#38047;&#25968;&#12290;&#40664;&#35748;&#20540;&#20026; 60&#12290;</p>
</dd>
<dt>&#33258;&#21160;&#37096;&#32626;</dt>
<dd>
<p>&#22914;&#26524;&#21551;&#29992;&#20102;&#27492;&#36873;&#39033;&#65292;&#23558;&#20250;&#23545;&#33258;&#21160;&#37096;&#32626;&#30446;&#24405;&#20013;&#30340;&#24212;&#29992;&#31243;&#24207;&#25191;&#34892;&#33258;&#21160;&#37096;&#32626;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#21551;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#33258;&#21160;&#37096;&#32626;&#36718;&#35810;&#26102;&#38388;&#38388;&#38548;</dt>
<dd>
<p>&#25351;&#23450;&#26381;&#21153;&#22120;&#24212;&#22312;&#33258;&#21160;&#37096;&#32626;&#30446;&#24405;&#20013;&#26816;&#26597;&#24212;&#29992;&#31243;&#24207;&#25110;&#27169;&#22359;&#26356;&#25913;&#30340;&#39057;&#29575;&#12290;&#26356;&#25913;&#36718;&#35810;&#26102;&#38388;&#38388;&#38548;&#19981;&#20250;&#24433;&#21709;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#25110;&#27169;&#22359;&#25152;&#38656;&#30340;&#26102;&#38388;&#12290;&#40664;&#35748;&#20540;&#20026; 2&#12290;</p>
</dd>
<dt>&#33258;&#21160;&#37096;&#32626;&#37325;&#35797;&#36229;&#26102;</dt>
<dd>
<p>&#25351;&#23450;&#37096;&#20998;&#22797;&#21046;&#30340;&#25991;&#20214;&#22312;&#21457;&#29983;&#38169;&#35823;&#21069;&#21487;&#20197;&#20445;&#25345;&#22823;&#23567;&#19981;&#21464;&#30340;&#31186;&#25968;&#12290;&#40664;&#35748;&#20540;&#20026; 4&#12290;</p>
<p>&#22914;&#26524;&#20197;&#24456;&#24930;&#30340;&#36895;&#24230;&#23558;&#25991;&#20214;&#22797;&#21046;&#21040;&#33258;&#21160;&#37096;&#32626;&#30446;&#24405;&#20013;&#65292;&#21017;&#22312;&#22797;&#21046;&#25972;&#20010;&#25991;&#20214;&#20043;&#21069;&#21487;&#20197;&#26174;&#31034;&#35813;&#25991;&#20214;&#12290;&#22240;&#27492;&#65292;&#33258;&#21160;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#30340;&#23581;&#35797;&#23558;&#22833;&#36133;&#12290;&#22914;&#26524;&#33258;&#21160;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#30340;&#23581;&#35797;&#22240;&#27492;&#32780;&#22833;&#36133;&#65292;GlassFish Server &#23558;&#23581;&#35797;&#20877;&#27425;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#12290;&#22914;&#26524;&#37096;&#20998;&#22797;&#21046;&#30340;&#25991;&#20214;&#22312;&#25351;&#23450;&#30340;&#26102;&#38388;&#27573;&#20869;&#20445;&#25345;&#22823;&#23567;&#19981;&#21464;&#65292;&#23558;&#20250;&#21457;&#29983;&#38169;&#35823;&#12290;</p>
</dd>
<dt>&#33258;&#21160;&#37096;&#32626;&#30446;&#24405;</dt>
<dd>
<p>&#26631;&#35782;&#29992;&#20110;&#30417;&#35270;&#24212;&#29992;&#31243;&#24207;&#33258;&#21160;&#37096;&#32626;&#30340;&#30446;&#24405;&#12290;&#40664;&#35748;&#20540;&#20026; domain-dir<code>/autodeploy</code>&#12290;</p>
</dd>
<dt>XML &#39564;&#35777;</dt>
<dd>
<p>&#25351;&#23450;&#35201;&#23545;&#26631;&#20934;&#37096;&#32626;&#25551;&#36848;&#31526;&#21644; GlassFish Server &#37096;&#32626;&#25551;&#36848;&#31526;&#25191;&#34892;&#30340; XML &#39564;&#35777;&#30340;&#31867;&#22411;&#12290;&#31867;&#22411;&#21487;&#20197;&#20026;&#20197;&#19979;&#20219;&#24847;&#19968;&#31181;&#65306;</p>
<dl>
<dt>&#23436;&#20840;</dt>
<dd>
<p>&#22914;&#26524; XML &#39564;&#35777;&#22833;&#36133;&#65292;&#21017;&#37096;&#32626;&#23558;&#22833;&#36133;&#12290;&#35813;&#20540;&#20026;&#40664;&#35748;&#20540;&#12290;</p>
</dd>
<dt>&#35299;&#26512;</dt>
<dd>
<p>&#25253;&#21578; XML &#39564;&#35777;&#38169;&#35823;&#65292;&#20294;&#20250;&#25191;&#34892;&#37096;&#32626;&#12290;</p>
</dd>
<dt>&#26080;</dt>
<dd>
<p>&#19981;&#25191;&#34892; XML &#39564;&#35777;&#12290;</p>
</dd>
</dl>
</dd>
<dt>&#39564;&#35777;&#22120;</dt>
<dd>
<p>&#22914;&#26524;&#21551;&#29992;&#27492;&#36873;&#39033;&#65292;&#21017;&#23558;&#22312;&#33258;&#21160;&#37096;&#32626;&#20043;&#21069;&#36816;&#34892;&#39564;&#35777;&#22120;&#12290;&#22914;&#26524;&#39564;&#35777;&#22833;&#36133;&#65292;&#21017;&#37096;&#32626;&#23558;&#19981;&#20250;&#25191;&#34892;&#12290;&#39564;&#35777;&#22120;&#23558;&#26816;&#26597;&#25991;&#20214;&#30340;&#32467;&#26500;&#21644;&#20869;&#23481;&#12290;&#22823;&#22411;&#24212;&#29992;&#31243;&#24207;&#30340;&#39564;&#35777;&#36890;&#24120;&#20250;&#24456;&#32791;&#36153;&#26102;&#38388;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#39044;&#32534;&#35793;</dt>
<dd>
<p>&#22914;&#26524;&#21551;&#29992;&#20102;&#27492;&#36873;&#39033;&#65292;&#23558;&#23545; JavaServer Pages (JSP) &#25991;&#20214;&#36827;&#34892;&#39044;&#32534;&#35793;&#12290;&#22914;&#26524;&#31105;&#29992;&#27492;&#36873;&#39033;&#65292;&#21017;&#22312;&#36816;&#34892;&#26102;&#39318;&#27425;&#35775;&#38382; JSP &#25991;&#20214;&#26102;&#23545;&#20854;&#36827;&#34892;&#32534;&#35793;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#20854;&#20182;&#23646;&#24615;</dt>
<dd>
<p>&#24212;&#29992;&#31243;&#24207;&#30340;&#20854;&#20182;&#23646;&#24615;&#12290;GlassFish Server &#19981;&#23450;&#20041;&#24212;&#29992;&#31243;&#24207;&#30340;&#20219;&#20309;&#20854;&#20182;&#23646;&#24615;&#12290;</p>
</dd>
</dl>
<a id="GHCOM339" name="GHCOM339"></a>
<h5>&#30456;&#20851;&#20219;&#21153;</h5>
<ul>
<li>
<p><a href="task-setadvanceappconfig.html">&#35774;&#32622;&#24212;&#29992;&#31243;&#24207;&#37197;&#32622;</a></p>
</li>
<li>
<p><a href="task-setadvancedomainattributes.html">&#35774;&#32622;&#22495;&#23646;&#24615;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
