<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-uploaddev" name="ref-uploaddev"></a><a id="GHCOM00077" name="GHCOM00077"></a></p>

<h4><a id="sthref289" name="sthref289"></a><a id="sthref290" name="sthref290"></a><a id="sthref291" name="sthref291"></a><a id="sthref292" name="sthref292"></a><a id="sthref293" name="sthref293"></a><a id="sthref294" name="sthref294"></a><a id="sthref295" name="sthref295"></a><a id="sthref296" name="sthref296"></a><a id="sthref297" name="sthref297"></a><a id="sthref298" name="sthref298"></a><a id="sthref299" name="sthref299"></a><a id="sthref300" name="sthref300"></a>&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#25110;&#27169;&#22359;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&ldquo;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#25110;&#27169;&#22359;&rdquo;&#39029;&#21487;&#20197;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#12290;</p>
<p>&ldquo;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#25110;&#27169;&#22359;&rdquo;&#39029;&#21253;&#21547;&#29992;&#20110;&#25152;&#26377;&#24212;&#29992;&#31243;&#24207;&#30340;&#20197;&#19979;&#36873;&#39033;&#12290;&#21482;&#26377;&#22312;&#20026;&#24212;&#29992;&#31243;&#24207;&#25351;&#23450;&ldquo;&#20301;&#32622;&rdquo;&#23383;&#27573;&#20197;&#21518;&#65292;&#25165;&#20250;&#26174;&#31034;&#20854;&#20182;&#36873;&#39033;&#12290;</p>
<dl>
<dt>&#20301;&#32622;</dt>
<dd>
<p>&#24744;&#35201;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;&#30340;&#26723;&#26696;&#20301;&#32622;&#12290;</p>
<p>&#20197;&#19979;&#36873;&#39033;&#25351;&#26126;&#20102;&#21487;&#20197;&#35775;&#38382;&#26723;&#26696;&#30340;&#20301;&#32622;&#65292;&#20197;&#21450;&#26723;&#26696;&#26159;&#19968;&#20010;&#25991;&#20214;&#36824;&#26159;&#19968;&#20010;&#30446;&#24405;&#12290;</p>
<dl>
<dt>&#35201;&#19978;&#36733;&#21040;&#26381;&#21153;&#22120;&#30340;&#25171;&#21253;&#25991;&#20214;</dt>
<dd>
<p>&#26723;&#26696;&#20301;&#20110;&#23458;&#25143;&#26426;&#20013;&#30340;&#25991;&#20214;&#25110;&#21487;&#20174;&#23458;&#25143;&#26426;&#35775;&#38382;&#30340;&#25991;&#20214;&#20013;&#12290;</p>
<p>&#23458;&#25143;&#26426;&#26159;&#21487;&#36890;&#36807;&#27983;&#35272;&#22120;&#26597;&#30475;&#31649;&#29702;&#25511;&#21046;&#21488;&#30340;&#20027;&#26426;&#12290;</p>
</dd>
<dt>&#21487;&#20174; GlassFish Server &#35775;&#38382;&#30340;&#26412;&#22320;&#25171;&#21253;&#25991;&#20214;&#25110;&#30446;&#24405;</dt>
<dd>
<p>&#26723;&#26696;&#26159;&#20301;&#20110;&#26381;&#21153;&#22120;&#35745;&#31639;&#26426;&#19978;&#30340;&#25991;&#20214;&#65292;&#25110;&#32773;&#26159;&#23637;&#24320;&#30446;&#24405;&#20013;&#30340;&#26410;&#25171;&#21253;&#24212;&#29992;&#31243;&#24207;&#12290;</p>
<p>&#26381;&#21153;&#22120;&#35745;&#31639;&#26426;&#26159;&#36816;&#34892; GlassFish Server &#22495;&#31649;&#29702;&#26381;&#21153;&#22120;&#30340;&#20027;&#26426;&#12290;</p>
</dd>
</dl>
</dd>
<dt>&#31867;&#22411;</dt>
<dd>
<p>&#24212;&#29992;&#31243;&#24207;&#31867;&#22411;&#12290;&#21487;&#29992;&#36873;&#39033;&#20026;&#65306;</p>
<ul>
<li>
<p>Web &#24212;&#29992;&#31243;&#24207;</p>
</li>
<li>
<p>&#20225;&#19994;&#24212;&#29992;&#31243;&#24207;</p>
</li>
<li>
<p>&#24212;&#29992;&#31243;&#24207;&#23458;&#25143;&#26426;</p>
</li>
<li>
<p>&#36830;&#25509;&#22120;&#27169;&#22359;</p>
</li>
<li>
<p>EJB Jar</p>
</li>
<li>
<p>&#20854;&#20182;</p>
</li>
</ul>
</dd>
<dt>&#30446;&#26631;</dt>
<dd>
<p>&#35201;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#25110;&#27169;&#22359;&#30340;&#38598;&#32676;&#21644;&#29420;&#31435;&#23454;&#20363;&#12290;&#20351;&#29992;&ldquo;&#28155;&#21152;&rdquo;&#21644;&ldquo;&#20840;&#37096;&#28155;&#21152;&rdquo;&#25353;&#38062;&#23558;&#25152;&#38656;&#30446;&#26631;&#31227;&#21160;&#21040;&ldquo;&#25152;&#36873;&#30446;&#26631;&rdquo;&#21015;&#12290;&#20351;&#29992;&ldquo;&#21024;&#38500;&rdquo;&#21644;&ldquo;&#20840;&#37096;&#21024;&#38500;&rdquo;&#25353;&#38062;&#23558;&#20219;&#20309;&#19981;&#38656;&#35201;&#30340;&#30446;&#26631;&#31227;&#21160;&#21040;&ldquo;&#21487;&#29992;&#30446;&#26631;&rdquo;&#21015;&#12290;</p>
<p>&#20165;&#24403;&#22312;&#22495;&#20013;&#24050;&#21019;&#24314;&#38598;&#32676;&#25110;&#29420;&#31435;&#23454;&#20363;&#26102;&#25165;&#20250;&#26174;&#31034;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
</dl>
<p>&#22312;&#19979;&#38754;&#30340;&#31456;&#33410;&#20013;&#25551;&#36848;&#20102;&#21508;&#31181;&#24212;&#29992;&#31243;&#24207;&#31867;&#22411;&#30340;&#20854;&#20182;&#36873;&#39033;&#12290;</p>
<ul>
<li>
<p><a href="#ref-webapp-options">Web &#24212;&#29992;&#31243;&#24207;&#30340;&#20854;&#20182;&#36873;&#39033;</a></p>
</li>
<li>
<p><a href="#ref-entapp-options">&#20225;&#19994;&#24212;&#29992;&#31243;&#24207;&#30340;&#20854;&#20182;&#36873;&#39033;</a></p>
</li>
<li>
<p><a href="#ref-appclient-options">&#24212;&#29992;&#31243;&#24207;&#23458;&#25143;&#26426;&#30340;&#20854;&#20182;&#36873;&#39033;</a></p>
</li>
<li>
<p><a href="#ref-connmodule-options">&#36830;&#25509;&#22120;&#27169;&#22359;&#30340;&#20854;&#20182;&#36873;&#39033;</a></p>
</li>
<li>
<p><a href="#ref-ejb-options">EJB Jar &#30340;&#20854;&#20182;&#36873;&#39033;</a></p>
</li>
</ul>
<a id="ref-webapp-options" name="ref-webapp-options"></a>
<h5>Web &#24212;&#29992;&#31243;&#24207;&#30340;&#20854;&#20182;&#36873;&#39033;</h5>
<p>&#22914;&#26524;&#24212;&#29992;&#31243;&#24207;&#31867;&#22411;&#20026; Web &#24212;&#29992;&#31243;&#24207;&#65292;&#21017;&#20250;&#26174;&#31034;&#20197;&#19979;&#36873;&#39033;&#12290;</p>
<dl>
<dt>&#19978;&#19979;&#25991;&#26681;&#30446;&#24405;</dt>
<dd>
<p>&#24212;&#29992;&#31243;&#24207;&#30340;&#36335;&#24452;&#12290;&#22312; Web &#24212;&#29992;&#31243;&#24207;&#30340; URL &#20013;&#65292;&#19978;&#19979;&#25991;&#26681;&#30446;&#24405;&#35201;&#32039;&#36319;&#30528;&#31471;&#21475;&#21495; (<code>http://</code><i>host</i><code>:</code><i>port</i><code>/</code><i>context-root</i><code>/...</code>)&#12290;&#19978;&#19979;&#25991;&#26681;&#30446;&#24405;&#24517;&#39035;&#20197;&#27491;&#26012;&#26464;&#24320;&#22836;&#65292;&#20363;&#22914;&#65306;<code>/hello</code>&#12290;</p>
</dd>
<dt>&#24212;&#29992;&#31243;&#24207;&#21517;&#31216;</dt>
<dd>
<p>&#24212;&#29992;&#31243;&#24207;&#21517;&#31216;&#12290;</p>
<p>&#21517;&#31216;&#21487;&#21253;&#21547;&#21487;&#36873;&#30340;&#29256;&#26412;&#26631;&#35782;&#31526;&#65292;&#23427;&#36319;&#22312;&#21517;&#31216;&#21518;&#38754;&#65292;&#24182;&#19982;&#21517;&#31216;&#20197;&#20882;&#21495; (<code>:</code>) &#20998;&#38548;&#12290;&#29256;&#26412;&#26631;&#35782;&#31526;&#24517;&#39035;&#20197;&#23383;&#27597;&#25110;&#25968;&#23383;&#24320;&#22836;&#12290;&#23427;&#21487;&#21253;&#21547;&#23383;&#27597;&#25968;&#23383;&#20197;&#21450;&#19979;&#21010;&#32447; (<code>_</code>)&#12289;&#30701;&#21010;&#32447; (<code>-</code>) &#21644;&#21477;&#28857; (<code>.</code>) &#31561;&#23383;&#31526;&#12290;&#26377;&#20851;&#27169;&#22359;&#21644;&#24212;&#29992;&#31243;&#24207;&#29256;&#26412;&#30340;&#35814;&#32454;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Oracle GlassFish Server Application Deployment Guide</i> &#20013;&#30340; <i>Module and Application Versions</i></a>&#12290;</p>
</dd>
<dt>&#34394;&#25311;&#26381;&#21153;&#22120;</dt>
<dd>
<p>&#19982;&#27492;&#24212;&#29992;&#31243;&#24207;&#30456;&#20851;&#32852;&#30340;&#34394;&#25311;&#26381;&#21153;&#22120;&#12290;</p>
<p>&#20165;&#24403;&#23384;&#22312;&#40664;&#35748;&#26381;&#21153;&#22120;&#23454;&#20363; <code>server</code> &#26102;&#65292;&#25165;&#20250;&#26174;&#31034;&ldquo;&#34394;&#25311;&#26381;&#21153;&#22120;&rdquo;&#36873;&#39033;&#12290;&#22914;&#26524;&#23384;&#22312;&#38598;&#32676;&#25110;&#20854;&#20182;&#29420;&#31435;&#26381;&#21153;&#22120;&#23454;&#20363;&#65292;&#21017;&#21487;&#20197;&#22312;&#37096;&#32626;&#21518;&#36873;&#25321;&#34394;&#25311;&#26381;&#21153;&#22120;&#12290;&#36716;&#33267;&ldquo;&#32534;&#36753;&#24212;&#29992;&#31243;&#24207;&rdquo;&#39029;&#65292;&#36873;&#25321;&ldquo;&#30446;&#26631;&rdquo;&#36873;&#39033;&#21345;&#65292;&#28982;&#21518;&#20026;&#25152;&#38656;&#30446;&#26631;&#36873;&#25321;&ldquo;&#31649;&#29702;&#34394;&#25311;&#26381;&#21153;&#22120;&rdquo;&#12290;</p>
</dd>
<dt>&#29366;&#24577;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&#27492;&#36873;&#39033;&#65292;&#21017;&#23558;&#21551;&#29992;&#24212;&#29992;&#31243;&#24207;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#27492;&#36873;&#39033;&#24050;&#36873;&#20013;&#12290;</p>
</dd>
<dt>&#21487;&#29992;&#24615;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&ldquo;&#24050;&#21551;&#29992;&rdquo;&#22797;&#36873;&#26694;&#65292;&#21017;&#20026; Web &#20250;&#35805;&#21644;&#26377;&#29366;&#24577;&#20250;&#35805; Bean (SFSB) &#26816;&#26597;&#28857;&#25805;&#20316;&#21644;&#28508;&#22312;&#38045;&#21270;&#21551;&#29992;&#39640;&#21487;&#29992;&#24615;&#12290;&#22914;&#26524;&#35774;&#32622;&#20026;&ldquo;&#20551;&rdquo;(&#40664;&#35748;&#20540;)&#65292;&#21017;&#23545;&#25351;&#23450;&#24212;&#29992;&#31243;&#24207;&#12289;Web &#24212;&#29992;&#31243;&#24207;&#25110; EJB &#27169;&#22359;&#31105;&#29992;&#25152;&#26377; Web &#20250;&#35805;&#20445;&#23384;&#21644; SFSB &#26816;&#26597;&#28857;&#25805;&#20316;&#12290;&#22914;&#26524;&#35774;&#32622;&#20026;&ldquo;&#30495;&rdquo;&#65292;&#21017;&#20026;&#25351;&#23450;&#30340;&#24212;&#29992;&#31243;&#24207;&#25110;&#27169;&#22359;&#21551;&#29992;&#39640;&#21487;&#29992;&#24615;&#12290;&#20165;&#24403;&#22312;&#26356;&#39640;&#32423;&#21035;&#19978; (&#20363;&#22914;&#26381;&#21153;&#22120;&#32423;&#21035;&#21644;&#23481;&#22120;&#32423;&#21035;) &#37197;&#32622;&#21644;&#21551;&#29992;&#39640;&#21487;&#29992;&#24615;&#26102;&#65292;&#27492;&#36873;&#39033;&#25165;&#35774;&#32622;&#20026;&ldquo;&#30495;&rdquo;&#12290;</p>
<p>&#22914;&#26524;&#38500;&#40664;&#35748;&#26381;&#21153;&#22120;&#23454;&#20363; (<code>server</code>) &#20197;&#22806;&#36824;&#23384;&#22312;&#38598;&#32676;&#25110;&#29420;&#31435;&#26381;&#21153;&#22120;&#23454;&#20363;&#65292;&#21017;&#20250;&#26174;&#31034;&#35813;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#39044;&#32534;&#35793; JSP</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&#20102;&#27492;&#36873;&#39033;&#65292;&#23558;&#23545; JavaServer Pages (JSP) &#25991;&#20214;&#36827;&#34892;&#39044;&#32534;&#35793;&#12290;&#22914;&#26524;&#31105;&#29992;&#27492;&#36873;&#39033;&#65292;&#21017;&#22312;&#36816;&#34892;&#26102;&#39318;&#27425;&#35775;&#38382; JSP &#25991;&#20214;&#26102;&#23545;&#20854;&#36827;&#34892;&#32534;&#35793;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#36816;&#34892;&#39564;&#35777;&#22120;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#25321;&#27492;&#36873;&#39033;&#65292;&#21017;&#20250;&#22312;&#37096;&#32626;&#20043;&#21069;&#39564;&#35777;&#37096;&#32626;&#25551;&#36848;&#31526;&#12290;&#22914;&#26524;&#39564;&#35777;&#22833;&#36133;&#65292;&#21017;&#37096;&#32626;&#23558;&#19981;&#20250;&#25191;&#34892;&#12290;&#39564;&#35777;&#22120;&#23558;&#26816;&#26597;&#37096;&#32626;&#25551;&#36848;&#31526;&#30340;&#32467;&#26500;&#21644;&#20869;&#23481;&#12290;&#22823;&#22411;&#24212;&#29992;&#31243;&#24207;&#30340;&#39564;&#35777;&#36890;&#24120;&#20250;&#24456;&#32791;&#36153;&#26102;&#38388;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
<p>&#24517;&#39035;&#20174; UpdateTool &#23433;&#35013;&#39564;&#35777;&#22120;&#31243;&#24207;&#21253;&#65292;&#21542;&#21017;&#23558;&#35760;&#24405;&#19968;&#26465;&#35686;&#21578;&#65292;&#24182;&#24573;&#30053;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#24378;&#21046;&#37325;&#26032;&#37096;&#32626;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&#27492;&#36873;&#39033;&#65292;&#21017;&#23558;&#37325;&#26032;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207; (&#22914;&#26524;&#24212;&#29992;&#31243;&#24207;&#24050;&#37096;&#32626;)&#12290;&#22914;&#26524;&#26410;&#36873;&#20013;&#27492;&#36873;&#39033;&#65292;&#21017;&#23581;&#35797;&#37096;&#32626;&#24050;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;&#23558;&#23548;&#33268;&#20986;&#38169;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#20445;&#25345;&#29366;&#24577;</dt>
<dd>
<p>&#27492;&#36873;&#39033;&#25511;&#21046;&#26159;&#21542;&#22312;&#37325;&#26032;&#37096;&#32626;&#26399;&#38388;&#20445;&#30041; Web &#20250;&#35805;&#12289;SFSB &#23454;&#20363;&#21644;&#25345;&#20037;&#21019;&#24314;&#30340; EJB &#35745;&#26102;&#22120;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;&#21482;&#26377;&#21517;&#20026; <code>server</code> &#30340;&#40664;&#35748;&#26381;&#21153;&#22120;&#23454;&#25903;&#25345;&#27492;&#36873;&#39033;&#12290;&#20219;&#20309;&#20854;&#20182;&#30446;&#26631;&#37117;&#19981;&#25903;&#25345;&#27492;&#36873;&#39033;&#24182;&#20104;&#20197;&#24573;&#30053;&#12290;</p>
<p>&#22312;&#20004;&#27425;&#37325;&#26032;&#37096;&#32626;&#26399;&#38388;&#23545;&#24212;&#29992;&#31243;&#24207;&#25152;&#20570;&#30340;&#26576;&#20123;&#26356;&#25913;&#20250;&#23548;&#33268;&#27492;&#21151;&#33021;&#26080;&#27861;&#27491;&#24120;&#24037;&#20316;&#12290;&#20363;&#22914;&#65292;&#19981;&#35201;&#26356;&#25913; SFSB Bean &#31867;&#20013;&#30340;&#23454;&#20363;&#21464;&#37327;&#38598;&#12290;</p>
<p>&#23545;&#20110; Web &#24212;&#29992;&#31243;&#24207;&#65292;&#20165;&#24403; <code>glassfish-web-app.xml</code> &#25991;&#20214;&#20013; <code>session-manager</code> &#20803;&#32032;&#30340; <code>persistence-type</code> &#23646;&#24615;&#26159; <code>file</code> &#26102;&#65292;&#27492;&#21151;&#33021;&#25165;&#21487;&#29992;&#12290;</p>
<p>&#23545;&#20110;&#26377;&#29366;&#24577;&#20250;&#35805; Bean &#23454;&#20363;&#65292;&#22312;&#26381;&#21153;&#22120;&#20013;&#35774;&#32622;&#19981;&#25903;&#25345;&#39640;&#21487;&#29992;&#24615;&#30340;&#25345;&#20037;&#31867;&#22411; (&ldquo;SFSB &#25345;&#20037;&#31867;&#22411;&rdquo;&#36873;&#39033;) &#19988;&#24517;&#39035;&#23558;&#20854;&#35774;&#32622;&#20026;<code>&#25991;&#20214;</code>&#65292;&#36825;&#26159;&#40664;&#35748;&#20540;&#65292;&#24314;&#35758;&#20351;&#29992;&#35813;&#20540;&#12290;</p>
<p>&#22914;&#26524;&#26080;&#27861;&#20445;&#30041;&#25110;&#36824;&#21407;&#20219;&#20309;&#27963;&#21160; Web &#20250;&#35805;&#12289;SFSB &#23454;&#20363;&#25110; EJB &#35745;&#26102;&#22120;&#65292;&#21017;&#22312;&#37325;&#26032;&#37096;&#32626;&#23436;&#25104;&#26102;&#36825;&#20123;&#36164;&#28304;&#23558;<i>&#26080;</i>&#19968;&#21487;&#29992;&#12290;&#20294;&#26159;&#65292;&#37325;&#26032;&#37096;&#32626;&#25805;&#20316;&#23558;&#32487;&#32493;&#65292;&#24182;&#19988;&#35760;&#24405;&#19968;&#20010;&#35686;&#21578;&#12290;</p>
<p>&#20026;&#20102;&#20445;&#30041;&#27963;&#21160;&#29366;&#24577;&#25968;&#25454;&#65292;GlassFish Server &#23558;&#23545;&#25968;&#25454;&#36827;&#34892;&#24207;&#21015;&#21270;&#65292;&#24182;&#23558;&#25968;&#25454;&#20445;&#23384;&#22312;&#20869;&#23384;&#20013;&#12290;&#20026;&#20102;&#36824;&#21407;&#36825;&#20123;&#25968;&#25454;&#65292;&#26368;&#36817;&#37325;&#26032;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;&#30340;&#31867;&#21152;&#36733;&#22120;&#23558;&#23545;&#20808;&#21069;&#20445;&#23384;&#30340;&#25968;&#25454;&#36827;&#34892;&#21453;&#24207;&#21015;&#21270;&#12290;</p>
</dd>
<dt>&#20445;&#30041;&#24212;&#29992;&#31243;&#24207;&#33539;&#22260;&#30340;&#36164;&#28304;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&#65292;&#23558;&#20445;&#30041;&#20219;&#20309;&#24212;&#29992;&#31243;&#24207;&#33539;&#22260;&#30340;&#36164;&#28304;&#24182;&#22312;&#37325;&#26032;&#37096;&#32626;&#36807;&#31243;&#20013;&#36824;&#21407;&#36825;&#20123;&#36164;&#28304;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#35813;&#36873;&#39033;&#22788;&#20110;&#26410;&#36873;&#20013;&#29366;&#24577;&#12290;</p>
</dd>
<dt>&#37096;&#32626;&#39034;&#24207;</dt>
<dd>
<p>&#24212;&#29992;&#31243;&#24207;&#30340;&#37096;&#32626;&#39034;&#24207;&#12290;</p>
<p>&#22312;&#26381;&#21153;&#22120;&#21551;&#21160;&#26102;&#20808;&#21152;&#36733;&#32534;&#21495;&#36739;&#20302;&#30340;&#24212;&#29992;&#31243;&#24207;&#12290;&#37096;&#32626;&#39034;&#24207;&#20026; 102 &#30340;&#24212;&#29992;&#31243;&#24207;&#22312;&#37096;&#32626;&#39034;&#24207;&#20026; 110 &#30340;&#24212;&#29992;&#31243;&#24207;&#20043;&#21069;&#21152;&#36733;&#12290;&#22914;&#26524;&#22312;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#26102;&#26410;&#25351;&#23450;&#37096;&#32626;&#39034;&#24207;&#65292;&#23558;&#20998;&#37197;&#40664;&#35748;&#37096;&#32626;&#39034;&#24207; 100&#12290;&#22914;&#26524;&#20004;&#20010;&#24212;&#29992;&#31243;&#24207;&#30340;&#37096;&#32626;&#39034;&#24207;&#30456;&#21516;&#65292;&#21017;&#39318;&#20808;&#21152;&#36733;&#20808;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;&#12290;&#22914;&#26524;&#24212;&#29992;&#31243;&#24207;&#20855;&#26377;&#30456;&#20851;&#24615;&#19988;&#24517;&#39035;&#25353;&#29305;&#23450;&#39034;&#24207;&#21152;&#36733;&#65292;&#21017;&#25351;&#23450;&#37096;&#32626;&#39034;&#24207;&#38750;&#24120;&#26377;&#29992;&#12290;</p>
</dd>
<dt>&#24211;</dt>
<dd>
<p>&#29305;&#23450;&#20110;&#27492;&#27169;&#22359;&#25110;&#24212;&#29992;&#31243;&#24207;&#24182;&#19988;&#20197;&#36887;&#21495;&#20998;&#38548;&#30340;&#24211; JAR &#25991;&#20214;&#21015;&#34920;&#12290;&#36335;&#24452;&#21487;&#20197;&#26159;&#32477;&#23545;&#36335;&#24452;&#25110;&#30456;&#23545;&#36335;&#24452;&#12290;&#30456;&#23545;&#36335;&#24452;&#26159;&#30456;&#23545;&#20110; domain-dir<code>/lib/applibs</code> &#30340;&#36335;&#24452;&#12290;&#22914;&#26524;&#36335;&#24452;&#26159;&#32477;&#23545;&#36335;&#24452;&#65292;&#21017;&#22495;&#31649;&#29702;&#26381;&#21153;&#22120; (DAS) &#24517;&#39035;&#33021;&#22815;&#35775;&#38382;&#27492;&#36335;&#24452;&#65292;&#36825;&#24847;&#21619;&#30528;&#27492;&#36335;&#24452;&#24517;&#39035;&#22312;domain-dir &#19979;&#12290;&#36825;&#20123;&#24211;&#25353;&#20854;&#25351;&#23450;&#30340;&#39034;&#24207;&#20379;&#24212;&#29992;&#31243;&#24207;&#20351;&#29992;&#12290;</p>
</dd>
<dt>&#35828;&#26126;</dt>
<dd>
<p>&#24212;&#29992;&#31243;&#24207;&#35828;&#26126;&#12290;</p>
</dd>
</dl>
<a id="ref-entapp-options" name="ref-entapp-options"></a>
<h5>&#20225;&#19994;&#24212;&#29992;&#31243;&#24207;&#30340;&#20854;&#20182;&#36873;&#39033;</h5>
<p>&#22914;&#26524;&#24212;&#29992;&#31243;&#24207;&#31867;&#22411;&#20026;&#20225;&#19994;&#24212;&#29992;&#31243;&#24207;&#65292;&#21017;&#20250;&#26174;&#31034;&#20197;&#19979;&#36873;&#39033;&#12290;</p>
<dl>
<dt>&#24212;&#29992;&#31243;&#24207;&#21517;&#31216;</dt>
<dd>
<p>&#24212;&#29992;&#31243;&#24207;&#21517;&#31216;&#12290;</p>
<p>&#21517;&#31216;&#21487;&#21253;&#21547;&#21487;&#36873;&#30340;&#29256;&#26412;&#26631;&#35782;&#31526;&#65292;&#23427;&#36319;&#22312;&#21517;&#31216;&#21518;&#38754;&#65292;&#24182;&#19982;&#21517;&#31216;&#20197;&#20882;&#21495; (<code>:</code>) &#20998;&#38548;&#12290;&#29256;&#26412;&#26631;&#35782;&#31526;&#24517;&#39035;&#20197;&#23383;&#27597;&#25110;&#25968;&#23383;&#24320;&#22836;&#12290;&#23427;&#21487;&#21253;&#21547;&#23383;&#27597;&#25968;&#23383;&#20197;&#21450;&#19979;&#21010;&#32447; (<code>_</code>)&#12289;&#30701;&#21010;&#32447; (<code>-</code>) &#21644;&#21477;&#28857; (<code>.</code>) &#31561;&#23383;&#31526;&#12290;&#26377;&#20851;&#27169;&#22359;&#21644;&#24212;&#29992;&#31243;&#24207;&#29256;&#26412;&#30340;&#35814;&#32454;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Oracle GlassFish Server Application Deployment Guide</i> &#20013;&#30340; <i>Module and Application Versions</i></a>&#12290;</p>
</dd>
<dt>&#34394;&#25311;&#26381;&#21153;&#22120;</dt>
<dd>
<p>&#19982;&#27492;&#24212;&#29992;&#31243;&#24207;&#30456;&#20851;&#32852;&#30340;&#34394;&#25311;&#26381;&#21153;&#22120;&#12290;</p>
<p>&#20165;&#24403;&#23384;&#22312;&#40664;&#35748;&#26381;&#21153;&#22120;&#23454;&#20363; <code>server</code> &#26102;&#65292;&#25165;&#20250;&#26174;&#31034;&ldquo;&#34394;&#25311;&#26381;&#21153;&#22120;&rdquo;&#36873;&#39033;&#12290;&#22914;&#26524;&#23384;&#22312;&#38598;&#32676;&#25110;&#20854;&#20182;&#29420;&#31435;&#26381;&#21153;&#22120;&#23454;&#20363;&#65292;&#21017;&#21487;&#20197;&#22312;&#37096;&#32626;&#21518;&#36873;&#25321;&#34394;&#25311;&#26381;&#21153;&#22120;&#12290;&#36716;&#33267;&ldquo;&#32534;&#36753;&#24212;&#29992;&#31243;&#24207;&rdquo;&#39029;&#65292;&#36873;&#25321;&ldquo;&#30446;&#26631;&rdquo;&#36873;&#39033;&#21345;&#65292;&#28982;&#21518;&#20026;&#25152;&#38656;&#30446;&#26631;&#36873;&#25321;&ldquo;&#31649;&#29702;&#34394;&#25311;&#26381;&#21153;&#22120;&rdquo;&#12290;</p>
</dd>
<dt>&#29366;&#24577;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&#27492;&#36873;&#39033;&#65292;&#21017;&#23558;&#21551;&#29992;&#24212;&#29992;&#31243;&#24207;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#27492;&#36873;&#39033;&#24050;&#36873;&#20013;&#12290;</p>
</dd>
<dt>&#21487;&#29992;&#24615;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&ldquo;&#24050;&#21551;&#29992;&rdquo;&#22797;&#36873;&#26694;&#65292;&#21017;&#20026; Web &#20250;&#35805;&#21644;&#26377;&#29366;&#24577;&#20250;&#35805; Bean (SFSB) &#26816;&#26597;&#28857;&#25805;&#20316;&#21644;&#28508;&#22312;&#38045;&#21270;&#21551;&#29992;&#39640;&#21487;&#29992;&#24615;&#12290;&#22914;&#26524;&#35774;&#32622;&#20026;&ldquo;&#20551;&rdquo;(&#40664;&#35748;&#20540;)&#65292;&#21017;&#23545;&#25351;&#23450;&#24212;&#29992;&#31243;&#24207;&#12289;Web &#24212;&#29992;&#31243;&#24207;&#25110; EJB &#27169;&#22359;&#31105;&#29992;&#25152;&#26377; Web &#20250;&#35805;&#20445;&#23384;&#21644; SFSB &#26816;&#26597;&#28857;&#25805;&#20316;&#12290;&#22914;&#26524;&#35774;&#32622;&#20026;&ldquo;&#30495;&rdquo;&#65292;&#21017;&#20026;&#25351;&#23450;&#30340;&#24212;&#29992;&#31243;&#24207;&#25110;&#27169;&#22359;&#21551;&#29992;&#39640;&#21487;&#29992;&#24615;&#12290;&#20165;&#24403;&#22312;&#26356;&#39640;&#32423;&#21035;&#19978; (&#20363;&#22914;&#26381;&#21153;&#22120;&#32423;&#21035;&#21644;&#23481;&#22120;&#32423;&#21035;) &#37197;&#32622;&#21644;&#21551;&#29992;&#39640;&#21487;&#29992;&#24615;&#26102;&#65292;&#27492;&#36873;&#39033;&#25165;&#35774;&#32622;&#20026;&ldquo;&#30495;&rdquo;&#12290;</p>
<p>&#22914;&#26524;&#38500;&#40664;&#35748;&#26381;&#21153;&#22120;&#23454;&#20363; (<code>server</code>) &#20197;&#22806;&#36824;&#23384;&#22312;&#38598;&#32676;&#25110;&#29420;&#31435;&#26381;&#21153;&#22120;&#23454;&#20363;&#65292;&#21017;&#20250;&#26174;&#31034;&#35813;&#36873;&#39033;&#12290;</p>
</dd>
<dt>Java Web Start</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&#27492;&#36873;&#39033;&#65292;&#21017;&#20801;&#35768;&#24212;&#29992;&#31243;&#24207;&#23458;&#25143;&#26426;&#27169;&#22359;&#35775;&#38382; Java Web Start&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#39044;&#32534;&#35793; JSP</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&#20102;&#27492;&#36873;&#39033;&#65292;&#23558;&#23545; JavaServer Pages (JSP) &#25991;&#20214;&#36827;&#34892;&#39044;&#32534;&#35793;&#12290;&#22914;&#26524;&#31105;&#29992;&#27492;&#36873;&#39033;&#65292;&#21017;&#22312;&#36816;&#34892;&#26102;&#39318;&#27425;&#35775;&#38382; JSP &#25991;&#20214;&#26102;&#23545;&#20854;&#36827;&#34892;&#32534;&#35793;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#36816;&#34892;&#39564;&#35777;&#22120;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#25321;&#27492;&#36873;&#39033;&#65292;&#21017;&#20250;&#22312;&#37096;&#32626;&#20043;&#21069;&#39564;&#35777;&#37096;&#32626;&#25551;&#36848;&#31526;&#12290;&#22914;&#26524;&#39564;&#35777;&#22833;&#36133;&#65292;&#21017;&#37096;&#32626;&#23558;&#19981;&#20250;&#25191;&#34892;&#12290;&#39564;&#35777;&#22120;&#23558;&#26816;&#26597;&#37096;&#32626;&#25551;&#36848;&#31526;&#30340;&#32467;&#26500;&#21644;&#20869;&#23481;&#12290;&#22823;&#22411;&#24212;&#29992;&#31243;&#24207;&#30340;&#39564;&#35777;&#36890;&#24120;&#20250;&#24456;&#32791;&#36153;&#26102;&#38388;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
<p>&#24517;&#39035;&#20174; UpdateTool &#23433;&#35013;&#39564;&#35777;&#22120;&#31243;&#24207;&#21253;&#65292;&#21542;&#21017;&#23558;&#35760;&#24405;&#19968;&#26465;&#35686;&#21578;&#65292;&#24182;&#24573;&#30053;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#20860;&#23481;&#24615;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&#65292;&#23545;&#24212;&#29992;&#31243;&#24207;&#20351;&#29992; GlassFish Server v2 JAR &#21487;&#35265;&#24615;&#35201;&#27714;&#65292;&#32780;&#38750; GlassFish Server v3 &#21457;&#34892;&#29256; (&#21253;&#25324; 4.0) &#20013;&#25191;&#34892;&#30340;&#26356;&#20005;&#26684;&#30340; Java EE 6 &#35201;&#27714;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#35813;&#36873;&#39033;&#22788;&#20110;&#26410;&#36873;&#20013;&#29366;&#24577;&#12290;</p>
<p>Java EE 6 &#24179;&#21488;&#35268;&#33539;&#25191;&#34892;&#30340;&#35201;&#27714;&#27604; Java EE 5 &#26356;&#20026;&#20005;&#26684;&#65292;&#22312; Java EE 5 &#20013;&#65292;EAR &#25991;&#20214;&#20013;&#30340; JAR &#25991;&#20214;&#23545;&#21508;&#31181;&#27169;&#22359;&#22343;&#21487;&#35265;&#12290;&#29305;&#21035;&#26159;&#65292;&#24212;&#29992;&#31243;&#24207;&#23458;&#25143;&#26426;&#19981;&#24471;&#35775;&#38382; EJB JAR &#25991;&#20214;&#25110; EAR &#25991;&#20214;&#20013;&#30340;&#20854;&#20182; JAR &#25991;&#20214;&#65292;&#38500;&#38750;&#24341;&#29992;&#20351;&#29992;&#26631;&#20934; Java SE &#26426;&#21046; (&#20363;&#22914;&#25193;&#23637;&#21517;) &#25110; Java EE &#24211;&#30446;&#24405;&#26426;&#21046;&#12290;&#36873;&#20013;&#27492;&#26694;&#23558;&#21024;&#38500;&#36825;&#20123; Java EE 6 &#38480;&#21046;&#12290;</p>
</dd>
<dt>&#24378;&#21046;&#37325;&#26032;&#37096;&#32626;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&#27492;&#36873;&#39033;&#65292;&#21017;&#23558;&#37325;&#26032;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207; (&#22914;&#26524;&#24212;&#29992;&#31243;&#24207;&#24050;&#37096;&#32626;)&#12290;&#22914;&#26524;&#26410;&#36873;&#20013;&#27492;&#36873;&#39033;&#65292;&#21017;&#23581;&#35797;&#37096;&#32626;&#24050;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;&#23558;&#23548;&#33268;&#20986;&#38169;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#20445;&#25345;&#29366;&#24577;</dt>
<dd>
<p>&#27492;&#36873;&#39033;&#25511;&#21046;&#26159;&#21542;&#22312;&#37325;&#26032;&#37096;&#32626;&#26399;&#38388;&#20445;&#30041; Web &#20250;&#35805;&#12289;SFSB &#23454;&#20363;&#21644;&#25345;&#20037;&#21019;&#24314;&#30340; EJB &#35745;&#26102;&#22120;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;&#21482;&#26377;&#21517;&#20026; <code>server</code> &#30340;&#40664;&#35748;&#26381;&#21153;&#22120;&#23454;&#25903;&#25345;&#27492;&#36873;&#39033;&#12290;&#20219;&#20309;&#20854;&#20182;&#30446;&#26631;&#37117;&#19981;&#25903;&#25345;&#27492;&#36873;&#39033;&#24182;&#20104;&#20197;&#24573;&#30053;&#12290;</p>
<p>&#22312;&#20004;&#27425;&#37325;&#26032;&#37096;&#32626;&#26399;&#38388;&#23545;&#24212;&#29992;&#31243;&#24207;&#25152;&#20570;&#30340;&#26576;&#20123;&#26356;&#25913;&#20250;&#23548;&#33268;&#27492;&#21151;&#33021;&#26080;&#27861;&#27491;&#24120;&#24037;&#20316;&#12290;&#20363;&#22914;&#65292;&#19981;&#35201;&#26356;&#25913; SFSB Bean &#31867;&#20013;&#30340;&#23454;&#20363;&#21464;&#37327;&#38598;&#12290;</p>
<p>&#23545;&#20110; Web &#24212;&#29992;&#31243;&#24207;&#65292;&#20165;&#24403; <code>glassfish-web-app.xml</code> &#25991;&#20214;&#20013; <code>session-manager</code> &#20803;&#32032;&#30340; <code>persistence-type</code> &#23646;&#24615;&#26159; <code>file</code> &#26102;&#65292;&#27492;&#21151;&#33021;&#25165;&#21487;&#29992;&#12290;</p>
<p>&#23545;&#20110;&#26377;&#29366;&#24577;&#20250;&#35805; Bean &#23454;&#20363;&#65292;&#22312;&#26381;&#21153;&#22120;&#20013;&#35774;&#32622;&#19981;&#25903;&#25345;&#39640;&#21487;&#29992;&#24615;&#30340;&#25345;&#20037;&#31867;&#22411; (&ldquo;SFSB &#25345;&#20037;&#31867;&#22411;&rdquo;&#36873;&#39033;) &#19988;&#24517;&#39035;&#23558;&#20854;&#35774;&#32622;&#20026;<code>&#25991;&#20214;</code>&#65292;&#36825;&#26159;&#40664;&#35748;&#20540;&#65292;&#24314;&#35758;&#20351;&#29992;&#35813;&#20540;&#12290;</p>
<p>&#22914;&#26524;&#26080;&#27861;&#20445;&#30041;&#25110;&#36824;&#21407;&#20219;&#20309;&#27963;&#21160; Web &#20250;&#35805;&#12289;SFSB &#23454;&#20363;&#25110; EJB &#35745;&#26102;&#22120;&#65292;&#21017;&#22312;&#37325;&#26032;&#37096;&#32626;&#23436;&#25104;&#26102;&#36825;&#20123;&#36164;&#28304;&#23558;<i>&#26080;</i>&#19968;&#21487;&#29992;&#12290;&#20294;&#26159;&#65292;&#37325;&#26032;&#37096;&#32626;&#25805;&#20316;&#23558;&#32487;&#32493;&#65292;&#24182;&#19988;&#35760;&#24405;&#19968;&#20010;&#35686;&#21578;&#12290;</p>
<p>&#20026;&#20102;&#20445;&#30041;&#27963;&#21160;&#29366;&#24577;&#25968;&#25454;&#65292;GlassFish Server &#23558;&#23545;&#25968;&#25454;&#36827;&#34892;&#24207;&#21015;&#21270;&#65292;&#24182;&#23558;&#25968;&#25454;&#20445;&#23384;&#22312;&#20869;&#23384;&#20013;&#12290;&#20026;&#20102;&#36824;&#21407;&#36825;&#20123;&#25968;&#25454;&#65292;&#26368;&#36817;&#37325;&#26032;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;&#30340;&#31867;&#21152;&#36733;&#22120;&#23558;&#23545;&#20808;&#21069;&#20445;&#23384;&#30340;&#25968;&#25454;&#36827;&#34892;&#21453;&#24207;&#21015;&#21270;&#12290;</p>
</dd>
<dt>&#20445;&#30041;&#24212;&#29992;&#31243;&#24207;&#33539;&#22260;&#30340;&#36164;&#28304;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&#65292;&#23558;&#20445;&#30041;&#20219;&#20309;&#24212;&#29992;&#31243;&#24207;&#33539;&#22260;&#30340;&#36164;&#28304;&#24182;&#22312;&#37325;&#26032;&#37096;&#32626;&#36807;&#31243;&#20013;&#36824;&#21407;&#36825;&#20123;&#36164;&#28304;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#35813;&#36873;&#39033;&#22788;&#20110;&#26410;&#36873;&#20013;&#29366;&#24577;&#12290;</p>
</dd>
<dt>&#37096;&#32626;&#39034;&#24207;</dt>
<dd>
<p>&#24212;&#29992;&#31243;&#24207;&#30340;&#37096;&#32626;&#39034;&#24207;&#12290;</p>
<p>&#22312;&#26381;&#21153;&#22120;&#21551;&#21160;&#26102;&#20808;&#21152;&#36733;&#32534;&#21495;&#36739;&#20302;&#30340;&#24212;&#29992;&#31243;&#24207;&#12290;&#37096;&#32626;&#39034;&#24207;&#20026; 102 &#30340;&#24212;&#29992;&#31243;&#24207;&#22312;&#37096;&#32626;&#39034;&#24207;&#20026; 110 &#30340;&#24212;&#29992;&#31243;&#24207;&#20043;&#21069;&#21152;&#36733;&#12290;&#22914;&#26524;&#22312;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#26102;&#26410;&#25351;&#23450;&#37096;&#32626;&#39034;&#24207;&#65292;&#23558;&#20998;&#37197;&#40664;&#35748;&#37096;&#32626;&#39034;&#24207; 100&#12290;&#22914;&#26524;&#20004;&#20010;&#24212;&#29992;&#31243;&#24207;&#30340;&#37096;&#32626;&#39034;&#24207;&#30456;&#21516;&#65292;&#21017;&#39318;&#20808;&#21152;&#36733;&#20808;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;&#12290;&#22914;&#26524;&#24212;&#29992;&#31243;&#24207;&#20855;&#26377;&#30456;&#20851;&#24615;&#19988;&#24517;&#39035;&#25353;&#29305;&#23450;&#39034;&#24207;&#21152;&#36733;&#65292;&#21017;&#25351;&#23450;&#37096;&#32626;&#39034;&#24207;&#38750;&#24120;&#26377;&#29992;&#12290;</p>
</dd>
<dt>&#24211;</dt>
<dd>
<p>&#29305;&#23450;&#20110;&#27492;&#24212;&#29992;&#31243;&#24207;&#24182;&#19988;&#20197;&#36887;&#21495;&#20998;&#38548;&#30340;&#24211; JAR &#25991;&#20214;&#21015;&#34920;&#12290;&#25351;&#23450;&#32477;&#23545;&#36335;&#24452;&#25110;&#30456;&#23545;&#36335;&#24452;&#12290;&#30456;&#23545;&#36335;&#24452;&#26159;&#30456;&#23545;&#20110; domain-dir<code>/lib/applibs</code> &#30340;&#36335;&#24452;&#12290;&#22914;&#26524;&#36335;&#24452;&#26159;&#32477;&#23545;&#36335;&#24452;&#65292;&#21017;&#22495;&#31649;&#29702;&#26381;&#21153;&#22120; (DAS) &#24517;&#39035;&#33021;&#22815;&#35775;&#38382;&#27492;&#36335;&#24452;&#65292;&#36825;&#24847;&#21619;&#30528;&#27492;&#36335;&#24452;&#24517;&#39035;&#22312;domain-dir &#19979;&#12290;&#36825;&#20123;&#24211;&#25353;&#20854;&#25351;&#23450;&#30340;&#39034;&#24207;&#20379;&#24212;&#29992;&#31243;&#24207;&#20351;&#29992;&#12290;</p>
</dd>
<dt>&#35828;&#26126;</dt>
<dd>
<p>&#24212;&#29992;&#31243;&#24207;&#35828;&#26126;&#12290;</p>
</dd>
</dl>
<a id="ref-appclient-options" name="ref-appclient-options"></a>
<h5>&#24212;&#29992;&#31243;&#24207;&#23458;&#25143;&#26426;&#30340;&#20854;&#20182;&#36873;&#39033;</h5>
<p>&#22914;&#26524;&#24212;&#29992;&#31243;&#24207;&#31867;&#22411;&#20026;&#24212;&#29992;&#31243;&#24207;&#23458;&#25143;&#26426;&#65292;&#21017;&#20250;&#26174;&#31034;&#20197;&#19979;&#36873;&#39033;&#12290;</p>
<dl>
<dt>&#24212;&#29992;&#31243;&#24207;&#21517;&#31216;</dt>
<dd>
<p>&#24212;&#29992;&#31243;&#24207;&#21517;&#31216;&#12290;</p>
<p>&#21517;&#31216;&#21487;&#21253;&#21547;&#21487;&#36873;&#30340;&#29256;&#26412;&#26631;&#35782;&#31526;&#65292;&#23427;&#36319;&#22312;&#21517;&#31216;&#21518;&#38754;&#65292;&#24182;&#19982;&#21517;&#31216;&#20197;&#20882;&#21495; (<code>:</code>) &#20998;&#38548;&#12290;&#29256;&#26412;&#26631;&#35782;&#31526;&#24517;&#39035;&#20197;&#23383;&#27597;&#25110;&#25968;&#23383;&#24320;&#22836;&#12290;&#23427;&#21487;&#21253;&#21547;&#23383;&#27597;&#25968;&#23383;&#20197;&#21450;&#19979;&#21010;&#32447; (<code>_</code>)&#12289;&#30701;&#21010;&#32447; (<code>-</code>) &#21644;&#21477;&#28857; (<code>.</code>) &#31561;&#23383;&#31526;&#12290;&#26377;&#20851;&#27169;&#22359;&#21644;&#24212;&#29992;&#31243;&#24207;&#29256;&#26412;&#30340;&#35814;&#32454;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Oracle GlassFish Server Application Deployment Guide</i> &#20013;&#30340; <i>Module and Application Versions</i></a>&#12290;</p>
</dd>
<dt>Java Web Start</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&#27492;&#36873;&#39033;&#65292;&#21017;&#20801;&#35768;&#24212;&#29992;&#31243;&#24207;&#23458;&#25143;&#26426;&#27169;&#22359;&#35775;&#38382; Java Web Start&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#36816;&#34892;&#39564;&#35777;&#22120;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#25321;&#27492;&#36873;&#39033;&#65292;&#21017;&#20250;&#22312;&#37096;&#32626;&#20043;&#21069;&#39564;&#35777;&#37096;&#32626;&#25551;&#36848;&#31526;&#12290;&#22914;&#26524;&#39564;&#35777;&#22833;&#36133;&#65292;&#21017;&#37096;&#32626;&#23558;&#19981;&#20250;&#25191;&#34892;&#12290;&#39564;&#35777;&#22120;&#23558;&#26816;&#26597;&#37096;&#32626;&#25551;&#36848;&#31526;&#30340;&#32467;&#26500;&#21644;&#20869;&#23481;&#12290;&#22823;&#22411;&#24212;&#29992;&#31243;&#24207;&#30340;&#39564;&#35777;&#36890;&#24120;&#20250;&#24456;&#32791;&#36153;&#26102;&#38388;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
<p>&#24517;&#39035;&#20174; UpdateTool &#23433;&#35013;&#39564;&#35777;&#22120;&#31243;&#24207;&#21253;&#65292;&#21542;&#21017;&#23558;&#35760;&#24405;&#19968;&#26465;&#35686;&#21578;&#65292;&#24182;&#24573;&#30053;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#24378;&#21046;&#37325;&#26032;&#37096;&#32626;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&#27492;&#36873;&#39033;&#65292;&#21017;&#23558;&#37325;&#26032;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207; (&#22914;&#26524;&#24212;&#29992;&#31243;&#24207;&#24050;&#37096;&#32626;)&#12290;&#22914;&#26524;&#26410;&#36873;&#20013;&#27492;&#36873;&#39033;&#65292;&#21017;&#23581;&#35797;&#37096;&#32626;&#24050;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;&#23558;&#23548;&#33268;&#20986;&#38169;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#37096;&#32626;&#39034;&#24207;</dt>
<dd>
<p>&#24212;&#29992;&#31243;&#24207;&#30340;&#37096;&#32626;&#39034;&#24207;&#12290;</p>
<p>&#22312;&#26381;&#21153;&#22120;&#21551;&#21160;&#26102;&#20808;&#21152;&#36733;&#32534;&#21495;&#36739;&#20302;&#30340;&#24212;&#29992;&#31243;&#24207;&#12290;&#37096;&#32626;&#39034;&#24207;&#20026; 102 &#30340;&#24212;&#29992;&#31243;&#24207;&#22312;&#37096;&#32626;&#39034;&#24207;&#20026; 110 &#30340;&#24212;&#29992;&#31243;&#24207;&#20043;&#21069;&#21152;&#36733;&#12290;&#22914;&#26524;&#22312;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#26102;&#26410;&#25351;&#23450;&#37096;&#32626;&#39034;&#24207;&#65292;&#23558;&#20998;&#37197;&#40664;&#35748;&#37096;&#32626;&#39034;&#24207; 100&#12290;&#22914;&#26524;&#20004;&#20010;&#24212;&#29992;&#31243;&#24207;&#30340;&#37096;&#32626;&#39034;&#24207;&#30456;&#21516;&#65292;&#21017;&#39318;&#20808;&#21152;&#36733;&#20808;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;&#12290;&#22914;&#26524;&#24212;&#29992;&#31243;&#24207;&#20855;&#26377;&#30456;&#20851;&#24615;&#19988;&#24517;&#39035;&#25353;&#29305;&#23450;&#39034;&#24207;&#21152;&#36733;&#65292;&#21017;&#25351;&#23450;&#37096;&#32626;&#39034;&#24207;&#38750;&#24120;&#26377;&#29992;&#12290;</p>
</dd>
<dt>&#35828;&#26126;</dt>
<dd>
<p>&#24212;&#29992;&#31243;&#24207;&#35828;&#26126;&#12290;</p>
</dd>
</dl>
<a id="ref-connmodule-options" name="ref-connmodule-options"></a>
<h5>&#36830;&#25509;&#22120;&#27169;&#22359;&#30340;&#20854;&#20182;&#36873;&#39033;</h5>
<p>&#22914;&#26524;&#24212;&#29992;&#31243;&#24207;&#31867;&#22411;&#20026;&#36830;&#25509;&#22120;&#27169;&#22359;&#65292;&#21017;&#20250;&#26174;&#31034;&#20197;&#19979;&#36873;&#39033;&#12290;</p>
<dl>
<dt>&#24212;&#29992;&#31243;&#24207;&#21517;&#31216;</dt>
<dd>
<p>&#24212;&#29992;&#31243;&#24207;&#21517;&#31216;&#12290;</p>
<p>&#21517;&#31216;&#21487;&#21253;&#21547;&#21487;&#36873;&#30340;&#29256;&#26412;&#26631;&#35782;&#31526;&#65292;&#23427;&#36319;&#22312;&#21517;&#31216;&#21518;&#38754;&#65292;&#24182;&#19982;&#21517;&#31216;&#20197;&#20882;&#21495; (<code>:</code>) &#20998;&#38548;&#12290;&#29256;&#26412;&#26631;&#35782;&#31526;&#24517;&#39035;&#20197;&#23383;&#27597;&#25110;&#25968;&#23383;&#24320;&#22836;&#12290;&#23427;&#21487;&#21253;&#21547;&#23383;&#27597;&#25968;&#23383;&#20197;&#21450;&#19979;&#21010;&#32447; (<code>_</code>)&#12289;&#30701;&#21010;&#32447; (<code>-</code>) &#21644;&#21477;&#28857; (<code>.</code>) &#31561;&#23383;&#31526;&#12290;&#26377;&#20851;&#27169;&#22359;&#21644;&#24212;&#29992;&#31243;&#24207;&#29256;&#26412;&#30340;&#35814;&#32454;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Oracle GlassFish Server Application Deployment Guide</i> &#20013;&#30340; <i>Module and Application Versions</i></a>&#12290;</p>
</dd>
<dt>&#29366;&#24577;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&#27492;&#36873;&#39033;&#65292;&#21017;&#23558;&#21551;&#29992;&#24212;&#29992;&#31243;&#24207;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#27492;&#36873;&#39033;&#24050;&#36873;&#20013;&#12290;</p>
</dd>
<dt>&#36816;&#34892;&#39564;&#35777;&#22120;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#25321;&#27492;&#36873;&#39033;&#65292;&#21017;&#20250;&#22312;&#37096;&#32626;&#20043;&#21069;&#39564;&#35777;&#37096;&#32626;&#25551;&#36848;&#31526;&#12290;&#22914;&#26524;&#39564;&#35777;&#22833;&#36133;&#65292;&#21017;&#37096;&#32626;&#23558;&#19981;&#20250;&#25191;&#34892;&#12290;&#39564;&#35777;&#22120;&#23558;&#26816;&#26597;&#37096;&#32626;&#25551;&#36848;&#31526;&#30340;&#32467;&#26500;&#21644;&#20869;&#23481;&#12290;&#22823;&#22411;&#24212;&#29992;&#31243;&#24207;&#30340;&#39564;&#35777;&#36890;&#24120;&#20250;&#24456;&#32791;&#36153;&#26102;&#38388;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
<p>&#24517;&#39035;&#20174; UpdateTool &#23433;&#35013;&#39564;&#35777;&#22120;&#31243;&#24207;&#21253;&#65292;&#21542;&#21017;&#23558;&#35760;&#24405;&#19968;&#26465;&#35686;&#21578;&#65292;&#24182;&#24573;&#30053;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#24378;&#21046;&#37325;&#26032;&#37096;&#32626;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&#27492;&#36873;&#39033;&#65292;&#21017;&#23558;&#37325;&#26032;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207; (&#22914;&#26524;&#24212;&#29992;&#31243;&#24207;&#24050;&#37096;&#32626;)&#12290;&#22914;&#26524;&#26410;&#36873;&#20013;&#27492;&#36873;&#39033;&#65292;&#21017;&#23581;&#35797;&#37096;&#32626;&#24050;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;&#23558;&#23548;&#33268;&#20986;&#38169;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#20445;&#30041;&#24212;&#29992;&#31243;&#24207;&#33539;&#22260;&#30340;&#36164;&#28304;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&#65292;&#23558;&#20445;&#30041;&#20219;&#20309;&#24212;&#29992;&#31243;&#24207;&#33539;&#22260;&#30340;&#36164;&#28304;&#24182;&#22312;&#37325;&#26032;&#37096;&#32626;&#36807;&#31243;&#20013;&#36824;&#21407;&#36825;&#20123;&#36164;&#28304;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#35813;&#36873;&#39033;&#22788;&#20110;&#26410;&#36873;&#20013;&#29366;&#24577;&#12290;</p>
</dd>
<dt>&#37096;&#32626;&#39034;&#24207;</dt>
<dd>
<p>&#24212;&#29992;&#31243;&#24207;&#30340;&#37096;&#32626;&#39034;&#24207;&#12290;</p>
<p>&#22312;&#26381;&#21153;&#22120;&#21551;&#21160;&#26102;&#20808;&#21152;&#36733;&#32534;&#21495;&#36739;&#20302;&#30340;&#24212;&#29992;&#31243;&#24207;&#12290;&#37096;&#32626;&#39034;&#24207;&#20026; 102 &#30340;&#24212;&#29992;&#31243;&#24207;&#22312;&#37096;&#32626;&#39034;&#24207;&#20026; 110 &#30340;&#24212;&#29992;&#31243;&#24207;&#20043;&#21069;&#21152;&#36733;&#12290;&#22914;&#26524;&#22312;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#26102;&#26410;&#25351;&#23450;&#37096;&#32626;&#39034;&#24207;&#65292;&#23558;&#20998;&#37197;&#40664;&#35748;&#37096;&#32626;&#39034;&#24207; 100&#12290;&#22914;&#26524;&#20004;&#20010;&#24212;&#29992;&#31243;&#24207;&#30340;&#37096;&#32626;&#39034;&#24207;&#30456;&#21516;&#65292;&#21017;&#39318;&#20808;&#21152;&#36733;&#20808;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;&#12290;&#22914;&#26524;&#24212;&#29992;&#31243;&#24207;&#20855;&#26377;&#30456;&#20851;&#24615;&#19988;&#24517;&#39035;&#25353;&#29305;&#23450;&#39034;&#24207;&#21152;&#36733;&#65292;&#21017;&#25351;&#23450;&#37096;&#32626;&#39034;&#24207;&#38750;&#24120;&#26377;&#29992;&#12290;</p>
</dd>
<dt>&#35828;&#26126;</dt>
<dd>
<p>&#24212;&#29992;&#31243;&#24207;&#35828;&#26126;&#12290;</p>
</dd>
</dl>
<a id="ref-ejb-options" name="ref-ejb-options"></a>
<h5>EJB Jar &#30340;&#20854;&#20182;&#36873;&#39033;</h5>
<p>&#22914;&#26524;&#24212;&#29992;&#31243;&#24207;&#31867;&#22411;&#20026; EJB Jar&#65292;&#21017;&#20250;&#26174;&#31034;&#20197;&#19979;&#36873;&#39033;&#12290;</p>
<dl>
<dt>&#24212;&#29992;&#31243;&#24207;&#21517;&#31216;</dt>
<dd>
<p>&#24212;&#29992;&#31243;&#24207;&#21517;&#31216;&#12290;</p>
<p>&#21517;&#31216;&#21487;&#21253;&#21547;&#21487;&#36873;&#30340;&#29256;&#26412;&#26631;&#35782;&#31526;&#65292;&#23427;&#36319;&#22312;&#21517;&#31216;&#21518;&#38754;&#65292;&#24182;&#19982;&#21517;&#31216;&#20197;&#20882;&#21495; (<code>:</code>) &#20998;&#38548;&#12290;&#29256;&#26412;&#26631;&#35782;&#31526;&#24517;&#39035;&#20197;&#23383;&#27597;&#25110;&#25968;&#23383;&#24320;&#22836;&#12290;&#23427;&#21487;&#21253;&#21547;&#23383;&#27597;&#25968;&#23383;&#20197;&#21450;&#19979;&#21010;&#32447; (<code>_</code>)&#12289;&#30701;&#21010;&#32447; (<code>-</code>) &#21644;&#21477;&#28857; (<code>.</code>) &#31561;&#23383;&#31526;&#12290;&#26377;&#20851;&#27169;&#22359;&#21644;&#24212;&#29992;&#31243;&#24207;&#29256;&#26412;&#30340;&#35814;&#32454;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Oracle GlassFish Server Application Deployment Guide</i> &#20013;&#30340; <i>Module and Application Versions</i></a>&#12290;</p>
</dd>
<dt>&#29366;&#24577;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&#27492;&#36873;&#39033;&#65292;&#21017;&#23558;&#21551;&#29992;&#24212;&#29992;&#31243;&#24207;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#27492;&#36873;&#39033;&#24050;&#36873;&#20013;&#12290;</p>
</dd>
<dt>&#21487;&#29992;&#24615;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&ldquo;&#24050;&#21551;&#29992;&rdquo;&#22797;&#36873;&#26694;&#65292;&#21017;&#20026; Web &#20250;&#35805;&#21644;&#26377;&#29366;&#24577;&#20250;&#35805; Bean (SFSB) &#26816;&#26597;&#28857;&#25805;&#20316;&#21644;&#28508;&#22312;&#38045;&#21270;&#21551;&#29992;&#39640;&#21487;&#29992;&#24615;&#12290;&#22914;&#26524;&#35774;&#32622;&#20026;&ldquo;&#20551;&rdquo;(&#40664;&#35748;&#20540;)&#65292;&#21017;&#23545;&#25351;&#23450;&#24212;&#29992;&#31243;&#24207;&#12289;Web &#24212;&#29992;&#31243;&#24207;&#25110; EJB &#27169;&#22359;&#31105;&#29992;&#25152;&#26377; Web &#20250;&#35805;&#20445;&#23384;&#21644; SFSB &#26816;&#26597;&#28857;&#25805;&#20316;&#12290;&#22914;&#26524;&#35774;&#32622;&#20026;&ldquo;&#30495;&rdquo;&#65292;&#21017;&#20026;&#25351;&#23450;&#30340;&#24212;&#29992;&#31243;&#24207;&#25110;&#27169;&#22359;&#21551;&#29992;&#39640;&#21487;&#29992;&#24615;&#12290;&#20165;&#24403;&#22312;&#26356;&#39640;&#32423;&#21035;&#19978; (&#20363;&#22914;&#26381;&#21153;&#22120;&#32423;&#21035;&#21644;&#23481;&#22120;&#32423;&#21035;) &#37197;&#32622;&#21644;&#21551;&#29992;&#39640;&#21487;&#29992;&#24615;&#26102;&#65292;&#27492;&#36873;&#39033;&#25165;&#35774;&#32622;&#20026;&ldquo;&#30495;&rdquo;&#12290;</p>
<p>&#22914;&#26524;&#38500;&#40664;&#35748;&#26381;&#21153;&#22120;&#23454;&#20363; (<code>server</code>) &#20197;&#22806;&#36824;&#23384;&#22312;&#38598;&#32676;&#25110;&#29420;&#31435;&#26381;&#21153;&#22120;&#23454;&#20363;&#65292;&#21017;&#20250;&#26174;&#31034;&#35813;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#36816;&#34892;&#39564;&#35777;&#22120;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#25321;&#27492;&#36873;&#39033;&#65292;&#21017;&#20250;&#22312;&#37096;&#32626;&#20043;&#21069;&#39564;&#35777;&#37096;&#32626;&#25551;&#36848;&#31526;&#12290;&#22914;&#26524;&#39564;&#35777;&#22833;&#36133;&#65292;&#21017;&#37096;&#32626;&#23558;&#19981;&#20250;&#25191;&#34892;&#12290;&#39564;&#35777;&#22120;&#23558;&#26816;&#26597;&#37096;&#32626;&#25551;&#36848;&#31526;&#30340;&#32467;&#26500;&#21644;&#20869;&#23481;&#12290;&#22823;&#22411;&#24212;&#29992;&#31243;&#24207;&#30340;&#39564;&#35777;&#36890;&#24120;&#20250;&#24456;&#32791;&#36153;&#26102;&#38388;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
<p>&#24517;&#39035;&#20174; UpdateTool &#23433;&#35013;&#39564;&#35777;&#22120;&#31243;&#24207;&#21253;&#65292;&#21542;&#21017;&#23558;&#35760;&#24405;&#19968;&#26465;&#35686;&#21578;&#65292;&#24182;&#24573;&#30053;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#20860;&#23481;&#24615;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&#65292;&#23545;&#24212;&#29992;&#31243;&#24207;&#20351;&#29992; GlassFish Server v2 JAR &#21487;&#35265;&#24615;&#35201;&#27714;&#65292;&#32780;&#38750; GlassFish Server v3 &#21457;&#34892;&#29256; (&#21253;&#25324; 4.0) &#20013;&#25191;&#34892;&#30340;&#26356;&#20005;&#26684;&#30340; Java EE 6 &#35201;&#27714;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#35813;&#36873;&#39033;&#22788;&#20110;&#26410;&#36873;&#20013;&#29366;&#24577;&#12290;</p>
<p>Java EE 6 &#24179;&#21488;&#35268;&#33539;&#25191;&#34892;&#30340;&#35201;&#27714;&#27604; Java EE 5 &#26356;&#20026;&#20005;&#26684;&#65292;&#22312; Java EE 5 &#20013;&#65292;EAR &#25991;&#20214;&#20013;&#30340; JAR &#25991;&#20214;&#23545;&#21508;&#31181;&#27169;&#22359;&#22343;&#21487;&#35265;&#12290;&#29305;&#21035;&#26159;&#65292;&#24212;&#29992;&#31243;&#24207;&#23458;&#25143;&#26426;&#19981;&#24471;&#35775;&#38382; EJB JAR &#25991;&#20214;&#25110; EAR &#25991;&#20214;&#20013;&#30340;&#20854;&#20182; JAR &#25991;&#20214;&#65292;&#38500;&#38750;&#24341;&#29992;&#20351;&#29992;&#26631;&#20934; Java SE &#26426;&#21046; (&#20363;&#22914;&#25193;&#23637;&#21517;) &#25110; Java EE &#24211;&#30446;&#24405;&#26426;&#21046;&#12290;&#36873;&#20013;&#27492;&#26694;&#23558;&#21024;&#38500;&#36825;&#20123; Java EE 6 &#38480;&#21046;&#12290;</p>
</dd>
<dt>&#24378;&#21046;&#37325;&#26032;&#37096;&#32626;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&#27492;&#36873;&#39033;&#65292;&#21017;&#23558;&#37325;&#26032;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207; (&#22914;&#26524;&#24212;&#29992;&#31243;&#24207;&#24050;&#37096;&#32626;)&#12290;&#22914;&#26524;&#26410;&#36873;&#20013;&#27492;&#36873;&#39033;&#65292;&#21017;&#23581;&#35797;&#37096;&#32626;&#24050;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;&#23558;&#23548;&#33268;&#20986;&#38169;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#20445;&#25345;&#29366;&#24577;</dt>
<dd>
<p>&#27492;&#36873;&#39033;&#25511;&#21046;&#26159;&#21542;&#22312;&#37325;&#26032;&#37096;&#32626;&#26399;&#38388;&#20445;&#30041; Web &#20250;&#35805;&#12289;SFSB &#23454;&#20363;&#21644;&#25345;&#20037;&#21019;&#24314;&#30340; EJB &#35745;&#26102;&#22120;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;&#21482;&#26377;&#21517;&#20026; <code>server</code> &#30340;&#40664;&#35748;&#26381;&#21153;&#22120;&#23454;&#25903;&#25345;&#27492;&#36873;&#39033;&#12290;&#20219;&#20309;&#20854;&#20182;&#30446;&#26631;&#37117;&#19981;&#25903;&#25345;&#27492;&#36873;&#39033;&#24182;&#20104;&#20197;&#24573;&#30053;&#12290;</p>
<p>&#22312;&#20004;&#27425;&#37325;&#26032;&#37096;&#32626;&#26399;&#38388;&#23545;&#24212;&#29992;&#31243;&#24207;&#25152;&#20570;&#30340;&#26576;&#20123;&#26356;&#25913;&#20250;&#23548;&#33268;&#27492;&#21151;&#33021;&#26080;&#27861;&#27491;&#24120;&#24037;&#20316;&#12290;&#20363;&#22914;&#65292;&#19981;&#35201;&#26356;&#25913; SFSB Bean &#31867;&#20013;&#30340;&#23454;&#20363;&#21464;&#37327;&#38598;&#12290;</p>
<p>&#23545;&#20110; Web &#24212;&#29992;&#31243;&#24207;&#65292;&#20165;&#24403; <code>glassfish-web-app.xml</code> &#25991;&#20214;&#20013; <code>session-manager</code> &#20803;&#32032;&#30340; <code>persistence-type</code> &#23646;&#24615;&#26159; <code>file</code> &#26102;&#65292;&#27492;&#21151;&#33021;&#25165;&#21487;&#29992;&#12290;</p>
<p>&#23545;&#20110;&#26377;&#29366;&#24577;&#20250;&#35805; Bean &#23454;&#20363;&#65292;&#22312;&#26381;&#21153;&#22120;&#20013;&#35774;&#32622;&#19981;&#25903;&#25345;&#39640;&#21487;&#29992;&#24615;&#30340;&#25345;&#20037;&#31867;&#22411; (&ldquo;SFSB &#25345;&#20037;&#31867;&#22411;&rdquo;&#36873;&#39033;) &#19988;&#24517;&#39035;&#23558;&#20854;&#35774;&#32622;&#20026;<code>&#25991;&#20214;</code>&#65292;&#36825;&#26159;&#40664;&#35748;&#20540;&#65292;&#24314;&#35758;&#20351;&#29992;&#35813;&#20540;&#12290;</p>
<p>&#22914;&#26524;&#26080;&#27861;&#20445;&#30041;&#25110;&#36824;&#21407;&#20219;&#20309;&#27963;&#21160; Web &#20250;&#35805;&#12289;SFSB &#23454;&#20363;&#25110; EJB &#35745;&#26102;&#22120;&#65292;&#21017;&#22312;&#37325;&#26032;&#37096;&#32626;&#23436;&#25104;&#26102;&#36825;&#20123;&#36164;&#28304;&#23558;<i>&#26080;</i>&#19968;&#21487;&#29992;&#12290;&#20294;&#26159;&#65292;&#37325;&#26032;&#37096;&#32626;&#25805;&#20316;&#23558;&#32487;&#32493;&#65292;&#24182;&#19988;&#35760;&#24405;&#19968;&#20010;&#35686;&#21578;&#12290;</p>
<p>&#20026;&#20102;&#20445;&#30041;&#27963;&#21160;&#29366;&#24577;&#25968;&#25454;&#65292;GlassFish Server &#23558;&#23545;&#25968;&#25454;&#36827;&#34892;&#24207;&#21015;&#21270;&#65292;&#24182;&#23558;&#25968;&#25454;&#20445;&#23384;&#22312;&#20869;&#23384;&#20013;&#12290;&#20026;&#20102;&#36824;&#21407;&#36825;&#20123;&#25968;&#25454;&#65292;&#26368;&#36817;&#37325;&#26032;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;&#30340;&#31867;&#21152;&#36733;&#22120;&#23558;&#23545;&#20808;&#21069;&#20445;&#23384;&#30340;&#25968;&#25454;&#36827;&#34892;&#21453;&#24207;&#21015;&#21270;&#12290;</p>
</dd>
<dt>&#20445;&#30041;&#24212;&#29992;&#31243;&#24207;&#33539;&#22260;&#30340;&#36164;&#28304;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&#65292;&#23558;&#20445;&#30041;&#20219;&#20309;&#24212;&#29992;&#31243;&#24207;&#33539;&#22260;&#30340;&#36164;&#28304;&#24182;&#22312;&#37325;&#26032;&#37096;&#32626;&#36807;&#31243;&#20013;&#36824;&#21407;&#36825;&#20123;&#36164;&#28304;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#35813;&#36873;&#39033;&#22788;&#20110;&#26410;&#36873;&#20013;&#29366;&#24577;&#12290;</p>
</dd>
<dt>&#37096;&#32626;&#39034;&#24207;</dt>
<dd>
<p>&#24212;&#29992;&#31243;&#24207;&#30340;&#37096;&#32626;&#39034;&#24207;&#12290;</p>
<p>&#22312;&#26381;&#21153;&#22120;&#21551;&#21160;&#26102;&#20808;&#21152;&#36733;&#32534;&#21495;&#36739;&#20302;&#30340;&#24212;&#29992;&#31243;&#24207;&#12290;&#37096;&#32626;&#39034;&#24207;&#20026; 102 &#30340;&#24212;&#29992;&#31243;&#24207;&#22312;&#37096;&#32626;&#39034;&#24207;&#20026; 110 &#30340;&#24212;&#29992;&#31243;&#24207;&#20043;&#21069;&#21152;&#36733;&#12290;&#22914;&#26524;&#22312;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#26102;&#26410;&#25351;&#23450;&#37096;&#32626;&#39034;&#24207;&#65292;&#23558;&#20998;&#37197;&#40664;&#35748;&#37096;&#32626;&#39034;&#24207; 100&#12290;&#22914;&#26524;&#20004;&#20010;&#24212;&#29992;&#31243;&#24207;&#30340;&#37096;&#32626;&#39034;&#24207;&#30456;&#21516;&#65292;&#21017;&#39318;&#20808;&#21152;&#36733;&#20808;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;&#12290;&#22914;&#26524;&#24212;&#29992;&#31243;&#24207;&#20855;&#26377;&#30456;&#20851;&#24615;&#19988;&#24517;&#39035;&#25353;&#29305;&#23450;&#39034;&#24207;&#21152;&#36733;&#65292;&#21017;&#25351;&#23450;&#37096;&#32626;&#39034;&#24207;&#38750;&#24120;&#26377;&#29992;&#12290;</p>
</dd>
<dt>&#24211;</dt>
<dd>
<p>&#29305;&#23450;&#20110;&#27492;&#27169;&#22359;&#25110;&#24212;&#29992;&#31243;&#24207;&#24182;&#19988;&#20197;&#36887;&#21495;&#20998;&#38548;&#30340;&#24211; JAR &#25991;&#20214;&#21015;&#34920;&#12290;&#25351;&#23450;&#32477;&#23545;&#36335;&#24452;&#25110;&#30456;&#23545;&#36335;&#24452;&#12290;&#30456;&#23545;&#36335;&#24452;&#26159;&#30456;&#23545;&#20110; domain-dir<code>/lib/applibs</code> &#30340;&#36335;&#24452;&#12290;&#22914;&#26524;&#36335;&#24452;&#26159;&#32477;&#23545;&#36335;&#24452;&#65292;&#21017;&#22495;&#31649;&#29702;&#26381;&#21153;&#22120; (DAS) &#24517;&#39035;&#33021;&#22815;&#35775;&#38382;&#27492;&#36335;&#24452;&#65292;&#36825;&#24847;&#21619;&#30528;&#27492;&#36335;&#24452;&#24517;&#39035;&#22312;domain-dir &#19979;&#12290;&#36825;&#20123;&#24211;&#25353;&#20854;&#25351;&#23450;&#30340;&#39034;&#24207;&#20379;&#24212;&#29992;&#31243;&#24207;&#20351;&#29992;&#12290;</p>
</dd>
<dt>&#35828;&#26126;</dt>
<dd>
<p>&#24212;&#29992;&#31243;&#24207;&#35828;&#26126;&#12290;</p>
</dd>
</dl>
<a id="sthref301" name="sthref301"></a>
<h5>&#38024;&#23545;&ldquo;&#20854;&#20182;&rdquo;&#31867;&#22411;&#30340;&#24212;&#29992;&#31243;&#24207;&#30340;&#20854;&#20182;&#36873;&#39033;</h5>
<p>&#22914;&#26524;&#24212;&#29992;&#31243;&#24207;&#31867;&#22411;&#20026;&ldquo;&#20854;&#20182;&rdquo;&#65292;&#21017;&#20250;&#26174;&#31034;&#20197;&#19979;&#36873;&#39033;&#12290;</p>
<dl>
<dt>&#24212;&#29992;&#31243;&#24207;&#21517;&#31216;</dt>
<dd>
<p>&#24212;&#29992;&#31243;&#24207;&#21517;&#31216;&#12290;</p>
<p>&#21517;&#31216;&#21487;&#21253;&#21547;&#21487;&#36873;&#30340;&#29256;&#26412;&#26631;&#35782;&#31526;&#65292;&#23427;&#36319;&#22312;&#21517;&#31216;&#21518;&#38754;&#65292;&#24182;&#19982;&#21517;&#31216;&#20197;&#20882;&#21495; (<code>:</code>) &#20998;&#38548;&#12290;&#29256;&#26412;&#26631;&#35782;&#31526;&#24517;&#39035;&#20197;&#23383;&#27597;&#25110;&#25968;&#23383;&#24320;&#22836;&#12290;&#23427;&#21487;&#21253;&#21547;&#23383;&#27597;&#25968;&#23383;&#20197;&#21450;&#19979;&#21010;&#32447; (<code>_</code>)&#12289;&#30701;&#21010;&#32447; (<code>-</code>) &#21644;&#21477;&#28857; (<code>.</code>) &#31561;&#23383;&#31526;&#12290;&#26377;&#20851;&#27169;&#22359;&#21644;&#24212;&#29992;&#31243;&#24207;&#29256;&#26412;&#30340;&#35814;&#32454;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Oracle GlassFish Server Application Deployment Guide</i> &#20013;&#30340; <i>Module and Application Versions</i></a>&#12290;</p>
</dd>
<dt>&#34394;&#25311;&#26381;&#21153;&#22120;</dt>
<dd>
<p>&#19982;&#27492;&#24212;&#29992;&#31243;&#24207;&#30456;&#20851;&#32852;&#30340;&#34394;&#25311;&#26381;&#21153;&#22120;&#12290;</p>
<p>&#20165;&#24403;&#23384;&#22312;&#40664;&#35748;&#26381;&#21153;&#22120;&#23454;&#20363; <code>server</code> &#26102;&#65292;&#25165;&#20250;&#26174;&#31034;&ldquo;&#34394;&#25311;&#26381;&#21153;&#22120;&rdquo;&#36873;&#39033;&#12290;&#22914;&#26524;&#23384;&#22312;&#38598;&#32676;&#25110;&#20854;&#20182;&#29420;&#31435;&#26381;&#21153;&#22120;&#23454;&#20363;&#65292;&#21017;&#21487;&#20197;&#22312;&#37096;&#32626;&#21518;&#36873;&#25321;&#34394;&#25311;&#26381;&#21153;&#22120;&#12290;&#36716;&#33267;&ldquo;&#32534;&#36753;&#24212;&#29992;&#31243;&#24207;&rdquo;&#39029;&#65292;&#36873;&#25321;&ldquo;&#30446;&#26631;&rdquo;&#36873;&#39033;&#21345;&#65292;&#28982;&#21518;&#20026;&#25152;&#38656;&#30446;&#26631;&#36873;&#25321;&ldquo;&#31649;&#29702;&#34394;&#25311;&#26381;&#21153;&#22120;&rdquo;&#12290;</p>
</dd>
<dt>&#29366;&#24577;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&#27492;&#36873;&#39033;&#65292;&#21017;&#23558;&#21551;&#29992;&#24212;&#29992;&#31243;&#24207;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#27492;&#36873;&#39033;&#24050;&#36873;&#20013;&#12290;</p>
</dd>
<dt>&#21487;&#29992;&#24615;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&ldquo;&#24050;&#21551;&#29992;&rdquo;&#22797;&#36873;&#26694;&#65292;&#21017;&#20026; Web &#20250;&#35805;&#21644;&#26377;&#29366;&#24577;&#20250;&#35805; Bean (SFSB) &#26816;&#26597;&#28857;&#25805;&#20316;&#21644;&#28508;&#22312;&#38045;&#21270;&#21551;&#29992;&#39640;&#21487;&#29992;&#24615;&#12290;&#22914;&#26524;&#35774;&#32622;&#20026;&ldquo;&#20551;&rdquo;(&#40664;&#35748;&#20540;)&#65292;&#21017;&#23545;&#25351;&#23450;&#24212;&#29992;&#31243;&#24207;&#12289;Web &#24212;&#29992;&#31243;&#24207;&#25110; EJB &#27169;&#22359;&#31105;&#29992;&#25152;&#26377; Web &#20250;&#35805;&#20445;&#23384;&#21644; SFSB &#26816;&#26597;&#28857;&#25805;&#20316;&#12290;&#22914;&#26524;&#35774;&#32622;&#20026;&ldquo;&#30495;&rdquo;&#65292;&#21017;&#20026;&#25351;&#23450;&#30340;&#24212;&#29992;&#31243;&#24207;&#25110;&#27169;&#22359;&#21551;&#29992;&#39640;&#21487;&#29992;&#24615;&#12290;&#20165;&#24403;&#22312;&#26356;&#39640;&#32423;&#21035;&#19978; (&#20363;&#22914;&#26381;&#21153;&#22120;&#32423;&#21035;&#21644;&#23481;&#22120;&#32423;&#21035;) &#37197;&#32622;&#21644;&#21551;&#29992;&#39640;&#21487;&#29992;&#24615;&#26102;&#65292;&#27492;&#36873;&#39033;&#25165;&#35774;&#32622;&#20026;&ldquo;&#30495;&rdquo;&#12290;</p>
<p>&#22914;&#26524;&#38500;&#40664;&#35748;&#26381;&#21153;&#22120;&#23454;&#20363; (<code>server</code>) &#20197;&#22806;&#36824;&#23384;&#22312;&#38598;&#32676;&#25110;&#29420;&#31435;&#26381;&#21153;&#22120;&#23454;&#20363;&#65292;&#21017;&#20250;&#26174;&#31034;&#35813;&#36873;&#39033;&#12290;</p>
</dd>
<dt>OSGI &#31867;&#22411;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&#27492;&#36873;&#39033;&#65292;&#21017;&#25351;&#23450;&#28151;&#21512; OSGi/Java-EE &#27169;&#22359;&#12290;&#20165;&#24403;&#36873;&#25321;&#30340;&ldquo;&#31867;&#22411;&rdquo;&#20026;&ldquo;&#20854;&#20182;&rdquo;&#26102;&#65292;&#25165;&#20250;&#26174;&#31034;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#39044;&#32534;&#35793; JSP</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&#20102;&#27492;&#36873;&#39033;&#65292;&#23558;&#23545; JavaServer Pages (JSP) &#25991;&#20214;&#36827;&#34892;&#39044;&#32534;&#35793;&#12290;&#22914;&#26524;&#31105;&#29992;&#27492;&#36873;&#39033;&#65292;&#21017;&#22312;&#36816;&#34892;&#26102;&#39318;&#27425;&#35775;&#38382; JSP &#25991;&#20214;&#26102;&#23545;&#20854;&#36827;&#34892;&#32534;&#35793;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#36816;&#34892;&#39564;&#35777;&#22120;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#25321;&#27492;&#36873;&#39033;&#65292;&#21017;&#20250;&#22312;&#37096;&#32626;&#20043;&#21069;&#39564;&#35777;&#37096;&#32626;&#25551;&#36848;&#31526;&#12290;&#22914;&#26524;&#39564;&#35777;&#22833;&#36133;&#65292;&#21017;&#37096;&#32626;&#23558;&#19981;&#20250;&#25191;&#34892;&#12290;&#39564;&#35777;&#22120;&#23558;&#26816;&#26597;&#37096;&#32626;&#25551;&#36848;&#31526;&#30340;&#32467;&#26500;&#21644;&#20869;&#23481;&#12290;&#22823;&#22411;&#24212;&#29992;&#31243;&#24207;&#30340;&#39564;&#35777;&#36890;&#24120;&#20250;&#24456;&#32791;&#36153;&#26102;&#38388;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
<p>&#24517;&#39035;&#20174; UpdateTool &#23433;&#35013;&#39564;&#35777;&#22120;&#31243;&#24207;&#21253;&#65292;&#21542;&#21017;&#23558;&#35760;&#24405;&#19968;&#26465;&#35686;&#21578;&#65292;&#24182;&#24573;&#30053;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#24378;&#21046;&#37325;&#26032;&#37096;&#32626;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#20013;&#27492;&#36873;&#39033;&#65292;&#21017;&#23558;&#37325;&#26032;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207; (&#22914;&#26524;&#24212;&#29992;&#31243;&#24207;&#24050;&#37096;&#32626;)&#12290;&#22914;&#26524;&#26410;&#36873;&#20013;&#27492;&#36873;&#39033;&#65292;&#21017;&#23581;&#35797;&#37096;&#32626;&#24050;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;&#23558;&#23548;&#33268;&#20986;&#38169;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#20445;&#25345;&#29366;&#24577;</dt>
<dd>
<p>&#27492;&#36873;&#39033;&#25511;&#21046;&#26159;&#21542;&#22312;&#37325;&#26032;&#37096;&#32626;&#26399;&#38388;&#20445;&#30041; Web &#20250;&#35805;&#12289;SFSB &#23454;&#20363;&#21644;&#25345;&#20037;&#21019;&#24314;&#30340; EJB &#35745;&#26102;&#22120;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;&#21482;&#26377;&#21517;&#20026; <code>server</code> &#30340;&#40664;&#35748;&#26381;&#21153;&#22120;&#23454;&#25903;&#25345;&#27492;&#36873;&#39033;&#12290;&#20219;&#20309;&#20854;&#20182;&#30446;&#26631;&#37117;&#19981;&#25903;&#25345;&#27492;&#36873;&#39033;&#24182;&#20104;&#20197;&#24573;&#30053;&#12290;</p>
<p>&#22312;&#20004;&#27425;&#37325;&#26032;&#37096;&#32626;&#26399;&#38388;&#23545;&#24212;&#29992;&#31243;&#24207;&#25152;&#20570;&#30340;&#26576;&#20123;&#26356;&#25913;&#20250;&#23548;&#33268;&#27492;&#21151;&#33021;&#26080;&#27861;&#27491;&#24120;&#24037;&#20316;&#12290;&#20363;&#22914;&#65292;&#19981;&#35201;&#26356;&#25913; SFSB Bean &#31867;&#20013;&#30340;&#23454;&#20363;&#21464;&#37327;&#38598;&#12290;</p>
<p>&#23545;&#20110; Web &#24212;&#29992;&#31243;&#24207;&#65292;&#20165;&#24403; <code>glassfish-web-app.xml</code> &#25991;&#20214;&#20013; <code>session-manager</code> &#20803;&#32032;&#30340; <code>persistence-type</code> &#23646;&#24615;&#26159; <code>file</code> &#26102;&#65292;&#27492;&#21151;&#33021;&#25165;&#21487;&#29992;&#12290;</p>
<p>&#23545;&#20110;&#26377;&#29366;&#24577;&#20250;&#35805; Bean &#23454;&#20363;&#65292;&#22312;&#26381;&#21153;&#22120;&#20013;&#35774;&#32622;&#19981;&#25903;&#25345;&#39640;&#21487;&#29992;&#24615;&#30340;&#25345;&#20037;&#31867;&#22411; (&ldquo;SFSB &#25345;&#20037;&#31867;&#22411;&rdquo;&#36873;&#39033;) &#19988;&#24517;&#39035;&#23558;&#20854;&#35774;&#32622;&#20026;<code>&#25991;&#20214;</code>&#65292;&#36825;&#26159;&#40664;&#35748;&#20540;&#65292;&#24314;&#35758;&#20351;&#29992;&#35813;&#20540;&#12290;</p>
<p>&#22914;&#26524;&#26080;&#27861;&#20445;&#30041;&#25110;&#36824;&#21407;&#20219;&#20309;&#27963;&#21160; Web &#20250;&#35805;&#12289;SFSB &#23454;&#20363;&#25110; EJB &#35745;&#26102;&#22120;&#65292;&#21017;&#22312;&#37325;&#26032;&#37096;&#32626;&#23436;&#25104;&#26102;&#36825;&#20123;&#36164;&#28304;&#23558;<i>&#26080;</i>&#19968;&#21487;&#29992;&#12290;&#20294;&#26159;&#65292;&#37325;&#26032;&#37096;&#32626;&#25805;&#20316;&#23558;&#32487;&#32493;&#65292;&#24182;&#19988;&#35760;&#24405;&#19968;&#20010;&#35686;&#21578;&#12290;</p>
<p>&#20026;&#20102;&#20445;&#30041;&#27963;&#21160;&#29366;&#24577;&#25968;&#25454;&#65292;GlassFish Server &#23558;&#23545;&#25968;&#25454;&#36827;&#34892;&#24207;&#21015;&#21270;&#65292;&#24182;&#23558;&#25968;&#25454;&#20445;&#23384;&#22312;&#20869;&#23384;&#20013;&#12290;&#20026;&#20102;&#36824;&#21407;&#36825;&#20123;&#25968;&#25454;&#65292;&#26368;&#36817;&#37325;&#26032;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;&#30340;&#31867;&#21152;&#36733;&#22120;&#23558;&#23545;&#20808;&#21069;&#20445;&#23384;&#30340;&#25968;&#25454;&#36827;&#34892;&#21453;&#24207;&#21015;&#21270;&#12290;</p>
</dd>
<dt>&#37096;&#32626;&#39034;&#24207;</dt>
<dd>
<p>&#24212;&#29992;&#31243;&#24207;&#30340;&#37096;&#32626;&#39034;&#24207;&#12290;</p>
<p>&#22312;&#26381;&#21153;&#22120;&#21551;&#21160;&#26102;&#20808;&#21152;&#36733;&#32534;&#21495;&#36739;&#20302;&#30340;&#24212;&#29992;&#31243;&#24207;&#12290;&#37096;&#32626;&#39034;&#24207;&#20026; 102 &#30340;&#24212;&#29992;&#31243;&#24207;&#22312;&#37096;&#32626;&#39034;&#24207;&#20026; 110 &#30340;&#24212;&#29992;&#31243;&#24207;&#20043;&#21069;&#21152;&#36733;&#12290;&#22914;&#26524;&#22312;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#26102;&#26410;&#25351;&#23450;&#37096;&#32626;&#39034;&#24207;&#65292;&#23558;&#20998;&#37197;&#40664;&#35748;&#37096;&#32626;&#39034;&#24207; 100&#12290;&#22914;&#26524;&#20004;&#20010;&#24212;&#29992;&#31243;&#24207;&#30340;&#37096;&#32626;&#39034;&#24207;&#30456;&#21516;&#65292;&#21017;&#39318;&#20808;&#21152;&#36733;&#20808;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;&#12290;&#22914;&#26524;&#24212;&#29992;&#31243;&#24207;&#20855;&#26377;&#30456;&#20851;&#24615;&#19988;&#24517;&#39035;&#25353;&#29305;&#23450;&#39034;&#24207;&#21152;&#36733;&#65292;&#21017;&#25351;&#23450;&#37096;&#32626;&#39034;&#24207;&#38750;&#24120;&#26377;&#29992;&#12290;</p>
</dd>
<dt>&#24211;</dt>
<dd>
<p>&#29305;&#23450;&#20110;&#27492;&#27169;&#22359;&#25110;&#24212;&#29992;&#31243;&#24207;&#24182;&#19988;&#20197;&#36887;&#21495;&#20998;&#38548;&#30340;&#24211; JAR &#25991;&#20214;&#21015;&#34920;&#12290;&#25351;&#23450;&#32477;&#23545;&#36335;&#24452;&#25110;&#30456;&#23545;&#36335;&#24452;&#12290;&#30456;&#23545;&#36335;&#24452;&#26159;&#30456;&#23545;&#20110; domain-dir<code>/lib/applibs</code> &#30340;&#36335;&#24452;&#12290;&#22914;&#26524;&#36335;&#24452;&#26159;&#32477;&#23545;&#36335;&#24452;&#65292;&#21017;&#22495;&#31649;&#29702;&#26381;&#21153;&#22120; (DAS) &#24517;&#39035;&#33021;&#22815;&#35775;&#38382;&#27492;&#36335;&#24452;&#65292;&#36825;&#24847;&#21619;&#30528;&#27492;&#36335;&#24452;&#24517;&#39035;&#22312;domain-dir &#19979;&#12290;&#36825;&#20123;&#24211;&#25353;&#20854;&#25351;&#23450;&#30340;&#39034;&#24207;&#20379;&#24212;&#29992;&#31243;&#24207;&#20351;&#29992;&#12290;</p>
</dd>
<dt>&#35828;&#26126;</dt>
<dd>
<p>&#24212;&#29992;&#31243;&#24207;&#35828;&#26126;&#12290;</p>
</dd>
</dl>
<a id="sthref302" name="sthref302"></a>
<h5>&#30456;&#20851;&#20219;&#21153;</h5>
<ul>
<li>
<p><a href="task-applistdeployed.html">&#26597;&#30475;&#24050;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#21015;&#34920;</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">&#37096;&#32626; Web &#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">&#37096;&#32626;&#20225;&#19994;&#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#23458;&#25143;&#26426;</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">&#37096;&#32626;&#36830;&#25509;&#22120;&#27169;&#22359;</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">&#37096;&#32626; EJB Jar</a></p>
</li>
<li>
<p><a href="task-appedit.html">&#32534;&#36753;&#24050;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">&#26597;&#30475;&#24212;&#29992;&#31243;&#24207;&#30340;&#25551;&#36848;&#31526;</a></p>
</li>
<li>
<p><a href="task-endpoint.html">&#26597;&#30475; Web &#26381;&#21153;&#31471;&#28857;&#20449;&#24687;</a></p>
</li>
<li>
<p><a href="task-applaunch.html">&#21551;&#21160;&#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">&#21551;&#21160;&#24212;&#29992;&#31243;&#24207;&#23458;&#25143;&#26426;</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">&#19979;&#36733;&#24212;&#29992;&#31243;&#24207;&#23458;&#25143;&#26426;&#23384;&#26681;</a></p>
</li>
<li>
<p><a href="task-appredeploy.html">&#37325;&#26032;&#37096;&#32626;&#24050;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-apprestart.html">&#37325;&#26032;&#21152;&#36733;&#24050;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">&#26597;&#30475;&#24212;&#29992;&#31243;&#24207;&#33539;&#22260;&#30340;&#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">&#20462;&#25913;&#24212;&#29992;&#31243;&#24207;&#33539;&#22260;&#30340;&#36164;&#28304;</a></p>
</li>
</ul>
<a id="sthref303" name="sthref303"></a>
<h5>&#30456;&#20851;&#30340; asadmin &#21629;&#20196;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00114"><code>deploy</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00217"><code>redeploy</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00148"><code>list-applications</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
