<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-setadvanceappconfig" name="task-setadvanceappconfig"></a><a id="GHCOM00144" name="GHCOM00144"></a></p>

<h4><a id="sthref7" name="sthref7"></a><a id="sthref8" name="sthref8"></a><a id="sthref9" name="sthref9"></a><a id="sthref10" name="sthref10"></a><a id="sthref11" name="sthref11"></a>&#35774;&#32622;&#24212;&#29992;&#31243;&#24207;&#37197;&#32622;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&ldquo;&#24212;&#29992;&#31243;&#24207;&#37197;&#32622;&rdquo;&#39029;&#21487;&#20197;&#35774;&#32622;&#19968;&#20123;&#23646;&#24615;&#65292;&#36890;&#36807;&#36825;&#20123;&#23646;&#24615;&#21487;&#24110;&#21161;&#30830;&#20445;&#33021;&#22815;&#26816;&#27979;&#21040;&#23545;&#24050;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;&#25152;&#20570;&#30340;&#26356;&#25913;&#24182;&#37325;&#26032;&#21152;&#36733;&#24050;&#20462;&#25913;&#30340;&#31867;&#12290;</p>
<ol>
<li>
<p>&#22312;&#23548;&#33322;&#26641;&#20013;&#65292;&#36873;&#25321;&ldquo;&#22495;&rdquo;&#33410;&#28857;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#22495;&#23646;&#24615;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#36873;&#25321;&ldquo;&#24212;&#29992;&#31243;&#24207;&#37197;&#32622;&rdquo;&#36873;&#39033;&#21345;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#24212;&#29992;&#31243;&#24207;&#37197;&#32622;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#21551;&#29992;&#37325;&#26032;&#21152;&#36733;&rdquo;&#22797;&#36873;&#26694;&#20197;&#21551;&#29992;&#24212;&#29992;&#31243;&#24207;&#30340;&#21160;&#24577;&#37325;&#26032;&#21152;&#36733;&#12290;</p>
<p>&#22914;&#26524;&#24050;&#21551;&#29992;&#21160;&#24577;&#37325;&#26032;&#21152;&#36733;&#65292;&#21017;&#22312;&#26356;&#25913;&#24212;&#29992;&#31243;&#24207;&#25110;&#27169;&#22359;&#30340;&#20195;&#30721;&#25110;&#37096;&#32626;&#25551;&#36848;&#31526;&#26102;&#65292;&#26080;&#38656;&#37325;&#26032;&#23545;&#20854;&#36827;&#34892;&#37096;&#32626;&#12290;&#21482;&#38656;&#23558;&#32463;&#36807;&#26356;&#25913;&#30340; JavaServer Pages (JSP) &#25110;&#31867;&#25991;&#20214;&#22797;&#21046;&#21040;&#24212;&#29992;&#31243;&#24207;&#25110;&#27169;&#22359;&#30340;&#37096;&#32626;&#30446;&#24405;&#20013;&#12290;&#26381;&#21153;&#22120;&#23558;&#23450;&#26399;&#26816;&#26597;&#37096;&#32626;&#30446;&#24405;&#20013;&#30340;&#26356;&#25913;&#65292;&#24182;&#33258;&#21160;&#20351;&#29992;&#36825;&#20123;&#26356;&#25913;&#21160;&#24577;&#37325;&#26032;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#12290;&#36825;&#22312;&#24320;&#21457;&#29615;&#22659;&#20013;&#24456;&#26377;&#29992;&#65292;&#22240;&#20026;&#23427;&#20801;&#35768;&#24555;&#36895;&#27979;&#35797;&#20195;&#30721;&#26356;&#25913;&#12290;&#20294;&#22312;&#29983;&#20135;&#29615;&#22659;&#20013;&#65292;&#21160;&#24577;&#37325;&#26032;&#21152;&#36733;&#21487;&#33021;&#20250;&#20351;&#24615;&#33021;&#38477;&#20302;&#12290;&#27492;&#22806;&#65292;&#27599;&#24403;&#23436;&#25104;&#37325;&#26032;&#21152;&#36733;&#26102;&#65292;&#24403;&#26102;&#30340;&#20250;&#35805;&#37117;&#23558;&#26080;&#25928;&#12290;&#23458;&#25143;&#26426;&#24517;&#39035;&#37325;&#26032;&#21551;&#21160;&#35813;&#20250;&#35805;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#21551;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#37325;&#26032;&#21152;&#36733;&#36718;&#35810;&#26102;&#38388;&#38388;&#38548;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#26816;&#26597;&#24212;&#29992;&#31243;&#24207;&#21644;&#27169;&#22359;&#30340;&#20195;&#30721;&#26356;&#25913;&#24182;&#21160;&#24577;&#37325;&#26032;&#21152;&#36733;&#26102;&#35201;&#37319;&#29992;&#30340;&#26102;&#38388;&#38388;&#38548; (&#31186;)&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 2&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#31649;&#29702;&#20250;&#35805;&#36229;&#26102;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#31649;&#29702;&#25511;&#21046;&#21488;&#20250;&#35805;&#36229;&#26102;&#20043;&#21069;&#22788;&#20110;&#38750;&#27963;&#21160;&#29366;&#24577;&#30340;&#20998;&#38047;&#25968;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 60&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#21551;&#29992;&#33258;&#21160;&#37096;&#32626;&rdquo;&#22797;&#36873;&#26694;&#65292;&#20197;&#21551;&#29992;&#24212;&#29992;&#31243;&#24207;&#30340;&#33258;&#21160;&#37096;&#32626;&#12290;</p>
<p>&#22914;&#26524;&#23558;&#24212;&#29992;&#31243;&#24207;&#25110;&#27169;&#22359;&#25991;&#20214; (JAR&#12289;WAR&#12289;RAR &#25110; EAR) &#22797;&#21046;&#21040;&#29305;&#27530;&#30446;&#24405;&#20013;&#65292;&#28982;&#21518;&#21551;&#29992;&#33258;&#21160;&#37096;&#32626;&#65292;&#21017; GlassFish Server &#23558;&#33258;&#21160;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#25110;&#27169;&#22359;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#21551;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#33258;&#21160;&#37096;&#32626;&#36718;&#35810;&#26102;&#38388;&#38388;&#38548;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#26816;&#26597;&#24212;&#29992;&#31243;&#24207;&#21644;&#27169;&#22359;&#30340;&#20195;&#30721;&#26356;&#25913;&#24182;&#21160;&#24577;&#37325;&#26032;&#21152;&#36733;&#26102;&#35201;&#37319;&#29992;&#30340;&#26102;&#38388;&#38388;&#38548; (&#31186;)&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 2&#12290;&#26356;&#25913;&#36718;&#35810;&#26102;&#38388;&#38388;&#38548;&#19981;&#20250;&#24433;&#21709;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#25110;&#27169;&#22359;&#25152;&#38656;&#30340;&#26102;&#38388;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#33258;&#21160;&#37096;&#32626;&#37325;&#35797;&#36229;&#26102;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#37096;&#20998;&#22797;&#21046;&#30340;&#25991;&#20214;&#22312;&#21457;&#29983;&#38169;&#35823;&#21069;&#21487;&#20197;&#20445;&#25345;&#22823;&#23567;&#19981;&#21464;&#30340;&#31186;&#25968;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 4&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#33258;&#21160;&#37096;&#32626;&#30446;&#24405;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#35201;&#30417;&#35270;&#30340;&#30446;&#24405;&#30340;&#23436;&#25972;&#36335;&#24452;&#65292;&#20197;&#20415;&#23545;&#24212;&#29992;&#31243;&#24207;&#36827;&#34892;&#33258;&#21160;&#37096;&#32626;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; domain-dir<code>/autodeploy</code>&#12290;</p>
</li>
<li>
<p>&#20174;&ldquo;XML &#39564;&#35777;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&#35201;&#23545;&#26631;&#20934;&#37096;&#32626;&#25551;&#36848;&#31526;&#21644; GlassFish Server &#37096;&#32626;&#25551;&#36848;&#31526;&#25191;&#34892;&#30340; XML &#39564;&#35777;&#30340;&#31867;&#22411;&#12290;</p>
<p>&#31867;&#22411;&#21487;&#20197;&#20026;&#20197;&#19979;&#20219;&#24847;&#19968;&#31181;&#65306;</p>
<dl>
<dt><code>&#23436;&#20840;</code></dt>
<dd>
<p>&#22914;&#26524; XML &#39564;&#35777;&#22833;&#36133;&#65292;&#21017;&#37096;&#32626;&#23558;&#22833;&#36133;&#12290;&#35813;&#20540;&#20026;&#40664;&#35748;&#20540;&#12290;</p>
</dd>
<dt><code>&#35299;&#26512;</code></dt>
<dd>
<p>&#25253;&#21578; XML &#39564;&#35777;&#38169;&#35823;&#65292;&#20294;&#20250;&#25191;&#34892;&#37096;&#32626;&#12290;</p>
</dd>
<dt><code>&#26080;</code></dt>
<dd>
<p>&#19981;&#25191;&#34892; XML &#39564;&#35777;&#12290;</p>
</dd>
</dl>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#24050;&#21551;&#29992;&#39564;&#35777;&#22120;&rdquo;&#22797;&#36873;&#26694;&#20197;&#39564;&#35777;&#37096;&#32626;&#25551;&#36848;&#31526;&#25991;&#20214;&#12290;</p>
<p>&#39564;&#35777;&#22120;&#23558;&#22312;&#33258;&#21160;&#37096;&#32626;&#20043;&#21069;&#26816;&#26597;&#25991;&#20214;&#30340;&#32467;&#26500;&#21644;&#20869;&#23481;&#12290;&#22914;&#26524;&#39564;&#35777;&#22833;&#36133;&#65292;&#21017;&#37096;&#32626;&#23558;&#19981;&#20250;&#25191;&#34892;&#12290;&#22823;&#22411;&#24212;&#29992;&#31243;&#24207;&#30340;&#39564;&#35777;&#36890;&#24120;&#20250;&#24456;&#32791;&#36153;&#26102;&#38388;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#24050;&#21551;&#29992;&#39044;&#32534;&#35793;&rdquo;&#22797;&#36873;&#26694;&#20197;&#39044;&#32534;&#35793;&#20219;&#20309; JSP &#25991;&#20214;&#12290;</p>
<p>&#22914;&#26524;&#31105;&#29992;&#27492;&#36873;&#39033;&#65292;&#21017;&#22312;&#36816;&#34892;&#26102;&#39318;&#27425;&#35775;&#38382; JSP &#25991;&#20214;&#26102;&#23545;&#20854;&#36827;&#34892;&#32534;&#35793;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#20854;&#20182;&#23646;&#24615;&rdquo;&#37096;&#20998;&#20013;&#65292;&#25351;&#23450;&#20854;&#20182;&#23646;&#24615;&#12290;</p>
<p>GlassFish Server &#19981;&#23450;&#20041;&#24212;&#29992;&#31243;&#24207;&#30340;&#20219;&#20309;&#20854;&#20182;&#23646;&#24615;&#12290;</p>
<ul>
<li>
<p>&#35201;&#28155;&#21152;&#23646;&#24615;&#65292;&#35831;&#21333;&#20987;&ldquo;&#28155;&#21152;&#23646;&#24615;&rdquo;&#25353;&#38062;&#12290;&#22312;&#26174;&#31034;&#30340;&#31354;&#30333;&#34892;&#20013;&#65292;&#22312;&ldquo;&#21517;&#31216;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#23646;&#24615;&#21517;&#31216;&#65292;&#22312;&ldquo;&#20540;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#23646;&#24615;&#20540;&#12290;</p>
</li>
<li>
<p>&#35201;&#20462;&#25913;&#23646;&#24615;&#65292;&#35831;&#32534;&#36753;&#35813;&#23646;&#24615;&#30340;&ldquo;&#20540;&rdquo;&#23383;&#27573;&#12290;</p>
</li>
<li>
<p>&#35201;&#21024;&#38500;&#23646;&#24615;&#65292;&#35831;&#36873;&#20013;&#20301;&#20110;&#24744;&#35201;&#21024;&#38500;&#23646;&#24615;&#30340;&ldquo;&#21517;&#31216;&rdquo;&#23383;&#27573;&#24038;&#36793;&#30340;&#22797;&#36873;&#26694;&#65292;&#28982;&#21518;&#21333;&#20987;&ldquo;&#21024;&#38500;&#23646;&#24615;&rdquo;&#25353;&#38062;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#21333;&#20987;&ldquo;&#20445;&#23384;&rdquo;&#12290;</p>

<hr>
<p><b>&#25552;&#31034;:</b></p>
&#35201;&#36820;&#22238;&#21040;&#40664;&#35748;&#35774;&#32622;&#65292;&#35831;&#21333;&#20987;&ldquo;&#21152;&#36733;&#40664;&#35748;&#20540;&rdquo;&#25353;&#38062;&#65292;&#28982;&#21518;&#21333;&#20987;&ldquo;&#20445;&#23384;&rdquo;&#12290;<br />
<hr>

</li>
<li>
<p>&#37325;&#26032;&#21551;&#21160;&#26381;&#21153;&#22120;&#12290;</p>
</li>
</ol>
<a id="sthref12" name="sthref12"></a>
<h5>&#21478;&#35831;&#21442;&#38405;</h5>
<ul>
<li>
<p><a href="task-generaltab.html">&#26597;&#30475; DAS &#30340;&#19968;&#33324;&#20449;&#24687;</a></p>
</li>
<li>
<p><a href="task-logviewer.html">&#26597;&#30475; DAS &#30340;&#26085;&#24535;&#25991;&#20214;</a></p>
</li>
<li>
<p><a href="task-filter-logs.html">&#36807;&#28388;&#26174;&#31034;&#30340;&#26085;&#24535;&#35760;&#24405;</a></p>
</li>
<li>
<p><a href="task-setadvancedomainattributes.html">&#35774;&#32622;&#22495;&#23646;&#24615;</a></p>
</li>
<li>
<p><a href="task-collectdomainlogs.html">&#25910;&#38598;&#21644;&#19979;&#36733;&#22495;&#26085;&#24535;</a></p>
</li>
<li>
<p><a href="task-setadminpassword.html">&#26356;&#25913;&#31649;&#29702;&#21592;&#21475;&#20196;</a></p>
</li>
<li>
<p><a href="task-systemproperties.html">&#31649;&#29702;&#31995;&#32479;&#23646;&#24615;</a></p>
</li>
<li>
<p><a href="task-appmonitoringdata.html">&#26597;&#30475;&#24212;&#29992;&#31243;&#24207;&#30417;&#35270;&#25968;&#25454;</a></p>
</li>
<li>
<p><a href="task-servermonitoringdata.html">&#26597;&#30475;&#26381;&#21153;&#22120;&#30417;&#35270;&#25968;&#25454;</a></p>
</li>
<li>
<p><a href="task-resourcemonitoringdata.html">&#26597;&#30475;&#36164;&#28304;&#30417;&#35270;&#25968;&#25454;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
