<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-confmonitor" name="task-confmonitor"></a></p>

<h4><a id="sthref114" name="sthref114"></a>&#37197;&#32622;&#30417;&#35270;&#26381;&#21153;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#25171;&#24320;&ldquo;&#30417;&#35270;&#26381;&#21153;&rdquo;&#39029;&#65292;&#25191;&#34892;&#20197;&#19979;&#20219;&#19968;&#25805;&#20316;&#65306;</p>
<ul>
<li>
<p>&#36873;&#25321;&ldquo;&#30417;&#35270;&#25968;&#25454;&rdquo;&#33410;&#28857;&#65292;&#28982;&#21518;&#21333;&#20987;&#35201;&#20026;&#20854;&#37197;&#32622;&#30417;&#35270;&#30340;&#26381;&#21153;&#22120;&#23454;&#20363;&#30340;&ldquo;&#37197;&#32622;&#30417;&#35270;&rdquo;&#38142;&#25509;&#12290;&#35201;&#20026;&#38598;&#32676;&#37197;&#32622;&#30417;&#35270;&#65292;&#35831;&#36873;&#25321;&#38598;&#32676;&#20013;&#30340;&#20219;&#24847;&#23454;&#20363;&#12290;</p>
</li>
</ul>
<ul>
<li>
<p>&#22312;&ldquo;&#37197;&#32622;&rdquo;&#33410;&#28857;&#19979;&#65292;&#23637;&#24320;&#35201;&#20026;&#20854;&#37197;&#32622;&#30417;&#35270;&#30340;&#26381;&#21153;&#22120;&#23454;&#20363;&#25110;&#38598;&#32676;&#37197;&#32622;&#65292;&#28982;&#21518;&#23637;&#24320;&ldquo;&#30417;&#35270;&rdquo;&#33410;&#28857;&#12290;</p>
</li>
</ul>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#30417;&#35270;&#26381;&#21153;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#21551;&#29992;&#30417;&#35270;&#26381;&#21153;&rdquo;&#22797;&#36873;&#26694;&#21487;&#20026; GlassFish Server &#21551;&#29992;&#30417;&#35270;&#65292;&#21462;&#28040;&#36873;&#25321;&#35813;&#22797;&#36873;&#26694;&#21017;&#21487;&#31105;&#29992;&#30417;&#35270;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#21551;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#21551;&#29992;&#30417;&#35270; MBean&rdquo;&#22797;&#36873;&#26694;&#21487;&#37096;&#32626;&#30417;&#35270;&#25152;&#38656;&#30340;&#25152;&#26377; MBean&#65292;&#21462;&#28040;&#36873;&#25321;&#35813;&#22797;&#36873;&#26694;&#21017;&#21487;&#21462;&#28040;&#37096;&#32626;&#36825;&#20123; MBean&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#21551;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
<p>&#22914;&#26524;&#26410;&#36873;&#20013;&#35813;&#22797;&#36873;&#26694;&#65292;&#21017;&#26080;&#27861;&#22312;&#31649;&#29702;&#25511;&#21046;&#21488;&#20013;&#26597;&#30475;&#30417;&#35270;&#25968;&#25454;&#65292;&#21363;&#20351;&#36873;&#20013;&ldquo;&#30417;&#35270;&#26381;&#21153;&rdquo;&#22797;&#36873;&#26694;&#20063;&#26159;&#22914;&#27492;&#12290;&#27492;&#26102;&#65292;&#24744;&#24517;&#39035;&#25913;&#29992;&#21629;&#20196;&#34892;&#26469;&#26597;&#30475;&#30417;&#35270;&#25968;&#25454;&#12290;&#22914;&#26524;&#21462;&#28040;&#36873;&#25321;&#35813;&#22797;&#36873;&#26694;&#65292;&#21017;&#20250;&#20943;&#23569; GlassFish Server &#30340;&#20869;&#23384;&#21344;&#29992;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#21551;&#29992; DTrace&rdquo;&#22797;&#36873;&#26694;&#21487;&#20197;&#21551;&#29992; Solaris DTrace &#24037;&#20855;&#12290;</p>
<p>&#35201;&#20351;&#29992; Solaris DTrace &#24037;&#20855;&#65292;&#36824;&#24517;&#39035;&#26377; Oracle Enterprise Manager DTrace Monitoring&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#22312;&#34920;&#20013;&#65292;&#25191;&#34892;&#20197;&#19979;&#25805;&#20316;&#20043;&#19968;&#12290;</p>
<ul>
<li>
<p>&#22312;&ldquo;&#30417;&#35270;&#32423;&#21035;&rdquo;&#21015;&#20013;&#65292;&#20174;&#19979;&#25289;&#21015;&#34920;&#20026;&ldquo;&#32452;&#20214;&rdquo;&#21015;&#20013;&#30340;&#19968;&#20010;&#25110;&#22810;&#20010;&#32452;&#20214;&#36873;&#25321;&ldquo;&#20302;&rdquo;&#25110;&ldquo;&#39640;&rdquo;&#65292;&#20026;&#36825;&#20123;&#32452;&#20214;&#21551;&#29992;&#30417;&#35270;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&#19968;&#20010;&#25110;&#22810;&#20010;&#32452;&#20214;&#26049;&#36793;&#30340;&#22797;&#36873;&#26694;&#65292;&#28982;&#21518;&#20174;&#27492;&#34920;&#39030;&#37096;&#30340;&ldquo;&#32423;&#21035;&rdquo;&#19979;&#25289;&#21015;&#34920;&#36873;&#25321;&ldquo;&#20302;&rdquo;&#25110;&ldquo;&#39640;&rdquo;&#65292;&#24182;&#21333;&#20987;&ldquo;&#26356;&#25913;&#32423;&#21035;&rdquo;&#25353;&#38062;&#65292;&#20197;&#23558;&#25152;&#26377;&#36825;&#20123;&#32452;&#20214;&#30340;&#30417;&#35270;&#32423;&#21035;&#35774;&#32622;&#20026;&#27492;&#20540;&#12290;</p>
</li>
</ul>
<p>&#22312;&#27492;&#21457;&#34892;&#29256;&#20013;&#65292;&ldquo;&#20302;&rdquo;&#21644;&ldquo;&#39640;&rdquo;&#36873;&#39033;&#25152;&#25552;&#20379;&#30340;&#30417;&#35270;&#32423;&#21035;&#20043;&#38388;&#27809;&#26377;&#24046;&#21035;&#12290;&#35201;&#20026;&#19968;&#20010;&#25110;&#22810;&#20010;&#32452;&#20214;&#31105;&#29992;&#30417;&#35270;&#65292;&#35831;&#36873;&#25321;&ldquo;&#20851;&#38381;&rdquo;&#12290;&#40664;&#35748;&#20540;&#20026;&ldquo;&#20851;&#38381;&rdquo;&#12290;</p>
<p>&#24744;&#24517;&#39035;&#39318;&#20808;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#12289;&#32452;&#20214;&#25110;&#26381;&#21153;&#65292;&#28982;&#21518;&#25165;&#33021;&#20026;&#23427;&#20204;&#37197;&#32622;&#30417;&#35270;&#12290;</p>
</li>
<li>
<p>&#21333;&#20987;&ldquo;&#20445;&#23384;&rdquo;&#12290;</p>
</li>
</ol>
<a id="GHCOM324" name="GHCOM324"></a>
<h5>&#21478;&#35831;&#21442;&#38405;</h5>
<ul>
<li>
<p><a href="task-appmonitoringdata.html">&#26597;&#30475;&#24212;&#29992;&#31243;&#24207;&#30417;&#35270;&#25968;&#25454;</a></p>
</li>
<li>
<p><a href="task-servermonitoringdata.html">&#26597;&#30475;&#26381;&#21153;&#22120;&#30417;&#35270;&#25968;&#25454;</a></p>
</li>
<li>
<p><a href="task-resourcemonitoringdata.html">&#26597;&#30475;&#36164;&#28304;&#30417;&#35270;&#25968;&#25454;</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
