<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-appredeploy" name="task-appredeploy"></a><a id="GHCOM00167" name="GHCOM00167"></a></p>

<h4><a id="sthref92" name="sthref92"></a><a id="sthref93" name="sthref93"></a>&#37325;&#26032;&#37096;&#32626;&#24050;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#37325;&#26032;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#20250;&#22312;&#20445;&#30041;&#24212;&#29992;&#31243;&#24207;&#26368;&#21021;&#37096;&#32626;&#26102;&#30340;&#35774;&#32622;&#21644;&#20854;&#20182;&#36873;&#39033;&#30340;&#21516;&#26102;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#30340;&#26032;&#29256;&#26412;&#12290;</p>
<a id="sthref94" name="sthref94"></a>
<h5>&#24320;&#22987;&#20043;&#21069;</h5>
<p>&#30830;&#20445;&#35201;&#37325;&#26032;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;&#24050;&#32463;&#37096;&#32626;&#12290;</p>
<ol>
<li>
<p>&#22312;&#23548;&#33322;&#26641;&#20013;&#65292;&#36873;&#25321;&ldquo;&#24212;&#29992;&#31243;&#24207;&rdquo;&#33410;&#28857;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#24212;&#29992;&#31243;&#24207;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#24050;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;&rdquo;&#34920;&#20013;&#65292;&#21333;&#20987;&#35201;&#37325;&#26032;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;&#34892;&#20013;&#30340;&ldquo;&#37325;&#26032;&#37096;&#32626;&rdquo;&#12290;</p>
<p>&#24212;&#29992;&#31243;&#24207;&#21517;&#31216;&#21487;&#21253;&#21547;&#21487;&#36873;&#30340;&#29256;&#26412;&#26631;&#35782;&#31526;&#65292;&#23427;&#36319;&#22312;&#21517;&#31216;&#21518;&#38754;&#65292;&#24182;&#19982;&#21517;&#31216;&#20197;&#20882;&#21495; (<code>:</code>) &#20998;&#38548;&#12290;&#26377;&#20851;&#27169;&#22359;&#21644;&#24212;&#29992;&#31243;&#24207;&#29256;&#26412;&#30340;&#35814;&#32454;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Oracle GlassFish Server Application Deployment Guide</i> &#20013;&#30340; <i>Module and Application Versions</i></a>&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#37325;&#26032;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#25110;&#27169;&#22359;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#25351;&#23450;&#35201;&#37325;&#26032;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;&#30340;&#20301;&#32622;&#12290;</p>
<ul>
<li>
<p>&#22914;&#26524;&#24212;&#29992;&#31243;&#24207;&#26159;&#20301;&#20110;&#23458;&#25143;&#26426;&#25110;&#21487;&#20174;&#23458;&#25143;&#26426;&#35775;&#38382;&#30340;&#26723;&#26696;&#65292;&#35831;&#36873;&#25321;&ldquo;&#35201;&#19978;&#36733;&#21040;&#26381;&#21153;&#22120;&#30340;&#25171;&#21253;&#25991;&#20214;&rdquo;&#36873;&#39033;&#12290;</p>
<p>&#23458;&#25143;&#26426;&#26159;&#21487;&#36890;&#36807;&#27983;&#35272;&#22120;&#26597;&#30475;&#31649;&#29702;&#25511;&#21046;&#21488;&#30340;&#20027;&#26426;&#12290;</p>
<p>&#21333;&#20987;&ldquo;&#27983;&#35272;&rdquo;&#20197;&#25214;&#21040;&#25991;&#20214;&#65292;&#25110;&#38190;&#20837;&#25991;&#20214;&#30340;&#23436;&#25972;&#36335;&#24452;&#12290;</p>
</li>
<li>
<p>&#22914;&#26524;&#24212;&#29992;&#31243;&#24207;&#26159;&#20301;&#20110;&#26381;&#21153;&#22120;&#35745;&#31639;&#26426;&#19978;&#30340;&#26723;&#26696;&#65292;&#25110;&#32773;&#26159;&#26469;&#33258;&#23637;&#24320;&#30446;&#24405;&#30340;&#24050;&#35299;&#21253;&#24212;&#29992;&#31243;&#24207;&#65292;&#35831;&#36873;&#25321;&ldquo;&#21487;&#20174; GlassFish Server &#35775;&#38382;&#30340;&#26412;&#22320;&#25171;&#21253;&#25991;&#20214;&#25110;&#30446;&#24405;&rdquo;&#36873;&#39033;&#12290;</p>
<p>&#26381;&#21153;&#22120;&#35745;&#31639;&#26426;&#26159;&#36816;&#34892;&#22495;&#31649;&#29702;&#26381;&#21153;&#22120; (DAS) &#30340;&#20027;&#26426;&#12290;</p>
<p>&#21333;&#20987;&ldquo;&#27983;&#35272;&#25991;&#20214;&rdquo;&#27983;&#35272;&#33267;&#25991;&#20214;&#65292;&#25110;&#32773;&#21333;&#20987;&ldquo;&#27983;&#35272;&#25991;&#20214;&#22841;&rdquo;&#27983;&#35272;&#33267;&#30446;&#24405;&#12290;&#27492;&#22806;&#65292;&#36824;&#21487;&#38190;&#20837;&#25991;&#20214;&#25110;&#30446;&#24405;&#30340;&#23436;&#25972;&#36335;&#24452;&#21517;&#12290;&#20174;&#23637;&#24320;&#30340;&#30446;&#24405;&#37096;&#32626;&#36866;&#29992;&#20110;&#39640;&#32423;&#24320;&#21457;&#20154;&#21592;&#65292;&#24314;&#35758;&#19981;&#35201;&#22312;&#29983;&#20135;&#29615;&#22659;&#20013;&#25191;&#34892;&#27492;&#25805;&#20316;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#24050;&#21551;&#29992;&#21487;&#29992;&#24615;&rdquo;&#22797;&#36873;&#26694;&#21487;&#20026;&#24212;&#29992;&#31243;&#24207;&#21551;&#29992;&#20250;&#35805;&#25345;&#20037;&#24615;&#21644; SFSB &#26816;&#26597;&#28857;&#25805;&#20316;&#12290;</p>
<p>&#22914;&#26524;&#36873;&#20013;&ldquo;&#24050;&#21551;&#29992;&rdquo;&#22797;&#36873;&#26694;&#65292;&#21017;&#20026; Web &#20250;&#35805;&#21644;&#26377;&#29366;&#24577;&#20250;&#35805; Bean (SFSB) &#26816;&#26597;&#28857;&#25805;&#20316;&#21644;&#28508;&#22312;&#38045;&#21270;&#21551;&#29992;&#39640;&#21487;&#29992;&#24615;&#12290;&#22914;&#26524;&#35774;&#32622;&#20026;&ldquo;&#20551;&rdquo;(&#40664;&#35748;&#20540;)&#65292;&#21017;&#20026;&#25351;&#23450;&#30340;&#24212;&#29992;&#31243;&#24207;&#31105;&#29992;&#25152;&#26377; Web &#20250;&#35805;&#20445;&#23384;&#21644; SFSB &#26816;&#26597;&#28857;&#25805;&#20316;&#12290;&#22914;&#26524;&#35774;&#32622;&#20026;&ldquo;&#30495;&rdquo;&#65292;&#21017;&#20026;&#25351;&#23450;&#30340;&#24212;&#29992;&#31243;&#24207;&#21551;&#29992;&#39640;&#21487;&#29992;&#24615;&#12290;&#20165;&#24403;&#22312;&#26356;&#39640;&#32423;&#21035;&#19978; (&#20363;&#22914;&#26381;&#21153;&#22120;&#32423;&#21035;&#21644;&#23481;&#22120;&#32423;&#21035;) &#37197;&#32622;&#21644;&#21551;&#29992;&#39640;&#21487;&#29992;&#24615;&#26102;&#65292;&#27492;&#36873;&#39033;&#25165;&#35774;&#32622;&#20026;&ldquo;&#30495;&rdquo;&#12290;</p>
<p>&#22914;&#26524;&#38500;&#40664;&#35748;&#26381;&#21153;&#22120;&#23454;&#20363; (<code>server</code>) &#20197;&#22806;&#36824;&#23384;&#22312;&#38598;&#32676;&#25110;&#29420;&#31435;&#26381;&#21153;&#22120;&#23454;&#20363;&#65292;&#21017;&#20250;&#26174;&#31034;&#35813;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#39044;&#32534;&#35793; JSP&rdquo;&#22797;&#36873;&#26694;&#65292;&#20197;&#39044;&#32534;&#35793; JavaServer Pages (JSP) &#25991;&#20214;&#12290;</p>
<p>&#22914;&#26524;&#31105;&#29992;&#27492;&#36873;&#39033;&#65292;&#21017;&#22312;&#36816;&#34892;&#26102;&#39318;&#27425;&#35775;&#38382; JSP &#25991;&#20214;&#26102;&#23545;&#20854;&#36827;&#34892;&#32534;&#35793;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#36816;&#34892;&#39564;&#35777;&#22120;&rdquo;&#22797;&#36873;&#26694;&#23558;&#22312;&#37325;&#26032;&#37096;&#32626;&#21069;&#39564;&#35777;&#37096;&#32626;&#25551;&#36848;&#31526;&#12290;</p>
<p>&#22914;&#26524;&#36873;&#20013;&#27492;&#36873;&#39033;&#24182;&#19988;&#39564;&#35777;&#22833;&#36133;&#65292;&#21017;&#37325;&#26032;&#37096;&#32626;&#23558;&#19981;&#20250;&#25191;&#34892;&#12290;&#39564;&#35777;&#22120;&#23558;&#26816;&#26597;&#37096;&#32626;&#25551;&#36848;&#31526;&#30340;&#32467;&#26500;&#21644;&#20869;&#23481;&#12290;&#22823;&#22411;&#24212;&#29992;&#31243;&#24207;&#30340;&#39564;&#35777;&#36890;&#24120;&#20250;&#24456;&#32791;&#36153;&#26102;&#38388;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
<p>&#24517;&#39035;&#20174; UpdateTool &#23433;&#35013;&#39564;&#35777;&#22120;&#31243;&#24207;&#21253;&#65292;&#21542;&#21017;&#23558;&#35760;&#24405;&#19968;&#26465;&#35686;&#21578;&#65292;&#24182;&#24573;&#30053;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;Java Web Start&rdquo;&#22797;&#36873;&#26694;&#65292;&#20026;&#24212;&#29992;&#31243;&#24207;&#23458;&#25143;&#26426;&#27169;&#22359;&#21551;&#29992; Java Web Start &#35775;&#38382;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#26681;&#25454;&#26368;&#21021;&#37096;&#32626;&#26102;&#30340;&#35774;&#32622;&#31105;&#29992;&#25110;&#21551;&#29992;&#35813;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#20445;&#25345;&#29366;&#24577;&rdquo;&#22797;&#36873;&#26694;&#23558;&#22312;&#20004;&#27425;&#37325;&#26032;&#37096;&#32626;&#26399;&#38388;&#20445;&#30041; Web &#20250;&#35805;&#12289;SFSB &#23454;&#20363;&#20197;&#21450;&#21019;&#24314;&#30340;&#25345;&#20037;&#24615; EJB &#35745;&#26102;&#22120;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;&#21482;&#26377;&#21517;&#20026; <code>server</code> &#30340;&#40664;&#35748;&#26381;&#21153;&#22120;&#23454;&#25903;&#25345;&#27492;&#36873;&#39033;&#12290;&#20219;&#20309;&#20854;&#20182;&#30446;&#26631;&#37117;&#19981;&#25903;&#25345;&#27492;&#36873;&#39033;&#24182;&#20104;&#20197;&#24573;&#30053;&#12290;</p>
<p>&#22312;&#20004;&#27425;&#37325;&#26032;&#37096;&#32626;&#26399;&#38388;&#23545;&#24212;&#29992;&#31243;&#24207;&#25152;&#20570;&#30340;&#26576;&#20123;&#26356;&#25913;&#20250;&#23548;&#33268;&#27492;&#21151;&#33021;&#26080;&#27861;&#27491;&#24120;&#24037;&#20316;&#12290;&#20363;&#22914;&#65292;&#19981;&#35201;&#26356;&#25913; SFSB Bean &#31867;&#20013;&#30340;&#23454;&#20363;&#21464;&#37327;&#38598;&#12290;</p>
<p>&#23545;&#20110; Web &#24212;&#29992;&#31243;&#24207;&#65292;&#20165;&#24403; <code>glassfish-web-app.xml</code> &#25991;&#20214;&#20013; <code>session-manager</code> &#20803;&#32032;&#30340; <code>persistence-type</code> &#23646;&#24615;&#26159; <code>file</code> &#26102;&#65292;&#27492;&#21151;&#33021;&#25165;&#21487;&#29992;&#12290;</p>
<p>&#23545;&#20110;&#26377;&#29366;&#24577;&#20250;&#35805; Bean &#23454;&#20363;&#65292;&#22312;&#26381;&#21153;&#22120;&#20013;&#35774;&#32622;&#19981;&#25903;&#25345;&#39640;&#21487;&#29992;&#24615;&#30340;&#25345;&#20037;&#31867;&#22411; (&ldquo;SFSB &#25345;&#20037;&#31867;&#22411;&rdquo;&#36873;&#39033;) &#19988;&#24517;&#39035;&#23558;&#20854;&#35774;&#32622;&#20026;<code>&#25991;&#20214;</code>&#65292;&#36825;&#26159;&#40664;&#35748;&#20540;&#65292;&#24314;&#35758;&#20351;&#29992;&#35813;&#20540;&#12290;</p>
<p>&#22914;&#26524;&#26080;&#27861;&#20445;&#30041;&#25110;&#36824;&#21407;&#20219;&#20309;&#27963;&#21160; Web &#20250;&#35805;&#12289;SFSB &#23454;&#20363;&#25110; EJB &#35745;&#26102;&#22120;&#65292;&#21017;&#22312;&#37325;&#26032;&#37096;&#32626;&#23436;&#25104;&#26102;&#36825;&#20123;&#36164;&#28304;&#23558;<i>&#26080;</i>&#19968;&#21487;&#29992;&#12290;&#20294;&#26159;&#65292;&#37325;&#26032;&#37096;&#32626;&#25805;&#20316;&#23558;&#32487;&#32493;&#65292;&#24182;&#19988;&#35760;&#24405;&#19968;&#20010;&#35686;&#21578;&#12290;</p>
<p>&#20026;&#20102;&#20445;&#30041;&#27963;&#21160;&#29366;&#24577;&#25968;&#25454;&#65292;GlassFish Server &#23558;&#23545;&#25968;&#25454;&#36827;&#34892;&#24207;&#21015;&#21270;&#65292;&#24182;&#23558;&#25968;&#25454;&#20445;&#23384;&#22312;&#20869;&#23384;&#20013;&#12290;&#20026;&#20102;&#36824;&#21407;&#36825;&#20123;&#25968;&#25454;&#65292;&#26368;&#36817;&#37325;&#26032;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;&#30340;&#31867;&#21152;&#36733;&#22120;&#23558;&#23545;&#20808;&#21069;&#20445;&#23384;&#30340;&#25968;&#25454;&#36827;&#34892;&#21453;&#24207;&#21015;&#21270;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#20445;&#30041;&#24212;&#29992;&#31243;&#24207;&#33539;&#22260;&#30340;&#36164;&#28304;&rdquo;&#22797;&#36873;&#26694;&#23558;&#20445;&#30041;&#20219;&#20309;&#24212;&#29992;&#31243;&#24207;&#33539;&#22260;&#30340;&#36164;&#28304;&#65292;&#24182;&#22312;&#37325;&#26032;&#37096;&#32626;&#36807;&#31243;&#20013;&#36824;&#21407;&#36825;&#20123;&#36164;&#28304;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#21333;&#20987;&ldquo;&#30830;&#23450;&rdquo;&#12290;</p>
</li>
</ol>
<a id="sthref95" name="sthref95"></a>
<h5>&#21478;&#35831;&#21442;&#38405;</h5>
<ul>
<li>
<p><a href="task-applistdeployed.html">&#26597;&#30475;&#24050;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#21015;&#34920;</a></p>
</li>
<li>
<p><a href="task-appdeployweb.html">&#37096;&#32626; Web &#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-deployentapp.html">&#37096;&#32626;&#20225;&#19994;&#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-appdeployclient.html">&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#23458;&#25143;&#26426;</a></p>
</li>
<li>
<p><a href="task-appdeployconn.html">&#37096;&#32626;&#36830;&#25509;&#22120;&#27169;&#22359;</a></p>
</li>
<li>
<p><a href="task-appdeployejb.html">&#37096;&#32626; EJB Jar</a></p>
</li>
<li>
<p><a href="task-appedit.html">&#32534;&#36753;&#24050;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">&#26597;&#30475;&#24212;&#29992;&#31243;&#24207;&#30340;&#25551;&#36848;&#31526;</a></p>
</li>
<li>
<p><a href="task-appviewtargets.html">&#26597;&#30475;&#24212;&#29992;&#31243;&#24207;&#30446;&#26631;</a></p>
</li>
<li>
<p><a href="task-endpoint.html">&#26597;&#30475; Web &#26381;&#21153;&#31471;&#28857;&#20449;&#24687;</a></p>
</li>
<li>
<p><a href="task-applaunch.html">&#21551;&#21160;&#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-appclientlaunch.html">&#21551;&#21160;&#24212;&#29992;&#31243;&#24207;&#23458;&#25143;&#26426;</a></p>
</li>
<li>
<p><a href="task-appclientstubs.html">&#19979;&#36733;&#24212;&#29992;&#31243;&#24207;&#23458;&#25143;&#26426;&#23384;&#26681;</a></p>
</li>
<li>
<p><a href="task-apprestart.html">&#37325;&#26032;&#21152;&#36733;&#24050;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesview.html">&#26597;&#30475;&#24212;&#29992;&#31243;&#24207;&#33539;&#22260;&#30340;&#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-appscopedresourcesedit.html">&#20462;&#25913;&#24212;&#29992;&#31243;&#24207;&#33539;&#22260;&#30340;&#36164;&#28304;</a></p>
</li>
<li>
<p><a href="../../../ejb/en/help/task-ejbcontaineravailability.html">&#20026; EJB &#23481;&#22120;&#37197;&#32622;&#21487;&#29992;&#24615;&#35774;&#32622;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
