<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-appviewtargets" name="task-appviewtargets"></a></p>

<h4>&#26597;&#30475;&#24212;&#29992;&#31243;&#24207;&#30446;&#26631;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#23548;&#33322;&#26641;&#20013;&#65292;&#36873;&#25321;&ldquo;&#24212;&#29992;&#31243;&#24207;&rdquo;&#33410;&#28857;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#24212;&#29992;&#31243;&#24207;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#36873;&#25321;&#24744;&#35201;&#26597;&#30475;&#30446;&#26631;&#30340;&#24212;&#29992;&#31243;&#24207;&#12290;</p>
<p>&#24212;&#29992;&#31243;&#24207;&#21517;&#31216;&#21487;&#21253;&#21547;&#21487;&#36873;&#30340;&#29256;&#26412;&#26631;&#35782;&#31526;&#65292;&#23427;&#36319;&#22312;&#21517;&#31216;&#21518;&#38754;&#65292;&#24182;&#19982;&#21517;&#31216;&#20197;&#20882;&#21495; (<code>:</code>) &#20998;&#38548;&#12290;&#26377;&#20851;&#27169;&#22359;&#21644;&#24212;&#29992;&#31243;&#24207;&#29256;&#26412;&#30340;&#35814;&#32454;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Oracle GlassFish Server Application Deployment Guide</i> &#20013;&#30340; <i>Module and Application Versions</i></a>&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&#24212;&#29992;&#31243;&#24207;&#30340;&#39029;&#12290;</p>
</li>
<li>
<p>&#36873;&#25321;&ldquo;&#30446;&#26631;&rdquo;&#36873;&#39033;&#21345;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#24212;&#29992;&#31243;&#24207;&#30446;&#26631;&rdquo;&#39029;&#65292;&#26174;&#31034;&#24403;&#21069;&#20026;&#24212;&#29992;&#31243;&#24207;&#25351;&#23450;&#30340;&#30446;&#26631;&#12290;</p>
</li>
<li>
<p>&#35201;&#22312;&#29305;&#23450;&#30446;&#26631;&#23454;&#20363;&#25110;&#38598;&#32676;&#19978;&#21551;&#29992;&#25110;&#31105;&#29992;&#24212;&#29992;&#31243;&#24207;&#65292;&#35831;&#21333;&#20987;&#30446;&#26631;&#26049;&#30340;&#22797;&#36873;&#26694;&#65292;&#24182;&#20174;&ldquo;&#26356;&#22810;&#25805;&#20316;&rdquo;&#19979;&#25289;&#33756;&#21333;&#20013;&#36873;&#25321;&ldquo;&#21551;&#29992;&rdquo;&#25110;&ldquo;&#31105;&#29992;&rdquo;&#12290;</p>
</li>
<li>
<p>&#35201;&#22312;&#29305;&#23450;&#30446;&#26631;&#23454;&#20363;&#25110;&#38598;&#32676;&#19978;&#20026;&#30446;&#26631;&#21551;&#29992;&#36127;&#36733;&#24179;&#34913;&#65292;&#35831;&#21333;&#20987;&#30446;&#26631;&#26049;&#30340;&#22797;&#36873;&#26694;&#65292;&#24182;&#20174;&ldquo;&#26356;&#22810;&#25805;&#20316;&rdquo;&#19979;&#25289;&#33756;&#21333;&#20013;&#36873;&#25321;&ldquo;&#36127;&#36733;&#24179;&#34913;&#22120;&#21551;&#29992;&rdquo;&#25110;&ldquo;&#36127;&#36733;&#24179;&#34913;&#22120;&#31105;&#29992;&rdquo;&#12290;</p>
</li>
<li>
<p>&#35201;&#23558;&#24212;&#29992;&#31243;&#24207;&#19982;&#29305;&#23450;&#34394;&#25311;&#26381;&#21153;&#22120;&#30456;&#20851;&#32852;&#65292;&#35831;&#20026;&#25152;&#38656;&#30446;&#26631;&#23454;&#20363;&#25110;&#38598;&#32676;&#36873;&#25321;&ldquo;&#31649;&#29702;&#34394;&#25311;&#26381;&#21153;&#22120;&rdquo;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#34394;&#25311;&#26381;&#21153;&#22120;&#30446;&#26631;&rdquo;&#39029;&#12290;</p>
<p>&#35201;&#28155;&#21152;&#30446;&#26631;&#34394;&#25311;&#26381;&#21153;&#22120;&#65292;&#35831;&#20174;&ldquo;&#21487;&#29992;&#30446;&#26631;&rdquo;&#21015;&#34920;&#20013;&#36873;&#25321;&#23427;&#20204;&#65292;&#28982;&#21518;&#20351;&#29992;&ldquo;&#28155;&#21152;&rdquo;&#25353;&#38062;&#23558;&#23427;&#20204;&#31227;&#21160;&#21040;&ldquo;&#25152;&#36873;&#30446;&#26631;&rdquo;&#21015;&#34920;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#27169;&#22359;&#25110;&#24212;&#29992;&#31243;&#24207;&#19982;&#21517;&#20026; <code>server</code> &#30340;&#40664;&#35748;&#34394;&#25311;&#26381;&#21153;&#22120;&#30456;&#20851;&#32852;&#12290;&#20351;&#29992;&ldquo;&#20840;&#37096;&#28155;&#21152;&rdquo;&#25353;&#38062;&#21487;&#28155;&#21152;&#25152;&#26377;&#30446;&#26631;&#12290;&#20351;&#29992;&ldquo;&#21024;&#38500;&rdquo;&#21644;&ldquo;&#20840;&#37096;&#21024;&#38500;&rdquo;&#25353;&#38062;&#21487;&#23558;&#30446;&#26631;&#20174;&ldquo;&#25152;&#36873;&#30446;&#26631;&rdquo;&#21015;&#34920;&#20013;&#21024;&#38500;&#12290;</p>
<p>&#36873;&#25321;&ldquo;&#20445;&#23384;&rdquo;&#23558;&#36820;&#22238;&#21040;&ldquo;&#24212;&#29992;&#31243;&#24207;&#30446;&#26631;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#35201;&#20026;&#24212;&#29992;&#31243;&#24207;&#28155;&#21152;&#25110;&#21024;&#38500;&#30446;&#26631;&#23454;&#20363;&#25110;&#38598;&#32676;&#65292;&#35831;&#36873;&#25321;&ldquo;&#31649;&#29702;&#30446;&#26631;&rdquo;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#31649;&#29702;&#30446;&#26631;&rdquo;&#39029;&#12290;</p>
<p>&#35201;&#28155;&#21152;&#30446;&#26631;&#65292;&#35831;&#20174;&ldquo;&#21487;&#29992;&#30446;&#26631;&rdquo;&#21015;&#34920;&#20013;&#36873;&#25321;&#23427;&#20204;&#65292;&#28982;&#21518;&#20351;&#29992;&ldquo;&#28155;&#21152;&rdquo;&#25353;&#38062;&#23558;&#23427;&#20204;&#31227;&#21160;&#21040;&ldquo;&#25152;&#36873;&#30446;&#26631;&rdquo;&#21015;&#34920;&#12290;</p>
<p>&#20351;&#29992;&ldquo;&#20840;&#37096;&#28155;&#21152;&rdquo;&#25353;&#38062;&#21487;&#28155;&#21152;&#25152;&#26377;&#30446;&#26631;&#12290;&#20351;&#29992;&ldquo;&#21024;&#38500;&rdquo;&#21644;&ldquo;&#20840;&#37096;&#21024;&#38500;&rdquo;&#25353;&#38062;&#21487;&#23558;&#30446;&#26631;&#20174;&ldquo;&#25152;&#36873;&#30446;&#26631;&rdquo;&#21015;&#34920;&#20013;&#21024;&#38500;&#12290;</p>
<p>&#36873;&#25321;&ldquo;&#20445;&#23384;&rdquo;&#23558;&#36820;&#22238;&#21040;&ldquo;&#24212;&#29992;&#31243;&#24207;&#30446;&#26631;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#21333;&#20987;&ldquo;&#20445;&#23384;&rdquo;&#12290;</p>
<p>&#24212;&#29992;&#31243;&#24207;&#27492;&#26102;&#23558;&#20986;&#29616;&#22312;&#20462;&#35746;&#21518;&#30340;&#30446;&#26631;&#21015;&#34920;&#19978;&#12290;</p>
</li>
</ol>
<a id="GHCOM251" name="GHCOM251"></a>
<h5>&#21478;&#35831;&#21442;&#38405;</h5>
<ul>
<li>
<p><a href="task-appedit.html">&#32534;&#36753;&#24050;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-appviewdesc.html">&#26597;&#30475;&#24212;&#29992;&#31243;&#24207;&#30340;&#25551;&#36848;&#31526;</a></p>
</li>
<li>
<p><a href="task-applaunch.html">&#21551;&#21160;&#24212;&#29992;&#31243;&#24207;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
