<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-securitysettings" name="task-securitysettings"></a></p>

<h4><a id="sthref78" name="sthref78"></a><a id="sthref79" name="sthref79"></a>&#37197;&#32622;&#23433;&#20840;&#24615;&#35774;&#32622;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#36890;&#36807;&#31649;&#29702;&#25511;&#21046;&#21488;&#21487;&#20197;&#35774;&#32622;&#21508;&#31181;&#31995;&#32479;&#33539;&#22260;&#30340;&#23433;&#20840;&#24615;&#35774;&#32622;&#12290;</p>
<ol>
<li>
<p>&#22312;&#23548;&#33322;&#26641;&#20013;&#65292;&#23637;&#24320;&ldquo;&#37197;&#32622;&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#37197;&#32622;&rdquo;&#33410;&#28857;&#19979;&#65292;&#21333;&#20987;&#24744;&#35201;&#20026;&#20854;&#37197;&#32622;&ldquo;&#23433;&#20840;&#24615;&rdquo;&#35774;&#32622;&#30340;&#26381;&#21153;&#22120;&#23454;&#20363;&#25110;&#38598;&#32676;&#37197;&#32622;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#37197;&#32622;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#37197;&#32622;&rdquo;&#39029;&#19978;&#65292;&#21333;&#20987;&ldquo;&#23433;&#20840;&#24615;&rdquo;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&#25152;&#36873;&#37197;&#32622;&#30446;&#26631;&#30340;&ldquo;&#23433;&#20840;&#24615;&rdquo;&#35774;&#32622;&#39029;&#12290;</p>
</li>
<li>
<p>&#36873;&#25321;&ldquo;&#21551;&#29992;&#23433;&#20840;&#31649;&#29702;&#22120;&rdquo;&#22797;&#36873;&#26694;&#26469;&#25171;&#24320;&#23433;&#20840;&#31649;&#29702;&#22120;&#12290;</p>
<p>&#22914;&#26524;&#24050;&#21551;&#29992;&#27492;&#36873;&#39033;&#65292;&#21017; JVM &#36873;&#39033; <code>-Djava.security.manager</code> &#23558;&#28155;&#21152;&#21040; GlassFish Server &#30340; JVM &#35774;&#32622;&#20013;&#12290;&#35831;&#21442;&#38405;<a href="task-jvmoptions.html">&#37197;&#32622; JVM &#36873;&#39033;</a>&#12290;&#24517;&#39035;&#37325;&#26032;&#21551;&#21160;&#26381;&#21153;&#22120;&#65292;&#25165;&#33021;&#20351;&#27492;&#26356;&#25913;&#29983;&#25928;&#12290;</p>
<p>&#35831;&#30830;&#20445;&#24744;&#24050;&#38024;&#23545;&#25152;&#26377;&#24212;&#29992;&#31243;&#24207;&#25480;&#20104;&#20102;&#27491;&#30830;&#30340;&#26435;&#38480;&#12290;&#24744;&#21487;&#20197;&#36890;&#36807;&#20851;&#38381;&#23433;&#20840;&#31649;&#29702;&#22120;&#26469;&#25552;&#39640;&#24615;&#33021;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#36873;&#25321;&ldquo;&#21551;&#29992;&#23457;&#35745;&#26085;&#24535;&#35760;&#24405;&rdquo;&#22797;&#36873;&#26694;&#25171;&#24320;&#23457;&#35745;&#26085;&#24535;&#35760;&#24405;&#12290;</p>
<p>&#22914;&#26524;&#21551;&#29992;&#27492;&#36873;&#39033;&#65292;&#21017;&#26381;&#21153;&#22120;&#23558;&#21152;&#36733;&#24182;&#36816;&#34892;&#22312;&ldquo;&#23457;&#35745;&#27169;&#22359;&rdquo;&#21015;&#34920;&#20013;&#36873;&#25321;&#30340;&#25152;&#26377;&#23457;&#35745;&#27169;&#22359;&#12290;&#22914;&#26524;&#31105;&#29992;&#27492;&#36873;&#39033;&#65292;&#21017;&#26381;&#21153;&#22120;&#23558;&#19981;&#20250;&#35775;&#38382;&#23457;&#35745;&#27169;&#22359;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#20174;&ldquo;&#40664;&#35748;&#39046;&#22495;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&#26381;&#21153;&#22120;&#23558;&#29992;&#20110;&#39564;&#35777;&#30340;&#27963;&#21160;&#39046;&#22495;&#12290;</p>
<p>&#22914;&#26524;&#24212;&#29992;&#31243;&#24207;&#30340;&#37096;&#32626;&#25551;&#36848;&#31526;&#27809;&#26377;&#25351;&#23450;&#20854;&#20182;&#30340;&#39046;&#22495;&#65292;&#21017;&#24212;&#29992;&#31243;&#24207;&#23558;&#20351;&#29992;&#27492;&#39046;&#22495;&#12290;&#21015;&#34920;&#20013;&#23558;&#26174;&#31034;&#25152;&#26377;&#24050;&#37197;&#32622;&#30340;&#39046;&#22495;&#12290;&#40664;&#35748;&#20540;&#20026;<code>&#25991;&#20214;</code>&#12290;</p>
</li>
<li>
<p>&#25351;&#23450;&#40664;&#35748;&#20027;&#29992;&#25143;&#20449;&#24687;&#12290;</p>
<ol type="a">
<li>
<p>&#22312;&ldquo;&#40664;&#35748;&#20027;&#29992;&#25143;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#40664;&#35748;&#30340;&#29992;&#25143;&#21517;&#12290;</p>
<p>&#22914;&#26524;&#27809;&#26377;&#25552;&#20379;&#20854;&#20182;&#30340;&#20027;&#29992;&#25143;&#65292;&#21017;&#26381;&#21153;&#22120;&#20351;&#29992;&#27492;&#29992;&#25143;&#21517;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#40664;&#35748;&#20027;&#29992;&#25143;&#21475;&#20196;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#22312;&ldquo;&#40664;&#35748;&#20027;&#29992;&#25143;&rdquo;&#23383;&#27573;&#20013;&#25351;&#23450;&#30340;&#40664;&#35748;&#20027;&#29992;&#25143;&#30340;&#21475;&#20196;&#12290;</p>
</li>
</ol>
<p>&#26222;&#36890;&#26381;&#21153;&#22120;&#25805;&#20316;&#19981;&#38656;&#35201;&#40664;&#35748;&#20027;&#29992;&#25143;&#12290;</p>
</li>
<li>
<p>&#20174;&ldquo;JACC&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&#24050;&#37197;&#32622;&#30340; JACC &#25552;&#20379;&#26041;&#30340;&#21517;&#31216;&#12290;</p>
<p>&#40664;&#35748;&#36873;&#25321;&#20026;<code>&#40664;&#35748;</code>&#21644;<code>&#31616;&#21333;</code>&#12290;&#40664;&#35748;&#36873;&#39033;&#20026;<code>&#40664;&#35748;</code>&#12290;&#26377;&#20851;&#21019;&#24314;&#26032;&#30340; JACC &#25552;&#20379;&#26041;&#30340;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405; ***&#12290;</p>
</li>
<li>
<p>&#20174;&ldquo;&#23457;&#35745;&#27169;&#22359;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&#22312;&#21551;&#29992;&#23457;&#35745;&#26085;&#24535;&#35760;&#24405;&#30340;&#24773;&#20917;&#19979;&#65292;&#23457;&#35745;&#23376;&#31995;&#32479;&#23558;&#20351;&#29992;&#30340;&#23457;&#35745;&#25552;&#20379;&#26041;&#27169;&#22359;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#26381;&#21153;&#22120;&#20351;&#29992;&#21517;&#20026;<code>&#40664;&#35748;</code>&#30340;&#23457;&#35745;&#27169;&#22359;&#12290;&#26377;&#20851;&#21019;&#24314;&#26032;&#23457;&#35745;&#27169;&#22359;&#30340;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405;<a href="task-auditmodulenew.html">&#21019;&#24314;&#23457;&#35745;&#27169;&#22359;</a>&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#21551;&#29992;&#20027;&#29992;&#25143;&#21040;&#35282;&#33394;&#30340;&#40664;&#35748;&#26144;&#23556;&rdquo;&#22797;&#36873;&#26694;&#65292;&#20197;&#23558;&#20027;&#29992;&#25143;&#21040;&#35282;&#33394;&#30340;&#40664;&#35748;&#26144;&#23556;&#24212;&#29992;&#21040;&#27809;&#26377;&#24212;&#29992;&#31243;&#24207;&#29305;&#23450;&#26144;&#23556;&#30340;&#24212;&#29992;&#31243;&#24207;&#12290;</p>
</li>
<li>
<p>&#22914;&#26524;&#24050;&#21551;&#29992;&#40664;&#35748;&#20027;&#29992;&#25143;&#21040;&#35282;&#33394;&#26144;&#23556;&#65292;&#35831;&#22312;&ldquo;&#26144;&#23556;&#30340;&#20027;&#29992;&#25143;&#31867;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#35201;&#22312;&#40664;&#35748;&#20027;&#29992;&#25143;&#21040;&#35282;&#33394;&#26144;&#23556;&#20013;&#20351;&#29992;&#30340;&#23450;&#21046; <code>java.security.Principal</code> &#23454;&#29616;&#31867;&#30340;&#21517;&#31216;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#20854;&#20182;&#23646;&#24615;&rdquo;&#37096;&#20998;&#20013;&#65292;&#25351;&#23450;&#20854;&#20182;&#23646;&#24615;&#12290;</p>
<p>&#26377;&#25928;&#23646;&#24615;&#21462;&#20915;&#20110;&#22312;&ldquo;&#40664;&#35748;&#39046;&#22495;&rdquo;&#23383;&#27573;&#20013;&#36873;&#25321;&#30340;&#39046;&#22495;&#30340;&#31867;&#22411;&#12290;&#26681;&#25454;&#24744;&#35201;&#37197;&#32622;&#30340;&#39046;&#22495;&#31867;&#22411;&#65292;&#21442;&#32771;&#20197;&#19979;&#21015;&#34920;&#20013;&#30340;&#30456;&#24212;&#26465;&#30446;&#12290;</p>
<ul>
<li>
<p><a href="ref-editfile-adminrealm.html">&#29305;&#23450;&#20110; <code>FileRealm</code> &#31867;&#30340;&#23646;&#24615;</a></p>
</li>
<li>
<p><a href="ref-editcertrealm.html">&#29305;&#23450;&#20110; <code>CertificateRealm</code> &#31867;&#30340;&#23646;&#24615;</a></p>
</li>
<li>
<p><a href="ref-editjdbcrealm.html">&#29305;&#23450;&#20110; <code>JDBCRealm</code> &#31867;&#30340;&#23646;&#24615;</a></p>
</li>
<li>
<p><a href="ref-ldaprealmprop.html">&#29305;&#23450;&#20110; <code>LDAPRealm</code> &#31867;&#30340;&#23646;&#24615;</a></p>
</li>
<li>
<p><a href="ref-solarisrealmprop.html">&#29305;&#23450;&#20110; <code>SolarisRealm</code> &#31867;&#30340;&#23646;&#24615;</a></p>
</li>
<li>
<p><a href="ref-pamrealmprop.html">&#29305;&#23450;&#20110; <code>PamRealm</code> &#31867;&#30340;&#23646;&#24615;</a></p>
</li>
</ul>
<ul>
<li>
<p>&#35201;&#28155;&#21152;&#23646;&#24615;&#65292;&#35831;&#21333;&#20987;&ldquo;&#28155;&#21152;&#23646;&#24615;&rdquo;&#25353;&#38062;&#12290;&#22312;&#26174;&#31034;&#30340;&#31354;&#30333;&#34892;&#20013;&#65292;&#22312;&ldquo;&#21517;&#31216;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#23646;&#24615;&#21517;&#31216;&#65292;&#22312;&ldquo;&#20540;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#23646;&#24615;&#20540;&#12290;</p>
</li>
<li>
<p>&#35201;&#20462;&#25913;&#23646;&#24615;&#65292;&#35831;&#32534;&#36753;&#35813;&#23646;&#24615;&#30340;&ldquo;&#20540;&rdquo;&#23383;&#27573;&#12290;</p>
</li>
<li>
<p>&#35201;&#21024;&#38500;&#23646;&#24615;&#65292;&#35831;&#36873;&#20013;&#20301;&#20110;&#24744;&#35201;&#21024;&#38500;&#23646;&#24615;&#30340;&ldquo;&#21517;&#31216;&rdquo;&#23383;&#27573;&#24038;&#36793;&#30340;&#22797;&#36873;&#26694;&#65292;&#28982;&#21518;&#21333;&#20987;&ldquo;&#21024;&#38500;&#23646;&#24615;&rdquo;&#25353;&#38062;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#21333;&#20987;&ldquo;&#20445;&#23384;&rdquo;&#12290;</p>
</li>
</ol>
<a id="GHCOM280" name="GHCOM280"></a>
<h5>&#21478;&#35831;&#21442;&#38405;</h5>
<ul>
<li>
<p><a href="task-accessadmintools.html">&#25480;&#20104;&#23545;&#31649;&#29702;&#24037;&#20855;&#30340;&#35775;&#38382;&#26435;&#38480;</a></p>
</li>
<li>
<p><a href="task-changeadminpasswd.html">&#26356;&#25913;&#31649;&#29702;&#39046;&#22495;&#20013;&#29992;&#25143;&#30340;&#21475;&#20196;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
