<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-filter-logs" name="task-filter-logs"></a></p>

<h4>&#36807;&#28388;&#26174;&#31034;&#30340;&#26085;&#24535;&#35760;&#24405;</h4>
<a name="BEGIN" id="BEGIN"></a><a id="GHCOM230" name="GHCOM230"></a>
<h5>&#24320;&#22987;&#20043;&#21069;</h5>
<p>&#35831;&#30830;&#20445;&#26597;&#30475;&#30340;&#26159;&#22495;&#31649;&#29702;&#26381;&#21153;&#22120; (DAS)&#12289;&#38598;&#32676; GlassFish Server &#23454;&#20363;&#25110;&#29420;&#31435;&#23454;&#20363;&#30340;&#26085;&#24535;&#25991;&#20214;&#12290;&#26377;&#20851;&#35814;&#32454;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405;&#20197;&#19979;&#20027;&#39064;&#65306;</p>
<ul>
<li>
<p><a href="task-logviewer.html">&#26597;&#30475; DAS &#30340;&#26085;&#24535;&#25991;&#20214;</a></p>
</li>
<li>
<p><a href="../../../cluster/en/help/task-view-logs-clustered-instance.html">&#26597;&#30475;&#38598;&#32676; GlassFish Server &#23454;&#20363;&#30340;&#26085;&#24535;&#25991;&#20214;</a></p>
</li>
<li>
<p><a href="../../../cluster/en/help/task-view-logs-standalone-instance.html">&#26597;&#30475;&#29420;&#31435; GlassFish Server &#23454;&#20363;&#30340;&#26085;&#24535;&#25991;&#20214;</a></p>
</li>
</ul>
<ol>
<li>
<p>&#22312;&ldquo;&#25628;&#32034;&#26631;&#20934;&rdquo;&#21306;&#22495;&#20013;&#65292;&#25353;&#20869;&#23481;&#12289;&#26102;&#38388;&#27573;&#21644;&#26085;&#24535;&#32423;&#21035;&#36807;&#28388;&#35760;&#24405;&#12290;</p>
<ol type="a">
<li>
<p>&#35201;&#21482;&#26174;&#31034;&#21253;&#21547;&#29305;&#23450;&#25991;&#26412;&#30340;&#35760;&#24405;&#65292;&#35831;&#22312;&ldquo;&#25991;&#26412;&#25628;&#32034;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#35813;&#25991;&#26412;&#12290;</p>
<p>&#35813;&#25628;&#32034;&#21306;&#20998;&#22823;&#23567;&#20889;&#12290;</p>
</li>
<li>
<p>&#35201;&#36873;&#25321;&#26174;&#31034;&#26085;&#24535;&#35760;&#24405;&#30340;&#26102;&#38388;&#27573;&#65292;&#35831;&#20351;&#29992;&ldquo;&#26102;&#38388;&#25139;&rdquo;&#36873;&#39033;&#12290;</p>
<ul>
<li>
<p>&#35201;&#26597;&#30475;&#26368;&#36817;&#30340;&#28040;&#24687;&#65292;&#35831;&#36873;&#25321;&ldquo;&#26368;&#36817;&rdquo;(&#40664;&#35748;&#20540;)&#12290;</p>
</li>
<li>
<p>&#22914;&#26524;&#21482;&#26597;&#30475;&#29305;&#23450;&#26102;&#38388;&#27573;&#20869;&#30340;&#28040;&#24687;&#65292;&#35831;&#36873;&#25321;&ldquo;&#29305;&#23450;&#33539;&#22260;&rdquo;&#24182;&#22312;&#26174;&#31034;&#30340;&ldquo;&#20174;&rdquo;&#23383;&#27573;&#21644;&ldquo;&#21040;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#26085;&#26399;&#21644;&#26102;&#38388;&#20540;&#12290;</p>
<p>&ldquo;&#26085;&#26399;&rdquo;&#20540;&#24517;&#39035;&#20026;&#20197;&#19979;&#26684;&#24335;&#65306;</p>
<pre>
<i>MM</i>/<i>DD</i>/<i>YY</i>
</pre>
<p><code><i>MM</i></code> &#20026;&#33539;&#22260;&#22312; 1-12 &#20043;&#38388;&#30340;&#25972;&#25968;&#65292;&#34920;&#31034;&#26376;&#20221;&#12290;&#20363;&#22914;&#65292;1 &#34920;&#31034; 1 &#26376;&#65292;10 &#34920;&#31034; 10 &#26376;&#12290;<code><i>DD</i></code> &#20026;&#33539;&#22260;&#22312; 1-31 &#20043;&#38388;&#30340;&#25972;&#25968;&#65292;&#34920;&#31034;&#27599;&#26376;&#20960;&#21495;&#12290;<code><i>YY</i></code> &#20026;&#24180;&#30340;&#26368;&#21518;&#20004;&#20301;&#25968;&#23383;&#65292;&#20363;&#22914;&#65292;11 &#20195;&#34920; 2011 &#24180;&#12290;</p>
<p>&#20363;&#22914;&#65292;&#35201;&#25351;&#23450;&#26085;&#26399; 2011 &#24180; 2 &#26376; 1 &#26085;&#65292;&#35831;&#22312;&ldquo;&#26085;&#26399;&rdquo;&#23383;&#27573;&#38190;&#20837; <code>2/1/11</code>&#12290;</p>
<p>&ldquo;&#26102;&#38388;&rdquo;&#20540;&#24517;&#39035;&#20026;&#20197;&#19979;&#26684;&#24335;&#65306;</p>
<pre>
<i>hh</i>:<i>mm</i>:<i>ss</i>.<i>SSS</i>
</pre>
<p><code><i>hh</i></code> &#20026;&#33539;&#22260;&#22312; 0-23 &#20043;&#38388;&#30340;&#25972;&#25968;&#65292;&#34920;&#31034;&#23567;&#26102;&#12290;&#23545;&#20110;&#19979;&#21320;&#30340;&#26102;&#38388;&#65292;&#20351;&#29992;&#33539;&#22260;&#22312; 12-23 &#20043;&#38388;&#30340;&#25972;&#25968;&#65292;&#20363;&#22914;&#65292;14 &#34920;&#31034;&#19979;&#21320; 2 &#28857;&#12290;<code><i>mm</i></code> &#20026;&#33539;&#22260;&#22312; 0-59 &#20043;&#38388;&#30340;&#25972;&#25968;&#65292;&#34920;&#31034;&#23567;&#26102;&#20013;&#30340;&#20998;&#38047;&#25968;&#12290;<code><i>ss</i></code> &#20026;&#33539;&#22260;&#22312; 0-59 &#20043;&#38388;&#30340;&#25972;&#25968;&#65292;&#34920;&#31034;&#31186;&#25968;&#12290;<code><i>SSS</i></code> &#20026;&#33539;&#22260;&#22312; 000-999 &#20043;&#38388;&#30340;&#19977;&#20301;&#25968;&#25972;&#25968; (&#22914;&#26524;&#38656;&#35201;&#65292;&#21487;&#24102;&#21069;&#23548;&#38646;)&#65292;&#34920;&#31034;&#27627;&#31186;&#25968;&#12290;</p>
<p>&#20363;&#22914;&#65292;&#35201;&#25351;&#23450;&#26102;&#38388;&#19979;&#21320; 5:10&#65292;&#35831;&#22312;&ldquo;&#26102;&#38388;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837; <code>17:10:00.000</code>&#12290;</p>
<p>&#22914;&#26524;&ldquo;&#20174;&rdquo;&#23383;&#27573;&#20013;&#30340;&#26102;&#38388;&#20540;&#36831;&#20110;&ldquo;&#21040;&rdquo;&#23383;&#27573;&#20013;&#30340;&#26102;&#38388;&#20540;&#65292;&#23558;&#26174;&#31034;&#38169;&#35823;&#28040;&#24687;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#25353;&#26085;&#24535;&#32423;&#21035;&#36807;&#28388;&#28040;&#24687;&#12290;</p>
<p>&#20026;&#30830;&#20445;&#35201;&#26597;&#30475;&#30340;&#28040;&#24687;&#37117;&#26174;&#31034;&#22312;&#26381;&#21153;&#22120;&#26085;&#24535;&#20013;&#65292;&#35831;&#20808;&#22312;&ldquo;&#27169;&#22359;&#26085;&#24535;&#32423;&#21035;&rdquo;&#39029;&#19978;&#35774;&#32622;&#36866;&#24403;&#30340;&#26085;&#24535;&#32423;&#21035;&#12290;&#26377;&#20851;&#35828;&#26126;&#65292;&#35831;&#21442;&#38405;<a href="task-eelogginglevels.html">&#37197;&#32622;&#26085;&#24535;&#32423;&#21035;</a>&#12290;</p>
<p>&#22914;&#26524;&#36873;&#25321;&#25353;&#26085;&#24535;&#32423;&#21035;&#36807;&#28388;&#26085;&#24535;&#28040;&#24687;&#65292;&#23558;&#21482;&#26174;&#31034;&#31526;&#21512;&#25351;&#23450;&#36807;&#28388;&#26465;&#20214;&#30340;&#28040;&#24687;&#12290;&#19981;&#36807;&#65292;&#36825;&#31181;&#36807;&#28388;&#19981;&#24433;&#21709;&#23558;&#21738;&#20123;&#28040;&#24687;&#35760;&#24405;&#21040;&#26381;&#21153;&#22120;&#26085;&#24535;&#20013;&#12290;</p>
<ol>
<li>
<p>&#22312;&ldquo;&#26085;&#24535;&#32423;&#21035;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&#26085;&#24535;&#32423;&#21035;&#12290;</p>
</li>
<li>
<p>&#35201;&#21482;&#26174;&#31034;&#25152;&#36873;&#32423;&#21035;&#30340;&#28040;&#24687;&#65292;&#35831;&#36873;&#25321;&ldquo;&#35831;&#21247;&#21253;&#25324;&#26356;&#20005;&#37325;&#30340;&#28040;&#24687;&rdquo;&#36873;&#39033;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#23558;&#26174;&#31034;&#26381;&#21153;&#22120;&#26085;&#24535;&#20013;&#25152;&#36873;&#26085;&#24535;&#32423;&#21035;&#21644;&#26356;&#20005;&#37325;&#32423;&#21035;&#30340;&#25152;&#26377;&#28040;&#24687;&#12290;</p>
</li>
</ol>
</li>
</ol>
</li>
<li>
<p>&#22312;&ldquo;&#39640;&#32423;&#25628;&#32034;&rdquo;&#21306;&#22495;&#20013;&#65292;&#25353;&#26085;&#24535;&#35760;&#24405;&#31243;&#24207;&#21517;&#31216;&#31354;&#38388;&#36807;&#28388;&#35760;&#24405;&#65292;&#24182;&#36873;&#25321;&#35201;&#26174;&#31034;&#30340;&#20449;&#24687;&#37327;&#12290;</p>
<ol type="a">
<li>
<p>&#21333;&#20987;&ldquo;&#39640;&#32423;&#25628;&#32034;&rdquo;&#38142;&#25509;&#12290;</p>
<p>&ldquo;&#39640;&#32423;&#25628;&#32034;&rdquo;&#21306;&#22495;&#23558;&#28155;&#21152;&#21040;&ldquo;&#26085;&#24535;&#26597;&#30475;&#22120;&rdquo;&#31383;&#21475;&#12290;</p>
</li>
<li>
<p>&#35201;&#25353;&#27169;&#22359;&#36807;&#28388;&#65292;&#35831;&#20174;&ldquo;&#26085;&#24535;&#35760;&#24405;&#31243;&#24207;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#36873;&#25321;&#19968;&#20010;&#25110;&#22810;&#20010;&#21517;&#31216;&#31354;&#38388;&#12290;</p>
<p>&#36890;&#36807;&#25353;&#20303; Shift &#38190;&#21333;&#20987;&#25110;&#25353;&#20303; Ctrl &#38190;&#21333;&#20987;&#36873;&#25321;&#22810;&#20010;&#21517;&#31216;&#31354;&#38388;&#12290;</p>
<p>&#36873;&#25321;&#36739;&#39640;&#32423;&#21035;&#30340;&#21517;&#31216;&#31354;&#38388;&#20063;&#23601;&#36873;&#25321;&#20102;&#35813;&#21517;&#31216;&#31354;&#38388;&#19979;&#30340;&#25152;&#26377;&#21517;&#31216;&#31354;&#38388;&#12290;&#20363;&#22914;&#65292;&#36873;&#25321; <code>javax.enterprise.system</code> &#20250;&#21516;&#26102;&#36873;&#25321;&#35813;&#21517;&#31216;&#31354;&#38388;&#19979;&#25152;&#26377;&#27169;&#22359;&#30340;&#26085;&#24535;&#35760;&#24405;&#31243;&#24207;&#65292;&#20363;&#22914; <code>javax.enterprise.system.core</code>&#12289;<code>javax.enterprise.system.tools.admin</code> &#31561;&#31561;&#12290;</p>
</li>
<li>
<p>&#35201;&#20174;&#26085;&#24535;&#35760;&#24405;&#31243;&#24207;&#20013;&#26597;&#30475;&#26576;&#20010;&#29305;&#23450;&#24212;&#29992;&#31243;&#24207;&#30340;&#28040;&#24687;&#65292;&#35831;&#22312;&ldquo;&#23450;&#21046;&#26085;&#24535;&#35760;&#24405;&#31243;&#24207;&rdquo;&#23383;&#27573;&#20013;&#65292;&#22312;&#21333;&#29420;&#30340;&#34892;&#19978;&#38190;&#20837;&#27599;&#20010;&#26085;&#24535;&#35760;&#24405;&#31243;&#24207;&#30340;&#21517;&#31216;&#12290;</p>
<p>&#22914;&#26524;&#24212;&#29992;&#31243;&#24207;&#20855;&#26377;&#22810;&#20010;&#27169;&#22359;&#65292;&#24744;&#21487;&#20197;&#26597;&#30475;&#20219;&#20309;&#27169;&#22359;&#65292;&#20063;&#21487;&#20197;&#26597;&#30475;&#25152;&#26377;&#27169;&#22359;&#12290;&#20363;&#22914;&#65292;&#26576;&#20010;&#24212;&#29992;&#31243;&#24207;&#21487;&#33021;&#20855;&#26377;&#20197;&#19979;&#26085;&#24535;&#35760;&#24405;&#31243;&#24207;&#65306;</p>
<pre>
com.example.myapp.module1
com.example.myapp.module2
com.example.myapp.module3
</pre>
<p>&#35201;&#26597;&#30475;&#24212;&#29992;&#31243;&#24207;&#20013;&#25152;&#26377;&#27169;&#22359;&#30340;&#28040;&#24687;&#65292;&#35831;&#38190;&#20837; <code>com.mycompany.myapp</code>&#12290;&#35201;&#21482;&#26597;&#30475; <code>module2</code> &#30340;&#28040;&#24687;&#65292;&#35831;&#38190;&#20837; <code>com.example.myapp.module2</code>&#12290;</p>
<p>&#25351;&#23450;&#19968;&#20010;&#25110;&#22810;&#20010;&#23450;&#21046;&#26085;&#24535;&#35760;&#24405;&#31243;&#24207;&#26102;&#65292;&#20165;&#24403;&#22312;&ldquo;&#26085;&#24535;&#35760;&#24405;&#31243;&#24207;&rdquo;&#21306;&#22495;&#20013;&#26174;&#24335;&#25351;&#23450;&#20102; GlassFish Server &#27169;&#22359;&#30340;&#28040;&#24687;&#65292;&#25165;&#20250;&#26174;&#31034;&#36825;&#20123;&#28040;&#24687;&#12290;</p>
</li>
<li>
<p>&#20174;&ldquo;&#26174;&#31034;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&#35201;&#26174;&#31034;&#30340;&#28040;&#24687;&#37327;&#12290;</p>
<p>&#25152;&#26174;&#31034;&#28040;&#24687;&#30340;&#40664;&#35748;&#25968;&#37327;&#20026; 40&#12290;&#20854;&#20182;&#36873;&#39033;&#20026; 100&#12289;250 &#21644; 1000&#12290;</p>
</li>
<li>
<p>&#35201;&#26597;&#30475;&#22534;&#26632;&#36319;&#36394;&#65292;&#35831;&#21462;&#28040;&#36873;&#25321;&ldquo;&#38480;&#21046;&#36807;&#38271;&#30340;&#28040;&#24687;&rdquo;&#36873;&#39033;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#22534;&#26632;&#36319;&#36394;&#19981;&#20986;&#29616;&#22312;&#26597;&#30475;&#22120;&#20013;&#12290;&#35201;&#26597;&#30475;&#22534;&#26632;&#36319;&#36394;&#65292;&#35831;&#21333;&#20987;&#28040;&#24687;&#30340; (&#35814;&#32454;&#20449;&#24687;) &#38142;&#25509;&#12290;</p>
</li>
<li>
<p>&#35201;&#38544;&#34255;&ldquo;&#39640;&#32423;&#25628;&#32034;&rdquo;&#21306;&#22495;&#65292;&#35831;&#21333;&#20987;&ldquo;&#22522;&#26412;&#25628;&#32034;&rdquo;&#38142;&#25509;&#12290;</p>
</li>
</ol>
</li>
<li>
<p>&#35201;&#25351;&#23450;&#24744;&#35201;&#26597;&#30475;&#30340;&#23454;&#20363;&#21644;&#30456;&#20851;&#32852;&#30340;&#26085;&#24535;&#25991;&#20214;&#65292;&#35831;&#20351;&#29992;&ldquo;&#20462;&#25913;&#25628;&#32034;&rdquo;&#21306;&#22495;&#12290;</p>
<ul>
<li>
<p>&#20174;&ldquo;&#23454;&#20363;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&#23454;&#20363;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#26159;&#24744;&#26368;&#21021;&#36873;&#25321;&#26597;&#30475;&#26085;&#24535;&#25991;&#20214;&#30340;&#23454;&#20363;&#12290;&#22914;&#26524;&#36873;&#25321;&#26597;&#30475;&#22495;&#31649;&#29702;&#26381;&#21153;&#22120; (DAS) &#30340;&#26085;&#24535;&#25991;&#20214;&#65292;&#21017;&#40664;&#35748;&#20540;&#26159;&ldquo;&#26381;&#21153;&#22120;&rdquo;(&#34920;&#31034; DAS)&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26085;&#24535;&#25991;&#20214;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&#26085;&#24535;&#25991;&#20214;&#12290;</p>
<p>&#40664;&#35748;&#21517;&#31216;&#20026; <code>server.log</code>&#12290;&#20854;&#20182;&#36873;&#39033;&#21462;&#20915;&#20110;&#25152;&#36873;&#30446;&#26631;&#30340;&#26085;&#24535;&#35774;&#32622;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#22312;&ldquo;&#25628;&#32034;&#32467;&#26524;&rdquo;&#21306;&#22495;&#20013;&#65292;&#23450;&#21046;&#26085;&#24535;&#28040;&#24687;&#30340;&#26174;&#31034;&#12290;</p>
<p>&ldquo;&#25628;&#32034;&#32467;&#26524;&rdquo;&#21306;&#22495;&#23558;&#25353;&#29031;&ldquo;&#26085;&#24535;&#35774;&#32622;&rdquo;&#39029;&#21644;&ldquo;&#26085;&#24535;&#32423;&#21035;&rdquo;&#39029;&#20013;&#30340;&#35774;&#32622;&#65292;&#26174;&#31034;&#26368;&#36817;&#30340; 40 &#26465;&#26381;&#21153;&#22120;&#26085;&#24535;&#26465;&#30446;&#12290;</p>
<ul>
<li>
<p>&#35201;&#25353;&#19981;&#21516;&#26041;&#24335;&#23545;&#28040;&#24687;&#36827;&#34892;&#25490;&#24207;&#65292;&#35831;&#21333;&#20987;&#21015;&#20013;&#30340;&#31661;&#22836;&#12290;</p>
</li>
<li>
<p>&#35201;&#20197;&#26684;&#24335;&#21270;&#29256;&#26412;&#26597;&#30475;&#28040;&#24687;&#65292;&#35831;&#21333;&#20987;&#27492;&#28040;&#24687;&#30340; (&#35814;&#32454;&#20449;&#24687;) &#38142;&#25509;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#26085;&#24535;&#26465;&#30446;&#35814;&#32454;&#20449;&#24687;&rdquo;&#31383;&#21475;&#65292;&#20854;&#20013;&#21253;&#21547;&#27492;&#28040;&#24687;&#30340;&#26684;&#24335;&#21270;&#29256;&#26412;&#12290;</p>
</li>
<li>
<p>&#35201;&#26597;&#30475;&#26085;&#24535;&#25991;&#20214;&#20013;&#36739;&#26089;&#25110;&#36739;&#26032;&#30340;&#26465;&#30446;&#65292;&#35831;&#21333;&#20987;&#20301;&#20110;&#34920;&#39030;&#37096;&#30340;&ldquo;&#20043;&#21069;&#30340;&#35760;&#24405;&rdquo;&#21644;&ldquo;&#20043;&#21518;&#30340;&#35760;&#24405;&rdquo;&#12290;</p>
</li>
</ul>
</li>
</ol>
<a id="GHCOM231" name="GHCOM231"></a>
<h5>&#21478;&#35831;&#21442;&#38405;</h5>
<ul>
<li>
<p><a href="task-eelogging.html">&#37197;&#32622;&#24120;&#35268;&#26085;&#24535;&#35760;&#24405;&#35774;&#32622;</a></p>
</li>
<li>
<p><a href="task-eelogginglevels.html">&#37197;&#32622;&#26085;&#24535;&#32423;&#21035;</a></p>
</li>
<li>
<p><a href="task-logviewer.html">&#26597;&#30475; DAS &#30340;&#26085;&#24535;&#25991;&#20214;</a></p>
</li>
<li>
<p><a href="../../../cluster/en/help/task-view-logs-clustered-instance.html">&#26597;&#30475;&#38598;&#32676; GlassFish Server &#23454;&#20363;&#30340;&#26085;&#24535;&#25991;&#20214;</a></p>
</li>
<li>
<p><a href="../../../cluster/en/help/task-view-logs-standalone-instance.html">&#26597;&#30475;&#29420;&#31435; GlassFish Server &#23454;&#20363;&#30340;&#26085;&#24535;&#25991;&#20214;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
