<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-messagesecurityproviderconfignew" name="task-messagesecurityproviderconfignew"></a></p>

<h4><a id="sthref177" name="sthref177"></a>&#21019;&#24314;&#28040;&#24687;&#23433;&#20840;&#25552;&#20379;&#26041;&#37197;&#32622;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#35201;&#21019;&#24314;&#26032;&#30340;&#28040;&#24687;&#23433;&#20840;&#25552;&#20379;&#26041;&#37197;&#32622;&#65292;&#35831;&#25191;&#34892;&#20197;&#19979;&#27493;&#39588;&#65306;</p>
<a id="sthref178" name="sthref178"></a>
<h5>&#24320;&#22987;&#20043;&#21069;</h5>
<p>&#26080;&#27861;&#21019;&#24314;&#25110;&#21024;&#38500;&#40664;&#35748; <code>server-config</code> &#37197;&#32622;&#30340;&#28040;&#24687;&#23433;&#20840;&#25552;&#20379;&#26041;&#12290;&#21482;&#26377; SOAP &#21644; HttpServlet &#36825;&#20004;&#20010;&#28040;&#24687;&#23433;&#20840;&#25552;&#20379;&#26041;&#25903;&#25345;&#40664;&#35748;&#30340; <code>server-config</code>&#12290;&#22240;&#20026;&#40664;&#35748;&#24773;&#20917;&#19979;&#23433;&#35013; GlassFish Server &#26102;&#24050;&#32463;&#21019;&#24314;&#20102;&#36825;&#20004;&#20010;&#28040;&#24687;&#25552;&#20379;&#26041;&#65292;&#25152;&#20197;&#40664;&#35748; <code>server-config</code> &#30340;&ldquo;&#28040;&#24687;&#23433;&#20840;&#37197;&#32622;&rdquo;&#39029;&#19978;&#30340;&ldquo;&#26032;&#24314;&rdquo;&#25353;&#38062;&#26174;&#31034;&#20026;&#28784;&#33394;&#12290;</p>
<ol>
<li>
<p>&#22312;&#23548;&#33322;&#26641;&#20013;&#65292;&#23637;&#24320;&ldquo;&#37197;&#32622;&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#23637;&#24320;&ldquo;&#23433;&#20840;&#24615;&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#36873;&#25321;&ldquo;&#28040;&#24687;&#23433;&#20840;&rdquo;&#33410;&#28857;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#28040;&#24687;&#23433;&#20840;&#37197;&#32622;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#28040;&#24687;&#23433;&#20840;&#37197;&#32622;&rdquo;&#39029;&#19978;&#65292;&#21333;&#20987;&#35201;&#32534;&#36753;&#30340;&#37197;&#32622;&#30340;&#39564;&#35777;&#23618;&#21517;&#31216;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#21807;&#19968;&#37197;&#32622;&#30340;&#28040;&#24687;&#23433;&#20840;&#37197;&#32622;&#20026; SOAP&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#32534;&#36753;&#28040;&#24687;&#23433;&#20840;&#37197;&#32622;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#21333;&#20987;&ldquo;&#25552;&#20379;&#26041;&rdquo;&#36873;&#39033;&#21345;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#25552;&#20379;&#26041;&#37197;&#32622;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#25552;&#20379;&#26041;&#37197;&#32622;&rdquo;&#39029;&#19978;&#65292;&#21333;&#20987;&ldquo;&#26032;&#24314;&rdquo;&#12290;</p>
<p>&#23558;&#26174;&#31034;&ldquo;&#26032;&#24314;&#25552;&#20379;&#26041;&#37197;&#32622;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26032;&#24314;&#25552;&#20379;&#26041;&#37197;&#32622;&rdquo;&#39029;&#30340;&ldquo;&#25552;&#20379;&#26041; ID&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#25552;&#20379;&#26041;&#37197;&#32622;&#30340;&#21807;&#19968;&#21517;&#31216;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#40664;&#35748;&#25552;&#20379;&#26041;&rdquo;&#22797;&#36873;&#26694;&#65292;&#20197;&#23558;&#27492;&#25552;&#20379;&#26041;&#35774;&#32622;&#20026;&#40664;&#35748;&#25552;&#20379;&#26041;&#12290;</p>
<p>&#23558;&#20026;&#27809;&#26377;&#25351;&#23450;&#29305;&#23450;&#25552;&#20379;&#26041;&#30340;&#20219;&#19968;&#24212;&#29992;&#31243;&#24207;&#35843;&#29992;&#40664;&#35748;&#25552;&#20379;&#26041;&#12290;&#25552;&#20379;&#26041;&#26159;&#40664;&#35748;&#23458;&#25143;&#26426;&#25552;&#20379;&#26041;&#12289;&#40664;&#35748;&#26381;&#21153;&#22120;&#25552;&#20379;&#26041;&#36824;&#26159;&#20108;&#32773;&#30001;&ldquo;&#25552;&#20379;&#26041;&#31867;&#22411;&rdquo;&#20915;&#23450;&#12290;</p>
</li>
<li>
<p>&#20174;&ldquo;&#25552;&#20379;&#26041;&#31867;&#22411;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&#25552;&#20379;&#26041;&#31867;&#22411;&#12290;</p>
<p>&#21487;&#29992;&#36873;&#39033;&#20026;&#65306;</p>
<dl>
<dt><code>&#23458;&#25143;&#26426;</code></dt>
<dd>
<p>&#25351;&#23450;&#25552;&#20379;&#26041;&#20026;&#23458;&#25143;&#26426;&#39564;&#35777;&#25552;&#20379;&#26041;&#12290;</p>
</dd>
<dt><code>&#26381;&#21153;&#22120;</code></dt>
<dd>
<p>&#25351;&#23450;&#25552;&#20379;&#26041;&#20026;&#26381;&#21153;&#22120;&#39564;&#35777;&#25552;&#20379;&#26041;&#12290;</p>
</dd>
<dt><code>&#23458;&#25143;&#26426;-&#26381;&#21153;&#22120;</code></dt>
<dd>
<p>&#25351;&#23450;&#25552;&#20379;&#26041;&#26082;&#20026;&#23458;&#25143;&#26426;&#39564;&#35777;&#25552;&#20379;&#26041;&#20063;&#20026;&#26381;&#21153;&#22120;&#39564;&#35777;&#25552;&#20379;&#26041;&#12290;</p>
</dd>
</dl>
</li>
<li>
<p>&#22312;&ldquo;&#31867;&#21517;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#25552;&#20379;&#26041;&#30340; Java &#23454;&#29616;&#31867;&#30340;&#21517;&#31216;&#12290;</p>
<p>&#23458;&#25143;&#26426;&#39564;&#35777;&#25552;&#20379;&#26041;&#24517;&#39035;&#23454;&#29616; <code>com.sun.enterprise.security.jauth.ClientAuthModule</code> &#25509;&#21475;&#12290;&#26381;&#21153;&#22120;&#31471;&#25552;&#20379;&#26041;&#24517;&#39035;&#23454;&#29616; <code>com.sun.enterprise.security.jauth.ServerAuthModule</code> &#25509;&#21475;&#12290;&#23458;&#25143;&#26426;-&#26381;&#21153;&#22120;&#25552;&#20379;&#26041;&#24517;&#39035;&#23454;&#29616;&#36825;&#20004;&#20010;&#25509;&#21475;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#35831;&#27714;&#31574;&#30053;&rdquo;&#21306;&#22495;&#20013;&#65292;&#20174;&ldquo;&#39564;&#35777;&#28304;&rdquo;&#19979;&#25289;&#21015;&#34920;&#65292;&#36873;&#25321;&#35831;&#27714;&#31574;&#30053;&#25152;&#38656;&#39564;&#35777;&#30340;&#31867;&#22411;&#12290;</p>
<p>&#35831;&#27714;&#31574;&#30053;&#29992;&#20110;&#30830;&#23450;&#39564;&#35777;&#25552;&#20379;&#26041;&#25191;&#34892;&#30340;&#35831;&#27714;&#22788;&#29702;&#12290;&#35831;&#27714;&#31574;&#30053;&#23383;&#27573;&#26159;&#21487;&#36873;&#30340;&#65292;&#20294;&#22914;&#26524;&#19981;&#25351;&#23450;&#36825;&#20123;&#23383;&#27573;&#65292;&#39564;&#35777;&#25552;&#20379;&#26041;&#23558;&#19981;&#20250;&#39564;&#35777;&#35831;&#27714;&#28040;&#24687;&#12290;</p>
<p>&#36873;&#25321; <code>sender</code> &#20197;&#25351;&#23450;&#35831;&#27714;&#28040;&#24687;&#30340;&#28040;&#24687;&#23618;&#21457;&#36865;&#32773;&#39564;&#35777; (&#20363;&#22914;&#65292;&#29992;&#25143;&#21517;&#21644;&#21475;&#20196;)&#12290;&#36873;&#25321; <code>content</code> &#26469;&#25351;&#23450;&#35831;&#27714;&#28040;&#24687;&#30340;&#20869;&#23481;&#39564;&#35777; (&#20363;&#22914;&#65292;&#25968;&#23383;&#31614;&#21517;)&#12290;&#23558;&#27492;&#23383;&#27573;&#30041;&#31354;&#65292;&#19981;&#39564;&#35777;&#35831;&#27714;&#28304;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#19981;&#36873;&#25321;&#20219;&#20309;&#39564;&#35777;&#31867;&#22411;&#12290;</p>
<p>&#26377;&#20851;&#30001; SOAP &#28040;&#24687;&#23433;&#20840;&#25552;&#20379;&#26041;&#25191;&#34892;&#30340;&#25805;&#20316;&#35828;&#26126;&#65292;&#35831;&#21442;&#38405;<a href="ref-configreq-respolicy.html">&#35831;&#27714;&#21644;&#21709;&#24212;&#31574;&#30053;&#37197;&#32622;</a>&#12290;</p>
</li>
<li>
<p>&#20174;&ldquo;&#39564;&#35777;&#25910;&#20214;&#20154;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&#22312;&#35831;&#27714;&#31574;&#30053;&#30340;&#20869;&#23481;&#39564;&#35777;&#20043;&#21069;&#36824;&#26159;&#20043;&#21518;&#36827;&#34892;&#25910;&#20214;&#20154;&#39564;&#35777;&#12290;</p>
<p>&#36873;&#25321; <code>before-content</code> &#25110; <code>after-content</code> &#20197;&#35201;&#27714;&#23545;&#20854;&#21457;&#36865;&#32773;&#36827;&#34892;&#35831;&#27714;&#28040;&#24687;&#30340;&#25910;&#20214;&#20154;&#30340;&#28040;&#24687;&#23618;&#39564;&#35777; (&#36890;&#36807; XML &#21152;&#23494;)&#12290;&#22914;&#26524;&#26410;&#25351;&#23450;&#20540;&#65292;&#21017;&#40664;&#35748;&#20540;&#20026; <code>after-content</code>&#12290;&#36825;&#20123;&#31574;&#30053;&#26159;&#25353;&#28040;&#24687;&#21457;&#36865;&#32773;&#30340;&#39034;&#24207;&#34920;&#36798;&#30340;&#65292;&#22240;&#27492; <code>after-content</code> &#34920;&#31034;&#28040;&#24687;&#25910;&#20214;&#20154;&#23558;&#22312;&#39564;&#35777;&#31614;&#21517;&#20043;&#21069;&#23545;&#28040;&#24687;&#36827;&#34892;&#35299;&#23494;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#21709;&#24212;&#31574;&#30053;&rdquo;&#21306;&#22495;&#20013;&#65292;&#20174;&ldquo;&#39564;&#35777;&#28304;&rdquo;&#19979;&#25289;&#21015;&#34920;&#65292;&#36873;&#25321;&#21709;&#24212;&#31574;&#30053;&#25152;&#38656;&#39564;&#35777;&#30340;&#31867;&#22411;&#12290;</p>
<p>&#21709;&#24212;&#31574;&#30053;&#29992;&#20110;&#30830;&#23450;&#39564;&#35777;&#25552;&#20379;&#26041;&#25191;&#34892;&#30340;&#21709;&#24212;&#22788;&#29702;&#12290;&#21709;&#24212;&#31574;&#30053;&#23383;&#27573;&#26159;&#21487;&#36873;&#30340;&#65292;&#20294;&#22914;&#26524;&#19981;&#25351;&#23450;&#36825;&#20123;&#23383;&#27573;&#65292;&#21017;&#19981;&#39564;&#35777;&#21709;&#24212;&#28040;&#24687;&#12290;</p>
<p>&#36873;&#25321; <code>sender</code> &#20197;&#25351;&#23450;&#21709;&#24212;&#28040;&#24687;&#30340;&#28040;&#24687;&#23618;&#21457;&#36865;&#32773;&#39564;&#35777; (&#20363;&#22914;&#65292;&#29992;&#25143;&#21517;&#21644;&#21475;&#20196;)&#12290;&#36873;&#25321; <code>content</code> &#26469;&#25351;&#23450;&#21709;&#24212;&#28040;&#24687;&#30340;&#20869;&#23481;&#39564;&#35777; (&#20363;&#22914;&#65292;&#25968;&#23383;&#31614;&#21517;)&#12290;&#23558;&#27492;&#23383;&#27573;&#30041;&#31354;&#65292;&#19981;&#39564;&#35777;&#21709;&#24212;&#28304;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#19981;&#36873;&#25321;&#20219;&#20309;&#39564;&#35777;&#31867;&#22411;&#12290;</p>
<p>&#26377;&#20851;&#30001; SOAP &#28040;&#24687;&#23433;&#20840;&#25552;&#20379;&#26041;&#25191;&#34892;&#30340;&#25805;&#20316;&#35828;&#26126;&#65292;&#35831;&#21442;&#38405;<a href="ref-configreq-respolicy.html">&#35831;&#27714;&#21644;&#21709;&#24212;&#31574;&#30053;&#37197;&#32622;</a>&#12290;</p>
</li>
<li>
<p>&#20174;&ldquo;&#39564;&#35777;&#25910;&#20214;&#20154;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&#22312;&#21709;&#24212;&#31574;&#30053;&#30340;&#20869;&#23481;&#39564;&#35777;&#20043;&#21069;&#36824;&#26159;&#20043;&#21518;&#36827;&#34892;&#25910;&#20214;&#20154;&#39564;&#35777;&#12290;</p>
<p>&#36873;&#25321; <code>before-content</code> &#25110; <code>after-content</code> &#20197;&#35201;&#27714;&#23545;&#20854;&#21457;&#36865;&#32773;&#36827;&#34892;&#21709;&#24212;&#28040;&#24687;&#30340;&#25910;&#20214;&#20154;&#30340;&#28040;&#24687;&#23618;&#39564;&#35777; (&#36890;&#36807; XML &#21152;&#23494;)&#12290;&#22914;&#26524;&#26410;&#25351;&#23450;&#20540;&#65292;&#21017;&#40664;&#35748;&#20540;&#20026; <code>after-content</code>&#12290;&#36825;&#20123;&#31574;&#30053;&#26159;&#25353;&#28040;&#24687;&#21457;&#36865;&#32773;&#30340;&#39034;&#24207;&#34920;&#36798;&#30340;&#65292;&#22240;&#27492; <code>after-content</code> &#34920;&#31034;&#28040;&#24687;&#25910;&#20214;&#20154;&#23558;&#22312;&#39564;&#35777;&#31614;&#21517;&#20043;&#21069;&#23545;&#28040;&#24687;&#36827;&#34892;&#35299;&#23494;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#20854;&#20182;&#23646;&#24615;&rdquo;&#37096;&#20998;&#20013;&#65292;&#25351;&#23450;&#20854;&#20182;&#23646;&#24615;&#12290;</p>
<p>&#35201;&#28155;&#21152;&#23646;&#24615;&#65292;&#35831;&#21333;&#20987;&ldquo;&#28155;&#21152;&#23646;&#24615;&rdquo;&#25353;&#38062;&#12290;&#22312;&#26174;&#31034;&#30340;&#31354;&#30333;&#34892;&#20013;&#65292;&#22312;&ldquo;&#21517;&#31216;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#23646;&#24615;&#21517;&#31216;&#65292;&#22312;&ldquo;&#20540;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#23646;&#24615;&#20540;&#12290;</p>
<p>&#26377;&#20851;&#21487;&#29992;&#20110;&#25552;&#20379;&#26041;&#37197;&#32622;&#30340;&#20854;&#20182;&#23646;&#24615;&#30340;&#35828;&#26126;&#65292;&#35831;&#21442;&#38405;<a href="ref-messagesecurityproviderconfigprops.html">&#29305;&#23450;&#20110;&#28040;&#24687;&#23433;&#20840;&#25552;&#20379;&#26041;&#37197;&#32622;&#30340;&#23646;&#24615;</a>&#12290;</p>
</li>
<li>
<p>&#21333;&#20987;&ldquo;&#30830;&#23450;&rdquo;&#12290;</p>
</li>
</ol>
<a id="sthref179" name="sthref179"></a>
<h5>&#21478;&#35831;&#21442;&#38405;</h5>
<ul>
<li>
<p><a href="task-configmsgsecproviders.html">&#23558; GlassFish Server &#24037;&#20855;&#37197;&#32622;&#20026;&#20379;&#28040;&#24687;&#23433;&#20840;&#25552;&#20379;&#26041;&#20351;&#29992;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfignew.html">&#21019;&#24314;&#28040;&#24687;&#23433;&#20840;&#37197;&#32622;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigedit.html">&#32534;&#36753;&#28040;&#24687;&#23433;&#20840;&#37197;&#32622;</a></p>
</li>
<li>
<p><a href="task-messagesecurityconfigdelete.html">&#21024;&#38500;&#28040;&#24687;&#23433;&#20840;&#37197;&#32622;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigedit.html">&#32534;&#36753;&#28040;&#24687;&#23433;&#20840;&#25552;&#20379;&#26041;&#37197;&#32622;</a></p>
</li>
<li>
<p><a href="task-messagesecurityproviderconfigdelete.html">&#21024;&#38500;&#28040;&#24687;&#23433;&#20840;&#25552;&#20379;&#26041;&#37197;&#32622;</a></p>
</li>
<li>
<p><a href="task-enablemesec4appclients.html">&#20026;&#24212;&#29992;&#31243;&#24207;&#23458;&#25143;&#26426;&#21551;&#29992;&#28040;&#24687;&#23433;&#20840;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
