<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-batchjobsconfiguration" name="ref-batchjobsconfiguration"></a></p>

<h4>&#25209;&#27425;&#22519;&#34892;&#38542;&#27573;&#32068;&#24907;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>GlassFish Server &#25552;&#20379;&#25209;&#27425;&#24037;&#20316;&#25490;&#31243;&#33287;&#22519;&#34892;&#30340;&#25209;&#27425;&#22519;&#34892;&#38542;&#27573;&#12290;&#25209;&#27425;&#24037;&#20316;&#36890;&#24120;&#26159;&#38263;&#26178;&#38291;&#22519;&#34892;&#65292;&#19988;&#21253;&#21547;&#19968;&#31995;&#21015;&#27493;&#39519;&#30340;&#22823;&#37327;&#22519;&#34892;&#23566;&#21521;&#24037;&#20316;&#12290;&#25209;&#27425;&#25033;&#29992;&#31243;&#24335;&#26371;&#25552;&#20132;&#24037;&#20316;&#32102;&#25209;&#27425;&#22519;&#34892;&#38542;&#27573;&#65292;&#20006;&#25552;&#20379;&#27493;&#39519;&#22519;&#34892;&#26041;&#24335;&#33287;&#27493;&#39519;&#22519;&#34892;&#26178;&#38291;&#30340;&#25351;&#31034;&#12290;&#25209;&#27425;&#22519;&#34892;&#38542;&#27573;&#26371;&#34389;&#29702;&#27493;&#39519;&#65292;&#20006;&#23559;&#33287;&#24037;&#20316;&#26377;&#38364;&#30340;&#36039;&#35338;&#20786;&#23384;&#22312;&#24037;&#20316;&#20786;&#23384;&#21312;&#22495;&#20013;&#12290;&#22312; GlassFish Server &#20013;&#65292;&#24037;&#20316;&#20786;&#23384;&#21312;&#22495;&#23601;&#26159;&#36039;&#26009;&#24235;&#12290;</p>
<p>&#24744;&#21487;&#20197;&#20351;&#29992;&#12300;&#25209;&#27425;&#22519;&#34892;&#38542;&#27573;&#32068;&#24907;&#12301;&#38913;&#38754;&#27298;&#35222;&#21450;&#35722;&#26356;&#25209;&#27425;&#22519;&#34892;&#38542;&#27573;&#30340;&#32068;&#24907;&#12290;&#25209;&#27425;&#22519;&#34892;&#38542;&#27573;&#26371;&#20351;&#29992;&#21463;&#31649;&#29702;&#22519;&#34892;&#31243;&#24335;&#26381;&#21209;&#33287;&#36039;&#26009;&#20358;&#28304;&#20358;&#22519;&#34892;&#25209;&#27425;&#24037;&#20316;&#12290;&#21463;&#31649;&#29702;&#22519;&#34892;&#31243;&#24335;&#26381;&#21209;&#26371;&#25552;&#20379;&#32363;&#32218;&#32102;&#24037;&#20316;&#65292;&#36039;&#26009;&#20358;&#28304;&#21063;&#26371;&#20786;&#23384;&#24037;&#20316;&#36039;&#35338;&#12290;&#25209;&#27425;&#22519;&#34892;&#38542;&#27573;&#32068;&#24907;&#36039;&#26009;&#26371;&#20786;&#23384;&#22312; <code>domain.xml</code> &#20839;&#30340; <code>config</code> &#20803;&#32032;&#20013;&#12290;</p>
<p>&#12300;&#25209;&#27425;&#22519;&#34892;&#38542;&#27573;&#32068;&#24907;&#12301;&#38913;&#38754;&#21253;&#21547;&#20197;&#19979;&#36039;&#35338;&#12290;</p>
<dl>
<dt>&#22519;&#34892;&#34389;&#29702;&#21517;&#31281;</dt>
<dt>&#21474;&#38598;&#21517;&#31281;</dt>
<dd>
<p>&#35201;&#22871;&#29992;&#32068;&#24907;&#20043; GlassFish &#21474;&#38598;&#25110;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#30340;&#21517;&#31281;&#12290;&#27492;&#28858;&#21807;&#35712;&#27396;&#20301;&#12290;</p>
</dd>
<dt>&#22519;&#34892;&#31243;&#24335;&#26381;&#21209;&#26597;&#35426;&#21517;&#31281;</dt>
<dd>
<p>&#25552;&#20379;&#32363;&#32218;&#32102;&#25209;&#27425;&#24037;&#20316;&#30340;&#21463;&#31649;&#29702;&#22519;&#34892;&#31243;&#24335;&#26381;&#21209; JNDI &#26597;&#35426;&#21517;&#31281;&#12290;&#38928;&#35373;&#21463;&#31649;&#29702;&#22519;&#34892;&#31243;&#24335;&#26381;&#21209;&#28858; <code>concurrent/__defaultManagedExecutorService</code>&#12290;</p>
<p>&#21463;&#31649;&#29702;&#22519;&#34892;&#31243;&#24335;&#26381;&#21209;&#21487;&#20197;&#22312;&#25209;&#27425;&#24037;&#20316;&#24050;&#36865;&#20986;&#33267;&#25209;&#27425;&#22519;&#34892;&#38542;&#27573;&#20043;&#24460;&#35722;&#26356;&#65292;&#19988;&#19981;&#26371;&#24433;&#38911;&#24037;&#20316;&#30340;&#22519;&#34892;&#12290;</p>
</dd>
<dt>&#36039;&#26009;&#20358;&#28304;&#26597;&#35426;&#21517;&#31281;</dt>
<dd>
<p>&#20786;&#23384;&#30446;&#21069;&#33287;&#36942;&#21435;&#25209;&#27425;&#24037;&#20316;&#30456;&#38364;&#36039;&#35338;&#30340;&#36039;&#26009;&#20358;&#28304; JNDI &#26597;&#35426;&#21517;&#31281;&#12290;&#38928;&#35373;&#30340;&#36039;&#26009;&#20358;&#28304;&#28858; <code>jdbc/__TimerPool</code>&#12290;</p>
<p>&#30070;&#31532;&#19968;&#20491;&#25209;&#27425;&#24037;&#20316;&#24050;&#36865;&#20986;&#33267;&#22519;&#34892;&#30340;&#25209;&#27425;&#22519;&#34892;&#38542;&#27573;&#20043;&#24460;&#65292;&#35531;&#21247;&#35722;&#26356;&#36039;&#26009;&#20358;&#28304;&#12290;&#22914;&#26524;&#24517;&#38920;&#35722;&#26356;&#36039;&#26009;&#20358;&#28304;&#65292;&#35531;&#20572;&#27490;&#20006;&#37325;&#26032;&#21855;&#21205;&#32178;&#22495;&#65292;&#28982;&#24460;&#26044;&#21855;&#21205;&#25110;&#37325;&#26032;&#21855;&#21205;&#20219;&#20309;&#24037;&#20316;&#20043;&#21069;&#20808;&#36914;&#34892;&#35722;&#26356;&#12290;&#20294;&#26159;&#65292;&#19968;&#26086;&#35722;&#26356;&#20102;&#36039;&#26009;&#20358;&#28304;&#65292;&#23601;&#28961;&#27861;&#32380;&#32396;&#23384;&#21462;&#20786;&#23384;&#26044;&#20808;&#21069;&#36039;&#26009;&#20358;&#28304;&#20013;&#30340;&#36039;&#35338;&#12290;</p>
</dd>
</dl>
<a id="sthref31" name="sthref31"></a>
<h5>&#30456;&#38364;&#20316;&#26989;</h5>
<ul>
<li>
<p><a href="tasks-topic-group004.html#CEGEEGBB">&#32068;&#24907;&#25209;&#27425;&#22519;&#34892;&#38542;&#27573;</a></p>
</li>
<li>
<p><a href="tasks-topic-group002.html#CEGEIGCJ">&#27298;&#35222;&#25209;&#27425;&#24037;&#20316;&#22519;&#34892;</a></p>
</li>
</ul>
<a id="sthref32" name="sthref32"></a>
<h5>&#30456;&#38364;&#30340; asadmin &#21629;&#20196;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM897"><code>set-batch-runtime-configuration</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM863"><code>list-batch-runtime-configuration</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM861"><code>list-batch-jobs</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM884"><code>list-batch-job-executions</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM895"><code>list-batch-job-steps</code>(1)</a></p>
</li>
</ul>




<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
