<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-javamailsessionsedit" name="task-javamailsessionsedit"></a></p>

<h4><a id="sthref9" name="sthref9"></a>&#32232;&#36655; JavaMail &#38542;&#27573;&#20316;&#26989;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#28687;&#35261;&#27193;&#29376;&#32080;&#27083;&#20013;&#65292;&#23637;&#38283;&#12300;&#36039;&#28304;&#12301;&#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#36039;&#28304;&#12301;&#31680;&#40670;&#19979;&#65292;&#36984;&#21462;&#12300;JavaMail &#38542;&#27573;&#20316;&#26989;&#12301;&#12290;</p>
<p>&#12300;JavaMail &#38542;&#27573;&#20316;&#26989;&#12301;&#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;JavaMail &#38542;&#27573;&#20316;&#26989;&#12301;&#38913;&#38754;&#19978;&#65292;&#25353;&#19968;&#19979;&#35201;&#32232;&#36655;&#30340;&#38542;&#27573;&#20316;&#26989;&#21517;&#31281;&#12290;</p>
<p>&#12300;&#32232;&#36655; JavaMail &#38542;&#27573;&#20316;&#26989;&#12301;&#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#37109;&#20214;&#20027;&#27231;&#12301;&#27396;&#20301;&#20013;&#65292;&#25351;&#23450;&#38928;&#35373;&#37109;&#20214;&#20282;&#26381;&#22120;&#30340;&#20027;&#27231;&#21517;&#31281;&#12290;</p>
<p>&#22914;&#26524;&#26410;&#25552;&#20379;&#21332;&#23450;&#29305;&#23450;&#30340;&#20027;&#27231;&#29305;&#24615;&#65292;Store &#21644; Transport &#29289;&#20214;&#30340;&#36899;&#32218;&#26041;&#27861;&#23559;&#20351;&#29992;&#35442;&#20540;&#12290;&#21517;&#31281;&#24517;&#38920;&#21487;&#20197;&#35299;&#26512;&#28858;&#23526;&#38555;&#30340;&#20027;&#27231;&#21517;&#31281;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#38928;&#35373;&#20351;&#29992;&#32773;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#36899;&#32218;&#33267;&#37109;&#20214;&#20282;&#26381;&#22120;&#26178;&#35201;&#25552;&#20379;&#30340;&#21478;&#19968;&#20491;&#20351;&#29992;&#32773;&#21517;&#31281;&#12290;</p>
<p>&#22914;&#26524;&#26410;&#25552;&#20379;&#21332;&#23450;&#29305;&#23450;&#30340;&#20351;&#29992;&#32773;&#21517;&#31281;&#29305;&#24615;&#65292;Store &#21644; Transport &#29289;&#20214;&#30340;&#36899;&#32218;&#26041;&#27861;&#20351;&#29992;&#35442;&#20540;&#12290;&#20351;&#29992;&#32773;&#21517;&#31281;&#20677;&#33021;&#21253;&#21547;&#23383;&#27597;&#25976;&#23383;&#12289;&#24213;&#32218;&#12289;&#30772;&#25240;&#34399;&#25110;&#40670;&#23383;&#20803;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#38928;&#35373;&#23492;&#20214;&#32773;&#22320;&#22336;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#38928;&#35373;&#20351;&#29992;&#32773;&#30340;&#38651;&#23376;&#37109;&#20214;&#22320;&#22336;&#12290;</p>
<p>&#26684;&#24335;&#28858; <i>&#20351;&#29992;&#32773;&#21517;&#31281;</i><code>@</code><i>&#20027;&#27231;</i>.<i>&#32178;&#22495;</i>&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#24314;&#32622;&#38918;&#24207;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#25976;&#23383;&#20358;&#25351;&#23450; JavaMail &#38542;&#27573;&#20316;&#26989;&#36039;&#28304;&#30340;&#24314;&#32622;&#38918;&#24207;&#12290;</p>
<p>&#31995;&#32113;&#26371;&#22312;&#20282;&#26381;&#22120;&#21855;&#21205;&#26178;&#20808;&#36617;&#20837;&#25976;&#23383;&#36611;&#23567;&#30340;&#36039;&#28304;&#12290;&#38928;&#35373;&#20540;&#28858; 100&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#25551;&#36848;&#12301;&#27396;&#20301;&#20013;&#65292;&#35722;&#26356;&#37109;&#20214;&#38542;&#27573;&#20316;&#26989;&#30340;&#25551;&#36848;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#21855;&#29992;&#29376;&#24907;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#20197;&#21855;&#29992;&#37109;&#20214;&#38542;&#27573;&#20316;&#26989;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858;&#12300;&#21855;&#29992;&#12301;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#20786;&#23384;&#21332;&#23450;&#12301;&#27396;&#20301;&#20013;&#65292;&#23450;&#32681;&#35201;&#20351;&#29992;&#30340;&#20786;&#23384;&#29289;&#20214;&#36890;&#35338;&#26041;&#27861;&#12290;</p>
<p>&#20381;&#38928;&#35373;&#65292;&#20786;&#23384;&#21332;&#23450;&#26159; <code>imap</code>&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#20786;&#23384;&#21332;&#23450;&#39006;&#21029;&#12301;&#27396;&#20301;&#20013;&#65292;&#25351;&#23450;&#21487;&#23526;&#34892;&#24819;&#35201;&#20043;&#20786;&#23384;&#21332;&#23450;&#30340;&#20786;&#23384;&#36890;&#35338;&#26041;&#27861;&#39006;&#21029;&#12290;</p>
<p>&#20381;&#38928;&#35373;&#65292;&#20786;&#23384;&#21332;&#23450;&#39006;&#21029;&#26159; <code>com.sun.mail.imap.IMAPStore</code>&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#20659;&#36664;&#21332;&#23450;&#12301;&#27396;&#20301;&#20013;&#65292;&#25351;&#23450;&#20659;&#36664;&#36890;&#35338;&#26041;&#27861;&#12290;</p>
<p>&#20381;&#38928;&#35373;&#65292;&#20659;&#36664;&#21332;&#23450;&#26159; <code>smtp</code>&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#20659;&#36664;&#21332;&#23450;&#39006;&#21029;&#12301;&#27396;&#20301;&#20013;&#65292;&#25351;&#23450;&#20659;&#36664;&#39006;&#21029;&#30340;&#36890;&#35338;&#26041;&#27861;&#12290;</p>
<p>&#20381;&#38928;&#35373;&#65292;&#20659;&#36664;&#21332;&#23450;&#39006;&#21029;&#26159; <code>com.sun.mail.smtp.SMTPTransport</code> &#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#38500;&#37679;&#12301;&#26680;&#21462;&#26041;&#22602;&#21487;&#28858;&#27492;&#37109;&#20214;&#38542;&#27573;&#20316;&#26989;&#21855;&#29992;&#38989;&#22806;&#30340;&#38500;&#37679;&#36664;&#20986;&#21151;&#33021;&#65292;&#21253;&#25324;&#21332;&#23450;&#36861;&#36452;&#12290;</p>
<p>&#22914;&#26524;&#23559; JavaMail &#26085;&#35468;&#23652;&#32026;&#35373;&#28858;<code>&#35443;&#32048;</code> &#25110;&#26356;&#35443;&#32048;&#65292;&#21063;&#31995;&#32113;&#26371;&#29986;&#29983;&#38500;&#37679;&#36664;&#20986;&#65292;&#20006;&#19988;&#35442;&#36664;&#20986;&#26371;&#21253;&#21547;&#22312;&#31995;&#32113;&#26085;&#35468;&#27284;&#20013;&#12290;&#35531;&#21443;&#38321; <a href="../../../common/en/help/task-eelogginglevels.html">To Configure Log Levels</a>&#65292;&#20197;&#21462;&#24471;&#26377;&#38364;&#35373;&#23450;&#26085;&#35468;&#23652;&#32026;&#30340;&#36039;&#35338;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#20854;&#20182;&#29305;&#24615;&#12301;&#34920;&#20013;&#65292;&#25351;&#23450;&#25033;&#29992;&#31243;&#24335;&#25152;&#38656;&#30340;&#20854;&#20182;&#29305;&#24615;&#65292;&#20363;&#22914;&#21332;&#23450;&#29305;&#23450;&#30340;&#20027;&#27231;&#25110;&#20351;&#29992;&#32773;&#21517;&#31281;&#29305;&#24615;&#12290;</p>
<p>&#22914;&#38656;&#21487;&#29992;&#29305;&#24615;&#30340;&#28165;&#21934;&#65292;&#35531;&#21443;&#38321; JavaMail API &#25991;&#20214; (<code><a href="http://java.sun.com/products/javamail/javadocs/index.html">http://java.sun.com/products/javamail/javadocs/index.html</a></code>)&#12290;&#20854;&#20182;&#29305;&#24615;&#24517;&#38920;&#20197; <code>mail-</code> &#38283;&#38957;&#65292;&#19988;&#24517;&#38920;&#20351;&#29992;&#36899;&#23383;&#31526; (&#32780;&#38750;&#40670;&#23383;&#20803;) &#20570;&#28858;&#20998;&#38548;&#31526;&#12290;&#20363;&#22914; <code>mail-debug</code> &#26159;&#27491;&#30906;&#30340;&#65292;&#32780; <code>mail.debug</code> &#21063;&#19981;&#27491;&#30906;&#12290;GlassFish Server &#24460;&#31471;&#26371;&#23559;&#36899;&#23383;&#31526;&#36681;&#25563;&#28858; JavaMail API &#38928;&#26399;&#30340;&#40670;&#23383;&#20803;&#12290;</p>
<ul>
<li>
<p>&#33509;&#35201;&#22686;&#21152;&#29305;&#24615;&#65292;&#35531;&#25353;&#19968;&#19979;&#12300;&#22686;&#21152;&#29305;&#24615;&#12301;&#25353;&#37397;&#12290;&#22312;&#20986;&#29694;&#30340;&#31354;&#30333;&#21015;&#20013;&#65292;&#26044;&#12300;&#21517;&#31281;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#21517;&#31281;&#65292;&#28982;&#24460;&#22312;&#12300;&#20540;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#20540;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#20462;&#25913;&#29305;&#24615;&#65292;&#35531;&#32232;&#36655;&#29305;&#24615;&#30340;&#12300;&#20540;&#12301;&#27396;&#20301;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#21034;&#38500;&#29305;&#24615;&#65292;&#35531;&#36984;&#21462;&#24744;&#35201;&#21034;&#38500;&#20043;&#29305;&#24615;&#12300;&#21517;&#31281;&#12301;&#27396;&#20301;&#24038;&#20596;&#30340;&#26680;&#21462;&#26041;&#22602;&#65292;&#28982;&#24460;&#25353;&#19968;&#19979;&#12300;&#21034;&#38500;&#29305;&#24615;&#12301;&#25353;&#37397;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#25353;&#19968;&#19979;&#12300;&#20786;&#23384;&#12301;&#12290;</p>

<hr>
<p><b>&#25552;&#31034;:</b></p>
&#33509;&#35201;&#22238;&#21040;&#38928;&#35373;&#35373;&#23450;&#65292;&#35531;&#25353;&#19968;&#19979;&#12300;&#36617;&#20837;&#38928;&#35373;&#20540;&#12301;&#25353;&#37397;&#65292;&#28982;&#24460;&#25353;&#19968;&#19979;&#12300;&#20786;&#23384;&#12301;&#12290;<br />
<hr>

</li>
</ol>
<a id="GHJML104" name="GHJML104"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-javamailsessioncreate.html">&#24314;&#31435; JavaMail &#38542;&#27573;&#20316;&#26989;</a></p>
</li>
<li>
<p><a href="task-javamailsessionsdelete.html">&#21034;&#38500; JavaMail &#38542;&#27573;&#20316;&#26989;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
