<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-threadpools" name="ref-threadpools"></a></p>

<h4><a id="sthref169" name="sthref169"></a><a id="sthref170" name="sthref170"></a>Pools de Thread</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Pool de Threads para configur&aacute;-los.</p>
<p>Use pools de threads para limitar um servi&ccedil;o a uma quantidade espec&iacute;fica de threads concorrentes.</p>
<p>Na primeira instala&ccedil;&atilde;o do GlassFish Server, existem dois pool de threads por default. O pool de threads denominado <code>http-thread-pool</code> est&aacute; configurado para uso por listeners de rede, enquanto <code>thread-pool-1</code> est&aacute; configurado para uso por ORB para solicita&ccedil;&otilde;es de RMI/IIOP. Pode ser necess&aacute;rio criar um pool de threads com defini&ccedil;&otilde;es diferentes para uso por determinados tipos de aplica&ccedil;&otilde;es e para determinados sistemas de hardware, ou para ajustar os pools de threads default &agrave;s suas necessidades.</p>
<p>A Java Virtual Machine (JVM) pode suportar muitos threads simult&acirc;neos de execu&ccedil;&atilde;o. Para ajudar no desempenho, o GlassFish Server mant&eacute;m um ou mais pool de threads. &Eacute; poss&iacute;vel designar pools de threads espec&iacute;ficos a servi&ccedil;os espec&iacute;ficos.</p>
<p>Um pool de threads pode atender v&aacute;rios servi&ccedil;os. Os threads de solicita&ccedil;&atilde;o processam solicita&ccedil;&otilde;es de usu&aacute;rios. Quando o servidor recebe uma solicita&ccedil;&atilde;o, ele a designa a um thread livre do pool de threads. O thread executa a solicita&ccedil;&atilde;o do cliente e retorna os resultados. Por exemplo, se a solicita&ccedil;&atilde;o precisar usar um recurso do sistema que est&aacute; ocupado no momento, o thread esperar&aacute; at&eacute; que o recurso fique dispon&iacute;vel para ent&atilde;o permitir que a solicita&ccedil;&atilde;o use o recurso.</p>
<p>Especifique um n&uacute;mero m&iacute;nimo e m&aacute;ximo de threads a serem reservados para solicita&ccedil;&otilde;es. O pool de threads &eacute; dinamicamente ajustado entre esses dois valores. O tamanho m&iacute;nimo do pool de threads especificado sinaliza o servidor para reservar pelo menos essa quantidade de threads para solicita&ccedil;&otilde;es. O n&uacute;mero &eacute; aumentado at&eacute; o tamanho m&aacute;ximo especificado para o pool de threads.</p>
<p>O aumento do n&uacute;mero de threads dispon&iacute;veis para um processo permite que o processo responda mais solicita&ccedil;&otilde;es simultaneamente.</p>
<p>Para cada pool de threads, as informa&ccedil;&otilde;es a seguir s&atilde;o fornecidas.</p>
<dl>
<dt>ID do Pool de Threads</dt>
<dd>
<p>O nome do pool de threads.</p>
</dd>
<dt>Tamanho M&aacute;ximo do Pool de Threads</dt>
<dd>
<p>O n&uacute;mero m&aacute;ximo de threads no pool de threads.</p>
</dd>
<dt>Tamanho M&iacute;nimo do Pool de Threads</dt>
<dd>
<p>O n&uacute;mero m&iacute;nimo de threads no pool de threads. Esses pools s&atilde;o criados quando o pool de threads &eacute; instanciado.</p>
</dd>
<dt>Tamanho M&aacute;ximo da Fila</dt>
<dd>
<p>O n&uacute;mero m&aacute;ximo de mensagens que podem ser colocadas na fila at&eacute; que os threads estejam dispon&iacute;veis para process&aacute;-las.</p>
</dd>
<dt>Time-out para Ociosidade do Thread</dt>
<dd>
<p>O per&iacute;odo de tempo em segundos ap&oacute;s o qual os threads inativos s&atilde;o removidos do pool.</p>
</dd>
</dl>
<p>A tabela Pool de Threads tamb&eacute;m cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Novo</dt>
<dd>
<p>Bot&atilde;o utilizado para criar um novo pool de threads.</p>
</dd>
<dt>Deletar</dt>
<dd>
<p>Bot&atilde;o utilizado para deletar um ou mais pool de threads selecionados.</p>
</dd>
</dl>
<a id="sthref171" name="sthref171"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-threadpoolnew.html">Para Criar um Pool de Threads</a></p>
</li>
<li>
<p><a href="task-threadpooledit.html">Para Editar um Pool de Threads</a></p>
</li>
<li>
<p><a href="task-threadpooldelete.html">Para Deletar um Pool de Threads</a></p>
</li>
</ul>
<a id="sthref172" name="sthref172"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00060"><code>create-threadpool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00204"><code>list-threadpools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00111"><code>delete-threadpool</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
