<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-httplistenernew" name="ref-httplistenernew"></a></p>

<h4><a id="sthref113" name="sthref113"></a>Novo Listener HTTP</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Novo Listener HTTP para criar um novo listener HTTP.</p>
<p>Ao criar um listener HTTP, a guia SSL &eacute; disponibilizada para voc&ecirc; tamb&eacute;m editar.</p>
<p>A p&aacute;gina Novo Listener HTTP cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Nome</dt>
<dd>
<p>Nome de um listener exclusivo. O nome de um listener HTTP n&atilde;o pode come&ccedil;ar com um n&uacute;mero.</p>
</dd>
<dt>Porta</dt>
<dd>
<p>O n&uacute;mero da porta na qual o listener far&aacute; listening. Os valores v&aacute;lidos s&atilde;o 1 a 65.535. Em sistemas UNIX, criar soquetes que fazem listening nas portas 1 - 1024 exige privil&eacute;gios de superusu&aacute;rio.</p>
</dd>
<dt>Status</dt>
<dd>
<p>O status do listener HTTP. O listener pode ser ativado ou desativado. Por default, a op&ccedil;&atilde;o est&aacute; ativada. Se o listener estiver desativado, qualquer tentativa de conectar ao listener resulta em uma exce&ccedil;&atilde;o de soquete (<code>java.net.ConnectException</code>).</p>
<p>Nas vers&otilde;es do GlassFish Server anteriores a 9.1, um listener cujo atributo ativado estava definido como falso retornava um c&oacute;digo de resposta 404, para quaisquer solicita&ccedil;&otilde;es enviadas ao mesmo. Para obter esse comportamento na vers&atilde;o atual do GlassFish Server, defina o status do listener como ativado e cada estado de servidor virtual associado como OFF. Um servidor virtual lista suas listeners associadas na sua lista drop-down Listeners de Rede.</p>
</dd>
<dt>Seguran&ccedil;a</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o estiver selecionada, a seguran&ccedil;a ser&aacute; ativada para o listener HTTP. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
<p>Se voc&ecirc; estiver configurando o <code>admin-listener</code> para o servidor de administra&ccedil;&atilde;o de dom&iacute;nios (DAS), que usa a configura&ccedil;&atilde;o <code>server-config</code>, esta op&ccedil;&atilde;o ser&aacute; somente para leitura. Para ativar a seguran&ccedil;a deste listener, &eacute; necess&aacute;rio ativar a administra&ccedil;&atilde;o segura. Consulte <a href="../../../common/en/help/ref-securityadmin.html">Administra&ccedil;&atilde;o Segura</a>.</p>
</dd>
<dt>Listener JK</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o estiver selecionada, o listener suportar&aacute; o protocolo <code>mod-jk</code> do Apache. O protocolo <code>mod-jk</code> &eacute; um protocolo propriet&aacute;rio de comunica&ccedil;&atilde;o/rede entre o <code>httpd</code> do Apache (servidor da web) e uma inst&acirc;ncia de back-end do GlassFish Server. Se o listener suportar este protocolo, <code>httpd</code> dever&aacute; suportar todo o conte&uacute;do est&aacute;tico, enquanto qualquer solicita&ccedil;&atilde;o de recurso din&acirc;mico (ou seja, Servlets e JSPs) s&atilde;o roteados para o listener HTTP ativado do <code>mod-jk</code> do &amp;Productname;, usando o protocolo <code>mod-jk</code>. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Endere&ccedil;o</dt>
<dd>
<p>O endere&ccedil;o IP no qual o listener de rede far&aacute; listening. O endere&ccedil;o pode estar na nota&ccedil;&atilde;o de par de pontos ou IPv6. Pode ser <code>qualquer</code> (para <code>INADDR_ANY</code>) para fazer listening em todos os endere&ccedil;os IP. Ele pode ser um nome de host.</p>
</dd>
<dt>Servidor Virtual Default</dt>
<dd>
<p>O servidor virtual a ser associado a este listener HTTP. Use a p&aacute;gina Servidores Virtuais para definir servidores virtuais.</p>
</dd>
<dt>Pool de Threads</dt>
<dd>
<p>O pool de threads associado ao listener HTTP. Normalmente, voc&ecirc; seleciona um dos dois pool de threads que est&atilde;o configurados quando o GlassFish Server &eacute; instalado.</p>
</dd>
<dt>Nome do Servidor</dt>
<dd>
<p>O nome do host a ser utilizado nas URLs que o servidor envia ao cliente. Esse nome ser&aacute; o nome alias se o servidor usar um alias. Se o servidor n&atilde;o usar alias, deixe o campo em branco.</p>
<p>Esse valor somente afeta os URLs gerados automaticamente pelo servidor; ele n&atilde;o afeta os URLs para diret&oacute;rios e arquivos armazenados no servidor. Caso seu servidor use um alias, o nome do servidor deve ser o nome do alias. Se uma v&iacute;rgula e um n&uacute;mero de porta forem acrescentados, essa porta ser&aacute; usada nos URLs que o servidor envia para o cliente.</p>
</dd>
</dl>
<a id="sthref114" name="sthref114"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-httplistenernew.html">Para Criar um Listener HTTP</a></p>
</li>
<li>
<p><a href="task-httplisteneredit.html">Para Editar um Listener HTTP</a></p>
</li>
<li>
<p><a href="task-httplistenerdelete.html">Para Deletar um Listener HTTP</a></p>
</li>
<li>
<p><a href="task-httplistenerssl.html">Para Editar Defini&ccedil;&otilde;es SSL de um Listener HTTP</a></p>
</li>
<li>
<p><a href="task-virtualservercreate.html">Para Criar um Servidor Virtual</a></p>
</li>
<li>
<p><a href="task-networklistenernew.html">Para Criar um Listener de Rede</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">Para Editar Defini&ccedil;&otilde;es de HTTP de um Protocolo</a></p>
</li>
</ul>
<a id="sthref115" name="sthref115"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00030"><code>create-http-listener</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00168"><code>list-http-listeners</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00082"><code>delete-http-listener</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00046"><code>create-network-listener</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00186"><code>list-network-listeners</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00098"><code>delete-network-listener</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
