<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-accesslog" name="ref-accesslog"></a></p>

<h4><a id="sthref103" name="sthref103"></a><a id="sthref104" name="sthref104"></a>Servi&ccedil;o HTTP</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilize a p&aacute;gina Servi&ccedil;o HTTP para especificar a pol&iacute;tica geral de log de acesso &agrave;s aplica&ccedil;&otilde;es Web.</p>
<p>O servi&ccedil;o HTTP oferece os recursos para implantar aplica&ccedil;&otilde;es Web e para tornar acess&iacute;veis pelos clientes HTTP as aplica&ccedil;&otilde;es Web implantadas, juntamente com servidores virtuais, pools de threads e o recurso Configura&ccedil;&atilde;o de Rede.</p>
<p>O GlassFish Server utiliza o log de acesso do servi&ccedil;o HTTP para ativar e configurar a circula&ccedil;&atilde;o de logs de acesso nos servidores virtuais. Estes logs est&atilde;o localizados no diret&oacute;rio domain-dir<code>/logs/access</code> e t&ecirc;m os seguintes nomes: <i>virtual_server_name</i><code>_access_log.</code><i>yyyyMMdd</i><code>-</code><i>HH</i><code>h</code><i>mm</i><code>m</code><i>ss</i><code>s.txt</code></p>
<p>A p&aacute;gina Servi&ccedil;o HTTP cont&eacute;m as op&ccedil;&otilde;es a seguir:</p>
<dl>
<dt>Carregar Defaults</dt>
<dd>
<p>Bot&atilde;o para restaurar defini&ccedil;&otilde;es para seus valores default. Defini&ccedil;&otilde;es que n&atilde;o tiveram seus valores default alterados.</p>
</dd>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>SSO</dt>
<dd>
<p>Identifica se o sign-on &uacute;nico est&aacute; ativado por default para todas as aplica&ccedil;&otilde;es Web em todos os servidores virtuais neste servidor que est&atilde;o configurados para o mesmo realm. Se esta op&ccedil;&atilde;o n&atilde;o estiver ativada, o sign-on &uacute;nico ser&aacute; desativado por default para todos os servidores virtuais e os usu&aacute;rios precisar&atilde;o se autenticar separadamente em cada aplica&ccedil;&atilde;o de cada servidor virtual. Voc&ecirc; pode substituir esta defini&ccedil;&atilde;o para um servidor virtual individual. O SSO pode ser ativado ou desativado. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Log de Acesso</dt>
<dd>
<p>Se essa op&ccedil;&atilde;o for selecionada, o log de acesso ser&aacute; ativado para todos os subelementos de servidor virtual que n&atilde;o especificarem essa propriedade. Se n&atilde;o for selecionada, a op&ccedil;&atilde;o desativar&aacute; o log de acesso para todos os subelementos de servidor virtual que n&atilde;o especificarem essa propriedade. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Rota&ccedil;&atilde;o</dt>
<dd>
<p>Se essa op&ccedil;&atilde;o for selecionada, a rota&ccedil;&atilde;o do arquivo de log ser&aacute; ativada. Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</dd>
<dt>Pol&iacute;tica de Rota&ccedil;&atilde;o</dt>
<dd>
<p>A &uacute;nica pol&iacute;tica de rota&ccedil;&atilde;o dispon&iacute;vel &eacute; <code>time</code>.</p>
</dd>
<dt>Intervalo de Rota&ccedil;&atilde;o</dt>
<dd>
<p>O n&uacute;mero de minutos entre as rota&ccedil;&otilde;es do log de acesso. Esse campo s&oacute; ser&aacute; v&aacute;lido se a Pol&iacute;tica de Rota&ccedil;&atilde;o for <code>time</code>. O valor default &eacute; 1.440 minutos (24 horas).</p>
</dd>
<dt>Sufixo de Rota&ccedil;&atilde;o</dt>
<dd>
<p>Valor de sequ&ecirc;ncia a ser adicionado ao final do nome do arquivo de log ap&oacute;s a rota&ccedil;&atilde;o. O valor default &eacute; <code>dd-MM-yyyy</code>.</p>
<p>Verifique se o sufixo de rota&ccedil;&atilde;o cont&eacute;m valores suficientes para criar um sufixo exclusivo para cada rota&ccedil;&atilde;o de log. Por exemplo, se o log de acesso for rotacionado mais de uma vez ao dia, inclua a hora do dia no sufixo de rota&ccedil;&atilde;o.</p>
<p>Um sufixo exclusivo &eacute; necess&aacute;rio para assegurar que o arquivo de log de acesso seja circulado sempre que o intervalo de rota&ccedil;&atilde;o for cumprido. Se o sufixo de rota&ccedil;&atilde;o do novo arquivo de log de acesso for igual ao sufixo de rota&ccedil;&atilde;o do arquivo de log existente, o arquivo n&atilde;o ser&aacute; rotacionado.</p>
</dd>
<dt>Contagem M&aacute;xima de Arquivos</dt>
<dd>
<p>O n&uacute;mero m&aacute;ximo de arquivos de log de acesso rotacionado a serem mantidos. Um valor negativo indica que n&atilde;o h&aacute; limite para a contagem de arquivos. O valor default &eacute; -1.</p>
</dd>
<dt>Tamanho do Buffer</dt>
<dd>
<p>O tamanho, em bytes, do buffer de registros de acesso ou um valor menor que ou igual a 0 para registros de acesso sem buffer. O valor default &eacute; 32.768.</p>
</dd>
<dt>Intervalo de Grava&ccedil;&atilde;o</dt>
<dd>
<p>O n&uacute;mero de segundos antes que o log seja gravado no disco. O log de acesso &eacute; gravado quando o buffer est&aacute; cheio ou quando o intervalo expira. Se o valor for menor que ou igual a 0, o buffer ser&aacute; sempre gravado, mesmo que n&atilde;o esteja cheio. Isso significa que, a cada vez que o servidor &eacute; acessado, a mensagem de log &eacute; armazenada diretamente no arquivo. O valor default &eacute; 300.</p>
</dd>
<dt>Formato</dt>
<dd>
<p>Valor de sequ&ecirc;ncia que especifica quais informa&ccedil;&otilde;es devem ser capturadas no log de acesso e a ordem em que devem ser capturadas. O valor default &eacute; o seguinte:</p>
<pre>
%client.name% %auth-user-name% %datetime% %request% %status% %response.length%
</pre>
<p>Esses valores est&atilde;o dispon&iacute;veis para inclus&atilde;o na string de formato:</p>
<dl>
<dt><code>%attribute.</code><i>name</i><code>%</code></dt>
<dd>
<p>Registra o valor (ao chamar seu m&eacute;todo <code>toString</code>) do atributo de solicita&ccedil;&atilde;o com o determinado <i>name</i></p>
</dd>
<dt><code>%auth-user-name%</code></dt>
<dd>
<p>Nome do usu&aacute;rio autorizado</p>
</dd>
<dt><code>%client.name%</code></dt>
<dd>
<p>Nome do host cliente</p>
</dd>
<dt><code>%client.dns%</code></dt>
<dd>
<p>DNS Cliente</p>
</dd>
<dt><code>%cookie.</code><i>name</i><code>%</code></dt>
<dd>
<p>O valor do cookie solicitado com o <i>name</i> determinado</p>
</dd>
<dt><code>%cookie.value%</code></dt>
<dd>
<p>O valor do primeiro cookie encontrado na solicita&ccedil;&atilde;o</p>
</dd>
<dt><code>%datetime%</code></dt>
<dd>
<p>Data do sistema</p>
</dd>
<dt><code>%request%</code></dt>
<dd>
<p>Linha de solicita&ccedil;&atilde;o HTTP completa</p>
</dd>
<dt><code>%status%</code></dt>
<dd>
<p>Status</p>
</dd>
<dt><code>%response.length%</code></dt>
<dd>
<p>Tamanho do conte&uacute;do da resposta</p>
</dd>
<dt><code>%header.referer%</code></dt>
<dd>
<p>Cabe&ccedil;alho do referenciador</p>
</dd>
<dt><code>%header.user-agent%</code></dt>
<dd>
<p>Cabe&ccedil;alho de agente do usu&aacute;rio</p>
</dd>
<dt><code>%http-method%</code></dt>
<dd>
<p>M&eacute;todo HTTP</p>
</dd>
<dt><code>%http-uri%</code></dt>
<dd>
<p>URI HTTP</p>
</dd>
<dt><code>%query-str%</code></dt>
<dd>
<p>String de consulta HTTP</p>
</dd>
<dt><code>%http-version%</code></dt>
<dd>
<p>Vers&atilde;o do protocolo HTTP</p>
</dd>
<dt><code>%header.accept%</code></dt>
<dd>
<p>Cabe&ccedil;alho da aceita&ccedil;&atilde;o</p>
</dd>
<dt><code>%header.date%</code></dt>
<dd>
<p>Cabe&ccedil;alho de data</p>
</dd>
<dt><code>%header.if-mod-since%</code></dt>
<dd>
<p>Cabe&ccedil;alho Se modificado desde</p>
</dd>
<dt><code>%header.auth%</code></dt>
<dd>
<p>Cabe&ccedil;alho da autoriza&ccedil;&atilde;o</p>
</dd>
<dt><code>%header.</code><i>any</i><code>%</code></dt>
<dd>
<p>Um valor de cabe&ccedil;alho HTTP v&aacute;lido em RFC 2616 (<code>any</code> tamb&eacute;m &eacute; um valor de cabe&ccedil;alho v&aacute;lido; est&aacute; especificado como vari&aacute;vel, aqui)</p>
</dd>
<dt><code>%session.</code><i>name</i><code>%</code></dt>
<dd>
<p>O valor do atributo da sess&atilde;o com o nome <i>name</i> ou <code>NULL-SESSION-ATTRIBUTE-</code><i>name</i> se o atributo denominado n&atilde;o existir na sess&atilde;o ou <code>NULL-SESSION</code> se nenhuma sess&atilde;o existir</p>
</dd>
<dt><code>%time-taken%</code></dt>
<dd>
<p>Tempo (em milissegundos) que levou para efetuar o servi&ccedil;o de cada solicita&ccedil;&atilde;o</p>
</dd>
<dt><code>%vs.id%</code></dt>
<dd>
<p>ID do servidor virtual</p>
</dd>
</dl>
</dd>
<dt>Propriedades Adicionais</dt>
<dd>
<p>As propriedades adicionais do Servi&ccedil;o HTTP. Para obter uma descri&ccedil;&atilde;o das propriedades dispon&iacute;veis, consulte <a href="ref-httpserviceprops.html">Propriedades Espec&iacute;ficas para o Servi&ccedil;o HTTP</a>.</p>
</dd>
</dl>
<a id="sthref105" name="sthref105"></a>
<h5>Tarefas Relacionadas</h5>
<p><a href="task-accesslog.html">Para Configurar o Servi&ccedil;o HTTP</a></p>
<a id="sthref106" name="sthref106"></a>
<h5>Comandos asadmin Relacionados</h5>
<p>Nenhum.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
