<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-virtualserveredit" name="ref-virtualserveredit"></a><a id="GHWEB00013" name="GHWEB00013"></a></p>

<h4><a id="sthref126" name="sthref126"></a>Editar Servidor Virtual</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Editar Servidor Virtual para modificar as defini&ccedil;&otilde;es de um servidor virtual.</p>
<p>A p&aacute;gina Editar Servidor Virtual cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Carregar Defaults</dt>
<dd>
<p>Bot&atilde;o para restaurar defini&ccedil;&otilde;es para seus valores default. Defini&ccedil;&otilde;es que n&atilde;o tiveram seus valores default alterados.</p>
</dd>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Id</dt>
<dd>
<p>Identificador vis&iacute;vel internamente do servidor virtual. N&atilde;o &eacute; mostrado aos clientes HTTP. Os nomes de host apresentados aos clientes HTTP devem ser especificados no campo Hosts.</p>
</dd>
<dt>Hosts</dt>
<dd>
<p>O nome ou os nomes de host do computador em que o servidor est&aacute; em execu&ccedil;&atilde;o. Use nomes de host reais ou virtuais que s&atilde;o registrados com o servidor DNS para a sua rede (e, em um sistema UNIX, no seu arquivo<code>/etc/hosts</code>). O valor default est&aacute; no valor da propriedade do sistema <code>${com.sun.aas.hostName}</code>.</p>
</dd>
<dt>Estado</dt>
<dd>
<p>O estado desejado do servidor. O valor pode ser um dos seguintes:</p>
<dl>
<dt>Ligado</dt>
<dd>
<p>O servidor virtual est&aacute; ativo. Esse &eacute; o valor default.</p>
</dd>
<dt>Desligado</dt>
<dd>
<p>O servidor virtual est&aacute; inativo. As tentativas de acessar o servidor retornam o c&oacute;digo de erro 404 (recurso indispon&iacute;vel).</p>
</dd>
<dt>Desativado</dt>
<dd>
<p>O servidor virtual est&aacute; desativado. As tentativas de acessar o servidor retornam o c&oacute;digo de erro 403 (execu&ccedil;&atilde;o da solicita&ccedil;&atilde;o recusada).</p>
</dd>
</dl>
</dd>
<dt>SSO</dt>
<dd>
<p>Especifique se o comportamento de sign-on &uacute;nico &eacute; herdado do servi&ccedil;o HTTP e se est&aacute; ativado ou desativado. Por default, &eacute; herdado do Servi&ccedil;o HTTP. Se esta op&ccedil;&atilde;o estiver ativada, o sign-on &uacute;nico ser&aacute; ativado para aplica&ccedil;&otilde;es Web neste servidor virtual que estiverem configuradas para o mesmo realm. Se esta op&ccedil;&atilde;o n&atilde;o estiver ativada, o sign-on &uacute;nico ser&aacute; desativado para este servidor virtual, e os usu&aacute;rios precisar&atilde;o ser autenticados separadamente em cada aplica&ccedil;&atilde;o no servidor virtual.</p>
</dd>
<dt>Listeners de Rede</dt>
<dd>
<p>O listener ou listeners de rede associados a esse servidor.</p>
</dd>
<dt>M&oacute;dulo Web Default</dt>
<dd>
<p>O m&oacute;dulo da Web implantado (se existente), designado para responder todas as solicita&ccedil;&otilde;es que n&atilde;o puderem ser mapeadas por outros m&oacute;dulos Web implantados no servidor virtual. Se um M&oacute;dulo da Web Default n&atilde;o for especificado, o m&oacute;dulo da Web que tiver uma raiz de contexto vazia ser&aacute; utilizado. Se n&atilde;o houver nenhum m&oacute;dulo da Web com raiz de contexto vazia, um m&oacute;dulo da Web default do sistema ser&aacute; criado e utilizado.</p>
</dd>
<dt>Arquivo de Log</dt>
<dd>
<p>O nome do caminho do arquivo em que as mensagens de log do servidor virtual ser&atilde;o exibidas. Por default, as mensagens de log aparecer&atilde;o em domain-dir<code>/logs/server.log</code>.</p>
</dd>
<dt>Docroot</dt>
<dd>
<p>O caminho absoluto do diret&oacute;rio de documento raiz do servidor. O valor default &eacute; domain-dir<code>/docroot</code>.</p>
</dd>
<dt>Log de Acesso</dt>
<dd>
<p>Especifica se o log de acesso &eacute; herdado do servi&ccedil;o HTTP e se est&aacute; ativado ou desativado. Por default, &eacute; herdado do Servi&ccedil;o HTTP.</p>
</dd>
<dt>Diret&oacute;rio</dt>
<dd>
<p>O caminho absoluto de diret&oacute;rio para os logs de acesso do servidor. O default &eacute; domain-dir<code>/logs/access</code>.</p>
</dd>
<dt>Propriedades Adicionais</dt>
<dd>
<p>Propriedades adicionais do servidor virtual.</p>
<p>Para obter informa&ccedil;&otilde;es sobre propriedades dispon&iacute;veis, consulte <a href="ref-virtualserverprops.html">Propriedades Espec&iacute;ficas para Servidores Virtuais</a>.</p>
</dd>
</dl>
<a id="sthref127" name="sthref127"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-virtualservercreate.html">Para Criar um Servidor Virtual</a></p>
</li>
<li>
<p><a href="task-virtualserveredit.html">Para Editar um Servidor Virtual</a></p>
</li>
<li>
<p><a href="task-virtualserverdelete.html">Para Deletar um Servidor Virtual</a></p>
</li>
</ul>
<a id="sthref128" name="sthref128"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00062"><code>create-virtual-server</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00207"><code>list-virtual-servers</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00113"><code>delete-virtual-server</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
