<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-managerproptab" name="ref-managerproptab"></a></p>

<h4><a id="sthref95" name="sthref95"></a><a id="sthref96" name="sthref96"></a>Propriedades do Gerenciador</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>O gerenciador de sess&otilde;es fornece os meios para configurar o modo como as sess&otilde;es s&atilde;o criadas e destru&iacute;das, mostra onde o estado da sess&atilde;o ser&aacute; armazenado e informa o n&uacute;mero m&aacute;ximo de sess&otilde;es dispon&iacute;veis.</p>
<p>Use a p&aacute;gina Propriedades do Gerenciador para adicionar ou modificar propriedades do gerenciador para o cont&ecirc;iner Web.</p>
<p>A p&aacute;gina Propriedades do Gerenciador cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Carregar Defaults</dt>
<dd>
<p>Bot&atilde;o para restaurar defini&ccedil;&otilde;es para seus valores default. Defini&ccedil;&otilde;es que n&atilde;o tiveram seus valores default alterados.</p>
</dd>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Intervalo para Remo&ccedil;&atilde;o</dt>
<dd>
<p>O n&uacute;mero de segundos antes que a sess&atilde;o inativa seja deletada do armazenamento. O valor default &eacute; 60.</p>
<p>Defina este valor menor do que a frequ&ecirc;ncia na qual os dados da sess&atilde;o s&atilde;o modificados. Por exemplo, este valor deveria ser o menor poss&iacute;vel (1 segundo) para um servlet de contagem de acessos em um Web site com acesso frequente, do contr&aacute;rio voc&ecirc; perder&aacute; alguns acessos cada vez que reiniciar o servidor.</p>
</dd>
<dt>M&aacute;x. de Sess&otilde;es</dt>
<dd>
<p>O n&uacute;mero m&aacute;ximo de sess&otilde;es que podem ser armazenadas no cache. Um valor de -1 indica que n&atilde;o h&aacute; limite para o n&uacute;mero de sess&otilde;es. O valor default &eacute; -1.</p>
<p>Ap&oacute;s o limite ser alcan&ccedil;ado, uma tentativa para criar uma nova sess&atilde;o causa a ocorr&ecirc;ncia de uma <code>IllegalStateException</code>.</p>
</dd>
<dt>Nome de Arquivo da Sess&atilde;o</dt>
<dd>
<p>O caminho absoluto ou relativo do diret&oacute;rio no qual o estado da sess&atilde;o &eacute; preservado entre as reinicializa&ccedil;&otilde;es da aplica&ccedil;&atilde;o, se for poss&iacute;vel preservar o estado. Se este caminho n&atilde;o for definido, o estado da sess&atilde;o n&atilde;o ser&aacute; preservado. Por default, este caminho n&atilde;o &eacute; definido.</p>
<p>Um caminho relativo para o diret&oacute;rio tempor&aacute;rio desta aplica&ccedil;&atilde;o Web.</p>
</dd>
<dt>Nome da Classe Geradora do ID da Sess&atilde;o</dt>
<dd>
<p>A classe personalizada para gera&ccedil;&atilde;o de IDs de sess&atilde;o exclusivos. S&oacute; &eacute; permitida uma classe geradora de ID de sess&atilde;o por inst&acirc;ncia do servidor, e todas as inst&acirc;ncias em um cluster devem usar o mesmo gerador de ID de sess&atilde;o para impedir que haja colis&atilde;o de chaves da sess&atilde;o. A classe deve estar no classpath do Servidor de Aplica&ccedil;&otilde;es. Por default, uma classe personalizada n&atilde;o &eacute; definida.</p>
</dd>
<dt>Propriedades Adicionais</dt>
<dd>
<p>Propriedades adicionais para o gerenciador de sess&otilde;es O GlassFish Server n&atilde;o define propriedades adicionais para o gerenciador de sess&otilde;es.</p>
</dd>
</dl>
<a id="sthref97" name="sthref97"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-webcontainergeneral.html">Para Configurar Propriedades Gerais do Cont&ecirc;iner Web</a></p>
</li>
<li>
<p><a href="task-webcontainersessiontimeout.html">Para Configurar Propriedades da Sess&atilde;o para o Cont&ecirc;iner Web</a></p>
</li>
<li>
<p><a href="task-webcontainermanagerprops.html">Para Configurar Propriedades do Gerenciador para o Cont&ecirc;iner Web</a></p>
</li>
<li>
<p><a href="task-webcontainerstoreprops.html">Para Configurar Propriedades de Armazenamento para o Cont&ecirc;iner Web</a></p>
</li>
<li>
<p><a href="task-webcontaineravailability.html">Para Configurar as Defini&ccedil;&otilde;es de Disponibilidade do Cont&ecirc;iner Web</a></p>
</li>
</ul>
<a id="sthref98" name="sthref98"></a>
<h5>Comandos asadmin Relacionados</h5>
<p>Nenhum.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
