<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-networklisteneredit" name="ref-networklisteneredit"></a><a id="GHWEB00017" name="GHWEB00017"></a></p>

<h4><a id="sthref135" name="sthref135"></a>Editar Listener de Rede</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilize a p&aacute;gina Editar Listeners de Rede para modificar um listener de rede existente.</p>
<p>Quando voc&ecirc; edita um listener de rede, as guias SSL, HTTP e Arquivo de Cache para o protocolo associado, tamb&eacute;m est&atilde;o dispon&iacute;veis para edi&ccedil;&atilde;o.</p>
<p>A p&aacute;gina Editar Listener de Rede cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Carregar Defaults</dt>
<dd>
<p>Bot&atilde;o para restaurar defini&ccedil;&otilde;es para seus valores default. Defini&ccedil;&otilde;es que n&atilde;o tiveram seus valores default alterados.</p>
</dd>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Nome</dt>
<dd>
<p>O nome exclusivo do listener. O campo Nome &eacute; somente para leitura. Voc&ecirc; s&oacute; pode especificar o nome quando cria uma novo listener de rede.</p>
</dd>
<dt>Protocolo</dt>
<dd>
<p>O protocolo associado ao listener de rede. O campo Protocolo &eacute; somente para leitura. Voc&ecirc; s&oacute; pode criar ou especificar um protocolo criar um novo listener de rede.</p>
<p>Selecione o Protocolo usado pelo listener de rede para alterar suas defini&ccedil;&otilde;es. Por exemplo, voc&ecirc; pode ativar seguran&ccedil;a.</p>
</dd>
<dt>Status</dt>
<dd>
<p>O status do listener de rede. O listener pode ser ativado ou desativado. Por default, a op&ccedil;&atilde;o est&aacute; ativada. Se o listener estiver desativado, qualquer tentativa de conectar ao listener resulta em uma exce&ccedil;&atilde;o de soquete (<code>java.net.ConnectException</code>).</p>
<p>Nas vers&otilde;es do GlassFish Server anteriores a Servidor de Aplica&ccedil;&otilde;es 9.1, um listener cujo atributo ativado estava definido como falso retornava um c&oacute;digo de resposta 404, para quaisquer solicita&ccedil;&otilde;es enviadas a ele. Para obter esse comportamento na vers&atilde;o atual do GlassFish Server, defina o status do listener como ativado e cada estado de servidor virtual associado como OFF. Um servidor virtual lista suas listeners associadas na sua lista drop-down Listeners de Rede.</p>
</dd>
<dt>Seguran&ccedil;a</dt>
<dd>
<p>Se essa op&ccedil;&atilde;o estiver selecionada, a seguran&ccedil;a ser&aacute; ativada para o protocolo utilizado pelo listener de rede. O campo Seguran&ccedil;a &eacute; somente para leitura.</p>
<p>Se voc&ecirc; estiver configurando o <code>admin-listener</code> para o servidor de administra&ccedil;&atilde;o de dom&iacute;nios (DAS), que usa a configura&ccedil;&atilde;o <code>server-config</code>, esta op&ccedil;&atilde;o ser&aacute; somente para leitura. Para ativar a seguran&ccedil;a deste listener, &eacute; necess&aacute;rio ativar a administra&ccedil;&atilde;o segura. Consulte <a href="../../../common/en/help/ref-securityadmin.html">Administra&ccedil;&atilde;o Segura</a>.</p>
</dd>
<dt>Listener JK</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o estiver selecionada, o listener suportar&aacute; o protocolo <code>mod-jk</code> do Apache. O protocolo <code>mod-jk</code> &eacute; um protocolo propriet&aacute;rio de comunica&ccedil;&atilde;o/rede entre o <code>httpd</code> do Apache (servidor da web) e uma inst&acirc;ncia de back-end do GlassFish Server. Se o listener oferecer suporte a esse protocolo, o <code>httpd</code> dever&aacute; tratar todo o conte&uacute;do est&aacute;tico, enquanto as solicita&ccedil;&otilde;es por recursos din&acirc;micos (ou seja, Servlets e JSPs) ser&atilde;o roteadas para o listener de rede ativado por <code>mod-jk</code> do GlassFish Server, utilizando o protocolo <code>mod-jk</code>. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Porta</dt>
<dd>
<p>O n&uacute;mero da porta na qual o listener far&aacute; listening. Os valores v&aacute;lidos s&atilde;o 1 a 65.535. Em sistemas UNIX, criar soquetes que fazem listening nas portas 1 - 1024 exige privil&eacute;gios de superusu&aacute;rio.</p>
</dd>
<dt>Endere&ccedil;o</dt>
<dd>
<p>O endere&ccedil;o IP no qual o listener de rede far&aacute; listening. O endere&ccedil;o pode estar na nota&ccedil;&atilde;o de par de pontos ou IPv6. Pode ser <code>qualquer</code> (para <code>INADDR_ANY</code>) para fazer listening em todos os endere&ccedil;os IP. Ele pode ser um nome de host.</p>
</dd>
<dt>Pool de Threads</dt>
<dd>
<p>O pool de threads associado ao listener de rede.</p>
</dd>
<dt>Transporte</dt>
<dd>
<p>O tipo de transporte do listener de rede. Por default, o &uacute;nico transporte &eacute; o <code>tcp</code>.</p>
</dd>
</dl>
<a id="sthref136" name="sthref136"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-networklistenernew.html">Para Criar um Listener de Rede</a></p>
</li>
<li>
<p><a href="task-networklisteneredit.html">Para Editar um Listener de Rede</a></p>
</li>
<li>
<p><a href="task-networklistenerdelete.html">Para Deletar um Listener de Rede</a></p>
</li>
<li>
<p><a href="task-protocolnew.html">Para Criar um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">Para Editar um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">Para Editar Defini&ccedil;&otilde;es de SSL de um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">Para Editar Defini&ccedil;&otilde;es de HTTP de um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocolfilecacheedit.html">Para Editar Defini&ccedil;&otilde;es de Cache do Arquivo de um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">Para Deletar um Protocolo</a></p>
</li>
</ul>
<a id="sthref137" name="sthref137"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00046"><code>create-network-listener</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00186"><code>list-network-listeners</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00098"><code>delete-network-listener</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
