<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-protocoledit" name="ref-protocoledit"></a></p>

<h4><a id="sthref145" name="sthref145"></a>Editar Protocolo</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilize a p&aacute;gina Editar Protocolo para modificar as defini&ccedil;&otilde;es de um protocolo de rede existente.</p>
<p>A p&aacute;gina Editar Protocolo cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Carregar Defaults</dt>
<dd>
<p>Bot&atilde;o para restaurar defini&ccedil;&otilde;es para seus valores default. Defini&ccedil;&otilde;es que n&atilde;o tiveram seus valores default alterados.</p>
</dd>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Nome</dt>
<dd>
<p>O nome do protocolo. O campo Nome &eacute; somente para leitura. Voc&ecirc; s&oacute; pode especificar o nome quando cria um novo protocolo.</p>
</dd>
<dt>Seguran&ccedil;a</dt>
<dd>
<p>Se essa op&ccedil;&atilde;o for selecionada, a seguran&ccedil;a ser&aacute; ativada para o protocolo. Se a seguran&ccedil;a est&aacute; ativada, voc&ecirc; pode usar a guia SSL para modificar as defini&ccedil;&otilde;es de seguran&ccedil;a.</p>
<p>Se voc&ecirc; estiver configurando o <code>admin-listener</code> para o servidor de administra&ccedil;&atilde;o de dom&iacute;nios (DAS), que usa a configura&ccedil;&atilde;o <code>server-config</code>, esta op&ccedil;&atilde;o ser&aacute; somente para leitura. Para ativar a seguran&ccedil;a deste protocolo, &eacute; necess&aacute;rio ativar a administra&ccedil;&atilde;o segura. Consulte <a href="../../../common/en/help/ref-securityadmin.html">Administra&ccedil;&atilde;o Segura</a>.</p>
</dd>
</dl>
<a id="sthref146" name="sthref146"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-protocolnew.html">Para Criar um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">Para Editar um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">Para Editar Defini&ccedil;&otilde;es de SSL de um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">Para Editar Defini&ccedil;&otilde;es de HTTP de um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocolfilecacheedit.html">Para Editar Defini&ccedil;&otilde;es de Cache do Arquivo de um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">Para Deletar um Protocolo</a></p>
</li>
</ul>
<a id="sthref147" name="sthref147"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00051"><code>create-protocol</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00195"><code>list-protocols</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00103"><code>delete-protocol</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
