<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-virtualserverprops" name="ref-virtualserverprops"></a></p>

<h4><a id="sthref125" name="sthref125"></a><a id="sthref126" name="sthref126"></a>Propriedades Espec&iacute;ficas para Servidores Virtuais</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>As propriedades a seguir adicionais est&atilde;o dispon&iacute;veis para um servidor virtual.</p>
<dl>
<dt><code>sso-max-inactive-seconds</code></dt>
<dd>
<p>Especifica o n&uacute;mero de segundos ap&oacute;s o qual o registro de sign-on &uacute;nico de um usu&aacute;rio se torna qualificado para expurga&ccedil;&atilde;o, caso nenhuma atividade do cliente seja recebida. Como o single sign-on &eacute; aplic&aacute;vel em v&aacute;rias aplica&ccedil;&otilde;es no mesmo servidor virtual, o acesso a qualquer um das aplica&ccedil;&otilde;es mant&eacute;m ativo o registro de sign-on &uacute;nico.</p>
<p>O valor default &eacute; 300 segundos (5 minutos). Valor mais altos fornecem uma persist&ecirc;ncia mais longa de sign-on &uacute;nico para os usu&aacute;rios, por&eacute;m, exige um uso de mem&oacute;ria maior no servidor.</p>
</dd>
<dt><code>sso-reap-interval-seconds</code></dt>
<dd>
<p>Especifica o n&uacute;mero de segundos entre as expurga&ccedil;&otilde;es de registros de sign-on &uacute;nico expirados.</p>
<p>O valor default &eacute; 60.</p>
</dd>
<dt><code>ssoCookieSecure</code></dt>
<dd>
<p>Define o atributo <code>Secure</code> de quaisquer cookies <code>JSESSIONIDSSO</code> associados &agrave;s aplica&ccedil;&otilde;es Web implantadas para esse servidor virtual. Essa propriedade s&oacute; se aplicar&aacute; se o sign-on &uacute;nico estiver ativado. Os valores permitidos s&atilde;o como segue:</p>
<dl>
<dt><code>true</code></dt>
<dd>
<p>Define <code>Secure</code> como verdadeiro.</p>
</dd>
<dt><code>false</code></dt>
<dd>
<p>Define <code>Secure</code> como falso.</p>
</dd>
<dt><code>dynamic</code></dt>
<dd>
<p>O cookie <code>JSESSIONIDSSO</code> herda a defini&ccedil;&atilde;o <code>Secure</code> da primeira sess&atilde;o participando no SSO.</p>
</dd>
</dl>
<p>Para definir um atributo Secure de um cookie <code>JSESSIONID</code>, use a propriedade <code>cookieSecure</code> <code>cookie-properties</code> no arquivo <code>sun-web.xml</code>. Para obter mais detalhes, consulte<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00130"><i>cookie-properties</i> em <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt><code>setCacheControl</code></dt>
<dd>
<p>Especifica uma lista separada por v&iacute;rgulas de diretivas de resposta <code>Controle por Cache</code>. Para obter uma lista de diretivas v&aacute;lidas, consulte Section 14.9 do documento em http://www.ietf.org/rfc/rfc2616.txt (<code><a href="http://www.ietf.org/rfc/rfc2616.txt">http://www.ietf.org/rfc/rfc2616.txt</a></code>).</p>
</dd>
<dt><code>accessLogBufferSize</code></dt>
<dd>
<p>Especifica o tamanho em bytes do buffer onde as chamadas de log de acesso s&atilde;o armazenadas. Se o valor for menor do que 5.120, uma mensagem de advert&ecirc;ncia ser&aacute; emitida, e o valor &eacute; definido como 5.120. O valor default &eacute; 32.768.</p>
</dd>
<dt><code>accessLogWriterInterval</code></dt>
<dd>
<p>Especifica o n&uacute;mero de segundos antes que o log seja gravado no disco. O log de acesso &eacute; gravado quando o buffer est&aacute; cheio ou quando o intervalo expira. Se o valor &eacute; 0, o buffer &eacute; sempre gravado mesmo que n&atilde;o esteja cheio. Isso significa que, a cada vez que o servidor &eacute; acessado, a mensagem de log &eacute; armazenada diretamente no arquivo. O valor default &eacute; 300.</p>
</dd>
<dt><code>allowRemoteAddress</code></dt>
<dd>
<p>Especifica uma lista separada por v&iacute;rgulas de padr&otilde;es de express&otilde;es regulares, em rela&ccedil;&atilde;o a qual o endere&ccedil;o IP do cliente remoto &eacute; comparado. Se essa propriedade for especificada. o endere&ccedil;o remoto <i>dever&aacute;</i> coincidir para que a solicita&ccedil;&atilde;o seja aceita. Se a propriedade n&atilde;o for especificada, todas as solicita&ccedil;&otilde;es ser&atilde;o aceitas, <i>a menos que</i> o endere&ccedil;o remoto coincida com o padr&atilde;o <code>denyRemoteAddress</code>.</p>
</dd>
<dt><code>denyRemoteAddress</code></dt>
<dd>
<p>Especifica uma lista separada por v&iacute;rgulas de padr&otilde;es de express&otilde;es regulares, em rela&ccedil;&atilde;o a qual o endere&ccedil;o IP do cliente remoto &eacute; comparado. Se essa propriedade for especificada. o endere&ccedil;o remoto <i>n&atilde;o</i> dever&aacute; coincidir para que a solicita&ccedil;&atilde;o seja aceita. Se a propriedade n&atilde;o for especificada, a aceita&ccedil;&atilde;o da solicita&ccedil;&atilde;o ser&aacute; administrada exclusivamente pela propriedade <code>allowRemoteAddress</code>.</p>
</dd>
<dt><code>allowRemoteHost</code></dt>
<dd>
<p>Especifica uma lista separada por v&iacute;rgulas de padr&otilde;es de express&otilde;es regulares aos quais o nome do host do cliente remoto (conforme retornado por <code>[java.net.]Socket.getInetAddress().getHostName()</code>) &eacute; comparado. Se essa propriedade for especificada. o nome de host remoto <i>dever&aacute;</i> coincidir para que a solicita&ccedil;&atilde;o seja aceita. Se a propriedade n&atilde;o for especificada, todas as solicita&ccedil;&otilde;es ser&atilde;o aceitas, <i>a menos que</i> o nome de host remoto coincida com o padr&atilde;o <code>denyRemoteHost</code>.</p>
</dd>
<dt><code>denyRemoteHost</code></dt>
<dd>
<p>Especifica uma lista separada por v&iacute;rgulas de padr&otilde;es de express&otilde;es regulares aos quais o nome do host do cliente remoto (conforme retornado por <code>[java.net.]Socket.getInetAddress().getHostName()</code>) &eacute; comparado. Se essa propriedade for especificada. o nome de host remoto <i>n&atilde;o</i> dever&aacute; coincidir para que a solicita&ccedil;&atilde;o seja aceita. Se a propriedade n&atilde;o for especificada, a aceita&ccedil;&atilde;o da solicita&ccedil;&atilde;o ser&aacute; administrada exclusivamente pela propriedade <code>allowRemoteHost</code>.</p>
<p>A defini&ccedil;&atilde;o desta propriedade n&atilde;o tem efeito se o dom&iacute;nio do GlassFish Server &eacute; acessado atrav&eacute;s de um listener de rede que tenha a op&ccedil;&atilde;o Interpretador JK ativada.</p>
</dd>
<dt><code>authRealm</code></dt>
<dd>
<p>Especifica o nome de um realm de autentica&ccedil;&atilde;o, que substitui o realm default da inst&acirc;ncia do servidor por aplica&ccedil;&otilde;es Web standalone implantadas neste servidor virtual. Um realm definido no arquivo <code>web.xml</code> de uma aplica&ccedil;&atilde;o da web standalone substitui o realm do servidor virtual. Para obter mais informa&ccedil;&otilde;es, consulte <a href="../../../common/en/help/ref-realms.html">Realms</a> .</p>
</dd>
<dt><code>securePagesWithPragma</code></dt>
<dd>
<p>Defina essa propriedade como <code>falso</code> para garantir que todas as aplica&ccedil;&otilde;es Web em downloads de arquivos do servidor virtual, usando SSL, funcionem adequadamente no Internet Explorer.</p>
<p>aplica&ccedil;&otilde;es Web individuais podem substituir essa defini&ccedil;&atilde;o, usando o elemento <code>sun-web-app</code> do arquivo <code>sun-web.xml</code>. Para obter mais detalhes, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>glassfish-web-app</i> em <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
<p>O valor default &eacute; <code>true</code>.</p>
</dd>
<dt><code>alternatedocroot_</code><i>n</i></dt>
<dd>
<p>Especifica uma raiz de documento alternativa (docroot), onde <i>n</i> &eacute; um inteiro positivo que permite a especifica&ccedil;&atilde;o de mais de um. Docroots alternativas permite que as aplica&ccedil;&otilde;es da Web atendam solicita&ccedil;&otilde;es de determinados recursos externos &agrave; pr&oacute;pria docroot, dependendo de tais solicita&ccedil;&otilde;es corresponderem a um (ou mais) dos padr&otilde;es URI das docroots alternativas da aplica&ccedil;&atilde;o Web.</p>
<p>Se uma solicita&ccedil;&atilde;o corresponder a um padr&atilde;o URI da docroot alternativa, ela ser&aacute; mapeada para uma docroot alternativa, acrescentando o URI da solicita&ccedil;&atilde;o (menos a raiz de contexto da aplica&ccedil;&atilde;o Web) &agrave; localiza&ccedil;&atilde;o f&iacute;sica (diret&oacute;rio) da docroot alternativa. Se uma solicita&ccedil;&atilde;o corresponder a v&aacute;rios padr&otilde;es URI, a docroot alternativa ser&aacute; determinada de acordo com esta ordem de preced&ecirc;ncia:</p>
<ul>
<li>
<p>Correspond&ecirc;ncia exata</p>
</li>
<li>
<p>Correspond&ecirc;ncia de caminho mais longo</p>
</li>
<li>
<p>Correspond&ecirc;ncia de extens&atilde;o</p>
</li>
</ul>
<p>Por exemplo, as seguintes propriedades especificam tr&ecirc;s docroots alternativas: O padr&atilde;o URI da primeira docroot alternativa usa uma correspond&ecirc;ncia exata, ao passo que os padr&otilde;es URI da segunda e terceira docroots alternativas usam correspond&ecirc;ncias de prefixo de extens&atilde;o e caminho mais longo, respectivamente.</p>
<pre>
&lt;property name="alternatedocroot_1" 
   value="from=/my.jpg dir=/srv/images/jpg"
&lt;property name="alternatedocroot_2" 
   value="from=*.jpg dir=/srv/images/jpg"
&lt;property name="alternatedocroot_3" 
   value="from=/jpg/* dir=/src/images"
</pre>
<p>O <code>valor</code> de cada docroot alternativa tem dois componentes: o primeiro componente, <code>de</code>, especifica o padr&atilde;o URI da docroot alternativa; o seguindo componente, <code>dir</code>, especifica a localiza&ccedil;&atilde;o f&iacute;sica (diret&oacute;rio) da docroot alternativa. Espa&ccedil;os s&atilde;o permitidos no componente <code>dir</code>.</p>
<p>aplica&ccedil;&otilde;es Web individuais podem substituir essa defini&ccedil;&atilde;o, usando o elemento <code>sun-web-app</code> do arquivo <code>sun-web.xml</code>. Para obter mais detalhes, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>glassfish-web-app</i> em <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt><code>contextXmlDefault</code></dt>
<dd>
<p>Especifica a localiza&ccedil;&atilde;o, relativa ao domain-dir do arquivo <code>context.xml</code> para este servidor virtual, se utilizado. Para obter mais informa&ccedil;&otilde;es sobre o arquivo <code>context.xml</code>, consulte o Cont&ecirc;iner de Contexto (<code><a href="http://tomcat.apache.org/tomcat-5.5-doc/config/context.html">http://tomcat.apache.org/tomcat-5.5-doc/config/context.html</a></code>).</p>
</dd>
<dt><code>allowLinking</code></dt>
<dd>
<p>Se <code>true</code>, os recursos que forem links simb&oacute;licos ser&atilde;o atendidos por todas as aplica&ccedil;&otilde;es Web implantadas no servidor virtual. aplica&ccedil;&otilde;es Web individuais podem substituir essa defini&ccedil;&atilde;o, usando a propriedade <code>sun-web-app</code> <code>allowLinking</code> do arquivo <code>sun-web.xml</code>:</p>
<pre>
&lt;sun-web-app&gt;
   &lt;property name="allowLinking" 
      value="{true|false}"
&lt;/sun-web-app&gt;
</pre>
<p>Para obter mais detalhes, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>glassfish-web-app</i> em <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
<p>O valor default &eacute; <code>false</code>.</p>

<hr>
<p><b>Cuidado:</b></p>
A defini&ccedil;&atilde;o desta propriedade como verdadeira nos sistemas Windows exp&otilde;e o c&oacute;digo de origem JSP.
<hr>

</dd>
<dt><code>send-error_</code><i>n</i></dt>
<dd>
<p>Especifica mapeamentos de p&aacute;ginas personalizadas de erros para o servidor virtual, os quais s&atilde;o herdados por todas as aplica&ccedil;&otilde;es implantadas no servidor virtual. Uma aplica&ccedil;&atilde;o Web pode substituir esses mapeamentos de p&aacute;ginas personalizadas de erros no respectivo descritor de implanta&ccedil;&atilde;o <code>web.xml</code>. O valor de cada propriedade <code>send-error_</code><i>n</i> tem tr&ecirc;s componentes, que podem ser especificados em qualquer ordem:</p>
<ul>
<li>
<p>O primeiro componente, <code>code</code>, especifica o c&oacute;digo de tr&ecirc;s d&iacute;gitos do status de resposta HTTP para o qual a p&aacute;gina de erro personalizada deve ser retornada na resposta.</p>
</li>
<li>
<p>O segundo componente, <code>path</code>, especifica o caminho absoluto ou relativo do sistema de arquivos da p&aacute;gina de erro personalizada. Um caminho relativo de sistema de arquivos &eacute; interpretado como relativo no diret&oacute;rio domain-dir<code>/config</code>.</p>
</li>
<li>
<p>O terceiro componente, <code>reason</code>, &eacute; opcional e especifica o texto da string de motivo (por exemplo, <code>Unauthorized</code> ou <code>Forbidden</code>) a ser retornado.</p>
</li>
</ul>
<p>Por exemplo:</p>
<pre>
&lt;property name="send-error_1"
   value="code=401 path=/myhost/401.html reason=MY-401-REASON"
</pre>
<p>Este exemplo de defini&ccedil;&atilde;o da propriedade faz com que o conte&uacute;do de <code>/myhost/401.html</code> seja retornado com 401 respostas, junto dessa linha de respostas:</p>
<pre>
HTTP/1.1 401 MY-401-REASON
</pre></dd>
<dt><code>redirect_</code><i>n</i></dt>
<dd>
<p>Especifica que uma solicita&ccedil;&atilde;o para um URL antigo seja tratado como uma solicita&ccedil;&atilde;o para um novo URL. Essas propriedades s&atilde;o herdadas por todas as aplica&ccedil;&otilde;es Web implantadas no servidor virtual. O valor de cada propriedade de <code>redirect_</code><i>n</i> tem dois componentes, que podem ser especificados em qualquer ordem:</p>
<ul>
<li>
<p>O primeiro componente, <code>from</code>, especifica o prefixo do URI solicitado cuja correspond&ecirc;ncia deve ser localizada.</p>
</li>
<li>
<p>O segundo componente, <code>url-prefix</code>, especifica o prefixo do novo URL a ser retornado para o cliente. O prefixo <code>from</code> &eacute; simplesmente substitu&iacute;do por esse prefixo de URL.</p>
</li>
</ul>
<p>Por exemplo:</p>
<pre>
&lt;property name="redirect_1" 
  value="from=/dummy url-prefix=http://etude"
</pre></dd>
<dt><code>valve_</code><i>n</i></dt>
<dd>
<p>Especifica um nome de classe totalmente qualificada de uma v&aacute;lvula personalizada, onde <i>n</i> &eacute; um inteiro positivo que permite a especifica&ccedil;&atilde;o de mais de um. A classe da v&aacute;lvula deve implementar a interface <code>org.apache.catalina.Valve</code> do Tomcat ou vers&otilde;es anteriores do GlassFish Server ou da interface <code>org.glassfish.web.valve.GlassFishValve</code> da vers&atilde;o atual do GlassFish Server. Por exemplo:</p>
<pre>
&lt;property name="valve_1"
value="org.glassfish.extension.Valve"
</pre>
<p>Voc&ecirc; pode definir esta propriedade para uma aplica&ccedil;&atilde;o Web espec&iacute;fica. Para obter mais detalhes, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>glassfish-web-app</i> em <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt><code>listener_</code><i>n</i></dt>
<dd>
<p>Especifica um nome de classe totalmente qualificada de um listenter Catalina personalizado, em que <i>n</i> &eacute; um positivo inteiro que permite especificar mais de uma. A classe de listener deve implementar a interface <code>org.apache.catalina.ContainerListener</code> ou <code>org.apache.catalina.LifecycleListener</code>. Por exemplo:</p>
<pre>
&lt;property name="listener_1"
value="org.glassfish.extension.MyLifecycleListener"
</pre>
<p>Voc&ecirc; pode definir esta propriedade para uma aplica&ccedil;&atilde;o Web espec&iacute;fica. Para obter mais detalhes, consulte <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>glassfish-web-app</i> em <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt><code>errorReportValve</code></dt>
<dd>
<p>Especifica um nome de classe totalmente qualificado de uma v&aacute;lvula personalizada que cria p&aacute;ginas de erro default para as aplica&ccedil;&otilde;es deste servidor virtual. Especifique uma string vazia para desativar o mecanismo da p&aacute;gina de erro default deste servidor virtual.</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
