<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-protocolnew" name="ref-protocolnew"></a></p>

<h4><a id="sthref142" name="sthref142"></a>Novo Protocolo</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilize a p&aacute;gina Novo Protocolo para criar um novo protocolo de rede.</p>
<p>Ap&oacute;s criar o protocolo, voc&ecirc; normalmente cria um listener de rede com o mesmo nome, e associa o listener de rede com o protocolo. Como alternativa, voc&ecirc; pode criar um listener de rede e ter um protocolo com defini&ccedil;&otilde;es default ao mesmo tempo.</p>
<p>A p&aacute;gina Novo Protocolo cont&eacute;m estas op&ccedil;&otilde;es.</p>
<dl>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Nome</dt>
<dd>
<p>O nome exclusivo do protocolo. Um nome de protocolo n&atilde;o pode come&ccedil;ar com um n&uacute;mero.</p>
</dd>
<dt>Seguran&ccedil;a</dt>
<dd>
<p>Se essa op&ccedil;&atilde;o for selecionada, a seguran&ccedil;a ser&aacute; ativada para o protocolo. Por default, essa op&ccedil;&atilde;o est&aacute; desativada. Caso voc&ecirc; ative a seguran&ccedil;a, poder&aacute; usar a guia SSL da p&aacute;gina Editar Protocolo para modificar as defini&ccedil;&otilde;es de seguran&ccedil;a.</p>
</dd>
<dt>Status</dt>
<dd>
<p>Se essa op&ccedil;&atilde;o for selecionada, o cache de arquivo ser&aacute; ativado. Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</dd>
<dt>Dura&ccedil;&atilde;o M&aacute;xima</dt>
<dd>
<p>A dura&ccedil;&atilde;o m&aacute;xima, em segundos, de uma entrada de cache v&aacute;lida.</p>
<p>Esse par&acirc;metro controla a quantidade de informa&ccedil;&otilde;es armazenadas no cache que ser&aacute; utilizada ap&oacute;s o armazenamento de um arquivo no cache. Uma entrada mais antiga do que a dura&ccedil;&atilde;o m&aacute;xima ser&aacute; substitu&iacute;da pela nova entrada do mesmo arquivo. Se o conte&uacute;do n&atilde;o for alterado com frequ&ecirc;ncia, aumente esse valor para melhorar o desempenho.</p>
<p>A dura&ccedil;&atilde;o m&aacute;xima mais eficiente depende da regularidade com que os arquivos existentes s&atilde;o modificados. Por exemplo, se os arquivos forem modificados quatro vezes ao dia, em intervalos regulares, considere a possibilidade de definir a dura&ccedil;&atilde;o m&aacute;xima em 21600 segundos (6 horas). Ou ent&atilde;o, defina a dura&ccedil;&atilde;o m&aacute;xima como sendo o tempo mais longo desejado para a exibi&ccedil;&atilde;o da vers&atilde;o anterior de um arquivo ap&oacute;s a modifica&ccedil;&atilde;o.</p>
<p>O valor default &eacute; 30.</p>
</dd>
<dt>Tamanho M&aacute;ximo do Cache</dt>
<dd>
<p>O tamanho total m&aacute;ximo (em bytes) do cache de arquivos, no disco. O valor default &eacute; 10485760.</p>
</dd>
<dt>Contagem M&aacute;xima de Arquivos</dt>
<dd>
<p>O n&uacute;mero m&aacute;ximo de arquivos que podem ser armazenados no cache de arquivos.</p>
<p>Se o valor for muito alto, o servidor armazenar&aacute; no cache os arquivos pouco necess&aacute;rios, o que consome mem&oacute;ria. Se o valor for muito baixo, os benef&iacute;cios do armazenamento no cache n&atilde;o ser&aacute; obtidos. Tente diferentes valores desse atributo para encontrar a solu&ccedil;&atilde;o mais eficiente para aplica&ccedil;&otilde;es espec&iacute;ficas.</p>
<p>O valor default &eacute; 1024.</p>
</dd>
<dt>Nome do Servidor</dt>
<dd>
<p>O nome do host a ser utilizado nas URLs que o servidor envia ao cliente. Esse nome ser&aacute; o nome alias se o servidor usar um alias. Se o servidor n&atilde;o usar alias, deixe o campo em branco.</p>
<p>Esse valor somente afeta os URLs gerados automaticamente pelo servidor; ele n&atilde;o afeta os URLs para diret&oacute;rios e arquivos armazenados no servidor. Caso seu servidor use um alias, o nome do servidor deve ser o nome do alias. Se uma v&iacute;rgula e um n&uacute;mero de porta forem acrescentados, essa porta ser&aacute; usada nos URLs que o servidor envia para o cliente.</p>
</dd>
<dt>Servidor Virtual Default</dt>
<dd>
<p>O servidor virtual a ser associado com esse protocolo. Use a p&aacute;gina Servidores Virtuais para definir servidores virtuais.</p>
</dd>
<dt>Porta de Redirecionamento</dt>
<dd>
<p>Valor de porta que redireciona uma solicita&ccedil;&atilde;o para outra porta. O GlassFish Server redirecionar&aacute; automaticamente a solicita&ccedil;&atilde;o se estas duas condi&ccedil;&otilde;es existirem:</p>
<ul>
<li>
<p>O listener de rede que referencia esse protocolo oferece suporte a solicita&ccedil;&otilde;es n&atilde;o-SSL.</p>
</li>
<li>
<p>Uma solicita&ccedil;&atilde;o &eacute; recebida, e a correspondente restri&ccedil;&atilde;o de seguran&ccedil;a exige transporte SSL.</p>
</li>
</ul>
<p>Se uma porta de redirecionamento n&atilde;o estiver especificada, o GlassFish Server usar&aacute; o n&uacute;mero de porta especificado na solicita&ccedil;&atilde;o original. Por default, nenhuma porta &eacute; especificada.</p>
</dd>
<dt>M&aacute;ximo de Conex&otilde;es</dt>
<dd>
<p>Especifica o n&uacute;mero m&aacute;ximo de solicita&ccedil;&otilde;es que podem colocar na fila at&eacute; que a conex&atilde;o seja fechada pelo servidor. O subsistema Keep-Alive consulta periodicamente as conex&otilde;es ociosas. O valor default &eacute; 256.</p>
<p>Defina esta propriedade para 1 para desativar o keep-alive HTTP/1.0, assim como o keep-alive HTTP/1.1 e pipeline. Um valor de 0 significa que as solicita&ccedil;&otilde;es s&atilde;o sempre rejeitadas. Um valor de -1 indica que n&atilde;o h&aacute; limite para conex&otilde;es keep-alive.</p>
</dd>
<dt>Time-out</dt>
<dd>
<p>A quantidade m&aacute;xima de tempo, em segundos, que uma conex&atilde;o pode permanecer inativa e mantida no estado keep-alive. Um valor de 0 ou menos significa que as conex&otilde;es keep-alive s&atilde;o mantidas abertas indefinidamente. O valor default &eacute; 30 segundos.</p>
</dd>
<dt>Time-out para Upload</dt>
<dd>
<p>Se essa op&ccedil;&atilde;o &eacute; selecionada, a conex&atilde;o para um servlet que l&ecirc; lentamente os bytes seja fechada ap&oacute;s o limite do Time-out para Upload de Conex&atilde;o &eacute; alcan&ccedil;ado. Se essa op&ccedil;&atilde;o for desativada, as conex&otilde;es de servlet n&atilde;o s&atilde;o submetidas a time-out. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Time-out para Upload de Conex&atilde;o</dt>
<dd>
<p>O time-out para uploads em milissegundos. Esse campo s&oacute; se aplicar&aacute; se a caixa de sele&ccedil;&atilde;o Time-out para Upload Ativado estiver marcada. O valor default &eacute; 300.000 milissegundos.</p>
</dd>
<dt>Time-out para Solicita&ccedil;&atilde;o</dt>
<dd>
<p>O n&uacute;mero de segundos antes que a solicita&ccedil;&atilde;o seja submetida a time-out. Se a solicita&ccedil;&atilde;o n&atilde;o for processada antes que o valor do time-out seja alcan&ccedil;ado, a solicita&ccedil;&atilde;o ser&aacute; ignorada. O valor default &eacute; 30 segundos.</p>
</dd>
<dt>Tamanho do Buffer para Envio</dt>
<dd>
<p>O tamanho m&aacute;ximo em bytes do buffer para envio. O valor default &eacute; 8.192 bytes.</p>
</dd>
<dt>Tamanho do Buffer de Cabe&ccedil;alho</dt>
<dd>
<p>O tamanho em bytes do buffer utilizado pelos threads de processamento da solicita&ccedil;&atilde;o para ler os dados da solicita&ccedil;&atilde;o. O valor default &eacute; 8.192 bytes.</p>
</dd>
<dt>Tamanho M&aacute;ximo de Postagem</dt>
<dd>
<p>O tamanho m&aacute;ximo em bytes de a&ccedil;&otilde;es POST. O valor default &eacute; 2.097.152 bytes.</p>
</dd>
<dt>Codifica&ccedil;&atilde;o do URI</dt>
<dd>
<p>O nome do conjunto de caracteres usado para decodificar os URIs de solicita&ccedil;&atilde;o recebidos. O valor precisa ser um nome v&aacute;lido de um conjunto de caracteres IANA. O valor default &eacute; UTF-8.</p>
</dd>
<dt>Vers&atilde;o</dt>
<dd>
<p>A vers&atilde;o do protocolo HTTP usado. O valor default &eacute; HTTP/1.1.</p>
</dd>
<dt>Compacta&ccedil;&atilde;o</dt>
<dd>
<p>Especifica o uso da compacta&ccedil;&atilde;o GZIP HTTP/1.1 para reduzir a largura de banda do servidor. As op&ccedil;&otilde;es dispon&iacute;veis s&atilde;o:</p>
<dl>
<dt><code>on</code></dt>
<dd>
<p>Compacta os dados.</p>
</dd>
<dt><code>off</code></dt>
<dd>
<p>Desativa a compacta&ccedil;&atilde;o.</p>
</dd>
<dt><code>force</code></dt>
<dd>
<p>For&ccedil;a a compacta&ccedil;&atilde;o dos dados em todos os casos.</p>
</dd>
</dl>
<p>O valor default <code>off</code>.</p>
</dd>
<dt>Tipos MIME Compact&aacute;veis</dt>
<dd>
<p>Uma lista separada por v&iacute;rgulas dos tipos MIME para os quais a compacta&ccedil;&atilde;o HTTP &eacute; utilizada. O valor default &eacute; <code>text/html,text/xml,text/plain</code>.</p>
</dd>
<dt>Tamanho M&iacute;nimo de Compacta&ccedil;&atilde;o</dt>
<dd>
<p>O tamanho m&iacute;nimo de um arquivo quando a compacta&ccedil;&atilde;o &eacute; aplicada. Esse valor deve ser definido se a Compacta&ccedil;&atilde;o estiver definida como <code>on</code> ou <code>force</code>. O valor default &eacute; 2.048 bytes.</p>
</dd>
<dt>Agentes de N&atilde;o Compacta&ccedil;&atilde;o do Usu&aacute;rio</dt>
<dd>
<p>Uma lista separada por v&iacute;rgulas de express&otilde;es regulares que coincidem com agentes do usu&aacute;rio ou clientes HTTP, para os quais a compacta&ccedil;&atilde;o n&atilde;o deve ser utilizada. Por default esse valor &eacute; uma string vazia.</p>
</dd>
<dt>Agente de Usu&aacute;rio Restrito</dt>
<dd>
<p>Uma lista de agentes do usu&aacute;rio restrito no qual a compacta&ccedil;&atilde;o HTTP &eacute; aplicada. Se nenhum agente do usu&aacute;rio for especificado, a compacta&ccedil;&atilde;o HTTP ser&aacute; aplicada em todos os agentes do usu&aacute;rio. Por default, nenhum agente do usu&aacute;rio &eacute; especificado.</p>
</dd>
<dt>Tipo de Resposta Default</dt>
<dd>
<p>Uma string que especifica o tipo de resposta default. O formato &eacute; uma string delimitada por pontos e v&iacute;rgulas, consistindo no tipo de conte&uacute;do, codifica&ccedil;&atilde;o, idioma e conjunto de caracteres. O valor default &eacute; <code>text/html; charset=iso-8859-1</code>.</p>
</dd>
<dt>Tipo de Resposta For&ccedil;ada</dt>
<dd>
<p>Uma string que especifica o tipo de solicita&ccedil;&atilde;o usado, caso nenhum mapeamento MIME esteja dispon&iacute;vel que coincida com a extens&atilde;o do arquivo. O formato &eacute; uma string delimitada por pontos e v&iacute;rgulas, consistindo no tipo de conte&uacute;do, codifica&ccedil;&atilde;o, idioma e conjunto de caracteres. O valor default &eacute; <code>text/html; charset=iso-8859-1</code>.</p>
</dd>
<dt>Adaptador</dt>
<dd>
<p>O nome da classe do adaptador de recursos est&aacute;ticos. O valor default &eacute; <code>com.sun.grizzly.tcp.StaticResourcesAdapter</code>.</p>
</dd>
<dt>Suporte a Comet</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o for selecionada, o suporte a Comet ser&aacute; ativado para o listener de rede que referencia este protocolo. Por default, essa op&ccedil;&atilde;o &eacute; desativada. Se o seu servlet ou p&aacute;gina JSP usa a tecnologia Comet, assegure-se de que esteja inicializada quando o GlassFish Server &eacute; iniciado, ao adicionar o elemento <code>load-on-startup</code> em seu arquivo <code>web.xml</code>. Por exemplo:</p>
<pre>
&lt;servlet&gt;
&lt;servlet-name&gt;CheckIn&lt;/servlet-name&gt;
&lt;servlet-class&gt;CheckInServlet&lt;/servlet-class&gt;
&lt;load-on-startup&gt;0&lt;/load-on-startup&gt;
&lt;/servlet&gt;
</pre></dd>
<dt>Pesquisa de DNS</dt>
<dd>
<p>Se essa op&ccedil;&atilde;o for selecionada, a pesquisa de DNS ser&aacute; ativada. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Pesquisa de DNS</dt>
<dd>
<p>Se essa op&ccedil;&atilde;o for selecionada, a pesquisa de DNS ser&aacute; ativada. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Suporte RCM</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o for selecionada, o Gerenciamento de Configura&ccedil;&atilde;o de Recursos (RCM) ser&aacute; ativado. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Rastrear</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o for selecionada, a opera&ccedil;&atilde;o TRACE ser&aacute; ativada. Se essa op&ccedil;&atilde;o for desativada, o GlassFish Server &eacute; menos suscet&iacute;vel ao ataques de scripts de site cruzado. Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</dd>
<dt>Passagem de Autoriza&ccedil;&atilde;o</dt>
<dd>
<p>Se essa op&ccedil;&atilde;o for selecionada, indica que o listener de rede que utiliza esse protocolo recebe tr&aacute;fego de um servidor proxy em que a conex&atilde;o SSL proveniente de um cliente termina no servidor proxy. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Agrupamento</dt>
<dd>
<p>Se essa op&ccedil;&atilde;o for selecionada, a resposta do agrupamento HTTP ser&aacute; ativada. Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</dd>
<dt>XPowered por</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o for selecionada, ser&atilde;o usados cabe&ccedil;alhos de <code>X-Powered-By</code> de acordo com as especifica&ccedil;&otilde;es de Java Servlet 3.0 e Java Server Pages 2.0. Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</dd>
<dt>Barra Codificada</dt>
<dd>
<p>Se essa op&ccedil;&atilde;o for selecionada, ser&aacute; permitido usar URIs para conter barras decodificadas. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Suporte &agrave; Websockets</dt>
<dd>
<p>Se essa op&ccedil;&atilde;o for selecionada, o protocolo de WebSockets &eacute; suportado. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
</dl>
<a id="sthref143" name="sthref143"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-protocolnew.html">Para Criar um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">Para Editar um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">Para Editar Defini&ccedil;&otilde;es de SSL de um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">Para Editar Defini&ccedil;&otilde;es de HTTP de um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocolfilecacheedit.html">Para Editar Defini&ccedil;&otilde;es de Cache do Arquivo de um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">Para Deletar um Protocolo</a></p>
</li>
</ul>
<a id="sthref144" name="sthref144"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00051"><code>create-protocol</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00195"><code>list-protocols</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00103"><code>delete-protocol</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
