<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-transportnew" name="ref-transportnew"></a></p>

<h4><a id="sthref162" name="sthref162"></a>Novo Transporte</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilize a p&aacute;gina Novo Transporte para criar um novo transporte.</p>
<p>N&atilde;o &eacute; comum precisar de outro transporte al&eacute;m do transporte <code>tcp</code> default.</p>
<p>A p&aacute;gina Novo Transporte cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Nome do Transporte</dt>
<dd>
<p>Um nome exclusivo para o transporte.</p>
</dd>
<dt>Nome de classe</dt>
<dd>
<p>O nome da classe da implementa&ccedil;&atilde;o do transporte. O valor default &eacute; <code>com.sun.grizzly.TCPSelectorHandler</code>.</p>
</dd>
<dt>Handler de Chave de Sele&ccedil;&atilde;o</dt>
<dd>
<p>O nome da classe do handler de chave de sele&ccedil;&atilde;o. Um handler de chave de sele&ccedil;&atilde;o &eacute; uma classe abstrata que gerencia o ciclo de vida das chaves de sele&ccedil;&atilde;o. Se voc&ecirc; n&atilde;o especifica um valor, a implementa&ccedil;&atilde;o default &eacute; usada.</p>
</dd>
<dt>Tipo de Buffer de Bytes</dt>
<dd>
<p>O tipo de <code>ByteBuffer</code> a ser usado. As op&ccedil;&otilde;es dispon&iacute;veis s&atilde;o <code>HEAP</code> e <code>DIRECT</code>. O valor default &eacute; <code>HEAP</code>.</p>
</dd>
<dt>Threads do Aceitador</dt>
<dd>
<p>O n&uacute;mero de processadores na m&aacute;quina. Um valor de -1 indica que Grizzly ir&aacute; calcular o n&uacute;mero de threads de quem aceita, com base no n&uacute;mero de processadores na m&aacute;quina. O valor default &eacute; 1.</p>
<p>Para definir o n&uacute;mero de threads de processamento da solicita&ccedil;&atilde;o, defina o valor Tamanho M&aacute;ximo do Pool de Threads usado por um listener de rede que usa este transporte.</p>
</dd>
<dt>Contagem M&aacute;xima de Conex&otilde;es</dt>
<dd>
<p>O n&uacute;mero m&aacute;ximo de conex&otilde;es pendentes em um listener de rede que usa este transporte. O valor default &eacute; 4096.</p>
</dd>
<dt>Tamanho do Buffer</dt>
<dd>
<p>O tamanho em bytes do buffer a ser fornecido para fluxos de entrada criados por um listener de rede que utiliza esse transporte. O valor default &eacute; 8.192.</p>
</dd>
<dt>Time-out para Chave Ociosa</dt>
<dd>
<p>O n&uacute;mero de segundos ap&oacute;s o qual uma chave ociosa ser&aacute; cancelada e o canal ser&aacute; fechado. O valor default &eacute; 30.</p>
</dd>
<dt>Time-out para Leitura</dt>
<dd>
<p>O n&uacute;mero em milissegundos que o GlassFish Server aguarda durante o parsing do cabe&ccedil;alho e corpo da opera&ccedil;&atilde;o de leitura. O valor default &eacute; 30.000.</p>
</dd>
<dt>Time-out para Sondagem do Seletor</dt>
<dd>
<p>O n&uacute;mero em milissegundos que um seletor NIO ser&aacute; bloqueado enquanto aguarda por eventos (solicita&ccedil;&otilde;es de usu&aacute;rios). O valor default &eacute; 1000.</p>
</dd>
<dt>Time-out para Grava&ccedil;&atilde;o</dt>
<dd>
<p>O n&uacute;mero de milissegundos que o &amp;ProductName. aguarda antes de considerar que o cliente remoto desconectou ao gravar a resposta. O valor default &eacute; 30.000.</p>
</dd>
<dt>Configura&ccedil;&atilde;o de Exibi&ccedil;&atilde;o</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o &eacute; selecionada, a configura&ccedil;&atilde;o interna do Grizzly &eacute; esvaziada nos registros do servidor. Essa op&ccedil;&atilde;o pode fornecer informa&ccedil;&otilde;es &uacute;teis para a depura&ccedil;&atilde;o. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Rastreamento</dt>
<dd>
<p>Se esta op&ccedil;&atilde;o for selecionada, a informa&ccedil;&atilde;o de solicita&ccedil;&atilde;o/resposta ser&aacute; submetida a dump no log do servidor. Essa op&ccedil;&atilde;o pode fornecer informa&ccedil;&otilde;es &uacute;teis para a depura&ccedil;&atilde;o, mas ir&aacute; reduzir significativamente o desempenho. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Sem Atraso de TCP</dt>
<dd>
<p>Se essa op&ccedil;&atilde;o for selecionada, TCP_NODELAY (tamb&eacute;m chamado de Nagle) ser&aacute; ativado. Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</dd>
</dl>
<a id="sthref163" name="sthref163"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-transportnew.html">Para Criar um Transporte</a></p>
</li>
<li>
<p><a href="task-transportedit.html">Para Editar um Transporte</a></p>
</li>
<li>
<p><a href="task-transportdelete.html">Para Deletar um Transporte</a></p>
</li>
</ul>
<a id="sthref164" name="sthref164"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00061"><code>create-transport</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00206"><code>list-transports</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00112"><code>delete-transport</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
