<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-sessionproptab" name="ref-sessionproptab"></a></p>

<h4><a id="sthref86" name="sthref86"></a><a id="sthref87" name="sthref87"></a><a id="sthref88" name="sthref88"></a>Propriedades da Sess&atilde;o</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Propriedades da Sess&atilde;o para adicionar ou modificar propriedades da sess&atilde;o de cont&ecirc;iner Web.</p>
<p>A p&aacute;gina Propriedades da Sess&atilde;o cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Carregar Defaults</dt>
<dd>
<p>Bot&atilde;o para restaurar defini&ccedil;&otilde;es para seus valores default. Defini&ccedil;&otilde;es que n&atilde;o tiveram seus valores default alterados.</p>
</dd>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Time-out para Sess&atilde;o</dt>
<dd>
<p>Especifica o n&uacute;mero m&aacute;ximo de segundos durante o qual uma sess&atilde;o inativa &eacute; v&aacute;lida. Se o valor &eacute; definido como 0, a sess&atilde;o nunca expirar&aacute;. O valor default &eacute; 1.800.</p>
</dd>
<dt>Propriedades Adicionais</dt>
<dd>
<p>Propriedades adicionais das sess&otilde;es de cont&ecirc;iner Web. Para obter uma descri&ccedil;&atilde;o das propriedades dispon&iacute;veis, consulte <a href="ref-websessionproperties.html">Propriedades Espec&iacute;ficas para as Sess&otilde;es de Cont&ecirc;iner Web</a>.</p>
</dd>
</dl>
<a id="sthref89" name="sthref89"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-webcontainergeneral.html">Para Configurar Propriedades Gerais do Cont&ecirc;iner Web</a></p>
</li>
<li>
<p><a href="task-webcontainersessiontimeout.html">Para Configurar Propriedades da Sess&atilde;o para o Cont&ecirc;iner Web</a></p>
</li>
<li>
<p><a href="task-webcontainermanagerprops.html">Para Configurar Propriedades do Gerenciador para o Cont&ecirc;iner Web</a></p>
</li>
<li>
<p><a href="task-webcontainerstoreprops.html">Para Configurar Propriedades de Armazenamento para o Cont&ecirc;iner Web</a></p>
</li>
<li>
<p><a href="task-webcontaineravailability.html">Para Configurar as Defini&ccedil;&otilde;es de Disponibilidade do Cont&ecirc;iner Web</a></p>
</li>
</ul>
<a id="sthref90" name="sthref90"></a>
<h5>Comandos asadmin Relacionados</h5>
<p>Nenhum.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
