<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-protocolfilecacheedit" name="ref-protocolfilecacheedit"></a></p>

<h4><a id="sthref156" name="sthref156"></a><a id="sthref157" name="sthref157"></a>Cache de Arquivos</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Arquivo de Cache para modificar as defini&ccedil;&otilde;es do arquivo de cache para um protocolo de rede.</p>
<p>A p&aacute;gina Cache de Arquivos cont&eacute;m as seguintes op&ccedil;&otilde;es:</p>
<dl>
<dt>Carregar Defaults</dt>
<dd>
<p>Bot&atilde;o para restaurar defini&ccedil;&otilde;es para seus valores default. Defini&ccedil;&otilde;es que n&atilde;o tiveram seus valores default alterados.</p>
</dd>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Nome do Protocolo</dt>
<dd>
<p>O nome do protocolo. O campo Nome do Protocolo &eacute; somente para leitura. Voc&ecirc; s&oacute; pode especificar o nome quando cria um novo protocolo.</p>
</dd>
<dt>Status</dt>
<dd>
<p>Se essa op&ccedil;&atilde;o for selecionada o status do cache de arquivo ser&aacute; ativado. Por default, essa op&ccedil;&atilde;o est&aacute; selecionada.</p>
</dd>
<dt>Dura&ccedil;&atilde;o M&aacute;xima</dt>
<dd>
<p>A dura&ccedil;&atilde;o m&aacute;xima, em segundos, de uma entrada de cache v&aacute;lida.</p>
<p>Esse par&acirc;metro controla a quantidade de informa&ccedil;&otilde;es armazenadas no cache que ser&aacute; utilizada ap&oacute;s o armazenamento de um arquivo no cache. Uma entrada mais antiga do que a dura&ccedil;&atilde;o m&aacute;xima ser&aacute; substitu&iacute;da pela nova entrada do mesmo arquivo. Se o conte&uacute;do n&atilde;o for alterado com frequ&ecirc;ncia, aumente esse valor para melhorar o desempenho.</p>
<p>A dura&ccedil;&atilde;o m&aacute;xima mais eficiente depende da regularidade com que os arquivos existentes s&atilde;o modificados. Por exemplo, se os arquivos forem modificados quatro vezes ao dia, em intervalos regulares, considere a possibilidade de definir a dura&ccedil;&atilde;o m&aacute;xima em 21600 segundos (6 horas). Ou ent&atilde;o, defina a dura&ccedil;&atilde;o m&aacute;xima como sendo o tempo mais longo desejado para a exibi&ccedil;&atilde;o da vers&atilde;o anterior de um arquivo ap&oacute;s a modifica&ccedil;&atilde;o.</p>
<p>O valor default &eacute; 30.</p>
</dd>
<dt>Tamanho M&aacute;ximo do Cache</dt>
<dd>
<p>O tamanho total m&aacute;ximo (em bytes) do cache de arquivos, no disco. O valor default &eacute; 10485760.</p>
</dd>
<dt>Contagem M&aacute;xima de Arquivos</dt>
<dd>
<p>O n&uacute;mero m&aacute;ximo de arquivos que podem ser armazenados no cache de arquivos.</p>
<p>Se o valor for muito alto, o servidor armazenar&aacute; no cache os arquivos pouco necess&aacute;rios, o que consome mem&oacute;ria. Se o valor for muito baixo, os benef&iacute;cios do armazenamento no cache n&atilde;o ser&aacute; obtidos. Tente diferentes valores desse atributo para encontrar a solu&ccedil;&atilde;o mais eficiente para aplica&ccedil;&otilde;es espec&iacute;ficas.</p>
<p>O valor default &eacute; 1024.</p>
</dd>
</dl>
<a id="sthref158" name="sthref158"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-protocolnew.html">Para Criar um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">Para Editar um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">Para Editar Defini&ccedil;&otilde;es de SSL de um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">Para Editar Defini&ccedil;&otilde;es de HTTP de um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocolfilecacheedit.html">Para Editar Defini&ccedil;&otilde;es de Cache do Arquivo de um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">Para Deletar um Protocolo</a></p>
</li>
</ul>
<a id="sthref159" name="sthref159"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00051"><code>create-protocol</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00195"><code>list-protocols</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00103"><code>delete-protocol</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
