<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-httpserviceprops" name="ref-httpserviceprops"></a><a id="GHWEB00009" name="GHWEB00009"></a></p>

<h4><a id="sthref107" name="sthref107"></a><a id="sthref108" name="sthref108"></a>Propriedades Espec&iacute;ficas para o Servi&ccedil;o HTTP</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>As propriedades adicionais a seguir est&atilde;o dispon&iacute;veis para o servi&ccedil;o HTTP. Se voc&ecirc; especificar essas propriedades, elas se aplicar&atilde;o a todos <a href="ref-group-networklisteners.html">Listeners de Rede</a>.</p>
<dl>
<dt><code>ssl-cache-entriese</code></dt>
<dd>
<p>O n&uacute;mero se sess&otilde;es SSL a serem armazenadas no cache. O valor default &eacute; 10.000.</p>
</dd>
<dt><code>ssl3-session-timeout</code></dt>
<dd>
<p>O intervalo no qual as sess&otilde;es SSL3 s&atilde;o armazenadas no cache. O valor default &eacute; 86.400.</p>
</dd>
<dt><code>ssl-session-timeout</code></dt>
<dd>
<p>O intervalo no qual as sess&otilde;es SSL2 s&atilde;o armazenadas no cache. O valor default &eacute; 100.</p>
</dd>
<dt><code>proxyHandler</code></dt>
<dd>
<p>O nome da classe totalmente qualificada de uma implementa&ccedil;&atilde;o personalizada da classe abstrata <code>com.sun.appserv.ProxyHandler</code> que permite uma inst&acirc;ncia back-end do GlassFish Server, para recuperar informa&ccedil;&otilde;es sobre a solicita&ccedil;&atilde;o original do cliente que foi interceptada por um servidor proxy em que a conex&atilde;o SSL proveniente do cliente termina no servidor proxy (por exemplo, um balanceador de carga). Uma implementa&ccedil;&atilde;o desta classe abstrata inspeciona um determinado cabe&ccedil;alho de solicita&ccedil;&atilde;o do cliente, atrav&eacute;s da qual o proxy do servidor comunica as informa&ccedil;&otilde;es sobre a solicita&ccedil;&atilde;o original do cliente para a inst&acirc;ncia do Enterprise Server, e retorna aquela informa&ccedil;&atilde;o para seu chamador.</p>
<p>A implementa&ccedil;&atilde;o default l&ecirc; o endere&ccedil;o IP do cliente de um cabe&ccedil;alho de solicita&ccedil;&atilde;o HTTP denominado <code>Proxy-ip</code>, o <code>keysize</code> do SSL de um cabe&ccedil;alho de solicita&ccedil;&atilde;o denominado <code>Proxy-keysize</code>, e o certificado do cliente SSL de um cabe&ccedil;alho de solicita&ccedil;&atilde;o HTTP denominado <code>Proxy-auth-cert</code>. O valor <code>Proxy-auth-cert</code> deve conter a cadeia de certificados do cliente codificados por BASE-64 sem os limites <code>BEGIN CERTIFICATE</code> e <code>END CERTIFICATE</code> e com <code>\n</code> substitu&iacute;do por <code>% d% a</code>.</p>
<p>Essa defini&ccedil;&atilde;o s&oacute; ser&aacute; utilizada se a caixa de sele&ccedil;&atilde;o Passagem de Autoriza&ccedil;&atilde;o para a p&aacute;gina HTTP do protocolo do listener de rede est&aacute; definida como verdadeira.</p>
</dd>
<dt><code>connectionTimeout</code></dt>
<dd>
<p>Especifica o n&uacute;mero de segundos aguardados pelos listeners de rede, ap&oacute;s aceitar a conex&atilde;o, pela apresenta&ccedil;&atilde;o de linha URI de solicita&ccedil;&atilde;o. O valor default &eacute; 30.</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
