<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-storeproptab" name="ref-storeproptab"></a><a id="GHWEB00007" name="GHWEB00007"></a></p>

<h4><a id="sthref98" name="sthref98"></a><a id="sthref99" name="sthref99"></a><a id="sthref100" name="sthref100"></a>Propriedades de Armazenamento</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Propriedades de Armazenamento para adicionar ou modificar propriedades da persist&ecirc;ncia da sess&atilde;o (armazenamento) para o cont&ecirc;iner Web.</p>
<p>A p&aacute;gina Propriedades de Armazenamento cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Diret&oacute;rio</dt>
<dd>
<p>O nome do caminho absoluto ou relativo do diret&oacute;rio no qual os arquivos individuais da sess&atilde;o s&atilde;o gravados. O valor default &eacute; domain-dir<code>/generated/jsp/j2ee-apps/</code><i>appname</i><code>/</code><i>appname</i><code>_war</code>. Um caminho relativo para o diret&oacute;rio tempor&aacute;rio de trabalho para esta aplica&ccedil;&atilde;o Web.</p>
</dd>
<dt>Propriedades Adicionais</dt>
<dd>
<p>Propriedades adicionais do armazenamento. O GlassFish Server n&atilde;o define propriedades adicionais para o armazenamento.</p>
</dd>
</dl>
<a id="sthref101" name="sthref101"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-webcontainergeneral.html">Para Configurar Propriedades Gerais do Cont&ecirc;iner Web</a></p>
</li>
<li>
<p><a href="task-webcontainersessiontimeout.html">Para Configurar Propriedades da Sess&atilde;o para o Cont&ecirc;iner Web</a></p>
</li>
<li>
<p><a href="task-webcontainermanagerprops.html">Para Configurar Propriedades do Gerenciador para o Cont&ecirc;iner Web</a></p>
</li>
<li>
<p><a href="task-webcontainerstoreprops.html">Para Configurar Propriedades de Armazenamento para o Cont&ecirc;iner Web</a></p>
</li>
<li>
<p><a href="task-webcontaineravailability.html">Para Configurar as Defini&ccedil;&otilde;es de Disponibilidade do Cont&ecirc;iner Web</a></p>
</li>
</ul>
<a id="sthref102" name="sthref102"></a>
<h5>Comandos asadmin Relacionados</h5>
<p>Nenhum.</p>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
