<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-networklisteneredit" name="task-networklisteneredit"></a></p>

<h4><a id="sthref44" name="sthref44"></a>Para Editar um Listener de Rede</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&atilde;o.</p>
</li>
<li>
<p>No n&oacute; Configura&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&atilde;o da Rede.</p>
</li>
<li>
<p>No n&oacute; Config da Rede, selecione o n&oacute; Listeners de Rede.</p>
<p>A p&aacute;gina Listeners de Rede ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Listeners de Rede, clique no nome do listener de rede que est&aacute; editando.</p>
<p>A p&aacute;gina Editar Listener de Rede ser&aacute; aberta.</p>
</li>
<li>
<p>Selecione o Protocolo usado pelo listener de rede para alterar suas defini&ccedil;&otilde;es. Por exemplo, voc&ecirc; pode ativar seguran&ccedil;a. N&atilde;o &eacute; poss&iacute;vel escolher um protocolo diferente.</p>
</li>
<li>
<p>Marque ou desmarque a caixa de sele&ccedil;&atilde;o Status Ativado para alterar o status do listener de rede.</p>
<p>O listener pode ser ativado ou desativado. Por default, a op&ccedil;&atilde;o est&aacute; ativada. Se o listener estiver desativado, qualquer tentativa de conectar ao listener resulta em uma exce&ccedil;&atilde;o de soquete (<code>java.net.ConnectException</code>).</p>
</li>
<li>
<p>A caixa de sele&ccedil;&atilde;o somente para leitura Seguran&ccedil;a Ativada indica se a seguran&ccedil;a est&aacute; ativada para o protocolo usado pelo listener de rede.</p>
<p>Se voc&ecirc; estiver configurando o <code>admin-listener</code> para o servidor de administra&ccedil;&atilde;o de dom&iacute;nios (DAS), que usa a configura&ccedil;&atilde;o <code>server-config</code>, esta op&ccedil;&atilde;o ser&aacute; somente para leitura. Para ativar a seguran&ccedil;a deste listener, &eacute; necess&aacute;rio ativar a administra&ccedil;&atilde;o segura. Consulte <a href="../../../common/en/help/ref-securityadmin.html">Administra&ccedil;&atilde;o Segura</a>.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Listener JK ativado para especificar que o listener suporta o protocolo <code>mod-jk</code> do Apache.</p>
<p>O protocolo <code>mod-jk</code> &eacute; um protocolo propriet&aacute;rio de comunica&ccedil;&atilde;o/rede entre o <code>httpd</code> do Apache (servidor da web) e uma inst&acirc;ncia de back-end do GlassFish Server. Se o listener oferecer suporte a esse protocolo, o <code>httpd</code> dever&aacute; tratar todo o conte&uacute;do est&aacute;tico, enquanto as solicita&ccedil;&otilde;es por recursos din&acirc;micos (ou seja, Servlets e JSPs) ser&atilde;o roteadas para o listener de rede ativado por <code>mod-jk</code> do GlassFish Server, utilizando o protocolo <code>mod-jk</code>. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>No campo Porta, digite o n&uacute;mero da porta do listener de rede.</p>
<p>Os valores v&aacute;lidos s&atilde;o 1 a 65.535. Em sistemas UNIX, criar soquetes que fazem listening nas portas 1 - 1024 exige privil&eacute;gios de superusu&aacute;rio.</p>
</li>
<li>
<p>No campo Endere&ccedil;o, digite o endere&ccedil;o IP do listener de rede.</p>
<p>O endere&ccedil;o pode estar na nota&ccedil;&atilde;o de par de pontos ou IPv6. Pode ser <code>qualquer</code> (para <code>INADDR_ANY</code>) para fazer listening em todos os endere&ccedil;os IP. Ele pode ser um nome de host.</p>
</li>
<li>
<p>Na lista drop-down Pool de Threads, selecione o pool de threads a ser associado ao listener de rede.</p>
</li>
<li>
<p>Clique em Salvar.</p>

<hr>
<p><b>Dica:</b></p>
Para voltar &agrave;s defini&ccedil;&otilde;es default, clique no bot&atilde;o Carregar Defaults e depois em Salvar.
<hr>

</li>
</ol>
<a id="sthref45" name="sthref45"></a>
<h5>Pr&oacute;ximas Etapas</h5>
<p>Voc&ecirc; pode usar as guias SSL, HTTP e Cache de Arquivos para editar as defini&ccedil;&otilde;es para o protocolo associado ao listener de rede. A guia SSL somente &eacute; significativa se voc&ecirc; tiver ativado a seguran&ccedil;a para o protocolo.</p>
<a id="sthref46" name="sthref46"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-networklistenernew.html">Para Criar um Listener de Rede</a></p>
</li>
<li>
<p><a href="task-networklistenerdelete.html">Para Deletar um Listener de Rede</a></p>
</li>
<li>
<p><a href="task-protocolnew.html">Para Criar um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">Para Editar um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">Para Editar Defini&ccedil;&otilde;es de SSL de um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">Para Editar Defini&ccedil;&otilde;es de HTTP de um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocolfilecacheedit.html">Para Editar Defini&ccedil;&otilde;es de Cache do Arquivo de um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">Para Deletar um Protocolo</a></p>
</li>
<li>
<p><a href="task-transportnew.html">Para Criar um Transporte</a></p>
</li>
<li>
<p><a href="task-transportedit.html">Para Editar um Transporte</a></p>
</li>
<li>
<p><a href="task-transportdelete.html">Para Deletar um Transporte</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
