<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-httplisteneredit" name="task-httplisteneredit"></a></p>

<h4><a id="sthref26" name="sthref26"></a>Para Editar um Listener HTTP</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&atilde;o.</p>
</li>
<li>
<p>No n&oacute; Configura&ccedil;&atilde;o, expanda o n&oacute; Servi&ccedil;o HTTP.</p>
</li>
<li>
<p>No n&oacute; Configura&ccedil;&atilde;o de Rede, selecione o n&oacute; Listeners HTTP.</p>
<p>A p&aacute;gina Listeners HTTP ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Listeners HTTP, clique no nome do listener HTTP que voc&ecirc; estiver editando.</p>
<p>A p&aacute;gina Editar Listener HTTP ser&aacute; aberta.</p>
</li>
<li>
<p>No campo Porta, digite o n&uacute;mero da porta na qual o listener HTTP far&aacute; o listening.</p>
<p>Os valores v&aacute;lidos s&atilde;o 1 a 65.535. Em sistemas UNIX, criar soquetes que fazem listening nas portas 1 - 1024 exige privil&eacute;gios de superusu&aacute;rio.</p>
</li>
<li>
<p>Marque ou desmarque a caixa de sele&ccedil;&atilde;o Status Ativado para alterar o status do listener HTTP.</p>
<p>O listener pode ser ativado ou desativado. Por default, a op&ccedil;&atilde;o est&aacute; ativada. Se o listener estiver desativado, qualquer tentativa de conectar ao listener resulta em uma exce&ccedil;&atilde;o de soquete (<code>java.net.ConnectException</code>).</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Seguran&ccedil;a Ativada para ativar a seguran&ccedil;a para o listener HTTP.</p>
<p>Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
<p>Se voc&ecirc; estiver configurando o <code>admin-listener</code> para o servidor de administra&ccedil;&atilde;o de dom&iacute;nios (DAS), que usa a configura&ccedil;&atilde;o <code>server-config</code>, esta op&ccedil;&atilde;o ser&aacute; somente para leitura. Para ativar a seguran&ccedil;a deste listener, &eacute; necess&aacute;rio ativar a administra&ccedil;&atilde;o segura. Consulte <a href="../../../common/en/help/ref-securityadmin.html">Administra&ccedil;&atilde;o Segura</a>.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Listener JK ativado para especificar que o listener suporta o protocolo <code>mod-jk</code> do Apache.</p>
<p>O protocolo <code>mod-jk</code> &eacute; um protocolo propriet&aacute;rio de comunica&ccedil;&atilde;o/rede entre o <code>httpd</code> do Apache (servidor da web) e uma inst&acirc;ncia de back-end do GlassFish Server. Se o listener suportar este protocolo, <code>httpd</code> dever&aacute; suportar todo o conte&uacute;do est&aacute;tico, enquanto qualquer solicita&ccedil;&atilde;o de recurso din&acirc;mico (ou seja, Servlets e JSPs) s&atilde;o roteados para o listener HTTP ativado do <code>mod-jk</code> do &amp;Productname;, usando o protocolo <code>mod-jk</code>. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>No campo Endere&ccedil;o, digite o endere&ccedil;o IP no qual o listener HTTP far&aacute; o listening.</p>
<p>O endere&ccedil;o pode estar na nota&ccedil;&atilde;o de par de pontos ou IPv6. Pode ser <code>qualquer</code> (para <code>INADDR_ANY</code>) para fazer listening em todos os endere&ccedil;os IP. Ele pode ser um nome de host.</p>
</li>
<li>
<p>Na lista drop-down Servidor Virtual Default, selecione o servidor virtual a ser associado a este listener HTTP.</p>
<p>Use a p&aacute;gina Servidores Virtuais para definir servidores virtuais.</p>
</li>
<li>
<p>Na lista drop-down Pool de Threads, selecione o pool de threads a ser associado ao listener HTTP.</p>
<p>Normalmente, voc&ecirc; seleciona um dos dois pool de threads que est&atilde;o configurados quando o GlassFish Server &eacute; instalado.</p>
</li>
<li>
<p>No campo Nome do Servidor, digite o nome do host a ser usado nas URLs que o servidor envia para o cliente.</p>
<p>Esse nome ser&aacute; o nome alias se o servidor usar um alias. Se o servidor n&atilde;o usar alias, deixe o campo em branco.</p>
<p>Esse valor somente afeta os URLs gerados automaticamente pelo servidor; ele n&atilde;o afeta os URLs para diret&oacute;rios e arquivos armazenados no servidor. Caso seu servidor use um alias, o nome do servidor deve ser o nome do alias. Se uma v&iacute;rgula e um n&uacute;mero de porta forem acrescentados, essa porta ser&aacute; usada nos URLs que o servidor envia para o cliente.</p>
</li>
<li>
<p>Clique em Salvar.</p>

<hr>
<p><b>Dica:</b></p>
Para voltar &agrave;s defini&ccedil;&otilde;es default, clique no bot&atilde;o Carregar Defaults e depois em Salvar.
<hr>

</li>
</ol>
<a id="sthref27" name="sthref27"></a>
<h5>Pr&oacute;ximas Etapas</h5>
<p>Caso voc&ecirc; tenha ativado a seguran&ccedil;a para o listener HTTP, poder&aacute; usar a guia SSL para editar as defini&ccedil;&otilde;es de SSL do listener HTTP.</p>
<p>Um listener HTTP &eacute; um tipo de listener de rede. Para acessar recursos avan&ccedil;ados, voc&ecirc; pode editar o listener HTTP usando as p&aacute;ginas do Listener de Rede.</p>
<a id="sthref28" name="sthref28"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-httplistenernew.html">Para Criar um Listener HTTP</a></p>
</li>
<li>
<p><a href="task-httplistenerdelete.html">Para Deletar um Listener HTTP</a></p>
</li>
<li>
<p><a href="task-httplistenerssl.html">Para Editar Defini&ccedil;&otilde;es SSL de um Listener HTTP</a></p>
</li>
<li>
<p><a href="task-virtualservercreate.html">Para Criar um Servidor Virtual</a></p>
</li>
<li>
<p><a href="task-networklistenernew.html">Para Criar um Listener de Rede</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">Para Editar Defini&ccedil;&otilde;es de HTTP de um Protocolo</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
