<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-webcontaineravailability" name="task-webcontaineravailability"></a></p>

<h4><a id="sthref16" name="sthref16"></a><a id="sthref17" name="sthref17"></a><a id="sthref18" name="sthref18"></a><a id="sthref19" name="sthref19"></a>Para Configurar as Defini&ccedil;&otilde;es de Disponibilidade do Cont&ecirc;iner Web</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&atilde;o.</p>
</li>
<li>
<p>Selecione a configura&ccedil;&atilde;o que est&aacute; sendo alterada.</p>
</li>
<li>
<p>No n&oacute; da configura&ccedil;&atilde;o, selecione o n&oacute; Servi&ccedil;o de Disponibilidade.</p>
<p>A p&aacute;gina Servi&ccedil;o de Disponibilidade ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Servi&ccedil;o de Disponibilidade, clique na guia Disponibilidade do Cont&ecirc;iner Web.</p>
<p>A p&aacute;gina Disponibilidade do Cont&ecirc;iner Web ser&aacute; aberta.</p>
</li>
<li>
<p>No campo Servi&ccedil;o de Disponibilidade, marque a caixa Ativado para ativar a disponibilidade do cont&ecirc;iner Web.</p>
<p>Para desativar a disponibilidade, desmarque a caixa Servi&ccedil;o de Disponibilidade Ativado.</p>
</li>
<li>
<p>Na lista drop-down Tipo de Persist&ecirc;ncia, selecione o mecanismo de persist&ecirc;ncia.</p>
<ul>
<li>
<p>Se Servi&ccedil;o de Disponibilidade Ativado <i>n&atilde;o</i> estiver marcado, selecione uma das seguintes op&ccedil;&otilde;es:</p>
<ul>
<li>
<p><code>memory</code> para nenhuma persist&ecirc;ncia de sess&atilde;o</p>
</li>
<li>
<p><code>file</code> para persist&ecirc;ncia de sess&atilde;o com base no sistema de arquivos que n&atilde;o est&aacute; altamente dispon&iacute;vel</p>
</li>
</ul>
</li>
<li>
<p>Se a op&ccedil;&atilde;o Servi&ccedil;o de Disponibilidade Ativado estiver marcada, selecione <code>replicated</code> para persist&ecirc;ncia de sess&atilde;o com base no failover do cluster que est&aacute; altamente dispon&iacute;vel.</p>
</li>
</ul>
</li>
<li>
<p>Na lista drop-down Frequ&ecirc;ncia da Persist&ecirc;ncia, selecione a frequ&ecirc;ncia na qual a sess&atilde;o HTTP ser&aacute; armazenada:</p>
<ul>
<li>
<p><code>web-method</code> &mdash; O estado da sess&atilde;o &eacute; armazenado no final de cada solicita&ccedil;&atilde;o, antes do envio de uma resposta para o cliente. Este modo oferece a melhor garantia de que o estado da sess&atilde;o estar&aacute; totalmente atualizado em caso de falha. Esse &eacute; o default.</p>
</li>
</ul>
<p>A Frequ&ecirc;ncia da Persist&ecirc;ncia s&oacute; &eacute; aplic&aacute;vel se o tipo de persist&ecirc;ncia for <code>replicated</code>.</p>
</li>
<li>
<p>Na lista drop-down Escopo da Persist&ecirc;ncia, selecione as altera&ccedil;&otilde;es do escopo da sess&atilde;o HTTP necess&aacute;rias para que o armazenamento ocorra:</p>
<ul>
<li>
<p><code>session</code> &mdash; O estado da sess&atilde;o inteira &eacute; sempre armazenado. Este modo oferece a melhor garantia de que os dados da sess&atilde;o sejam corretamente armazenados em qualquer aplica&ccedil;&atilde;o Web distribu&iacute;vel.</p>
</li>
<li>
<p><code>modified-session</code> &mdash; O estado da sess&atilde;o inteira ser&aacute; armazenado se ela tiver sido modificada. Uma sess&atilde;o &eacute; considerada modificada caso <code>HttpSession.setAttribute()</code> ou <code>HttpSession.removeAttribute()</code> tenha sido chamado. Certifique-se de chamar <code>setAttribute()</code> sempre que um atributo for alterado. N&atilde;o se trata de um requisito da especifica&ccedil;&atilde;o Java EE, mas sim uma necessidade para que este modo funcione corretamente.</p>
</li>
<li>
<p><code>modified-attribute</code> &mdash; Somente os atributos modificados da sess&atilde;o ser&atilde;o armazenados. Para que esse modo funcione corretamente, &eacute; necess&aacute;rio seguir estas diretrizes:</p>
<ul>
<li>
<p>Chame <code>setAttribute()</code> sempre que o estado da sess&atilde;o for modificado.</p>
</li>
<li>
<p>Certifique-se de que n&atilde;o haja refer&ecirc;ncias cruzadas entre os atributos. O gr&aacute;fico do objeto em cada chave de atributo diferente &eacute; serializado e armazenado separadamente. Se houver quaisquer refer&ecirc;ncias cruzadas do objeto entre os objetos em cada chave diferente, eles n&atilde;o s&atilde;o serializados e desserializados corretamente.</p>
</li>
<li>
<p>Distribua o estado da sess&atilde;o em muitos atributos ou, pelo menos, entre um atributo somente para leitura e um atributo modific&aacute;vel.</p>
</li>
</ul>
</li>
</ul>
<p>O Escopo da Persist&ecirc;ncia se aplica somente se o Tipo de Persist&ecirc;ncia for <code>replicated</code>.</p>
</li>
<li>
<p>No campo Estado de Sign-on &Uacute;nico, marque a caixa Ativado para tornar o estado de sign-on &uacute;nico dispon&iacute;vel para failover.</p>
<p>Para que o estado de sign-on &uacute;nico n&atilde;o esteja dispon&iacute;vel para failover, remova a marca da caixa Estado de Sign-on &Uacute;nico.</p>
</li>
<li>
<p>Para restaurar os valores default de todas as defini&ccedil;&otilde;es, clique no bot&atilde;o Carregar Defaults.</p>
</li>
<li>
<p>Na se&ccedil;&atilde;o Propriedades Adicionais, especifique as propriedades adicionais.</p>
<p>O GlassFish Server n&atilde;o define nenhuma propriedade adicional da disponibilidade do cont&ecirc;iner Web.</p>
<ul>
<li>
<p>Para adicionar uma propriedade, clique no bot&atilde;o Adicionar Propriedade. Na linha em branco que for exibida, digite o nome da propriedade no campo Nome e digite o valor da propriedade no campo Valor.</p>
</li>
<li>
<p>Para modificar uma propriedade, edite o campo Valor da propriedade.</p>
</li>
<li>
<p>Para deletar uma propriedade, marque a caixa de sele&ccedil;&atilde;o &agrave; esquerda do campo Nome da Propriedade a ser deletada. Clique no bot&atilde;o Deletar Propriedades.</p>
</li>
</ul>
</li>
<li>
<p>Clique em Salvar.</p>
</li>
</ol>
<a id="sthref20" name="sthref20"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-webcontainergeneral.html">Para Configurar Propriedades Gerais do Cont&ecirc;iner Web</a></p>
</li>
<li>
<p><a href="task-webcontainersessiontimeout.html">Para Configurar Propriedades da Sess&atilde;o para o Cont&ecirc;iner Web</a></p>
</li>
<li>
<p><a href="task-webcontainermanagerprops.html">Para Configurar Propriedades do Gerenciador para o Cont&ecirc;iner Web</a></p>
</li>
<li>
<p><a href="task-webcontainerstoreprops.html">Para Configurar Propriedades de Armazenamento para o Cont&ecirc;iner Web</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
