<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-transportedit" name="task-transportedit"></a></p>

<h4><a id="sthref69" name="sthref69"></a>Para Editar um Transporte</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&atilde;o.</p>
</li>
<li>
<p>No n&oacute; Configura&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&atilde;o da Rede.</p>
</li>
<li>
<p>No n&oacute; Config da Rede, selecione o n&oacute; Transportes.</p>
<p>A p&aacute;gina Transportes ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Transportes, clique no nome do transporte a ser editado.</p>
<p>A p&aacute;gina Editar Transporte ser&aacute; aberta.</p>
</li>
<li>
<p>No campo Nome de classe, digite o nome de classe da implementa&ccedil;&atilde;o de transporte.</p>
<p>O valor default &eacute; <code>com.sun.grizzly.TCPSelectorHandler</code>.</p>
</li>
<li>
<p>No campo Handler de Chave de Sele&ccedil;&atilde;o, digite o nome da classe de um handler de chave de sele&ccedil;&atilde;o.</p>
<p>O nome da classe do handler de chave de sele&ccedil;&atilde;o. Um handler de chave de sele&ccedil;&atilde;o &eacute; uma classe abstrata que gerencia o ciclo de vida das chaves de sele&ccedil;&atilde;o. Se voc&ecirc; n&atilde;o especifica um valor, a implementa&ccedil;&atilde;o default &eacute; usada.</p>
</li>
<li>
<p>Na lista drop-down Tipo de Buffer de Bytes, selecione o tipo de <code>ByteBuffer</code> a ser usado.</p>
<p>As op&ccedil;&otilde;es dispon&iacute;veis s&atilde;o <code>HEAP</code> e <code>DIRECT</code>. O valor default &eacute; <code>HEAP</code>.</p>
</li>
<li>
<p>No campo Threads do Aceitador, digite o n&uacute;mero de processadores na m&aacute;quina.</p>
<p>Um valor de -1 indica que Grizzly ir&aacute; calcular o n&uacute;mero de threads de quem aceita, com base no n&uacute;mero de processadores na m&aacute;quina. O valor default &eacute; 1.</p>
<p>Para definir o n&uacute;mero de threads de processamento da solicita&ccedil;&atilde;o, defina o valor Tamanho M&aacute;ximo do Pool de Threads usado por um listener de rede que usa este transporte.</p>
</li>
<li>
<p>No campo Contagem M&aacute;xima de Conex&otilde;es, digite o n&uacute;mero m&aacute;ximo de conex&otilde;es pendentes em um listener de rede que usa este transporte.</p>
<p>O valor default &eacute; 4096.</p>
</li>
<li>
<p>No campo Tamanho do Buffer, digite o tamanho em bytes do buffer a ser fornecido para fluxos de entrada criados por um listener de rede que usa este transporte.</p>
<p>O valor default &eacute; 8.192.</p>
</li>
<li>
<p>No campo Time-out para Chave Ociosa, digite o n&uacute;mero de segundos ap&oacute;s o qual uma chave ociosa pode ser cancelada e o canal fechado.</p>
<p>O valor default &eacute; 30.</p>
</li>
<li>
<p>No campo Time-out para Leitura, digite o n&uacute;mero em milissegundos que o GlassFish Server aguarda durante o parsing do cabe&ccedil;alho e corpo da opera&ccedil;&atilde;o de leitura.</p>
<p>O valor default &eacute; 30.000.</p>
</li>
<li>
<p>No campo Time-out para Sondagem do Seletor, digite o n&uacute;mero em milissegundos que um seletor NIO ser&aacute; bloqueado enquanto aguarda por eventos (solicita&ccedil;&otilde;es de usu&aacute;rios).</p>
<p>O valor default &eacute; 1000.</p>
</li>
<li>
<p>No campo Time-out para Grava&ccedil;&atilde;o, digite o n&uacute;mero de milissegundos que o GlassFish Server aguarda antes de considerar que o cliente remoto desconectou ao gravar a resposta.</p>
<p>O valor default &eacute; 30.000.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Configura&ccedil;&atilde;o de Exibi&ccedil;&atilde;o Ativado para descarregar as configura&ccedil;&otilde;es internas do Grizzly nos logs do servidor.</p>
<p>Essa op&ccedil;&atilde;o pode fornecer informa&ccedil;&otilde;es &uacute;teis para a depura&ccedil;&atilde;o. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Rastreamento Ativado para fazer dump das informa&ccedil;&otilde;es de solicita&ccedil;&otilde;es/resposta para o log do servidor.</p>
<p>Essa op&ccedil;&atilde;o pode fornecer informa&ccedil;&otilde;es &uacute;teis para a depura&ccedil;&atilde;o, mas ir&aacute; reduzir significativamente o desempenho. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o TCP sem Atraso para ativar TCP_NODELAY (tamb&eacute;m chamado de algoritmo de Nagle).</p>
<p>Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</li>
<li>
<p>Clique em Salvar.</p>

<hr>
<p><b>Dica:</b></p>
Para voltar &agrave;s defini&ccedil;&otilde;es default, clique no bot&atilde;o Carregar Defaults e depois em Salvar.
<hr>

</li>
</ol>
<a id="sthref70" name="sthref70"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-networklistenernew.html">Para Criar um Listener de Rede</a></p>
</li>
<li>
<p><a href="task-networklisteneredit.html">Para Editar um Listener de Rede</a></p>
</li>
<li>
<p><a href="task-networklistenerdelete.html">Para Deletar um Listener de Rede</a></p>
</li>
<li>
<p><a href="task-protocolnew.html">Para Criar um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">Para Editar um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">Para Editar Defini&ccedil;&otilde;es de SSL de um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">Para Editar Defini&ccedil;&otilde;es de HTTP de um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocolfilecacheedit.html">Para Editar Defini&ccedil;&otilde;es de Cache do Arquivo de um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">Para Deletar um Protocolo</a></p>
</li>
<li>
<p><a href="task-transportnew.html">Para Criar um Transporte</a></p>
</li>
<li>
<p><a href="task-transportdelete.html">Para Deletar um Transporte</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
