<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-protocolfilecacheedit" name="task-protocolfilecacheedit"></a></p>

<h4><a id="sthref62" name="sthref62"></a><a id="sthref63" name="sthref63"></a>Para Editar Defini&ccedil;&otilde;es de Cache do Arquivo de um Protocolo</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&atilde;o.</p>
</li>
<li>
<p>No n&oacute; Configura&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&atilde;o da Rede.</p>
</li>
<li>
<p>No n&oacute; Configura&ccedil;&atilde;o de Rede, selecione o n&oacute; Protocolos.</p>
<p>&Eacute; aberta a p&aacute;gina Protocolos.</p>
</li>
<li>
<p>Na p&aacute;gina Protocolos, clique no nome do protocolo a ser editado.</p>
<p>A p&aacute;gina Editar Protocolo ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Editar Protocolo, clique na guia Cache de Arquivos.</p>
<p>A p&aacute;gina Cache de Arquivos ser&aacute; aberta.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Status Ativado para ativar o cache do arquivo.</p>
<p>Por default, essa op&ccedil;&atilde;o est&aacute; selecionada.</p>
</li>
<li>
<p>No campo Dura&ccedil;&atilde;o M&aacute;xima, digite a dura&ccedil;&atilde;o m&aacute;xima, em segundos, de uma entrada de cache v&aacute;lida.</p>
<p>Esse par&acirc;metro controla a quantidade de informa&ccedil;&otilde;es armazenadas no cache que ser&aacute; utilizada ap&oacute;s o armazenamento de um arquivo no cache. Uma entrada mais antiga do que a dura&ccedil;&atilde;o m&aacute;xima ser&aacute; substitu&iacute;da pela nova entrada do mesmo arquivo. Se o conte&uacute;do n&atilde;o for alterado com frequ&ecirc;ncia, aumente esse valor para melhorar o desempenho.</p>
<p>A dura&ccedil;&atilde;o m&aacute;xima mais eficiente depende da regularidade com que os arquivos existentes s&atilde;o modificados. Por exemplo, se os arquivos forem modificados quatro vezes ao dia, em intervalos regulares, considere a possibilidade de definir a dura&ccedil;&atilde;o m&aacute;xima em 21600 segundos (6 horas). Ou ent&atilde;o, defina a dura&ccedil;&atilde;o m&aacute;xima como sendo o tempo mais longo desejado para a exibi&ccedil;&atilde;o da vers&atilde;o anterior de um arquivo ap&oacute;s a modifica&ccedil;&atilde;o.</p>
<p>O valor default &eacute; 30.</p>
</li>
<li>
<p>No campo Tamanho M&aacute;ximo do Cache, digite o tamanho total m&aacute;ximo (em bytes) do cache do arquivo em disco.</p>
<p>O valor default &eacute; 10485760.</p>
</li>
<li>
<p>No campo Contagem M&aacute;xima de Arquivos, digite o n&uacute;mero m&aacute;ximo de arquivos que pode ser armazenado no cache do arquivo.</p>
<p>Se o valor for muito alto, o servidor armazenar&aacute; no cache os arquivos pouco necess&aacute;rios, o que consome mem&oacute;ria. Se o valor for muito baixo, os benef&iacute;cios do armazenamento no cache n&atilde;o ser&aacute; obtidos. Tente diferentes valores desse atributo para encontrar a solu&ccedil;&atilde;o mais eficiente para aplica&ccedil;&otilde;es espec&iacute;ficas.</p>
<p>O valor default &eacute; 1024.</p>
</li>
<li>
<p>Clique em Salvar.</p>

<hr>
<p><b>Dica:</b></p>
Para voltar &agrave;s defini&ccedil;&otilde;es default, clique no bot&atilde;o Carregar Defaults e depois em Salvar.
<hr>

</li>
</ol>
<a id="sthref64" name="sthref64"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-networklistenernew.html">Para Criar um Listener de Rede</a></p>
</li>
<li>
<p><a href="task-networklisteneredit.html">Para Editar um Listener de Rede</a></p>
</li>
<li>
<p><a href="task-networklistenerdelete.html">Para Deletar um Listener de Rede</a></p>
</li>
<li>
<p><a href="task-protocolnew.html">Para Criar um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">Para Editar um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">Para Editar Defini&ccedil;&otilde;es de SSL de um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">Para Editar Defini&ccedil;&otilde;es de HTTP de um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">Para Deletar um Protocolo</a></p>
</li>
<li>
<p><a href="task-transportnew.html">Para Criar um Transporte</a></p>
</li>
<li>
<p><a href="task-transportedit.html">Para Editar um Transporte</a></p>
</li>
<li>
<p><a href="task-transportdelete.html">Para Deletar um Transporte</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
