<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-webcontainermanagerprops" name="task-webcontainermanagerprops"></a><a id="GHWEB00032" name="GHWEB00032"></a></p>

<h4><a id="sthref7" name="sthref7"></a><a id="sthref8" name="sthref8"></a><a id="sthref9" name="sthref9"></a>Para Configurar Propriedades do Gerenciador para o Cont&ecirc;iner Web</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>O gerenciador de sess&otilde;es fornece os meios para configurar o modo como as sess&otilde;es s&atilde;o criadas e destru&iacute;das, mostra onde o estado da sess&atilde;o ser&aacute; armazenado e informa o n&uacute;mero m&aacute;ximo de sess&otilde;es dispon&iacute;veis.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&atilde;o.</p>
</li>
<li>
<p>Selecione a configura&ccedil;&atilde;o que est&aacute; sendo alterada.</p>
</li>
<li>
<p>No n&oacute; da configura&ccedil;&atilde;o, selecione o n&oacute; Cont&ecirc;iner Web.</p>
<p>A p&aacute;gina Propriedades Gerais ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Propriedades Gerais, clique na guia Propriedades do Gerenciador.</p>
<p>A p&aacute;gina Propriedades do Gerenciador ser&aacute; aberta.</p>
</li>
<li>
<p>No campo Intervalo para Remo&ccedil;&atilde;o, digite o n&uacute;mero de segundos que antecede a dele&ccedil;&atilde;o dos dados de sess&atilde;o inativa do armazenamento.</p>
<p>O valor default &eacute; 60.</p>
<p>Defina este valor menor do que a frequ&ecirc;ncia na qual os dados da sess&atilde;o s&atilde;o modificados. Por exemplo, este valor deveria ser o menor poss&iacute;vel (1 segundo) para um servlet de contagem de acessos em um Web site com acesso frequente, do contr&aacute;rio voc&ecirc; perder&aacute; alguns acessos cada vez que reiniciar o servidor.</p>
</li>
<li>
<p>No campo M&aacute;ximo de Sess&otilde;es, digite o n&uacute;mero m&aacute;ximo de sess&otilde;es que pode ser armazenado no cache.</p>
<p>Um valor de -1 indica que n&atilde;o h&aacute; limite para o n&uacute;mero de sess&otilde;es. O valor default &eacute; -1.</p>
<p>Ap&oacute;s o limite ser alcan&ccedil;ado, uma tentativa para criar uma nova sess&atilde;o causa a ocorr&ecirc;ncia de uma <code>IllegalStateException</code>.</p>
</li>
<li>
<p>No campo Nome do Arquivo da Sess&atilde;o, digite o caminho absoluto ou relativo do diret&oacute;rio no qual o estado da sess&atilde;o &eacute; preservado entre as reinicializa&ccedil;&otilde;es da aplica&ccedil;&atilde;o, se for poss&iacute;vel preservar o estado.</p>
<p>Se este caminho n&atilde;o for definido, o estado da sess&atilde;o n&atilde;o ser&aacute; preservado. Por default, este caminho n&atilde;o &eacute; definido.</p>
<p>Um caminho relativo para o diret&oacute;rio tempor&aacute;rio desta aplica&ccedil;&atilde;o Web.</p>
<p>Esta defini&ccedil;&atilde;o se aplica somente se o tipo de persist&ecirc;ncia for <code>memory</code>. Para definir o Tipo de Persist&ecirc;ncia, consulte <a href="task-webcontaineravailability.html">Para Configurar as Defini&ccedil;&otilde;es de Disponibilidade do Cont&ecirc;iner Web</a>.</p>
</li>
<li>
<p>Na se&ccedil;&atilde;o Propriedades Adicionais, especifique as propriedades adicionais.</p>
<p>O GlassFish Server n&atilde;o define propriedades adicionais para o gerenciador de sess&atilde;o.</p>
<ul>
<li>
<p>Para adicionar uma propriedade, clique no bot&atilde;o Adicionar Propriedade. Na linha em branco que for exibida, digite o nome da propriedade no campo Nome e digite o valor da propriedade no campo Valor.</p>
</li>
<li>
<p>Para modificar uma propriedade, edite o campo Valor da propriedade.</p>
</li>
<li>
<p>Para deletar uma propriedade, marque a caixa de sele&ccedil;&atilde;o &agrave; esquerda do campo Nome da Propriedade a ser deletada. Clique no bot&atilde;o Deletar Propriedades.</p>
</li>
</ul>
</li>
<li>
<p>Clique em Salvar.</p>

<hr>
<p><b>Dica:</b></p>
Para voltar &agrave;s defini&ccedil;&otilde;es default, clique no bot&atilde;o Carregar Defaults e depois em Salvar.
<hr>

</li>
</ol>
<a id="sthref10" name="sthref10"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-webcontainergeneral.html">Para Configurar Propriedades Gerais do Cont&ecirc;iner Web</a></p>
</li>
<li>
<p><a href="task-webcontainersessiontimeout.html">Para Configurar Propriedades da Sess&atilde;o para o Cont&ecirc;iner Web</a></p>
</li>
<li>
<p><a href="task-webcontainerstoreprops.html">Para Configurar Propriedades de Armazenamento para o Cont&ecirc;iner Web</a></p>
</li>
<li>
<p><a href="task-webcontaineravailability.html">Para Configurar as Defini&ccedil;&otilde;es de Disponibilidade do Cont&ecirc;iner Web</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
