<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-threadpooledit" name="task-threadpooledit"></a></p>

<h4><a id="sthref74" name="sthref74"></a>Para Editar um Pool de Threads</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&atilde;o.</p>
</li>
<li>
<p>No n&oacute; Configura&ccedil;&atilde;o, selecione o n&oacute; Pool de Threads.</p>
<p>A p&aacute;gina Pools de Thread ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Pool de Threads, clique no nome do pool de threads a ser editado.</p>
<p>A p&aacute;gina Editar Pool de Threads ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Editar Pool de Threads, no campo Nome da Classe, digite o nome totalmente qualificado da classe de implementa&ccedil;&atilde;o do pool de threads.</p>
<p>O valor default &eacute; <code>com.sun.grizzly.http.StatsThreadPool</code>.</p>
</li>
<li>
<p>No campo Tamanho M&aacute;ximo da Fila, digite o n&uacute;mero m&aacute;ximo de mensagens que podem ser colocadas na fila at&eacute; que os threads estejam dispon&iacute;veis para process&aacute;-las.</p>
<p>Um valor de -1 indica que n&atilde;o existe limite para o tamanho da linha. O valor default &eacute; 4096.</p>
</li>
<li>
<p>No campo Tamanho M&aacute;ximo do Pool de Threads, digite a quantidade m&aacute;xima de threads que pode haver no pool de threads.</p>
<p>O valor default &eacute; 5. Esse &eacute; o valor recomendado para pool de threads de listener de rede.</p>
</li>
<li>
<p>No campo Tamanho M&iacute;nimo do Pool de Threads, digite a quantidade m&iacute;nima de threads que pode haver no pool de threads.</p>
<p>Esses pools s&atilde;o criados quando o pool de threads &eacute; instanciado. O valor default &eacute; 2.</p>
</li>
<li>
<p>No campo Time-out para Ociosidade do Thread, digite o tempo m&aacute;ximo, em segundos, durante o qual um thread pode permanecer ocioso no pool.</p>
<p>Ap&oacute;s esse per&iacute;odo, o thread ser&aacute; removido do pool. O valor default &eacute; 900.</p>
</li>
<li>
<p>Clique em Salvar.</p>

<hr>
<p><b>Dica:</b></p>
Para voltar &agrave;s defini&ccedil;&otilde;es default, clique no bot&atilde;o Carregar Defaults e depois em Salvar.
<hr>

</li>
</ol>
<a id="sthref75" name="sthref75"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-threadpoolnew.html">Para Criar um Pool de Threads</a></p>
</li>
<li>
<p><a href="task-threadpooldelete.html">Para Deletar um Pool de Threads</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
