<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-protocolnew" name="task-protocolnew"></a><a id="GHWEB00042" name="GHWEB00042"></a></p>

<h4><a id="sthref49" name="sthref49"></a>Para Criar um Protocolo</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&atilde;o.</p>
</li>
<li>
<p>No n&oacute; Configura&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&atilde;o da Rede.</p>
</li>
<li>
<p>No n&oacute; Configura&ccedil;&atilde;o de Rede, selecione o n&oacute; Protocolos.</p>
<p>&Eacute; aberta a p&aacute;gina Protocolos.</p>
</li>
<li>
<p>Na p&aacute;gina Protocolos, clique em Novo.</p>
<p>A p&aacute;gina Novo Protocolo ser&aacute; exibida.</p>
</li>
<li>
<p>No campo Nome, digite um nome exclusivo para o protocolo.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Seguran&ccedil;a Ativada para ativar a seguran&ccedil;a do protocolo.</p>
<p>Por default, essa op&ccedil;&atilde;o est&aacute; desativada. Caso voc&ecirc; ative a seguran&ccedil;a, poder&aacute; usar a guia SSL da p&aacute;gina Editar Protocolo para modificar as defini&ccedil;&otilde;es de seguran&ccedil;a.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Status Ativado para ativar o cache do arquivo.</p>
<p>Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</li>
<li>
<p>No campo Dura&ccedil;&atilde;o M&aacute;xima, digite a dura&ccedil;&atilde;o m&aacute;xima, em segundos, de uma entrada de cache v&aacute;lida.</p>
<p>Esse par&acirc;metro controla a quantidade de informa&ccedil;&otilde;es armazenadas no cache que ser&aacute; utilizada ap&oacute;s o armazenamento de um arquivo no cache. Uma entrada mais antiga do que a dura&ccedil;&atilde;o m&aacute;xima ser&aacute; substitu&iacute;da pela nova entrada do mesmo arquivo. Se o conte&uacute;do n&atilde;o for alterado com frequ&ecirc;ncia, aumente esse valor para melhorar o desempenho.</p>
<p>A dura&ccedil;&atilde;o m&aacute;xima mais eficiente depende da regularidade com que os arquivos existentes s&atilde;o modificados. Por exemplo, se os arquivos forem modificados quatro vezes ao dia, em intervalos regulares, considere a possibilidade de definir a dura&ccedil;&atilde;o m&aacute;xima em 21600 segundos (6 horas). Ou ent&atilde;o, defina a dura&ccedil;&atilde;o m&aacute;xima como sendo o tempo mais longo desejado para a exibi&ccedil;&atilde;o da vers&atilde;o anterior de um arquivo ap&oacute;s a modifica&ccedil;&atilde;o.</p>
<p>O valor default &eacute; 30.</p>
</li>
<li>
<p>No campo Tamanho M&aacute;ximo do Cache, digite o tamanho total m&aacute;ximo (em bytes) do cache do arquivo em disco.</p>
<p>O valor default &eacute; 10485760.</p>
</li>
<li>
<p>No campo Contagem M&aacute;xima de Arquivos, digite o n&uacute;mero m&aacute;ximo de arquivos que pode ser armazenado no cache do arquivo.</p>
<p>Se o valor for muito alto, o servidor armazenar&aacute; no cache os arquivos pouco necess&aacute;rios, o que consome mem&oacute;ria. Se o valor for muito baixo, os benef&iacute;cios do armazenamento no cache n&atilde;o ser&aacute; obtidos. Tente diferentes valores desse atributo para encontrar a solu&ccedil;&atilde;o mais eficiente para aplica&ccedil;&otilde;es espec&iacute;ficas.</p>
<p>O valor default &eacute; 1024.</p>
</li>
<li>
<p>No campo Nome do Servidor, digite o nome do host a ser usado nas URLs que o servidor envia para o cliente.</p>
<p>Esse nome ser&aacute; o nome alias se o servidor usar um alias. Se o servidor n&atilde;o usar alias, deixe o campo em branco.</p>
<p>Esse valor somente afeta os URLs gerados automaticamente pelo servidor; ele n&atilde;o afeta os URLs para diret&oacute;rios e arquivos armazenados no servidor. Caso seu servidor use um alias, o nome do servidor deve ser o nome do alias. Se uma v&iacute;rgula e um n&uacute;mero de porta forem acrescentados, essa porta ser&aacute; usada nos URLs que o servidor envia para o cliente.</p>
</li>
<li>
<p>Na lista drop-down Servidor Virtual Default, selecione o servidor virtual a ser associado com este protocolo.</p>
<p>Use a p&aacute;gina Servidores Virtuais para definir servidores virtuais.</p>
</li>
<li>
<p>No campo Porta de Redirecionamento, digite o valor da porta a ser usado para redirecionar uma solicita&ccedil;&atilde;o para outra porta.</p>
<p>O GlassFish Server redirecionar&aacute; automaticamente a solicita&ccedil;&atilde;o se estas duas condi&ccedil;&otilde;es existirem:</p>
<ul>
<li>
<p>O listener de rede que referencia esse protocolo oferece suporte a solicita&ccedil;&otilde;es n&atilde;o-SSL.</p>
</li>
<li>
<p>Uma solicita&ccedil;&atilde;o &eacute; recebida, e a correspondente restri&ccedil;&atilde;o de seguran&ccedil;a exige transporte SSL.</p>
</li>
</ul>
<p>Se uma porta de redirecionamento n&atilde;o estiver especificada, o GlassFish Server usar&aacute; o n&uacute;mero de porta especificado na solicita&ccedil;&atilde;o original. Por default, nenhuma porta &eacute; especificada.</p>
</li>
<li>
<p>No campo M&aacute;ximo de Conex&otilde;es, digite o n&uacute;mero m&aacute;ximo de solicita&ccedil;&otilde;es que podem ser colocadas na fila at&eacute; que a conex&atilde;o seja fechada pelo servidor.</p>
<p>O subsistema Keep-Alive consulta periodicamente as conex&otilde;es ociosas. O valor default &eacute; 256.</p>
<p>Defina esta propriedade para 1 para desativar o keep-alive HTTP/1.0, assim como o keep-alive HTTP/1.1 e pipeline. Um valor de 0 significa que as solicita&ccedil;&otilde;es s&atilde;o sempre rejeitadas. Um valor de -1 indica que n&atilde;o h&aacute; limite para conex&otilde;es keep-alive.</p>
</li>
<li>
<p>No campo Time-out, digite o m&aacute;ximo de tempo em segundos que uma conex&atilde;o pode ser considerada inativa e mantida no estado keep-alive.</p>
<p>Um valor de 0 ou menos significa que as conex&otilde;es keep-alive s&atilde;o mantidas abertas indefinidamente. O valor default &eacute; 30 segundos.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Time-out para Upload Ativado para que a conex&atilde;o para um servlet que l&ecirc; lentamente os bytes seja fechada ap&oacute;s o limite de Time-out para Upload de Conex&atilde;o &eacute; alcan&ccedil;ado.</p>
<p>Se essa op&ccedil;&atilde;o for desativada, as conex&otilde;es de servlet n&atilde;o s&atilde;o submetidas a time-out. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>No campo Time-out para Upload de Conex&atilde;o, digite o time-out para uploads em milissegundos.</p>
<p>Esse campo s&oacute; se aplicar&aacute; se a caixa de sele&ccedil;&atilde;o Time-out para Upload Desativado estiver marcada. O valor default &eacute; 300.000 milissegundos.</p>
</li>
<li>
<p>No campo Time-out para Solicita&ccedil;&atilde;o, digite o n&uacute;mero de segundos antes que uma solicita&ccedil;&atilde;o seja submetida a time-out.</p>
<p>Se a solicita&ccedil;&atilde;o n&atilde;o for processada antes que o valor do time-out seja alcan&ccedil;ado, a solicita&ccedil;&atilde;o ser&aacute; ignorada. O valor default &eacute; 30 segundos.</p>
</li>
<li>
<p>No campo Tamanho do Buffer para Envio, digite o tamanho em bytes do buffer para envio.</p>
<p>O valor default &eacute; 8.192 bytes.</p>
</li>
<li>
<p>No campo Tamanho do Buffer de Cabe&ccedil;alho, digite o tamanho em bytes do buffer usado pelos threads de processamento de solicita&ccedil;&atilde;o para ler os dados da solicita&ccedil;&atilde;o.</p>
<p>O valor default &eacute; 8.192 bytes.</p>
</li>
<li>
<p>No campo Tamanho M&aacute;ximo de Postagem, digite o tamanho m&aacute;ximo em bytes das a&ccedil;&otilde;es POST.</p>
<p>O valor default &eacute; 2.097.152 bytes.</p>
</li>
<li>
<p>No campo Codifica&ccedil;&atilde;o URI, digite o nome do conjunto de caracteres usado para decodificar os URIs de solicita&ccedil;&atilde;o recebidos.</p>
<p>O valor precisa ser um nome v&aacute;lido de um conjunto de caracteres IANA. O valor default &eacute; UTF-8.</p>
</li>
<li>
<p>No campo Vers&atilde;o, digite a vers&atilde;o do protocolo HTTP usado.</p>
<p>O valor default &eacute; HTTP/1.1.</p>
</li>
<li>
<p>Na lista drop-down Compacta&ccedil;&atilde;o, selecione o uso da compacta&ccedil;&atilde;o HTTP/1.1 GZIP para reduzir a largura de banda no servidor.</p>
<p>As op&ccedil;&otilde;es dispon&iacute;veis s&atilde;o:</p>
<dl>
<dt><code>on</code></dt>
<dd>
<p>Compacta os dados.</p>
</dd>
<dt><code>off</code></dt>
<dd>
<p>Desativa a compacta&ccedil;&atilde;o.</p>
</dd>
<dt><code>force</code></dt>
<dd>
<p>For&ccedil;a a compacta&ccedil;&atilde;o dos dados em todos os casos.</p>
</dd>
</dl>
<p>O valor default <code>off</code>.</p>
</li>
<li>
<p>No campo Tipos MIME Compact&aacute;veis, digite uma lista separada por v&iacute;rgulas dos tipos MIME para os quais a compacta&ccedil;&atilde;o HTTP &eacute; usada.</p>
<p>O valor default &eacute; <code>text/html,text/xml,text/plain</code>.</p>
</li>
<li>
<p>No campo Tamanho M&iacute;nimo de Compacta&ccedil;&atilde;o, digite o tamanho m&iacute;nimo de um arquivo quando a compacta&ccedil;&atilde;o &eacute; aplicada.</p>
<p>Esse valor deve ser definido se a Compacta&ccedil;&atilde;o estiver definida como <code>on</code> ou <code>force</code>. O valor default &eacute; 2.048 bytes.</p>
</li>
<li>
<p>No campo Agentes de N&atilde;o Compacta&ccedil;&atilde;o do Usu&aacute;rio, digite uma lista separada por v&iacute;rgulas de express&otilde;es regulares que coincidem com agentes do usu&aacute;rio ou clientes HTTP, para os quais a compacta&ccedil;&atilde;o n&atilde;o deve ser usada.</p>
<p>Por default esse valor &eacute; uma string vazia.</p>
</li>
<li>
<p>No campo Agente de Usu&aacute;rio Restrito, digite uma lista de agentes do usu&aacute;rio restritos no qual a compacta&ccedil;&atilde;o HTTP &eacute; aplicada.</p>
<p>Se nenhum agente do usu&aacute;rio for especificado, a compacta&ccedil;&atilde;o HTTP ser&aacute; aplicada em todos os agentes do usu&aacute;rio. Por default, nenhum agente do usu&aacute;rio &eacute; especificado.</p>
</li>
<li>
<p>No campo Tipo de Resposta Default, digite uma string que especifica o tipo de resposta default.</p>
<p>O formato &eacute; uma string delimitada por pontos e v&iacute;rgulas, consistindo no tipo de conte&uacute;do, codifica&ccedil;&atilde;o, idioma e conjunto de caracteres. O valor default &eacute; <code>text/html; charset=iso-8859-1</code>.</p>
</li>
<li>
<p>No campo Tipo de Resposta For&ccedil;ada, digite uma string que especifica o tipo de solicita&ccedil;&atilde;o usado, caso nenhum mapeamento MIME esteja dispon&iacute;vel que coincida com a extens&atilde;o do arquivo.</p>
<p>O formato &eacute; uma string delimitada por pontos e v&iacute;rgulas, consistindo no tipo de conte&uacute;do, codifica&ccedil;&atilde;o, idioma e conjunto de caracteres. O valor default &eacute; <code>text/html; charset=iso-8859-1</code>.</p>
</li>
<li>
<p>No campo Adaptador, digite o nome da classe do adaptador de recursos est&aacute;ticos.</p>
<p>O valor default &eacute; <code>com.sun.grizzly.tcp.StaticResourcesAdapter</code>.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Suporte a Comet Ativado para ativar o suporte a Comet para o listener de rede que referencia este protocolo.</p>
<p>Por default, essa op&ccedil;&atilde;o &eacute; desativada. Se o seu servlet ou p&aacute;gina JSP usa a tecnologia Comet, assegure-se de que esteja inicializada quando o GlassFish Server &eacute; iniciado, ao adicionar o elemento <code>load-on-startup</code> em seu arquivo <code>web.xml</code>. Por exemplo:</p>
<pre>
&lt;servlet&gt;
&lt;servlet-name&gt;CheckIn&lt;/servlet-name&gt;
&lt;servlet-class&gt;CheckInServlet&lt;/servlet-class&gt;
&lt;load-on-startup&gt;0&lt;/load-on-startup&gt;
&lt;/servlet&gt;
</pre></li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Pesquisa de DNS Ativada para ativar a pesquisa de DNS.</p>
<p>Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Suporte RCM Ativado para ativar o Gerenciamento de Configura&ccedil;&atilde;o de Recursos (RCM).</p>
<p>Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Rastreamento Ativado para ativar a opera&ccedil;&atilde;o TRACE.</p>
<p>Se essa op&ccedil;&atilde;o for desativada, o GlassFish Server &eacute; menos suscet&iacute;vel ao ataques de scripts de site cruzado. Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Passagem de Autoriza&ccedil;&atilde;o Ativada para indicar que o listener de rede que usa este protocolo recebe tr&aacute;fego de um servidor proxy em que a conex&atilde;o SSL proveniente do cliente termina no servidor proxy.</p>
<p>Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Agrupamento Ativada para ativar o agrupamento de resposta HTTP.</p>
<p>Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o XPowered por Ativado para indicar ao GlassFish Server para usar os cabe&ccedil;alhos <code>X-Powered-By</code> das especifica&ccedil;&otilde;es Java Servlet 3.0 e do Java Server Pages 2.0.</p>
<p>Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</li>
</ol>
<a id="sthref50" name="sthref50"></a>
<h5>Pr&oacute;ximas Etapas</h5>
<p>Ap&oacute;s criar o protocolo, voc&ecirc; pode criar um listener de rede que usa o protocolo.</p>
<a id="sthref51" name="sthref51"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-networklistenernew.html">Para Criar um Listener de Rede</a></p>
</li>
<li>
<p><a href="task-networklisteneredit.html">Para Editar um Listener de Rede</a></p>
</li>
<li>
<p><a href="task-networklistenerdelete.html">Para Deletar um Listener de Rede</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">Para Editar um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">Para Editar Defini&ccedil;&otilde;es de SSL de um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">Para Editar Defini&ccedil;&otilde;es de HTTP de um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocolfilecacheedit.html">Para Editar Defini&ccedil;&otilde;es de Cache do Arquivo de um Protocolo</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">Para Deletar um Protocolo</a></p>
</li>
<li>
<p><a href="task-transportnew.html">Para Criar um Transporte</a></p>
</li>
<li>
<p><a href="task-transportedit.html">Para Editar um Transporte</a></p>
</li>
<li>
<p><a href="task-transportdelete.html">Para Deletar um Transporte</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
