<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-virtualserveredit" name="task-virtualserveredit"></a><a id="GHWEB00037" name="GHWEB00037"></a></p>

<h4><a id="sthref36" name="sthref36"></a>Para Editar um Servidor Virtual</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&atilde;o.</p>
</li>
<li>
<p>Selecione a configura&ccedil;&atilde;o que est&aacute; sendo alterada.</p>
</li>
<li>
<p>No n&oacute; Configura&ccedil;&atilde;o, selecione o n&oacute; Servidores Virtuais.</p>
<p>A p&aacute;gina Servidores Virtuais ser&aacute; aberta.</p>
</li>
<li>
<p>NA p&aacute;gina Servidores Virtuais, clique no nome do servidor virtual a ser editado.</p>
<p>A p&aacute;gina Editar Servidor Virtual ser&aacute; aberta.</p>
</li>
<li>
<p>No campo Hosts, digite os nomes de host ou endere&ccedil;os IP da m&aacute;quina na qual o servidor est&aacute; sendo executado.</p>
<p>Use nomes de host reais ou virtuais que s&atilde;o registrados com o servidor DNS para a sua rede (e, em um sistema UNIX, no seu arquivo<code>/etc/hosts</code>). O valor default est&aacute; no valor da propriedade do sistema <code>${com.sun.aas.hostName}</code>.</p>
</li>
<li>
<p>Selecione uma op&ccedil;&atilde;o de Estado para o servidor virtual.</p>
<p>O valor pode ser um dos seguintes:</p>
<dl>
<dt>Ligado</dt>
<dd>
<p>O servidor virtual est&aacute; ativo. Esse &eacute; o valor default.</p>
</dd>
<dt>Desligado</dt>
<dd>
<p>O servidor virtual est&aacute; inativo. As tentativas de acessar o servidor retornam o c&oacute;digo de erro 404 (recurso indispon&iacute;vel).</p>
</dd>
<dt>Desativado</dt>
<dd>
<p>O servidor virtual est&aacute; desativado. As tentativas de acessar o servidor retornam o c&oacute;digo de erro 403 (execu&ccedil;&atilde;o da solicita&ccedil;&atilde;o recusada).</p>
</dd>
</dl>
</li>
<li>
<p>Selecione uma op&ccedil;&atilde;o SSO para o novo servidor virtual.</p>
<p>Por default, um servidor virtual herda a defini&ccedil;&atilde;o de sign-on &uacute;nico (SSO) do servi&ccedil;o HTTP. Selecione Ativado ou Desativado para substituir a defini&ccedil;&atilde;o do servi&ccedil;o HTTP ao ativar ou desativar o sign-on &uacute;nico para este servidor virtual.</p>
<p>O sign-on &uacute;nico em aplica&ccedil;&otilde;es no GlassFish Server tem suporte de servlets e arquivos JSP. Esse recurso permite o compartilhamento dessa informa&ccedil;&atilde;o pelas v&aacute;rias aplica&ccedil;&otilde;es que exigem as mesmas informa&ccedil;&otilde;es de sign-on de usu&aacute;rio, em vez de exigir que o usu&aacute;rio fa&ccedil;a um sign-on separado em cada aplica&ccedil;&atilde;o.</p>
</li>
<li>
<p>Na lista drop-down Listeners de Rede, selecione um ou mais listeners de rede ou deixe o campo em branco.</p>
</li>
<li>
<p>Na lista drop-down M&oacute;dulo da Web Default, selecione o m&oacute;dulo que deve responder a todas as solicita&ccedil;&otilde;es que n&atilde;o podem ser mapeadas para outros m&oacute;dulos da Web implantados no servidor virtual.</p>
<p>Se n&atilde;o for especificado um m&oacute;dulo da Web default, ser&aacute; usado o m&oacute;dulo da Web que tenha uma raiz de contexto vazia. Se n&atilde;o houver nenhum m&oacute;dulo da Web com raiz de contexto vazia, um m&oacute;dulo da Web default do sistema ser&aacute; criado e utilizado.</p>
</li>
<li>
<p>No campo Arquivo de Log, digite o nome do caminho do arquivo no qual ser&atilde;o exibidas as mensagens de log desse servidor virtual.</p>
<p>Por default, as mensagens de log ser&atilde;o enviadas para o log do servidor default, domain-dir<code>/logs/server.log</code>.</p>
</li>
<li>
<p>No campo Docroot, digite o caminho absoluto para o diret&oacute;rio raiz de documentos do servidor.</p>
<p>O valor default &eacute; domain-dir<code>/docroot</code>.</p>
</li>
<li>
<p>Para ativar ou desativar o log de acesso, selecione a op&ccedil;&atilde;o Log de Acesso.</p>
<p>Por default, um servidor virtual herda a defini&ccedil;&atilde;o de log de acesso do servi&ccedil;o HTTP. Selecione Ativado ou Desativado para substituir a defini&ccedil;&atilde;o do servi&ccedil;o HTTP ao ativar ou desativar o log de acesso para este servidor virtual.</p>
</li>
<li>
<p>No campo Diret&oacute;rio, digite o caminho absoluto do diret&oacute;rio para os logs de acesso do servidor.</p>
<p>O valor default &eacute; domain-dir<code>/logs/access</code>.</p>
</li>
<li>
<p>Na se&ccedil;&atilde;o Propriedades Adicionais, especifique propriedades adicionais do servidor virtual.</p>
<p>Para obter informa&ccedil;&otilde;es sobre propriedades dispon&iacute;veis, consulte <a href="ref-virtualserverprops.html">Propriedades Espec&iacute;ficas para Servidores Virtuais</a>.</p>
<ul>
<li>
<p>Para adicionar uma propriedade, clique no bot&atilde;o Adicionar Propriedade. Na linha em branco que for exibida, digite o nome da propriedade no campo Nome e digite o valor da propriedade no campo Valor.</p>
</li>
<li>
<p>Para modificar uma propriedade, edite o campo Valor da propriedade.</p>
</li>
<li>
<p>Para deletar uma propriedade, marque a caixa de sele&ccedil;&atilde;o &agrave; esquerda do campo Nome da Propriedade a ser deletada. Clique no bot&atilde;o Deletar Propriedades.</p>
</li>
</ul>
</li>
<li>
<p>Clique em Salvar.</p>

<hr>
<p><b>Dica:</b></p>
Para voltar &agrave;s defini&ccedil;&otilde;es default, clique no bot&atilde;o Carregar Defaults e depois em Salvar.
<hr>

</li>
</ol>
<a id="sthref37" name="sthref37"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-virtualservercreate.html">Para Criar um Servidor Virtual</a></p>
</li>
<li>
<p><a href="task-virtualserverdelete.html">Para Deletar um Servidor Virtual</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
