<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-httplistenerssl" name="task-httplistenerssl"></a></p>

<h4><a id="sthref31" name="sthref31"></a><a id="sthref32" name="sthref32"></a>Para Editar Defini&ccedil;&otilde;es SSL de um Listener HTTP</h4>
<a name="BEGIN" id="BEGIN"></a><a id="sthref33" name="sthref33"></a>
<h5>Antes de Come&ccedil;ar</h5>
<p>Esta tarefa &eacute; significante somente se a seguran&ccedil;a for ativada pelo protocolo.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&atilde;o.</p>
</li>
<li>
<p>No n&oacute; Configura&ccedil;&atilde;o, expanda o n&oacute; Servi&ccedil;o HTTP.</p>
</li>
<li>
<p>No n&oacute; Configura&ccedil;&atilde;o de Rede, selecione o n&oacute; Listeners HTTP.</p>
<p>A p&aacute;gina Listeners HTTP ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Listeners HTTP, clique no nome do listener HTTP que voc&ecirc; estiver editando.</p>
<p>A p&aacute;gina Editar Listener HTTP ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Editar Listener HTTP, clique na guia SSL.</p>
<p>A p&aacute;gina SSL ser&aacute; aberta.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o SSL3 Ativada para ativar a SSL3.</p>
<p>Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o TLS Ativada para ativar o Transport Layer Security (TLS).</p>
<p>Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Autentica&ccedil;&atilde;o do Cliente Ativada para exigir que os clientes se identifiquem ao servidor a cada solicita&ccedil;&atilde;o.</p>
<p>Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</li>
<li>
<p>No campo Apelido do Certificado, digite o apelido do certificado do servidor no banco de dados de certificados ou no token PKCS#11.</p>
<p>No certificado, o formato de nome &eacute;<i>tokenname</i><code>:</code><i>nickname</i>. Inclusive o <i>tokenname</i><code>:</code> parte do nome neste atributo &eacute; opcional.</p>
</li>
<li>
<p>No campo Armazenamento de Chaves, digite o nome do arquivo do armazenamento de chaves (por exemplo, <code>keystore.jks</code>).</p>
</li>
<li>
<p>No campo Algoritmo de Confiabilidade, digite o nome do algoritmo de gerenciamento confi&aacute;vel (por exemplo, PKIX) para usar para valida&ccedil;&atilde;o do caminho de certifica&ccedil;&atilde;o.</p>
</li>
<li>
<p>No campo Tamanho M&aacute;ximo do Certificado, digite o n&uacute;mero m&aacute;ximo de certificados intermedi&aacute;rios n&atilde;o emitidos automaticamente, que podem existir em um caminho de certifica&ccedil;&atilde;o.</p>
<p>Esse campo &eacute; usado apenas se o campo Algoritmo de Confiabilidade estiver definido como PKIX. O valor 0 indica que o caminho pode conter somente um certificado. O valor -1 indica que o comprimento do caminho n&atilde;o &eacute; restrito (n&atilde;o existe m&aacute;ximo). A defini&ccedil;&atilde;o de um valor menor que -1 gera uma exce&ccedil;&atilde;o.</p>
</li>
<li>
<p>No campo Armazenamento Confi&aacute;vel, digite o nome do arquivo de armazenamento confi&aacute;vel (por exemplo, <code>cacerts.jks</code>).</p>
</li>
<li>
<p>Na &aacute;rea Conjuntos Criptogr&aacute;ficos, especifique os conjuntos criptogr&aacute;ficos a serem usados.</p>
<p>Se voc&ecirc; n&atilde;o adicionar conjuntos criptogr&aacute;ficos, todos os conjuntos criptogr&aacute;ficos ser&atilde;o usados.</p>
</li>
<li>
<p>Clique em OK.</p>
</li>
</ol>
<a id="sthref34" name="sthref34"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-httplistenernew.html">Para Criar um Listener HTTP</a></p>
</li>
<li>
<p><a href="task-httplisteneredit.html">Para Editar um Listener HTTP</a></p>
</li>
<li>
<p><a href="task-httplistenerdelete.html">Para Deletar um Listener HTTP</a></p>
</li>
<li>
<p><a href="task-virtualservercreate.html">Para Criar um Servidor Virtual</a></p>
</li>
<li>
<p><a href="task-networklistenernew.html">Para Criar um Listener de Rede</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">Para Editar Defini&ccedil;&otilde;es de HTTP de um Protocolo</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
