<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-ejbmdbpoolsettings" name="ref-ejbmdbpoolsettings"></a><a id="GHEJB00002" name="GHEJB00002"></a></p>

<h4><a id="sthref15" name="sthref15"></a><a id="sthref16" name="sthref16"></a><a id="sthref17" name="sthref17"></a>Configuraci&oacute;n del pool por defecto de beans controlados por mensajes</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Configuraci&oacute;n del Pool por Defecto de Beans Controlados por Mensajes para configurar el pool de beans controlados por mensajes.</p>
<p>La p&aacute;gina Configuraci&oacute;n del Pool por Defecto de Beans Controlados por Mensajes contiene las opciones siguientes.</p>
<dl>
<dt>Cargar Valores por Defecto</dt>
<dd>
<p>Bot&oacute;n para restaurar configuraci&oacute;n que tiene valores por defecto a sus valores por defecto. Las configuraciones que no tienen valores por defecto no se modifican.</p>
</dd>
<dt>Nombre de Configuraci&oacute;n</dt>
<dd>
<p>Nombre de la configuraci&oacute;n a la que se aplican los valores de esta p&aacute;gina. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>Tama&ntilde;o de pool inicial y m&iacute;nimo:</dt>
<dd>
<p>N&uacute;mero m&iacute;nimo de beans de mensajes que se mantendr&aacute;n en el pool. El valor por defecto es 0.</p>
</dd>
<dt>Tama&ntilde;o de Pool M&aacute;ximo</dt>
<dd>
<p>N&uacute;mero m&aacute;ximo de beans que el contenedor puede mantener en el pool al mismo tiempo. El valor por defecto es 32.</p>
</dd>
<dt>Cantidad de Cambio de Tama&ntilde;o del Pool</dt>
<dd>
<p>N&uacute;mero de beans que se eliminan del pool si est&aacute;n inactivos durante m&aacute;s tiempo del especificado en el campo Timeout de inactividad del pool. El valor debe ser 0 como m&iacute;nimo e inferior al valor de Tama&ntilde;o de pool m&aacute;ximo. El valor por defecto es 8.</p>
</dd>
<dt>Timeout de inactividad de pool</dt>
<dd>
<p>Intervalo de tiempo, en segundos, que un bean del pool puede estar inactivo antes de que se elimine del pool. Una vez transcurrido dicho intervalo de tiempo, el bean se destruye. Un valor de 0 significa que un bean puede permanecer inactivo indefinidamente. El valor por defecto es 600.</p>
</dd>
<dt>Propiedades Adicionales</dt>
<dd>
<p>Propiedades adicionales del pool MDB. GlassFish Server no define ninguna propiedad adicional para el pool de beans controlados por mensajes.</p>
</dd>
</dl>
<a id="sthref18" name="sthref18"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-ejbmdbpoolsettings.html">Configurar valores de pool de beans controlados por mensajes</a></p>
</li>
<li>
<p><a href="../../../ejb-lite/en/help/task-ejbgeneral.html">Definir la Configuraci&oacute;n de EJB</a></p>
</li>
<li>
<p><a href="task-ejbtimerservice.html">Configurar el servicio de temporizador de EJB</a></p>
</li>
</ul>
<a id="sthref19" name="sthref19"></a>
<h5>Comandos asadmin Relacionados</h5>
<p>Ninguno.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
