<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-ejbcontaineravailability" name="task-ejbcontaineravailability"></a></p>

<h4><a id="sthref7" name="sthref7"></a><a id="sthref8" name="sthref8"></a><a id="sthref9" name="sthref9"></a><a id="sthref10" name="sthref10"></a>Configurar la Disponibilidad del Contenedor EJB</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Configuraci&oacute;n.</p>
</li>
<li>
<p>Seleccione la configuraci&oacute;n que desea cambiar.</p>
</li>
<li>
<p>En el nodo de configuraci&oacute;n, seleccione el nodo Servicio de Disponibilidad.</p>
<p>Se abrir&aacute; la p&aacute;gina Servicio de disponibilidad.</p>
</li>
<li>
<p>En la p&aacute;gina Servicio de Disponibilidad, haga clic en el separador Disponibilidad de Contenedor EJB.</p>
<p>Se abrir&aacute; la p&aacute;gina Disponibilidad de contenedor EJB.</p>
</li>
<li>
<p>Active la casilla Servicio de disponibilidad activado para activar la disponibilidad del contenedor EJB.</p>
<p>Para desactivar la disponibilidad, desactive la casilla Servicio de disponibilidad.</p>
</li>
<li>
<p>El tipo de persistencia HA es <code>replicated</code>.</p>
<p>&Eacute;ste es el mecanismo de persistencia utilizado cuando Servicio de disponibilidad activado est&aacute; activada. La persistencia se basa en failover en un cluster. No cambie este valor.</p>
</li>
<li>
<p>El tipo de persistencia SFSB es <code>file</code>.</p>
<p>&Eacute;ste es el mecanismo de persistencia utilizado cuando Servicio de disponibilidad activado <i>no</i> est&aacute; activada. La persistencia se basa en el sistema de archivos. No cambie este valor.</p>
<p>El campo Ubicaci&oacute;n del almac&eacute;n de sesi&oacute;n determina d&oacute;nde contin&uacute;an activos los estados del punto de control SFSB. Para definir la ubicaci&oacute;n del almac&eacute;n de sesi&oacute;n, consulte <a href="../../../ejb-lite/en/help/task-ejbgeneral.html">Definir la Configuraci&oacute;n de EJB</a>.</p>
</li>
<li>
<p>Para restablecer los valores por defecto, haga clic en el bot&oacute;n Cargar valores por defecto.</p>
</li>
<li>
<p>En la secci&oacute;n Propiedades Adicionales, especifique las propiedades adicionales.</p>
<p>GlassFish Server no define ninguna propiedad adicional para la disponibilidad del contenedor EJB.</p>
<ul>
<li>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, introduzca el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
</li>
<li>
<p>Para modificar una propiedad, edite el campo Valor.</p>
</li>
<li>
<p>Para suprimir una propiedad, active la casilla de control a la izquierda del campo Nombre de la propiedad que est&aacute; suprimiendo y, a continuaci&oacute;n, haga clic en el bot&oacute;n Suprimir Propiedades.</p>
</li>
</ul>
</li>
<li>
<p>Haga clic en Guardar.</p>
</li>
</ol>
<a id="sthref11" name="sthref11"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="../../../ejb-lite/en/help/task-ejbgeneral.html">Definir la Configuraci&oacute;n de EJB</a></p>
</li>
<li>
<p><a href="task-ejbmdbpoolsettings.html">Configurar valores de pool de beans controlados por mensajes</a></p>
</li>
<li>
<p><a href="task-ejbtimerservice.html">Configurar el servicio de temporizador de EJB</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
