<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-ejbmdbpoolsettings" name="task-ejbmdbpoolsettings"></a></p>

<h4><a id="sthref2" name="sthref2"></a><a id="sthref3" name="sthref3"></a><a id="sthref4" name="sthref4"></a>Configurar valores de pool de beans controlados por mensajes</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>El grupo de beans controlados por mensajes es similar al de los beans de sesi&oacute;n. Por defecto, el contenedor mantiene un pool de beans controlados por mensajes.</p>
<p>Para ajustar la configuraci&oacute;n de este pool, lleve a cabo los pasos siguientes.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Configuraci&oacute;n.</p>
</li>
<li>
<p>Seleccione el nodo Contenedor EJB.</p>
<p>Se abrir&aacute; la p&aacute;gina de Enterprise Java Beans (EJB).</p>
</li>
<li>
<p>Haga clic en el separador Configuraci&oacute;n de Beans Controlados por Mensajes.</p>
<p>Se abrir&aacute; la p&aacute;gina Configuraci&oacute;n del pool por defecto de beans controlados por mensajes.</p>
</li>
<li>
<p>En el campo Tama&ntilde;o de Pool Inicial y M&iacute;nimo, escriba el n&uacute;mero m&iacute;nimo de beans que se mantendr&aacute;n en el pool.</p>
<p>El valor por defecto es 0.</p>
</li>
<li>
<p>En el campo Tama&ntilde;o de pool m&aacute;ximo, escriba el n&uacute;mero m&aacute;ximo de beans que el contenedor puede mantener en el pool al mismo tiempo.</p>
<p>El valor por defecto es 32.</p>
</li>
<li>
<p>En el campo Cantidad de cambio de tama&ntilde;o del pool, escriba la cantidad de beans que se eliminar&aacute;n del pool si permanecen en estado inactivo durante un tiempo superior al especificado en el campo Timeout de inactividad del pool.</p>
<p>El valor debe ser 0 como m&iacute;nimo e inferior al valor de Tama&ntilde;o de pool m&aacute;ximo. El valor por defecto es 8.</p>
</li>
<li>
<p>En el campo Timeout de inactividad del pool, escriba el tiempo, en segundos, que un bean del pool puede estar inactivo antes de que se elimine del pool.</p>
<p>Una vez transcurrido dicho intervalo de tiempo, el bean se destruye. Un valor de 0 significa que un bean puede permanecer inactivo indefinidamente. El valor por defecto es 600.</p>
</li>
<li>
<p>En la secci&oacute;n Propiedades Adicionales, especifique las propiedades adicionales.</p>
<p>GlassFish Server no define ninguna propiedad adicional para el pool de beans controlados por mensajes.</p>
<ul>
<li>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, introduzca el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
</li>
<li>
<p>Para modificar una propiedad, edite el campo Valor.</p>
</li>
<li>
<p>Para suprimir una propiedad, active la casilla de control a la izquierda del campo Nombre de la propiedad que est&aacute; suprimiendo y, a continuaci&oacute;n, haga clic en el bot&oacute;n Suprimir Propiedades.</p>
</li>
</ul>
</li>
<li>
<p>Haga clic en Guardar.</p>

<hr>
<p><b>Sugerencia:</b></p>
Para volver a la configuraci&oacute;n por defecto, haga clic en el bot&oacute;n Cargar Valores por Defecto y, a continuaci&oacute;n, en Guardar.
<hr>

</li>
<li>
<p>Reinicie GlassFish Server.</p>
</li>
</ol>
<a id="sthref5" name="sthref5"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="../../../ejb-lite/en/help/task-ejbgeneral.html">Definir la Configuraci&oacute;n de EJB</a></p>
</li>
<li>
<p><a href="task-ejbtimerservice.html">Configurar el servicio de temporizador de EJB</a></p>
</li>
<li>
<p><a href="task-ejbcontaineravailability.html">Configurar la Disponibilidad del Contenedor EJB</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
