<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-ejbtimerservice" name="task-ejbtimerservice"></a></p>

<h4><a id="sthref6" name="sthref6"></a><a id="sthref7" name="sthref7"></a><a id="sthref8" name="sthref8"></a>Configurar el servicio de temporizador de EJB</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>El servicio de temporizador consiste en un servicio de notificaciones transaccional y continuo proporcionado por el contenedor de beans de empresa. Se utiliza para programar notificaciones o eventos utilizados por beans de empresa. Todos los beans de empresa, excepto los beans de sesi&oacute;n con estado, pueden recuperar notificaciones del servicio de temporizador. Los temporizadores persistentes definidos por el servicio no se destruyen si el servidor se apaga o se reinicia.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Configuraci&oacute;n.</p>
</li>
<li>
<p>Seleccione el nodo Contenedor EJB.</p>
<p>Se abrir&aacute; la p&aacute;gina de Enterprise Java Beans (EJB).</p>
</li>
<li>
<p>Haga clic en el separador Servicio de Temporizador EJB.</p>
<p>Se abrir&aacute; la p&aacute;gina Servicio de temporizador EJB.</p>
</li>
<li>
<p>En el campo Intervalo m&iacute;nimo de entrega, especifique la cantidad m&iacute;nima de milisegundos permitidos antes de la caducidad del temporizador de un determinado temporizador.</p>
<p>Si se define un intervalo demasiado bajo, el servidor se puede sobrecargar. El valor por defecto es 1.000.</p>
</li>
<li>
<p>En el campo N&uacute;mero m&aacute;ximo de nuevas entregas, especifique el n&uacute;mero m&aacute;ximo de intentos que realiza el servicio de temporizador para entregar un vencimiento por caducidad del temporizador para una excepci&oacute;n o un rollback.</p>
<p>El valor por defecto es 1.</p>
</li>
<li>
<p>En el campo Intervalo de nueva entrega, escriba el intervalo, en milisegundos, entre reintentos de entrega.</p>
<p>El valor por defecto es 5.000.</p>
</li>
<li>
<p>En el campo Origen de datos de temporizador, escriba el nombre de JNDI del recurso de JDBC que se utilizar&aacute; como origen de datos de temporizador.</p>
<p>Si se especifica, este valor anula el valor por defecto de <code>jdbc/__TimerPool</code> para la aplicaci&oacute;n del sistema de servicio de temporizador.</p>
</li>
<li>
<p>Haga clic en Guardar.</p>

<hr>
<p><b>Sugerencia:</b></p>
Para volver a la configuraci&oacute;n por defecto, haga clic en el bot&oacute;n Cargar Valores por Defecto y, a continuaci&oacute;n, en Guardar.
<hr>

</li>
<li>
<p>Reinicie GlassFish Server.</p>
</li>
</ol>
<a id="sthref9" name="sthref9"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="../../../ejb-lite/en/help/task-ejbgeneral.html">Definir la Configuraci&oacute;n de EJB</a></p>
</li>
<li>
<p><a href="task-ejbmdbpoolsettings.html">Configurar valores de pool de beans controlados por mensajes</a></p>
</li>
<li>
<p><a href="task-ejbcontaineravailability.html">Configurar la Disponibilidad del Contenedor EJB</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
