<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-executorservicenew" name="ref-executorservicenew"></a></p>

<h4>&#26032;&#35215;&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;<a id="sthref24" name="sthref24"></a></h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#26032;&#35215;&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26032;&#35215;&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>JNDI&#21517;</dt>
<dd>
<p>&#12522;&#12477;&#12540;&#12473;&#12434;&#35672;&#21029;&#12377;&#12427;&#19968;&#24847;&#12398;JNDI&#21517;&#12290;&#35215;&#21063;&#12395;&#12424;&#12426;&#12289;&#21517;&#21069;&#12399;&#12289;concurrent/&#12289;jdbc/&#12289;jms/&#12398;&#12424;&#12358;&#12395;&#12289;&#12522;&#12477;&#12540;&#12473;&#12539;&#12479;&#12452;&#12503;&#12539;&#12452;&#12531;&#12472;&#12465;&#12540;&#12479;&#12392;&#12473;&#12521;&#12483;&#12471;&#12517;&#12391;&#22987;&#12414;&#12426;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#24773;&#22577;</dt>
<dd>
<p>Classloader&#12289;JNDI&#12289;Security&#12289;WorkArea&#12394;&#12393;&#12289;&#12473;&#12524;&#12483;&#12489;&#12395;&#20253;&#25773;&#12377;&#12427;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12290;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12398;&#20253;&#25773;&#12399;&#26377;&#21177;&#21270;&#12377;&#12427;&#12371;&#12392;&#12418;&#28961;&#21177;&#21270;&#12377;&#12427;&#12371;&#12392;&#12418;&#21487;&#33021;&#12391;&#12377;&#12290;&#26377;&#21177;&#21270;&#12373;&#12428;&#12390;&#12356;&#12427;&#12392;&#12289;&#36984;&#25246;&#12373;&#12428;&#12383;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12364;&#20253;&#25773;&#12373;&#12428;&#12414;&#12377;&#12290;&#28961;&#21177;&#21270;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12364;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12390;&#12418;&#20253;&#25773;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12300;&#26377;&#21177;&#12301;&#12391;&#12289;4&#12388;&#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12364;&#12377;&#12409;&#12390;&#36984;&#25246;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12473;&#12486;&#12540;&#12479;&#12473;</dt>
<dd>
<p>&#12522;&#12477;&#12540;&#12473;&#12398;&#12473;&#12486;&#12540;&#12479;&#12473;&#12290;&#12522;&#12477;&#12540;&#12473;&#12399;&#12289;&#26377;&#21177;&#12414;&#12383;&#12399;&#28961;&#21177;&#12398;&#29366;&#24907;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12300;&#26377;&#21177;&#12301;&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12473;&#12524;&#12483;&#12489;&#20778;&#20808;&#24230;</dt>
<dd>
<p>&#20316;&#25104;&#12373;&#12428;&#12383;&#12473;&#12524;&#12483;&#12489;&#12395;&#21106;&#12426;&#24403;&#12390;&#12427;&#20778;&#20808;&#24230;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;5&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#38263;&#26178;&#38291;&#23455;&#34892;&#20013;&#12398;&#12479;&#12473;&#12463;</dt>
<dd>
<p>&#12522;&#12477;&#12540;&#12473;&#12434;&#38263;&#26399;&#23455;&#34892;&#20013;&#12398;&#12479;&#12473;&#12463;&#12395;&#20351;&#29992;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12290;&#26377;&#21177;&#21270;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#38263;&#26399;&#23455;&#34892;&#20013;&#12398;&#12479;&#12473;&#12463;&#12399;&#12473;&#12479;&#12483;&#12463;&#12392;&#12375;&#12390;&#12524;&#12509;&#12540;&#12488;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12495;&#12531;&#12464;&#12414;&#12391;&#12398;&#26178;&#38291;</dt>
<dd>
<p>&#12479;&#12473;&#12463;&#12364;&#24540;&#31572;&#12375;&#12390;&#12356;&#12394;&#12356;&#12392;&#12415;&#12394;&#12373;&#12428;&#12427;&#12414;&#12391;&#12395;&#23455;&#34892;&#21487;&#33021;&#12394;&#31186;&#25968;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;0&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#35500;&#26126;</dt>
<dd>
<p>&#12522;&#12477;&#12540;&#12473;&#12398;&#35500;&#26126;&#12290;</p>
</dd>
<dt>&#12467;&#12450;&#12539;&#12469;&#12452;&#12474;</dt>
<dd>
<p>&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12395;&#20445;&#25345;&#12373;&#12428;&#12427;&#12473;&#12524;&#12483;&#12489;&#12398;&#25968;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;0&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;</dt>
<dd>
<p>&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12395;&#21547;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12473;&#12524;&#12483;&#12489;&#12398;&#26368;&#22823;&#25968;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12289;2147483647&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12461;&#12540;&#12503;&#12539;&#12450;&#12521;&#12452;&#12502;</dt>
<dd>
<p>&#12473;&#12524;&#12483;&#12489;&#25968;&#12364;&#12467;&#12450;&#12539;&#12469;&#12452;&#12474;&#12424;&#12426;&#12418;&#22823;&#12365;&#12367;&#12394;&#12387;&#12383;&#22580;&#21512;&#12395;&#12473;&#12524;&#12483;&#12489;&#12364;&#12450;&#12452;&#12489;&#12523;&#29366;&#24907;&#12391;&#12356;&#12425;&#12428;&#12427;&#31186;&#25968;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;60&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12473;&#12524;&#12483;&#12489;&#23384;&#32154;&#26178;&#38291;</dt>
<dd>
<p>&#12473;&#12524;&#12483;&#12489;&#25968;&#12364;&#12467;&#12450;&#12539;&#12469;&#12452;&#12474;&#12424;&#12426;&#22823;&#12365;&#12356;&#12363;&#12393;&#12358;&#12363;&#12289;&#12414;&#12383;&#12399;&#12473;&#12524;&#12483;&#12489;&#12364;&#12450;&#12452;&#12489;&#12523;&#29366;&#24907;&#12391;&#12354;&#12427;&#12363;&#12393;&#12358;&#12363;&#12395;&#12363;&#12363;&#12431;&#12425;&#12378;&#12289;&#21508;&#12473;&#12524;&#12483;&#12489;&#12364;&#12497;&#12540;&#12472;&#12373;&#12428;&#12427;&#12414;&#12391;&#12395;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#20869;&#12395;&#23384;&#32154;&#12391;&#12365;&#12427;&#31186;&#25968;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;0&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#12479;&#12473;&#12463;&#12539;&#12461;&#12517;&#12540;&#12539;&#12461;&#12515;&#12497;&#12471;&#12486;&#12451;</dt>
<dd>
<p>&#23455;&#34892;&#12434;&#24453;&#27231;&#12377;&#12427;&#12479;&#12473;&#12463;&#12539;&#12461;&#12517;&#12540;&#12395;&#26684;&#32013;&#12391;&#12365;&#12427;&#36865;&#20449;&#28168;&#12479;&#12473;&#12463;&#12398;&#25968;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12289;2147483647&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;</dt>
<dd>
<p>&#12522;&#12477;&#12540;&#12473;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12290;GlassFish Server&#12391;&#12399;&#12289;&#12371;&#12398;&#12522;&#12477;&#12540;&#12473;&#12539;&#12479;&#12452;&#12503;&#12395;&#12399;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#23450;&#32681;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12414;&#12383;&#12289;&#12371;&#12398;&#12522;&#12477;&#12540;&#12473;&#12539;&#12479;&#12452;&#12503;&#12391;&#12399;&#29694;&#22312;&#12289;&#36861;&#21152;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#20351;&#29992;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>&#12479;&#12540;&#12466;&#12483;&#12488;</dt>
<dd>
<p>(&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12489;&#12513;&#12452;&#12531;&#20869;&#12395;&#12463;&#12521;&#12473;&#12479;&#12414;&#12383;&#12399;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20316;&#25104;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;)</p>
<p>&#12522;&#12477;&#12540;&#12473;&#12398;&#12463;&#12521;&#12473;&#12479;&#12362;&#12424;&#12403;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12290;&#24517;&#35201;&#12394;&#12479;&#12540;&#12466;&#12483;&#12488;&#12434;&#12300;&#36984;&#25246;&#12375;&#12383;&#12479;&#12540;&#12466;&#12483;&#12488;&#12301;&#21015;&#12395;&#31227;&#21205;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12414;&#12383;&#12399;&#12300;&#12377;&#12409;&#12390;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#19981;&#35201;&#12394;&#12479;&#12540;&#12466;&#12483;&#12488;&#12434;&#12300;&#20351;&#29992;&#21487;&#33021;&#12394;&#12479;&#12540;&#12466;&#12483;&#12488;&#12301;&#21015;&#12395;&#31227;&#21205;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#38500;&#21435;&#12301;&#12508;&#12479;&#12531;&#12414;&#12383;&#12399;&#12300;&#12377;&#12409;&#12390;&#38500;&#21435;&#12301;&#12508;&#12479;&#12531;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
</dl>
<a id="sthref25" name="sthref25"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-managedexecutorservicecreate.html">&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-managedexecutorserviceedit.html">&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-managedexecutorservicedelete.html">&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="GHCON142" name="GHCON142"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM840"><code>create-managed-executor-service</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM871"><code>list-managed-executor-services</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM848"><code>delete-managed-executor-service</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
