<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-executorservices" name="ref-executorservices"></a></p>

<h4>&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;<a id="sthref21" name="sthref21"></a><a id="sthref22" name="sthref22"></a></h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12399;&#12289;&#36865;&#20449;&#28168;&#12479;&#12473;&#12463;&#12434;&#38750;&#21516;&#26399;&#12391;&#23455;&#34892;&#12377;&#12427;&#12383;&#12417;&#12395;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12424;&#12387;&#12390;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12479;&#12473;&#12463;&#12399;&#12289;&#12467;&#12531;&#12486;&#12490;&#12395;&#12424;&#12387;&#12390;&#38283;&#22987;&#12362;&#12424;&#12403;&#31649;&#29702;&#12373;&#12428;&#12427;&#12473;&#12524;&#12483;&#12489;&#12391;&#23455;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;&#12467;&#12531;&#12486;&#12490;&#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12399;&#12289;&#12479;&#12473;&#12463;&#12434;&#23455;&#34892;&#12377;&#12427;&#12473;&#12524;&#12483;&#12489;&#12395;&#20253;&#25773;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<p>&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12539;&#12522;&#12477;&#12540;&#12473;&#12372;&#12392;&#12395;&#12289;&#27425;&#12398;&#24773;&#22577;&#12364;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>JNDI&#21517;</dt>
<dd>
<p>&#12522;&#12477;&#12540;&#12473;&#12434;&#35672;&#21029;&#12377;&#12427;&#19968;&#24847;&#12398;&#21517;&#21069;&#12290;</p>
</dd>
<dt>&#35542;&#29702;JNDI&#21517;</dt>
<dd>
<p>&#12522;&#12477;&#12540;&#12473;&#12398;&#35542;&#29702;JNDI&#21517;&#12290;&#35443;&#32048;&#12399;&#12289;<a href="../../../common/en/help/ref-logicaljndinames.html">&#12300;&#35542;&#29702;JNDI&#21517;&#12301;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</dd>
<dt>&#26377;&#21177;</dt>
<dd>
<p>(&#12371;&#12398;&#21015;&#12399;&#12289;&#12489;&#12513;&#12452;&#12531;&#12395;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;<code>server</code>&#12398;&#12415;&#12364;&#23384;&#22312;&#12377;&#12427;&#22580;&#21512;&#12395;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;)</p>
<p>&#12522;&#12477;&#12540;&#12473;&#12364;&#26377;&#21177;&#12394;&#22580;&#21512;&#12399;&#12481;&#12455;&#12483;&#12463;&#12510;&#12540;&#12463;&#12289;&#12522;&#12477;&#12540;&#12473;&#12364;&#28961;&#21177;&#12394;&#22580;&#21512;&#12399;X&#12290;</p>
</dd>
<dt>&#12473;&#12486;&#12540;&#12479;&#12473;</dt>
<dd>
<p>(&#12371;&#12398;&#21015;&#12399;&#12289;&#12489;&#12513;&#12452;&#12531;&#20869;&#12395;&#12463;&#12521;&#12473;&#12479;&#12414;&#12383;&#12399;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20316;&#25104;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12395;&#12398;&#12415;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;)</p>
<p>&#12522;&#12477;&#12540;&#12473;&#12398;&#12479;&#12540;&#12466;&#12483;&#12488;&#12391;&#12354;&#12427;&#12463;&#12521;&#12473;&#12479;&#12392;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#25968;&#12289;&#12362;&#12424;&#12403;&#12381;&#12428;&#12425;&#12398;&#12479;&#12540;&#12466;&#12483;&#12488;&#12398;&#12358;&#12385;&#12289;&#12522;&#12477;&#12540;&#12473;&#12364;&#26377;&#21177;&#21270;&#12373;&#12428;&#12390;&#12356;&#12427;&#25968;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#12300;4&#12479;&#12540;&#12466;&#12483;&#12488;&#12398;2&#12391;&#26377;&#21177;&#12301;&#12399;&#12289;&#12522;&#12477;&#12540;&#12473;&#12364;4&#12388;&#12398;&#12463;&#12521;&#12473;&#12479;&#12392;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#12479;&#12540;&#12466;&#12483;&#12488;&#12392;&#12375;&#12390;&#12362;&#12426;&#12289;&#12381;&#12428;&#12425;4&#12388;&#12398;&#12479;&#12540;&#12466;&#12483;&#12488;&#12398;&#12358;&#12385;&#12289;2&#12388;&#12391;&#26377;&#21177;&#21270;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#24773;&#22577;</dt>
<dd>
<p>&#12473;&#12524;&#12483;&#12489;&#12395;&#20253;&#25773;&#12373;&#12428;&#12383;&#12467;&#12531;&#12486;&#12490;&#12539;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12290;</p>
</dd>
<dt>&#12473;&#12524;&#12483;&#12489;&#20778;&#20808;&#24230;</dt>
<dd>
<p>&#12473;&#12524;&#12483;&#12489;&#12395;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12383;&#20778;&#20808;&#24230;&#12290;</p>
</dd>
<dt>&#35500;&#26126;</dt>
<dd>
<p>&#12522;&#12477;&#12540;&#12473;&#12398;&#35500;&#26126;&#12290;</p>
</dd>
</dl>
<p>&#12300;&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12398;&#34920;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12418;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#26032;&#35215;</dt>
<dd>
<p>&#26032;&#35215;&#12522;&#12477;&#12540;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
<dt>&#21066;&#38500;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12522;&#12477;&#12540;&#12473;&#12434;&#21066;&#38500;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
<dt>&#26377;&#21177;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12522;&#12477;&#12540;&#12473;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
<dt>&#28961;&#21177;</dt>
<dd>
<p>&#36984;&#25246;&#12375;&#12383;1&#12388;&#12414;&#12383;&#12399;&#35079;&#25968;&#12398;&#12522;&#12477;&#12540;&#12473;&#12434;&#28961;&#21177;&#12395;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;</p>
</dd>
</dl>
<a id="sthref23" name="sthref23"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-managedexecutorservicecreate.html">&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-managedexecutorserviceedit.html">&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-managedexecutorservicedelete.html">&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="GHCON140" name="GHCON140"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM840"><code>create-managed-executor-service</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM871"><code>list-managed-executor-services</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM848"><code>delete-managed-executor-service</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
