<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-contextserviceedit" name="ref-contextserviceedit"></a></p>

<h4>&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12469;&#12540;&#12499;&#12473;&#12398;&#32232;&#38598;<a id="sthref19" name="sthref19"></a></h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12469;&#12540;&#12499;&#12473;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12469;&#12540;&#12499;&#12473;&#12398;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12469;&#12540;&#12499;&#12473;&#12398;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;&#27425;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;</p>
<dl>
<dt>&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12489;</dt>
<dd>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12354;&#12427;&#35373;&#23450;&#12434;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12395;&#24489;&#20803;&#12377;&#12427;&#12508;&#12479;&#12531;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12398;&#12394;&#12356;&#35373;&#23450;&#12399;&#22793;&#26356;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt>JNDI&#21517;</dt>
<dd>
<p>&#12522;&#12477;&#12540;&#12473;&#12434;&#35672;&#21029;&#12377;&#12427;&#19968;&#24847;&#12398;JNDI&#21517;&#12290;&#35215;&#21063;&#12395;&#12424;&#12426;&#12289;&#21517;&#21069;&#12399;&#12289;concurrent/&#12289;jdbc/&#12289;jms/&#12398;&#12424;&#12358;&#12395;&#12289;&#12522;&#12477;&#12540;&#12473;&#12539;&#12479;&#12452;&#12503;&#12539;&#12452;&#12531;&#12472;&#12465;&#12540;&#12479;&#12392;&#12473;&#12521;&#12483;&#12471;&#12517;&#12391;&#22987;&#12414;&#12426;&#12414;&#12377;&#12290;JNDI&#21517;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12501;&#12451;&#12540;&#12523;&#12489;&#12391;&#12377;&#12290;JNDI&#21517;&#12434;&#25351;&#23450;&#12391;&#12365;&#12427;&#12398;&#12399;&#12289;&#26032;&#35215;&#12522;&#12477;&#12540;&#12473;&#12398;&#20316;&#25104;&#26178;&#12398;&#12415;&#12391;&#12377;</p>
</dd>
<dt>&#35542;&#29702;JNDI&#21517;</dt>
<dd>
<p>&#12522;&#12477;&#12540;&#12473;&#12398;&#35542;&#29702;JNDI&#21517;&#12290;&#12522;&#12477;&#12540;&#12473;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12427;Java EE&#27161;&#28310;&#21517;&#12391;&#12377;&#12290;&#12300;&#35542;&#29702;JNDI&#21517;&#12301;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12501;&#12451;&#12540;&#12523;&#12489;&#12391;&#12377;&#12290;&#35443;&#32048;&#12399;&#12289;<a href="../../../common/en/help/ref-logicaljndinames.html">&#12300;&#35542;&#29702;JNDI&#21517;&#12301;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
</dd>
<dt>&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#24773;&#22577;</dt>
<dd>
<p>Classloader&#12289;JNDI&#12289;Security&#12289;WorkArea&#12394;&#12393;&#12289;&#12473;&#12524;&#12483;&#12489;&#12395;&#20253;&#25773;&#12377;&#12427;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12290;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12398;&#20253;&#25773;&#12399;&#26377;&#21177;&#21270;&#12377;&#12427;&#12371;&#12392;&#12418;&#28961;&#21177;&#21270;&#12377;&#12427;&#12371;&#12392;&#12418;&#21487;&#33021;&#12391;&#12377;&#12290;&#26377;&#21177;&#21270;&#12373;&#12428;&#12390;&#12356;&#12427;&#12392;&#12289;&#36984;&#25246;&#12373;&#12428;&#12383;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12364;&#20253;&#25773;&#12373;&#12428;&#12414;&#12377;&#12290;&#28961;&#21177;&#21270;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12364;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12390;&#12418;&#20253;&#25773;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12300;&#26377;&#21177;&#12301;&#12391;&#12289;4&#12388;&#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12364;&#12377;&#12409;&#12390;&#36984;&#25246;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#12487;&#12503;&#12525;&#12452;&#38918;&#24207;</dt>
<dd>
<p>&#12371;&#12398;&#12522;&#12477;&#12540;&#12473;&#12398;&#12487;&#12503;&#12525;&#12452;&#38918;&#24207;&#12290;&#12469;&#12540;&#12496;&#12540;&#12398;&#36215;&#21205;&#26178;&#12395;&#12289;&#25968;&#20516;&#12398;&#23567;&#12373;&#12356;&#12522;&#12477;&#12540;&#12473;&#12364;&#20808;&#12395;&#12525;&#12540;&#12489;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;100&#12391;&#12377;&#12290;</p>
</dd>
<dt>&#35500;&#26126;</dt>
<dd>
<p>&#12522;&#12477;&#12540;&#12473;&#12398;&#35500;&#26126;&#12290;</p>
</dd>
<dt>&#12473;&#12486;&#12540;&#12479;&#12473;</dt>
<dd>
<p>&#12522;&#12477;&#12540;&#12473;&#12364;&#23455;&#34892;&#26178;&#12395;&#20351;&#29992;&#21487;&#33021;&#12391;&#12354;&#12427;&#12363;&#12393;&#12358;&#12363;&#12290;</p>
<p>&#12489;&#12513;&#12452;&#12531;&#12395;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12469;&#12540;&#12496;&#12540;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;<code>server</code>&#12398;&#12415;&#12364;&#23384;&#22312;&#12377;&#12427;&#22580;&#21512;&#12289;&#12522;&#12477;&#12540;&#12473;&#12398;&#23455;&#34892;&#26178;&#21487;&#29992;&#24615;&#12399;&#26377;&#21177;&#21270;&#12377;&#12427;&#12371;&#12392;&#12418;&#28961;&#21177;&#21270;&#12377;&#12427;&#12371;&#12392;&#12418;&#21487;&#33021;&#12391;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#23455;&#34892;&#26178;&#21487;&#29992;&#24615;&#12399;&#26377;&#21177;&#21270;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
<p>&#12489;&#12513;&#12452;&#12531;&#12395;&#12463;&#12521;&#12473;&#12479;&#12414;&#12383;&#12399;&#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12531;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#20316;&#25104;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12300;&#12479;&#12540;&#12466;&#12483;&#12488;&#12301;&#12479;&#12502;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;&#12479;&#12540;&#12466;&#12483;&#12488;&#12395;&#12362;&#12369;&#12427;&#12522;&#12477;&#12540;&#12473;&#12398;&#23455;&#34892;&#26178;&#21487;&#29992;&#24615;&#12434;&#21046;&#24481;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt>&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;</dt>
<dd>
<p>&#12522;&#12477;&#12540;&#12473;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12290;GlassFish Server&#12391;&#12399;&#12289;&#12371;&#12398;&#12522;&#12477;&#12540;&#12473;&#12539;&#12479;&#12452;&#12503;&#12395;&#12399;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#23450;&#32681;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12414;&#12383;&#12289;&#12371;&#12398;&#12522;&#12477;&#12540;&#12473;&#12539;&#12479;&#12452;&#12503;&#12391;&#12399;&#29694;&#22312;&#12289;&#36861;&#21152;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#20351;&#29992;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
</dl>
<a id="sthref20" name="sthref20"></a>
<h5>&#38306;&#36899;&#12479;&#12473;&#12463;</h5>
<ul>
<li>
<p><a href="task-contextservicecreate.html">&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-contextserviceedit.html">&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-contextservicedelete.html">&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>
<a id="GHCON137" name="GHCON137"></a>
<h5>&#38306;&#36899;&#12377;&#12427;asadmin&#12467;&#12510;&#12531;&#12489;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM838"><code>create-context-service</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM865"><code>list-context-services</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM846"><code>delete-context-service</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
