<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-contextservicecreate" name="task-contextservicecreate"></a></p>

<h4>&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;<a id="sthref2" name="sthref2"></a></h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12469;&#12540;&#12499;&#12473;&#12399;&#12289;&#12467;&#12531;&#12486;&#12490;&#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12434;&#21462;&#24471;&#12375;&#12289;&#24460;&#12363;&#12425;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12381;&#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#20869;&#12391;&#23455;&#34892;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12377;&#12427;&#21205;&#30340;&#12503;&#12525;&#12461;&#12471;&#12539;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#20316;&#25104;&#12395;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12467;&#12531;&#12486;&#12490;&#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12399;&#12289;&#12479;&#12473;&#12463;&#12434;&#23455;&#34892;&#12377;&#12427;&#12473;&#12524;&#12483;&#12489;&#12395;&#20253;&#25773;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<p>GlassFish Server&#12391;&#12399;&#12289;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12469;&#12540;&#12499;&#12473;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#27083;&#25104;&#12375;&#12289;&#12469;&#12540;&#12502;&#12524;&#12483;&#12488;&#12420;EJB&#12394;&#12393;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12364;&#20351;&#29992;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#12522;&#12477;&#12540;&#12473;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12522;&#12477;&#12540;&#12473;&#12301;&#12494;&#12540;&#12489;&#12391;&#12289;&#12300;&#20006;&#34892;&#20966;&#29702;&#12522;&#12477;&#12540;&#12473;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20006;&#34892;&#20966;&#29702;&#12522;&#12477;&#12540;&#12473;&#12301;&#12494;&#12540;&#12489;&#12391;&#12289;&#12300;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;&#26032;&#35215;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26032;&#35215;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;JNDI&#21517;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12522;&#12477;&#12540;&#12473;&#12434;&#35672;&#21029;&#12377;&#12427;&#19968;&#24847;&#12398;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>JNDI&#21517;&#12399;JNDI&#12493;&#12540;&#12511;&#12531;&#12464;&#12539;&#12469;&#12540;&#12499;&#12473;&#12395;&#30331;&#37682;&#12373;&#12428;&#12289;&#12522;&#12477;&#12540;&#12473;&#12398;&#26908;&#32034;&#12398;&#12383;&#12417;&#12395;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12424;&#12387;&#12390;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;<code>concurrent/</code><i>name</i>&#12392;&#12356;&#12358;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;<code>concurrent/myContextService</code>&#12391;&#12377;&#12290;&#21517;&#21069;&#12395;&#21547;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12398;&#12399;&#12289;&#33521;&#25968;&#23383;&#12289;&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#12289;&#12480;&#12483;&#12471;&#12517;&#12289;&#12414;&#12383;&#12399;&#12489;&#12483;&#12488;&#12398;&#21508;&#25991;&#23383;&#12398;&#12415;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12434;&#12473;&#12524;&#12483;&#12489;&#12395;&#20253;&#25773;&#12377;&#12427;&#12395;&#12399;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#24773;&#22577;&#26377;&#21177;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#20253;&#25773;&#12377;&#12427;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#21270;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289;&#12377;&#12409;&#12390;&#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12364;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#35079;&#25968;&#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12434;&#36984;&#25246;&#12377;&#12427;&#12395;&#12399;&#12289;[Shift]&#12434;&#25276;&#12375;&#12394;&#12364;&#12425;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12363;&#12289;[Ctrl]&#12434;&#25276;&#12375;&#12394;&#12364;&#12425;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#28961;&#21177;&#21270;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12364;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12390;&#12418;&#20253;&#25773;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p>&#12300;&#35500;&#26126;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12522;&#12477;&#12540;&#12473;&#12398;&#31777;&#21336;&#12394;&#35500;&#26126;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#35500;&#26126;&#12399;&#25991;&#23383;&#21015;&#20516;&#12391;&#12289;&#26368;&#22823;250&#25991;&#23383;&#12434;&#20837;&#21147;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12473;&#12486;&#12540;&#12479;&#12473;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#12522;&#12477;&#12540;&#12473;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#21270;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289;&#12522;&#12477;&#12540;&#12473;&#12399;&#20316;&#25104;&#12373;&#12428;&#12427;&#12392;&#12377;&#12368;&#12395;&#20351;&#29992;&#21487;&#33021;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>GlassFish Server&#12391;&#12399;&#12289;&#12371;&#12398;&#12522;&#12477;&#12540;&#12473;&#12539;&#12479;&#12452;&#12503;&#12395;&#12399;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#23450;&#32681;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12414;&#12383;&#12289;&#12371;&#12398;&#12522;&#12477;&#12540;&#12473;&#12539;&#12479;&#12452;&#12503;&#12391;&#12399;&#29694;&#22312;&#12289;&#36861;&#21152;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#20351;&#29992;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p>&#12300;OK&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="GHCON104" name="GHCON104"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-contextserviceedit.html">&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-contextservicedelete.html">&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
