<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-managedexecutorservicecreate" name="task-managedexecutorservicecreate"></a></p>

<h4>&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12391;XXX&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#12522;&#12477;&#12540;&#12473;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12522;&#12477;&#12540;&#12473;&#12301;&#12494;&#12540;&#12489;&#12391;&#12289;&#12300;&#20006;&#34892;&#20966;&#29702;&#12522;&#12477;&#12540;&#12473;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20006;&#34892;&#20966;&#29702;&#12522;&#12477;&#12540;&#12473;&#12301;&#12494;&#12540;&#12489;&#12391;&#12289;&#12300;&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;&#26032;&#35215;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26032;&#35215;&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;JNDI&#21517;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#19968;&#24847;&#12398;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#21517;&#21069;&#12399;JNDI&#12493;&#12540;&#12511;&#12531;&#12464;&#12539;&#12469;&#12540;&#12499;&#12473;&#12395;&#30331;&#37682;&#12373;&#12428;&#12414;&#12377;&#12290;&#12459;&#12540;&#12489;&#24335;&#12398;&#30446;&#37682;&#12395;&#12424;&#12387;&#12390;&#22259;&#26360;&#39208;&#12398;&#34101;&#26360;&#12398;&#20998;&#39006;&#12392;&#20445;&#31649;&#22580;&#25152;&#12398;&#31649;&#29702;&#12434;&#34892;&#12358;&#22580;&#21512;&#12392;&#21516;&#27096;&#12398;&#26041;&#27861;&#12391;&#12289;&#20998;&#25955;&#12467;&#12531;&#12500;&#12517;&#12540;&#12486;&#12451;&#12531;&#12464;&#29872;&#22659;&#12395;&#37197;&#32622;&#12373;&#12428;&#12383;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#32232;&#25104;&#12392;&#22580;&#25152;&#12398;&#31649;&#29702;&#12364;JNDI&#21517;&#12395;&#12424;&#12387;&#12390;&#34892;&#12431;&#12428;&#12414;&#12377;&#12290;&#12381;&#12398;&#12383;&#12417;&#12289;JNDI&#21517;&#12399;&#12522;&#12477;&#12540;&#12473;&#12408;&#12398;&#37325;&#35201;&#12394;&#12450;&#12463;&#12475;&#12473;&#26041;&#27861;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>XXX</p>
</li>
<li>
<p>&#12300;&#35500;&#26126;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12522;&#12477;&#12540;&#12473;&#12398;&#31777;&#21336;&#12394;&#35500;&#26126;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#35500;&#26126;&#12399;&#25991;&#23383;&#21015;&#20516;&#12391;&#12289;&#26368;&#22823;250&#25991;&#23383;&#12434;&#20837;&#21147;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12473;&#12486;&#12540;&#12479;&#12473;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#12522;&#12477;&#12540;&#12473;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12522;&#12477;&#12540;&#12473;&#12399;&#26377;&#21177;&#12391;&#12289;&#20316;&#25104;&#24460;&#12377;&#12368;&#12395;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#12289;&#12522;&#12477;&#12540;&#12473;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>GlassFish Server&#12399;&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12539;&#12522;&#12477;&#12540;&#12473;&#12398;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#23450;&#32681;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#34920;&#31034;&#12373;&#12428;&#12427;&#31354;&#30333;&#34892;&#12391;&#12289;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#21517;&#12434;&#20837;&#21147;&#12375;&#12289;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;OK&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="GHCON110" name="GHCON110"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-managedexecutorserviceedit.html">&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-managedexecutorservicedelete.html">&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
