<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-managedscheduledexecutorservicecreate" name="task-managedscheduledexecutorservicecreate"></a></p>

<h4>&#31649;&#29702;&#23550;&#35937;&#12473;&#12465;&#12472;&#12517;&#12540;&#12523;&#28168;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;<a id="sthref8" name="sthref8"></a></h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#31649;&#29702;&#23550;&#35937;&#12473;&#12465;&#12472;&#12517;&#12540;&#12523;&#28168;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12399;&#12289;&#36865;&#20449;&#28168;&#12479;&#12473;&#12463;&#12434;&#25351;&#23450;&#12373;&#12428;&#12383;&#26178;&#38291;&#12395;&#38750;&#21516;&#26399;&#12391;&#23455;&#34892;&#12377;&#12427;&#12383;&#12417;&#12395;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12424;&#12387;&#12390;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12479;&#12473;&#12463;&#12399;&#12289;&#12467;&#12531;&#12486;&#12490;&#12395;&#12424;&#12387;&#12390;&#38283;&#22987;&#12362;&#12424;&#12403;&#31649;&#29702;&#12373;&#12428;&#12427;&#12473;&#12524;&#12483;&#12489;&#12391;&#23455;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;&#12467;&#12531;&#12486;&#12490;&#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12399;&#12289;&#12479;&#12473;&#12463;&#12434;&#23455;&#34892;&#12377;&#12427;&#12473;&#12524;&#12483;&#12489;&#12395;&#20253;&#25773;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<p>GlassFish Server&#12391;&#12399;&#12289;&#31649;&#29702;&#23550;&#35937;&#12473;&#12465;&#12472;&#12517;&#12540;&#12523;&#28168;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12539;&#12522;&#12477;&#12540;&#12473;&#12434;&#27083;&#25104;&#12375;&#12289;&#12469;&#12540;&#12502;&#12524;&#12483;&#12488;&#12420;EJB&#12394;&#12393;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12364;&#20351;&#29992;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;&#12479;&#12473;&#12463;&#12398;&#23455;&#38555;&#12398;&#12473;&#12465;&#12472;&#12517;&#12540;&#12523;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12424;&#12387;&#12390;&#12503;&#12525;&#12464;&#12521;&#12512;&#12391;&#23455;&#35013;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#12522;&#12477;&#12540;&#12473;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12522;&#12477;&#12540;&#12473;&#12301;&#12494;&#12540;&#12489;&#12391;&#12289;&#12300;&#20006;&#34892;&#20966;&#29702;&#12522;&#12477;&#12540;&#12473;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20006;&#34892;&#20966;&#29702;&#12522;&#12477;&#12540;&#12473;&#12301;&#12494;&#12540;&#12489;&#12391;&#12289;&#12300;&#31649;&#29702;&#23550;&#35937;&#12473;&#12465;&#12472;&#12517;&#12540;&#12523;&#28168;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#31649;&#29702;&#23550;&#35937;&#12473;&#12465;&#12472;&#12517;&#12540;&#12523;&#28168;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#31649;&#29702;&#23550;&#35937;&#12473;&#12465;&#12472;&#12517;&#12540;&#12523;&#28168;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#12300;&#26032;&#35215;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#26032;&#35215;&#31649;&#29702;&#23550;&#35937;&#12473;&#12465;&#12472;&#12517;&#12540;&#12523;&#28168;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;JNDI&#21517;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12522;&#12477;&#12540;&#12473;&#12434;&#35672;&#21029;&#12377;&#12427;&#19968;&#24847;&#12398;&#21517;&#21069;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>JNDI&#21517;&#12399;JNDI&#12493;&#12540;&#12511;&#12531;&#12464;&#12539;&#12469;&#12540;&#12499;&#12473;&#12395;&#30331;&#37682;&#12373;&#12428;&#12289;&#12522;&#12477;&#12540;&#12473;&#12398;&#26908;&#32034;&#12398;&#12383;&#12417;&#12395;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12424;&#12387;&#12390;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;<code>concurrent/</code><i>name</i>&#12392;&#12356;&#12358;&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;<code>concurrent/myManagedScheduledExecutorService</code>&#12391;&#12377;&#12290;&#21517;&#21069;&#12395;&#21547;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12398;&#12399;&#12289;&#33521;&#25968;&#23383;&#12289;&#12450;&#12531;&#12480;&#12540;&#12473;&#12467;&#12450;&#12289;&#12480;&#12483;&#12471;&#12517;&#12289;&#12414;&#12383;&#12399;&#12489;&#12483;&#12488;&#12398;&#21508;&#25991;&#23383;&#12398;&#12415;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12434;&#12473;&#12524;&#12483;&#12489;&#12395;&#20253;&#25773;&#12377;&#12427;&#12395;&#12399;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#24773;&#22577;&#26377;&#21177;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#20253;&#25773;&#12377;&#12427;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#21270;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289;&#12377;&#12409;&#12390;&#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12364;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#35079;&#25968;&#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12434;&#36984;&#25246;&#12377;&#12427;&#12395;&#12399;&#12289;[Shift]&#12434;&#25276;&#12375;&#12394;&#12364;&#12425;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12363;&#12289;[Ctrl]&#12434;&#25276;&#12375;&#12394;&#12364;&#12425;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#28961;&#21177;&#21270;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12364;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12390;&#12418;&#20253;&#25773;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p>&#12300;&#12473;&#12486;&#12540;&#12479;&#12473;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#12522;&#12477;&#12540;&#12473;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#21270;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289;&#12522;&#12477;&#12540;&#12473;&#12399;&#20316;&#25104;&#12373;&#12428;&#12427;&#12392;&#12377;&#12368;&#12395;&#20351;&#29992;&#21487;&#33021;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12473;&#12524;&#12483;&#12489;&#20778;&#20808;&#24230;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#20316;&#25104;&#12373;&#12428;&#12383;&#12473;&#12524;&#12483;&#12489;&#12395;&#21106;&#12426;&#24403;&#12390;&#12427;&#20778;&#20808;&#24230;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;5&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#38263;&#26399;&#23455;&#34892;&#20013;&#12398;&#12479;&#12473;&#12463;&#12395;&#12522;&#12477;&#12540;&#12473;&#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#38263;&#26399;&#23455;&#34892;&#20013;&#12398;&#12479;&#12473;&#12463;&#26377;&#21177;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#26377;&#21177;&#21270;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#38263;&#26399;&#23455;&#34892;&#20013;&#12398;&#12479;&#12473;&#12463;&#12399;&#12473;&#12479;&#12483;&#12463;&#12392;&#12375;&#12390;&#12524;&#12509;&#12540;&#12488;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12495;&#12531;&#12464;&#12414;&#12391;&#12398;&#26178;&#38291;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12479;&#12473;&#12463;&#12364;&#24540;&#31572;&#12375;&#12390;&#12356;&#12394;&#12356;&#12392;&#12415;&#12394;&#12373;&#12428;&#12427;&#12414;&#12391;&#12395;&#23455;&#34892;&#21487;&#33021;&#12394;&#31186;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;0&#12391;&#12289;&#12479;&#12473;&#12463;&#12364;&#24540;&#31572;&#12375;&#12390;&#12356;&#12394;&#12356;&#12392;&#12415;&#12394;&#12373;&#12428;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p>&#12300;&#35500;&#26126;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12522;&#12477;&#12540;&#12473;&#12398;&#31777;&#21336;&#12394;&#35500;&#26126;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#35500;&#26126;&#12399;&#25991;&#23383;&#21015;&#20516;&#12391;&#12289;&#26368;&#22823;250&#25991;&#23383;&#12434;&#20837;&#21147;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12467;&#12450;&#12539;&#12469;&#12452;&#12474;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12450;&#12452;&#12489;&#12523;&#29366;&#24907;&#12398;&#22580;&#21512;&#12391;&#12418;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12395;&#20445;&#25345;&#12377;&#12427;&#12473;&#12524;&#12483;&#12489;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;0&#12391;&#12289;&#26368;&#21021;&#12398;&#12479;&#12473;&#12463;&#12364;&#12473;&#12465;&#12472;&#12517;&#12540;&#12523;&#12373;&#12428;&#12427;&#12392;&#12473;&#12524;&#12483;&#12489;&#12364;1&#12388;&#20316;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12461;&#12540;&#12503;&#12539;&#12450;&#12521;&#12452;&#12502;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12473;&#12524;&#12483;&#12489;&#25968;&#12364;&#12467;&#12450;&#12539;&#12469;&#12452;&#12474;&#12424;&#12426;&#22823;&#12365;&#12356;&#22580;&#21512;&#12395;&#12289;&#12473;&#12524;&#12483;&#12489;&#12364;&#12450;&#12452;&#12489;&#12523;&#29366;&#24907;&#12391;&#12356;&#12425;&#12428;&#12427;&#31186;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;60&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12473;&#12524;&#12483;&#12489;&#23384;&#32154;&#26178;&#38291;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12473;&#12524;&#12483;&#12489;&#25968;&#12364;&#12467;&#12450;&#12539;&#12469;&#12452;&#12474;&#12424;&#12426;&#22823;&#12365;&#12356;&#12363;&#12393;&#12358;&#12363;&#12289;&#12414;&#12383;&#12399;&#12473;&#12524;&#12483;&#12489;&#12364;&#12450;&#12452;&#12489;&#12523;&#29366;&#24907;&#12391;&#12354;&#12427;&#12363;&#12393;&#12358;&#12363;&#12395;&#12363;&#12363;&#12431;&#12425;&#12378;&#12289;&#21508;&#12473;&#12524;&#12483;&#12489;&#12364;&#12497;&#12540;&#12472;&#12373;&#12428;&#12427;&#12414;&#12391;&#12395;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#20869;&#12395;&#23384;&#32154;&#12391;&#12365;&#12427;&#31186;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;0&#12391;&#12289;&#12473;&#12524;&#12483;&#12489;&#12399;&#12497;&#12540;&#12472;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p>&#12300;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>GlassFish Server&#12391;&#12399;&#12289;&#12371;&#12398;&#12522;&#12477;&#12540;&#12473;&#12539;&#12479;&#12452;&#12503;&#12395;&#12399;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#23450;&#32681;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12414;&#12383;&#12289;&#12371;&#12398;&#12522;&#12477;&#12540;&#12473;&#12539;&#12479;&#12452;&#12503;&#12391;&#12399;&#29694;&#22312;&#12289;&#36861;&#21152;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#20351;&#29992;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p>&#12300;OK&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="GHCON116" name="GHCON116"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-managedscheduledexecutorserviceedit.html">&#31649;&#29702;&#23550;&#35937;&#12473;&#12465;&#12472;&#12517;&#12540;&#12523;&#28168;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-managedscheduledexecutorservicedelete.html">&#31649;&#29702;&#23550;&#35937;&#12473;&#12465;&#12472;&#12517;&#12540;&#12523;&#28168;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
