<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-managedexecutorserviceedit" name="task-managedexecutorserviceedit"></a></p>

<h4>&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#32232;&#38598;&#12377;&#12427;&#12395;&#12399;<a id="sthref6" name="sthref6"></a></h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#12522;&#12477;&#12540;&#12473;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12522;&#12477;&#12540;&#12473;&#12301;&#12494;&#12540;&#12489;&#12391;&#12289;&#12300;&#20006;&#34892;&#20966;&#29702;&#12522;&#12477;&#12540;&#12473;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20006;&#34892;&#20966;&#29702;&#12522;&#12477;&#12540;&#12473;&#12301;&#12494;&#12540;&#12489;&#12391;&#12289;&#12300;&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12391;&#12289;&#32232;&#38598;&#12377;&#12427;&#12522;&#12477;&#12540;&#12473;&#12398;&#21517;&#21069;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12398;&#32232;&#38598;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
JNDI&#21517;&#12399;&#35501;&#21462;&#12426;&#23554;&#29992;&#12501;&#12451;&#12540;&#12523;&#12489;&#12391;&#12377;&#12290;JNDI&#21517;&#12434;&#25351;&#23450;&#12391;&#12365;&#12427;&#12398;&#12399;&#12289;&#26032;&#35215;&#12522;&#12477;&#12540;&#12473;&#12398;&#20316;&#25104;&#26178;&#12398;&#12415;&#12391;&#12377;&#12290;&#12300;&#35542;&#29702;JNDI&#21517;&#12301;&#12418;&#35501;&#21462;&#12426;&#23554;&#29992;&#12501;&#12451;&#12540;&#12523;&#12489;&#12391;&#12377;&#12290;
<hr>

</li>
<li>
<p>&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12434;&#12473;&#12524;&#12483;&#12489;&#12395;&#20253;&#25773;&#12377;&#12427;&#12395;&#12399;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#24773;&#22577;&#26377;&#21177;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#20253;&#25773;&#12377;&#12427;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#21270;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289;&#12377;&#12409;&#12390;&#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12364;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#35079;&#25968;&#12398;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12434;&#36984;&#25246;&#12377;&#12427;&#12395;&#12399;&#12289;[Shift]&#12434;&#25276;&#12375;&#12394;&#12364;&#12425;&#12463;&#12522;&#12483;&#12463;&#12377;&#12427;&#12363;&#12289;[Ctrl]&#12434;&#25276;&#12375;&#12394;&#12364;&#12425;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12364;&#28961;&#21177;&#21270;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12364;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12390;&#12418;&#20253;&#25773;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p>&#12300;&#12473;&#12486;&#12540;&#12479;&#12473;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#12522;&#12477;&#12540;&#12473;&#12434;&#26377;&#21177;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12473;&#12524;&#12483;&#12489;&#20778;&#20808;&#24230;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#20316;&#25104;&#12373;&#12428;&#12383;&#12473;&#12524;&#12483;&#12489;&#12395;&#21106;&#12426;&#24403;&#12390;&#12427;&#20778;&#20808;&#24230;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;5&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#38263;&#26399;&#23455;&#34892;&#20013;&#12398;&#12479;&#12473;&#12463;&#12395;&#12522;&#12477;&#12540;&#12473;&#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#38263;&#26399;&#23455;&#34892;&#20013;&#12398;&#12479;&#12473;&#12463;&#26377;&#21177;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#26377;&#21177;&#21270;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#38263;&#26399;&#23455;&#34892;&#20013;&#12398;&#12479;&#12473;&#12463;&#12399;&#12473;&#12479;&#12483;&#12463;&#12392;&#12375;&#12390;&#12524;&#12509;&#12540;&#12488;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12495;&#12531;&#12464;&#12414;&#12391;&#12398;&#26178;&#38291;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12479;&#12473;&#12463;&#12364;&#24540;&#31572;&#12375;&#12390;&#12356;&#12394;&#12356;&#12392;&#12415;&#12394;&#12373;&#12428;&#12427;&#12414;&#12391;&#12395;&#23455;&#34892;&#21487;&#33021;&#12394;&#31186;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;0&#12391;&#12289;&#12479;&#12473;&#12463;&#12364;&#24540;&#31572;&#12375;&#12390;&#12356;&#12394;&#12356;&#12392;&#12415;&#12394;&#12373;&#12428;&#12427;&#12371;&#12392;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p>&#12300;&#12487;&#12503;&#12525;&#12452;&#38918;&#24207;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#25968;&#20516;&#12434;&#20837;&#21147;&#12375;&#12289;&#12522;&#12477;&#12540;&#12473;&#12398;&#12487;&#12503;&#12525;&#12452;&#38918;&#24207;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12469;&#12540;&#12496;&#12540;&#12398;&#36215;&#21205;&#26178;&#12395;&#12289;&#25968;&#20516;&#12398;&#23567;&#12373;&#12356;&#12522;&#12477;&#12540;&#12473;&#12364;&#20808;&#12395;&#12525;&#12540;&#12489;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;100&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#35500;&#26126;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12522;&#12477;&#12540;&#12473;&#12398;&#31777;&#21336;&#12394;&#35500;&#26126;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#35500;&#26126;&#12399;&#25991;&#23383;&#21015;&#20516;&#12391;&#12289;&#26368;&#22823;250&#25991;&#23383;&#12434;&#20837;&#21147;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12467;&#12450;&#12539;&#12469;&#12452;&#12474;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12450;&#12452;&#12489;&#12523;&#29366;&#24907;&#12398;&#22580;&#21512;&#12391;&#12418;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12395;&#20445;&#25345;&#12377;&#12427;&#12473;&#12524;&#12483;&#12489;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#26032;&#12375;&#12356;&#12479;&#12473;&#12463;&#12398;&#36865;&#20449;&#26178;&#12395;&#12289;&#23455;&#34892;&#20013;&#12398;&#12473;&#12524;&#12483;&#12489;&#25968;&#12364;&#12467;&#12450;&#12539;&#12469;&#12452;&#12474;&#12434;&#19979;&#22238;&#12387;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12381;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#20966;&#29702;&#12377;&#12427;&#12383;&#12417;&#12395;&#26032;&#12375;&#12356;&#12473;&#12524;&#12483;&#12489;&#12364;1&#12388;&#20316;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;0&#12391;&#12289;&#12479;&#12473;&#12463;&#12539;&#12461;&#12517;&#12540;&#12364;&#12356;&#12387;&#12401;&#12356;&#12391;&#12354;&#12427;&#12363;&#12289;&#12522;&#12477;&#12540;&#12473;&#12364;&#30452;&#25509;&#12461;&#12517;&#12540;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12434;&#38500;&#12365;&#12289;&#26032;&#12375;&#12356;&#12473;&#12524;&#12483;&#12489;&#12399;&#20316;&#25104;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#30452;&#25509;&#12461;&#12517;&#12540;&#12399;&#12289;&#12479;&#12473;&#12463;&#12539;&#12461;&#12517;&#12540;&#12539;&#12461;&#12515;&#12497;&#12471;&#12486;&#12451;&#12364;0&#12398;&#22580;&#21512;&#12420;&#12289;&#12479;&#12473;&#12463;&#12539;&#12461;&#12517;&#12540;&#12539;&#12461;&#12515;&#12497;&#12471;&#12486;&#12451;&#12364;2147483647&#12391;&#12467;&#12450;&#12539;&#12469;&#12452;&#12474;&#12364;0&#12398;&#22580;&#21512;&#12395;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#26368;&#22823;&#12503;&#12540;&#12523;&#12539;&#12469;&#12452;&#12474;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12395;&#21547;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12473;&#12524;&#12483;&#12489;&#12398;&#26368;&#22823;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;2147483647&#12391;&#12289;&#21407;&#21063;&#30340;&#12395;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#12399;&#12496;&#12452;&#12531;&#12489;&#12373;&#12428;&#12378;&#12289;&#20219;&#24847;&#12398;&#25968;&#12398;&#12473;&#12524;&#12483;&#12489;&#12434;&#21547;&#12417;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12461;&#12540;&#12503;&#12539;&#12450;&#12521;&#12452;&#12502;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12473;&#12524;&#12483;&#12489;&#25968;&#12364;&#12467;&#12450;&#12539;&#12469;&#12452;&#12474;&#12424;&#12426;&#22823;&#12365;&#12356;&#22580;&#21512;&#12395;&#12289;&#12473;&#12524;&#12483;&#12489;&#12364;&#12450;&#12452;&#12489;&#12523;&#29366;&#24907;&#12391;&#12356;&#12425;&#12428;&#12427;&#31186;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;60&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12473;&#12524;&#12483;&#12489;&#23384;&#32154;&#26178;&#38291;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12473;&#12524;&#12483;&#12489;&#25968;&#12364;&#12467;&#12450;&#12539;&#12469;&#12452;&#12474;&#12424;&#12426;&#22823;&#12365;&#12356;&#12363;&#12393;&#12358;&#12363;&#12289;&#12414;&#12383;&#12399;&#12473;&#12524;&#12483;&#12489;&#12364;&#12450;&#12452;&#12489;&#12523;&#29366;&#24907;&#12391;&#12354;&#12427;&#12363;&#12393;&#12358;&#12363;&#12395;&#12363;&#12363;&#12431;&#12425;&#12378;&#12289;&#21508;&#12473;&#12524;&#12483;&#12489;&#12364;&#12497;&#12540;&#12472;&#12373;&#12428;&#12427;&#12414;&#12391;&#12395;&#12473;&#12524;&#12483;&#12489;&#12539;&#12503;&#12540;&#12523;&#20869;&#12395;&#23384;&#32154;&#12391;&#12365;&#12427;&#31186;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;0&#12391;&#12289;&#12473;&#12524;&#12483;&#12489;&#12399;&#12497;&#12540;&#12472;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p>&#12300;&#12479;&#12473;&#12463;&#12539;&#12461;&#12517;&#12540;&#12539;&#12461;&#12515;&#12497;&#12471;&#12486;&#12451;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#23455;&#34892;&#12434;&#24453;&#27231;&#12377;&#12427;&#12479;&#12473;&#12463;&#12539;&#12461;&#12517;&#12540;&#12395;&#26684;&#32013;&#12391;&#12365;&#12427;&#36865;&#20449;&#28168;&#12479;&#12473;&#12463;&#12398;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;2147483647&#12391;&#12289;&#21407;&#21063;&#30340;&#12395;&#12479;&#12473;&#12463;&#12539;&#12461;&#12517;&#12540;&#12399;&#12496;&#12452;&#12531;&#12489;&#12373;&#12428;&#12378;&#12289;&#20219;&#24847;&#12398;&#25968;&#12398;&#36865;&#20449;&#28168;&#12479;&#12473;&#12463;&#12434;&#26684;&#32013;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>GlassFish Server&#12391;&#12399;&#12289;&#12371;&#12398;&#12522;&#12477;&#12540;&#12473;&#12539;&#12479;&#12452;&#12503;&#12395;&#12399;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#23450;&#32681;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12414;&#12383;&#12289;&#12371;&#12398;&#12522;&#12477;&#12540;&#12473;&#12539;&#12479;&#12452;&#12503;&#12391;&#12399;&#29694;&#22312;&#12289;&#36861;&#21152;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#20351;&#29992;&#12375;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="GHCON112" name="GHCON112"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-managedexecutorservicecreate.html">&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#20316;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-managedexecutorservicedelete.html">&#31649;&#29702;&#23550;&#35937;&#12456;&#12464;&#12476;&#12461;&#12517;&#12540;&#12479;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
