<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-managedexecutorserviceedit" name="task-managedexecutorserviceedit"></a></p>

<h4>&#32534;&#36753;&#25176;&#31649;&#25191;&#34892;&#31243;&#24207;&#26381;&#21153;<a id="sthref6" name="sthref6"></a></h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#23548;&#33322;&#26641;&#20013;&#65292;&#23637;&#24320;&ldquo;&#36164;&#28304;&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#36164;&#28304;&rdquo;&#33410;&#28857;&#19979;&#65292;&#23637;&#24320;&ldquo;&#24182;&#21457;&#36164;&#28304;&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#24182;&#21457;&#36164;&#28304;&rdquo;&#33410;&#28857;&#19979;&#65292;&#36873;&#25321;&ldquo;&#25176;&#31649;&#25191;&#34892;&#31243;&#24207;&#26381;&#21153;&rdquo;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#25176;&#31649;&#25191;&#34892;&#31243;&#24207;&#26381;&#21153;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#25176;&#31649;&#25191;&#34892;&#31243;&#24207;&#26381;&#21153;&rdquo;&#39029;&#19978;&#65292;&#21333;&#20987;&#35201;&#32534;&#36753;&#30340;&#36164;&#28304;&#30340;&#21517;&#31216;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#32534;&#36753;&#25176;&#31649;&#25191;&#34892;&#31243;&#24207;&#26381;&#21153;&rdquo;&#39029;&#12290;</p>

<hr>
<p><b>&#27880;:</b></p>
JNDI &#21517;&#31216;&#26159;&#21482;&#35835;&#23383;&#27573;&#12290;&#21482;&#33021;&#22312;&#21019;&#24314;&#26032;&#36164;&#28304;&#26102;&#25351;&#23450; JNDI &#21517;&#31216;&#12290;&#36923;&#36753; JNDI &#21517;&#31216;&#20063;&#26159;&#21482;&#35835;&#23383;&#27573;&#12290;
<hr>

</li>
<li>
<p>&#36873;&#25321;&ldquo;&#21551;&#29992;&#19978;&#19979;&#25991;&#20449;&#24687;&rdquo;&#22797;&#36873;&#26694;&#20197;&#23558;&#19978;&#19979;&#25991;&#20256;&#25773;&#21040;&#32447;&#31243;&#65292;&#28982;&#21518;&#36873;&#25321;&#35201;&#20256;&#25773;&#30340;&#19978;&#19979;&#25991;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#27492;&#36873;&#39033;&#24050;&#21551;&#29992;&#65292;&#24182;&#19988;&#36873;&#20013;&#25152;&#26377;&#19978;&#19979;&#25991;&#12290;&#36890;&#36807;&#25353;&#20303; Shift &#38190;&#21333;&#20987;&#25110;&#25353;&#20303; Ctrl &#38190;&#21333;&#20987;&#36873;&#25321;&#22810;&#20010;&#19978;&#19979;&#25991;&#12290;&#22914;&#26524;&#31105;&#29992;&#20102;&#27492;&#36873;&#39033;&#65292;&#21017;&#19981;&#20256;&#25773;&#19978;&#19979;&#25991;&#65292;&#21363;&#20351;&#24050;&#36873;&#20013;&#20102;&#23427;&#20204;&#20063;&#26159;&#22914;&#27492;&#12290;</p>
</li>
<li>
<p>&#36873;&#25321;&ldquo;&#21551;&#29992;&#29366;&#24577;&rdquo;&#22797;&#36873;&#26694;&#20197;&#21551;&#29992;&#36164;&#28304;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#21551;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#32447;&#31243;&#20248;&#20808;&#32423;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#20998;&#37197;&#32473;&#24050;&#21019;&#24314;&#32447;&#31243;&#30340;&#20248;&#20808;&#32423;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 5&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#21551;&#29992;&#38271;&#26102;&#38388;&#36816;&#34892;&#20219;&#21153;&rdquo;&#22797;&#36873;&#26694;&#20197;&#20351;&#29992;&#36164;&#28304;&#26469;&#36816;&#34892;&#38271;&#26102;&#38388;&#36816;&#34892;&#30340;&#20219;&#21153;&#12290;</p>
<p>&#22914;&#26524;&#21551;&#29992;&#65292;&#21017;&#19981;&#23558;&#38271;&#26102;&#38388;&#36816;&#34892;&#30340;&#20219;&#21153;&#25253;&#21578;&#20026;&#31896;&#28382;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#25346;&#36215;&#21069;&#26102;&#38388;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#22312;&#23558;&#20219;&#21153;&#35270;&#20026;&#26080;&#21709;&#24212;&#20043;&#21069;&#20219;&#21153;&#21487;&#25191;&#34892;&#30340;&#31186;&#25968;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 0&#65292;&#36825;&#34920;&#31034;&#20174;&#19981;&#23558;&#20219;&#21153;&#35270;&#20026;&#26080;&#21709;&#24212;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#37096;&#32626;&#39034;&#24207;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#19968;&#20010;&#25968;&#23383;&#20197;&#25351;&#23450;&#36164;&#28304;&#30340;&#37096;&#32626;&#39034;&#24207;&#12290;</p>
<p>&#22312;&#26381;&#21153;&#22120;&#21551;&#21160;&#26102;&#20808;&#21152;&#36733;&#32534;&#21495;&#36739;&#20302;&#30340;&#36164;&#28304;&#12290;&#40664;&#35748;&#20540;&#20026; 100&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#35828;&#26126;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#36164;&#28304;&#30340;&#31616;&#30701;&#35828;&#26126;&#12290;</p>
<p>&#27492;&#35828;&#26126;&#26159;&#23383;&#31526;&#20018;&#20540;&#65292;&#26368;&#22810;&#21487;&#20197;&#21253;&#21547; 250 &#20010;&#23383;&#31526;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26680;&#24515;&#22823;&#23567;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#32447;&#31243;&#27744;&#20013;&#20445;&#30041;&#30340;&#32447;&#31243;&#25968; (&#21363;&#20351;&#36825;&#20123;&#32447;&#31243;&#31354;&#38386;)&#12290;</p>
<p>&#25552;&#20132;&#20102;&#26032;&#20219;&#21153;&#24182;&#19988;&#27491;&#22312;&#36816;&#34892;&#32447;&#31243;&#30340;&#25968;&#37327;&#23567;&#20110;&#26680;&#24515;&#22823;&#23567;&#26102;&#65292;&#23558;&#21019;&#24314;&#26032;&#32447;&#31243;&#26469;&#22788;&#29702;&#35831;&#27714;&#12290;&#40664;&#35748;&#20540;&#20026; 0&#65292;&#34920;&#31034;&#38500;&#38750;&#20219;&#21153;&#38431;&#21015;&#24050;&#28385;&#25110;&#32773;&#36164;&#28304;&#20351;&#29992;&#20102;&#30452;&#25509;&#25490;&#38431;&#65292;&#21542;&#21017;&#20174;&#19981;&#21019;&#24314;&#26032;&#32447;&#31243;&#12290;&#20219;&#21153;&#38431;&#21015;&#23481;&#37327;&#20026; 0 &#26102;&#65292;&#25110;&#32773;&#20219;&#21153;&#38431;&#21015;&#23481;&#37327;&#20026; 2147483647 &#19988;&#26680;&#24515;&#22823;&#23567;&#20026; 0 &#26102;&#23558;&#20986;&#29616;&#30452;&#25509;&#25490;&#38431;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26368;&#22823;&#27744;&#22823;&#23567;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#32447;&#31243;&#27744;&#21487;&#20197;&#21253;&#21547;&#30340;&#26368;&#22823;&#32447;&#31243;&#25968;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 2147483647&#65292;&#36825;&#34920;&#31034;&#32447;&#31243;&#27744;&#23454;&#38469;&#19978;&#27809;&#26377;&#19978;&#38480;&#65292;&#21487;&#20197;&#21253;&#21547;&#20219;&#24847;&#25968;&#37327;&#30340;&#32447;&#31243;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#20445;&#25345;&#27963;&#21160;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#24403;&#32447;&#31243;&#25968;&#22823;&#20110;&#26680;&#24515;&#22823;&#23567;&#26102;&#32447;&#31243;&#21487;&#20197;&#20445;&#25345;&#31354;&#38386;&#29366;&#24577;&#30340;&#31186;&#25968;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 60&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#32447;&#31243;&#26377;&#25928;&#26399;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#32447;&#31243;&#22312;&#34987;&#28165;&#38500;&#20043;&#21069;&#21487;&#20197;&#20445;&#30041;&#22312;&#32447;&#31243;&#27744;&#20013;&#30340;&#31186;&#25968;&#65292;&#32780;&#26080;&#35770;&#32447;&#31243;&#25968;&#26159;&#21542;&#22823;&#20110;&#26680;&#24515;&#22823;&#23567;&#25110;&#32447;&#31243;&#26159;&#21542;&#22788;&#20110;&#31354;&#38386;&#29366;&#24577;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 0&#65292;&#34920;&#31034;&#20174;&#19981;&#28165;&#38500;&#32447;&#31243;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#20219;&#21153;&#38431;&#21015;&#23481;&#37327;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#21487;&#20197;&#23384;&#20648;&#22312;&#31561;&#24453;&#25191;&#34892;&#30340;&#20219;&#21153;&#38431;&#21015;&#20013;&#30340;&#24050;&#25552;&#20132;&#20219;&#21153;&#25968;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 2147483647&#65292;&#36825;&#34920;&#31034;&#20219;&#21153;&#38431;&#21015;&#23454;&#38469;&#19978;&#27809;&#26377;&#19978;&#38480;&#65292;&#21487;&#20197;&#23384;&#20648;&#20219;&#24847;&#25968;&#37327;&#30340;&#24050;&#25552;&#20132;&#20219;&#21153;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#20854;&#20182;&#23646;&#24615;&rdquo;&#37096;&#20998;&#20013;&#65292;&#19981;&#35201;&#28155;&#21152;&#20219;&#20309;&#20854;&#20182;&#23646;&#24615;&#12290;</p>
<p>GlassFish Server &#27809;&#26377;&#20026;&#27492;&#36164;&#28304;&#31867;&#22411;&#23450;&#20041;&#20219;&#20309;&#20854;&#20182;&#23646;&#24615;&#12290;&#27492;&#22806;&#65292;&#27492;&#36164;&#28304;&#31867;&#22411;&#24403;&#21069;&#19981;&#20351;&#29992;&#20219;&#20309;&#20854;&#20182;&#23646;&#24615;&#12290;</p>
</li>
<li>
<p>&#21333;&#20987;&ldquo;&#20445;&#23384;&rdquo;&#12290;</p>
</li>
</ol>
<a id="GHCON112" name="GHCON112"></a>
<h5>&#21478;&#35831;&#21442;&#38405;</h5>
<ul>
<li>
<p><a href="task-managedexecutorservicecreate.html">&#21019;&#24314;&#25176;&#31649;&#25191;&#34892;&#31243;&#24207;&#26381;&#21153;</a></p>
</li>
<li>
<p><a href="task-managedexecutorservicedelete.html">&#21024;&#38500;&#25176;&#31649;&#25191;&#34892;&#31243;&#24207;&#26381;&#21153;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
