<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-managedscheduledexecutorservicecreate" name="task-managedscheduledexecutorservicecreate"></a></p>

<h4>&#21019;&#24314;&#25176;&#31649;&#35843;&#24230;&#25191;&#34892;&#31243;&#24207;&#26381;&#21153;<a id="sthref8" name="sthref8"></a></h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#25176;&#31649;&#30340;&#24050;&#35843;&#24230;&#25191;&#34892;&#31243;&#24207;&#26381;&#21153;&#30001;&#24212;&#29992;&#31243;&#24207;&#29992;&#20110;&#22312;&#29305;&#23450;&#26102;&#38388;&#24322;&#27493;&#25191;&#34892;&#24050;&#25552;&#20132;&#20219;&#21153;&#12290;&#20219;&#21153;&#22312;&#30001;&#23481;&#22120;&#21551;&#21160;&#21644;&#31649;&#29702;&#30340;&#32447;&#31243;&#19978;&#25191;&#34892;&#12290;&#23481;&#22120;&#30340;&#19978;&#19979;&#25991;&#23558;&#20256;&#25773;&#21040;&#25191;&#34892;&#20219;&#21153;&#30340;&#32447;&#31243;&#12290;</p>
<p>&#22312; GlassFish Server &#20013;&#65292;&#21487;&#20197;&#37197;&#32622;&#25176;&#31649;&#30340;&#24050;&#35843;&#24230;&#25191;&#34892;&#31243;&#24207;&#26381;&#21153;&#36164;&#28304;&#24182;&#20351;&#36164;&#28304;&#21487;&#20379;&#24212;&#29992;&#31243;&#24207;&#32452;&#20214;&#20351;&#29992;&#65292;&#20363;&#22914; Servlet &#21644; EJB&#12290;&#20219;&#21153;&#30340;&#23454;&#38469;&#35843;&#24230;&#30001;&#24212;&#29992;&#31243;&#24207;&#20197;&#32534;&#31243;&#26041;&#24335;&#23454;&#29616;&#12290;</p>
<ol>
<li>
<p>&#22312;&#23548;&#33322;&#26641;&#20013;&#65292;&#23637;&#24320;&ldquo;&#36164;&#28304;&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#36164;&#28304;&rdquo;&#33410;&#28857;&#19979;&#65292;&#23637;&#24320;&ldquo;&#24182;&#21457;&#36164;&#28304;&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#24182;&#21457;&#36164;&#28304;&rdquo;&#33410;&#28857;&#19979;&#65292;&#36873;&#25321;&ldquo;&#25176;&#31649;&#35843;&#24230;&#25191;&#34892;&#31243;&#24207;&#26381;&#21153;&rdquo;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#25176;&#31649;&#35843;&#24230;&#25191;&#34892;&#31243;&#24207;&#26381;&#21153;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#25176;&#31649;&#35843;&#24230;&#25191;&#34892;&#31243;&#24207;&#26381;&#21153;&rdquo;&#39029;&#19978;&#65292;&#21333;&#20987;&ldquo;&#26032;&#24314;&rdquo;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#26032;&#24314;&#25176;&#31649;&#35843;&#24230;&#25191;&#34892;&#31243;&#24207;&#26381;&#21153;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;JNDI &#21517;&#31216;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#26631;&#35782;&#36164;&#28304;&#30340;&#21807;&#19968;&#21517;&#31216;&#12290;</p>
<p>JNDI &#21517;&#31216;&#22312; JNDI &#21629;&#21517;&#26381;&#21153;&#20013;&#27880;&#20876;&#65292;&#30001;&#24212;&#29992;&#31243;&#24207;&#29992;&#20110;&#26597;&#25214;&#36164;&#28304;&#12290;&#20351;&#29992; <code>concurrent/</code><i>name</i> &#26684;&#24335;&#12290;&#20363;&#22914;&#65292;<code>concurrent/myManagedScheduledExecutorService</code>&#12290;&#21517;&#31216;&#21482;&#33021;&#21253;&#21547;&#23383;&#27597;&#25968;&#23383;&#12289;&#19979;&#21010;&#32447;&#12289;&#30701;&#21010;&#32447;&#25110;&#28857;&#23383;&#31526;&#12290;</p>
</li>
<li>
<p>&#36873;&#25321;&ldquo;&#21551;&#29992;&#19978;&#19979;&#25991;&#20449;&#24687;&rdquo;&#22797;&#36873;&#26694;&#20197;&#23558;&#19978;&#19979;&#25991;&#20256;&#25773;&#21040;&#32447;&#31243;&#65292;&#28982;&#21518;&#36873;&#25321;&#35201;&#20256;&#25773;&#30340;&#19978;&#19979;&#25991;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#27492;&#36873;&#39033;&#24050;&#21551;&#29992;&#65292;&#24182;&#19988;&#36873;&#20013;&#25152;&#26377;&#19978;&#19979;&#25991;&#12290;&#36890;&#36807;&#25353;&#20303; Shift &#38190;&#21333;&#20987;&#25110;&#25353;&#20303; Ctrl &#38190;&#21333;&#20987;&#36873;&#25321;&#22810;&#20010;&#19978;&#19979;&#25991;&#12290;&#22914;&#26524;&#31105;&#29992;&#20102;&#27492;&#36873;&#39033;&#65292;&#21017;&#19981;&#20256;&#25773;&#19978;&#19979;&#25991;&#65292;&#21363;&#20351;&#24050;&#36873;&#20013;&#20102;&#23427;&#20204;&#20063;&#26159;&#22914;&#27492;&#12290;</p>
</li>
<li>
<p>&#36873;&#25321;&ldquo;&#21551;&#29992;&#29366;&#24577;&rdquo;&#22797;&#36873;&#26694;&#20197;&#21551;&#29992;&#36164;&#28304;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#21551;&#29992;&#27492;&#36873;&#39033;&#65292;&#36825;&#34920;&#31034;&#36164;&#28304;&#22312;&#21019;&#24314;&#20043;&#21518;&#31435;&#21363;&#21487;&#29992;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#32447;&#31243;&#20248;&#20808;&#32423;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#20998;&#37197;&#32473;&#24050;&#21019;&#24314;&#32447;&#31243;&#30340;&#20248;&#20808;&#32423;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 5&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#21551;&#29992;&#38271;&#26102;&#38388;&#36816;&#34892;&#20219;&#21153;&rdquo;&#22797;&#36873;&#26694;&#20197;&#20351;&#29992;&#36164;&#28304;&#26469;&#36816;&#34892;&#38271;&#26102;&#38388;&#36816;&#34892;&#30340;&#20219;&#21153;&#12290;</p>
<p>&#22914;&#26524;&#21551;&#29992;&#65292;&#21017;&#19981;&#23558;&#38271;&#26102;&#38388;&#36816;&#34892;&#30340;&#20219;&#21153;&#25253;&#21578;&#20026;&#31896;&#28382;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#25346;&#36215;&#21069;&#26102;&#38388;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#22312;&#23558;&#20219;&#21153;&#35270;&#20026;&#26080;&#21709;&#24212;&#20043;&#21069;&#20219;&#21153;&#21487;&#25191;&#34892;&#30340;&#31186;&#25968;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 0&#65292;&#36825;&#34920;&#31034;&#20174;&#19981;&#23558;&#20219;&#21153;&#35270;&#20026;&#26080;&#21709;&#24212;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#35828;&#26126;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#36164;&#28304;&#30340;&#31616;&#30701;&#35828;&#26126;&#12290;</p>
<p>&#27492;&#35828;&#26126;&#26159;&#23383;&#31526;&#20018;&#20540;&#65292;&#26368;&#22810;&#21487;&#20197;&#21253;&#21547; 250 &#20010;&#23383;&#31526;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26680;&#24515;&#22823;&#23567;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#32447;&#31243;&#27744;&#20013;&#20445;&#30041;&#30340;&#32447;&#31243;&#25968; (&#21363;&#20351;&#36825;&#20123;&#32447;&#31243;&#31354;&#38386;)&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 0&#65292;&#36825;&#34920;&#31034;&#32447;&#31243;&#22312;&#35843;&#24230;&#39318;&#20010;&#20219;&#21153;&#26102;&#21019;&#24314;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#20445;&#25345;&#27963;&#21160;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#24403;&#32447;&#31243;&#25968;&#22823;&#20110;&#26680;&#24515;&#22823;&#23567;&#26102;&#32447;&#31243;&#21487;&#20197;&#20445;&#25345;&#31354;&#38386;&#29366;&#24577;&#30340;&#31186;&#25968;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 60&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#32447;&#31243;&#26377;&#25928;&#26399;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#32447;&#31243;&#22312;&#34987;&#28165;&#38500;&#20043;&#21069;&#21487;&#20197;&#20445;&#30041;&#22312;&#32447;&#31243;&#27744;&#20013;&#30340;&#31186;&#25968;&#65292;&#32780;&#26080;&#35770;&#32447;&#31243;&#25968;&#26159;&#21542;&#22823;&#20110;&#26680;&#24515;&#22823;&#23567;&#25110;&#32447;&#31243;&#26159;&#21542;&#22788;&#20110;&#31354;&#38386;&#29366;&#24577;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 0&#65292;&#34920;&#31034;&#20174;&#19981;&#28165;&#38500;&#32447;&#31243;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#20854;&#20182;&#23646;&#24615;&rdquo;&#37096;&#20998;&#20013;&#65292;&#19981;&#35201;&#28155;&#21152;&#20219;&#20309;&#20854;&#20182;&#23646;&#24615;&#12290;</p>
<p>GlassFish Server &#27809;&#26377;&#20026;&#27492;&#36164;&#28304;&#31867;&#22411;&#23450;&#20041;&#20219;&#20309;&#20854;&#20182;&#23646;&#24615;&#12290;&#27492;&#22806;&#65292;&#27492;&#36164;&#28304;&#31867;&#22411;&#24403;&#21069;&#19981;&#20351;&#29992;&#20219;&#20309;&#20854;&#20182;&#23646;&#24615;&#12290;</p>
</li>
<li>
<p>&#21333;&#20987;&ldquo;&#30830;&#23450;&rdquo;&#12290;</p>
</li>
</ol>
<a id="GHCON116" name="GHCON116"></a>
<h5>&#21478;&#35831;&#21442;&#38405;</h5>
<ul>
<li>
<p><a href="task-managedscheduledexecutorserviceedit.html">&#32534;&#36753;&#25176;&#31649;&#35843;&#24230;&#25191;&#34892;&#31243;&#24207;&#26381;&#21153;</a></p>
</li>
<li>
<p><a href="task-managedscheduledexecutorservicedelete.html">&#21024;&#38500;&#25176;&#31649;&#35843;&#24230;&#25191;&#34892;&#31243;&#24207;&#26381;&#21153;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
