<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jdbcconnpooladvanceattrtab" name="ref-jdbcconnpooladvanceattrtab"></a><a id="GHJDB00027" name="GHJDB00027"></a></p>

<h4><a id="sthref49" name="sthref49"></a>&#32232;&#36655;&#36899;&#32218;&#38598;&#21312;&#36914;&#38542;&#23660;&#24615;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&#12300;&#32232;&#36655;&#36899;&#32218;&#38598;&#21312;&#36914;&#38542;&#23660;&#24615;&#12301;&#38913;&#38754;&#21487;&#25351;&#23450;&#33021;&#24171;&#21161;&#35386;&#26039;&#36899;&#32218;&#27945;&#28431;&#21644;&#25913;&#21892;&#31777;&#26131;&#25805;&#20316;&#24615;&#30340;&#23660;&#24615;&#12290;</p>
<p>&#12300;&#32232;&#36655;&#36899;&#32218;&#38598;&#21312;&#36914;&#38542;&#23660;&#24615;&#12301;&#38913;&#38754;&#21253;&#21547;&#19979;&#21015;&#36984;&#38917;&#12290;</p>
<dl>
<dt>&#36617;&#20837;&#38928;&#35373;&#20540;</dt>
<dd>
<p>&#29992;&#26044;&#23559;&#20855;&#26377;&#38928;&#35373;&#20540;&#30340;&#35373;&#23450;&#24489;&#21407;&#28858;&#35373;&#23450;&#20540;&#30340;&#25353;&#37397;&#12290;&#27794;&#26377;&#38928;&#35373;&#20540;&#30340;&#35373;&#23450;&#21063;&#20445;&#25345;&#19981;&#35722;&#12290;</p>
</dd>
<dt>&#38598;&#21312;&#21517;&#31281;</dt>
<dd>
<p>&#36899;&#32218;&#38598;&#21312;&#30340;&#21517;&#31281;&#12290;&#21517;&#31281;&#26159;&#21807;&#35712;&#27396;&#20301;&#12290;&#24744;&#20677;&#33021;&#22312;&#24314;&#31435;&#26032;&#30340; JDBC &#36899;&#32218;&#38598;&#21312;&#26178;&#25351;&#23450;&#36899;&#32218;&#38598;&#21312;&#21517;&#31281;&#12290;</p>
</dd>
<dt>&#25944;&#36848;&#21477;&#36926;&#26178;</dt>
<dd>
<p>&#32066;&#27490;&#22519;&#34892;&#26178;&#38291;&#36942;&#38263;&#30340;&#26597;&#35426;&#20043;&#21069;&#65292;&#31561;&#24453;&#30340;&#26178;&#38291;&#38263;&#24230; (&#20197;&#31186;&#28858;&#21934;&#20301;)&#12290;GlassFish Server &#23559;&#23565;&#24314;&#31435;&#30340;&#25944;&#36848;&#21477;&#35373;&#23450; <code>QueryTimeout</code>&#12290;&#20540; -1 &#34920;&#31034;&#20572;&#29992;&#35442;&#36984;&#38917;&#12290;&#38928;&#35373;&#20540;&#28858; -1&#12290;</p>
</dd>
<dt>&#25944;&#36848;&#21477;&#24555;&#21462;&#22823;&#23567;</dt>
<dd>
<p>&#35201;&#20351;&#29992; LRU (&#36817;&#20358;&#26368;&#23569;&#20351;&#29992;) &#24555;&#21462;&#27231;&#21046;&#24555;&#21462;&#30340;&#25944;&#36848;&#21477;&#25976;&#30446;&#12290;0 &#20540;&#26371;&#20572;&#29992;&#25944;&#36848;&#21477;&#24555;&#21462;&#12290;&#38928;&#35373;&#20540;&#28858; 0&#12290;</p>
</dd>
<dt>&#21021;&#22987;&#21270; SQL</dt>
<dd>
<p>&#27599;&#30070;&#22312;&#38598;&#21312;&#20013;&#24314;&#31435;&#36899;&#32218;&#26178;&#26371;&#22519;&#34892;&#30340; SQL &#23383;&#20018; (&#19981;&#37325;&#35079;&#20351;&#29992;)&#12290;&#22519;&#34892;&#27492;&#23383;&#20018;&#26371;&#21021;&#22987;&#21270;&#36899;&#32218;&#29376;&#24907;&#12290;</p>
</dd>
<dt>SQL &#36861;&#36452;&#30435;&#32893;&#22120;</dt>
<dd>
<p>&#20197;&#36887;&#34399;&#20998;&#38548;&#30340;&#30435;&#32893;&#22120;&#23526;&#34892;&#39006;&#21029;&#21517;&#31281;&#28165;&#21934;&#65292;&#26371;&#25351;&#23450;&#36861;&#36452;&#25033;&#29992;&#31243;&#24335;&#22519;&#34892;&#30340; SQL &#25944;&#36848;&#21477;&#12290;&#30435;&#32893;&#22120;&#39006;&#21029;&#24517;&#38920;&#23526;&#34892; <code>org.glassfish.api.jdbc.SQLTraceListener</code> &#20171;&#38754;&#12290;&#20351;&#29992;&#30435;&#32893;&#22120;&#33021;&#35731;&#24744;&#37341;&#23565; SQL &#25944;&#36848;&#21477;&#36629;&#39686;&#31721;&#36984;&#26085;&#35468;&#35338;&#24687;&#65292;&#19988;&#33021;&#24171;&#21161;&#31649;&#29702;&#21729;&#20998;&#26512;&#25944;&#36848;&#21477;&#12290;</p>
</dd>
<dt>&#21253;&#35037; JDBC &#29289;&#20214;</dt>
<dd>
<p>&#33509;&#21855;&#29992;&#27492;&#36984;&#38917;&#65292;&#25033;&#29992;&#31243;&#24335;&#23559;&#26371;&#21462;&#24471; Statement&#12289;PreparedStatement&#12289;CallableStatement&#12289;ResultSet&#12289;DatabaseMetaData &#30340;&#21253;&#35037; JDBC &#29289;&#20214;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#21855;&#29992;&#12290;</p>
</dd>
<dt>&#38598;&#21312;&#31649;&#29702;</dt>
<dd>
<p>&#37341;&#23565;&#38598;&#21312;&#21855;&#29992;&#36899;&#32218;&#38598;&#21312;&#31649;&#29702;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#21855;&#29992;&#12290;</p>
</dd>
<dt>&#39511;&#35657;&#38291;&#38548;&#26368;&#20037;&#26178;&#38291;</dt>
<dd>
<p>&#25351;&#23450;&#36899;&#32396;&#35531;&#27714;&#39511;&#35657;&#36899;&#32218;&#30340;&#26368;&#38263;&#26178;&#38291;&#38291;&#38548; (&#20197;&#31186;&#28858;&#21934;&#20301;)&#12290;&#23559;&#27492;&#23660;&#24615;&#35373;&#23450;&#28858;&#36969;&#30070;&#20540;&#65292;&#21487;&#23559;&#39511;&#35657;&#36899;&#32218;&#35531;&#27714;&#30340;&#25976;&#30446;&#28187;&#33267;&#26368;&#23567;&#12290;&#38928;&#35373;&#20540;&#28858; 0&#65292;&#34920;&#31034;&#26410;&#21855;&#29992;&#27492;&#23660;&#24615;&#12290;</p>
</dd>
<dt>&#36899;&#32218;&#27945;&#28431;&#36926;&#26178;</dt>
<dd>
<p>&#36861;&#36452;&#36899;&#32218;&#38598;&#21312;&#20013;&#36899;&#32218;&#27945;&#28431;&#30340;&#26178;&#38291; (&#20197;&#31186;&#28858;&#21934;&#20301;)&#12290;&#20351;&#29992;&#27492;&#27396;&#20301;&#21487;&#20597;&#28204;&#25033;&#29992;&#31243;&#24335;&#36896;&#25104;&#30340;&#28507;&#22312;&#36899;&#32218;&#27945;&#28431;&#12290;&#33509;&#25033;&#29992;&#31243;&#24335;&#26410;&#26044;&#25351;&#23450;&#26399;&#38291;&#20839;&#23559;&#36899;&#32218;&#20659;&#22238;&#38598;&#21312;&#65292;&#21063;&#26371;&#20551;&#35373;&#36899;&#32218;&#21487;&#33021;&#30332;&#29983;&#37679;&#35492;&#65292;&#20006;&#26371;&#35352;&#37636;&#21628;&#21483;&#32773;&#30340;&#22534;&#30090;&#36861;&#36452;&#12290;0 &#20540;&#34920;&#31034;&#24050;&#20572;&#29992;&#36899;&#32218;&#27945;&#28431;&#36861;&#36452;&#12290;&#38928;&#35373;&#20540;&#28858; 0&#12290;</p>
<p>&#23559;&#27492;&#27396;&#20301;&#33287;&#12300;&#37679;&#35492;&#25910;&#22238;&#12301;&#27396;&#20301;&#37197;&#21512;&#20351;&#29992;&#65292;&#21487;&#36991;&#20813;&#25033;&#29992;&#31243;&#24335;&#36896;&#25104;&#30340;&#28507;&#22312;&#36899;&#32218;&#27945;&#28431;&#12290;</p>
</dd>
<dt>&#36899;&#32218;&#27945;&#28431;&#25910;&#22238;</dt>
<dd>
<p>&#33509;&#21855;&#29992;&#27492;&#36984;&#38917;&#65292;&#21063;&#22312;&#37679;&#35492;&#36899;&#32218;&#36861;&#36452;&#23436;&#25104;&#20043;&#24460;&#65292;&#26371;&#23559;&#37679;&#35492;&#30340;&#36899;&#32218;&#24489;&#21407;&#33267;&#36899;&#32218;&#38598;&#21312;&#20013;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</dd>
<dt>&#25944;&#36848;&#21477;&#28431;&#22833;&#36926;&#26178;</dt>
<dd>
<p>&#36861;&#36452;&#36899;&#32218;&#38598;&#21312;&#20013;&#25944;&#36848;&#21477;&#28431;&#22833;&#30340;&#26178;&#38291;&#38263;&#24230; (&#20197;&#31186;&#28858;&#21934;&#20301;)&#12290;&#20351;&#29992;&#27492;&#27396;&#20301;&#21487;&#20597;&#28204;&#25033;&#29992;&#31243;&#24335;&#36896;&#25104;&#30340;&#28507;&#22312;&#25944;&#36848;&#21477;&#28431;&#22833;&#12290;&#33509;&#25033;&#29992;&#31243;&#24335;&#26410;&#26044;&#25351;&#23450;&#26399;&#38291;&#20839;&#23559;&#25944;&#36848;&#21477;&#20659;&#22238;&#38598;&#21312;&#65292;&#21063;&#26371;&#20551;&#35373;&#25944;&#36848;&#21477;&#21487;&#33021;&#28431;&#22833;&#65292;&#20006;&#26371;&#35352;&#37636;&#21628;&#21483;&#32773;&#30340;&#22534;&#30090;&#36861;&#36452;&#12290;&#20540; 0 &#34920;&#31034;&#20572;&#29992;&#25944;&#36848;&#21477;&#28431;&#22833;&#36861;&#36452;&#12290;&#38928;&#35373;&#20540;&#28858; 0&#12290;</p>
<p>&#23559;&#27492;&#27396;&#20301;&#33287;&#12300;&#25944;&#36848;&#21477;&#28431;&#22833;&#25910;&#22238;&#12301;&#37197;&#21512;&#20351;&#29992;&#65292;&#21487;&#36991;&#20813;&#25033;&#29992;&#31243;&#24335;&#36896;&#25104;&#30340;&#28507;&#22312;&#36899;&#32218;&#27945;&#28431;&#12290;</p>
</dd>
<dt>&#25944;&#36848;&#21477;&#28431;&#22833;&#25910;&#22238;</dt>
<dd>
<p>&#33509;&#21855;&#29992;&#27492;&#36984;&#38917;&#65292;&#21063;&#22312;&#28431;&#22833;&#25944;&#36848;&#21477;&#36861;&#36452;&#23436;&#25104;&#20043;&#24460;&#65292;&#26371;&#23559;&#28431;&#22833;&#30340;&#25944;&#36848;&#21477;&#24489;&#21407;&#33267;&#36899;&#32218;&#38598;&#21312;&#20013;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</dd>
<dt>&#24314;&#31435;&#37325;&#35430;&#22039;&#35430;</dt>
<dd>
<p>&#22312;&#24314;&#31435;&#26032;&#36899;&#32218;&#22833;&#25943;&#20043;&#24460;&#65292;&#23559;&#36914;&#34892;&#30340;&#22039;&#35430;&#27425;&#25976;&#12290;&#20540; 0 &#34920;&#31034;&#19981;&#26371;&#20877;&#27425;&#22039;&#35430;&#24314;&#31435;&#36899;&#32218;&#12290;&#38928;&#35373;&#20540;&#28858; 0&#12290;</p>
</dd>
<dt>&#37325;&#35430;&#38291;&#38548;</dt>
<dd>
<p>&#20841;&#27425;&#22039;&#35430;&#24314;&#31435;&#36899;&#32218;&#20043;&#38291;&#30340;&#26178;&#38291;&#38291;&#38548; (&#20197;&#31186;&#28858;&#21934;&#20301;)&#12290;&#38928;&#35373;&#20540;&#28858; 10&#12290;&#20677;&#30070;&#12300;&#24314;&#31435;&#37325;&#26032;&#22039;&#35430;&#27425;&#25976;&#12301;&#30340;&#20540;&#22823;&#26044; 0 &#26178;&#65292;&#25165;&#20351;&#29992;&#35442;&#23660;&#24615;&#12290;</p>
</dd>
<dt>&#24816;&#24615;&#38364;&#32879;</dt>
<dd>
<p>&#33509;&#21855;&#29992;&#27492;&#36984;&#38917;&#65292;&#20677;&#30070;&#20351;&#29992;&#36899;&#32218;&#26178;&#65292;&#25165;&#26371;&#23559;&#23526;&#39636;&#36899;&#32218;&#33287;&#37007;&#36655;&#38598;&#21512;&#38364;&#32879;&#12290;&#30070;&#20316;&#26989;&#20107;&#20214;&#23436;&#25104;&#19988;&#20803;&#20214;&#26041;&#27861;&#32080;&#26463;&#26178;&#65292;&#36889;&#20123;&#36899;&#32218;&#20415;&#26371;&#21462;&#28040;&#38364;&#32879;&#65292;&#24478;&#32780;&#21487;&#20197;&#37325;&#35079;&#20351;&#29992;&#23526;&#39636;&#36899;&#32218;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</dd>
<dt>&#24816;&#24615;&#36899;&#32218;&#30331;&#35352;</dt>
<dd>
<p>&#33509;&#21855;&#29992;&#27492;&#36984;&#38917;&#65292;&#20677;&#30070;&#36039;&#28304;&#22312;&#26041;&#27861;&#20013;&#23526;&#38555;&#20351;&#29992;&#26178;&#65292;&#25165;&#26371;&#23559;&#35442;&#36039;&#28304;&#21152;&#20837;&#20316;&#26989;&#20107;&#20214;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</dd>
<dt>&#33287;&#32363;&#32218;&#24314;&#31435;&#38364;&#32879;</dt>
<dd>
<p>&#33509;&#21855;&#29992;&#27492;&#36984;&#38917;&#65292;&#23559;&#24314;&#31435;&#36899;&#32218;&#33287;&#32363;&#32218;&#20043;&#38291;&#30340;&#38364;&#32879;&#65292;&#36889;&#27171;&#30070;&#30456;&#21516;&#30340;&#32363;&#32218;&#38656;&#35201;&#36899;&#32218;&#26178;&#65292;&#20415;&#21487;&#37325;&#35079;&#20351;&#29992;&#24050;&#33287;&#35442;&#32363;&#32218;&#30456;&#38364;&#32879;&#30340;&#36899;&#32218;&#65292;&#32780;&#30465;&#19979;&#24478;&#38598;&#21312;&#20013;&#21462;&#24471;&#36899;&#32218;&#30340;&#32147;&#24120;&#24615;&#32791;&#29992;&#26178;&#38291;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</dd>
<dt>&#27604;&#23565;&#36899;&#32218;</dt>
<dd>
<p>&#33509;&#21855;&#29992;&#27492;&#36984;&#38917;&#65292;&#26371;&#23559;&#24478;&#38598;&#21312;&#20013;&#36984;&#21462;&#30340;&#36899;&#32218;&#33287;&#20855;&#26377;&#29305;&#23450;&#24977;&#35657;&#30340;&#36899;&#32218;&#21152;&#20197;&#27604;&#23565;&#12290;&#22914;&#26524;&#36899;&#32218;&#38598;&#21312;&#26159;&#20379;&#20855;&#26377;&#22810;&#20491;&#20351;&#29992;&#32773;&#24977;&#35657;&#30340;&#25033;&#29992;&#31243;&#24335;&#20351;&#29992;&#65292;&#21063;&#24517;&#38920;&#21855;&#29992;&#27492;&#36984;&#38917;&#12290;&#24744;&#21487;&#20197;&#22312;&#20197;&#19979;&#24773;&#27841;&#19979;&#23433;&#20840;&#22320;&#20572;&#29992;&#27492;&#36984;&#38917;&#65306;&#31649;&#29702;&#21729;&#30693;&#36947;&#38598;&#21312;&#20013;&#30340;&#36899;&#32218;&#19968;&#23450;&#26159;&#21516;&#36074;&#36899;&#32218;&#65292;&#22240;&#27492;&#19981;&#38656;&#35201;&#36039;&#28304;&#36681;&#25509;&#22120;&#23565;&#24478;&#38598;&#21312;&#20013;&#25361;&#36984;&#30340;&#36899;&#32218;&#36914;&#34892;&#27604;&#23565;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</dd>
<dt>&#36899;&#32218;&#30340;&#26368;&#22810;&#20351;&#29992;&#27425;&#25976;</dt>
<dd>
<p>&#36899;&#32218;&#38598;&#21312;&#25033;&#37325;&#35079;&#20351;&#29992;&#36899;&#32218;&#30340;&#27425;&#25976;&#12290;&#37325;&#35079;&#20351;&#29992;&#25351;&#23450;&#27425;&#25976;&#30340;&#36899;&#32218;&#24460;&#65292;&#23601;&#26371;&#38364;&#38281;&#36899;&#32218;&#12290;&#24744;&#21487;&#20197;&#36879;&#36942;&#38480;&#21046;&#36899;&#32218;&#21487;&#37325;&#35079;&#20351;&#29992;&#30340;&#27425;&#25976;&#65292;&#36991;&#20813;&#22312;&#25033;&#29992;&#31243;&#24335;&#26410;&#38364;&#38281;&#25944;&#36848;&#21477;&#26178;&#65292;&#30332;&#29983;&#25944;&#36848;&#21477;&#37679;&#35492;&#12290;&#20540; 0 &#34920;&#31034;&#20572;&#29992;&#27492;&#23660;&#24615;&#12290;&#38928;&#35373;&#20540;&#28858; 0&#12290;</p>
</dd>
<dt>&#36899;&#32218;&#39511;&#35657;</dt>
<dd>
<p>&#33509;&#21855;&#29992;&#27492;&#36984;&#38917;&#65292;&#21063;&#38656;&#35201;&#39511;&#35657;&#36899;&#32218;&#65292;&#20197;&#22312;&#22833;&#25943;&#26178;&#20801;&#35377;&#20282;&#26381;&#22120;&#37325;&#26032;&#36899;&#32218;&#12290;</p>
</dd>
<dt>&#39511;&#35657;&#26041;&#27861;</dt>
<dd>
<p>GlassFish Server &#21487;&#20351;&#29992;&#20197;&#19979;&#26041;&#24335;&#39511;&#35657;&#36039;&#26009;&#24235;&#36899;&#32218;&#12290;</p>
<dl>
<dt><code>auto-commit</code> &#21644; <code>metadata</code></dt>
<dd>
<p>GlassFish Server &#26371;&#36879;&#36942;&#21628;&#21483; <code>con.getAutoCommit</code> &#25110; <code>con.getMetaData</code> &#26041;&#27861;&#39511;&#35657;&#36899;&#32218;&#12290;</p>

<hr>
<p><b>&#20633;&#35387;:</b></p>
&#35377;&#22810; JDBC &#39493;&#21205;&#31243;&#24335;&#26371;&#24555;&#21462;&#36889;&#20123;&#21628;&#21483;&#30340;&#32080;&#26524;&#12290;&#22240;&#27492;&#65292;&#20351;&#29992;&#36889;&#20123;&#21628;&#21483;&#19981;&#19968;&#23450;&#33021;&#25552;&#20379;&#21487;&#38752;&#30340;&#39511;&#35657;&#12290;&#35531;&#27965;&#35426;&#39493;&#21205;&#31243;&#24335;&#20379;&#25033;&#21830;&#65292;&#20197;&#30906;&#23450;&#36889;&#20123;&#21628;&#21483;&#26159;&#21542;&#26371;&#34987;&#24555;&#21462;&#12290;
<hr>

</dd>
<dt><code>custom-validation</code></dt>
<dd>
<p>GlassFish Server &#26371;&#20351;&#29992;&#12300;&#39511;&#35657;&#39006;&#21029;&#21517;&#31281;&#12301;&#27396;&#20301;&#20013;&#30340;&#33258;&#35330;&#23526;&#34892;&#39006;&#21029;&#25152;&#25351;&#23450;&#30340;&#20351;&#29992;&#32773;&#23450;&#32681;&#39511;&#35657;&#27231;&#21046;&#12290;</p>
</dd>
<dt><code>table</code></dt>
<dd>
<p>&#25033;&#29992;&#31243;&#24335;&#26371;&#26597;&#35426;&#25351;&#23450;&#30340;&#36039;&#26009;&#24235;&#34920;&#26684;&#12290;&#27492;&#34920;&#26684;&#24517;&#38920;&#23384;&#22312;&#20006;&#19988;&#21487;&#20197;&#23384;&#21462;&#65292;&#20294;&#19981;&#35201;&#27714;&#34920;&#26684;&#30340;&#21015;&#25976;&#12290;&#35531;&#21247;&#20351;&#29992;&#21253;&#21547;&#35377;&#22810;&#21015;&#30340;&#29694;&#26377;&#34920;&#26684;&#25110;&#32147;&#24120;&#23384;&#21462;&#30340;&#34920;&#26684;&#12290;</p>
</dd>
</dl>
</dd>
<dt>&#34920;&#26684;&#21517;&#31281;</dt>
<dd>
<p>&#29992;&#26044;&#39511;&#35657;&#30340;&#36039;&#26009;&#24235;&#34920;&#26684;&#21517;&#31281;&#12290;&#21482;&#26377;&#22312;&#12300;&#39511;&#35657;&#26041;&#27861;&#12301;&#35373;&#28858; <code>table</code> &#26178;&#65292;&#25165;&#21487;&#20351;&#29992;&#27492;&#27396;&#20301;&#12290;&#24744;&#21487;&#20197;&#24478;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#36984;&#21462;&#21517;&#31281;&#65292;&#25110;&#37749;&#20837;&#21517;&#31281;&#12290;</p>
</dd>
<dt>&#39511;&#35657;&#39006;&#21029;&#21517;&#31281;</dt>
<dd>
<p>&#33258;&#35330;&#39511;&#35657;&#23526;&#34892;&#39006;&#21029;&#21517;&#31281;&#12290;&#21482;&#26377;&#22312;&#12300;&#39511;&#35657;&#26041;&#27861;&#12301;&#35373;&#28858; <code>custom-validation</code> &#26178;&#65292;&#25165;&#21487;&#20351;&#29992;&#27492;&#27396;&#20301;&#12290;GlassFish Server &#24517;&#38920;&#21487;&#20197;&#23384;&#21462;&#25552;&#20379;&#30340;&#39006;&#21029;&#21517;&#31281;&#12290;&#25351;&#23450;&#30340;&#39006;&#21029;&#24517;&#38920;&#23526;&#34892; <code>org.glassfish.api.jdbc.ConnectionValidation</code> &#20171;&#38754;&#12290;&#24744;&#21487;&#20197;&#24478;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#36984;&#21462;&#21517;&#31281;&#65292;&#25110;&#37749;&#20837;&#21517;&#31281;&#12290;</p>
</dd>
<dt>&#19968;&#26086;&#22833;&#25943;</dt>
<dd>
<p>&#33509;&#21855;&#29992;&#27492;&#36984;&#38917;&#65292;&#21063;&#22312;&#20219;&#20309;&#36899;&#32218;&#22833;&#25943;&#26178;&#65292;GlassFish Server &#26371;&#38364;&#38281;&#38598;&#21312;&#20013;&#30340;&#25152;&#26377;&#36899;&#32218;&#20006;&#37325;&#26032;&#24314;&#31435;&#36899;&#32218;&#12290;&#33509;&#20572;&#29992;&#27492;&#36984;&#38917;&#65292;&#21063;&#20677;&#26371;&#22312;&#20351;&#29992;&#36899;&#32218;&#26178;&#37325;&#26032;&#24314;&#31435;&#20491;&#21029;&#36899;&#32218;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</dd>
<dt>&#20801;&#35377;&#38750;&#20803;&#20214;&#21628;&#21483;&#32773;</dt>
<dd>
<p>&#33509;&#21855;&#29992;&#27492;&#36984;&#38917;&#65292;&#21063;&#38750;&#20803;&#20214;&#21628;&#21483;&#32773; (&#20363;&#22914; Servlet &#31721;&#36984;&#33287;&#31532;&#19977;&#26041;&#25345;&#32396;&#24615;&#31649;&#29702;&#21729;) &#21487;&#20351;&#29992;&#38598;&#21312;&#12290;&#38750;&#20803;&#20214;&#21628;&#21483;&#32773;&#25152;&#21462;&#24471;&#30340;&#36899;&#32218;&#65292;&#19981;&#26371;&#22312;&#20316;&#26989;&#20107;&#20214;&#32080;&#26463;&#26178;&#30001;&#23481;&#22120;&#33258;&#21205;&#38364;&#38281;&#12290;&#36889;&#20123;&#36899;&#32218;&#24517;&#38920;&#30001;&#21628;&#21483;&#32773;&#26126;&#30906;&#22320;&#38364;&#38281;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</dd>
</dl>
<a id="sthref50" name="sthref50"></a>
<h5>&#30456;&#38364;&#20316;&#26989;</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">&#35373;&#23450;&#36039;&#26009;&#24235;&#23384;&#21462;</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">&#25972;&#21512; JDBC &#39493;&#21205;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">&#24314;&#31435; JDBC &#36899;&#32218;&#38598;&#21312;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">&#32232;&#36655; JDBC &#36899;&#32218;&#38598;&#21312;&#19968;&#33324;&#35373;&#23450;</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">&#39511;&#35657;&#36899;&#32218;&#38598;&#21312;&#35373;&#23450;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">&#32232;&#36655; JDBC &#36899;&#32218;&#38598;&#21312;&#36914;&#38542;&#23660;&#24615;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">&#32232;&#36655; JDBC &#36899;&#32218;&#38598;&#21312;&#29305;&#24615;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">&#21034;&#38500; JDBC &#36899;&#32218;&#38598;&#21312;</a></p>
</li>
</ul>
<a id="sthref51" name="sthref51"></a>
<h5>&#30456;&#38364;&#30340; asadmin &#21629;&#20196;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00001"><code>add-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00036"><code>create-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00088"><code>delete-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00135"><code>flush-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00173"><code>list-jdbc-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00214"><code>ping-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00234"><code>start-database</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00239"><code>stop-database</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
