<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jdbcconnectionpoolnew2" name="ref-jdbcconnectionpoolnew2"></a><a id="GHJDB00025" name="GHJDB00025"></a></p>

<h4><a id="sthref43" name="sthref43"></a>&#26032;&#24314; JDBC &#36899;&#32218;&#38598;&#21312; (&#27493;&#39519; 2&#65292;&#20849; 2 &#20491;&#27493;&#39519;)</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&#12300;&#26032;&#24314; JDBC &#36899;&#32218;&#38598;&#21312; (&#27493;&#39519; 2&#65292;&#20849; 2 &#27493;)&#12301;&#38913;&#38754;&#21487;&#24314;&#31435;&#26032;&#30340; JDBC &#36899;&#32218;&#38598;&#21312;&#12290;</p>
<p>&#12300;&#26032;&#24314; JDBC &#36899;&#32218;&#38598;&#21312; (&#27493;&#39519; 2&#65292;&#20849; 2 &#27493;)&#12301;&#38913;&#38754;&#21253;&#21547;&#19979;&#21015;&#36984;&#38917;&#12290;</p>
<dl>
<dt>&#36039;&#26009;&#20358;&#28304;&#39006;&#21029;&#21517;&#31281;</dt>
<dd>
<p>&#23526;&#34892; <code>DataSource</code>&#12289;<code>ConnectionPoolDataSource</code> &#25110; <code>XADataSource</code> API &#30340;&#20379;&#25033;&#21830;&#23560;&#23660;&#39006;&#21029;&#21517;&#31281;&#12290;&#33509;&#24744;&#21855;&#29992;&#12300;&#33258;&#25105;&#27298;&#26597;&#12301;&#36984;&#38917;&#20006;&#36984;&#21462;&#20854;&#20013;&#19968;&#20491;&#36039;&#26009;&#20358;&#28304;&#36039;&#28304;&#39006;&#22411;&#65292;&#27492;&#27396;&#20301;&#26371;&#33258;&#21205;&#22635;&#20837;&#33287;&#24744;&#25152;&#36984;&#36039;&#28304;&#39006;&#22411;&#21644;&#36039;&#26009;&#24235;&#20379;&#25033;&#21830;&#38364;&#32879;&#30340;&#39006;&#21029;&#21517;&#31281;&#12290;&#33509;&#24744;&#36984;&#21462;&#20102; <code>java.sql.Driver</code> &#36039;&#28304;&#39006;&#22411;&#65292;&#26371;&#20572;&#29992;&#27492;&#27396;&#20301;&#12290;</p>
</dd>
<dt>&#39493;&#21205;&#31243;&#24335;&#39006;&#21029;&#21517;&#31281;</dt>
<dd>
<p>&#20379;&#25033;&#21830;&#25552;&#20379;&#30340; JDBC &#39493;&#21205;&#31243;&#24335;&#39006;&#21029;&#21517;&#31281;&#12290;&#33509;&#24744;&#21855;&#29992;&#12300;&#33258;&#25105;&#27298;&#26597;&#12301;&#36984;&#38917;&#20006;&#36984;&#21462; <code>java.sql.Driver</code> &#36039;&#28304;&#39006;&#22411;&#65292;&#27492;&#27396;&#20301;&#26371;&#33258;&#21205;&#22635;&#20837;&#33287;&#24744;&#25152;&#36984;&#39493;&#21205;&#31243;&#24335;&#21644;&#36039;&#26009;&#24235;&#20379;&#25033;&#21830;&#38364;&#32879;&#30340;&#39006;&#21029;&#21517;&#31281;&#12290;&#33509;&#24744;&#36984;&#21462;&#20102;&#20854;&#20013;&#19968;&#20491;&#36039;&#26009;&#20358;&#28304;&#36039;&#28304;&#39006;&#22411;&#65292;&#26371;&#20572;&#29992;&#27492;&#27396;&#20301;&#12290;</p>
</dd>
<dt>Ping</dt>
<dd>
<p>&#33509;&#36984;&#21462;&#20102;&#27492;&#36984;&#38917;&#65292;&#23559;&#26371;&#22312;&#38598;&#21312;&#24314;&#31435;&#25110;&#37325;&#26032;&#32068;&#24907;&#26399;&#38291;&#33258;&#21205; Ping &#38598;&#21312;&#65292;&#20197;&#35672;&#21029;&#20006;&#35686;&#21578;&#20219;&#20309;&#37679;&#35492;&#30340;&#23660;&#24615;&#20540;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</dd>
<dt>&#25551;&#36848;</dt>
<dd>
<p>&#36899;&#32218;&#38598;&#21312;&#30340;&#31777;&#30701;&#25551;&#36848;&#12290;</p>
</dd>
<dt>&#38598;&#21312;&#30340;&#21021;&#22987;&#22823;&#23567;&#21644;&#26368;&#23567;&#22823;&#23567;</dt>
<dd>
<p>&#38598;&#21312;&#20013;&#36899;&#32218;&#30340;&#26368;&#23567;&#25976;&#30446;&#12290;&#35442;&#20540;&#36996;&#21487;&#27770;&#23450;&#39318;&#27425;&#24314;&#31435;&#38598;&#21312;&#25110; GlassFish Server &#21855;&#21205;&#26178;&#65292;&#32622;&#26044;&#38598;&#21312;&#20013;&#30340;&#36899;&#32218;&#25976;&#30446;&#12290;&#38928;&#35373;&#20540;&#28858; 8&#12290;</p>
</dd>
<dt>&#38598;&#21312;&#30340;&#26368;&#22823;&#22823;&#23567;</dt>
<dd>
<p>&#38598;&#21312;&#20013;&#36899;&#32218;&#30340;&#26368;&#22823;&#25976;&#30446;&#12290;&#38928;&#35373;&#20540;&#28858; 32&#12290;</p>
</dd>
<dt>&#38598;&#21312;&#35373;&#23450;&#22823;&#23567;&#25976;&#37327;</dt>
<dd>
<p>&#30070;&#38598;&#21312;&#20998;&#21029;&#21521;&#26368;&#22823;&#38598;&#21312;&#22823;&#23567;&#25844;&#20805;&#20197;&#21450;&#21521;&#26368;&#23567;&#38598;&#21312;&#22823;&#23567;&#25910;&#32302;&#26178;&#65292;&#23559;&#25104;&#25209;&#35519;&#25972;&#22823;&#23567;&#12290;&#27492;&#20540;&#30906;&#23450;&#25209;&#27425;&#20013;&#30340;&#36899;&#32218;&#25976;&#30446;&#12290;&#23559;&#27492;&#20540;&#35373;&#32622;&#36942;&#22823;&#26371;&#24310;&#36978;&#36899;&#32218;&#24314;&#31435;&#21644;&#36039;&#28304;&#22238;&#25910;&#65307;&#32780;&#23559;&#35442;&#20540;&#35373;&#32622;&#36942;&#23567;&#21063;&#26371;&#23566;&#33268;&#25928;&#29575;&#38477;&#20302;&#12290;&#38928;&#35373;&#20540;&#28858; 2&#12290;</p>
</dd>
<dt>&#38290;&#32622;&#36926;&#26178;</dt>
<dd>
<p>&#36899;&#32218;&#21487;&#20197;&#22312;&#38598;&#21312;&#20013;&#38290;&#32622;&#30340;&#26368;&#38263;&#26178;&#38291; (&#20197;&#31186;&#28858;&#21934;&#20301;)&#12290;&#19968;&#26086;&#36229;&#36942;&#27492;&#26178;&#38291;&#65292;&#21363;&#24478;&#38598;&#21312;&#20013;&#31227;&#38500;&#35442;&#36899;&#32218;&#12290;&#38928;&#35373;&#20540;&#28858; 300&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#31561;&#24453;&#26178;&#38291;</dt>
<dd>
<p>&#36899;&#32218;&#36926;&#26178;&#21069;&#65292;&#35531;&#27714;&#36899;&#32218;&#30340;&#25033;&#29992;&#31243;&#24335;&#31561;&#24453;&#30340;&#26368;&#38263;&#26178;&#38291; (&#20197;&#27627;&#31186;&#28858;&#21934;&#20301;)&#12290;&#38928;&#35373;&#20540;&#28858; 60,000&#12290;</p>
</dd>
<dt>&#38750;&#20316;&#26989;&#20107;&#20214;&#36899;&#32218;</dt>
<dd>
<p>&#33509;&#21855;&#29992;&#27492;&#36984;&#38917;&#65292;&#21063;&#26371;&#20659;&#22238;&#38750;&#20316;&#26989;&#20107;&#20214;&#36899;&#32218;&#12290;</p>
</dd>
<dt>&#20316;&#26989;&#20107;&#20214;&#38548;&#38626;</dt>
<dd>
<p>&#33509;&#25351;&#23450;&#20316;&#26989;&#20107;&#20214;&#38548;&#38626;&#23652;&#32026;&#65292;&#21063;&#27492;&#38598;&#21312;&#20013;&#30340;&#36899;&#32218;&#26371;&#20197;&#25351;&#23450;&#30340;&#23652;&#32026;&#36914;&#34892;&#20316;&#26989;&#12290;&#21542;&#21063;&#65292;&#36899;&#32218;&#23559;&#20351;&#29992; JDBC &#39493;&#21205;&#31243;&#24335;&#25552;&#20379;&#30340;&#38928;&#35373;&#38548;&#38626;&#23652;&#32026;&#36914;&#34892;&#20316;&#26989;&#12290;&#20381;&#38928;&#35373;&#65292;&#19981;&#26371;&#25351;&#23450;&#27492;&#36984;&#38917;&#12290;</p>
</dd>
<dt>&#38548;&#38626;&#23652;&#32026;</dt>
<dd>
<p>&#33509;&#36984;&#21462;&#20102;&#12300;&#21463;&#20445;&#35657;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#21063;&#24478;&#38598;&#21312;&#20013;&#29554;&#21462;&#30340;&#25152;&#26377;&#36899;&#32218;&#37117;&#20855;&#26377;&#30456;&#21516;&#30340;&#38548;&#38626;&#23652;&#32026;&#12290;&#20363;&#22914;&#65292;&#33509;&#19978;&#27425;&#20351;&#29992;&#36899;&#32218;&#26178;&#20197;&#31243;&#24335;&#35373;&#35336;&#26041;&#24335; (&#20351;&#29992; <code>con.setTransactionIsolation</code>) &#35722;&#26356;&#20102;&#36899;&#32218;&#30340;&#38548;&#38626;&#23652;&#32026;&#65292;&#21063;&#27492;&#27231;&#21046;&#26371;&#23559;&#29376;&#24907;&#35722;&#26356;&#22238;&#25351;&#23450;&#30340;&#38548;&#38626;&#23652;&#32026;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#21855;&#29992;&#12290;</p>
<p>&#21482;&#26377;&#24050;&#25351;&#23450;&#20316;&#26989;&#20107;&#20214;&#38548;&#38626;&#23652;&#32026;&#26178;&#65292;&#25165;&#21487;&#20351;&#29992;&#27492;&#35373;&#23450;&#12290;</p>
</dd>
<dt>&#20854;&#20182;&#29305;&#24615;</dt>
<dd>
<p>JDBC &#36899;&#32218;&#38598;&#21312;&#30340;&#20854;&#20182;&#29305;&#24615;&#12290;&#36889;&#20123;&#29305;&#24615;&#21487;&#33021;&#21253;&#21547;&#36039;&#26009;&#24235;&#21517;&#31281; (URL)&#12289;&#20351;&#29992;&#32773;&#21517;&#31281;&#21644;&#23494;&#30908;&#12290;&#34920;&#20013;&#19968;&#33324;&#26371;&#21253;&#21547;&#36039;&#26009;&#24235;&#20379;&#25033;&#21830;&#20351;&#29992;&#30340;&#29305;&#24615;&#12290;</p>
<p>&#22914;&#38656;&#37096;&#20998;&#21487;&#29992;&#29305;&#24615;&#30340;&#25551;&#36848;&#65292;&#35531;&#21443;&#38321;<a href="ref-jdbc-properties.html">JDBC &#36899;&#32218;&#38598;&#21312;&#29305;&#23450;&#30340;&#29305;&#24615;</a>&#12290;</p>
<p>&#33509;&#24744;&#26410;&#37341;&#23565;&#29305;&#24615;&#25351;&#23450;&#20540;&#65292;&#36899;&#32218;&#38598;&#21312;&#24314;&#31435;&#23436;&#25104;&#26178;&#65292;&#26371;&#24478;&#34920;&#20013;&#31227;&#38500;&#35442;&#29305;&#24615;&#12290;&#33509;&#24744;&#19981;&#24819;&#31435;&#21363;&#28858;&#29305;&#24615;&#35373;&#23450;&#20540;&#65292;&#20294;&#24076;&#26395;&#23559;&#35442;&#29305;&#24615;&#20445;&#30041;&#22312;&#34920;&#20013;&#65292;&#24453;&#31245;&#24460;&#28858;&#20854;&#35373;&#23450;&#20540;&#65292;&#35531;&#22312;&#12300;&#20540;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#19968;&#32068;&#31354;&#30340;&#22291;&#25324;&#34399;&#65306;</p>
<pre>
()
</pre></dd>
</dl>
<a id="sthref44" name="sthref44"></a>
<h5>&#30456;&#38364;&#20316;&#26989;</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">&#35373;&#23450;&#36039;&#26009;&#24235;&#23384;&#21462;</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">&#25972;&#21512; JDBC &#39493;&#21205;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">&#24314;&#31435; JDBC &#36899;&#32218;&#38598;&#21312;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">&#32232;&#36655; JDBC &#36899;&#32218;&#38598;&#21312;&#19968;&#33324;&#35373;&#23450;</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">&#39511;&#35657;&#36899;&#32218;&#38598;&#21312;&#35373;&#23450;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">&#32232;&#36655; JDBC &#36899;&#32218;&#38598;&#21312;&#36914;&#38542;&#23660;&#24615;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">&#32232;&#36655; JDBC &#36899;&#32218;&#38598;&#21312;&#29305;&#24615;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">&#21034;&#38500; JDBC &#36899;&#32218;&#38598;&#21312;</a></p>
</li>
</ul>
<a id="sthref45" name="sthref45"></a>
<h5>&#30456;&#38364;&#30340; asadmin &#21629;&#20196;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00001"><code>add-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00036"><code>create-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00088"><code>delete-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00135"><code>flush-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00173"><code>list-jdbc-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00214"><code>ping-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00234"><code>start-database</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00239"><code>stop-database</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
