<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jdbcconnectionpooledit" name="task-jdbcconnectionpooledit"></a></p>

<h4><a id="sthref16" name="sthref16"></a>&#32232;&#36655; JDBC &#36899;&#32218;&#38598;&#21312;&#19968;&#33324;&#35373;&#23450;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#28687;&#35261;&#27193;&#29376;&#32080;&#27083;&#20013;&#65292;&#23637;&#38283;&#12300;&#36039;&#28304;&#12301;&#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#36039;&#28304;&#12301;&#31680;&#40670;&#19979;&#65292;&#23637;&#38283;&#12300;JDBC&#12301;&#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;JDBC&#12301;&#31680;&#40670;&#19979;&#65292;&#36984;&#21462;&#12300;&#36899;&#32218;&#38598;&#21312;&#12301;&#31680;&#40670;&#12290;</p>
<p>&#12300;&#36899;&#32218;&#38598;&#21312;&#12301;&#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#25353;&#19968;&#19979;&#24744;&#35201;&#32232;&#36655;&#30340;&#36899;&#32218;&#38598;&#21312;&#21517;&#31281;&#12290;</p>
<p>&#12300;&#32232;&#36655;&#36899;&#32218;&#38598;&#21312;&#12301;&#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#24478;&#12300;&#36039;&#28304;&#39006;&#22411;&#12301;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#19968;&#31278;&#36039;&#28304;&#39006;&#22411;&#12290;</p>
<p>&#36984;&#38917;&#21253;&#25324; <code>javax.sql.DataSource</code> (&#20677;&#38480;&#26044;&#26412;&#27231;&#20316;&#26989;&#20107;&#20214;)&#12289;<code>javax.sql.XADataSource</code> (&#20840;&#22495;&#20316;&#26989;&#20107;&#20214;) &#21644; <code>java.sql.ConnectionPoolDataSource</code> (&#26412;&#27231;&#20316;&#26989;&#20107;&#20214;&#65292;&#21487;&#33021;&#26371;&#25913;&#21892;&#25928;&#33021;)&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#36039;&#26009;&#20358;&#28304;&#39006;&#21029;&#21517;&#31281;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#23526;&#34892; <code>DataSource</code>&#12289;<code>ConnectionPoolDataSource</code> &#25110; <code>XADataSource</code> API &#30340;&#20379;&#25033;&#21830;&#23560;&#23660;&#39006;&#21029;&#21517;&#31281;&#12290;</p>
<p>&#33509;&#24744;&#36984;&#21462;&#20102;&#20854;&#20013;&#19968;&#20491;&#36039;&#26009;&#20358;&#28304;&#36039;&#28304;&#39006;&#22411;&#65292;&#27492;&#27396;&#20301;&#36890;&#24120;&#26371;&#33258;&#21205;&#22635;&#20837;&#33287;&#24744;&#25152;&#36984;&#30340;&#36039;&#28304;&#39006;&#22411;&#21644;&#36039;&#26009;&#24235;&#20379;&#25033;&#21830;&#38364;&#32879;&#30340;&#39006;&#21029;&#21517;&#31281;&#12290;&#33509;&#24744;&#36984;&#21462;&#20102; <code>java.sql.Driver</code> &#36039;&#28304;&#39006;&#22411;&#65292;&#26371;&#20572;&#29992;&#27492;&#27396;&#20301;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#39493;&#21205;&#31243;&#24335;&#39006;&#21029;&#21517;&#31281;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#23526;&#34892; <code>java.sql.Driver</code> API &#30340;&#20379;&#25033;&#21830;&#23560;&#23660;&#39006;&#21029;&#21517;&#31281;&#12290;</p>
<p>&#33509;&#24744;&#36984;&#21462;&#20102; <code>java.sql.Driver</code> &#36039;&#28304;&#39006;&#22411;&#65292;&#27492;&#27396;&#20301;&#36890;&#24120;&#26371;&#33258;&#21205;&#22635;&#20837;&#33287;&#24744;&#25152;&#36984;&#30340;&#39493;&#21205;&#31243;&#24335;&#21644;&#36039;&#26009;&#24235;&#20379;&#25033;&#21830;&#38364;&#32879;&#30340;&#39006;&#21029;&#21517;&#31281;&#12290;&#33509;&#24744;&#36984;&#21462;&#20102;&#20854;&#20013;&#19968;&#20491;&#36039;&#26009;&#20358;&#28304;&#36039;&#28304;&#39006;&#22411;&#65292;&#26371;&#20572;&#29992;&#27492;&#27396;&#20301;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#21855;&#29992; Ping&#12301;&#26680;&#21462;&#26041;&#22602;&#21487;&#33258;&#21205;&#22312;&#38598;&#21312;&#24314;&#31435;&#25110;&#37325;&#26032;&#32068;&#24907;&#26399;&#38291;&#33258;&#21205; Ping &#38598;&#21312;&#65292;&#20197;&#35672;&#21029;&#20006;&#35686;&#21578;&#20219;&#20309;&#37679;&#35492;&#30340;&#23660;&#24615;&#20540;&#12290;</p>
<p>&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#25551;&#36848;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#36899;&#32218;&#38598;&#21312;&#30340;&#31777;&#30701;&#25551;&#36848;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#38598;&#21312;&#30340;&#21021;&#22987;&#22823;&#23567;&#21644;&#26368;&#23567;&#22823;&#23567;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#27492;&#38598;&#21312;&#30340;&#26368;&#23567;&#36899;&#32218;&#25976;&#30446;&#12290;</p>
<p>&#35442;&#20540;&#36996;&#21487;&#27770;&#23450;&#39318;&#27425;&#24314;&#31435;&#38598;&#21312;&#25110; GlassFish Server &#21855;&#21205;&#26178;&#65292;&#32622;&#26044;&#38598;&#21312;&#20013;&#30340;&#36899;&#32218;&#25976;&#30446;&#12290;&#38928;&#35373;&#20540;&#28858; 8&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#38598;&#21312;&#30340;&#26368;&#22823;&#22823;&#23567;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#27492;&#38598;&#21312;&#30340;&#26368;&#22823;&#36899;&#32218;&#25976;&#30446;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 32&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#38598;&#21312;&#35373;&#23450;&#22823;&#23567;&#25976;&#37327;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#27599;&#20491;&#38598;&#21312;&#35373;&#23450;&#22823;&#23567;&#25209;&#27425;&#30340;&#36899;&#32218;&#25976;&#30446;&#12290;</p>
<p>&#30070;&#38598;&#21312;&#20998;&#21029;&#21521;&#26368;&#22823;&#38598;&#21312;&#22823;&#23567;&#25844;&#20805;&#20197;&#21450;&#21521;&#26368;&#23567;&#38598;&#21312;&#22823;&#23567;&#25910;&#32302;&#26178;&#65292;&#23559;&#25104;&#25209;&#35519;&#25972;&#22823;&#23567;&#12290;&#27492;&#20540;&#30906;&#23450;&#25209;&#27425;&#20013;&#30340;&#36899;&#32218;&#25976;&#30446;&#12290;&#23559;&#27492;&#20540;&#35373;&#32622;&#36942;&#22823;&#26371;&#24310;&#36978;&#36899;&#32218;&#24314;&#31435;&#21644;&#36039;&#28304;&#22238;&#25910;&#65307;&#32780;&#23559;&#35442;&#20540;&#35373;&#32622;&#36942;&#23567;&#21063;&#26371;&#23566;&#33268;&#25928;&#29575;&#38477;&#20302;&#12290;&#38928;&#35373;&#20540;&#28858; 2&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#38290;&#32622;&#36926;&#26178;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#36899;&#32218;&#21487;&#20197;&#22312;&#38598;&#21312;&#20013;&#38290;&#32622;&#30340;&#26368;&#38263;&#26178;&#38291; (&#20197;&#31186;&#28858;&#21934;&#20301;)&#12290;</p>
<p>&#19968;&#26086;&#36229;&#36942;&#27492;&#26178;&#38291;&#65292;&#21363;&#24478;&#38598;&#21312;&#20013;&#31227;&#38500;&#35442;&#36899;&#32218;&#12290;&#38928;&#35373;&#20540;&#28858; 300&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#26368;&#22823;&#31561;&#24453;&#26178;&#38291;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#36899;&#32218;&#36926;&#26178;&#21069;&#65292;&#35531;&#27714;&#36899;&#32218;&#30340;&#25033;&#29992;&#31243;&#24335;&#38656;&#31561;&#24453;&#30340;&#26368;&#38263;&#26178;&#38291; (&#20197;&#27627;&#31186;&#28858;&#21934;&#20301;)&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 60,000&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#21855;&#29992;&#38750;&#20316;&#26989;&#20107;&#20214;&#36899;&#32218;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#21487;&#20659;&#22238;&#38750;&#20316;&#26989;&#20107;&#20214;&#36899;&#32218;&#12290;</p>
<p>&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</li>
<li>
<p>&#24478;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#36899;&#32218;&#38598;&#21312;&#30340;&#20316;&#26989;&#20107;&#20214;&#38548;&#38626;&#23652;&#32026;&#12290;</p>
<p>&#33509;&#19981;&#25351;&#23450;&#27492;&#36984;&#38917;&#65292;&#36899;&#32218;&#23559;&#20351;&#29992; JDBC &#39493;&#21205;&#31243;&#24335;&#25152;&#25552;&#20379;&#30340;&#38928;&#35373;&#38548;&#38626;&#23652;&#32026;&#36914;&#34892;&#20316;&#26989;&#12290;&#20381;&#38928;&#35373;&#65292;&#19981;&#26371;&#25351;&#23450;&#27492;&#36984;&#38917;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#20445;&#35657;&#38548;&#38626;&#23652;&#32026;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#21487;&#20351;&#24478;&#38598;&#21312;&#20013;&#29554;&#21462;&#30340;&#25152;&#26377;&#36899;&#32218;&#37117;&#20855;&#26377;&#30456;&#21516;&#30340;&#38548;&#38626;&#23652;&#32026;&#12290;</p>
<p>&#20363;&#22914;&#65292;&#22914;&#26524;&#19978;&#27425;&#20351;&#29992;&#36899;&#32218;&#26178;&#31243;&#24335;&#21270; (&#20351;&#29992; <code>con.setTransactionIsolation</code>) &#35722;&#26356;&#20102;&#36899;&#32218;&#30340;&#38548;&#38626;&#23652;&#32026;&#65292;&#36889;&#31278;&#27231;&#21046;&#26371;&#23559;&#29376;&#24907;&#35722;&#26356;&#22238;&#25351;&#23450;&#30340;&#38548;&#38626;&#23652;&#32026;&#12290;</p>
<p>&#21482;&#26377;&#24050;&#25351;&#23450;&#20316;&#26989;&#20107;&#20214;&#38548;&#38626;&#23652;&#32026;&#26178;&#65292;&#25165;&#21487;&#20351;&#29992;&#27492;&#35373;&#23450;&#12290;</p>
</li>
<li>
<p>&#25353;&#19968;&#19979;&#12300;Ping&#12301;&#25353;&#37397;&#20197;&#39511;&#35657;&#36039;&#26009;&#24235;&#36899;&#32218;&#12290;</p>
<p>&#31649;&#29702;&#20027;&#25511;&#21488;&#23559;&#22039;&#35430;&#36899;&#32218;&#33267;&#36039;&#26009;&#24235;&#12290;&#22914;&#26524;&#39023;&#31034;&#37679;&#35492;&#35338;&#24687;&#65292;&#35531;&#27298;&#26597;&#36039;&#26009;&#24235;&#20282;&#26381;&#22120;&#26159;&#21542;&#24050;&#21855;&#21205;&#12290;</p>
</li>
<li>
<p>&#25353;&#19968;&#19979;&#12300;&#28165;&#38500;&#23531;&#20837;&#12301;&#25353;&#37397;&#65292;&#23559;&#36899;&#32218;&#38598;&#21312;&#37325;&#35373;&#28858;&#20854;&#21021;&#22987;&#29376;&#24907;&#12290;</p>
<p>&#36889;&#27171;&#26371;&#37559;&#27584;&#20219;&#20309;&#29694;&#26377;&#20351;&#29992;&#20013;&#30340;&#36899;&#32218;&#65292;&#34920;&#31034;&#33287;&#36889;&#20123;&#36899;&#32218;&#30456;&#38364;&#32879;&#30340;&#20316;&#26989;&#20107;&#20214;&#37117;&#26371;&#36986;&#22833;&#12290;&#28982;&#24460;&#23376;&#21629;&#20196;&#26371;&#28858;&#38598;&#21312;&#37325;&#26032;&#24314;&#31435;&#21021;&#22987;&#36899;&#32218;&#65292;&#20006;&#23559;&#38598;&#21312;&#36996;&#21407;&#25104;&#25345;&#32396;&#30340;&#38598;&#21312;&#22823;&#23567;&#12290;</p>
</li>
<li>
<p>&#25353;&#19968;&#19979;&#12300;&#20786;&#23384;&#12301;&#12290;</p>

<hr>
<p><b>&#25552;&#31034;:</b></p>
&#33509;&#35201;&#22238;&#21040;&#38928;&#35373;&#35373;&#23450;&#65292;&#35531;&#25353;&#19968;&#19979;&#12300;&#36617;&#20837;&#38928;&#35373;&#20540;&#12301;&#25353;&#37397;&#65292;&#28982;&#24460;&#25353;&#19968;&#19979;&#12300;&#20786;&#23384;&#12301;&#12290;<br />
<hr>

</li>
</ol>
<a id="sthref17" name="sthref17"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">&#35373;&#23450;&#36039;&#26009;&#24235;&#23384;&#21462;</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">&#25972;&#21512; JDBC &#39493;&#21205;&#31243;&#24335;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcenew.html">&#24314;&#31435; JDBC &#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesedit.html">&#32232;&#36655; JDBC &#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcetargets.html">&#32232;&#36655; JDBC &#36039;&#28304;&#30446;&#27161;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesdelete.html">&#21034;&#38500; JDBC &#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">&#24314;&#31435; JDBC &#36899;&#32218;&#38598;&#21312;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">&#32232;&#36655; JDBC &#36899;&#32218;&#38598;&#21312;&#36914;&#38542;&#23660;&#24615;</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">&#39511;&#35657;&#36899;&#32218;&#38598;&#21312;&#35373;&#23450;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">&#32232;&#36655; JDBC &#36899;&#32218;&#38598;&#21312;&#29305;&#24615;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">&#21034;&#38500; JDBC &#36899;&#32218;&#38598;&#21312;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
