<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterapplications" name="ref-clusterapplications"></a></p>

<h4><a id="sthref262" name="sthref262"></a><a id="sthref263" name="sthref263"></a>&#24212;&#29992;&#31243;&#24207;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&ldquo;&#24212;&#29992;&#31243;&#24207;&rdquo;&#39029;&#21487;&#23545;&#24403;&#21069;&#38598;&#32676;&#25191;&#34892;&#20197;&#19979;&#20219;&#21153;&#65306;</p>
<ul>
<li>
<p>&#26597;&#30475;&#21644;&#31649;&#29702;&#24050;&#37096;&#32626;&#21040;&#38598;&#32676;&#30340;&#24212;&#29992;&#31243;&#24207;</p>
</li>
<li>
<p>&#23558;&#22810;&#20010;&#24212;&#29992;&#31243;&#24207;&#37096;&#32626;&#21040;&#38598;&#32676;</p>
</li>
</ul>
<p>&ldquo;&#38598;&#32676;&#21517;&#31216;&rdquo;&#23383;&#27573;&#26159;&#21482;&#35835;&#23383;&#27573;&#65292;&#20854;&#20013;&#26174;&#31034;&#24403;&#21069;&#38598;&#32676;&#30340;&#21517;&#31216;&#12290;</p>
<p>&ldquo;&#24212;&#29992;&#31243;&#24207;&rdquo;&#39029;&#26174;&#31034;&#24050;&#37096;&#32626;&#21040;&#24403;&#21069;&#38598;&#32676;&#30340;&#24212;&#29992;&#31243;&#24207;&#30340;&#21015;&#34920;&#12290;&#23545;&#20110;&#27599;&#20010;&#24212;&#29992;&#31243;&#24207;&#65292;&#22343;&#25552;&#20379;&#20197;&#19979;&#20449;&#24687;&#12290;</p>
<dl>
<dt>&#21517;&#31216;</dt>
<dd>
<p>&#24212;&#29992;&#31243;&#24207;&#21517;&#31216;&#12290;</p>
<p>&#21517;&#31216;&#21487;&#21253;&#21547;&#21487;&#36873;&#30340;&#29256;&#26412;&#26631;&#35782;&#31526;&#65292;&#23427;&#36319;&#22312;&#21517;&#31216;&#21518;&#38754;&#65292;&#24182;&#19982;&#21517;&#31216;&#20197;&#20882;&#21495; (<code>:</code>) &#20998;&#38548;&#12290;&#26377;&#20851;&#27169;&#22359;&#21644;&#24212;&#29992;&#31243;&#24207;&#29256;&#26412;&#30340;&#35814;&#32454;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Oracle GlassFish Server Application Deployment Guide</i> &#20013;&#30340; <i>Module and Application Versions</i></a>&#12290;</p>
</dd>
<dt>&#24050;&#21551;&#29992;</dt>
<dd>
<p>&#25351;&#31034;&#24212;&#29992;&#31243;&#24207;&#26159;&#21542;&#24050;&#21551;&#29992;&#65306;</p>
<ul>
<li>
<p>&#22914;&#26524;&#24212;&#29992;&#31243;&#24207;&#24050;&#21551;&#29992;&#65292;&#23558;&#26174;&#31034;&#22797;&#36873;&#26631;&#35760; (&#10003;)&#12290;</p>
</li>
<li>
<p>&#22914;&#26524;&#24212;&#29992;&#31243;&#24207;&#24050;&#31105;&#29992;&#65292;&#23558;&#26174;&#31034;&#21449;&#21495; (&#10007;)&#12290;</p>
</li>
</ul>
</dd>
<dt>&#24050;&#21551;&#29992;&#36127;&#36733;&#24179;&#34913;&#22120;</dt>
<dd>
<p>&#25351;&#31034;&#29992;&#20110;&#36127;&#36733;&#24179;&#34913;&#30340;&#24212;&#29992;&#31243;&#24207;&#26159;&#21542;&#24050;&#21551;&#29992;&#65306;</p>
<ul>
<li>
<p>&#22914;&#26524;&#24212;&#29992;&#31243;&#24207;&#24050;&#21551;&#29992;&#36127;&#36733;&#24179;&#34913;&#65292;&#23558;&#26174;&#31034;&#22797;&#36873;&#26631;&#35760; (&#10003;)&#12290;</p>
</li>
<li>
<p>&#22914;&#26524;&#24212;&#29992;&#31243;&#24207;&#24050;&#31105;&#29992;&#36127;&#36733;&#24179;&#34913;&#65292;&#23558;&#26174;&#31034;&#21449;&#21495; (&#10007;)&#12290;</p>
</li>
</ul>
</dd>
<dt>&#24341;&#25806;</dt>
<dd>
<p>&#24212;&#29992;&#31243;&#24207;&#25152;&#29992;&#30340;&#23481;&#22120;&#31867;&#22411;&#12290;&#23481;&#22120;&#31867;&#22411;&#21487;&#20026;&#20197;&#19979;&#31867;&#22411;&#30340;&#20219;&#24847;&#19968;&#31181;&#65306;</p>
<ul>
<li>
<p><code>web</code></p>
</li>
<li>
<p><code>Web &#26381;&#21153;</code></p>
</li>
<li>
<p><code>ejb</code></p>
</li>
<li>
<p><code>&#36830;&#25509;&#22120;</code></p>
</li>
<li>
<p><code>appclient</code></p>
</li>
<li>
<p><code>weld</code> &mdash; Java EE &#24179;&#21488;&#24212;&#29992;&#31243;&#24207;&#30340; Contexts &#21644; Dependency Injection &#30340;&#23481;&#22120;</p>
</li>
</ul>
</dd>
</dl>
<p>&#24050;&#37096;&#32626;&#30340;&#24212;&#29992;&#31243;&#24207;&#34920;&#36824;&#21253;&#21547;&#20197;&#19979;&#36873;&#39033;&#12290;</p>
<dl>
<dt>&#37096;&#32626;</dt>
<dd>
<p>&#29992;&#20110;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#30340;&#25353;&#38062;&#12290;</p>
</dd>
<dt>&#21462;&#28040;&#37096;&#32626;</dt>
<dd>
<p>&#29992;&#20110;&#21462;&#28040;&#37096;&#32626;&#19968;&#20010;&#25110;&#22810;&#20010;&#25152;&#36873;&#24212;&#29992;&#31243;&#24207;&#30340;&#25353;&#38062;&#12290;</p>
<p>&#21462;&#28040;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#20250;&#20174;&#25152;&#26377;&#30446;&#26631;&#21644;&#22495;&#20013;&#21024;&#38500;&#35813;&#24212;&#29992;&#31243;&#24207;&#12290;&#21462;&#28040;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#26102;&#65292;&#35813;&#24212;&#29992;&#31243;&#24207;&#23558;&#19981;&#20877;&#21015;&#22312;<a href="../../../common/en/help/ref-applications.html">&#24212;&#29992;&#31243;&#24207;</a>&#39029;&#19978;&#65292;&#35813;&#39029;&#26174;&#31034;&#25152;&#26377;&#24050;&#37096;&#32626;&#21040; GlassFish Server &#20013;&#30340;&#24212;&#29992;&#31243;&#24207;&#12290;</p>
<p>&#35201;&#20165;&#20174;&#24403;&#21069;&#30446;&#26631;&#20013;&#21024;&#38500;&#24212;&#29992;&#31243;&#24207;&#65292;&#35831;&#20351;&#29992;&#35813;&#39029;&#19978;&#30340;&ldquo;&#21024;&#38500;&rdquo;&#25353;&#38062;&#12290;</p>
</dd>
<dt>&#21024;&#38500;</dt>
<dd>
<p>&#29992;&#20110;&#21024;&#38500;&#19968;&#20010;&#25110;&#22810;&#20010;&#25152;&#36873;&#24212;&#29992;&#31243;&#24207;&#30340;&#25353;&#38062;&#12290;</p>
<p>&#21024;&#38500;&#24212;&#29992;&#31243;&#24207;&#21482;&#20250;&#20174;&#24403;&#21069;&#30446;&#26631;&#20013;&#21024;&#38500;&#35813;&#24212;&#29992;&#31243;&#24207;&#12290;&#23558;&#24212;&#29992;&#31243;&#24207;&#20174;&#30446;&#26631;&#20013;&#21024;&#38500;&#26102;&#65292;&#35813;&#24212;&#29992;&#31243;&#24207;&#20250;&#32487;&#32493;&#21015;&#22312;<a href="../../../common/en/help/ref-applications.html">&#24212;&#29992;&#31243;&#24207;</a>&#39029;&#19978;&#65292;&#35813;&#39029;&#26174;&#31034;&#25152;&#26377;&#24050;&#37096;&#32626;&#21040; GlassFish Server &#20013;&#30340;&#24212;&#29992;&#31243;&#24207;&#12290;&#22312;&#26366;&#32463;&#37096;&#32626;&#20102;&#35813;&#24212;&#29992;&#31243;&#24207;&#30340;&#20219;&#20309;&#20854;&#20182;&#30446;&#26631;&#20013;&#65292;&#35813;&#24212;&#29992;&#31243;&#24207;&#20063;&#20173;&#20445;&#25345;&#22788;&#20110;&#37096;&#32626;&#29366;&#24577;&#12290;</p>
<p>&#35201;&#20174;&#25152;&#26377;&#30446;&#26631;&#21644;&#22495;&#20013;&#21024;&#38500;&#24212;&#29992;&#31243;&#24207;&#65292;&#35831;&#20351;&#29992;&#35813;&#39029;&#19978;&#30340;&ldquo;&#21462;&#28040;&#37096;&#32626;&rdquo;&#25353;&#38062;&#12290;</p>
</dd>
<dt>&#26356;&#22810;&#25805;&#20316;</dt>
<dd>
<p>&#22312;&#19968;&#20010;&#25110;&#22810;&#20010;&#25152;&#36873;&#24212;&#29992;&#31243;&#24207;&#19978;&#25191;&#34892;&#20854;&#20182;&#25805;&#20316;&#30340;&#19979;&#25289;&#21015;&#34920;&#12290;</p>
<dl>
<dt>&#21551;&#29992;</dt>
<dd>
<p>&#21551;&#29992;&#19968;&#20010;&#25110;&#22810;&#20010;&#25152;&#36873;&#24212;&#29992;&#31243;&#24207;&#12290;</p>
</dd>
<dt>&#31105;&#29992;</dt>
<dd>
<p>&#31105;&#29992;&#19968;&#20010;&#25110;&#22810;&#20010;&#25152;&#36873;&#24212;&#29992;&#31243;&#24207;&#12290;</p>
</dd>
<dt>&#36127;&#36733;&#24179;&#34913;&#22120;&#21551;&#29992;</dt>
<dd>
<p>&#21551;&#29992;&#19968;&#20010;&#25110;&#22810;&#20010;&#29992;&#20110;&#36127;&#36733;&#24179;&#34913;&#30340;&#25152;&#36873;&#24212;&#29992;&#31243;&#24207;&#12290;</p>
</dd>
<dt>&#36127;&#36733;&#24179;&#34913;&#22120;&#31105;&#29992;</dt>
<dd>
<p>&#31105;&#29992;&#19968;&#20010;&#25110;&#22810;&#20010;&#29992;&#20110;&#36127;&#36733;&#24179;&#34913;&#30340;&#25152;&#36873;&#24212;&#29992;&#31243;&#24207;&#12290;</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref264" name="sthref264"></a>
<h5>&#30456;&#20851;&#20219;&#21153;</h5>
<ul>
<li>
<p><a href="task-cluster-app-deploy.html">&#23558;&#24212;&#29992;&#31243;&#24207;&#37096;&#32626;&#21040;&#38598;&#32676;</a></p>
</li>
<li>
<p><a href="task-cluster-app-list.html">&#21015;&#20986;&#24050;&#37096;&#32626;&#21040;&#38598;&#32676;&#30340;&#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-cluster-app-undeploy.html">&#20174;&#38598;&#32676;&#20013;&#21462;&#28040;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-cluster-app-remove.html">&#20174;&#38598;&#32676;&#20013;&#21024;&#38500;&#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-cluster-app-edit.html">&#32534;&#36753;&#24050;&#37096;&#32626;&#21040;&#38598;&#32676;&#30340;&#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-cluster-app-enable-disable.html">&#21551;&#29992;&#25110;&#31105;&#29992;&#24050;&#37096;&#32626;&#21040;&#38598;&#32676;&#30340;&#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-cluster-app-lb-enable-disable.html">&#20026;&#24050;&#37096;&#32626;&#21040;&#38598;&#32676;&#30340;&#24212;&#29992;&#31243;&#24207;&#21551;&#29992;&#25110;&#31105;&#29992;&#36127;&#36733;&#24179;&#34913;</a></p>
</li>
</ul>
<a id="sthref265" name="sthref265"></a>
<h5>&#31561;&#25928;&#30340; asadmin &#23376;&#21629;&#20196;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00114"><code>deploy</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00116"><code>disable</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00118"><code>disable-http-lb-application</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00124"><code>enable</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00126"><code>enable-http-lb-application</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00148"><code>list-applications</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
