<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusternew" name="ref-clusternew"></a><a id="GHCLU00002" name="GHCLU00002"></a></p>

<h4><a id="sthref247" name="sthref247"></a><a id="sthref248" name="sthref248"></a>&#26032;&#24314;&#38598;&#32676;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&ldquo;&#26032;&#24314;&#38598;&#32676;&rdquo;&#39029;&#21487;&#21019;&#24314;&#38598;&#32676;&#12290;</p>
<p>&ldquo;&#26032;&#24314;&#38598;&#32676;&rdquo;&#39029;&#21253;&#21547;&#20197;&#19979;&#36873;&#39033;&#12290;</p>
<dl>
<dt>&#38598;&#32676;&#21517;&#31216;</dt>
<dd>
<p>&#38598;&#32676;&#30340;&#21517;&#31216;&#12290;</p>
<p>&#21517;&#31216;&#24517;&#39035;&#28385;&#36275;&#20197;&#19979;&#35201;&#27714;&#65306;</p>
<ul>
<li>
<p>&#21517;&#31216;&#20013;&#21482;&#33021;&#21253;&#21547; ASCII &#23383;&#31526;&#12290;</p>
</li>
<li>
<p>&#21517;&#31216;&#24320;&#22836;&#24517;&#39035;&#26159;&#23383;&#27597;&#12289;&#25968;&#23383;&#25110;&#19979;&#21010;&#32447;&#12290;</p>
</li>
<li>
<p>&#21517;&#31216;&#21482;&#33021;&#21253;&#21547;&#20197;&#19979;&#23383;&#31526;&#65306;</p>
<ul>
<li>
<p>&#23567;&#20889;&#23383;&#27597;</p>
</li>
<li>
<p>&#22823;&#20889;&#23383;&#27597;</p>
</li>
<li>
<p>&#25968;&#23383;</p>
</li>
<li>
<p>&#36830;&#23383;&#31526;</p>
</li>
<li>
<p>&#21477;&#28857;</p>
</li>
<li>
<p>&#19979;&#21010;&#32447;</p>
</li>
</ul>
</li>
<li>
<p>&#21517;&#31216;&#22312;&#22495;&#20013;&#24517;&#39035;&#26159;&#21807;&#19968;&#30340;&#65292;&#32780;&#19988;&#19981;&#24471;&#26159;&#21478;&#19968;&#20010;&#38598;&#32676;&#12289;&#21629;&#21517;&#37197;&#32622;&#12289;GlassFish Server &#23454;&#20363;&#25110;&#33410;&#28857;&#30340;&#21517;&#31216;&#12290;</p>
</li>
<li>
<p>&#21517;&#31216;&#19981;&#24471;&#26159; <code>domain</code>&#12289;<code>server</code> &#25110; GlassFish Server &#20445;&#30041;&#30340;&#20219;&#20309;&#20854;&#20182;&#20851;&#38190;&#23383;&#12290;</p>
</li>
</ul>
</dd>
<dt>&#37197;&#32622;</dt>
<dd>
<p>&#38598;&#32676;&#21487;&#20351;&#29992;&#30340;&#29616;&#26377;&#21629;&#21517;&#37197;&#32622;&#30340;&#19979;&#25289;&#21015;&#34920;&#12290;&#38598;&#32676;&#38656;&#35201;&#19968;&#20010;&#21629;&#21517;&#37197;&#32622;&#65292;&#29992;&#20110;&#23450;&#20041;&#35201;&#28155;&#21152;&#21040;&#38598;&#32676;&#30340;&#25152;&#26377;&#23454;&#20363;&#30340;&#37197;&#32622;&#12290;&#24517;&#39035;&#20174;&#35813;&#21015;&#34920;&#20013;&#36873;&#25321;&#19968;&#20010;&#37197;&#32622;&#12290;&#38598;&#32676;&#22312;&#21019;&#24314;&#26102;&#23558;&#20351;&#29992;&#25152;&#36873;&#37197;&#32622;&#12290;</p>
</dd>
<dt>&#22797;&#21046;&#25152;&#36873;&#37197;&#32622;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#25321;&#27492;&#36873;&#39033;&#65292;&#21017;&#22312;&#21019;&#24314;&#38598;&#32676;&#26102;&#20250;&#22797;&#21046;&#25152;&#36873;&#37197;&#32622;&#12290;&#20250;&#20026;&#35813;&#37197;&#32622;&#30340;&#21103;&#26412;&#25351;&#23450;&#19968;&#20010;&#21517;&#31216; cluster-name<code>-config</code>&#65292;&#20854;&#20013; <i>cluster-name</i> &#26159;&#22312;&ldquo;&#38598;&#32676;&#21517;&#31216;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#30340;&#38598;&#32676;&#21517;&#31216;&#12290;</p>
<p>&#22914;&#26524;&#20174;&ldquo;&#37197;&#32622;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#36873;&#25321;&#20102; <code>default-config</code>&#65292;&#21017;&#24517;&#39035;&#36873;&#25321;&#27492;&#36873;&#39033;&#12290;<code>default-config</code> &#37197;&#32622;&#21482;&#33021;&#34987;&#22797;&#21046;&#32780;&#19981;&#33021;&#34987;&#24341;&#29992;&#12290;</p>
</dd>
<dt>&#24341;&#29992;&#25152;&#36873;&#37197;&#32622;</dt>
<dd>
<p>&#22914;&#26524;&#36873;&#25321;&#27492;&#36873;&#39033;&#65292;&#38598;&#32676;&#23558;&#20351;&#29992;&#25351;&#23450;&#30340;&#29616;&#26377;&#21629;&#21517;&#37197;&#32622;&#12290;</p>
<p>&#22914;&#26524;&#20174;&ldquo;&#37197;&#32622;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#36873;&#25321;&#20102; <code>default-config</code>&#65292;&#21017;<i>&#19981;&#33021;</i>&#36873;&#25321;&#27492;&#36873;&#39033;&#12290;<code>default-config</code> &#37197;&#32622;&#21482;&#33021;&#34987;&#22797;&#21046;&#32780;&#19981;&#33021;&#34987;&#24341;&#29992;&#12290;</p>
</dd>
<dt>&#28040;&#24687;&#38431;&#21015;&#38598;&#32676;&#37197;&#32622;&#31867;&#22411;</dt>
<dd>
<p>&#20351;&#29992;&#27492;&#36873;&#39033;&#21487;&#20197;&#25351;&#23450;&#35201;&#29992;&#20110;&#26032; GlassFish Server &#38598;&#32676;&#30340; &#28040;&#24687;&#38431;&#21015; &#20013;&#20171;&#38598;&#32676;&#30340;&#31867;&#22411;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;GlassFish Server &#20351;&#29992;&#24120;&#35268; &#28040;&#24687;&#38431;&#21015; &#20013;&#20171;&#38598;&#32676;&#65292;&#35813;&#38598;&#32676;&#24102;&#26377;&#19968;&#20010;&#20027;&#20013;&#20171;&#65292;&#24182;&#19988; GlassFish Server &#38598;&#32676;&#30340;&#27599;&#20010;&#23454;&#20363;&#20013;&#37117;&#20869;&#23884;&#19968;&#20010;&#20013;&#20171;&#12290;</p>
<p>&#22914;&#26524;&#27492;&#36873;&#39033;&#35774;&#32622;&#20026;&ldquo;&#23450;&#21046;&rdquo;&#65292;&#23558;&#26174;&#31034;&#22810;&#20010;&#20854;&#20182;&#36873;&#39033;&#26469;&#37197;&#32622; &#28040;&#24687;&#38431;&#21015; &#20013;&#20171;&#38598;&#32676;&#65292;&#20197;&#20415;&#29992;&#20110; GlassFish Server &#38598;&#32676;&#12290;&#35831;&#21442;&#38405;<a href="#CHDJFEJB">&#29992;&#20110;&#23450;&#21046; &#28040;&#24687;&#38431;&#21015; &#20013;&#20171;&#38598;&#32676;&#30340;&#36873;&#39033;</a>&#12290;</p>
</dd>
<dt>&#35201;&#21019;&#24314;&#30340;&#26381;&#21153;&#22120;&#23454;&#20363;</dt>
<dd>
<p>&#21019;&#24314;&#38598;&#32676;&#26102;&#35201;&#21019;&#24314;&#30340; GlassFish Server &#23454;&#20363;&#30340;&#21015;&#34920;&#12290;&#23545;&#20110;&#27599;&#20010;&#23454;&#20363;&#65292;&#23558;&#25552;&#20379;&#20197;&#19979;&#20449;&#24687;&#65306;</p>
<dl>
<dt>&#23454;&#20363;&#21517;&#31216;</dt>
<dd>
<p>&#23454;&#20363;&#30340;&#21517;&#31216;&#12290;</p>
</dd>
<dt>&#26435;&#37325;</dt>
<dd>
<p>&#19968;&#20010;&#34920;&#31034;&#23454;&#20363;&#30340;&#36127;&#36733;&#24179;&#34913;&#26435;&#37325;&#30340;&#25972;&#25968;&#12290;</p>
<p>&#36127;&#36733;&#24179;&#34913;&#26435;&#37325;&#30830;&#23450;&#22312;&#23545;&#38598;&#32676;&#30340;&#25152;&#26377;&#35831;&#27714;&#20013;&#65292;&#23454;&#20363;&#24212;&#22788;&#29702;&#30340;&#35831;&#27714;&#25152;&#21344;&#30340;&#27604;&#20363;&#12290;</p>
<p>&#20363;&#22914;&#65292;&#22312;&#19968;&#20010;&#20855;&#26377;&#20004;&#20010;&#23454;&#20363;&#30340;&#38598;&#32676;&#20013;&#65292;&#24744;&#21487;&#33021;&#38656;&#35201;&#19968;&#20010;&#23454;&#20363;&#26469;&#22788;&#29702;&#22235;&#20998;&#20043;&#19968;&#30340;&#35831;&#27714;&#65292;&#21478;&#19968;&#23454;&#20363;&#22788;&#29702;&#22235;&#20998;&#20043;&#19977;&#30340;&#35831;&#27714;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#23558;&#22788;&#29702;&#22235;&#20998;&#20043;&#19968;&#35831;&#27714;&#30340;&#23454;&#20363;&#30340;&#26435;&#37325;&#35774;&#32622;&#20026; 1&#65292;&#23558;&#21478;&#19968;&#23454;&#20363;&#30340;&#26435;&#37325;&#35774;&#32622;&#20026; 3&#12290;&#22914;&#26524;&#24744;&#21916;&#27426;&#20351;&#29992;&#30334;&#20998;&#27604;&#65292;&#21017;&#20998;&#21035;&#23558;&#23454;&#20363;&#26435;&#37325;&#35774;&#32622;&#20026; 25 &#21644; 75&#12290;</p>
<p>&#40664;&#35748;&#26435;&#37325;&#20026; 100&#12290;</p>
</dd>
<dt>&#33410;&#28857;</dt>
<dd>
<p>&#23454;&#20363;&#21487;&#39547;&#30041;&#30340;&#29616;&#26377;&#33410;&#28857;&#30340;&#19979;&#25289;&#21015;&#34920;&#12290;&#24517;&#39035;&#20174;&#21015;&#34920;&#20013;&#36873;&#25321;&#19968;&#20010;&#33410;&#28857;&#12290;&#21019;&#24314;&#38598;&#32676;&#26102;&#65292;&#23454;&#20363;&#23558;&#39547;&#30041;&#22312;&#25152;&#36873;&#33410;&#28857;&#19978;&#12290;</p>
</dd>
</dl>
<p>&ldquo;&#35201;&#21019;&#24314;&#30340;&#26381;&#21153;&#22120;&#23454;&#20363;&rdquo;&#34920;&#36824;&#21253;&#21547;&#20197;&#19979;&#36873;&#39033;&#12290;</p>
<dl>
<dt>&#26032;&#24314;</dt>
<dd>
<p>&#29992;&#20110;&#21019;&#24314;&#23454;&#20363;&#30340;&#25353;&#38062;&#12290;&#21333;&#20987;&#27492;&#25353;&#38062;&#21487;&#21521;&ldquo;&#35201;&#21019;&#24314;&#30340;&#26381;&#21153;&#22120;&#23454;&#20363;&rdquo;&#34920;&#20013;&#28155;&#21152;&#19968;&#34892;&#12290;</p>
</dd>
<dt>&#21024;&#38500;</dt>
<dd>
<p>&#29992;&#20110;&#21024;&#38500;&#23454;&#20363;&#30340;&#25353;&#38062;&#12290;</p>
</dd>
</dl>
</dd>
</dl>
<a id="CHDJFEJB" name="CHDJFEJB"></a>
<h5>&#29992;&#20110;&#23450;&#21046; &#28040;&#24687;&#38431;&#21015; &#20013;&#20171;&#38598;&#32676;&#30340;&#36873;&#39033;</h5>
<p>&#22914;&#26524;&ldquo;&#28040;&#24687;&#38431;&#21015;&#38598;&#32676;&#37197;&#32622;&#31867;&#22411;&rdquo;&#35774;&#32622;&#20026;&ldquo;&#23450;&#21046;&rdquo;&#65292;&#23558;&#26174;&#31034;&#20197;&#19979;&#36873;&#39033;&#26469;&#37197;&#32622; &#28040;&#24687;&#38431;&#21015; &#20013;&#20171;&#38598;&#32676;&#65292;&#20197;&#20415;&#29992;&#20110; GlassFish Server &#38598;&#32676;&#12290;</p>
<dl>
<dt>JMS &#26381;&#21153;&#31867;&#22411;</dt>
<dd>
<p>&#35201;&#22312;&#20013;&#20171;&#38598;&#32676;&#20013;&#20351;&#29992;&#30340;&#20013;&#20171; (&#22312; GlassFish Server &#20013;&#31216;&#20026; JMS &#20027;&#26426;) &#30340;&#31867;&#22411;&#12290;&#36873;&#23450;&#30340;&#31867;&#22411;&#20915;&#23450;&#20102;&#25152;&#25552;&#20379;&#30340;&#20013;&#20171;&#38598;&#32676;&#31867;&#22411;&#12290;&#20013;&#20171;&#31867;&#22411;&#22914;&#19979;&#25152;&#31034;&#12290;</p>
<dl>
<dt>&#23884;&#20837;&#24335;</dt>
<dd>
<p>&#20013;&#20171;&#37197;&#32622;&#21644;&#29983;&#21629;&#21608;&#26399;&#30001; GlassFish Server &#31649;&#29702;&#12290;&#27599;&#20010; GlassFish &#38598;&#32676;&#23454;&#20363;&#37117;&#30001;&#19982;&#23454;&#20363;&#30456;&#21516;&#30340; JVM &#20013;&#36816;&#34892;&#30340;&#20013;&#20171;&#36827;&#34892;&#22788;&#29702;&#12290;</p>
<p>&#22914;&#26524;&ldquo;JMS &#26381;&#21153;&#31867;&#22411;&rdquo;&#36873;&#39033;&#35774;&#32622;&#20026;&ldquo;&#23884;&#20837;&#24335;&rdquo;&#65292;&#21017;&#21482;&#25903;&#25345;&#24120;&#35268; &#28040;&#24687;&#38431;&#21015; &#20013;&#20171;&#38598;&#32676;&#12290;&#27492;&#26102;&#23558;&#26174;&#31034;&#29992;&#20110;&#37197;&#32622;&#24120;&#35268;&#38598;&#32676;&#30340;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#26412;&#22320;</dt>
<dd>
<p>&#20013;&#20171;&#37197;&#32622;&#21644;&#29983;&#21629;&#21608;&#26399;&#30001; GlassFish Server &#31649;&#29702;&#12290;&#27599;&#20010; GlassFish &#38598;&#32676;&#23454;&#20363;&#30001;&#19968;&#20010;&#20013;&#20171;&#22788;&#29702;&#65292;&#35813;&#20013;&#20171;&#36816;&#34892;&#22312;&#19982;&#23454;&#20363;&#30456;&#21516;&#30340;&#20027;&#26426;&#19978;&#30340;&#21333;&#29420; JVM &#20013;&#12290;</p>
<p>&#22914;&#26524;&ldquo;JMS &#26381;&#21153;&#31867;&#22411;&rdquo;&#36873;&#39033;&#35774;&#32622;&#20026;&ldquo;&#26412;&#22320;&rdquo;&#65292;&#21017;&#25903;&#25345;&#24120;&#35268;&#21644;&#22686;&#24378; (&#39640;&#21487;&#29992;&#24615;) &#28040;&#24687;&#38431;&#21015; &#20013;&#20171;&#38598;&#32676;&#12290;&#27492;&#26102;&#23558;&#26174;&#31034;&#29992;&#20110;&#36873;&#25321;&#38598;&#32676;&#31867;&#22411;&#21644;&#37197;&#32622;&#38598;&#32676;&#30340;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#36828;&#31243;</dt>
<dd>
<p>&#20013;&#20171;&#21644;&#20013;&#20171;&#38598;&#32676;&#37197;&#32622;&#21644;&#29983;&#21629;&#21608;&#26399;&#26159;&#20351;&#29992; &#28040;&#24687;&#38431;&#21015; &#31649;&#29702;&#24037;&#20855;&#31649;&#29702;&#30340;&#12290;</p>
<p>&#22914;&#26524;&ldquo;JMS &#26381;&#21153;&#31867;&#22411;&rdquo;&#36873;&#39033;&#35774;&#32622;&#20026;&ldquo;&#36828;&#31243;&rdquo;&#65292;&#21017;&#19981;&#26174;&#31034;&#20219;&#20309;&#20854;&#20182;&#36873;&#39033;&#12290;</p>
</dd>
</dl>
</dd>
<dt>JMS &#38598;&#32676;&#31867;&#22411;</dt>
<dd>
<p>&#29992;&#20110; GlassFish Server &#38598;&#32676;&#30340; &#28040;&#24687;&#38431;&#21015; &#20013;&#20171;&#38598;&#32676;&#30340;&#31867;&#22411;&#12290;</p>
<p>&#22914;&#26524;&ldquo;JMS &#38598;&#32676;&#31867;&#22411;&rdquo;&#36873;&#39033;&#35774;&#32622;&#20026;&ldquo;&#24120;&#35268;&rdquo;&#65292;&#21017;&#26174;&#31034;&#20197;&#19979;&#36873;&#39033;&#12290;</p>
<dl>
<dt>JMS &#37197;&#32622;&#23384;&#20648;&#31867;&#22411;</dt>
<dd>
<p>&#29992;&#20110;&#24120;&#35268;&#38598;&#32676;&#37197;&#32622;&#25968;&#25454;&#30340;&#25968;&#25454;&#23384;&#20648;&#30340;&#31867;&#22411;&#12290;&#22914;&#26524;&#27492;&#36873;&#39033;&#35774;&#32622;&#20026;&ldquo;&#20027;&#20013;&#20171;&rdquo;&#65292;&#21017;&#23558;&#38598;&#32676;&#20013;&#30340;&#19968;&#20010;&#20013;&#20171;&#25351;&#23450;&#20026;&#20027;&#20013;&#20171;&#24182;&#19988;&#30001;&#35813;&#20013;&#20171;&#23384;&#20648;&#37197;&#32622;&#25968;&#25454;&#12290;&#22914;&#26524;&#27492;&#36873;&#39033;&#35774;&#32622;&#20026;&ldquo;&#20849;&#20139;&#25968;&#25454;&#24211;&rdquo;&#65292;&#21017;&#37197;&#32622;&#25968;&#25454;&#23384;&#20648;&#22312;&#21487;&#20379;&#25152;&#26377;&#20013;&#20171;&#35775;&#38382;&#30340; JDBC &#25968;&#25454;&#23384;&#20648;&#20013;&#12290;&#22312;&#27492;&#31034;&#20363;&#20013;&#65292;&#23558;&#26174;&#31034;&#25968;&#25454;&#24211;&#30456;&#20851;&#36873;&#39033;&#12290;</p>
</dd>
<dt>JMS &#28040;&#24687;&#23384;&#20648;&#31867;&#22411;</dt>
<dd>
<p>&#27599;&#20010;&#20013;&#20171;&#22312;&#23384;&#20648;&#28040;&#24687;&#25968;&#25454;&#26102;&#20351;&#29992;&#30340;&#25968;&#25454;&#23384;&#20648;&#31867;&#22411;&#12290;&#22914;&#26524;&#27492;&#36873;&#39033;&#35774;&#32622;&#20026;&ldquo;&#25991;&#20214;&rdquo;&#65292;&#21017;&#27599;&#20010;&#20013;&#20171;&#23558;&#22312;&#22522;&#20110;&#25991;&#20214;&#30340;&#25968;&#25454;&#23384;&#20648;&#20013;&#23384;&#20648;&#28040;&#24687;&#25968;&#25454;&#12290;&#22914;&#26524;&#27492;&#36873;&#39033;&#35774;&#32622;&#20026;&ldquo;JDBC&rdquo;&#65292;&#21017;&#27599;&#20010;&#20013;&#20171;&#23558;&#22312; JDBC &#25968;&#25454;&#23384;&#20648;&#20013;&#23384;&#20648;&#28040;&#24687;&#25968;&#25454;&#12290;</p>
</dd>
</dl>
<p>&#22914;&#26524;&ldquo;JMS &#38598;&#32676;&#31867;&#22411;&rdquo;&#36873;&#39033;&#35774;&#32622;&#20026;&ldquo;&#22686;&#24378; (HA)&rdquo;&#65292;&#21017;&#23558;&#26174;&#31034;&#25968;&#25454;&#24211;&#30456;&#20851;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#25968;&#25454;&#24211;&#20379;&#24212;&#21830;</dt>
<dt>&#25968;&#25454;&#24211; URL</dt>
<dt>&#25968;&#25454;&#24211;&#29992;&#25143;</dt>
<dd>
<p>&#35201;&#22312;&#20197;&#19979;&#20219;&#19968;&#24773;&#20917;&#19979;&#20351;&#29992;&#30340; JDBC &#25968;&#25454;&#24211;&#30340;&#25968;&#25454;&#24211;&#20379;&#24212;&#21830;&#12289;&#35775;&#38382; URL &#21644;&#29992;&#25143;&#65306;</p>
<ul>
<li>
<p>&#24403;&#24120;&#35268;&#38598;&#32676;&#30340;&#37197;&#32622;&#23384;&#20648;&#31867;&#22411;&#35774;&#32622;&#20026;&ldquo;&#20849;&#20139;&#25968;&#25454;&#24211;&rdquo;&#26102;</p>
</li>
<li>
<p>&#24403;&#24120;&#35268;&#38598;&#32676;&#30340;&#28040;&#24687;&#23384;&#20648;&#31867;&#22411;&#35774;&#32622;&#20026;&ldquo;JDBC&rdquo;&#26102;</p>
</li>
<li>
<p>&#24403;&#38598;&#32676;&#31867;&#22411;&#35774;&#32622;&#20026;&ldquo;&#22686;&#24378; (HA)&rdquo;&#26102;</p>
</li>
</ul>
<p>&#26377;&#20851;&#21463;&#25903;&#25345;&#20379;&#24212;&#21830;&#20197;&#21450;&#27599;&#20010;&#20379;&#24212;&#21830;&#30340;&#35775;&#38382; URL &#26684;&#24335;&#30340;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405; <i>Oracle GlassFish Server Message Queue Administration Guide</i> &#20013;&#30340; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GMADG00244">JDBC-Based Persistence</a>&#12290;</p>
</dd>
<dt>&#25968;&#25454;&#24211;&#39564;&#35777;</dt>
<dt>&#25968;&#25454;&#24211;&#21475;&#20196;</dt>
<dt>&#21475;&#20196;&#21035;&#21517;</dt>
<dd>
<p>&#22312;&ldquo;&#25968;&#25454;&#24211;&#29992;&#25143;&rdquo;&#20013;&#25351;&#23450;&#30340; JDBC &#25968;&#25454;&#24211;&#29992;&#25143;&#30340;&#21475;&#20196;&#20449;&#24687;&#12290;</p>
<p>&#22914;&#26524;&ldquo;&#25968;&#25454;&#24211;&#39564;&#35777;&rdquo;&#35774;&#32622;&#20026;&ldquo;&#21475;&#20196;&rdquo;&#65292;&#21017;&#23558;&#26174;&#31034;&ldquo;&#25968;&#25454;&#24211;&#21475;&#20196;&rdquo;&#36873;&#39033;&#12290;&#22914;&#26524;&ldquo;&#25968;&#25454;&#24211;&#39564;&#35777;&rdquo;&#35774;&#32622;&#20026;&ldquo;&#21475;&#20196;&#21035;&#21517;&rdquo;&#65292;&#21017;&#23558;&#26174;&#31034;&ldquo;&#21475;&#20196;&#21035;&#21517;&rdquo;&#36873;&#39033;&#12290;</p>
</dd>
<dt>JMS &#38598;&#32676;&#23646;&#24615;</dt>
<dd>
<p>&#29992;&#20110;&#37197;&#32622;&#20013;&#20171;&#30340;&#19968;&#20010;&#25110;&#22810;&#20010; &#28040;&#24687;&#38431;&#21015; &#20013;&#20171;&#23646;&#24615;&#30340;&#21015;&#34920;&#12290;&#21015;&#34920;&#20351;&#29992;&#20882;&#21495; (<code>:</code>) &#20998;&#38548;&#65292;&#26684;&#24335;&#22914;&#19979;&#65306;</p>
<pre>
<i>prop1Name</i>=<i>prop1Value</i>:<i>prop2Name</i>=<i>prop2Value</i>:...
</pre>
<p>&#22914;&#26524;&#20013;&#20171;&#23646;&#24615;&#21517;&#21253;&#21547;&#28857;&#65292;&#21017;&#22312;&#28857;&#20043;&#21069;&#21152;&#20004;&#20010;&#21453;&#26012;&#26464; (<code>\\</code>)&#65307;&#20363;&#22914;&#65292;&#35201;&#21253;&#21547; <code>imq.system.max_count</code> &#23646;&#24615;&#65292;&#35831;&#22312;&#21015;&#34920;&#20013;&#25351;&#23450; <code>imq\\.system\\.max_count</code>&#12290;</p>
</dd>
</dl>
<a id="sthref249" name="sthref249"></a>
<h5>&#30456;&#20851;&#20219;&#21153;</h5>
<p><a href="task-create-cluster.html">&#21019;&#24314;&#38598;&#32676;</a></p>
<a id="sthref250" name="sthref250"></a>
<h5>&#31561;&#25928;&#30340; asadmin &#23376;&#21629;&#20196;</h5>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00017"><code>create-cluster</code>(1)</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
