<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterinstances" name="ref-clusterinstances"></a></p>

<h4><a id="sthref266" name="sthref266"></a><a id="sthref267" name="sthref267"></a>&#38598;&#32676;&#26381;&#21153;&#22120;&#23454;&#20363;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&ldquo;&#38598;&#32676;&#26381;&#21153;&#22120;&#23454;&#20363;&rdquo;&#39029;&#21487;&#22312;&#24403;&#21069;&#38598;&#32676;&#20013;&#21019;&#24314;&#21644;&#31649;&#29702; GlassFish Server &#23454;&#20363;&#12290;</p>
<p>&ldquo;&#38598;&#32676;&#21517;&#31216;&rdquo;&#23383;&#27573;&#26159;&#21482;&#35835;&#23383;&#27573;&#65292;&#20854;&#20013;&#26174;&#31034;&#24403;&#21069;&#38598;&#32676;&#30340;&#21517;&#31216;&#12290;</p>
<p>&ldquo;&#38598;&#32676;&#26381;&#21153;&#22120;&#23454;&#20363;&rdquo;&#39029;&#26174;&#31034;&#23646;&#20110;&#24403;&#21069;&#38598;&#32676;&#30340;&#23454;&#20363;&#30340;&#21015;&#34920;&#12290;&#23545;&#20110;&#27599;&#20010;&#23454;&#20363;&#65292;&#23558;&#25552;&#20379;&#20197;&#19979;&#20449;&#24687;&#12290;</p>
<dl>
<dt>&#21517;&#31216;</dt>
<dd>
<p>&#21019;&#24314;&#23454;&#20363;&#26102;&#20026;&#20854;&#25351;&#23450;&#30340;&#21517;&#31216;&#12290;&#21333;&#20987;&#35813;&#21517;&#31216;&#23558;&#25171;&#24320;&#23454;&#20363;&#30340;&ldquo;<a href="ref-clusterinstanceedit.html">&#19968;&#33324;&#20449;&#24687;</a>&rdquo;&#39029;&#12290;</p>
</dd>
<dt>LB &#26435;&#37325;</dt>
<dd>
<p>&#19968;&#20010;&#34920;&#31034;&#23454;&#20363;&#30340;&#36127;&#36733;&#24179;&#34913;&#26435;&#37325;&#30340;&#25972;&#25968;&#12290;</p>
<p>&#36127;&#36733;&#24179;&#34913;&#26435;&#37325;&#30830;&#23450;&#22312;&#23545;&#38598;&#32676;&#30340;&#25152;&#26377;&#35831;&#27714;&#20013;&#65292;&#23454;&#20363;&#24212;&#22788;&#29702;&#30340;&#35831;&#27714;&#25152;&#21344;&#30340;&#27604;&#20363;&#12290;</p>
<p>&#20363;&#22914;&#65292;&#22312;&#19968;&#20010;&#20855;&#26377;&#20004;&#20010;&#23454;&#20363;&#30340;&#38598;&#32676;&#20013;&#65292;&#24744;&#21487;&#33021;&#38656;&#35201;&#19968;&#20010;&#23454;&#20363;&#26469;&#22788;&#29702;&#22235;&#20998;&#20043;&#19968;&#30340;&#35831;&#27714;&#65292;&#21478;&#19968;&#23454;&#20363;&#22788;&#29702;&#22235;&#20998;&#20043;&#19977;&#30340;&#35831;&#27714;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#23558;&#22788;&#29702;&#22235;&#20998;&#20043;&#19968;&#35831;&#27714;&#30340;&#23454;&#20363;&#30340;&#26435;&#37325;&#35774;&#32622;&#20026; 1&#65292;&#23558;&#21478;&#19968;&#23454;&#20363;&#30340;&#26435;&#37325;&#35774;&#32622;&#20026; 3&#12290;&#22914;&#26524;&#24744;&#21916;&#27426;&#20351;&#29992;&#30334;&#20998;&#27604;&#65292;&#21017;&#20998;&#21035;&#23558;&#23454;&#20363;&#26435;&#37325;&#35774;&#32622;&#20026; 25 &#21644; 75&#12290;</p>
<p>&#40664;&#35748;&#26435;&#37325;&#20026; 100&#12290;</p>
</dd>
<dt>&#37197;&#32622;</dt>
<dd>
<p>&#23454;&#20363;&#24341;&#29992;&#30340;&#37197;&#32622;&#12290;&#21333;&#20987;&#37197;&#32622;&#21487;&#25171;&#24320;&#23454;&#20363;&#30340;<a href="../../../common/en/help/ref-configuration.html">&#37197;&#32622;</a>&#39029;&#12290;</p>
</dd>
<dt>&#33410;&#28857;</dt>
<dd>
<p>&#23454;&#20363;&#39547;&#30041;&#30340;&#33410;&#28857;&#30340;&#21517;&#31216;&#12290;&#21333;&#20987;&#35813;&#21517;&#31216;&#23558;&#25171;&#24320;&#33410;&#28857;&#30340;&ldquo;<a href="ref-nodeedit.html">&#32534;&#36753;&#33410;&#28857;</a>&rdquo;&#39029;&#12290;</p>
</dd>
<dt>&#29366;&#24577;</dt>
<dd>
<p>&#25351;&#31034;&#23454;&#20363;&#26159;&#22312;&#36816;&#34892;&#12289;&#38656;&#35201;&#37325;&#26032;&#21551;&#21160;&#20197;&#26681;&#25454;&#37197;&#32622;&#26356;&#25913;&#36827;&#34892;&#26356;&#26032;&#65292;&#36824;&#26159;&#26410;&#36816;&#34892;&#12290;&#27492;&#23383;&#27573;&#20026;&#21482;&#35835;&#12290;</p>
</dd>
</dl>
<p>&ldquo;&#26381;&#21153;&#22120;&#23454;&#20363;&rdquo;&#34920;&#36824;&#21253;&#21547;&#20197;&#19979;&#36873;&#39033;&#12290;</p>
<dl>
<dt>&#26032;&#24314;</dt>
<dd>
<p>&#29992;&#20110;&#21521;&#38598;&#32676;&#28155;&#21152;&#23454;&#20363;&#30340;&#25353;&#38062;&#12290;</p>
</dd>
<dt>&#21024;&#38500;</dt>
<dd>
<p>&#29992;&#20110;&#21024;&#38500;&#38598;&#32676;&#20013;&#19968;&#20010;&#25110;&#22810;&#20010;&#25152;&#36873;&#23454;&#20363;&#30340;&#25353;&#38062;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
&#22914;&#26524;&#20351;&#29992;&#30340;&#26159;&#24102;&#26377;&#20027;&#20013;&#20171;&#30340; Java &#28040;&#24687;&#26381;&#21153; (JMS) &#38598;&#32676;&#65292;&#35831;&#19981;&#35201;&#21024;&#38500;&#19982;&#35813;&#20027;&#20013;&#20171;&#20851;&#32852;&#30340;&#23454;&#20363;&#12290;&#22914;&#26524;&#24517;&#39035;&#21024;&#38500;&#35813;&#23454;&#20363;&#65292;&#35831;&#20351;&#29992; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00005"><code>change-master-broker</code>(1)</a> &#23376;&#21629;&#20196;&#23558;&#35813;&#20027;&#20013;&#20171;&#25351;&#23450;&#32473;&#21478;&#19968;&#20010;&#23454;&#20363;&#12290;
<hr>

</dd>
<dt>&#21551;&#21160;</dt>
<dd>
<p>&#29992;&#20110;&#21551;&#21160;&#38598;&#32676;&#20013;&#19968;&#20010;&#25110;&#22810;&#20010;&#25152;&#36873;&#23454;&#20363;&#30340;&#25353;&#38062;&#12290;</p>
</dd>
<dt>&#20572;&#27490;</dt>
<dd>
<p>&#29992;&#20110;&#20572;&#27490;&#38598;&#32676;&#20013;&#19968;&#20010;&#25110;&#22810;&#20010;&#25152;&#36873;&#23454;&#20363;&#30340;&#25353;&#38062;&#12290;</p>
</dd>
</dl>
<a id="sthref268" name="sthref268"></a>
<h5>&#30456;&#20851;&#20219;&#21153;</h5>
<ul>
<li>
<p><a href="task-create-clustered-instance.html">&#23558; GlassFish Server &#23454;&#20363;&#28155;&#21152;&#21040;&#38598;&#32676;</a></p>
</li>
<li>
<p><a href="task-delete-clustered-instances.html">&#21024;&#38500;&#38598;&#32676; GlassFish Server &#23454;&#20363;</a></p>
</li>
<li>
<p><a href="task-start-clustered-instances.html">&#21551;&#21160;&#38598;&#32676; GlassFish Server &#23454;&#20363;</a></p>
</li>
<li>
<p><a href="task-stop-clustered-instances.html">&#20572;&#27490;&#38598;&#32676; GlassFish Server &#23454;&#20363;</a></p>
</li>
</ul>
<a id="sthref269" name="sthref269"></a>
<h5>&#31561;&#25928;&#30340; asadmin &#23376;&#21629;&#20196;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00033"><code>create-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00085"><code>delete-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00170"><code>list-instances</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00236"><code>start-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00241"><code>stop-instance</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
