<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterproperties" name="ref-clusterproperties"></a></p>

<h4><a id="sthref300" name="sthref300"></a><a id="sthref301" name="sthref301"></a>&#38598;&#32676;&#23646;&#24615;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&ldquo;&#38598;&#32676;&#23646;&#24615;&rdquo;&#39029;&#26174;&#31034;&#20026;&#25152;&#36873;&#38598;&#32676;&#35774;&#32622;&#30340;&#23646;&#24615;&#30340;&#21015;&#34920;&#12290;&#36825;&#20123;&#23646;&#24615;&#28155;&#21152;&#20102;&#26377;&#20851;&#38598;&#32676;&#30340;&#21487;&#36873;&#37197;&#32622;&#20449;&#24687;&#12290;</p>
<p>&ldquo;&#38598;&#32676;&#21517;&#31216;&rdquo;&#23383;&#27573;&#26159;&#21482;&#35835;&#23383;&#27573;&#65292;&#20854;&#20013;&#26174;&#31034;&#25152;&#36873;&#38598;&#32676;&#30340;&#21517;&#31216;&#12290;</p>
<p>&#23545;&#20110;&#27599;&#20010;&#23646;&#24615;&#65292;&#37117;&#23558;&#26174;&#31034;&#20197;&#19979;&#20449;&#24687;&#65306;</p>
<dl>
<dt>&#21517;&#31216;</dt>
<dd>
<p>&#23646;&#24615;&#21517;&#31216;&#12290;</p>
</dd>
<dt>&#20540;</dt>
<dd>
<p>&#20026;&#25152;&#36873;&#30340;&#23454;&#20363;&#35774;&#32622;&#30340;&#23646;&#24615;&#30340;&#20540;&#12290;</p>
</dd>
<dt>&#35828;&#26126;</dt>
<dd>
<p>&#25552;&#20379;&#26377;&#20851;&#23646;&#24615;&#30340;&#35814;&#32454;&#20449;&#24687;&#30340;&#25991;&#26412;&#35828;&#26126;&#12290;</p>
</dd>
</dl>
<p>&ldquo;&#20854;&#20182;&#23646;&#24615;&rdquo;&#34920;&#36824;&#21253;&#21547;&#20197;&#19979;&#36873;&#39033;&#12290;</p>
<dl>
<dt>&#28155;&#21152;&#23646;&#24615;</dt>
<dd>
<p>&#29992;&#20110;&#28155;&#21152;&#23646;&#24615;&#30340;&#25353;&#38062;&#12290;&#21333;&#20987;&#27492;&#25353;&#38062;&#21487;&#21521;&ldquo;&#20854;&#20182;&#23646;&#24615;&rdquo;&#34920;&#20013;&#28155;&#21152;&#19968;&#34892;&#12290;</p>
</dd>
<dt>&#21024;&#38500;&#23646;&#24615;</dt>
<dd>
<p>&#29992;&#20110;&#21024;&#38500;&#19968;&#20010;&#25110;&#22810;&#20010;&#25152;&#36873;&#23646;&#24615;&#30340;&#25353;&#38062;&#12290;&#21024;&#38500;&#30340;&#20219;&#20309;&#23646;&#24615;&#20250;&#24674;&#22797;&#20854;&#40664;&#35748;&#20540;&#65292;&#25110;&#32773;&#22914;&#26524;&#27809;&#26377;&#35774;&#32622;&#40664;&#35748;&#20540;&#65292;&#21017;&#26410;&#23450;&#20041;&#12290;</p>
</dd>
</dl>
<p>GlassFish Server &#23450;&#20041;&#20102;&#20197;&#19979;&#38598;&#32676;&#23646;&#24615;&#65306;</p>
<dl>
<dt><code>GMS_DISCOVERY_URI_LIST</code></dt>
<dd>
<p>&#38598;&#32676;&#20013; GlassFish Server &#23454;&#20363;&#30340;&#20301;&#32622;&#65292;&#29992;&#20110;&#25628;&#32034;&#38598;&#32676;&#12290;&#21482;&#26377;&#22312;&#32452;&#31649;&#29702;&#26381;&#21153; (GMS) &#26410;&#23558;&#22810;&#28857;&#20256;&#36865;&#29992;&#20110;&#24191;&#25773;&#28040;&#24687;&#26102;&#25165;&#38656;&#35201;&#27492;&#23646;&#24615;&#12290;</p>
<p>&#35813;&#23646;&#24615;&#30340;&#26377;&#25928;&#20540;&#22914;&#19979;&#65306;</p>
<ul>
<li>
<p>&#32479;&#19968;&#36164;&#28304;&#26631;&#35782;&#31526; (URI) &#30340;&#36887;&#21495;&#20998;&#38548;&#21015;&#34920;&#12290;&#27599;&#20010; URI &#24517;&#39035;&#23450;&#20301;&#19968;&#20010; GlassFish Server &#23454;&#20363;&#25110; DAS&#12290;&#22914;&#26524;&#22810;&#20010; GlassFish Server &#23454;&#20363;&#36816;&#34892;&#22312;&#21516;&#19968;&#20027;&#26426;&#19978;&#65292;&#21017;&#38656;&#35201;&#37319;&#29992;&#35813;&#26684;&#24335;&#12290;</p>
<p>&#21015;&#34920;&#20013;&#27599;&#20010; URI &#30340;&#26684;&#24335;&#22914;&#19979;&#65306;</p>
<p><i>scheme</i><code>://</code><i>host-name-or -IP-address</i><code>:</code><i>port</i></p>
<ul>
<li>
<p><i>scheme</i> &#26159; URI &#26041;&#26696;&#65292;&#20540;&#20026; <code>tcp</code>&#12290;</p>
</li>
<li>
<p><i>host-name-or -IP-address</i> &#26159;&#36816;&#34892;&#23454;&#20363;&#30340;&#20027;&#26426;&#30340;&#20027;&#26426;&#21517;&#25110; IP &#22320;&#22336;&#12290;</p>
</li>
<li>
<p><i>port</i> &#26159;&#23454;&#20363;&#29992;&#20110;&#20174; GMS &#30417;&#21548;&#28040;&#24687;&#30340;&#31471;&#21475;&#30340;&#31471;&#21475;&#21495;&#12290;&#24517;&#39035;&#20026;&#23454;&#20363;&#35774;&#32622;&#31995;&#32479;&#23646;&#24615; <code>GMS_LISTENER_PORT-</code><i>clustername</i>&#12290;&#26377;&#20851;&#20026;&#23454;&#20363;&#35774;&#32622;&#27492;&#31995;&#32479;&#23646;&#24615;&#30340;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405; <i>Oracle GlassFish Server High Availability Administration Guide</i> &#20013;&#30340; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSHAG00373">Discovering a Cluster When Multicast Transport Is Unavailable</a>&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#27491;&#22312;&#36816;&#34892; DAS &#25110;&#23454;&#20363;&#30340; IP &#22320;&#22336;&#25110;&#20027;&#26426;&#21517;&#30340;&#36887;&#21495;&#20998;&#38548;&#21015;&#34920;&#12290;&#35813;&#21015;&#34920;&#21487;&#28151;&#21512;&#21253;&#21547; IP &#22320;&#22336;&#21644;&#20027;&#26426;&#21517;&#12290;&#20165;&#24403;&#27599;&#20010;&#20027;&#26426;&#19978;&#36816;&#34892;&#19968;&#20010;&#38598;&#32676;&#23454;&#20363;&#26102;&#65292;&#25165;&#33021;&#20351;&#29992;&#35813;&#26684;&#24335;&#12290;<code>GMS_LISTENER_PORT</code> &#23646;&#24615;&#30340;&#20540;&#23545;&#20110;&#22495;&#20013;&#30340;&#27599;&#20010;&#38598;&#32676;&#37117;&#24517;&#39035;&#26159;&#21807;&#19968;&#30340;&#12290;</p>
</li>
<li>
<p>&#20851;&#38190;&#23383; <code>generate</code>&#12290;&#20165;&#22312;&#27599;&#20010;&#20027;&#26426;&#19978;&#36816;&#34892;&#38598;&#32676;&#20013;&#30340;&#19968;&#20010;&#23454;&#20363;&#24182;&#19988; DAS &#22312;&#21333;&#29420;&#30340;&#20027;&#26426;&#19978;&#36816;&#34892;&#26102;&#65292;&#25165;&#21487;&#20197;&#20351;&#29992;&#27492;&#26684;&#24335;&#12290;&#21516;&#19968;&#20027;&#26426;&#19978;&#30340;&#22810;&#20010;&#23454;&#20363;&#19981;&#33021;&#26159;&#21516;&#19968;&#38598;&#32676;&#30340;&#25104;&#21592;&#12290;<code>GMS_LISTENER_PORT</code> &#23646;&#24615;&#30340;&#20540;&#23545;&#20110;&#22495;&#20013;&#30340;&#27599;&#20010;&#38598;&#32676;&#37117;&#24517;&#39035;&#26159;&#21807;&#19968;&#30340;&#12290;</p>
</li>
</ul>
</dd>
<dt><code>GMS_LISTENER_PORT</code></dt>
<dd>
<p>&#38598;&#32676;&#29992;&#20110;&#30417;&#21548;&#26469;&#33258; GMS &#28040;&#24687;&#30340;&#31471;&#21475;&#30340;&#31471;&#21475;&#21495;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026;&#23545; <code>GMS_LISTENER_PORT-</code><i>cluster-name</i> &#31995;&#32479;&#23646;&#24615;&#30340;&#24341;&#29992;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#26410;&#35774;&#32622;&#27492;&#31995;&#32479;&#23646;&#24615;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;GMS &#20174;&#23646;&#24615; <code>GMS_TCPSTARTPORT</code> &#21644; <code>GMS_TCPENDPORT</code> &#23450;&#20041;&#30340;&#33539;&#22260;&#20013;&#36873;&#25321;&#31354;&#38386;&#31471;&#21475;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#27492;&#33539;&#22260;&#20026; 9090-9200&#12290;&#22312;&#22823;&#22810;&#25968;&#24773;&#20917;&#19979;&#65292;&#35813;&#40664;&#35748;&#34892;&#20026;&#24212;&#35813;&#36275;&#22815;&#12290;</p>
<p>&#20294;&#26159;&#65292;&#22914;&#26524; GMS <b>&#19981;</b>&#20351;&#29992;&#22810;&#28857;&#20256;&#36865;&#26469;&#24191;&#25773;&#28040;&#24687;&#65292;&#21017;&#35813;&#23646;&#24615;&#24517;&#39035;&#25351;&#23450;&#19968;&#20010;&#23545;&#38598;&#32676;&#20013;&#25152;&#26377; GlassFish Server &#23454;&#20363;&#37117;&#26377;&#25928;&#30340;&#31471;&#21475;&#21495;&#12290;&#35201;&#20351;&#29992;&#40664;&#35748;&#20540;&#20197;&#28385;&#36275;&#35813;&#35201;&#27714;&#65292;&#35831;&#20351;&#29992;&#31995;&#32479;&#23646;&#24615;&#20998;&#21035;&#20026;&#27599;&#20010;&#23454;&#20363;&#35774;&#32622;&#31471;&#21475;&#21495;&#12290;</p>
<p>&#20363;&#22914;&#65292;&#20351;&#29992;&ldquo;<a href="ref-clustersystemproperties.html">&#38598;&#32676;&#31995;&#32479;&#23646;&#24615;</a>&rdquo;&#39029;&#20026; DAS &#21019;&#24314;&#31995;&#32479;&#23646;&#24615; <code>GMS_LISTENER_PORT-</code><i>cluster-name</i>&#12290;&#28982;&#21518;&#65292;&#23545;&#20110;&#38598;&#32676;&#20013;&#30340;&#27599;&#20010;&#23454;&#20363;&#65292;&#23558; <code>GMS_LISTENER_PORT-</code><i>cluster-name</i> &#31995;&#32479;&#23646;&#24615;&#35774;&#32622;&#20026;&#23454;&#20363;&#29992;&#20110;&#20174; GMS &#30417;&#21548;&#28040;&#24687;&#30340;&#31471;&#21475;&#21495;&#12290;&#38598;&#32676;&#30340; <code>GMS_LISTENER_PORT</code> &#23646;&#24615;&#30340;&#40664;&#35748;&#20540;&#24341;&#29992;&#27492;&#31995;&#32479;&#23646;&#24615;&#12290;</p>
</dd>
<dt><code>GMS_LOOPBACK</code></dt>
<dd>
<p>&#25351;&#23450;&#23454;&#20363;&#26159;&#21542;&#21487;&#20197;&#25509;&#25910;&#20854;&#24191;&#25773;&#21040;&#38598;&#32676;&#30340;&#24212;&#29992;&#32423;&#28040;&#24687;&#12290;</p>
<p>&#21487;&#33021;&#30340;&#20540;&#22914;&#19979;&#65306;</p>
<dl>
<dt><code>&#20551;</code></dt>
<dd>
<p>&#23454;&#20363;<i>&#19981;</i>&#33021;&#25509;&#25910;&#33258;&#24049;&#21457;&#36865;&#30340;&#28040;&#24687; (&#40664;&#35748;&#20540;)&#12290;</p>
</dd>
<dt><code>&#30495;</code></dt>
<dd>
<p>&#23454;&#20363;&#21487;&#20197;&#25509;&#25910;&#33258;&#24049;&#21457;&#36865;&#30340;&#28040;&#24687;&#12290;&#24403;&#23454;&#20363;&#26159;&#38598;&#32676;&#20013;&#30340;&#21807;&#19968;&#23454;&#20363;&#26102;&#65292;&#20351;&#29992;&#27492;&#35774;&#32622;&#23545;&#35813;&#23454;&#20363;&#36827;&#34892;&#27979;&#35797;&#12290;</p>
</dd>
</dl>
</dd>
<dt><code>GMS_MULTICAST_TIME_TO_LIVE</code></dt>
<dd>
<p>&#20197;&#19979;&#31867;&#22411;&#20107;&#20214;&#30340;&#22810;&#28857;&#20256;&#36865;&#28040;&#24687;&#22312;&#34987;&#20002;&#24323;&#20043;&#21069;&#21487;&#20197;&#23581;&#35797;&#30340;&#26368;&#22823;&#36845;&#20195;&#25968;&#25110;&#20256;&#36755;&#25968;&#65306;</p>
<ul>
<li>
<p>&#32452;&#25628;&#32034;</p>
</li>
<li>
<p>&#25104;&#21592;&#33033;&#21160;</p>
</li>
<li>
<p>&#25104;&#21592;&#20851;&#31995;&#26356;&#25913;</p>
</li>
</ul>
<p>&#35201;&#21305;&#37197;&#22312;&#20854;&#19978;&#37096;&#32626; DAS &#21644;&#38598;&#32676;&#23454;&#20363;&#30340;&#32593;&#32476;&#37197;&#32622;&#65292;&#21487;&#23558;&#27492;&#20540;&#35774;&#32622;&#30340;&#23613;&#21487;&#33021;&#23567;&#20123;&#12290;&#35201;&#30830;&#23450;&#31995;&#32479;&#30340;&#26368;&#23567;&#21487;&#33021;&#20540;&#65292;&#21487;&#20351;&#29992; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00259"><code>validate-multicast</code>(1)</a> &#23376;&#21629;&#20196;&#12290;</p>
<p>&#20540; 0 &#30830;&#20445;&#22810;&#28857;&#20256;&#36865;&#28040;&#24687;&#20174;&#19981;&#31163;&#24320;&#24191;&#25773;&#23427;&#20204;&#30340;&#20027;&#26426;&#12290;</p>
<p>&#20540; 1 &#20250;&#38459;&#27490;&#22312;&#21516;&#19968;&#23376;&#32593;&#19978;&#36890;&#36807;&#20132;&#25442;&#26426;&#25110;&#36335;&#30001;&#22120;&#36830;&#25509;&#30340;&#20027;&#26426;&#20043;&#38388;&#24191;&#25773;&#28040;&#24687;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 4&#65292;&#23558;&#30830;&#20445;&#28040;&#24687;&#25104;&#21151;&#24191;&#25773;&#21040;&#36890;&#36807;&#20132;&#25442;&#26426;&#25110;&#36335;&#30001;&#22120;&#36830;&#25509;&#20027;&#26426;&#30340;&#32593;&#32476;&#20013;&#30340;&#25152;&#26377;&#38598;&#32676;&#25104;&#21592;&#12290;</p>
</dd>
<dt><code>GMS_TCPENDPORT</code></dt>
<dd>
<p>&#33539;&#22260;&#20013;&#30340;&#26368;&#22823;&#31471;&#21475;&#21495;&#65307;&#22914;&#26524;&#26410;&#35774;&#32622; <code>GMS_LISTENER_PORT-</code><i>cluster-name</i> &#31995;&#32479;&#23646;&#24615;&#65292;&#21017; GMS &#23558;&#20174;&#35813;&#33539;&#22260;&#20013;&#36873;&#25321;&#31354;&#38386;&#31471;&#21475;&#12290;&#40664;&#35748;&#20540;&#20026; 9200&#12290;</p>
</dd>
<dt><code>GMS_TCPSTARTPORT</code></dt>
<dd>
<p>&#33539;&#22260;&#20013;&#30340;&#26368;&#23567;&#31471;&#21475;&#21495;&#65307;&#22914;&#26524;&#26410;&#35774;&#32622; <code>GMS_LISTENER_PORT-</code><i>cluster-name</i> &#31995;&#32479;&#23646;&#24615;&#65292;&#21017; GMS &#23558;&#20174;&#35813;&#33539;&#22260;&#20013;&#36873;&#25321;&#31354;&#38386;&#31471;&#21475;&#12290;&#40664;&#35748;&#20540;&#20026; 9090&#12290;</p>
</dd>
</dl>
<a id="sthref302" name="sthref302"></a>
<h5>&#31561;&#25928;&#30340; asadmin &#23376;&#21629;&#20196;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00139"><code>get</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00145"><code>list</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00226"><code>set</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
