<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clustergeneral" name="ref-clustergeneral"></a></p>

<h4><a id="sthref251" name="sthref251"></a><a id="sthref252" name="sthref252"></a><a id="sthref253" name="sthref253"></a><a id="sthref254" name="sthref254"></a>&#19968;&#33324;&#20449;&#24687;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&ldquo;&#19968;&#33324;&#20449;&#24687;&rdquo;&#39029;&#21253;&#21547;&#20197;&#19979;&#36873;&#39033;&#12290;</p>
<dl>
<dt>&#21551;&#21160;&#38598;&#32676;</dt>
<dd>
<p>&#29992;&#20110;&#21551;&#21160;&#38598;&#32676;&#30340;&#25353;&#38062;&#12290;&#22914;&#26524;&#38598;&#32676;&#20013;&#30340;&#25152;&#26377;&#23454;&#20363;&#37117;&#22312;&#36816;&#34892;&#65292;&#21017;&#20250;&#21462;&#28040;&#28608;&#27963;&#27492;&#25353;&#38062;&#12290;</p>
</dd>
<dt>&#20572;&#27490;&#38598;&#32676;</dt>
<dd>
<p>&#29992;&#20110;&#20572;&#27490;&#38598;&#32676;&#30340;&#25353;&#38062;&#12290;&#22914;&#26524;&#38598;&#32676;&#20013;&#30340;&#25152;&#26377;&#23454;&#20363;&#37117;&#24050;&#20572;&#27490;&#65292;&#21017;&#20250;&#21462;&#28040;&#28608;&#27963;&#27492;&#25353;&#38062;&#12290;</p>
</dd>
<dt>&#31227;&#26893; EJB &#35745;&#26102;&#22120;</dt>
<dd>
<p>&#29992;&#20110;&#23558; Enterprise JavaBeans (EJB) &#25216;&#26415;&#35745;&#26102;&#22120;&#20174;&#24050;&#20572;&#27490;&#30340; GlassFish Server &#23454;&#20363;&#31227;&#26893;&#21040;&#38598;&#32676;&#20013;&#27491;&#22312;&#36816;&#34892;&#30340;&#23454;&#20363;&#30340;&#25353;&#38062;&#12290;&#21333;&#20987;&#27492;&#25353;&#38062;&#23558;&#25171;&#24320;&ldquo;<a href="ref-migrateejbtimers.html">&#31227;&#26893; EJB &#35745;&#26102;&#22120;</a>&rdquo;&#39029;&#12290;&#22914;&#26524;&#38598;&#32676;&#20013;&#30340;&#25152;&#26377;&#23454;&#20363;&#37117;&#22312;&#36816;&#34892;&#65292;&#21017;&#20250;&#21462;&#28040;&#28608;&#27963;&#27492;&#25353;&#38062;&#12290;</p>
</dd>
<dt>&#28378;&#21160;&#26085;&#24535;</dt>
<dd>
<p>&#29992;&#20110;&#28378;&#21160;&#38598;&#32676;&#30340;&#26085;&#24535;&#25991;&#20214;&#30340;&#25353;&#38062;&#12290;&#28378;&#21160;&#26085;&#24535;&#25991;&#20214;&#26102;&#65292;&#20250;&#20197; <code>server.log_</code><i>date-and-time</i> &#26684;&#24335;&#29992;&#26102;&#38388;&#25139;&#21517;&#31216;&#37325;&#21629;&#21517;&#35813;&#25991;&#20214;&#65292;&#24182;&#20026;&#26032;&#30340;&#26085;&#24535;&#28040;&#24687;&#21019;&#24314;&#19968;&#20010;&#31354;&#30340;&#26085;&#24535;&#25991;&#20214;&#12290;&#26356;&#25913;&#20250;&#21160;&#24577;&#24212;&#29992;&#12290;&#22240;&#27492;&#65292;&#26080;&#38656;&#37325;&#26032;&#21551;&#21160;&#26381;&#21153;&#22120;&#12290;</p>
</dd>
<dt>&#38598;&#32676;&#21517;&#31216;</dt>
<dd>
<p>&#21019;&#24314;&#38598;&#32676;&#26102;&#20026;&#20854;&#25351;&#23450;&#30340;&#21517;&#31216;&#12290;&#27492;&#23383;&#27573;&#20026;&#21482;&#35835;&#12290;</p>
</dd>
<dt>JVM</dt>
<dd>
<p>&#22914;&#26524;&#21333;&#20987;&ldquo;JVM &#25253;&#21578;&rdquo;&#65292;&#21017;&#20250;&#25171;&#24320;&#19968;&#20010;&#21333;&#29420;&#30340;&#31383;&#21475;&#65292;&#27492;&#31383;&#21475;&#26174;&#31034;&#26377;&#20851; Java &#34394;&#25311;&#26426;&#30340;&#25253;&#21578;&#65292;&#21253;&#25324;&#27010;&#35201;&#25253;&#21578;&#12289;&#20869;&#23384;&#31649;&#29702;&#21644;&#22403;&#22334;&#25910;&#38598;&#25253;&#21578;&#12289;&#31867;&#21152;&#36733;&#25253;&#21578;&#21644;&#24403;&#21069;&#32447;&#31243;&#36716;&#20648;&#12290;</p>
</dd>
<dt>&#37197;&#32622;</dt>
<dd>
<p>&#21019;&#24314;&#38598;&#32676;&#26102;&#20026;&#20854;&#36873;&#25321;&#30340;&#37197;&#32622;&#12290;&#21333;&#20987;&#37197;&#32622;&#23558;&#25171;&#24320;&#38598;&#32676;&#30340;<a href="../../../common/en/help/ref-configuration.html">&#37197;&#32622;</a>&#39029;&#12290;&#27492;&#23383;&#27573;&#20026;&#21482;&#35835;&#12290;</p>
</dd>
<dt>GMS</dt>
<dd>
<p>&#22914;&#26524;&#21551;&#29992;&#27492;&#36873;&#39033;&#65292;&#23558;&#22312;&#38598;&#32676;&#20197;&#21450;&#22495;&#31649;&#29702;&#26381;&#21153;&#22120; (DAS) &#30340;&#27599;&#20010; GlassFish Server &#23454;&#20363;&#20013;&#21551;&#21160;&#32452;&#31649;&#29702;&#26381;&#21153; (GMS)&#12290;DAS &#20250;&#21442;&#19982;&#24050;&#20026;&#20854;&#21551;&#29992;&#20102; GMS &#30340;&#27599;&#20010;&#38598;&#32676;&#12290;GMS &#25552;&#20379;&#38598;&#32676;&#30417;&#35270;&#26381;&#21153;&#12289;&#38598;&#32676;&#25104;&#21592;&#26381;&#21153;&#21644;&#32452;&#36890;&#20449;&#26381;&#21153;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#21551;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#22810;&#28857;&#20256;&#36865;&#31471;&#21475;</dt>
<dd>
<p>GMS &#22312;&#20854;&#19978;&#30417;&#21548;&#32452;&#20107;&#20214;&#30340;&#36890;&#20449;&#31471;&#21475;&#30340;&#31471;&#21475;&#21495;&#12290;&#27492;&#36873;&#39033;&#24517;&#39035;&#25351;&#23450;&#19968;&#20010;&#22312; 2048-49151 &#33539;&#22260;&#20869;&#30340;&#26377;&#25928;&#31471;&#21475;&#21495;&#12290;&#40664;&#35748;&#20540;&#26159;&#22312;&#27492;&#33539;&#22260;&#20869;&#33258;&#21160;&#29983;&#25104;&#30340;&#19968;&#20010;&#20540;&#12290;</p>
</dd>
<dt>&#22810;&#28857;&#20256;&#36865;&#22320;&#22336;</dt>
<dd>
<p>GMS &#30417;&#21548;&#32452;&#20107;&#20214;&#30340;&#22320;&#22336;&#12290;&#27492;&#36873;&#39033;&#24517;&#39035;&#25351;&#23450; 224.0.0.0 &#21040; 239.255.255.255 &#33539;&#22260;&#20869;&#30340;&#22810;&#28857;&#20256;&#36865;&#22320;&#22336;&#12290;&#40664;&#35748;&#20540;&#20026; 228.9.<i>XX</i>.<i>YY</i>&#65292;&#20854;&#20013; <i>XX</i> &#21644; <i>YY</i> &#26159;&#33258;&#21160;&#29983;&#25104;&#30340; 0 &#21040; 255 &#20043;&#38388;&#30340;&#29420;&#31435;&#20540;&#12290;</p>
</dd>
<dt>&#32465;&#23450;&#25509;&#21475;&#22320;&#22336;</dt>
<dd>
<p>GMS &#32465;&#23450;&#21040;&#30340;&#32593;&#32476;&#25509;&#21475;&#30340; Internet &#21327;&#35758; (IP) &#22320;&#22336;&#12290;&#27492;&#36873;&#39033;&#24517;&#39035;&#25351;&#23450;&#26412;&#22320;&#32593;&#32476;&#25509;&#21475;&#30340; IP &#22320;&#22336;&#12290;&#40664;&#35748;&#20540;&#26159;&#25152;&#26377;&#20844;&#20849;&#32593;&#32476;&#25509;&#21475;&#22320;&#22336;&#12290;</p>
<p>&#22312;&#22810;&#23487;&#20027;&#35745;&#31639;&#26426;&#19978;&#65292;&#27492;&#36873;&#39033;&#37197;&#32622;&#29992;&#20110; GMS &#30340;&#32593;&#32476;&#25509;&#21475;&#12290;&#22810;&#23487;&#20027;&#35745;&#31639;&#26426;&#21487;&#22788;&#29702;&#20004;&#20010;&#25110;&#22810;&#20010;&#32593;&#32476;&#25509;&#21475;&#12290;</p>
<p>&#35201;&#25351;&#23450;&#19968;&#20010;&#23545;&#38598;&#32676;&#20013;&#25152;&#26377; GlassFish Server &#23454;&#20363;&#37117;&#26377;&#25928;&#30340;&#22320;&#22336;&#65292;&#35831;&#20351;&#29992;&#31995;&#32479;&#23646;&#24615;&#20026;&#27599;&#20010;&#23454;&#20363;&#20998;&#21035;&#35774;&#32622;&#22320;&#22336;&#12290;</p>
<p>&#20363;&#22914;&#65292;&#20351;&#29992;&ldquo;<a href="ref-clustersystemproperties.html">&#38598;&#32676;&#31995;&#32479;&#23646;&#24615;</a>&rdquo;&#39029;&#21019;&#24314;&#31995;&#32479;&#23646;&#24615; GMS-BIND-INTERFACE-ADDRESS- <i>cluster-name</i>&#12290;&#28982;&#21518;&#65292;&#23558;&#27492;&#39029;&#20013;&#30340;&ldquo;&#32465;&#23450;&#22320;&#22336;&rdquo;&#36873;&#39033;&#35774;&#32622;&#20026; <code>${GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i><code>}</code> &#20197;&#25351;&#23450;&#35813;&#31995;&#32479;&#23646;&#24615;&#12290;&#26368;&#21518;&#65292;&#23545;&#20110;&#38598;&#32676;&#20013;&#30340;&#27599;&#20010;&#23454;&#20363;&#65292;&#23558; <code>GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i> &#31995;&#32479;&#23646;&#24615;&#35774;&#32622;&#20026;&#23454;&#20363;&#35745;&#31639;&#26426;&#19978;&#25152;&#38656;&#30340;&#32593;&#32476;&#25509;&#21475;&#22320;&#22336;&#12290;</p>
</dd>
<dt>&#29366;&#24577;</dt>
<dd>
<p>&#26631;&#26126;&#38598;&#32676;&#20013;&#36816;&#34892;&#20197;&#21450;&#26410;&#36816;&#34892;&#30340;&#23454;&#20363;&#25968;&#37327;&#12290;&#27492;&#23383;&#27573;&#20026;&#21482;&#35835;&#12290;</p>
</dd>
</dl>
<a id="sthref255" name="sthref255"></a>
<h5>&#30456;&#20851;&#20219;&#21153;</h5>
<ul>
<li>
<p><a href="task-gmscluster.html">&#20026;&#38598;&#32676;&#37197;&#32622;&#32452;&#31649;&#29702;&#26381;&#21153;&#35774;&#32622;</a></p>
</li>
<li>
<p><a href="task-migrate-ejb-timers.html">&#31227;&#26893; EJB &#35745;&#26102;&#22120;</a></p>
</li>
</ul>
<a id="sthref256" name="sthref256"></a>
<h5>&#31561;&#25928;&#30340; asadmin &#23376;&#21629;&#20196;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00138"><code>generate-jvm-report</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00211"><code>migrate-timers</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00224"><code>rotate-log</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
