<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-create-cluster" name="task-create-cluster"></a></p>

<h4><a id="sthref2" name="sthref2"></a>&#21019;&#24314;&#38598;&#32676;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#38598;&#32676;&#26159;&#21629;&#21517;&#30340; GlassFish Server &#23454;&#20363;&#38598;&#21512;&#65292;&#36825;&#20123;&#23454;&#20363;&#20849;&#20139;&#30456;&#21516;&#30340;&#24212;&#29992;&#31243;&#24207;&#12289;&#36164;&#28304;&#21644;&#37197;&#32622;&#20449;&#24687;&#12290;</p>
<p>&#38598;&#32676;&#21487;&#36890;&#36807;&#21487;&#20280;&#32553;&#24615;&#12289;&#36127;&#36733;&#24179;&#34913;&#21644;&#25925;&#38556;&#38450;&#25252;&#26469;&#25552;&#20379;&#39640;&#21487;&#29992;&#24615;&#12290;&#24403;&#38598;&#32676;&#20013;&#30340;&#23454;&#20363;&#25110;&#20027;&#26426;&#20986;&#29616;&#25925;&#38556;&#26102;&#65292;GlassFish Server &#26816;&#27979;&#21040;&#35813;&#25925;&#38556;&#65292;&#23558;&#35831;&#27714;&#20174;&#20986;&#29616;&#25925;&#38556;&#30340;&#23454;&#20363;&#37325;&#23450;&#21521;&#33267;&#38598;&#32676;&#20013;&#30340;&#20854;&#20182;&#23454;&#20363;&#65292;&#24182;&#24674;&#22797;&#29992;&#25143;&#20250;&#35805;&#29366;&#24577;&#12290;&#30001;&#20110;&#38598;&#32676;&#20013;&#25152;&#26377;&#23454;&#20363;&#19978;&#30340;&#24212;&#29992;&#31243;&#24207;&#21644;&#36164;&#28304;&#37117;&#30456;&#21516;&#65292;&#22240;&#27492;&#19968;&#20010;&#23454;&#20363;&#21487;&#20197;&#25925;&#38556;&#36716;&#31227;&#33267;&#38598;&#32676;&#20013;&#30340;&#20219;&#20309;&#20854;&#20182;&#23454;&#20363;&#12290;</p>
<p>&#36890;&#36807; GlassFish Server&#65292;&#21487;&#20197;&#23558;&#38598;&#32676;&#20013;&#30340;&#25152;&#26377;&#23454;&#20363;&#20316;&#20026;&#21333;&#20010;&#21333;&#20803;&#30001;&#21333;&#20010;&#20027;&#26426;&#26469;&#36827;&#34892;&#31649;&#29702;&#65292;&#26080;&#35770;&#36825;&#20123;&#23454;&#20363;&#26159;&#39547;&#30041;&#22312;&#21516;&#19968;&#20027;&#26426;&#36824;&#26159;&#19981;&#21516;&#20027;&#26426;&#19978;&#12290;</p>
<a id="sthref3" name="sthref3"></a>
<h5>&#24320;&#22987;&#20043;&#21069;</h5>
<p>&#22914;&#26524;&#35745;&#21010;&#21521;&#35201;&#21019;&#24314;&#30340;&#38598;&#32676;&#20013;&#28155;&#21152; GlassFish Server &#23454;&#20363;&#65292;&#35831;&#30830;&#20445;&#23454;&#20363;&#35201;&#39547;&#30041;&#30340;&#33410;&#28857;&#24050;&#32463;&#23384;&#22312;&#12290;</p>
<ol>
<li>
<p>&#22312;&#23548;&#33322;&#26641;&#20013;&#65292;&#36873;&#25321;&ldquo;&#38598;&#32676;&rdquo;&#33410;&#28857;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#38598;&#32676;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#38598;&#32676;&rdquo;&#39029;&#20013;&#65292;&#21333;&#20987;&ldquo;&#26032;&#24314;&rdquo;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#26032;&#24314;&#38598;&#32676;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#38598;&#32676;&#21517;&#31216;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#38598;&#32676;&#30340;&#21517;&#31216;&#12290;</p>
<p>&#21517;&#31216;&#24517;&#39035;&#28385;&#36275;&#20197;&#19979;&#35201;&#27714;&#65306;</p>
<ul>
<li>
<p>&#21517;&#31216;&#20013;&#21482;&#33021;&#21253;&#21547; ASCII &#23383;&#31526;&#12290;</p>
</li>
<li>
<p>&#21517;&#31216;&#24320;&#22836;&#24517;&#39035;&#26159;&#23383;&#27597;&#12289;&#25968;&#23383;&#25110;&#19979;&#21010;&#32447;&#12290;</p>
</li>
<li>
<p>&#21517;&#31216;&#21482;&#33021;&#21253;&#21547;&#20197;&#19979;&#23383;&#31526;&#65306;</p>
<ul>
<li>
<p>&#23567;&#20889;&#23383;&#27597;</p>
</li>
<li>
<p>&#22823;&#20889;&#23383;&#27597;</p>
</li>
<li>
<p>&#25968;&#23383;</p>
</li>
<li>
<p>&#36830;&#23383;&#31526;</p>
</li>
<li>
<p>&#21477;&#28857;</p>
</li>
<li>
<p>&#19979;&#21010;&#32447;</p>
</li>
</ul>
</li>
<li>
<p>&#21517;&#31216;&#22312;&#22495;&#20013;&#24517;&#39035;&#26159;&#21807;&#19968;&#30340;&#65292;&#32780;&#19988;&#19981;&#24471;&#26159;&#21478;&#19968;&#20010;&#38598;&#32676;&#12289;&#21629;&#21517;&#37197;&#32622;&#12289;GlassFish Server &#23454;&#20363;&#25110;&#33410;&#28857;&#30340;&#21517;&#31216;&#12290;</p>
</li>
<li>
<p>&#21517;&#31216;&#19981;&#24471;&#26159; <code>domain</code>&#12289;<code>server</code> &#25110; GlassFish Server &#20445;&#30041;&#30340;&#20219;&#20309;&#20854;&#20182;&#20851;&#38190;&#23383;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#20174;&ldquo;&#37197;&#32622;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&#38598;&#32676;&#23558;&#20351;&#29992;&#30340;&#21629;&#21517;&#37197;&#32622;&#12290;</p>

<hr>
<p><b>&#27880;:</b></p>
&#22914;&#26524;&#36873;&#25321; <code>default-config</code>&#65292;&#21017;&#24517;&#39035;&#22312;&#19979;&#19968;&#27493;&#20013;&#25351;&#23450;<i>&#19981;</i>&#20849;&#20139;&#37197;&#32622;&#12290;&#19981;&#33021;&#20849;&#20139; <code>default-config</code> &#37197;&#32622;&#12290;
<hr>

</li>
<li>
<p>&#25351;&#23450;&#26159;&#21542;&#20849;&#20139;&#38598;&#32676;&#23558;&#20351;&#29992;&#30340;&#37197;&#32622;&#12290;</p>
<ul>
<li>
<p>&#22914;&#26524;&#19981;&#20849;&#20139;&#37197;&#32622;&#65292;&#35831;&#20445;&#30041;&ldquo;&#22797;&#21046;&#25152;&#36873;&#37197;&#32622;&rdquo;&#36873;&#39033;&#30340;&#36873;&#20013;&#29366;&#24577;&#12290;</p>
<p>&#21019;&#24314;&#38598;&#32676;&#26102;&#65292;&#23558;&#22797;&#21046;&#25152;&#36873;&#37197;&#32622;&#12290;&#20250;&#20026;&#35813;&#37197;&#32622;&#30340;&#21103;&#26412;&#25351;&#23450;&#19968;&#20010;&#21517;&#31216; cluster-name<code>-config</code>&#65292;&#20854;&#20013; <i>cluster-name</i> &#26159;&#35201;&#21019;&#24314;&#30340;&#38598;&#32676;&#30340;&#21517;&#31216;&#12290;</p>
</li>
<li>
<p>&#22914;&#26524;&#20849;&#20139;&#37197;&#32622;&#65292;&#35831;&#36873;&#25321;&ldquo;&#24341;&#29992;&#25152;&#36873;&#37197;&#32622;&rdquo;&#36873;&#39033;&#12290;</p>
<p>&#38598;&#32676;&#23558;&#20351;&#29992;&#25351;&#23450;&#30340;&#29616;&#26377;&#21629;&#21517;&#37197;&#32622;&#12290;</p>
</li>
</ul>
</li>
<li>
<p><a id="sthref4" name="sthref4"></a>&#23558; GlassFish Server &#23454;&#20363;&#28155;&#21152;&#21040;&#38598;&#32676;&#12290;</p>

<hr>
<p><b>&#27880;:</b></p>
&#35201;&#22312;&#34920;&#31034;&#36828;&#31243;&#20027;&#26426;&#30340;&#31867;&#22411;&#20026;&ldquo;&#37197;&#32622;&rdquo;&#30340;&#33410;&#28857;&#19978;&#21019;&#24314;&#23454;&#20363;&#65292;&#24517;&#39035;&#20351;&#29992; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00044"><code>create-local-instance</code>(1)</a> &#23376;&#21629;&#20196;&#12290;&#19981;&#33021;&#20351;&#29992;&#31649;&#29702;&#25511;&#21046;&#21488;&#26469;&#23454;&#29616;&#27492;&#30446;&#30340;&#12290;
<hr>

<p>&#20063;&#21487;&#20197;&#22312;&#21019;&#24314;&#38598;&#32676;&#21518;&#28155;&#21152;&#23454;&#20363;&#65292;&#22914;<a href="task-create-clustered-instance.html">&#23558; GlassFish Server &#23454;&#20363;&#28155;&#21152;&#21040;&#38598;&#32676;</a>&#20013;&#25152;&#36848;&#12290;</p>
<p>&#25353;&#22914;&#19979;&#25152;&#31034;&#28155;&#21152;&#27599;&#20010;&#23454;&#20363;&#65306;</p>
<ol type="a">
<li>
<p>&#22312;&ldquo;&#35201;&#21019;&#24314;&#30340;&#26381;&#21153;&#22120;&#23454;&#20363;&rdquo;&#21306;&#22495;&#65292;&#21333;&#20987;&ldquo;&#28155;&#21152;&rdquo;&#12290;</p>
<p>&#23558;&#22312;&#38598;&#32676;&#20013;&#30340;&#23454;&#20363;&#34920;&#20013;&#28155;&#21152;&#19968;&#34892;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#23454;&#20363;&#21517;&#31216;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#23454;&#20363;&#30340;&#21517;&#31216;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26435;&#37325;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#34920;&#31034;&#23454;&#20363;&#30340;&#36127;&#36733;&#24179;&#34913;&#26435;&#37325;&#30340;&#25972;&#25968;&#12290;</p>
<p>&#36127;&#36733;&#24179;&#34913;&#26435;&#37325;&#30830;&#23450;&#22312;&#23545;&#38598;&#32676;&#30340;&#25152;&#26377;&#35831;&#27714;&#20013;&#65292;&#23454;&#20363;&#24212;&#22788;&#29702;&#30340;&#35831;&#27714;&#25152;&#21344;&#30340;&#27604;&#20363;&#12290;</p>
<p>&#20363;&#22914;&#65292;&#22312;&#19968;&#20010;&#20855;&#26377;&#20004;&#20010;&#23454;&#20363;&#30340;&#38598;&#32676;&#20013;&#65292;&#24744;&#21487;&#33021;&#38656;&#35201;&#19968;&#20010;&#23454;&#20363;&#26469;&#22788;&#29702;&#22235;&#20998;&#20043;&#19968;&#30340;&#35831;&#27714;&#65292;&#21478;&#19968;&#23454;&#20363;&#22788;&#29702;&#22235;&#20998;&#20043;&#19977;&#30340;&#35831;&#27714;&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#23558;&#22788;&#29702;&#22235;&#20998;&#20043;&#19968;&#35831;&#27714;&#30340;&#23454;&#20363;&#30340;&#26435;&#37325;&#35774;&#32622;&#20026; 1&#65292;&#23558;&#21478;&#19968;&#23454;&#20363;&#30340;&#26435;&#37325;&#35774;&#32622;&#20026; 3&#12290;&#22914;&#26524;&#24744;&#21916;&#27426;&#20351;&#29992;&#30334;&#20998;&#27604;&#65292;&#21017;&#20998;&#21035;&#23558;&#23454;&#20363;&#26435;&#37325;&#35774;&#32622;&#20026; 25 &#21644; 75&#12290;</p>
<p>&#40664;&#35748;&#26435;&#37325;&#20026; 100&#12290;</p>
</li>
<li>
<p>&#20174;&ldquo;&#33410;&#28857;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&#23454;&#20363;&#23558;&#39547;&#30041;&#30340;&#33410;&#28857;&#12290;</p>
</li>
</ol>
</li>
<li>
<p>&#21333;&#20987;&ldquo;&#30830;&#23450;&rdquo;&#12290;</p>
<p>&#23558;&#36820;&#22238;&#21040;&ldquo;&#38598;&#32676;&rdquo;&#39029;&#12290;&#35813;&#38598;&#32676;&#23558;&#28155;&#21152;&#21040;&#39029;&#20013;&#30340;&#38598;&#32676;&#34920;&#12290;</p>
</li>
</ol>
<a id="sthref5" name="sthref5"></a>
<h5>&#21478;&#35831;&#21442;&#38405;</h5>
<ul>
<li>
<p><a href="task-delete-cluster.html">&#21024;&#38500;&#38598;&#32676;</a></p>
</li>
<li>
<p><a href="task-availabilityservice.html">&#20026;&#38598;&#32676;&#37197;&#32622;&#21487;&#29992;&#24615;&#35774;&#32622;</a></p>
</li>
<li>
<p><a href="task-start-cluster.html">&#21551;&#21160;&#38598;&#32676;</a></p>
</li>
<li>
<p><a href="task-stop-cluster.html">&#20572;&#27490;&#38598;&#32676;</a></p>
</li>
<li>
<p><a href="task-modify-cluster-config.html">&#20462;&#25913;&#38598;&#32676;&#37197;&#32622;</a></p>
</li>
<li>
<p><a href="task-cluster-app-deploy.html">&#23558;&#24212;&#29992;&#31243;&#24207;&#37096;&#32626;&#21040;&#38598;&#32676;</a></p>
</li>
<li>
<p><a href="task-cluster-app-list.html">&#21015;&#20986;&#24050;&#37096;&#32626;&#21040;&#38598;&#32676;&#30340;&#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-cluster-app-undeploy.html">&#20174;&#38598;&#32676;&#20013;&#21462;&#28040;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-cluster-app-remove.html">&#20174;&#38598;&#32676;&#20013;&#21024;&#38500;&#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-cluster-app-edit.html">&#32534;&#36753;&#24050;&#37096;&#32626;&#21040;&#38598;&#32676;&#30340;&#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-cluster-app-enable-disable.html">&#21551;&#29992;&#25110;&#31105;&#29992;&#24050;&#37096;&#32626;&#21040;&#38598;&#32676;&#30340;&#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-cluster-app-lb-enable-disable.html">&#20026;&#24050;&#37096;&#32626;&#21040;&#38598;&#32676;&#30340;&#24212;&#29992;&#31243;&#24207;&#21551;&#29992;&#25110;&#31105;&#29992;&#36127;&#36733;&#24179;&#34913;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-create.html">&#20026;&#38598;&#32676;&#21019;&#24314;&#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-display.html">&#21015;&#20986;&#38598;&#32676;&#30340;&#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-enable-disable.html">&#20840;&#23616;&#21551;&#29992;&#25110;&#31105;&#29992;&#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-edit.html">&#32534;&#36753;&#38598;&#32676;&#30340;&#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-upgrade-components.html">&#22312;&#19981;&#25439;&#22833;&#26381;&#21153;&#30340;&#24773;&#20917;&#19979;&#21319;&#32423;&#32452;&#20214;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
