<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-upgrade-components" name="task-upgrade-components"></a></p>

<h4><a id="sthref62" name="sthref62"></a><a id="sthref63" name="sthref63"></a><a id="sthref64" name="sthref64"></a><a id="sthref65" name="sthref65"></a>&#22312;&#19981;&#25439;&#22833;&#26381;&#21153;&#30340;&#24773;&#20917;&#19979;&#21319;&#32423;&#32452;&#20214;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#22312;&#38598;&#32676;&#29615;&#22659;&#20013;&#65292;&#28378;&#21160;&#21319;&#32423;&#33021;&#22815;&#20197;&#26381;&#21153;&#21644;&#20250;&#35805;&#25439;&#22833;&#26368;&#23569;&#30340;&#26041;&#24335;&#37325;&#26032;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#12290;&#20250;&#35805;&#26159;&#21487;&#22797;&#21046;&#30340;&#20219;&#20309; Artifact&#65292;&#20363;&#22914;&#65306;</p>
<ul>
<li>
<p><code>HttpSession</code></p>
</li>
<li>
<p><code>SingleSignOn</code></p>
</li>
<li>
<p><code>ServletTimer</code></p>
</li>
<li>
<p><code>DialogFragment</code></p>
</li>
<li>
<p>&#26377;&#29366;&#24577;&#20250;&#35805; Bean</p>
</li>
</ul>
<p>&#21487;&#20197;&#20351;&#29992;&#36127;&#36733;&#24179;&#34913;&#22120;&#21644;&#22810;&#20010;&#38598;&#32676;&#26469;&#21319;&#32423; GlassFish Server &#20013;&#30340;&#32452;&#20214;&#65292;&#32780;&#19981;&#25439;&#22833;&#20219;&#20309;&#26381;&#21153;&#12290;&#20363;&#22914;&#65292;&#32452;&#20214;&#21487;&#20197;&#26159; JVM &#35745;&#31639;&#26426;&#12289;GlassFish Server &#36719;&#20214;&#25110; Web &#24212;&#29992;&#31243;&#24207;&#12290;</p>
<p>&#28378;&#21160;&#21319;&#32423;&#21487;&#22312;&#36731;&#24230;&#21040;&#20013;&#24230;&#36127;&#36733;&#19979;&#36827;&#34892;&#12290;&#23545;&#20110;&#27599;&#20010; GlassFish Server &#23454;&#20363;&#65292;&#35813;&#36807;&#31243;&#38656;&#35201;&#22823;&#32422; 10-15 &#20998;&#38047;&#12290;</p>
<p>&#21319;&#32423;&#36807;&#31243;&#20013;&#65292;&#24212;&#29992;&#31243;&#24207;&#24517;&#39035;&#20860;&#23481;&#12290;&#22312;&#26576;&#20123;&#23454;&#20363;&#36816;&#34892;&#26087;&#29256;&#26412;&#32780;&#20854;&#20182;&#23454;&#20363;&#36816;&#34892;&#26032;&#29256;&#26412;&#30340;&#36807;&#28193;&#26399;&#38388;&#65292;&#24212;&#29992;&#31243;&#24207;&#24517;&#39035;&#33021;&#22815;&#27491;&#24120;&#24037;&#20316;&#12290;&#26087;&#29256;&#26412;&#21644;&#26032;&#29256;&#26412;&#24517;&#39035;&#20855;&#26377;&#30456;&#21516;&#24418;&#29366;&#30340;&#21487;&#24207;&#21015;&#21270;&#31867;&#65292;&#29992;&#20110;&#24418;&#25104;&#23384;&#20648;&#20110;&#20250;&#35805;&#20013;&#30340;&#23545;&#35937;&#22270;&#65292;&#20363;&#22914;&#38750;&#30636;&#24577;&#23454;&#20363;&#21464;&#37327;&#12290;&#22914;&#26524;&#36825;&#20123;&#31867;&#30340;&#24418;&#29366;&#24517;&#39035;&#21457;&#29983;&#21464;&#21270;&#65292;&#24212;&#29992;&#31243;&#24207;&#24320;&#21457;&#20154;&#21592;&#24517;&#39035;&#30830;&#20445;&#25152;&#36827;&#34892;&#30340;&#24207;&#21015;&#21270;&#34892;&#20026;&#26159;&#27491;&#30830;&#30340;&#12290;&#22914;&#26524;&#21319;&#32423;&#36807;&#31243;&#20013;&#24212;&#29992;&#31243;&#24207;&#19981;&#20860;&#23481;&#65292;&#24517;&#39035;&#20572;&#27490;&#38598;&#32676;&#20197;&#36827;&#34892;&#23436;&#20840;&#37325;&#26032;&#37096;&#32626;&#12290;</p>
<p>&#22914;&#26524;&#24212;&#29992;&#31243;&#24207;&#21319;&#32423;&#21253;&#21547;&#23545;&#24212;&#29992;&#31243;&#24207;&#25968;&#25454;&#24211;&#26041;&#26696;&#30340;&#26356;&#25913;&#65292;&#21017;&#36825;&#31181;&#26041;&#27861;&#19981;&#21487;&#33021;&#23454;&#29616;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
&#20026;&#38450;&#33539;&#20250;&#35805;&#25925;&#38556;&#36716;&#31227;&#26102;&#30340;&#29256;&#26412;&#19981;&#21305;&#37197;&#39118;&#38505;&#65292;&#35831;&#21516;&#26102;&#21319;&#32423;&#38598;&#32676;&#20013;&#30340;&#25152;&#26377;&#23454;&#20363;&#12290;&#21542;&#21017;&#65292;&#20250;&#35805;&#21487;&#33021;&#25925;&#38556;&#36716;&#31227;&#33267;&#36816;&#34892;&#19981;&#21516;&#29256;&#26412;&#32452;&#20214;&#30340;&#23454;&#20363;&#12290;<br />
<hr>

<p>&#35831;&#22312;&#27599;&#20010;&#38598;&#32676;&#19978;&#21333;&#29420;&#25191;&#34892;&#27492;&#20219;&#21153;&#12290;&#23545;&#20110;&#38598;&#32676;&#20013;&#30340;&#23454;&#20363;&#65292;&#38598;&#32676;&#21487;&#20316;&#20026;&#20250;&#35805;&#25925;&#38556;&#36716;&#31227;&#30340;&#23433;&#20840;&#36793;&#30028;&#12290;&#19968;&#20010;&#38598;&#32676;&#20013;&#30340;&#20250;&#35805;&#27704;&#36828;&#37117;&#26080;&#27861;&#25925;&#38556;&#36716;&#31227;&#33267;&#21478;&#19968;&#20010;&#38598;&#32676;&#20013;&#30340;&#20250;&#35805;&#12290;&#22240;&#27492;&#65292;&#29256;&#26412;&#19981;&#21305;&#37197;&#30340;&#39118;&#38505;&#21487;&#24471;&#20197;&#36991;&#20813;&#12290;</p>
<ol>
<li>
<p>&#20572;&#27490;&#38598;&#32676;&#12290;</p>
<p>&#35831;&#21442;&#38405;<a href="task-stop-cluster.html">&#20572;&#27490;&#38598;&#32676;</a>&#12290;</p>
</li>
<li>
<p>&#21319;&#32423;&#35813;&#38598;&#32676;&#20013;&#30340;&#32452;&#20214;&#12290;</p>
</li>
<li>
<p>&#21551;&#21160;&#38598;&#32676;&#12290;</p>
<p>&#35831;&#21442;&#38405;<a href="task-start-cluster.html">&#21551;&#21160;&#38598;&#32676;</a>&#12290;</p>
</li>
</ol>
<a id="sthref66" name="sthref66"></a>
<h5>&#21478;&#35831;&#21442;&#38405;</h5>
<ul>
<li>
<p><a href="task-create-cluster.html">&#21019;&#24314;&#38598;&#32676;</a></p>
</li>
<li>
<p><a href="task-delete-cluster.html">&#21024;&#38500;&#38598;&#32676;</a></p>
</li>
<li>
<p><a href="task-availabilityservice.html">&#20026;&#38598;&#32676;&#37197;&#32622;&#21487;&#29992;&#24615;&#35774;&#32622;</a></p>
</li>
<li>
<p><a href="task-start-cluster.html">&#21551;&#21160;&#38598;&#32676;</a></p>
</li>
<li>
<p><a href="task-stop-cluster.html">&#20572;&#27490;&#38598;&#32676;</a></p>
</li>
<li>
<p><a href="task-modify-cluster-config.html">&#20462;&#25913;&#38598;&#32676;&#37197;&#32622;</a></p>
</li>
<li>
<p><a href="task-cluster-app-deploy.html">&#23558;&#24212;&#29992;&#31243;&#24207;&#37096;&#32626;&#21040;&#38598;&#32676;</a></p>
</li>
<li>
<p><a href="task-cluster-app-list.html">&#21015;&#20986;&#24050;&#37096;&#32626;&#21040;&#38598;&#32676;&#30340;&#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-cluster-app-undeploy.html">&#20174;&#38598;&#32676;&#20013;&#21462;&#28040;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-cluster-app-remove.html">&#20174;&#38598;&#32676;&#20013;&#21024;&#38500;&#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-cluster-app-edit.html">&#32534;&#36753;&#24050;&#37096;&#32626;&#21040;&#38598;&#32676;&#30340;&#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-cluster-app-enable-disable.html">&#21551;&#29992;&#25110;&#31105;&#29992;&#24050;&#37096;&#32626;&#21040;&#38598;&#32676;&#30340;&#24212;&#29992;&#31243;&#24207;</a></p>
</li>
<li>
<p><a href="task-cluster-app-lb-enable-disable.html">&#20026;&#24050;&#37096;&#32626;&#21040;&#38598;&#32676;&#30340;&#24212;&#29992;&#31243;&#24207;&#21551;&#29992;&#25110;&#31105;&#29992;&#36127;&#36733;&#24179;&#34913;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-create.html">&#20026;&#38598;&#32676;&#21019;&#24314;&#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-display.html">&#21015;&#20986;&#38598;&#32676;&#30340;&#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-enable-disable.html">&#20840;&#23616;&#21551;&#29992;&#25110;&#31105;&#29992;&#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-cluster-resource-edit.html">&#32534;&#36753;&#38598;&#32676;&#30340;&#36164;&#28304;</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
