<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-gmscluster" name="task-gmscluster"></a><a id="GHCLU00079" name="GHCLU00079"></a></p>

<h4><a id="sthref220" name="sthref220"></a>&#20026;&#38598;&#32676;&#37197;&#32622;&#32452;&#31649;&#29702;&#26381;&#21153;&#35774;&#32622;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#32452;&#31649;&#29702;&#26381;&#21153; (GMS) &#26159;&#19968;&#31181;&#36827;&#31243;&#20869;&#26381;&#21153;&#65292;&#21487;&#25552;&#20379;&#38598;&#32676;&#30417;&#35270;&#12289;&#38598;&#32676;&#25104;&#21592;&#21644;&#32452;&#36890;&#20449;&#26381;&#21153;&#12290;GMS &#25191;&#34892;&#20197;&#19979;&#21151;&#33021;&#65306;</p>
<ul>
<li>
<p>&#22312;&#38598;&#32676;&#20013;&#28155;&#21152;&#25110;&#21024;&#38500;&#19968;&#20010;&#25110;&#22810;&#20010;&#25104;&#21592;&#23454;&#20363;&#65292;&#25110;&#32773;&#24576;&#30097;&#25110;&#30830;&#35748;&#19968;&#20010;&#25110;&#22810;&#20010;&#25104;&#21592;&#23454;&#20363;&#24050;&#22833;&#36133;&#26102;&#65292;&#36890;&#30693; GlassFish Server &#23454;&#20363;&#20013;&#30340;&#24050;&#27880;&#20876;&#27169;&#22359;&#12290;</p>
</li>
<li>
<p>&#25552;&#20379;&#22312;&#38598;&#32676;&#25104;&#21592;&#20043;&#38388;&#21457;&#36865;&#21644;&#25509;&#25910;&#28040;&#24687;&#30340;&#21151;&#33021;&#12290;</p>
</li>
</ul>
<ol>
<li>
<p>&#22312;&#23548;&#33322;&#26641;&#20013;&#65292;&#23637;&#24320;&ldquo;&#38598;&#32676;&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#36873;&#25321;&#35201;&#20026;&#20854;&#37197;&#32622;&#32452;&#31649;&#29702;&#26381;&#21153; (GMS) &#35774;&#32622;&#30340;&#38598;&#32676;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&#38598;&#32676;&#30340;&ldquo;&#19968;&#33324;&#20449;&#24687;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#24050;&#21551;&#29992; GMS&rdquo;&#22797;&#36873;&#26694;&#20026;&#38598;&#32676;&#21551;&#29992; GMS&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#27492;&#36873;&#39033;&#24050;&#36873;&#20013;&#12290;&#35201;&#20026;&#38598;&#32676;&#31105;&#29992; GMS&#65292;&#21017;&#23558;&#22797;&#36873;&#26631;&#35760;&#20174;&ldquo;&#24050;&#21551;&#29992; GMS&rdquo;&#22797;&#36873;&#26694;&#20013;&#21024;&#38500;&#12290;</p>
<p>&#22914;&#26524;&#21551;&#29992;&#65292;&#21017;&#20250;&#22312;&#38598;&#32676;&#30340;&#27599;&#20010;&#26381;&#21153;&#22120;&#23454;&#20363;&#21644;&#22495;&#31649;&#29702;&#26381;&#21153;&#22120; (DAS) &#20013;&#21551;&#21160;&#32452;&#31649;&#29702;&#26381;&#21153;&#12290;DAS &#20250;&#21442;&#19982;&#21040;&#21551;&#29992; GMS &#30340;&#27599;&#20010;&#38598;&#32676;&#20013;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#22810;&#28857;&#20256;&#36865;&#31471;&#21475;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#32452;&#31649;&#29702;&#26381;&#21153;&#29992;&#20110;&#30417;&#21548;&#32452;&#20107;&#20214;&#30340;&#31471;&#21475;&#12290;</p>
<p>&#25351;&#23450; 2048-49151 &#33539;&#22260;&#20869;&#30340;&#26631;&#20934; UDP &#31471;&#21475;&#21495;&#12290;&#40664;&#35748;&#20540;&#26159;&#22312;&#27492;&#33539;&#22260;&#20869;&#33258;&#21160;&#29983;&#25104;&#30340;&#19968;&#20010;&#20540;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#22810;&#28857;&#20256;&#36865;&#22320;&#22336;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#32452;&#31649;&#29702;&#26381;&#21153;&#29992;&#20110;&#30417;&#21548;&#32452;&#20107;&#20214;&#30340;&#22320;&#22336;&#12290;</p>
<p>&#25351;&#23450; D &#31867; IP &#22810;&#28857;&#20256;&#36865;&#22320;&#22336;&#12290;D &#31867; IP &#22320;&#22336;&#22312; <code>224.0.0.0</code> &#21644; <code>239.255.255.255</code> &#30340;&#33539;&#22260;&#20869; (&#21253;&#25324;&#20004;&#32773;)&#12290;&#22320;&#22336; <code>224.0.0.0</code> &#34987;&#20445;&#30041;&#65292;&#19981;&#24212;&#20351;&#29992;&#12290;&#40664;&#35748;&#20540;&#20026; 228.9.<i>XX</i>.<i>YY</i>&#65292;&#20854;&#20013; <i>XX</i> &#21644; <i>YY</i> &#26159;&#33258;&#21160;&#29983;&#25104;&#30340; 0 &#21040; 255 &#20043;&#38388;&#30340;&#29420;&#31435;&#20540;&#12290;</p>
</li>
<li>
<p>&#22914;&#26524;&#26377;&#22810;&#20010;&#32593;&#32476;&#25509;&#21475;&#65292;&#22312;&ldquo;&#32465;&#23450;&#25509;&#21475;&#22320;&#22336;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#32452;&#31649;&#29702;&#26381;&#21153;&#30340;&#32593;&#32476;&#25509;&#21475;&#22320;&#22336;&#12290;</p>
<p>&#22914;&#26524;&#22312;&#25215;&#36733;&#38598;&#32676;&#20013;&#26381;&#21153;&#22120;&#23454;&#20363;&#30340;&#20219;&#20309;&#35745;&#31639;&#26426;&#19978;&#26377;&#22810;&#20010;&#32593;&#32476;&#25509;&#21475;&#65292;&#27492;&#35774;&#32622;&#20351;&#24744;&#33021;&#22815;&#37197;&#32622;&#29992;&#20110; GMS &#30340;&#32593;&#32476;&#25509;&#21475;&#12290;&#35813;&#20540;&#24517;&#39035;&#26159;&#26412;&#22320;&#32593;&#32476;&#25509;&#21475; IP &#22320;&#22336;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#20250;&#20351;&#29992;&#25152;&#26377;&#20844;&#20849;&#32593;&#32476;&#25509;&#21475;&#22320;&#22336;&#12290;</p>
<p>&#35201;&#25351;&#23450;&#19968;&#20010;&#23545;&#38598;&#32676;&#20013;&#25152;&#26377; GlassFish Server &#23454;&#20363;&#37117;&#26377;&#25928;&#30340;&#22320;&#22336;&#65292;&#35831;&#20351;&#29992;&#31995;&#32479;&#23646;&#24615;&#20026;&#27599;&#20010;&#23454;&#20363;&#20998;&#21035;&#35774;&#32622;&#22320;&#22336;&#12290;</p>
<p>&#20363;&#22914;&#65292;&#22312; DAS &#19978;&#21019;&#24314;&#31995;&#32479;&#23646;&#24615; <code>GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i>&#12290;&#28982;&#21518;&#23558;&#27492;&ldquo;&#32465;&#23450;&#25509;&#21475;&#22320;&#22336;&rdquo;&#36873;&#39033;&#35774;&#32622;&#20026; <code>${GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i><code>}</code> &#20197;&#25351;&#23450;&#35813;&#31995;&#32479;&#23646;&#24615;&#12290;&#26368;&#21518;&#65292;&#23545;&#20110;&#38598;&#32676;&#20013;&#30340;&#27599;&#20010;&#23454;&#20363;&#65292;&#23558; <code>GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i> &#31995;&#32479;&#23646;&#24615;&#35774;&#32622;&#20026;&#23454;&#20363;&#35745;&#31639;&#26426;&#19978;&#25152;&#38656;&#30340;&#32593;&#32476;&#25509;&#21475;&#22320;&#22336;&#12290;</p>
</li>
<li>
<p>&#35201;&#25351;&#23450;&#20854;&#20182;&#23646;&#24615;&#65292;&#35831;&#36873;&#25321;&ldquo;&#23646;&#24615;&rdquo;&#36873;&#39033;&#21345;&#21644;&ldquo;&#38598;&#32676;&#23646;&#24615;&rdquo;&#23376;&#36873;&#39033;&#21345;&#12290;</p>
<ul>
<li>
<p>&#35201;&#28155;&#21152;&#23646;&#24615;&#65292;&#35831;&#21333;&#20987;&ldquo;&#28155;&#21152;&#23646;&#24615;&rdquo;&#25353;&#38062;&#12290;&#22312;&#26174;&#31034;&#30340;&#31354;&#30333;&#34892;&#20013;&#65292;&#22312;&ldquo;&#21517;&#31216;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#23646;&#24615;&#21517;&#31216;&#65292;&#22312;&ldquo;&#20540;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#23646;&#24615;&#20540;&#12290;</p>
</li>
<li>
<p>&#35201;&#20462;&#25913;&#23646;&#24615;&#65292;&#35831;&#32534;&#36753;&#35813;&#23646;&#24615;&#30340;&ldquo;&#20540;&rdquo;&#23383;&#27573;&#12290;</p>
</li>
<li>
<p>&#35201;&#21024;&#38500;&#23646;&#24615;&#65292;&#35831;&#36873;&#20013;&#20301;&#20110;&#24744;&#35201;&#21024;&#38500;&#23646;&#24615;&#30340;&ldquo;&#21517;&#31216;&rdquo;&#23383;&#27573;&#24038;&#36793;&#30340;&#22797;&#36873;&#26694;&#65292;&#28982;&#21518;&#21333;&#20987;&ldquo;&#21024;&#38500;&#23646;&#24615;&rdquo;&#25353;&#38062;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#21333;&#20987;&ldquo;&#20445;&#23384;&rdquo;&#12290;</p>
</li>
</ol>
<a id="sthref221" name="sthref221"></a>
<h5>&#21478;&#35831;&#21442;&#38405;</h5>
<ul>
<li>
<p><a href="task-gmsenable.html">&#21551;&#29992;&#32452;&#31649;&#29702;&#26381;&#21153;</a></p>
</li>
<li>
<p><a href="task-gms.html">&#37197;&#32622;&#32452;&#31649;&#29702;&#26381;&#21153;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
