<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-connectorconnectionpooladvance" name="ref-connectorconnectionpooladvance"></a></p>

<h4><a id="sthref75" name="sthref75"></a>&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#36914;&#38542;&#23660;&#24615;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&#12300;&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#36914;&#38542;&#23660;&#24615;&#12301;&#38913;&#38754;&#21487;&#20462;&#25913;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#30340;&#36914;&#38542;&#35373;&#23450;&#12290;</p>
<p>&#12300;&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#36914;&#38542;&#23660;&#24615;&#12301;&#38913;&#38754;&#21253;&#21547;&#19979;&#21015;&#36984;&#38917;&#12290;</p>
<dl>
<dt>&#36617;&#20837;&#38928;&#35373;&#20540;</dt>
<dd>
<p>&#29992;&#26044;&#23559;&#20855;&#26377;&#38928;&#35373;&#20540;&#30340;&#35373;&#23450;&#24489;&#21407;&#28858;&#35373;&#23450;&#20540;&#30340;&#25353;&#37397;&#12290;&#27794;&#26377;&#38928;&#35373;&#20540;&#30340;&#35373;&#23450;&#21063;&#20445;&#25345;&#19981;&#35722;&#12290;</p>
</dd>
<dt>&#39511;&#35657;&#38291;&#38548;&#26368;&#20037;&#26178;&#38291;</dt>
<dd>
<p>&#25351;&#23450;&#36899;&#32396;&#35531;&#27714;&#39511;&#35657;&#36899;&#32218;&#30340;&#26368;&#38263;&#26178;&#38291;&#38291;&#38548; (&#20197;&#31186;&#28858;&#21934;&#20301;)&#12290;&#38928;&#35373;&#20540;&#28858; 0&#65292;&#34920;&#31034;&#26410;&#21855;&#29992;&#35442;&#23660;&#24615;&#12290;</p>
</dd>
<dt>&#37679;&#35492;&#36926;&#26178;</dt>
<dd>
<p>&#36861;&#36452;&#36899;&#32218;&#38598;&#21312;&#20013;&#36899;&#32218;&#27945;&#28431;&#30340;&#26178;&#38291; (&#20197;&#31186;&#28858;&#21934;&#20301;)&#12290;0 &#20540;&#34920;&#31034;&#24050;&#20572;&#29992;&#36899;&#32218;&#27945;&#28431;&#36861;&#36452;&#12290;&#38928;&#35373;&#20540;&#28858; 0&#12290;</p>
</dd>
<dt>&#37679;&#35492;&#25910;&#22238;</dt>
<dd>
<p>&#33509;&#36984;&#21462;&#20102;&#27492;&#36984;&#38917;&#65292;&#21063;&#22312;&#37679;&#35492;&#36899;&#32218;&#36861;&#36452;&#23436;&#25104;&#20043;&#24460;&#65292;&#26371;&#23559;&#37679;&#35492;&#30340;&#36899;&#32218;&#24489;&#21407;&#33267;&#36899;&#32218;&#38598;&#21312;&#20013;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</dd>
<dt>&#24314;&#31435;&#37325;&#35430;&#22039;&#35430;</dt>
<dd>
<p>&#22312;&#24314;&#31435;&#26032;&#36899;&#32218;&#22833;&#25943;&#20043;&#24460;&#65292;&#23559;&#36914;&#34892;&#30340;&#22039;&#35430;&#27425;&#25976;&#12290;0 &#20540;&#34920;&#31034;&#19981;&#26371;&#20877;&#27425;&#22039;&#35430;&#24314;&#31435;&#36899;&#32218;&#12290;&#38928;&#35373;&#20540;&#28858; 0&#12290;</p>
</dd>
<dt>&#37325;&#35430;&#38291;&#38548;</dt>
<dd>
<p>&#20841;&#27425;&#22039;&#35430;&#24314;&#31435;&#36899;&#32218;&#30340;&#26178;&#38291;&#38291;&#38548; (&#20197;&#31186;&#28858;&#21934;&#20301;)&#12290;&#20677;&#30070;&#12300;&#24314;&#31435;&#37325;&#26032;&#22039;&#35430;&#27425;&#25976;&#12301;&#30340;&#20540;&#22823;&#26044; 0 &#26178;&#65292;&#25165;&#20351;&#29992;&#35442;&#23660;&#24615;&#12290;&#38928;&#35373;&#20540;&#28858; 10 &#31186;&#12290;</p>
</dd>
<dt>&#38598;&#21312;&#31649;&#29702;</dt>
<dd>
<p>&#37341;&#23565;&#38598;&#21312;&#21855;&#29992;&#36899;&#32218;&#38598;&#21312;&#31649;&#29702;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#21855;&#29992;&#12290;</p>
</dd>
<dt>&#24816;&#24615;&#38364;&#32879;</dt>
<dd>
<p>&#33509;&#36984;&#21462;&#20102;&#27492;&#36984;&#38917;&#65292;&#30070;&#20316;&#26989;&#26044;&#36899;&#32218;&#19978;&#22519;&#34892;&#26178;&#65292;&#26371;&#28858;&#36899;&#32218;&#24314;&#31435;&#24816;&#24615;&#38364;&#32879;&#12290;&#30070;&#20316;&#26989;&#20107;&#20214;&#23436;&#25104;&#19988;&#20803;&#20214;&#26041;&#27861;&#32080;&#26463;&#26178;&#65292;&#36889;&#20123;&#36899;&#32218;&#20415;&#26371;&#21462;&#28040;&#38364;&#32879;&#65292;&#24478;&#32780;&#21487;&#20197;&#37325;&#35079;&#20351;&#29992;&#23526;&#39636;&#36899;&#32218;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</dd>
<dt>&#24816;&#24615;&#36899;&#32218;&#30331;&#35352;</dt>
<dd>
<p>&#33509;&#36984;&#21462;&#20102;&#27492;&#36984;&#38917;&#65292;&#20677;&#30070;&#36039;&#28304;&#22312;&#26041;&#27861;&#20013;&#23526;&#38555;&#20351;&#29992;&#26178;&#65292;&#25165;&#26371;&#23559;&#35442;&#36039;&#28304;&#30331;&#35352;&#33267;&#20316;&#26989;&#20107;&#20214;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</dd>
<dt>&#33287;&#32363;&#32218;&#24314;&#31435;&#38364;&#32879;</dt>
<dd>
<p>&#33509;&#36984;&#21462;&#20102;&#27492;&#36984;&#38917;&#65292;&#26371;&#23559;&#36899;&#32218;&#33287;&#32363;&#32218;&#24314;&#31435;&#38364;&#32879;&#12290;&#30070;&#30456;&#21516;&#30340;&#32363;&#32218;&#38656;&#35201;&#36899;&#32218;&#26178;&#65292;&#20415;&#21487;&#20197;&#37325;&#35079;&#20351;&#29992;&#24050;&#33287;&#35442;&#32363;&#32218;&#24314;&#31435;&#38364;&#32879;&#30340;&#36899;&#32218;&#65292;&#32780;&#30465;&#19979;&#24478;&#38598;&#21312;&#20013;&#21462;&#24471;&#36899;&#32218;&#30340;&#32147;&#24120;&#24615;&#32791;&#29992;&#26178;&#38291;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</dd>
<dt>&#27604;&#23565;&#36899;&#32218;</dt>
<dd>
<p>&#33509;&#36984;&#21462;&#20102;&#27492;&#36984;&#38917;&#65292;&#26371;&#21855;&#29992;&#38598;&#21312;&#30340;&#36899;&#32218;&#27604;&#23565;&#12290;&#24744;&#21487;&#20197;&#22312;&#20197;&#19979;&#24773;&#27841;&#19979;&#20572;&#29992;&#27492;&#36984;&#38917;&#65306;&#24744;&#30693;&#36947;&#38598;&#21312;&#20013;&#30340;&#36899;&#32218;&#19968;&#23450;&#26159;&#21516;&#36074;&#36899;&#32218;&#65292;&#22240;&#27492;&#19981;&#38656;&#35201;&#36039;&#28304;&#36681;&#25509;&#22120;&#23565;&#24478;&#38598;&#21312;&#20013;&#25361;&#36984;&#30340;&#36899;&#32218;&#36914;&#34892;&#27604;&#23565;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#21855;&#29992;&#12290;</p>
</dd>
<dt>&#27604;&#23565;&#36899;&#32218;&#20351;&#29992;&#29575;</dt>
<dd>
<p>&#36899;&#32218;&#38598;&#21312;&#25033;&#37325;&#35079;&#20351;&#29992;&#36899;&#32218;&#30340;&#27425;&#25976;&#12290;&#37325;&#35079;&#20351;&#29992;&#25351;&#23450;&#27425;&#25976;&#30340;&#36899;&#32218;&#24460;&#65292;&#23601;&#26371;&#38364;&#38281;&#36899;&#32218;&#12290;0 &#20540;&#34920;&#31034;&#27794;&#26377;&#21855;&#29992;&#27492;&#23660;&#24615;&#12290;&#38928;&#35373;&#20540;&#28858; 0&#12290;</p>
</dd>
</dl>
<a id="sthref76" name="sthref76"></a>
<h5>&#30456;&#38364;&#20316;&#26989;</h5>
<ul>
<li>
<p><a href="task-connectorconnectionpoolnew.html">&#24314;&#31435;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#36914;&#38542;&#23660;&#24615;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#29305;&#24615;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">&#24314;&#31435;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#30340;&#23433;&#20840;&#24615;&#23565;&#25033;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#30340;&#23433;&#20840;&#24615;&#23565;&#25033;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">&#21034;&#38500;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#30340;&#23433;&#20840;&#24615;&#23565;&#25033;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">&#21034;&#38500;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;</a></p>
</li>
</ul>
<a id="sthref77" name="sthref77"></a>
<h5>&#30456;&#38364;&#30340; asadmin &#21629;&#20196;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00018"><code>create-connector-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00157"><code>list-connector-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00070"><code>delete-connector-connection-pool</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
