<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-connectorconnectionpoolnew2" name="ref-connectorconnectionpoolnew2"></a></p>

<h4><a id="sthref72" name="sthref72"></a>&#26032;&#24314;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312; (&#27493;&#39519; 2&#65292;&#20849; 2 &#27493;)</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&#12300;&#26032;&#24314;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312; (&#27493;&#39519; 2&#65292;&#20849; 2 &#27493;)&#12301;&#38913;&#38754;&#21487;&#24314;&#31435;&#26032;&#30340;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#12290;</p>
<p>&#12300;&#26032;&#24314;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312; (&#27493;&#39519; 2&#65292;&#20849; 2 &#27493;)&#12301;&#38913;&#38754;&#21253;&#21547;&#19979;&#21015;&#36984;&#38917;&#12290;</p>
<dl>
<dt>Ping</dt>
<dd>
<p>&#33509;&#21855;&#29992;&#20102;&#27492;&#36984;&#38917;&#65292;&#23559;&#26371;&#22312;&#24314;&#31435;&#25110;&#37325;&#26032;&#32068;&#24907;&#26399;&#38291; Ping &#36899;&#32218;&#38598;&#21312;&#65292;&#20197;&#35672;&#21029;&#20006;&#35686;&#21578;&#20219;&#20309;&#37679;&#35492;&#30340;&#23660;&#24615;&#20540;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</dd>
<dt>&#25551;&#36848;</dt>
<dd>
<p>&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#30340;&#25551;&#36848;&#12290;</p>
</dd>
<dt>&#38598;&#21312;&#30340;&#21021;&#22987;&#22823;&#23567;&#21644;&#26368;&#23567;&#22823;&#23567;</dt>
<dd>
<p>&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#20013;&#30340;&#26368;&#23567;&#36899;&#32218;&#25976;&#30446;&#12290;&#38928;&#35373;&#20540;&#28858; 8&#12290;</p>
</dd>
<dt>&#38598;&#21312;&#30340;&#26368;&#22823;&#22823;&#23567;</dt>
<dd>
<p>&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#20013;&#30340;&#26368;&#22823;&#36899;&#32218;&#25976;&#30446;&#12290;&#38928;&#35373;&#20540;&#28858; 32&#12290;</p>
</dd>
<dt>&#38598;&#21312;&#35373;&#23450;&#22823;&#23567;&#25976;&#37327;</dt>
<dd>
<p>&#38598;&#21312;&#30340;&#38290;&#32622;&#36926;&#26178;&#36942;&#26399;&#26178;&#35201;&#31227;&#38500;&#30340;&#36899;&#32218;&#25976;&#30446;&#12290;&#38928;&#35373;&#20540;&#28858; 2&#12290;</p>
</dd>
<dt>&#38290;&#32622;&#36926;&#26178;</dt>
<dd>
<p>&#36899;&#32218;&#21487;&#20197;&#22312;&#20786;&#23384;&#21312;&#20013;&#38290;&#32622;&#30340;&#26368;&#38263;&#26178;&#38291; (&#20197;&#31186;&#34920;&#31034;)&#12290;&#38928;&#35373;&#20540;&#28858; 300&#12290;</p>
</dd>
<dt>&#26368;&#22823;&#31561;&#24453;&#26178;&#38291;</dt>
<dd>
<p>&#35531;&#27714;&#36899;&#32218;&#30340;&#25033;&#29992;&#31243;&#24335;&#22312;&#36948;&#21040;&#36899;&#32218;&#36926;&#26178;&#20043;&#21069;&#31561;&#24453;&#30340;&#26178;&#38291;&#12290;&#38928;&#35373;&#20540;&#28858; 60000&#12290;</p>
</dd>
<dt>&#36899;&#32218;&#39511;&#35657;</dt>
<dd>
<p>&#33509;&#36984;&#21462;&#20102;&#12300;&#38656;&#35201;&#36899;&#32218;&#39511;&#35657;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#25351;&#23450;&#36899;&#32218;&#32102;&#25033;&#29992;&#31243;&#24335;&#20043;&#21069;&#26371;&#20808;&#39511;&#35657;&#12290;&#33509;&#36039;&#28304;&#30340;&#39511;&#35657;&#22833;&#25943;&#65292;&#21063;&#26371;&#37559;&#27584;&#35442;&#36039;&#28304;&#65292;&#28982;&#24460;&#24314;&#31435;&#20006;&#20659;&#22238;&#26032;&#30340;&#36039;&#28304;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</dd>
<dt>&#19968;&#26086;&#22833;&#25943;</dt>
<dd>
<p>&#22914;&#26524;&#36984;&#21462;&#20102;&#12300;&#38364;&#38281;&#25152;&#26377;&#36899;&#32218;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;GlassFish Server &#23559;&#26371;&#22312;&#20219;&#20309;&#19968;&#20491;&#36899;&#32218;&#22833;&#25943;&#26178;&#65292;&#38364;&#38281;&#38598;&#21312;&#20013;&#30340;&#25152;&#26377;&#36899;&#32218;&#20006;&#37325;&#26032;&#24314;&#31435;&#36899;&#32218;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</dd>
<dt>&#20316;&#26989;&#20107;&#20214;&#25903;&#25588;</dt>
<dd>
<p>&#36984;&#25799;&#30340;&#20316;&#26989;&#20107;&#20214;&#25903;&#25588;&#20197;&#21521;&#19979;&#30456;&#23481;&#26041;&#24335;&#32622;&#25563;&#33287;&#27492;&#36899;&#32218;&#38598;&#21312;&#38364;&#32879;&#30340;&#36039;&#28304;&#20171;&#38754;&#20013;&#30340;&#20316;&#26989;&#20107;&#20214;&#25903;&#25588;&#23660;&#24615;&#12290;&#20063;&#23601;&#26159;&#35498;&#65292;&#23427;&#21487;&#20197;&#25903;&#25588;&#27604;&#36039;&#28304;&#36681;&#25509;&#22120;&#20013;&#25351;&#23450;&#30340;&#20316;&#26989;&#20107;&#20214;&#23652;&#32026;&#20302;&#25110;&#33287;&#20854;&#30456;&#21516;&#30340;&#20316;&#26989;&#20107;&#20214;&#23652;&#32026;&#65292;&#20294;&#23427;&#19981;&#33021;&#25351;&#23450;&#26356;&#39640;&#30340;&#23652;&#32026;&#12290;</p>
<p>&#20540;&#21487;&#33021;&#28858;&#19979;&#21015;&#20854;&#20013;&#20043;&#19968;&#65306;</p>
<dl>
<dt>XATransaction</dt>
<dd>
<p>&#36039;&#28304;&#36681;&#25509;&#22120;&#26371;&#36879;&#36942;&#23526;&#34892; LocalTransaction &#21644; XAResource &#20171;&#38754;&#20358;&#25903;&#25588;&#36039;&#28304;&#31649;&#29702;&#21729;&#30340;&#26412;&#27231;&#21644; JTA &#20316;&#26989;&#20107;&#20214;&#12290;XA &#20316;&#26989;&#20107;&#20214;&#30001;&#20316;&#26989;&#20107;&#20214;&#31649;&#29702;&#21729;&#22312;&#36039;&#28304;&#31649;&#29702;&#21729;&#22806;&#37096;&#36914;&#34892;&#25511;&#21046;&#21644;&#21332;&#35519;&#12290;</p>
</dd>
<dt>LocalTransaction</dt>
<dd>
<p>&#36039;&#28304;&#36681;&#25509;&#22120;&#26371;&#36879;&#36942;&#23526;&#34892; LocalTransaction &#20171;&#38754;&#20358;&#25903;&#25588;&#26412;&#27231;&#20316;&#26989;&#20107;&#20214;&#12290;&#26412;&#27231;&#20316;&#26989;&#20107;&#20214;&#30340;&#31649;&#29702;&#22312;&#36039;&#28304;&#31649;&#29702;&#21729;&#20839;&#37096;&#36914;&#34892;&#65292;&#19981;&#28041;&#21450;&#20219;&#20309;&#22806;&#37096;&#20316;&#26989;&#20107;&#20214;&#31649;&#29702;&#21729;&#12290;</p>
</dd>
<dt>NoTransaction</dt>
<dd>
<p>&#36039;&#28304;&#36681;&#25509;&#22120;&#19981;&#25903;&#25588;&#36039;&#28304;&#31649;&#29702;&#21729;&#30340;&#26412;&#27231;&#25110; JTA &#20316;&#26989;&#20107;&#20214;&#65292;&#19988;&#19981;&#26371;&#23526;&#34892; XAResource &#25110; LocalTransaction &#20171;&#38754;&#12290;</p>
</dd>
</dl>
</dd>
<dt>&#20854;&#20182;&#29305;&#24615;</dt>
<dd>
<p>&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#30340;&#20854;&#20182;&#29305;&#24615;&#12290;&#21487;&#29992;&#30340;&#29305;&#24615;&#26371;&#35222;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#30340;&#36039;&#28304;&#36681;&#25509;&#22120;&#32780;&#23450;&#12290;&#27492;&#34920;&#20013;&#25351;&#23450;&#30340;&#21517;/&#20540;&#37197;&#23565;&#65292;&#21487;&#29992;&#26044;&#32622;&#25563;&#36039;&#28304;&#36681;&#25509;&#22120;&#20379;&#25033;&#21830;&#23450;&#32681;&#30340;&#29305;&#24615;&#38928;&#35373;&#20540;&#12290;</p>
<p>&#33509;&#24744;&#28858;&#29305;&#24615;&#25351;&#23450;&#20102;&#21517;&#31281;&#20294;&#27794;&#26377;&#25351;&#23450;&#20540;&#65292;&#36899;&#32218;&#38598;&#21312;&#24314;&#31435;&#23436;&#25104;&#26178;&#65292;&#26371;&#24478;&#34920;&#20013;&#31227;&#38500;&#35442;&#29305;&#24615;&#12290;&#33509;&#24744;&#19981;&#24819;&#31435;&#21363;&#28858;&#29305;&#24615;&#35373;&#23450;&#20540;&#65292;&#20294;&#24076;&#26395;&#23559;&#35442;&#29305;&#24615;&#20445;&#30041;&#22312;&#34920;&#20013;&#65292;&#24453;&#31245;&#24460;&#28858;&#20854;&#35373;&#23450;&#20540;&#65292;&#35531;&#22312;&#12300;&#20540;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#19968;&#32068;&#31354;&#30340;&#22291;&#25324;&#34399;&#65306;</p>
<pre>
()
</pre></dd>
</dl>
<a id="sthref73" name="sthref73"></a>
<h5>&#30456;&#38364;&#20316;&#26989;</h5>
<ul>
<li>
<p><a href="task-connectorconnectionpoolnew.html">&#24314;&#31435;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#36914;&#38542;&#23660;&#24615;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#29305;&#24615;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">&#24314;&#31435;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#30340;&#23433;&#20840;&#24615;&#23565;&#25033;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#30340;&#23433;&#20840;&#24615;&#23565;&#25033;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">&#21034;&#38500;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#30340;&#23433;&#20840;&#24615;&#23565;&#25033;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">&#21034;&#38500;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;</a></p>
</li>
</ul>
<a id="sthref74" name="sthref74"></a>
<h5>&#30456;&#38364;&#30340; asadmin &#21629;&#20196;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00018"><code>create-connector-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00157"><code>list-connector-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00070"><code>delete-connector-connection-pool</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
