<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-connectorconnectionpoolproperty" name="task-connectorconnectionpoolproperty"></a><a id="GHJCA00066" name="GHJCA00066"></a></p>

<h4><a id="sthref16" name="sthref16"></a><a id="sthref17" name="sthref17"></a>&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#29305;&#24615;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#28687;&#35261;&#27193;&#29376;&#32080;&#27083;&#20013;&#65292;&#23637;&#38283;&#12300;&#36039;&#28304;&#12301;&#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#23637;&#38283;&#12300;&#36899;&#32218;&#22120;&#12301;&#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#36899;&#32218;&#22120;&#12301;&#31680;&#40670;&#19979;&#65292;&#36984;&#21462;&#12300;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#12301;&#31680;&#40670;&#12290;</p>
<p>&#12300;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#12301;&#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#12301;&#38913;&#38754;&#19978;&#65292;&#25353;&#19968;&#19979;&#35201;&#32232;&#36655;&#30340;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#21517;&#31281;&#12290;</p>
<p>&#12300;&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#12301;&#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#12301;&#38913;&#38754;&#19978;&#65292;&#25353;&#19968;&#19979;&#12300;&#20854;&#20182;&#29305;&#24615;&#12301;&#27161;&#31844;&#12290;</p>
<p>&#12300;&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#29305;&#24615;&#12301;&#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#20854;&#20182;&#29305;&#24615;&#12301;&#34920;&#20013;&#65292;&#25351;&#23450;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#30340;&#20854;&#20182;&#29305;&#24615;&#12290;</p>
<p>&#25351;&#23450;&#30340;&#29305;&#24615;&#21462;&#27770;&#26044;&#35442;&#38598;&#21312;&#20351;&#29992;&#30340;&#36039;&#28304;&#20171;&#38754;&#12290;&#30001;&#20351;&#29992;&#27492;&#34920;&#30340;&#20351;&#29992;&#32773;&#25152;&#25351;&#23450;&#30340;&#21517;/&#20540;&#37197;&#23565;&#65292;&#21487;&#29992;&#26044;&#32622;&#25563;&#36039;&#28304;&#36681;&#25509;&#22120;&#20379;&#25033;&#21830;&#23450;&#32681;&#30340;&#29305;&#24615;&#38928;&#35373;&#20540;&#12290;</p>
<p>&#33509;&#24744;&#26410;&#37341;&#23565;&#29305;&#24615;&#25351;&#23450;&#20540;&#65292;&#36899;&#32218;&#38598;&#21312;&#32232;&#36655;&#23436;&#25104;&#26178;&#65292;&#26371;&#24478;&#34920;&#20013;&#31227;&#38500;&#35442;&#29305;&#24615;&#12290;&#33509;&#24744;&#19981;&#24819;&#31435;&#21363;&#28858;&#29305;&#24615;&#35373;&#23450;&#20540;&#65292;&#20294;&#24076;&#26395;&#23559;&#35442;&#29305;&#24615;&#20445;&#30041;&#22312;&#34920;&#20013;&#65292;&#24453;&#31245;&#24460;&#28858;&#20854;&#35373;&#23450;&#20540;&#65292;&#35531;&#22312;&#12300;&#20540;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#19968;&#32068;&#31354;&#30340;&#22291;&#25324;&#34399;&#65306;</p>
<pre>
()
</pre>
<ul>
<li>
<p>&#33509;&#35201;&#22686;&#21152;&#29305;&#24615;&#65292;&#35531;&#25353;&#19968;&#19979;&#12300;&#22686;&#21152;&#29305;&#24615;&#12301;&#25353;&#37397;&#12290;&#22312;&#20986;&#29694;&#30340;&#31354;&#30333;&#21015;&#20013;&#65292;&#26044;&#12300;&#21517;&#31281;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#21517;&#31281;&#65292;&#28982;&#24460;&#22312;&#12300;&#20540;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#20540;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#20462;&#25913;&#29305;&#24615;&#65292;&#35531;&#32232;&#36655;&#29305;&#24615;&#30340;&#12300;&#20540;&#12301;&#27396;&#20301;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#21034;&#38500;&#29305;&#24615;&#65292;&#35531;&#36984;&#21462;&#24744;&#35201;&#21034;&#38500;&#20043;&#29305;&#24615;&#12300;&#21517;&#31281;&#12301;&#27396;&#20301;&#24038;&#20596;&#30340;&#26680;&#21462;&#26041;&#22602;&#65292;&#28982;&#24460;&#25353;&#19968;&#19979;&#12300;&#21034;&#38500;&#29305;&#24615;&#12301;&#25353;&#37397;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#25353;&#19968;&#19979;&#12300;&#20786;&#23384;&#12301;&#12290;</p>
</li>
</ol>
<a id="sthref18" name="sthref18"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-connectorresourcenew.html">&#24314;&#31435;&#36899;&#32218;&#22120;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-connectorresourceedit.html">&#32232;&#36655;&#36899;&#32218;&#22120;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-connectorresourcesdelete.html">&#21034;&#38500;&#36899;&#32218;&#22120;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolnew.html">&#24314;&#31435;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#36914;&#38542;&#23660;&#24615;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">&#24314;&#31435;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#30340;&#23433;&#20840;&#24615;&#23565;&#25033;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#30340;&#23433;&#20840;&#24615;&#23565;&#25033;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">&#21034;&#38500;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#30340;&#23433;&#20840;&#24615;&#23565;&#25033;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">&#21034;&#38500;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;</a></p>
</li>
<li>
<p><a href="task-setupeisaccess.html">&#35373;&#23450; EIS &#23384;&#21462;</a></p>
</li>
<li>
<p><a href="task-adminobjectnew.html">&#24314;&#31435;&#31649;&#29702;&#29289;&#20214;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-adminobjectedit.html">&#32232;&#36655;&#31649;&#29702;&#29289;&#20214;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-administeredobjectresourcedelete.html">&#21034;&#38500;&#31649;&#29702;&#29289;&#20214;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-worksecuritymapnew.html">&#24314;&#31435;&#24037;&#20316;&#23433;&#20840;&#24615;&#23565;&#25033;</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">&#32232;&#36655;&#24037;&#20316;&#23433;&#20840;&#24615;&#23565;&#25033;</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">&#21034;&#38500;&#24037;&#20316;&#23433;&#20840;&#24615;&#23565;&#25033;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
