<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-connectorconnectionpooledit" name="task-connectorconnectionpooledit"></a></p>

<h4><a id="sthref12" name="sthref12"></a>&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#28687;&#35261;&#27193;&#29376;&#32080;&#27083;&#20013;&#65292;&#23637;&#38283;&#12300;&#36039;&#28304;&#12301;&#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#23637;&#38283;&#12300;&#36899;&#32218;&#22120;&#12301;&#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#36899;&#32218;&#22120;&#12301;&#31680;&#40670;&#19979;&#65292;&#36984;&#21462;&#12300;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#12301;&#31680;&#40670;&#12290;</p>
<p>&#12300;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#12301;&#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#12301;&#38913;&#38754;&#19978;&#65292;&#25353;&#19968;&#19979;&#35201;&#32232;&#36655;&#30340;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#21517;&#31281;&#12290;</p>
<p>&#12300;&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#12301;&#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#24478;&#12300;&#36039;&#28304;&#36681;&#25509;&#22120;&#12301;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#19981;&#21516;&#30340;&#36039;&#28304;&#36681;&#25509;&#22120;&#12290;</p>
</li>
<li>
<p>&#24478;&#12300;&#36899;&#32218;&#23450;&#32681;&#12301;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#36899;&#32218;&#23450;&#32681;&#30340;&#39006;&#21029;&#21517;&#31281;&#12290;</p>
<p>&#28165;&#21934;&#20013;&#25552;&#20379;&#30340;&#36984;&#38917;&#26371;&#35222;&#24744;&#25152;&#36984;&#21462;&#30340;&#36039;&#28304;&#36681;&#25509;&#22120;&#32780;&#23450;&#12290;&#36899;&#32218;&#23450;&#32681;&#26371;&#35672;&#21029;&#36039;&#28304;&#36681;&#25509;&#22120;&#22312; <code>ra.xml</code> &#27284;&#26696;&#20013;&#30340; <code>connection-definition</code> &#20803;&#32032;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#21855;&#29992; Ping&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#21487;&#22312;&#36899;&#32218;&#38598;&#21312;&#24314;&#31435;&#25110;&#37325;&#26032;&#32068;&#24907;&#26399;&#38291; Ping &#36899;&#32218;&#38598;&#21312;&#65292;&#20197;&#35672;&#21029;&#20006;&#35686;&#21578;&#20219;&#20309;&#37679;&#35492;&#30340;&#23660;&#24615;&#20540;&#12290;</p>
<p>&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#24314;&#32622;&#38918;&#24207;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#25976;&#23383;&#20358;&#25351;&#23450;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#30340;&#24314;&#32622;&#38918;&#24207;&#12290;</p>
<p>&#31995;&#32113;&#26371;&#22312;&#20282;&#26381;&#22120;&#21855;&#21205;&#26178;&#20808;&#36617;&#20837;&#25976;&#23383;&#36611;&#23567;&#30340;&#36039;&#28304;&#12290;&#38928;&#35373;&#20540;&#28858; 100&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#25551;&#36848;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#30340;&#25551;&#36848;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#38598;&#21312;&#30340;&#21021;&#22987;&#22823;&#23567;&#21644;&#26368;&#23567;&#22823;&#23567;&#12301;&#27396;&#20301;&#20013;&#65292;&#25351;&#23450;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#20013;&#30340;&#26368;&#23567;&#36899;&#32218;&#25976;&#30446;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 8&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#38598;&#21312;&#30340;&#26368;&#22823;&#22823;&#23567;&#12301;&#27396;&#20301;&#20013;&#65292;&#25351;&#23450;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#20013;&#30340;&#26368;&#22823;&#36899;&#32218;&#25976;&#30446;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 32&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#38598;&#21312;&#35373;&#23450;&#22823;&#23567;&#25976;&#37327;&#12301;&#27396;&#20301;&#20013;&#65292;&#25351;&#23450;&#38598;&#21312;&#30340;&#38290;&#32622;&#36926;&#26178;&#36942;&#26399;&#26178;&#35201;&#31227;&#38500;&#30340;&#36899;&#32218;&#25976;&#30446;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 2&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#38290;&#32622;&#36926;&#26178;&#12301;&#27396;&#20301;&#20013;&#65292;&#25351;&#23450;&#36899;&#32218;&#21487;&#20197;&#22312;&#38598;&#21312;&#20013;&#38290;&#32622;&#30340;&#26368;&#38263;&#26178;&#38291; (&#20197;&#31186;&#28858;&#21934;&#20301;)&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 300&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#26368;&#22823;&#31561;&#24453;&#26178;&#38291;&#12301;&#27396;&#20301;&#20013;&#65292;&#25351;&#23450;&#35531;&#27714;&#36899;&#32218;&#30340;&#25033;&#29992;&#31243;&#24335;&#22312;&#36899;&#32218;&#36926;&#26178;&#21069;&#31561;&#24453;&#30340;&#26178;&#38291;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 60000&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#38656;&#35201;&#36899;&#32218;&#39511;&#35657;&#12301;&#26680;&#21462;&#26041;&#22602;&#20197;&#21855;&#29992;&#36899;&#32218;&#39511;&#35657;&#12290;</p>
<p>&#33509;&#36984;&#21462;&#20102;&#12300;&#38656;&#35201;&#36899;&#32218;&#39511;&#35657;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#25351;&#23450;&#36899;&#32218;&#32102;&#25033;&#29992;&#31243;&#24335;&#20043;&#21069;&#26371;&#20808;&#39511;&#35657;&#12290;&#33509;&#36039;&#28304;&#30340;&#39511;&#35657;&#22833;&#25943;&#65292;&#21063;&#26371;&#37559;&#27584;&#35442;&#36039;&#28304;&#65292;&#28982;&#24460;&#24314;&#31435;&#20006;&#20659;&#22238;&#26032;&#30340;&#36039;&#28304;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#19968;&#26086;&#22833;&#25943;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#21487;&#35731; GlassFish Server &#22312;&#20219;&#20309;&#19968;&#20491;&#36899;&#32218;&#22833;&#25943;&#26178;&#65292;&#38364;&#38281;&#38598;&#21312;&#20013;&#30340;&#25152;&#26377;&#36899;&#32218;&#20006;&#37325;&#26032;&#24314;&#31435;&#36899;&#32218;&#12290;</p>
<p>&#22914;&#26524;&#26410;&#36984;&#21462;&#27492;&#26680;&#21462;&#26041;&#22602;&#65292;&#21063;&#20677;&#22312;&#20351;&#29992;&#20491;&#21029;&#36899;&#32218;&#26178;&#25165;&#26371;&#37325;&#26032;&#24314;&#31435;&#36889;&#20123;&#36899;&#32218;&#12290;</p>
</li>
<li>
<p>&#24478;&#12300;&#20316;&#26989;&#20107;&#20214;&#25903;&#25588;&#12301;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#28858;&#36899;&#32218;&#38598;&#21312;&#36984;&#21462;&#20316;&#26989;&#20107;&#20214;&#25903;&#25588;&#39006;&#22411;&#12290;</p>
<p>&#36984;&#25799;&#30340;&#20316;&#26989;&#20107;&#20214;&#25903;&#25588;&#20197;&#21521;&#19979;&#30456;&#23481;&#26041;&#24335;&#32622;&#25563;&#33287;&#27492;&#36899;&#32218;&#38598;&#21312;&#38364;&#32879;&#30340;&#36039;&#28304;&#20171;&#38754;&#20013;&#30340;&#20316;&#26989;&#20107;&#20214;&#25903;&#25588;&#23660;&#24615;&#12290;&#20063;&#23601;&#26159;&#35498;&#65292;&#23427;&#21487;&#20197;&#25903;&#25588;&#27604;&#36039;&#28304;&#36681;&#25509;&#22120;&#20013;&#25351;&#23450;&#30340;&#20316;&#26989;&#20107;&#20214;&#23652;&#32026;&#20302;&#25110;&#33287;&#20854;&#30456;&#21516;&#30340;&#20316;&#26989;&#20107;&#20214;&#23652;&#32026;&#65292;&#20294;&#23427;&#19981;&#33021;&#25351;&#23450;&#26356;&#39640;&#30340;&#23652;&#32026;&#12290;</p>
<p>&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#21487;&#29992;&#30340;&#36984;&#38917;&#22914;&#19979;&#65306;</p>
<ul>
<li>
<p>NoTransaction&#65306;&#34920;&#31034;&#36039;&#28304;&#36681;&#25509;&#22120;&#19981;&#25903;&#25588;&#36039;&#28304;&#31649;&#29702;&#21729;&#30340;&#26412;&#27231;&#25110; JTA &#20316;&#26989;&#20107;&#20214;&#65292;&#19988;&#19981;&#26371;&#23526;&#34892; XAResource &#25110; LocalTransaction &#20171;&#38754;&#12290;</p>
</li>
<li>
<p>LocalTransaction&#65306;&#34920;&#31034;&#36039;&#28304;&#36681;&#25509;&#22120;&#26371;&#36879;&#36942;&#23526;&#34892; LocalTransaction &#20171;&#38754;&#20358;&#25903;&#25588;&#26412;&#27231;&#20316;&#26989;&#20107;&#20214;&#12290;</p>
<p>&#26412;&#27231;&#20316;&#26989;&#20107;&#20214;&#30340;&#31649;&#29702;&#22312;&#36039;&#28304;&#31649;&#29702;&#21729;&#20839;&#37096;&#36914;&#34892;&#65292;&#19981;&#28041;&#21450;&#20219;&#20309;&#22806;&#37096;&#20316;&#26989;&#20107;&#20214;&#31649;&#29702;&#21729;&#12290;</p>
</li>
<li>
<p>XATransaction&#65306;&#34920;&#31034;&#36039;&#28304;&#36681;&#25509;&#22120;&#26371;&#36879;&#36942;&#23526;&#34892; LocalTransaction &#21644; XAResource &#20171;&#38754;&#20358;&#25903;&#25588;&#36039;&#28304;&#31649;&#29702;&#21729;&#30340;&#26412;&#27231;&#21644; JTA &#20316;&#26989;&#20107;&#20214;&#12290;</p>
<p>XA &#20316;&#26989;&#20107;&#20214;&#30001;&#20316;&#26989;&#20107;&#20214;&#31649;&#29702;&#21729;&#22312;&#36039;&#28304;&#31649;&#29702;&#21729;&#22806;&#37096;&#36914;&#34892;&#25511;&#21046;&#21644;&#21332;&#35519;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#25353;&#19968;&#19979;&#12300;&#28165;&#38500;&#12301;&#25353;&#37397;&#21487;&#24478;&#38598;&#21312;&#20013;&#28165;&#38500;&#25152;&#26377;&#36899;&#32218;&#12290;</p>
<p>&#25353;&#19968;&#19979;&#12300;&#28165;&#38500;&#12301;&#25353;&#37397;&#21487;&#37559;&#27584;&#20219;&#20309;&#29694;&#26377;&#30340;&#36899;&#32218;&#12289;&#37325;&#26032;&#24314;&#31435;&#24050;&#37341;&#23565;&#36899;&#32218;&#38598;&#21312;&#24314;&#31435;&#30340;&#36899;&#32218;&#65292;&#20006;&#23559;&#38598;&#21312;&#24489;&#21407;&#28858;&#20854;&#21021;&#22987;&#33287;&#26368;&#23567;&#30340;&#38598;&#21312;&#22823;&#23567;&#12290;</p>
</li>
<li>
<p>&#25353;&#19968;&#19979;&#12300;Ping&#12301;&#25353;&#37397;&#21487;&#39511;&#35657;&#36899;&#32218;&#38598;&#21312;&#26159;&#21542;&#21487;&#20197;&#20351;&#29992;&#12290;</p>
</li>
<li>
<p>&#25353;&#19968;&#19979;&#12300;&#20786;&#23384;&#12301;&#12290;</p>

<hr>
<p><b>&#25552;&#31034;:</b></p>
&#33509;&#35201;&#22238;&#21040;&#38928;&#35373;&#35373;&#23450;&#65292;&#35531;&#25353;&#19968;&#19979;&#12300;&#36617;&#20837;&#38928;&#35373;&#20540;&#12301;&#25353;&#37397;&#65292;&#28982;&#24460;&#25353;&#19968;&#19979;&#12300;&#20786;&#23384;&#12301;&#12290;<br />
<hr>

</li>
</ol>
<a id="sthref13" name="sthref13"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-connectorresourcenew.html">&#24314;&#31435;&#36899;&#32218;&#22120;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-connectorresourceedit.html">&#32232;&#36655;&#36899;&#32218;&#22120;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-connectorresourcesdelete.html">&#21034;&#38500;&#36899;&#32218;&#22120;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolnew.html">&#24314;&#31435;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#36914;&#38542;&#23660;&#24615;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#29305;&#24615;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">&#24314;&#31435;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#30340;&#23433;&#20840;&#24615;&#23565;&#25033;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#30340;&#23433;&#20840;&#24615;&#23565;&#25033;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">&#21034;&#38500;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#30340;&#23433;&#20840;&#24615;&#23565;&#25033;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">&#21034;&#38500;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;</a></p>
</li>
<li>
<p><a href="task-setupeisaccess.html">&#35373;&#23450; EIS &#23384;&#21462;</a></p>
</li>
<li>
<p><a href="task-adminobjectnew.html">&#24314;&#31435;&#31649;&#29702;&#29289;&#20214;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-adminobjectedit.html">&#32232;&#36655;&#31649;&#29702;&#29289;&#20214;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-administeredobjectresourcedelete.html">&#21034;&#38500;&#31649;&#29702;&#29289;&#20214;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-worksecuritymapnew.html">&#24314;&#31435;&#24037;&#20316;&#23433;&#20840;&#24615;&#23565;&#25033;</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">&#32232;&#36655;&#24037;&#20316;&#23433;&#20840;&#24615;&#23565;&#25033;</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">&#21034;&#38500;&#24037;&#20316;&#23433;&#20840;&#24615;&#23565;&#25033;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
