<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-connectorconnectionpooladvance" name="task-connectorconnectionpooladvance"></a><a id="GHJCA00065" name="GHJCA00065"></a></p>

<h4><a id="sthref14" name="sthref14"></a>&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#36914;&#38542;&#23660;&#24615;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#28687;&#35261;&#27193;&#29376;&#32080;&#27083;&#20013;&#65292;&#23637;&#38283;&#12300;&#36039;&#28304;&#12301;&#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#23637;&#38283;&#12300;&#36899;&#32218;&#22120;&#12301;&#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#36899;&#32218;&#22120;&#12301;&#31680;&#40670;&#19979;&#65292;&#36984;&#21462;&#12300;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#12301;&#31680;&#40670;&#12290;</p>
<p>&#12300;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#12301;&#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#12301;&#38913;&#38754;&#19978;&#65292;&#25353;&#19968;&#19979;&#35201;&#32232;&#36655;&#30340;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#21517;&#31281;&#12290;</p>
<p>&#12300;&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#12301;&#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#12301;&#38913;&#38754;&#19978;&#65292;&#25353;&#19968;&#19979;&#12300;&#36914;&#38542;&#12301;&#27161;&#31844;&#12290;</p>
<p>&#12300;&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#36914;&#38542;&#23660;&#24615;&#12301;&#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#39511;&#35657;&#38291;&#38548;&#26368;&#20037;&#26178;&#38291;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#21040;&#36948;&#39511;&#35657;&#36899;&#32218;&#38291;&#38548;&#26368;&#38263;&#26178;&#38291;&#20043;&#21069;&#65292;&#31561;&#24453;&#30340;&#26178;&#38291;&#38263;&#24230; (&#20197;&#31186;&#28858;&#21934;&#20301;)&#12290;</p>
<p>&#23559;&#27492;&#23660;&#24615;&#35373;&#23450;&#28858;&#36969;&#30070;&#20540;&#65292;&#21487;&#23559;&#39511;&#35657;&#36899;&#32218;&#35531;&#27714;&#30340;&#25976;&#30446;&#28187;&#33267;&#26368;&#23567;&#12290;&#38928;&#35373;&#20540;&#28858; 0&#65292;&#34920;&#31034;&#26410;&#21855;&#29992;&#27492;&#23660;&#24615;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#37679;&#35492;&#36926;&#26178;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#36861;&#36452;&#36899;&#32218;&#38598;&#21312;&#20013;&#37679;&#35492;&#36899;&#32218;&#30340;&#26178;&#38291;&#38263;&#24230; (&#20197;&#31186;&#28858;&#21934;&#20301;)&#12290;</p>
<p>0 &#20540;&#34920;&#31034;&#24050;&#20572;&#29992;&#36899;&#32218;&#27945;&#28431;&#36861;&#36452;&#12290;&#38928;&#35373;&#20540;&#28858; 0&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#37679;&#35492;&#25910;&#22238;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#21487;&#22312;&#36899;&#32218;&#37679;&#35492;&#36861;&#36452;&#23436;&#25104;&#20043;&#24460;&#65292;&#23559;&#37679;&#35492;&#36899;&#32218;&#24489;&#21407;&#33267;&#36899;&#32218;&#38598;&#21312;&#12290;</p>
<p>&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#24314;&#31435;&#37325;&#26032;&#22039;&#35430;&#27425;&#25976;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#24314;&#31435;&#26032;&#36899;&#32218;&#22833;&#25943;&#20043;&#24460;&#65292;&#23559;&#36914;&#34892;&#30340;&#22039;&#35430;&#27425;&#25976;&#12290;</p>
<p>0 &#20540;&#34920;&#31034;&#19981;&#26371;&#20877;&#27425;&#22039;&#35430;&#24314;&#31435;&#36899;&#32218;&#12290;&#38928;&#35373;&#20540;&#28858; 0&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#37325;&#35430;&#38291;&#38548;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#20841;&#27425;&#22039;&#35430;&#24314;&#31435;&#36899;&#32218;&#20043;&#38291;&#30340;&#26178;&#38291;&#38291;&#38548; (&#20197;&#31186;&#28858;&#21934;&#20301;)&#12290;</p>
<p>&#20677;&#30070;&#12300;&#24314;&#31435;&#37325;&#26032;&#22039;&#35430;&#27425;&#25976;&#12301;&#30340;&#20540;&#22823;&#26044; 0 &#26178;&#65292;&#25165;&#20351;&#29992;&#35442;&#23660;&#24615;&#12290;&#38928;&#35373;&#20540;&#28858; 10 &#31186;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#38598;&#21312;&#31649;&#29702;&#12301;&#26680;&#21462;&#26041;&#22602;&#21487;&#37341;&#23565;&#38598;&#21312;&#21855;&#29992;&#36899;&#32218;&#38598;&#21312;&#31649;&#29702;&#12290;</p>
<p>&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#21855;&#29992;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#24816;&#24615;&#38364;&#32879;&#12301;&#26680;&#21462;&#26041;&#22602;&#21487;&#22312;&#20316;&#26989;&#26044;&#36899;&#32218;&#19978;&#22519;&#34892;&#26178;&#65292;&#28858;&#36899;&#32218;&#24314;&#31435;&#24816;&#24615;&#38364;&#32879;&#12290;</p>
<p>&#30070;&#20316;&#26989;&#20107;&#20214;&#23436;&#25104;&#19988;&#20803;&#20214;&#26041;&#27861;&#32080;&#26463;&#26178;&#65292;&#36889;&#20123;&#36899;&#32218;&#20415;&#26371;&#21462;&#28040;&#38364;&#32879;&#65292;&#24478;&#32780;&#21487;&#20197;&#37325;&#35079;&#20351;&#29992;&#23526;&#39636;&#36899;&#32218;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#24816;&#24615;&#36899;&#32218;&#30331;&#35352;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#21487;&#20677;&#22312;&#36039;&#28304;&#23526;&#38555;&#29992;&#26044;&#26041;&#27861;&#20013;&#26178;&#65292;&#25165;&#23559;&#36039;&#28304;&#30331;&#35352;&#33267;&#20316;&#26989;&#20107;&#20214;&#12290;</p>
<p>&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#33287;&#32363;&#32218;&#24314;&#31435;&#38364;&#32879;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#21487;&#23559;&#36899;&#32218;&#33287;&#32363;&#32218;&#24314;&#31435;&#38364;&#32879;&#12290;</p>
<p>&#30070;&#30456;&#21516;&#30340;&#32363;&#32218;&#38656;&#35201;&#36899;&#32218;&#26178;&#65292;&#20415;&#21487;&#20197;&#37325;&#35079;&#20351;&#29992;&#24050;&#33287;&#35442;&#32363;&#32218;&#24314;&#31435;&#38364;&#32879;&#30340;&#36899;&#32218;&#65292;&#32780;&#30465;&#19979;&#24478;&#38598;&#21312;&#20013;&#21462;&#24471;&#36899;&#32218;&#30340;&#32147;&#24120;&#24615;&#32791;&#29992;&#26178;&#38291;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#27604;&#23565;&#36899;&#32218;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#21487;&#21855;&#29992;&#38598;&#21312;&#30340;&#36899;&#32218;&#27604;&#23565;&#21151;&#33021;&#12290;</p>
<p>&#22914;&#26524;&#24744;&#30693;&#36947;&#38598;&#21312;&#20013;&#30340;&#36899;&#32218;&#19968;&#23450;&#26159;&#21516;&#36074;&#36899;&#32218;&#65292;&#22240;&#27492;&#19981;&#38656;&#35201;&#36039;&#28304;&#36681;&#25509;&#22120;&#23565;&#24478;&#38598;&#21312;&#20013;&#25361;&#36984;&#30340;&#36899;&#32218;&#36914;&#34892;&#27604;&#23565;&#65292;&#21487;&#20197;&#20572;&#29992;&#27492;&#36984;&#38917;&#12290;&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#21855;&#29992;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#27604;&#23565;&#36899;&#32218;&#20351;&#29992;&#29575;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#38598;&#21312;&#37325;&#35079;&#20351;&#29992;&#36899;&#32218;&#30340;&#27425;&#25976;&#12290;</p>
<p>&#37325;&#35079;&#20351;&#29992;&#25351;&#23450;&#27425;&#25976;&#30340;&#36899;&#32218;&#24460;&#65292;&#23601;&#26371;&#38364;&#38281;&#36899;&#32218;&#12290;0 &#20540;&#34920;&#31034;&#27794;&#26377;&#21855;&#29992;&#27492;&#23660;&#24615;&#12290;&#38928;&#35373;&#20540;&#28858; 0&#12290;</p>
</li>
<li>
<p>&#25353;&#19968;&#19979;&#12300;&#20786;&#23384;&#12301;&#12290;</p>

<hr>
<p><b>&#25552;&#31034;:</b></p>
&#33509;&#35201;&#22238;&#21040;&#38928;&#35373;&#35373;&#23450;&#65292;&#35531;&#25353;&#19968;&#19979;&#12300;&#36617;&#20837;&#38928;&#35373;&#20540;&#12301;&#25353;&#37397;&#65292;&#28982;&#24460;&#25353;&#19968;&#19979;&#12300;&#20786;&#23384;&#12301;&#12290;<br />
<hr>

</li>
</ol>
<a id="sthref15" name="sthref15"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-connectorresourcenew.html">&#24314;&#31435;&#36899;&#32218;&#22120;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-connectorresourceedit.html">&#32232;&#36655;&#36899;&#32218;&#22120;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-connectorresourcesdelete.html">&#21034;&#38500;&#36899;&#32218;&#22120;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolnew.html">&#24314;&#31435;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#29305;&#24615;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">&#24314;&#31435;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#30340;&#23433;&#20840;&#24615;&#23565;&#25033;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#30340;&#23433;&#20840;&#24615;&#23565;&#25033;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">&#21034;&#38500;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#30340;&#23433;&#20840;&#24615;&#23565;&#25033;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">&#21034;&#38500;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;</a></p>
</li>
<li>
<p><a href="task-setupeisaccess.html">&#35373;&#23450; EIS &#23384;&#21462;</a></p>
</li>
<li>
<p><a href="task-adminobjectnew.html">&#24314;&#31435;&#31649;&#29702;&#29289;&#20214;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-adminobjectedit.html">&#32232;&#36655;&#31649;&#29702;&#29289;&#20214;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-administeredobjectresourcedelete.html">&#21034;&#38500;&#31649;&#29702;&#29289;&#20214;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-worksecuritymapnew.html">&#24314;&#31435;&#24037;&#20316;&#23433;&#20840;&#24615;&#23565;&#25033;</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">&#32232;&#36655;&#24037;&#20316;&#23433;&#20840;&#24615;&#23565;&#25033;</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">&#21034;&#38500;&#24037;&#20316;&#23433;&#20840;&#24615;&#23565;&#25033;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
