<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-adminobjectnew" name="task-adminobjectnew"></a></p>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#28687;&#35261;&#27193;&#29376;&#32080;&#27083;&#20013;&#65292;&#23637;&#38283;&#12300;&#36039;&#28304;&#12301;&#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#23637;&#38283;&#12300;&#36899;&#32218;&#22120;&#12301;&#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#36899;&#32218;&#22120;&#12301;&#31680;&#40670;&#19979;&#65292;&#36984;&#21462;&#12300;&#31649;&#29702;&#29289;&#20214;&#36039;&#28304;&#12301;&#31680;&#40670;&#12290;</p>
<p>&#12300;&#31649;&#29702;&#29289;&#20214;&#36039;&#28304;&#12301;&#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#31649;&#29702;&#29289;&#20214;&#36039;&#28304;&#12301;&#38913;&#38754;&#19978;&#25353;&#19968;&#19979;&#12300;&#26032;&#24314;&#12301;&#25353;&#37397;&#12290;</p>
<p>&#12300;&#26032;&#24314;&#31649;&#29702;&#29289;&#20214;&#36039;&#28304;&#12301;&#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;JNDI &#21517;&#31281;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#35672;&#21029;&#31649;&#29702;&#29289;&#20214;&#36039;&#28304;&#30340;&#21807;&#19968;&#21517;&#31281;&#12290;</p>
</li>
<li>
<p>&#24478;&#12300;&#36039;&#28304;&#36681;&#25509;&#22120;&#12301;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#31649;&#29702;&#29289;&#20214;&#36039;&#28304;&#30340;&#36039;&#28304;&#36681;&#25509;&#22120;&#12290;</p>
</li>
<li>
<p>&#24478;&#12300;&#36039;&#28304;&#39006;&#22411;&#12301;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#31649;&#29702;&#29289;&#20214;&#36039;&#28304;&#30340; Java &#39006;&#22411;&#12290;</p>
</li>
<li>
<p>&#24478;&#12300;&#39006;&#21029;&#21517;&#31281;&#12301;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#33287;&#36039;&#28304;&#39006;&#22411;&#38364;&#32879;&#30340;&#23526;&#34892;&#39006;&#21029;&#21517;&#31281;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#25551;&#36848;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#31649;&#29702;&#29289;&#20214;&#36039;&#28304;&#30340;&#25551;&#36848;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#21855;&#29992;&#29376;&#24907;&#12301;&#26680;&#21462;&#26041;&#22602;&#21855;&#29992;&#31649;&#29702;&#29289;&#20214;&#36039;&#28304;&#12290;</p>
<p>&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#21855;&#29992;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#20854;&#20182;&#29305;&#24615;&#12301;&#34920;&#20013;&#65292;&#25351;&#23450;&#31649;&#29702;&#29289;&#20214;&#36039;&#28304;&#30340;&#20854;&#20182;&#29305;&#24615;&#12290;</p>
<p>&#21487;&#29992;&#30340;&#29305;&#24615;&#26371;&#35222;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#30340;&#36039;&#28304;&#36681;&#25509;&#22120;&#32780;&#23450;&#12290;</p>
<p>&#33509;&#35201;&#22686;&#21152;&#29305;&#24615;&#65292;&#35531;&#25353;&#19968;&#19979;&#12300;&#22686;&#21152;&#29305;&#24615;&#12301;&#25353;&#37397;&#12290;&#22312;&#20986;&#29694;&#30340;&#31354;&#30333;&#21015;&#20013;&#65292;&#26044;&#12300;&#21517;&#31281;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#21517;&#31281;&#65292;&#28982;&#24460;&#22312;&#12300;&#20540;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#20540;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#21487;&#29992;&#30340;&#30446;&#27161;&#12301;&#21312;&#27573;&#20013;&#65292;&#36984;&#21462;&#31649;&#29702;&#29289;&#20214;&#25152;&#22312;&#30340;&#32178;&#22495;&#12289;&#21474;&#38598;&#25110;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#65292;&#28982;&#24460;&#25353;&#19968;&#19979;&#12300;&#22686;&#21152;&#12301;&#12290;</p>
<p>&#33509;&#35201;&#31227;&#38500;&#12300;&#24050;&#36984;&#21462;&#12301;&#27396;&#20301;&#20013;&#25152;&#21015;&#30340;&#20854;&#20013;&#19968;&#20491;&#32178;&#22495;&#12289;&#21474;&#38598;&#25110;&#20282;&#26381;&#22120;&#22519;&#34892;&#34389;&#29702;&#65292;&#35531;&#24478;&#35442;&#27396;&#20301;&#20013;&#20104;&#20197;&#36984;&#21462;&#65292;&#28982;&#24460;&#25353;&#19968;&#19979;&#12300;&#31227;&#38500;&#12301;&#12290;</p>
</li>
<li>
<p>&#25353;&#19968;&#19979;&#12300;&#30906;&#23450;&#12301;&#12290;</p>
</li>
</ol>
<a id="sthref32" name="sthref32"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-connectorresourcenew.html">&#24314;&#31435;&#36899;&#32218;&#22120;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-connectorresourceedit.html">&#32232;&#36655;&#36899;&#32218;&#22120;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-connectorresourcesdelete.html">&#21034;&#38500;&#36899;&#32218;&#22120;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolnew.html">&#24314;&#31435;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooledit.html">&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooladvance.html">&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#36914;&#38542;&#23660;&#24615;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpoolproperty.html">&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#29305;&#24615;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapnew.html">&#24314;&#31435;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#30340;&#23433;&#20840;&#24615;&#23565;&#25033;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapedit.html">&#32232;&#36655;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#30340;&#23433;&#20840;&#24615;&#23565;&#25033;</a></p>
</li>
<li>
<p><a href="task-connectorsecuritymapdel.html">&#21034;&#38500;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;&#30340;&#23433;&#20840;&#24615;&#23565;&#25033;</a></p>
</li>
<li>
<p><a href="task-connectorconnectionpooldel.html">&#21034;&#38500;&#36899;&#32218;&#22120;&#36899;&#32218;&#38598;&#21312;</a></p>
</li>
<li>
<p><a href="task-setupeisaccess.html">&#35373;&#23450; EIS &#23384;&#21462;</a></p>
</li>
<li>
<p><a href="task-adminobjectedit.html">&#32232;&#36655;&#31649;&#29702;&#29289;&#20214;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-administeredobjectresourcedelete.html">&#21034;&#38500;&#31649;&#29702;&#29289;&#20214;&#36039;&#28304;</a></p>
</li>
<li>
<p><a href="task-worksecuritymapnew.html">&#24314;&#31435;&#24037;&#20316;&#23433;&#20840;&#24615;&#23565;&#25033;</a></p>
</li>
<li>
<p><a href="task-worksecuritymapedit.html">&#32232;&#36655;&#24037;&#20316;&#23433;&#20840;&#24615;&#23565;&#25033;</a></p>
</li>
<li>
<p><a href="task-worksecuritymapdelete.html">&#21034;&#38500;&#24037;&#20316;&#23433;&#20840;&#24615;&#23565;&#25033;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
