<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-ejbtimerservice" name="ref-ejbtimerservice"></a></p>

<h4><a id="sthref23" name="sthref23"></a><a id="sthref24" name="sthref24"></a><a id="sthref25" name="sthref25"></a>Servi&ccedil;o de Timer EJB</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Servi&ccedil;o de Timer EJB para configurar o servi&ccedil;o de timer do EJB.</p>
<p>O servi&ccedil;o de timer &eacute; um servi&ccedil;o de notifica&ccedil;&atilde;o persistente e transacional que &eacute; fornecido pelo cont&ecirc;iner do enterprise bean e utilizado para programar notifica&ccedil;&otilde;es ou eventos utilizados por enterprise beans. Todos os enterprise beans, exceto os beans de sess&atilde;o stateful, podem receber notifica&ccedil;&otilde;es do servi&ccedil;o de timer. Os timers persistentes definidos pelo servi&ccedil;o n&atilde;o s&atilde;o destru&iacute;dos quando o servidor &eacute; submetido a shutdown ou reiniciado.</p>
<p>A p&aacute;gina Servi&ccedil;o de Timer EJB cont&eacute;m a seguintes op&ccedil;&otilde;es:</p>
<dl>
<dt>Carregar Defaults</dt>
<dd>
<p>Bot&atilde;o para restaurar defini&ccedil;&otilde;es para seus valores default. Defini&ccedil;&otilde;es que n&atilde;o tiveram seus valores default alterados.</p>
</dd>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Intervalo M&iacute;nimo de Entrega</dt>
<dd>
<p>O n&uacute;mero m&iacute;nimo de milissegundos permitidos antes que a pr&oacute;xima expira&ccedil;&atilde;o para determinado timer ocorra. A defini&ccedil;&atilde;o deste intervalo com um valor muito baixo pode causar a sobrecarga do servidor. O valor default &eacute; 1000.</p>
</dd>
<dt>M&aacute;ximo de Tentativas de Entrega</dt>
<dd>
<p>O n&uacute;mero m&aacute;ximo de tentativas feitas pelo servi&ccedil;o de timer para entregar uma expira&ccedil;&atilde;o de timer de em decorr&ecirc;ncia de uma exce&ccedil;&atilde;o ou revers&atilde;o. O valor default &eacute; 1.</p>
</dd>
<dt>Intervalo para Nova Tentativa de Entrega</dt>
<dd>
<p>O intervalo em milissegundos entre as novas tentativas de entrega. O valor default &eacute; 5.000.</p>
</dd>
<dt>Fonte de Dados do Timer</dt>
<dd>
<p>O nome JNDI do recurso JDBC que ser&aacute; usado como a fonte de dados do timer. Caso seja especificado, esse valor substitui o valor default de <code>jdbc/__TimerPool</code> para a aplica&ccedil;&atilde;o do sistema do servi&ccedil;o do timer.</p>
</dd>
</dl>
<a id="sthref26" name="sthref26"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-ejbtimerservice.html">Para Configurar o Servi&ccedil;o de Timer EJB</a></p>
</li>
<li>
<p><a href="../../../ejb-lite/en/help/task-ejbgeneral.html">Para Configurar as Defini&ccedil;&otilde;es EJB</a></p>
</li>
<li>
<p><a href="task-ejbmdbpoolsettings.html">Para Configurar as Defini&ccedil;&otilde;es do Pool MDB</a></p>
</li>
</ul>
<a id="sthref27" name="sthref27"></a>
<h5>Comandos asadmin Relacionados</h5>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00205"><code>list-timers</code>(1)</a></p>





<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
