<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-ejbcontaineravailability" name="ref-ejbcontaineravailability"></a></p>

<h4><a id="sthref15" name="sthref15"></a><a id="sthref16" name="sthref16"></a>Disponibilidade de Cont&ecirc;iner EJB</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilize a p&aacute;gina Disponibilidade do Cont&ecirc;iner EJB para configurar as defini&ccedil;&otilde;es de disponibilidade do cont&ecirc;iner EJB.</p>
<p>A p&aacute;gina Disponibilidade do Cont&ecirc;iner EJB cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Carregar Defaults</dt>
<dd>
<p>Bot&atilde;o para restaurar defini&ccedil;&otilde;es para seus valores default. Defini&ccedil;&otilde;es que n&atilde;o tiveram seus valores default alterados.</p>
</dd>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Servi&ccedil;o de Disponibilidade</dt>
<dd>
<p>Se a caixa de sele&ccedil;&atilde;o Ativado estiver selecionada, a disponibilidade estar&aacute; ativada para o cont&ecirc;iner EJB.</p>
</dd>
<dt>Tipo de Persist&ecirc;ncia de HA</dt>
<dd>
<p>Trata-se do mecanismo de persist&ecirc;ncia utilizado quando a op&ccedil;&atilde;o Servi&ccedil;o de Disponibilidade Ativado estiver marcada. O default &eacute; <code>replicado</code>, o que gera persist&ecirc;ncia com base no failover de um cluster. N&atilde;o altere este valor.</p>
</dd>
<dt>Tipo de Persist&ecirc;ncia SFSB</dt>
<dd>
<p>Trata-se do mecanismo de persist&ecirc;ncia utilizado quando a op&ccedil;&atilde;o Servi&ccedil;o de Disponibilidade Ativado <i>n&atilde;o</i> estiver marcada. O default &eacute; <code>file</code>, o que gera persist&ecirc;ncia com base no sistema de arquivos. N&atilde;o altere este valor.</p>
<p>O campo Local de Armazenamento de Sess&atilde;o determina onde os estados do checkpoint SFSB s&atilde;o persistentes. Para definir o Local de Armazenamento de Sess&atilde;o, consulte <a href="../../../ejb-lite/en/help/task-ejbgeneral.html">Para Configurar Defini&ccedil;&otilde;es do EJB</a>.</p>
</dd>
<dt>Propriedades Adicionais</dt>
<dd>
<p>Propriedades adicionais da Disponibilidade do Cont&ecirc;iner EJB.</p>
<p>O GlassFish Server n&atilde;o define propriedades adicionais da Disponibilidade do Cont&ecirc;iner EJB.</p>
</dd>
</dl>
<a id="sthref17" name="sthref17"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-ejbcontaineravailability.html">Para Configurar as Defini&ccedil;&otilde;es de Disponibilidade do Cont&ecirc;iner EJB</a></p>
</li>
<li>
<p><a href="../../../ejb-lite/en/help/task-ejbgeneral.html">Para Configurar as Defini&ccedil;&otilde;es EJB</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
