<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-ejbmdbpoolsettings" name="ref-ejbmdbpoolsettings"></a></p>

<h4><a id="sthref15" name="sthref15"></a><a id="sthref16" name="sthref16"></a><a id="sthref17" name="sthref17"></a>Defini&ccedil;&otilde;es de Pool Default MDB</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilize a p&aacute;gina Defini&ccedil;&otilde;es de Pool Default MDB, para configurar o pool MDB.</p>
<p>A p&aacute;gina Defini&ccedil;&otilde;es de Pool Default MDB cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Carregar Defaults</dt>
<dd>
<p>Bot&atilde;o para restaurar defini&ccedil;&otilde;es para seus valores default. Defini&ccedil;&otilde;es que n&atilde;o tiveram seus valores default alterados.</p>
</dd>
<dt>Nome da Configura&ccedil;&atilde;o</dt>
<dd>
<p>O nome da configura&ccedil;&atilde;o &agrave; qual as defini&ccedil;&otilde;es nesta p&aacute;gina se aplicam. Este campo &eacute; somente para leitura.</p>
</dd>
<dt>Tamanho Inicial e M&iacute;nimo do Pool</dt>
<dd>
<p>O n&uacute;mero m&iacute;nimo de beans de mensagem a serem mantidos no pool. O valor default &eacute; 0.</p>
</dd>
<dt>Tamanho M&aacute;ximo do Pool</dt>
<dd>
<p>O n&uacute;mero m&aacute;ximo de beans que o cont&ecirc;iner pode manter no pool ao mesmo tempo. O valor default &eacute; 32.</p>
</dd>
<dt>Quantidade de Redimensionamento do Pool</dt>
<dd>
<p>O n&uacute;mero de beans que s&atilde;o removidos do Pool, se estiverem ociosos por mais tempo do que o especificado no campo Time-out para Ociosidade do Pool. O valor precisa ser ao menos 0 e menor do que o valor de Tamanho M&aacute;ximo do Pool. O valor default &eacute; 8.</p>
</dd>
<dt>Time-out para Ociosidade do Pool</dt>
<dd>
<p>O tempo, em segundos, que um pool pode permanecer ocioso antes que seja removido do pool. Ap&oacute;s essa quantidade de tempo, o bean &eacute; destru&iacute;do. Um valor de 0 significa que um bean pode permanecer ocioso indefinidamente. O valor default &eacute; 600.</p>
</dd>
<dt>Propriedades Adicionais</dt>
<dd>
<p>Propriedades adicionais do pool MDB. O GlassFish Server n&atilde;o define quaisquer propriedades adicionais para o pool MDB.</p>
</dd>
</dl>
<a id="sthref18" name="sthref18"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-ejbmdbpoolsettings.html">Para Configurar as Defini&ccedil;&otilde;es do Pool MDB</a></p>
</li>
<li>
<p><a href="../../../ejb-lite/en/help/task-ejbgeneral.html">Para Configurar as Defini&ccedil;&otilde;es EJB</a></p>
</li>
<li>
<p><a href="task-ejbtimerservice.html">Para Configurar o Servi&ccedil;o de Timer EJB</a></p>
</li>
</ul>
<a id="sthref19" name="sthref19"></a>
<h5>Comandos asadmin Relacionados</h5>
<p>Nenhum.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
