<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-ejbtimerservice" name="task-ejbtimerservice"></a><a id="GHEJB00005" name="GHEJB00005"></a></p>

<h4><a id="sthref3" name="sthref3"></a><a id="sthref4" name="sthref4"></a><a id="sthref5" name="sthref5"></a>Para Configurar o Servi&ccedil;o de Timer EJB</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>O servi&ccedil;o de timer &eacute; um servi&ccedil;o de notifica&ccedil;&atilde;o persistente e transacional que &eacute; fornecido pelo cont&ecirc;iner do enterprise bean e utilizado para programar notifica&ccedil;&otilde;es ou eventos utilizados por enterprise beans. Todos os enterprise beans, exceto os beans de sess&atilde;o stateful, podem receber notifica&ccedil;&otilde;es do servi&ccedil;o de timer. Os timers persistentes definidos pelo servi&ccedil;o n&atilde;o s&atilde;o destru&iacute;dos quando o servidor &eacute; submetido a shutdown ou reiniciado.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&atilde;o.</p>
</li>
<li>
<p>Selecione o n&oacute; Cont&ecirc;iner EJB.</p>
<p>A p&aacute;gina Enterprise Java Beans (EJB) &eacute; aberta.</p>
</li>
<li>
<p>Clique na guia Servi&ccedil;o de Timer EJB.</p>
<p>A p&aacute;gina Servi&ccedil;o de Timer EJB ser&aacute; aberta.</p>
</li>
<li>
<p>No campo Intervalo M&iacute;nimo de Entrega, digite o n&uacute;mero m&iacute;nimo de milissegundos permitidos antes que a pr&oacute;xima expira&ccedil;&atilde;o para um determinado timer ocorra.</p>
<p>A defini&ccedil;&atilde;o deste intervalo com um valor muito baixo pode causar a sobrecarga do servidor. O valor default &eacute; 1000.</p>
</li>
<li>
<p>No campo M&aacute;ximo de Tentativas de Entrega, digite o n&uacute;mero m&aacute;ximo de tentativas feitas pelo servi&ccedil;o de timer para entregar uma expira&ccedil;&atilde;o de timer em decorr&ecirc;ncia de uma exce&ccedil;&atilde;o ou revers&atilde;o.</p>
<p>O valor default &eacute; 1.</p>
</li>
<li>
<p>No campo Intervalo para Nova Tentativa de Entrega, digite o intervalo, em segundos, entre a as tentativas de nova entrega.</p>
<p>O valor default &eacute; 5.000.</p>
</li>
<li>
<p>No campo Fonte de Dados do Timer, digite o nome JNDI do recurso JDBC que ser&aacute; utilizado como a fonte de dados do timer.</p>
<p>Caso seja especificado, esse valor substitui o valor default de <code>jdbc/__TimerPool</code> para a aplica&ccedil;&atilde;o do sistema do servi&ccedil;o do timer.</p>
</li>
<li>
<p>Clique em Salvar.</p>

<hr>
<p><b>Dica:</b></p>
Para voltar &agrave;s defini&ccedil;&otilde;es default, clique no bot&atilde;o Carregar Defaults e depois em Salvar.
<hr>

</li>
<li>
<p>Reinicie o GlassFish Server.</p>
</li>
</ol>
<a id="sthref6" name="sthref6"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="../../../ejb-lite/en/help/task-ejbgeneral.html">Para Configurar as Defini&ccedil;&otilde;es EJB</a></p>
</li>
<li>
<p><a href="task-ejbmdbpoolsettings.html">Para Configurar as Defini&ccedil;&otilde;es do Pool MDB</a></p>
</li>
<li>
<p><a href="task-ejbcontaineravailability.html">Para Configurar as Defini&ccedil;&otilde;es de Disponibilidade do Cont&ecirc;iner EJB</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
