<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-ejbmdbpoolsettings" name="task-ejbmdbpoolsettings"></a></p>

<h4><a id="sthref2" name="sthref2"></a><a id="sthref3" name="sthref3"></a><a id="sthref4" name="sthref4"></a>Para Configurar as Defini&ccedil;&otilde;es do Pool MDB</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>O pool para beans baseados em mensagens &eacute; semelhante ao pool para os beans de sess&atilde;o. Por default, o cont&ecirc;iner mant&eacute;m um pool de beans baseados em mensagens.</p>
<p>Para ajustar a configura&ccedil;&atilde;o desse pool, execute as etapas a seguir.</p>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&atilde;o.</p>
</li>
<li>
<p>Selecione o n&oacute; Cont&ecirc;iner EJB.</p>
<p>A p&aacute;gina Enterprise Java Beans (EJB) &eacute; aberta.</p>
</li>
<li>
<p>Clique na guia Defini&ccedil;&otilde;es MDB.</p>
<p>A p&aacute;gina Defini&ccedil;&otilde;es do Pool MDB Default &eacute; aberta.</p>
</li>
<li>
<p>No campo Tamanho inicial e M&iacute;nimo do Pool, digite o n&uacute;mero m&iacute;nimo de beans de mensagem a serem mantidos no Pool.</p>
<p>O valor default &eacute; 0.</p>
</li>
<li>
<p>No campo Tamanho M&aacute;ximo do Pool, digite o n&uacute;mero m&aacute;ximo de beans que o cont&ecirc;iner pode manter no pool ao mesmo tempo.</p>
<p>O valor default &eacute; 32.</p>
</li>
<li>
<p>No campo Quantidade de Redimensionamento do Pool, digite o n&uacute;mero de beans que ser&atilde;o removidos do Pool, se estiverem ociosos por mais tempo do que o especificado no campo Time-out para Ociosidade do Pool.</p>
<p>O valor precisa ser ao menos 0 e menor do que o valor de Tamanho M&aacute;ximo do Pool. O valor default &eacute; 8.</p>
</li>
<li>
<p>No campo Time-out para Ociosidade do Pool, digite o tempo, em segundos, que um bean do Pool pode permanecer ocioso antes que seja removido.</p>
<p>Ap&oacute;s essa quantidade de tempo, o bean &eacute; destru&iacute;do. Um valor de 0 significa que um bean pode permanecer ocioso indefinidamente. O valor default &eacute; 600.</p>
</li>
<li>
<p>Na se&ccedil;&atilde;o Propriedades Adicionais, especifique as propriedades adicionais.</p>
<p>O GlassFish Server n&atilde;o define quaisquer propriedades adicionais para o pool MDB.</p>
<ul>
<li>
<p>Para adicionar uma propriedade, clique no bot&atilde;o Adicionar Propriedade. Na linha em branco que for exibida, digite o nome da propriedade no campo Nome e digite o valor da propriedade no campo Valor.</p>
</li>
<li>
<p>Para modificar uma propriedade, edite o campo Valor da propriedade.</p>
</li>
<li>
<p>Para deletar uma propriedade, marque a caixa de sele&ccedil;&atilde;o &agrave; esquerda do campo Nome da Propriedade a ser deletada. Clique no bot&atilde;o Deletar Propriedades.</p>
</li>
</ul>
</li>
<li>
<p>Clique em Salvar.</p>

<hr>
<p><b>Dica:</b></p>
Para voltar &agrave;s defini&ccedil;&otilde;es default, clique no bot&atilde;o Carregar Defaults e depois em Salvar.
<hr>

</li>
<li>
<p>Reinicie o GlassFish Server.</p>
</li>
</ol>
<a id="sthref5" name="sthref5"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="../../../ejb-lite/en/help/task-ejbgeneral.html">Para Configurar as Defini&ccedil;&otilde;es EJB</a></p>
</li>
<li>
<p><a href="task-ejbtimerservice.html">Para Configurar o Servi&ccedil;o de Timer EJB</a></p>
</li>
<li>
<p><a href="task-ejbcontaineravailability.html">Para Configurar as Defini&ccedil;&otilde;es de Disponibilidade do Cont&ecirc;iner EJB</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
