<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-ejbcontaineravailability" name="task-ejbcontaineravailability"></a><a id="GHEJB00006" name="GHEJB00006"></a></p>

<h4><a id="sthref7" name="sthref7"></a><a id="sthref8" name="sthref8"></a><a id="sthref9" name="sthref9"></a><a id="sthref10" name="sthref10"></a>Para Configurar as Defini&ccedil;&otilde;es de Disponibilidade do Cont&ecirc;iner EJB</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Configura&ccedil;&atilde;o.</p>
</li>
<li>
<p>Selecione a configura&ccedil;&atilde;o que est&aacute; sendo alterada.</p>
</li>
<li>
<p>No n&oacute; da configura&ccedil;&atilde;o, selecione o n&oacute; Servi&ccedil;o de Disponibilidade.</p>
<p>A p&aacute;gina Servi&ccedil;o de Disponibilidade ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina Servi&ccedil;o de Disponibilidade, clique na guia Disponibilidade do Cont&ecirc;iner EJB.</p>
<p>A p&aacute;gina Disponibilidade do Cont&ecirc;iner EJB ser&aacute; aberta.</p>
</li>
<li>
<p>Marque a caixa Servi&ccedil;o de Disponibilidade Ativado para ativar a disponibilidade do cont&ecirc;iner EJB.</p>
<p>Para desativar a disponibilidade, desmarque a caixa Servi&ccedil;o de Disponibilidade Ativado.</p>
</li>
<li>
<p>O tipo de persist&ecirc;ncia HA &eacute; <code>replicated</code>.</p>
<p>Trata-se do mecanismo de persist&ecirc;ncia utilizado quando a op&ccedil;&atilde;o Servi&ccedil;o de Disponibilidade Ativado estiver marcada. A persist&ecirc;ncia &eacute; baseada no failover em um cluster. N&atilde;o altere este valor.</p>
</li>
<li>
<p>O Tipo de Persist&ecirc;ncia SFSB &eacute; <code>file</code>.</p>
<p>Trata-se do mecanismo de persist&ecirc;ncia utilizado quando a op&ccedil;&atilde;o Servi&ccedil;o de Disponibilidade Ativado <i>n&atilde;o</i> estiver marcada. A persist&ecirc;ncia &eacute; baseada no sistema de arquivos. N&atilde;o altere este valor.</p>
<p>O campo Local de Armazenamento de Sess&atilde;o determina onde os estados do checkpoint SFSB s&atilde;o persistentes. Para definir o Local de Armazenamento de Sess&atilde;o, consulte <a href="../../../ejb-lite/en/help/task-ejbgeneral.html">Para Configurar Defini&ccedil;&otilde;es do EJB</a>.</p>
</li>
<li>
<p>Para restaurar os valores default, clique no bot&atilde;o Carregar Defaults.</p>
</li>
<li>
<p>Na se&ccedil;&atilde;o Propriedades Adicionais, especifique as propriedades adicionais.</p>
<p>O GlassFish Server n&atilde;o define propriedades adicionais para a disponibilidade do cont&ecirc;iner EJB.</p>
<ul>
<li>
<p>Para adicionar uma propriedade, clique no bot&atilde;o Adicionar Propriedade. Na linha em branco que for exibida, digite o nome da propriedade no campo Nome e digite o valor da propriedade no campo Valor.</p>
</li>
<li>
<p>Para modificar uma propriedade, edite o campo Valor da propriedade.</p>
</li>
<li>
<p>Para deletar uma propriedade, marque a caixa de sele&ccedil;&atilde;o &agrave; esquerda do campo Nome da Propriedade a ser deletada. Clique no bot&atilde;o Deletar Propriedades.</p>
</li>
</ul>
</li>
<li>
<p>Clique em Salvar.</p>
</li>
</ol>
<a id="sthref11" name="sthref11"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="../../../ejb-lite/en/help/task-ejbgeneral.html">Para Configurar as Defini&ccedil;&otilde;es EJB</a></p>
</li>
<li>
<p><a href="task-ejbmdbpoolsettings.html">Para Configurar as Defini&ccedil;&otilde;es do Pool MDB</a></p>
</li>
<li>
<p><a href="task-ejbtimerservice.html">Para Configurar o Servi&ccedil;o de Timer EJB</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
