<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="documentinfo"></a><p>Teilenr.: 821-0082-10</p><p>Mai 2009</p><p>4150 Network Circle<br>Santa Clara,  CA 95054<br>U.S.A.</p><p>Copyright 2009 Sun Microsystems, Inc.</p><p>Sun
Microsystems, Inc. hat Rechte in Bezug auf geistiges Eigentum an der Technologie,
die in dem in diesem Dokument beschriebenen Produkt enthalten ist. Im Besonderen
und ohne Einschr&#228;nkung umfassen diese Anspr&#252;che in Bezug auf geistiges Eigentum eines
oder mehrere  Patente und eines oder mehrere Patente oder Anwendungen mit
laufendem Patent in den USA und in anderen L&#228;ndern.</p><p>Rechte der US-Regierung &#8211;
Kommerzielle Software. F&#252;r bei der Regierung besch&#228;ftigte Benutzer gelten die Standardlizenzvereinbarung von
Sun Microsystems, Inc. sowie die einschl&#228;gigen Bestimmungen des FAR und seiner Erg&#228;nzungen.</p><p>Dieses
Lieferung schlie&#223;t m&#246;glicherweise Materialien ein, die von Fremdanbietern entwickelt wurden.</p><p>Teile dieses Produkts
k&#246;nnen von Berkeley BSD Systems abgeleitet und durch die University of California
lizenziert sein. UNIX ist eine eingetragene Marke in den Vereinigten Staaten und
anderen L&#228;ndern und wird ausschlie&#223;lich durch die X/Open Company Ltd. lizenziert.</p><p>Sun, Sun
Microsystems, das Sun-Logo, das Solaris-Logo, das Java Coffee Cup-Logo, docs.sun.com,  Enterprise JavaBeans,
EJB, GlassFish, J2EE, J2SE, Java Benennungs- und Verzeichnis-Schnittstelle, JavaBeans, Javadoc, JDBC, JDK,
JavaScript, JavaServer, JavaServer Pages, JMX, JRE, JSP, JVM, MySQL, NetBeans, OpenSolaris, SunSolve,
Sun GlassFish,  Java und Solaris sind Marken oder eingetragene Marken von Sun Microsystems,
Inc. oder Tochterunternehmen, in den USA und in anderen L&#228;ndern. S&#228;mtliche SPARC-Marken
werden unter Lizenz verwendet und sind Marken oder eingetragene Marken von SPARC
International Inc. in den Vereinigten Staaten und anderen L&#228;ndern. Produkte mit der
SPARC-Marke basieren auf einer von Sun Microsystems Inc. entwickelten Architektur. </p><p>Die grafischen
Benutzeroberfl&#228;chen von OPEN LOOK und Sun<sup>TM</sup> wurden von Sun Microsystems Inc. f&#252;r
seine Benutzer und Lizenznehmer entwickelt. Sun erkennt die Pionierleistung von Xerox bei
der Ausarbeitung und Entwicklung des Konzepts von visuellen oder grafischen Benutzeroberfl&#228;chen f&#252;r
die Computerindustrie an. Sun ist Inhaber einer einfachen Lizenz von Xerox f&#252;r
die Xerox Graphical User Interface (grafische Benutzeroberfl&#228;che von Xerox). Mit dieser Lizenz
werden auch die Sun-Lizenznehmer abgedeckt, die grafische OPEN LOOK-Benutzeroberfl&#228;chen implementieren und sich
ansonsten an die schriftlichen Sun-Lizenzvereinbarungen halten.</p><p>Produkte, die in dieser Ver&#246;ffentlichung beschrieben sind,
und die in diesem Handbuch enthaltenen Informationen unterliegen den Gesetzen der US-Exportkontrolle
und k&#246;nnen den Export- oder Importgesetzen anderer L&#228;nder unterliegen. Die Verwendung im
Zusammenhang mit Nuklear-, Raketen-, chemischen und biologischen Waffen, im nuklear-maritimen Bereich oder
durch in diesem Bereich t&#228;tige Endbenutzer, direkt oder indirekt, ist strengstens untersagt.
Der Export oder R&#252;ckexport in L&#228;nder, die einem US-Embargo unterliegen, oder an
Personen und K&#246;rperschaften, die auf der US-Exportausschlussliste stehen, einschlie&#223;lich (jedoch nicht beschr&#228;nkt
auf) der Liste nicht zul&#228;ssiger Personen und speziell ausgewiesener Staatsangeh&#246;riger, ist strengstens
untersagt.</p><p>DIE DOKUMENTATION WIRD &#8220;AS IS&#8221; BEREITGESTELLT, UND JEGLICHE AUSDR&#220;CKLICHE ODER IMPLIZITE BEDINGUNGEN,
DARSTELLUNGEN UND HAFTUNG, EINSCHLIESSLICH JEGLICHER STILLSCHWEIGENDER HAFTUNG F&#220;R MARKTF&#196;HIGKEIT, EIGNUNG F&#220;R EINEN
BESTIMMTEN ZWECK ODER NICHT&#220;BERTRETUNG WERDEN IM GESETZLICH ZUL&#196;SSIGEN RAHMEN AUSDR&#220;CKLICH AUSGESCHLOSSEN.</p><p></p><p>Sun Microsystems,
Inc. d&#233;tient les droits de propri&#233;t&#233; intellectuelle relatifs &#224; la technologie incorpor&#233;e dans le
produit qui est d&#233;crit dans ce document. En particulier, et ce sans limitation, ces
droits de propri&#233;t&#233; intellectuelle peuvent inclure un ou plusieurs brevets am&#233;ricains ou des applications de
brevet en attente aux Etats-Unis et dans d'autres pays.</p><p>Cette distribution peut comprendre des
composants d&#233;velopp&#233;s par des tierces personnes.</p><p>Certaines composants de ce produit peuvent &#234;tre d&#233;riv&#233;es du
logiciel Berkeley BSD, licenci&#233;s par l'Universit&#233; de Californie. UNIX est une marque d&#233;pos&#233;e aux
Etats-Unis et dans d'autres pays; elle est licenci&#233;e exclusivement par X/Open Company, Ltd. </p><p>Sun,
Sun Microsystems, le logo Sun, le logo Solaris, le logo Java Coffee Cup,
docs.sun.com,  Enterprise JavaBeans, EJB, GlassFish, J2EE, J2SE, Java Benennungs- und Verzeichnis-Schnittstelle, JavaBeans,
Javadoc, JDBC, JDK, JavaScript, JavaServer, JavaServer Pages, JMX, JRE, JSP, JVM, MySQL,
NetBeans, OpenSolaris, SunSolve, Sun GlassFish,   Java et Solaris sont des marques de fabrique
ou des marques d&#233;pos&#233;es de Sun Microsystems, Inc., ou ses filiales, aux Etats-Unis
et dans d'autres pays. Toutes les marques SPARC sont utilis&#233;es sous licence et sont
des marques de fabrique ou des marques d&#233;pos&#233;es de SPARC International, Inc. aux Etats-Unis et
dans d'autres pays. Les produits portant les marques SPARC sont bas&#233;s sur une architecture d&#233;velopp&#233;e
par Sun Microsystems, Inc.</p><p>L'interface d'utilisation graphique OPEN LOOK et Sun a &#233;t&#233; d&#233;velopp&#233;e par
Sun Microsystems, Inc. pour ses utilisateurs et licenci&#233;s. Sun reconna&#238;t les efforts de pionniers
de Xerox pour la recherche et le d&#233;veloppement du concept des interfaces d'utilisation visuelle ou graphique
pour l'industrie de l'informatique. Sun d&#233;tient une licence non exclusive de Xerox sur l'interface
d'utilisation graphique Xerox, cette licence couvrant &#233;galement les licenci&#233;s de Sun qui mettent en
place l'interface d'utilisation graphique OPEN LOOK et qui, en outre, se conforment aux licences
&#233;crites de Sun.</p><p>Les produits qui font l'objet de cette publication et les informations
qu'il contient sont r&#233;gis par la legislation am&#233;ricaine en mati&#232;re de contr&#244;le des
exportations et peuvent &#234;tre soumis au droit d'autres pays dans le domaine des
exportations et importations. Les utilisations finales, ou utilisateurs finaux, pour des armes nucl&#233;aires,
des missiles, des armes chimiques ou biologiques ou pour le nucl&#233;aire maritime, directement
ou indirectement, sont strictement interdites. Les exportations ou r&#233;exportations vers des pays sous embargo
des Etats-Unis, ou vers des entit&#233;s figurant sur les listes d'exclusion d'exportation am&#233;ricaines,
y compris, mais de mani&#232;re non exclusive, la liste de personnes qui font
objet d'un ordre de ne pas participer, d'une fa&#231;on directe ou indirecte, aux exportations
des produits ou des services qui sont r&#233;gis par la legislation am&#233;ricaine en mati&#232;re
de contr&#244;le des exportations et la liste de ressortissants sp&#233;cifiquement design&#233;s, sont rigoureusement interdites.</p><p>LA DOCUMENTATION
EST FOURNIE "EN L'ETAT" ET TOUTES AUTRES CONDITIONS, DECLARATIONS ET GARANTIES EXPRESSES OU
TACITES SONT FORMELLEMENT EXCLUES, DANS LA MESURE AUTORISEE PAR LA LOI APPLICABLE, Y
COMPRIS NOTAMMENT TOUTE GARANTIE IMPLICITE RELATIVE A LA QUALITE MARCHANDE, A L'APTITUDE A
UNE UTILISATION PARTICULIERE OU A L'ABSENCE DE CONTREFACON. </p>
