<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Registerkarte "Erweiterte Attribute des Verbindungspools bearbeiten" - Online-Hilfe f&#252;r Sun GlassFish Enterprise Server v3 Prelude Administration Console
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>

</head>

<body class="HlpBdy">

<a name="gentextid-4098"></a><h4><a name="ref-jdbcconnpooladvanceattrtab"></a>Registerkarte "Erweiterte Attribute des Verbindungspools bearbeiten"</h4>
<p>Um Verbindungslecks leichter diagnostizieren zu k&#246;nnen und die Verwendung zu vereinfachen, werden
erweiterte Attribute zur Verf&#252;gung gestellt, um einen Verbindungspool bei der Erstellung zu
konfigurieren.</p><dl><dt>Name</dt>
<dd><p>Ein schreibgesch&#252;tztes Feld, das den Namen des Verbindungspools angibt.</p></dd>
<dt>Statement Timeout</dt>
<dd><p>Die Zeit&#252;berschreitung in Sekunden, nach der abnormal lang ausgef&#252;hrte Abfragen beendet werden.Enterprise Server legt f&#252;r die erstellten Anweisungen "QueryTimeout" fest. Der Standardwert lautet -1 und impliziert, dass das Attribut nicht aktiviert ist.</p></dd>
<dt>JDBC-Objekte umbrechen</dt>
<dd><p>Wenn dieses Feld auf "True" eingestellt wird, erhalten Anwendungen umgebrochene JDBC-Objekte f&#252;r <tt>Statement</tt>, <tt>PreparedStatement</tt>, <tt>CallableStatement</tt>, <tt>ResultSet</tt>, <tt>DatabaseMetaData</tt>. Der Standardwert lautet "False".</p></dd>
<dt>H&#246;chstens einmal &#252;berpr&#252;fen</dt>
<dd><p>Die Zeitspanne in Sekunden, nach der eine Verbindung mindestens einmal &#252;berpr&#252;ft wird. Durch diese Einstellung wird die Anzahl der &#220;berpr&#252;fngsanforderungen einer Verbindung reduziert. Der Standardwert 0 impliziert, dass die Verbindungs&#252;berpr&#252;fung nicht aktiviert ist.</p></dd>
<dt>Leak Timeout</dt>
<dd><p>Die Zeitspanne in Sekunden zur Verfolgung von Verbindungslecks in einem Verbindungspool. Der Standardwert 0 impliziert, dass die Verfolgung von Verbindungslecks deaktiviert ist. Wenn die Verfolgung von Verbindungslecks aktiviert ist, k&#246;nnnen Sie auf der Registerkarte "Ressourcen &#252;berwachen" statistische Daten zur Anzahl der Verbindungslecks abrufen. Wechseln Sie zur Anzeige dieser Registerkarte zu "Anwendungsserver -&gt;&#220;berwachung -&gt; Ressourcen".</p></dd>
<dt>Leck zur&#252;ckfordern</dt>
<dd><p>Bei Aktivierung dieser Option werden die Verbindungen mit Leck zum Pool wiederhergestellt, nachdem die Verfolgung von Verbindungslecks abgeschlossen wurde.</p></dd>
<dt>Herstellungs-Neuversuche</dt>
<dd><p>Die Anzahl der Neuversuche, wenn bei der Erstellung einer neuen Verbindung ein Fehler aufgetreten ist. Der Standardwert 0 impliziert, dass keine Neuversuche zur Verbindungsherstellung unternommen werden.</p></dd>
<dt>Wiederholungsintervall</dt>
<dd><p>Das Intervall (in Sekunden) zwischen zwei Versuchen zur Erstellung einer Verbindung. Der Standardwert betr&#228;gt 10 Sekunden. Dieses Attribut wird nur verwendet, wenn der Wert von "Creation Retry Attempts" h&#246;her als 0 liegt.</p></dd>
<dt>Tr&#228;ge Assoziation</dt>
<dd><p>Bei Aktivierung dieser Option werden die Verbindungen lose verkn&#252;pft, wenn eine Operation f&#252;r sie durchgef&#252;hrt wird. Die Verkn&#252;pfung wird dar&#252;ber hinaus wieder aufgehoben, wenn die Transaktion abgeschlossen ist und eine Komponentenmethode beendet wird. Auf diese Weise wird die Wiederverwendung der physischen Verbindungen gef&#246;rdert. Der Standardwert ist deaktiviert.</p></dd>
<dt>Inanspruchnahme tr&#228;ger Verbindungen</dt>
<dd><p>Bei Aktivierung dieser Option wird eine Ressource f&#252;r die Transaktion nur aufgef&#252;hrt, wenn sie tats&#228;chlich in einer Methode verwendet wird.</p></dd>
<dt>Mit Thread verkn&#252;pfen</dt>
<dd><p>Aktivieren Sie diese Option, um eine Verbindung mit dem Thread zu verkn&#252;pfen. Wenn dieser Thread eine Verbindung ben&#246;tigt, kann er die mit dem Thread verkn&#252;pfte Verbindung verwenden und erzeugt keinen Overhead durch das Abrufen einer Verbindung aus dem Pool. Der Standardwert ist deaktiviert.</p></dd>
<dt>Verbindungen abgleichen</dt>
<dd><p>Bei Aktivierung dieser Option wird die mit dem Pool &#252;bereinstimmende Verbindung ein- bzw. ausgeschaltet. Die Option kann deaktiviert werden, wenn der Administrator wei&#223;, dass die Verbindungen im Pool immer homogen sind und eine aus dem Pool abgerufene Verbindung nicht mit dem Ressourcenadapter abgeglichen werden muss. Der Standardwert ist deaktiviert.</p></dd>
<dt>Max. Verbindungsnutzung</dt>
<dd><p>Die Anzahl der Wiederverwendungen einer Verbindung durch den Pool. Nachdem eine Verbindung so h&#228;ufig wie angegeben wiederverwendet wurde, wird sie geschlossen. Diese Einstellung eignet sich beispielsweise zur Vermeidung von Anweisungslecks. Der Standardwert 0 impliziert, dass das Attribut nicht aktiviert ist.</p></dd>
</dl>
<h5>Verwandte Aufgaben</h5>

<ul><li><p><a href="task-setdbaccess.html">So richten Sie den Datenbankzugriff ein</a></p></li>
<li><p><a href="task-integratejdbcdriver.html">So integrieren Sie einen JDBC-Treiber</a></p></li>
<li><p><a href="task-jdbcresourcenew.html">So erstellen Sie eine JDBC-Ressource</a></p></li>
<li><p><a href="task-jdbcresourcesedit.html">So bearbeiten Sie eine JDBC-Ressource</a></p></li>
<li><p><a href="task-jdbcresourcesdelete.html">So l&#246;schen Sie eine JDBC-Ressource</a></p></li>
<li><p><a href="task-jdbcconnectionpoolnew.html">So erstellen Sie einen JDBC-Verbindungspool</a></p></li>
<li><p><a href="task-jdbcconnectionpooledit.html">So bearbeiten Sie die allgemeinen JDBC-Verbindungspooleinstellungen</a></p></li>
<li><p><a href="task-jdbcconnectionpooladvance.html">So bearbeiten Sie die erweiterten Attribute eines JDBC-Verbindungspools</a></p></li>
<li><p><a href="task-verifyconnpoolsettings.html">So &#252;berpr&#252;fen Sie die Verbindungspooleinstellungen</a></p></li>
<li><p><a href="task-jdbcconnectionpoolproperty.html">So bearbeiten Sie die JDBC-Verbindungspooleigenschaften</a></p></li>
<li><p><a href="task-jdbcconnectionpooldelete.html">So l&#246;schen Sie einen JDBC-Verbindungspool</a></p></li></ul>
<h5>Verwandte <tt>asadmin</tt>-Befehle</h5>

<ul><li><p><a href="http://docs.sun.com/doc/820-4497/add-resources-1?a=view"><tt>add-resources</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/create-jdbc-resource-1?a=view"><tt>create-jdbc-resource</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/delete-jdbc-resource-1?a=view"><tt>delete-jdbc-resource</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/list-jdbc-resources-1?a=view"><tt>list-jdbc-resources</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/create-jdbc-connection-pool-1?a=view"><tt>create-jdbc-connection-pool</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/delete-jdbc-connection-pool-1?a=view"><tt>delete-jdbc-connection-pool</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/list-jdbc-connection-pools-1?a=view"><tt>list-jdbc-connection-pools</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/ping-connection-pool-1?a=view"><tt>ping-connection-pool</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/start-database-1?a=view"><tt>start-database</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/stop-database-1?a=view"><tt>stop-database</tt>(1)</a></p></li></ul>

<br/>

</body>
</html>
