<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Registerkarte "HTTP-Zielger&#228;t bearbeiten" - Online-Hilfe f&#252;r Sun GlassFish Enterprise Server v3 Prelude Administration Console
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>

</head>

<body class="HlpBdy">

<a name="httplisteneredittab"></a><h4>Registerkarte "HTTP-Zielger&#228;t bearbeiten"</h4>
<p>Durch Bearbeiten des HTTP-Zielger&#228;t-Sockets wird Enterprise Server eine schnellere Bearbeitung von HTTP-Anforderungen
erm&#246;glicht.</p><dl><dt>Name</dt>
<dd><p>Eine schreibgesch&#252;tzte eindeutige ID f&#252;r das Zielger&#228;t.</p></dd>
<dt>Zielger&#228;t</dt>
<dd><p>Geben Sie eine g&#252;ltige IP-Adresse f&#252;r den Server ein. </p></dd>
<dt>Sicherheit</dt>
<dd><p>Verf&#252;gbar in Cluster- und Enterprise-Profilen. Erstellt ein sicheres Zielger&#228;t.</p></dd>
<dt>Netzwerkadresse</dt>
<dd><p>Geben Sie den Wert 0.0.0.0 f&#252;r die Netzwerkadresse ein, wenn das Zielger&#228;t unter Verwendung einer eindeutigen Port-Nummer alle IP-Adressen des Servers &#252;berwachen soll.</p></dd>
<dt>Zielger&#228;tport</dt>
<dd><p>Ein eindeutiger Zielger&#228;tportwert, wenn im Feld "Netzwerkadresse" der Wert 0.0.0.0 angegeben wurde, bzw. der gew&#252;nschte Portwert, wenn Sie eine andere IP-Adresse verwenden.</p></dd>
<dt>Standardm&#228;&#223;iger virtueller Server</dt>
<dd><p>W&#228;hlen Sie einen virtuellen Server aus der Dropdown-Liste.</p></dd>
<dt>Servername</dt>
<dd><p>Der Hostname, der in den URLs verwendet werden soll, die der Server an den Client sendet Dieser Name ist der Aliasname, falls Ihr Server einen Alias verwendet. Wenn Ihr Server keinen Alias verwendet, lassen Sie dieses Feld leer.</p></dd>
<dt>Port umleiten</dt>
<dd><p>Geben Sie einen Portwert ein, um die Anforderung an einen anderen Port umzuleiten. Enterprise Server leitet Anforderungen automatisch weiter, wenn die folgenden zwei Bedingungen erf&#252;llt sind:</p>
<ul><li><p>Der Listener unterst&#252;tzt Nicht-SSL-Anforderungen.</p></li>
<li><p>Es wird eine Anforderung empfangen, f&#252;r die eine &#252;bereinstimmende Sicherheitsbeschr&#228;nkung einen SSL-Transport erfordert.</p><p>Per Voreinstellung verwendet Enterprise Server die Portnummer, die in der urspr&#252;nglichen Anforderung angegeben ist.</p></li></ul>
</dd>
<dt>Annahmethreads</dt>
<dd><p>Die Anzahl der Annahmethreads. Der Standardwert lautet 1.</p></dd>
<dt>Versorgung durch</dt>
<dd><p>Deaktivieren Sie das Kontrollk&#228;stchen, um den Einschluss des <tt>X-Powered-By: Servlet/2.4</tt>-Headers in Servlet-erzeugten HTTP-Antwortheadern zu deaktivieren.</p><p>Die Java Servlet 2.4-Spezifikation definiert diesen Header, den Container in Servlet-erzeugte Antworten einf&#252;gen k&#246;nnen. &#196;hnlich definiert die JavaServer Pages 2.0-Spezifikation (JSP) einen <tt>X-Powered-By: JSP/2.0</tt>-Header, der (optional) in Antworten verwendet werden kann, die die JSP-Technologie nutzen. Der Einschluss des <tt>X-Powered-By: JSP/2.0</tt>-Headers wird f&#252;r Webanwendungen standardm&#228;&#223;ig aktiviert. Ziel dieser Header ist, Websiteadministratoren bei der Erfassung statistischer Daten zur Verwendung der Servlet- und JSP-Technologie zu unterst&#252;tzen. </p><p>Informationen zum Aktivieren und Deaktivieren des <tt>X-Powered-By</tt>-Headers f&#252;r JSP-Seiten finden Sie in <a href="http://docs.sun.com/doc/820-4502/beaqi?a=view">Anhang A, <i>Deployment Descriptor Files</i> in <i>Sun GlassFish Enterprise Server v3 Prelude Application Deployment Guide</i></a>. </p><p>In Produktionsumgebungen ist der Verzicht auf die Erzeugung von <tt>X-Powered-By</tt>-Headern m&#246;glicherweise w&#252;nschenswert, um die zugrunde liegende Technologie nicht offenzulegen.</p></dd>
<dt>Blockung</dt>
<dd><p>Aktiviert die Blockung f&#252;r Zielger&#228;te und externe Ports.</p></dd>
<dt>Weitere Eigenschaften</dt>
<dd><p>F&#252;gen Sie Eigenschaften f&#252;r das Zielger&#228;t hinzu.</p></dd>
</dl>
<h5>Verwandte Aufgaben</h5>

<ul><li><p><a href="task-httplistenerssl.html">So konfigurieren Sie ein HTTP-Zielger&#228;t f&#252;r die Verwendung von SSL</a></p></li>
<li><p><a href="task-httplistenerdelete.html">So l&#246;schen Sie einen HTTP-Listener</a></p></li></ul>
<h5>Verwandte <tt>asadmin</tt>-Befehle</h5>

<ul><li><p><a href="http://docs.sun.com/doc/820-4497/create-http-listener-1?a=view"><tt>create-http-listener</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-4497/delete-http-listener-1?a=view"><tt>delete-http-listener</tt>(1)</a></p></li></ul>

<br/>

</body>
</html>
