<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-serverinstappsconfig"></a><h4>Anwendungskonfiguration</h4>
<a name="indexterm-24"></a><a name="indexterm-25"></a><a name="indexterm-26"></a><a name="indexterm-27"></a><p>Auf dieser Seite k&#246;nnen Sie die Eigenschaften f&#252;r die Anwendungskonfiguration festlegen, um
sicherzustellen, dass &#196;nderungen an bereitgestellten Anwendungen ermittelt und die ge&#228;nderten Klassen neu
geladen werden.</p><p>Die Seite Applications Configuration (Anwendungskonfiguration) umfasst die folgenden Optionen.</p><dl><dt>Reload (Neu laden)</dt>
<dd><p>Wenn diese Option aktiviert ist, werden ge&#228;nderte Klassen dynamisch neu geladen. Der Server pr&#252;ft das Bereitstellungsverzeichnis regelm&#228;&#223;ig auf &#196;nderungen und stellt die Anwendung automatisch und dynamisch, einschlie&#223;lich der &#196;nderungen, erneut bereit. Diese Funktion ist besonders in einer Entwicklungsumgebung sehr n&#252;tzlich, da Code&#228;nderungen schnell getestet werden k&#246;nnen. In einer Produktionsumgebung hingegen kann das dynamische erneute Laden zu einer Beeintr&#228;chtigung der Leistung f&#252;hren. Dar&#252;ber hinaus werden bei jedem erneuten Laden die Sitzungen ung&#252;ltig, die zum Zeitpunkt des Ladevorgangs bestehen. Der Client muss die Sitzung neu starten. Diese Option ist standardm&#228;&#223;ig aktiviert.</p></dd>
<dt>Reload Poll Interval (Intervall f&#252;r Neuladen des Abrufs)</dt>
<dd><p>Legt fest, wie h&#228;ufig der Server bereitgestellte Anwendungen und Module auf Code-&#196;nderungen &#252;berpr&#252;fen soll. Der Standardwert ist 2.</p></dd>
<dt>Admin Session Timeout (Zeit&#252;berschreitung Admin-Sitzung)</dt>
<dd><p>Gibt in Minuten die Dauer der Inaktivit&#228;t an, bevor Administration Console eine Zeit&#252;berschreitung erf&#228;hrt und Sie sich erneut anmelden m&#252;ssen. Der Standardwert ist 60.</p></dd>
<dt>Auto Deploy (Automatisch bereitstellen)</dt>
<dd><p>Wenn Sie diese Option aktivieren, werden die Anwendungen im Verzeichnis f&#252;r automatische Bereitstellung automatisch bereitgestellt. Diese Option ist standardm&#228;&#223;ig aktiviert.</p></dd>
<dt>Auto Deploy Poll Interval (Abrufintervall f&#252;r automatische Bereitstellung)</dt>
<dd><p>Legt fest, wie h&#228;ufig der Server das Verzeichnis f&#252;r automatische Bereitstellung auf Anwendungs- oder Modul&#228;nderungen &#252;berpr&#252;fen soll. Das &#196;ndern des Abrufintervalls hat keine Auswirkungen auf die Bereitstellungszeit von Anwendungen oder Modulen. Der Standardwert ist 2.</p></dd>
<dt>Auto Deploy Retry Timeout (Zeit&#252;berschreitung f&#252;r Wiederholungen der automatischen Bereitstellung)</dt>
<dd><p>Gibt in Sekunden an, wie lange die Gr&#246;&#223;e einer teilweise kopierten Datei unver&#228;ndert bleiben kann, bevor ein Fehler auftritt. Der Standardwert ist 4.</p><p>Wenn eine Datei langsam in ein Verzeichnis f&#252;r automatische Bereitstellung kopiert wird, kann die Datei angezeigt werden, bevor die gesamte Datei kopiert ist. Folglich schl&#228;gt der Versuch, die Anwendung automatisch bereitzustellen, fehl. Wenn ein Versuch eine Anwendung automatisch bereitzustellen aus diesem Grund fehlschl&#228;gt, versucht Enterprise Server die Anwendung erneut bereitzustellen. Wenn die Gr&#246;&#223;e der teilweise kopierten Datei f&#252;r die angegebene Zeitdauer unver&#228;ndert bleibt, tritt ein Fehler auf.</p></dd>
<dt>Auto Deploy Directory (Verzeichnis f&#252;r automatische Bereitstellung)</dt>
<dd><p>Gibt das Verzeichnis an, das f&#252;r die automatische Bereitstellung von Anwendungen &#252;berwacht wird. Der Standardwert ist <tt></tt><i>domain-dir</i><tt>/autodeploy</tt>.</p></dd>
<dt>XML-Validierung</dt>
<dd><p>Legt den Typ der XML-Validierung fest, der bei Standard und Enterprise Server Bereitstellungsbeschreibungen ausgef&#252;hrt werden soll. Der Typ kann einen der folgenden Werte annehmen:</p><dl><dt>Vollst&#228;ndig</dt>
<dd><p>Wenn die XML-Validierung fehlschl&#228;gt, schl&#228;gt die Bereitstellung fehl. Dies ist der Standardwert.</p></dd>
<dt>Parsing</dt>
<dd><p>Fehler bei der XML-Validierung werden protokolliert, die Bereitstellung wird jedoch durchgef&#252;hrt.</p></dd>
<dt>Keine</dt>
<dd><p>Es wird keine XML-Validierung durchgef&#252;hrt.</p></dd>
</dl>
</dd>
<dt>Verifier</dt>
<dd><p>Wenn Sie diese Option aktivieren, wird der Verifier vor der automatischen Bereitstellung ausgef&#252;hrt. Wenn die Verifizierung fehlschl&#228;gt, wird die Bereitstellung nicht ausgef&#252;hrt. Der Verifier &#252;berpr&#252;ft Struktur und Inhalt der Datei. Die &#220;berpr&#252;fung von gro&#223;en Anwendungen ist h&#228;ufig sehr zeitaufwendig. Die Option ist standardm&#228;&#223;ig deaktiviert.</p></dd>
<dt>Precompile (Vorkompilieren)</dt>
<dd><p>Wenn Sie diese Option aktivieren, werden JavaServer Pages<sup>TM</sup> (JSP<sup>TM</sup>)-Dateien vorkompiliert. Wenn Sie diese Option deaktivieren, werden die JSP-Dateien beim ersten Zugriff zur Laufzeit kompiliert. Diese Option ist standardm&#228;&#223;ig deaktiviert.</p></dd>
<dt>Additional Properties (Weitere Eigenschaften)</dt>
<dd><p>Zus&#228;tzliche Eigenschaften f&#252;r Anwendungen Der Enterprise Server definiert keine zus&#228;tzlichen Eigenschaften f&#252;r Anwendungen.</p></dd>
</dl>
<h5>Verwandte Aufgaben</h5>

<ul><li><p><a href="task-setadvanceappconfig.html">So f&#252;hren Sie die "Erweiterte Anwendungskonfiguration" durch</a></p></li>
<li><p><a href="task-setadvancedomainattributes.html">So legen Sie die erweiterten Dom&#228;nenattribute fest</a></p></li></ul>

