<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-managefilerealm"></a><h4>Dateibenutzer</h4>
<p>Verwalten Sie Benutzer des <tt>file</tt>-Bereichs &#252;ber die Administration Console. Benutzer und Gruppen
im <tt>file</tt>-Bereich sind in der Schl&#252;sseldatei aufgef&#252;hrt, deren Speicherort durch die Eigenschaft
<tt>file</tt> angegeben wird.</p>
<hr><p><b>Hinweis - </b>Es ist auch m&#246;glich, diese Schritte zum Hinzuf&#252;gen von Benutzern zu einem
Dateibereich (einschlie&#223;lich <tt>admin-realm</tt>) zu verwenden. Setzen Sie einfach den Namen des Zielbereichs
an die Stelle des <tt>file</tt>-Bereichs, auf den in diesem Abschnitt verwiesen wird.</p>
<hr>
<p>Ein Benutzer im Bereich <tt>file</tt> kann zu einer <b>Java-Gruppe</b> geh&#246;ren, einer Benutzerkategorie,
die durch gemeinsame Merkmale klassifiziert ist. So k&#246;nnen Kunden einer eCommerce-Anwendung z.
B. zur Gruppe <tt>CUSTOMER</tt> geh&#246;ren, die Gro&#223;kunden w&#252;rden jedoch der Gruppe <tt>PREFERRED</tt>
angeh&#246;ren. Das Kategorisieren von Benutzern in Gruppen vereinfacht die Zugangssteuerung bei einer
gro&#223;en Benutzeranzahl.</p><p>Nach der Installation von Enterprise Server ist der w&#228;hrend der Installation eingegebene
Administrator zun&#228;chst der einzige Benutzer. Dieser Benutzer ist standardm&#228;&#223;ig Mitglied der Gruppe
<tt>asadmin</tt> im Bereich <tt>admin-realm</tt> und damit berechtigt, &#196;nderungen an Enterprise Server vorzunehmen.
Benutzer, die dieser Gruppe zugewiesen sind, verf&#252;gen &#252;ber Administratorrechte und k&#246;nnen damit
auf das <tt>asadmin</tt>-Tool und die Administration Console zugreifen.</p><p>Die Seite Dateibenutzer enth&#228;lt eine Liste mit Benutzern f&#252;r den ausgew&#228;hlten Bereich.
F&#252;r jeden Benutzer werden die folgenden Informationen zur Verf&#252;gung gestellt:</p><dl><dt>Benutzer-ID</dt>
<dd><p>Der Name des Benutzers.</p></dd>
<dt>Gruppenliste</dt>
<dd><p>Die Gruppen, denen der Benutzer angeh&#246;rt.</p></dd>
</dl>

