<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-configreq-respolicy"></a><h4>Anforderungs- und Antwortrichtlinienkonfigurationen</h4>
<p>Wenn als Authentifizierungsquelle <tt>sender</tt> festgelegt wurde, enth&#228;lt die Meldung einen <tt>wsse:Security</tt>-Header mit
<tt>wsse:UsernameToken</tt> (mit Passwort). Wenn als Authentifizierungsquelle "content" festgelegt wurde, ist der Inhalt
der SOAP-Meldung signiert, und die Meldung enth&#228;lt einen <tt>wsse:Security</tt>-Header; die Meldungstextsignatur wird
als <tt>ds</tt>: <tt>Signature</tt>.</p><p>Wenn als Authentifizierungsempf&#228;nger <tt>before-content</tt> oder <tt>after-content</tt> festgelegt wurde, wird der Inhalt der
SOAP-Meldung verschl&#252;sselt und durch <tt>xend:EncryptedData</tt> ersetzt. Die Meldung enth&#228;lt einen <tt>a wsse:Security</tt>-Header mit
<tt>xenc:EncryptedKey</tt>. <tt>xenc:EncryptedKey</tt> enth&#228;lt den Schl&#252;ssel f&#252;r die Verschl&#252;sselung des SOAP-Meldungstexts. Der Schl&#252;ssel
wird im &#246;ffentlichen Schl&#252;ssel des Empf&#228;ngers verschl&#252;sselt.</p><p>Wenn f&#252;r Authentifizierungsquelle und -empf&#228;nger keine Werte angegeben werden, ist keine Sicherheitsrichtlinie
festgelegt, und die Module f&#252;hren keine Sicherheitsoperationen durch.</p><p>Die folgende Tabelle zeigt Meldungssicherheitsrichtlinien-Konfigurationen und die entsprechenden Meldungssicherheitsoperationen, die von den
WS-Security-SOAP-Meldungssicherheitsanbietern f&#252;r die jeweilige Konfiguration durchgef&#252;hrt werden.</p><a name="gbutq"></a><h6>Tabelle&#160;1 Meldungssicherheitsrichtlinie basierend auf der WS-Security-SOAP-Meldungssicherheitsoperation</h6><table><col width="33%"><col width="33%"><col width="33%"><tr><th align="left" valign="top" scope="column"></th>
<th align="left" valign="top" scope="column"><p>Empf&#228;ngerauthentifizierung <tt>before-content</tt></p></th>
<th align="left" valign="top" scope="column"><p>Empf&#228;ngerauthentifizierung <tt>after-content</tt></p></th>
</tr>
<tr><td align="left" valign="top" scope="row"><p>Authentifizierungsquelle <tt>sender</tt></p></td>
<td colspan="2" align="left" valign="top" scope="row"><p>Der Inhalt der
SOAP-Meldung wird verschl&#252;sselt und durch <tt>xend:EncryptedData</tt> ersetzt. Die Nachricht enth&#228;lt einen a
<tt>wsse:Security</tt>-Header, der einen <tt>wsse:UsernameToken (mit Passwort)</tt> enth&#228;lt und einen <tt>xenc:EncryptedKey</tt>. <tt>xenc:EncryptedKey</tt> enth&#228;lt den Schl&#252;ssel
f&#252;r die Verschl&#252;sselung des SOAP-Meldungstexts. Der Schl&#252;ssel wird im &#246;ffentlichen Schl&#252;ssel des
Empf&#228;ngers verschl&#252;sselt.</p></td>
</tr>
<tr><td align="left" valign="top" scope="row"><p>Authentifizierungsquelle <tt>Inhalt</tt></p></td>
<td align="left" valign="top" scope="row"><p>Der Inhalt der SOAP-Meldung wird verschl&#252;sselt und durch <tt>xend:EncryptedData</tt> ersetzt.
<tt>xenc:EncryptedData</tt> ist signiert. Die Meldung enth&#228;lt einen Header <tt>a wsse:Sicherheit</tt>, der einen <tt>xenc:EncryptedKey</tt>
und eine <tt>ds:Signatur </tt> enth&#228;lt. <tt>xenc:EncryptedKey</tt> enth&#228;lt den Schl&#252;ssel f&#252;r die Verschl&#252;sselung des
SOAP-Meldungstexts. Der Schl&#252;ssel wird im &#246;ffentlichen Schl&#252;ssel des Empf&#228;ngers verschl&#252;sselt.</p></td>
<td align="left" valign="top" scope="row"><p>Der Inhalt der
SOAP-Meldung wird signiert, verschl&#252;sselt und anschlie&#223;end durch <tt>xend:EncryptedData</tt> ersetzt. Die Nachricht enth&#228;lt
einen <tt>wsse:Security</tt>-Header, der einen <tt> xenc:EncryptedKey</tt> und eine <tt>ds:Signature</tt> enth&#228;lt. <tt>xenc:EncryptedKey</tt> enth&#228;lt den
Schl&#252;ssel f&#252;r die Verschl&#252;sselung des SOAP-Meldungstexts. Der Schl&#252;ssel wird im &#246;ffentlichen Schl&#252;ssel
des Empf&#228;ngers verschl&#252;sselt.</p></td>
</tr>
</table>
