<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-logviewer"></a><h4>Protokoll-Viewer</h4>
<a name="indexterm-22"></a><a name="indexterm-23"></a><p>Verwenden Sie die Seite Protokoll-Viewer, um das Server-Protokoll anzuzeigen und die Protokollanzeige
anzupassen.</p><p>Die Seite Protokoll-Viewer ist in drei Bereiche unterteilt:</p>
<ul><li><p>Suchkriterien</p></li>
<li><p>Erweiterte Suche</p></li>
<li><p>Suchergebnisse</p></li></ul>
<p>Der Bereich Suchkriterien enth&#228;lt die folgenden Optionen.</p><dl><dt>Erweiterte Suche</dt>
<dd><p>Wenn Sie auf diesen Link klicken, wird ein Bereich ge&#246;ffnet, in dem Sie weitere Feineinstellungen im Protokoll-Viewer vornehmen k&#246;nnen.</p></dd>
<dt>Zeitstempel</dt>
<dd><p>Im Optionsfeld Neu werden die neuen Nachrichten angezeigt. &#220;ber das Optionsfeld Bestimmter Bereich lassen sich die Felder Von und Bis &#246;ffnen. Auf diese Weise k&#246;nnen Sie Nachrichten anzeigen, die einem bestimmten Zeitraum entstammen.</p><p>F&#252;r den Wert Zeit muss die Syntax folgende Form annehmen (<b>SSS</b> steht f&#252;r Millisekunden):</p><pre><b>hh</b>:<b>mm</b>:<b>ss</b>.<b>SSS</b></pre><p>Beispiel:</p><pre>17:10:00.000</pre><p>Wenn der Wert im Feld "Von" zeitlich hinter dem Wert in "Bis" liegt, wird eine Fehlermeldung angezeigt.</p></dd>
<dt>Protokollebene</dt>
<dd><p>Die f&#252;r den Filtervorgang ausgew&#228;hlte Protokollebene. Per Voreinstellung werden alle im Serverprotokoll enthaltenen Meldungen angezeigt, die der gew&#228;hlten oder einer h&#246;heren Protokollebene zugeordnet sind. Aktivieren Sie das Kontrollk&#228;stchen "Keine weiteren als 'schwerwiegend' eingestuften Meldungen aufnehmen", um nur Meldungen der gew&#228;hlten Protokollebene anzuzeigen.</p><p>Um sicherzustellen, dass die Nachrichten, die Sie anzeigen m&#246;chten, im Serverprotokoll angezeigt werden, stellen Sie zun&#228;chst die geeigneten Protokollebenen auf der Seite Modul-Protokollebenen ein. Siehe <a href="task-eelogginglevels.html">So konfigurieren Sie Protokollebenen</a>.</p><p>Wenn Sie sich f&#252;r eine Filterung von Protokollmeldungen basierend auf der Protokollebene entschieden haben, werden nur Meldungen angezeigt, die den angegebenen Filterkriterien entsprechen. Diese Filterung wirkt sich jedoch nicht darauf aus, welche Meldungen im Serverprotokoll aufgezeichnet werden.</p></dd>
</dl>
<p>Der Bereich Erweiterte Suche enth&#228;lt die folgenden Optionen.</p><dl><dt>Protokollfunktion</dt>
<dd><p>Namespaces der Protokollfunktion zum Filtern nach Modul. Verwenden Sie die Tastenkombination Umschalt+Klick oder Strg+Klick, um mehrere Namespaces auszuw&#228;hlen.</p><p>Die Auswahl eines Namespaces einer h&#246;heren Ebene f&#252;hrt zur Auswahl aller darunter angeordneten Namespaces. Wenn Sie beispielsweise <tt>javax.enterprise.system</tt> ausw&#228;hlen, werden auch die Protokollierfunktionen aller Module unterhalb dieses Namespaces ausgew&#228;hlt: <tt>javax.enterprise.system.core</tt>, <tt>javax.enterprise.system.tools.admin</tt> usw.</p></dd>
<dt>Benutzerdefinierte Protokollfunktion</dt>
<dd><p>Protokollfunktionen, die zu einer bestimmten Anwendung geh&#246;ren, eine pro Zeile.</p><p>Wenn die Anwendung &#252;ber mehrere Module verf&#252;gt, k&#246;nnen Sie einige oder alle dieser Module anzeigen. Angenommen, die Anwendung weist Protokollierfunktionen mit den folgenden Namen auf:</p><pre>com.mycompany.myapp.module1
com.mycompany.myapp.module2
com.mycompany.myapp.module3</pre><p>Um Meldungen aller Module in der Anwendung anzuzeigen, geben Sie <tt>com.mycompany.myapp</tt> ein. Um nur Meldungen von <tt>module2</tt> anzuzeigen, geben Sie <tt>com.mycompany.myapp.module2</tt> ein.</p><p>Wenn Sie eine oder mehrere benutzerdefinierte Protokollfunktionen angeben, werden Meldungen von Enterprise Server-Modulen nur dann angezeigt, wenn Sie sie im Bereich "Protokollfunktion" explizit auff&#252;hren.</p></dd>
<dt>Name-Wert-Paare</dt>
<dd><p>Der Schl&#252;sselname und -wert f&#252;r einen Thread, zum Anzeigen der Ausgabe eines bestimmten Threads. Der Schl&#252;sselname lautet <tt>_ThreadID</tt>. Beispiel:</p><pre>_ThreadID=13</pre><p>Angenommen, <tt>com.mycompany.myapp.module2</tt> wird in verschiedenen Threads ausgef&#252;hrt. Um die Protokollanzeige zu verfeinern und nur die Ausgabe eines Threads anzuzeigen, geben Sie die Protokollfunktion f&#252;r das betreffende Modul im Feld "Benutzerdefinierte Protokollfunktion" ein und geben dann in diesem Feld die Thread-ID an.</p></dd>
<dt>Anzeige</dt>
<dd><p>Die Anzahl der gleichzeitig angezeigten Nachrichten. Als Standardanzeige f&#252;r Nachrichten wird 40 angezeigt. Dar&#252;ber hinaus stehen 100, 250 und 1000 zur Auswahl.</p><p>Um Daten zur Stapelablaufverfolgung anzuzeigen, deaktivieren Sie das Kontrollk&#228;stchen "Sehr lange Meldungen begrenzen". Per Voreinstellung werden in der Anzeige keine Daten zur Stapelablaufverfolgung angezeigt. Um diese einzublenden, klicken Sie auf den Link <tt>(Details)</tt> f&#252;r eine Meldung.</p></dd>
</dl>
<p>Die Tabelle Suchergebnisse zeigt die Nachrichten des Serverprotokolls an.</p><p>F&#252;r jede Nachricht enth&#228;lt die Tabelle Suchergebnisse die folgenden Informationen.</p><dl><dt>Datensatznummer</dt>
<dd><p>Die Nummer der Nachricht im Serverprotokoll. </p></dd>
<dt>Protokollebene</dt>
<dd><p>Die Protokollebene der Nachricht.</p></dd>
<dt>Nachricht</dt>
<dd><p>Der kurze Text der Protokollnachricht. Klicken Sie auf den Link <tt>(Details)</tt>, um eine formatierte Version einer Nachricht anzuzeigen.</p></dd>
<dt>Protokollfunktion</dt>
<dd><p>Das Protokollfunktionsmodul, das die Protokollnachricht generiert hat.</p></dd>
<dt>Zeitstempel</dt>
<dd><p>Datum und Uhrzeit der Erstellung der Protokollnachricht.</p></dd>
<dt>Name/Wertpaare</dt>
<dd><p>Der Name und die ID des Threads der Protokollnachricht.</p></dd>
</dl>
<h5>Verwandte Aufgaben</h5>

<ul><li><p><a href="task-eelogging.html">So konfigurieren Sie allgemeine Protokollierungseinstellungen</a></p></li>
<li><p><a href="task-eelogginglevels.html">So konfigurieren Sie Protokollebenen</a></p></li>
<li><p><a href="task-logviewer.html">So zeigen Sie das Serverprotokoll an</a></p></li></ul>
<h5>Verwandte <tt>asadmin</tt>-Befehle</h5>

<ul><li><p><tt>set-log-level</tt></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/rotate-log-1?a=view"><tt>rotate-log</tt>(1)</a></p></li></ul>

