<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-registrationpage"></a><h4>Produktregistrierung</h4>
<p>Um Ihre Installation von Sun GlassFish<sup>TM</sup>Enterprise Server mit <a href="http://www.sun.com/service/sunconnection/index.jsp">Sun Connection </a>zu registrieren, ben&#246;tigen Sie
ein<a href="https://reg.sun.com/whyregister">Sun-Onlinekonto</a>. Wenn Sie nicht &#252;ber ein Sun-Onlinekonto verf&#252;gen, erm&#246;glicht Enterprise Server die
Erstellung eines Kontos bei der Registrierung.</p><p>Die Seite Product Registration (Produktregistrierung) umfasst die folgenden Optionen.</p><dl><dt>Ich habe bereits ein Sun-Onlinekonto oder ein Sun Delevoper Network(SDN)-Konto.</dt>
<dd><p>W&#228;hlen Sie diese Option aus, wenn Sie bereits &#252;ber ein Konto verf&#252;gen. Wenn Sie diese Option w&#228;hlen, werden folgende Felder angezeigt.</p><dl><dt>Benutzername</dt>
<dd><p>Der Benutzername, den Sie beim Registrieren f&#252;r Ihr Sun-Onlinekonto angegeben haben.</p></dd>
<dt>Passwort</dt>
<dd><p>Das Passwort, das Sie beim Registrieren f&#252;r Ihr Sun-Onlinekonto angegeben haben.</p></dd>
<dt>Proxy-Host</dt>
<dd><p>Der Hostname des Proxy-Servers f&#252;r den Computer, auf dem Enterprise Server ausgef&#252;hrt wird.</p><p>Dieses Feld gilt nur, wenn der Computer, auf dem Enterprise Server ausgef&#252;hrt wird, &#252;ber einen Proxy-Server mit dem Internet verbunden wird.</p></dd>
<dt>Proxy-Port</dt>
<dd><p>Die Port-Nummer des Proxy-Servers f&#252;r den Computer, auf dem Enterprise Server ausgef&#252;hrt wird.</p><p>Dieses Feld gilt nur, wenn der Computer, auf dem Enterprise Server ausgef&#252;hrt wird, &#252;ber einen Proxy-Server mit dem Internet verbunden wird.</p></dd>
</dl>
</dd>
<dt>Ich besitze kein Sun-Onlinekonto. Anmelden.</dt>
<dd><p>W&#228;hlen Sie diese Option aus, wenn Sie nicht &#252;ber ein Konto verf&#252;gen und Ihre Installation von Enterprise Server bei Sun Connection registrieren m&#246;chten. Wenn Sie diese Option w&#228;hlen, werden folgende Felder angezeigt.</p><dl><dt>E-Mail-Adresse</dt>
<dd><p>Ihre E-Mail-Adresse, die als Benutzername f&#252;r Ihr Sun-Onlinekonto verwendet wird.</p></dd>
<dt>Passwort</dt>
<dd><p>Das f&#252;r Ihr Sun-Onlinekonto verwendete Passwort. F&#252;r das Passwort wird die Gro&#223;- und Kleinschreibung beachtet, und es muss 6&#8211;10 Zeichen umfassen.</p></dd>
<dt>Passwort wiederholen</dt>
<dd><p>Sie m&#252;ssen das im Passwortfeld eingegebene Passwort wiederholen.</p></dd>
<dt>Vorname</dt>
<dd><p>Ihr Vorname.</p></dd>
<dt>Familienname</dt>
<dd><p>Ihr Nachname.</p></dd>
<dt>Firma</dt>
<dd><p>Die Firma, f&#252;r die Sie arbeiten (sofern zutreffend).</p></dd>
<dt>Land</dt>
<dd><p>Das Land, in dem sich Ihr Standort befindet.</p></dd>
<dt>Proxy-Host</dt>
<dd><p>Der Hostname des Proxy-Servers f&#252;r den Computer, auf dem Enterprise Server ausgef&#252;hrt wird.</p><p>Dieses Feld gilt nur, wenn der Computer, auf dem Enterprise Server ausgef&#252;hrt wird, &#252;ber einen Proxy-Server mit dem Internet verbunden wird.</p></dd>
<dt>Proxy-Port</dt>
<dd><p>Die Port-Nummer des Proxy-Servers f&#252;r den Computer, auf dem Enterprise Server ausgef&#252;hrt wird.</p><p>Dieses Feld gilt nur, wenn der Computer, auf dem Enterprise Server ausgef&#252;hrt wird, &#252;ber einen Proxy-Server mit dem Internet verbunden wird.</p></dd>
</dl>
</dd>
</dl>
<h5>Verbundene Aufgabe</h5>

<ul><li><p><a href="task-register.html">So registrieren Sie Sun GlassFish Enterprise Server bei Sun Connection</a></p></li></ul>

