<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-messagesecurityproviderconfignew"></a><h4>Neue Anbieter-Konfiguration</h4>
<p>&#220;ber die Seite "Neue Anbieterkonfiguration" k&#246;nnen Sie eine neue Meldungssicherheitsanbieter-Konfiguration erstellen.</p><p>Die Seite "Neue Anbietersicherheitskonfiguration" enth&#228;lt die folgenden Optionen.</p><dl><dt>Anbieter-ID</dt>
<dd><p>Der Name der Meldungssicherheitsanbieter.</p></dd>
<dt>Standardanbieter</dt>
<dd><p>Wenn diese Option ausgew&#228;hlt wird, ist dieser Anbieter der Standardanbieter. Der Standardanbieter wird f&#252;r alle Anwendungen aufgerufen, f&#252;r die kein spezifischer Anbieter angegeben ist. Die Einstellung "Anbietertyp" legt fest, ob es sich um den standardm&#228;&#223;igen Clientanbieter, den standardm&#228;&#223;igen Serveranbieter oder um beide handelt.</p></dd>
<dt>Anbietertyp</dt>
<dd><p>Legt den Anbietertyp fest. Zur Auswahl stehen:</p><dl><dt><tt>Client</tt></dt>
<dd><p>Legt fest, dass der Anbieter der Client-Authentifizierungsanbieter ist.</p></dd>
<dt><tt>Server</tt></dt>
<dd><p>Legt fest, dass der Anbieter der Server-Authentifizierungsanbieter ist.</p></dd>
<dt><tt>Client-Server</tt></dt>
<dd><p>Legt fest, dass der Anbieter sowohl ein Client- als auch ein Server-Authentifizierungsanbieter ist.</p></dd>
</dl>
</dd>
<dt>Class Name (Klassenname)</dt>
<dd><p>Der Name der Java Implementierungsklasse des Anbieters. Client-Authentifizierungsanbieter m&#252;ssen die Schnittstelle <tt>com.sun.enterprise.security.jauth.ClientAuthModule</tt> implementieren. Server-seitige Anbieter m&#252;ssen die Schnittstelle <tt>com.sun.enterprise.security.jauth.ServerAuthModule</tt> implementieren. Client-Server-Anbieter m&#252;ssen beide Schnittstellen implementieren.</p></dd>
<dt>Quelle authentifizieren (f&#252;r Anfragenrichtlinie)</dt>
<dd><p>Der Typ der erforderlichen Authentifizierung f&#252;r die Anfragenrichtlinie. Die Anforderungsrichtlinie legt die Anforderungsverarbeitung f&#252;r den Authentifizierungsanbieter fest. Die Anforderungsrichtlinienfelder sind optional; wenn sie jedoch nicht angegeben werden, authentifiziert der Authentifizierungsanbieter keine Anforderungsmeldungen.</p><p>W&#228;hlen Sie <tt>sender</tt>, um die Absenderauthentifizierung auf Meldungsebene (z. B. Benutzername und Passwort) f&#252;r Anforderungsmeldungen festzulegen. W&#228;hlen Sie <tt>content</tt>, um die Inhaltsauthentifizierung f&#252;r Anforderungsmeldungen (z. B. digitale Signaturen) festzulegen. Lassen Sie das Feld leer, um die Quelle der Anforderungen nicht zu authentifizieren. Standardm&#228;&#223;ig ist kein Authentifizierungstyp ausgew&#228;hlt.</p><p>Eine Beschreibung der Aktionen des SOAP-Meldungssicherheitsempf&#228;ngers finden Sie unter <a href="ref-configreq-respolicy.html">Anforderungs- und Antwortrichtlinienkonfigurationen</a>.</p></dd>
<dt>Empf&#228;nger authentifizieren (f&#252;r Anforderungsrichtlinie)</dt>
<dd><p>Legt fest, ob die Empf&#228;ngerauthentifizierung vor oder nach der inhaltlichen Authentifizierung f&#252;r die angeforderte Richtlinie erfolgt.</p><p>W&#228;hlen Sie <tt>before-content</tt> oder <tt>after-content</tt> aus, um die Authentifizierung des Empf&#228;ngers von Anforderungsmeldungen gegen&#252;ber dem Absender auf Meldungsebene festzulegen (durch XML-Verschl&#252;sselung). Wenn der Wert nicht festgelegt ist, ist der Standard <tt>after-content</tt>. Richtlinien werden in der Reihenfolge des Meldungsabsenders ausgedr&#252;ckt, sodass der Meldungsempf&#228;nger die Meldung bei Auswahl von <tt>after-content</tt> vor der Validierung der Signatur entschl&#252;sselt.</p></dd>
<dt>Quelle authentifizieren (f&#252;r Antwortrichtlinie)</dt>
<dd><p>Der Typ der f&#252;r die Authentifizierung erforderlichen Antwortrichtlinie. Die Antwortrichtlinie legt die Antwortverarbeitung f&#252;r den Authentifizierungsanbieter fest. Die Antwortrichtlinienfelder sind optional. Wenn sie jedoch nicht festgelegt sind, wird keine Authentifizierung auf die Antwort-Meldungen angewendet.</p><p>W&#228;hlen Sie <tt>sender</tt>, um die Absenderauthentifizierung auf Meldungsebene (z. B. Benutzername und Passwort) f&#252;r Antwortmeldungen festzulegen. W&#228;hlen Sie <tt>content</tt>, um die Inhaltsauthentifizierung f&#252;r Antwortmeldungen (z. B. digitale Signaturen) festzulegen. Lassen Sie das Feld leer, um keine Antwortquellen zu authentifizieren. Standardm&#228;&#223;ig ist kein Authentifizierungstyp ausgew&#228;hlt.</p><p>Eine Beschreibung der Aktionen des SOAP-Meldungssicherheitsempf&#228;ngers finden Sie unter <a href="ref-configreq-respolicy.html">Anforderungs- und Antwortrichtlinienkonfigurationen</a>.</p></dd>
<dt>Empf&#228;nger authentifizieren (f&#252;r Antwortrichtlinie)</dt>
<dd><p>Legt fest, ob die Empf&#228;ngerauthentifizierung vor oder nach der Authentifizierung f&#252;r die Antwortrichtlinie erfolgt.</p><p>W&#228;hlen Sie <tt>before-content</tt> oder <tt>after-content</tt>, um eine Anforderung f&#252;r die Authentifizierung des Empf&#228;ngers von Anforderungsmeldungen gegen&#252;ber dem Absender auf Meldungsebene festzulegen (durch XML-Verschl&#252;sselung). Wenn der Wert nicht festgelegt ist, ist der Standard <tt>after-content</tt>. <tt></tt>Richtlinien werden in der Reihenfolge des Meldungsabsenders ausgedr&#252;ckt, sodass der Meldungsempf&#228;nger die Meldung bei Auswahl von after-content vor der Signaturvalidierung entschl&#252;sselt.</p></dd>
<dt>Additional Properties (Weitere Eigenschaften)</dt>
<dd><p>Weitere Eigenschaften f&#252;r die Meldungssicherheitsanbieter-Konfiguration. Eine Beschreibung der weiteren Eigenschaften, die f&#252;r die Anbieterkonfigurationen zur Verf&#252;gung stehen, finden Sie unter <a href="ref-messagesecurityproviderconfigprops.html">Besondere Eigenschaften von Meldungssicherheitsanbieter-Konfigurationen</a>.</p></dd>
</dl>
<h5>Verwandte Aufgaben</h5>

<ul><li><p><a href="task-configmsgsecproviders.html">So konfigurieren Sie Enterprise Server-Funktionen f&#252;r die Verwendung durch Meldungssicherheitsanbieter</a></p></li>
<li><p><a href="task-messagesecurityconfignew.html">So erstellen Sie eine Meldungssicherheitskonfiguration</a></p></li>
<li><p><a href="task-messagesecurityconfigedit.html">So bearbeiten Sie eine Meldungssicherheitskonfiguration</a></p></li>
<li><p><a href="task-messagesecurityconfigdelete.html">So l&#246;schen Sie eine Meldungssicherheitskonfiguration</a></p></li>
<li><p><a href="task-messagesecurityproviderconfignew.html">So erstellen Sie eine Meldungssicherheitsanbieter-Konfiguration</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigedit.html">So bearbeiten Sie eine Konfiguration von Meldungssicherheitsanbietern</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigdelete.html">So l&#246;schen Sie eine Konfiguration des Meldungssicherheitsanbieters</a></p></li>
<li><p><a href="task-enablemesec4appclients.html">So aktivieren Sie die Meldungssicherheit f&#252;r Anwendungs-Clients</a></p></li></ul>
<h5>Verwandte <tt>asadmin</tt>-Befehle</h5>

<ul><li><p><a href="http://docs.sun.com/doc/820-7701/create-message-security-provider-1?a=view"><tt>create-message-security-provider</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/list-message-security-providers-1?a=view"><tt>list-message-security-providers</tt>(1)</a></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/delete-message-security-provider-1?a=view"><tt>delete-message-security-provider</tt>(1)</a></p></li></ul>

