<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html>

<!--

-->

<head>

  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <!-- ident      "%Z%%M% %I%     %E% SMI" -->

  <title>Seite "Anwendungskonfiguration" - Online-Hilfe f&#252;r Sun GlassFish Enterprise Server v3 Prelude Administration Console
  </title>
  <script language="JavaScript1.2">
    linktag = window.parent.frames[0].document.getElementsByTagName('link');
    for (var i = 0; i < linktag.length; i++) {
        if (linktag[i].rel == "stylesheet") {
            var s = "<link rel=" + linktag[i].rel + " type='text/css' href=" + linktag[i].href + " />";
            document.write(s);
        }
    }
  </script>

</head>

<body class="HlpBdy">

<a name="ref-appconfigtab"></a><h4>Seite "Anwendungskonfiguration"</h4>
<p>Auf dieser Seite k&#246;nnen Sie die Eigenschaften f&#252;r die Anwendungskonfiguration festlegen, um
sicherzustellen, dass &#196;nderungen an bereitgestellten Anwendungen ermittelt und die ge&#228;nderten Klassen neu
geladen werden.</p><dl><dt>Neu laden</dt>
<dd><p>Wenn diese Option aktiviert ist, werden ge&#228;nderte Klassen dynamisch neu geladen. Der Server pr&#252;ft das Bereitstellungsverzeichnis regelm&#228;&#223;ig auf &#196;nderungen und stellt die Anwendung automatisch und dynamisch, einschlie&#223;lich der &#196;nderungen, erneut bereit. Diese Funktion ist besonders in einer Entwicklungsumgebung sehr n&#252;tzlich, da Code&#228;nderungen schnell getestet werden k&#246;nnen. In einer Produktionsumgebung hingegen kann das dynamische erneute Laden zu einer Beeintr&#228;chtigung der Leistung f&#252;hren. Dar&#252;ber hinaus werden bei jedem erneuten Laden die Sitzungen ung&#252;ltig, die zum Zeitpunkt des Ladevorgangs bestehen. Der Client muss die Sitzung neu starten.</p></dd>
<dt>Intervall f&#252;r Neuladen des Abrufs</dt>
<dd><p>Gibt an, wie h&#228;ufig der Server bereitgestellte Anwendungen auf &#196;nderungen &#252;berpr&#252;fen soll.</p></dd>
<dt>Zeit&#252;berschreitung Admin-Sitzung</dt>
<dd><p>Gibt in Minuten die Dauer der Inaktivit&#228;t an, bevor Administration Console eine Zeit&#252;berschreitung erf&#228;hrt und Sie sich erneut anmelden m&#252;ssen.</p></dd>
<dt>Automatisch bereitstellen</dt>
<dd><p>Wenn Sie diese Option aktivieren, werden die Anwendungen im Verzeichnis f&#252;r automatische Bereitstellung automatisch bereitgestellt.</p></dd>
<dt>Abrufintervall f&#252;r automatische Bereitstellung</dt>
<dd><p>Gibt an, wie h&#228;ufig der Server das Verzeichnis f&#252;r automatische Bereitstellung auf Anwendungs- oder Modularchive &#252;berpr&#252;fen soll. Das &#196;ndern des Abrufintervalls hat keine Auswirkungen auf die Bereitstellungszeit von Anwendungen oder Modulen.</p></dd>
<dt>Zeit&#252;berschreitung f&#252;r Wiederholungen der automatischen Bereitstellung</dt>
<dd><p>Gibt in Sekunden an, wie lange die Gr&#246;&#223;e einer teilweise kopierten Datei unver&#228;ndert bleiben kann, bevor ein Fehler auftritt. Der Standard ist 30.</p><p>Wenn eine Datei langsam in ein Verzeichnis f&#252;r automatische Bereitstellung kopiert wird, kann die Datei angezeigt werden, bevor die gesamte Datei kopiert ist. Folglich schl&#228;gt der Versuch, die Anwendung automatisch bereitzustellen, fehl. Wenn ein Versuch eine Anwendung automatisch bereitzustellen aus diesem Grund fehlschl&#228;gt, versucht Enterprise Server die Anwendung erneut bereitzustellen. Wenn die Gr&#246;&#223;e der teilweise kopierten Datei f&#252;r die angegebene Zeitdauer unver&#228;ndert bleibt, tritt ein Fehler auf.</p></dd>
<dt>Verzeichnis f&#252;r automatische Bereitstellung</dt>
<dd><p>Gibt das Verzeichnis an, in dem Sie Ihre Anwendung erstellen, sodass Sie die Dateien nicht in das standardm&#228;&#223;ige Verzeichnis f&#252;r automatische Bereitstellung kopieren m&#252;ssen.</p></dd>
<dt>Verifier</dt>
<dd><p>Wenn Sie diese Option aktivieren, wird der Verifier vor der Bereitstellung ausgef&#252;hrt. Der Verifier &#252;berpr&#252;ft Struktur und Inhalt der Datei. Die &#220;berpr&#252;fung gro&#223;er Anwendungen ist h&#228;ufig zeitaufw&#228;ndig.</p></dd>
<dt>Vorkompilieren</dt>
<dd><p>Wenn Sie diese Option aktivieren, werden JavaServer Pages<sup>TM</sup> (JSP<sup>TM</sup>)-Dateien vorkompiliert. Wenn Sie diese Option deaktivieren, werden die JSP-Dateien beim ersten Zugriff zur Laufzeit kompiliert.</p></dd>
<dt>Weitere Eigenschaften</dt>
<dd><p>Gibt zus&#228;tzliche Eigenschaften an.</p></dd>
</dl>

<br/>

</body>
</html>
