<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-editfile-adminrealm"></a><h4>F&#252;r die <tt>FileRealm</tt>-Klasse spezifische Eigenschaften</h4>
<p>F&#252;r einen <tt>file</tt>-Bereich sind die folgenden Eigenschaften erforderlich.</p><dl><dt>JAAS-Kontext</dt>
<dd><p>Der JAAS-(Java-Authentifizierungs- und Autorisierungsdienst)-Kontext (die Kennung f&#252;r das Anmeldemodul, das f&#252;r diesen Bereich zu verwenden ist). Der einzig g&#252;ltige Wert ist <tt>fileRealm</tt>.</p></dd>
<dt>Schl&#252;sseldatei</dt>
<dd><p>Vollst&#228;ndiger Pfad und Name der Datei, in welcher der Server alle Benutzer-, Gruppen- und Passwortinformationen f&#252;r diesen Bereich speichert. Standardwert ist <i>domain-dir</i><tt>/config/keyfile</tt> f&#252;r den <tt>file</tt>-Bereich und <i>domain-dir</i><tt>/config/admin-keyfile</tt> f&#252;r den <tt>admin-realm</tt>-Bereich.</p></dd>
</dl>
<p>Die Schl&#252;sseldatei f&#252;r den <tt>file</tt>-Bereich ist anf&#228;nglich leer, sodass Benutzer auf der
Seite <a href="ref-managefilerealm.html">Dateibenutzer</a> hinzugef&#252;gt werden m&#252;ssen, bevor der Bereich <tt>file</tt> verwendet wird.</p><p>Die Schl&#252;sseldatei f&#252;r den Bereich <tt>admin-realm</tt> enth&#228;lt anf&#228;nglich den Administratorbenutzernamen, das Administratorpasswort
in verschl&#252;sselter Form sowie die Gruppe, zu der dieser Benutzer geh&#246;rt (standardm&#228;&#223;ig
<tt>asadmin</tt>). Weitere Informationen zum Hinzuf&#252;gen von Benutzern zum Bereich <tt>admin-realm</tt> finden Sie
unter <a href="task-accessadmintools.html">So gew&#228;hren Sie Zugriff auf Administrationstools</a>.</p>
<hr><p><b>Hinweis - </b>Benutzer in der Gruppe <tt>asadmin</tt> im Bereich <tt>admin-realm</tt> sind zur Verwendung der
Administration Console und der <tt>asadmin</tt>-Tools berechtigt. F&#252;gen Sie dieser Gruppe nur Benutzer
hinzu, die &#252;ber Administratorrechte f&#252;r den Server verf&#252;gen.</p>
<hr>
<p>Die folgende optionale Eigenschaft ist f&#252;r einen <tt>file</tt>-Bereich verf&#252;gbar. </p><dl><dt>Gruppen zuweisen</dt>
<dd><p>Eine durch Kommata getrennte Liste mit Gruppennamen. Alle Clients, die &#252;ber g&#252;ltige Zertifikate verf&#252;gen, werden diesen Gruppen zugewiesen, zum Beispiel <tt>employee,manager </tt>, wobei dies die Namen von Benutzergruppen sind.</p></dd>
</dl>

