<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-messagesecurityconfigedit"></a><h4>Meldungssicherheitskonfiguration bearbeiten</h4>
<p>Verwenden Sie die Seite "Meldungssicherheitskonfiguration bearbeiten", um Anbieter f&#252;r Meldungssicherheit zu aktivieren.</p><p>Zum Aktivieren der Meldungssicherheit f&#252;r in Enterprise Server bereitgestellte Webdienstendpunkte muss ein
Anbieter als Standardanbieter f&#252;r die Serverseite angegeben werden. Wenn Sie einen Standardanbieter
f&#252;r die Meldungssicherheit aktivieren, m&#252;ssen ebenfalls Anbieter f&#252;r die Clients der in
Enterprise Server bereitgestellten Webdienste aktiviert werden. Informationen zum Aktivieren der Anbieter, die
von Clients verwendet werden, werden in <a href="task-enablemesec4appclients.html">So aktivieren Sie die Meldungssicherheit f&#252;r Anwendungs-Clients</a> diskutiert.</p><p>Zum Aktivieren der Meldungssicherheit f&#252;r Webdienstaufrufe von bereitgestellten Endpunkten muss ein standardm&#228;&#223;iger
Clientanbieter angegeben werden. Wenn ein standardm&#228;&#223;iger Clientanbieter f&#252;r Enterprise Server aktiviert wurde,
muss sichergestellt werden, dass die von in Enterprise Server bereitgestellten Endpunkten aufgerufenen
Dienste f&#252;r Sicherheit auf Meldungsebene konfiguriert sind.</p><p>Die Seite "Neue Meldungssicherheitskonfiguration" enth&#228;lt die folgenden Optionen.</p><dl><dt>Authentifizierungs-Layer</dt>
<dd><p>Die Nachrichtenlayer, in der die Authentifizierung durchgef&#252;hrt wird. Dies ist ein schreibgesch&#252;tztes Feld. Der Wert ist entweder <tt>SOAP</tt> (f&#252;r die Standard-Meldungssicherheitskonfiguration) oder <tt>HttpServlet</tt>.</p></dd>
<dt>Standardanbieter</dt>
<dd><p>Der standardm&#228;&#223;ige Server-seitige Anbieter, falls vorhanden. Der standardm&#228;&#223;ige Serveranbieter, auch Standardanbieter genannt, gibt den Serveranbieter an, der f&#252;r Anwendungen aufgerufen wird, f&#252;r die kein spezifischer Serveranbieter festgelegt ist. Zur Auswahl stehen <tt>Serveranbieter</tt>, <tt>XWS_ServerProvider </tt> oder keine. Standardm&#228;&#223;ig wird kein Anbieter ausgew&#228;hlt, so dass Enterprise Server Server-seitig keinen Meldungssicherheitsanbieter aufruft. W&#228;hlen Sie im Allgemeinen <tt> ServerProvider</tt> als Standardanbieter aus.</p></dd>
<dt>Standard-Clientanbieter</dt>
<dd><p>Der Standard-Clientanbieter, falls vorhanden. Der standardm&#228;&#223;ige Clientanbieter gibt den Clientanbieter an, der f&#252;r Anwendungen aufgerufen wird, f&#252;r die kein spezifischer Clientanbieter festgelegt ist. Zur Auswahl stehen <tt>ClientProvider</tt>, <tt> XWS_ClientProvider</tt> oder keine. Standardm&#228;&#223;ig ist kein Anbieter ausgew&#228;hlt, so dass Enterprise Server Client-seitig keinen Meldungssicherheitsanbieter aufruft. W&#228;hlen Sie im Allgemeinen f&#252;r den Standard-Clientanbieter "keine" aus. W&#228;hlen Sie <tt>ClientProvider</tt>, um einen Standardanbieter und eine Meldungssicherheitsrichtilinie zu aktivieren, die f&#252;r Webdienstaufrufe von in Enterprise Server bereitgestellten Webdienstendpunkten angewendet werden.</p></dd>
</dl>
<h5>Verwandte Aufgaben</h5>

<ul><li><p><a href="task-configmsgsecproviders.html">So konfigurieren Sie Enterprise Server-Funktionen f&#252;r die Verwendung durch Meldungssicherheitsanbieter</a></p></li>
<li><p><a href="task-messagesecurityconfignew.html">So erstellen Sie eine Meldungssicherheitskonfiguration</a></p></li>
<li><p><a href="task-messagesecurityconfigedit.html">So bearbeiten Sie eine Meldungssicherheitskonfiguration</a></p></li>
<li><p><a href="task-messagesecurityconfigdelete.html">So l&#246;schen Sie eine Meldungssicherheitskonfiguration</a></p></li>
<li><p><a href="task-messagesecurityproviderconfignew.html">So erstellen Sie eine Meldungssicherheitsanbieter-Konfiguration</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigedit.html">So bearbeiten Sie eine Konfiguration von Meldungssicherheitsanbietern</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigdelete.html">So l&#246;schen Sie eine Konfiguration des Meldungssicherheitsanbieters</a></p></li>
<li><p><a href="task-enablemesec4appclients.html">So aktivieren Sie die Meldungssicherheit f&#252;r Anwendungs-Clients</a></p></li></ul>
<h5>Verwandte <tt>asadmin</tt>-Befehle</h5>
<p>Verwenden Sie den Befehl <a href="http://docs.sun.com/doc/820-7701/set-1?a=view"><tt>set</tt>(1)</a>, um eine Meldungssicherheitskonfiguration zu &#228;ndern.</p>
<ul><li><p>Zum Festlegen des standardm&#228;&#223;igen Serveranbieters:</p><pre>asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
default_provider=ServerProvider</pre></li>
<li><p>Zum Festlegen des standardm&#228;&#223;igen Clientanbieters:</p><pre>asadmin set --user <i>admin-user</i> --port <i>admin-port</i> 
server-config.security-service.message-security-config.SOAP.
default_client_provider=ClientProvider</pre></li></ul>

