<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-eelogging"></a><h4>Einstellungen Protokollfunktion</h4>
<p>Verwenden Sie die Seite Einstellungen Protokollfunktion, um die Protokollierung f&#252;r Enterprise Server
zu konfigurieren.</p><p>Die Seite Einstellungen Protokollfunktion enth&#228;lt die folgenden Optionen.</p><dl><dt>In Systemprotokoll schreiben</dt>
<dd><p>Wenn diese Option ausgew&#228;hlt wird, wird der Protokolloutput zus&#228;tzlich zum Serverprotokoll an das Dienstprogramm <tt> syslog</tt> gesendet. Diese Funktion ist ausschlie&#223;lich unter den Betriebssystemen Solaris und Linux verf&#252;gbar. Die Option ist standardm&#228;&#223;ig deaktiviert.</p></dd>
<dt>Anmelden bei Konsole</dt>
<dd><p>Dieser Option ist keine Aktion zugeordnet. Die Option ist standardm&#228;&#223;ig deaktiviert.</p></dd>
<dt>Protokolldatei</dt>
<dd><p>Ein alternativer Name oder Ort f&#252;r die Server-Protokolldatei. Der Standardort ist <tt>glassfish/domains/domain1/logs/server.log</tt>.</p></dd>
<dt>Protokoll-Handler</dt>
<dd><p>Der absolute Klassenname eines benutzerdefinierten Protokoll-Handlers. Ein benutzerdefinierter Protokoll-Handler erm&#246;glicht es Ihnen, Protokolle an einen Empf&#228;nger zu senden, der von <tt>server.log </tt> oder <tt>syslog</tt> verschieden ist. Der benutzerdefinierte Handler muss die Klasse <tt>java.util.logging.Handler</tt> erweitern (eine JSR 047-kompatible API). Platzieren Sie die Handler-Klasse im Klassenpfad von Enterprise Server, damit der Handler beim Serversetup installiert wird.</p></dd>
<dt>Begrenzung f&#252;r Dateirotation</dt>
<dd><p>Die Gr&#246;&#223;e in Bytes, die die Server-Protokolldatei erreichen muss, bevor sie rotiert wird. Wenn das Serverprotokoll die angegebene Gr&#246;&#223;e erreicht, wird eine neue, leere Datei mit Namen <tt>server.log</tt> erstellt. Die alte Datei wird in <tt>server.log_</tt><i>Datum</i> umbenannt, wobei <i> Datum</i> das Datum und die Uhrzeit der Rotation angibt. Der Standardwert betr&#228;gt 2 MB. Der Mindestwert f&#252;r diese Einstellung betr&#228;gt 500 KB; wenn Sie einen niedrigeren Wert einstellen, findet die Dateirotation statt, wenn die Protokolldatei eine Gr&#246;&#223;e von 500 KB erreicht. Zur Deaktivierung der Protokolldateirotation setzen Sie den Wert auf 0.</p></dd>
<dt>Zeitlimit f&#252;r Dateirotation</dt>
<dd><p>Die Anzahl der Minuten, nach denen das Serverprotokoll rotiert werden muss. Der Standardwert lautet 0, d. h.: Die Dateirotation wird auf Grundlage der im Feld "Begrenzung f&#252;r Dateirotation" angegebenen Dateigr&#246;&#223;e durchgef&#252;hrt. Wenn Sie eine oder mehrere Minuten festlegen, hat das Zeitlimit Vorrang vor dem Gr&#246;&#223;enlimit, das im Feld Dateirotationslimit festgelegt wurde.</p></dd>
</dl>
<h5>Verwandte Aufgaben</h5>

<ul><li><p><a href="task-eelogging.html">So konfigurieren Sie allgemeine Protokollierungseinstellungen</a></p></li>
<li><p><a href="task-eelogginglevels.html">So konfigurieren Sie Protokollebenen</a></p></li>
<li><p><a href="task-logviewer.html">So zeigen Sie das Serverprotokoll an</a></p></li></ul>
<h5>Verwandte <tt>asadmin</tt>-Befehle</h5>

<ul><li><p><tt>set-log-level</tt></p></li>
<li><p><a href="http://docs.sun.com/doc/820-7701/rotate-log-1?a=view"><tt>rotate-log</tt>(1)</a></p></li></ul>

