<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-ldaprealmprop"></a><h4>F&#252;r die <tt>LDAPRealm</tt>-Klasse spezifische Eigneschaften</h4>
<p>Folgende Eigenschaften sind f&#252;r einen LDAP-Bereich erforderlich.</p><dl><dt>JAAS-Kontext</dt>
<dd><p>Der JAAS-(Java-Authentifizierungs- und Autorisierungsdienst)-Kontext (die Kennung f&#252;r das Anmeldemodul, das f&#252;r diesen Bereich zu verwenden ist). Der einzige g&#252;ltige Wert ist <tt>solarisRealm</tt>.</p></dd>
<dt>Verzeichnis</dt>
<dd><p>Der LDAP-URL f&#252;r Ihren Server.</p></dd>
<dt>Basis-DN</dt>
<dd><p>Der LDAP-Basis-DN (Distinguished Name) f&#252;r den Speicherort von Benutzerdaten. Dieser Basis-DN kann sich auf jeder beliebigen Ebene oberhalb der Benutzerdaten befinden, da eine Suchbaum-Suche durchgef&#252;hrt wird. Je kleiner der Suchbaum, desto besser die Leistung.</p></dd>
</dl>
<p>Die folgende optionale Eigenschaft ist f&#252;r einen LDAP-Bereich verf&#252;gbar. </p><dl><dt>Gruppen zuweisen</dt>
<dd><p>Eine durch Kommata getrennte Liste mit Gruppennamen. Alle Clients, die &#252;ber g&#252;ltige Zertifikate verf&#252;gen, werden diesen Gruppen zugewiesen, zum Beispiel <tt>employee,manager </tt>, wobei dies die Namen von Benutzergruppen sind.</p></dd>
</dl>
<p>Die folgenden weiteren Eigenschaften sind f&#252;r einen LDAP-Bereich erforderlich.</p><dl><dt><tt>search-filter</tt></dt>
<dd><p>Der Suchfilter, der verwendet wird, um den Benutzer zu finden. Der Standard ist <tt> uid=%s</tt> (<tt>%s</tt> erweitert auf den Namen des Gesuchten).</p></dd>
<dt><tt>group-base-dn</tt></dt>
<dd><p>Der Basis-DN f&#252;r den Speicherort von Gruppendaten. Standardm&#228;&#223;ig ist er mit dem Basis-DN-Wert identisch, erforderlichenfalls kann er angepasst werden.</p></dd>
<dt><tt>group-search-filter</tt></dt>
<dd><p>Der Suchfilter, der verwendet wird, um Gruppenzugeh&#246;rigkeiten des Benutzers zu finden. Der Standard ist <tt>uniquemember=%d</tt> (<tt>%d</tt> erweitert auf den Benutzerelement-DN).</p></dd>
<dt><tt>group-target</tt></dt>
<dd><p>Der LDAP-Attributname, der Gruppennamenenintr&#228;ge enth&#228;lt. Der Standardwert lautet <tt>CN</tt>.</p></dd>
<dt><tt>search-bind-dn</tt></dt>
<dd><p>Ein optionaler DN, der zur Authentifizierung gegen&#252;ber dem Verzeichnis verwendet wird, um den <tt>search-filter</tt> aufzurufen. Dies ist nur bei solchen Verzeichnissen erforderlich, die keine anonyme Suche erlauben.</p></dd>
<dt><tt>search-bind-password</tt></dt>
<dd><p>Das LDAP-Passwort f&#252;r den DN, der in <tt>search-bind-dn</tt> angegeben ist.</p></dd>
</dl>

