<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-jmxconnectorssledit"></a><h4>SSL</h4>
<p>Verwenden Sie die SSL-Seite, um die SSL-Einstellungen f&#252;r den JMX-Connector zu &#228;ndern.</p><p>Die Einstellungen auf dieser Seite sind nur dann relevant, wenn die Sicherheit
f&#252;r den JMX-Connector auf der Seite JMX-Connector bearbeiten aktiviert ist.</p><p>Die SSL-Seite enth&#228;lt die folgenden Optionen.</p><dl><dt>SSL3</dt>
<dd><p>Falls dieses Kontrollk&#228;stchen aktiviert ist, wird das SSL3-Protokoll f&#252;r den JMX-Connector aktiviert. Diese Option ist standardm&#228;&#223;ig aktiviert.</p></dd>
<dt>TLS</dt>
<dd><p>Falls dieses Kontrollk&#228;stchen aktiviert ist, wird das TLS-Protokoll f&#252;r den JMX-Connector aktiviert. Diese Option ist standardm&#228;&#223;ig aktiviert.</p></dd>
<dt></dt>
<dt>Client-Authentifizierung</dt>
<dd><p>Falls dieses Kontrollk&#228;stchen aktiviert ist, m&#252;ssen Clients bei jeder Anfrage vom Server identifiziert werden. Die Option ist standardm&#228;&#223;ig deaktiviert.</p></dd>
<dt>Zertifikatspseudonym</dt>
<dd><p>Das Pseudonym des Serverzertifikats in der Zertifikatedatenbank oder dem Token PKCS#11. In dem Zertifikat ist das Namensformat <tt><i> Tokenname</i>:<i>Pseudonym</i></tt>. Auch der Teil <tt><i>Tokenname</i>:</tt> des Namens in diesem Attribut ist optional. Der Standardwert ist <tt>s1as</tt>.</p></dd>
<dt>KeyStore</dt>
<dd><p>Der Name der Keystore-Datei (z. B. <tt>keystore.jks </tt>).</p></dd>
<dt>Trust-Algorithmus</dt>
<dd><p>Der Name des Trust-Management-Algorithmus (z. B. PKIX), der f&#252;r die Validierung des Zertifizierungspfades verwendet werden soll.</p></dd>
<dt>Max. Zertifizierungsl&#228;nge</dt>
<dd><p>Die maximale Anzahl an nicht selbst ausgestellten Zwischenzertifikaten, die in einem Zertifizierungspfad bestehen kann. Dieses Feld wird nur dann verwendet, wenn das Feld Trust-Algorithmus auf PKIX eingestellt ist. Ein Wert von 0 l&#228;sst darauf schlie&#223;en, dass der Pfad nur ein einziges Zertifikat enthalten kann. Ein Wert von -1 l&#228;sst darauf schlie&#223;en, dass die Pfadl&#228;nge nicht beschr&#228;nkt ist (es gibt keinen H&#246;chstwert). Das Einstellen eines Werts, der geringer als -1 ist, f&#252;hrt zu einem Ausnahmefehler. Der Standardwert ist 5.</p></dd>
<dt>Truststore</dt>
<dd><p>Der Name der Truststore-Datei (z. B. <tt>cacerts.jks </tt>).</p></dd>
<dt>Cipher Suites</dt>
<dd><p>Ein Bereich, in dem Sie Cipher Suites hinzuf&#252;gen oder entfernen k&#246;nnen. Wenn Sie keine Cipher Suites hinzuf&#252;gen, werden alle Cipher Suites verwendet.</p></dd>
</dl>
<h5>Verwandte Aufgaben</h5>

<ul><li><p><a href="task-jmxconnectoredit.html">So bearbeiten Sie den JMX-Connector </a></p></li>
<li><p><a href="task-jmxconnectorssledit.html">So bearbeiten Sie die SSL-Einstellungen f&#252;r den JMX Connector</a></p></li></ul>

