<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-messagesecurityconfig"></a><h4>Nachrichtensicherheitskonfigurationen</h4>
<p>Auf der Seite Nachrichtensicherheitskonfigurationen sind die verf&#252;gbaren Konfigurationen f&#252;r Nachrichtensicherheitsanbieter aufgelistet.</p><p>Um Nachrichtensicherheit zu konfigurieren, ben&#246;tigen Sie ein grundlegendes Verst&#228;ndnis von Sicherheits- und
Webservice-Konzepten. Weitere Informationen finden Sie in <a href="http://docs.sun.com/doc/820-7692/ablrk?a=view">Kapitel 13, Administering Message Security in <i>Sun GlassFish Enterprise Server v3 Administration Guide</i></a> und <a href="http://docs.sun.com/doc/820-7692/gbbjk?a=view">Kapitel 6, Administering Web Applications in <i>Sun GlassFish Enterprise Server v3 Administration Guide</i></a>.</p><p>Enterprise Server implementiert die Meldungssicherheit mithilfe von Meldungssicherheitsanbietern, die auf SOAP-Verarbeitungsebene integriert
sind. Die Meldungssicherheitsanbieter h&#228;ngen von den Sicherheitsfunktionen von Enterprise Server ab.</p><p>F&#252;r jede Konfiguration enth&#228;lt die Seite Nachrichtensicherheitskonfigurationen die folgenden Informationen.</p><dl><dt>Authentifizierungs-Layer</dt>
<dd><p>Die Nachrichtenlayer, in der Authentifizierung durchgef&#252;hrt wird. Standardm&#228;&#223;ig wird eine SOAP-Konfiguration bereitgestellt. Es ist dar&#252;ber hinaus m&#246;glich, eine HttpServlet-Konfiguration bereitzustellen.</p></dd>
<dt>Standardanbieter</dt>
<dd><p>Der Standard-Serveranbieter f&#252;r diese Konfiguration. Standardm&#228;&#223;ig ist kein Serveranbieter konfiguriert.</p></dd>
<dt>Standard-Clientanbieter</dt>
<dd><p>Der Standard-Clientanbieter f&#252;r diese Konfiguration. Standardm&#228;&#223;ig ist kein Standard-Clientanbieter konfiguriert.</p></dd>
</dl>
<h5>Verwandte Aufgaben</h5>

<ul><li><p><a href="task-configmsgsecproviders.html">So konfigurieren Sie Enterprise Server-Funktionen f&#252;r die Verwendung durch Meldungssicherheitsanbieter</a></p></li>
<li><p><a href="task-messagesecurityconfignew.html">So erstellen Sie eine Meldungssicherheitskonfiguration</a></p></li>
<li><p><a href="task-messagesecurityconfigedit.html">So bearbeiten Sie eine Meldungssicherheitskonfiguration</a></p></li>
<li><p><a href="task-messagesecurityconfigdelete.html">So l&#246;schen Sie eine Meldungssicherheitskonfiguration</a></p></li>
<li><p><a href="task-messagesecurityproviderconfignew.html">So erstellen Sie eine Meldungssicherheitsanbieter-Konfiguration</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigedit.html">So bearbeiten Sie eine Konfiguration von Meldungssicherheitsanbietern</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigdelete.html">So l&#246;schen Sie eine Konfiguration des Meldungssicherheitsanbieters</a></p></li>
<li><p><a href="task-enablemesec4appclients.html">So aktivieren Sie die Meldungssicherheit f&#252;r Anwendungs-Clients</a></p></li></ul>
<h5>Verwandte <tt>asadmin</tt>-Befehle</h5>
<p>Keine.</p>
