<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->
<a name="ref-messagesecurityconfignew"></a><h4>Neue Meldungssicherheitskonfiguration</h4>
<p>&#220;ber die Seite "Neue Meldungssicherheitskonfiguration" k&#246;nnen Sie eine HttpServlet-Konfiguration f&#252;r Meldungssicherheit erstellen.</p><p>Die Seite "Neue Meldungssicherheitskonfiguration" enth&#228;lt die folgenden Optionen.</p><dl><dt>Authentifizierungs-Layer</dt>
<dd><p>Legt die Meldungslayer fest, in der die Authentifizierung durchgef&#252;hrt wird. Der Wert muss <tt>SOAP</tt> oder <tt>HttpServlet</tt> sein. Da eine SOAP-Konfiguration standardm&#228;&#223;ig zur Verf&#252;gung steht, lautet die einzige Auswahl <tt> HttpServlet</tt>.</p></dd>
<dt>Anbieter-ID</dt>
<dd><p>Der eindeutige Identifizierer der Anbieterkonfiguration f&#252;r diese Meldungssicherheitskonfiguration.</p></dd>
<dt>Standardanbieter</dt>
<dd><p>Wenn diese Option ausgew&#228;hlt wird, ist dieser Anbieter der Standardanbieter. Der Standardanbieter wird f&#252;r alle Anwendungen aufgerufen, f&#252;r die kein spezifischer Anbieter angegeben ist. Die Einstellung "Anbietertyp" legt fest, ob es sich um den standardm&#228;&#223;igen Clientanbieter, den standardm&#228;&#223;igen Serveranbieter oder um beide handelt.</p></dd>
<dt>Anbietertyp</dt>
<dd><p>Legt den Anbietertyp fest. Zur Auswahl stehen:</p><dl><dt><tt>Client</tt></dt>
<dd><p>Legt fest, dass der Anbieter der Client-Authentifizierungsanbieter ist.</p></dd>
<dt><tt>Server</tt></dt>
<dd><p>Legt fest, dass der Anbieter der Server-Authentifizierungsanbieter ist.</p></dd>
<dt><tt>Client-Server</tt></dt>
<dd><p>Legt fest, dass der Anbieter sowohl ein Client- als auch ein Server-Authentifizierungsanbieter ist.</p></dd>
</dl>
</dd>
<dt>Class Name (Klassenname)</dt>
<dd><p>Der Name der Java Implementierungsklasse des Anbieters. Client-Authentifizierungsanbieter m&#252;ssen die Schnittstelle <tt>com.sun.enterprise.security.jauth.ClientAuthModule</tt> implementieren. Serverseitige Anbieter m&#252;ssen die Schnittstelle <tt>com.sun.enterprise.security.jauth.ServerAuthModule</tt> implementieren. Client-Server-Anbieter m&#252;ssen beide Schnittstellen implementieren.</p></dd>
<dt>Additional Properties (Weitere Eigenschaften)</dt>
<dd><p>Weitere Eigenschaften f&#252;r die Meldungssicherheitskonfiguration.</p></dd>
</dl>
<h5>Verwandte Aufgaben</h5>

<ul><li><p><a href="task-configmsgsecproviders.html">So konfigurieren Sie Enterprise Server-Funktionen f&#252;r die Verwendung durch Meldungssicherheitsanbieter</a></p></li>
<li><p><a href="task-messagesecurityconfignew.html">So erstellen Sie eine Meldungssicherheitskonfiguration</a></p></li>
<li><p><a href="task-messagesecurityconfigedit.html">So bearbeiten Sie eine Meldungssicherheitskonfiguration</a></p></li>
<li><p><a href="task-messagesecurityconfigdelete.html">So l&#246;schen Sie eine Meldungssicherheitskonfiguration</a></p></li>
<li><p><a href="task-messagesecurityproviderconfignew.html">So erstellen Sie eine Meldungssicherheitsanbieter-Konfiguration</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigedit.html">So bearbeiten Sie eine Konfiguration von Meldungssicherheitsanbietern</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigdelete.html">So l&#246;schen Sie eine Konfiguration des Meldungssicherheitsanbieters</a></p></li>
<li><p><a href="task-enablemesec4appclients.html">So aktivieren Sie die Meldungssicherheit f&#252;r Anwendungs-Clients</a></p></li></ul>
<h5>Verwandte <tt>asadmin</tt>-Befehle</h5>
<p>Keine.</p>
