<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-messagesecurityproviderconfignew"></a><h4>So erstellen Sie eine Meldungssicherheitsanbieter-Konfiguration</h4><p>Zum Erstellen einer neuen Meldungssicherheitsanbieter-Konfiguration f&#252;hren Sie die folgenden Schritte aus:</p><ol>
<li><b>Erweitern Sie in der Navigationsstruktur den Konfigurationsknoten.</b></li>
<li><b>Erweitern Sie den Knoten "Sicherheit".</b></li>
<li><b>W&#228;hlen Sie den Knoten "Meldungssicherheit".</b><p>Die Seite "Nachrichtensicherheitskonfigurationen" wird ge&#246;ffnet.</p></li>
<li><b>Klicken Sie auf der Seite "Nachrichtensicherheitskonfigurationen" auf den Namen der Authentifizierungslayer der
Konfiguration, die Sie bearbeiten.</b><p>Standardm&#228;&#223;ig ist die einzige konfigurierte Nachrichtensicherheitskonfiguration SOAP.</p><p>Die Seite "Meldungssicherheitskonfiguration bearbeiten" wird ge&#246;ffnet.</p></li>
<li><b>Klicken Sie auf die Registerkarte "Anbieter".</b><p>Die Seite "Anbieterkonfigurationen" wird ge&#246;ffnet.</p></li>
<li><b>Klicken Sie auf der Seite "Anbieterkonfigurationen" auf "Neu".</b><p>Die Seite zur Konfiguration eines neuen Anbieters wird angezeigt.</p></li>
<li><b>Geben Sie auf der Seite "Neue Anbieter-Konfiguration" im Feld "Anbieter-ID" einen eindeutigen
Namen f&#252;r die Anbieterkonfiguration ein.</b></li>
<li><b>Aktivieren Sie das Kontrollk&#228;stchen "Standardanbieter", um diesen Anbieter zum Standardanbieter zu machen.</b><p>Der Standardanbieter wird f&#252;r alle Anwendungen aufgerufen, f&#252;r die kein spezifischer Anbieter
angegeben ist. Die Einstellung "Anbietertyp" legt fest, ob es sich um den
standardm&#228;&#223;igen Clientanbieter, den standardm&#228;&#223;igen Serveranbieter oder um beide handelt.</p></li>
<li><b>W&#228;hlen Sie aus der Dropdown-Liste Anbietertyp den Anbietertyp aus.</b><p>Zur Auswahl stehen:</p><dl><dt><tt>Client</tt></dt>
<dd><p>Legt fest, dass der Anbieter der Client-Authentifizierungsanbieter ist.</p></dd>
<dt><tt>Server</tt></dt>
<dd><p>Legt fest, dass der Anbieter der Server-Authentifizierungsanbieter ist.</p></dd>
<dt><tt>Client-Server</tt></dt>
<dd><p>Legt fest, dass der Anbieter sowohl ein Client- als auch ein Server-Authentifizierungsanbieter ist.</p></dd>
</dl>
</li>
<li><b>Geben Sie im Feld "Klassename" den Namen der Java-Implementierungsklasse des Anbieters an.</b><p>Client-Authentifizierungsanbieter m&#252;ssen die Schnittstelle <tt>com.sun.enterprise.security.jauth.ClientAuthModule</tt> implementieren. Serverseitige Anbieter m&#252;ssen die Schnittstelle <tt>com.sun.enterprise.security.jauth.ServerAuthModule</tt>
implementieren. Client-Server-Anbieter m&#252;ssen beide Schnittstellen implementieren.</p></li>
<li><b>W&#228;hlen Sie im Bereich "Anforderungsrichtlinie" aus der Dropdown-Liste "Authentifizierungsquelle" den Typ der
angeforderten Authentifizierung f&#252;r die Anforderungsrichtlinie aus.</b><p>Die Anforderungsrichtlinie legt die Anforderungsverarbeitung f&#252;r den Authentifizierungsanbieter fest. Die Anforderungsrichtlinienfelder sind
optional; wenn sie jedoch nicht angegeben werden, authentifiziert der Authentifizierungsanbieter keine Anforderungsmeldungen.</p><p>W&#228;hlen Sie <tt>sender</tt>, um die Absenderauthentifizierung des Nachrichtenlayers (z. B. Benutzername und
Passwort) f&#252;r Anforderungsmeldungen festzulegen. W&#228;hlen Sie <tt>content</tt>, um die Inhaltsauthentifizierung f&#252;r Anforderungsmeldungen
(z. B. digitale Signaturen) festzulegen. Lassen Sie das Feld leer, um die
Quelle der Anforderungen nicht zu authentifizieren. Standardm&#228;&#223;ig ist kein Authentifizierungstyp ausgew&#228;hlt.</p><p>Eine Beschreibung der Aktionen des SOAP-Meldungssicherheitsempf&#228;ngers finden Sie unter <a href="ref-configreq-respolicy.html">Anforderungs- und Antwortrichtlinienkonfigurationen</a>.</p></li>
<li><b>W&#228;hlen Sie &#252;ber die Dropdown-Liste "Empf&#228;ngerauthentifizierung" aus, ob die Empf&#228;ngerauthentifizierung vor oder
nach der Inhaltsauthentifizierung f&#252;r die Anforderungsrichtlinie durchgef&#252;hrt wird.</b><p>W&#228;hlen Sie <tt>before-content</tt> oder <tt>after-content</tt>, um die Authentifizierung der Meldungs-Layer des Empf&#228;ngers
der Anforderungsmeldung gegen&#252;ber dem Absender zu fordern (durch XML-Verschl&#252;sselung). Wenn der Wert
nicht festgelegt ist, ist der Standard <tt>after-content</tt>. Richtlinien werden in der Reihenfolge
des Meldungsabsenders ausgedr&#252;ckt, sodass der Meldungsempf&#228;nger die Meldung bei Auswahl von <tt>after-content</tt>
vor der Validierung der Signatur entschl&#252;sselt.</p></li>
<li><b>W&#228;hlen Sie im Bereich "Antwortrichtlinie" aus der Dropdown-Liste "Authentifizierungsquelle" den Typ der
angeforderten Authentifizierung f&#252;r die Antwortrichtlinie aus.</b><p>Die Antwortrichtlinie legt die Antwortverarbeitung f&#252;r den Authentifizierungsanbieter fest. Die Antwortrichtlinienfelder sind
optional. Wenn sie jedoch nicht festgelegt sind, wird keine Authentifizierung auf die
Antwort-Meldungen angewendet.</p><p>W&#228;hlen Sie <tt>sender</tt>, um die Absenderauthentifizierung des Meldungslayers (z. B. Benutzername und
Passwort) f&#252;r Antwortmeldungen festzulegen. W&#228;hlen Sie <tt>content</tt>, um die Inhaltsauthentifizierung f&#252;r Antwortmeldungen
(z. B. digitale Signaturen) festzulegen. Lassen Sie das Feld leer, um keine
Antwortquellen zu authentifizieren. Standardm&#228;&#223;ig ist kein Authentifizierungstyp ausgew&#228;hlt.</p><p>Eine Beschreibung der Aktionen des SOAP-Meldungssicherheitsempf&#228;ngers finden Sie unter <a href="ref-configreq-respolicy.html">Anforderungs- und Antwortrichtlinienkonfigurationen</a>.</p></li>
<li><b>W&#228;hlen Sie &#252;ber die Dropdown-Liste "Empf&#228;ngerauthentifizierung" aus, ob die Empf&#228;ngerauthentifizierung vor oder
nach der Inhaltsauthentifizierung f&#252;r die Antwortrichtlinie stattfindet.</b><p>W&#228;hlen Sie <tt>before-content</tt> oder <tt>after-content</tt>, um die Authentifizierung der Meldungs-Layer des Empf&#228;ngers
der Antwortnachricht gegen&#252;ber dem Absender festzulegen (durch XML-Verschl&#252;sselung). Wenn der Wert nicht
festgelegt ist, ist der Standard <tt>after-content</tt>. Richtlinien werden in der Reihenfolge des
Meldungseingangs angegeben, sodass der Meldungsempf&#228;nger die Meldung bei Auswahl von <tt>after-content</tt> vor
der Validierung der Signatur entschl&#252;sselt.</p></li>
<li>(Optional) <b>Geben Sie im Abschnitt "Weitere Eigenschaften" weitere Eigenschaften an.</b><p>Zum Hinzuf&#252;gen einer Eigenschaft klicken Sie auf die Schaltfl&#228;che "Eigenschaft hinzuf&#252;gen". Geben
Sie in die daraufhin angezeigte leere Zeile den Eigenschaftsnamen in das Feld
"Name" und den Eigenschaftswert in das Feld "Wert" ein.</p><p>Eine Beschreibung der weiteren Eigenschaften, die f&#252;r die Anbieterkonfigurationen zur Verf&#252;gung stehen,
finden Sie unter <a href="ref-messagesecurityproviderconfigprops.html">Besondere Eigenschaften von Meldungssicherheitsanbieter-Konfigurationen</a>.</p></li>
<li><b>Klicken Sie auf &#8222;OK&#8220;.</b></li></ol><h6>Siehe auch</h6>
<ul><li><p><a href="task-configmsgsecproviders.html">So konfigurieren Sie Enterprise Server-Funktionen f&#252;r die Verwendung durch Meldungssicherheitsanbieter</a></p></li>
<li><p><a href="task-messagesecurityconfignew.html">So erstellen Sie eine Meldungssicherheitskonfiguration</a></p></li>
<li><p><a href="task-messagesecurityconfigedit.html">So bearbeiten Sie eine Meldungssicherheitskonfiguration</a></p></li>
<li><p><a href="task-messagesecurityconfigdelete.html">So l&#246;schen Sie eine Meldungssicherheitskonfiguration</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigedit.html">So bearbeiten Sie eine Konfiguration von Meldungssicherheitsanbietern</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigdelete.html">So l&#246;schen Sie eine Konfiguration des Meldungssicherheitsanbieters</a></p></li>
<li><p><a href="task-enablemesec4appclients.html">So aktivieren Sie die Meldungssicherheit f&#252;r Anwendungs-Clients</a></p></li></ul>

