<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-securitysettings"></a><h4>So konfigurieren Sie die Sicherheitseinstellungen</h4><p>Mit der Administration Console k&#246;nnen verschiedene systemweite Sicherheitseinstellungen festgelegt werden.</p><ol>
<li><b>Erweitern Sie in der Navigationsstruktur den Konfigurationsknoten.</b></li>
<li><b>W&#228;hlen Sie unter dem Konfigurationsknoten den Sicherheitsknoten aus.</b><p>Die Seite "Sicherheit" wird ge&#246;ffnet.</p></li>
<li><b>Aktivieren Sie das Kontrollk&#228;stchen "Sicherheitsmanager aktiviert", um den Sicherheitsmanager zu aktivieren.</b><p>Bei Aktivierung wird eine JVM-Option, <tt>-Djava.security.manager</tt>, zu den JVM-Einstellungen von Enterprise Server
hinzugef&#252;gt. Siehe <a href="task-jvmoptions.html">So konfigurieren Sie die JVM-Optionen</a>. Um diese &#196;nderung zu &#252;bernehmen, muss der Server neu
gestartet werden.</p><p>Stellen Sie sicher, dass Sie &#252;ber die erforderlichen Berechtigungen f&#252;r alle Anwendungen
verf&#252;gen. Der Sicherheitsmanager kann zum Verbessern der Leistung deaktiviert werden. Diese Option
ist standardm&#228;&#223;ig deaktiviert.</p></li>
<li><b>Aktivieren Sie das Kontrollk&#228;stchen "&#220;berwachungsprotokollierung aktiviert", um die &#220;berwachungsprotokollierung einzuschalten.</b><p>Ist diese Option aktiviert, l&#228;dt der Server alle in der Liste "&#220;berwachungsmodule"
ausgew&#228;hlten &#220;berwachungsmodule und f&#252;hrt sie aus. Ist die Option deaktiviert, greift der
Server nicht auf &#220;berwachungsmodule zu. Diese Option ist standardm&#228;&#223;ig deaktiviert.</p></li>
<li><b>W&#228;hlen Sie aus der Dropdown-Liste "Standardbereich" einen aktiven Bereich aus, den der
Server zur Authentifizierung verwenden wird.</b><p>Dieser Bereich wird von den Anwendungen verwendet, es sei denn, ihre Bereitstellungsbeschreibung
gibt einen anderen Bereich an. Alle konfigurierten Bereiche werden in der Liste
angezeigt. Der Standardwert ist <tt>file</tt>.</p></li>
<li><b>Geben Sie Standard-Principal-Informationen an.</b><ol style="list-style-type: lower-alpha">
<li><b>Geben Sie in das Feld "Standard-Principal" den Standardbenutzernamen ein.</b><p>Dieser Benutzername wird vom Server verwendet, wenn kein anderer Principal angegeben wird.</p></li>
<li><b>Geben Sie in das Feld "Standard-Principal-Passwort" das Passwort des im Feld "Standard-Principal"
angegebenen Standard-Principals ein.</b></li></ol><p>Ein Standard-Principal ist f&#252;r normale Server-Operationen nicht erforderlich.</p></li>
<li><b>W&#228;hlen Sie aus der Dropdown-Liste "JACC" den Namen eines konfigurierten JACC-Anbieters aus.</b><p>Die Standardauswahlen sind <tt>Standard</tt> und <tt> einfach</tt>. Die Standardoption ist <tt>Standard</tt>.</p></li>
<li><b>W&#228;hlen Sie aus der Dropdown-Liste "&#220;berwachungsmodule" die &#220;berwachungsanbieter aus, die vom &#220;berwachungs-Subsystem
verwendet werden, wenn die &#220;berwachungsprotokollierung aktiviert wird.</b><p>Standardm&#228;&#223;ig verwendet der Server das &#220;berwachungsmodul <tt>default</tt>. Weitere Informationen zum Erstellen neuer
&#220;berwachungsmodule finden Sie unter <a href="task-auditmodulenew.html">So erstellen Sie ein &#220;berwachungsmodul</a>.</p></li>
<li><b>Markieren Sie das Kontrollk&#228;stchen "Standardm&#228;&#223;ige Principal/Rolle-Zuordnung aktiviert", um eine standardm&#228;&#223;ige Principal/Rolle-Zuordnung f&#252;r
solche Anwendungen zu erm&#246;glichen, bei denen keine anwendungsspezifische Zuordnung erfolgt.</b></li>
<li><b>Wenn Sie die standardm&#228;&#223;ige Principal-to-role-Zuordnung aktivieren, geben Sie in das Feld "Klasse
der Principal-Zuordnung" den Namen einer benutzerdefinierten <tt>java.security.Principal</tt>-Implementierungsklasse ein, die bei der standardm&#228;&#223;igen
Principal/Rolle-Zuordnung verwendet werden soll. </b></li>
<li>(Optional) <b>Geben Sie im Abschnitt "Weitere Eigenschaften" weitere Eigenschaften an.</b><p>Zul&#228;ssige Eigenschaften h&#228;ngen vom Bereichstyp ab, der im Feld "Standardbereich" ausgew&#228;hlt wurde.</p>
<ul><li><p>Eine Beschreibung der Eigenschaften "Dateibereich" finden Sie unter <a href="ref-editfile-adminrealm.html">F&#252;r die <tt>FileRealm</tt>-Klasse spezifische Eigenschaften</a>.</p></li>
<li><p>Eine Beschreibung der Eigenschaften "Zertifikatsbereich" finden Sie unter <a href="ref-editcertrealm.html">F&#252;r die <tt>CertificateRealm</tt>-Klasse spezifische Eigenschaften</a>.</p></li>
<li><p>Eine Beschreibung der Eigenschaften "JDBC-Bereich" finden Sie unter <a href="ref-editjdbcrealm.html">F&#252;r die <tt>JDBCRealm</tt>-Klasse spezifische Eigenschaften</a>.</p></li>
<li><p>Eine Beschreibung der Eigenschaften "LDAP-Bereich" finden Sie unter <a href="ref-ldaprealmprop.html">F&#252;r die <tt>LDAPRealm</tt>-Klasse spezifische Eigneschaften</a>.</p></li>
<li><p>Eine Beschreibung der Eigenschaften "Solaris-Bereich" finden Sie unter <a href="ref-solarisrealmprop.html">F&#252;r die <tt>SolarisRealm</tt>-Klasse spezifische Eigenschaften</a>.</p></li></ul>
<ul>
<li><b>Zum Hinzuf&#252;gen einer Eigenschaft klicken Sie auf die Schaltfl&#228;che "Eigenschaft hinzuf&#252;gen". Geben
Sie in die daraufhin angezeigte leere Zeile den Eigenschaftsnamen in das Feld
"Name" und den Eigenschaftswert in das Feld "Wert" ein.</b></li>
<li><b>Um eine Eigenschaft zu &#228;ndern, bearbeiten Sie das Feld "Wert" dieser Eigenschaft.</b></li>
<li><b>Um eine Eigenschaft zu l&#246;schen, aktivieren Sie das Kontrollk&#228;stchen links neben dem
Feld "Name" der zu l&#246;schenden Eigenschaft und klicken Sie anschlie&#223;end auf die
Schaltfl&#228;che "Eigenschaften l&#246;schen".</b></li></ul></li>
<li><b>Klicken Sie auf "Speichern".</b></li></ol><h6>Siehe auch</h6>
<ul><li><p><a href="task-accessadmintools.html">So gew&#228;hren Sie Zugriff auf Administrationstools</a></p></li>
<li><p><a href="task-changeadminpasswd.html">So &#228;ndern Sie das Passwort f&#252;r einen Benutzer im Admin-Bereich</a></p></li></ul>

