<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-logviewer"></a><h4>So zeigen Sie das Serverprotokoll an</h4><a name="indexterm-6"></a><a name="indexterm-7"></a><ol>
<li><b>W&#228;hlen Sie in der Navigationsstruktur den Anwendungsserverknoten.</b><p>Die Seite "Allgemeine Informationen" wird ge&#246;ffnet.</p></li>
<li><b>Klicken Sie auf der Seite "Allgemeine Informationen" auf die Schaltfl&#228;che "Protokolldateien anzeigen".</b><p>Ein Protokoll-Viewer-Fenster wird ge&#246;ffnet.</p></li>
<li><b>Verwenden Sie den Bereich "Suchkriterien", um die Protokollanzeige anzupassen und zu filtern.</b><ul>
<li><b>Klicken Sie im Bereich "Suchkriterien" auf "Erweiterte Suche", um die Protokollanzeige weiter
zu verfeinern.</b></li>
<li><b>Im Feld "Zeitstempel":</b><ul>
<li><b>Um die aktuellsten Meldungen anzuzeigen, w&#228;hlen Sie "Aktuell".</b></li>
<li><b>Um Meldungen aus einem bestimmten Zeitraum anzuzeigen, w&#228;hlen Sie "Bestimmter Zeitraum", und
geben Sie einen Datums- und Uhrzeitwert in die Felder "Von" und "An"
ein.</b><p>F&#252;r den Wert Zeit muss die Syntax folgende Form annehmen (<b>SSS</b> steht
f&#252;r Millisekunden):</p><pre><b>hh</b>:<b>mm</b>:<b>ss</b>.<b>SSS</b></pre><p>Beispiel:</p><pre>17:10:00.000</pre><p>Wenn der Wert im Feld "Von" zeitlich hinter dem Wert in "Bis"
liegt, wird eine Fehlermeldung angezeigt.</p></li></ul></li>
<li><b>W&#228;hlen Sie aus der Dropdown-Liste Protokollebene eine Protokollebene aus, um die Meldungen
nach Protokollebene zu filtern. Aktivieren Sie das Kontrollk&#228;stchen "Keine weiteren als 'schwerwiegend'
eingestuften Meldungen aufnehmen", um nur Meldungen der gew&#228;hlten Protokollebene anzuzeigen.</b><p>Per Voreinstellung werden alle im Serverprotokoll enthaltenen Meldungen angezeigt, die der gew&#228;hlten
oder einer h&#246;heren Protokollebene zugeordnet sind.</p><p>Um sicherzustellen, dass die Nachrichten, die Sie anzeigen m&#246;chten, im Serverprotokoll angezeigt
werden, stellen Sie zun&#228;chst die geeigneten Protokollebenen auf der Seite "Protokollebenen Modul"
ein. Siehe <a href="task-eelogginglevels.html">So konfigurieren Sie Protokollebenen</a>.</p><p>Wenn Sie sich f&#252;r eine Filterung von Protokollmeldungen basierend auf der Protokollebene
entschieden haben, werden nur Meldungen angezeigt, die den angegebenen Filterkriterien entsprechen. Diese
Filterung wirkt sich jedoch nicht darauf aus, welche Meldungen im Serverprotokoll aufgezeichnet
werden.</p></li></ul></li>
<li><b>Wenn Sie im Bereich "Suchkriterien" auf "Erweiterte Suche" geklickt haben, f&#252;hren Sie
diese Schritte aus.</b><ol style="list-style-type: lower-alpha">
<li><b>W&#228;hlen Sie aus der Dropdown-Liste Protokollfunktion einen oder mehrere Namespaces aus, um
nach Modul zu filtern.</b><p>Verwenden Sie die Tastenkombination Umschalt+Klick oder Strg+Klick, um mehrere Namespaces auszuw&#228;hlen.</p><p>Die Auswahl eines Namespaces einer h&#246;heren Ebene f&#252;hrt zur Auswahl aller darunter
angeordneten Namespaces. Wenn Sie beispielsweise <tt>javax.enterprise.system</tt> ausw&#228;hlen, werden auch die Protokollierfunktionen aller
Module unterhalb dieses Namespaces ausgew&#228;hlt: <tt>javax.enterprise.system.core</tt>, <tt>javax.enterprise.system.tools.admin</tt> usw.</p></li>
<li><b>Geben Sie im Feld "Benutzerdefinierte Protokollfunktion" den Namen der Protokollfunktion, einen pro
Zeile, ein, um Meldungen aus Protokollfunktionen anzuzeigen, die zu einer besonderen Anwendung
geh&#246;ren.</b><p>Wenn die Anwendung &#252;ber mehrere Module verf&#252;gt, k&#246;nnen Sie einige oder alle
dieser Module anzeigen. Angenommen, die Anwendung weist Protokollierfunktionen mit den folgenden Namen
auf:</p><pre>com.mycompany.myapp.module1
com.mycompany.myapp.module2
com.mycompany.myapp.module3</pre><p>Um Meldungen aller Module in der Anwendung anzuzeigen, geben Sie <tt>com.mycompany.myapp</tt> ein.
Um nur Meldungen von <tt>module2</tt> anzuzeigen, geben Sie <tt>com.mycompany.myapp.module2</tt> ein.</p><p>Wenn Sie eine oder mehrere benutzerdefinierte Protokollfunktionen angeben, werden Meldungen von Enterprise
Server-Modulen nur dann angezeigt, wenn Sie sie im Bereich "Protokollfunktion" explizit festlegen.</p></li>
<li><b>Geben Sie im Feld Name-Wert-Paare den Schl&#252;sselnamen und den Wert f&#252;r diesen
Thread ein, um den Output aus einem bestimmten Thread anzuzeigen.</b><p>Der Schl&#252;sselname lautet <tt>_ThreadID</tt>. Beispiel:</p><pre>_ThreadID=13</pre><p>Angenommen, <tt>com.mycompany.myapp.module2</tt> wird in verschiedenen Threads ausgef&#252;hrt. Um die Protokollanzeige zu verfeinern
und nur die Ausgabe eines Threads anzuzeigen, geben Sie die Protokollfunktion f&#252;r
das betreffende Modul im Feld "Benutzerdefinierte Protokollfunktion" ein und geben dann in
diesem Feld die Thread-ID an.</p></li>
<li><b>W&#228;hlen Sie aus der Dropdown-Liste "Anzeige" einen Wert aus der Dropdown-Liste aus,
um diese Anzahl der Meldungen gleichzeitig anzuzeigen.</b><p>Als Standardanzeige f&#252;r Nachrichten wird 40 angezeigt. Dar&#252;ber hinaus stehen 100, 250
und 1000 zur Auswahl.</p><p>Um Daten zur Stapelablaufverfolgung anzuzeigen, deaktivieren Sie das Kontrollk&#228;stchen "Sehr lange Meldungen
begrenzen". Per Voreinstellung werden in der Anzeige keine Daten zur Stapelablaufverfolgung angezeigt.
Um diese einzublenden, klicken Sie auf den Link <tt>(Details)</tt> f&#252;r eine Meldung.</p></li>
<li><b>Klicken Sie auf "Basissuche", um den Bereich "Erweiterte Optionen" auszublenden.</b></li></ol></li>
<li><b>Passen Sie im Bereich "Suchergebnisse" die Anzeige von Protokollmeldungen an.</b><p>Im Bereich "Suchergebnisse" werden die letzten 40 Eintr&#228;ge des Serverprotokolls angezeigt, gem&#228;&#223;
den Einstellungen auf den Seiten "Protokollierung" und "Protokollebenen".</p><ul>
<li><b>Klicken Sie auf die Pfeile in den Spalten, um die Meldungen zu
sortieren.</b></li>
<li><b>Klicken Sie auf den beschrifteten Link <tt>(Details)</tt>, um eine formatierte Version einer
beliebigen Meldung anzuzeigen.</b><p>Es wird ein Fenster "Protokolleintragsdetail" mit der formatierten Version der Meldung angezeigt.</p></li>
<li><b>Klicken Sie auf die Schaltfl&#228;chen oberhalb und unterhalb der Tabelle, um fr&#252;her
oder sp&#228;ter protokollierte Eintr&#228;ge in der Protokolldatei anzuzeigen.</b></li></ul></li></ol><h6>Siehe auch</h6>
<ul><li><p><a href="task-eelogging.html">So konfigurieren Sie allgemeine Protokollierungseinstellungen</a></p></li>
<li><p><a href="task-eelogginglevels.html">So konfigurieren Sie Protokollebenen</a></p></li>
<li><p><a href="task-generaltab.html">So zeigen Sie allgemeine Informationen f&#252;r Enterprise Server an</a></p></li>
<li><p><a href="task-setadvanceappconfig.html">So f&#252;hren Sie die "Erweiterte Anwendungskonfiguration" durch</a></p></li>
<li><p><a href="task-setadvancedomainattributes.html">So legen Sie die erweiterten Dom&#228;nenattribute fest</a></p></li>
<li><p><a href="task-setadminpassword.html">So &#228;ndern Sie das Administrator-Passwort</a></p></li>
<li><p><a href="task-systemproperties.html">So verwalten Sie Systemeigenschaften</a></p></li>
<li><p><a href="task-appmonitoringdata.html">So zeigen Sie &#220;berwachungsdaten der Anwendung an</a></p></li>
<li><p><a href="task-servermonitoringdata.html">So zeigen Sie die Server-&#220;berwachungsdaten an</a></p></li></ul>

