<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-accessadmintools"></a><h4>So gew&#228;hren Sie Zugriff auf Administrationstools</h4><p>Nur Benutzer in der Gruppe <tt>asadmin</tt> k&#246;nnen auf die Administration Console und
das Befehlszeilendienstprogramm <tt>asadmin</tt> zugreifen. Um Benutzern den Zugriff auf diese Verwaltungstools zu
gew&#228;hren, f&#252;gen Sie sie der Gruppe <tt>asadmin</tt> im <tt>admin-realm</tt> hinzu.</p><ol>
<li><b>Erweitern Sie in der Navigationsstruktur den Konfigurationsknoten.</b></li>
<li><b>Erweitern Sie den Knoten "Sicherheit".</b></li>
<li><b>Erweitern Sie den Knoten "Bereiche".</b></li>
<li><b>W&#228;hlen Sie den Knoten <tt>admin-realm</tt>.</b><p>Die Seite "Bereich bearbeiten" wird ge&#246;ffnet.</p></li>
<li><b>Klicken Sie auf der Seite "Bereich bearbeiten" auf die Schaltfl&#228;che "Benutzer verwalten".</b><p>Die Seite "Dateibenutzer" wird ge&#246;ffnet.</p><p>Nach der Installation werden die w&#228;hrend der Installation eingegebenen Werte f&#252;r Benutzername
und Passwort des Administrators in einer Datei mit dem Namen <tt>admin-keyfile</tt> aufgelistet.
Standardm&#228;&#223;ig geh&#246;rt dieser Benutzer zur Gruppe <tt>asadmin</tt>, welche &#252;ber Berechtigungen zum &#196;ndern
von Enterprise Server verf&#252;gt. F&#252;gen Sie zu dieser Gruppe nur Benutzer hinzu,
denen Sie Administratorrechte f&#252;r Enterprise Server zuweisen m&#246;chten.</p><p>Wenn Sie einen Benutzer dem Bereich <tt>admin-realm</tt>, jedoch nicht der Gruppe <tt>asadmin</tt>
zuweisen, werden die Benutzerinformationen zwar in die Datei <tt>admin-keyfile</tt> geschrieben, der Benutzer
ist jedoch nicht f&#252;r den Zugriff auf die Verwaltungstools oder Anwendungen im
Bereich <tt>file</tt> berechtigt.</p></li>
<li><b>Klicken Sie auf der Seite "Dateibenutzer" auf "Neu", um dem <tt>admin-realm</tt>-Bereich einen
neuen Benutzer hinzuzuf&#252;gen.</b><p>Die Seite "Neuer Dateibereichsbenutzer" wird ge&#246;ffnet.</p></li>
<li><b>Geben Sie in das Feld "Benutzer-ID" den neuen Benutzernamen ein.</b></li>
<li><b>Geben Sie in das Feld "Gruppenliste" die Namen der Gruppen ein, zu
denen der Benutzer geh&#246;rt.</b><p>Um einem Benutzer Berechtigungen zum Durchf&#252;hren von &#196;nderungen an Enterprise Server zuzuweisen,
f&#252;gen Sie die Gruppe <tt>asadmin</tt> im Feld "Gruppenliste" hinzu.</p></li>
<li><b>Geben Sie in die Felder "Neues Passwort" und "Neues Passwort best&#228;tigen" das
Passwort f&#252;r den neuen Benutzer ein.</b></li>
<li><b>Klicken Sie auf "OK", um diesen Benutzer dem Bereich <tt>admin-realm</tt> hinzuzuf&#252;gen, oder
klicken Sie auf "Abbrechen", um den Vorgang ohne Speichern zu beenden.</b></li></ol><h6>Siehe auch</h6>
<ul><li><p><a href="task-securitysettings.html">So konfigurieren Sie die Sicherheitseinstellungen</a></p></li>
<li><p><a href="task-changeadminpasswd.html">So &#228;ndern Sie das Passwort f&#252;r einen Benutzer im Admin-Bereich</a></p></li></ul>

