<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-enablemesec4appclients"></a><h4>So aktivieren Sie die Meldungssicherheit f&#252;r Anwendungs-Clients</h4><p>Clientanbieter m&#252;ssen &#252;ber dieselben Meldungssicherheitsrichtlinien verf&#252;gen wie die serverseitigen Anbieter, mit denen
sie interagieren. F&#252;r die bei der Installation von Enterprise Server konfigurierten (jedoch
nicht aktivierten) Anbieter wird diese Anforderung bereits erf&#252;llt.</p><p>Zum Aktivieren der Meldungssicherheit f&#252;r Clientanwendungen &#228;ndern Sie die Enterprise Server-spezifische Konfiguration
f&#252;r den Anwendungsclient-Container.</p><ol>
<li><b>Halten Sie alle Clientanwendungen an, die von der Client-Containerbeschreibung abh&#228;ngen.</b></li>
<li><b>&#214;ffnen Sie die Sun-Anwendungscontainerbeschreibung im Verzeichnis <i>domain-dir</i><tt>/config/sun-acc.xml</tt> in einem Texteditor.</b></li>
<li><b>Zum Aktivieren des standardm&#228;&#223;igen Clientanbieters f&#252;r den Anwendungsclient f&#252;gen Sie das Attribut
<tt>default-client-provider</tt> zum Element <tt>message-security-config</tt> hinzu. </b><p>Der umgebende Code wird als Kontext angezeigt und kann in Ihrer Installation
geringf&#252;gig abweichen. &#196;ndern Sie diesen Code nicht.</p><pre>&#60;client-container>
  &#60;target-server name="<i>your-host</i>" address="<i>your-host</i>"
      port="<i>your-port</i>"/>
  &#60;log-service file="" level="WARNING"/>
  &#60;message-security-config auth-layer="SOAP"
      <b>default-client-provider="ClientProvider"</b>>
    &#60;provider-config
        class-name="com.sun.enterprise.security.jauth.ClientAuthModule"
        provider-id="ClientProvider" provider-type="client">
      &#60;request-policy auth-source="sender"/>
      &#60;response-policy/>
        &#60;property name="security.config"
          value="C:/Sun/AppServer/lib/appclient/wss-client-config.xml"/>
    &#60;/provider-config>
  &#60;/message-security-config>
&#60;/client-container></pre><p>Der im Clientcontainer konfigurierte Meldungssicherheitsanbieter muss &#252;ber Zugriff auf private Schl&#252;ssel und
vertrauensw&#252;rdige Zertifikate verf&#252;gen. Um diesen Zugriff einzurichten, setzen Sie die Werte f&#252;r
die folgenden Systemeigenschaften im Startskript des Anwendungsclients:</p><pre>-Djavax.net.ssl.keyStore</pre><pre>-Djavax.net.ssl.trustStore</pre></li></ol><h6>Siehe auch</h6>
<ul><li><p><a href="task-configmsgsecproviders.html">So konfigurieren Sie Enterprise Server-Funktionen f&#252;r die Verwendung durch Meldungssicherheitsanbieter</a></p></li>
<li><p><a href="task-messagesecurityconfignew.html">So erstellen Sie eine Meldungssicherheitskonfiguration</a></p></li>
<li><p><a href="task-messagesecurityconfigedit.html">So bearbeiten Sie eine Meldungssicherheitskonfiguration</a></p></li>
<li><p><a href="task-messagesecurityconfigdelete.html">So l&#246;schen Sie eine Meldungssicherheitskonfiguration</a></p></li>
<li><p><a href="task-messagesecurityproviderconfignew.html">So erstellen Sie eine Meldungssicherheitsanbieter-Konfiguration</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigedit.html">So bearbeiten Sie eine Konfiguration von Meldungssicherheitsanbietern</a></p></li>
<li><p><a href="task-messagesecurityproviderconfigdelete.html">So l&#246;schen Sie eine Konfiguration des Meldungssicherheitsanbieters</a></p></li></ul>

