<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-jmxconnectorssledit"></a><h4>So bearbeiten Sie die SSL-Einstellungen f&#252;r den JMX Connector</h4><h6>Bevor Sie beginnen</h6><p>Diese Aufgabe ist nur dann von Bedeutung, wenn die Sicherheit f&#252;r den
JMX Connector aktiviert ist.</p><ol>
<li><b>Erweitern Sie in der Navigationsstruktur den Konfigurationsknoten.</b></li>
<li><b>W&#228;hlen Sie unter dem Konfigurationsknoten den Admin-Dienstknoten aus.</b><p>Die Seite "JMX-Connector bearbeiten" wird ge&#246;ffnet.</p></li>
<li><b>Aktivieren Sie das Kontrollk&#228;stchen "Sicherheit aktiviert", damit der JMX-Datenaustausch verschl&#252;sselt werden kann.</b><p>Die Option ist standardm&#228;&#223;ig deaktiviert.</p></li>
<li><b>Klicken Sie auf die Registerkarte "SSL".</b><p>Die Seite "SSL" wird ge&#246;ffnet.</p></li>
<li><b>Markieren Sie auf der Seite SSL das f&#252;r SSL3 aktivierte Kontrollk&#228;stchen, um
SSL3 zu aktivieren.</b><p>Diese Option ist standardm&#228;&#223;ig aktiviert.</p></li>
<li><b>Markieren Sie das Kontrollk&#228;stchen TLS aktiviert, um Transport Layer Security (TLS) zu
aktivieren.</b><p>Diese Option ist standardm&#228;&#223;ig aktiviert.</p></li>
<li><b>Aktivieren Sie das Kontrollk&#228;stchen "Client-Authentifizierung aktiviert", um von Clients zu fordern, dass
sie sich selbst dem Server gegen&#252;ber auf jede Anfrage hin identifizieren.</b><p>Die Option ist standardm&#228;&#223;ig deaktiviert.</p></li>
<li><b>Geben Sie in das Feld "Zertifikatspseudonym" das Pseudonym des Serverzertifikats in der
Zertifikatsdatenbank oder dem Token PKCS#11 ein.</b><p>In dem Zertifikat ist das Namensformat <tt><i> Tokenname</i>:<i>Pseudonym</i></tt>. Einschlie&#223;lich der Teil <tt><i>Tokenname</i>:</tt> des
Namens in diesem Attribut ist optional. Der Standardwert ist <tt>s1as</tt>.</p></li>
<li><b>Geben Sie im Feld "Schl&#252;sselspeicher" den Namen der Schl&#252;sselspeicher-Datei (z. B. <tt>keystore.jks</tt>)
ein.</b></li>
<li><b>Geben Sie im Feld Trust-Algorithmus den Namen des Trust-Management-Algorithmus (z. B. PKIX)
ein, um diesen f&#252;r die Validierung des Zertifizierungspfads zu verwenden.</b></li>
<li><b>Geben Sie im Feld "Maximale Zertifikatsl&#228;nge" die maximale Anzahl der nicht selbst
herausgegebenen Zwischenzertifikate ein, die in einem Zertifizierungspfad vorhanden sein k&#246;nnen.</b><p>Dieses Feld wird nur dann verwendet, wenn das Feld "Trust-Algorithmus" auf PKIX
eingestellt ist. Ein Wert von 0 l&#228;sst darauf schlie&#223;en, dass der Pfad
nur ein einziges Zertifikat enthalten kann. Ein Wert von -1 l&#228;sst darauf
schlie&#223;en, dass die Pfadl&#228;nge nicht beschr&#228;nkt ist (es gibt keinen H&#246;chstwert). Das
Einstellen eines Werts, der geringer als -1 ist, sorgt daf&#252;r, dass eine
Ausnahme gemacht wird. Der Standardwert ist 5.</p></li>
<li><b>Geben Sie im Feld Truststore den Namen der Schl&#252;sselspeicher-Datei (z. B. <tt>cacerts.jks</tt>)
ein.</b></li>
<li><b>Legen Sie im Bereich Cipher Suites die Cipher Suites fest, die verwendet
werden sollen.</b><p>Wenn Sie keine Cipher-Suites hinzuf&#252;gen, werden alle Cipher-Suites verwendet.</p></li>
<li><b>Klicken Sie auf &#8222;OK&#8220;.</b></li></ol><h6>Siehe auch</h6>
<ul><li><p><a href="task-jmxconnectoredit.html">So bearbeiten Sie den JMX-Connector </a></p></li></ul>

