<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2009 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-appdeployweb"></a><h4>So stellen Sie eine Webanwendung bereit</h4><ol>
<li><b>W&#228;hlen Sie in der Navigationsstruktur den Anwendungsknoten.</b><p>Die Seite "Anwendungen" wird ge&#246;ffnet.</p></li>
<li><b>Klicken Sie in der Tabelle "Bereitgestellte Anwendungen" auf die Schaltfl&#228;che "Bereitstellen".</b><p>Die Seite "Anwendungen oder Module bereitstellen" wird ge&#246;ffnet.</p></li>
<li><b>Geben Sie den Speicherort des Archivs an, das die bereitzustellende Anwendung enth&#228;lt.</b><ul>
<li><b>Ist das Archiv eine Datei, die sich auf dem Clientcomputer befindet oder
&#252;ber diesen zug&#228;nglich ist, w&#228;hlen Sie die Option "Verpackte Datei zum Hochladen
auf den Server" aus.</b><p>Der Clientcomputer ist der Host, auf dem Sie die Administration Console &#252;ber
einen Browser anzeigen.</p><p>Klicken Sie auf "Durchsuchen", um nach der Datei zu suchen, oder geben
Sie den vollst&#228;ndigen Pfad zu der Datei ein.</p></li>
<li><b>Wenn das Archiv eine Datei ist, die auf dem Servercomputer vorliegt, oder
eine nicht verpackte Anwendung aus einem aufgel&#246;sten Verzeichnis, w&#228;hlen Sie die Option
"Lokale Paketdatei oder lokales Verzeichnis, auf die bzw. das vom Enterprise Server
aus zugegriffen werden kann".</b><p>Der Serverrechner ist der Host, der den Domain Administration Server (DAS) ausf&#252;hrt.
</p><p>Klicken auf "Dateien durchsuchen", um zu einer Datei zu gelangen, oder auf
"Ordner durchsuchen", um zu einem Verzeichnis zu gelangen.  Alternativ k&#246;nnen Sie
auch den Namen des vollst&#228;ndigen Pfads zur Datei oder zum Verzeichnis eingeben.
Die Bereitstellung aus einem erweiterten Verzeichnis ist f&#252;r erfahrene Entwickler vorgesehen und
wird f&#252;r Produktionsumgebungen nicht empfohlen.</p></li></ul></li>
<li><b>W&#228;hlen Sie "Webanwendung" aus der Dropdown-Liste "Typ".</b><p>Wenn Sie entweder eine gepackte Datei angegeben haben, die auf den Server
hochgeladen werden soll, oder eine lokale gepackte Datei, die von Enterprise Server
aus zug&#228;nglich ist, wird der Anwendungstyp automatisch erkannt. Wenn Sie ein Verzeichnis
angegeben haben, das von Enterprise Server aus zug&#228;nglich ist, m&#252;ssen Sie den
Typ manuell festlegen.</p></li>
<li><b>Im Feld "Kontext-Root" k&#246;nnen Sie eine Zeichenfolge zur Identifizierung der Webanwendung eingeben.</b><p>Im URL der Webanwendung folgt die Kontext-Root gleich hinter der Portnummer (<tt>http://</tt><i>host</i><tt>:</tt><i> port</i><tt>/</tt><i>context-root</i><tt>/...</tt>).
Die Kontext-Root sollte mit einem Schr&#228;gstrich beginnen, wie z. B. <tt>/hallo</tt>.</p></li>
<li><b>Im Feld "Anwendungsname" k&#246;nnen Sie den Standardnamen (das Pr&#228;fix des Dateinamens) beibehalten
oder einen anderen Namen eingeben.  </b><p>Der Standardname wird angezeigt, wenn Sie eine Datei f&#252;r den Upload ausw&#228;hlen.
Der Anwendungsname muss eindeutig sein.</p></li>
<li><b>W&#228;hlen Sie aus der Dropdown-Liste "Virtuelle Server" den mit dieser Anwendung zu
verkn&#252;pfenden virtuellen Server aus.</b></li>
<li><b>Markieren Sie das Kontrollk&#228;stchen "Status aktiviert", um die Anwendung zu aktivieren.</b><p>Diese Option ist standardm&#228;&#223;ig aktiviert. Wenn diese Option deaktiviert wird, ist die
Anwendung nicht verf&#252;gbar.</p></li>
<li><b>Aktivieren Sie das Kontrollk&#228;stchen "JSPs vorkompilieren", um die JavaServer Pages<sup>TM</sup> (JSP<sup>TM</sup>)-Dateien vorzukompilieren.</b><p>Wenn Sie diese Option deaktivieren, werden die JSP-Dateien beim ersten Zugriff zur
Laufzeit kompiliert. Die Option ist standardm&#228;&#223;ig deaktiviert.</p></li>
<li><b>Aktivieren Sie das Kontrollk&#228;stchen "Verifier ausf&#252;hren", um den Verifier vor der Bereitstellung
auszuf&#252;hren.</b><p>Wenn die &#220;berpr&#252;fung bei Auswahl dieser Option fehlschl&#228;gt, findet keine Bereitstellung statt.
Der Verifier &#252;berpr&#252;ft Struktur und Inhalt der Datei. Die &#220;berpr&#252;fung von gro&#223;en
Anwendungen ist h&#228;ufig sehr zeitaufwendig. Die Option ist standardm&#228;&#223;ig deaktiviert.</p></li>
<li><b>Aktivieren Sie das Kontrollk&#228;stchen Erneute Bereitstellung erzwingen, um die erneute Bereitstellung zu
erzwingen, wenn die Anwendung bereits bereitgestellt ist.</b><p>Ist diese Option nicht ausgew&#228;hlt, wird beim Versuch, eine bereits bereitgestellte Anwendung
bereitzustellen, eine Fehlermeldung angezeigt. Die Option ist standardm&#228;&#223;ig deaktiviert.</p></li>
<li><b>Geben Sie im Feld Bibliotheken eine durch Kommas getrennte Liste von Bibliotheken-JAR-Dateien
ein, die f&#252;r dieses Modul oder diese Anwendung spezifisch sind. </b><p>Die Pfade k&#246;nnen absolut oder relativ sein. Ein relativer Pfad ist relativ
zu <tt></tt><i>domain-dir</i><tt>/lib/applibs</tt>. Wenn der Pfad absolut ist, muss der Pfad f&#252;r den
Domain Administration Server (DAS) zug&#228;nglich sein. Dies bedeutet, dass er sich unter
<tt></tt><i>domain-dir</i><tt></tt> befinden muss. Die Bibliotheken werden f&#252;r die Anwendung in der Reihenfolge
verf&#252;gbar gemacht, in der sie festgelegt werden.</p></li>
<li><b>Geben Sie im Feld "Beschreibung" eine Beschreibung dieser Anwendung ein.</b></li>
<li><b>Klicken Sie auf &#8222;OK&#8220;.</b></li></ol><h6>Siehe auch</h6>
<ul><li><p><a href="task-applistdeployed.html">So zeigen Sie eine Liste eingesetzter Anwendungen an</a></p></li>
<li><p><a href="task-deployentapp.html">So stellen Sie eine Unternehmensanwendung bereit</a></p></li>
<li><p><a href="task-appdeployclient.html">So stellen Sie einen Anwendungs-Client bereit</a></p></li>
<li><p><a href="task-appdeployconn.html">So stellen Sie ein Verbindungsmodul bereit</a></p></li>
<li><p><a href="task-appdeployejb.html">So stellen Sie ein EJB Jar bereit</a></p></li>
<li><p><a href="task-appdeployruby.html">So stellen Sie eine Ruby-Anwendung bereit </a></p></li>
<li><p><a href="task-appedit.html">So bearbeiten Sie eine bereitgestellte Anwendung</a></p></li>
<li><p><a href="task-appviewdesc.html">So zeigen Sie die Beschreibung einer Anwendung an</a></p></li>
<li><p><a href="task-applaunch.html">So starten Sie eine Anwendung</a></p></li>
<li><p><a href="task-appredeploy.html">Eine bereitgestellte Anwendung erneut bereitstellen</a></p></li>
<li><p><a href="task-apprestart.html">Eine bereitgestellte Anwendung erneut starten</a></p></li></ul>

