<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2008 Sun Microsystems, Inc. All rights reserved.
 
Use is subject to License Terms  -->


<a name="task-register"></a><h4>So registrieren Sie Sun GlassFish Enterprise Server bei Sun Connection</h4><a name="indexterm-1"></a><a name="indexterm-2"></a><a name="indexterm-3"></a><p>Als registrierter Benutzer von Sun GlassFish<sup>TM</sup> Enterprise Server genie&#223;en Sie folgende Vorteile:</p>
<ul><li><p>Patch-Informationen und Programmfehler-Updates</p></li>
<li><p>Screencasts und Lernprogramme</p></li>
<li><p>Neuigkeiten und Termine</p></li>
<li><p>Support und Schulungen</p></li></ul>
<p>Zur Registrierung Ihrer Installation von Sun GlassFish Enterprise Server bei <a href="http://www.sun.com/service/sunconnection/index.jsp">Sun Connection </a> m&#252;ssen
Sie &#252;ber ein <a href="https://reg.sun.com/whyregister">Sun-Onlinekonto</a> verf&#252;gen. Wenn Sie nicht &#252;ber ein Sun-Onlinekonto verf&#252;gen,
erm&#246;glicht Enterprise Server die Erstellung eines Kontos bei der Registrierung.</p>
<hr><p><b>Hinweis - </b>Wenn Sie ein Sun-Onlinekonto bei der Registrierung von Enterprise Server erstellen, werden
sie lediglich zur Angabe der erforderlichen Informationen aufgefordert. Nach dem Registrieren von
Enterprise Server k&#246;nnen Sie zus&#228;tzliche, optionale Informationen angeben, indem Sie <a href="https://reg.sun.com/updateaccount">Ihr Sun-Onlinekonto aktualisieren</a>. </p>
<hr>
<h6>Bevor Sie beginnen</h6><p>Wenn der Computer, auf dem Enterprise Server ausgef&#252;hrt wird, &#252;ber einen Proxy
eine Verbindung zum Internet herstellt, ben&#246;tigen Sie den Hostnamen und die Port-Nummer
des Proxy. Wenn ein Webbrowser auf dem Computer ausgef&#252;hrt wird, auf dem
Enterprise Server ausgef&#252;hrt wird, k&#246;nnen Sie diese Informationen vom Webbrowser beziehen. Andernfalls
erhalten Sie die ben&#246;tigten Informationen von Ihrem Systemadministrator.</p><ol>
<li><b>W&#228;hlen Sie in der Navigationsstruktur den Registrierungsknoten.</b><p>Die Seite "Produktregistrierung" wird ge&#246;ffnet.</p></li>
<li><b>Geben Sie auf der Seite "Produktregistrierung" die erforderlichen Informationen an.</b><ul>
<li><b>Wenn Sie bereits &#252;ber ein Sun-Onlinekonto verf&#252;gen, geben Sie die erforderlichen Informationen
wie folgt an:</b><ol style="list-style-type: lower-alpha">
<li><b>W&#228;hlen Sie die Option "Ich habe bereits ein Sun-Onlinekonto oder ein Sun
Delevoper Network-(SDN)-Konto".</b></li>
<li><b>Geben Sie im Feld "Benutzername" den Benutzernamen ein, den Sie bei der
Registrierung f&#252;r das Sun-Onlinekonto angegeben haben.</b></li>
<li><b>Geben Sie im Feld "Passwort" das Passwort ein, das Sie bei der
Registrierung f&#252;r das Sun-Onlinekonto angegeben haben.</b></li></ol></li>
<li><b>Wenn Sie nicht &#252;ber ein Sun-Onlinekonto verf&#252;gen, geben Sie die erforderlichen Informationen
wie folgt an:</b><ol style="list-style-type: lower-alpha">
<li><b>W&#228;hlen Sie die Option "Ich habe kein Sun-Onlinekonto".</b></li>
<li><b>Geben Sie im Feld "E-Mail-Adresse" Ihre E-Mail-Adresse ein.</b><p>Ihre E-Mail-Adresse wird der Benutzername Ihres Sun-Onlinekontos sein.</p></li>
<li><b>Geben Sie im Feld "Passwort" das Passwort f&#252;r Ihr Sun-Onlinekonto ein.</b><p>F&#252;r das Passwort wird die Gro&#223;- und Kleinschreibung beachtet, und es muss
6&#8211;10 Zeichen umfassen.</p></li>
<li><b>Geben Sie im Feld zur Passwortbest&#228;tigung erneut das Passwort ein, das Sie
im vorherigen Schritt eingegeben haben.</b></li>
<li><b>Geben Sie im Feld "Vorname" Ihren Vornamen ein.</b></li>
<li><b>Geben Sie im Feld "Nachname" Ihren Nachnamen ein.</b></li>
<li><b>Geben Sie im Feld "Unternehmen", wenn zutreffend, den Namen Ihres Unternehmens ein.</b></li>
<li><b>W&#228;hlen Sie in der Dropdown-Liste das Land aus, in dem Sie leben.</b></li></ol></li></ul></li>
<li><b>Wenn der Computer, auf dem Enterprise Server ausgef&#252;hrt wird, &#252;ber einen Proxy
eine Verbindung zum Internet herstellt, geben Sie den Hostnamen und die Port-Nummer
des Proxy an.</b><p>Wenn der Computer, auf dem Enterprise Server ausgef&#252;hrt wird, eine direkte Verbindung
zum Internet herstellt, lassen Sie diesen Schritt aus.</p><p>M&#246;glicherweise wird ein Webbrowser auf dem Computer ausgef&#252;hrt, auf dem Enterprise Server
ausgef&#252;hrt wird. In diesem Fall k&#246;nnen Sie den Hostnamen und die Port-Nummer
des Proxy &#252;ber den Webbrowser beziehen. Andernfalls erhalten Sie die ben&#246;tigten Informationen
von Ihrem Systemadministrator.</p></li>
<li><b>Klicken Sie auf "Registrieren".</b><p>Zur Best&#228;tigung der erfolgreichen Registrierung wird die <a href="ref-supportpage.html">Supportseite</a> ge&#246;ffnet.</p></li></ol>
