<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jdbcconnectionpooledittab" name="ref-jdbcconnectionpooledittab"></a></p>

<h4><a id="sthref45" name="sthref45"></a>&#51217;&#49549; &#54400; &#54200;&#51665;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#51217;&#49549; &#54400; &#54200;&#51665;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; JDBC &#51217;&#49549; &#54400;&#51032; &#51068;&#48152; &#49549;&#49457;&#51012; &#54200;&#51665;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>[&#51217;&#49549; &#54400; &#54200;&#51665;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44592;&#48376;&#44050; &#47196;&#46300;</dt>
<dd>
<p>&#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#45716; &#49444;&#51221;&#51012; &#44592;&#48376;&#44050;&#51004;&#47196; &#48373;&#50896;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#49444;&#51221;&#51008; &#48320;&#44221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#48708;&#50864;&#44592;</dt>
<dd>
<p>&#51217;&#49549; &#54400;&#51032; &#51217;&#49549;&#51012; &#45796;&#49884; &#52488;&#44592;&#54868;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#51060; &#45800;&#52628;&#47484; &#45572;&#47476;&#47732; &#44592;&#51316;&#51032; &#47784;&#46304; &#51217;&#49549;&#51060; &#49325;&#51228;&#46104;&#44256; &#54400;&#50640; &#49444;&#51221;&#46108; &#51217;&#49549;&#51060; &#45796;&#49884; &#49373;&#49457;&#46108; &#54980; &#54400;&#51060; &#52488;&#44592; &#48143; &#52572;&#49548; &#54400; &#53356;&#44592;&#47196; &#48373;&#50896;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#54609;</dt>
<dd>
<p>&#51217;&#49549; &#54400;&#51012; &#49324;&#50857;&#54624; &#49688; &#51080;&#45716;&#51648; &#54869;&#51064;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#51060; &#45800;&#52628;&#47484; &#45572;&#47484; &#46412; &#50724;&#47448; &#47700;&#49884;&#51648;&#44032; &#45208;&#53440;&#45208;&#47732; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#49436;&#48260;&#44032; &#49884;&#51089;&#46104;&#50632;&#45716;&#51648; &#54869;&#51064;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#54400; &#51060;&#47492;</dt>
<dd>
<p>&#51217;&#49549; &#54400;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51069;&#44592; &#51204;&#50857; &#54596;&#46300;&#51077;&#45768;&#45796;. JDBC &#51217;&#49549; &#54400;&#51012; &#49373;&#49457;&#54624; &#46412;&#47564; &#54400; &#51060;&#47492;&#51012; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#47532;&#49548;&#49828; &#50976;&#54805;</dt>
<dd>
<p>&#49440;&#53469; &#54637;&#47785;&#50640;&#45716; javax.sql.XADataSource(&#51204;&#50669; &#53944;&#47004;&#51117;&#49496;), java.sql.ConnectionPoolDataSource(&#47196;&#52972; &#53944;&#47004;&#51117;&#49496;, &#49457;&#45733; &#54693;&#49345; &#44032;&#45733;), javax.sql.DataSource(&#47196;&#52972; &#53944;&#47004;&#51117;&#49496;&#47564;) &#48143; <code>java.sql.Driver</code>&#44032; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#45936;&#51060;&#53552; &#49548;&#49828; &#53364;&#47000;&#49828; &#51060;&#47492;</dt>
<dd>
<p>&#45936;&#51060;&#53552; &#49548;&#49828;&#47484; &#44396;&#54788;&#54616;&#45716; &#44277;&#44553;&#50629;&#52404;&#48324; &#53364;&#47000;&#49828; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#46300;&#46972;&#51060;&#48260; &#53364;&#47000;&#49828; &#51060;&#47492;</dt>
<dd>
<p>&#44277;&#44553;&#50629;&#52404;&#50640;&#49436; &#51228;&#44277;&#54620; JDBC &#46300;&#46972;&#51060;&#48260; &#53364;&#47000;&#49828; &#51060;&#47492;&#51077;&#45768;&#45796;. java.sql.Driver &#47532;&#49548;&#49828; &#50976;&#54805;&#51012; &#49440;&#53469;&#54620; &#44221;&#50864; &#51068;&#48152;&#51201;&#51004;&#47196; &#51060; &#54596;&#46300;&#50640;&#45716; &#49440;&#53469;&#54620; &#46300;&#46972;&#51060;&#48260; &#48143; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#44277;&#44553;&#50629;&#52404;&#50752; &#50672;&#44288;&#46108; &#53364;&#47000;&#49828; &#51060;&#47492;&#51060; &#51088;&#46041;&#51004;&#47196; &#51077;&#47141;&#46121;&#45768;&#45796;. &#45936;&#51060;&#53552; &#49548;&#49828; &#47532;&#49548;&#49828; &#50976;&#54805; &#51473; &#54616;&#45208;&#47484; &#49440;&#53469;&#54620; &#44221;&#50864; &#51060; &#54596;&#46300;&#45716; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#54609;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51060; &#49440;&#53469;&#46108; &#44221;&#50864;, &#54400; &#49373;&#49457; &#51473;&#51060;&#45208; &#51116;&#44396;&#49457; &#51473; &#54400;&#51060; &#51088;&#46041;&#51004;&#47196; &#54609;&#46104;&#50612; &#50724;&#47448;&#44032; &#48156;&#49373;&#54620; &#49549;&#49457;&#44050;&#51012; &#49885;&#48324;&#54616;&#44256; &#44221;&#44256;&#54633;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#49444;&#47749;</dt>
<dd>
<p>&#51217;&#49549; &#54400;&#50640; &#45824;&#54620; &#44036;&#45800;&#54620; &#49444;&#47749;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52488;&#44592; &#48143; &#52572;&#49548; &#54400; &#53356;&#44592;</dt>
<dd>
<p>&#54400;&#51032; &#52572;&#49548; &#51217;&#49549; &#49688;&#51077;&#45768;&#45796;. &#54400; &#44050;&#50640; &#46384;&#46972; &#54400;&#51012; &#47676;&#51200; &#49373;&#49457;&#54616;&#44144;&#45208; GlassFish Server&#47484; &#49884;&#51089;&#54624; &#46412; &#54400;&#50640; &#51080;&#45716; &#51217;&#49549; &#49688;&#46020; &#44208;&#51221;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 8&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#45824; &#54400; &#53356;&#44592;</dt>
<dd>
<p>&#54400;&#51032; &#52572;&#45824; &#51217;&#49549; &#49688;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 32&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#54400; &#53356;&#44592; &#51312;&#51221; &#44060;&#49688;</dt>
<dd>
<p>&#54400;&#51060; &#44033;&#44033; &#52572;&#45824; &#48143; &#52572;&#49548; &#54400; &#53356;&#44592;&#47196; &#54869;&#51109;&#46104;&#44144;&#45208; &#52629;&#49548;&#46104;&#45716; &#44221;&#50864; &#53356;&#44592;&#44032; &#51068;&#44292;&#51201;&#51004;&#47196; &#51312;&#51221;&#46121;&#45768;&#45796;. &#51060; &#44050;&#51008; &#51068;&#44292;&#51201;&#51004;&#47196; &#52376;&#47532;&#54624; &#51217;&#49549; &#49688;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;. &#51060; &#44050;&#51012; &#45320;&#47924; &#53356;&#44172; &#54616;&#47732; &#51217;&#49549; &#49373;&#49457; &#48143; &#51116;&#49692;&#54872;&#51060; &#51648;&#52404;&#46104;&#47728;, &#45320;&#47924; &#51089;&#44172; &#54616;&#47732; &#54952;&#50984;&#49457;&#51060; &#46504;&#50612;&#51665;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 2&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#50976;&#55092; &#49884;&#44036; &#52488;&#44284;</dt>
<dd>
<p>&#54400;&#50640;&#49436; &#51217;&#49549;&#51060; &#50976;&#55092; &#49345;&#53468;&#47196; &#51080;&#51012; &#49688; &#51080;&#45716; &#52572;&#45824; &#49884;&#44036;(&#52488;)&#51077;&#45768;&#45796;. &#51060; &#49884;&#44036;&#51060; &#47564;&#47308;&#46104;&#47732; &#51217;&#49549;&#51060; &#54400;&#50640;&#49436; &#51228;&#44144;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 300&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#45824; &#45824;&#44592; &#49884;&#44036;</dt>
<dd>
<p>&#51217;&#49549;&#51012; &#50836;&#52397;&#54620; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51032; &#51217;&#49549; &#49884;&#44036;&#51060; &#52488;&#44284;&#46112; &#46412;&#44620;&#51648; &#45824;&#44592;&#54616;&#45716; &#52572;&#45824; &#49884;&#44036;(&#48128;&#47532;&#52488;)&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 60,000&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#53944;&#47004;&#51117;&#49496;&#51060; &#50500;&#45772; &#51217;&#49549;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#53944;&#47004;&#51117;&#49496;&#51060; &#50500;&#45772; &#51217;&#49549;&#51060; &#48152;&#54872;&#46121;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; &#51060; &#50741;&#49496;&#51008; &#51648;&#51221;&#46104;&#50612; &#51080;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#53944;&#47004;&#51117;&#49496; &#44201;&#47532;</dt>
<dd>
<p>&#53944;&#47004;&#51117;&#49496; &#44201;&#47532; &#47112;&#48296;&#51012; &#51648;&#51221;&#54616;&#45716; &#44221;&#50864; &#51060; &#54400;&#51032; &#51217;&#49549;&#51060; &#51648;&#51221;&#46108; &#47112;&#48296;&#47196; &#49892;&#54665;&#46121;&#45768;&#45796;. &#44536;&#47111;&#51648; &#50506;&#51004;&#47732; &#51217;&#49549;&#51008; JDBC &#46300;&#46972;&#51060;&#48260;&#50640;&#49436; &#51228;&#44277;&#54616;&#45716; &#44592;&#48376; &#44201;&#47532; &#47112;&#48296;&#47196; &#49892;&#54665;&#46121;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; &#51060; &#50741;&#49496;&#51008; &#51648;&#51221;&#46104;&#50612; &#51080;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#44201;&#47532; &#47112;&#48296;</dt>
<dd>
<p>[&#48372;&#51109;] &#52404;&#53356; &#48149;&#49828;&#44032; &#49440;&#53469;&#46108; &#44221;&#50864; &#54400;&#50640;&#49436; &#44032;&#51256;&#50728; &#47784;&#46304; &#51217;&#49549;&#51008; &#46041;&#51068;&#54620; &#44201;&#47532; &#47112;&#48296;&#51012; &#44054;&#44172; &#46121;&#45768;&#45796;. &#50696;&#47484; &#46308;&#50612;, &#47560;&#51648;&#47561;&#51004;&#47196; &#49324;&#50857;&#54624; &#46412; &#51217;&#49549;&#51032; &#44201;&#47532; &#47112;&#48296;&#51012; &#54532;&#47196;&#44536;&#47000;&#48141; &#48169;&#49885;&#51004;&#47196; &#48320;&#44221;&#54620; &#44221;&#50864;(&#50696;: <code>con.setTransactionIsolation</code> &#49324;&#50857;) &#51060; &#48169;&#49885;&#51008; &#49345;&#53468;&#47484; &#51648;&#51221;&#54620; &#44201;&#47532; &#47112;&#48296;&#47196; &#45796;&#49884; &#48320;&#44221;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#54596;&#46300;&#45716; &#53944;&#47004;&#51117;&#49496; &#44201;&#47532; &#47112;&#48296;&#51012; &#51648;&#51221;&#54620; &#44221;&#50864;&#50640;&#47564; &#51201;&#50857; &#44032;&#45733;&#54633;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref46" name="sthref46"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#50529;&#49464;&#49828;&#47484; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">JDBC &#46300;&#46972;&#51060;&#48260;&#47484; &#53685;&#54633;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">JDBC &#51217;&#49549; &#54400;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">JDBC &#51217;&#49549; &#54400; &#51068;&#48152; &#49444;&#51221;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">&#51217;&#49549; &#54400; &#49444;&#51221;&#51012; &#54869;&#51064;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">JDBC &#51217;&#49549; &#54400; &#44256;&#44553; &#49549;&#49457;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">JDBC &#51217;&#49549; &#54400; &#49549;&#49457;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">JDBC &#51217;&#49549; &#54400;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref47" name="sthref47"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00001"><code>add-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00036"><code>create-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00088"><code>delete-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00135"><code>flush-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00173"><code>list-jdbc-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00214"><code>ping-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00234"><code>start-database</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00239"><code>stop-database</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
