<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jdbcconnpooladvanceattrtab" name="ref-jdbcconnpooladvanceattrtab"></a></p>

<h4><a id="sthref50" name="sthref50"></a>&#51217;&#49549; &#54400; &#44256;&#44553; &#49549;&#49457; &#54200;&#51665;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#51217;&#49549; &#54400; &#44256;&#44553; &#49549;&#49457; &#54200;&#51665;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#50672;&#44208; &#45572;&#49688;&#47484; &#51652;&#45800;&#54616;&#44256; &#49324;&#50857; &#54200;&#51032;&#49457;&#51012; &#45458;&#51060;&#45716; &#49549;&#49457;&#51012; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>[&#51217;&#49549; &#54400; &#44256;&#44553; &#49549;&#49457; &#54200;&#51665;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#44592;&#48376;&#44050; &#47196;&#46300;</dt>
<dd>
<p>&#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#45716; &#49444;&#51221;&#51012; &#44592;&#48376;&#44050;&#51004;&#47196; &#48373;&#50896;&#54616;&#45716; &#45800;&#52628;&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51012; &#49324;&#50857;&#54616;&#51648; &#50506;&#45716; &#49444;&#51221;&#51008; &#48320;&#44221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#54400; &#51060;&#47492;</dt>
<dd>
<p>&#51217;&#49549; &#54400;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060;&#47492;&#51008; &#51069;&#44592; &#51204;&#50857; &#54596;&#46300;&#51077;&#45768;&#45796;. &#49352; JDBC &#51217;&#49549; &#54400;&#51012; &#49373;&#49457;&#54624; &#46412;&#47564; &#51217;&#49549; &#54400; &#51060;&#47492;&#51012; &#51648;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#47749;&#47161;&#47928; &#49884;&#44036; &#52488;&#44284;</dt>
<dd>
<p>&#48708;&#51221;&#49345;&#51201;&#51004;&#47196; &#44600;&#44172; &#49892;&#54665;&#46104;&#45716; &#51656;&#51032;&#47484; &#51333;&#47308;&#54616;&#44592; &#51204;&#44620;&#51648;&#51032; &#49884;&#44036; &#44600;&#51060;(&#52488;)&#51077;&#45768;&#45796;. GlassFish Server&#50640;&#49436;&#45716; &#47749;&#47161;&#47928;&#51012; &#49373;&#49457;&#54624; &#46412; <code>QueryTimeout</code>&#51012; &#49444;&#51221;&#54633;&#45768;&#45796;. &#44050; -1&#51008; &#51060; &#50741;&#49496;&#51012; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; -1&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#47749;&#47161;&#47928; &#52880;&#49884; &#53356;&#44592;</dt>
<dd>
<p>LRU(&#44032;&#51109; &#50724;&#47000; &#51204;&#50640; &#49324;&#50857;&#46120;) &#52880;&#49905; &#48169;&#49885;&#51012; &#49324;&#50857;&#54616;&#50668; &#52880;&#49884;&#54624; &#47749;&#47161;&#47928; &#49688;&#51077;&#45768;&#45796;. &#44050; 0&#51008; &#47749;&#47161;&#47928; &#52880;&#49905;&#51012; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 0&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#52488;&#44592; SQL</dt>
<dd>
<p>&#54400;&#50640;&#49436; &#51217;&#49549;&#51060; &#49373;&#49457;&#46112; &#46412;&#47560;&#45796;(&#51116;&#49324;&#50857;&#46104;&#51648; &#50506;&#51020;) &#49892;&#54665;&#54624; SQL &#47928;&#51088;&#50676;&#51077;&#45768;&#45796;. &#51060; &#47928;&#51088;&#50676;&#51060; &#49892;&#54665;&#46104;&#47732; &#51217;&#49549; &#49345;&#53468;&#44032; &#52488;&#44592;&#54868;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>SQL &#52628;&#51201; &#47532;&#49828;&#45320;</dt>
<dd>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640;&#49436; &#49892;&#54665;&#54620; SQL &#47749;&#47161;&#47928;&#51012; &#52628;&#51201;&#54616;&#46020;&#47197; &#51648;&#51221;&#54616;&#45716; &#47532;&#49828;&#45320; &#44396;&#54788; &#53364;&#47000;&#49828; &#51060;&#47492;&#51032; &#53092;&#47560;&#47196; &#44396;&#48516;&#46108; &#47785;&#47197;&#51077;&#45768;&#45796;. &#47532;&#49828;&#45320; &#53364;&#47000;&#49828;&#45716; <code>org.glassfish.api.jdbc.SQLTraceListener</code> &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#44396;&#54788;&#54644;&#50556; &#54633;&#45768;&#45796;. &#47532;&#49828;&#45320;&#47484; &#49324;&#50857;&#54616;&#47732; SQL &#47928;&#50640; &#45824;&#54620; &#47196;&#44536; &#47700;&#49884;&#51648;&#47484; &#49789;&#44172; &#54596;&#53552;&#47553;&#54616;&#44256; &#44288;&#47532;&#51088;&#44032; &#47749;&#47161;&#47928;&#51012; &#48516;&#49437;&#54616;&#46020;&#47197; &#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>JDBC &#44061;&#52404; &#47000;&#54609;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; Statement, PreparedStatement, CallableStatement, ResultSet, DatabaseMetaData&#50640; &#45824;&#54620; &#47000;&#54609;&#46108; JDBC &#44061;&#52404;&#47484; &#44032;&#51256;&#50741;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#54400;&#47553;</dt>
<dd>
<p>&#54400;&#50640; &#45824;&#54620; &#51217;&#49549; &#54400;&#47553;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#45824; 1&#54924; &#44160;&#51613; &#44592;&#44036;</dt>
<dd>
<p>&#51217;&#49549;&#51012; &#52572;&#45824; &#54620; &#48264; &#44160;&#51613;&#54616;&#44592; &#50948;&#54644; &#50672;&#49549;&#46108; &#50836;&#52397; &#44036;&#51032; &#49884;&#44036; &#44036;&#44201;(&#52488;)&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. &#51060; &#49549;&#49457;&#51012; &#51201;&#51208;&#54620; &#44050;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; &#51217;&#49549;&#51032; &#44160;&#51613; &#50836;&#52397; &#54943;&#49688;&#44032; &#52572;&#49548;&#54868;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 0&#51077;&#45768;&#45796;. &#44050;&#51060; 0&#51060;&#47732; &#49549;&#49457;&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#51217;&#49549; &#45572;&#49688; &#49884;&#44036; &#52488;&#44284;</dt>
<dd>
<p>&#51217;&#49549; &#54400;&#51032; &#51217;&#49549; &#45572;&#49688;&#47484; &#52628;&#51201;&#54616;&#45716; &#49884;&#44036;(&#52488;)&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#47484; &#49324;&#50857;&#54616;&#50668; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640;&#49436; &#48156;&#49373;&#54624; &#49688; &#51080;&#45716; &#51104;&#51116;&#51201;&#51064; &#51217;&#49549; &#45572;&#49688;&#47484; &#44160;&#49353;&#54633;&#45768;&#45796;. &#51648;&#51221;&#46108; &#44592;&#44036; &#45236;&#50640; &#51217;&#49549;&#51060; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#51032;&#54644; &#54400;&#47196; &#46104;&#46028;&#50500;&#44032;&#51648; &#50506;&#51004;&#47732; &#51104;&#51116;&#51201;&#51004;&#47196; &#45572;&#49688;&#46104;&#44256; &#51080;&#45796;&#44256; &#44036;&#51452;&#46104;&#50612; &#54840;&#52636;&#51088;&#51032; &#49828;&#53469; &#52628;&#51201;&#51060; &#47196;&#44613;&#46121;&#45768;&#45796;. &#44050;&#51060; 0&#51060;&#47732; &#51217;&#49549; &#45572;&#49688; &#52628;&#51201;&#51012; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#51020;&#51012; &#45208;&#53440;&#45253;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 0&#51077;&#45768;&#45796;.</p>
<p>&#51060; &#54596;&#46300;&#47484; &#45572;&#49688; &#51116;&#49373;&#44284; &#54632;&#44760; &#49324;&#50857;&#54616;&#50668; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640;&#49436; &#51104;&#51116;&#51201;&#51064; &#51217;&#49549; &#45572;&#49688;&#44032; &#48156;&#49373;&#54616;&#45716; &#44163;&#51012; &#48169;&#51648;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#51217;&#49549; &#45572;&#49688; &#51116;&#49373;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; &#45572;&#49688; &#51217;&#49549; &#52628;&#51201;&#51060; &#50756;&#47308;&#46108; &#54980;&#50640; &#45572;&#49688;&#46108; &#51217;&#49549;&#51060; &#54400;&#47196; &#48373;&#50896;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#47749;&#47161;&#47928; &#45572;&#49688; &#49884;&#44036; &#52488;&#44284;</dt>
<dd>
<p>&#51217;&#49549; &#54400;&#51032; &#47749;&#47161;&#47928; &#45572;&#49688;&#47484; &#52628;&#51201;&#54616;&#45716; &#49884;&#44036;(&#52488;)&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#50640;&#49436;&#45716; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640;&#49436; &#48156;&#49373;&#54624; &#49688; &#51080;&#45716; &#47749;&#47161;&#47928; &#45572;&#49688;&#47484; &#44160;&#49353;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51648;&#51221;&#46108; &#44592;&#44036; &#45236;&#50640; &#47749;&#47161;&#47928;&#51060; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#51032;&#54644; &#54400;&#47196; &#46104;&#46028;&#50500;&#44032;&#51648; &#50506;&#51004;&#47732; &#51104;&#51116;&#51201;&#51004;&#47196; &#45572;&#49688;&#46104;&#44256; &#51080;&#45796;&#44256; &#44036;&#51452;&#46104;&#50612; &#54840;&#52636;&#51088;&#51032; &#49828;&#53469; &#52628;&#51201;&#51060; &#47196;&#44613;&#46121;&#45768;&#45796;. &#44050;&#51060; 0&#51060;&#47732; &#47749;&#47161;&#47928; &#45572;&#49688; &#52628;&#51201;&#51012; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#51020;&#51012; &#45208;&#53440;&#45253;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 0&#51077;&#45768;&#45796;.</p>
<p>&#51060; &#54596;&#46300;&#47484; &#47749;&#47161;&#47928; &#45572;&#49688; &#51116;&#49373;&#44284; &#54632;&#44760; &#49324;&#50857;&#54616;&#47732; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640;&#49436; &#51104;&#51116;&#51201;&#51064; &#51217;&#49549; &#45572;&#49688;&#44032; &#48156;&#49373;&#54616;&#45716; &#44163;&#51012; &#48169;&#51648;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#47749;&#47161;&#47928; &#45572;&#49688; &#51116;&#49373;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; &#45572;&#49688; &#47749;&#47161;&#47928; &#52628;&#51201;&#51060; &#50756;&#47308;&#46108; &#54980;&#50640; &#45572;&#49688;&#46108; &#47749;&#47161;&#47928;&#51060; &#54400;&#47196; &#48373;&#50896;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#49373;&#49457; &#51116;&#49884;&#46020; &#54943;&#49688;</dt>
<dd>
<p>&#49352; &#51217;&#49549; &#49373;&#49457;&#50640; &#49892;&#54056;&#54620; &#44221;&#50864; &#51116;&#49884;&#46020;&#54616;&#45716; &#54943;&#49688;&#51077;&#45768;&#45796;. &#44050;&#51060; 0&#51060;&#47732; &#51217;&#49549;&#51012; &#45796;&#49884; &#49373;&#49457;&#54616;&#47140;&#44256; &#49884;&#46020;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 0&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51116;&#49884;&#46020; &#44036;&#44201;</dt>
<dd>
<p>&#51217;&#49549;&#51012; &#49373;&#49457;&#54616;&#44592; &#50948;&#54620; &#46160; &#49884;&#46020; &#44036;&#51032; &#44036;&#44201;(&#52488;)&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 10&#51077;&#45768;&#45796;. &#51060; &#49549;&#49457;&#51008; &#49373;&#49457; &#51116;&#49884;&#46020; &#54943;&#49688;&#51032; &#44050;&#51060; 0&#48372;&#45796; &#53360; &#44221;&#50864;&#50640;&#47564; &#49324;&#50857;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#45712;&#47536; &#50672;&#44208;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; &#51217;&#49549;&#51060; &#49324;&#50857;&#46112; &#44221;&#50864;&#50640;&#47564; &#47932;&#47532;&#51201; &#51217;&#49549;&#51060; &#45436;&#47532; &#47784;&#51020;&#44284; &#50672;&#44288;&#46121;&#45768;&#45796;. &#46608;&#54620; &#53944;&#47004;&#51117;&#49496;&#51060; &#50756;&#47308;&#46104;&#44256; &#44396;&#49457; &#50836;&#49548; &#47700;&#49548;&#46300;&#44032; &#51333;&#47308;&#46104;&#47732; &#50672;&#44288; &#54644;&#51228;&#46104;&#50612; &#47932;&#47532;&#51201; &#51217;&#49549;&#51012; &#51116;&#49324;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#51648;&#50672; &#51217;&#49549; &#52280;&#50668;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; &#49892;&#51228;&#47196; &#47532;&#49548;&#49828;&#44032; &#47700;&#49548;&#46300;&#50640; &#49324;&#50857;&#46112; &#44221;&#50864;&#50640;&#47564; &#47532;&#49548;&#49828;&#44032; &#53944;&#47004;&#51117;&#49496;&#50640; &#46321;&#47197;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#49828;&#47112;&#46300;&#50752; &#50672;&#44208;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; &#51217;&#49549;&#51060; &#49828;&#47112;&#46300;&#50752; &#50672;&#44288;&#46104;&#50612; &#51217;&#49549;&#50640;&#49436; &#44057;&#51008; &#49828;&#47112;&#46300;&#44032; &#54596;&#50836;&#54624; &#46412; &#54644;&#45817; &#49828;&#47112;&#46300;&#50640; &#51060;&#48120; &#50672;&#44288;&#46108; &#51217;&#49549;&#51012; &#51116;&#49324;&#50857;&#54632;&#51004;&#47196;&#50024; &#54400;&#50640;&#49436; &#51217;&#49549;&#51012; &#44032;&#51256;&#50732; &#46412; &#50724;&#48260;&#54756;&#46300; &#48156;&#49373;&#51060; &#48169;&#51648;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#51217;&#49549; &#51068;&#52824;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; &#54400;&#50640;&#49436; &#49440;&#53469;&#54616;&#45716; &#51217;&#49549;&#51060; &#53945;&#51221; &#51064;&#51613;&#49436;&#44032; &#51080;&#45716; &#51217;&#49549;&#44284; &#51068;&#52824;&#54644;&#50556; &#54633;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#50668;&#47084; &#44060;&#51032; &#49324;&#50857;&#51088; &#51064;&#51613;&#49436;&#44032; &#51080;&#45716; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640;&#49436; &#51217;&#49549; &#54400;&#51060; &#49324;&#50857;&#46104;&#45716; &#44221;&#50864; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54644;&#50556; &#54633;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#54400;&#51032; &#51217;&#49549;&#51060; &#54637;&#49345; &#44057;&#51008; &#51333;&#47448;&#51060;&#50612;&#49436; &#54400;&#50640;&#49436; &#49440;&#53469;&#46108; &#51217;&#49549;&#51012; &#47532;&#49548;&#49828; &#50612;&#45841;&#53552;&#50752; &#51068;&#52824;&#49884;&#53420; &#54596;&#50836;&#44032; &#50630;&#51020;&#51012; &#44288;&#47532;&#51088;&#44032; &#50508;&#44256; &#51080;&#51012; &#46412; &#50504;&#51204;&#54616;&#44172; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#52572;&#45824; &#51217;&#49549; &#49324;&#50857; &#49688;</dt>
<dd>
<p>&#54400;&#50640;&#49436; &#51217;&#49549;&#51012; &#51116;&#49324;&#50857;&#54624; &#54943;&#49688;&#51077;&#45768;&#45796;. &#51217;&#49549;&#51012; &#51648;&#51221;&#46108; &#54943;&#49688;&#47564;&#53372; &#51116;&#49324;&#50857;&#54620; &#45796;&#51020;&#50640;&#45716; &#54644;&#45817; &#51217;&#49549;&#51060; &#45803;&#55193;&#45768;&#45796;. &#51217;&#49549;&#51060; &#51116;&#49324;&#50857;&#46112; &#49688; &#51080;&#45716; &#54943;&#49688;&#47484; &#51228;&#54620;&#54616;&#50668; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#47749;&#47161;&#47928;&#51012; &#51333;&#47308;&#54616;&#51648; &#50506;&#51008; &#44221;&#50864; &#47749;&#47161;&#47928; &#45572;&#49688; &#48156;&#49373;&#51012; &#48169;&#51648;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#44050; 0&#51008; &#51060; &#49549;&#49457;&#51060; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50632;&#51020;&#51012; &#51032;&#48120;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 0&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51217;&#49549; &#44160;&#51613;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; &#51217;&#49549; &#44160;&#51613;&#51060; &#54596;&#49688;&#51201;&#51004;&#47196; &#49688;&#54665;&#46104;&#50612; &#49436;&#48260;&#44032; &#51217;&#49549;&#46104;&#51648; &#50506;&#51008; &#44221;&#50864; &#51116;&#51217;&#49549;&#46112; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#44160;&#51613; &#48169;&#48277;</dt>
<dd>
<p>GlassFish Server&#50640;&#49436; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#51217;&#49549;&#51012; &#44160;&#51613;&#54616;&#45716; &#48169;&#48277;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt><code>auto-commit</code> &#48143; <code>metadata</code></dt>
<dd>
<p>GlassFish Server&#50640;&#49436;&#45716; <code>con.getAutoCommit</code> &#46608;&#45716; <code>con.getMetaData</code> &#47700;&#49548;&#46300;&#47484; &#54840;&#52636;&#54616;&#50668; &#51217;&#49549;&#51012; &#44160;&#51613;&#54633;&#45768;&#45796;.</p>

<hr>
<p><b>&#51452;:</b></p>
&#47566;&#51008; JDBC &#46300;&#46972;&#51060;&#48260;&#50640;&#49436; &#51060;&#47084;&#54620; &#54840;&#52636;&#51032; &#44208;&#44284;&#47484; &#52880;&#49884;&#54633;&#45768;&#45796;. &#44536;&#47084;&#48064;&#47196; &#51060;&#47084;&#54620; &#54840;&#52636;&#51012; &#49324;&#50857;&#54616;&#47732; &#44221;&#50864;&#50640; &#46384;&#46972; &#49888;&#47280;&#54624; &#49688; &#50630;&#45716; &#44160;&#51613;&#51060; &#51228;&#44277;&#46112; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060;&#47084;&#54620; &#54840;&#52636;&#51032; &#52880;&#49884; &#50668;&#48512;&#47484; &#54032;&#45800;&#54616;&#47140;&#47732; &#46300;&#46972;&#51060;&#48260; &#44277;&#44553;&#50629;&#52404;&#50640; &#54869;&#51064;&#54633;&#45768;&#45796;.
<hr>

</dd>
<dt><code>custom-validation</code></dt>
<dd>
<p>GlassFish Server&#50640;&#49436;&#45716; &#49324;&#50857;&#51088; &#51221;&#51032; &#44396;&#54788; &#53364;&#47000;&#49828;&#50640; &#51032;&#54644; [&#44160;&#51613; &#53364;&#47000;&#49828; &#51060;&#47492;] &#54596;&#46300;&#50640; &#51648;&#51221;&#46108; &#49324;&#50857;&#51088; &#51221;&#51032; &#44160;&#51613; &#48169;&#49885;&#51012; &#49324;&#50857;&#54633;&#45768;&#45796;.</p>
</dd>
<dt><code>table</code></dt>
<dd>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640;&#49436; &#51648;&#51221;&#46108; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53580;&#51060;&#48660;&#51012; &#51656;&#51032;&#54633;&#45768;&#45796;. &#50529;&#49464;&#49828;&#54624; &#49688; &#51080;&#45716; &#53580;&#51060;&#48660;&#51060; &#51080;&#50612;&#50556; &#54616;&#51648;&#47564; &#54665;&#51008; &#50630;&#50612;&#46020; &#46121;&#45768;&#45796;. &#54665;&#51060; &#47566;&#51060; &#51080;&#45716; &#44592;&#51316; &#53580;&#51060;&#48660;&#51060;&#45208; &#51060;&#48120; &#51088;&#51452; &#50529;&#49464;&#49828;&#54616;&#45716; &#53580;&#51060;&#48660;&#51008; &#49324;&#50857;&#54616;&#51648; &#47560;&#49901;&#49884;&#50724;.</p>
</dd>
</dl>
</dd>
<dt>&#53580;&#51060;&#48660; &#51060;&#47492;</dt>
<dd>
<p>&#44160;&#51613;&#50640; &#49324;&#50857;&#54616;&#45716; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53580;&#51060;&#48660;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#44160;&#51613; &#48169;&#48277;&#51060; <code>table</code>&#47196; &#49444;&#51221;&#46108; &#44221;&#50864;&#50640;&#47564; &#51201;&#50857;&#46121;&#45768;&#45796;. &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#51060;&#47492;&#51012; &#49440;&#53469;&#54616;&#44144;&#45208; &#51077;&#47141;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#44160;&#51613; &#53364;&#47000;&#49828; &#51060;&#47492;</dt>
<dd>
<p>&#49324;&#50857;&#51088; &#51221;&#51032; &#44160;&#51613; &#44396;&#54788; &#53364;&#47000;&#49828; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#44160;&#51613; &#48169;&#48277;&#51060; <code>custom-validation</code>&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864;&#50640;&#47564; &#51201;&#50857;&#46121;&#45768;&#45796;. &#51228;&#44277;&#46108; &#53364;&#47000;&#49828; &#51060;&#47492;&#51008; GlassFish Server&#50640;&#49436; &#50529;&#49464;&#49828;&#54624; &#49688; &#51080;&#50612;&#50556; &#54633;&#45768;&#45796;. &#51648;&#51221;&#46108; &#53364;&#47000;&#49828;&#45716; <code>org.glassfish.api.jdbc.ConnectionValidation</code> &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#44396;&#54788;&#54644;&#50556; &#54633;&#45768;&#45796;. &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#51060;&#47492;&#51012; &#49440;&#53469;&#54616;&#44144;&#45208; &#51077;&#47141;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#49892;&#54056; &#49884;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; GlassFish Server&#50640;&#49436; &#54400;&#50640; &#51080;&#45716; &#47784;&#46304; &#51217;&#49549;&#51012; &#45803;&#44256; &#51217;&#49549; &#49892;&#54056; &#49884; &#51217;&#49549;&#51012; &#45796;&#49884; &#49444;&#51221;&#54633;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51012; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; &#44060;&#48324; &#51217;&#49549;&#51060; &#49324;&#50857;&#46104;&#45716; &#44221;&#50864;&#50640;&#47564; &#45796;&#49884; &#49444;&#51221;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#44396;&#49457; &#50836;&#49548;&#44032; &#50500;&#45772; &#54840;&#52636;&#51088; &#54728;&#50857;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; &#49436;&#48660;&#47551; &#54596;&#53552; &#48143; &#53440;&#49324; &#51648;&#49549;&#49457; &#44288;&#47532;&#51088;&#50752; &#44057;&#51060; &#44396;&#49457; &#50836;&#49548;&#44032; &#50500;&#45772; &#54840;&#52636;&#51088;&#44032; &#54400;&#51012; &#49324;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#44396;&#49457; &#50836;&#49548;&#44032; &#50500;&#45772; &#54840;&#52636;&#51088;&#44032; &#50619;&#51008; &#51217;&#49549;&#51008; &#53944;&#47004;&#51117;&#49496;&#51060; &#51333;&#47308;&#46112; &#46412; &#52968;&#53580;&#51060;&#45320;&#50640; &#51032;&#54644; &#51088;&#46041;&#51004;&#47196; &#45803;&#55176;&#51648; &#50506;&#49845;&#45768;&#45796;. &#51060; &#50672;&#44208;&#51008; &#54840;&#52636;&#51088;&#44032; &#47749;&#49884;&#51201;&#51004;&#47196; &#45803;&#50500;&#50556; &#54633;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref51" name="sthref51"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#50529;&#49464;&#49828;&#47484; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">JDBC &#46300;&#46972;&#51060;&#48260;&#47484; &#53685;&#54633;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">JDBC &#51217;&#49549; &#54400;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">JDBC &#51217;&#49549; &#54400; &#51068;&#48152; &#49444;&#51221;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">&#51217;&#49549; &#54400; &#49444;&#51221;&#51012; &#54869;&#51064;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">JDBC &#51217;&#49549; &#54400; &#44256;&#44553; &#49549;&#49457;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">JDBC &#51217;&#49549; &#54400; &#49549;&#49457;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">JDBC &#51217;&#49549; &#54400;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="sthref52" name="sthref52"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00001"><code>add-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00036"><code>create-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00088"><code>delete-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00135"><code>flush-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00173"><code>list-jdbc-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00214"><code>ping-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00234"><code>start-database</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00239"><code>stop-database</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
