<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jdbc" name="ref-jdbc"></a><a id="GHJDB00019" name="GHJDB00019"></a></p>

<h4><a id="sthref26" name="sthref26"></a>JDBC</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>JDBC &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; &#45796;&#51020; &#50976;&#54805;&#51032; &#47532;&#49548;&#49828;&#47484; &#44396;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<ul>
<li>
<p><a href="ref-jdbcresources.html">JDBC &#47532;&#49548;&#49828;</a></p>
</li>
<li>
<p><a href="ref-jdbcconnectionpools.html">&#51217;&#49549; &#54400;</a></p>
</li>
</ul>
<p>JDBC(Java DataBase Connectivity) &#44592;&#49696;&#51008; &#44288;&#44228;&#54805; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#50640; &#45824;&#54620; &#51217;&#49549;&#51012; &#51228;&#44277;&#54633;&#45768;&#45796;. GlassFish Server&#50640;&#49436; &#46020;&#47700;&#51064;&#50640; JDBC &#47532;&#49548;&#49828;(&#45936;&#51060;&#53552; &#49548;&#49828;)&#47484; &#52628;&#44032;&#54616;&#50668; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#51217;&#49549;&#51012; &#44396;&#49457;&#54633;&#45768;&#45796;. &#45936;&#51060;&#53552; &#49548;&#49828;&#45716; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#50640; &#45824;&#54620; &#51217;&#49549;&#51012; &#44396;&#49457;&#54616;&#45716; Java &#54540;&#47019;&#54268;, Enterprise Edition(Java EE &#54540;&#47019;&#54268;)&#51032; &#54364;&#51456; &#47700;&#49548;&#46300;&#51077;&#45768;&#45796;. &#44033; &#45936;&#51060;&#53552; &#49548;&#49828;&#50640;&#45716; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#51217;&#49549;&#51032; &#54400;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;. &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51008; JNDI(Java Naming and Directory Interface) API &#53944;&#47532; &#46608;&#45716; &#47196;&#52972; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016; &#52968;&#53581;&#49828;&#53944;&#50640;&#49436; &#45936;&#51060;&#53552; &#49548;&#49828;&#47484; &#52286;&#51008; &#45796;&#51020; <code>getConnection</code> &#47700;&#49548;&#46300;&#47196; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#51217;&#49549;&#51012; &#44160;&#49353;&#54633;&#45768;&#45796;. &#45936;&#51060;&#53552; &#49548;&#49828; &#48143; &#51217;&#49549; &#54400;&#51008; &#49884;&#49828;&#53596;&#51012; &#49892;&#54665; &#49345;&#53468;&#47196; &#50976;&#51648;&#54616;&#45716; &#45936; &#46020;&#50880;&#51012; &#51452;&#45716; &#51217;&#49549; &#44288;&#47532; &#54532;&#47196;&#49464;&#49828;&#47484; &#51228;&#44277;&#54633;&#45768;&#45796;.</p>
<p>GlassFish Server&#50640;&#45716; Java DB &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#51032; &#48373;&#49324;&#48376;&#51060; &#54252;&#54632;&#46104;&#44256; &#51060; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#50640; &#50529;&#49464;&#49828;&#54624; &#49688; &#51080;&#45716; &#44592;&#45733;&#51060; &#49324;&#51204; &#44396;&#49457;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
