<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jdbcconnectionpooladvance" name="task-jdbcconnectionpooladvance"></a></p>

<h4><a id="sthref19" name="sthref19"></a>JDBC &#51217;&#49549; &#54400; &#44256;&#44553; &#49549;&#49457;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#53456;&#49353; &#53944;&#47532;&#50640;&#49436; [&#47532;&#49548;&#49828;] &#45432;&#46300;&#47484; &#54869;&#51109;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#47532;&#49548;&#49828;] &#45432;&#46300;&#50640;&#49436; JDBC &#45432;&#46300;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>JDBC &#45432;&#46300;&#50640;&#49436; [&#51217;&#49549; &#54400;] &#45432;&#46300;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>[&#51217;&#49549; &#54400;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51217;&#49549; &#54400;] &#54168;&#51060;&#51648;&#50640;&#49436; &#54200;&#51665;&#54624; &#54400;&#51032; &#51060;&#47492;&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
<p>[&#51217;&#49549; &#54400; &#54200;&#51665;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51217;&#49549; &#54400; &#54200;&#51665;] &#54168;&#51060;&#51648;&#50640;&#49436; [&#44256;&#44553;] &#53485;&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
<p>[&#51217;&#49549; &#54400; &#44256;&#44553; &#49549;&#49457; &#54200;&#51665;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#47749;&#47161;&#47928; &#49884;&#44036; &#52488;&#44284;] &#54596;&#46300;&#50640; &#48708;&#51221;&#49345;&#51201;&#51004;&#47196; &#44600;&#44172; &#49892;&#54665;&#46104;&#45716; &#51656;&#51032;&#47484; &#51333;&#47308;&#54616;&#44592; &#51204;&#44620;&#51648;&#51032; &#49884;&#44036;(&#52488;)&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>GlassFish Server&#50640;&#49436;&#45716; &#47749;&#47161;&#47928;&#51012; &#49373;&#49457;&#54624; &#46412; <code>QueryTimeout</code>&#51012; &#49444;&#51221;&#54633;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51012; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54616;&#47140;&#47732; &#44050;&#51012; -1&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; -1&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#47749;&#47161;&#47928; &#52880;&#49884; &#53356;&#44592;] &#54596;&#46300;&#50640; LRU(&#44032;&#51109; &#50724;&#47000; &#51204;&#50640; &#49324;&#50857;&#46120;) &#52880;&#49905; &#48169;&#49885;&#51012; &#49324;&#50857;&#54616;&#50668; &#52880;&#49884;&#54624; &#47749;&#47161;&#47928; &#49688;&#51077;&#45768;&#45796;.</p>
<p>&#47749;&#47161;&#47928; &#52880;&#49905;&#51012; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54616;&#47140;&#47732; &#44050;&#51012; 0&#51004;&#47196; &#51648;&#51221;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 0&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#52488;&#44592; SQL &#54596;&#46300;]&#50640; &#54400;&#50640;&#49436; &#51217;&#49549;&#51060; &#49373;&#49457;&#46112; &#46412;&#47560;&#45796;(&#51116;&#49324;&#50857;&#46104;&#51648; &#50506;&#51020;) &#49892;&#54665;&#54624; SQL &#47928;&#51088;&#50676;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#47928;&#51088;&#50676;&#51060; &#49892;&#54665;&#46104;&#47732; &#51217;&#49549; &#49345;&#53468;&#44032; &#52488;&#44592;&#54868;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>[SQL &#52628;&#51201; &#47532;&#49828;&#45320;] &#54596;&#46300;&#50640;&#49436; &#47532;&#49828;&#45320; &#44396;&#54788; &#53364;&#47000;&#49828; &#51060;&#47492;&#51032; &#53092;&#47560;&#47196; &#44396;&#48516;&#46108; &#47785;&#47197;&#51012; &#51077;&#47141;&#54616;&#50668; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640;&#49436; &#49892;&#54665;&#46108; SQL &#47749;&#47161;&#47928;&#51060; &#52628;&#51201;&#46104;&#46020;&#47197; &#51648;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#47532;&#49828;&#45320; &#53364;&#47000;&#49828;&#45716; <code>org.glassfish.api.jdbc.SQLTraceListener</code> &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#44396;&#54788;&#54644;&#50556; &#54633;&#45768;&#45796;. &#47532;&#49828;&#45320;&#47484; &#49324;&#50857;&#54616;&#47732; SQL &#47928;&#50640; &#45824;&#54620; &#47196;&#44536; &#47700;&#49884;&#51648;&#47484; &#49789;&#44172; &#54596;&#53552;&#47553;&#54616;&#44256; &#44288;&#47532;&#51088;&#44032; &#47749;&#47161;&#47928;&#51012; &#48516;&#49437;&#54616;&#46020;&#47197; &#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[JDBC &#44061;&#52404; &#47000;&#54609; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#47732; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640;&#49436; <code>Statement</code>, <code>PreparedStatement</code>, <code>CallableStatement</code>, <code>ResultSet</code>, <code>DatabaseMetaData</code>&#50640; &#45824;&#54620; JDBC &#44061;&#52404;&#44032; &#47000;&#54609;&#46121;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>&#54400;&#50640; &#45824;&#54620; &#51217;&#49549; &#54400;&#47553;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47140;&#47732; [&#54400;&#47553;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#52572;&#45824; 1&#54924; &#44160;&#51613; &#44592;&#44036;] &#54596;&#46300;&#50640;&#49436; &#51217;&#49549;&#51060; &#52572;&#45824; 1&#54924; &#44160;&#51613;&#46104;&#44592;&#44620;&#51648;&#51032; &#49884;&#44036;(&#52488;)&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#49549;&#49457;&#51012; &#51201;&#51208;&#54620; &#44050;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; &#51217;&#49549;&#51032; &#44160;&#51613; &#50836;&#52397; &#54943;&#49688;&#44032; &#52572;&#49548;&#54868;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 0&#51077;&#45768;&#45796;. &#44050;&#51060; 0&#51060;&#47732; &#49549;&#49457;&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46104;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51217;&#49549; &#45572;&#49688; &#49884;&#44036; &#52488;&#44284;] &#54596;&#46300;&#50640;&#49436; &#51217;&#49549; &#54400;&#51032; &#51217;&#49549; &#45572;&#49688;&#47484; &#52628;&#51201;&#54624; &#49884;&#44036;(&#52488;)&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#54596;&#46300;&#47484; &#49324;&#50857;&#54616;&#50668; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640;&#49436; &#48156;&#49373;&#54624; &#49688; &#51080;&#45716; &#51104;&#51116;&#51201;&#51064; &#51217;&#49549; &#45572;&#49688;&#47484; &#44160;&#49353;&#54633;&#45768;&#45796;. &#51648;&#51221;&#46108; &#44592;&#44036; &#45236;&#50640; &#51217;&#49549;&#51060; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#51032;&#54644; &#54400;&#47196; &#46104;&#46028;&#50500;&#44032;&#51648; &#50506;&#51004;&#47732; &#51104;&#51116;&#51201;&#51004;&#47196; &#45572;&#49688;&#46104;&#44256; &#51080;&#45796;&#44256; &#44036;&#51452;&#46104;&#50612; &#54840;&#52636;&#51088;&#51032; &#49828;&#53469; &#52628;&#51201;&#51060; &#47196;&#44613;&#46121;&#45768;&#45796;. &#51217;&#49549; &#45572;&#49688; &#52628;&#51201;&#51012; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54616;&#47140;&#47732; &#44050;&#51012; 0&#51004;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 0&#51077;&#45768;&#45796;.</p>
<p>&#51060; &#54596;&#46300;&#47484; &#51217;&#49549; &#45572;&#49688; &#51116;&#49373;&#44284; &#54632;&#44760; &#49324;&#50857;&#54616;&#47732; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640;&#49436; &#51104;&#51116;&#51201;&#51064; &#51217;&#49549; &#45572;&#49688;&#44032; &#48156;&#49373;&#54616;&#45716; &#44163;&#51012; &#48169;&#51648;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51217;&#49549; &#45572;&#49688; &#51116;&#49373;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#47732; &#45572;&#49688; &#50672;&#44208; &#52628;&#51201;&#51060; &#50756;&#47308;&#46108; &#54980;&#50640; &#45572;&#49688;&#46108; &#50672;&#44208;&#51060; &#54400;&#47196; &#48373;&#50896;&#46121;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#47749;&#47161;&#47928; &#45572;&#49688; &#49884;&#44036; &#52488;&#44284;] &#54596;&#46300;&#50640;&#49436; &#51217;&#49549; &#54400;&#51032; &#47749;&#47161;&#47928; &#45572;&#49688;&#47484; &#52628;&#51201;&#54624; &#49884;&#44036;(&#52488;)&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#54596;&#46300;&#50640;&#49436;&#45716; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640;&#49436; &#48156;&#49373;&#54624; &#49688; &#51080;&#45716; &#47749;&#47161;&#47928; &#45572;&#49688;&#47484; &#44160;&#49353;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51648;&#51221;&#46108; &#44592;&#44036; &#45236;&#50640; &#47749;&#47161;&#47928;&#51060; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#51032;&#54644; &#54400;&#47196; &#46104;&#46028;&#50500;&#44032;&#51648; &#50506;&#51004;&#47732; &#51104;&#51116;&#51201;&#51004;&#47196; &#45572;&#49688;&#46104;&#44256; &#51080;&#45796;&#44256; &#44036;&#51452;&#46104;&#50612; &#54840;&#52636;&#51088;&#51032; &#49828;&#53469; &#52628;&#51201;&#51060; &#47196;&#44613;&#46121;&#45768;&#45796;. &#47749;&#47161;&#47928; &#45572;&#49688; &#52628;&#51201;&#51012; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54616;&#47140;&#47732; &#44050;&#51012; 0&#51004;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 0&#51077;&#45768;&#45796;.</p>
<p>&#51060; &#54596;&#46300;&#47484; &#47749;&#47161;&#47928; &#45572;&#49688; &#51116;&#49373;&#44284; &#54632;&#44760; &#49324;&#50857;&#54616;&#47732; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640;&#49436; &#51104;&#51116;&#51201;&#51064; &#47749;&#47161;&#47928; &#45572;&#49688;&#44032; &#48156;&#49373;&#54616;&#45716; &#44163;&#51012; &#48169;&#51648;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#45572;&#49688; &#51116;&#49373;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#47732; &#45572;&#49688; &#47749;&#47161;&#47928; &#52628;&#51201;&#51060; &#50756;&#47308;&#46108; &#54980;&#50640; &#45572;&#49688;&#46108; &#47749;&#47161;&#47928;&#51060; &#54400;&#47196; &#48373;&#50896;&#46121;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#49373;&#49457; &#51116;&#49884;&#46020; &#54943;&#49688;] &#54596;&#46300;&#50640;&#49436; &#49352; &#51217;&#49549; &#49373;&#49457;&#50640; &#49892;&#54056;&#54624; &#44221;&#50864; &#51116;&#49884;&#46020;&#54624; &#54943;&#49688;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#51217;&#49549; &#45796;&#49884; &#49373;&#49457;&#54616;&#44592; &#50948;&#54620; &#54943;&#49688;&#47484; &#51648;&#51221;&#54616;&#51648; &#50506;&#51004;&#47140;&#47732; &#44050;&#51012; 0&#51004;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 0&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51116;&#49884;&#46020; &#44036;&#44201;] &#54596;&#46300;&#50640;&#49436; &#51217;&#49549;&#51012; &#49373;&#49457;&#54616;&#44592; &#50948;&#54620; &#46160; &#49884;&#46020; &#44036;&#51032; &#44036;&#44201;(&#52488;)&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; 10&#51077;&#45768;&#45796;. &#51060; &#49549;&#49457;&#51008; &#49373;&#49457; &#51116;&#49884;&#46020; &#54943;&#49688;&#51032; &#44050;&#51060; 0&#48372;&#45796; &#53360; &#44221;&#50864;&#50640;&#47564; &#49324;&#50857;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>&#51217;&#49549;&#51060; &#49324;&#50857;&#46112; &#46412;&#50640;&#47564; &#47932;&#47532;&#51201; &#51217;&#49549;&#51012; &#45436;&#47532; &#47784;&#51020;&#44284; &#50672;&#44288;&#49884;&#53412;&#47140;&#47732; [&#45712;&#47536; &#50672;&#44208; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#46608;&#54620; &#53944;&#47004;&#51117;&#49496;&#51060; &#50756;&#47308;&#46104;&#44256; &#44396;&#49457; &#50836;&#49548; &#47700;&#49548;&#46300;&#44032; &#51333;&#47308;&#46104;&#47732; &#50672;&#44288; &#54644;&#51228;&#46104;&#50612; &#47932;&#47532;&#51201; &#51217;&#49549;&#51012; &#51116;&#49324;&#50857;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51060; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#47932;&#47532;&#51201; &#51217;&#49549;&#51008; &#49324;&#50857;&#46104;&#44592; &#51204;&#51060;&#46972;&#46020; &#45436;&#47532;&#51201; &#51217;&#49549;&#44284; &#50672;&#44288;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>&#49892;&#51228;&#47196; &#47700;&#49548;&#46300;&#50640;&#49436; &#49324;&#50857;&#46112; &#44221;&#50864;&#50640;&#47564; &#47532;&#49548;&#49828;&#47484; &#53944;&#47004;&#51117;&#49496;&#50640; &#46321;&#47197;&#54616;&#47140;&#47732; [&#51648;&#50672; &#51217;&#49549; &#52280;&#50668; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>&#51217;&#49549;&#44284; &#49828;&#47112;&#46300; &#44036;&#50640; &#50672;&#44288;&#51012; &#49373;&#49457;&#54616;&#47140;&#47732; [&#49828;&#47112;&#46300;&#50752; &#50672;&#44208;] &#49324;&#50857; &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#45796;&#47480; &#51217;&#49549;&#50640; &#45824;&#54644; &#46041;&#51068;&#54620; &#49828;&#47112;&#46300;&#44032; &#54596;&#50836;&#54620; &#44221;&#50864; &#54644;&#45817; &#49828;&#47112;&#46300;&#50752; &#51060;&#48120; &#50672;&#44288;&#46108; &#51217;&#49549;&#51012; &#51116;&#49324;&#50857;&#54624; &#49688; &#51080;&#44592; &#46412;&#47928;&#50640; &#54400;&#50640;&#49436; &#45796;&#47480; &#51217;&#49549;&#50640; &#45824;&#54620; &#50724;&#48260;&#54756;&#46300;&#44032; &#48156;&#49373;&#54616;&#51648; &#50506;&#49845;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>&#54400;&#50640; &#45824;&#54644; &#51068;&#52824;&#54616;&#45716; &#51217;&#49549;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47140;&#47732; [&#51217;&#49549; &#51068;&#52824; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51012; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54616;&#47732; &#54400;&#50640;&#49436; &#49440;&#53469;&#54616;&#45716; &#51217;&#49549;&#51060; &#53945;&#51221; &#51064;&#51613;&#49436;&#44032; &#51080;&#45716; &#51217;&#49549;&#44284; &#51068;&#52824;&#54644;&#50556; &#54633;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#50668;&#47084; &#44060;&#51032; &#49324;&#50857;&#51088; &#51064;&#51613;&#49436;&#44032; &#51080;&#45716; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640;&#49436; &#51217;&#49549; &#54400;&#51060; &#49324;&#50857;&#46104;&#45716; &#44221;&#50864; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#54644;&#50556; &#54633;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#54400;&#51032; &#51217;&#49549;&#51060; &#54637;&#49345; &#44057;&#51008; &#51333;&#47448;&#51060;&#47728; &#46384;&#46972;&#49436; &#54400;&#50640;&#49436; &#49440;&#53469;&#46108; &#51217;&#49549;&#51012; &#47532;&#49548;&#49828; &#50612;&#45841;&#53552;&#50752; &#51068;&#52824;&#49884;&#53420; &#54596;&#50836;&#44032; &#50630;&#51020;&#51012; &#44288;&#47532;&#51088;&#44032; &#50508;&#44256; &#51080;&#51012; &#46412; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#52572;&#45824; &#51217;&#49549; &#49324;&#50857; &#49688;] &#54596;&#46300;&#50640; &#54400;&#50640;&#49436; &#51217;&#49549;&#51012; &#45796;&#49884; &#49324;&#50857;&#54624; &#54943;&#49688;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#51217;&#49549;&#51012; &#51648;&#51221;&#46108; &#54943;&#49688;&#47564;&#53372; &#51116;&#49324;&#50857;&#54620; &#45796;&#51020;&#50640;&#45716; &#54644;&#45817; &#51217;&#49549;&#51060; &#45803;&#55193;&#45768;&#45796;. &#51217;&#49549;&#51060; &#51116;&#49324;&#50857;&#46112; &#49688; &#51080;&#45716; &#54943;&#49688;&#47484; &#51228;&#54620;&#54616;&#50668; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#47749;&#47161;&#47928;&#51012; &#51333;&#47308;&#54616;&#51648; &#50506;&#51008; &#44221;&#50864; &#47749;&#47161;&#47928; &#45572;&#49688; &#48156;&#49373;&#51012; &#48169;&#51648;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060; &#49549;&#49457;&#51012; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54616;&#47140;&#47732; &#44050;&#51012; 0&#51004;&#47196; &#49444;&#51221;&#54633;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 0&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51217;&#49549; &#44160;&#51613; &#54596;&#50836;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#50668; &#51217;&#49549; &#44160;&#51613;&#51012; &#49324;&#50857;&#54616;&#46020;&#47197; &#49444;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#49892;&#54056;&#54616;&#45716; &#44221;&#50864; &#49436;&#48260;&#50640;&#49436; &#51217;&#49549; &#44160;&#51613;&#51012; &#49324;&#50857;&#54616;&#50668; &#51116;&#51217;&#49549;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#44160;&#51613; &#48169;&#48277;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#44160;&#51613; &#48169;&#48277;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>GlassFish Server&#50640;&#49436; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#51217;&#49549;&#51012; &#44160;&#51613;&#54616;&#45716; &#48169;&#48277;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<dl>
<dt><code>auto-commit</code> &#48143; <code>metadata</code></dt>
<dd>
<p>GlassFish Server&#50640;&#49436;&#45716; <code>con.getAutoCommit</code> &#48143; <code>con.getMetaData</code> &#47700;&#49548;&#46300;&#47484; &#54840;&#52636;&#54616;&#50668; &#51217;&#49549;&#51012; &#44160;&#51613;&#54633;&#45768;&#45796;.</p>

<hr>
<p><b>&#51452;:</b></p>
&#47566;&#51008; JDBC &#46300;&#46972;&#51060;&#48260;&#50640;&#49436; &#51060;&#47084;&#54620; &#54840;&#52636;&#51032; &#44208;&#44284;&#47484; &#52880;&#49884;&#54633;&#45768;&#45796;. &#44536;&#47084;&#48064;&#47196; &#51060;&#47084;&#54620; &#54840;&#52636;&#51012; &#49324;&#50857;&#54616;&#47732; &#44221;&#50864;&#50640; &#46384;&#46972; &#49888;&#47280;&#54624; &#49688; &#50630;&#45716; &#44160;&#51613;&#51060; &#51228;&#44277;&#46112; &#49688; &#51080;&#49845;&#45768;&#45796;. &#51060;&#47084;&#54620; &#54840;&#52636;&#51032; &#52880;&#49884; &#50668;&#48512;&#47484; &#54032;&#45800;&#54616;&#47140;&#47732; &#46300;&#46972;&#51060;&#48260; &#44277;&#44553;&#50629;&#52404;&#50640; &#54869;&#51064;&#54633;&#45768;&#45796;.
<hr>

</dd>
<dt><code>custom-validation</code></dt>
<dd>
<p>GlassFish Server&#50640;&#49436;&#45716; &#49324;&#50857;&#51088; &#51221;&#51032; &#44396;&#54788; &#53364;&#47000;&#49828;&#50640; &#51032;&#54644; [&#44160;&#51613; &#53364;&#47000;&#49828; &#51060;&#47492;] &#54596;&#46300;&#50640; &#51648;&#51221;&#46108; &#49324;&#50857;&#51088; &#51221;&#51032; &#44160;&#51613; &#48169;&#49885;&#51012; &#49324;&#50857;&#54633;&#45768;&#45796;.</p>
</dd>
<dt><code>table</code></dt>
<dd>
<p>&#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640;&#49436; &#51648;&#51221;&#46108; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53580;&#51060;&#48660;&#51012; &#51656;&#51032;&#54633;&#45768;&#45796;. &#50529;&#49464;&#49828;&#54624; &#49688; &#51080;&#45716; &#53580;&#51060;&#48660;&#51060; &#51080;&#50612;&#50556; &#54616;&#51648;&#47564; &#54665;&#51008; &#50630;&#50612;&#46020; &#46121;&#45768;&#45796;. &#54665;&#51060; &#47566;&#51060; &#51080;&#45716; &#44592;&#51316; &#53580;&#51060;&#48660;&#51060;&#45208; &#51060;&#48120; &#51088;&#51452; &#50529;&#49464;&#49828;&#54616;&#45716; &#53580;&#51060;&#48660;&#51008; &#49324;&#50857;&#54616;&#51648; &#47560;&#49901;&#49884;&#50724;.</p>
</dd>
</dl>
</li>
<li>
<p>[&#44160;&#51613; &#48169;&#48277;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; <code>table</code>&#51012; &#49440;&#53469;&#54620; &#44221;&#50864; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#53580;&#51060;&#48660;&#51032; &#51060;&#47492;&#51012; &#51077;&#47141;&#54616;&#44144;&#45208; &#53580;&#51060;&#48660; &#51060;&#47492; &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#44160;&#51613; &#48169;&#48277;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; <code>custom-validation</code>&#51012; &#49440;&#53469;&#54620; &#44221;&#50864; &#49324;&#50857;&#51088; &#51221;&#51032; &#44160;&#51613; &#44396;&#54788; &#53364;&#47000;&#49828; &#51060;&#47492;&#51012; &#51077;&#47141;&#54616;&#44144;&#45208; &#44160;&#51613; &#53364;&#47000;&#49828; &#51060;&#47492; &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#51228;&#44277;&#46108; &#53364;&#47000;&#49828; &#51060;&#47492;&#51008; GlassFish Server&#50640;&#49436; &#50529;&#49464;&#49828;&#54624; &#49688; &#51080;&#50612;&#50556; &#54633;&#45768;&#45796;. &#51648;&#51221;&#46108; &#53364;&#47000;&#49828;&#45716; <code>org.glassfish.api.jdbc.ConnectionValidation</code> &#51064;&#53552;&#54168;&#51060;&#49828;&#47484; &#44396;&#54788;&#54644;&#50556; &#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#49892;&#54056; &#49884; &#47784;&#46304; &#51217;&#49549; &#45803;&#44592;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#50668; &#45800;&#51068; &#51217;&#49549;&#51060; &#49892;&#54056;&#54624; &#44221;&#50864; &#49436;&#48260;&#50640;&#49436; &#54400;&#51032; &#47784;&#46304; &#51217;&#49549;&#51012; &#45803;&#44256; &#51116;&#49444;&#51221;&#54616;&#46020;&#47197; &#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51060; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46108; &#44221;&#50864; &#44060;&#48324; &#51217;&#49549;&#51060; &#49324;&#50857;&#46104;&#45716; &#44221;&#50864;&#50640;&#47564; &#45796;&#49884; &#49444;&#51221;&#46121;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>&#49436;&#48660;&#47551; &#54596;&#53552; &#48143; &#53440;&#49324; &#51648;&#49549;&#49457; &#44288;&#47532;&#51088;&#50752; &#44057;&#51060; &#44396;&#49457; &#50836;&#49548;&#44032; &#50500;&#45772; &#54840;&#52636;&#51088;&#44032; &#54400;&#51012; &#49324;&#50857;&#54624; &#49688; &#51080;&#44172; &#54616;&#47140;&#47732; [&#44396;&#49457; &#50836;&#49548;&#44032; &#50500;&#45772; &#54840;&#52636;&#51088; &#54728;&#50857; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#44396;&#49457; &#50836;&#49548;&#44032; &#50500;&#45772; &#54840;&#52636;&#51088;&#44032; &#50619;&#51008; &#51217;&#49549;&#51008; &#53944;&#47004;&#51117;&#49496;&#51060; &#51333;&#47308;&#46112; &#46412; &#52968;&#53580;&#51060;&#45320;&#50640; &#51032;&#54644; &#51088;&#46041;&#51004;&#47196; &#45803;&#55176;&#51648; &#50506;&#49845;&#45768;&#45796;. &#51060; &#50672;&#44208;&#51008; &#54840;&#52636;&#51088;&#44032; &#47749;&#49884;&#51201;&#51004;&#47196; &#45803;&#50500;&#50556; &#54633;&#45768;&#45796;. &#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51068;&#48152;] &#53485;&#51032; [&#48708;&#50864;&#44592;] &#45800;&#52628;&#47484; &#45580;&#47084; &#54400;&#50640;&#49436; &#47784;&#46304; &#51217;&#49549;&#51012; &#48708;&#50881;&#45768;&#45796;.</p>
<p>[&#48708;&#50864;&#44592;] &#45800;&#52628;&#47484; &#45572;&#47476;&#47732; &#44592;&#51316; &#51217;&#49549;&#51060; &#47784;&#46160; &#49325;&#51228;&#46104;&#44256;, &#54400;&#50640; &#45824;&#54644; &#49444;&#51221;&#46108; &#51217;&#49549;&#51060; &#45796;&#49884; &#49373;&#49457;&#46104;&#47728;, &#54400;&#51060; &#52488;&#44592; &#48143; &#52572;&#49548; &#54400; &#53356;&#44592;&#47196; &#48373;&#50896;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51200;&#51109;]&#51012; &#45572;&#47493;&#45768;&#45796;.</p>

<hr>
<p><b>&#54017;:</b></p>
&#44592;&#48376; &#49444;&#51221;&#51004;&#47196; &#46028;&#50500;&#44032;&#47140;&#47732; [&#44592;&#48376;&#44050; &#47196;&#46300;] &#45800;&#52628;&#47484; &#45572;&#47480; &#45796;&#51020; [&#51200;&#51109;]&#51012; &#45572;&#47493;&#45768;&#45796;.
<hr>

</li>
</ol>
<a id="sthref20" name="sthref20"></a>
<h5>&#44288;&#47144; &#54637;&#47785;</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#50529;&#49464;&#49828;&#47484; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">JDBC &#46300;&#46972;&#51060;&#48260;&#47484; &#53685;&#54633;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcenew.html">JDBC &#47532;&#49548;&#49828;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesedit.html">JDBC &#47532;&#49548;&#49828;&#47484; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcetargets.html">JDBC &#47532;&#49548;&#49828; &#45824;&#49345;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesdelete.html">JDBC &#47532;&#49548;&#49828;&#47484; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">JDBC &#51217;&#49549; &#54400;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">JDBC &#51217;&#49549; &#54400; &#51068;&#48152; &#49444;&#51221;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">&#51217;&#49549; &#54400; &#49444;&#51221;&#51012; &#54869;&#51064;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">JDBC &#51217;&#49549; &#54400; &#49549;&#49457;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">JDBC &#51217;&#49549; &#54400;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
