<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jdbcconnectionpooledit" name="task-jdbcconnectionpooledit"></a></p>

<h4><a id="sthref17" name="sthref17"></a>JDBC &#51217;&#49549; &#54400; &#51068;&#48152; &#49444;&#51221;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#53456;&#49353; &#53944;&#47532;&#50640;&#49436; [&#47532;&#49548;&#49828;] &#45432;&#46300;&#47484; &#54869;&#51109;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#47532;&#49548;&#49828;] &#45432;&#46300;&#50640;&#49436; JDBC &#45432;&#46300;&#47484; &#54869;&#51109;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>JDBC &#45432;&#46300;&#50640;&#49436; [&#51217;&#49549; &#54400;] &#45432;&#46300;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>[&#51217;&#49549; &#54400;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>&#54200;&#51665;&#54624; &#51217;&#49549; &#54400;&#51032; &#51060;&#47492;&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
<p>[&#51217;&#49549; &#54400; &#54200;&#51665;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#47532;&#49548;&#49828; &#50976;&#54805;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#47532;&#49548;&#49828; &#50976;&#54805;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#49440;&#53469; &#54637;&#47785;&#50640;&#45716; <code>javax.sql.DataSource</code>(&#47196;&#52972; &#53944;&#47004;&#51117;&#49496;&#50640;&#47564; &#54644;&#45817;), <code>javax.sql.XADataSource</code>(&#51204;&#50669; &#53944;&#47004;&#51117;&#49496;) &#48143; <code>java.sql.ConnectionPoolDataSource</code>(&#47196;&#52972; &#53944;&#47004;&#51117;&#49496;, &#49457;&#45733; &#54693;&#49345; &#44032;&#45733;)&#44032; &#54252;&#54632;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#45936;&#51060;&#53552; &#49548;&#49828; &#53364;&#47000;&#49828; &#51060;&#47492;] &#54596;&#46300;&#50640; <code>DataSource</code>, <code>ConnectionPoolDataSource</code> &#46608;&#45716; <code>XADataSource</code> API&#47484; &#44396;&#54788;&#54616;&#45716; &#44277;&#44553;&#50629;&#52404;&#48324; &#53364;&#47000;&#49828; &#51060;&#47492;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#45936;&#51060;&#53552; &#49548;&#49828; &#47532;&#49548;&#49828; &#50976;&#54805; &#51473; &#54616;&#45208;&#47484; &#49440;&#53469;&#54620; &#44221;&#50864; &#51068;&#48152;&#51201;&#51004;&#47196; &#51060; &#54596;&#46300;&#50640;&#45716; &#49440;&#53469;&#54620; &#47532;&#49548;&#49828; &#50976;&#54805; &#48143; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#44277;&#44553;&#50629;&#52404;&#50752; &#50672;&#44288;&#46108; &#53364;&#47000;&#49828; &#51060;&#47492;&#51060; &#51088;&#46041;&#51004;&#47196; &#51077;&#47141;&#46121;&#45768;&#45796;. <code>java.sql.Driver</code> &#47532;&#49548;&#49828; &#50976;&#54805;&#51012; &#49440;&#53469;&#54620; &#44221;&#50864; &#51060; &#54596;&#46300;&#45716; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#46300;&#46972;&#51060;&#48260; &#53364;&#47000;&#49828; &#51060;&#47492;] &#54596;&#46300;&#50640; <code>java.sql.Driver</code> API&#47484; &#44396;&#54788;&#54616;&#45716; &#44277;&#44553;&#50629;&#52404;&#48324; &#53364;&#47000;&#49828; &#51060;&#47492;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p><code>java.sql.Driver</code> &#47532;&#49548;&#49828; &#50976;&#54805;&#51012; &#49440;&#53469;&#54620; &#44221;&#50864; &#51068;&#48152;&#51201;&#51004;&#47196; &#51060; &#54596;&#46300;&#50640;&#45716; &#49440;&#53469;&#54620; &#46300;&#46972;&#51060;&#48260; &#48143; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#44277;&#44553;&#50629;&#52404;&#50752; &#50672;&#44288;&#46108; &#53364;&#47000;&#49828; &#51060;&#47492;&#51060; &#51088;&#46041;&#51004;&#47196; &#51077;&#47141;&#46121;&#45768;&#45796;. &#45936;&#51060;&#53552; &#49548;&#49828; &#47532;&#49548;&#49828; &#50976;&#54805; &#51473; &#54616;&#45208;&#47484; &#49440;&#53469;&#54620; &#44221;&#50864; &#51060; &#54596;&#46300;&#45716; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;.</p>
</li>
<li>
<p>&#54400; &#49373;&#49457; &#51473; &#46608;&#45716; &#51116;&#44396;&#49457; &#51473; &#54400;&#51012; &#51088;&#46041;&#51004;&#47196; &#54609;&#54624; &#49688; &#51080;&#46020;&#47197; [&#54609; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#50668; &#50724;&#47448;&#44032; &#51080;&#45716; &#49549;&#49457;&#44050;&#51012; &#54869;&#51064;&#54616;&#44256; &#44221;&#44256;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#48176;&#52824; &#49692;&#49436;] &#54596;&#46300;&#50640; &#51217;&#49549; &#54400;&#51032; &#48176;&#52824; &#49692;&#49436;&#47484; &#51648;&#51221;&#54616;&#45716; &#49707;&#51088;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#49436;&#48260; &#49884;&#51089; &#49884; &#45230;&#51008; &#48264;&#54840;&#51032; &#47532;&#49548;&#49828;&#48512;&#53552; &#47196;&#46300;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 100&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#49444;&#47749;] &#54596;&#46300;&#50640; &#51217;&#49549; &#54400;&#50640; &#45824;&#54620; &#44036;&#45800;&#54620; &#49444;&#47749;&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#52488;&#44592; &#48143; &#52572;&#49548; &#54400; &#53356;&#44592;] &#54596;&#46300;&#50640; &#51060; &#54400;&#51032; &#52572;&#49548; &#51217;&#49549; &#49688;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#44050;&#50640; &#46384;&#46972; &#54400;&#51060; &#52376;&#51020; &#49373;&#49457;&#46104;&#44144;&#45208; GlassFish Server&#51060;(&#44032;) &#49884;&#51089;&#46112; &#46412; &#54400;&#50640; &#51080;&#45716; &#51217;&#49549; &#49688;&#46020; &#44208;&#51221;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 8&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#52572;&#45824; &#54400; &#53356;&#44592;] &#54596;&#46300;&#50640; &#51060; &#54400;&#51032; &#52572;&#45824; &#51217;&#49549; &#49688;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; 32&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#54400; &#53356;&#44592; &#51312;&#51221; &#44060;&#49688;] &#54596;&#46300;&#50640; &#54400; &#53356;&#44592; &#51312;&#51221; &#51068;&#44292; &#51089;&#50629;&#45817; &#51217;&#49549; &#49688;&#47484; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#54400;&#51060; &#44033;&#44033; &#52572;&#45824; &#48143; &#52572;&#49548; &#54400; &#53356;&#44592;&#47196; &#54869;&#51109;&#46104;&#44144;&#45208; &#52629;&#49548;&#46104;&#45716; &#44221;&#50864; &#53356;&#44592;&#44032; &#51068;&#44292;&#51201;&#51004;&#47196; &#51312;&#51221;&#46121;&#45768;&#45796;. &#51060; &#44050;&#51008; &#51068;&#44292;&#51201;&#51004;&#47196; &#52376;&#47532;&#54624; &#51217;&#49549; &#49688;&#47484; &#51648;&#51221;&#54633;&#45768;&#45796;. &#51060; &#44050;&#51012; &#45320;&#47924; &#53356;&#44172; &#54616;&#47732; &#51217;&#49549; &#49373;&#49457; &#48143; &#51116;&#49692;&#54872;&#51060; &#51648;&#52404;&#46104;&#47728;, &#45320;&#47924; &#51089;&#44172; &#54616;&#47732; &#54952;&#50984;&#49457;&#51060; &#46504;&#50612;&#51665;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 2&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#50976;&#55092; &#49884;&#44036; &#52488;&#44284;] &#54596;&#46300;&#50640; &#54400;&#50640;&#49436; &#51217;&#49549;&#51060; &#50976;&#55092; &#49345;&#53468;&#47196; &#50976;&#51648;&#46112; &#49688; &#51080;&#45716; &#52572;&#45824; &#49884;&#44036;(&#52488;)&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#49884;&#44036;&#51060; &#47564;&#47308;&#46104;&#47732; &#51217;&#49549;&#51060; &#54400;&#50640;&#49436; &#51228;&#44144;&#46121;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; 300&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#52572;&#45824; &#45824;&#44592; &#49884;&#44036;] &#54596;&#46300;&#50640; &#51217;&#49549;&#51012; &#50836;&#52397;&#54616;&#45716; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#51060; &#51217;&#49549; &#49884;&#44036;&#51060; &#52488;&#44284;&#46112; &#46412;&#44620;&#51648; &#45824;&#44592;&#54624; &#52572;&#45824; &#49884;&#44036;(&#48128;&#47532;&#52488;)&#51012; &#51077;&#47141;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376;&#44050;&#51008; 60,000&#51077;&#45768;&#45796;.</p>
</li>
<li>
<p>&#53944;&#47004;&#51117;&#49496;&#51060; &#50500;&#45772; &#51217;&#49549;&#51004;&#47196; &#46028;&#50500;&#44032;&#47140;&#47732; [&#53944;&#47004;&#51117;&#49496;&#51060; &#50500;&#45772; &#51217;&#49549; &#49324;&#50857;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51008; &#44592;&#48376;&#51201;&#51004;&#47196; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>&#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#51217;&#49549;&#51032; &#53944;&#47004;&#51117;&#49496; &#44201;&#47532; &#47112;&#48296;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#51648;&#51221;&#54616;&#51648; &#50506;&#45716; &#44221;&#50864; &#51217;&#49549;&#51008; JDBC &#46300;&#46972;&#51060;&#48260;&#50640;&#49436; &#51228;&#44277;&#54616;&#45716; &#44592;&#48376; &#44201;&#47532; &#47112;&#48296;&#47196; &#49892;&#54665;&#46121;&#45768;&#45796;. &#44592;&#48376;&#51201;&#51004;&#47196; &#51060; &#50741;&#49496;&#51008; &#51648;&#51221;&#46104;&#50612; &#51080;&#51648; &#50506;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#44201;&#47532; &#47112;&#48296; &#48372;&#51109;] &#52404;&#53356; &#48149;&#49828;&#47484; &#49440;&#53469;&#54616;&#50668; &#54400;&#50640;&#49436; &#44032;&#51256;&#50728; &#47784;&#46304; &#51217;&#49549;&#51032; &#44201;&#47532; &#47112;&#48296;&#51060; &#46041;&#51068;&#54620;&#51648; &#54869;&#51064;&#54633;&#45768;&#45796;.</p>
<p>&#50696;&#47484; &#46308;&#50612;, &#47560;&#51648;&#47561;&#51004;&#47196; &#49324;&#50857; &#49884; &#51217;&#49549;&#51032; &#44201;&#47532; &#47112;&#48296;&#51012; &#54532;&#47196;&#44536;&#47000;&#48141; &#48169;&#49885;&#51004;&#47196; &#48320;&#44221;&#54620; &#44221;&#50864;(&#50696;: <code>con.setTransactionIsolation</code> &#49324;&#50857;) &#51060; &#48169;&#49885;&#51008; &#49345;&#53468;&#47484; &#51648;&#51221;&#54620; &#44201;&#47532; &#47112;&#48296;&#47196; &#45796;&#49884; &#48320;&#44221;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#49444;&#51221;&#51008; &#53944;&#47004;&#51117;&#49496; &#44201;&#47532; &#47112;&#48296;&#51012; &#51648;&#51221;&#54620; &#44221;&#50864;&#50640;&#47564; &#51201;&#50857; &#44032;&#45733;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#51217;&#49549;&#51012; &#54869;&#51064;&#54616;&#47140;&#47732; [&#54609;] &#45800;&#52628;&#47484; &#45572;&#47493;&#45768;&#45796;.</p>
<p>&#44288;&#47532; &#53080;&#49556;&#50640;&#49436; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#51217;&#49549;&#51012; &#49884;&#46020;&#54633;&#45768;&#45796;. &#50724;&#47448; &#47700;&#49884;&#51648;&#44032; &#54364;&#49884;&#46104;&#47732; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#49436;&#48260;&#44032; &#49884;&#51089;&#46104;&#50632;&#45716;&#51648; &#54869;&#51064;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#48708;&#50864;&#44592;] &#45800;&#52628;&#47484; &#45580;&#47084; &#51217;&#49549; &#54400;&#51012; &#54644;&#45817; &#52488;&#44592; &#49345;&#53468;&#47196; &#51116;&#49444;&#51221;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#51316;&#51032; &#47784;&#46304; &#46972;&#51060;&#48652; &#51217;&#49549;&#51060; &#49325;&#51228;&#46121;&#45768;&#45796;. &#51593;, &#51060;&#47084;&#54620; &#51217;&#49549;&#44284; &#44288;&#47144;&#46108; &#53944;&#47004;&#51117;&#49496;&#51060; &#49552;&#49892;&#46121;&#45768;&#45796;. &#44536;&#47084;&#47732; &#54616;&#50948; &#47749;&#47161;&#50640;&#49436; &#54400;&#50640; &#45824;&#54620; &#52488;&#44592; &#51217;&#49549;&#51012; &#45796;&#49884; &#49373;&#49457;&#54620; &#45796;&#51020; &#50504;&#51221;&#51201;&#51064; &#54400; &#53356;&#44592;&#47196; &#54400;&#51012; &#48373;&#50896;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51200;&#51109;]&#51012; &#45572;&#47493;&#45768;&#45796;.</p>

<hr>
<p><b>&#54017;:</b></p>
&#44592;&#48376; &#49444;&#51221;&#51004;&#47196; &#46028;&#50500;&#44032;&#47140;&#47732; [&#44592;&#48376;&#44050; &#47196;&#46300;] &#45800;&#52628;&#47484; &#45572;&#47480; &#45796;&#51020; [&#51200;&#51109;]&#51012; &#45572;&#47493;&#45768;&#45796;.
<hr>

</li>
</ol>
<a id="sthref18" name="sthref18"></a>
<h5>&#44288;&#47144; &#54637;&#47785;</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">&#45936;&#51060;&#53552;&#48288;&#51060;&#49828; &#50529;&#49464;&#49828;&#47484; &#49444;&#51221;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">JDBC &#46300;&#46972;&#51060;&#48260;&#47484; &#53685;&#54633;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcenew.html">JDBC &#47532;&#49548;&#49828;&#47484; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesedit.html">JDBC &#47532;&#49548;&#49828;&#47484; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcetargets.html">JDBC &#47532;&#49548;&#49828; &#45824;&#49345;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesdelete.html">JDBC &#47532;&#49548;&#49828;&#47484; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">JDBC &#51217;&#49549; &#54400;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">JDBC &#51217;&#49549; &#54400; &#44256;&#44553; &#49549;&#49457;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">&#51217;&#49549; &#54400; &#49444;&#51221;&#51012; &#54869;&#51064;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">JDBC &#51217;&#49549; &#54400; &#49549;&#49457;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">JDBC &#51217;&#49549; &#54400;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
