<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-transactionsvcproperties" name="ref-transactionsvcproperties"></a><a id="GHJTS00003" name="GHJTS00003"></a></p>

<h4><a id="sthref16" name="sthref16"></a><a id="sthref17" name="sthref17"></a>&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12499;&#12473;&#12395;&#22266;&#26377;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12499;&#12473;&#12398;&#27083;&#25104;&#12395;&#12399;&#12289;&#27425;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;</p>
<dl>
<dt><code>oracle-xa-recovery-workaround</code></dt>
<dd>
<p><code>true</code>&#12395;&#35373;&#23450;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;Oracle XA Resource&#22238;&#36991;&#26041;&#27861;&#12364;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#12522;&#12459;&#12496;&#12522;&#12391;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>true</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt><code>disable-distributed-transaction-logging</code></dt>
<dd>
<p><code>true</code>&#12395;&#35373;&#23450;&#12375;&#12383;&#22580;&#21512;&#12289;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12525;&#12462;&#12531;&#12464;&#12364;&#28961;&#21177;&#12395;&#12394;&#12426;&#12289;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12364;&#21521;&#19978;&#12377;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12300;&#20877;&#36215;&#21205;&#26178;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12364;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#28961;&#35222;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>false</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt><code>xaresource-txn-timeout</code></dt>
<dd>
<p><code>XAResource</code>&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12434;&#22793;&#26356;&#12375;&#12414;&#12377;&#12290;&#22580;&#21512;&#12395;&#12424;&#12387;&#12390;&#12399;&#12289;<code>XAResource</code>&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12395;&#12424;&#12387;&#12390;&#12289;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12364;&#20013;&#26029;&#12373;&#12428;&#12427;&#12371;&#12392;&#12364;&#12354;&#12427;&#12383;&#12417;&#12289;&#22793;&#26356;&#12377;&#12427;&#12371;&#12392;&#12434;&#12362;&#34214;&#12417;&#12375;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12289;&#20351;&#29992;&#12375;&#12390;&#12356;&#12427;<code>XAResource</code>&#12395;&#22266;&#26377;&#12391;&#12377;&#12290;</p>
</dd>
<dt><code>pending-txn-cleanup-interval</code></dt>
<dd>
<p>&#38750;&#21516;&#26399;&#12473;&#12524;&#12483;&#12489;&#12364;&#20445;&#30041;&#20013;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#12289;&#12381;&#12428;&#12425;&#12434;&#23436;&#20102;&#12373;&#12379;&#12427;&#38291;&#38548;&#12434;&#31186;&#25968;&#12391;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12354;&#12427;&#12364;&#20516;&#12364;&#12394;&#12356;&#22580;&#21512;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;60&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;</p>
</dd>
<dt><code>use-last-agent-optimization</code></dt>
<dd>
<p><code>true</code>&#12395;&#35373;&#23450;&#12375;&#12383;&#22580;&#21512;&#12289;&#26368;&#32066;&#12456;&#12540;&#12472;&#12455;&#12531;&#12488;&#26368;&#36969;&#21270;&#12364;&#26377;&#21177;&#12395;&#12394;&#12426;&#12289;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#12473;&#12523;&#12540;&#12503;&#12483;&#12488;&#12364;&#25913;&#21892;&#12373;&#12428;&#12414;&#12377;&#12290;1&#12388;&#12398;&#38750;XA&#12522;&#12477;&#12540;&#12473;&#12364;&#21516;&#12376;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12391;XA&#12522;&#12477;&#12540;&#12473;&#12392;&#19968;&#32210;&#12395;&#20351;&#29992;&#12373;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#38750;XA&#12522;&#12477;&#12540;&#12473;&#12364;&#26368;&#32066;&#12456;&#12540;&#12472;&#12455;&#12531;&#12488;&#12391;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;<code>true</code>&#12391;&#12377;&#12290;</p>
</dd>
<dt><code>delegated-recovery</code></dt>
<dd>
<p><code>true</code>&#12395;&#35373;&#23450;&#12375;&#12383;&#22580;&#21512;&#12289;&#12463;&#12521;&#12473;&#12479;&#20840;&#20307;&#12391;&#22996;&#20219;&#12522;&#12459;&#12496;&#12522;&#12364;&#26377;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;false&#12391;&#12377;&#12290;</p>
</dd>
<dt><code>wait-time-before-recovery-insec</code></dt>
<dd>
<p>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#12487;&#12483;&#12489;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12395;&#23550;&#12375;&#12390;&#12522;&#12459;&#12496;&#12522;&#12434;&#38283;&#22987;&#12377;&#12427;&#12414;&#12391;&#12395;&#24453;&#27231;&#12377;&#12427;&#31186;&#25968;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
</dd>
<dt><code>db-logging-resource</code></dt>
<dd>
<p>&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#35352;&#37682;&#12377;&#12427;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;JDBC&#12522;&#12477;&#12540;&#12473;&#12398;JNDI&#21517;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#35443;&#32048;&#12399;&#12289;<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDVG00018"><i>Oracle GlassFish Server&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#38283;&#30330;&#12460;&#12452;&#12489;</i>&#12398;&#31532;17&#31456;&#12289;<i>Using the Transaction Service</i></a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;</p>
</dd>
<dt><code>xa-servername</code></dt>
<dd>
<p>&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12499;&#12473;&#12364;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12373;&#12428;&#12390;&#12356;&#12427;GlassFish Server&#12391;&#31649;&#29702;&#12373;&#12428;&#12427;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#35672;&#21029;&#12377;&#12427;&#12383;&#12417;&#12395;&#20351;&#29992;&#12377;&#12427;&#12507;&#12473;&#12488;&#21517;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12289;GlassFish Server&#12434;&#23455;&#34892;&#12375;&#12390;&#12356;&#12427;&#21029;&#12398;&#12507;&#12473;&#12488;&#12391;&#20316;&#25104;&#12373;&#12428;&#12383;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#12522;&#12459;&#12496;&#12522;&#12377;&#12427;&#22580;&#21512;&#12395;&#20415;&#21033;&#12391;&#12377;&#12290;</p>
</dd>
</dl>




<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
