<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-setkeyptinterval" name="task-setkeyptinterval"></a></p>

<h4><a id="sthref11" name="sthref11"></a><a id="sthref12" name="sthref12"></a>&#12461;&#12540;&#12509;&#12452;&#12531;&#12488;&#38291;&#38548;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12461;&#12540;&#12509;&#12452;&#12531;&#12488;&#25805;&#20316;&#12395;&#12424;&#12387;&#12390;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12364;&#22311;&#32302;&#12373;&#12428;&#12414;&#12377;&#12290;&#12461;&#12540;&#12509;&#12452;&#12531;&#12488;&#38291;&#38548;&#12392;&#12399;&#12289;&#12525;&#12464;&#19978;&#12398;&#12461;&#12540;&#12509;&#12452;&#12531;&#12488;&#25805;&#20316;&#38291;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#25968;&#12391;&#12377;&#12290;&#12461;&#12540;&#12509;&#12452;&#12531;&#12488;&#25805;&#20316;&#12395;&#12424;&#12387;&#12390;&#12289;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#12469;&#12452;&#12474;&#12434;&#23567;&#12373;&#12367;&#12391;&#12365;&#12414;&#12377;&#12290;&#12461;&#12540;&#12509;&#12452;&#12531;&#12488;&#38291;&#38548;&#12434;&#22823;&#12365;&#12367;&#12377;&#12427;&#12392;&#12289;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12364;&#22823;&#12365;&#12367;&#12394;&#12426;&#12414;&#12377;&#12364;&#12289;&#12461;&#12540;&#12509;&#12452;&#12531;&#12488;&#25805;&#20316;&#12364;&#23569;&#12394;&#12367;&#12394;&#12427;&#12398;&#12391;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12364;&#21521;&#19978;&#12377;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12461;&#12540;&#12509;&#12452;&#12531;&#12488;&#38291;&#38548;&#12434;&#23567;&#12373;&#12367;&#12377;&#12427;&#12392;(&#20363;: 256)&#12289;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#12469;&#12452;&#12474;&#12364;&#23567;&#12373;&#12367;&#12394;&#12426;&#12414;&#12377;&#12364;&#12289;&#12461;&#12540;&#12509;&#12452;&#12531;&#12488;&#25805;&#20316;&#12364;&#22810;&#12367;&#12394;&#12427;&#12398;&#12391;&#12289;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12364;&#12431;&#12378;&#12363;&#12395;&#20302;&#19979;&#12375;&#12414;&#12377;&#12290;</p>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#27083;&#25104;&#12377;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;:</p>
<ul>
<li>
<p>&#29305;&#23450;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12381;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#27083;&#25104;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;<code>server</code>&#12398;&#22580;&#21512;&#12399;&#12289;<code>server-config</code>&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12377;&#12409;&#12390;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;<code>default-config</code>&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12461;&#12540;&#12509;&#12452;&#12531;&#12488;&#38291;&#38548;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12461;&#12540;&#12509;&#12452;&#12531;&#12488;&#25805;&#20316;&#38291;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;65,536&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref13" name="sthref13"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-configtransservice.html">&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-configtransrecovery.html">GlassFish Server&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#12522;&#12459;&#12496;&#12522;&#26041;&#27861;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-settranstimeout.html">&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#20516;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-settranslog.html">&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12525;&#12464;&#12398;&#20301;&#32622;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>




<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
