<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-configtransrecovery" name="task-configtransrecovery"></a></p>

<h4><a id="sthref4" name="sthref4"></a>GlassFish Server&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#12522;&#12459;&#12496;&#12522;&#26041;&#27861;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12399;&#12289;2&#12501;&#12455;&#12540;&#12474;&#12539;&#12467;&#12511;&#12483;&#12488;&#12398;&#12501;&#12455;&#12540;&#12474;&#38291;&#12391;&#30330;&#29983;&#12377;&#12427;&#12469;&#12540;&#12496;&#12540;&#12539;&#12463;&#12521;&#12483;&#12471;&#12517;&#12414;&#12383;&#12399;&#12522;&#12477;&#12540;&#12473;&#12539;&#12510;&#12493;&#12540;&#12472;&#12515;&#12539;&#12463;&#12521;&#12483;&#12471;&#12517;&#12398;&#12356;&#12378;&#12428;&#12363;&#12395;&#12424;&#12426;&#19981;&#23436;&#20840;&#12395;&#12394;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#26410;&#23436;&#20102;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#23436;&#20102;&#12373;&#12379;&#12289;&#38556;&#23475;&#12434;&#12522;&#12459;&#12496;&#12522;&#12373;&#12379;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;GlassFish Server&#12399;&#12289;&#12371;&#12428;&#12425;&#12398;&#38556;&#23475;&#12434;&#12522;&#12459;&#12496;&#12522;&#12375;&#12289;&#12469;&#12540;&#12496;&#12540;&#12398;&#36215;&#21205;&#26178;&#12395;&#12381;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#23436;&#20102;&#12377;&#12427;&#12424;&#12358;&#12395;&#35373;&#35336;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
<p>&#12522;&#12459;&#12496;&#12522;&#12434;&#23455;&#34892;&#12377;&#12427;&#21069;&#12395;&#12289;&#38306;&#20418;&#12377;&#12427;&#12377;&#12409;&#12390;&#12398;&#12522;&#12477;&#12540;&#12473;&#12364;&#31292;&#20685;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#35469;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12364;&#35079;&#25968;&#12398;&#12469;&#12540;&#12496;&#12540;&#12395;&#12431;&#12383;&#12387;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#38283;&#22987;&#12375;&#12383;&#12469;&#12540;&#12496;&#12540;&#12364;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#32080;&#26524;&#12434;&#21462;&#24471;&#12375;&#12424;&#12358;&#12392;&#12375;&#12390;&#20182;&#12398;&#12469;&#12540;&#12496;&#12540;&#12395;&#21839;&#12356;&#21512;&#12379;&#12427;&#22580;&#21512;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#20182;&#12398;&#12469;&#12540;&#12496;&#12540;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;&#12289;&#12381;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12399;&#12300;&#12498;&#12517;&#12540;&#12522;&#12473;&#12486;&#12451;&#12483;&#12463;&#27770;&#23450;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#20351;&#29992;&#12375;&#12390;&#12381;&#12398;&#32080;&#26524;&#12434;&#21028;&#21029;&#12375;&#12414;&#12377;&#12290;</p>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#27083;&#25104;&#12377;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;:</p>
<ul>
<li>
<p>&#29305;&#23450;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12381;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#27083;&#25104;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;<code>server</code>&#12398;&#22580;&#21512;&#12399;&#12289;<code>server-config</code>&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12377;&#12409;&#12390;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;<code>default-config</code>&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12398;&#12300;&#20877;&#36215;&#21205;&#26178;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#19981;&#23436;&#20840;&#12394;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#12522;&#12459;&#12496;&#12522;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12289;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12399;&#36984;&#25246;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;</p>
</li>
<li>
<p>&#12300;&#20877;&#35430;&#34892;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;GlassFish Server&#12364;&#21040;&#36948;&#19981;&#21487;&#33021;&#12394;&#12469;&#12540;&#12496;&#12540;&#12408;&#12398;&#25509;&#32154;&#12434;&#35430;&#34892;&#12377;&#12427;&#31186;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;600(10&#20998;)&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12498;&#12517;&#12540;&#12522;&#12473;&#12486;&#12451;&#12483;&#12463;&#27770;&#23450;&#12301;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12391;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12394;&#12356;&#12469;&#12540;&#12496;&#12540;&#12395;&#38306;&#12377;&#12427;&#12509;&#12522;&#12471;&#12540;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12467;&#12511;&#12483;&#12488;&#12301;&#12434;&#36984;&#25246;&#12377;&#12427;&#27491;&#24403;&#12394;&#29702;&#30001;&#12364;&#12394;&#12356;&#12363;&#12366;&#12426;&#12289;&#12300;&#29305;&#27530;&#12394;&#32080;&#26524;&#21028;&#21029;&#12301;&#12399;&#12300;&#12525;&#12540;&#12523;&#12539;&#12496;&#12483;&#12463;&#12301;&#12398;&#12414;&#12414;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;(&#12487;&#12501;&#12457;&#12523;&#12488;)&#12290;&#26410;&#30906;&#23450;&#12394;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#12467;&#12511;&#12483;&#12488;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12487;&#12540;&#12479;&#12398;&#25972;&#21512;&#24615;&#12434;&#25613;&#12358;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>GlassFish Server&#12434;&#20877;&#36215;&#21205;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref5" name="sthref5"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-configtransservice.html">&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-settranstimeout.html">&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#20516;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-settranslog.html">&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12525;&#12464;&#12398;&#20301;&#32622;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-setkeyptinterval.html">&#12461;&#12540;&#12509;&#12452;&#12531;&#12488;&#38291;&#38548;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
