<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-configtransservice" name="task-configtransservice"></a><a id="GHJTS00004" name="GHJTS00004"></a></p>

<h4><a id="sthref2" name="sthref2"></a>&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12539;&#12484;&#12522;&#12540;&#12391;&#12289;&#12300;&#27083;&#25104;&#12301;&#12494;&#12540;&#12489;&#12434;&#23637;&#38283;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#27083;&#25104;&#12377;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;:</p>
<ul>
<li>
<p>&#29305;&#23450;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#12381;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#27083;&#25104;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;&#12383;&#12392;&#12360;&#12400;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;<code>server</code>&#12398;&#22580;&#21512;&#12399;&#12289;<code>server-config</code>&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12377;&#12409;&#12390;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;<code>default-config</code>&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12494;&#12540;&#12489;&#12434;&#36984;&#25246;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12300;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12364;&#38283;&#12365;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12499;&#12473;&#12301;&#12506;&#12540;&#12472;&#12398;&#12300;&#20877;&#36215;&#21205;&#26178;&#12301;&#12398;&#12300;&#26377;&#21177;&#12301;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12390;&#12289;&#12469;&#12540;&#12496;&#12540;&#12398;&#20877;&#36215;&#21205;&#26178;&#12395;&#19981;&#23436;&#20840;&#12394;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#12522;&#12459;&#12496;&#12522;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12371;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#28961;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12391;&#12289;&#23436;&#20102;&#12375;&#12390;&#12356;&#12394;&#12356;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#12525;&#12540;&#12523;&#12539;&#12496;&#12483;&#12463;&#12377;&#12427;&#12414;&#12391;&#12395;&#12469;&#12540;&#12496;&#12540;&#12364;&#24453;&#27231;&#12377;&#12427;&#31186;&#25968;&#12434;&#20837;&#21147;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>&#20516;&#12392;&#12375;&#12390;0&#12434;&#20837;&#21147;&#12377;&#12427;&#12392;&#12289;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12364;&#28961;&#21177;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;0&#12391;&#12377;&#12290;&#12371;&#12428;&#12399;&#12289;&#12469;&#12540;&#12496;&#12540;&#12364;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12364;&#23436;&#20102;&#12377;&#12427;&#12414;&#12391;&#28961;&#26399;&#38480;&#12395;&#24453;&#27231;&#12377;&#12427;&#12392;&#12356;&#12358;&#24847;&#21619;&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#20877;&#35430;&#34892;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;GlassFish Server&#12364;&#21040;&#36948;&#19981;&#21487;&#33021;&#12394;&#12469;&#12540;&#12496;&#12540;&#12408;&#12398;&#25509;&#32154;&#12434;&#35430;&#34892;&#12377;&#12427;&#31186;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;600(10&#20998;)&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12525;&#12464;&#12398;&#20301;&#32622;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12391;&#12289;&#12469;&#12540;&#12496;&#12540;&#12398;&#12525;&#12464;&#12434;&#20445;&#25345;&#12377;&#12427;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12434;&#20837;&#21147;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12525;&#12464;&#12399;&#12289;&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12391;&#25351;&#23450;&#12375;&#12383;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12398;<code>tx</code>&#12469;&#12502;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#20445;&#23384;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;&#12300;&#12489;&#12513;&#12452;&#12531;&#23646;&#24615;&#12301;&#12506;&#12540;&#12472;&#12398;&#12300;&#12525;&#12464;&#12539;&#12523;&#12540;&#12488;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12391;&#25351;&#23450;&#12373;&#12428;&#12383;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12391;&#12377;&#12290;&#12371;&#12398;&#12506;&#12540;&#12472;&#12399;GlassFish Server&#12494;&#12540;&#12489;&#12398;&#12300;&#35443;&#32048;&#12301;&#12479;&#12502;&#12398;&#19979;&#12395;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#29305;&#27530;&#12394;&#32080;&#26524;&#21028;&#21029;&#12301;&#12398;&#12489;&#12525;&#12483;&#12503;&#12480;&#12454;&#12531;&#12539;&#12522;&#12473;&#12488;&#12363;&#12425;&#12289;&#20182;&#12398;&#21442;&#21152;&#32773;&#12364;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12394;&#12356;&#12383;&#12417;&#12395;&#20998;&#25955;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#32080;&#26524;&#12434;&#27770;&#23450;&#12391;&#12365;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#24467;&#12358;&#24517;&#35201;&#12364;&#12354;&#12427;&#12509;&#12522;&#12471;&#12540;&#12434;&#36984;&#25246;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<p>&#12300;&#12467;&#12511;&#12483;&#12488;&#12301;&#12434;&#36984;&#25246;&#12377;&#12427;&#27491;&#24403;&#12394;&#29702;&#30001;&#12364;&#12394;&#12356;&#12363;&#12366;&#12426;&#12289;&#12300;&#29305;&#27530;&#12394;&#32080;&#26524;&#21028;&#21029;&#12301;&#12399;&#12300;&#12525;&#12540;&#12523;&#12539;&#12496;&#12483;&#12463;&#12301;&#12398;&#12414;&#12414;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;(&#12487;&#12501;&#12457;&#12523;&#12488;)&#12290;&#26410;&#30906;&#23450;&#12394;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#12467;&#12511;&#12483;&#12488;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12487;&#12540;&#12479;&#12398;&#25972;&#21512;&#24615;&#12434;&#25613;&#12358;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#12461;&#12540;&#12509;&#12452;&#12531;&#12488;&#38291;&#38548;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12289;&#12461;&#12540;&#12509;&#12452;&#12531;&#12488;&#25805;&#20316;&#38291;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#25968;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#12461;&#12540;&#12509;&#12452;&#12531;&#12488;&#25805;&#20316;&#12395;&#12424;&#12387;&#12390;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12525;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12364;&#22311;&#32302;&#12373;&#12428;&#12414;&#12377;&#12290;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;65,536&#12391;&#12377;&#12290;</p>
</li>
<li>
<p>&#12300;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12301;&#12475;&#12463;&#12471;&#12519;&#12531;&#12391;&#12289;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;</p>
<p>&#20351;&#29992;&#21487;&#33021;&#12394;&#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;<a href="ref-transactionsvcproperties.html">&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12499;&#12473;&#12395;&#22266;&#26377;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;</a>&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;</p>
<ul>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12377;&#12427;&#12395;&#12399;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;&#34920;&#31034;&#12373;&#12428;&#12427;&#31354;&#30333;&#34892;&#12391;&#12289;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#21517;&#12434;&#20837;&#21147;&#12375;&#12289;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12503;&#12525;&#12497;&#12486;&#12451;&#20516;&#12434;&#20837;&#21147;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#22793;&#26356;&#12377;&#12427;&#12395;&#12399;&#12289;&#12381;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#20516;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#32232;&#38598;&#12375;&#12414;&#12377;&#12290;</p>
</li>
<li>
<p>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;&#12289;&#21066;&#38500;&#12377;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12300;&#21517;&#21069;&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12398;&#24038;&#20596;&#12395;&#12354;&#12427;&#12481;&#12455;&#12483;&#12463;&#12539;&#12508;&#12483;&#12463;&#12473;&#12434;&#36984;&#25246;&#12375;&#12289;&#12300;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#21066;&#38500;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;</p>

<hr>
<p><b>&#12498;&#12531;&#12488;:</b></p>
&#12487;&#12501;&#12457;&#12523;&#12488;&#35373;&#23450;&#12395;&#36820;&#12377;&#12395;&#12399;&#12289;&#12300;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12525;&#12540;&#12489;&#12301;&#12508;&#12479;&#12531;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12289;&#12300;&#20445;&#23384;&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;<br />
<hr>

</li>
<li>
<p>GlassFish Server&#12434;&#20877;&#36215;&#21205;&#12375;&#12414;&#12377;&#12290;</p>
</li>
</ol>
<a id="sthref3" name="sthref3"></a>
<h5>&#38306;&#36899;&#38917;&#30446;</h5>
<ul>
<li>
<p><a href="task-configtransrecovery.html">GlassFish Server&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#12522;&#12459;&#12496;&#12522;&#26041;&#27861;&#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-settranstimeout.html">&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#12479;&#12452;&#12512;&#12450;&#12454;&#12488;&#20516;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-settranslog.html">&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12525;&#12464;&#12398;&#20301;&#32622;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
<li>
<p><a href="task-setkeyptinterval.html">&#12461;&#12540;&#12509;&#12452;&#12531;&#12488;&#38291;&#38548;&#12434;&#35373;&#23450;&#12377;&#12427;&#12395;&#12399;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
