<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-contextservices" name="ref-contextservices"></a></p>

<h4>Servi&ccedil;os de Contexto<a id="sthref14" name="sthref14"></a><a id="sthref15" name="sthref15"></a></h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Os servi&ccedil;os de contexto s&atilde;o usados para criar objetos proxy din&acirc;micos que capturam o contexto de um cont&ecirc;iner e permitem que as aplica&ccedil;&otilde;es sejam executadas dentro desse contexto posteriormente. O contexto do cont&ecirc;iner &eacute; propagado para o thread que executa a tarefa.</p>
<p>Use a p&aacute;gina Servi&ccedil;os de Contexto para configurar recursos de servi&ccedil;o de contexto.</p>
<p>Para cada recurso de servi&ccedil;o de contexto, as informa&ccedil;&otilde;es a seguir s&atilde;o fornecidas.</p>
<dl>
<dt>Nome JNDI</dt>
<dd>
<p>Um nome exclusivo que identifica o recurso.</p>
</dd>
<dt>Nome L&oacute;gico JNDI</dt>
<dd>
<p>O nome l&oacute;gico JNDI para o recurso. Consulte <a href="../../../common/en/help/ref-logicaljndinames.html">Nomes L&oacute;gicos JNDI</a> para obter mais informa&ccedil;&otilde;es.</p>
</dd>
<dt>Ativado</dt>
<dd>
<p>(Esta coluna s&oacute; ser&aacute; exibida se a inst&acirc;ncia do servidor default, <code>server</code>, existir no dom&iacute;nio.)</p>
<p>Exibe uma marca de sele&ccedil;&atilde;o se o recurso estiver ativado ou um X se o recurso estiver desativado.</p>
</dd>
<dt>Status</dt>
<dd>
<p>(Esta coluna s&oacute; ser&aacute; exibida se os clusters ou inst&acirc;ncias standalone tiverem sido criadas no dom&iacute;nio.)</p>
<p>O n&uacute;mero de clusters e inst&acirc;ncias independentes ao qual o recurso est&aacute; direcionado e em quantos desses o recurso est&aacute; ativado. Por exemplo, "Ativado em 2 de 4 Alvos" significa que o recurso est&aacute; direcionado para quatro clusters e inst&acirc;ncias standalone e que est&aacute; ativado em dois desses quatro alvos.</p>
</dd>
<dt>Informa&ccedil;&otilde;es de Contexto</dt>
<dd>
<p>Os contextos do cont&ecirc;iner propagados para threads.</p>
</dd>
<dt>Descri&ccedil;&atilde;o</dt>
<dd>
<p>Uma descri&ccedil;&atilde;o do recurso.</p>
</dd>
</dl>
<p>A tabela Servi&ccedil;os de Contexto tamb&eacute;m cont&eacute;m as seguintes op&ccedil;&otilde;es.</p>
<dl>
<dt>Novo</dt>
<dd>
<p>Bot&atilde;o utilizado para criar um novo recurso.</p>
</dd>
<dt>Deletar</dt>
<dd>
<p>Bot&atilde;o utilizado para deletar um ou mais recursos selecionados.</p>
</dd>
<dt>Ativar</dt>
<dd>
<p>Bot&atilde;o utilizado para ativar um ou mais recursos selecionados.</p>
</dd>
<dt>Desativar</dt>
<dd>
<p>Bot&atilde;o utilizado para desativar um ou mais recursos selecionados.</p>
</dd>
</dl>
<a id="sthref16" name="sthref16"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-contextservicecreate.html">Para Criar um Servi&ccedil;o de Contexto</a></p>
</li>
<li>
<p><a href="task-contextserviceedit.html">Para Editar um Servi&ccedil;o de Contexto</a></p>
</li>
<li>
<p><a href="task-contextservicedelete.html">Para Deletar um Servi&ccedil;o de Contexto</a></p>
</li>
</ul>
<a id="GHCON133" name="GHCON133"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM838"><code>create-context-service</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM865"><code>list-context-services</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM846"><code>delete-context-service</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
