<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-contextservicenew" name="ref-contextservicenew"></a></p>

<h4>Novo Servi&ccedil;o de Contexto<a id="sthref17" name="sthref17"></a></h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Novo Servi&ccedil;o de Contexto para criar um recurso de servi&ccedil;o de contexto.</p>
<p>A p&aacute;gina Novo Servi&ccedil;o de Contexto cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Nome JNDI</dt>
<dd>
<p>Um nome JNDI exclusivo que identifica o recurso. Por conven&ccedil;&atilde;o, o nome come&ccedil;a com um indicador de tipo de recurso e uma barra, tais como concurrent/, jdbc/ ou jms/.</p>
</dd>
<dt>Informa&ccedil;&otilde;es de Contexto</dt>
<dd>
<p>Os contextos a serem propagados para threads:, Classloader; JNDI, Seguran&ccedil;a ou WorkArea. A propaga&ccedil;&atilde;o de contexto pode ser ativada ou desativada. Se a op&ccedil;&atilde;o estiver ativada, os contextos selecionados ser&atilde;o propagados. Se esta op&ccedil;&atilde;o estiver desativada, nenhum dos contextos ser&aacute; propagado, mesmo que eles estejam selecionados. O valor default &eacute; Ativado, com todos os quatro contextos selecionados.</p>
</dd>
<dt>Descri&ccedil;&atilde;o</dt>
<dd>
<p>Uma descri&ccedil;&atilde;o deste recurso.</p>
</dd>
<dt>Status</dt>
<dd>
<p>O status do recurso. O recurso pode ser ativado ou desativado. O valor default &eacute; Ativado.</p>
</dd>
<dt>Propriedades Adicionais</dt>
<dd>
<p>Propriedades adicionais do recurso. O GlassFish Server n&atilde;o define propriedades adicionais para este tipo de recurso. Al&eacute;m disso, este tipo de recurso n&atilde;o usa atualmente propriedades adicionais.</p>
</dd>
<dt>Alvos</dt>
<dd>
<p>(Esta op&ccedil;&atilde;o s&oacute; ser&aacute; exibida se os clusters ou inst&acirc;ncias standalone tiverem sido criados no dom&iacute;nio.)</p>
<p>Clusters e inst&acirc;ncias standalone do recurso. Mova os alvos desejados para a coluna Alvos Selecionados utilizando os bot&otilde;es Adicionar e Adicionar Tudo. Mova os alvos desnecess&aacute;rios para a coluna Alvos Dispon&iacute;veis utilizando os bot&otilde;es Remover e Remover Tudo.</p>
</dd>
</dl>
<a id="sthref18" name="sthref18"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-contextservicecreate.html">Para Criar um Servi&ccedil;o de Contexto</a></p>
</li>
<li>
<p><a href="task-contextserviceedit.html">Para Editar um Servi&ccedil;o de Contexto</a></p>
</li>
<li>
<p><a href="task-contextservicedelete.html">Para Deletar um Servi&ccedil;o de Contexto</a></p>
</li>
</ul>
<a id="GHCON135" name="GHCON135"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM838"><code>create-context-service</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM865"><code>list-context-services</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM846"><code>delete-context-service</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
