<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-threadfactories" name="ref-threadfactories"></a></p>

<h4>F&aacute;bricas de Threads Gerenciados<a id="sthref35" name="sthref35"></a><a id="sthref36" name="sthref36"></a></h4>
<a name="BEGIN" id="BEGIN"></a>
<p>As f&aacute;bricas de threads gerenciados s&atilde;o usadas por aplica&ccedil;&otilde;es para criar threads gerenciados sob demanda. Os threads s&atilde;o iniciados e gerenciados pelo cont&ecirc;iner. O contexto do cont&ecirc;iner &eacute; propagado para o thread que executa a tarefa.</p>
<p>Use a p&aacute;gina F&aacute;bricas de Threads Gerenciados para configurar recursos da f&aacute;brica de threads gerenciados.</p>
<p>Para cada recurso da f&aacute;brica de thread gerenciado, as informa&ccedil;&otilde;es a seguir s&atilde;o fornecidas.</p>
<dl>
<dt>Nome JNDI</dt>
<dd>
<p>Um nome exclusivo que identifica o recurso.</p>
</dd>
<dt>Nome L&oacute;gico JNDI</dt>
<dd>
<p>O nome l&oacute;gico JNDI para o recurso. Consulte <a href="../../../common/en/help/ref-logicaljndinames.html">Nomes L&oacute;gicos JNDI</a> para obter mais informa&ccedil;&otilde;es.</p>
</dd>
<dt>Ativado</dt>
<dd>
<p>(Esta coluna s&oacute; ser&aacute; exibida se a inst&acirc;ncia do servidor default, <code>server</code>, existir no dom&iacute;nio.)</p>
<p>Exibe uma marca de sele&ccedil;&atilde;o se o recurso estiver ativado ou um X se o recurso estiver desativado.</p>
</dd>
<dt>Status</dt>
<dd>
<p>(Esta coluna s&oacute; ser&aacute; exibida se os clusters ou inst&acirc;ncias standalone tiverem sido criadas no dom&iacute;nio.)</p>
<p>O n&uacute;mero de clusters e inst&acirc;ncias independentes ao qual o recurso est&aacute; direcionado e em quantos desses o recurso est&aacute; ativado. Por exemplo, "Ativado em 2 de 4 Alvos" significa que o recurso est&aacute; direcionado para quatro clusters e inst&acirc;ncias standalone e que est&aacute; ativado em dois desses quatro alvos.</p>
</dd>
<dt>Informa&ccedil;&otilde;es de Contexto</dt>
<dd>
<p>Os contextos do cont&ecirc;iner propagados para threads.</p>
</dd>
<dt>Prioridade do Thread</dt>
<dd>
<p>A prioridade designada aos threads.</p>
</dd>
<dt>Descri&ccedil;&atilde;o</dt>
<dd>
<p>Uma descri&ccedil;&atilde;o do recurso.</p>
</dd>
</dl>
<p>A tabela F&aacute;bricas de Threads Gerenciados tamb&eacute;m cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Novo</dt>
<dd>
<p>Bot&atilde;o utilizado para criar um novo recurso.</p>
</dd>
<dt>Deletar</dt>
<dd>
<p>Bot&atilde;o utilizado para deletar um ou mais recursos selecionados.</p>
</dd>
<dt>Ativar</dt>
<dd>
<p>Bot&atilde;o utilizado para ativar um ou mais recursos selecionados.</p>
</dd>
<dt>Desativar</dt>
<dd>
<p>Bot&atilde;o utilizado para desativar um ou mais recursos selecionados.</p>
</dd>
</dl>
<a id="sthref37" name="sthref37"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-managedthreadfactorynew.html">Para Criar uma F&aacute;brica de Threads Gerenciados</a></p>
</li>
<li>
<p><a href="task-managedthreadfactoryedit.html">Para Editar uma F&aacute;brica de Threads Gerenciados</a></p>
</li>
<li>
<p><a href="task-managedthreadfactorydelete.html">Para Deletar uma F&aacute;brica de Threads Gerenciados</a></p>
</li>
</ul>
<a id="GHCON154" name="GHCON154"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM842"><code>create-managed-thread-factory</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM875"><code>list-managed-thread-factories</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM852"><code>delete-managed-thread-factory</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
