<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-scheduledexecutorserviceedit" name="ref-scheduledexecutorserviceedit"></a></p>

<h4>Editor Servi&ccedil;o do Executor Programado Gerenciado</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Editor de Servi&ccedil;o do Executor Programado Gerenciado para criar um recurso de servi&ccedil;o do executor gerenciado programado.</p>
<p>A p&aacute;gina Editar Servi&ccedil;o de Contexto cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Carregar Defaults</dt>
<dd>
<p>Bot&atilde;o para restaurar defini&ccedil;&otilde;es para seus valores default. Defini&ccedil;&otilde;es que n&atilde;o tiveram seus valores default alterados.</p>
</dd>
<dt>Nome JNDI</dt>
<dd>
<p>Um nome exclusivo que identifica o recurso. O nome JNDI &eacute; um campo somente para leitura. Voc&ecirc; pode especificar o nome JNDI ao criar um novo recurso.</p>
</dd>
<dt>Informa&ccedil;&otilde;es de Contexto</dt>
<dd>
<p>O contexto do recurso: Classloader, JNDI, Seguran&ccedil;a ou &Aacute;rea de Trabalho.</p>
</dd>
<dt>Status</dt>
<dd>
<p>O status do recurso. O recurso pode ser ativado ou desativado. O valor default &eacute; Ativado.</p>
</dd>
<dt>Prioridade do Thread</dt>
<dd>
<p>A prioridade de threads a ser criada para a inst&acirc;ncia de servi&ccedil;o do executor programado gerenciado. O default &eacute; 5 .</p>
</dd>
<dt>Tarefas de Longa Execu&ccedil;&atilde;o</dt>
<dd>
<p>XXX.</p>
</dd>
<dt>Suspensa Ap&oacute;s</dt>
<dd>
<p>O tempo em segundos que uma tarefa pode ser executada antes de ser considerada suspensa.</p>
</dd>
<dt>Tamanho do Principal</dt>
<dd>
<p>O n&uacute;mero de threads a serem mantidos em um pool de thread. O default &eacute; 0.</p>
</dd>
<dt>Tamanho M&aacute;ximo do Pool</dt>
<dd>
<p>O n&uacute;mero m&aacute;ximo de threads que um pool pode conter. O valor default &eacute; 2147483647.</p>
</dd>
<dt>Conex&atilde;o Ativa</dt>
<dd>
<p>O tempo em segundos que o thread pode permanecer inativo quando o n&uacute;mero de threads for maior que o tamanho do principal. O default &eacute; 60.</p>
</dd>
<dt>Vida &Uacute;til do Thread</dt>
<dd>
<p>O tempo em segundos que cada thread permanece em um pool de threads antes de ser expurgado, independentemente se o n&uacute;mero de threads &eacute; maior que o tamanho do principal ou se o thread est&aacute; inativo.</p>
</dd>
<dt>Capacidade da Fila da Tarefa</dt>
<dd>
<p>O tamanho da fila que mant&eacute;m as tarefas submetidas que est&atilde;o aguardando para serem executadas. O default &eacute; 2147483647 .</p>
</dd>
<dt>Descri&ccedil;&atilde;o</dt>
<dd>
<p>Uma descri&ccedil;&atilde;o deste recurso.</p>
</dd>
<dt>Propriedades Adicionais</dt>
<dd>
<p>Propriedades adicionais para o recurso personalizado. O GlassFish Server n&atilde;o define quaisquer propriedades adicionais para recursos de servi&ccedil;o do executor gerenciado programado.</p>
</dd>
</dl>
<a id="GHCON151" name="GHCON151"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00022"><code>create-XXX</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00162"><code>list-XXX</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00074"><code>delete-XXX</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
