<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-executorservicenew" name="ref-executorservicenew"></a></p>

<h4>Novo Servi&ccedil;o do Executor Gerenciado<a id="sthref24" name="sthref24"></a></h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Use a p&aacute;gina Novo Servi&ccedil;o do Executor Gerenciado para criar um recurso de servi&ccedil;o do executor gerenciado.</p>
<p>A p&aacute;gina Novo Servi&ccedil;o do Executor Gerenciado cont&eacute;m as op&ccedil;&otilde;es a seguir.</p>
<dl>
<dt>Nome JNDI</dt>
<dd>
<p>Um nome JNDI exclusivo que identifica o recurso. Por conven&ccedil;&atilde;o, o nome come&ccedil;a com um indicador de tipo de recurso e uma barra, tais como concurrent/, jdbc/ ou jms/.</p>
</dd>
<dt>Informa&ccedil;&otilde;es de Contexto</dt>
<dd>
<p>Os contextos a serem propagados para threads:, Classloader; JNDI, Seguran&ccedil;a ou WorkArea. A propaga&ccedil;&atilde;o de contexto pode ser ativada ou desativada. Se a op&ccedil;&atilde;o estiver ativada, os contextos selecionados ser&atilde;o propagados. Se esta op&ccedil;&atilde;o estiver desativada, nenhum dos contextos ser&aacute; propagado, mesmo que eles estejam selecionados. O valor default &eacute; Ativado, com todos os quatro contextos selecionados.</p>
</dd>
<dt>Status</dt>
<dd>
<p>O status do recurso. O recurso pode ser ativado ou desativado. O valor default &eacute; Ativado.</p>
</dd>
<dt>Prioridade do Thread</dt>
<dd>
<p>A prioridade a ser designada ao threads criados. O valor default &eacute; 5.</p>
</dd>
<dt>Tarefas de Longa Execu&ccedil;&atilde;o</dt>
<dd>
<p>Se o recurso deve ser usado para tarefas de longa execu&ccedil;&atilde;o. Se esta op&ccedil;&atilde;o estiver ativada, tarefas de longa execu&ccedil;&atilde;o n&atilde;o ser&atilde;o relatadas como paradas. Por default, essa op&ccedil;&atilde;o est&aacute; desativada.</p>
</dd>
<dt>Suspensa Ap&oacute;s</dt>
<dd>
<p>O n&uacute;mero de segundos durante os quais as tarefas podem ser executadas antes de se considerar que n&atilde;o est&atilde;o respondendo. O valor default &eacute; 0.</p>
</dd>
<dt>Descri&ccedil;&atilde;o</dt>
<dd>
<p>Uma descri&ccedil;&atilde;o deste recurso.</p>
</dd>
<dt>Tamanho do Principal</dt>
<dd>
<p>O n&uacute;mero de threads a serem mantidos em um pool de thread. O valor default &eacute; 0.</p>
</dd>
<dt>Tamanho M&aacute;ximo do Pool</dt>
<dd>
<p>O n&uacute;mero m&aacute;ximo de threads que um pool pode conter. O valor default &eacute; 2147483647.</p>
</dd>
<dt>Conex&atilde;o Ativa</dt>
<dd>
<p>O tempo em segundos durante os quais os threads podem permanecer inativos quando o n&uacute;mero de threads for maior que o tamanho do n&uacute;cleo. O valor default &eacute; 60.</p>
</dd>
<dt>Vida &Uacute;til do Thread</dt>
<dd>
<p>O n&uacute;mero de segundos durante os quais os threads podem permanecer em um pool de threads antes de serem expurgados, independentemente de se o n&uacute;mero de threads &eacute; maior do que o tamanho do n&uacute;cleo ou de se os threads est&atilde;o inativos. O valor default &eacute; 0.</p>
</dd>
<dt>Capacidade da Fila da Tarefa</dt>
<dd>
<p>O n&uacute;mero de tarefas submetidas que podem ser armazenadas na fila de tarefas que est&atilde;o aguardando execu&ccedil;&atilde;o. O valor default &eacute; 2147483647.</p>
</dd>
<dt>Propriedades Adicionais</dt>
<dd>
<p>Propriedades adicionais do recurso. O GlassFish Server n&atilde;o define propriedades adicionais para este tipo de recurso. Al&eacute;m disso, este tipo de recurso n&atilde;o usa atualmente propriedades adicionais.</p>
</dd>
<dt>Alvos</dt>
<dd>
<p>(Esta op&ccedil;&atilde;o s&oacute; ser&aacute; exibida se os clusters ou inst&acirc;ncias standalone tiverem sido criados no dom&iacute;nio.)</p>
<p>Clusters e inst&acirc;ncias standalone do recurso. Mova os alvos desejados para a coluna Alvos Selecionados utilizando os bot&otilde;es Adicionar e Adicionar Tudo. Mova os alvos desnecess&aacute;rios para a coluna Alvos Dispon&iacute;veis utilizando os bot&otilde;es Remover e Remover Tudo.</p>
</dd>
</dl>
<a id="sthref25" name="sthref25"></a>
<h5>Tarefas Relacionadas</h5>
<ul>
<li>
<p><a href="task-managedexecutorservicecreate.html">Para Criar um Servi&ccedil;o de Executor Gerenciado</a></p>
</li>
<li>
<p><a href="task-managedexecutorserviceedit.html">Para Editar um Servi&ccedil;o de Executor Gerenciado</a></p>
</li>
<li>
<p><a href="task-managedexecutorservicedelete.html">Para Deletar um Servi&ccedil;o de Executor Gerenciado</a></p>
</li>
</ul>
<a id="GHCON142" name="GHCON142"></a>
<h5>Comandos asadmin Relacionados</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM840"><code>create-managed-executor-service</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM871"><code>list-managed-executor-services</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM848"><code>delete-managed-executor-service</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
