<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-managedthreadfactoryedit" name="task-managedthreadfactoryedit"></a></p>

<h4>Para Editar uma F&aacute;brica de Threads Gerenciados<a id="sthref12" name="sthref12"></a></h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Na &aacute;rvore de navega&ccedil;&atilde;o, expanda o n&oacute; Recursos.</p>
</li>
<li>
<p>No n&oacute; Recursos, expanda o n&oacute; Recursos Concorrentes.</p>
</li>
<li>
<p>No n&oacute; Recursos Concorrentes, selecione F&aacute;bricas de Threads Gerenciados.</p>
<p>A p&aacute;gina F&aacute;bricas de Threads Gerenciados ser&aacute; aberta.</p>
</li>
<li>
<p>Na p&aacute;gina F&aacute;bricas de Thread Gerenciados, clique no nome do recurso que voc&ecirc; est&aacute; editando.</p>
<p>A p&aacute;gina Editar F&aacute;brica de Threads Gerenciados ser&aacute; aberta.</p>

<hr>
<p><b>Observa&ccedil;&atilde;o:</b></p>
O nome JNDI &eacute; um campo somente para leitura. Voc&ecirc; pode especificar o nome JNDI ao criar um novo recurso. O nome JNDI l&oacute;gico tamb&eacute;m &eacute; um campo somente para leitura.
<hr>

</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Informa&ccedil;&otilde;es de Contexto Ativadas para propagar contextos a threads, e selecione os contextos que voc&ecirc; deseja propagar.</p>
<p>Esta op&ccedil;&atilde;o &eacute; ativada e todos os contextos s&atilde;o selecionadas por default. Use Shift-clique ou Control-clique para escolher v&aacute;rios contextos. Se essa op&ccedil;&atilde;o estiver desativada, os contextos n&atilde;o ser&atilde;o propagados, mesmo que eles estejam selecionados.</p>
</li>
<li>
<p>Marque a caixa de sele&ccedil;&atilde;o Status ativo para ativar o recurso.</p>
<p>Por default, a op&ccedil;&atilde;o est&aacute; ativada.</p>
</li>
<li>
<p>No campo Prioridade do Thread, digite a prioridade a ser designada aos threads criados.</p>
<p>O valor default &eacute; 5.</p>
</li>
<li>
<p>No campo Ordem de Implanta&ccedil;&atilde;o, digite um n&uacute;mero para especificar a ordem de implanta&ccedil;&atilde;o do recurso.</p>
<p>Recursos com n&uacute;meros menores s&atilde;o carregados primeiro na inicializa&ccedil;&atilde;o do servidor. O valor default &eacute; 100.</p>
</li>
<li>
<p>No campo Descri&ccedil;&atilde;o, digite uma descri&ccedil;&atilde;o curta do recurso.</p>
<p>Esta descri&ccedil;&atilde;o &eacute; um valor de string e pode incluir no m&aacute;ximo 250 caracteres.</p>
</li>
<li>
<p>Na se&ccedil;&atilde;o Propriedades Adicionais, n&atilde;o adicione propriedades.</p>
<p>O GlassFish Server n&atilde;o define propriedades adicionais para este tipo de recurso. Al&eacute;m disso, este tipo de recurso n&atilde;o usa atualmente propriedades adicionais.</p>
</li>
<li>
<p>Clique em Salvar.</p>
</li>
</ol>
<a id="GHCON124" name="GHCON124"></a>
<h5>Consulte Tamb&eacute;m</h5>
<ul>
<li>
<p><a href="task-managedthreadfactorynew.html">Para Criar uma F&aacute;brica de Threads Gerenciados</a></p>
</li>
<li>
<p><a href="task-managedthreadfactorydelete.html">Para Deletar uma F&aacute;brica de Threads Gerenciados</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
