<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-standaloneinstancenew" name="ref-standaloneinstancenew"></a></p>

<h4><a id="sthref324" name="sthref324"></a><a id="sthref325" name="sthref325"></a><a id="sthref326" name="sthref326"></a>Nueva instancia del servidor independiente</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Nueva instancia del servidor independiente para crear una instancia de GlassFish Server independiente.</p>
<p>La p&aacute;gina Nueva instancia del servidor independiente contiene las opciones siguientes.</p>
<dl>
<dt>Nombre de instancia</dt>
<dd>
<p>Nombre de la instancia que se va a crear.</p>
<p>El nombre debe cumplir los siguientes requisitos:</p>
<ul>
<li>
<p>El nombre s&oacute;lo puede contener caracteres ASCII.</p>
</li>
<li>
<p>El nombre debe empezar por una letra, un n&uacute;mero o un car&aacute;cter de subrayado.</p>
</li>
<li>
<p>El nombre s&oacute;lo puede contener los siguientes caracteres:</p>
<ul>
<li>
<p>Letras en min&uacute;scula</p>
</li>
<li>
<p>Letras en may&uacute;scula</p>
</li>
<li>
<p>N&uacute;meros</p>
</li>
<li>
<p>Gui&oacute;n</p>
</li>
<li>
<p>Punto</p>
</li>
<li>
<p>Subrayado</p>
</li>
</ul>
</li>
<li>
<p>El nombre debe ser &uacute;nico en el dominio y no debe ser el nombre de otro nodo, cluster, configuraci&oacute;n con nombre ni instancia de GlassFish Server.</p>
</li>
<li>
<p>El nombre no debe ser <code>domain</code>, <code>server</code> ni otra palabra clave reservada por GlassFish Server.</p>
</li>
</ul>
</dd>
<dt>Nodo</dt>
<dd>
<p>Lista desplegable de los nodos existentes que definen los hosts en los que puede residir la instancia. Debe seleccionarse un nodo en la lista. Si la instancia se va a crear en el host en el que se est&aacute; ejecutando el servidor de administraci&oacute;n de dominio (DAS), seleccione el nodo predefinido <code>localhost-</code><i>domain</i>.</p>
</dd>
<dt>Configuraci&oacute;n</dt>
<dd>
<p>Lista desplegable de las configuraciones con nombre existentes que la instancia puede utilizar. Debe seleccionarse una configuraci&oacute;n en la lista. La instancia utilizar&aacute; la configuraci&oacute;n seleccionada cuando se cree.</p>
</dd>
<dt>Realizar una copia de la configuraci&oacute;n seleccionada</dt>
<dd>
<p>Si se selecciona esta opci&oacute;n, se copia la configuraci&oacute;n seleccionada cuando se crea la instancia. Se asigna el nombre <i>instance-name</i><code>-config</code> a la copia de la configuraci&oacute;n, donde <i>instance-name</i> es el nombre de la instancia del campo Nombre de instancia.</p>
<p>Si se selecciona <code>default-config</code> en la lista desplegable Configuraci&oacute;n, debe seleccionar esta opci&oacute;n. La configuraci&oacute;n <code>default-config</code> s&oacute;lo se puede copiar, no tomar como referencia.</p>
</dd>
<dt>Hacer referencia a la configuraci&oacute;n seleccionada</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; seleccionada, la instancia usar&aacute; la configuraci&oacute;n con nombre existente especificada.</p>
<p>Si se selecciona <code>default-config</code> en la lista desplegable Configuraci&oacute;n, <i>no</i> debe seleccionar esta opci&oacute;n. La configuraci&oacute;n <code>default-config</code> no puede tomarse como referencia, sino s&oacute;lo copiarse.</p>
</dd>
</dl>
<a id="sthref327" name="sthref327"></a>
<h5>Tareas relacionadas</h5>
<p><a href="task-create-standalone-instance.html">Crear una instancia de GlassFish Server independiente</a></p>
<a id="sthref328" name="sthref328"></a>
<h5>Subcomando asadmin equivalente</h5>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00033"><code>create-instance</code>(1)</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
