<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterinstanceconfigproperties" name="ref-clusterinstanceconfigproperties"></a><a id="GHCLU00010" name="GHCLU00010"></a></p>

<h4><a id="sthref283" name="sthref283"></a><a id="sthref284" name="sthref284"></a><a id="sthref285" name="sthref285"></a>Propiedades del sistema de instancias</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La p&aacute;gina Propiedades del sistema de instancias muestra una lista de las propiedades del sistema Java definidas para la instancia actual de GlassFish Server. Las propiedades del sistema Java se transfieren al iniciador de aplicaciones Java mediante la opci&oacute;n <code>-D</code> del iniciador de aplicaciones Java al iniciar GlassFish Server.</p>
<p>Estas propiedades sustituyen las definiciones de propiedades de configuraci&oacute;n de puertos en la configuraci&oacute;n de la instancia. La configuraci&oacute;n de puertos predefinida se debe sustituir si, por ejemplo, dos instancias en cluster residen en el mismo host. En esta situaci&oacute;n, la configuraci&oacute;n de puertos para una instancia debe sustituirse porque las dos instancias comparten la misma configuraci&oacute;n.</p>
<p>Para obtener m&aacute;s informaci&oacute;n sobre la configuraci&oacute;n de puertos predefinida, consulte <a href="../../../common/en/help/ref-predefinedconfigsysproperties.html">Propiedades predefinidas del sistema de configuraci&oacute;n</a>.</p>
<p>El campo Nombre de instancia es un campo de s&oacute;lo lectura que muestra el nombre de la instancia actual.</p>
<p>Para cada propiedad se muestra la informaci&oacute;n siguiente:</p>
<dl>
<dt>Nombre de variable de instancia</dt>
<dd>
<p>Nombre de la propiedad del sistema.</p>
</dd>
<dt>Valor actual</dt>
<dd>
<p>Valor actualmente definido para la propiedad. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>Valor de sustituci&oacute;n</dt>
<dd>
<p>Valor en el que se definir&aacute; la propiedad despu&eacute;s de guardar los cambios.</p>
</dd>
</dl>
<p>La tabla Propiedades adicionales tambi&eacute;n contiene las opciones siguientes.</p>
<dl>
<dt>Agregar propiedad</dt>
<dd>
<p>Bot&oacute;n para agregar una propiedad. Al hacer clic en este bot&oacute;n se agrega una fila a la tabla Propiedades adicionales.</p>
</dd>
<dt>Suprimir propiedades</dt>
<dd>
<p>Bot&oacute;n para suprimir una o varias propiedades seleccionadas. Cualquier propiedad que se suprima vuelve a su valor por defecto o, si no se ha definido ning&uacute;n valor por defecto, se queda sin definir.</p>
</dd>
</dl>
<a id="sthref286" name="sthref286"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-change-clustered-instance-ports.html">Modificar los n&uacute;meros de puerto de una instancia de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-config-sys-properties-defaults.html">Definir los Valores por Defecto de las Propiedades del Sistema de Configuraci&oacute;n</a></p>
</li>
</ul>
<a id="sthref287" name="sthref287"></a>
<h5>Subcomandos asadmin equivalentes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00059"><code>create-system-properties</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00110"><code>delete-system-property</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00203"><code>list-system-properties</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
