<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterproperties" name="ref-clusterproperties"></a><a id="GHCLU00014" name="GHCLU00014"></a></p>

<h4><a id="sthref300" name="sthref300"></a><a id="sthref301" name="sthref301"></a>Propiedades del cluster</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La p&aacute;gina Propiedades del cluster muestra una lista de las propiedades que se definen para los clusters seleccionados. Estas propiedades agregan informaci&oacute;n de configuraci&oacute;n opcional sobre el cluster.</p>
<p>El campo Nombre de cluster es un campo de s&oacute;lo lectura que muestra el nombre del cluster seleccionado.</p>
<p>Para cada propiedad se muestra la informaci&oacute;n siguiente:</p>
<dl>
<dt>Nombre</dt>
<dd>
<p>Nombre de la propiedad.</p>
</dd>
<dt>Valor</dt>
<dd>
<p>Valor de la propiedad que se ha definido para la instancia seleccionada.</p>
</dd>
<dt>Descripci&oacute;n</dt>
<dd>
<p>Descripci&oacute;n textual que ofrece m&aacute;s informaci&oacute;n sobre la propiedad.</p>
</dd>
</dl>
<p>La tabla Propiedades adicionales tambi&eacute;n contiene las opciones siguientes.</p>
<dl>
<dt>Agregar propiedad</dt>
<dd>
<p>Bot&oacute;n para agregar una propiedad. Al hacer clic en este bot&oacute;n se agrega una fila a la tabla Propiedades adicionales.</p>
</dd>
<dt>Suprimir propiedades</dt>
<dd>
<p>Bot&oacute;n para suprimir una o varias propiedades seleccionadas. Cualquier propiedad que se suprima vuelve a su valor por defecto o, si no se ha definido ning&uacute;n valor por defecto, se queda sin definir.</p>
</dd>
</dl>
<p>GlassFish Server define las siguientes propiedades del cluster:</p>
<dl>
<dt><code>gms_discovery_uri_list</code></dt>
<dd>
<p>Ubicaciones de las instancias de GlassFish Server del cluster que se van a usar para detectar dicho cluster. Esta propiedad s&oacute;lo es necesaria si el servicio de gesti&oacute;n de grupos (GMS) no utiliza multidifusi&oacute;n para enviar mensajes.</p>
<p>Los valores v&aacute;lidos de esta propiedad son los siguientes:</p>
<ul>
<li>
<p>Una lista de identificadores de recursos uniformes (URI) separados por comas. Cada URI debe localizar una instancia de GlassFish Server o el DAS. Este formato es necesario si hay varias instancias de GlassFish Server en ejecuci&oacute;n en el mismo host.</p>
<p>El formato de cada URI en la lista es el siguiente:</p>
<p><i>scheme</i><code>://</code><i>host-name-or -IP-address</i><code>:</code><i>port</i></p>
<ul>
<li>
<p><i>scheme</i> es el esquema de URI, que es <code>tcp</code>.</p>
</li>
<li>
<p><i>host-name-or -IP-address</i> es el nombre de host o la direcci&oacute;n IP del host en el que se ejecuta la instancia.</p>
</li>
<li>
<p><i>port</i> es el n&uacute;mero del puerto en el que la instancia recibe mensajes de GMS. Debe definirse la propiedad del sistema <code>GMS_LISTENER_PORT-</code><i>clustername</i> para la instancia. Para obtener informaci&oacute;n sobre c&oacute;mo definir esta propiedad del sistema para una instancia, consulte la secci&oacute;n sobre la <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSHAG00373">detecci&oacute;n de un cluster cuando el transporte de multidifusi&oacute;n no est&aacute; disponible</a> en <i>Oracle GlassFish Server High Availability Administration Guide</i>.</p>
</li>
</ul>
</li>
<li>
<p>Lista separada por comas de direcciones IP o nombres de host en los que se est&eacute;n ejecutando el DAS o las instancias. Esta lista puede contener una mezcla de direcciones IP y nombres de host. Este formato puede utilizarse s&oacute;lo si se ejecuta una instancia en cluster en cada host. El valor de la propiedad <code>GMS_LISTENER_PORT</code> debe ser &uacute;nico para cada cluster de un dominio.</p>
</li>
<li>
<p>La palabra clave <code>generate</code>. Este formato s&oacute;lo se puede usar si se est&aacute; ejecutando una instancia de cluster en cada host y si el DAS se est&aacute; ejecutando en un host diferente. No puede haber varias instancias en el mismo host que pertenezcan al mismo cluster. El valor de la propiedad <code>GMS_LISTENER_PORT</code> debe ser &uacute;nico para cada cluster de un dominio.</p>
</li>
</ul>
</dd>
<dt><code>GMS_LISTENER_PORT</code></dt>
<dd>
<p>N&uacute;mero del puerto en el que el cluster recibe mensajes de GMS.</p>
<p>El valor por defecto es una referencia a la propiedad del sistema <code>GMS_LISTENER_PORT-</code><i>cluster-name</i>. Por defecto, esta propiedad de sistema no est&aacute; definida. En esta situaci&oacute;n, GMS seleccionar&aacute; un puerto libre de los que se incluyen en el rango definido por las propiedades <code>GMS_TCPSTARTPORT</code> y <code>GMS_TCPENDPORT</code>. Por defecto, este rango es 9090-9200. En la mayor&iacute;a de los casos, este comportamiento por defecto debe ser suficiente.</p>
<p>Sin embargo, si GMS <b>no</b> utiliza la multidifusi&oacute;n para difundir mensajes, esta propiedad debe indicar un n&uacute;mero de puerto v&aacute;lido para todas las instancias de GlassFish Server del cluster. Para utilizar el valor por defecto para cubrir este requisito, utilice una propiedad del sistema para definir el n&uacute;mero de puerto para cada una de las instancias.</p>
<p>Por ejemplo, utilice la p&aacute;gina <a href="ref-clustersystemproperties.html">Propiedades del sistema de cluster</a> para crear la propiedad del sistema <code>GMS_LISTENER_PORT-</code><i>cluster-name</i> para el DAS. A continuaci&oacute;n, para cada instancia del cluster, defina la propiedad del sistema <code>GMS_LISTENER_PORT-</code><i>cluster-name</i> en el n&uacute;mero de puerto en el que la instancia recibe mensajes de GMS. El valor por defecto de la propiedad <code>GMS_LISTENER_PORT</code> para el cluster hace referencia a esta propiedad del sistema.</p>
</dd>
<dt><code>GMS_LOOPBACK</code></dt>
<dd>
<p>Especifica si una instancia puede recibir de ella misma mensajes de nivel de aplicaci&oacute;n que difunda al cluster.</p>
<p>Los valores posibles son los siguientes:</p>
<dl>
<dt><code>false</code></dt>
<dd>
<p>La instancia <i>no</i> puede recibir mensajes de ella misma (por defecto).</p>
</dd>
<dt><code>true</code></dt>
<dd>
<p>La instancia puede recibir mensajes de ella misma. Utilice esta configuraci&oacute;n para probar una instancia cuando sea la &uacute;nica de un cluster.</p>
</dd>
</dl>
</dd>
<dt><code>GMS_MULTICAST_TIME_TO_LIVE</code></dt>
<dd>
<p>N&uacute;mero m&aacute;ximo de iteraciones o transmisiones que puede experimentar un mensaje de multidifusi&oacute;n para los siguientes tipos de eventos antes de descartar el mensaje:</p>
<ul>
<li>
<p>Detecci&oacute;n de grupos</p>
</li>
<li>
<p>Latidos de miembros</p>
</li>
<li>
<p>Cambios de miembros</p>
</li>
</ul>
<p>Para coincidir con la configuraci&oacute;n de la red en la que se despliegan el DAS y las instancias agrupadas en cluster, configure esta opci&oacute;n con el valor m&aacute;s bajo posible. Para determinar el valor m&aacute;s bajo posible para el sistema, utilice el subcomando <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00259"><code>validate-multicast</code>(1)</a>.</p>
<p>Un valor de 0 garantiza que los mensajes de multidifusi&oacute;n nunca dejar&aacute;n el host desde el cual se difunden.</p>
<p>Un valor de 1 puede impedir la difusi&oacute;n de mensajes entre hosts de la misma subred que est&aacute;n conectados mediante un conmutador o un enrutador.</p>
<p>El valor por defecto es 4, que garantiza que los mensajes se difundan correctamente a todos los miembros del cluster de las redes en las que se han conectado los hosts mediante conmutadores o enrutadores.</p>
</dd>
<dt><code>GMS_TCPENDPORT</code></dt>
<dd>
<p>N&uacute;mero de puerto m&aacute;s alto dentro del rango en el que GMS selecciona un puerto libre si la propiedad del sistema <code>GMS_LISTENER_PORT-</code><i>cluster-name</i> no se ha definido. El valor por defecto es 9200.</p>
</dd>
<dt><code>GMS_TCPSTARTPORT</code></dt>
<dd>
<p>N&uacute;mero de puerto m&aacute;s bajo dentro del rango en el que GMS selecciona un puerto libre si la propiedad del sistema <code>GMS_LISTENER_PORT-</code><i>cluster-name</i> no se ha definido. El valor por defecto es 9090.</p>
</dd>
</dl>
<a id="sthref302" name="sthref302"></a>
<h5>Subcomandos asadmin equivalentes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00139"><code>get</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00145"><code>list</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00226"><code>set</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
