<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusternew" name="ref-clusternew"></a></p>

<h4><a id="sthref247" name="sthref247"></a><a id="sthref248" name="sthref248"></a>Cluster nuevo</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Cluster nuevo para crear un cluster.</p>
<p>La p&aacute;gina Cluster nuevo contiene las opciones siguientes.</p>
<dl>
<dt>Nombre de cluster</dt>
<dd>
<p>Nombre del cluster.</p>
<p>El nombre debe cumplir los siguientes requisitos:</p>
<ul>
<li>
<p>El nombre s&oacute;lo puede contener caracteres ASCII.</p>
</li>
<li>
<p>El nombre debe empezar por una letra, un n&uacute;mero o un car&aacute;cter de subrayado.</p>
</li>
<li>
<p>El nombre s&oacute;lo puede contener los siguientes caracteres:</p>
<ul>
<li>
<p>Letras en min&uacute;scula</p>
</li>
<li>
<p>Letras en may&uacute;scula</p>
</li>
<li>
<p>N&uacute;meros</p>
</li>
<li>
<p>Gui&oacute;n</p>
</li>
<li>
<p>Punto</p>
</li>
<li>
<p>Subrayado</p>
</li>
</ul>
</li>
<li>
<p>El nombre debe ser &uacute;nico en el dominio y no debe ser el nombre de otro cluster, una configuraci&oacute;n con nombre, una instancia de GlassFish Server ni otro nodo.</p>
</li>
<li>
<p>El nombre no debe ser <code>domain</code>, <code>server</code> ni otra palabra clave reservada por GlassFish Server.</p>
</li>
</ul>
</dd>
<dt>Configuraci&oacute;n</dt>
<dd>
<p>Lista desplegable de las configuraciones con nombre existentes que puede utilizar el cluster. Un cluster necesita una configuraci&oacute;n con nombre que defina la configuraci&oacute;n de todas las instancias que se agregan al cluster. Debe seleccionarse una configuraci&oacute;n en la lista. El cluster utilizar&aacute; la configuraci&oacute;n seleccionada cuando se cree.</p>
</dd>
<dt>Realizar una copia de la configuraci&oacute;n seleccionada</dt>
<dd>
<p>Si se selecciona esta opci&oacute;n, se copia la configuraci&oacute;n seleccionada cuando se crea el cluster. Se asigna el nombre <i>cluster-name</i><code>-config</code> a la copia de la configuraci&oacute;n, donde <i>cluster-name</i> es el nombre del cluster del campo Nombre de cluster.</p>
<p>Si se selecciona <code>default-config</code> en la lista desplegable Configuraci&oacute;n, debe seleccionar esta opci&oacute;n. La configuraci&oacute;n <code>default-config</code> s&oacute;lo se puede copiar, no tomar como referencia.</p>
</dd>
<dt>Hacer referencia a la configuraci&oacute;n seleccionada</dt>
<dd>
<p>Si se selecciona esta opci&oacute;n, el cluster utilizar&aacute; la configuraci&oacute;n con nombre existente especificada.</p>
<p>Si se selecciona <code>default-config</code> en la lista desplegable Configuraci&oacute;n, <i>no</i> debe seleccionar esta opci&oacute;n. La configuraci&oacute;n <code>default-config</code> no puede tomarse como referencia, sino s&oacute;lo copiarse.</p>
</dd>
<dt>Tipo de configuraci&oacute;n de cluster de Message Queue</dt>
<dd>
<p>Use esta opci&oacute;n para especificar el tipo de cluster de broker Message Queue que se va a usar para el nuevo cluster de GlassFish Server. Por defecto, GlassFish Server usa un cluster de broker Message Queue convencional con un broker maestro, con un broker embebido en cada una de las instancias del cluster de GlassFish Server.</p>
<p>Si esta opci&oacute;n se define como Personalizada, se mostrar&aacute;n varias opciones adicionales para configurar el cluster de broker Message Queue de forma que se pueda usar para el cluster de GlassFish Server. Consulte <a href="#CHDJFEJB">Opciones para clusters de broker Message Queue personalizados</a>.</p>
</dd>
<dt>Instancias del servidor que se van a crear</dt>
<dd>
<p>Lista de instancias de GlassFish Server que se crear&aacute;n cuando se cree el cluster. Para cada instancia, se proporciona la informaci&oacute;n siguiente:</p>
<dl>
<dt>Nombre de instancia</dt>
<dd>
<p>Nombre de la instancia.</p>
</dd>
<dt>Peso</dt>
<dd>
<p>Entero que representa el peso de equilibrio de carga de la instancia.</p>
<p>El peso de equilibrio de carga determina la proporci&oacute;n de todas las solicitudes con respecto al cluster que debe procesar la instancia.</p>
<p>Por ejemplo, en un cluster de dos instancias, puede necesitar que una instancia procese una solicitud de cuatro, y que otra procese las otras tres. En este caso, configure el peso de la instancia que debe procesar una de las cuatro solicitudes como 1 y el peso de la otra instancia como 3. Si prefiere usar porcentajes, defina los pesos de las instancias como 25 y 75, respectivamente.</p>
<p>El peso por defecto es 100.</p>
</dd>
<dt>Nodo</dt>
<dd>
<p>Lista desplegable de los nodos existentes en los que puede residir la instancia. Debe seleccionarse un nodo en la lista. La instancia residir&aacute; en el nodo seleccionado cuando se cree el cluster.</p>
</dd>
</dl>
<p>La tabla Instancias del Servidor que se van a crear tambi&eacute;n contiene las opciones siguientes.</p>
<dl>
<dt>Nuevo</dt>
<dd>
<p>Bot&oacute;n para crear una instancia. Al hacer clic en este bot&oacute;n se agrega una fila a la tabla Instancias del servidor que se van a crear.</p>
</dd>
<dt>Suprimir</dt>
<dd>
<p>Bot&oacute;n para suprimir una instancia.</p>
</dd>
</dl>
</dd>
</dl>
<a id="CHDJFEJB" name="CHDJFEJB"></a>
<h5>Opciones para clusters de broker Message Queue personalizados</h5>
<p>Cuando se defina la opci&oacute;n Tipo de configuraci&oacute;n de cluster de Message Queue como Personalizada, se mostrar&aacute;n las opciones siguientes para configurar el cluster de broker Message Queue de forma que se pueda usar para el cluster de GlassFish Server.</p>
<dl>
<dt>Tipo de servicio JMS</dt>
<dd>
<p>Tipo de broker (llamado host JMS en GlassFish Server) que se debe usar en el cluster de broker. El tipo seleccionado determinar&aacute; los tipos de clusters de broker disponibles. Los tipos de broker disponibles son los siguientes:</p>
<dl>
<dt>Embebido</dt>
<dd>
<p>GlassFish Server gestiona el ciclo de vida y la configuraci&oacute;n del broker. Cada instancia en cluster de GlassFish la sirve un broker que se ejecuta en la misma JVM que la instancia.</p>
<p>Si la opci&oacute;n Tipo de servicio JMS se define en Embebido, s&oacute;lo se soportar&aacute;n los clusters de broker Message Queue convencionales. Se mostrar&aacute;n las opciones de configuraci&oacute;n del cluster convencional.</p>
</dd>
<dt>Local</dt>
<dd>
<p>GlassFish Server gestiona el ciclo de vida y la configuraci&oacute;n del broker. Cada instancia en cluster de GlassFish la sirve un broker que se ejecuta en una JVM distinta situada en el mismo host que la instancia.</p>
<p>Si la opci&oacute;n Tipo de servicio JMS se define en Local, se soportar&aacute;n los clusters de broker Message Queue convencionales y tambi&eacute;n los mejorados (con alta disponibilidad). Se mostrar&aacute;n las opciones para seleccionar el tipo de cluster y para la configuraci&oacute;n del mismo.</p>
</dd>
<dt>Remoto</dt>
<dd>
<p>La configuraci&oacute;n y el ciclo de vida del broker y del cluster de broker se gestionan a trav&eacute;s de las herramientas administrativas de Message Queue.</p>
<p>Si la opci&oacute;n Tipo de servicio JMS se define en Remoto, no se mostrar&aacute;n otras opciones.</p>
</dd>
</dl>
</dd>
<dt>Tipo de cluster de JMS</dt>
<dd>
<p>Tipo de cluster de broker Message Queue que se debe usar para el cluster de GlassFish Server.</p>
<p>Si la opci&oacute;n Tipo de cluster de JMS se define en Convencional, se mostrar&aacute;n las opciones siguientes.</p>
<dl>
<dt>Tipo de almac&eacute;n de configuraci&oacute;n de JMS</dt>
<dd>
<p>Tipo de almac&eacute;n de datos que se va a usar para los datos de configuraci&oacute;n del cluster convencional. Si esta opci&oacute;n se define como Broker maestro, se designar&aacute; un broker del cluster como broker maestro que ser&aacute; responsable del almacenamiento de los datos de configuraci&oacute;n. Si esta opci&oacute;n se define en Base de datos compartida, los datos de configuraci&oacute;n se almacenar&aacute;n en un almac&eacute;n de datos JDBC accesible para todos los brokers. En este caso, se mostrar&aacute;n las opciones relacionadas con la base de datos.</p>
</dd>
<dt>Tipo de almac&eacute;n de mensajes de JMS</dt>
<dd>
<p>Tipo de almac&eacute;n de datos que va a usar cada broker para almacenar los datos de sus mensajes. Si se define esta opci&oacute;n en Archivo, cada broker almacenar&aacute; los datos correspondientes en un almac&eacute;n de datos basado en archivos. Si se define esta opci&oacute;n en JDBC, cada broker almacenar&aacute; los datos correspondientes en un almac&eacute;n de datos JDBC.</p>
</dd>
</dl>
<p>Si la opci&oacute;n Tipo de cluster de JMS se define en Mejorado (HA), se mostrar&aacute;n las opciones relacionadas con las bases de datos.</p>
</dd>
<dt>Proveedor de base de datos</dt>
<dt>URL de base de datos</dt>
<dt>Usuario de base de datos</dt>
<dd>
<p>Proveedor de la base de datos, URL de acceso y usuario de la base de datos JDBC que se van a utilizar en cualquiera de estas situaciones:</p>
<ul>
<li>
<p>Cuando el tipo de almac&eacute;n de configuraci&oacute;n de un cluster convencional se ha definido en Base de datos compartida.</p>
</li>
<li>
<p>Cuando el tipo de almac&eacute;n de mensajes de un cluster convencional se ha definido en JDBC.</p>
</li>
<li>
<p>Cuando el tipo de cluster se ha definido en Mejorado (HA).</p>
</li>
</ul>
<p>Para obtener informaci&oacute;n sobre proveedores soportados y los formatos de URL de acceso de cada proveedor, consulte la secci&oacute;n sobre <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GMADG00244">persistencia basada en JDBC</a> en <i>Oracle GlassFish Server Message Queue Administration Guide</i>.</p>
</dd>
<dt>Autenticaci&oacute;n de base de datos</dt>
<dt>Contrase&ntilde;a de base de datos</dt>
<dt>Alias de contrase&ntilde;a</dt>
<dd>
<p>Informaci&oacute;n de contrase&ntilde;a para el usuario de la base de datos JDBC especificado en Usuario de base de datos.</p>
<p>Si la opci&oacute;n Autenticaci&oacute;n de base de datos est&aacute; definida en Contrase&ntilde;a, se mostrar&aacute; la opci&oacute;n Contrase&ntilde;a de base de datos. Si la opci&oacute;n Autenticaci&oacute;n de base de datos est&aacute; definida en Alias de contrase&ntilde;a, se mostrar&aacute; la opci&oacute;n Alias de contrase&ntilde;a.</p>
</dd>
<dt>Propiedades del cluster JMS</dt>
<dd>
<p>Lista de una o m&aacute;s propiedades de broker Message Queue para configurar los distintos brokers. Esta lista viene separada por dos puntos (<code>:</code>) y tiene este formato:</p>
<pre>
<i>prop1Name</i>=<i>prop1Value</i>:<i>prop2Name</i>=<i>prop2Value</i>:...
</pre>
<p>Si el nombre de la propiedad de broker incluye puntos, coloque dos barras invertidas antes de los puntos (<code>\\</code>); por ejemplo, para incluir la propiedad <code>imq.system.max_count</code>, especifique <code>imq\\.system\\.max_count</code> en la lista.</p>
</dd>
</dl>
<a id="sthref249" name="sthref249"></a>
<h5>Tareas relacionadas</h5>
<p><a href="task-create-cluster.html">Para crear un cluster</a></p>
<a id="sthref250" name="sthref250"></a>
<h5>Subcomando asadmin equivalente</h5>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00017"><code>create-cluster</code>(1)</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
