<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-standaloneinstancegeneral" name="ref-standaloneinstancegeneral"></a></p>

<h4><a id="sthref329" name="sthref329"></a><a id="sthref330" name="sthref330"></a><a id="sthref331" name="sthref331"></a>Informaci&oacute;n general</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La p&aacute;gina Informaci&oacute;n general contiene las opciones siguientes.</p>
<dl>
<dt>Iniciar</dt>
<dd>
<p>Bot&oacute;n para iniciar la instancia. Si la instancia se est&aacute; ejecutando, este bot&oacute;n est&aacute; desactivado.</p>
</dd>
<dt>Parar</dt>
<dd>
<p>Bot&oacute;n para parar la instancia. Si la instancia est&aacute; parada, este bot&oacute;n est&aacute; desactivado.</p>
</dd>
<dt>Reiniciar</dt>
<dd>
<p>Bot&oacute;n para reiniciar la instancia. Si la instancia est&aacute; parada, este bot&oacute;n est&aacute; desactivado.</p>
</dd>
<dt>Ver archivos log</dt>
<dd>
<p>Bot&oacute;n para ver archivos log para la instancia.</p>
</dd>
<dt>Rotar log</dt>
<dd>
<p>Bot&oacute;n para rotar el archivo log para la instancia. Cuando se rota el archivo log, se cambia el nombre del archivo por un nombre con registro de hora con el formato <code>server.log_</code><i>date-and-time</i> y se crea un archivo log vac&iacute;o para los nuevos mensajes de log. Los cambios se aplican de forma din&aacute;mica. No es necesario reiniciar el servidor.</p>
</dd>
<dt>Recuperar transacciones</dt>
<dd>
<p>Bot&oacute;n para recuperar las transacciones para la instancia.</p>
</dd>
<dt>Nombre</dt>
<dd>
<p>Nombre que se asign&oacute; a la instancia en el momento de su creaci&oacute;n. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>JVM</dt>
<dd>
<p>Si hace clic en Informe de JVM, se abrir&aacute; una ventana independiente que muestra informes sobre Java Virtual Machine, incluyendo un informe resumido, un informe sobre gesti&oacute;n de la memoria y recolecci&oacute;n de basura, otro informe sobre carga de clase y un volcado de thread actual.</p>
</dd>
<dt>Estado</dt>
<dd>
<p>Indicaci&oacute;n de si la instancia est&aacute; en ejecuci&oacute;n o no. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>Nodo</dt>
<dd>
<p>Nombre del nodo en el que reside la instancia. Al hacer clic en el nombre se abrir&aacute; la p&aacute;gina <a href="ref-nodeedit.html">Editar nodo</a> del nodo.</p>
</dd>
<dt>Configuraci&oacute;n</dt>
<dd>
<p>Configuraci&oacute;n a la que hace referencia la instancia. Al hacer clic en la configuraci&oacute;n se abrir&aacute; la p&aacute;gina <a href="../../../common/en/help/ref-configuration.html">Configuraciones</a> para la instancia.</p>
</dd>
<dt>Depurar</dt>
<dd>
<p>Indicaci&oacute;n de si se ha activado la depuraci&oacute;n de Java Platform Debugger Architecture (JPDA) (<code><a href="http://java.sun.com/javase/technologies/core/toolsapis/jpda/">http://java.sun.com/javase/technologies/core/toolsapis/jpda/</a></code>) para la instancia. Este campo es de s&oacute;lo lectura.</p>
<p>Si se inicia una instancia desde la Consola de administraci&oacute;n, la depuraci&oacute;n de JPDA no se activa para la instancia. Para iniciar una instancia con depuraci&oacute;n de JPDA activada, utilice el subcomando <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00236"><code>start-instance</code>(1)</a>.</p>
</dd>
<dt>Puertos HTTP</dt>
<dd>
<p>Lista separada por comas de los n&uacute;meros de puerto en los que la instancia recibe los siguientes tipos de solicitudes:</p>
<ul>
<li>
<p>Solicitudes de administraci&oacute;n</p>
</li>
<li>
<p>Solicitudes HTTP</p>
</li>
<li>
<p>Solicitudes HTTPS</p>
</li>
</ul>
<p>Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>Puertos IIOP</dt>
<dd>
<p>Lista separada por comas de los n&uacute;meros de puerto que utiliza la instancia para los siguientes tipos de conexiones:</p>
<ul>
<li>
<p>Conexi&oacute;n IIOP segura</p>
</li>
<li>
<p>Conexiones IIOP seguras con autenticaci&oacute;n de cliente</p>
</li>
<li>
<p>Conexiones IIOP</p>
</li>
</ul>
<p>Este campo es de s&oacute;lo lectura.</p>
</dd>
</dl>
<a id="sthref332" name="sthref332"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-start-standalone-instances.html">Iniciar instancias de GlassFish Server independientes</a></p>
</li>
<li>
<p><a href="task-stop-standalone-instances.html">Parar instancias de GlassFish Server independientes</a></p>
</li>
<li>
<p><a href="task-view-logs-standalone-instance.html">Ver Archivos Log para una Instancia de GlassFish Server Independiente</a></p>
</li>
<li>
<p><a href="task-recovertransactions-standalone-instance.html">Recuperar transacciones para una instancia de GlassFish Server independiente</a></p>
</li>
</ul>
<a id="sthref333" name="sthref333"></a>
<h5>Subcomandos asadmin equivalentes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00138"><code>generate-jvm-report</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00236"><code>start-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00241"><code>stop-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00224"><code>rotate-log</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
