<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-nodenew" name="ref-nodenew"></a></p>

<h4><a id="sthref307" name="sthref307"></a>Nuevo nodo</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Nuevo nodo para crear un nodo de GlassFish Server. Un nodo representa un host en el que est&aacute; instalado el software GlassFish Server. Debe existir un nodo en cada host en el que residan instancias de GlassFish Server.</p>
<p>Las opciones que aparezcan en la p&aacute;gina Nuevo nodo depender&aacute;n del tipo de nodo.</p>
<a id="sthref308" name="sthref308"></a>
<h5>Opciones para todos los tipos de nodos</h5>
<p>Las opciones siguientes est&aacute;n disponibles para todos los tipos de nodos:</p>
<dl>
<dt>Nombre</dt>
<dd>
<p>Nombre del nodo.</p>
<p>El nombre debe cumplir los siguientes requisitos:</p>
<ul>
<li>
<p>El nombre s&oacute;lo puede contener caracteres ASCII.</p>
</li>
<li>
<p>El nombre debe empezar por una letra, un n&uacute;mero o un car&aacute;cter de subrayado.</p>
</li>
<li>
<p>El nombre s&oacute;lo puede contener los siguientes caracteres:</p>
<ul>
<li>
<p>Letras en min&uacute;scula</p>
</li>
<li>
<p>Letras en may&uacute;scula</p>
</li>
<li>
<p>N&uacute;meros</p>
</li>
<li>
<p>Gui&oacute;n</p>
</li>
<li>
<p>Punto</p>
</li>
<li>
<p>Subrayado</p>
</li>
</ul>
</li>
<li>
<p>El nombre debe ser &uacute;nico en el dominio y no debe ser el nombre de otro nodo, un cluster, una configuraci&oacute;n con nombre ni una instancia de GlassFish Server.</p>
</li>
<li>
<p>El nombre no debe ser <code>domain</code>, <code>server</code> ni otra palabra clave reservada por GlassFish Server.</p>
</li>
</ul>
</dd>
<dt>Tipo</dt>
<dd>
<p>Lista desplegable para especificar el tipo de nodo, que puede ser:</p>
<dl>
<dt>CONFIG</dt>
<dd>
<p>El nodo no soporta la comunicaci&oacute;n remota. Si est&aacute; seleccionada la opci&oacute;n CONFIG, no se muestran opciones de configuraci&oacute;n de SSH o DCOM y se borra el contenido del campo Directorio de instalaci&oacute;n.</p>
</dd>
<dt>DCOM</dt>
<dd>
<p>El nodo soporta comunicaci&oacute;n a trav&eacute;s del protocolo remoto Distributed Component Object Model (DCOM). El protocolo DCOM est&aacute; disponible s&oacute;lo en los sistemas Windows.</p>
</dd>
<dt>SSH</dt>
<dd>
<p>El nodo soporta comunicaci&oacute;n sobre shell seguro (SSH).</p>
</dd>
</dl>
</dd>
<dt>Host de nodo</dt>
<dd>
<p>Nombre del host que el nodo representa. Este campo es obligatorio o no en funci&oacute;n del tipo de nodo:</p>
<ul>
<li>
<p>Si el tipo de nodo es CONFIG., el nombre del host puede omitirse. El nombre del host se puede determinar al crear las instancias que residen en el nodo.</p>
</li>
<li>
<p>Si el tipo de nodo es DCOM o SSH, se debe especificar el nombre del host. De lo contrario, se produce un error.</p>
</li>
</ul>
</dd>
<dt>Directorio de nodos</dt>
<dd>
<p>Ruta de acceso al directorio que va a contener las instancias de GlassFish Server que se crean en el nodo. Si se especifica una ruta de acceso relativa, la ruta de acceso es relativa con respecto al directorio as-install.</p>
<p>El valor por defecto depende del tipo de nodo:</p>
<ul>
<li>
<p>Si el tipo de nodo es CONFIG, no se especifica ning&uacute;n directorio de instancias para el nodo en la configuraci&oacute;n del servidor de administraci&oacute;n de dominio (DAS). El directorio del nodo se puede determinar al crear las instancias que residen en el nodo.</p>
</li>
<li>
<p>Si el tipo de nodo es DCOM, el valor por defecto es as-install<code>\nodes</code>, donde as-install es el directorio base de instalaci&oacute;n del software GlassFish Server en el host.</p>
</li>
<li>
<p>Si el tipo de nodo es SSH, el valor por defecto es as-install<code>/nodes</code>, donde as-install es el directorio base de instalaci&oacute;n del software GlassFish Server en el host.</p>
</li>
</ul>
</dd>
<dt>Directorio de instalaci&oacute;n</dt>
<dd>
<p>Ruta de acceso completa al <i>principal</i> del directorio de instalaci&oacute;n base del software GlassFish Server en el host, por ejemplo <code>/export/glassfish3</code>.</p>
<p>El valor por defecto depende del tipo de nodo:</p>
<ul>
<li>
<p>Si el tipo de nodo es CONFIG., no se especifica ning&uacute;n directorio de instalaci&oacute;n para el nodo en la configuraci&oacute;n de DAS. El directorio de instalaci&oacute;n se puede determinar al crear las instancias que residen en el nodo.</p>
</li>
<li>
<p>Si el tipo de nodo es DCOM o SSH, el valor por defecto es el principal del directorio de instalaci&oacute;n base por defecto del software GlassFish Server para DAS. Este valor por defecto s&oacute;lo es &uacute;til si se ha instalado GlassFish Server en la misma ubicaci&oacute;n en todos los hosts.</p>
</li>
</ul>
</dd>
</dl>
<a id="sthref309" name="sthref309"></a>
<h5>Opciones adicionales para los nodos DCOM</h5>
<p>Las opciones siguientes est&aacute;n disponibles s&oacute;lo si el campo Tipo se define en DCOM:</p>
<dl>
<dt>Instalar GlassFish Server</dt>
<dd>
<p>Si se selecciona la opci&oacute;n Activado, DAS copiar&aacute; el software GlassFish Server del host de DAS en el host del nodo. Para copiar el software GlassFish Server en el host, DAS debe poder contactar con el host mediante DCOM.</p>
</dd>
<dt>Forzar</dt>
<dd>
<p>Si se selecciona la opci&oacute;n Activado, se crea el nodo en la configuraci&oacute;n de DAS aunque falle la validaci&oacute;n de los par&aacute;metros del nodo. Para validar los par&aacute;metros de un nodo, DAS debe poder establecer contacto con el host del nodo a trav&eacute;s de DCOM.</p>
</dd>
<dt>Validar DCOM</dt>
<dd>
<p>Si se selecciona la opci&oacute;n Activado, GlassFish Server prueba la conexi&oacute;n mediante DCOM con el host del nodo antes de crear el nodo. Como parte de la prueba, GlassFish Server copia un script llamado <code>delete_me.bat</code> en el host.</p>
<p>Si selecciona esta opci&oacute;n, se activa el campo Directorio de prueba remoto para permitirle proporcionar el directorio en el que GlassFish Server debe copiar el script.</p>
</dd>
<dt>Directorio de prueba remoto</dt>
<dd>
<p>Carpeta del host remoto en la que GlassFish Server debe crear el archivo <code>delete_me.bat</code>. El usuario que especifica la opci&oacute;n Nombre de usuario de Windows debe tener acceso de escritura a esta carpeta. De lo contrario, se produce un error. El valor por defecto es <code>C:\</code>.</p>
</dd>
<dt>Dominio de Windows</dt>
<dd>
<p>Nombre del dominio de Windows que contiene el usuario que especifica la opci&oacute;n Nombre de usuario de Windows. El valor por defecto es el nombre del host en el que se est&aacute; ejecutando la Consola de administraci&oacute;n.</p>
</dd>
<dt>Nombre de usuario de Windows</dt>
<dd>
<p>Usuario del host de este nodo que va a ejecutar el proceso para conectarse al host a trav&eacute;s de DCOM. El valor por defecto es el usuario que est&aacute; ejecutando el proceso DAS. Si la opci&oacute;n Host de nodo se define en <code>localhost-</code>domain, se ignora la opci&oacute;n Nombre de usuario de Windows.</p>
</dd>
<dt>Autenticaci&oacute;n de usuario de Windows</dt>
<dd>
<p>Lista desplegable para especificar c&oacute;mo se autentica el usuario de Windows al conectarse al host de este nodo. Los m&eacute;todos de autenticaci&oacute;n posibles son los siguientes:</p>
<dl>
<dt>Contrase&ntilde;a</dt>
<dd>
<p>El usuario de Windows se autentica mediante una contrase&ntilde;a que se almacena en la configuraci&oacute;n de DAS.</p>

<hr>
<p><b>Atenci&oacute;n:</b></p>
Esta contrase&ntilde;a se almacena en forma de texto no cifrado en la configuraci&oacute;n de DAS. Para mejorar la seguridad, utilice un alias de contrase&ntilde;a.
<hr>

<p>Si selecciona esta opci&oacute;n, el campo Contrase&ntilde;a de usuario de Windows se activa para que pueda indicar la contrase&ntilde;a.</p>
</dd>
<dt>Alias de contrase&ntilde;a</dt>
<dd>
<p>El usuario de Windows se autentica mediante un alias de contrase&ntilde;a. Si selecciona esta opci&oacute;n, seleccione el alias de contrase&ntilde;a en la lista desplegable Alias de contrase&ntilde;a.</p>
</dd>
</dl>
</dd>
<dt>Contrase&ntilde;a de usuario de Windows</dt>
<dd>
<p>Contrase&ntilde;a que el usuario de Windows utilizar&aacute; al conectarse al host de este nodo.</p>
</dd>
<dt>Alias de contrase&ntilde;a</dt>
<dd>
<p>Lista desplegable de alias de contrase&ntilde;a definidos para este dominio.</p>
</dd>
</dl>
<a id="sthref310" name="sthref310"></a>
<h5>Opciones adicionales para los nodos SSH</h5>
<p>Las opciones siguientes est&aacute;n disponibles s&oacute;lo si el campo Tipo se define en SSH:</p>
<dl>
<dt>Instalar GlassFish Server</dt>
<dd>
<p>Si se selecciona la opci&oacute;n Activado, DAS copiar&aacute; el software GlassFish Server del host de DAS en el host del nodo. Para copiar el software GlassFish Server en el host, DAS debe poder contactar con el host mediante SSH.</p>
</dd>
<dt>Forzar</dt>
<dd>
<p>Si se selecciona la opci&oacute;n Activado, se crea el nodo en la configuraci&oacute;n de DAS aunque falle la validaci&oacute;n de los par&aacute;metros del nodo. Para validar los par&aacute;metros de un nodo, DAS debe poder establecer contacto con el host del nodo a trav&eacute;s de SSH.</p>
</dd>
<dt>Puerto SSH</dt>
<dd>
<p>Puerto que se usar&aacute; para las conexiones SSH con el host de este nodo. El valor por defecto es 22. Si la opci&oacute;n Host de nodo se define en <code>localhost-</code><i>domain</i>, se ignora la opci&oacute;n Puerto SSH.</p>
</dd>
<dt>Nombre de usuario SSH</dt>
<dd>
<p>Usuario del host de este nodo que va a ejecutar el proceso para conectarse al host a trav&eacute;s de SSH. El valor por defecto es el usuario que est&aacute; ejecutando el proceso DAS. Para asegurarse de que el DAS pueda leer el archivo de claves privadas de este usuario SSH, especifique el usuario que est&aacute; ejecutando el proceso DAS. Si la opci&oacute;n Host de nodo se define en <code>localhost-</code><i>domain</i>, se ignora la opci&oacute;n Nombre de usuario.</p>
</dd>
<dt>Autenticaci&oacute;n de usuario de SSH</dt>
<dd>
<p>Lista desplegable para especificar c&oacute;mo se autentica el usuario de SSH al conectarse al host de este nodo. Los m&eacute;todos de autenticaci&oacute;n posibles son los siguientes:</p>
<dl>
<dt>Archivo de claves</dt>
<dd>
<p>El usuario de SSH se autentica a trav&eacute;s de un archivo de claves privadas SSH. Si selecciona esta opci&oacute;n, especifique la ruta de acceso absoluta al archivo en el campo Archivo de claves.</p>
</dd>
<dt>Contrase&ntilde;a</dt>
<dd>
<p>El usuario de SSH se autentica mediante una contrase&ntilde;a que se almacena en la configuraci&oacute;n de DAS.</p>

<hr>
<p><b>Atenci&oacute;n:</b></p>
Esta contrase&ntilde;a se almacena en forma de texto no cifrado en la configuraci&oacute;n de DAS. Para mayor seguridad, utilice un archivo de claves o un alias de contrase&ntilde;a.
<hr>

<p>Si selecciona esta opci&oacute;n, el campo Contrase&ntilde;a de usuario de SSH se activa para que pueda indicar la contrase&ntilde;a.</p>
</dd>
<dt>Alias de contrase&ntilde;a</dt>
<dd>
<p>El usuario de SSH se autentica mediante un alias de contrase&ntilde;a. Si selecciona esta opci&oacute;n, seleccione el alias de contrase&ntilde;a en la lista desplegable Alias de contrase&ntilde;a.</p>
</dd>
</dl>
</dd>
<dt>Configurar SSH</dt>
<dd>
<p>Si se selecciona la opci&oacute;n Activado, GlassFish Server configura una clave SSH en el host del nodo. GlassFish Server configura la clave SSH copiando archivos de claves existentes desde el host de DAS o, en caso necesario, generando los archivos antes de copiarlos. Esta opci&oacute;n est&aacute; disponible s&oacute;lo si la opci&oacute;n Autenticaci&oacute;n de usuario de SSH se define en Archivo de claves.</p>
</dd>
<dt>Generar clave</dt>
<dd>
<p>Si se selecciona la opci&oacute;n Activada, GlassFish Server genera los archivos de claves SSH antes de copiar los archivos en el host del nodo en caso de que no existan estos archivos. Si existen archivos de claves SSH, GlassFish Server no generar&aacute; los archivos aunque se haya seleccionado la opci&oacute;n Activada.</p>

<hr>
<p><b>Nota:</b></p>
Si no existen archivos de claves SSH, se debe seleccionar la opci&oacute;n Activada. En caso contrario, se producir&aacute; un error al intentar guardar los cambios.
<hr>

</dd>
<dt>Contrase&ntilde;a de usuario de SSH</dt>
<dd>
<p>Contrase&ntilde;a que el usuario de SSH utilizar&aacute; al conectarse al host de este nodo.</p>
</dd>
<dt>Alias de contrase&ntilde;a</dt>
<dd>
<p>Lista desplegable de alias de contrase&ntilde;a definidos para este dominio.</p>
</dd>
<dt>Archivo de claves p&uacute;blicas</dt>
<dd>
<p>Ruta de acceso absoluta al archivo de claves p&uacute;blicas SSH para el usuario que especifique la opci&oacute;n Nombre de usuario de SSH. El contenido del archivo de claves p&uacute;blicas se agrega al archivo <code>.ssh/authorized_keys</code> del usuario en el host del nodo. Si el archivo <code>.ssh/authorized_keys</code> no existe en el host, GlassFish Server lo crea.</p>
</dd>
<dt>Archivo de claves</dt>
<dd>
<p>Ruta de acceso absoluta al archivo de claves privadas SSH para el usuario que especifique la opci&oacute;n Nombre de usuario de SSH. Este archivo se utiliza para la autenticaci&oacute;n en el daemon <code>sshd</code> en el host del nodo.</p>

<hr>
<p><b>Nota:</b></p>
GlassFish Server tambi&eacute;n soporta la autenticaci&oacute;n con contrase&ntilde;a a trav&eacute;s de la entrada <code>AS_ADMIN_SSHPASSWORD</code> en el archivo de contrase&ntilde;as. El archivo de contrase&ntilde;as se especifica en la opci&oacute;n <code>-paswordfile</code> de la utilidad <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00263"><code>asadmin</code>(1)</a>.
<hr>

<p>Si el archivo de claves privadas SSH se protege con una contrase&ntilde;a, el archivo de contrase&ntilde;as debe contener la entrada <code>AS_ADMIN_SSHKEYPASSPHRASE</code>.</p>
<p>La ruta de acceso al archivo de claves debe ser accesible para DAS y el archivo de claves debe ser legible para el mismo.</p>
<p>El valor por defecto es un archivo de claves del directorio <code>.ssh</code> del usuario. Si se encuentran varios archivos de claves, GlassFish Server utiliza el siguiente orden de preferencia:</p>
<ol>
<li>
<p><code>id_rsa</code></p>
</li>
<li>
<p><code>id_dsa</code></p>
</li>
<li>
<p><code>identity</code></p>
</li>
</ol>
</dd>
</dl>
<a id="sthref311" name="sthref311"></a>
<h5>Tareas relacionadas</h5>
<p><a href="task-createnode.html">Crear un nodo</a></p>
<a id="sthref312" name="sthref312"></a>
<h5>Subcomandos asadmin equivalentes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00047"><code>create-node-config</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM510"><code>create-node-dcom</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00048"><code>create-node-ssh</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00229"><code>setup-ssh</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM796"><code>validate-dcom</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
