<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-gms" name="ref-gms"></a><a id="GHCLU00026" name="GHCLU00026"></a></p>

<h4><a id="sthref354" name="sthref354"></a>Editar servicio de gesti&oacute;n de grupos</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Servicios de gesti&oacute;n de grupos para cambiar la configuraci&oacute;n de GMS.</p>
<p>El servicio de gesti&oacute;n de grupos (GMS) es un servicio en curso que proporciona supervisi&oacute;n del cluster, pertenencia al cluster y servicios de comunicaci&oacute;n de grupos. GMS se basa en una pila configurable de protocolos de detecci&oacute;n de pertenencia a grupos y de supervisi&oacute;n de estado. Los GMS realizan las funciones siguientes:</p>
<ul>
<li>
<p>Notifican los m&oacute;dulos registrados en una instancia de GlassFish Server cuando se agregan o eliminan una o varias instancias en un cluster, o cuando se sospecha o se confirma que han fallado.</p>
</li>
<li>
<p>Ofrece la posibilidad de enviar y recibir mensajes entre los miembros del cluster.</p>
</li>
</ul>
<p>La p&aacute;gina Servicio de gesti&oacute;n de grupos contiene las opciones siguientes.</p>
<dl>
<dt>Cargar Valores por Defecto</dt>
<dd>
<p>Bot&oacute;n para restaurar configuraci&oacute;n que tiene valores por defecto a sus valores por defecto. Las configuraciones que no tienen valores por defecto no se modifican.</p>
</dd>
<dt>Nombre de Configuraci&oacute;n</dt>
<dd>
<p>Nombre de la configuraci&oacute;n a la que se aplican los valores de esta p&aacute;gina. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>N&uacute;mero M&aacute;ximo de Latidos que Faltan</dt>
<dd>
<p>N&uacute;mero de latidos que faltan en un miembro tras el que se crear&aacute; un fallo en la instancia del servidor. El valor por defecto es 3.</p>
</dd>
<dt>Frecuencia de Latidos</dt>
<dd>
<p>Per&iacute;odo de tiempo entre latidos que faltan en un miembro concreto. El valor por defecto es 2.000 milisegundos.</p>
</dd>
<dt>Timeout de Detecci&oacute;n de Grupos</dt>
<dd>
<p>Tiempo que espera GMS para detectar otros miembros del cluster. El valor por defecto es 5.000 milisegundos.</p>
</dd>
<dt>Tiempo de Espera para la Verificaci&oacute;n de Fallos</dt>
<dd>
<p>Tiempo de espera antes de verificar que un miembro que se cree que ha fallado se debe indicar como tal. El valor por defecto es 1.500 milisegundos.</p>
</dd>
<dt>Propiedades Adicionales</dt>
<dd>
<p>Tabla de propiedades adicionales para el servicio de gesti&oacute;n de grupos.</p>
<p>GlassFish Server no define propiedades adicionales de GMS.</p>
<p>Para cada propiedad se muestra la informaci&oacute;n siguiente:</p>
<dl>
<dt>Nombre</dt>
<dd>
<p>Nombre de la propiedad.</p>
</dd>
<dt>Valor</dt>
<dd>
<p>Valor de la propiedad que se ha definido para la instancia seleccionada.</p>
</dd>
<dt>Descripci&oacute;n</dt>
<dd>
<p>Descripci&oacute;n textual que ofrece m&aacute;s informaci&oacute;n sobre la propiedad.</p>
</dd>
</dl>
<p>La tabla Propiedades adicionales tambi&eacute;n contiene las opciones siguientes.</p>
<dl>
<dt>Agregar propiedad</dt>
<dd>
<p>Bot&oacute;n para agregar una propiedad. Al hacer clic en este bot&oacute;n se agrega una fila a la tabla Propiedades adicionales.</p>
</dd>
<dt>Suprimir propiedades</dt>
<dd>
<p>Bot&oacute;n para suprimir una o varias propiedades seleccionadas. Cualquier propiedad que se suprima vuelve a su valor por defecto o, si no se ha definido ning&uacute;n valor por defecto, se queda sin definir.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref355" name="sthref355"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-gmsenable.html">Activar el servicio de gesti&oacute;n de grupos</a></p>
</li>
<li>
<p><a href="task-gms.html">Configurar el servicio de gesti&oacute;n de grupos</a></p>
</li>
<li>
<p><a href="task-gmscluster.html">Configurar valores de servicio de gesti&oacute;n de grupos para un cluster</a></p>
</li>
</ul>




<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
