<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-standaloneinstances" name="ref-standaloneinstances"></a><a id="GHCLU00018" name="GHCLU00018"></a></p>

<h4><a id="sthref319" name="sthref319"></a><a id="sthref320" name="sthref320"></a><a id="sthref321" name="sthref321"></a>Instancias de servidor independientes</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilice la p&aacute;gina Instancias de servidor independientes para crear y gestionar instancias de GlassFish Server independientes.</p>
<p>La p&aacute;gina Instancias de servidor independientes muestra una lista de todas las instancias independientes del dominio. Para cada instancia se proporciona la informaci&oacute;n siguiente.</p>
<dl>
<dt>Nombre</dt>
<dd>
<p>Nombre que se asign&oacute; a la instancia en el momento de su creaci&oacute;n. Al hacer clic en el nombre se abrir&aacute; la p&aacute;gina <a href="ref-standaloneinstancegeneral.html">Informaci&oacute;n general</a> de la instancia.</p>
</dd>
<dt>Peso de equilibrador de carga</dt>
<dd>
<p>Entero que representa el peso de equilibrio de carga de la instancia.</p>
<p>El peso de equilibrio de carga determina la proporci&oacute;n de todas las solicitudes con respecto al cluster que debe procesar la instancia.</p>
<p>Por ejemplo, en un cluster de dos instancias, puede necesitar que una instancia procese una solicitud de cuatro, y que otra procese las otras tres. En este caso, configure el peso de la instancia que debe procesar una de las cuatro solicitudes como 1 y el peso de la otra instancia como 3. Si prefiere usar porcentajes, defina los pesos de las instancias como 25 y 75, respectivamente.</p>
<p>El peso por defecto es 100.</p>
</dd>
<dt>Configuraci&oacute;n</dt>
<dd>
<p>Configuraci&oacute;n que se seleccion&oacute; para la instancia en el momento de su creaci&oacute;n. Al hacer clic en la configuraci&oacute;n se abrir&aacute; la p&aacute;gina <a href="../../../common/en/help/ref-configuration.html">Configuraciones</a> para la instancia.</p>
</dd>
<dt>Nodo</dt>
<dd>
<p>Nombre del nodo en el que reside la instancia. Al hacer clic en el nombre se abrir&aacute; la p&aacute;gina <a href="ref-nodeedit.html">Editar nodo</a> del nodo.</p>
</dd>
<dt>Estado</dt>
<dd>
<p>Indicaci&oacute;n de si la instancia est&aacute; en ejecuci&oacute;n o no.</p>
</dd>
</dl>
<p>La tabla Instancias de servidor tambi&eacute;n contiene las opciones siguientes.</p>
<dl>
<dt>Nuevo</dt>
<dd>
<p>Bot&oacute;n para crear una instancia independiente.</p>
</dd>
<dt>Suprimir</dt>
<dd>
<p>Bot&oacute;n para suprimir una o varias instancias independientes seleccionadas.</p>
</dd>
<dt>Iniciar</dt>
<dd>
<p>Bot&oacute;n para iniciar una o varias instancias independientes seleccionadas.</p>
</dd>
<dt>Parar</dt>
<dd>
<p>Bot&oacute;n para parar una o varias instancias independientes seleccionadas.</p>
</dd>
</dl>
<a id="sthref322" name="sthref322"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-create-standalone-instance.html">Crear una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-delete-standalone-instances.html">Suprimir instancias de GlassFish Server independientes</a></p>
</li>
<li>
<p><a href="task-start-standalone-instances.html">Iniciar instancias de GlassFish Server independientes</a></p>
</li>
<li>
<p><a href="task-stop-standalone-instances.html">Parar instancias de GlassFish Server independientes</a></p>
</li>
</ul>
<a id="sthref323" name="sthref323"></a>
<h5>Subcomandos asadmin equivalentes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00033"><code>create-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00085"><code>delete-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00170"><code>list-instances</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00236"><code>start-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00241"><code>stop-instance</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
