<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clustergeneral" name="ref-clustergeneral"></a></p>

<h4><a id="sthref251" name="sthref251"></a><a id="sthref252" name="sthref252"></a><a id="sthref253" name="sthref253"></a><a id="sthref254" name="sthref254"></a>Informaci&oacute;n general</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La p&aacute;gina Informaci&oacute;n general contiene las opciones siguientes.</p>
<dl>
<dt>Iniciar cluster</dt>
<dd>
<p>Bot&oacute;n para iniciar el cluster. Si todas las instancias en el cluster est&aacute;n en ejecuci&oacute;n, este bot&oacute;n est&aacute; desactivado.</p>
</dd>
<dt>Parar cluster</dt>
<dd>
<p>Bot&oacute;n para parar el cluster. Si todas las instancias en el cluster est&aacute;n paradas, este bot&oacute;n est&aacute; desactivado.</p>
</dd>
<dt>Migrar temporizadores EJB</dt>
<dd>
<p>Bot&oacute;n para migrar temporizadores de tecnolog&iacute;a Enterprise JavaBeans (EJB) desde una instancia de GlassFish Server parada a una instancia en ejecuci&oacute;n en el cluster. Al hacer clic en este bot&oacute;n se abrir&aacute; la p&aacute;gina <a href="ref-migrateejbtimers.html">Migrar temporizadores EJB</a>. Si todas las instancias en el cluster est&aacute;n en ejecuci&oacute;n, este bot&oacute;n est&aacute; desactivado.</p>
</dd>
<dt>Rotar log</dt>
<dd>
<p>Bot&oacute;n para rotar el archivo log para el cluster. Cuando se rota el archivo log, se cambia el nombre del archivo por un nombre con registro de hora con el formato <code>server.log_</code><i>date-and-time</i> y se crea un archivo log vac&iacute;o para los nuevos mensajes de log. Los cambios se aplican de forma din&aacute;mica. No es necesario reiniciar el servidor.</p>
</dd>
<dt>Nombre de cluster</dt>
<dd>
<p>Nombre que se asign&oacute; al cluster en el momento de su creaci&oacute;n. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>JVM</dt>
<dd>
<p>Si hace clic en Informe de JVM, se abrir&aacute; una ventana independiente que muestra informes sobre Java Virtual Machine, incluyendo un informe resumido, un informe sobre gesti&oacute;n de la memoria y recolecci&oacute;n de basura, otro informe sobre carga de clase y un volcado de thread actual.</p>
</dd>
<dt>Configuraci&oacute;n</dt>
<dd>
<p>Configuraci&oacute;n que se seleccion&oacute; para el cluster en el momento de su creaci&oacute;n. Al hacer clic en la configuraci&oacute;n se abrir&aacute; la p&aacute;gina <a href="../../../common/en/help/ref-configuration.html">Configuraciones</a> del cluster. Este campo es de s&oacute;lo lectura.</p>
</dd>
<dt>GMS</dt>
<dd>
<p>Si esta opci&oacute;n est&aacute; activada, se inicia el servicio de gesti&oacute;n de grupos (GMS) en cada instancia de GlassFish Server del cluster y en el servidor de administraci&oacute;n de dominio (DAS). DAS participa en cada cluster para el que se ha activado GMS. GMS proporciona supervisi&oacute;n del cluster, pertenencia al cluster y servicios de comunicaci&oacute;n para los grupos. Esta opci&oacute;n se encuentra activada por defecto.</p>
</dd>
<dt>Puerto de multidifusi&oacute;n</dt>
<dd>
<p>N&uacute;mero del puerto de comunicaci&oacute;n en el que GMS recibe los eventos de grupo. Esta opci&oacute;n debe especificar un n&uacute;mero de puerto v&aacute;lido entre 2048 y 49151. El valor por defecto se genera autom&aacute;ticamente dentro de este rango.</p>
</dd>
<dt>Direcci&oacute;n de multidifusi&oacute;n</dt>
<dd>
<p>Direcci&oacute;n en la que GMS recibe los eventos de grupo. Esta opci&oacute;n debe especificar una direcci&oacute;n de multidifusi&oacute;n en el rango de 224.0.0.0 a 239.255.255.255. El valor por defecto es 228.9.<i>XX</i>. <i>YY</i>, donde <i>XX</i> e <i>YY</i> son valores independientes generados autom&aacute;ticamente entre 0 y 255.</p>
</dd>
<dt>Direcci&oacute;n de interfaz de enlace</dt>
<dd>
<p>Direcci&oacute;n IP (Internet Protocol) de la interfaz de red a la que se enlaza GMS. Esta opci&oacute;n debe especificar la direcci&oacute;n IP de una interfaz de red local. Los valores por defecto son direcciones de interfaz de red p&uacute;blicas.</p>
<p>En una m&aacute;quina multiorigen, esta opci&oacute;n configura la interfaz de red usada para GMS. Un equipo multiorigen posee dos o m&aacute;s interfaces de red.</p>
<p>Para especificar una direcci&oacute;n que sea v&aacute;lida para todas las instancias de GlassFish Server del cluster, utilice una propiedad del sistema para definir la direcci&oacute;n de forma individual para cada instancia.</p>
<p>Por ejemplo, utilice la p&aacute;gina <a href="ref-clustersystemproperties.html">Propiedades del sistema de cluster</a> para crear la propiedad del sistema <code>GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i>. A continuaci&oacute;n, defina la opci&oacute;n Direcci&oacute;n de enlace en esta p&aacute;gina como <code>${GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i><code>}</code> para especificar la propiedad del sistema. Por &uacute;ltimo, para cada instancia del cluster, defina la propiedad del sistema <code>GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i> en la direcci&oacute;n de interfaz de red necesaria de la m&aacute;quina de la instancia.</p>
</dd>
<dt>Estado</dt>
<dd>
<p>Indicaci&oacute;n del n&uacute;mero de instancias del cluster que est&aacute;n en ejecuci&oacute;n y que no lo est&aacute;n. Este campo es de s&oacute;lo lectura.</p>
</dd>
</dl>
<a id="sthref255" name="sthref255"></a>
<h5>Tareas relacionadas</h5>
<ul>
<li>
<p><a href="task-gmscluster.html">Configurar valores de servicio de gesti&oacute;n de grupos para un cluster</a></p>
</li>
<li>
<p><a href="task-migrate-ejb-timers.html">Migrar temporizadores EJB</a></p>
</li>
</ul>
<a id="sthref256" name="sthref256"></a>
<h5>Subcomandos asadmin equivalentes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00138"><code>generate-jvm-report</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00211"><code>migrate-timers</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00224"><code>rotate-log</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
