<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-change-clustered-instance-ports" name="task-change-clustered-instance-ports"></a></p>

<h4><a id="sthref95" name="sthref95"></a><a id="sthref96" name="sthref96"></a><a id="sthref97" name="sthref97"></a>Modificar los n&uacute;meros de puerto de una instancia de GlassFish Server en cluster</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Los n&uacute;meros de puerto de una instancia de GlassFish Server en cluster se definen inicialmente en la configuraci&oacute;n que hereda la instancia de su cluster principal. Debe modificar estos n&uacute;meros de puerto si, por ejemplo, dos instancias en cluster residen en el mismo host. En este caso, es necesario modificar los n&uacute;meros de puerto de una instancia porque ambas instancias comparten la misma configuraci&oacute;n.</p>
<p>Los n&uacute;meros de puerto de una instancia se guardan como propiedades del sistema Java. Estas propiedades se transfieren al iniciador de aplicaciones Java mediante la opci&oacute;n <code>-D</code> del iniciador de aplicaciones Java cuando se inicia GlassFish Server.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Clusters.</p>
</li>
<li>
<p>En el nodo Clusters ampliado, seleccione el nodo para el cluster.</p>
<p>Se abre la p&aacute;gina Informaci&oacute;n General para el cluster.</p>
</li>
<li>
<p>En la p&aacute;gina Informaci&oacute;n General, haga clic en el separador Instancias.</p>
<p>Se abrir&aacute; la p&aacute;gina Instancias del Servidor en Cluster para el cluster.</p>
</li>
<li>
<p>Seleccione la instancia para la cual se modificar&aacute;n los n&uacute;meros de puerto.</p>
<p>Se abrir&aacute; la p&aacute;gina Informaci&oacute;n General para la instancia.</p>
</li>
<li>
<p>En la p&aacute;gina Informaci&oacute;n General, haga clic en el separador Propiedades.</p>
<p>Se abrir&aacute; la p&aacute;gina Propiedades del Sistema de Instancias.</p>
<p>Esta p&aacute;gina muestra los valores actuales de las siguientes propiedades del sistema para la instancia:</p>
<ul>
<li>
<p><a href="../../../common/en/help/ref-predefinedconfigsysproperties.html">N&uacute;meros de puerto predefinidos en la configuraci&oacute;n de la instancia</a></p>
</li>
<li>
<p>Propiedades personalizadas que se definen para la instancia, si las hay</p>
</li>
</ul>
</li>
<li>
<p>Para cada propiedad que vaya a modificar, escriba el nuevo valor en el campo Valor de Sustituci&oacute;n para la propiedad.</p>
</li>
<li>
<p>Defina los valores que necesite en las dem&aacute;s propiedades.</p>
<ol type="a">
<li>
<p>En la tabla Propiedades Adicionales, haga clic en Agregar Propiedad.</p>
<p>Se agrega una fila a la tabla Propiedades Adicionales.</p>
</li>
<li>
<p>En el campo Nombre de Variable de Instancia, escriba el nombre de la propiedad.</p>
</li>
<li>
<p>En el campo Valor de Sustituci&oacute;n, escriba el valor.</p>
</li>
</ol>
</li>
<li>
<p>Haga clic en Guardar.</p>
</li>
</ol>
<a id="sthref98" name="sthref98"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-create-clustered-instance.html">Para agregar una instancia de GlassFish Server a un Cluster</a></p>
</li>
<li>
<p><a href="task-delete-clustered-instances.html">Para suprimir instancias de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-start-clustered-instances.html">Para iniciar instancias de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-stop-clustered-instances.html">Para parar instancias de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-view-logs-clustered-instance.html">Ver Archivos Log para una Instancia de GlassFish Server en Cluster</a></p>
</li>
<li>
<p><a href="task-recovertransactions.html">Recuperar transacciones para una instancia de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-set-props-clustered-instance.html">Definir propiedades de s&oacute;lo instancia para una instancia de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-mon-app-clustered-instance.html">Ver datos de supervisi&oacute;n de aplicaciones para una instancia de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-mon-server-clustered-instance.html">Ver datos de supervisi&oacute;n del servidor virtual para una instancia de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-mon-resource-clustered-instance.html">Ver datos de supervisi&oacute;n de recursos para una instancia de GlassFish Server en cluster</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
