<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-create-standalone-instance" name="task-create-standalone-instance"></a><a id="GHCLU00056" name="GHCLU00056"></a></p>

<h4><a id="sthref122" name="sthref122"></a><a id="sthref123" name="sthref123"></a><a id="sthref124" name="sthref124"></a>Crear una instancia de GlassFish Server independiente</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Las instancias de GlassFish Server forman la base del despliegue de aplicaciones. Una instancia independiente no forma parte de un cluster. Cada instancia pertenece a un solo dominio y tiene su propia estructura de directorios, configuraci&oacute;n y aplicaciones desplegadas. Cada instancia incluye tambi&eacute;n el contenedor web de la plataforma Java, Enterprise Edition (Java EE) y el contenedor de la tecnolog&iacute;a Enterprise JavaBeans (tecnolog&iacute;a EJB). Cada instancia nueva debe contener una referencia a un nodo que defina el host donde residir&aacute; la instancia.</p>

<hr>
<p><b>Nota:</b></p>
Para crear una instancia en un nodo de tipo CONFIG que representa un host remoto, debe utilizar el subcomando <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00044"><code>create-local-instance</code>(1)</a>. No se puede utilizar Consola de administraci&oacute;n para este fin.
<hr>

<a id="sthref125" name="sthref125"></a>
<h5>Antes de Empezar</h5>
<p>Aseg&uacute;rese de que exista el nodo en el que reside la instancia. Consulte <a href="task-createnode.html">Crear un nodo</a> para obtener instrucciones.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, seleccione el nodo Instancias Independientes.</p>
<p>Se abrir&aacute; la p&aacute;gina Instancias de Servidor Independientes.</p>
</li>
<li>
<p>En la p&aacute;gina Instancias de Servidor Independientes, haga clic en Nuevo.</p>
<p>Se abrir&aacute; la p&aacute;gina Nueva Instancia del Servidor Independiente.</p>
</li>
<li>
<p>En el campo Nombre, escriba un nombre para la instancia.</p>
<p>El nombre debe cumplir los siguientes requisitos:</p>
<ul>
<li>
<p>El nombre s&oacute;lo puede contener caracteres ASCII.</p>
</li>
<li>
<p>El nombre debe empezar por una letra, un n&uacute;mero o un car&aacute;cter de subrayado.</p>
</li>
<li>
<p>El nombre s&oacute;lo puede contener los siguientes caracteres:</p>
<ul>
<li>
<p>Letras en min&uacute;scula</p>
</li>
<li>
<p>Letras en may&uacute;scula</p>
</li>
<li>
<p>N&uacute;meros</p>
</li>
<li>
<p>Gui&oacute;n</p>
</li>
<li>
<p>Punto</p>
</li>
<li>
<p>Subrayado</p>
</li>
</ul>
</li>
<li>
<p>El nombre debe ser &uacute;nico en el dominio y no debe ser el nombre de otro nodo, cluster, configuraci&oacute;n con nombre ni instancia de GlassFish Server.</p>
</li>
<li>
<p>El nombre no debe ser <code>domain</code>, <code>server</code> ni otra palabra clave reservada por GlassFish Server.</p>
</li>
</ul>
</li>
<li>
<p>En la lista desplegable Nodo, seleccione el nodo donde residir&aacute; la instancia.</p>
</li>
<li>
<p>En la lista desplegable Configuraci&oacute;n, seleccione la configuraci&oacute;n con nombre que utilizar&aacute; la instancia.</p>

<hr>
<p><b>Nota:</b></p>
Si selecciona <code>default-config</code>, debe especificar en el paso siguiente que la configuraci&oacute;n <i>no</i> es compartida. La configuraci&oacute;n de <code>default-config</code> no se puede compartir.
<hr>

</li>
<li>
<p>Especifique si la configuraci&oacute;n que usar&aacute; la instancia es compartida.</p>
<ul>
<li>
<p>Si la configuraci&oacute;n no es compartida, deje seleccionada la opci&oacute;n Realizar una Copia de la Configuraci&oacute;n Seleccionada.</p>
<p>La configuraci&oacute;n seleccionada se copia cuando se crea la instancia. Se asigna el nombre nombre_instancia<code>-config</code> a la copia de la configuraci&oacute;n, donde <i>nombre_instancia</i> es el nombre de la instancia que est&aacute; creando.</p>
</li>
<li>
<p>Si la configuraci&oacute;n es compartida, seleccione la opci&oacute;n Hacer Referencia a la Configuraci&oacute;n Seleccionada.</p>
<p>La instancia utilizar&aacute; la configuraci&oacute;n con nombre especificada existente.</p>
</li>
</ul>
</li>
<li>
<p>Haga clic en Aceptar.</p>
</li>
</ol>
<a id="sthref126" name="sthref126"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-delete-standalone-instances.html">Suprimir instancias de GlassFish Server independientes</a></p>
</li>
<li>
<p><a href="task-start-standalone-instances.html">Iniciar instancias de GlassFish Server independientes</a></p>
</li>
<li>
<p><a href="task-stop-standalone-instances.html">Parar instancias de GlassFish Server independientes</a></p>
</li>
<li>
<p><a href="task-view-logs-standalone-instance.html">Ver Archivos Log para una Instancia de GlassFish Server Independiente</a></p>
</li>
<li>
<p><a href="task-recovertransactions-standalone-instance.html">Recuperar transacciones para una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-deploy.html">Desplegar una aplicaci&oacute;n en una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-list.html">Mostrar aplicaciones desplegadas en una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-undeploy.html">Anular despliegue de aplicaciones de una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-remove.html">Eliminar aplicaciones de una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-edit.html">Editar una aplicaci&oacute;n desplegada en una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-enable-disable.html">Activar o desactivar una aplicaci&oacute;n desplegada en una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-lb-enable-disable.html">Activar o desactivar el equilibrio de carga para una aplicaci&oacute;n desplegada en una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-create.html">Crear un recurso para una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-display.html">Mostrar recursos para una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-enable-disable.html">Activar o desactivar un recurso para una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-edit.html">Editar un recurso para una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-change-standalone-instance-ports.html">Modificar los n&uacute;meros de puerto de una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-set-props-standalone-instance.html">Definir propiedades de s&oacute;lo instancia para una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-mon-app-standalone-instance.html">Ver datos de supervisi&oacute;n de aplicaciones para una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-mon-server-standalone-instance.html">Ver datos de supervisi&oacute;n de servidor virtual para una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-mon-resource-standalone-instance.html">Ver datos de supervisi&oacute;n de recursos para una instancia de GlassFish Server independiente</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
