<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-nodeupdatedcom" name="task-nodeupdatedcom"></a></p>
<!-- infolevel="all" infotype="General" -->
<h4>Terminar la Actualizaci&oacute;n de un Nodo DCOM</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Esta tarea es la continuaci&oacute;n para un nodo DCOM de <a href="task-editnode.html">Editar un nodo</a>.</p>
<ol>
<li>
<p>Para forzar la creaci&oacute;n del nodo en la configuraci&oacute;n del servidor de administraci&oacute;n de dominio (DAS) aunque falle la validaci&oacute;n de los par&aacute;metros del nodo, active la opci&oacute;n Forzar.</p>
</li>
<li>
<p>Si necesita que GlassFish Server pruebe la conexi&oacute;n mediante DCOM con el host del nodo antes de actualizar el nodo, lleve a cabo estos pasos:</p>
<ol type="a">
<li>
<p>Active la opci&oacute;n Validar DCOM.</p>
</li>
<li>
<p>En el campo Directorio de Prueba Remoto, escriba el nombre de la carpeta del host remoto en la que GlassFish Server deba crear un archivo para probar la conexi&oacute;n.</p>
</li>
</ol>
</li>
<li>
<p>En el campo Dominio de Windows, escriba el nombre del domino de Windows que contenga el usuario que la opci&oacute;n Nombre de Usuario de Windows especifica.</p>
<p>Si cambia el tipo de nodo por DCOM y deja este campo en blanco, la opci&oacute;n Dominio de Windows se define en el nombre del host en el que se ejecuta Consola de administraci&oacute;n.</p>
</li>
<li>
<p>En el campo Nombre de Usuario de Windows, escriba el nombre del usuario del host de este nodo que ejecutar&aacute; el proceso para conectar al host mediante DCOM.</p>
<p>Si cambia el tipo de nodo de CONFIG a DCOM y deja este campo en blanco, la opci&oacute;n Nombre de Usuario de Windows se configura con el usuario que ejecuta el proceso DAS.</p>
</li>
<li>
<p>Especifique c&oacute;mo se autenticar&aacute; el usuario de Windows al iniciar sesi&oacute;n en el host de este nodo.</p>

<hr>
<p><b>Nota:</b></p>
GlassFish Server tambi&eacute;n soporta la autenticaci&oacute;n con contrase&ntilde;a a trav&eacute;s de la entrada <code>AS_ADMIN_WINDOWSPASSWORD</code> en el archivo de contrase&ntilde;as. El archivo de contrase&ntilde;as se especifica en la opci&oacute;n <code>-paswordfile</code> de la utilidad <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00263"><code>asadmin</code>(1)</a>.
<hr>

<ol type="a">
<li>
<p>Para especificar la autenticaci&oacute;n mediante una contrase&ntilde;a guardada en la configuraci&oacute;n de DAS, efect&uacute;e los pasos siguientes:</p>

<hr>
<p><b>Atenci&oacute;n:</b></p>
Esta contrase&ntilde;a se almacena en forma de texto no cifrado en la configuraci&oacute;n de DAS. Para mejorar la seguridad, utilice un alias de contrase&ntilde;a.
<hr>

<ol>
<li>
<p>Seleccione Contrase&ntilde;a en la lista desplegable Autenticaci&oacute;n de Usuario de Windows.</p>
</li>
<li>
<p>En el campo Contrase&ntilde;a de Usuario de Windows, escriba la contrase&ntilde;a que el usuario de Windows utilizar&aacute; al conectarse al host de este nodo.</p>
</li>
</ol>
</li>
<li>
<p>Para especificar la autenticaci&oacute;n mediante un alias de contrase&ntilde;a, efect&uacute;e los pasos siguientes:</p>
<ol>
<li>
<p>Seleccione Alias de Contrase&ntilde;a en la lista desplegable Autenticaci&oacute;n de Usuario de Windows.</p>
</li>
<li>
<p>En la lista desplegable Alias de Contrase&ntilde;a, seleccione un alias existente.</p>
</li>
</ol>
</li>
</ol>
</li>
<li>
<p>Haga clic en Guardar.</p>
</li>
</ol>
<a id="sthref238" name="sthref238"></a>
<h5>Consulte tambi&eacute;n</h5>
<p><a href="task-editnode.html">Editar un nodo</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
