<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-set-props-clustered-instance" name="task-set-props-clustered-instance"></a><a id="GHCLU00052" name="GHCLU00052"></a></p>

<h4><a id="sthref99" name="sthref99"></a><a id="sthref100" name="sthref100"></a><a id="sthref101" name="sthref101"></a>Definir propiedades de s&oacute;lo instancia para una instancia de GlassFish Server en cluster</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Las propiedades de una instancia de GlassFish Server incluyen informaci&oacute;n de configuraci&oacute;n opcional acerca de la instancia.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Clusters.</p>
</li>
<li>
<p>En el nodo Clusters ampliado, seleccione el nodo para el cluster.</p>
<p>Se abre la p&aacute;gina Informaci&oacute;n General para el cluster.</p>
</li>
<li>
<p>En la p&aacute;gina Informaci&oacute;n General, haga clic en el separador Instancias.</p>
<p>Se abrir&aacute; la p&aacute;gina Instancias del Servidor en Cluster para el cluster.</p>
</li>
<li>
<p>Seleccione la instancia para la cual se modificar&aacute;n las propiedades de s&oacute;lo instancia.</p>
<p>Se abrir&aacute; la p&aacute;gina Informaci&oacute;n General para la instancia.</p>
</li>
<li>
<p>En la p&aacute;gina Informaci&oacute;n General, haga clic en el separador Propiedades.</p>
</li>
<li>
<p>Si es necesario, haga clic en el separador Propiedades de la Instancia.</p>
<p>Se abre la p&aacute;gina Propiedades de la Instancia.</p>
<p>Esta p&aacute;gina muestra una lista de las propiedades que se definen para la instancia seleccionada de GlassFish Server.</p>
</li>
<li>
<p>Para cada propiedad que desee modificar, escriba el nuevo valor en el campo Valor de la propiedad.</p>
</li>
<li>
<p>Defina los valores que necesite en las dem&aacute;s propiedades.</p>
<ol type="a">
<li>
<p>En la tabla Propiedades Adicionales, haga clic en Agregar Propiedad.</p>
<p>Se agrega una fila a la tabla Propiedades Adicionales.</p>
</li>
<li>
<p>En el campo Nombre, escriba un nombre para la propiedad.</p>
</li>
<li>
<p>En el campo Valor, escriba el valor.</p>
</li>
<li>
<p>En el campo Descripci&oacute;n, escriba una breve descripci&oacute;n de la propiedad.</p>
</li>
</ol>
</li>
<li>
<p>Haga clic en Guardar.</p>
</li>
</ol>
<a id="sthref102" name="sthref102"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-create-clustered-instance.html">Para agregar una instancia de GlassFish Server a un Cluster</a></p>
</li>
<li>
<p><a href="task-delete-clustered-instances.html">Para suprimir instancias de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-start-clustered-instances.html">Para iniciar instancias de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-stop-clustered-instances.html">Para parar instancias de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-view-logs-clustered-instance.html">Ver Archivos Log para una Instancia de GlassFish Server en Cluster</a></p>
</li>
<li>
<p><a href="task-recovertransactions.html">Recuperar transacciones para una instancia de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-change-clustered-instance-ports.html">Modificar los n&uacute;meros de puerto de una instancia de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-mon-app-clustered-instance.html">Ver datos de supervisi&oacute;n de aplicaciones para una instancia de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-mon-server-clustered-instance.html">Ver datos de supervisi&oacute;n del servidor virtual para una instancia de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-mon-resource-clustered-instance.html">Ver datos de supervisi&oacute;n de recursos para una instancia de GlassFish Server en cluster</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
