<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-create-clustered-instance" name="task-create-clustered-instance"></a></p>

<h4><a id="sthref67" name="sthref67"></a><a id="sthref68" name="sthref68"></a><a id="sthref69" name="sthref69"></a>Para agregar una instancia de GlassFish Server a un Cluster</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Las instancias de GlassFish Server forman la base del despliegue de aplicaciones. Una instancia en cluster es un miembro de un cluster. Cada instancia pertenece a un solo dominio y tiene su propia estructura de directorios, configuraci&oacute;n y aplicaciones desplegadas. Cada instancia incluye tambi&eacute;n el contenedor web de la plataforma Java, Enterprise Edition (Java EE) y el contenedor de la tecnolog&iacute;a Enterprise JavaBeans (tecnolog&iacute;a EJB). Cada instancia nueva debe contener una referencia a un nodo que defina el host donde residir&aacute; la instancia.</p>

<hr>
<p><b>Nota:</b></p>
Para crear una instancia en un nodo de tipo CONFIG que representa un host remoto, debe utilizar el subcomando <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00044"><code>create-local-instance</code>(1)</a>. No se puede utilizar Consola de administraci&oacute;n para este fin.
<hr>

<a id="sthref70" name="sthref70"></a>
<h5>Antes de Empezar</h5>
<p>Aseg&uacute;rese de que existan los elementos siguientes:</p>
<ul>
<li>
<p>Cluster al que se agregar&aacute; la instancia. Consulte <a href="task-create-cluster.html">Para crear un cluster</a> para obtener instrucciones.</p>
</li>
<li>
<p>Nodo en el que residir&aacute; la instancia. Consulte <a href="task-createnode.html">Crear un nodo</a> para obtener instrucciones.</p>
</li>
</ul>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Clusters.</p>
</li>
<li>
<p>En el nodo Clusters ampliado, seleccione el nodo para el cluster.</p>
<p>Se abre la p&aacute;gina Informaci&oacute;n General para el cluster.</p>
</li>
<li>
<p>En la p&aacute;gina Informaci&oacute;n General, haga clic en el separador Instancias.</p>
<p>Se abrir&aacute; la p&aacute;gina Instancias del Servidor en Cluster para el cluster.</p>
</li>
<li>
<p>En la p&aacute;gina Instancias de Servidor en Cluster, haga clic en Nuevo.</p>
<p>Se abrir&aacute; p&aacute;gina Nueva Instancia del Servidor en Cluster.</p>
</li>
<li>
<p>En el campo Nombre, escriba un nombre para la instancia.</p>
<p>El nombre debe cumplir los siguientes requisitos:</p>
<ul>
<li>
<p>El nombre s&oacute;lo puede contener caracteres ASCII.</p>
</li>
<li>
<p>El nombre debe empezar por una letra, un n&uacute;mero o un car&aacute;cter de subrayado.</p>
</li>
<li>
<p>El nombre s&oacute;lo puede contener los siguientes caracteres:</p>
<ul>
<li>
<p>Letras en min&uacute;scula</p>
</li>
<li>
<p>Letras en may&uacute;scula</p>
</li>
<li>
<p>N&uacute;meros</p>
</li>
<li>
<p>Gui&oacute;n</p>
</li>
<li>
<p>Punto</p>
</li>
<li>
<p>Subrayado</p>
</li>
</ul>
</li>
<li>
<p>El nombre debe ser &uacute;nico en el dominio y no debe ser el nombre de otro nodo, cluster, configuraci&oacute;n con nombre ni instancia de GlassFish Server.</p>
</li>
<li>
<p>El nombre no debe ser <code>domain</code>, <code>server</code> ni otra palabra clave reservada por GlassFish Server.</p>
</li>
</ul>
</li>
<li>
<p>En la lista desplegable Nodo, seleccione el nodo donde residir&aacute; la instancia.</p>
</li>
<li>
<p>Haga clic en Aceptar.</p>
</li>
</ol>
<a id="sthref71" name="sthref71"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-delete-clustered-instances.html">Para suprimir instancias de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-start-clustered-instances.html">Para iniciar instancias de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-stop-clustered-instances.html">Para parar instancias de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-view-logs-clustered-instance.html">Ver Archivos Log para una Instancia de GlassFish Server en Cluster</a></p>
</li>
<li>
<p><a href="task-recovertransactions.html">Recuperar transacciones para una instancia de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-change-clustered-instance-ports.html">Modificar los n&uacute;meros de puerto de una instancia de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-set-props-clustered-instance.html">Definir propiedades de s&oacute;lo instancia para una instancia de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-mon-app-clustered-instance.html">Ver datos de supervisi&oacute;n de aplicaciones para una instancia de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-mon-server-clustered-instance.html">Ver datos de supervisi&oacute;n del servidor virtual para una instancia de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-mon-resource-clustered-instance.html">Ver datos de supervisi&oacute;n de recursos para una instancia de GlassFish Server en cluster</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
