<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-create-cluster" name="task-create-cluster"></a></p>

<h4><a id="sthref2" name="sthref2"></a>Para crear un cluster</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Un cluster es una recopilaci&oacute;n de instancias de GlassFish Server con nombre que comparten las mismas aplicaciones, recursos e informaci&oacute;n de configuraci&oacute;n.</p>
<p>Un cluster proporciona una gran disponibilidad a trav&eacute;s de la escalabilidad, el equilibrio de carga y la protecci&oacute;n contra fallos. Cuando falla una instancia o un host de un cluster, GlassFish Server detecta el error, redirige las solicitudes de la instancia fallida a otras instancias del cluster y recupera el estado de la sesi&oacute;n del usuario. Dado que los mismos recursos y aplicaciones est&aacute;n en todas las instancias del cluster, una instancia puede generar un failover en cualquier otra instancia del cluster.</p>
<p>GlassFish Server permite administrar todas las instancias de un cluster como una sola unidad desde un &uacute;nico host, independientemente de si residen en el mismo host o no.</p>
<a id="sthref3" name="sthref3"></a>
<h5>Antes de Empezar</h5>
<p>Si tiene previsto agregar instancias de GlassFish Server al cluster que est&aacute; creando, aseg&uacute;rese de que los nodos en los que vayan a residir las instancias ya existan.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, seleccione el nodo Clusters.</p>
<p>Se abrir&aacute; la p&aacute;gina Clusters.</p>
</li>
<li>
<p>En la p&aacute;gina Clusters, haga clic en Nuevo.</p>
<p>Se abrir&aacute; la p&aacute;gina Cluster Nuevo.</p>
</li>
<li>
<p>En el campo Nombre de Cluster, escriba un nombre para el cluster.</p>
<p>El nombre debe cumplir los siguientes requisitos:</p>
<ul>
<li>
<p>El nombre s&oacute;lo puede contener caracteres ASCII.</p>
</li>
<li>
<p>El nombre debe empezar por una letra, un n&uacute;mero o un car&aacute;cter de subrayado.</p>
</li>
<li>
<p>El nombre s&oacute;lo puede contener los siguientes caracteres:</p>
<ul>
<li>
<p>Letras en min&uacute;scula</p>
</li>
<li>
<p>Letras en may&uacute;scula</p>
</li>
<li>
<p>N&uacute;meros</p>
</li>
<li>
<p>Gui&oacute;n</p>
</li>
<li>
<p>Punto</p>
</li>
<li>
<p>Subrayado</p>
</li>
</ul>
</li>
<li>
<p>El nombre debe ser &uacute;nico en el dominio y no debe ser el nombre de otro cluster, una configuraci&oacute;n con nombre, una instancia de GlassFish Server ni otro nodo.</p>
</li>
<li>
<p>El nombre no debe ser <code>domain</code>, <code>server</code> ni otra palabra clave reservada por GlassFish Server.</p>
</li>
</ul>
</li>
<li>
<p>En la lista desplegable Configuraci&oacute;n, seleccione la configuraci&oacute;n con nombre que utilizar&aacute; el cluster.</p>

<hr>
<p><b>Nota:</b></p>
Si selecciona <code>default-config</code>, debe especificar en el paso siguiente que la configuraci&oacute;n <i>no</i> es compartida. La configuraci&oacute;n de <code>default-config</code> no se puede compartir.
<hr>

</li>
<li>
<p>Indique si la configuraci&oacute;n que utilizar&aacute; el cluster es compartida.</p>
<ul>
<li>
<p>Si la configuraci&oacute;n no es compartida, deje seleccionada la opci&oacute;n Realizar una Copia de la Configuraci&oacute;n Seleccionada.</p>
<p>La configuraci&oacute;n seleccionada se copia cuando se crea el cluster. Se asigna el nombre nombre_cluster<code>-config</code> a la copia de la configuraci&oacute;n, donde <i>nombre_cluster</i> es el nombre del cluster que se est&aacute; creando.</p>
</li>
<li>
<p>Si la configuraci&oacute;n es compartida, seleccione la opci&oacute;n Hacer Referencia a la Configuraci&oacute;n Seleccionada.</p>
<p>El cluster utilizar&aacute; la configuraci&oacute;n con nombre especificada existente.</p>
</li>
</ul>
</li>
<li>
<p><a id="sthref4" name="sthref4"></a>Agregue instancias de GlassFish Server al cluster.</p>

<hr>
<p><b>Nota:</b></p>
Para crear una instancia en un nodo de tipo CONFIG que representa un host remoto, debe utilizar el subcomando <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00044"><code>create-local-instance</code>(1)</a>. No se puede utilizar Consola de administraci&oacute;n para este fin.
<hr>

<p>Tambi&eacute;n puede agregar instancias despu&eacute;s de crear el cluster, tal y como se describe en <a href="task-create-clustered-instance.html">Para agregar una instancia de GlassFish Server a un Cluster</a>.</p>
<p>Agregue cada una de las instancias del modo siguiente:</p>
<ol type="a">
<li>
<p>En el &aacute;rea Instancias del Servidor que se Van a Crear, haga clic en Agregar.</p>
<p>Se agregar&aacute; una fila a la tabla de instancias del cluster.</p>
</li>
<li>
<p>En el campo Nombre de Instancia, escriba un nombre para la instancia.</p>
</li>
<li>
<p>En el campo Peso, escriba un n&uacute;mero entero que representa el peso del equilibrio de carga de la instancia.</p>
<p>El peso de equilibrio de carga determina la proporci&oacute;n de todas las solicitudes con respecto al cluster que debe procesar la instancia.</p>
<p>Por ejemplo, en un cluster de dos instancias, puede necesitar que una instancia procese una solicitud de cuatro, y que otra procese las otras tres. En este caso, configure el peso de la instancia que debe procesar una de las cuatro solicitudes como 1 y el peso de la otra instancia como 3. Si prefiere usar porcentajes, defina los pesos de las instancias como 25 y 75, respectivamente.</p>
<p>El peso por defecto es 100.</p>
</li>
<li>
<p>En la lista desplegable Nodo, seleccione el nodo en el que residir&aacute; la instancia.</p>
</li>
</ol>
</li>
<li>
<p>Haga clic en Aceptar.</p>
<p>Volver&aacute; a la p&aacute;gina Clusters. El cluster se agrega a la tabla de clusters de la p&aacute;gina.</p>
</li>
</ol>
<a id="sthref5" name="sthref5"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-delete-cluster.html">Para suprimir un cluster</a></p>
</li>
<li>
<p><a href="task-availabilityservice.html">Configurar los valores de disponibilidad para un cluster</a></p>
</li>
<li>
<p><a href="task-start-cluster.html">Para iniciar un cluster</a></p>
</li>
<li>
<p><a href="task-stop-cluster.html">Para parar un cluster</a></p>
</li>
<li>
<p><a href="task-modify-cluster-config.html">Para modificar la configuraci&oacute;n de un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-deploy.html">Para desplegar una aplicaci&oacute;n en un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-list.html">Para mostrar las aplicaciones desplegadas en un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-undeploy.html">Para anular el despliegue de aplicaciones en un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-remove.html">Para eliminar aplicaciones de un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-edit.html">Para editar una aplicaci&oacute;n desplegada en un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-enable-disable.html">Activar o desactivar una aplicaci&oacute;n desplegada en un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-lb-enable-disable.html">Activar o desactivar el equilibrio de carga para una aplicaci&oacute;n desplegada en un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-resource-create.html">Para crear un recurso para un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-resource-display.html">Para mostrar los recursos para un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-resource-enable-disable.html">Activar o desactivar un recurso de forma global</a></p>
</li>
<li>
<p><a href="task-cluster-resource-edit.html">Para editar un recurso para un cluster</a></p>
</li>
<li>
<p><a href="task-upgrade-components.html">Actualizar componentes sin p&eacute;rdida de servicio</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
