<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-standalone-instance-app-remove" name="task-standalone-instance-app-remove"></a><a id="GHCLU00065" name="GHCLU00065"></a></p>

<h4><a id="sthref159" name="sthref159"></a><a id="sthref160" name="sthref160"></a>Eliminar aplicaciones de una instancia de GlassFish Server independiente</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Al eliminar una aplicaci&oacute;n, s&oacute;lo se elimina del destino actual. Cuando una aplicaci&oacute;n se elimina de un destino, la aplicaci&oacute;n sigue apareciendo en la p&aacute;gina <a href="../../../common/en/help/ref-applications.html">Aplicaciones</a> que muestra todas las aplicaciones desplegadas en GlassFish Server. La aplicaci&oacute;n tambi&eacute;n seguir&aacute; desplegada en otros destinos en los que se hubiera desplegado.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, seleccione el nodo Instancias Independientes.</p>
<p>Se abrir&aacute; la p&aacute;gina Instancias de Servidor Independientes.</p>
</li>
<li>
<p>En la p&aacute;gina Instancias de Servidor Independientes, seleccione la instancia.</p>
<p>Se abrir&aacute; la p&aacute;gina Informaci&oacute;n General para la instancia.</p>
</li>
<li>
<p>En la p&aacute;gina Informaci&oacute;n General para la instancia, haga clic en el separador Aplicaciones.</p>
<p>Se abrir&aacute; la p&aacute;gina Aplicaciones para la instancia.</p>
</li>
<li>
<p>Para cada aplicaci&oacute;n que vaya a eliminar, active la casilla de control que aparece junto a ella en la tabla Aplicaciones Desplegadas.</p>
</li>
<li>
<p>Haga clic en Eliminar.</p>
<p>Se le pedir&aacute; que confirme que desea eliminar las aplicaciones.</p>
</li>
<li>
<p>Confirme que desea eliminar las aplicaciones.</p>
<p>Las aplicaciones se eliminan de la tabla de aplicaciones desplegadas de la p&aacute;gina.</p>
</li>
</ol>
<a id="sthref161" name="sthref161"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-create-standalone-instance.html">Crear una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-delete-standalone-instances.html">Suprimir instancias de GlassFish Server independientes</a></p>
</li>
<li>
<p><a href="task-start-standalone-instances.html">Iniciar instancias de GlassFish Server independientes</a></p>
</li>
<li>
<p><a href="task-stop-standalone-instances.html">Parar instancias de GlassFish Server independientes</a></p>
</li>
<li>
<p><a href="task-view-logs-standalone-instance.html">Ver Archivos Log para una Instancia de GlassFish Server Independiente</a></p>
</li>
<li>
<p><a href="task-recovertransactions-standalone-instance.html">Recuperar transacciones para una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-deploy.html">Desplegar una aplicaci&oacute;n en una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-list.html">Mostrar aplicaciones desplegadas en una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-undeploy.html">Anular despliegue de aplicaciones de una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-edit.html">Editar una aplicaci&oacute;n desplegada en una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-enable-disable.html">Activar o desactivar una aplicaci&oacute;n desplegada en una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-lb-enable-disable.html">Activar o desactivar el equilibrio de carga para una aplicaci&oacute;n desplegada en una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-create.html">Crear un recurso para una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-display.html">Mostrar recursos para una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-enable-disable.html">Activar o desactivar un recurso para una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-edit.html">Editar un recurso para una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-change-standalone-instance-ports.html">Modificar los n&uacute;meros de puerto de una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-set-props-standalone-instance.html">Definir propiedades de s&oacute;lo instancia para una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-mon-app-standalone-instance.html">Ver datos de supervisi&oacute;n de aplicaciones para una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-mon-server-standalone-instance.html">Ver datos de supervisi&oacute;n de servidor virtual para una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-mon-resource-standalone-instance.html">Ver datos de supervisi&oacute;n de recursos para una instancia de GlassFish Server independiente</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
