<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-upgrade-components" name="task-upgrade-components"></a></p>

<h4><a id="sthref62" name="sthref62"></a><a id="sthref63" name="sthref63"></a><a id="sthref64" name="sthref64"></a><a id="sthref65" name="sthref65"></a>Actualizar componentes sin p&eacute;rdida de servicio</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>En un entorno en cluster, una actualizaci&oacute;n sucesiva vuelve a desplegar una aplicaci&oacute;n con una p&eacute;rdida m&iacute;nima de servicio y sesiones. Una sesi&oacute;n es un artefacto que se puede replicar, por ejemplo:</p>
<ul>
<li>
<p><code>HttpSession</code></p>
</li>
<li>
<p><code>SingleSignOn</code></p>
</li>
<li>
<p><code>ServletTimer</code></p>
</li>
<li>
<p><code>DialogFragment</code></p>
</li>
<li>
<p>Bean de sesi&oacute;n con estado</p>
</li>
</ul>
<p>Puede utilizar el equilibrador de carga y varios clusters para actualizar componentes en GlassFish Server sin sufrir ninguna p&eacute;rdida de servicio. Un componente puede ser, por ejemplo, un equipo JVM, el software GlassFish Server o una aplicaci&oacute;n web.</p>
<p>Una actualizaci&oacute;n sucesiva puede tener lugar con cargas ligeras o moderadas. El procedimiento requiere aproximadamente 10-15 minutos para cada instancia de GlassFish Server.</p>
<p>Las aplicaciones deben ser compatibles con la actualizaci&oacute;n. Deben funcionar correctamente durante la transici&oacute;n cuando algunas instancias ejecuten la versi&oacute;n antigua y otras ejecuten la versi&oacute;n nueva. La versi&oacute;n antigua y la nueva deben tener la misma forma de clases serializables que componen los gr&aacute;ficos de objetos que se almacenan en sesiones (por ejemplo, variables de instancias no transitorias). Si la forma de estas clases debe cambiar, el desarrollador de aplicaciones debe asegurarse de que se produzca el comportamiento de serializaci&oacute;n correcto. Si la aplicaci&oacute;n no es compatible con la actualizaci&oacute;n, es necesario parar el cluster para realizar un nuevo despliegue completo.</p>
<p>Este m&eacute;todo no es posible si la actualizaci&oacute;n de la aplicaci&oacute;n implica un cambio en el esquema de la base de datos de la aplicaci&oacute;n.</p>

<hr>
<p><b>Atenci&oacute;n:</b></p>
Para evitar el riesgo de que no coincidan las versiones cuando se produce un failover de sesi&oacute;n, actualice todas las instancias de un cluster al mismo tiempo. De lo contrario, una sesi&oacute;n puede generar un failover en una instancia en la que se ejecuten componentes de diferentes versiones.
<hr>

<p>Realice esta tarea en cada cluster por separado. Un cluster act&uacute;a como un l&iacute;mite seguro para failover de sesiones en las instancias del cluster. Las sesiones de un cluster nunca pueden generar un failover en sesiones de otro cluster. Por tanto, se evita el riesgo de que no coincidan las versiones.</p>
<ol>
<li>
<p>Parar el cluster.</p>
<p>Consulte <a href="task-stop-cluster.html">Para parar un cluster</a>.</p>
</li>
<li>
<p>Actualizar el componente en ese cluster.</p>
</li>
<li>
<p>Iniciar el cluster.</p>
<p>Consulte <a href="task-start-cluster.html">Para iniciar un cluster</a>.</p>
</li>
</ol>
<a id="sthref66" name="sthref66"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-create-cluster.html">Para crear un cluster</a></p>
</li>
<li>
<p><a href="task-delete-cluster.html">Para suprimir un cluster</a></p>
</li>
<li>
<p><a href="task-availabilityservice.html">Configurar los valores de disponibilidad para un cluster</a></p>
</li>
<li>
<p><a href="task-start-cluster.html">Para iniciar un cluster</a></p>
</li>
<li>
<p><a href="task-stop-cluster.html">Para parar un cluster</a></p>
</li>
<li>
<p><a href="task-modify-cluster-config.html">Para modificar la configuraci&oacute;n de un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-deploy.html">Para desplegar una aplicaci&oacute;n en un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-list.html">Para mostrar las aplicaciones desplegadas en un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-undeploy.html">Para anular el despliegue de aplicaciones en un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-remove.html">Para eliminar aplicaciones de un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-edit.html">Para editar una aplicaci&oacute;n desplegada en un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-enable-disable.html">Activar o desactivar una aplicaci&oacute;n desplegada en un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-lb-enable-disable.html">Activar o desactivar el equilibrio de carga para una aplicaci&oacute;n desplegada en un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-resource-create.html">Para crear un recurso para un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-resource-display.html">Para mostrar los recursos para un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-resource-enable-disable.html">Activar o desactivar un recurso de forma global</a></p>
</li>
<li>
<p><a href="task-cluster-resource-edit.html">Para editar un recurso para un cluster</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
