<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-start-clustered-instances" name="task-start-clustered-instances"></a><a id="GHCLU00047" name="GHCLU00047"></a></p>

<h4><a id="sthref76" name="sthref76"></a><a id="sthref77" name="sthref77"></a><a id="sthref78" name="sthref78"></a>Para iniciar instancias de GlassFish Server en cluster</h4>
<a name="BEGIN" id="BEGIN"></a><a id="sthref79" name="sthref79"></a>
<h5>Antes de Empezar</h5>
<p>Aseg&uacute;rese de que se cumplan los siguientes requisitos previos:</p>
<ul>
<li>
<p>Todos los nodos en los que residen las instancias est&aacute;n activados para la comunicaci&oacute;n remota.</p>
</li>
<li>
<p>El usuario del servidor de administraci&oacute;n de dominio (DAS) puede usar el protocolo remoto de Distributed Component Object Model (DCOM) o Secure Shell (SSH) para conectar al host para cualquier nodo en el que residan las instancias.</p>
</li>
</ul>
<p>Si no se cumplen algunos de estos requisitos previos, inicie cada instancia de forma individual desde la l&iacute;nea de comandos mediante el subcomando <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00237"><code>start-local-instance</code>(1)</a>.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Clusters.</p>
</li>
<li>
<p>En el nodo Clusters ampliado, seleccione el nodo para el cluster.</p>
<p>Se abre la p&aacute;gina Informaci&oacute;n General para el cluster.</p>
</li>
<li>
<p>En la p&aacute;gina Informaci&oacute;n General, haga clic en el separador Instancias.</p>
<p>Se abrir&aacute; la p&aacute;gina Instancias del Servidor en Cluster para el cluster.</p>
</li>
<li>
<p>Para cada instancia que vaya a iniciar, active la casilla de control que aparece junto a la instancia en la tabla Instancias del Servidor.</p>
</li>
<li>
<p>Haga clic en Iniciar.</p>
<p>Se le pedir&aacute; que confirme que desea iniciar las instancias.</p>
</li>
<li>
<p>Confirme que desea iniciar las instancias.</p>
<p>El estado de cada instancia se actualiza en la tabla Instancias del Servidor cuando se inicia la instancia.</p>
</li>
</ol>
<a id="sthref80" name="sthref80"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-create-clustered-instance.html">Para agregar una instancia de GlassFish Server a un Cluster</a></p>
</li>
<li>
<p><a href="task-delete-clustered-instances.html">Para suprimir instancias de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-stop-clustered-instances.html">Para parar instancias de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-view-logs-clustered-instance.html">Ver Archivos Log para una Instancia de GlassFish Server en Cluster</a></p>
</li>
<li>
<p><a href="task-recovertransactions.html">Recuperar transacciones para una instancia de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-change-clustered-instance-ports.html">Modificar los n&uacute;meros de puerto de una instancia de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-set-props-clustered-instance.html">Definir propiedades de s&oacute;lo instancia para una instancia de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-mon-app-clustered-instance.html">Ver datos de supervisi&oacute;n de aplicaciones para una instancia de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-mon-server-clustered-instance.html">Ver datos de supervisi&oacute;n del servidor virtual para una instancia de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-mon-resource-clustered-instance.html">Ver datos de supervisi&oacute;n de recursos para una instancia de GlassFish Server en cluster</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
