<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-gms" name="task-gms"></a><a id="GHCLU00080" name="GHCLU00080"></a></p>

<h4><a id="sthref222" name="sthref222"></a>Configurar el servicio de gesti&oacute;n de grupos</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>El servicio de gesti&oacute;n de grupos (GMS) es un servicio en curso que proporciona supervisi&oacute;n del cluster, pertenencia al cluster y servicios de comunicaci&oacute;n de grupos. Los GMS realizan las funciones siguientes:</p>
<ul>
<li>
<p>Notifican los m&oacute;dulos registrados en una instancia de GlassFish Server cuando se agregan o eliminan una o varias instancias en un cluster, o cuando se sospecha o se confirma que han fallado.</p>
</li>
<li>
<p>Ofrece la posibilidad de enviar y recibir mensajes entre los miembros del cluster.</p>
</li>
</ul>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Configuraci&oacute;n.</p>
</li>
<li>
<p>Seleccione la configuraci&oacute;n para el cluster que vaya a cambiar.</p>
</li>
<li>
<p>En el nodo de configuraci&oacute;n, seleccione el nodo Servicio de Gesti&oacute;n de Grupos.</p>
<p>Se abrir&aacute; la p&aacute;gina Servicio de Gesti&oacute;n de Grupos.</p>
</li>
<li>
<p>En el campo N&uacute;mero M&aacute;ximo de Latidos que Faltan, introduzca el n&uacute;mero m&aacute;ximo de latidos que faltan en un miembro antes de que GMS confirme que parece que hay un fallo.</p>
<p>El valor por defecto es 3.</p>
</li>
<li>
<p>En el campo Frecuencia de Latidos, escriba el per&iacute;odo de tiempo que transcurre entre las sucesivas difusiones del latido de un miembro del grupo.</p>
<p>El valor por defecto es 2.000 milisegundos.</p>
</li>
<li>
<p>En el campo Timeout de Detecci&oacute;n de Grupos, escriba el tiempo que esperar&aacute; GMS para detectar otros miembros del cluster.</p>
<p>El valor por defecto es 5.000 milisegundos.</p>
</li>
<li>
<p>En el campo Tiempo de Espera para la Verificaci&oacute;n de Fallos, escriba el tiempo que se debe esperar antes de verificar que un miembro que se cree que ha fallado se debe indicar como tal.</p>
<p>El valor por defecto es 1.500 milisegundos.</p>
</li>
<li>
<p>Para restablecer los valores por defecto, haga clic en el bot&oacute;n Cargar valores por defecto.</p>
</li>
<li>
<p>En la secci&oacute;n Propiedades Adicionales, especifique las propiedades adicionales.</p>
<ul>
<li>
<p>Para agregar una propiedad, haga clic en el bot&oacute;n Agregar Propiedad. En la fila en blanco que aparece, introduzca el nombre de propiedad en el campo Nombre y escriba el valor de propiedad en el campo Valor.</p>
</li>
<li>
<p>Para modificar una propiedad, edite el campo Valor.</p>
</li>
<li>
<p>Para suprimir una propiedad, active la casilla de control a la izquierda del campo Nombre de la propiedad que est&aacute; suprimiendo y, a continuaci&oacute;n, haga clic en el bot&oacute;n Suprimir Propiedades.</p>
</li>
</ul>
</li>
<li>
<p>Haga clic en Guardar.</p>
</li>
</ol>
<a id="sthref223" name="sthref223"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-gmsenable.html">Activar el servicio de gesti&oacute;n de grupos</a></p>
</li>
<li>
<p><a href="task-gmscluster.html">Configurar valores de servicio de gesti&oacute;n de grupos para un cluster</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
