<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-mon-app-clustered-instance" name="task-mon-app-clustered-instance"></a><a id="GHCLU00053" name="GHCLU00053"></a></p>

<h4><a id="sthref103" name="sthref103"></a><a id="sthref104" name="sthref104"></a><a id="sthref105" name="sthref105"></a><a id="sthref106" name="sthref106"></a><a id="sthref107" name="sthref107"></a>Ver datos de supervisi&oacute;n de aplicaciones para una instancia de GlassFish Server en cluster</h4>
<a name="BEGIN" id="BEGIN"></a><a id="sthref108" name="sthref108"></a>
<h5>Antes de Empezar</h5>
<p>Para poder ver datos de supervisi&oacute;n, debe <a href="../../../common/en/help/task-confmonitor.html">configurar el servicio de supervisi&oacute;n</a>.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Clusters.</p>
</li>
<li>
<p>En el nodo Clusters ampliado, seleccione el nodo para el cluster.</p>
<p>Se abre la p&aacute;gina Informaci&oacute;n General para el cluster.</p>
</li>
<li>
<p>En la p&aacute;gina Informaci&oacute;n General, haga clic en el separador Instancias.</p>
<p>Se abrir&aacute; la p&aacute;gina Instancias del Servidor en Cluster para el cluster.</p>
</li>
<li>
<p>Seleccione la instancia para la que desea ver los datos de supervisi&oacute;n de aplicaciones.</p>
<p>Se abrir&aacute; la p&aacute;gina Informaci&oacute;n General para la instancia.</p>
</li>
<li>
<p>En la p&aacute;gina Informaci&oacute;n General, haga clic en el separador Supervisar.</p>
<p>Se abrir&aacute; la p&aacute;gina Supervisi&oacute;n de Aplicaci&oacute;n.</p>
</li>
<li>
<p>En la lista desplegable Ver, seleccione la aplicaci&oacute;n para la cual desea ver los datos de supervisi&oacute;n.</p>
</li>
<li>
<p>Para actualizar los datos de supervisi&oacute;n mostrados, haga clic en Refrescar.</p>
</li>
</ol>
<a id="sthref109" name="sthref109"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="../../../common/en/help/task-confmonitor.html">Configurar el Servicio de Supervisi&oacute;n</a></p>
</li>
<li>
<p><a href="task-create-clustered-instance.html">Para agregar una instancia de GlassFish Server a un Cluster</a></p>
</li>
<li>
<p><a href="task-delete-clustered-instances.html">Para suprimir instancias de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-start-clustered-instances.html">Para iniciar instancias de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-stop-clustered-instances.html">Para parar instancias de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-view-logs-clustered-instance.html">Ver Archivos Log para una Instancia de GlassFish Server en Cluster</a></p>
</li>
<li>
<p><a href="task-recovertransactions.html">Recuperar transacciones para una instancia de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-change-clustered-instance-ports.html">Modificar los n&uacute;meros de puerto de una instancia de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-set-props-clustered-instance.html">Definir propiedades de s&oacute;lo instancia para una instancia de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-mon-server-clustered-instance.html">Ver datos de supervisi&oacute;n del servidor virtual para una instancia de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-mon-resource-clustered-instance.html">Ver datos de supervisi&oacute;n de recursos para una instancia de GlassFish Server en cluster</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
