<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-editnode" name="task-editnode"></a></p>

<h4><a id="sthref236" name="sthref236"></a>Editar un nodo</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Al editar un nodo se actualizan los datos de configuraci&oacute;n de un nodo de GlassFish Server. Editar un nodo tambi&eacute;n permite cambiar el tipo de nodo de CONFIG a DCOM o SSH para activar la comunicaci&oacute;n remota para el nodo.</p>
<p>Si cambia el tipo de nodo de CONFIG a DCOM, se aplicar&aacute;n los valores por defecto si se deja vac&iacute;o cualquiera de los campos siguientes:</p>
<ul>
<li>
<p>Dominio de Windows</p>
</li>
<li>
<p>Usuario de Windows</p>
</li>
</ul>
<p>Si cambia el tipo de nodo de CONFIG a SSH, se aplicar&aacute;n los valores por defecto si se deja vac&iacute;o cualquiera de los campos siguientes:</p>
<ul>
<li>
<p>Puerto SSH</p>
</li>
<li>
<p>Nombre de Usuario SSH</p>
</li>
<li>
<p>Archivo de claves</p>
</li>
</ul>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Nodos.</p>
</li>
<li>
<p>En la lista de nodos, seleccione el nodo que vaya a editar.</p>
<p>Se abrir&aacute; la p&aacute;gina Editar Nodo.</p>
</li>
<li>
<p>En la lista desplegable Tipo, seleccione el tipo de nodo actualizado.</p>
<ul>
<li>
<p>Para activar el nodo para que admita comunicaciones mediante el protocolo remoto Distributed Component Object Model (DCOM), seleccione DCOM.</p>
</li>
<li>
<p>Para permitir que el nodo soporte la comunicaci&oacute;n sobre Secure Shell (SSH), seleccione SSH.</p>
</li>
<li>
<p>Para que el nodo deje de soportar la configuraci&oacute;n remota, seleccione CONFIG.</p>
<p>Si selecciona CONFIG, no se mostrar&aacute; ninguna opci&oacute;n para la configuraci&oacute;n de SSH o la configuraci&oacute;n de DCOM. Si el tipo actual del nodo es DCOM o SSH y selecciona CONFIG, se eliminar&aacute;n los datos de configuraci&oacute;n de DCOM o SSH de la configuraci&oacute;n del nodo cuando guarde los cambios.</p>
</li>
</ul>
</li>
<li>
<p>En el campo Host de Nodo, indique el nombre del host que representar&aacute; el nodo actualizado.</p>
<p>Este campo es obligatorio o no en funci&oacute;n del tipo de nodo:</p>
<ul>
<li>
<p>Si el tipo de nodo es CONFIG., el nombre del host puede omitirse. El nombre del host se puede determinar al crear las instancias que residen en el nodo.</p>
</li>
<li>
<p>Si el tipo de nodo es DCOM o SSH, se debe especificar el nombre del host. De lo contrario, se produce un error.</p>
</li>
</ul>
</li>
<li>
<p>En el campo Directorio de Nodos, indique la ruta de acceso al directorio que contendr&aacute; las instancias de GlassFish Server que se crean en el nodo.</p>
<p>Si especifica una ruta de acceso relativa, la ruta de acceso es relativa con respecto al directorio as-install, donde as-install es el directorio base de instalaci&oacute;n del software GlassFish Server en el host.</p>
</li>
<li>
<p>En el campo Directorio de Instalaci&oacute;n, especifique la ruta de acceso completa al directorio <i>principal</i> del directorio base de instalaci&oacute;n del software GlassFish Server en el host, por ejemplo <code>/export/glassfish3</code>.</p>
</li>
<li>
<p>Termine la actualizaci&oacute;n del nodo tal y como lo exija el tipo de nodo.</p>
<ol type="a">
<li>
<p>Si el tipo de nodo es CONFIG, haga clic en Guardar.</p>
</li>
<li>
<p>Si el tipo de nodo es DCOM, siga las instrucciones de <a href="task-nodeupdatedcom.html">Terminar la Actualizaci&oacute;n de un Nodo DCOM</a>.</p>
</li>
<li>
<p>Si el tipo de nodo es SSH, siga las instrucciones de <a href="task-nodeeditssh.html">Terminar la Actualizaci&oacute;n de un Nodo SSH</a>.</p>
</li>
</ol>
</li>
</ol>
<a id="sthref237" name="sthref237"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-nodeupdatedcom.html">Terminar la Actualizaci&oacute;n de un Nodo DCOM</a></p>
</li>
<li>
<p><a href="task-nodeeditssh.html">Terminar la Actualizaci&oacute;n de un Nodo SSH</a></p>
</li>
<li>
<p><a href="task-createnode.html">Crear un nodo</a></p>
</li>
<li>
<p><a href="task-deletenode.html">Suprimir nodos</a></p>
</li>
<li>
<p><a href="task-listnodes.html">Mostrar todos los nodos en el dominio actual</a></p>
</li>
<li>
<p><a href="task-pingnode.html">Comprobar si el nodo es accesible</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
