<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-recovertransactions" name="task-recovertransactions"></a><a id="GHCLU00050" name="GHCLU00050"></a></p>

<h4><a id="sthref91" name="sthref91"></a><a id="sthref92" name="sthref92"></a><a id="sthref93" name="sthref93"></a>Recuperar transacciones para una instancia de GlassFish Server en cluster</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Clusters.</p>
</li>
<li>
<p>En el nodo Clusters ampliado, seleccione el nodo para el cluster.</p>
<p>Se abre la p&aacute;gina Informaci&oacute;n General para el cluster.</p>
</li>
<li>
<p>En la p&aacute;gina Informaci&oacute;n General, haga clic en el separador Instancias.</p>
<p>Se abrir&aacute; la p&aacute;gina Instancias del Servidor en Cluster para el cluster.</p>
</li>
<li>
<p>Seleccione la instancia para la que se deben recuperar transacciones.</p>
<p>Se abrir&aacute; la p&aacute;gina Informaci&oacute;n General para la instancia.</p>
</li>
<li>
<p>En la p&aacute;gina Informaci&oacute;n General, haga clic en Recuperar Transacciones.</p>
<p>Se abrir&aacute; la p&aacute;gina Recuperar Transacciones.</p>
<p>El contenido de la p&aacute;gina depende de si la instancia se est&aacute; ejecutando.</p>
<ul>
<li>
<p>Si la instancia se est&aacute; ejecutando, la p&aacute;gina Recuperar transacciones s&oacute;lo contiene el texto <b>La recuperaci&oacute;n la realiza el propio servidor en ejecuci&oacute;n</b> y el bot&oacute;n Aceptar.</p>
</li>
<li>
<p>Si la instancia no se est&aacute; ejecutando, la p&aacute;gina Recuperar Transacciones contiene opciones adicionales.</p>
</li>
</ul>
</li>
<li>
<p>En la lista desplegable Servidor de Destino, seleccione otra instancia del mismo cluster que pueda recuperar transacciones en la instancia actual.</p>
</li>
<li>
<p>En el campo Directorio de Log de Transacciones, escriba el directorio donde se guardar&aacute;n los logs de transacciones.</p>
<p>El valor por defecto es <code>/logs/tx</code> en el directorio de dominio. Los logs de transacciones se guardan en el subdirectorio <code>tx</code> del directorio especificado por la configuraci&oacute;n de Ubicaci&oacute;n de log de transacciones del servicio de transacci&oacute;n para la configuraci&oacute;n del cluster. El valor por defecto de Ubicaci&oacute;n de log de transacciones es el directorio especificado en el campo Ra&iacute;z de log de la p&aacute;gina Atributos de dominio, que est&aacute; ubicada en el separador Avanzado del nodo GlassFish Server.</p>
</li>
<li>
<p>Haga clic en Aceptar.</p>
</li>
</ol>
<a id="sthref94" name="sthref94"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-create-clustered-instance.html">Para agregar una instancia de GlassFish Server a un Cluster</a></p>
</li>
<li>
<p><a href="task-delete-clustered-instances.html">Para suprimir instancias de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-start-clustered-instances.html">Para iniciar instancias de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-stop-clustered-instances.html">Para parar instancias de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-view-logs-clustered-instance.html">Ver Archivos Log para una Instancia de GlassFish Server en Cluster</a></p>
</li>
<li>
<p><a href="task-change-clustered-instance-ports.html">Modificar los n&uacute;meros de puerto de una instancia de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-set-props-clustered-instance.html">Definir propiedades de s&oacute;lo instancia para una instancia de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-mon-app-clustered-instance.html">Ver datos de supervisi&oacute;n de aplicaciones para una instancia de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-mon-server-clustered-instance.html">Ver datos de supervisi&oacute;n del servidor virtual para una instancia de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-mon-resource-clustered-instance.html">Ver datos de supervisi&oacute;n de recursos para una instancia de GlassFish Server en cluster</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
