<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-cluster-app-undeploy" name="task-cluster-app-undeploy"></a></p>

<h4><a id="sthref28" name="sthref28"></a><a id="sthref29" name="sthref29"></a>Para anular el despliegue de aplicaciones en un cluster</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Al anular el despliegue de una aplicaci&oacute;n, se elimina la aplicaci&oacute;n de todos los objetivos y del dominio. Cuando se anula el despliegue de una aplicaci&oacute;n, la aplicaci&oacute;n ya no aparece en la p&aacute;gina <a href="../../../common/en/help/ref-applications.html">Aplicaciones</a> que muestra todas las aplicaciones desplegadas en GlassFish Server.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Clusters.</p>
</li>
<li>
<p>En el nodo Clusters ampliado, seleccione el nodo para el cluster.</p>
<p>Se abre la p&aacute;gina Informaci&oacute;n General para el cluster.</p>
</li>
<li>
<p>En la p&aacute;gina Informaci&oacute;n General, haga clic en el separador Aplicaciones.</p>
<p>Se abre la p&aacute;gina Aplicaciones para el cluster.</p>
</li>
<li>
<p>Para cada aplicaci&oacute;n cuyo despliegue vaya a anular, active la casilla de control que aparece junto a ella en la tabla Aplicaciones Desplegadas.</p>
</li>
<li>
<p>Haga clic en Anular Despliegue.</p>
<p>Se le pedir&aacute; que confirme que desea anular el despliegue de las aplicaciones.</p>
</li>
<li>
<p>Confirme que desea anular el despliegue de las aplicaciones.</p>
<p>Se anula el despliegue de las aplicaciones y &eacute;stas se eliminan de la tabla de aplicaciones desplegadas de la p&aacute;gina.</p>
</li>
</ol>
<a id="sthref30" name="sthref30"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-create-cluster.html">Para crear un cluster</a></p>
</li>
<li>
<p><a href="task-delete-cluster.html">Para suprimir un cluster</a></p>
</li>
<li>
<p><a href="task-availabilityservice.html">Configurar los valores de disponibilidad para un cluster</a></p>
</li>
<li>
<p><a href="task-start-cluster.html">Para iniciar un cluster</a></p>
</li>
<li>
<p><a href="task-stop-cluster.html">Para parar un cluster</a></p>
</li>
<li>
<p><a href="task-modify-cluster-config.html">Para modificar la configuraci&oacute;n de un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-deploy.html">Para desplegar una aplicaci&oacute;n en un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-list.html">Para mostrar las aplicaciones desplegadas en un cluster</a></p>
</li>
<li>
<p><a href="#task-cluster-app-undeploy">Para anular el despliegue de aplicaciones en un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-remove.html">Para eliminar aplicaciones de un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-remove.html">Para eliminar aplicaciones de un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-edit.html">Para editar una aplicaci&oacute;n desplegada en un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-enable-disable.html">Activar o desactivar una aplicaci&oacute;n desplegada en un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-app-lb-enable-disable.html">Activar o desactivar el equilibrio de carga para una aplicaci&oacute;n desplegada en un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-resource-create.html">Para crear un recurso para un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-resource-display.html">Para mostrar los recursos para un cluster</a></p>
</li>
<li>
<p><a href="task-cluster-resource-enable-disable.html">Activar o desactivar un recurso de forma global</a></p>
</li>
<li>
<p><a href="task-cluster-resource-edit.html">Para editar un recurso para un cluster</a></p>
</li>
<li>
<p><a href="task-upgrade-components.html">Actualizar componentes sin p&eacute;rdida de servicio</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
