<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-migrate-ejb-timers" name="task-migrate-ejb-timers"></a></p>

<h4><a id="sthref240" name="sthref240"></a><a id="sthref241" name="sthref241"></a><a id="sthref242" name="sthref242"></a>Migrar temporizadores EJB</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Si se para una instancia de GlassFish Server, los temporizadores EJB (Enterprise JavaBeans) instalados en dicha instancia tambi&eacute;n se parar&aacute;n. Si la instancia se ha parado de forma anormal o inesperada, puede activar los temporizadores. Para ello, ejec&uacute;telos mientras la instancia est&eacute; parada y m&iacute;grelos a una instancia de servidor en ejecuci&oacute;n del cluster.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo Clusters.</p>
</li>
<li>
<p>En el nodo Clusters del &aacute;rbol de navegaci&oacute;n, seleccione el cluster.</p>
<p>Se abre la p&aacute;gina Informaci&oacute;n General para el cluster.</p>
</li>
<li>
<p>En la p&aacute;gina Informaci&oacute;n General, haga clic en Migrar Temporizadores EJB.</p>
<p>Se abrir&aacute; la p&aacute;gina Migrar temporizadores EJB.</p>

<hr>
<p><b>Nota:</b></p>
Si todas las instancias del cluster se est&aacute;n ejecutando, el bot&oacute;n Migrar temporizadores EJB estar&aacute; desactivado.
<hr>

<p>Para ayudarle en la migraci&oacute;n de temporizadores, la p&aacute;gina Migrar temporizadores EJB contiene una tabla de temporizadores EJB con la informaci&oacute;n siguiente.</p>
<dl>
<dt>Nombre de servidor</dt>
<dd>
<p>Lista de instancias de GlassFish Server en el cluster.</p>
</dd>
<dt>Recuento de temporizadores</dt>
<dd>
<p>N&uacute;mero de temporizadores persistentes en cada instancia.</p>
</dd>
</dl>
</li>
<li>
<p>En la p&aacute;gina Migrar Temporizadores EJB, seleccione la instancia a la que se migrar&aacute;n los temporizadores y desde la cual se migrar&aacute;n.</p>
<ol type="a">
<li>
<p>En la lista desplegable Origen, seleccione la instancia parada desde la cual se migrar&aacute;n los temporizadores.</p>
</li>
<li>
<p>En la lista desplegable Destino, seleccione la instancia en ejecuci&oacute;n a la que se migrar&aacute;n los temporizadores.</p>
</li>
<li>
<p>Haga clic en Aceptar.</p>
</li>
</ol>
</li>
</ol>
<p>Si la instancia de origen se est&aacute; ejecutando o la instancia de destino no se est&aacute; ejecutando, la Consola de administraci&oacute;n mostrar&aacute; un mensaje de error.</p>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
