<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-nodeeditssh" name="task-nodeeditssh"></a></p>
<!-- infolevel="all" infotype="General" -->
<h4>Terminar la Actualizaci&oacute;n de un Nodo SSH</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Esta tarea es la continuaci&oacute;n para un nodo SSH de <a href="task-editnode.html">Editar un nodo</a>.</p>
<ol>
<li>
<p>Para forzar la actualizaci&oacute;n del nodo en la configuraci&oacute;n del Servidor de Administraci&oacute;n de Dominio (DAS) aunque falle la validaci&oacute;n de los par&aacute;metros del nodo, active la opci&oacute;n Forzar.</p>
</li>
<li>
<p>En el campo Puerto SSH, escriba el puerto que se utilizar&aacute; para las conexiones SSH con el host de este nodo.</p>
<p>Si cambia el tipo de nodo de CONFIG a SSH y deja este campo vac&iacute;o, la opci&oacute;n Puerto SSH se define en 22.</p>
</li>
<li>
<p>En el campo Nombre de Usuario SSH, escriba el nombre del usuario del host de este nodo que ejecutar&aacute; el proceso para conectar al host mediante SSH.</p>
<p>Si cambia el tipo de nodo de CONFIG a SSH y deja este campo en blanco, la opci&oacute;n Nombre de Usuario SSH se configura con el usuario que ejecuta el proceso DAS.</p>
</li>
<li>
<p>Especifique c&oacute;mo se autenticar&aacute; el usuario de SSH al iniciar sesi&oacute;n en el host de este nodo.</p>
<ul>
<li>
<p>Para especificar la autenticaci&oacute;n a trav&eacute;s de un archivo de claves SSH privadas, efect&uacute;e los pasos siguientes:</p>
<ol type="a">
<li>
<p>Seleccione Archivo de Claves en la lista desplegable Autenticaci&oacute;n de Usuario de SSH.</p>
</li>
<li>
<p>Si necesita que GlassFish Server configure una clave SSH en el host del nodo, active la opci&oacute;n Configurar SSH.</p>
<p>GlassFish Server configura la clave SSH copiando archivos de claves existentes desde el host de DAS o, en caso necesario, generando los archivos antes de copiarlos.</p>
<p>Se agregan a la ventana el campo Generar Clave y el campo Archivo de Claves P&uacute;blicas.</p>
</li>
<li>
<p>Si necesita que GlassFish Server genere los archivos de claves SSH antes de copiar los archivos en el host del nodo, active la opci&oacute;n Generar Clave.</p>
<p>Si existen archivos de claves SSH, GlassFish Server no generar&aacute; los archivos aunque seleccione la opci&oacute;n Activada.</p>

<hr>
<p><b>Nota:</b></p>
Si no existen archivos de claves SSH, deber&aacute; seleccionar la opci&oacute;n Activada. En caso contrario, se producir&aacute; un error al intentar guardar los cambios.
<hr>

</li>
<li>
<p>En el campo Contrase&ntilde;a de Usuario de SSH, escriba la contrase&ntilde;a que el usuario de SSH utilizar&aacute; al conectarse al host de este nodo.</p>
</li>
<li>
<p>En el campo Archivo de Claves P&uacute;blicas, escriba la ruta de acceso absoluta al archivo de claves p&uacute;blicas de SSH para el usuario especificado en la opci&oacute;n Nombre de Usuario SSH.</p>
</li>
<li>
<p>En el campo Archivo de Claves, escriba la ruta de acceso absoluta al archivo de claves SSH privadas para el usuario especificado en la opci&oacute;n Nombre de Usuario SSH.</p>

<hr>
<p><b>Nota:</b></p>
GlassFish Server tambi&eacute;n soporta la autenticaci&oacute;n con contrase&ntilde;a a trav&eacute;s de la entrada <code>AS_ADMIN_SSHPASSWORD</code> en el archivo de contrase&ntilde;as. El archivo de contrase&ntilde;as se especifica en la opci&oacute;n <code>-paswordfile</code> de la utilidad <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00263"><code>asadmin</code>(1)</a>.
<hr>

<p>Si cambia el tipo de nodo a SSH y deja este campo en blanco, la opci&oacute;n Archivo de Claves se configura con un archivo de claves situado en el directorio <code>.ssh</code> del usuario. Si se encuentran varios archivos de claves, GlassFish Server utiliza el siguiente orden de preferencia:</p>
<pre>
id_rsa
id_dsa
identity
</pre></li>
</ol>
</li>
<li>
<p>Para especificar la autenticaci&oacute;n mediante una contrase&ntilde;a guardada en la configuraci&oacute;n de DAS, efect&uacute;e los pasos siguientes:</p>

<hr>
<p><b>Atenci&oacute;n:</b></p>
Esta contrase&ntilde;a se almacena en forma de texto no cifrado en la configuraci&oacute;n de DAS. Para mayor seguridad, utilice un archivo de claves o un alias de contrase&ntilde;a.
<hr>

<ol type="a">
<li>
<p>Seleccione Contrase&ntilde;a en la lista desplegable Autenticaci&oacute;n de Usuario de SSH.</p>
</li>
<li>
<p>En el campo Contrase&ntilde;a de Usuario de SSH, escriba la contrase&ntilde;a que el usuario de SSH utilizar&aacute; al conectarse al host de este nodo.</p>
</li>
</ol>
</li>
<li>
<p>Para especificar la autenticaci&oacute;n mediante un alias de contrase&ntilde;a, efect&uacute;e los pasos siguientes:</p>
<ol type="a">
<li>
<p>Seleccione Alias de Contrase&ntilde;a en la lista desplegable Autenticaci&oacute;n de Usuario de SSH.</p>
</li>
<li>
<p>En la lista desplegable Alias de Contrase&ntilde;a, seleccione un alias existente.</p>
</li>
</ol>
</li>
</ul>
</li>
<li>
<p>Haga clic en Guardar.</p>
</li>
</ol>
<a id="sthref239" name="sthref239"></a>
<h5>Consulte tambi&eacute;n</h5>
<p><a href="task-editnode.html">Editar un nodo</a></p>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
