<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-standalone-instance-resource-enable-disable" name="task-standalone-instance-resource-enable-disable"></a><a id="GHCLU00071" name="GHCLU00071"></a></p>

<h4><a id="sthref182" name="sthref182"></a><a id="sthref183" name="sthref183"></a><a id="sthref184" name="sthref184"></a><a id="sthref185" name="sthref185"></a>Activar o desactivar un recurso para una instancia de GlassFish Server independiente</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, seleccione el nodo Instancias Independientes.</p>
<p>Se abrir&aacute; la p&aacute;gina Instancias de Servidor Independientes.</p>
</li>
<li>
<p>En la p&aacute;gina Instancias de Servidor Independientes, seleccione la instancia.</p>
<p>Se abrir&aacute; la p&aacute;gina Informaci&oacute;n General para la instancia.</p>
</li>
<li>
<p>En la p&aacute;gina Informaci&oacute;n General, haga clic en el separador Recursos.</p>
<p>Se abrir&aacute; la p&aacute;gina Recursos para la instancia.</p>
</li>
<li>
<p>Active la casilla de control que aparece junto al recurso.</p>
</li>
<li>
<p>Haga clic en el bot&oacute;n correspondiente.</p>
<ul>
<li>
<p>Para activar el recurso, seleccione Activar.</p>
</li>
<li>
<p>Para desactivar el recurso, seleccione Desactivar.</p>
<p>Al desactivar un recurso no se elimina.</p>
</li>
</ul>
</li>
</ol>
<a id="sthref186" name="sthref186"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-create-standalone-instance.html">Crear una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-delete-standalone-instances.html">Suprimir instancias de GlassFish Server independientes</a></p>
</li>
<li>
<p><a href="task-start-standalone-instances.html">Iniciar instancias de GlassFish Server independientes</a></p>
</li>
<li>
<p><a href="task-stop-standalone-instances.html">Parar instancias de GlassFish Server independientes</a></p>
</li>
<li>
<p><a href="task-view-logs-standalone-instance.html">Ver Archivos Log para una Instancia de GlassFish Server Independiente</a></p>
</li>
<li>
<p><a href="task-recovertransactions-standalone-instance.html">Recuperar transacciones para una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-deploy.html">Desplegar una aplicaci&oacute;n en una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-list.html">Mostrar aplicaciones desplegadas en una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-undeploy.html">Anular despliegue de aplicaciones de una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-remove.html">Eliminar aplicaciones de una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-edit.html">Editar una aplicaci&oacute;n desplegada en una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-enable-disable.html">Activar o desactivar una aplicaci&oacute;n desplegada en una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-lb-enable-disable.html">Activar o desactivar el equilibrio de carga para una aplicaci&oacute;n desplegada en una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-create.html">Crear un recurso para una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-display.html">Mostrar recursos para una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-edit.html">Editar un recurso para una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-change-standalone-instance-ports.html">Modificar los n&uacute;meros de puerto de una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-set-props-standalone-instance.html">Definir propiedades de s&oacute;lo instancia para una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-mon-app-standalone-instance.html">Ver datos de supervisi&oacute;n de aplicaciones para una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-mon-server-standalone-instance.html">Ver datos de supervisi&oacute;n de servidor virtual para una instancia de GlassFish Server independiente</a></p>
</li>
<li>
<p><a href="task-mon-resource-standalone-instance.html">Ver datos de supervisi&oacute;n de recursos para una instancia de GlassFish Server independiente</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
