<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-config-sys-properties-defaults" name="task-config-sys-properties-defaults"></a></p>

<h4>Definir los Valores por Defecto de las Propiedades del Sistema de Configuraci&oacute;n</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Los valores por defecto de las propiedades de configuraci&oacute;n se definen en la configuraci&oacute;n a la que hace referencia el cluster o la instancia.</p>
<ol>
<li>
<p>En el &aacute;rbol de navegaci&oacute;n, ampl&iacute;e el nodo relativo a la configuraci&oacute;n.</p>
</li>
<li>
<p>En la lista de tipos de propiedades bajo el nodo ampliado, seleccione Propiedades del Sistema.</p>
<p>Se abrir&aacute; la p&aacute;gina Propiedades del sistema para la configuraci&oacute;n seleccionada.</p>
<p>Esta p&aacute;gina muestra los valores actuales de las siguientes propiedades del sistema para la configuraci&oacute;n:</p>
<ul>
<li>
<p><a href="../../../common/en/help/ref-predefinedconfigsysproperties.html">N&uacute;meros de puerto predefinidos cuando se cre&oacute; la configuraci&oacute;n</a></p>
</li>
<li>
<p>Propiedades personalizadas que se agregan a la configuraci&oacute;n, si la hay</p>
</li>
</ul>
</li>
<li>
<p>Para asegurarse de que se apliquen los cambios sin necesidad de reiniciar el cluster o la instancia, seleccione la opci&oacute;n Nueva Configuraci&oacute;n Din&aacute;mica.</p>
</li>
<li>
<p>Para cada propiedad para la que configure un valor por defecto, escriba el nuevo valor en el campo Valor por Defecto de la propiedad.</p>
</li>
<li>
<p>Defina los valores por defecto para las propiedades adicionales que necesite.</p>
<ol type="a">
<li>
<p>En la tabla Propiedades Adicionales, haga clic en Agregar Propiedad.</p>
<p>Se agrega una fila a la tabla Propiedades Adicionales.</p>
</li>
<li>
<p>En el campo Nombre de Variable de Instancia, escriba el nombre de la propiedad.</p>
</li>
<li>
<p>En el campo Valor por Defecto, escriba el valor.</p>
</li>
</ol>
</li>
<li>
<p>Haga clic en Guardar.</p>
</li>
</ol>
<a id="sthref243" name="sthref243"></a>
<h5>Consulte tambi&eacute;n</h5>
<ul>
<li>
<p><a href="task-change-clustered-instance-ports.html">Modificar los n&uacute;meros de puerto de una instancia de GlassFish Server en cluster</a></p>
</li>
<li>
<p><a href="task-change-standalone-instance-ports.html">Modificar los n&uacute;meros de puerto de una instancia de GlassFish Server independiente</a></p>
</li>
</ul>




<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
