<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-protocolfilecacheedit" name="ref-protocolfilecacheedit"></a></p>

<h4><a id="sthref156" name="sthref156"></a><a id="sthref157" name="sthref157"></a>Dateicache</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Auf der Seite "Dateicache" k&ouml;nnen Sie Dateicacheeinstellungen f&uuml;r ein Netzwerkprotokoll &auml;ndern.</p>
<p>Die Seite "Dateicache" enth&auml;lt die folgenden Optionen.</p>
<dl>
<dt>Standardeinstellungen laden</dt>
<dd>
<p>Schaltfl&auml;che zur Wiederherstellung der Standardwerte von Einstellungen, die Standardwerte haben. Einstellungen, die keine Standardwerte haben, werden nicht ge&auml;ndert.</p>
</dd>
<dt>Name der Konfiguration</dt>
<dd>
<p>Der Name der Konfiguration, f&uuml;r die die Einstellungen auf dieser Seite angewendet werden. Dieses Feld ist schreibgesch&uuml;tzt.</p>
</dd>
<dt>Protokollname</dt>
<dd>
<p>Der Name des Protokolls. Das Feld "Protokollname" ist ein schreibgesch&uuml;tztes Feld. Sie k&ouml;nnen den Namen nur festlegen, wenn Sie ein neues Protokoll erstellen.</p>
</dd>
<dt>Status</dt>
<dd>
<p>Wenn diese Option ausgew&auml;hlt wird, wird der Status des Dateicache aktiviert. Diese Option ist standardm&auml;&szlig;ig aktiviert.</p>
</dd>
<dt>Maximales Alter</dt>
<dd>
<p>Das maximale Alter in Sekunden f&uuml;r einen g&uuml;ltigen Cacheeintrag.</p>
<p>Dieser Parameter kontrolliert, wie lange gecachte Informationen verwendet werden, nachdem eine Datei gecacht wurde. Ein Eintrag, der &auml;lter ist als das angegebene Maximalalter, wird durch einen neuen Eintrag f&uuml;r dieselbe Datei ersetzt. Wenn sich der verwendete Content nur selten &auml;ndert, erh&ouml;hen Sie diesen Wert, um die Performance zu verbessern.</p>
<p>Das optimale maximale Alter h&auml;ngt davon ab, ob die vorhandenen Dateien regelm&auml;&szlig;ig ge&auml;ndert werden. Wenn die Dateien beispielsweise vier Mal t&auml;glich in regelm&auml;&szlig;igen Abst&auml;nden ge&auml;ndert werden, k&ouml;nnen Sie das maximale Alter auf 21600 Sekunden (6 Stunden) festlegen. Andernfalls sollten Sie das maximale Alter auf den l&auml;ngsten Zeitraum einstellen, f&uuml;r den die fr&uuml;here Version einer Inhaltsdatei auf dem Server verbleiben soll, nachdem die Datei ge&auml;ndert wurde.</p>
<p>Der Standardwert ist 30.</p>
</dd>
<dt>Maximale Zwischenspeichergr&ouml;&szlig;e</dt>
<dd>
<p>Die maximale Gesamtgr&ouml;&szlig;e (in Byte) des Dateicache auf dem Datentr&auml;ger. Der Standardwert ist 10485760.</p>
</dd>
<dt>Maximale Dateizahl</dt>
<dd>
<p>Die maximale Anzahl an Dateien, die im Dateicache gespeichert werden k&ouml;nnen.</p>
<p>Wenn dieser Wert zu hoch gew&auml;hlt ist, cacht der Server selten verwendete Dateien, wodurch Arbeitsspeicher vergeudet wird. Ist dieser Wert zu niedrig eingestellt, gehen die Vorteile der Cachings verloren. Probieren Sie verschiedene Werte f&uuml;r dieses Attribut aus, um die optimale Einstellung f&uuml;r spezifische Anwendungen zu finden.</p>
<p>Der Standardwert ist 1024.</p>
</dd>
</dl>
<a id="sthref158" name="sthref158"></a>
<h5>Verwandte Aufgaben</h5>
<ul>
<li>
<p><a href="task-protocolnew.html">So wird ein Protokoll erstellt</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">So wird ein Protokoll bearbeitet</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">So werden SSL-Einstellungen f&uuml;r ein Protokoll bearbeitet</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">So werden HTTP-Einstellungen f&uuml;r ein Protokoll bearbeitet</a></p>
</li>
<li>
<p><a href="task-protocolfilecacheedit.html">So werden Dateicacheeinstellungen f&uuml;r ein Protokoll bearbeitet</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">So wird ein Protokoll gel&ouml;scht</a></p>
</li>
</ul>
<a id="sthref159" name="sthref159"></a>
<h5>Zugeh&ouml;rige asadmin-Befehle</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00051"><code>create-protocol</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00195"><code>list-protocols</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00103"><code>delete-protocol</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
