<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-virtualserverprops" name="ref-virtualserverprops"></a></p>

<h4><a id="sthref125" name="sthref125"></a><a id="sthref126" name="sthref126"></a>F&uuml;r virtuelle Server spezifische Eigenschaften</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Die folgenden zus&auml;tzlichen Eigenschaften stehen f&uuml;r virtuelle Server zur Verf&uuml;gung.</p>
<dl>
<dt><code>sso-max-inactive-seconds</code></dt>
<dd>
<p>Gibt den Zeitraum (in Sekunden) an, nach dem der SSO-Datensatz eines Benutzers zum L&ouml;schen freigegeben wird, wenn keine Clientaktivit&auml;t verzeichnet wird. Da der SSO-Eintrag f&uuml;r verschiedene Anwendungen auf demselben virtuellen Server verwendet wird, wird er durch den Zugriff auf eine beliebige der Anwendungen aktiv gehalten.</p>
<p>Der Standardwert ist 300 Sekunden (5 Minuten). H&ouml;here Werte erm&ouml;glichen eine l&auml;ngere SSO-Persistenz f&uuml;r die Benutzer, jedoch zu Lasten eines h&ouml;heren Arbeitsspeicherverbrauchs auf dem Server.</p>
</dd>
<dt><code>sso-reap-interval-seconds</code></dt>
<dd>
<p>Gibt den Zeitraum (in Sekunden) an, der zwischen zwei L&ouml;schvorg&auml;ngen f&uuml;r abgelaufene SSO-Eintr&auml;ge vergeht.</p>
<p>Der Standardwert ist 60.</p>
</dd>
<dt><code>ssoCookieSecure</code></dt>
<dd>
<p>Legt das Attribut <code>Secure</code> aller <code>JSESSIONIDSSO</code> -Cookies fest, die mit den auf diesem virtuellen Server bereitgestellten Webanwendungen verbunden sind. Diese Eigenschaft ist nur verf&uuml;gbar, wenn Single Sign-On (SSO) aktiviert ist. Folgende Werte sind zul&auml;ssig:</p>
<dl>
<dt><code>true</code></dt>
<dd>
<p>Legt <code>Secure</code> auf "True" fest.</p>
</dd>
<dt><code>false</code></dt>
<dd>
<p>Legt <code>Secure</code> auf "False" fest.</p>
</dd>
<dt><code>dynamic</code></dt>
<dd>
<p>Das Cookie <code>JSESSIONIDSSO</code> &uuml;bernimmt die <code>Secure</code>-Einstellung der ersten Session, die an SSO teilnimmt.</p>
</dd>
</dl>
<p>Zum Festlegen des Secure-Attributs eines <code>JSESSIONID</code>-Cookies verwenden Sie die Eigenschaft <code>cookieSecure</code> <code>cookie-properties</code> in der Datei <code>sun-web.xml</code>. Weitere Einzelheiten finden Sie unter <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00130"><i>cookie-properties</i> in <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt><code>setCacheControl</code></dt>
<dd>
<p>Eine durch Komma getrennte Liste von Anweisungen f&uuml;r <code>Cache-Control</code>-Antworten. Eine Liste der g&uuml;ltigen Anweisungen finden Sie in Abschnitt 14.9 des Dokuments in http://www.ietf.org/rfc/rfc2616.txt (<code><a href="http://www.ietf.org/rfc/rfc2616.txt">http://www.ietf.org/rfc/rfc2616.txt</a></code>).</p>
</dd>
<dt><code>accessLogBufferSize</code></dt>
<dd>
<p>Gibt die Gr&ouml;&szlig;e des Puffers, in dem Zugriffslogaufrufe gespeichert werden, in Byte an. Ist der Wert kleiner als 5120, wird eine Warnmeldung ausgegeben, und der Wert wird auf 5120 gesetzt. Der Standardwert ist 32768.</p>
</dd>
<dt><code>accessLogWriterInterval</code></dt>
<dd>
<p>Gibt die Anzahl Sekunden an, bevor das Log auf den Datentr&auml;ger geschrieben wird. Das Zugriffslog wird geschrieben, wenn der Puffer voll ist oder das Intervall abl&auml;uft. Beim Wert 0 werden die Pufferdaten immer geschrieben, auch wenn der Puffer nicht voll ist. Dies bedeutet, dass die Logmeldung bei jedem Zugriff auf den Server direkt in der Datei gespeichert wird. Der Standardwert ist 300.</p>
</dd>
<dt><code>allowRemoteAddress</code></dt>
<dd>
<p>Eine Liste durch Kommata getrennter regul&auml;rer Ausdrucksmuster, mit der die IP-Adresse des Remote-Client verglichen wird. Wenn diese Eigenschaft angegeben ist, <i>muss</i> f&uuml;r die Remote-Adresse &Uuml;bereinstimmung bestehen, damit diese Anforderung akzeptiert wird. Wenn diese Eigenschaft nicht angegeben ist, werden alle Anforderungen akzeptiert, <i>es sei denn</i>, die Remote-Adresse stimmt mit einem <code>denyRemoteAddress</code>-Muster &uuml;berein.</p>
</dd>
<dt><code>denyRemoteAddress</code></dt>
<dd>
<p>Eine Liste durch Kommata getrennter regul&auml;rer Ausdrucksmuster, mit der die IP-Adresse des Remote-Client verglichen wird. Wenn diese Eigenschaft angegeben ist, darf f&uuml;r diese Remote-Adresse <i>keine</i> &Uuml;bereinstimmung bestehen, damit diese Anforderung akzeptiert wird. Wenn diese Eigenschaft nicht angegeben ist, wird das Akzeptieren von Anforderungen allein &uuml;ber die Eigenschaft <code>allowRemoteAddress</code> geregelt.</p>
</dd>
<dt><code>allowRemoteHost</code></dt>
<dd>
<p>Gibt eine durch Komma getrennte Liste regul&auml;rer Ausdrucksmuster an, mit denen der Hostname des Remote-Clients (wie von <code>[java.net.]Socket.getInetAddress().getHostName()</code> zur&uuml;ckgegeben) verglichen wird. Wenn diese Eigenschaft angegeben ist, <i>muss</i> f&uuml;r den Hostnamen dieses Remote-Client &Uuml;bereinstimmung bestehen, damit diese Anforderung akzeptiert wird. Wenn diese Eigenschaft nicht angegeben ist, werden alle Anforderungen akzeptiert, <i>es sei denn</i>, der Hostname dieses Remote-Client stimmt mit einem <code>denyRemoteHost</code>-Muster &uuml;berein.</p>
</dd>
<dt><code>denyRemoteHost</code></dt>
<dd>
<p>Gibt eine durch Komma getrennte Liste regul&auml;rer Ausdrucksmuster an, mit denen der Hostname des Remote-Clients (wie von <code>[java.net.]Socket.getInetAddress().getHostName()</code> zur&uuml;ckgegeben) verglichen wird. Wenn diese Eigenschaft angegeben ist, darf f&uuml;r den Hostnamen dieses Remote-Client <i>keine</i> &Uuml;bereinstimmung bestehen, damit diese Anforderung akzeptiert wird. Wenn diese Eigenschaft nicht angegeben ist, wird das Akzeptieren von Anforderungen allein &uuml;ber die Eigenschaft <code>allowRemoteHost</code> geregelt.</p>
<p>Die Festlegung dieser Eigenschaft hat keine Wirkung, wenn der Zugriff auf die GlassFish Server-Domain &uuml;ber ein Netzwerkzielger&auml;t erfolgt, f&uuml;r das die Option "JK-Zielger&auml;t" aktiviert ist.</p>
</dd>
<dt><code>authRealm</code></dt>
<dd>
<p>Gibt den Namen einer Authentifizierungs-Realm an, die die Standard-Realm einer Serverinstanz f&uuml;r Standalone-Webanwendungen, die in diesem virtuellen Server bereitgestellt werden, &uuml;berschreibt. Eine Realm, die in einer <code>web.xml</code>-Datei einer Standalone-Webanwendung definiert ist, &uuml;berschreibt die Realm des virtuellen Servers. Weitere Informationen finden Sie unter <a href="../../../common/en/help/ref-realms.html">Realms</a> .</p>
</dd>
<dt><code>securePagesWithPragma</code></dt>
<dd>
<p>Setzen Sie diese Eigenschaft auf <code>False</code>, um sicherzustellen, dass das Herunterladen von Dateien &uuml;ber Internet Explorer mit SSL f&uuml;r alle Webanwendungen auf diesem virtuellen Server korrekt funktioniert.</p>
<p>Einzelne Webanwendungen k&ouml;nnen diese Einstellung durch Verwendung des <code>sun-web-app</code>-Elements in der Datei <code>sun-web.xml</code> &uuml;berschreiben. Weitere Einzelheiten finden Sie unter <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>glassfish-web-app</i> in <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
<p>Der Standardwert ist <code>True</code>.</p>
</dd>
<dt><code>alternatedocroot_</code><i>n</i></dt>
<dd>
<p>Gibt eine alternative Document Root (Docroot) an, wobei <i>n</i> eine positive Ganzzahl ist, die die Angabe von mehr als einer Docroot erlaubt. Alternative Docroots erm&ouml;glichen Webanwendungen das Bearbeiten von Anforderungen f&uuml;r bestimmte Ressourcen von au&szlig;erhalb ihrer eigenen Docroot, abh&auml;ngig davon, ob diese Anforderungen mit einem (oder mehreren) der URI-Muster der alternativen Docroots der Webanwendung &uuml;bereinstimmen.</p>
<p>Wenn die Anforderung mit dem URI-Muster einer alternativen Docroot &uuml;bereinstimmt, wird es der alternativen Docroot zugeordnet, indem der URI der Anforderung (minus Context Root der Webanwendung) an den physikalischen Speicherort der alternativen Docroot (Verzeichnis) angeh&auml;ngt wird. Wenn eine Anforderung mit mehreren URI-Mustern &uuml;bereinstimmt, wird die alternative Docroot anhand dieser Reihenfolge festgelegt:</p>
<ul>
<li>
<p>Exakte &Uuml;bereinstimmung</p>
</li>
<li>
<p>L&auml;ngste &Uuml;bereinstimmung des Pfades</p>
</li>
<li>
<p>&Uuml;bereinstimmung der Erweiterung</p>
</li>
</ul>
<p>Die folgenden Eigenschaften geben beispielsweise drei alternative Docroots an: Im URI-Muster der ersten alternativen Docroot wird eine exakte &Uuml;bereinstimmung verwendet, wogegen im URI-Muster der zweiten und dritten alternativen Docroot eine Erweiterung bzw. das l&auml;ngste Pfadpr&auml;fix verwendet werden.</p>
<pre>
&lt;property name="alternatedocroot_1" 
   value="from=/my.jpg dir=/srv/images/jpg"
&lt;property name="alternatedocroot_2" 
   value="from=*.jpg dir=/srv/images/jpg"
&lt;property name="alternatedocroot_3" 
   value="from=/jpg/* dir=/src/images"
</pre>
<p>Der <code>Wert</code> jeder alternativen Docroot hat zwei Komponenten: Die erste Komponente, <code>from</code>, gibt das URI-Muster der alternativen Docroot an, die zweite Komponente, <code>dir</code>, gibt den physischen Speicherort der alternativen Docroot an (das Verzeichnis). Bei der <code>dir</code>-Komponente sind Leerzeichen erlaubt.</p>
<p>Einzelne Webanwendungen k&ouml;nnen diese Einstellung durch Verwendung des <code>sun-web-app</code>-Elements in der Datei <code>sun-web.xml</code> &uuml;berschreiben. Weitere Einzelheiten finden Sie unter <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>glassfish-web-app</i> in <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt><code>contextXmlDefault</code></dt>
<dd>
<p>Gibt das Verzeichnis relativ zu domain-dir der Datei <code>context.xml</code> f&uuml;r diesen virtuellen Server an, sofern verwendet. Weitere Informationen &uuml;ber die Datei <code>context.xml</code> finden Sie unter "The Context Container" (<code><a href="http://tomcat.apache.org/tomcat-5.5-doc/config/context.html">http://tomcat.apache.org/tomcat-5.5-doc/config/context.html</a></code>)</p>
</dd>
<dt><code>allowLinking</code></dt>
<dd>
<p>Wenn diese Eigenschaft auf <code>True</code> gesetzt wird, werden Ressourcen in Form von symbolischen Links f&uuml;r alle Webanwendungen verwendet, die auf diesem virtuellen Server bereitgestellt sind. Einzelne Webanwendungen k&ouml;nnen diese Einstellung durch Verwendung der <code>sun-web-app</code>-Eigenschaft <code>allowLinking</code> in der Datei <code>sun-web.xml</code> &uuml;berschreiben:</p>
<pre>
&lt;sun-web-app&gt;
   &lt;property name="allowLinking" 
      value="{true|false}"
&lt;/sun-web-app&gt;
</pre>
<p>Weitere Einzelheiten finden Sie unter <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>glassfish-web-app</i> in <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
<p>Der Standardwert ist <code>False</code>.</p>

<hr>
<p><b>Achtung:</b></p>
Wenn diese Eigenschaft auf Windows-Systemen auf "True" gesetzt wird, wird JSP-Quellcode offengelegt.
<hr>

</dd>
<dt><code>send-error_</code><i>n</i></dt>
<dd>
<p>Gibt die benutzerdefinierten Fehlerseitenzuordnungen f&uuml;r den virtuellen Server an, der von allen durch den virtuellen Server bereitgestellten Webanwendungen &uuml;bernommen wird. Eine Webanwendung kann diese benutzerdefinierten Fehlerseitenzuordnungen in ihrem <code>web.xml</code>-Deployment-Deskriptor &uuml;berschreiben. Der Wert jeder <code>send-error_</code> <i>n</i>-Eigenschaft hat drei Komponenten, die in beliebiger Reihenfolge angegeben werden k&ouml;nnen:</p>
<ul>
<li>
<p>Die Komponente, <code>code</code>, gibt den dreistelligen HTTP-Antwortstatuscode an, f&uuml;r den die benutzerdefinierte Fehlerseite in der Antwort zur&uuml;ckgegeben werden soll.</p>
</li>
<li>
<p>Die zweite Komponente, <code>path</code>, gibt den absoluten oder den relativen Dateisystempfad der benutzerdefinierten Fehlerseite an. Ein relativer Dateisystempfad wird relativ zum Verzeichnis domain-dir<code>/config</code> interpretiert.</p>
</li>
<li>
<p>Die dritte Komponente, <code>reason</code>, ist optional und gibt den zur&uuml;ckzugebenden Text der Ursachenzeichenfolge an (beispielsweise <code>Unauthorized</code> oder <code>Forbidden</code>.</p>
</li>
</ul>
<p>Beispiel:</p>
<pre>
&lt;property name="send-error_1"
   value="code=401 path=/myhost/401.html reason=MY-401-REASON"
</pre>
<p>Dieses Beispiel einer Eigenschaftendefinition f&uuml;hrt dazu, dass der Content von <code>/myhost/401.html</code> mit 401-Antworten zusammen mit dieser Antwortzeile zur&uuml;ckgegeben wird:</p>
<pre>
HTTP/1.1 401 MY-401-REASON
</pre></dd>
<dt><code>redirect_</code><i>n</i></dt>
<dd>
<p>Legt fest, dass eine Anforderung f&uuml;r eine alte URL als Anforderung f&uuml;r eine neue URL behandelt wird. Diese Eigenschaften werden von allen Webanwendungen &uuml;bernommen, die auf dem virtuellen Server bereitgestellt werden. Der Wert jeder <code>redirect_</code> <i>n</i>-Eigenschaft hat zwei Komponenten, die in beliebiger Reihenfolge angegeben werden k&ouml;nnen:</p>
<ul>
<li>
<p>Die erste Komponente, <code>from</code>, gibt das neue Pr&auml;fix des angeforderten URI an, mit dem &Uuml;bereinstimmung bestehen muss.</p>
</li>
<li>
<p>Die zweite Komponente, <code>url-prefix</code>, gibt das neue URL-Pr&auml;fix an, das dem Client zur&uuml;ckzusenden ist. Das Pr&auml;fix <code>from</code> wird einfach durch dieses URL-Pr&auml;fix ersetzt.</p>
</li>
</ul>
<p>Beispiel:</p>
<pre>
&lt;property name="redirect_1" 
  value="from=/dummy url-prefix=http://etude"
</pre></dd>
<dt><code>valve_</code><i>n</i></dt>
<dd>
<p>Gibt einen vollst&auml;ndig angegebenen Klassennamen eines benutzerdefinierten Valve an, wobei <i>n</i> eine positive Ganzzahl ist, die die Angabe von mehr als einem Valve erm&ouml;glicht. Die Valve-Klasse muss die <code>org.apache.catalina.Valve</code>-Schnittstelle von Tomcat oder der GlassFish Server-Vorg&auml;ngerversionen oder der <code>org.glassfish.web.valve.GlassFishValve</code>-Schnittstelle der aktuellen GlassFish Server-Version implementieren. Beispiel:</p>
<pre>
&lt;property name="valve_1"
value="org.glassfish.extension.Valve"
</pre>
<p>Sie k&ouml;nnen diese Eigenschaft f&uuml;r eine bestimmte Webanwendung festlegen. Weitere Einzelheiten finden Sie unter <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>glassfish-web-app</i> in <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt><code>listener_</code><i>n</i></dt>
<dd>
<p>Gibt einen vollst&auml;ndig angegebenen Klassennamen eines benutzerdefinierten Catalina-Listeners an, wobei <i>n</i> eine positive Ganzzahl ist, die die Angabe von mehr als einem Listener erm&ouml;glicht. Die Listener-Klasse muss die <code>org.apache.catalina.ContainerListener</code>- oder <code>org.apache.catalina.LifecycleListener</code>-Schnittstelle implementieren. Beispiel:</p>
<pre>
&lt;property name="listener_1"
value="org.glassfish.extension.MyLifecycleListener"
</pre>
<p>Sie k&ouml;nnen diese Eigenschaft f&uuml;r eine bestimmte Webanwendung festlegen. Weitere Einzelheiten finden Sie unter <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00161"><i>glassfish-web-app</i> in <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt><code>errorReportValve</code></dt>
<dd>
<p>Gibt einen vollst&auml;ndig angegebenen Klassennamen eines benutzerdefinierten Valve an, das Standardfehlerseiten f&uuml;r Anwendungen auf diesem virtuellen Server produziert. Geben Sie eine leere Zeichenfolge an, um den Standard- Fehlerseitenmechanismus f&uuml;r diesen virtuellen Server zu deaktivieren.</p>
</dd>
</dl>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
