<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-threadpools" name="ref-threadpools"></a><a id="GHWEB00027" name="GHWEB00027"></a></p>

<h4><a id="sthref169" name="sthref169"></a><a id="sthref170" name="sthref170"></a>Threadpools</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Sie verwenden die Seite "Threadpools" zum Konfigurieren von Threadpools.</p>
<p>Verwenden Sie Threadpools, um einen Service auf eine bestimmte Anzahl gleichzeitiger Threads zu beschr&auml;nken.</p>
<p>Wenn Sie GlassFish Server erstmalig installieren, stehen standardm&auml;&szlig;ig zwei Threadpools zur Verf&uuml;gung. Der Threadpool <code>http-thread-pool</code> ist f&uuml;r die Verwendung durch Netzwerk-Listener konfiguriert, w&auml;hrend <code>thread-pool-1</code> f&uuml;r die Verwendung durch den ORB f&uuml;r RMI/IIOP-Anforderungen konfiguriert ist. M&ouml;glicherweise m&uuml;ssen Sie einen Threadpool mit unterschiedlichen Einstellungen f&uuml;r bestimmte Arten von Anwendungen und bestimmte Hardwaresysteme erstellen oder den standardm&auml;&szlig;igen Threadpool an Ihre spezifischen Anforderungen anpassen.</p>
<p>Die Java Virtual Machine (JVM) kann gleichzeitig eine Vielzahl von Ausf&uuml;hrungsthreads unterst&uuml;tzen. F&uuml;r eine gute Performance verf&uuml;gt GlassFish Server &uuml;ber mindestens einen Threadpool. Sie k&ouml;nnen bestimmten Services bestimmte Threadpools zuweisen.</p>
<p>Ein Threadpool kann f&uuml;r mehrere Services verwendet werden. Anforderungsthreads verarbeiten Benutzeranforderungen. Wenn der Server eine Anforderung empf&auml;ngt, weist er die Anforderung einem freien Thread im Threadpool zu. Der Thread f&uuml;hrt die Clientanforderung aus und gibt Ergebnisse zur&uuml;ck. Beispiel: Wenn die Anforderung eine Systemressource verwenden muss, die gegenw&auml;rtig belegt ist, wartet der Thread, bis die Ressource frei ist, bevor er die Verwendung dieser Ressource zul&auml;sst.</p>
<p>Geben Sie die Mindestanzahl und die maximale Anzahl von Threads an, die f&uuml;r Anforderungen reserviert sind. Der Threadpool wird gem&auml;&szlig; diesen Werten dynamisch angepasst. Die angegebene Mindestgr&ouml;&szlig;e des Threadpools weist den Server an, mindestens diese Anzahl von Threads f&uuml;r Anforderungen zu reservieren. Diese Anzahl wird bis zur angegebenen maximalen Threadpoolgr&ouml;&szlig;e erh&ouml;ht.</p>
<p>Durch das Erh&ouml;hen der Anzahl von verf&uuml;gbaren Threads f&uuml;r einen Prozess kann dieser Prozess auf eine h&ouml;here Anzahl von Anforderungen gleichzeitig reagieren.</p>
<p>F&uuml;r jeden Threadpool stehen die folgenden Informationen zur Verf&uuml;gung.</p>
<dl>
<dt>Threadpool-ID</dt>
<dd>
<p>Der Name des Threadpools.</p>
</dd>
<dt>Max. Threadpoolgr&ouml;&szlig;e</dt>
<dd>
<p>Die maximale Anzahl an Threads im Threadpool.</p>
</dd>
<dt>Minimale Threadpoolgr&ouml;&szlig;e</dt>
<dd>
<p>Die minimale Anzahl an Threads im Threadpool. Diese Threads werden bei der Instanziierung des Threadpools erstellt.</p>
</dd>
<dt>Max. Queuegr&ouml;&szlig;e</dt>
<dd>
<p>Die maximale Anzahl von Meldungen, die in die Queue gestellt werden k&ouml;nnen, bis Threads f&uuml;r ihre Verarbeitung zur Verf&uuml;gung stehen.</p>
</dd>
<dt>Threadleerlauftimeout</dt>
<dd>
<p>Die Anzahl Sekunden, nach der inaktive Threads aus dem Pool entfernt werden.</p>
</dd>
</dl>
<p>Die Tabelle "Threadpools" enth&auml;lt dar&uuml;ber hinaus die folgenden Optionen.</p>
<dl>
<dt>Neu</dt>
<dd>
<p>Schaltfl&auml;che zum Erstellen eines neuen Threadpools.</p>
</dd>
<dt>L&ouml;schen</dt>
<dd>
<p>Schaltfl&auml;che zum L&ouml;schen von mindestens einem ausgew&auml;hlten Threadpool.</p>
</dd>
</dl>
<a id="sthref171" name="sthref171"></a>
<h5>Verwandte Aufgaben</h5>
<ul>
<li>
<p><a href="task-threadpoolnew.html">So wird ein Threadpool erstellt</a></p>
</li>
<li>
<p><a href="task-threadpooledit.html">So wird ein Threadpool bearbeitet</a></p>
</li>
<li>
<p><a href="task-threadpooldelete.html">So wird ein Threadpool gel&ouml;scht</a></p>
</li>
</ul>
<a id="sthref172" name="sthref172"></a>
<h5>Zugeh&ouml;rige asadmin-Befehle</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00060"><code>create-threadpool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00204"><code>list-threadpools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00111"><code>delete-threadpool</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
