<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-networklisteneredit" name="ref-networklisteneredit"></a></p>

<h4><a id="sthref136" name="sthref136"></a>Netzwerk-Listener bearbeiten</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Auf der Seite "Netzwerk-Listener bearbeiten" k&ouml;nnen Sie einen vorhandenen Netzwerk-Listener bearbeiten.</p>
<p>Beim Bearbeiten eines Netzwerk-Listeners stehen die Registerkarten "SSL", "HTTP" und "Dateicache" f&uuml;r das verbundene Protokoll ebenfalls zur Bearbeitung zur Verf&uuml;gung.</p>
<p>Die Seite "Netzwerk-Listener bearbeiten" enth&auml;lt die folgenden Optionen.</p>
<dl>
<dt>Standardeinstellungen laden</dt>
<dd>
<p>Schaltfl&auml;che zur Wiederherstellung der Standardwerte von Einstellungen, die Standardwerte haben. Einstellungen, die keine Standardwerte haben, werden nicht ge&auml;ndert.</p>
</dd>
<dt>Name der Konfiguration</dt>
<dd>
<p>Der Name der Konfiguration, f&uuml;r die die Einstellungen auf dieser Seite angewendet werden. Dieses Feld ist schreibgesch&uuml;tzt.</p>
</dd>
<dt>Name</dt>
<dd>
<p>Der eindeutige Listener-Name. Das Feld "Name" ist ein schreibgesch&uuml;tztes Feld. Sie k&ouml;nnen den Namen nur festlegen, wenn Sie einen neuen Netzwerk-Listener erstellen.</p>
</dd>
<dt>Protokoll</dt>
<dd>
<p>Das mit dem Netzwerk-Listener verbundene Protokoll. Das Feld "Protokoll" ist ein schreibgesch&uuml;tztes Feld. Sie k&ouml;nnen nur dann ein Protokoll erstellen oder festlegen, wenn Sie einen neuen Netzwerk-Listener erstellen.</p>
<p>W&auml;hlen Sie das vom Netzwerk-Listener verwendete Protokoll, um die Einstellungen zu &auml;ndern. Beispiel: Sie k&ouml;nnen die Sicherheit aktivieren</p>
</dd>
<dt>Status</dt>
<dd>
<p>Der Status des Netzwerk-Listeners. Der Listener kann aktiviert oder deaktiviert werden. Diese Option ist standardm&auml;&szlig;ig aktiviert. Wenn der Listener deaktiviert ist, f&uuml;hren alle Versuche, eine Verbindung zum Listener herzustellen, zu einer Socket-Ausnahme (<code>java.net.ConnectException</code>).</p>
<p>In Versionen von GlassFish Server vor Application Server 9.1 wurde bei einem Listener, dessen Attribut "Aktiviert" auf "False" gesetzt war, f&uuml;r alle an den Listener gesendeten Anforderungen der Antwortcode 404 zur&uuml;ckgegeben. Um dieses Behavior in der aktuellen Version von GlassFish Server zu erzielen, setzen Sie den Status des Listeners auf "Aktiviert" und den Status aller verbundenen virtuellen Server auf "Deaktiviert". Die mit einem virtuellen Server verbundenen Listener werden in der Dropdown-Liste "Netzwerk-Listener" des Servers aufgef&uuml;hrt.</p>
</dd>
<dt>Sicherheit</dt>
<dd>
<p>Bei aktivierter Option ist f&uuml;r das vom Netzwerk-Listener verwendete Protokoll Sicherheit aktiviert. Das Feld "Sicherheit" ist ein schreibgesch&uuml;tztes Feld.</p>
<p>Wenn Sie den <code>admin-listener</code> f&uuml;r den Domain Administration Server (DAS) konfigurieren, der die Konfiguration <code>server-config</code> verwendet, ist diese Option schreibgesch&uuml;tzt. Um die Sicherheit f&uuml;r diesen Listener zu aktivieren, m&uuml;ssen Sie die sichere Administration aktivieren. Siehe <a href="../../../common/en/help/ref-securityadmin.html">Sichere Administration</a>.</p>
</dd>
<dt>JK-Listener</dt>
<dd>
<p>Bei aktivierter Option unterst&uuml;tzt der Listener das Apache-Protokoll <code>mod-jk</code>. Das Protokoll <code>mod-jk</code> ist ein propriet&auml;res Kommunikations-/Netzwerkprotokoll zwischen dem Apache-Webserver <code>httpd</code> und einer Backend-Instanz von GlassFish Server. Wenn der Listener dieses Protokoll unterst&uuml;tzt, wird davon ausgegangen, dass <code>httpd</code> den gesamten statischen Content verarbeitet, w&auml;hrend alle Anforderungen von dynamischen Ressourcen (d.h. Servlets und JSPs) an den <code>mod-jk</code>-f&auml;higen Listener von GlassFish Server weitergeleitet werden, wobei das Protokoll <code>mod-jk</code> verwendet wird. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>Port</dt>
<dd>
<p>Die Nummer des Ports, auf dem der Netzwerk-Listener horcht. G&uuml;ltige Werte sind 1 bis 65535. Bei einem UNIX-System sind zum Erstellen von Sockets, die auf den Ports 1 bis 1024 horchen, Superuser-Berechtigungen erforderlich.</p>
</dd>
<dt>Adresse</dt>
<dd>
<p>Die IP-Adresse, auf der der Netzwerk-Listener horcht. Die Adresse kann als Punktepaar oder in IPv6-Notation angegeben werden. Beim Wert <code>any</code> (f&uuml;r <code>INADDR_ANY</code>) wird auf allen IP-Adressen gehorcht. Auch die Angabe eines Hostnamens ist m&ouml;glich.</p>
</dd>
<dt>Threadpool</dt>
<dd>
<p>Der mit dem Netzwerk-Listener verbundene Threadpool.</p>
</dd>
<dt>Transport</dt>
<dd>
<p>Der Transporttyp f&uuml;r den Netzwerk-Listener. Standardm&auml;&szlig;ig steht <code>tcp</code> als einziger Transporttyp zur Auswahl.</p>
</dd>
</dl>
<a id="sthref137" name="sthref137"></a>
<h5>Verwandte Aufgaben</h5>
<ul>
<li>
<p><a href="task-networklistenernew.html">So wird ein Netzwerk-Listener erstellt</a></p>
</li>
<li>
<p><a href="task-networklisteneredit.html">So wird ein Netzwerk-Listener bearbeitet</a></p>
</li>
<li>
<p><a href="task-networklistenerdelete.html">So wird ein Netzwerk-Listener gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-protocolnew.html">So wird ein Protokoll erstellt</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">So wird ein Protokoll bearbeitet</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">So werden SSL-Einstellungen f&uuml;r ein Protokoll bearbeitet</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">So werden HTTP-Einstellungen f&uuml;r ein Protokoll bearbeitet</a></p>
</li>
<li>
<p><a href="task-protocolfilecacheedit.html">So werden Dateicacheeinstellungen f&uuml;r ein Protokoll bearbeitet</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">So wird ein Protokoll gel&ouml;scht</a></p>
</li>
</ul>
<a id="sthref138" name="sthref138"></a>
<h5>Zugeh&ouml;rige asadmin-Befehle</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00046"><code>create-network-listener</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00186"><code>list-network-listeners</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00098"><code>delete-network-listener</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
