<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-virtualservernew" name="ref-virtualservernew"></a><a id="GHWEB00011" name="GHWEB00011"></a></p>

<h4><a id="sthref122" name="sthref122"></a>Neuer virtueller Server</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Auf der Seite "Neuer virtueller Server" k&ouml;nnen Sie einen virtuellen Server erstellen.</p>
<p>Die Seite "Neuer virtueller Server" umfasst die folgenden Optionen.</p>
<dl>
<dt>Name der Konfiguration</dt>
<dd>
<p>Der Name der Konfiguration, f&uuml;r die die Einstellungen auf dieser Seite angewendet werden. Dieses Feld ist schreibgesch&uuml;tzt.</p>
</dd>
<dt>ID</dt>
<dd>
<p>Intern sichtbare virtuelle Server-ID. Sie wird gegen&uuml;ber HTTP-Clients nicht offengelegt. Die Hostnamen, die gegen&uuml;ber HTTP-Clients offengelegt werden, m&uuml;ssen im Feld "Hosts" angegeben werden.</p>
</dd>
<dt>Hosts</dt>
<dd>
<p>Der Hostname oder Namen f&uuml;r den Rechner, auf dem der Server ausgef&uuml;hrt wird. Verwenden Sie entweder tats&auml;chliche oder virtuelle Hostnamen, die beim DNS-Server f&uuml;r Ihr Netzwerk registriert sind (auf einem UNIX-System in der Datei <code>/etc/hosts</code>). Der Standardwert ist der Wert der Systemeigenschaft <code>${com.sun.aas.hostName}</code>.</p>
</dd>
<dt>Status</dt>
<dd>
<p>Der gew&uuml;nschte Status f&uuml;r den virtuellen Server. Folgende Werte sind m&ouml;glich:</p>
<dl>
<dt>Ein</dt>
<dd>
<p>Der virtuelle Server ist aktiv. Dies ist der Standardwert.</p>
</dd>
<dt>Aus</dt>
<dd>
<p>Der virtuelle Server ist inaktiv. Versuche, auf den Server zuzugreifen, f&uuml;hren zum Fehlercode 404 (Ressource nicht verf&uuml;gbar).</p>
</dd>
<dt>Deaktiviert</dt>
<dd>
<p>Der virtuelle Server ist deaktiviert. Versuche, auf den Server zuzugreifen, f&uuml;hren zum Fehlercode 403 (Anforderung abgelehnt).</p>
</dd>
</dl>
</dd>
<dt>SSO</dt>
<dd>
<p>Gibt an, ob das Single Sign-On-Behavior (SSO) vom HTTP-Service &uuml;bernommen wird oder ob es aktiviert oder deaktiviert ist. Standardm&auml;&szlig;ig wird es vom HTTP-Service &uuml;bernommen. Bei aktivierter Option ist SSO f&uuml;r Webanwendungen auf diesem virtuellen Server aktiviert, die f&uuml;r dieselbe Realm konfiguriert sind. Bei deaktivierter Option ist SSO f&uuml;r diesen virtuellen Server deaktiviert, und Benutzer m&uuml;ssen sich bei jeder Anwendung auf dem virtuellen Server separat authentifizieren.</p>
</dd>
<dt>Netzwerk-Listener</dt>
<dd>
<p>Die mit diesem Server verbundenen Netzwerk-Listener (sofern vorhanden).</p>
</dd>
<dt>Standardwebmodul</dt>
<dd>
<p>Das bereitgestellte Webmodul (sofern vorhanden), das auf alle Anforderungen antworten soll, die keinem anderen auf dem virtuellen Server bereitgestellten Webmodul zugeordnet werden k&ouml;nnen. Wenn kein Standardwebmodul angegeben ist, wird das Webmodul verwendet, das einen leeren Root-Kontext aufweist. Ist kein solches Webmodul vorhanden, wird ein Standardwebmodul f&uuml;r das System erstellt und verwendet.</p>
</dd>
<dt>Logdatei</dt>
<dd>
<p>Der Pfad zu der Datei, in der Logmeldungen f&uuml;r diesen virtuellen Server angezeigt werden. Standardm&auml;&szlig;ig werden Logmeldungen unter domain-dir<code>/logs/server.log</code> gespeichert.</p>
</dd>
<dt>Docroot</dt>
<dd>
<p>Der absolute Pfad zum Root-Dokumentverzeichnis f&uuml;r den Server. Der Standardwert ist domain-dir<code>/docroot</code>.</p>
</dd>
<dt>Zugriffsprotokollierung</dt>
<dd>
<p>Gibt an, ob die Zugriffsprotokollierung vom HTTP-Service &uuml;bernommen wird oder ob sie aktiviert oder deaktiviert ist. Standardm&auml;&szlig;ig wird es vom HTTP-Service &uuml;bernommen.</p>
</dd>
<dt>Verzeichnis</dt>
<dd>
<p>Der absolute Verzeichnispfad zu den Serverzugriffslogs. Der Standardwert ist domain-dir<code>/logs/access</code>.</p>
</dd>
<dt>Weitere Eigenschaften</dt>
<dd>
<p>Weitere Eigenschaften f&uuml;r den virtuellen Server.</p>
<p>Information zu verf&uuml;gbaren Eigenschaften finden Sie unter <a href="ref-virtualserverprops.html">F&uuml;r virtuelle Server spezifische Eigenschaften</a>.</p>
</dd>
</dl>
<a id="sthref123" name="sthref123"></a>
<h5>Verwandte Aufgaben</h5>
<ul>
<li>
<p><a href="task-virtualservercreate.html">So wird ein virtueller Server erstellt</a></p>
</li>
<li>
<p><a href="task-virtualserveredit.html">So wird ein virtueller Server bearbeitet</a></p>
</li>
<li>
<p><a href="task-virtualserverdelete.html">So wird ein virtueller Server gel&ouml;scht</a></p>
</li>
</ul>
<a id="sthref124" name="sthref124"></a>
<h5>Zugeh&ouml;rige asadmin-Befehle</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00062"><code>create-virtual-server</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00207"><code>list-virtual-servers</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00113"><code>delete-virtual-server</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
