<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-webcontaineravailability" name="task-webcontaineravailability"></a><a id="GHWEB00034" name="GHWEB00034"></a></p>

<h4><a id="sthref16" name="sthref16"></a><a id="sthref17" name="sthref17"></a><a id="sthref18" name="sthref18"></a><a id="sthref19" name="sthref19"></a>So werden Verf&uuml;gbarkeitseinstellungen f&uuml;r den Webcontainer konfiguriert</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Blenden Sie in der Navigationsbaumstruktur den Knoten "Konfiguration" ein.</p>
</li>
<li>
<p>W&auml;hlen Sie die zu &auml;ndernde Konfiguration.</p>
</li>
<li>
<p>W&auml;hlen Sie unter dem Konfigurationsknoten den Knoten "Verf&uuml;gbarkeitsservice".</p>
<p>Die Seite "Verf&uuml;gbarkeitsservice" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie auf der Seite "Verf&uuml;gbarkeitsservice" auf die Registerkarte "Webcontainerverf&uuml;gbarkeit".</p>
<p>Die Seite "Webcontainer-Verf&uuml;gbarkeit" wird angezeigt.</p>
</li>
<li>
<p>Aktivieren Sie im Feld "Verf&uuml;gbarkeitsservice" das Kontrollk&auml;stchen "Aktiviert", um die Verf&uuml;gbarkeit f&uuml;r den Webcontainer zu aktivieren.</p>
<p>Um die Verf&uuml;gbarkeit aufzuheben, deaktivieren Sie das Kontrollk&auml;stchen "Aktiviert" f&uuml;r den Verf&uuml;gbarkeitsservice.</p>
</li>
<li>
<p>W&auml;hlen Sie aus der Dropdown-Liste "Persistenztyp" den Persistenzmechanismus aus.</p>
<ul>
<li>
<p>Wenn "Aktiviert" f&uuml;r den Verf&uuml;gbarkeitsservice <i>nicht</i> aktiviert ist, w&auml;hlen Sie eine der folgenden Optionen:</p>
<ul>
<li>
<p><code>memory</code> f&uuml;r keine Sessionpersistenz</p>
</li>
<li>
<p><code>file</code> f&uuml;r Sessionpersistenz basierend auf dem Dateisystem, das nicht hochverf&uuml;gbar ist</p>
</li>
</ul>
</li>
<li>
<p>Wenn "Aktiviert" f&uuml;r den Verf&uuml;gbarkeitsservice aktiviert ist, w&auml;hlen Sie <code>replicated</code> f&uuml;r die Sessionpersistenz basierend auf einem Cluster-Failover, das hochverf&uuml;gbar ist.</p>
</li>
</ul>
</li>
<li>
<p>W&auml;hlen Sie aus der Dropdown-Liste "Persistenzh&auml;ufigkeit" die H&auml;ufigkeit, mit der die HTTP-Session gespeichert wird:</p>
<ul>
<li>
<p><code>web-method</code> (Webmethode) &mdash; Der Sessionstatus wird am Ende jeder Webanforderung vor dem Senden einer Antwort an den Client gespeichert. Dieser Modus stellt am besten sicher, dass der Sessionstatus bei einem Ausfall vollst&auml;ndig aktualisiert wird. Dies ist die Standardeinstellung.</p>
</li>
</ul>
<p>Die Persistenzh&auml;ufigkeit findet nur dann Anwendung, wenn der Persistenztyp <code>replicated</code> lautet.</p>
</li>
<li>
<p>W&auml;hlen Sie aus der Dropdown-Liste "Persistenzumfang" den Umfang der HTTP-Session&auml;nderungen, die erforderlich sind, damit gespeichert werden kann:</p>
<ul>
<li>
<p><code>session</code> (Session) &mdash; Der Sessionstatus wird bei jedem Speichervorgang vollst&auml;ndig gespeichert. Dieser Modus bietet die beste M&ouml;glichkeit, um sicherzustellen, dass die Sessiondaten f&uuml;r verteilbare Webanwendungen ordnungsgem&auml;&szlig; gespeichert werden.</p>
</li>
<li>
<p><code>modified-session</code> (modifizierte Session) &mdash; Der Sessionstatus wird vollst&auml;ndig gespeichert, wenn er ge&auml;ndert wurde. Eine Session gilt als ge&auml;ndert, wenn <code>HttpSession.setAttribute()</code> oder <code>HttpSession.removeAttribute()</code> aufgerufen wurde. Es muss sichergestellt werden, dass <code>setAttribute()</code> bei jeder Attribut&auml;nderung aufgerufen wird. Dies ist keine Anforderung der Java EE-Spezifikation, sondern f&uuml;r die ordnungsgem&auml;&szlig;e Funktionsweise dieses Modus erforderlich.</p>
</li>
<li>
<p><code>modified-attribute</code> (modifiziertes Attribut) &mdash; Lediglich ge&auml;nderte Sessionattribute werden gespeichert. F&uuml;r die ordnungsgem&auml;&szlig;e Funktionsweise dieses Modus m&uuml;ssen folgende Richtlinien befolgt werden:</p>
<ul>
<li>
<p>Rufen Sie <code>setAttribute()</code> bei jeder &Auml;nderung des Sessionstatus auf.</p>
</li>
<li>
<p>Stellen Sie sicher, dass keine Querverweise zwischen Attributen vorhanden sind. Die Objektdiagramme unter den verschiedenen Attributschl&uuml;sseln werden serialisiert und separat gespeichert. Wenn zwischen den Objekten unter den verschiedenen Schl&uuml;sseln Querverweise vorhanden sind, ist keine ordnungsgem&auml;&szlig;e Serialisierung und Aufhebung der Serialisierung m&ouml;glich.</p>
</li>
<li>
<p>Verteilen Sie den Sessionstatus auf mehrere Attribute oder zumindest zwischen einem schreibgesch&uuml;tzten und einem &auml;nderbaren Attribut.</p>
</li>
</ul>
</li>
</ul>
<p>Der Persistenzgeltungsbereich findet nur dann Anwendung, wenn der Persistenztyp <code>replicated</code> lautet.</p>
</li>
<li>
<p>Aktivieren Sie im Feld "Single Sign-On-Status" das Kontrollk&auml;stchen "Aktiviert", um den Single Sign-On-Status f&uuml;r das Failover verf&uuml;gbar zu machen.</p>
<p>Um die Verf&uuml;gbarkeit des Single Sign-On-Status f&uuml;r das Failover aufzuheben, entfernen Sie das H&auml;kchen aus dem Kontrollk&auml;stchen "Single Sign-On-Status".</p>
</li>
<li>
<p>Um die Standardwerte aller Einstellungen wiederherzustellen, klicken Sie auf die Schaltfl&auml;che "Standardwerte laden".</p>
</li>
<li>
<p>Geben Sie im Abschnitt "Weitere Eigenschaften" weitere Eigenschaften an.</p>
<p>GlassFish Server definiert keine weiteren Eigenschaften f&uuml;r die Webcontainerverf&uuml;gbarkeit.</p>
<ul>
<li>
<p>Um eine Eigenschaft hinzuzuf&uuml;gen, klicken Sie auf die Schaltfl&auml;che "Eigenschaft hinzuf&uuml;gen". Geben Sie in die daraufhin angezeigte leere Zeile den Eigenschaftsnamen in das Feld "Name" und den Eigenschaftswert in das Feld "Wert" ein.</p>
</li>
<li>
<p>Um eine Eigenschaft zu &auml;ndern, bearbeiten Sie das Feld "Wert" dieser Eigenschaft.</p>
</li>
<li>
<p>Um eine Eigenschaft zu l&ouml;schen, aktivieren Sie das Kontrollk&auml;stchen links neben dem Feld "Name" der zu l&ouml;schenden Eigenschaft und klicken anschlie&szlig;end auf die Schaltfl&auml;che "Eigenschaften l&ouml;schen".</p>
</li>
</ul>
</li>
<li>
<p>Klicken Sie auf "Speichern".</p>
</li>
</ol>
<a id="sthref20" name="sthref20"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-webcontainergeneral.html">So werden allgemeine Eigenschaften f&uuml;r den Webcontainer konfiguriert</a></p>
</li>
<li>
<p><a href="task-webcontainersessiontimeout.html">So werden Sessioneigenschaften f&uuml;r den Webcontainer konfiguriert</a></p>
</li>
<li>
<p><a href="task-webcontainermanagerprops.html">So werden Managereigenschaften f&uuml;r den Webcontainer konfiguriert</a></p>
</li>
<li>
<p><a href="task-webcontainerstoreprops.html">So werden Speichereigenschaften f&uuml;r den Webcontainer konfiguriert</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
