<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-webcontainersessiontimeout" name="task-webcontainersessiontimeout"></a></p>

<h4><a id="sthref4" name="sthref4"></a><a id="sthref5" name="sthref5"></a><a id="sthref6" name="sthref6"></a>So werden Sessioneigenschaften f&uuml;r den Webcontainer konfiguriert</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Blenden Sie in der Navigationsbaumstruktur den Knoten "Konfiguration" ein.</p>
</li>
<li>
<p>W&auml;hlen Sie die zu &auml;ndernde Konfiguration.</p>
</li>
<li>
<p>W&auml;hlen Sie unter dem Konfigurationsknoten den Webcontainerknoten.</p>
<p>Die Seite "Allgemeine Eigenschaften" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie auf der Seite "Allgemeine Eigenschaften" auf die Registerkarte "Sessioneigenschaften".</p>
<p>Die Seite "Sessioneigenschaften" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Geben Sie im Feld "Sessiontimeout" die maximale Anzahl Sekunden ein, die eine inaktive Session g&uuml;ltig bleibt.</p>
<p>Der Standardwert ist 1800. Bei einem Wert kleiner oder gleich 0 laufen Sessions niemals ab.</p>
</li>
<li>
<p>Geben Sie im Abschnitt "Weitere Eigenschaften" weitere Eigenschaften an.</p>
<p>Eine Beschreibung der verf&uuml;gbaren Eigenschaften finden Sie unter <a href="ref-websessionproperties.html">F&uuml;r Webcontainersessions spezifische Eigenschaften</a>.</p>
<ul>
<li>
<p>Um eine Eigenschaft hinzuzuf&uuml;gen, klicken Sie auf die Schaltfl&auml;che "Eigenschaft hinzuf&uuml;gen". Geben Sie in die daraufhin angezeigte leere Zeile den Eigenschaftsnamen in das Feld "Name" und den Eigenschaftswert in das Feld "Wert" ein.</p>
</li>
<li>
<p>Um eine Eigenschaft zu &auml;ndern, bearbeiten Sie das Feld "Wert" dieser Eigenschaft.</p>
</li>
<li>
<p>Um eine Eigenschaft zu l&ouml;schen, aktivieren Sie das Kontrollk&auml;stchen links neben dem Feld "Name" der zu l&ouml;schenden Eigenschaft und klicken anschlie&szlig;end auf die Schaltfl&auml;che "Eigenschaften l&ouml;schen".</p>
</li>
</ul>
</li>
<li>
<p>Klicken Sie auf "Speichern".</p>

<hr>
<p><b>Tipp:</b></p>
Um zu den Standardeinstellungen zur&uuml;ckzukehren, klicken Sie auf die Schaltfl&auml;che "Standardwerte laden" und anschlie&szlig;end auf "Speichern".
<hr>

</li>
</ol>
<a id="sthref7" name="sthref7"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-webcontainergeneral.html">So werden allgemeine Eigenschaften f&uuml;r den Webcontainer konfiguriert</a></p>
</li>
<li>
<p><a href="task-webcontainermanagerprops.html">So werden Managereigenschaften f&uuml;r den Webcontainer konfiguriert</a></p>
</li>
<li>
<p><a href="task-webcontainerstoreprops.html">So werden Speichereigenschaften f&uuml;r den Webcontainer konfiguriert</a></p>
</li>
<li>
<p><a href="task-webcontaineravailability.html">So werden Verf&uuml;gbarkeitseinstellungen f&uuml;r den Webcontainer konfiguriert</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
