<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-protocolfilecacheedit" name="task-protocolfilecacheedit"></a></p>

<h4><a id="sthref62" name="sthref62"></a><a id="sthref63" name="sthref63"></a>So werden Dateicacheeinstellungen f&uuml;r ein Protokoll bearbeitet</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Blenden Sie in der Navigationsbaumstruktur den Knoten "Konfiguration" ein.</p>
</li>
<li>
<p>Blenden Sie unter dem Konfigurationsknoten den Knoten "Netzwerkkonfiguration" ein.</p>
</li>
<li>
<p>W&auml;hlen Sie unter dem Knoten "Netzwerkkonfiguration" den Knoten "Protokolle".</p>
<p>Die Seite "Protokolle" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie auf der Seite "Protokolle" auf den Namen des zu bearbeitenden Protokolls.</p>
<p>Die Seite "Protokoll bearbeiten" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie auf der Seite "Protokoll bearbeiten" auf die Registerkarte "Dateicache".</p>
<p>Die Seite "Dateicache" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>W&auml;hlen Sie das Kontrollk&auml;stchen "Status aktiviert", um den Dateicache zu aktivieren.</p>
<p>Diese Option ist standardm&auml;&szlig;ig aktiviert.</p>
</li>
<li>
<p>Geben Sie im Feld "Maximales Alter" das maximale Alter (in Sekunden) f&uuml;r einen g&uuml;ltigen Cacheeintrag ein.</p>
<p>Dieser Parameter kontrolliert, wie lange gecachte Informationen verwendet werden, nachdem eine Datei gecacht wurde. Ein Eintrag, der &auml;lter ist als das angegebene Maximalalter, wird durch einen neuen Eintrag f&uuml;r dieselbe Datei ersetzt. Wenn sich der verwendete Content nur selten &auml;ndert, erh&ouml;hen Sie diesen Wert, um die Performance zu verbessern.</p>
<p>Das optimale maximale Alter h&auml;ngt davon ab, ob die vorhandenen Dateien regelm&auml;&szlig;ig ge&auml;ndert werden. Wenn die Dateien beispielsweise vier Mal t&auml;glich in regelm&auml;&szlig;igen Abst&auml;nden ge&auml;ndert werden, k&ouml;nnen Sie das maximale Alter auf 21600 Sekunden (6 Stunden) festlegen. Andernfalls sollten Sie das maximale Alter auf den l&auml;ngsten Zeitraum einstellen, f&uuml;r den die fr&uuml;here Version einer Inhaltsdatei auf dem Server verbleiben soll, nachdem die Datei ge&auml;ndert wurde.</p>
<p>Der Standardwert ist 30.</p>
</li>
<li>
<p>Geben Sie im Feld "Maximale Cachegr&ouml;&szlig;e" die Maximalgr&ouml;&szlig;e (in Bytes) des Dateicaches auf der Festplatte an.</p>
<p>Der Standardwert ist 10485760.</p>
</li>
<li>
<p>Geben Sie im Feld "Maximale Anzahl an Dateien" die maximale Anzahl der Dateien an, die im Dateicache gespeichert werden k&ouml;nnen.</p>
<p>Wenn dieser Wert zu hoch gew&auml;hlt ist, cacht der Server selten verwendete Dateien, wodurch Arbeitsspeicher vergeudet wird. Ist dieser Wert zu niedrig eingestellt, gehen die Vorteile der Cachings verloren. Probieren Sie verschiedene Werte f&uuml;r dieses Attribut aus, um die optimale Einstellung f&uuml;r spezifische Anwendungen zu finden.</p>
<p>Der Standardwert ist 1024.</p>
</li>
<li>
<p>Klicken Sie auf "Speichern".</p>

<hr>
<p><b>Tipp:</b></p>
Um zu den Standardeinstellungen zur&uuml;ckzukehren, klicken Sie auf die Schaltfl&auml;che "Standardwerte laden" und anschlie&szlig;end auf "Speichern".
<hr>

</li>
</ol>
<a id="sthref64" name="sthref64"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-networklistenernew.html">So wird ein Netzwerk-Listener erstellt</a></p>
</li>
<li>
<p><a href="task-networklisteneredit.html">So wird ein Netzwerk-Listener bearbeitet</a></p>
</li>
<li>
<p><a href="task-networklistenerdelete.html">So wird ein Netzwerk-Listener gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-protocolnew.html">So wird ein Protokoll erstellt</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">So wird ein Protokoll bearbeitet</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">So werden SSL-Einstellungen f&uuml;r ein Protokoll bearbeitet</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">So werden HTTP-Einstellungen f&uuml;r ein Protokoll bearbeitet</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">So wird ein Protokoll gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-transportnew.html">So wird ein Transport erstellt</a></p>
</li>
<li>
<p><a href="task-transportedit.html">So wird ein Transport bearbeitet</a></p>
</li>
<li>
<p><a href="task-transportdelete.html">So wird ein Transport gel&ouml;scht</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
