<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-accesslog" name="task-accesslog"></a><a id="GHWEB00035" name="GHWEB00035"></a></p>

<h4><a id="sthref21" name="sthref21"></a><a id="sthref22" name="sthref22"></a>So wird der HTTP-Service konfiguriert</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Blenden Sie in der Navigationsbaumstruktur den Knoten "Konfiguration" ein.</p>
</li>
<li>
<p>W&auml;hlen Sie die zu &auml;ndernde Konfiguration.</p>
</li>
<li>
<p>W&auml;hlen Sie unter dem Konfigurationsknoten den Knoten "HTTP-Service".</p>
<p>Die Seite "HTTP-Service" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "SSO", um Single Sign-On standardm&auml;&szlig;ig f&uuml;r alle Webanwendungen auf allen virtuellen Servern auf diesem Server zu aktivieren, die f&uuml;r dieselbe Realm konfiguriert sind.</p>
<p>Sie k&ouml;nnen diese Einstellung f&uuml;r einen einzelnen virtuellen Server au&szlig;er Kraft setzen. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Zugriffsprotokollierung", um die Zugriffsprotokollierung f&uuml;r alle Teilelemente eines virtuellen Servers, die diese Eigenschaft nicht angeben, zu erm&ouml;glichen.</p>
<p>Wenn das Kontrollk&auml;stchen "Zugriffsprotokollierung" deaktiviert ist, wird die Zugriffsprotokollierung f&uuml;r alle Teilelemente des virtuellen Servers deaktiviert, die diese Eigenschaft nicht angeben. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Rotation", um die Logdateirotation zu erm&ouml;glichen.</p>
<p>Diese Option ist standardm&auml;&szlig;ig aktiviert.</p>
</li>
<li>
<p>W&auml;hlen Sie aus der Dropdown-Liste "Rotations-Policy" eine Rotations-Policy.</p>
<p>Die einzige verf&uuml;gbare Rotations-Policy ist <code>time</code>.</p>
</li>
<li>
<p>Geben Sie im Feld "Rotationsintervall" die Dauer (in Minuten) zwischen zwei Rotationen des Zugriffslogs ein.</p>
<p>Dieses Feld ist nur g&uuml;ltig, wenn als Rotations-Policy <code>time</code> ausgew&auml;hlt wurde. Der Standardwert ist 1.440 Minuten (24 Stunden).</p>
</li>
<li>
<p>Geben Sie im Feld "Rotationssuffix" den Zeichenfolgenwert ein, der nach der Rotation dem Logdateinamen hinzugef&uuml;gt werden soll.</p>
<p>Der Standardwert ist <code>JJJJ-MM-TT</code>.</p>
<p>Stellen Sie sicher, dass das Rotationssuffix gen&uuml;gend Werte zur Erstellung eines eindeutigen Suffixes f&uuml;r jede Logrotation enth&auml;lt. Beispiel: Wenn das Zugriffslog mehr als einmal pro Tag rotiert wird, beziehen Sie die Uhrzeit des Tages in das Rotationssuffix ein.</p>
<p>Ein eindeutiges Suffix ist erforderlich, um sicherzustellen, dass die Zugriffslogdatei bei jedem Ablauf des Rotationsintervalls rotiert wird. Sind das Rotationssuffix der neuen Zugriffslogdatei und das Rotationssuffix der vorhandenen Zugriffslogdatei identisch, wird die Datei nicht rotiert.</p>
</li>
<li>
<p>Geben Sie im Feld "Maximale Dateizahl" die maximale Anzahl rotierter Zugriffslogdateien an, die aufbewahrt werden sollen.</p>
<p>Ein negativer Wert gibt an, dass die Dateianzahl nicht begrenzt ist. Der Standardwert ist -1.</p>
</li>
<li>
<p>Geben Sie im Feld "Puffergr&ouml;&szlig;e" die Gr&ouml;&szlig;e des Zugriffslogpuffers in Byte an.</p>
<p>Ein Wert kleiner oder gleich null (0) deaktiviert die Zugriffslogpufferung. Der Standardwert ist 32768.</p>
</li>
<li>
<p>Geben Sie im Feld "Intervall f&uuml;r Schreibvorg&auml;nge" die Anzahl Sekunden an, bevor das Log auf den Datentr&auml;ger geschrieben wird.</p>
<p>Das Zugriffslog wird geschrieben, wenn der Puffer voll ist oder das Intervall abl&auml;uft. Wenn der Wert kleiner oder gleich null (0) ist, werden die Pufferdaten immer geschrieben, auch wenn der Puffer nicht voll ist. Dies bedeutet, dass die Logmeldung bei jedem Zugriff auf den Server direkt in der Datei gespeichert wird. Der Standardwert ist 300.</p>
</li>
<li>
<p>Geben Sie im Feld "Format" den Zeichenfolgenwert ein, um die folgenden Eigenschaften des Zugriffslogs anzugeben:</p>
<ul>
<li>
<p>Die Informationen, die im Zugriffslog aufzuzeichnen sind</p>
</li>
<li>
<p>Die Reihenfolge, in der die Informationen aufgezeichnet werden</p>
</li>
</ul>
<p>Der Standardwert ist:</p>
<pre>
%client.name% %auth-user-name% %datetime% %request% %status% %response.length%
</pre>
<p>Die folgenden Werte k&ouml;nnen f&uuml;r die Formatzeichenfolge verwendet werden:</p>
<dl>
<dt><code>%attribute.</code><i>name</i><code>%</code></dt>
<dd>
<p>Protokolliert den Wert (durch Aufruf der Methode <code>toString</code>) des Anforderungsattributs mit dem angegebenen <i>name</i></p>
</dd>
<dt><code>%auth-user-name%</code></dt>
<dd>
<p>Name des autorisierten Benutzers</p>
</dd>
<dt><code>%client.name%</code></dt>
<dd>
<p>Clienthostname</p>
</dd>
<dt><code>%client.dns%</code></dt>
<dd>
<p>Client-DNS</p>
</dd>
<dt><code>%cookie.</code><i>name</i><code>%</code></dt>
<dd>
<p>Der Wert des Anforderungscookies mit dem angegebenen <i>name</i></p>
</dd>
<dt><code>%cookie.value%</code></dt>
<dd>
<p>Der Wert des ersten in der Anforderung gefundenen Cookies</p>
</dd>
<dt><code>%datetime%</code></dt>
<dd>
<p>Systemdatum</p>
</dd>
<dt><code>%request%</code></dt>
<dd>
<p>Vollst&auml;ndige HTTP-Anforderungszeile</p>
</dd>
<dt><code>%status%</code></dt>
<dd>
<p>Status</p>
</dd>
<dt><code>%response.length%</code></dt>
<dd>
<p>L&auml;nge des Antwortcontents</p>
</dd>
<dt><code>%header.referer%</code></dt>
<dd>
<p>Referenzheader</p>
</dd>
<dt><code>%header.user-agent%</code></dt>
<dd>
<p>User Agent-Header</p>
</dd>
<dt><code>%http-method%</code></dt>
<dd>
<p>HTTP-Methode</p>
</dd>
<dt><code>%http-uri%</code></dt>
<dd>
<p>HTTP-URI</p>
</dd>
<dt><code>%query-str%</code></dt>
<dd>
<p>HTTP-Abfragezeichenfolge</p>
</dd>
<dt><code>%http-version%</code></dt>
<dd>
<p>HTTP-Protokollversion</p>
</dd>
<dt><code>%header.accept%</code></dt>
<dd>
<p>Accept-Header</p>
</dd>
<dt><code>%header.date%</code></dt>
<dd>
<p>Datumsheader</p>
</dd>
<dt><code>%header.if-mod-since%</code></dt>
<dd>
<p>Falls-ge&auml;ndert-seit-Header</p>
</dd>
<dt><code>%header.auth%</code></dt>
<dd>
<p>Autorisierungsheader</p>
</dd>
<dt><code>%header.</code><i>any</i><code>%</code></dt>
<dd>
<p>Jeder g&uuml;ltige HTTP-Header, der in RFC 2616 definiert ist (<code>any</code> ist ebenfalls ein g&uuml;ltiger Headerwert; dieser wird hier als Variable angegeben)</p>
</dd>
<dt><code>%session.</code><i>name</i><code>%</code></dt>
<dd>
<p>Der Wert des Sessionattributs mit dem Namen <i>name</i> oder <code>NULL-SESSION-ATTRIBUTE-</code>name, wenn das benannte Attribut in der Session nicht vorhanden ist, oder <code>NULL-SESSION</code>, wenn keine Session vorhanden ist</p>
</dd>
<dt><code>%time-taken%</code></dt>
<dd>
<p>Dauer der Verarbeitung der einzelnen Anforderungen in Millisekunden</p>
</dd>
<dt><code>%vs.id%</code></dt>
<dd>
<p>Virtuelle Server-ID</p>
</dd>
</dl>
</li>
<li>
<p>Geben Sie im Abschnitt "Weitere Eigenschaften" weitere Eigenschaften an.</p>
<p>Eine Beschreibung der verf&uuml;gbaren Eigenschaften finden Sie unter <a href="ref-httpserviceprops.html">F&uuml;r den HTTP-Service spezifische Eigenschaften</a>.</p>
<ul>
<li>
<p>Um eine Eigenschaft hinzuzuf&uuml;gen, klicken Sie auf die Schaltfl&auml;che "Eigenschaft hinzuf&uuml;gen". Geben Sie in die daraufhin angezeigte leere Zeile den Eigenschaftsnamen in das Feld "Name" und den Eigenschaftswert in das Feld "Wert" ein.</p>
</li>
<li>
<p>Um eine Eigenschaft zu &auml;ndern, bearbeiten Sie das Feld "Wert" dieser Eigenschaft.</p>
</li>
<li>
<p>Um eine Eigenschaft zu l&ouml;schen, aktivieren Sie das Kontrollk&auml;stchen links neben dem Feld "Name" der zu l&ouml;schenden Eigenschaft und klicken anschlie&szlig;end auf die Schaltfl&auml;che "Eigenschaften l&ouml;schen".</p>
</li>
</ul>
</li>
<li>
<p>Klicken Sie auf "Speichern".</p>

<hr>
<p><b>Tipp:</b></p>
Um zu den Standardeinstellungen zur&uuml;ckzukehren, klicken Sie auf die Schaltfl&auml;che "Standardwerte laden" und anschlie&szlig;end auf "Speichern".
<hr>

</li>
</ol>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
