<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-networklisteneredit" name="task-networklisteneredit"></a></p>

<h4><a id="sthref45" name="sthref45"></a>So wird ein Netzwerk-Listener bearbeitet</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Blenden Sie in der Navigationsbaumstruktur den Knoten "Konfiguration" ein.</p>
</li>
<li>
<p>Blenden Sie unter dem Konfigurationsknoten den Knoten "Netzwerkkonfiguration" ein.</p>
</li>
<li>
<p>W&auml;hlen Sie unter dem Knoten "Netzwerkkonfiguration" den Knoten "Netzwerk-Listener".</p>
<p>Die Seite "Netzwerk-Listener" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie auf der Seite "Netzwerk-Listener" auf den Namen des zu bearbeitenden Netzwerk-Listeners.</p>
<p>Die Seite "Netzwerk-Listener bearbeiten" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>W&auml;hlen Sie das vom Netzwerk-Listener verwendete Protokoll, um die Einstellungen zu &auml;ndern. Beispiel: Sie k&ouml;nnen die Sicherheit aktivieren Sie k&ouml;nnen kein anderes Protokoll w&auml;hlen.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Status aktiviert", oder entfernen Sie die Markierung, um den Status des Netzwerk-Listeners zu &auml;ndern.</p>
<p>Der Listener kann aktiviert oder deaktiviert werden. Diese Option ist standardm&auml;&szlig;ig aktiviert. Wenn der Listener deaktiviert ist, f&uuml;hren alle Versuche, eine Verbindung zum Listener herzustellen, zu einer Socket-Ausnahme (<code>java.net.ConnectException</code>).</p>
</li>
<li>
<p>Das schreibgesch&uuml;tzte Kontrollk&auml;stchen "Sicherheit aktiviert" zeigt an, ob die Sicherheit f&uuml;r das vom Netzwerk-Listener verwendete Protokoll aktiviert ist.</p>
<p>Wenn Sie den <code>admin-listener</code> f&uuml;r den Domain Administration Server (DAS) konfigurieren, der die Konfiguration <code>server-config</code> verwendet, ist diese Option schreibgesch&uuml;tzt. Um die Sicherheit f&uuml;r diesen Listener zu aktivieren, m&uuml;ssen Sie die sichere Administration aktivieren. Siehe <a href="../../../common/en/help/ref-securityadmin.html">Sichere Administration</a>.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "JK-Listener", um anzugeben, dass der Listener das Apache-Protokoll <code>mod-jk</code> unterst&uuml;tzt.</p>
<p>Das Protokoll <code>mod-jk</code> ist ein propriet&auml;res Kommunikations-/Netzwerkprotokoll zwischen dem Apache-Webserver <code>httpd</code> und einer Backend-Instanz von GlassFish Server. Wenn der Listener dieses Protokoll unterst&uuml;tzt, wird davon ausgegangen, dass <code>httpd</code> den gesamten statischen Content verarbeitet, w&auml;hrend alle Anforderungen von dynamischen Ressourcen (d.h. Servlets und JSPs) an den <code>mod-jk</code>-f&auml;higen Listener von GlassFish Server weitergeleitet werden, wobei das Protokoll <code>mod-jk</code> verwendet wird. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Geben Sie im Feld "Port" die Nummer des Ports ein, auf dem der Netzwerk-Listener horchen soll.</p>
<p>G&uuml;ltige Werte sind 1 bis 65535. Bei einem UNIX-System sind zum Erstellen von Sockets, die auf den Ports 1 bis 1024 horchen, Superuser-Berechtigungen erforderlich.</p>
</li>
<li>
<p>Geben Sie im Feld "Adresse" die IP-Adresse ein, &uuml;ber die die Verbindung zum Netzwerk-Listener hergestellt wird.</p>
<p>Die Adresse kann als Punktepaar oder in IPv6-Notation angegeben werden. Beim Wert <code>any</code> (f&uuml;r <code>INADDR_ANY</code>) wird auf allen IP-Adressen gehorcht. Auch die Angabe eines Hostnamens ist m&ouml;glich.</p>
</li>
<li>
<p>W&auml;hlen Sie aus der Dropdown-Liste "Threadpool" den Threadpool, der mit dem Netzwerk-Listener verbunden werden soll.</p>
</li>
<li>
<p>Klicken Sie auf "Speichern".</p>

<hr>
<p><b>Tipp:</b></p>
Um zu den Standardeinstellungen zur&uuml;ckzukehren, klicken Sie auf die Schaltfl&auml;che "Standardwerte laden" und anschlie&szlig;end auf "Speichern".
<hr>

</li>
</ol>
<a id="sthref46" name="sthref46"></a>
<h5>N&auml;chste Schritte</h5>
<p>In den Registerkarten "SSL", "HTTP" und "Dateicache" k&ouml;nnen Sie die Einstellungen f&uuml;r das mit dem Netzwerk-Listener verbundene Protokoll bearbeiten. Die Registerkarte "SSL" ist nur dann von Bedeutung, wenn Sie die Sicherheit f&uuml;r das Protokoll aktiviert haben.</p>
<a id="sthref47" name="sthref47"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-networklistenernew.html">So wird ein Netzwerk-Listener erstellt</a></p>
</li>
<li>
<p><a href="task-networklistenerdelete.html">So wird ein Netzwerk-Listener gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-protocolnew.html">So wird ein Protokoll erstellt</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">So wird ein Protokoll bearbeitet</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">So werden SSL-Einstellungen f&uuml;r ein Protokoll bearbeitet</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">So werden HTTP-Einstellungen f&uuml;r ein Protokoll bearbeitet</a></p>
</li>
<li>
<p><a href="task-protocolfilecacheedit.html">So werden Dateicacheeinstellungen f&uuml;r ein Protokoll bearbeitet</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">So wird ein Protokoll gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-transportnew.html">So wird ein Transport erstellt</a></p>
</li>
<li>
<p><a href="task-transportedit.html">So wird ein Transport bearbeitet</a></p>
</li>
<li>
<p><a href="task-transportdelete.html">So wird ein Transport gel&ouml;scht</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
