<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-webcontainermanagerprops" name="task-webcontainermanagerprops"></a><a id="GHWEB00032" name="GHWEB00032"></a></p>

<h4><a id="sthref8" name="sthref8"></a><a id="sthref9" name="sthref9"></a><a id="sthref10" name="sthref10"></a>So werden Managereigenschaften f&uuml;r den Webcontainer konfiguriert</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Mit dem Sessionmanager k&ouml;nnen Sie konfigurieren, wie Sessions erstellt und aufgel&ouml;st werden, wo der Sessionstatus gespeichert wird und wie viele Sessions maximal zul&auml;ssig sind.</p>
<ol>
<li>
<p>Blenden Sie in der Navigationsbaumstruktur den Knoten "Konfiguration" ein.</p>
</li>
<li>
<p>W&auml;hlen Sie die zu &auml;ndernde Konfiguration.</p>
</li>
<li>
<p>W&auml;hlen Sie unter dem Konfigurationsknoten den Webcontainerknoten.</p>
<p>Die Seite "Allgemeine Eigenschaften" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie auf der Seite "Allgemeine Eigenschaften" auf die Registerkarte "Managereigenschaften".</p>
<p>Die Seite "Managereigenschaften" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Geben Sie im Feld "Reap-Intervall" die Zeitdauer in Sekunden an, bis die Daten der inaktiven Session aus dem Speicher gel&ouml;scht werden.</p>
<p>Der Standardwert ist 60.</p>
<p>Legen Sie hierf&uuml;r einen niedrigeren Wert fest als f&uuml;r die H&auml;ufigkeit der &Auml;nderung von Sessiondaten. Beispiel: F&uuml;r ein Servlet, das die Aufrufe einer stark frequentierten Website z&auml;hlt, sollte ein m&ouml;glichst niedriger Wert festgelegt werden (1 Sekunde), da anderenfalls bei jedem Neustart des Servers die letzten Aufrufe verloren gehen k&ouml;nnten.</p>
</li>
<li>
<p>Geben Sie im Feld "Maximale Sessions" die maximale Anzahl an Sessions an, die sich im Cache befinden k&ouml;nnen.</p>
<p>Bei einem Wert -1 ist die Anzahl der Sessions unbegrenzt. Der Standardwert ist -1.</p>
<p>Nach Erreichen des Grenzwerts wird bei dem Versuch, eine neue Session zu erstellen, die Ausnahme <code>IllegalStateException</code> ausgel&ouml;st.</p>
</li>
<li>
<p>Geben Sie im Feld "Sessiondateiname" den absoluten oder relativen Pfad zu dem Verzeichnis an, in dem der Sessionstatus zwischen Anwendungsneustarts gespeichert wird, sofern die Speicherung des Status m&ouml;glich ist.</p>
<p>Wenn kein Pfad festgelegt wird, wird der Sessionstatus nicht gespeichert. Standardm&auml;&szlig;ig ist kein Pfad festgelegt.</p>
<p>Ein relativer Pfad wird relativ zum tempor&auml;ren Verzeichnis f&uuml;r diese Webanwendung angegeben.</p>
<p>Diese Einstellung findet nur dann Anwendung, wenn der Persistenztyp <code>memory</code> lautet. In <a href="task-webcontaineravailability.html">So werden Verf&uuml;gbarkeitseinstellungen f&uuml;r den Webcontainer konfiguriert</a> wird beschrieben, wie der Persistenztyp festgelegt wird.</p>
</li>
<li>
<p>Geben Sie im Abschnitt "Weitere Eigenschaften" weitere Eigenschaften an.</p>
<p>Der GlassFish Server definiert keine zus&auml;tzlichen Eigenschaften f&uuml;r den Sessionmanager.</p>
<ul>
<li>
<p>Um eine Eigenschaft hinzuzuf&uuml;gen, klicken Sie auf die Schaltfl&auml;che "Eigenschaft hinzuf&uuml;gen". Geben Sie in die daraufhin angezeigte leere Zeile den Eigenschaftsnamen in das Feld "Name" und den Eigenschaftswert in das Feld "Wert" ein.</p>
</li>
<li>
<p>Um eine Eigenschaft zu &auml;ndern, bearbeiten Sie das Feld "Wert" dieser Eigenschaft.</p>
</li>
<li>
<p>Um eine Eigenschaft zu l&ouml;schen, aktivieren Sie das Kontrollk&auml;stchen links neben dem Feld "Name" der zu l&ouml;schenden Eigenschaft und klicken anschlie&szlig;end auf die Schaltfl&auml;che "Eigenschaften l&ouml;schen".</p>
</li>
</ul>
</li>
<li>
<p>Klicken Sie auf "Speichern".</p>

<hr>
<p><b>Tipp:</b></p>
Um zu den Standardeinstellungen zur&uuml;ckzukehren, klicken Sie auf die Schaltfl&auml;che "Standardwerte laden" und anschlie&szlig;end auf "Speichern".
<hr>

</li>
</ol>
<a id="sthref11" name="sthref11"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-webcontainergeneral.html">So werden allgemeine Eigenschaften f&uuml;r den Webcontainer konfiguriert</a></p>
</li>
<li>
<p><a href="task-webcontainersessiontimeout.html">So werden Sessioneigenschaften f&uuml;r den Webcontainer konfiguriert</a></p>
</li>
<li>
<p><a href="task-webcontainerstoreprops.html">So werden Speichereigenschaften f&uuml;r den Webcontainer konfiguriert</a></p>
</li>
<li>
<p><a href="task-webcontaineravailability.html">So werden Verf&uuml;gbarkeitseinstellungen f&uuml;r den Webcontainer konfiguriert</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
