<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-httplistenernew" name="task-httplistenernew"></a></p>

<h4><a id="sthref23" name="sthref23"></a>So wird ein HTTP-Listener erstellt</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Blenden Sie in der Navigationsbaumstruktur den Knoten "Konfiguration" ein.</p>
</li>
<li>
<p>Blenden Sie unter dem Konfigurationsknoten den Knoten "HTTP-Service" ein.</p>
</li>
<li>
<p>W&auml;hlen Sie unter dem Knoten "Netzwerkkonfiguration" den Knoten "HTTP-Listener".</p>
<p>Die Seite "HTTP-Listener" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie auf der Seite "HTTP-Listener" auf "Neu".</p>
<p>Die Seite "Neuer HTTP-Listener" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Geben Sie im Feld "Name" einen Namen f&uuml;r den HTTP-Listener ein.</p>
<p>Der Name eines HTTP-Listeners darf nicht mit einer Zahl beginnen.</p>
</li>
<li>
<p>Geben Sie im Feld "Port" die Nummer des Ports ein, auf dem der HTTP-Listener horcht.</p>
<p>G&uuml;ltige Werte sind 1 bis 65535. Bei einem UNIX-System sind zum Erstellen von Sockets, die auf den Ports 1 bis 1024 horchen, Superuser-Berechtigungen erforderlich.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Status aktiviert", um den HTTP-Listener zu aktivieren.</p>
<p>Diese Option ist standardm&auml;&szlig;ig aktiviert. Wenn der Listener deaktiviert ist, f&uuml;hren alle Versuche, eine Verbindung zum Listener herzustellen, zu einer Socket-Ausnahme (<code>java.net.ConnectException</code>).</p>
<p>In Versionen vor GlassFish Server 9.1 wurde bei einem Listener, dessen Attribut "Aktiviert" auf "False" gesetzt war, f&uuml;r alle an den Listener gesendeten Anforderungen der Antwortcode 404 zur&uuml;ckgegeben. Um dieses Behavior in der aktuellen Version von GlassFish Server zu erzielen, setzen Sie den Status des Listeners auf "Aktiviert" und den Status aller verbundenen virtuellen Server auf "Deaktiviert". F&uuml;r einen virtuellen Server werden die verkn&uuml;pften Listener in der Dropdown-Liste "Netzwerk-Listener" aufgef&uuml;hrt. (Ein HTTP-Listener ist ein Netzwerk-Listener-Typ.)</p>
</li>
<li>
<p>W&auml;hlen Sie das Kontrollk&auml;stchen "Sicherheit aktiviert", um die Sicherheit f&uuml;r den HTTP-Listener zu aktivieren.</p>
<p>Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
<p>Wenn Sie den <code>admin-listener</code> f&uuml;r den Domain Administration Server (DAS) konfigurieren, der die Konfiguration <code>server-config</code> verwendet, ist diese Option schreibgesch&uuml;tzt. Um die Sicherheit f&uuml;r diesen Listener zu aktivieren, m&uuml;ssen Sie die sichere Administration aktivieren. Siehe <a href="../../../common/en/help/ref-securityadmin.html">Sichere Administration</a>.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "JK-Listener", um anzugeben, dass der Listener das Apache-Protokoll <code>mod-jk</code> unterst&uuml;tzt.</p>
<p>Das Protokoll <code>mod-jk</code> ist ein propriet&auml;res Kommunikations-/Netzwerkprotokoll zwischen dem Apache-Webserver <code>httpd</code> und einer Backend-Instanz von GlassFish Server. Wenn der Listener dieses Protokoll unterst&uuml;tzt, wird davon ausgegangen, dass <code>httpd</code> den gesamten statischen Content verarbeitet, w&auml;hrend alle Anforderungen von dynamischen Ressourcen (d.h. Servlets und JSPs) an den <code>mod-jk</code>-f&auml;higen HTTP-Listener von GlassFish Server mit dem Protokoll <code>mod-jk</code> weitergeleitet werden. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Geben Sie im Feld "Adresse" die IP-Adresse ein, auf die der HTTP-Listener horcht.</p>
<p>Die Adresse kann als Punktepaar oder in IPv6-Notation angegeben werden. Beim Wert <code>any</code> (f&uuml;r <code>INADDR_ANY</code>) wird auf allen IP-Adressen gehorcht. Auch die Angabe eines Hostnamens ist m&ouml;glich.</p>
</li>
<li>
<p>W&auml;hlen Sie aus der Dropdown-Liste "Standard-Virtual Server" den virtuellen Server, der mit diesem HTTP-Listener verkn&uuml;pft werden soll.</p>
<p>Auf der Seite "Virtuelle Server" k&ouml;nnen Sie virtuelle Server definieren.</p>
</li>
<li>
<p>W&auml;hlen Sie aus der Dropdown-Liste "Threadpool" den Threadpool, der mit dem HTTP-Listener verbunden werden soll.</p>
<p>Normalerweise w&auml;hlen Sie einen der beiden Threadpools, die bei der Installation von GlassFish Server konfiguriert werden.</p>
</li>
<li>
<p>Geben Sie im Feld "Servername" den Hostnamen ein, der in den URLs verwendet wird, die der Server an den Client sendet.</p>
<p>Dieser Name ist der Aliasname, falls Ihr Server einen Alias verwendet. Wenn Ihr Server keinen Alias verwendet, lassen Sie dieses Feld leer.</p>
<p>Dieser Wert wirkt sich auf URLs aus, die vom Server automatisch generiert werden; URLs f&uuml;r Verzeichnisse und im Server gespeicherte Dateien sind davon nicht betroffen. Wenn Ihr Server einen Alias verwendet, muss der Servername dem Aliasnamen entsprechen. Werden ein Doppelpunkt und eine Portnummer angeh&auml;ngt, wird dieser Port in URLs verwendet, die der Server an den Client sendet.</p>
</li>
<li>
<p>Klicken Sie auf "OK".</p>
</li>
</ol>
<a id="sthref24" name="sthref24"></a>
<h5>N&auml;chste Schritte</h5>
<p>Wenn Sie Sicherheit f&uuml;r den HTTP-Listener gew&auml;hlt haben, k&ouml;nnen Sie die SSL-Einstellungen des HTTP-Listeners in der Registerkarte "SSL" bearbeiten.</p>
<p>Ein HTTP-Listener ist ein Netzwerk-Listener-Typ. F&uuml;r den Zugriff auf erweiterte Features k&ouml;nnen Sie einen HTTP-Listener mit den Seiten "Netzwerk-Listener" bearbeiten.</p>
<a id="sthref25" name="sthref25"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-httplisteneredit.html">So wird ein HTTP-Listener bearbeitet</a></p>
</li>
<li>
<p><a href="task-httplistenerdelete.html">So wird ein HTTP-Listener gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-httplistenerssl.html">So werden SSL-Einstellungen f&uuml;r einen HTTP Listener bearbeitet</a></p>
</li>
<li>
<p><a href="task-virtualservercreate.html">So wird ein virtueller Server erstellt</a></p>
</li>
<li>
<p><a href="task-networklistenernew.html">So wird ein Netzwerk-Listener erstellt</a></p>
</li>
<li>
<p><a href="task-protocolhttpedit.html">So werden HTTP-Einstellungen f&uuml;r ein Protokoll bearbeitet</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
