<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-protocolhttpedit" name="task-protocolhttpedit"></a><a id="GHWEB00045" name="GHWEB00045"></a></p>

<h4><a id="sthref59" name="sthref59"></a><a id="sthref60" name="sthref60"></a>So werden HTTP-Einstellungen f&uuml;r ein Protokoll bearbeitet</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Blenden Sie in der Navigationsbaumstruktur den Knoten "Konfiguration" ein.</p>
</li>
<li>
<p>Blenden Sie unter dem Konfigurationsknoten den Knoten "Netzwerkkonfiguration" ein.</p>
</li>
<li>
<p>W&auml;hlen Sie unter dem Knoten "Netzwerkkonfiguration" den Knoten "Protokolle".</p>
<p>Die Seite "Protokolle" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie auf der Seite "Protokolle" auf den Namen des zu bearbeitenden Protokolls.</p>
<p>Die Seite "Protokoll bearbeiten" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie auf der Seite "Protokoll bearbeiten" auf die Registerkarte "HTTP".</p>
<p>Die Seite "HTTP" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Geben Sie im Feld "Servername" den Hostnamen ein, der in den URLs verwendet wird, die der Server an den Client sendet.</p>
<p>Dieser Name ist der Aliasname, falls Ihr Server einen Alias verwendet. Wenn Ihr Server keinen Alias verwendet, lassen Sie dieses Feld leer.</p>
</li>
<li>
<p>W&auml;hlen Sie aus der Dropdown-Liste "Standard-Virtual Server" den virtuellen Server aus, der mit dem Protokoll verkn&uuml;pft werden soll.</p>
<p>Auf der Seite "Virtuelle Server" k&ouml;nnen Sie virtuelle Server definieren.</p>
</li>
<li>
<p>Geben Sie in das Feld "Portumleitung" den Wert des Ports ein, der bei der Umleitung einer Anforderung an einen anderen Port verwendet werden soll.</p>
<p>GlassFish Server leitet Anforderungen automatisch weiter, wenn die folgenden zwei Bedingungen erf&uuml;llt sind:</p>
<ul>
<li>
<p>Dieses Protokoll unterst&uuml;tzt Nicht-SSL-Anforderungen.</p>
</li>
<li>
<p>Es wird eine Anforderung empfangen, f&uuml;r die ein &uuml;bereinstimmendes Sicherheits-Constraint einen SSL-Transport erfordert.</p>
</li>
</ul>
<p>Wird kein Umleitungsport angegeben, verwendet GlassFish Server die in der urspr&uuml;nglichen Anforderung angegebene Portnummer.</p>
</li>
<li>
<p>Geben Sie im Feld "Maximale Verbindungen" die maximale Anzahl der permanenten Verbindungen an, die im Keep-Alive-Modus beibehalten werden sollen.</p>
<p>Das Keep-Alive-Teilsystem ruft regelm&auml;&szlig;ig Verbindungen im Leerlaufstatus ab.</p>
</li>
<li>
<p>Geben Sie im Feld "Timeout" die maximale Anzahl Sekunden an, die eine Verbindung als im Leerlauf befindlich betrachtet und im Keep-Alive-Zustand gehalten werden kann.</p>
<p>Ein Wert kleiner oder gleich null (0) bedeutet, dass Keep-Alive-Verbindungen unbegrenzt offen gehalten werden. Der Standardwert ist 30 Sekunden.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Timeout beim Hochladen", um die Verbindung f&uuml;r ein Servlet, das Byte langsam liest, nach Erreichen des Grenzwerts f&uuml;r das Timeout beim Hochladen der Verbindung zu schlie&szlig;en.</p>
<p>Bei deaktivierter Option tritt f&uuml;r Servlet-Verbindungen kein Timeout ein. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Geben Sie im Feld "Timeout beim Hochladen der Verbindung" das Timeout beim Hochladen in Millisekunden an.</p>
<p>Dieses Feld steht nur zur Verf&uuml;gung, wenn das Kontrollk&auml;stchen "Timeout beim Hochladen" aktiviert ist. Der Standardwert ist 300.000 Millisekunden.</p>
</li>
<li>
<p>Geben Sie im Feld "Timeout f&uuml;r Anforderung" die Anzahl Sekunden ein, bevor die Anforderung wegen Timeout abgebrochen wird.</p>
<p>Wenn die Anforderung nicht vor Erreichen des Timeoutwerts verarbeitet wird, wird sie ignoriert. Der Standardwert ist 30 Sekunden.</p>
</li>
<li>
<p>Geben Sie im Feld "Gr&ouml;&szlig;e des Sendepuffers" die Gr&ouml;&szlig;e des Sendepuffers in Byte an.</p>
<p>Der Standardwert ist 8192 Byte.</p>
</li>
<li>
<p>Geben Sie im Feld "Headerpuffergr&ouml;&szlig;e" die Gr&ouml;&szlig;e (in Byte) des Puffers an, der von den Anforderungsverarbeitungsthreads zum Lesen der Anforderungsdaten verwendet wird.</p>
<p>Der Standardwert ist 8192 Byte.</p>
</li>
<li>
<p>Geben Sie im Feld "Maximale Post-Gr&ouml;&szlig;e" die maximale Gr&ouml;&szlig;e von POST-Aktionen in Byte an.</p>
<p>Der Standardwert ist 2.097.152 Byte.</p>
</li>
<li>
<p>Geben Sie im Feld "URI-Codierung" den Namen des Zeichensatzes ein, der zum Decodieren der erhaltenen Anforderungs-URIs verwendet wird.</p>
<p>Als Wert muss ein g&uuml;ltiger IANA-Zeichensatzname angegeben werden. Der Standardwert ist UTF-8.</p>
</li>
<li>
<p>Geben Sie im Feld "Version" die Version des verwendeten HTTP-Protokolls an.</p>
<p>Der Standardwert ist HTTP/1.1.</p>
</li>
<li>
<p>W&auml;hlen Sie aus der Dropdown-Liste "Komprimierung" die HTTP/1.1 GZIP-Komprimierung, um Serverbandbreite zu sparen.</p>
<p>Zur Auswahl stehen:</p>
<dl>
<dt><code>On</code></dt>
<dd>
<p>Komprimiert Daten.</p>
</dd>
<dt><code>Off</code></dt>
<dd>
<p>In der folgenden Tabelle werden diese Eigenschaften aufgelistet.</p>
</dd>
<dt><code>force</code></dt>
<dd>
<p>Erzwingt die Datenkomprimierung in allen F&auml;llen.</p>
</dd>
</dl>
<p><code>Der Standardwert ist "Off".</code></p>
</li>
<li>
<p>Geben Sie im Feld "Komprimierbare MIME-Typen" eine durch Komma getrennte Liste von MIME-Typen ein, f&uuml;r die HTTP-Komprimierung verwendet wird.</p>
<p>Der Standardwert ist <code>text/html,text/xml,text/plain</code>.</p>
</li>
<li>
<p>Geben Sie im Feld "Mindestkomprimierungsgr&ouml;&szlig;e" die minimale Gr&ouml;&szlig;e einer komprimierten Datei ein.</p>
<p>Dieser Wert muss festgelegt werden, wenn das Kontrollk&auml;stchen "Komprimierung" aktiviert wird. Der Standardwert ist 2048 Byte.</p>
</li>
<li>
<p>Geben Sie im Feld "User Agent ohne Komprimierung" eine durch Komma getrennte Liste von regul&auml;ren Ausdr&uuml;cken ein, die User Agents von HTTP-Clients entsprechen, f&uuml;r die keine Komprimierung verwendet werden soll.</p>
<p>Standardm&auml;&szlig;ig handelt es sich bei diesem Wert um eine leere Zeichenfolge.</p>
</li>
<li>
<p>Geben Sie im Feld "Beschr&auml;nkte User Agents" eine Liste von beschr&auml;nkten User Agents ein, auf die HTTP-Komprimierung angewendet wird.</p>
<p>Wenn keine User Agents angegeben werden, wird die HTTP-Komprimierung auf alle User Agents angewendet. Standardm&auml;&szlig;ig sind keine User Agents angegeben.</p>
</li>
<li>
<p>Geben Sie im Feld "Standardm&auml;&szlig;iger Antworttyp" eine Zeichenfolge ein, die den standardm&auml;&szlig;igen Antworttyp angibt.</p>
<p>Das Format ist eine durch Semikolon getrennte Zeichenfolge bestehend aus Contenttyp, Codierung, Sprache und Zeichensatz. Der Standardwert ist <code>text/html; charset=iso-8859-1</code>.</p>
</li>
<li>
<p>Geben Sie im Feld "Erzwungener Antworttyp" eine Zeichenfolge ein, die den zu verwendenden Antworttyp angibt, falls keine MIME-Zuordnung mit der Dateierweiterung &uuml;bereinstimmt.</p>
<p>Das Format ist eine durch Semikolon getrennte Zeichenfolge bestehend aus Contenttyp, Codierung, Sprache und Zeichensatz. Der Standardwert ist <code>text/html; charset=iso-8859-1</code>.</p>
</li>
<li>
<p>Geben Sie im Feld "Adapter" den Klassennamen des statischen Ressourcenadapters ein.</p>
<p>Der Standardwert ist <code>com.sun.grizzly.tcp.StaticResourcesAdapter</code>.</p>
</li>
<li>
<p>W&auml;hlen Sie das Kontrollk&auml;stchen "Comet-Unterst&uuml;tzung aktiviert", um Comet-Unterst&uuml;tzung f&uuml;r das Protokoll zu aktivieren.</p>
<p>Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "DNS-Suche", um die DNS-Suche (Domain Name System) zu aktivieren.</p>
<p>Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "RCM-Unterst&uuml;tzung", um Resource Configuration Management (RCM) zu aktivieren.</p>
<p>Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Trace", um den TRACE-Vorgang zu aktivieren.</p>
<p>Bei deaktivierter Option ist GlassFish Server weniger anf&auml;llig f&uuml;r site&uuml;bergreifende Skriptangriffe. Diese Option ist standardm&auml;&szlig;ig aktiviert.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Autorisierungsdurchlauf", um anzugeben, dass der Netzwerk-Listener, der dieses Protokoll verwendet, Daten von einem SSL-beendenden Proxyserver empf&auml;ngt.</p>
<p>Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Erstellen von Datenbl&ouml;cken", um das Erstellen von Datenbl&ouml;cken f&uuml;r HTTP-Antworten zu aktivieren.</p>
<p>Diese Option ist standardm&auml;&szlig;ig aktiviert.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "XPowered-By", um GlassFish Server anzuweisen, <code>X-Powered-By</code> -Header entsprechend den Spezifikationen f&uuml;r Java Servlet 3.0 und Java Server Pages 2.0 zu verwenden.</p>
<p>Diese Option ist standardm&auml;&szlig;ig aktiviert.</p>
</li>
<li>
<p>Klicken Sie auf "Speichern".</p>

<hr>
<p><b>Tipp:</b></p>
Um zu den Standardeinstellungen zur&uuml;ckzukehren, klicken Sie auf die Schaltfl&auml;che "Standardwerte laden" und anschlie&szlig;end auf "Speichern".
<hr>

</li>
</ol>
<a id="sthref61" name="sthref61"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-networklistenernew.html">So wird ein Netzwerk-Listener erstellt</a></p>
</li>
<li>
<p><a href="task-networklisteneredit.html">So wird ein Netzwerk-Listener bearbeitet</a></p>
</li>
<li>
<p><a href="task-networklistenerdelete.html">So wird ein Netzwerk-Listener gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-protocolnew.html">So wird ein Protokoll erstellt</a></p>
</li>
<li>
<p><a href="task-protocoledit.html">So wird ein Protokoll bearbeitet</a></p>
</li>
<li>
<p><a href="task-protocolssledit.html">So werden SSL-Einstellungen f&uuml;r ein Protokoll bearbeitet</a></p>
</li>
<li>
<p><a href="task-protocolfilecacheedit.html">So werden Dateicacheeinstellungen f&uuml;r ein Protokoll bearbeitet</a></p>
</li>
<li>
<p><a href="task-protocoldelete.html">So wird ein Protokoll gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-transportnew.html">So wird ein Transport erstellt</a></p>
</li>
<li>
<p><a href="task-transportedit.html">So wird ein Transport bearbeitet</a></p>
</li>
<li>
<p><a href="task-transportdelete.html">So wird ein Transport gel&ouml;scht</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
