<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-virtualservercreate" name="task-virtualservercreate"></a><a id="GHWEB00036" name="GHWEB00036"></a></p>

<h4><a id="sthref35" name="sthref35"></a>So wird ein virtueller Server erstellt</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Blenden Sie in der Navigationsbaumstruktur den Knoten "Konfiguration" ein.</p>
</li>
<li>
<p>W&auml;hlen Sie die zu &auml;ndernde Konfiguration.</p>
</li>
<li>
<p>W&auml;hlen Sie unter dem Konfigurationsknoten den Knoten "Virtuelle Server".</p>
<p>Die Seite "Virtuelle Server" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie auf der Seite "Virtuelle Server" auf "Neu".</p>
<p>Die Seite "Neuer virtueller Server" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Geben Sie im Feld "ID" einen Wert ein, der den virtuellen Server intern identifiziert.</p>
<p>Dieser Wert wird HTTP-Clients nicht angezeigt. Die Hostnamen, die gegen&uuml;ber HTTP-Clients offengelegt werden, m&uuml;ssen im Feld "Hosts" angegeben werden.</p>
</li>
<li>
<p>Geben Sie im Feld "Hosts" die Hostnamen oder IP-Adressen f&uuml;r den Rechner ein, auf dem der Server ausgef&uuml;hrt wird.</p>
<p>Verwenden Sie entweder tats&auml;chliche oder virtuelle Hostnamen, die beim DNS-Server f&uuml;r Ihr Netzwerk registriert sind (auf einem UNIX-System in der Datei <code>/etc/hosts</code>).</p>
<p>Der Standardwert ist der Wert der Systemeigenschaft <code>${com.sun.aas.hostName}</code>.</p>
</li>
<li>
<p>W&auml;hlen Sie die Option "Status" f&uuml;r den neuen virtuellen Server.</p>
<p>Der virtuelle Server kann den Status "Ein" (d.h. aktiv), "Aus" oder "Deaktiviert" haben. Der Standardwert ist "Ein".</p>
</li>
<li>
<p>W&auml;hlen Sie eine SSO-Option f&uuml;r den neuen virtuellen Server.</p>
<p>Standardm&auml;&szlig;ig &uuml;bernimmt ein virtueller Server die SSO-Einstellung (Single Sign-On) des HTTP-Service. W&auml;hlen Sie "Aktiviert" oder "Deaktiviert", um die HTTP-Serviceeinstellung au&szlig;er Kraft zu setzen, indem Sie SSO f&uuml;r diesen virtuellen Server aktivieren oder deaktivieren.</p>
<p>Anwendungs&uuml;bergreifendes SSO f&uuml;r GlassFish Server wird von Servlets und JSP-Dateien unterst&uuml;tzt. Dieses Feature erm&ouml;glicht es mehreren Anwendungen, f&uuml;r die dieselben Benutzeranmeldeinformationen erforderlich sind, diese Informationen gemeinsam zu nutzen. Auf diese Weise muss sich der Benutzer nicht bei jeder Anwendung einzeln anmelden.</p>
</li>
<li>
<p>W&auml;hlen Sie aus der Dropdown-Liste "Netzwerk-Listener" mindestens einen Netzwerk-Listener, oder lassen Sie das Feld leer.</p>
</li>
<li>
<p>W&auml;hlen Sie in der Dropdown-Liste "Standardwebmodul" das Modul, das auf alle Anforderungen antworten soll, die nicht anderen, dem virtuellen Server bereitgestellten Webmodulen zugeordnet werden k&ouml;nnen.</p>
<p>Wenn kein Standardwebmodul angegeben ist, wird das Webmodul verwendet, das einen leeren Kontext aufweist. Ist kein solches Webmodul vorhanden, wird ein Standardwebmodul f&uuml;r das System erstellt und verwendet.</p>
</li>
<li>
<p>Geben Sie im Feld "Logdatei" den Pfad zu der Datei ein, in der Meldungen f&uuml;r diesen virtuellen Server protokolliert werden.</p>
<p>Standardm&auml;&szlig;ig werden Logging-Meldungen im Standardserverlog domain-dir<code>/logs/server.log</code> gespeichert.</p>
</li>
<li>
<p>Geben Sie im Feld "Docroot" den absoluten Pfad zum Root-Dokumentverzeichnis des Servers ein.</p>
<p>Wenn dieses Feld leer bleibt, wird domain-dir<code>/docroot</code> verwendet.</p>
</li>
<li>
<p>Aktivieren Sie die Option "Zugriffsprotokollierung", um die Zugriffsprotokollierung zu aktivieren oder zu deaktivieren.</p>
<p>Alternativ k&ouml;nnen Sie auch angeben, ob die Zugriffsprotokollierung vom HTTP-Service &uuml;bernommen wird. Standardm&auml;&szlig;ig wird es vom HTTP-Service &uuml;bernommen.</p>
</li>
<li>
<p>Geben Sie im Feld "Verzeichnis" den absoluten Verzeichnispfad zu den Serverzugriffslogs ein.</p>
<p>Der Standardwert ist domain-dir<code>/logs/access</code>.</p>
</li>
<li>
<p>Geben Sie im Abschnitt "Weitere Eigenschaften" zus&auml;tzliche Eigenschaften f&uuml;r den virtuellen Server an.</p>
<p>Information zu verf&uuml;gbaren Eigenschaften finden Sie unter <a href="ref-virtualserverprops.html">F&uuml;r virtuelle Server spezifische Eigenschaften</a>.</p>
<p>Um eine Eigenschaft hinzuzuf&uuml;gen, klicken Sie auf die Schaltfl&auml;che "Eigenschaft hinzuf&uuml;gen". Geben Sie in die daraufhin angezeigte leere Zeile den Eigenschaftsnamen in das Feld "Name" und den Eigenschaftswert in das Feld "Wert" ein.</p>
</li>
<li>
<p>Klicken Sie auf "OK".</p>
</li>
</ol>
<a id="sthref36" name="sthref36"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-virtualserveredit.html">So wird ein virtueller Server bearbeitet</a></p>
</li>
<li>
<p><a href="task-virtualserverdelete.html">So wird ein virtueller Server gel&ouml;scht</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
