<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-executorservicenew" name="ref-executorservicenew"></a></p>

<h4>Nouveau service ex&eacute;cuteur g&eacute;r&eacute;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilisez la page Nouveau service ex&eacute;cuteur g&eacute;r&eacute; pour cr&eacute;er une ressource de service ex&eacute;cuteur g&eacute;r&eacute;.</p>
<p>Elle contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Nom JNDI</dt>
<dd>
<p>Nom unique identifiant la ressource.</p>
</dd>
<dt>Informations de contexte</dt>
<dd>
<p>Contexte de la ressource : chargeur de classe; JNDI, s&eacute;curit&eacute; ou espace de travail.</p>
</dd>
<dt>Statut</dt>
<dd>
<p>Statut de la ressource. La ressource peut &ecirc;tre activ&eacute;e ou d&eacute;sactiv&eacute;e. La valeur par d&eacute;faut est Activ&eacute;.</p>
</dd>
<dt>Priorit&eacute; des threads</dt>
<dd>
<p>Priorit&eacute; des threads &agrave; cr&eacute;er pour l'instance de service ex&eacute;cuteur g&eacute;r&eacute;. La valeur par d&eacute;faut est 5.</p>
</dd>
<dt>T&acirc;ches &agrave; longue dur&eacute;e d'ex&eacute;cution</dt>
<dd>
<p>XXX.</p>
</dd>
<dt>Bloqu&eacute; au bout de</dt>
<dd>
<p>Dur&eacute;e (en secondes) pendant laquelle une t&acirc;che peut &ecirc;tre ex&eacute;cut&eacute;e avant d'&ecirc;tre consid&eacute;r&eacute;e comme bloqu&eacute;e.</p>
</dd>
<dt>Taille de base</dt>
<dd>
<p>Nombre de threads &agrave; conserver dans un pool de threads. La valeur par d&eacute;faut est 0.</p>
</dd>
<dt>Taille maximale du pool</dt>
<dd>
<p>Nombre maximal de threads qu'un pool peut contenir. La valeur par d&eacute;faut est 2147483647.</p>
</dd>
<dt>Maintien des connexions</dt>
<dd>
<p>Dur&eacute;e (en secondes) pendant laquelle les threads peuvent rester inactifs lorsque le nombre de threads est sup&eacute;rieur &agrave; la taille de base. La valeur par d&eacute;faut est 60.</p>
</dd>
<dt>Dur&eacute;e de vie des threads</dt>
<dd>
<p>Dur&eacute;e (en secondes) pendant laquelle chaque thread reste dans un pool de threads avant sa purge, que le nombre de threads soit sup&eacute;rieur &agrave; la taille de base ou non ou que le thread soit inactif ou non.</p>
</dd>
<dt>Capacit&eacute; de la file d'attente de t&acirc;ches</dt>
<dd>
<p>Taille de la file d'attente contenant les t&acirc;ches soumises en attente d'ex&eacute;cution. La valeur par d&eacute;faut est 2147483647.</p>
</dd>
<dt>Description</dt>
<dd>
<p>Description de la ressource.</p>
</dd>
<dt>Autres propri&eacute;t&eacute;s</dt>
<dd>
<p>Propri&eacute;t&eacute;s suppl&eacute;mentaires de la ressource. GlassFish Server ne d&eacute;finit aucune autre propri&eacute;t&eacute; pour les ressources de service ex&eacute;cuteur g&eacute;r&eacute;.</p>
</dd>
</dl>
<a id="GHCON142" name="GHCON142"></a>
<h5>Commandes asadmin connexes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00022"><code>create-XXX</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00162"><code>list-XXX</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00074"><code>delete-XXX</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
