<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-contextserviceedit" name="ref-contextserviceedit"></a></p>

<h4>Modifier le service de contexte<a id="sthref19" name="sthref19"></a></h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilisez la page Modifier le service de contexte pour modifier une ressource de service de contexte.</p>
<p>Elle contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Charger les valeurs par d&eacute;faut</dt>
<dd>
<p>Bouton permettant de restaurer les valeurs par d&eacute;faut des param&egrave;tres qui en ont. Les param&egrave;tres qui n'ont pas de valeurs par d&eacute;faut ne sont pas modifi&eacute;s.</p>
</dd>
<dt>Nom JNDI</dt>
<dd>
<p>Nom JNDI unique identifiant la ressource. Par convention, le nom commence par un indicateur de type de ressource et une barre oblique, comme concurrent/, jdbc/ ou jms/. Le champ Nom JNDI est en lecture seule. Vous ne pouvez sp&eacute;cifier le nom JNDI qu'&agrave; la cr&eacute;ation d'une ressource</p>
</dd>
<dt>Nom JNDI logique</dt>
<dd>
<p>Nom JNDI logique pour la ressource. Nom standard Java EE permettant d'acc&eacute;der &agrave; la ressource. Le champ Nom JNDI logique est en lecture seule. Pour plus d'informations, reportez-vous &agrave; <a href="../../../common/en/help/ref-logicaljndinames.html">Noms JNDI logiques</a>.</p>
</dd>
<dt>Informations de contexte</dt>
<dd>
<p>Contextes &agrave; propager vers les threads : Chargeur de classe, JNDI, S&eacute;curit&eacute; ou Zone de travail. La propagation de contexte peut &ecirc;tre activ&eacute;e ou d&eacute;sactiv&eacute;e. Si elle est activ&eacute;e, les contextes s&eacute;lectionn&eacute;s sont propag&eacute;s. Si elle est d&eacute;sactiv&eacute;e, aucun des contextes n'est propag&eacute;, m&ecirc;me s'ils sont s&eacute;lectionn&eacute;s. La valeur par d&eacute;faut est Activ&eacute;, avec les quatre contextes s&eacute;lectionn&eacute;s.</p>
</dd>
<dt>Ordre de d&eacute;ploiement</dt>
<dd>
<p>Ordre de d&eacute;ploiement de cette ressource. Les ressources avec les plus petits num&eacute;ros sont charg&eacute;s en premier au d&eacute;marrage du serveur. La valeur par d&eacute;faut est 100.</p>
</dd>
<dt>Description</dt>
<dd>
<p>Description de la ressource.</p>
</dd>
<dt>Statut</dt>
<dd>
<p>Indique si la ressource est disponible lors de l'ex&eacute;cution.</p>
<p>Si seule l'instance de serveur par d&eacute;faut <code>server</code>, existe dans le domaine, la disponibilit&eacute; d'ex&eacute;cution de la ressource peut &ecirc;tre activ&eacute;e ou d&eacute;sactiv&eacute;e. La disponibilit&eacute; d'ex&eacute;cution est activ&eacute;e par d&eacute;faut.</p>
<p>Si des clusters ou des instances autonomes ont &eacute;t&eacute; cr&eacute;&eacute;s dans le domaine, utilisez l'onglet Cible pour contr&ocirc;ler la disponibilit&eacute; d'ex&eacute;cution de la ressource sur ses cibles.</p>
</dd>
<dt>Autres propri&eacute;t&eacute;s</dt>
<dd>
<p>Propri&eacute;t&eacute;s suppl&eacute;mentaires de la ressource. GlassFish Server ne d&eacute;finit aucune autre propri&eacute;t&eacute; pour ce type de ressource. De plus, ce type de ressource n'utilise actuellement aucune propri&eacute;t&eacute; suppl&eacute;mentaire.</p>
</dd>
</dl>
<a id="sthref20" name="sthref20"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-contextservicecreate.html">Cr&eacute;ation d'un service de contexte</a></p>
</li>
<li>
<p><a href="task-contextserviceedit.html">Modification d'un service de contexte</a></p>
</li>
<li>
<p><a href="task-contextservicedelete.html">Suppression d'un service de contexte</a></p>
</li>
</ul>
<a id="GHCON137" name="GHCON137"></a>
<h5>Commandes asadmin connexes</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM838"><code>create-context-service</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM865"><code>list-context-services</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM846"><code>delete-context-service</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
