<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-contextservicecreate" name="task-contextservicecreate"></a></p>

<h4>Cr&eacute;ation d'un service de contexte<a id="sthref2" name="sthref2"></a></h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Un service de contexte est utilis&eacute; pour cr&eacute;er des objets proxy dynamiques capturant le contexte d'un conteneur et permet aux applications d'&ecirc;tre ex&eacute;cut&eacute;es dans ce contexte ult&eacute;rieurement. Le contexte du conteneur est propag&eacute; vers le thread ex&eacute;cutant la t&acirc;che.</p>
<p>Dans GlassFish Server, configurez une ressource de service de contexte et rendez-la disponible pour utilisation par les composants d'application tels que les servlets et les EJB.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Ressources.</p>
</li>
<li>
<p>Sous le noeud Ressources, d&eacute;veloppez le noeud Ressources simultan&eacute;es.</p>
</li>
<li>
<p>Sous le noeud Ressources simultan&eacute;es, s&eacute;lectionnez Services de contexte.</p>
<p>La page Services de contexte est ouverte.</p>
</li>
<li>
<p>Sur la page Services de contexte, cliquez sur Nouveau.</p>
<p>La page Nouveau service de contexte est ouverte.</p>
</li>
<li>
<p>Dans le champ Nom JNDI, saisissez le nom unique qui identifie la ressource.</p>
<p>Le nom JNDI est inscrit dans le service de d&eacute;nomination JNDI et utilis&eacute; par les applications pour rechercher la ressource. Utilisez le format <code>concurrent/</code><i>name</i>. Par exemple, <code>concurrent/myContextService</code>. Le nom ne peut contenir que des caract&egrave;res alphanum&eacute;riques, des traits de soulignement, des tirets ou des points.</p>
</li>
<li>
<p>Cochez la case Informations de contexte activ&eacute;es pour propager les contextes vers des threads, puis s&eacute;lectionner les contextes que vous voulez propager.</p>
<p>Cette option est activ&eacute;e et tous les contextes sont s&eacute;lectionn&eacute;s par d&eacute;faut. Appuyez sur les touches Maj ou Ctrl pendant que vous cliquez pour s&eacute;lectionner plusieurs contextes. Si cette option est d&eacute;sactiv&eacute;e, les contextes ne sont pas propag&eacute;s, m&ecirc;me s'ils sont s&eacute;lectionn&eacute;s.</p>
</li>
<li>
<p>Dans le champ Description, entrez une br&egrave;ve description de la ressource.</p>
<p>Cette description doit se pr&eacute;senter sous la forme d'une cha&icirc;ne pouvant inclure un maximum de 250 caract&egrave;res.</p>
</li>
<li>
<p>Cochez la case Activ&eacute; du champ Statut pour activer la ressource.</p>
<p>Cette option est activ&eacute;e par d&eacute;faut, ce qui signifie que la ressource est disponible d&egrave;s sa cr&eacute;ation.</p>
</li>
<li>
<p>Dans la section Autres propri&eacute;t&eacute;s, n'ajoutez aucune propri&eacute;t&eacute; suppl&eacute;mentaire.</p>
<p>GlassFish Server ne d&eacute;finit aucune autre propri&eacute;t&eacute; pour ce type de ressource. De plus, ce type de ressource n'utilise actuellement aucune propri&eacute;t&eacute; suppl&eacute;mentaire.</p>
</li>
<li>
<p>Cliquez sur OK.</p>
</li>
</ol>
<a id="GHCON104" name="GHCON104"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-contextserviceedit.html">Modification d'un service de contexte</a></p>
</li>
<li>
<p><a href="task-contextservicedelete.html">Suppression d'un service de contexte</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
