<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-managedexecutorserviceedit" name="task-managedexecutorserviceedit"></a></p>

<h4>Modification d'un service ex&eacute;cuteur g&eacute;r&eacute;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Ressources.</p>
</li>
<li>
<p>Sous le noeud Ressources, d&eacute;veloppez le noeud Ressources simultan&eacute;es.</p>
</li>
<li>
<p>Sous le noeud Ressources simultan&eacute;es, s&eacute;lectionnez Services ex&eacute;cuteurs g&eacute;r&eacute;s.</p>
<p>La page Services ex&eacute;cuteurs g&eacute;r&eacute;s est ouverte.</p>
</li>
<li>
<p>Sur la page Services ex&eacute;cuteurs g&eacute;r&eacute;s, cliquez sur le nom de la ressource &agrave; modifier.</p>
<p>La page Modifier le service ex&eacute;cuteur g&eacute;r&eacute; est ouverte.</p>

<hr>
<p><b>Remarque:</b></p>
Le champ Nom JNDI est en lecture seule. Vous ne pouvez sp&eacute;cifier le nom JNDI qu'&agrave; la cr&eacute;ation d'une ressource.
<hr>

</li>
<li>
<p>XXX</p>
</li>
<li>
<p>Dans le champ Description, entrez une br&egrave;ve description de la ressource.</p>
<p>Cette description doit se pr&eacute;senter sous la forme d'une cha&icirc;ne pouvant inclure un maximum de 250 caract&egrave;res.</p>
</li>
<li>
<p>Cochez la case Activ&eacute; du champ Statut pour activer la ressource.</p>
</li>
<li>
<p>Dans la section Autres propri&eacute;t&eacute;s, sp&eacute;cifiez les propri&eacute;t&eacute;s suppl&eacute;mentaires de la ressource.</p>
<p>GlassFish Server ne d&eacute;finit aucune autre propri&eacute;t&eacute; pour les ressources de service ex&eacute;cuteur g&eacute;r&eacute;.</p>
<ul>
<li>
<p>Pour ajouter une propri&eacute;t&eacute;, cliquez sur le bouton Ajouter une propri&eacute;t&eacute;. Sur la ligne vide qui appara&icirc;t, saisissez le nom de la propri&eacute;t&eacute; dans le champ Nom et la valeur de la propri&eacute;t&eacute; dans le champ Valeur.</p>
</li>
<li>
<p>Pour modifier une propri&eacute;t&eacute;, modifiez le champ Valeur de cette propri&eacute;t&eacute;.</p>
</li>
<li>
<p>Pour supprimer une propri&eacute;t&eacute;, s&eacute;lectionnez la case situ&eacute;e &agrave; gauche du champ Nom de la propri&eacute;t&eacute; &agrave; supprimer, puis cliquez sur Supprimer des propri&eacute;t&eacute;s.</p>
</li>
</ul>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>
</li>
</ol>
<a id="GHCON112" name="GHCON112"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-managedexecutorservicecreate.html">Cr&eacute;ation d'un service ex&eacute;cuteur g&eacute;r&eacute;</a></p>
</li>
<li>
<p><a href="task-managedexecutorservicedelete.html">Suppression d'un service ex&eacute;cuteur g&eacute;r&eacute;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
