<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-managedthreadfactoryedit" name="task-managedthreadfactoryedit"></a></p>

<h4>Modification d'une fabrique de threads g&eacute;r&eacute;s<a id="sthref12" name="sthref12"></a></h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Ressources.</p>
</li>
<li>
<p>Sous le noeud Ressources, d&eacute;veloppez le noeud Ressources simultan&eacute;es.</p>
</li>
<li>
<p>Sous le noeud Ressources simultan&eacute;es, s&eacute;lectionnez Fabriques de threads g&eacute;r&eacute;s.</p>
<p>La page Fabriques de threads g&eacute;r&eacute;s est ouverte.</p>
</li>
<li>
<p>Sur la page Fabriques de threads g&eacute;r&eacute;s, cliquez sur le nom de la ressource &agrave; modifier.</p>
<p>La page Modifier la fabrique de threads g&eacute;r&eacute;s est ouverte.</p>

<hr>
<p><b>Remarque:</b></p>
Le champ Nom JNDI est en lecture seule. Vous ne pouvez sp&eacute;cifier le nom JNDI qu'&agrave; la cr&eacute;ation d'une ressource. Le champ Nom JNDI logique est &eacute;galement en lecture seule.
<hr>

</li>
<li>
<p>Cochez la case Informations de contexte activ&eacute;es pour propager les contextes vers des threads, puis s&eacute;lectionner les contextes que vous voulez propager.</p>
<p>Cette option est activ&eacute;e et tous les contextes sont s&eacute;lectionn&eacute;s par d&eacute;faut. Appuyez sur les touches Maj ou Ctrl pendant que vous cliquez pour s&eacute;lectionner plusieurs contextes. Si cette option est d&eacute;sactiv&eacute;e, les contextes ne sont pas propag&eacute;s, m&ecirc;me s'ils sont s&eacute;lectionn&eacute;s.</p>
</li>
<li>
<p>Cochez la case Activ&eacute; du champ Statut pour activer la ressource.</p>
<p>Cette option est activ&eacute;e par d&eacute;faut.</p>
</li>
<li>
<p>Dans le champ Priorit&eacute; des threads, saisissez la priorit&eacute; &agrave; affecter aux threads cr&eacute;&eacute;s.</p>
<p>La valeur par d&eacute;faut est 5.</p>
</li>
<li>
<p>Dans le champ Ordre de d&eacute;ploiement, saisissez un nombre pour indiquer l'ordre de d&eacute;ploiement de la ressource.</p>
<p>Les ressources avec les plus petits num&eacute;ros sont charg&eacute;s en premier au d&eacute;marrage du serveur. La valeur par d&eacute;faut est 100.</p>
</li>
<li>
<p>Dans le champ Description, entrez une br&egrave;ve description de la ressource.</p>
<p>Cette description doit se pr&eacute;senter sous la forme d'une cha&icirc;ne pouvant inclure un maximum de 250 caract&egrave;res.</p>
</li>
<li>
<p>Dans la section Autres propri&eacute;t&eacute;s, n'ajoutez aucune propri&eacute;t&eacute; suppl&eacute;mentaire.</p>
<p>GlassFish Server ne d&eacute;finit aucune autre propri&eacute;t&eacute; pour ce type de ressource. De plus, ce type de ressource n'utilise actuellement aucune propri&eacute;t&eacute; suppl&eacute;mentaire.</p>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>
</li>
</ol>
<a id="GHCON124" name="GHCON124"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="task-managedthreadfactorynew.html">Cr&eacute;ation d'une fabrique de threads g&eacute;r&eacute;s</a></p>
</li>
<li>
<p><a href="task-managedthreadfactorydelete.html">Suppression d'une fabrique de threads g&eacute;r&eacute;s</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
