common.versionextracter.appserver.string=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u30fc 
common.versionextracter.dtd_product_version_find_failured=domain.xml \u30d5\u30a1\u30a4\u30eb\u306b\u88fd\u54c1\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002

commands.DomainRunningFragment=\u7a3c\u50cd\u4e2d
commands.DomainRunningMsg=\u30c9\u30e1\u30a4\u30f3 ({0}) \u306f\u3059\u3067\u306b\u5b9f\u884c\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3092\u958b\u59cb\u3059\u308b\u524d\u306b\u3001\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u30bf\u30fc\u30b2\u30c3\u30c8\u4e0a\u306e\u3059\u3079\u3066\u306e\u30c9\u30e1\u30a4\u30f3\u3092\u505c\u6b62\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059"
commands.executingCommandMsg=\u5b9f\u884c\u4e2d\u306e\u30b3\u30de\u30f3\u30c9:  
commands.exceptionReadingStream=\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u30c4\u30fc\u30eb\u3067\u3001\u30d7\u30ed\u30bb\u30b9\u306e\u51fa\u529b\u306e\u8aad\u307f\u53d6\u308a\u4e2d\u306b\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
commands.problemFound=\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u30d7\u30ed\u30bb\u30b9\u304c\u5b8c\u4e86\u3057\u305f\u3042\u3068\u306b\u3001\u30b5\u30fc\u30d0\u30fc\u30ed\u30b0\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002


upgrade.common.log_redirect=\u30ed\u30b0\u306f\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u3055\u308c\u307e\u3059 
upgrade.common.general_exception=\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f: 
upgrade.common.upgrade_not_supported=\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u306a\u3044\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u30d1\u30b9\u3067\u3059\u3002\n\u30bd\u30fc\u30b9  \u30d0\u30fc\u30b8\u30e7\u30f3:{0} \u30d7\u30ed\u30d5\u30a1\u30a4\u30eb: {1} \n \u30bf\u30fc\u30b2\u30c3\u30c8\u30d0\u30fc\u30b8\u30e7\u30f3:{2} \u30d7\u30ed\u30d5\u30a1\u30a4\u30eb: {3}
upgrade.common.delete_directory_failed=\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306e\u524a\u9664\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: {0}
upgrade.common.delete_backedup_domain_directory_failed=\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306e\u524a\u9664\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: {0}\u3002\u30c9\u30e1\u30a4\u30f3\u30eb\u30fc\u30c8\u3067\u3001\u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u304b\u3089\u30c9\u30e1\u30a4\u30f3\u3092\u5fa9\u5143\u3057\u3066\u304f\u3060\u3055\u3044\u3002
upgrade.common.copy_directory_failed=\u30c9\u30e1\u30a4\u30f3\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306e\u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u4e2d\u306b\u81f4\u547d\u7684\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002{0} \u3092 {1} \u3078\u30b3\u30d4\u30fc\u3067\u304d\u307e\u305b\u3093\u3002
upgrade.common.make_directory_failed=\u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u30c9\u30e1\u30a4\u30f3\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306e\u4f5c\u6210\u4e2d\u306b\u81f4\u547d\u7684\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002{0} \u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093
upgrade.common.iiop_port_domain_doc=iiop-clusters \u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u306e\u30dd\u30fc\u30c8\u756a\u53f7\u3092 iiop-listener \u306b\u66f4\u65b0\u4e2d\u306b\u3001Domain \u8981\u7d20\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f

upgrade.common.domain_start_failed=\u6b21\u306e\u30c9\u30e1\u30a4\u30f3\u306e\u8d77\u52d5\u306b\u5931\u6557\u3057\u307e\u3057\u305f: {0}
#todo: unused prop search. use this as test case
upgrade.common.inplace_upgrade_not_supported=\u3053\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u306e\u30b5\u30fc\u30d0\u30fc\u306f\u3001\u30c9\u30e1\u30a4\u30f3\u306e\u30a4\u30f3\u30d7\u30ec\u30fc\u30b9\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3092\u8a31\u53ef\u3057\u307e\u305b\u3093\u3002\u30b5\u30a4\u30c9\u30d0\u30a4\u30b5\u30a4\u30c9\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u306e\u307f\u304c\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u3059\u3002

upgrade.common.start_copy_user_libs=\u30e6\u30fc\u30b6\u30fc\u30e9\u30a4\u30d6\u30e9\u30ea\u30d5\u30a1\u30a4\u30eb\u306e\u30b3\u30d4\u30fc\u3092\u958b\u59cb\u3057\u307e\u3059\u3002
upgrade.common.src_lib_dir_not_found=\u30bd\u30fc\u30b9\u30b5\u30fc\u30d0\u30fc\u306e\u30e9\u30a4\u30d6\u30e9\u30ea\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u304c\u3001{0} \u304b\u3089\u306e\u76f8\u5bfe\u4f4d\u7f6e\u3067\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
upgrade.common.trg_lib_dir_not_found=\u30bf\u30fc\u30b2\u30c3\u30c8\u30b5\u30fc\u30d0\u30fc\u306e\u30e9\u30a4\u30d6\u30e9\u30ea\u30c7\u30a3\u30ec\u30af\u30c8\u30ea {0} \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
upgrade.common.finished_copy_user_libs=\u30e6\u30fc\u30b6\u30fc\u30e9\u30a4\u30d6\u30e9\u30ea\u30d5\u30a1\u30a4\u30eb\u306e\u30b3\u30d4\u30fc\u304c\u5b8c\u4e86\u3057\u307e\u3057\u305f\u3002
upgrade.common.dir_not_found=\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093 {0}
upgrade.common.warning_user_must_copy_file=\u8b66\u544a: \u30bd\u30fc\u30b9\u30b5\u30fc\u30d0\u30fc\u306e\u30e9\u30a4\u30d6\u30e9\u30ea\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306b\u3042\u308b\u4ed6\u793e\u88fd\u306e JAR \u30d5\u30a1\u30a4\u30eb\u306f\u3059\u3079\u3066\u3001\u30bf\u30fc\u30b2\u30c3\u30c8\u30b5\u30fc\u30d0\u30fc\u306e\u30e9\u30a4\u30d6\u30e9\u30ea\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306b\u30b3\u30d4\u30fc\u3057\u3066\u304f\u3060\u3055\u3044\u3002
upgrade.common.sourceIsTarget=\u30bd\u30fc\u30b9\u30e9\u30a4\u30d6\u30e9\u30ea\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u304c\u3001\u30bf\u30fc\u30b2\u30c3\u30c8\u30e9\u30a4\u30d6\u30e9\u30ea\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u3068\u540c\u3058\u3067\u3059\u3002JAR \u30d5\u30a1\u30a4\u30eb\u3092\u30b3\u30d4\u30fc\u3059\u308b\u5fc5\u8981\u306f\u3042\u308a\u307e\u305b\u3093\u3002

upgrade.common.lib_exclude_error=\u30e9\u30a4\u30d6\u30e9\u30ea\u306e\u30d5\u30a1\u30a4\u30eb\u9664\u5916\u30a8\u30e9\u30fc {0}
upgrade.common.lib_copy_error=\u30e9\u30a4\u30d6\u30e9\u30ea\u306e\u30d5\u30a1\u30a4\u30eb\u30b3\u30d4\u30fc\u30a8\u30e9\u30fc {0}
upgrade.common.copied_dir=\u30b3\u30d4\u30fc\u3057\u305f\u30c7\u30a3\u30ec\u30af\u30c8\u30ea: {0}
upgrade.common.copied_file=\u30b3\u30d4\u30fc\u3057\u305f\u30d5\u30a1\u30a4\u30eb: {0}

enterprise.tools.upgrade.cli._invalid_option_or_value=\u7121\u52b9\u306a\u30aa\u30d7\u30b7\u30e7\u30f3\u307e\u305f\u306f\u5024: {0} {1}
enterprise.tools.upgrade.cli.not_valid_source_install=\u30bd\u30fc\u30b9\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u304c\u7121\u52b9\u3067\u3059\u3002\u7d76\u5bfe\u30d1\u30b9\u3092\u5165\u529b\u3059\u308b\u304b\u3001Ctrl \u30ad\u30fc\u3092\u62bc\u3057\u306a\u304c\u3089 C \u30ad\u30fc\u3092\u62bc\u3057\u3066\u7d42\u4e86\u3057\u3066\u304f\u3060\u3055\u3044\u3002
enterprise.tools.upgrade.cli.not_valid_target_install=\u30bf\u30fc\u30b2\u30c3\u30c8\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u304c\u7121\u52b9\u3067\u3059\u3002\u30bf\u30fc\u30b2\u30c3\u30c8\u306e\u30d1\u30b9\u3092\u5165\u529b\u3059\u308b\u304b\u3001Ctrl \u30ad\u30fc\u3092\u62bc\u3057\u306a\u304c\u3089 C \u30ad\u30fc\u3092\u62bc\u3057\u3066\u7d42\u4e86\u3057\u3066\u304f\u3060\u3055\u3044\u3002
enterprise.tools.upgrade.cli.Source_input=\u30bd\u30fc\u30b9\u30c9\u30e1\u30a4\u30f3\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044:
enterprise.tools.upgrade.cli.move_dir="{0}" \u306f\u3059\u3067\u306b\u30bf\u30fc\u30b2\u30c3\u30c8\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306b\u5b58\u5728\u3057\u3066\u3044\u307e\u3059\u3002\u540d\u524d\u3092\u5909\u66f4\u3057\u307e\u3059\u304b (y/n) ?
enterprise.tools.upgrade.cli.yes_option=y

enterprise.tools.upgrade.cli.Target_input=\u30bf\u30fc\u30b2\u30c3\u30c8\u30c9\u30e1\u30a4\u30f3\u306e\u30eb\u30fc\u30c8\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044:
enterprise.tools.upgrade.cli.MasterPW_input=\u30de\u30b9\u30bf\u30fc\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044 (\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u5834\u5408\u306f\u3001\u7a7a\u767d\u306e\u307e\u307e):
enterprise.tools.upgrade.cli.unexpectedException=\u4e88\u671f\u3057\u3066\u3044\u306a\u3044\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f:
enterprise.tools.upgrade.cli.arg_unknow_class_not_found=ARG_Unknown \u30af\u30e9\u30b9\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
enterprise.tools.upgrade.cli.invalid_option=\u4e0d\u660e\u306a\u30aa\u30d7\u30b7\u30e7\u30f3 {0}
enterprise.tools.upgrade.cli.usage=\u4f7f\u7528\u65b9\u6cd5 :
enterprise.tools.upgrade.cli.command_string=asupgrade [-c/--console] [-V/--version] [-h/--help] [-s/--source source_domain_directory] [-t/--target target_domains_root] [-m/--masterpassword mpassword] [-f/--passwordfile pwd_file_path]

enterprise.tools.upgrade.target.dir_does_not_exist=\u30bf\u30fc\u30b2\u30c3\u30c8\u30c7\u30a3\u30ec\u30af\u30c8\u30ea {0} \u304c\u5b58\u5728\u3057\u307e\u305b\u3093\u3002\u30c4\u30fc\u30eb\u306f\u3053\u306e\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u3092\u4f5c\u6210\u3057\u307e\u305b\u3093\u3002
enterprise.tools.upgrade.target.dir_domain_exist=\u30c9\u30e1\u30a4\u30f3\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u304c\u5b58\u5728\u3057\u3066\u3044\u307e\u3059: {0}\u3002\u30c4\u30fc\u30eb\u306f\u3053\u306e\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u3092\u4e0a\u66f8\u304d\u3057\u307e\u305b\u3093\u3002

enterprise.tools.upgrade.util.copyDir={0} \u3092 {1} \u306b\u30b3\u30d4\u30fc\u3057\u307e\u3059\u3002
enterprise.tools.upgrade.util.moveDir={0} \u3092 {1} \u306b\u79fb\u52d5\u3057\u307e\u3059\u3002