common.versionextracter.appserver.string=Application Server 
common.versionextracter.dtd_product_version_find_failured=No se pudo encontrar la versi\u00f3n del producto en el archivo domain.xml.

commands.DomainRunningFragment=ejecut\u00e1ndose
commands.DomainRunningMsg=El dominio ({0}) ya se est\u00e1 ejecutando. Todos los dominios del destino de actualizaci\u00f3n deben detenerse antes de comenzar la actualizaci\u00f3n"
commands.executingCommandMsg=Ejecutando comando:  
commands.exceptionReadingStream=La herramienta de actualizaci\u00f3n ha detectado una excepci\u00f3n al leer la salida del proceso.
commands.problemFound=Errores detectados durante la actualizaci\u00f3n. Consulte el registro del servidor cuando se haya completado el proceso de actualizaci\u00f3n.


upgrade.common.log_redirect=Registro redireccionado a 
upgrade.common.general_exception=Se produjo una excepci\u00f3n: 
upgrade.common.upgrade_not_supported=Ruta de actualizaci\u00f3n no admitida. \nVersi\u00f3n de origen: {0} perfil: {1} \nversi\u00f3n de destino: : {2} perfil: {3}
upgrade.common.delete_directory_failed=Se produjo un error al eliminar el directorio: {0}
upgrade.common.delete_backedup_domain_directory_failed=Se produjo un error al eliminar el directorio: {0}. Restaure el dominio desde el directorio de copia de seguridad en la ra\u00edz de dominios. 
upgrade.common.copy_directory_failed=Se ha producido un error grave al hacer la copia de seguridad del directorio del dominio. No se pudo copiar {0} en {1}
upgrade.common.make_directory_failed=Se ha producido un error grave al intentar crear el directorio del dominio de copia de seguridad. No se puede crear {0}
upgrade.common.iiop_port_domain_doc=Mientras se actualizaban los n\u00fameros de puerto de punto final de iiop-clusters a iiop-listener, no se pudo obtener el elemento de dominio

upgrade.common.domain_start_failed=No se pudo iniciar el dominio: {0}
#todo: unused prop search. use this as test case
upgrade.common.inplace_upgrade_not_supported=Esta versi\u00f3n del servidor no permite la actualizaci\u00f3n del dominio "in situ", s\u00f3lo se puede realizar una actualizaci\u00f3n paralela.

upgrade.common.start_copy_user_libs=Inicie la copia de los archivos lib del usuario.
upgrade.common.src_lib_dir_not_found=No se ha encontrado un directorio lib del servidor de origen relativo a {0}.
upgrade.common.trg_lib_dir_not_found=No se ha encontrado el directorio lib del servidor de destino {0}.
upgrade.common.finished_copy_user_libs=La copia de archivos lib del usuario ha finalizado.
upgrade.common.dir_not_found=Directorio no encontrado {0}.
upgrade.common.warning_user_must_copy_file=ADVERTENCIA: el usuario debe copiar todos los archivos jar de terceros desde el directorio lib del servidor de origen al directorio lib del servidor de destino.
upgrade.common.sourceIsTarget=El directorio lib de origen es el mismo que el directorio lib de destino. No es necesario copiar los archivos jar.

upgrade.common.lib_exclude_error=Error de archivo de exclusi\u00f3n lib {0}
upgrade.common.lib_copy_error=Error al copiar el archivo lib {0} 
upgrade.common.copied_dir=Directorio copiado: {0}
upgrade.common.copied_file=Archivo copiado: {0}

enterprise.tools.upgrade.cli._invalid_option_or_value=Opci\u00f3n o valor no v\u00e1lido: {0} {1}
enterprise.tools.upgrade.cli.not_valid_source_install=El directorio de origen no es v\u00e1lido. Introduzca una ruta de acceso absoluta o pulse Ctrl-c para salir.
enterprise.tools.upgrade.cli.not_valid_target_install=El directorio de destino no es v\u00e1lido. Introduzca una ruta de destino o pulse Ctrl-c para salir.
enterprise.tools.upgrade.cli.Source_input=Introduzca el directorio de dominio de origen:
enterprise.tools.upgrade.cli.move_dir="{0}" ya existe en el directorio de destino. \u00bfDesea cambiarle el nombre (s/n)?
enterprise.tools.upgrade.cli.yes_option=S

enterprise.tools.upgrade.cli.Target_input=Indique el directorio ra\u00edz de los dominios de destino.
enterprise.tools.upgrade.cli.MasterPW_input=Introduzca la contrase\u00f1a maestra (deje en blanco esta opci\u00f3n para utilizar la predeterminada):
enterprise.tools.upgrade.cli.unexpectedException=Se produjo una excepci\u00f3n inesperada:
enterprise.tools.upgrade.cli.arg_unknow_class_not_found=No se ha encontrado la clase ARG_Unknown.
enterprise.tools.upgrade.cli.invalid_option=Opci\u00f3n desconocida {0}
enterprise.tools.upgrade.cli.usage=Uso :
enterprise.tools.upgrade.cli.command_string=asupgrade [-c/--console] [-V/--version] [-h/--help] [-s/--source source_domain_directory] [-t/--target target_domains_root] [-m/--masterpassword mpassword] [-f/--passwordfile pwd_file_path]

enterprise.tools.upgrade.target.dir_does_not_exist=El directorio de destino {0} no existe. La herramienta no lo crear\u00e1.
enterprise.tools.upgrade.target.dir_domain_exist=Existe un directorio de dominio existente: {0}. La herramienta no lo sobrescribir\u00e1.

enterprise.tools.upgrade.util.copyDir=Copiando {0} en {1}.
enterprise.tools.upgrade.util.moveDir=Moviendo {0} a {1}.