common.versionextracter.appserver.string=Serveur d'application 
common.versionextracter.dtd_product_version_find_failured=Impossible de trouver la version du produit dans le fichier domain.xml.

commands.DomainRunningFragment=actif
commands.DomainRunningMsg=Le domaine ({0}) est d\u00e9j\u00e0 en cours d''ex\u00e9cution. Tous les domaines de la cible de la mise \u00e0 jour doivent \u00eatre arr\u00eat\u00e9s avant le d\u00e9but de la mise \u00e0 jour.
commands.executingCommandMsg=Ex\u00e9cution de la commande :  
commands.exceptionReadingStream=L''outil de mise \u00e0 niveau a d\u00e9tect\u00e9 une exception lors de la lecture de la sortie du processus.
commands.problemFound=Des erreurs se sont produites lors de la mise \u00e0 niveau. Consultez le journal du serveur une fois la mise \u00e0 niveau termin\u00e9e.


upgrade.common.log_redirect=Journal redirig\u00e9 vers 
upgrade.common.general_exception=Une exception s''est produite : 
upgrade.common.upgrade_not_supported=Chemin de mise \u00e0 niveau non pris en charge. \nversion source\u00a0: {0} profil\u00a0: {1} \nversion cible\u00a0: {2} profil\u00a0: {3}
upgrade.common.delete_directory_failed=Une erreur s''est produite lors de la suppression du r\u00e9pertoire : {0}
upgrade.common.delete_backedup_domain_directory_failed=Erreur lors de la suppression du r\u00e9pertoire : {0}. Restaurez le domaine \u00e0 partir du r\u00e9pertoire de sauvegarde sous la racine des domaines.
upgrade.common.copy_directory_failed=Erreur fatale lors de la sauvegarde du r\u00e9pertoire du domaine. Impossible de copier {0} dans {1}
upgrade.common.make_directory_failed=Erreur fatale lors de la cr\u00e9ation du r\u00e9pertoire du domaine de sauvegarde. Impossible de cr\u00e9er {0}
upgrade.common.iiop_port_domain_doc=Lors de la mise \u00e0 jour des num\u00e9ros de port des extr\u00e9mit\u00e9s des clusters iiop en fonction du listener iiop, impossible d''obtenir l''\u00e9l\u00e9ment Domain

upgrade.common.domain_start_failed=\u00c9chec du d\u00e9marrage du domaine : {0}
#todo: unused prop search. use this as test case
upgrade.common.inplace_upgrade_not_supported=Cette version du serveur n''autorise pas de mise \u00e0 niveau de domaine sur place, mais uniquement une mise \u00e0 niveau c\u00f4te \u00e0 c\u00f4te.

upgrade.common.start_copy_user_libs=D\u00e9but de la copie des fichiers lib utilisateur.
upgrade.common.src_lib_dir_not_found=R\u00e9pertoire lib du serveur source introuvable par rapport \u00e0 {0}.
upgrade.common.trg_lib_dir_not_found=R\u00e9pertoire lib du serveur cible {0} introuvable.
upgrade.common.finished_copy_user_libs=Fin de la copie des fichiers lib utilisateur.
upgrade.common.dir_not_found=R\u00e9pertoire {0} introuvable
upgrade.common.warning_user_must_copy_file=AVERTISSEMENT : l'utilisateur doit copier tous les fichiers jar tiers \u00e0 partir du r\u00e9pertoire lib du serveur source vers le m\u00eame r\u00e9pertoire sur le serveur cible.
upgrade.common.sourceIsTarget=Le r\u00e9pertoire lib source est identique au r\u00e9pertoire lib cible. Il est inutile de copier les fichiers jar.

upgrade.common.lib_exclude_error=Erreur d''exclusion du fichier lib {0}
upgrade.common.lib_copy_error=Erreur de copie du fichier lib {0}
upgrade.common.copied_dir=R\u00e9pertoire copi\u00e9 : {0}
upgrade.common.copied_file=Fichier copi\u00e9 : {0}

enterprise.tools.upgrade.cli._invalid_option_or_value=Option ou valeur incorrecte : {0} {1}
enterprise.tools.upgrade.cli.not_valid_source_install=Le r\u00e9pertoire source est incorrect. Entrez un chemin d''acc\u00e8s absolu ou appuyez sur les touches Ctrl+C pour quitter le processus.
enterprise.tools.upgrade.cli.not_valid_target_install=Le r\u00e9pertoire cible est incorrect. Entrez un chemin d''acc\u00e8s cible ou appuyez sur les touches Ctrl+C pour quitter le processus.
enterprise.tools.upgrade.cli.Source_input=Entrez le r\u00e9pertoire du domaine source :
enterprise.tools.upgrade.cli.move_dir="{0}" existe d\u00e9j\u00e0 dans le r\u00e9pertoire cible. Voulez-vous le renommer (o/n) ?
enterprise.tools.upgrade.cli.yes_option=o

enterprise.tools.upgrade.cli.Target_input=Entrez le r\u00e9pertoire racine des domaines cible :
enterprise.tools.upgrade.cli.MasterPW_input=Entrez le mot de passe principal (laissez le champ vide pour conserver la valeur par d\u00e9faut) :
enterprise.tools.upgrade.cli.unexpectedException=Une exception inattendue s''est produite :
enterprise.tools.upgrade.cli.arg_unknow_class_not_found=Classe ARG_Unknown introuvable.
enterprise.tools.upgrade.cli.invalid_option=Option {0} inconnue
enterprise.tools.upgrade.cli.usage=Utilisation :
enterprise.tools.upgrade.cli.command_string=asupgrade [-c/--console] [-V/--version] [-h/--help] [-s/--source source_domain_directory] [-t/--target target_domains_root] [-m/--masterpassword mpassword] [-f/--passwordfile pwd_file_path]

enterprise.tools.upgrade.target.dir_does_not_exist=Le r\u00e9pertoire cible {0} n''existe pas.  L''outil ne va pas le cr\u00e9er.
enterprise.tools.upgrade.target.dir_domain_exist=Un r\u00e9pertoire de domaines nomm\u00e9 {0} existe d\u00e9j\u00e0.  L''outil ne vas pas le remplacer.

enterprise.tools.upgrade.util.copyDir=Copie de {0} vers {1}.
enterprise.tools.upgrade.util.moveDir=D\u00e9placement de {0} vers {1}.