<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-gms" name="ref-gms"></a></p>

<h4><a id="sthref354" name="sthref354"></a>Group Management Service bearbeiten</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Auf der Seite "Group Management Service" k&ouml;nnen Sie die GMS-Einstellungen &auml;ndern.</p>
<p>Der Group Management Service (GMS) ist ein prozessinterner Service, der Services f&uuml;r Cluster&uuml;berwachung, Clustermitgliedschaft und Gruppenkommunikation bereitstellt. Der GMS baut auf einem konfigurierbaren Stapel von Protokollen zu Gruppenmitgliedschaftserkennung und Zustands&uuml;berwachung auf. Der GMS f&uuml;hrt folgende Funktionen aus:</p>
<ul>
<li>
<p>Benachrichtigt registrierte Module in einer GlassFish Server-Instanz, wenn mindestens eine Mitgliedsinstanz zum Cluster hinzugef&uuml;gt bzw. aus dem Cluster entfernt wurde oder bei einer Mitgliedsinstanz Fehler vermutet bzw. best&auml;tigt wurden.</p>
</li>
<li>
<p>Bietet die M&ouml;glichkeit, Nachrichten zwischen Cluster-Membern zu senden und zu empfangen.</p>
</li>
</ul>
<p>Die Seite "Group Management Service" enth&auml;lt die folgenden Optionen.</p>
<dl>
<dt>Standardeinstellungen laden</dt>
<dd>
<p>Schaltfl&auml;che zur Wiederherstellung der Standardwerte von Einstellungen, die Standardwerte haben. Einstellungen, die keine Standardwerte haben, werden nicht ge&auml;ndert.</p>
</dd>
<dt>Name der Konfiguration</dt>
<dd>
<p>Der Name der Konfiguration, f&uuml;r die die Einstellungen auf dieser Seite angewendet werden. Dieses Feld ist schreibgesch&uuml;tzt.</p>
</dd>
<dt>Maximale Anzahl nicht ausgel&ouml;ster Heartbeats</dt>
<dd>
<p>Die Anzahl nicht ausgel&ouml;ster Heartbeats eines Mitglieds, nach der ein Serverinstanzfehler vermutet wird. Der Standardwert ist 3.</p>
</dd>
<dt>Heartbeat-H&auml;ufigkeit</dt>
<dd>
<p>Der Zeitraum zwischen nicht ausgel&ouml;sten Heartbeats eines Mitglieds. Der Standardwert ist 2000 Millisekunden.</p>
</dd>
<dt>Timeout f&uuml;r Gruppenerkennung</dt>
<dd>
<p>Der Zeitraum, den der GMS wartet, bis die Erkennung anderer Cluster-Member fortgesetzt wird. Der Standardwert ist 5000 Millisekunden.</p>
</dd>
<dt>Wartezeit f&uuml;r Fehler&uuml;berpr&uuml;fung</dt>
<dd>
<p>Die Wartezeit, bevor gepr&uuml;ft wird, ob ein Mitglied, bei dem ein Fehler vermutet wird, als Fehler gemeldet werden soll. Der Standardwert ist 1500 Millisekunden.</p>
</dd>
<dt>Weitere Eigenschaften</dt>
<dd>
<p>Eine Tabelle mit weiteren Eigenschaften f&uuml;r den Group Management Service.</p>
<p>Bei GlassFish Server sind keine weiteren Eigenschaften f&uuml;r den GMS definiert.</p>
<p>F&uuml;r jede Instanz werden folgende Informationen angezeigt:</p>
<dl>
<dt>Name</dt>
<dd>
<p>Der Name der Eigenschaft.</p>
</dd>
<dt>Wert</dt>
<dd>
<p>Der Wert der Eigenschaft, der f&uuml;r die ausgew&auml;hlte Instanz festgelegt ist.</p>
</dd>
<dt>Beschreibung</dt>
<dd>
<p>Eine Textbeschreibung mit weiteren Informationen zur Eigenschaft.</p>
</dd>
</dl>
<p>Die Tabelle "Weitere Eigenschaften" enth&auml;lt dar&uuml;ber hinaus die folgenden Optionen.</p>
<dl>
<dt>Eigenschaft hinzuf&uuml;gen</dt>
<dd>
<p>Schaltfl&auml;che zum Hinzuf&uuml;gen einer Eigenschaft. Durch Klicken auf diese Schaltfl&auml;che wird eine Zeile zur Tabelle "Weitere Eigenschaften" hinzugef&uuml;gt.</p>
</dd>
<dt>Eigenschaften l&ouml;schen</dt>
<dd>
<p>Schaltfl&auml;che zum L&ouml;schen von mindestens einer ausgew&auml;hlten Eigenschaft. Eine gel&ouml;schte Eigenschaft wird auf den Standardwert zur&uuml;ckgesetzt oder, falls kein Standardwert vorhanden ist, nicht definiert.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref355" name="sthref355"></a>
<h5>Verwandte Aufgaben</h5>
<ul>
<li>
<p><a href="task-gmsenable.html">So wird der Group Management Service aktiviert</a></p>
</li>
<li>
<p><a href="task-gms.html">So wird der Group Management Service konfiguriert</a></p>
</li>
<li>
<p><a href="task-gmscluster.html">So werden Group Management Service-Einstellungen f&uuml;r ein Cluster konfiguriert</a></p>
</li>
</ul>





<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
