<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusternew" name="ref-clusternew"></a><a id="GHCLU00002" name="GHCLU00002"></a></p>

<h4><a id="sthref247" name="sthref247"></a><a id="sthref248" name="sthref248"></a>Neues Cluster</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Auf der Seite "Neues Cluster" k&ouml;nnen Sie ein neues Cluster erstellen.</p>
<p>Die Seite "Neues Cluster" umfasst die folgenden Optionen.</p>
<dl>
<dt>Clustername</dt>
<dd>
<p>Der Name des Clusters.</p>
<p>Der Name muss den folgenden Anforderungen entsprechen:</p>
<ul>
<li>
<p>Der Name darf nur ASCII-Zeichen enthalten.</p>
</li>
<li>
<p>Der Name muss mit einem Buchstaben, einer Ziffer oder einem Unterstrich beginnen.</p>
</li>
<li>
<p>Der Name darf nur die folgenden Zeichen enthalten:</p>
<ul>
<li>
<p>Kleinbuchstaben</p>
</li>
<li>
<p>Gro&szlig;buchstaben</p>
</li>
<li>
<p>Ziffern</p>
</li>
<li>
<p>Bindestriche</p>
</li>
<li>
<p>Punkte</p>
</li>
<li>
<p>Unterstriche</p>
</li>
</ul>
</li>
<li>
<p>Der Name muss in der Domain eindeutig sein und darf nicht der Name eines anderen Clusters, einer benannten Konfiguration, einer GlassFish Server-Instanz oder eines Knotens sein.</p>
</li>
<li>
<p>Bei dem Namen darf es sich nicht um <code>domain</code>, <code>server</code> oder ein anderes Schl&uuml;sselwort handeln, das von GlassFish Server reserviert ist.</p>
</li>
</ul>
</dd>
<dt>Konfiguration</dt>
<dd>
<p>Eine Dropdown-Liste der benannten Konfigurationen, die das Cluster verwenden kann. Ein Cluster ben&ouml;tigt eine benannte Konfiguration, die die Konfiguration aller Instanzen definiert, die zum Cluster hinzugef&uuml;gt werden. Sie m&uuml;ssen eine Konfiguration aus der Liste ausw&auml;hlen. Die ausgew&auml;hlte Konfiguration wird zur Erstellung des Clusters verwendet.</p>
</dd>
<dt>Kopie der ausgew&auml;hlten Konfiguration erstellen</dt>
<dd>
<p>Bei Auswahl dieser Option wird die ausgew&auml;hlte Konfiguration bei der Erstellung des Clusters kopiert. Der Kopie der Konfiguration wird der Name cluster-name<code>-config</code> zugewiesen, wobei <i>cluster-name</i> f&uuml;r den Namen des Clusters im Feld "Clustername" steht.</p>
<p>Wenn <code>default-config</code> aus der Dropdown-Liste "Konfiguration" ausgew&auml;hlt wurde, m&uuml;ssen Sie diese Option ausw&auml;hlen. Die Konfiguration <code>default-config</code> kann nur kopiert, aber nicht referenziert werden.</p>
</dd>
<dt>Auf ausgew&auml;hlte Konfiguration verweisen</dt>
<dd>
<p>Bei Auswahl dieser Option verwendet das Cluster die angegebene benannte Konfiguration.</p>
<p>Wenn <code>default-config</code> aus der Dropdown-Liste "Konfiguration" ausgew&auml;hlt wurde, d&uuml;rfen Sie diese Option <i>nicht</i> ausw&auml;hlen. Die Konfiguration <code>default-config</code> kann nicht referenziert, sondern nur kopiert werden.</p>
</dd>
<dt>Konfigurationstyp f&uuml;r Message-Queuecluster</dt>
<dd>
<p>Mit dieser Option geben Sie den Typ des Message-Queue-Brokerclusters an, der f&uuml;r das neue GlassFish Server-Cluster verwendet werden soll. Standardm&auml;&szlig;ig verwendet GlassFish Server ein herk&ouml;mmliches Message-Queue-Brokercluster mit einem Master-Broker und einem eingebetteten Broker in jeder Instanz des GlassFish Server-Clusters.</p>
<p>Wenn f&uuml;r diese Option "Benutzerdefiniert" festgelegt ist, werden verschiedene zus&auml;tzliche Optionen angezeigt, mit denen Sie das Message-Queue-Broker-Cluster konfigurieren k&ouml;nnen, das f&uuml;r das GlassFish Server-Cluster verwendet werden soll. Siehe <a href="#CHDJFEJB">Optionen f&uuml;r benutzerdefinierte Message-Queue-Broker-Cluster</a></p>
</dd>
<dt>Zu erstellende Serverinstanzen</dt>
<dd>
<p>Eine Liste der zu erstellenden GlassFish Server-Instanzen, wenn das Cluster erstellt wird. F&uuml;r jede Instanz werden die folgenden Informationen zur Verf&uuml;gung gestellt:</p>
<dl>
<dt>Instanzname</dt>
<dd>
<p>Der Name der Instanz.</p>
</dd>
<dt>Gewichtung</dt>
<dd>
<p>Eine Ganzzahl, die die Gewichtung des Load Balancings der Instanz darstellt.</p>
<p>Die Gewichtung des Load Balancings bestimmt den Anteil aller Anforderungen an das Cluster, die von der Instanz verarbeitet werden.</p>
<p>Beispiel: Bei einem Cluster mit zwei Instanzen muss eine Instanz eine von vier Anforderungen und die andere Instanz drei von vier Anforderungen verarbeiten. Definieren Sie in diesem Fall f&uuml;r die Gewichtung der Instanz, die eine von vier Anforderungen verarbeiten soll, den Wert 1 und f&uuml;r die Gewichtung der anderen Instanz den Wert 3. Wenn Sie stattdessen Prozents&auml;tze bevorzugen, legen Sie f&uuml;r die Gewichtung der Instanzen jeweils den Prozentwert 25 und 75 fest.</p>
<p>Die Standardgewichtung ist 100.</p>
</dd>
<dt>Knoten</dt>
<dd>
<p>Eine Dropdown-Liste der vorhandenen Knoten, auf denen sich die Instanz befinden kann. Sie m&uuml;ssen einen Knoten aus der Liste ausw&auml;hlen. Die Instanz befindet sich auf dem ausgew&auml;hlten Knoten, wenn das Cluster erstellt wird.</p>
</dd>
</dl>
<p>Die Tabelle "Zu erstellende Serverinstanzen" enth&auml;lt ebenfalls die folgenden Optionen.</p>
<dl>
<dt>Neu</dt>
<dd>
<p>Schaltfl&auml;che zum Erstellen einer Instanz. Wenn Sie auf diese Schaltfl&auml;che klicken, wird eine Zeile zur Tabelle "Zu erstellende Serverinstanzen" hinzugef&uuml;gt.</p>
</dd>
<dt>L&ouml;schen</dt>
<dd>
<p>Schaltfl&auml;che zum L&ouml;schen einer Instanz.</p>
</dd>
</dl>
</dd>
</dl>
<a id="CHDJFEJB" name="CHDJFEJB"></a>
<h5>Optionen f&uuml;r benutzerdefinierte Message-Queue-Broker-Cluster</h5>
<p>Wenn der Konfigurationstyp des Message-Queueclusters auf "Benutzerdefiniert" gesetzt ist, werden die folgenden Optionen zur Konfiguration des f&uuml;r das GlassFish Server-Cluster zu verwendenden Message-Queue-Broker-Clusters angezeigt.</p>
<dl>
<dt>JMS-Servicetyp</dt>
<dd>
<p>Der Typ des Brokers (in GlassFish Server JMS-Host genannt), der im Broker-Cluster verwendet werden soll. Der gew&auml;hlte Typ bestimmt, welche Broker-Clustertypen verf&uuml;gbar sind. Die folgenden Broker-Typen stehen zur Verf&uuml;gung:</p>
<dl>
<dt>Eingebettet</dt>
<dd>
<p>Konfiguration und Lebenszyklus des Brokers werden von GlassFish Server verwaltet. Jede geclusterte GlassFish-Instanz wird von einem Broker bearbeitet, der auf der gleichen JVM ausgef&uuml;hrt wird wie die Instanz.</p>
<p>Wenn die Option "JMS-Servicetyp" auf "Eingebettet" gesetzt ist, werden nur herk&ouml;mmliche Message-Queue-Broker-Cluster unterst&uuml;tzt. Optionen zur Konfiguration des herk&ouml;mmlichen Clusters werden angezeigt.</p>
</dd>
<dt>Lokal</dt>
<dd>
<p>Konfiguration und Lebenszyklus des Brokers werden von GlassFish Server verwaltet. Jede geclusterte GlassFish-Instanz wird von einem Broker bearbeitet, der in einer separaten JVM auf demselben Host wie die Instanz ausgef&uuml;hrt wird.</p>
<p>Wenn die Option "JMS-Servicetyp" auf "Lokal" gesetzt ist, werden sowohl herk&ouml;mmliche als auch erweiterte (hochverf&uuml;gbare) Message-Queue-Broker-Cluster unterst&uuml;tzt. Optionen zur Auswahl des Clustertyps und zur Konfiguration des Clusters werden angezeigt.</p>
</dd>
<dt>Remote</dt>
<dd>
<p>Konfiguration und Lebenszyklus des Brokers und Broker-Clusters werden mit den administrativen Message-Queue-Tools verwaltet.</p>
<p>Wenn die Option "JMS-Servicetyp" auf "Remote" gesetzt ist, werden keine weiteren Optionen angezeigt.</p>
</dd>
</dl>
</dd>
<dt>JMS-Clustertyp</dt>
<dd>
<p>Der Typ des Message-Queue-Broker-Clusters, der f&uuml;r das GlassFish Server-Cluster verwendet werden soll.</p>
<p>Wenn die Option "JMS-Clustertyp" auf "Herk&ouml;mmlich" gesetzt ist, werden die folgenden Optionen angezeigt.</p>
<dl>
<dt>JMS-Konfigurationsspeichertyp</dt>
<dd>
<p>Der Typ des Datenspeichers, der f&uuml;r die Konfigurationsdaten in einem herk&ouml;mmlichen Cluster verwendet wird. Ist f&uuml;r diese Option "Master-Broker" festgelegt, so wird ein Broker im Cluster als Master-Broker bestimmt, der dann die Konfigurationsdaten speichert. Ist f&uuml;r diese Option "Gemeinsam verwendete DB" festgelegt, werden die Konfigurationsdaten in einem JDBC-Datenspeicher gespeichert, der f&uuml;r alle Broker zug&auml;nglich ist. In diesem Fall werden datenbankbezogene Optionen angezeigt.</p>
</dd>
<dt>JMS-Nachrichtenspeichertyp</dt>
<dd>
<p>Der Typ des Datenspeichers, den jeder Broker zur Speicherung seiner Nachrichtendaten verwendet. Ist f&uuml;r diese Option "Datei" festgelegt, speichert jeder Broker seine Nachrichtendaten in einem dateibasierten Datenspeicher. Ist f&uuml;r diese Option "JDBC" festgelegt, speichert jeder Broker seine Nachrichtendaten in einem JDBC-Datenspeicher.</p>
</dd>
</dl>
<p>Wenn die Option "JMS-Clustertyp" auf "Erweitert (HA)" gesetzt ist, werden die datenbankbezogenen Optionen angezeigt.</p>
</dd>
<dt>Datenbankanbieter</dt>
<dt>Datenbank-URL</dt>
<dt>Datenbankbenutzer</dt>
<dd>
<p>Anbieter, Zugriffs-URL und Benutzer der JDBC-Datenbank f&uuml;r die Verwendung in folgenden F&auml;llen:</p>
<ul>
<li>
<p>Wenn der Konfigurationsspeichertyp eines herk&ouml;mmlichen Clusters auf "Gemeinsam verwendete DB" gesetzt ist</p>
</li>
<li>
<p>Wenn der Nachrichtenspeichertyp eines herk&ouml;mmlichen Clusters auf "JDBC" gesetzt ist</p>
</li>
<li>
<p>Wenn der Clustertyp auf "Erweitert (HA)" gesetzt ist</p>
</li>
</ul>
<p>Weitere Informationen &uuml;ber unterst&uuml;tzte Hersteller und die Formate der Zugriffs-URLs f&uuml;r jeden Hersteller finden Sie in <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GMADG00244">JDBC-Based Persistence</a> im <i>Oracle GlassFish Server Message Queue Administration Guide</i>.</p>
</dd>
<dt>Datenbankauthentifizierung</dt>
<dt>Datenbankkennwort</dt>
<dt>Kennwortalias</dt>
<dd>
<p>Die unter "Datenbankbenutzer" angegebenen Kennwortinformationen f&uuml;r den Benutzer der JDBC-Datenbank.</p>
<p>Wenn "Datenbankauthentifizierung" auf "Kennwort" gesetzt ist, wird die Option "Datenbankkennwort" angezeigt. Wenn "Datenbankauthentifizierung" auf "Kennwortalias" gesetzt ist, wird die Option "Kennwortalias" angezeigt.</p>
</dd>
<dt>JMS-Clustereigenschaften</dt>
<dd>
<p>Eine Liste mit mindestens einer Eigenschaft des Message-Queue-Brokers zur Konfiguration der Broker. Die durch Doppelpunkte (<code>:</code>) getrennte Liste hat das folgende Format:</p>
<pre>
<i>prop1Name</i>=<i>prop1Value</i>:<i>prop2Name</i>=<i>prop2Value</i>:...
</pre>
<p>Wenn der Name einer Broker-Eigenschaft Punkte enth&auml;lt, stellen Sie den Punkten zwei umgekehrte Schr&auml;gstriche (<code>\\</code>) voran. Beispiel: Um die Eigenschaft <code>imq.system.max_count</code> einzubeziehen, geben Sie in der Liste <code>imq\\.system\\.max_count</code> an.</p>
</dd>
</dl>
<a id="sthref249" name="sthref249"></a>
<h5>Verwandte Aufgaben</h5>
<p><a href="task-create-cluster.html">So wird ein Cluster erstellt</a></p>
<a id="sthref250" name="sthref250"></a>
<h5>Entsprechender asadmin-Unterbefehl</h5>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00017"><code>create-cluster</code>(1)</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
