<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clustergeneral" name="ref-clustergeneral"></a></p>

<h4><a id="sthref251" name="sthref251"></a><a id="sthref252" name="sthref252"></a><a id="sthref253" name="sthref253"></a><a id="sthref254" name="sthref254"></a>Allgemeine Informationen</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Die Seite "Allgemeine Informationen" enth&auml;lt die folgenden Optionen.</p>
<dl>
<dt>Cluster starten</dt>
<dd>
<p>Schaltfl&auml;che zum Starten des Clusters. Wenn alle Instanzen im Cluster ausgef&uuml;hrt werden, ist diese Schaltfl&auml;che deaktiviert.</p>
</dd>
<dt>Cluster anhalten</dt>
<dd>
<p>Schaltfl&auml;che zum Anhalten des Clusters. Wenn alle Instanzen im Cluster angehalten werden, ist diese Schaltfl&auml;che deaktiviert.</p>
</dd>
<dt>EJB-Timer migrieren</dt>
<dd>
<p>Schaltfl&auml;che zum Migrieren von Timern der Enterprise JavaBeans (EJB)-Technologie von einer angehaltenen GlassFish Server-Instanz auf eine ausgef&uuml;hrte Instanz im Cluster. Wenn Sie auf diese Schaltfl&auml;che klicken, wird die Seite <a href="ref-migrateejbtimers.html">EJB-Timer migrieren</a> ge&ouml;ffnet. Wenn alle Instanzen im Cluster ausgef&uuml;hrt werden, ist diese Schaltfl&auml;che deaktiviert.</p>
</dd>
<dt>Log rotieren</dt>
<dd>
<p>Schaltfl&auml;che zum Rotieren der Logdatei f&uuml;r das Cluster. Beim Rotieren der Logdatei wird die Datei mit einem Zeitstempelnamen im Format <code>server.log;</code> <i>date-and-time</i> umbenannt und eine leere Logdatei wird f&uuml;r neue Logmeldungen erstellt. Die &Auml;nderungen werden dynamisch angewendet. Ein Neustarten des Servers ist nicht erforderlich.</p>
</dd>
<dt>Clustername</dt>
<dd>
<p>Der Name, der dem Cluster bei der Erstellung zugewiesen wurde. Dieses Feld ist schreibgesch&uuml;tzt.</p>
</dd>
<dt>JVM</dt>
<dd>
<p>Wenn Sie auf einen JVM-Bericht klicken, wird ein separates Fenster ge&ouml;ffnet, das Berichte &uuml;ber die Java Virtual Machine anzeigt, einschlie&szlig;lich eines zusammenfassenden Berichts, Speichermanagement- und Garbage Collection-Berichts, Class Loading-Berichts und einem aktuellen Threaddump.</p>
</dd>
<dt>Konfiguration</dt>
<dd>
<p>Die Konfiguration, die f&uuml;r das Cluster bei der Erstellung ausgew&auml;hlt wurde. Durch Klicken auf die Konfiguration wird die Seite <a href="../../../common/en/help/ref-configuration.html">Konfigurationen</a> f&uuml;r das Cluster ge&ouml;ffnet. Dieses Feld ist schreibgesch&uuml;tzt.</p>
</dd>
<dt>GMS</dt>
<dd>
<p>Wenn diese Option aktiviert ist, wird der Group Management Service (GMS) in jeder GlassFish Server-Instanz im Cluster und im Domainadministrationsserver (DAS, Domain Administration Server) gestartet. Der DAS ist an jedem Cluster beteiligt, f&uuml;r den GMS aktiviert ist. GMS bietet Services f&uuml;r Cluster&uuml;berwachung, Clustermitgliedschaft und Gruppenkommunikation. Diese Option ist standardm&auml;&szlig;ig aktiviert.</p>
</dd>
<dt>Multicast-Port</dt>
<dd>
<p>Die Portnummer des Kommunikationsports, auf dem GMS auf Gruppenereignisse horcht. Bei dieser Option muss eine g&uuml;ltige Portnummer im Bereich 2048-49151 angegeben sein. Der Standardwert wird automatisch in diesem Bereich generiert.</p>
</dd>
<dt>Multicast-Adresse</dt>
<dd>
<p>Die Adresse, auf der der GMS auf Gruppenereignisse horcht. Diese Option muss eine Multicast-Adresse im Bereich von 224.0.0.0 bis 239.255.255.255 angeben. Der Standardwert ist 228.9.<i>XX</i>. <i>YY</i>. Dabei stehen <i>XX</i> und <i>YY</i> f&uuml;r automatisch generierte unabh&auml;ngige Werte zwischen 0 und 255.</p>
</dd>
<dt>Schnittstellenadresse binden</dt>
<dd>
<p>Die IP-(Internet Protocol-)Adresse der Netzwerkschnittstelle, zu der der GMS eine Verbindung herstellt. Bei dieser Option muss die IP-Adresse einer lokalen Netzwerkschnittstelle angegeben werden. Standardm&auml;&szlig;ig werden alle &ouml;ffentlichen Netzwerkschnittstellenadressen angegeben.</p>
<p>Bei mehrfach vernetzten (Multihomed) Rechnern wird durch diese Option die Netzwerkschnittstelle konfiguriert, die f&uuml;r den GMS verwendet wird. Ein mehrfach vernetzter Rechner verf&uuml;gt &uuml;ber mindestens zwei Netzwerkschnittstellen.</p>
<p>Um eine Adresse anzugeben, die f&uuml;r alle GlassFish Server-Instanzen im Cluster g&uuml;ltig ist, verwenden Sie eine Systemeigenschaft, mit der die Adresse einzeln f&uuml;r jede Instanz festgelegt werden kann.</p>
<p>Beispiel: Verwenden Sie die Seite <a href="ref-clustersystemproperties.html">Clustersystemeigenschaften</a>, um die Systemeigenschaft GMS-BIND-INTERFACE-ADDRESS-<i>cluster-name</i> zu erstellen. Setzen Sie anschlie&szlig;end die Option f&uuml;r die Bind-Adresse auf dieser Seite auf <code>${GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i><code>}</code>, um die Systemeigenschaft anzugeben. Legen Sie abschlie&szlig;end f&uuml;r jede Instanz im Cluster die Systemeigenschaft <code>GMS-BIND-INTERFACE-ADDRESS-</code> <i>cluster-name</i> auf die erforderliche Netzwerkschnittstellenadresse im Rechner der Instanz fest.</p>
</dd>
<dt>Status</dt>
<dd>
<p>Gibt die Anzahl der Instanzen im Cluster an, die ausgef&uuml;hrt und nicht ausgef&uuml;hrt werden. Dieses Feld ist schreibgesch&uuml;tzt.</p>
</dd>
</dl>
<a id="sthref255" name="sthref255"></a>
<h5>Verwandte Aufgaben</h5>
<ul>
<li>
<p><a href="task-gmscluster.html">So werden Group Management Service-Einstellungen f&uuml;r ein Cluster konfiguriert</a></p>
</li>
<li>
<p><a href="task-migrate-ejb-timers.html">So werden EJB-Timer migriert</a></p>
</li>
</ul>
<a id="sthref256" name="sthref256"></a>
<h5>Entsprechende asadmin-Unterbefehle</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00138"><code>generate-jvm-report</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00211"><code>migrate-timers</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00224"><code>rotate-log</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
