<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-nodeedit" name="ref-nodeedit"></a></p>

<h4><a id="sthref313" name="sthref313"></a>Knoten bearbeiten</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Auf der Seite "Knoten bearbeiten" k&ouml;nnen Sie die Konfigurationsdaten eines GlassFish Server-Knotens aktualisieren. Au&szlig;erdem k&ouml;nnen Sie auf dieser Seite den Knotentyp von CONFIG in DCOM oder SSH &auml;ndern, um die Remote-Kommunikation f&uuml;r den Knoten zu erm&ouml;glichen.</p>
<p>Nach dem &Auml;ndern des Knotentyps von CONFIG in DCOM werden die Standardwerte angewendet, wenn eines der folgenden Felder leer ist:</p>
<ul>
<li>
<p>Windows-Domain</p>
</li>
<li>
<p>Windows-Benutzer</p>
</li>
</ul>
<p>Nach dem &Auml;ndern des Knotentyps von CONFIG in SSH werden die Standardwerte angewendet, wenn eines der folgenden Felder leer ist:</p>
<ul>
<li>
<p>SSH-Port</p>
</li>
<li>
<p>Benutzername</p>
</li>
<li>
<p>Schl&uuml;sseldatei</p>
</li>
</ul>
<p>Die Optionen auf der Seite "Knoten bearbeiten" h&auml;ngen vom Typ des Knotens ab.</p>
<a id="sthref314" name="sthref314"></a>
<h5>Optionen f&uuml;r alle Knotenarten</h5>
<p>Die folgenden Optionen sind f&uuml;r alle Knotentypen verf&uuml;gbar:</p>
<dl>
<dt>Name</dt>
<dd>
<p>Der Name, der dem Knoten bei der Erstellung zugewiesen wurde. Dieses Feld ist schreibgesch&uuml;tzt.</p>
</dd>
<dt>Typ</dt>
<dd>
<p>Dropdown-Liste f&uuml;r die Angabe des Knotentyps. Folgende Typen sind verf&uuml;gbar:</p>
<dl>
<dt>CONFIG</dt>
<dd>
<p>Der Knoten unterst&uuml;tzt keine Remote-Kommunikation. Wenn CONFIG ausgew&auml;hlt ist, werden keine Optionen f&uuml;r die DCOM- oder SSH-Konfiguration angezeigt. Wenn der aktuelle Knotentyp SSH ist und Sie CONFIG, DCOM oder SSH ausw&auml;hlen, werden beim Speichern der &Auml;nderungen die Konfigurationsdaten aus der Knotenkonfiguration entfernt.</p>
</dd>
<dt>DCOM</dt>
<dd>
<p>Der Knoten unterst&uuml;tzt die Kommunikation &uuml;ber das Distributed Component Object Model-(DCOM-)Remote-Protokoll. Das DCOM-Protokoll ist nur auf Windows-Systemen verf&uuml;gbar.</p>
</dd>
<dt>SSH</dt>
<dd>
<p>Der Knoten unterst&uuml;tzt die Kommunikation &uuml;ber Secure Shell (SSH).</p>
</dd>
</dl>
</dd>
<dt>Knotenhost</dt>
<dd>
<p>Der Name des Hosts, den der Knoten darstellen soll, nachdem der Knoten aktualisiert wurde. Ob dieses Feld obligatorisch ist, h&auml;ngt vom Knotentyp ab:</p>
<ul>
<li>
<p>Wenn der Knotentyp CONFIG ist, kann der Name des Hosts ausgelassen werden. Der Name des Hosts kann festgelegt werden, wenn die Instanzen erstellt werden, die sich auf dem Knoten befinden.</p>
</li>
<li>
<p>Wenn der Knotentyp DCOM oder SSH ist, muss der Name des Hosts angegeben werden. Andernfalls tritt ein Fehler auf.</p>
</li>
</ul>
</dd>
<dt>Knotenverzeichnis</dt>
<dd>
<p>Der Pfad zu dem Verzeichnis, das die GlassFish Server-Instanzen enthalten soll, die auf dem Knoten erstellt werden. Wenn ein relativer Pfad angegeben ist, ist der Pfad relativ zum Verzeichnis as-install. Dabei steht as-install f&uuml;r das Hauptinstallationsverzeichnis der GlassFish Server-Software auf dem Host.</p>
<p>Wird dieses Feld leer gelassen, wird die Konfiguration des Knotens wie folgt aktualisiert:</p>
<ul>
<li>
<p>Wenn der Knotentyp CONFIG ist, wird f&uuml;r den Knoten in der Domainadministrationsserver-(DAS-)Konfiguration kein Verzeichnis f&uuml;r Instanzen angegeben. Das Knotenverzeichnis kann festgelegt werden, wenn die Instanzen erstellt werden, die sich auf dem Knoten befinden.</p>
</li>
<li>
<p>Beim Knotentyp DCOM ist das Standardverzeichnis as-install<code>\nodes</code>, wobei as-install das Hauptinstallationsverzeichnis der GlassFish Server-Software auf dem Host ist.</p>
</li>
<li>
<p>Beim Knotentyp SSH ist das Knotenverzeichnis as-install<code>/nodes</code>, wobei as-install das Hauptinstallationsverzeichnis der GlassFish Server-Software auf dem Host ist.</p>
</li>
</ul>
</dd>
<dt>Installationsverzeichnis</dt>
<dd>
<p>Der vollst&auml;ndige Pfad zum <i>&uuml;bergeordneten</i> Verzeichnis des Hauptinstallationsverzeichnisses der GlassFish Server-Software auf dem Host; Beispiel: <code>/export/glassfish3/</code>.</p>
<p>Wird dieses Feld leer gelassen, wird die Konfiguration des Knotens wie folgt aktualisiert:</p>
<ul>
<li>
<p>Wenn der Knotentyp CONFIG ist, wird f&uuml;r den Knoten in der DAS-Konfiguration kein Installationsverzeichnis angegeben. Das Installationsverzeichnis kann festgelegt werden, wenn die Instanzen erstellt werden, die sich auf dem Knoten befinden.</p>
</li>
<li>
<p>Wenn der Knotentyp DCOM oder SSH ist, ist das Installationsverzeichnis das &uuml;bergeordnete Verzeichnis des Standardhauptinstallationsverzeichnisses der GlassFish Server-Software f&uuml;r den DAS. Diese Einstellung ist nur dann von Nutzen, wenn GlassFish Server auf allen Hosts im gleichen Verzeichnis installiert ist.</p>
</li>
</ul>
</dd>
</dl>
<a id="sthref315" name="sthref315"></a>
<h5>Zus&auml;tzliche Optionen f&uuml;r DCOM-Knoten</h5>
<p>Die folgenden Optionen sind nur verf&uuml;gbar, wenn das Feld "Typ" auf DCOM festgelegt ist:</p>
<dl>
<dt>Erzwingen</dt>
<dd>
<p>Wenn die Option "Aktiviert" ausgew&auml;hlt ist, wird der Knoten in der DAS-Konfiguration erstellt, auch wenn die Validierung der Knotenparameter nicht erfolgreich verl&auml;uft. Um die Parameter eines Knotens zu validieren, muss der DAS mit dem Host des Knotens &uuml;ber DCOM Verbindung aufnehmen k&ouml;nnen.</p>
</dd>
<dt>DCOM validieren</dt>
<dd>
<p>Wenn die Option "Aktiviert" gew&auml;hlt ist, testet GlassFish Server die Verbindung &uuml;ber DCOM zu dem Knotenhost, bevor der Knoten aktualisiert wird. Im Rahmen des Tests kopiert GlassFish Server ein Skript namens <code>delete_me.bat</code> in den Host.</p>
<p>Wenn Sie diese Option w&auml;hlen, wird das Feld "Remote-Testverzeichnis" aktiviert, damit Sie das Verzeichnis angeben k&ouml;nnen, in das GlassFish Server das Skript kopieren soll.</p>
</dd>
<dt>Remote-Testverzeichnis</dt>
<dd>
<p>Der Ordner auf dem Remote-Host, in dem GlassFish Server die Datei <code>delete_me.bat</code> erstellen soll. Der Benutzer, der mit der Option "Windows-Benutzername" angegeben wird, muss Schreibzugriff auf diesen Ordner haben. Andernfalls tritt ein Fehler auf. Der Standardwert ist <code>C:\</code>.</p>
</dd>
<dt>Windows-Domain</dt>
<dd>
<p>Der Name der Windows-Domain, die den Benutzer enth&auml;lt, der mit der Option "Windows-Benutzername" angegeben wird. Der Standardwert ist der Name des Hosts, auf dem die Administrationskonsole ausgef&uuml;hrt wird.</p>
</dd>
<dt>Windows-Benutzername</dt>
<dd>
<p>Der Benutzer auf dem Host dieses Knotens, der die Verbindung zum Host &uuml;ber DCOM ausf&uuml;hrt. Der Standardwert ist der Benutzer, der den DAS-Prozess ausf&uuml;hrt. Wenn die Option "Knotenhost" auf <code>localhost-</code><i>domain</i> gesetzt ist, wird die Option "Windows-Benutzername" ignoriert.</p>
</dd>
<dt>Authentifizierung des Windows-Benutzers</dt>
<dd>
<p>Eine Dropdown-Liste, die angibt, wie der Windows-Benutzer authentifiziert wird, wenn er sich beim Host dieses Knotens anmeldet. F&uuml;r die Authentifizierung stehen folgende M&ouml;glichkeiten zur Verf&uuml;gung:</p>
<dl>
<dt>Kennwort</dt>
<dd>
<p>Der Windows-Benutzer wird durch ein Kennwort authentifiziert, das in der DAS-Konfiguration gespeichert wird.</p>

<hr>
<p><b>Achtung:</b></p>
Dieses Kennwort wird als Klartext in der DAS-Konfiguration gespeichert. Zur erweiterten Sicherheit verwenden Sie einen Kennwortalias.
<hr>

<p>Wenn Sie diese Option w&auml;hlen, wird das Feld "Windows-Benutzerkennwort" aktiviert, damit Sie ein Kennwort angeben k&ouml;nnen.</p>
</dd>
<dt>Kennwortalias</dt>
<dd>
<p>Der Windows-Benutzer wird durch einen Kennwortalias authentifiziert. Wenn Sie diese Option w&auml;hlen, w&auml;hlen Sie den Kennwortalias aus der Dropdown-Liste "Kennwortalias".</p>
</dd>
</dl>
</dd>
<dt>Windows-Benutzerkennwort</dt>
<dd>
<p>Das Kennwort, das der Windows-Benutzer verwendet, wenn er sich beim Host dieses Knotens anmeldet.</p>
</dd>
<dt>Kennwortalias</dt>
<dd>
<p>Eine Dropdown-Liste der Kennwortaliasnamen, die f&uuml;r diese Domain definiert sind.</p>
</dd>
</dl>
<a id="sthref316" name="sthref316"></a>
<h5>Zus&auml;tzliche Optionen f&uuml;r SSH-Knoten</h5>
<p>Die folgenden Optionen sind nur verf&uuml;gbar, wenn das Feld "Typ" auf SSH festgelegt ist:</p>
<dl>
<dt>Erzwingen</dt>
<dd>
<p>Wenn die Option "Aktiviert" ausgew&auml;hlt ist, wird der Knoten in der Konfiguration des Domainadministrationsservers (DAS, Domain Administration Server) aktualisiert, auch wenn die Validierung der Knotenparameter nicht erfolgreich ist. Um die Parameter eines Knotens zu validieren, muss der DAS f&auml;hig sein, den Host des Knotens &uuml;ber SSH zu kontaktieren.</p>
</dd>
<dt>SSH-Port</dt>
<dd>
<p>Der Port, der f&uuml;r SSH-Verbindungen mit dem Host dieses Knotens verwendet wird</p>
<p>Wenn Sie den Knotentyp von CONFIG in SSH &auml;ndern und dieses Feld leer lassen, wird die Option "SSH-Port" auf 22 gesetzt.</p>
<p>Wenn die Option "Knotenhost" auf <code>localhost-</code><i>domain</i> gesetzt ist, wird die Option "SSH-Port" ignoriert.</p>
</dd>
<dt>SSH-Benutzername</dt>
<dd>
<p>Der Benutzer auf dem Host dieses Knotens, der die Verbindung mit dem Host &uuml;ber SSH herstellen soll.</p>
<p>Wenn Sie den Knotentyp von CONFIG in SSH &auml;ndern und dieses Feld leer lassen, wird f&uuml;r die Option "Benutzername" der Benutzer verwendet, der den DAS-Prozess ausf&uuml;hrt.</p>
<p>Wenn die Option "Knotenhost" auf <code>localhost-</code><i>domain</i> gesetzt ist, wird die Option "SSH-Benutzer" ignoriert.</p>
</dd>
<dt>SSH-Benutzerauthentifizierung</dt>
<dd>
<p>Eine Dropdown-Liste, die angibt, wie der SSH-Benutzer authentifiziert wird, wenn er sich beim Host dieses Knotens anmeldet. F&uuml;r die Authentifizierung stehen folgende M&ouml;glichkeiten zur Verf&uuml;gung:</p>
<dl>
<dt>Schl&uuml;sseldatei</dt>
<dd>
<p>Der SSH-Benutzer wird durch eine Datei f&uuml;r den SSH-Private Key authentifiziert. Wenn Sie diese Option w&auml;hlen, geben Sie den absoluten Pfad zu dieser Datei im Feld "Schl&uuml;sseldatei" an.</p>
</dd>
<dt>Kennwort</dt>
<dd>
<p>Der SSH-Benutzer wird durch ein Kennwort authentifiziert, das in der DAS-Konfiguration gespeichert wird.</p>

<hr>
<p><b>Achtung:</b></p>
Dieses Kennwort wird als Klartext in der DAS-Konfiguration gespeichert. Verwenden Sie eine Schl&uuml;sseldatei oder einen Kennwortalias, um die Sicherheit zu erh&ouml;hen.
<hr>

<p>Wenn Sie diese Option w&auml;hlen, wird das Feld "SSH-Benutzerkennwort" aktiviert, damit Sie ein Kennwort angeben k&ouml;nnen.</p>
</dd>
<dt>Kennwortalias</dt>
<dd>
<p>Der SSH-Benutzer wird durch einen Kennwortalias authentifiziert. Wenn Sie diese Option w&auml;hlen, w&auml;hlen Sie den Kennwortalias aus der Dropdown-Liste "Kennwortalias".</p>
</dd>
</dl>
</dd>
<dt>SSH einrichten</dt>
<dd>
<p>Wenn die Option "Aktiviert" gew&auml;hlt ist, richtet GlassFish Server einen SSH-Schl&uuml;ssel auf dem Host des Knotens ein. GlassFish Server richtet den SSH-Schl&uuml;ssel ein, indem vorhandene Schl&uuml;sseldateien aus dem DAS-Host kopiert werden, oder indem gegebenenfalls die Dateien generiert werden, bevor sie kopiert werden. Diese Option ist nur verf&uuml;gbar, wenn die Option "SSH-Benutzerauthentifizierung" auf "Schl&uuml;sseldatei" gesetzt ist.</p>
</dd>
<dt>Schl&uuml;ssel generieren</dt>
<dd>
<p>Wenn die Option "Aktiviert" gew&auml;hlt ist, generiert GlassFish Server die SSH-Schl&uuml;sseldateien, bevor die Dateien in den Host des Knotens kopiert werden, wenn die Dateien nicht vorhanden sind. Wenn die SSH-Schl&uuml;sseldateien vorhanden sind, generiert GlassFish Server die Dateien nicht, auch wenn die Option "Aktiviert" gew&auml;hlt ist.</p>

<hr>
<p><b>Hinweis:</b></p>
Wenn die SSH-Schl&uuml;sseldateien nicht vorhanden sind, muss die Option "Aktiviert" gew&auml;hlt sein. Andernfalls tritt ein Fehler auf, wenn Sie versuchen, die &Auml;nderungen zu speichern.
<hr>

</dd>
<dt>SSH-Benutzerkennwort</dt>
<dd>
<p>Das Kennwort, das der SSH-Benutzer verwendet, wenn er sich beim Host dieses Knotens anmeldet.</p>
</dd>
<dt>Kennwortalias</dt>
<dd>
<p>Eine Dropdown-Liste der Kennwortaliasnamen, die f&uuml;r diese Domain definiert sind.</p>
</dd>
<dt>Public Key-Datei</dt>
<dd>
<p>Der absolute Pfad zu der SSH-Public Key-Datei f&uuml;r den Benutzer, der mit der Option "SSH-Benutzername" angegeben wird. Der Content der Public Key-Datei wird an die Datei <code>.ssh/authorized_keys</code> des Benutzers auf dem Host des Knotens angeh&auml;ngt. Wenn die Datei <code>.ssh/authorized_keys</code> nicht auf dem Host vorhanden ist, erstellt GlassFish Server sie.</p>
</dd>
<dt>Schl&uuml;sseldatei</dt>
<dd>
<p>Der absolute Pfad zur Datei f&uuml;r den SSH-Private Key des Benutzers, der durch die Option "Benutzername" angegeben ist. Diese Datei dient zur Authentifizierung des <code>sshd</code>-Daemons auf dem Host des Knotens.</p>

<hr>
<p><b>Hinweis:</b></p>
GlassFish Server unterst&uuml;tzt ebenfalls eine Kennwortauthentifizierung &uuml;ber den Eintrag <code>AS_ADMIN_SSHPASSWORD</code> in der Kennwortdatei. Die Kennwortdatei wird in der Option <code>-paswordfile</code> des Utilitys <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00263"><code>asadmin</code>1</a> angegeben.
<hr>

<p>Wenn die SSH-Private Key-Datei durch eine Passphrase gesch&uuml;tzt wird, muss die Kennwortdatei den Eintrag <code>AS_ADMIN_SSHKEYPASSPHRASE</code> enthalten.</p>
<p>Der Pfad zur Schl&uuml;sseldatei muss f&uuml;r den DAS erreichbar sein, und die Schl&uuml;sseldatei muss vom DAS gelesen werden k&ouml;nnen.</p>
<p>Der Standardwert h&auml;ngt davon ab, ob Sie den Knotentyp von CONFIG in SSH &auml;ndern, um die Kommunikation &uuml;ber SSH f&uuml;r den Knoten zu aktivieren:</p>
<p>Wenn Sie den Knotentyp von CONFIG in SSH &auml;ndern und dieses Feld leer lassen, wird die Option "Schl&uuml;sseldatei" auf eine Schl&uuml;sseldatei im Verzeichnis <code>.ssh</code> des Benutzers gesetzt. Wenn mehrere Schl&uuml;sseldateien gefunden werden, verwendet GlassFish Server die folgende Reihenfolge:</p>
<ol>
<li>
<p><code>id_rsa</code></p>
</li>
<li>
<p><code>id_dsa</code></p>
</li>
<li>
<p><code>identity</code></p>
</li>
</ol>
</dd>
</dl>
<a id="sthref317" name="sthref317"></a>
<h5>Verwandte Aufgaben</h5>
<p><a href="task-editnode.html">So wird ein Knoten bearbeitet</a></p>
<a id="sthref318" name="sthref318"></a>
<h5>Entsprechende asadmin-Unterbefehle</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00255"><code>update-node-config</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM789"><code>update-node-dcom</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00256"><code>update-node-ssh</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
