<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterinstanceedit" name="ref-clusterinstanceedit"></a></p>

<h4><a id="sthref275" name="sthref275"></a><a id="sthref276" name="sthref276"></a><a id="sthref277" name="sthref277"></a>Allgemeine Informationen</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Die Seite "Allgemeine Informationen" enth&auml;lt die folgenden Optionen.</p>
<dl>
<dt>Starten</dt>
<dd>
<p>Schaltfl&auml;che zum Starten der Instanz. Wenn die Instanz ausgef&uuml;hrt wird, ist diese Schaltfl&auml;che deaktiviert.</p>
</dd>
<dt>Anhalten</dt>
<dd>
<p>Schaltfl&auml;che zum Anhalten der Instanz. Wenn die Instanz angehalten ist, ist diese Schaltfl&auml;che deaktiviert.</p>
</dd>
<dt>Neustart</dt>
<dd>
<p>Schaltfl&auml;che zum erneuten Starten der Instanz. Wenn die Instanz angehalten ist, ist diese Schaltfl&auml;che deaktiviert.</p>
</dd>
<dt>Logdateien anzeigen</dt>
<dd>
<p>Schaltfl&auml;che zum Anzeigen von Logdateien f&uuml;r die Instanz.</p>
</dd>
<dt>Transaktionen wiederherstellen</dt>
<dd>
<p>Schaltfl&auml;che zum Wiederherstellen von Transaktionen f&uuml;r die Instanz.</p>
</dd>
<dt>Clustername</dt>
<dd>
<p>Der Name, der dem Cluster bei der Erstellung zugewiesen wurde. Wenn Sie auf den Namen klicken, wird die Seite <a href="ref-clustergeneral.html">Allgemeine Informationen</a> f&uuml;r das Cluster ge&ouml;ffnet.</p>
</dd>
<dt>Instanzname</dt>
<dd>
<p>Der Name, der der Instanz beim Hinzuf&uuml;gen zum Cluster zugewiesen wurde. Dieses Feld ist schreibgesch&uuml;tzt.</p>
</dd>
<dt>Status</dt>
<dd>
<p>Gibt an, ob die Instanz ausgef&uuml;hrt wird, einen Neustart ben&ouml;tigt, um mit Konfigurations&auml;nderungen aktualisiert zu werden, oder nicht ausgef&uuml;hrt wird. Dieses Feld ist schreibgesch&uuml;tzt.</p>
</dd>
<dt>JVM</dt>
<dd>
<p>Wenn Sie auf einen JVM-Bericht klicken, wird ein separates Fenster ge&ouml;ffnet, das Berichte &uuml;ber die Java Virtual Machine anzeigt, einschlie&szlig;lich eines zusammenfassenden Berichts, Speichermanagement- und Garbage Collection-Berichts, Class Loading-Berichts und einem aktuellen Threaddump.</p>
</dd>
<dt>Knoten</dt>
<dd>
<p>Der Name des Knotens, auf dem sich die Instanz befindet. Wenn Sie auf den Namen klicken, wird die Seite <a href="ref-nodeedit.html">Knoten bearbeiten</a> f&uuml;r den Knoten ge&ouml;ffnet.</p>
</dd>
<dt>Konfiguration</dt>
<dd>
<p>Die Konfiguration, auf die die Instanz verweist. Durch Klicken auf die Konfiguration wird die Seite <a href="../../../common/en/help/ref-configuration.html">Konfigurationen</a> f&uuml;r die Instanz ge&ouml;ffnet.</p>
</dd>
<dt>HTTP-Ports</dt>
<dd>
<p>Eine durch Komma getrennte Liste der Nummern von Ports, auf denen die Instanz auf die folgenden Anforderungstypen horcht:</p>
<ul>
<li>
<p>Administrationsanforderungen</p>
</li>
<li>
<p>HTTP-Anforderungen</p>
</li>
<li>
<p>HTTPS-Anforderungen</p>
</li>
</ul>
<p>Dieses Feld ist schreibgesch&uuml;tzt.</p>
</dd>
<dt>IIOP-Ports</dt>
<dd>
<p>Eine durch Komma getrennte Liste der Nummern von Ports, die die Instanz f&uuml;r die folgenden Verbindungstypen verwendet:</p>
<ul>
<li>
<p>Sichere IIOP-Verbindung</p>
</li>
<li>
<p>Sichere IIOP-Verbindungen mit Clientauthentifizierung</p>
</li>
<li>
<p>IIOP-Verbindungen</p>
</li>
</ul>
<p>Dieses Feld ist schreibgesch&uuml;tzt.</p>
</dd>
</dl>
<a id="sthref278" name="sthref278"></a>
<h5>Verwandte Aufgaben</h5>
<ul>
<li>
<p><a href="task-start-clustered-instances.html">So werden geclusterte GlassFish Server-Instanzen gestartet</a></p>
</li>
<li>
<p><a href="task-stop-clustered-instances.html">So werden geclusterte GlassFish Server-Instanzen angehalten</a></p>
</li>
<li>
<p><a href="task-view-logs-clustered-instance.html">So zeigen Sie Logdateien f&uuml;r eine GlassFish Server-Clusterinstanz an</a></p>
</li>
<li>
<p><a href="task-recovertransactions.html">So werden Transaktionen f&uuml;r eine geclusterte GlassFish Server-Instanz wiederhergestellt</a></p>
</li>
</ul>
<a id="sthref279" name="sthref279"></a>
<h5>Entsprechende asadmin-Unterbefehle</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00138"><code>generate-jvm-report</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00219"><code>restart-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00236"><code>start-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00241"><code>stop-instance</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
