<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterinstanceconfigproperties" name="ref-clusterinstanceconfigproperties"></a><a id="GHCLU00010" name="GHCLU00010"></a></p>

<h4><a id="sthref283" name="sthref283"></a><a id="sthref284" name="sthref284"></a><a id="sthref285" name="sthref285"></a>Instanzsystemeigenschaften</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Auf der Seite "Instanzsystemeigenschaften" werden die Java-Systemeigenschaften aufgelistet, die f&uuml;r die aktuelle GlassFish Server-Instanz festgelegt sind. Java-Systemeigenschaften werden an das Java-Anwendungsstarttool &uuml;ber die Option <code>-D</code> des Java-Anwendungsstarttools weitergeleitet, wenn GlassFish Server gestartet wird.</p>
<p>Diese Eigenschaften &uuml;berschreiben die Eigenschaftsdefinitionen f&uuml;r Porteinstellungen in der Konfiguration der Instanz. Vordefinierte Porteinstellungen m&uuml;ssen &uuml;berschrieben werden, wenn sich beispielsweise zwei geclusterte Instanzen auf demselben Host befinden. In solch einem Fall m&uuml;ssen die Porteinstellungen f&uuml;r eine Instanz au&szlig;er Kraft gesetzt werden, weil beide Instanzen dieselbe Konfiguration nutzen.</p>
<p>Weitere Informationen zu vordefinierten Porteinstellungen in einer Konfiguration finden Sie unter <a href="../../../common/en/help/ref-predefinedconfigsysproperties.html">Predefined Configuration System Properties</a>.</p>
<p>Das Feld "Instanzname" ist ein schreibgesch&uuml;tztes Feld, in dem der Name der aktuellen Instanz angezeigt wird.</p>
<p>F&uuml;r jede Instanz werden folgende Informationen angezeigt:</p>
<dl>
<dt>Name der Instanzenvariablen</dt>
<dd>
<p>Der Name der Systemeigenschaft.</p>
</dd>
<dt>Aktueller Wert</dt>
<dd>
<p>Der Wert, der aktuell f&uuml;r die Eigenschaft festgelegt ist. Dieses Feld ist schreibgesch&uuml;tzt.</p>
</dd>
<dt>&Uuml;berschreibungswert</dt>
<dd>
<p>Der Wert, auf den die Eigenschaft gesetzt wird, nachdem die &Auml;nderungen gespeichert wurden.</p>
</dd>
</dl>
<p>Die Tabelle "Weitere Eigenschaften" enth&auml;lt dar&uuml;ber hinaus die folgenden Optionen.</p>
<dl>
<dt>Eigenschaft hinzuf&uuml;gen</dt>
<dd>
<p>Schaltfl&auml;che zum Hinzuf&uuml;gen einer Eigenschaft. Durch Klicken auf diese Schaltfl&auml;che wird eine Zeile zur Tabelle "Weitere Eigenschaften" hinzugef&uuml;gt.</p>
</dd>
<dt>Eigenschaften l&ouml;schen</dt>
<dd>
<p>Schaltfl&auml;che zum L&ouml;schen von mindestens einer ausgew&auml;hlten Eigenschaft. Eine gel&ouml;schte Eigenschaft wird auf den Standardwert zur&uuml;ckgesetzt oder, falls kein Standardwert vorhanden ist, nicht definiert.</p>
</dd>
</dl>
<a id="sthref286" name="sthref286"></a>
<h5>Verwandte Aufgaben</h5>
<ul>
<li>
<p><a href="task-change-clustered-instance-ports.html">So werden die Portnummern einer geclusterten GlassFish Server-Instanz ge&auml;ndert</a></p>
</li>
<li>
<p><a href="task-config-sys-properties-defaults.html">So geben Sie Standardwerte f&uuml;r Konfigurationssystemeigenschaften an</a></p>
</li>
</ul>
<a id="sthref287" name="sthref287"></a>
<h5>Entsprechende asadmin-Unterbefehle</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00059"><code>create-system-properties</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00110"><code>delete-system-property</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00203"><code>list-system-properties</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
