<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterinstances" name="ref-clusterinstances"></a></p>

<h4><a id="sthref266" name="sthref266"></a><a id="sthref267" name="sthref267"></a>Clusterserverinstanzen</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Auf der Seite "Geclusterte Serverinstanzen" k&ouml;nnen Sie GlassFish Server-Instanzen im aktuellen Cluster erstellen und verwalten.</p>
<p>Das Feld "Clustername" ist ein schreibgesch&uuml;tztes Feld, in dem der Name des aktuellen Clusters angezeigt wird.</p>
<p>Auf der Seite "Geclusterte Serverinstanzen" werden die Instanzen aufgelistet, die zum aktuellen Cluster geh&ouml;ren. F&uuml;r jede Instanz werden die folgenden Informationen zur Verf&uuml;gung gestellt.</p>
<dl>
<dt>Name</dt>
<dd>
<p>Der Name, der der Instanz bei der Erstellung zugewiesen wurde. Wenn Sie auf den Namen klicken, wird die Seite <a href="ref-clusterinstanceedit.html">Allgemeine Informationen</a> f&uuml;r die Instanz ge&ouml;ffnet.</p>
</dd>
<dt>LB-Gewichtung</dt>
<dd>
<p>Eine Ganzzahl, die die Gewichtung des Load Balancings der Instanz darstellt.</p>
<p>Die Gewichtung des Load Balancings bestimmt den Anteil aller Anforderungen an das Cluster, die von der Instanz verarbeitet werden.</p>
<p>Beispiel: Bei einem Cluster mit zwei Instanzen muss eine Instanz eine von vier Anforderungen und die andere Instanz drei von vier Anforderungen verarbeiten. Definieren Sie in diesem Fall f&uuml;r die Gewichtung der Instanz, die eine von vier Anforderungen verarbeiten soll, den Wert 1 und f&uuml;r die Gewichtung der anderen Instanz den Wert 3. Wenn Sie stattdessen Prozents&auml;tze bevorzugen, legen Sie f&uuml;r die Gewichtung der Instanzen jeweils den Prozentwert 25 und 75 fest.</p>
<p>Die Standardgewichtung ist 100.</p>
</dd>
<dt>Konfiguration</dt>
<dd>
<p>Die Konfiguration, auf die die Instanz verweist. Durch Klicken auf die Konfiguration wird die Seite <a href="../../../common/en/help/ref-configuration.html">Konfigurationen</a> f&uuml;r die Instanz ge&ouml;ffnet.</p>
</dd>
<dt>Knoten</dt>
<dd>
<p>Der Name des Knotens, auf dem sich die Instanz befindet. Wenn Sie auf den Namen klicken, wird die Seite <a href="ref-nodeedit.html">Knoten bearbeiten</a> f&uuml;r den Knoten ge&ouml;ffnet.</p>
</dd>
<dt>Status</dt>
<dd>
<p>Gibt an, ob die Instanz ausgef&uuml;hrt wird, einen Neustart ben&ouml;tigt, um mit Konfigurations&auml;nderungen aktualisiert zu werden, oder nicht ausgef&uuml;hrt wird. Dieses Feld ist schreibgesch&uuml;tzt.</p>
</dd>
</dl>
<p>Die Tabelle "Serverinstanzen" enth&auml;lt dar&uuml;ber hinaus die folgenden Optionen.</p>
<dl>
<dt>Neu</dt>
<dd>
<p>Schaltfl&auml;che zum Hinzuf&uuml;gen einer Instanz zum Cluster.</p>
</dd>
<dt>L&ouml;schen</dt>
<dd>
<p>Schaltfl&auml;che zum Entfernen von mindestens einer ausgew&auml;hlten Instanz aus dem Cluster.</p>

<hr>
<p><b>Achtung:</b></p>
L&ouml;schen Sie nicht die Instanz, die mit dem Master-Broker verkn&uuml;pft ist, wenn Sie ein Java Message Service-(JMS-)Cluster mit einem Master-Broker verwenden. Wenn diese Instanz gel&ouml;scht werden muss, verwenden Sie den Unterbefehl <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00005"><code>change-master-broker</code> 1</a>, um den Master-Broker einer anderen Instanz zuzuweisen.
<hr>

</dd>
<dt>Starten</dt>
<dd>
<p>Schaltfl&auml;che zum Starten von mindestens einer ausgew&auml;hlten Instanz im Cluster.</p>
</dd>
<dt>Anhalten</dt>
<dd>
<p>Schaltfl&auml;che zum Anhalten von mindestens einer ausgew&auml;hlten Instanz im Cluster.</p>
</dd>
</dl>
<a id="sthref268" name="sthref268"></a>
<h5>Verwandte Aufgaben</h5>
<ul>
<li>
<p><a href="task-create-clustered-instance.html">So wird eine GlassFish Server-Instanz einem Cluster hinzugef&uuml;gt</a></p>
</li>
<li>
<p><a href="task-delete-clustered-instances.html">So werden geclusterte GlassFish Server-Instanzen gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-start-clustered-instances.html">So werden geclusterte GlassFish Server-Instanzen gestartet</a></p>
</li>
<li>
<p><a href="task-stop-clustered-instances.html">So werden geclusterte GlassFish Server-Instanzen angehalten</a></p>
</li>
</ul>
<a id="sthref269" name="sthref269"></a>
<h5>Entsprechende asadmin-Unterbefehle</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00033"><code>create-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00085"><code>delete-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00170"><code>list-instances</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00236"><code>start-instance</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00241"><code>stop-instance</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
