<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterapplications" name="ref-clusterapplications"></a><a id="GHCLU00005" name="GHCLU00005"></a></p>

<h4><a id="sthref262" name="sthref262"></a><a id="sthref263" name="sthref263"></a>Anwendungen</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Auf der Seite "Anwendungen" k&ouml;nnen Sie die folgenden Aufgaben auf dem aktuellen Cluster ausf&uuml;hren:</p>
<ul>
<li>
<p>Anzeigen und Verwalten der Anwendungen, die bereits f&uuml;r das Cluster bereitgestellt sind</p>
</li>
<li>
<p>Bereitstellen weiterer Anwendungen f&uuml;r das Cluster</p>
</li>
</ul>
<p>Das Feld "Clustername" ist ein schreibgesch&uuml;tztes Feld, in dem der Name des aktuellen Clusters angezeigt wird.</p>
<p>Auf der Seite "Anwendungen" werden die Anwendungen aufgelistet, die f&uuml;r das aktuelle Cluster bereitgestellt sind. F&uuml;r jede Anwendung werden die folgenden Informationen zur Verf&uuml;gung gestellt.</p>
<dl>
<dt>Name</dt>
<dd>
<p>Der Name der Anwendung.</p>
<p>Der Name kann eine optionale Versions-ID enthalten, die dem Namen folgt und von diesem durch einen Doppelpunkt (<code>:</code>) getrennt ist. Weitere Informationen zu Modul- und Anwendungsversionen finden Sie unter <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDPG00324"><i>Module and Application Versions</i> im <i>Oracle GlassFish Server Application Deployment Guide</i></a>.</p>
</dd>
<dt>Aktiviert</dt>
<dd>
<p>Gibt an, ob die Anwendung aktiviert ist:</p>
<ul>
<li>
<p>Wenn die Anwendung aktiviert ist, wird ein H&auml;kchen (&#10003;) angezeigt.</p>
</li>
<li>
<p>Wenn die Anwendung deaktiviert ist, wird ein Kreuz (&#10007;) angezeigt.</p>
</li>
</ul>
</dd>
<dt>LB aktiviert</dt>
<dd>
<p>Gibt an, ob die Anwendung f&uuml;r das Load Balancing aktiviert ist:</p>
<ul>
<li>
<p>Wenn die Anwendung f&uuml;r das Load Balancing aktiviert ist, wird ein H&auml;kchen (&#10003;) angezeigt.</p>
</li>
<li>
<p>Wenn die Anwendung f&uuml;r das Load Balancing deaktiviert ist, wird ein Kreuz (&#10003;) angezeigt.</p>
</li>
</ul>
</dd>
<dt>Engines</dt>
<dd>
<p>Die Art der von der Anwendung verwendeten Container. Es stehen folgende Containertypen zur Verf&uuml;gung:</p>
<ul>
<li>
<p><code>web</code></p>
</li>
<li>
<p><code>webservices</code></p>
</li>
<li>
<p><code>ejb</code></p>
</li>
<li>
<p><code>connector</code></p>
</li>
<li>
<p><code>appclient</code></p>
</li>
<li>
<p><code>weld</code> &mdash; der Container f&uuml;r Contexts and Dependency Injection f&uuml;r Anwendungen der Java EE-Plattform</p>
</li>
</ul>
</dd>
</dl>
<p>Die Tabelle "Bereitgestellte Anwendungen" enth&auml;lt dar&uuml;ber hinaus die folgenden Optionen.</p>
<dl>
<dt>Bereitstellen</dt>
<dd>
<p>Schaltfl&auml;che zum Bereitstellen einer Anwendung.</p>
</dd>
<dt>Deployment aufheben</dt>
<dd>
<p>Schaltfl&auml;che, um das Deployment einer oder mehrerer ausgew&auml;hlter Anwendungen aufzuheben.</p>
<p>Durch Aufheben des Deployments einer Anwendung wird die Anwendung aus allen Zielen und der Domain entfernt. Wenn das Deployment einer Anwendung aufgehoben wird, wird die Anwendung nicht mehr auf der Seite <a href="../../../common/en/help/ref-applications.html">Anwendungen</a> aufgelistet, auf der alle in GlassFish Server bereitgestellten Anwendungen angezeigt werden.</p>
<p>Um Anwendungen nur aus dem aktuellen Ziel zu entfernen, verwenden Sie die Schaltfl&auml;che "Entfernen", die sich auf dieser Seite befindet.</p>
</dd>
<dt>Entfernen</dt>
<dd>
<p>Schaltfl&auml;che zum Entfernen von mindestens einer ausgew&auml;hlten Anwendung.</p>
<p>Durch Entfernen einer Anwendung wird die Anwendung nur aus dem aktuellen Ziel entfernt. Wenn eine Anwendung aus einem Ziel entfernt wird, wird die Anwendung weiterhin auf der Seite <a href="../../../common/en/help/ref-applications.html">Anwendungen</a> aufgelistet, auf der alle in GlassFish Server bereitgestellten Anwendungen angezeigt werden. Die Anwendung bleibt auch weiterhin auf anderen Zielen bereitgestellt, auf denen sie bereitgestellt wurde.</p>
<p>Um Anwendungen aus allen Zielen und der Domain zu entfernen, verwenden Sie die Schaltfl&auml;che "Deployment aufheben", die sich auf dieser Seite befindet.</p>
</dd>
<dt>Weitere Aktionen</dt>
<dd>
<p>Dropdown-Liste, &uuml;ber die weitere Aktionen f&uuml;r mindestens eine Anwendung ausgef&uuml;hrt werden k&ouml;nnen.</p>
<dl>
<dt>Aktivieren</dt>
<dd>
<p>Aktiviert mindestens eine Anwendung.</p>
</dd>
<dt>Deaktivieren</dt>
<dd>
<p>Deaktiviert mindestens eine Anwendung.</p>
</dd>
<dt>Load Balancer aktivieren</dt>
<dd>
<p>Aktiviert mindestens eine ausgew&auml;hlte Anwendung f&uuml;r das Load Balancing.</p>
</dd>
<dt>Load Balancer deaktivieren</dt>
<dd>
<p>Deaktiviert mindestens eine ausgew&auml;hlte Anwendung f&uuml;r das Load Balancing.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref264" name="sthref264"></a>
<h5>Verwandte Aufgaben</h5>
<ul>
<li>
<p><a href="task-cluster-app-deploy.html">So wird eine Anwendung f&uuml;r ein Cluster bereitgestellt</a></p>
</li>
<li>
<p><a href="task-cluster-app-list.html">So werden Anwendungen aufgelistet, die f&uuml;r ein Cluster bereitgestellt sind</a></p>
</li>
<li>
<p><a href="task-cluster-app-undeploy.html">So wird das Deployment von Anwendungen auf einem Cluster aufgehoben</a></p>
</li>
<li>
<p><a href="task-cluster-app-remove.html">So werden Anwendungen aus einem Cluster entfernt</a></p>
</li>
<li>
<p><a href="task-cluster-app-edit.html">So wird eine Anwendung bearbeitet, die in einem Cluster bereitgestellt ist</a></p>
</li>
<li>
<p><a href="task-cluster-app-enable-disable.html">So wird eine Anwendung aktiviert oder deaktiviert, die in einem Cluster bereitgestellt ist</a></p>
</li>
<li>
<p><a href="task-cluster-app-lb-enable-disable.html">So wird das Load Balancing f&uuml;r eine Anwendung aktiviert oder deaktiviert, die in einem Cluster bereitgestellt ist</a></p>
</li>
</ul>
<a id="sthref265" name="sthref265"></a>
<h5>Entsprechende asadmin-Unterbefehle</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00114"><code>deploy</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00116"><code>disable</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00118"><code>disable-http-lb-application</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00124"><code>enable</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00126"><code>enable-http-lb-application</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00148"><code>list-applications</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
