<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-clusterproperties" name="ref-clusterproperties"></a></p>

<h4><a id="sthref300" name="sthref300"></a><a id="sthref301" name="sthref301"></a>Clustereigenschaften</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Auf der Seite "Clustereigenschaften" werden die Eigenschaften aufgelistet, die f&uuml;r die ausgew&auml;hlten Cluster festgelegt sind. Diese Eigenschaften f&uuml;gen optionale Konfigurationsinformationen zum Cluster hinzu.</p>
<p>Das Feld "Clustername" ist ein schreibgesch&uuml;tztes Feld, in dem der Name des ausgew&auml;hlten Clusters angezeigt wird.</p>
<p>F&uuml;r jede Instanz werden folgende Informationen angezeigt:</p>
<dl>
<dt>Name</dt>
<dd>
<p>Der Name der Eigenschaft.</p>
</dd>
<dt>Wert</dt>
<dd>
<p>Der Wert der Eigenschaft, der f&uuml;r die ausgew&auml;hlte Instanz festgelegt ist.</p>
</dd>
<dt>Beschreibung</dt>
<dd>
<p>Eine Textbeschreibung mit weiteren Informationen zur Eigenschaft.</p>
</dd>
</dl>
<p>Die Tabelle "Weitere Eigenschaften" enth&auml;lt dar&uuml;ber hinaus die folgenden Optionen.</p>
<dl>
<dt>Eigenschaft hinzuf&uuml;gen</dt>
<dd>
<p>Schaltfl&auml;che zum Hinzuf&uuml;gen einer Eigenschaft. Durch Klicken auf diese Schaltfl&auml;che wird eine Zeile zur Tabelle "Weitere Eigenschaften" hinzugef&uuml;gt.</p>
</dd>
<dt>Eigenschaften l&ouml;schen</dt>
<dd>
<p>Schaltfl&auml;che zum L&ouml;schen von mindestens einer ausgew&auml;hlten Eigenschaft. Eine gel&ouml;schte Eigenschaft wird auf den Standardwert zur&uuml;ckgesetzt oder, falls kein Standardwert vorhanden ist, nicht definiert.</p>
</dd>
</dl>
<p>GlassFish Server definiert die folgenden Clustereigenschaften:</p>
<dl>
<dt><code>GMS_DISCOVERY_URI_LIST</code></dt>
<dd>
<p>Die Speicherorte der GlassFish Server-Instanzen im Cluster, die zur Erkennung des Clusters verwendet werden. Diese Eigenschaft ist nur erforderlich, wenn der GMS (Group Management Service) kein Multicast f&uuml;r die &Uuml;bertragung von Nachrichten verwendet.</p>
<p>G&uuml;ltige Werte f&uuml;r diese Eigenschaft sind:</p>
<ul>
<li>
<p>Eine durch Komma getrennte Liste von URIs (Uniform Resource Identifiers). Jeder URI muss eine GlassFish Server-Instanz oder den DAS suchen. Dieses Format ist erforderlich, wenn mehrere GlassFish Server-Instanzen auf demselben Host ausgef&uuml;hrt werden.</p>
<p>Das Format der einzelnen URIs in der Liste ist wie folgt:</p>
<p><i>scheme</i><code>://</code><i>host-name-or -IP-address</i><code>:</code><i>port</i></p>
<ul>
<li>
<p><i>scheme</i> ist das URI-Schema, das <code>tcp</code> lautet.</p>
</li>
<li>
<p><i>host-name-or -IP-address</i> ist der Hostname oder die IP-Adresse des Hosts, auf dem die Instanz ausgef&uuml;hrt wird.</p>
</li>
<li>
<p><i>Port</i> ist die Portnummer des Ports, auf dem die Instanz auf Nachrichten von GMS horcht. Die Systemeigenschaft <code>GMS_LISTENER_PORT-</code><i>clustername</i> muss f&uuml;r die Instanz festgelegt werden. Weitere Informationen zur Festlegung dieser Systemeigenschaft f&uuml;r eine Instanz finden Sie unter "<a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSHAG00373">Discovering a Cluster When Multicast Transport Is Unavailable</a>" im <i>Oracle GlassFish Server High Availability Administration Guide</i>.</p>
</li>
</ul>
</li>
<li>
<p>Eine durch Komma getrennte Liste mit IP-Adressen oder Namen von Hosts, auf denen der DAS oder die Instanzen ausgef&uuml;hrt werden. Die Liste kann eine Mischung aus IP-Adressen und Hostnamen enthalten. Dieses Format kann nur verwendet werden, wenn jeweils eine geclusterte Instanz auf den einzelnen Hosts ausgef&uuml;hrt wird. Der Wert der Eigenschaft <code>GMS_LISTENER_PORT</code> muss f&uuml;r jedes Cluster in einer Domain eindeutig sein.</p>
</li>
<li>
<p>Das Schl&uuml;sselwort <code>generate</code>. Dieses Format kann nur verwendet werden, wenn eine Instanz in einem Cluster auf jedem Host ausgef&uuml;hrt wird und der DAS auf einem separaten Host ausgef&uuml;hrt wird. Mehrere Instanzen auf demselben Host k&ouml;nnen nicht Mitglied desselben Clusters sein. Der Wert der Eigenschaft <code>GMS_LISTENER_PORT</code> muss f&uuml;r jedes Cluster in einer Domain eindeutig sein.</p>
</li>
</ul>
</dd>
<dt><code>GMS_LISTENER_PORT</code></dt>
<dd>
<p>Die Portnummer des Ports, auf dem das Cluster auf Nachrichten vom GMS horcht.</p>
<p>Der Standardwert ist eine Referenz zur Systemeigenschaft <code>GMS_LISTENER_PORT-</code><i>cluster-name</i>. Standardm&auml;&szlig;ig ist diese Systemeigenschaft nicht festgelegt. In diesem Fall w&auml;hlt der GMS einen freien Port aus dem durch die Eigenschaften <code>GMS_TCPSTARTPORT</code> und <code>GMS_TCPENDPORT</code> definierten Bereich. Standardm&auml;&szlig;ig liegt dieser Bereich zwischen 9090 und 9200. In den meisten F&auml;llen reicht dieses Standardbehavior aus.</p>
<p>Wenn der GMS jedoch <b>nicht</b> Multicast f&uuml;r Nachrichten verwendet, muss diese Eigenschaft eine Portnummer angeben, die f&uuml;r alle GlassFish Server-Instanzen im Cluster gilt. Damit Sie den Standardwert verwenden k&ouml;nnen, um diese Anforderung zu erf&uuml;llen, legen Sie die Portnummer individuell f&uuml;r jede Instanz mit einer Systemeigenschaft fest.</p>
<p>Beispiel: Verwenden Sie die Seite <a href="ref-clustersystemproperties.html">Clustersystemeigenschaften</a>, um die Systemeigenschaft <code>GMS_LISTENER_PORT-</code><i>cluster-name</i> f&uuml;r den DAS zu erstellen. Stellen Sie dann f&uuml;r jede Instanz im Cluster die Systemeigenschaft <code>GMS_LISTENER_PORT-</code><i>cluster-name</i> auf die Portnummer ein, auf der die Instanz auf Nachrichten vom GMS horcht. Der Standardwert der Eigenschaft <code>GMS_LISTENER_PORT</code> f&uuml;r das Cluster referenziert diese Systemeigenschaft.</p>
</dd>
<dt><code>GMS_LOOPBACK</code></dt>
<dd>
<p>Gibt an, ob eine Instanz von sich selbst Nachrichten auf Anwendungsebene erhalten kann, die die Instanz an das Cluster sendet.</p>
<p>M&ouml;gliche Werte:</p>
<dl>
<dt><code>false</code></dt>
<dd>
<p>Die Instanz darf <i>keine</i> Nachrichten von sich selbst erhalten (Standardeinstellung).</p>
</dd>
<dt><code>true</code></dt>
<dd>
<p>Die Instanz kann Nachrichten von sich selbst erhalten. Verwenden Sie diese Einstellung zum Testen einer Instanz, wenn die Instanz die einzige Instanz in einem Cluster ist.</p>
</dd>
</dl>
</dd>
<dt><code>GMS_MULTICAST_TIME_TO_LIVE</code></dt>
<dd>
<p>Die maximale Anzahl der Iterationen oder &Uuml;bertragungen, die bei einer Multicast-Nachricht der folgenden Ereignistypen auftreten kann, bevor die Meldung verworfen wird:</p>
<ul>
<li>
<p>Gruppenerkennung</p>
</li>
<li>
<p>Mitglied-Heartbeats</p>
</li>
<li>
<p>Mitgliedschafts&auml;nderungen</p>
</li>
</ul>
<p>Damit die Konfiguration des Netzwerks, auf dem der DAS und die Clusterinstanzen bereitgestellt sind, &uuml;bereinstimmt, setzen Sie diesen Wert so niedrig wie m&ouml;glich. Um den niedrigstm&ouml;glichen Wert f&uuml;r das System zu ermitteln, verwenden Sie den Unterbefehl <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00259"><code>validate-multicast</code>1</a>.</p>
<p>Bei einem Wert von 0 wird sichergestellt, dass Multicast-Nachrichten auf keinen Fall den Host verlassen, von dem sie gesendet werden.</p>
<p>Ein Wert von 1 kann verhindern, dass Nachrichten zwischen den &uuml;ber einen Switch oder Router verbundenen Hosts im gleichen Subnet gesendet wird.</p>
<p>Der Standardwert ist 4. Dadurch wird sichergestellt, dass Nachrichten zwischen allen Cluster-Membern in Netzwerken erfolgreich gesendet werden, in denen Hosts &uuml;ber Switches oder Router verbunden sind.</p>
</dd>
<dt><code>GMS_TCPENDPORT</code></dt>
<dd>
<p>Die h&ouml;chste Portnummer in dem Bereich, aus dem der GMS einen freien Port w&auml;hlt, wenn die Systemeigenschaft <code>GMS_LISTENER_PORT-</code><i>cluster-name</i> nicht festgelegt ist. Der Standardwert ist 9200.</p>
</dd>
<dt><code>GMS_TCPSTARTPORT</code></dt>
<dd>
<p>Die niedrigste Portnummer in dem Bereich, aus dem der GMS einen freien Port w&auml;hlt, wenn die Systemeigenschaft <code>GMS_LISTENER_PORT-</code><i>cluster-name</i> nicht festgelegt ist. Der Standardwert ist 9090.</p>
</dd>
</dl>
<a id="sthref302" name="sthref302"></a>
<h5>Entsprechende asadmin-Unterbefehle</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00139"><code>get</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00145"><code>list</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00226"><code>set</code>(1)</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
