<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-start-cluster" name="task-start-cluster"></a></p>

<h4><a id="sthref14" name="sthref14"></a>So wird ein Cluster gestartet</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Beim Starten eines Clusters werden alle GlassFish Server-Instanzen im Cluster gestartet, die noch nicht ausgef&uuml;hrt werden.</p>
<a id="sthref15" name="sthref15"></a>
<h5>Bevor Sie beginnen</h5>
<p>Stellen Sie sicher, dass die folgenden Voraussetzungen erf&uuml;llt sind:</p>
<ul>
<li>
<p>Alle Knoten, auf denen sich Instanzen im Cluster befinden, werden f&uuml;r die Remote-Kommunikation aktiviert.</p>
</li>
<li>
<p>Der Benutzer des Domainadministrationsservers (DAS, Domain Administration Server) kann sich &uuml;ber das Remote-Protokoll Distributed Component Object Model (DCOM) oder &uuml;ber Secure Shell (SSH) bei dem Host f&uuml;r alle Knoten anmelden, auf denen sich Instanzen im Cluster befinden.</p>
</li>
</ul>
<p>Wenn eine dieser Voraussetzungen nicht erf&uuml;llt ist, starten Sie das Cluster, indem Sie jede Instanz einzeln &uuml;ber die Befehlszeile mit dem Unterbefehl <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00237"><code>start-local-instance</code>1</a> starten.</p>
<ol>
<li>
<p>W&auml;hlen Sie in der Navigationsbaumstruktur den Knoten "Cluster".</p>
<p>Die Seite "Cluster" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Aktivieren Sie auf der Seite "Cluster" das Kontrollk&auml;stchen neben dem Namen des Clusters.</p>
</li>
<li>
<p>Klicken Sie auf "Cluster starten".</p>
<p>Sie m&uuml;ssen das Starten des Clusters best&auml;tigen.</p>
</li>
<li>
<p>Best&auml;tigen Sie das Starten des Clusters.</p>
<p>Das Cluster wird gestartet. Der Status jeder Instanz im Cluster wird auf der Seite "Cluster" aktualisiert, wenn die Instanz gestartet wird.</p>
</li>
</ol>
<a id="sthref16" name="sthref16"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-create-cluster.html">So wird ein Cluster erstellt</a></p>
</li>
<li>
<p><a href="task-delete-cluster.html">So wird ein Cluster gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-availabilityservice.html">So werden Verf&uuml;gbarkeitseinstellungen f&uuml;r ein Cluster konfiguriert</a></p>
</li>
<li>
<p><a href="task-stop-cluster.html">So wird ein Cluster gestoppt</a></p>
</li>
<li>
<p><a href="task-modify-cluster-config.html">So wird die Konfiguration eines Clusters ge&auml;ndert</a></p>
</li>
<li>
<p><a href="task-cluster-app-deploy.html">So wird eine Anwendung f&uuml;r ein Cluster bereitgestellt</a></p>
</li>
<li>
<p><a href="task-cluster-app-list.html">So werden Anwendungen aufgelistet, die f&uuml;r ein Cluster bereitgestellt sind</a></p>
</li>
<li>
<p><a href="task-cluster-app-undeploy.html">So wird das Deployment von Anwendungen auf einem Cluster aufgehoben</a></p>
</li>
<li>
<p><a href="task-cluster-app-remove.html">So werden Anwendungen aus einem Cluster entfernt</a></p>
</li>
<li>
<p><a href="task-cluster-app-edit.html">So wird eine Anwendung bearbeitet, die in einem Cluster bereitgestellt ist</a></p>
</li>
<li>
<p><a href="task-cluster-app-enable-disable.html">So wird eine Anwendung aktiviert oder deaktiviert, die in einem Cluster bereitgestellt ist</a></p>
</li>
<li>
<p><a href="task-cluster-app-lb-enable-disable.html">So wird das Load Balancing f&uuml;r eine Anwendung aktiviert oder deaktiviert, die in einem Cluster bereitgestellt ist</a></p>
</li>
<li>
<p><a href="task-cluster-resource-create.html">So wird eine Ressource f&uuml;r ein Cluster erstellt</a></p>
</li>
<li>
<p><a href="task-cluster-resource-display.html">So werden Ressourcen f&uuml;r ein Cluster aufgelistet</a></p>
</li>
<li>
<p><a href="task-cluster-resource-enable-disable.html">So wird eine Ressource global aktiviert oder deaktiviert</a></p>
</li>
<li>
<p><a href="task-cluster-resource-edit.html">So wird eine Ressource f&uuml;r ein Cluster bearbeitet</a></p>
</li>
<li>
<p><a href="task-upgrade-components.html">So werden Ressourcen ohne Serviceunterbrechung upgegradet</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
