<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-deletenode" name="task-deletenode"></a></p>

<h4><a id="sthref228" name="sthref228"></a>So werden Knoten gel&ouml;scht</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Durch L&ouml;schen eines Knotens wird der Knoten aus der Konfiguration des Domainadministrationsservers (DAS, Domain Administration Server) entfernt. Die Verzeichnisse und Dateien des Knotens werden gel&ouml;scht, wenn die letzte GlassFish Server-Instanz auf dem Knoten gel&ouml;scht wird.</p>
<p>Sie k&ouml;nnen auch die GlassFish Server-Software von dem Knotenhost deinstallieren, wenn der Knoten gel&ouml;scht wird.</p>
<a id="sthref229" name="sthref229"></a>
<h5>Bevor Sie beginnen</h5>
<p>Vergewissern Sie sich, dass sich keine GlassFish Server-Instanzen auf dem zu l&ouml;schenden Knoten befinden.</p>
<ol>
<li>
<p>W&auml;hlen Sie in der Navigationsbaumstruktur den Knoten "Knoten".</p>
<p>Die Seite "Knoten" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Aktivieren Sie f&uuml;r jeden zu l&ouml;schenden Knoten das Kontrollk&auml;stchen neben dem Knoten in der Tabelle "Knoten".</p>

<hr>
<p><b>Hinweis:</b></p>
Der vordefinierte Knoten <code>localhost-</code><i>domain</i> kann nicht gel&ouml;scht werden.
<hr>

</li>
<li>
<p>Klicken Sie auf die Schaltfl&auml;che zum L&ouml;schen der Knoten, oder l&ouml;schen Sie die Knoten und deinstallieren Sie die GlassFish Server-Software von den Knotenhosts.</p>
<ul>
<li>
<p>Um die Knoten zu l&ouml;schen, ohne die GlassFish Server-Software zu deinstallieren, klicken Sie auf "L&ouml;schen".</p>
<p>Sie m&uuml;ssen das L&ouml;schen der Knoten best&auml;tigen.</p>
</li>
<li>
<p>Um die Knoten zu l&ouml;schen und die GlassFish Server-Software von den Knotenhosts zu deinstallieren, klicken Sie auf "L&ouml;schen und deinstallieren".</p>
<p>Sie m&uuml;ssen best&auml;tigen, dass Sie die Knoten l&ouml;schen und die GlassFish Server-Software von den Knotenhosts deinstallieren m&ouml;chten.</p>

<hr>
<p><b>Hinweis:</b></p>
Die GlassFish Server-Software wird nicht von einem Host deinstalliert, den ein Knoten des Typs CONFIG darstellt. Nur der Knoten wird gel&ouml;scht.
<hr>

</li>
</ul>
</li>
<li>
<p>Sie m&uuml;ssen best&auml;tigen, dass Sie die Knoten l&ouml;schen oder die Knoten l&ouml;schen und die GlassFish Server-Software von den Knotenhosts deinstallieren m&ouml;chten.</p>
<p>Die Knoten werden gel&ouml;scht und aus der Tabelle der Knoten auf der Seite "Knoten" entfernt. Wenn Sie auf "L&ouml;schen und deinstallieren" geklickt haben, wird die GlassFish Server-Software ebenfalls von den Knotenhosts deinstalliert.</p>
</li>
</ol>
<a id="sthref230" name="sthref230"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-createnode.html">So wird ein Knoten erstellt</a></p>
</li>
<li>
<p><a href="task-listnodes.html">So werden alle Knoten in der aktuellen Domain aufgef&uuml;hrt</a></p>
</li>
<li>
<p><a href="task-pingnode.html">So wird getestet, ob ein Knoten zug&auml;nglich ist</a></p>
</li>
<li>
<p><a href="task-editnode.html">So wird ein Knoten bearbeitet</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
