<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-upgrade-components" name="task-upgrade-components"></a></p>

<h4><a id="sthref62" name="sthref62"></a><a id="sthref63" name="sthref63"></a><a id="sthref64" name="sthref64"></a><a id="sthref65" name="sthref65"></a>So werden Ressourcen ohne Serviceunterbrechung upgegradet</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>In einer Clusterumgebung wird durch ein laufendes Upgrade eine Anwendung bei minimalem Verlust von Services und Sessions erneut bereitgestellt. Eine Session ist ein Artefakt, das repliziert werden kann. Beispiel:</p>
<ul>
<li>
<p><code>HttpSession</code></p>
</li>
<li>
<p><code>SingleSignOn</code></p>
</li>
<li>
<p><code>ServletTimer</code></p>
</li>
<li>
<p><code>DialogFragment</code></p>
</li>
<li>
<p>Stateful Session-Bean</p>
</li>
</ul>
<p>Sie k&ouml;nnen den Load Balancer und mehrere Cluster verwenden, um Komponenten in GlassFish Server ohne Serviceunterbrechung zu aktualisieren. Bei einer Komponente kann es sich beispielsweise um eine JVM, die GlassFish Server-Software oder eine Webanwendung handeln.</p>
<p>Ein Rolling-Upgrade kann bei leichter bis mittlerer Auslastung stattfinden. Der Vorgang dauert ca. 10-15 Minuten f&uuml;r jede GlassFish Server-Instanz.</p>
<p>Die Anwendungen innerhalb des Upgrades m&uuml;ssen kompatibel sein. W&auml;hrend des &Uuml;bergangs m&uuml;ssen sie ordnungsgem&auml;&szlig; funktionieren, wenn bei einigen Instanzen die alte Version und bei anderen Instanzen die neue Version ausgef&uuml;hrt wird. Die alte und neue Version m&uuml;ssen die gleiche Form von serialisierbaren Klassen aufweisen, die in Sessions gespeicherte Objektdiagramme bilden (beispielsweise nicht-tempor&auml;re Instanzenvariablen). Wenn die Form dieser Klassen sich &auml;ndert, muss der Entwickler der Anwendung sicherstellen, dass das Serialisierungsbehavior ordnungsgem&auml;&szlig; ist. Wenn die Anwendungen innerhalb des Upgrades nicht kompatibel sind, muss das Cluster angehalten und vollst&auml;ndig neu bereitgestellt werden.</p>
<p>Dieser Ansatz ist nicht m&ouml;glich, wenn das Anwendungsupgrade eine &Auml;nderung am Datenbankschema der Anwendung erfordert.</p>

<hr>
<p><b>Achtung:</b></p>
Um unterschiedliche Versionen bei einem Failover einer Session zu vermeiden, aktualisieren Sie gleichzeitig alle Instanzen in einem Cluster. Andernfalls wird m&ouml;glicherweise ein Failover einer Session auf eine Instanz durchgef&uuml;hrt, auf der unterschiedliche Versionen der Komponenten ausgef&uuml;hrt werden.
<hr>

<p>F&uuml;hren Sie diese Task auf jedem Cluster separat durch. Ein Cluster fungiert als Sicherheitsbarriere f&uuml;r ein Session-Failover auf Instanzen im Cluster. Bei Sessions in einem Cluster kann niemals ein Failover auf Sessions in einem anderen Cluster durchgef&uuml;hrt werden. Dadurch wird das Risiko unterschiedlicher Versionen vermieden.</p>
<ol>
<li>
<p>Stoppen Sie das Cluster.</p>
<p>Siehe <a href="task-stop-cluster.html">So wird ein Cluster gestoppt</a></p>
</li>
<li>
<p>Upgraden Sie die Komponenten in diesem Cluster.</p>
</li>
<li>
<p>Starten Sie das Cluster</p>
<p>Siehe <a href="task-start-cluster.html">So wird ein Cluster gestartet</a></p>
</li>
</ol>
<a id="sthref66" name="sthref66"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-create-cluster.html">So wird ein Cluster erstellt</a></p>
</li>
<li>
<p><a href="task-delete-cluster.html">So wird ein Cluster gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-availabilityservice.html">So werden Verf&uuml;gbarkeitseinstellungen f&uuml;r ein Cluster konfiguriert</a></p>
</li>
<li>
<p><a href="task-start-cluster.html">So wird ein Cluster gestartet</a></p>
</li>
<li>
<p><a href="task-stop-cluster.html">So wird ein Cluster gestoppt</a></p>
</li>
<li>
<p><a href="task-modify-cluster-config.html">So wird die Konfiguration eines Clusters ge&auml;ndert</a></p>
</li>
<li>
<p><a href="task-cluster-app-deploy.html">So wird eine Anwendung f&uuml;r ein Cluster bereitgestellt</a></p>
</li>
<li>
<p><a href="task-cluster-app-list.html">So werden Anwendungen aufgelistet, die f&uuml;r ein Cluster bereitgestellt sind</a></p>
</li>
<li>
<p><a href="task-cluster-app-undeploy.html">So wird das Deployment von Anwendungen auf einem Cluster aufgehoben</a></p>
</li>
<li>
<p><a href="task-cluster-app-remove.html">So werden Anwendungen aus einem Cluster entfernt</a></p>
</li>
<li>
<p><a href="task-cluster-app-edit.html">So wird eine Anwendung bearbeitet, die in einem Cluster bereitgestellt ist</a></p>
</li>
<li>
<p><a href="task-cluster-app-enable-disable.html">So wird eine Anwendung aktiviert oder deaktiviert, die in einem Cluster bereitgestellt ist</a></p>
</li>
<li>
<p><a href="task-cluster-app-lb-enable-disable.html">So wird das Load Balancing f&uuml;r eine Anwendung aktiviert oder deaktiviert, die in einem Cluster bereitgestellt ist</a></p>
</li>
<li>
<p><a href="task-cluster-resource-create.html">So wird eine Ressource f&uuml;r ein Cluster erstellt</a></p>
</li>
<li>
<p><a href="task-cluster-resource-display.html">So werden Ressourcen f&uuml;r ein Cluster aufgelistet</a></p>
</li>
<li>
<p><a href="task-cluster-resource-enable-disable.html">So wird eine Ressource global aktiviert oder deaktiviert</a></p>
</li>
<li>
<p><a href="task-cluster-resource-edit.html">So wird eine Ressource f&uuml;r ein Cluster bearbeitet</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
