<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-gmscluster" name="task-gmscluster"></a></p>

<h4><a id="sthref220" name="sthref220"></a>So werden Group Management Service-Einstellungen f&uuml;r ein Cluster konfiguriert</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Der Group Management Service (GMS) ist ein prozessinterner Service, der Services f&uuml;r Cluster&uuml;berwachung, Clustermitgliedschaft und Gruppenkommunikation bereitstellt. Der GMS f&uuml;hrt folgende Funktionen aus:</p>
<ul>
<li>
<p>Benachrichtigt registrierte Module in einer GlassFish Server-Instanz, wenn mindestens eine Mitgliedsinstanz zum Cluster hinzugef&uuml;gt bzw. aus dem Cluster entfernt wurde oder bei einer Mitgliedsinstanz Fehler vermutet bzw. best&auml;tigt wurden.</p>
</li>
<li>
<p>Bietet die M&ouml;glichkeit, Nachrichten zwischen Cluster-Membern zu senden und zu empfangen.</p>
</li>
</ul>
<ol>
<li>
<p>Blenden Sie in der Navigationsbaumstruktur den Knoten "Cluster" ein.</p>
</li>
<li>
<p>W&auml;hlen Sie das Cluster, f&uuml;r das Sie Einstellungen f&uuml;r den Group Management Service (GMS) konfigurieren m&ouml;chten.</p>
<p>Die Seite "Allgemeine Informationen" f&uuml;r das Cluster wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Aktiviert" f&uuml;r den GMS, um den GMS f&uuml;r das Cluster zu aktivieren.</p>
<p>Diese Option ist standardm&auml;&szlig;ig aktiviert. Um den GMS f&uuml;r das Cluster zu deaktivieren, deaktivieren Sie das Kontrollk&auml;stchen "Aktiviert" f&uuml;r den GMS.</p>
<p>Wenn diese Option aktiviert ist, wird der Group Management Service (GMS) in jeder Serverinstanz im Cluster und im Domainadministrationsserver (DAS, Domain Administration Server) gestartet. Der DAS ist an jedem Cluster beteiligt, f&uuml;r den GMS aktiviert ist.</p>
</li>
<li>
<p>Geben Sie im Feld "Multicast-Port" den Port ein, den der Group Management Service zum &Uuml;berwachen der Gruppenereignisse verwendet.</p>
<p>Geben Sie eine standardm&auml;&szlig;ige UDP-Portnummer im Bereich 2048-49151 an. Der Standardwert wird automatisch in diesem Bereich generiert.</p>
</li>
<li>
<p>Geben Sie im Feld "Multicast-Adresse" die Adresse an, die der Group Management Service zum &Uuml;berwachen der Gruppenereignisse verwendet.</p>
<p>Geben Sie eine IP-Multicast-Adresse der Klasse D an. IP-Adressen der Klasse D liegen im Bereich von <code>224.0.0.0</code> bis einschlie&szlig;lich <code>239.255.255.255</code>. Die Adresse <code>224.0.0.0</code> ist reserviert und sollte nicht verwendet werden. Der Standardwert ist 228.9.<i>XX</i>. <i>YY</i>. Dabei stehen <i>XX</i> und <i>YY</i> f&uuml;r automatisch generierte unabh&auml;ngige Werte zwischen 0 und 255.</p>
</li>
<li>
<p>Geben Sie im Feld "Bind-Schnittstellenadresse" die Netzwerkschnittstellenadresse f&uuml;r den Group Management Service (GMS) an, wenn mehrere Netzwerkschnittstellen vorhanden sind.</p>
<p>Durch diese Einstellung k&ouml;nnen Sie festlegen, welche Netzwerkschnittstelle f&uuml;r den GMS verwendet wird, wenn mehrere Netzwerkschnittstellen auf den Rechnern vorhanden sind, auf denen die Serverinstanzen im Cluster gehostet werden. Bei diesem Wert muss es sich um die IP-Adresse einer lokalen Netzwerkschnittstelle handeln. Standardm&auml;&szlig;ig werden alle &ouml;ffentlichen Netzwerkschnittstellenadressen verwendet.</p>
<p>Um eine Adresse anzugeben, die f&uuml;r alle GlassFish Server-Instanzen im Cluster g&uuml;ltig ist, verwenden Sie eine Systemeigenschaft, mit der die Adresse einzeln f&uuml;r jede Instanz festgelegt werden kann.</p>
<p>Beispiel: Erstellen Sie die Systemeigenschaft <code>GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i> auf dem DAS. Danach legen Sie diese Option "Bind-Schnittstellenadresse" auf <code>${GMS-BIND-INTERFACE-ADDRESS-</code><i>cluster-name</i><code>}</code> fest, um die Systemeigenschaft anzugeben. Legen Sie abschlie&szlig;end f&uuml;r jede Instanz im Cluster die Systemeigenschaft <code>GMS-BIND-INTERFACE-ADDRESS-</code> <i>cluster-name</i> auf die erforderliche Netzwerkschnittstellenadresse im Rechner der Instanz fest.</p>
</li>
<li>
<p>Um weitere Eigenschaften anzugeben, w&auml;hlen Sie in der Registerkarte "Eigenschaften" die untergeordnete Registerkarte "Clustereigenschaften".</p>
<ul>
<li>
<p>Um eine Eigenschaft hinzuzuf&uuml;gen, klicken Sie auf die Schaltfl&auml;che "Eigenschaft hinzuf&uuml;gen". Geben Sie in die daraufhin angezeigte leere Zeile den Eigenschaftsnamen in das Feld "Name" und den Eigenschaftswert in das Feld "Wert" ein.</p>
</li>
<li>
<p>Um eine Eigenschaft zu &auml;ndern, bearbeiten Sie das Feld "Wert" dieser Eigenschaft.</p>
</li>
<li>
<p>Um eine Eigenschaft zu l&ouml;schen, aktivieren Sie das Kontrollk&auml;stchen links neben dem Feld "Name" der zu l&ouml;schenden Eigenschaft und klicken anschlie&szlig;end auf die Schaltfl&auml;che "Eigenschaften l&ouml;schen".</p>
</li>
</ul>
</li>
<li>
<p>Klicken Sie auf "Speichern".</p>
</li>
</ol>
<a id="sthref221" name="sthref221"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-gmsenable.html">So wird der Group Management Service aktiviert</a></p>
</li>
<li>
<p><a href="task-gms.html">So wird der Group Management Service konfiguriert</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
