<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-set-props-standalone-instance" name="task-set-props-standalone-instance"></a></p>

<h4><a id="sthref194" name="sthref194"></a><a id="sthref195" name="sthref195"></a><a id="sthref196" name="sthref196"></a>So werden Nur-Instanz-Eigenschaften f&uuml;r eine Standalone-GlassFish Server-Instanz festgelegt</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Die Eigenschaften einer GlassFish Server-Instanz enthalten optionale Konfigurationsinformationen zur Instanz.</p>
<ol>
<li>
<p>W&auml;hlen Sie in der Navigationsbaumstruktur den Knoten "Standalone-Instanzen".</p>
<p>Die Seite "Standalone-Serverinstanz" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>W&auml;hlen Sie die Instanz, f&uuml;r die instanzenbezogene Eigenschaften ge&auml;ndert werden sollen.</p>
<p>Die Seite "Allgemeine Informationen" f&uuml;r die Instanz wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie auf der Seite "Allgemeine Informationen" auf die Registerkarte "Eigenschaften".</p>
</li>
<li>
<p>Klicken Sie, falls erforderlich, auf die Registerkarte "Instanzeigenschaften".</p>
<p>Die Seite "Instanzeigenschaften" wird ge&ouml;ffnet.</p>
<p>Auf dieser Seite werden die Eigenschaften aufgelistet, die f&uuml;r die ausgew&auml;hlte GlassFish Server-Instanz festgelegt sind.</p>
</li>
<li>
<p>Geben Sie f&uuml;r jede vorhandene Eigenschaft, die Sie &auml;ndern m&ouml;chten, den neuen Wert im Feld "Wert" f&uuml;r die Eigenschaft ein.</p>
</li>
<li>
<p>Geben Sie Werte f&uuml;r alle zus&auml;tzlichen Eigenschaften ein, die Sie ben&ouml;tigen.</p>
<ol type="a">
<li>
<p>Klicken Sie in der Tabelle "Weitere Eigenschaften" auf "Eigenschaft hinzuf&uuml;gen".</p>
<p>Eine Zeile wird zur Tabelle "Weitere Eigenschaften" hinzugef&uuml;gt.</p>
</li>
<li>
<p>Geben Sie im Feld "Name" den Eigenschaftsnamen ein.</p>
</li>
<li>
<p>Geben Sie im Feld "Wert" den Wert ein.</p>
</li>
<li>
<p>Geben Sie im Feld "Beschreibung" eine kurze Beschreibung der Eigenschaft ein.</p>
</li>
</ol>
</li>
<li>
<p>Klicken Sie auf "Speichern".</p>
</li>
</ol>
<a id="sthref197" name="sthref197"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-create-standalone-instance.html">So wird eine Standalone-GlassFish Server-Instanz erstellt</a></p>
</li>
<li>
<p><a href="task-delete-standalone-instances.html">So werden Standalone-GlassFish Server-Instanzen gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-start-standalone-instances.html">So werden Standalone-GlassFish Server-Instanzen gestartet</a></p>
</li>
<li>
<p><a href="task-stop-standalone-instances.html">So werden Standalone-GlassFish Server-Instanzen angehalten</a></p>
</li>
<li>
<p><a href="task-view-logs-standalone-instance.html">So zeigen Sie Logdateien f&uuml;r eine Standalone-GlassFish Server-Instanz an</a></p>
</li>
<li>
<p><a href="task-recovertransactions-standalone-instance.html">So werden Transaktionen f&uuml;r eine Standalone-GlassFish Server-Instanz wiederhergestellt</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-deploy.html">So wird eine Anwendung in einer Standalone-GlassFish Server-Instanz bereitgestellt</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-list.html">So werden Anwendungen aufgelistet, die f&uuml;r eine Standalone-GlassFish Server-Instanz bereitgestellt sind</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-undeploy.html">So wird das Deployment von Anwendungen auf einer Standalone-GlassFish Server-Instanz aufgehoben</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-remove.html">So werden Anwendungen aus einer Standalone-GlassFish Server-Instanz entfernt</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-edit.html">So wird eine Anwendung bearbeitet, die in einer Standalone-GlassFish Server-Instanz bereitgestellt ist</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-enable-disable.html">So wird eine Anwendung aktiviert oder deaktiviert, die in einer Standalone-GlassFish Server-Instanz bereitgestellt ist</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-lb-enable-disable.html">So wird das Load Balancing f&uuml;r eine Anwendung aktiviert oder deaktiviert, die in einer Standalone-GlassFish Server-Instanz bereitgestellt ist</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-create.html">So wird eine Ressource f&uuml;r eine Standalone-GlassFish Server-Instanz erstellt</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-display.html">So werden Ressourcen f&uuml;r eine Standalone-GlassFish Server-Instanz aufgelistet</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-enable-disable.html">So wird eine Ressource f&uuml;r eine Standalone-GlassFish Server-Instanz aktiviert oder deaktiviert</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-edit.html">So wird eine Ressource f&uuml;r eine Standalone-GlassFish Server-Instanz bearbeitet</a></p>
</li>
<li>
<p><a href="task-change-standalone-instance-ports.html">So werden die Portnummern einer Standalone-GlassFish Server-Instanz ge&auml;ndert</a></p>
</li>
<li>
<p><a href="task-mon-app-standalone-instance.html">So werden Anwendungs&uuml;berwachungsdaten f&uuml;r eine Standalone-GlassFish Server-Instanz angezeigt</a></p>
</li>
<li>
<p><a href="task-mon-server-standalone-instance.html">So werden Virtual-Server-&Uuml;berwachungsdaten f&uuml;r eine Standalone-GlassFish Server-Instanz angezeigt</a></p>
</li>
<li>
<p><a href="task-mon-resource-standalone-instance.html">So werden Ressourcen&uuml;berwachungsdaten f&uuml;r eine Standalone-GlassFish Server-Instanz angezeigt</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
