<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-start-standalone-instances" name="task-start-standalone-instances"></a></p>

<h4><a id="sthref131" name="sthref131"></a><a id="sthref132" name="sthref132"></a><a id="sthref133" name="sthref133"></a>So werden Standalone-GlassFish Server-Instanzen gestartet</h4>
<a name="BEGIN" id="BEGIN"></a><a id="sthref134" name="sthref134"></a>
<h5>Bevor Sie beginnen</h5>
<p>Stellen Sie sicher, dass die folgenden Voraussetzungen erf&uuml;llt sind:</p>
<ul>
<li>
<p>Alle Knoten, auf denen sich die Instanzen befinden, sind f&uuml;r eine Remote-Kommunikation aktiviert.</p>
</li>
<li>
<p>Der Benutzer des Domainadministrationsservers (DAS, Domain Administration Server) kann sich &uuml;ber das Remote-Protokoll Distributed Component Object Model (DCOM) oder &uuml;ber Secure Shell (SSH) bei dem Host f&uuml;r alle Knoten anmelden, auf denen sich Instanzen im Cluster befinden.</p>
</li>
</ul>
<p>Wenn eine dieser Voraussetzungen nicht erf&uuml;llt ist, starten Sie jede Instanz einzeln &uuml;ber die Befehlszeile, indem Sie den Unterbefehl <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00237"><code>start-local-instance</code>(1)</a> eingeben.</p>
<ol>
<li>
<p>W&auml;hlen Sie in der Navigationsbaumstruktur den Knoten "Standalone-Instanzen".</p>
<p>Die Seite "Standalone-Serverinstanz" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Aktivieren Sie f&uuml;r jede zu startende Instanz das Kontrollk&auml;stchen neben der Instanz in der Tabelle "Serverinstanzen".</p>
</li>
<li>
<p>Klicken Sie auf "Start".</p>
<p>Sie m&uuml;ssen das Starten der Instanzen best&auml;tigen.</p>
</li>
<li>
<p>Best&auml;tigen Sie das Starten der Instanzen.</p>
<p>Der Status der Instanzen wird in der Tabelle "Serverinstanzen" aktualisiert, wenn die Instanz gestartet wird.</p>
</li>
</ol>
<a id="sthref135" name="sthref135"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-create-standalone-instance.html">So wird eine Standalone-GlassFish Server-Instanz erstellt</a></p>
</li>
<li>
<p><a href="task-delete-standalone-instances.html">So werden Standalone-GlassFish Server-Instanzen gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-stop-standalone-instances.html">So werden Standalone-GlassFish Server-Instanzen angehalten</a></p>
</li>
<li>
<p><a href="task-view-logs-standalone-instance.html">So zeigen Sie Logdateien f&uuml;r eine Standalone-GlassFish Server-Instanz an</a></p>
</li>
<li>
<p><a href="task-recovertransactions-standalone-instance.html">So werden Transaktionen f&uuml;r eine Standalone-GlassFish Server-Instanz wiederhergestellt</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-deploy.html">So wird eine Anwendung in einer Standalone-GlassFish Server-Instanz bereitgestellt</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-list.html">So werden Anwendungen aufgelistet, die f&uuml;r eine Standalone-GlassFish Server-Instanz bereitgestellt sind</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-undeploy.html">So wird das Deployment von Anwendungen auf einer Standalone-GlassFish Server-Instanz aufgehoben</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-remove.html">So werden Anwendungen aus einer Standalone-GlassFish Server-Instanz entfernt</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-edit.html">So wird eine Anwendung bearbeitet, die in einer Standalone-GlassFish Server-Instanz bereitgestellt ist</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-enable-disable.html">So wird eine Anwendung aktiviert oder deaktiviert, die in einer Standalone-GlassFish Server-Instanz bereitgestellt ist</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-lb-enable-disable.html">So wird das Load Balancing f&uuml;r eine Anwendung aktiviert oder deaktiviert, die in einer Standalone-GlassFish Server-Instanz bereitgestellt ist</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-create.html">So wird eine Ressource f&uuml;r eine Standalone-GlassFish Server-Instanz erstellt</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-display.html">So werden Ressourcen f&uuml;r eine Standalone-GlassFish Server-Instanz aufgelistet</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-enable-disable.html">So wird eine Ressource f&uuml;r eine Standalone-GlassFish Server-Instanz aktiviert oder deaktiviert</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-edit.html">So wird eine Ressource f&uuml;r eine Standalone-GlassFish Server-Instanz bearbeitet</a></p>
</li>
<li>
<p><a href="task-change-standalone-instance-ports.html">So werden die Portnummern einer Standalone-GlassFish Server-Instanz ge&auml;ndert</a></p>
</li>
<li>
<p><a href="task-set-props-standalone-instance.html">So werden Nur-Instanz-Eigenschaften f&uuml;r eine Standalone-GlassFish Server-Instanz festgelegt</a></p>
</li>
<li>
<p><a href="task-mon-app-standalone-instance.html">So werden Anwendungs&uuml;berwachungsdaten f&uuml;r eine Standalone-GlassFish Server-Instanz angezeigt</a></p>
</li>
<li>
<p><a href="task-mon-server-standalone-instance.html">So werden Virtual-Server-&Uuml;berwachungsdaten f&uuml;r eine Standalone-GlassFish Server-Instanz angezeigt</a></p>
</li>
<li>
<p><a href="task-mon-resource-standalone-instance.html">So werden Ressourcen&uuml;berwachungsdaten f&uuml;r eine Standalone-GlassFish Server-Instanz angezeigt</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
