<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-create-cluster" name="task-create-cluster"></a><a id="GHCLU00027" name="GHCLU00027"></a></p>

<h4><a id="sthref2" name="sthref2"></a>So wird ein Cluster erstellt</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Ein Cluster ist eine benannte Zusammenstellung aus GlassFish Server-Instanzen, die dieselben Anwendungen, Ressourcen und Konfigurationsinformationen verwenden.</p>
<p>Ein Cluster bietet eine hohe Verf&uuml;gbarkeit durch Skalierbarkeit, Lastenausgleich und Fehlerschutz. Wenn bei einer Instanz oder einem Host in einem Cluster ein Fehler auftritt, erkennt GlassFish Server den Fehler, leitet Anfragen von der fehlerhaften Instanz an andere Instanzen im Cluster um und stellt den Status der Benutzersession wieder her. Da die gleichen Anwendungen und Ressourcen in allen Instanzen des Clusters vorhanden sind, kann eine Instanz ein Failover zu einer anderen Instanz im Cluster durchf&uuml;hren.</p>
<p>GlassFish Server erm&ouml;glicht die Verwaltung aller Instanzen im Cluster von einem einzigen Host aus als eine Einheit, unabh&auml;ngig davon, ob die Instanzen sich auf dem gleichen Host oder auf unterschiedlichen Hosts befinden.</p>
<a id="sthref3" name="sthref3"></a>
<h5>Bevor Sie beginnen</h5>
<p>Wenn Sie GlassFish Server-Instanzen zu dem zu erstellenden Cluster hinzuf&uuml;gen m&ouml;chten, stellen Sie sicher, dass die Knoten, auf denen sich die Instanzen befinden sollen, vorhanden sind.</p>
<ol>
<li>
<p>W&auml;hlen Sie in der Navigationsbaumstruktur den Knoten "Cluster".</p>
<p>Die Seite "Cluster" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie auf der Seite "Cluster" auf "Neu".</p>
<p>Die Seite "Neues Cluster" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Geben Sie im Feld "Clustername" einen Namen f&uuml;r das Cluster ein.</p>
<p>Der Name muss den folgenden Anforderungen entsprechen:</p>
<ul>
<li>
<p>Der Name darf nur ASCII-Zeichen enthalten.</p>
</li>
<li>
<p>Der Name muss mit einem Buchstaben, einer Ziffer oder einem Unterstrich beginnen.</p>
</li>
<li>
<p>Der Name darf nur die folgenden Zeichen enthalten:</p>
<ul>
<li>
<p>Kleinbuchstaben</p>
</li>
<li>
<p>Gro&szlig;buchstaben</p>
</li>
<li>
<p>Ziffern</p>
</li>
<li>
<p>Bindestriche</p>
</li>
<li>
<p>Punkte</p>
</li>
<li>
<p>Unterstriche</p>
</li>
</ul>
</li>
<li>
<p>Der Name muss in der Domain eindeutig sein und darf nicht der Name eines anderen Clusters, einer benannten Konfiguration, einer GlassFish Server-Instanz oder eines Knotens sein.</p>
</li>
<li>
<p>Bei dem Namen darf es sich nicht um <code>domain</code>, <code>server</code> oder ein anderes Schl&uuml;sselwort handeln, das von GlassFish Server reserviert ist.</p>
</li>
</ul>
</li>
<li>
<p>W&auml;hlen Sie in der Dropdown-Liste "Konfiguration" die benannte Konfiguration, die das Cluster verwenden soll.</p>

<hr>
<p><b>Hinweis:</b></p>
Wenn Sie <code>default-config</code> ausw&auml;hlen, m&uuml;ssen Sie im n&auml;chsten Schritt angeben, dass die Konfiguration <i>nicht</i> gemeinsam genutzt ist. Die Konfiguration <code>default-config</code> kann nicht gemeinsam genutzt werden.
<hr>

</li>
<li>
<p>Geben Sie an, ob die Konfiguration, die das Cluster verwenden soll, gemeinsam genutzt ist.</p>
<ul>
<li>
<p>Wenn die Konfiguration nicht gemeinsam genutzt werden soll, lassen Sie die Option "Kopie der ausgew&auml;hlten Konfiguration erstellen" aktiviert.</p>
<p>Die ausgew&auml;hlte Konfiguration wird kopiert, wenn das Cluster erstellt wird. Der Kopie der Konfiguration wird der Name cluster-name<code>-config</code> zugewiesen, wobei <i>cluster-name</i> f&uuml;r den Namen des zu erstellenden Clusters steht.</p>
</li>
<li>
<p>Wenn die Konfiguration nicht gemeinsam genutzt ist, w&auml;hlen Sie die Option "Auf ausgew&auml;hlte Konfiguration verweisen".</p>
<p>Das Cluster verwendet die angegebene benannte Konfiguration.</p>
</li>
</ul>
</li>
<li>
<p><a id="sthref4" name="sthref4"></a>F&uuml;gen Sie GlassFish Server-Instanzen dem Cluster hinzu.</p>

<hr>
<p><b>Hinweis:</b></p>
Um eine Instanz auf einem Knotentyp CONFIG zu erstellen, der einen Remote-Host darstellt, m&uuml;ssen Sie den Unterbefehl <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00044"><code>create-local-instance</code>(1)</a> verwenden. Zu diesem Zweck k&ouml;nnen Sie nicht die Administrationskonsole verwenden.
<hr>

<p>Au&szlig;erdem k&ouml;nnen Sie Instanzen nach dem Erstellen des Clusters hinzuf&uuml;gen, wie in <a href="task-create-clustered-instance.html">So wird eine GlassFish Server-Instanz einem Cluster hinzugef&uuml;gt</a> beschrieben.</p>
<p>F&uuml;gen Sie jede Instanz wie folgt hinzu:</p>
<ol type="a">
<li>
<p>Klicken Sie im Bereich "Zu erstellende Serverinstanzen" auf "Hinzuf&uuml;gen".</p>
<p>Eine Zeile wird zur Tabelle der Instanzen im Cluster hinzugef&uuml;gt.</p>
</li>
<li>
<p>Geben Sie im Feld "Instanzname" einen Namen f&uuml;r die Instanz ein.</p>
</li>
<li>
<p>Geben Sie im Feld "Gewichtung" eine Ganzzahl ein, die f&uuml;r die Gewichtung des Load Balancings der Instanz steht.</p>
<p>Die Gewichtung des Load Balancings bestimmt den Anteil aller Anforderungen an das Cluster, die von der Instanz verarbeitet werden.</p>
<p>Beispiel: Bei einem Cluster mit zwei Instanzen muss eine Instanz eine von vier Anforderungen und die andere Instanz drei von vier Anforderungen verarbeiten. Definieren Sie in diesem Fall f&uuml;r die Gewichtung der Instanz, die eine von vier Anforderungen verarbeiten soll, den Wert 1 und f&uuml;r die Gewichtung der anderen Instanz den Wert 3. Wenn Sie stattdessen Prozents&auml;tze bevorzugen, legen Sie f&uuml;r die Gewichtung der Instanzen jeweils den Prozentwert 25 und 75 fest.</p>
<p>Die Standardgewichtung ist 100.</p>
</li>
<li>
<p>W&auml;hlen Sie in der Dropdown-Liste "Knoten" den Knoten, auf dem die Instanz sich befinden soll.</p>
</li>
</ol>
</li>
<li>
<p>Klicken Sie auf "OK".</p>
<p>Die Seite "Cluster" wird erneut angezeigt. Das Cluster wird zur Tabelle der Cluster auf der Seite hinzugef&uuml;gt.</p>
</li>
</ol>
<a id="sthref5" name="sthref5"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-delete-cluster.html">So wird ein Cluster gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-availabilityservice.html">So werden Verf&uuml;gbarkeitseinstellungen f&uuml;r ein Cluster konfiguriert</a></p>
</li>
<li>
<p><a href="task-start-cluster.html">So wird ein Cluster gestartet</a></p>
</li>
<li>
<p><a href="task-stop-cluster.html">So wird ein Cluster gestoppt</a></p>
</li>
<li>
<p><a href="task-modify-cluster-config.html">So wird die Konfiguration eines Clusters ge&auml;ndert</a></p>
</li>
<li>
<p><a href="task-cluster-app-deploy.html">So wird eine Anwendung f&uuml;r ein Cluster bereitgestellt</a></p>
</li>
<li>
<p><a href="task-cluster-app-list.html">So werden Anwendungen aufgelistet, die f&uuml;r ein Cluster bereitgestellt sind</a></p>
</li>
<li>
<p><a href="task-cluster-app-undeploy.html">So wird das Deployment von Anwendungen auf einem Cluster aufgehoben</a></p>
</li>
<li>
<p><a href="task-cluster-app-remove.html">So werden Anwendungen aus einem Cluster entfernt</a></p>
</li>
<li>
<p><a href="task-cluster-app-edit.html">So wird eine Anwendung bearbeitet, die in einem Cluster bereitgestellt ist</a></p>
</li>
<li>
<p><a href="task-cluster-app-enable-disable.html">So wird eine Anwendung aktiviert oder deaktiviert, die in einem Cluster bereitgestellt ist</a></p>
</li>
<li>
<p><a href="task-cluster-app-lb-enable-disable.html">So wird das Load Balancing f&uuml;r eine Anwendung aktiviert oder deaktiviert, die in einem Cluster bereitgestellt ist</a></p>
</li>
<li>
<p><a href="task-cluster-resource-create.html">So wird eine Ressource f&uuml;r ein Cluster erstellt</a></p>
</li>
<li>
<p><a href="task-cluster-resource-display.html">So werden Ressourcen f&uuml;r ein Cluster aufgelistet</a></p>
</li>
<li>
<p><a href="task-cluster-resource-enable-disable.html">So wird eine Ressource global aktiviert oder deaktiviert</a></p>
</li>
<li>
<p><a href="task-cluster-resource-edit.html">So wird eine Ressource f&uuml;r ein Cluster bearbeitet</a></p>
</li>
<li>
<p><a href="task-upgrade-components.html">So werden Ressourcen ohne Serviceunterbrechung upgegradet</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
