<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-standalone-instance-app-remove" name="task-standalone-instance-app-remove"></a><a id="GHCLU00065" name="GHCLU00065"></a></p>

<h4><a id="sthref159" name="sthref159"></a><a id="sthref160" name="sthref160"></a>So werden Anwendungen aus einer Standalone-GlassFish Server-Instanz entfernt</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Durch Entfernen einer Anwendung wird die Anwendung nur aus dem aktuellen Ziel entfernt. Wenn eine Anwendung aus einem Ziel entfernt wird, wird die Anwendung weiterhin auf der Seite <a href="../../../common/en/help/ref-applications.html">Anwendungen</a> aufgelistet, auf der alle in GlassFish Server bereitgestellten Anwendungen angezeigt werden. Die Anwendung bleibt auch weiterhin auf anderen Zielen bereitgestellt, auf denen sie bereitgestellt wurde.</p>
<ol>
<li>
<p>W&auml;hlen Sie in der Navigationsbaumstruktur den Knoten "Standalone-Instanzen".</p>
<p>Die Seite "Standalone-Serverinstanz" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>W&auml;hlen Sie auf der Seite "Standalone-Serverinstanzen" die Instanz.</p>
<p>Die Seite "Allgemeine Informationen" f&uuml;r die Instanz wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie auf der Seite "Allgemeine Informationen" f&uuml;r die Instanz auf die Registerkarte "Anwendungen".</p>
<p>Die Seite "Anwendungen" f&uuml;r die Instanz wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Aktivieren Sie f&uuml;r jede Anwendung, die Sie entfernen, das Kontrollk&auml;stchen neben der Anwendung in der Tabelle "Bereitgestellte Anwendungen".</p>
</li>
<li>
<p>Klicken Sie auf "Entfernen".</p>
<p>Sie m&uuml;ssen das Entfernen der Anwendungen best&auml;tigen.</p>
</li>
<li>
<p>Best&auml;tigen Sie das Entfernen der Anwendungen.</p>
<p>Die Anwendungen werden aus der Tabelle der bereitgestellten Anwendungen auf der Seite entfernt.</p>
</li>
</ol>
<a id="sthref161" name="sthref161"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-create-standalone-instance.html">So wird eine Standalone-GlassFish Server-Instanz erstellt</a></p>
</li>
<li>
<p><a href="task-delete-standalone-instances.html">So werden Standalone-GlassFish Server-Instanzen gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-start-standalone-instances.html">So werden Standalone-GlassFish Server-Instanzen gestartet</a></p>
</li>
<li>
<p><a href="task-stop-standalone-instances.html">So werden Standalone-GlassFish Server-Instanzen angehalten</a></p>
</li>
<li>
<p><a href="task-view-logs-standalone-instance.html">So zeigen Sie Logdateien f&uuml;r eine Standalone-GlassFish Server-Instanz an</a></p>
</li>
<li>
<p><a href="task-recovertransactions-standalone-instance.html">So werden Transaktionen f&uuml;r eine Standalone-GlassFish Server-Instanz wiederhergestellt</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-deploy.html">So wird eine Anwendung in einer Standalone-GlassFish Server-Instanz bereitgestellt</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-list.html">So werden Anwendungen aufgelistet, die f&uuml;r eine Standalone-GlassFish Server-Instanz bereitgestellt sind</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-undeploy.html">So wird das Deployment von Anwendungen auf einer Standalone-GlassFish Server-Instanz aufgehoben</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-edit.html">So wird eine Anwendung bearbeitet, die in einer Standalone-GlassFish Server-Instanz bereitgestellt ist</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-enable-disable.html">So wird eine Anwendung aktiviert oder deaktiviert, die in einer Standalone-GlassFish Server-Instanz bereitgestellt ist</a></p>
</li>
<li>
<p><a href="task-standalone-instance-app-lb-enable-disable.html">So wird das Load Balancing f&uuml;r eine Anwendung aktiviert oder deaktiviert, die in einer Standalone-GlassFish Server-Instanz bereitgestellt ist</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-create.html">So wird eine Ressource f&uuml;r eine Standalone-GlassFish Server-Instanz erstellt</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-display.html">So werden Ressourcen f&uuml;r eine Standalone-GlassFish Server-Instanz aufgelistet</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-enable-disable.html">So wird eine Ressource f&uuml;r eine Standalone-GlassFish Server-Instanz aktiviert oder deaktiviert</a></p>
</li>
<li>
<p><a href="task-standalone-instance-resource-edit.html">So wird eine Ressource f&uuml;r eine Standalone-GlassFish Server-Instanz bearbeitet</a></p>
</li>
<li>
<p><a href="task-change-standalone-instance-ports.html">So werden die Portnummern einer Standalone-GlassFish Server-Instanz ge&auml;ndert</a></p>
</li>
<li>
<p><a href="task-set-props-standalone-instance.html">So werden Nur-Instanz-Eigenschaften f&uuml;r eine Standalone-GlassFish Server-Instanz festgelegt</a></p>
</li>
<li>
<p><a href="task-mon-app-standalone-instance.html">So werden Anwendungs&uuml;berwachungsdaten f&uuml;r eine Standalone-GlassFish Server-Instanz angezeigt</a></p>
</li>
<li>
<p><a href="task-mon-server-standalone-instance.html">So werden Virtual-Server-&Uuml;berwachungsdaten f&uuml;r eine Standalone-GlassFish Server-Instanz angezeigt</a></p>
</li>
<li>
<p><a href="task-mon-resource-standalone-instance.html">So werden Ressourcen&uuml;berwachungsdaten f&uuml;r eine Standalone-GlassFish Server-Instanz angezeigt</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
