<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-delete-cluster" name="task-delete-cluster"></a><a id="GHCLU00028" name="GHCLU00028"></a></p>

<h4><a id="sthref6" name="sthref6"></a>So wird ein Cluster gel&ouml;scht</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Durch L&ouml;schen eines Clusters werden das Cluster und alle GlassFish Server-Instanzen im Cluster gel&ouml;scht. Sie brauchen die Instanzen im Cluster nicht zu l&ouml;schen, bevor Sie das Cluster l&ouml;schen.</p>
<p>Wenn die vom Cluster verwendete Konfiguration nicht gemeinsam genutzt wird, wird die Konfiguration ebenfalls gel&ouml;scht.</p>
<a id="sthref7" name="sthref7"></a>
<h5>Bevor Sie beginnen</h5>
<p>Stellen Sie sicher, dass das zu l&ouml;schende Cluster gestoppt ist. Weitere Anweisungen finden Sie in <a href="task-stop-cluster.html">So wird ein Cluster gestoppt</a>.</p>
<ol>
<li>
<p>W&auml;hlen Sie in der Navigationsbaumstruktur den Knoten "Cluster".</p>
<p>Die Seite "Cluster" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Aktivieren Sie auf der Seite "Cluster" das Kontrollk&auml;stchen neben dem Namen des Clusters.</p>
</li>
<li>
<p>Klicken Sie auf "L&ouml;schen".</p>
<p>Sie m&uuml;ssen das L&ouml;schen des Clusters und aller Instanzen im Cluster best&auml;tigen.</p>
</li>
<li>
<p>Best&auml;tigen Sie das L&ouml;schen des Clusters und aller Instanzen im Cluster.</p>
<p>Das Cluster wird gel&ouml;scht und aus der Tabelle der Cluster auf der Seite "Cluster" entfernt.</p>
</li>
</ol>
<a id="sthref8" name="sthref8"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-create-cluster.html">So wird ein Cluster erstellt</a></p>
</li>
<li>
<p><a href="task-availabilityservice.html">So werden Verf&uuml;gbarkeitseinstellungen f&uuml;r ein Cluster konfiguriert</a></p>
</li>
<li>
<p><a href="task-start-cluster.html">So wird ein Cluster gestartet</a></p>
</li>
<li>
<p><a href="task-stop-cluster.html">So wird ein Cluster gestoppt</a></p>
</li>
<li>
<p><a href="task-modify-cluster-config.html">So wird die Konfiguration eines Clusters ge&auml;ndert</a></p>
</li>
<li>
<p><a href="task-cluster-app-deploy.html">So wird eine Anwendung f&uuml;r ein Cluster bereitgestellt</a></p>
</li>
<li>
<p><a href="task-cluster-app-list.html">So werden Anwendungen aufgelistet, die f&uuml;r ein Cluster bereitgestellt sind</a></p>
</li>
<li>
<p><a href="task-cluster-app-undeploy.html">So wird das Deployment von Anwendungen auf einem Cluster aufgehoben</a></p>
</li>
<li>
<p><a href="task-cluster-app-remove.html">So werden Anwendungen aus einem Cluster entfernt</a></p>
</li>
<li>
<p><a href="task-cluster-app-edit.html">So wird eine Anwendung bearbeitet, die in einem Cluster bereitgestellt ist</a></p>
</li>
<li>
<p><a href="task-cluster-app-enable-disable.html">So wird eine Anwendung aktiviert oder deaktiviert, die in einem Cluster bereitgestellt ist</a></p>
</li>
<li>
<p><a href="task-cluster-app-lb-enable-disable.html">So wird das Load Balancing f&uuml;r eine Anwendung aktiviert oder deaktiviert, die in einem Cluster bereitgestellt ist</a></p>
</li>
<li>
<p><a href="task-cluster-resource-create.html">So wird eine Ressource f&uuml;r ein Cluster erstellt</a></p>
</li>
<li>
<p><a href="task-cluster-resource-display.html">So werden Ressourcen f&uuml;r ein Cluster aufgelistet</a></p>
</li>
<li>
<p><a href="task-cluster-resource-enable-disable.html">So wird eine Ressource global aktiviert oder deaktiviert</a></p>
</li>
<li>
<p><a href="task-cluster-resource-edit.html">So wird eine Ressource f&uuml;r ein Cluster bearbeitet</a></p>
</li>
<li>
<p><a href="task-upgrade-components.html">So werden Ressourcen ohne Serviceunterbrechung upgegradet</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
