<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-editnode" name="task-editnode"></a><a id="GHCLU00084" name="GHCLU00084"></a></p>

<h4><a id="sthref236" name="sthref236"></a>So wird ein Knoten bearbeitet</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Durch das Bearbeiten eines Knotens werden Konfigurationsdaten eines GlassFish Server-Knotens aktualisiert. Au&szlig;erdem wird durch das Bearbeiten eines Knotens der Knotentyp von CONFIG in DCOM oder SSH ge&auml;ndert, um die Remote-Kommunikation f&uuml;r den Knoten zu aktivieren.</p>
<p>Nach dem &Auml;ndern des Knotentyps von CONFIG in DCOM werden die Standardwerte angewendet, wenn eines der folgenden Felder leer ist:</p>
<ul>
<li>
<p>Windows-Domain</p>
</li>
<li>
<p>Windows-Benutzer</p>
</li>
</ul>
<p>Nach dem &Auml;ndern des Knotentyps von CONFIG in SSH werden die Standardwerte angewendet, wenn eines der folgenden Felder leer ist:</p>
<ul>
<li>
<p>SSH-Port</p>
</li>
<li>
<p>SSH-Benutzername</p>
</li>
<li>
<p>Schl&uuml;sseldatei</p>
</li>
</ul>
<ol>
<li>
<p>Blenden Sie in der Navigationsbaumstruktur den Knoten "Knoten" ein.</p>
</li>
<li>
<p>W&auml;hlen Sie in der Liste der Knoten den zu bearbeitenden Knoten.</p>
<p>Die Seite "Knoten bearbeiten" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>W&auml;hlen Sie aus der Dropdown-Liste "Typ" den aktualisierten Knotentyp.</p>
<ul>
<li>
<p>Um den Knoten zur Unterst&uuml;tzung der Kommunikation &uuml;ber das Remote-Protokoll "Distributed Component Object Model (DCOM)" zu aktivieren, w&auml;hlen Sie DCOM.</p>
</li>
<li>
<p>W&auml;hlen Sie SSH, um eine Kommunikation &uuml;ber Secure Shell (SSH) f&uuml;r den Knoten zu unterst&uuml;tzen.</p>
</li>
<li>
<p>W&auml;hlen Sie CONFIG, um keine Remote-Konfiguration f&uuml;r den Knoten zu unterst&uuml;tzen.</p>
<p>Wenn Sie CONFIG w&auml;hlen, werden keine Optionen f&uuml;r die SSH-Konfiguration oder DCOM-Konfiguration angezeigt. Wenn der aktuelle Knotentyp DCOM oder SSH ist und Sie CONFIG-, DCOM-Konfigurationsdaten oder SSH ausw&auml;hlen, werden beim Speichern der &Auml;nderungen die Konfigurationsdaten aus der Knotenkonfiguration entfernt.</p>
</li>
</ul>
</li>
<li>
<p>Geben Sie im Feld "Knotenhost" den Namen des Hosts ein, den der aktualisierte Knoten darstellen soll.</p>
<p>Ob dieses Feld obligatorisch ist, h&auml;ngt vom Knotentyp ab:</p>
<ul>
<li>
<p>Wenn der Knotentyp CONFIG ist, kann der Name des Hosts ausgelassen werden. Der Name des Hosts kann festgelegt werden, wenn die Instanzen erstellt werden, die sich auf dem Knoten befinden.</p>
</li>
<li>
<p>Wenn der Knotentyp DCOM oder SSH ist, muss der Name des Hosts angegeben werden. Andernfalls tritt ein Fehler auf.</p>
</li>
</ul>
</li>
<li>
<p>Geben Sie im Feld "Knotenverzeichnis" den Pfad zu dem Verzeichnis ein, das die GlassFish Server-Instanzen enthalten soll, die auf dem Knoten erstellt werden.</p>
<p>Wenn Sie einen relativen Pfad angeben, ist der Pfad relativ zum Verzeichnis as-install. Dabei steht as-install f&uuml;r das Hauptinstallationsverzeichnis der GlassFish Server-Software auf dem Host.</p>
</li>
<li>
<p>Geben Sie im Feld "Installationsverzeichnis" den vollst&auml;ndigen Pfad zum <i>&uuml;bergeordneten</i> Verzeichnis des Hauptinstallationsverzeichnisses der GlassFish Server-Software auf dem Host ein. Beispiel: <code>/export/glassfish3</code>.</p>
</li>
<li>
<p>Beenden Sie das Update des Knotens je nach Knotentyp.</p>
<ol type="a">
<li>
<p>Wenn der Knotentyp "CONFIG" ist, klicken Sie auf "Speichern".</p>
</li>
<li>
<p>Wenn der Knotentyp DCOM ist, befolgen Sie die Anweisungen in <a href="task-nodeupdatedcom.html">So wird das Update eines DCOM-Knotens beendet</a>.</p>
</li>
<li>
<p>Wenn der Knotentyp SSH ist, befolgen Sie die Anweisungen in <a href="task-nodeeditssh.html">So wird das Update eines SSH-Knotens beendet</a>.</p>
</li>
</ol>
</li>
</ol>
<a id="sthref237" name="sthref237"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-nodeupdatedcom.html">So wird das Update eines DCOM-Knotens beendet</a></p>
</li>
<li>
<p><a href="task-nodeeditssh.html">So wird das Update eines SSH-Knotens beendet</a></p>
</li>
<li>
<p><a href="task-createnode.html">So wird ein Knoten erstellt</a></p>
</li>
<li>
<p><a href="task-deletenode.html">So werden Knoten gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-listnodes.html">So werden alle Knoten in der aktuellen Domain aufgef&uuml;hrt</a></p>
</li>
<li>
<p><a href="task-pingnode.html">So wird getestet, ob ein Knoten zug&auml;nglich ist</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
