<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-javamailsessioncreate" name="ref-javamailsessioncreate"></a></p>

<h4><a id="sthref19" name="sthref19"></a>&#49352; JavaMail &#49464;&#49496;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>[&#49352; JavaMail &#49464;&#49496;] &#54168;&#51060;&#51648;&#50640;&#49436;&#45716; JavaMail &#49464;&#49496; &#47532;&#49548;&#49828;&#47484; &#49373;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>[&#49352; JavaMail &#49464;&#49496;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#50741;&#49496;&#51060; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>JNDI &#51060;&#47492;</dt>
<dd>
<p>&#47700;&#51068; &#49464;&#49496;&#51012; &#49885;&#48324;&#54616;&#45716; &#44256;&#50976;&#54620; &#51060;&#47492;&#51077;&#45768;&#45796;. JavaMail &#47532;&#49548;&#49828;&#50640; &#51060;&#47492; &#51648;&#51221; &#54616;&#50948; &#52968;&#53581;&#49828;&#53944; &#51217;&#46160;&#50612; <code>mail/</code>&#51012; &#49324;&#50857;&#54633;&#45768;&#45796;. &#50696;: <code>mail/MySession</code>. &#51060;&#47492;&#50640;&#45716; &#50689;&#49707;&#51088;, &#48145;&#51460;, &#45824;&#49884; &#46608;&#45716; &#51216; &#47928;&#51088;&#47564; &#49324;&#50857;&#54644;&#50556; &#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#47700;&#51068; &#54840;&#49828;&#53944;</dt>
<dd>
<p>&#44592;&#48376; &#47700;&#51068; &#49436;&#48260;&#51032; &#54840;&#49828;&#53944; &#51060;&#47492;&#51077;&#45768;&#45796;. &#54532;&#47196;&#53664;&#53084; &#44288;&#47144; &#54840;&#49828;&#53944; &#49549;&#49457;&#51012; &#51228;&#44277;&#54616;&#51648; &#50506;&#51004;&#47732; &#51200;&#51109;&#49548; &#48143; &#51204;&#49569; &#44061;&#52404;&#51032; &#51217;&#49549; &#47700;&#49548;&#46300;&#50640;&#49436; &#51060; &#44050;&#51012; &#49324;&#50857;&#54633;&#45768;&#45796;. &#51060;&#47492;&#51012; &#49892;&#51228; &#54840;&#49828;&#53944; &#51060;&#47492;&#51004;&#47196; &#54869;&#51064;&#54624; &#49688; &#51080;&#50612;&#50556; &#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#44592;&#48376; &#49324;&#50857;&#51088;</dt>
<dd>
<p>&#47700;&#51068; &#49436;&#48260;&#50640; &#51217;&#49549;&#54624; &#46412; &#51077;&#47141;&#54624; &#49324;&#50857;&#51088; &#51060;&#47492;&#51077;&#45768;&#45796;. &#54532;&#47196;&#53664;&#53084; &#44288;&#47144; &#49324;&#50857;&#51088; &#51060;&#47492; &#49549;&#49457;&#51012; &#51228;&#44277;&#54616;&#51648; &#50506;&#51004;&#47732; &#51200;&#51109;&#49548; &#48143; &#51204;&#49569; &#44061;&#52404;&#51032; &#51217;&#49549; &#47700;&#49548;&#46300;&#50640;&#49436; &#51060; &#44050;&#51012; &#49324;&#50857;&#54633;&#45768;&#45796;. &#49324;&#50857;&#51088; &#51060;&#47492;&#50640;&#45716; &#50689;&#49707;&#51088;, &#48145;&#51460;, &#45824;&#49884; &#46608;&#45716; &#51216; &#47928;&#51088;&#47564; &#49324;&#50857;&#54644;&#50556; &#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#44592;&#48376; &#48372;&#45240; &#49324;&#46988; &#51452;&#49548;</dt>
<dd>
<p>&#44592;&#48376; &#49324;&#50857;&#51088;&#51032; &#51204;&#51088; &#47700;&#51068; &#51452;&#49548;&#51077;&#45768;&#45796;. &#54805;&#49885;&#51008; <i>username</i><code>@</code><i>host</i>.<i>domain</i>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49444;&#47749;</dt>
<dd>
<p>&#51060; &#47700;&#51068; &#49464;&#49496;&#50640; &#45824;&#54620; &#49444;&#47749;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49345;&#53468;</dt>
<dd>
<p>&#47700;&#51068; &#49464;&#49496;&#51032; &#49345;&#53468;&#51077;&#45768;&#45796;. &#47700;&#51068; &#49464;&#49496;&#51008; &#49324;&#50857; &#46608;&#45716; &#49324;&#50857; &#50504;&#54632;&#51004;&#47196; &#49444;&#51221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; &#49324;&#50857;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51200;&#51109;&#49548; &#54532;&#47196;&#53664;&#53084;</dt>
<dd>
<p>&#47700;&#51068; &#49436;&#48260;&#50640; &#51217;&#49549;&#54616;&#50668; &#47700;&#49884;&#51648;&#47484; &#44160;&#49353;&#54616;&#44256; &#54616;&#45208; &#51060;&#49345;&#51032; &#54260;&#45908;&#50640; &#47700;&#49884;&#51648;&#47484; &#51200;&#51109;&#54616;&#45716; &#51200;&#51109;&#49548; &#54532;&#47196;&#53664;&#53084; &#49436;&#48708;&#49828;&#51077;&#45768;&#45796;. &#54728;&#50857;&#46104;&#45716; &#44050;&#51008; <code>imap</code>, <code>pop3</code>, <code>imaps</code>&middot;&#48143; <code>pop3s</code>&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>imap</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51200;&#51109;&#49548; &#54532;&#47196;&#53664;&#53084; &#53364;&#47000;&#49828;</dt>
<dd>
<p>&#51200;&#51109;&#49548;&#50640; &#45824;&#54620; &#49436;&#48708;&#49828; &#51228;&#44277;&#51088; &#44396;&#54788; &#53364;&#47000;&#49828;&#51077;&#45768;&#45796;. &#54728;&#50857;&#46104;&#45716; &#44050;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<ul>
<li>
<p><code>com.sun.mail.imap.IMAPStore</code></p>
</li>
<li>
<p><code>com.sun.mail.pop3.POP3Store</code></p>
</li>
<li>
<p><code>com.sun.mail.imap.IMAPSSLStore</code></p>
</li>
<li>
<p><code>com.sun.mail.pop3.POP3SSLStore</code></p>
</li>
</ul>
<p>&#44592;&#48376;&#44050;&#51008; <code>com.sun.mail.imap.IMAPStore</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51204;&#49569; &#54532;&#47196;&#53664;&#53084;</dt>
<dd>
<p>&#47700;&#49884;&#51648;&#47484; &#48372;&#45236;&#45716; &#51204;&#49569; &#54532;&#47196;&#53664;&#53084; &#49436;&#48708;&#49828;&#51077;&#45768;&#45796;. &#54728;&#50857;&#46104;&#45716; &#44050;&#51008; <code>smtp</code> &#48143; <code>smtps</code>&#51077;&#45768;&#45796;. &#44592;&#48376;&#44050;&#51008; <code>smtp</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51204;&#49569; &#54532;&#47196;&#53664;&#53084; &#53364;&#47000;&#49828;</dt>
<dd>
<p>&#51204;&#49569;&#50640; &#45824;&#54620; &#49436;&#48708;&#49828; &#51228;&#44277;&#51088; &#44396;&#54788; &#53364;&#47000;&#49828;&#51077;&#45768;&#45796;. &#54728;&#50857;&#46104;&#45716; &#44050;&#51008; &#45796;&#51020;&#44284; &#44057;&#49845;&#45768;&#45796;.</p>
<ul>
<li>
<p><code>com.sun.mail.smtp.SMTPTransport</code></p>
</li>
<li>
<p><code>com.sun.mail.smtp.SMTPSSLTransport</code></p>
</li>
</ul>
<p>&#44592;&#48376;&#44050;&#51008; <code>com.sun.mail.smtp.SMTPTransport</code>&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#46356;&#48260;&#44536;</dt>
<dd>
<p>&#51060; &#50741;&#49496;&#51012; &#49440;&#53469;&#54616;&#47732; &#51060; &#47532;&#49548;&#49828;&#50640; &#45824;&#54620; &#46356;&#48260;&#44613;&#51060; &#49324;&#50857;&#51004;&#47196; &#49444;&#51221;&#46121;&#45768;&#45796;. JavaMail &#47196;&#44536; &#47112;&#48296;&#51012; <code>FINE</code> &#51060;&#49345;&#51004;&#47196; &#49444;&#51221;&#54620; &#44221;&#50864; &#46356;&#48260;&#44613; &#52636;&#47141;&#51060; &#49373;&#49457;&#46104;&#50612; &#49884;&#49828;&#53596; &#47196;&#44536; &#54028;&#51068;&#50640; &#54252;&#54632;&#46121;&#45768;&#45796;. &#47196;&#44536; &#47112;&#48296; &#49444;&#51221;&#50640; &#45824;&#54620; &#51088;&#49464;&#54620; &#45236;&#50857;&#51008; <a href="../../../common/en/help/task-eelogginglevels.html">&#47196;&#44536; &#47112;&#48296;&#51012; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;</a>&#51012; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;.</p>
</dd>
<dt>&#52628;&#44032; &#49549;&#49457;</dt>
<dd>
<p>JavaMail &#49464;&#49496;&#50640; &#45824;&#54620; &#52628;&#44032; &#49549;&#49457;&#51077;&#45768;&#45796;. &#49324;&#50857; &#44032;&#45733;&#54620; &#49549;&#49457; &#47785;&#47197;&#51008; JavaMail API &#49444;&#47749;&#49436;(<code><a href="http://java.sun.com/products/javamail/javadocs/index.html">http://java.sun.com/products/javamail/javadocs/index.html</a></code>)&#47484; &#52280;&#51312;&#54616;&#49901;&#49884;&#50724;. &#52628;&#44032; &#49549;&#49457;&#51008; <code>mail-</code>&#47196; &#49884;&#51089;&#54644;&#50556; &#54616;&#47728; &#47560;&#52840;&#54364;&#44032; &#50500;&#45772; &#54616;&#51060;&#54536;&#51012; &#44396;&#48516;&#51088;&#47196; &#49324;&#50857;&#54644;&#50556; &#54633;&#45768;&#45796;. &#50696;&#47484; &#46308;&#50612; <code>mail-debug</code>&#45716; &#50732;&#48148;&#47476;&#47728; <code>mail.debug</code>&#45716; &#51096;&#47803;&#46104;&#50632;&#49845;&#45768;&#45796;. GlassFish Server &#48177;&#50644;&#46300;&#45716; &#54616;&#51060;&#54536;&#51012; JavaMail API&#50640;&#49436; &#50836;&#44396;&#54616;&#45716; &#47560;&#52840;&#54364;&#47196; &#48320;&#54872;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#45824;&#49345;</dt>
<dd>
<p>JavaMail &#49464;&#49496;&#50640; &#45824;&#54620; &#53364;&#47084;&#49828;&#53552; &#48143; &#46021;&#47549;&#54805; &#51064;&#49828;&#53556;&#49828;&#51077;&#45768;&#45796;. &#50896;&#54616;&#45716; &#45824;&#49345;&#51012; [&#49440;&#53469;&#54620; &#45824;&#49345;] &#50676;&#47196; &#51060;&#46041;&#54616;&#47140;&#47732; [&#52628;&#44032;] &#48143; [&#47784;&#46160; &#52628;&#44032;] &#45800;&#52628;&#47484; &#49324;&#50857;&#54633;&#45768;&#45796;. &#54596;&#50836;&#54616;&#51648; &#50506;&#51008; &#45824;&#49345;&#51012; [&#49324;&#50857; &#44032;&#45733;&#54620; &#45824;&#49345;] &#50676;&#47196; &#51060;&#46041;&#54616;&#47140;&#47732; [&#51228;&#44144;] &#48143; [&#47784;&#46160; &#51228;&#44144;] &#45800;&#52628;&#47484; &#49324;&#50857;&#54633;&#45768;&#45796;.</p>
<p>&#51060; &#50741;&#49496;&#51008; &#53364;&#47084;&#49828;&#53552;&#45208; &#46021;&#47549;&#54805; &#51064;&#49828;&#53556;&#49828;&#44032; &#46020;&#47700;&#51064;&#50640; &#49373;&#49457;&#46108; &#44221;&#50864;&#50640;&#47564; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="GHJML119" name="GHJML119"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="task-javamailsessioncreate.html">JavaMail &#49464;&#49496;&#51012; &#49373;&#49457;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-javamailsessionsedit.html">JavaMail &#49464;&#49496;&#51012; &#54200;&#51665;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
<li>
<p><a href="task-javamailsessionsdelete.html">JavaMail &#49464;&#49496;&#51012; &#49325;&#51228;&#54616;&#45716; &#48169;&#48277;</a></p>
</li>
</ul>
<a id="GHJML120" name="GHJML120"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00035"><code>create-javamail-resource</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00172"><code>list-javamail-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00087"><code>delete-javamail-resource</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
