<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-batchjobsconfiguration" name="ref-batchjobsconfiguration"></a></p>

<h4>&#51068;&#44292; &#52376;&#47532; &#47088;&#53440;&#51076; &#44396;&#49457;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>GlassFish Server&#50640;&#49436;&#45716; &#51068;&#44292; &#52376;&#47532; &#51089;&#50629;&#51032; &#51068;&#51221; &#51105;&#44592; &#48143; &#49892;&#54665;&#51012; &#50948;&#54644; &#51068;&#44292; &#52376;&#47532; &#47088;&#53440;&#51076;&#51012; &#51228;&#44277;&#54633;&#45768;&#45796;. &#51068;&#44292; &#52376;&#47532; &#51089;&#50629;&#51008; &#45824;&#44060; &#50668;&#47084; &#45800;&#44228;&#44032; &#54252;&#54632;&#46108;, &#50724;&#47019;&#46041;&#50504; &#49892;&#54665;&#46104;&#45716; &#45824;&#47049; &#51089;&#50629;&#51077;&#45768;&#45796;. &#51068;&#44292; &#52376;&#47532; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640;&#49436;&#45716; &#51068;&#44292; &#52376;&#47532; &#47088;&#53440;&#51076;&#50640; &#51089;&#50629;&#51012; &#51228;&#52636;&#54616;&#44256;, &#44033; &#45800;&#44228;&#47484; &#49892;&#54665;&#54616;&#45716; &#48169;&#48277; &#48143; &#49884;&#44592;&#50640; &#45824;&#54620; &#51648;&#52840;&#51012; &#51228;&#44277;&#54633;&#45768;&#45796;. &#51068;&#44292; &#52376;&#47532; &#47088;&#53440;&#51076;&#51008; &#44033; &#45800;&#44228;&#47484; &#52376;&#47532;&#54616;&#44256; &#51089;&#50629;&#50640; &#45824;&#54620; &#51221;&#48372;&#47484; &#51089;&#50629; &#51200;&#51109;&#49548;&#50640; &#51200;&#51109;&#54633;&#45768;&#45796;. GlassFish Server&#50640;&#49436; &#51089;&#50629; &#51200;&#51109;&#49548;&#45716; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#51077;&#45768;&#45796;.</p>
<p>[&#51068;&#44292; &#52376;&#47532; &#47088;&#53440;&#51076; &#44396;&#49457;] &#54168;&#51060;&#51648;&#47484; &#49324;&#50857;&#54616;&#50668; &#51068;&#44292; &#52376;&#47532; &#47088;&#53440;&#51076;&#51032; &#44396;&#49457;&#51012; &#48372;&#44256; &#48320;&#44221;&#54633;&#45768;&#45796;. &#51068;&#44292; &#52376;&#47532; &#47088;&#53440;&#51076;&#51008; &#44288;&#47532; &#45824;&#49345; &#49892;&#54665;&#44592; &#49436;&#48708;&#49828; &#48143; &#45936;&#51060;&#53552; &#49548;&#49828;&#47484; &#49324;&#50857;&#54616;&#50668; &#51068;&#44292; &#52376;&#47532; &#51089;&#50629;&#51012; &#49892;&#54665;&#54633;&#45768;&#45796;. &#44288;&#47532; &#45824;&#49345; &#49892;&#54665;&#44592; &#49436;&#48708;&#49828;&#45716; &#51089;&#50629;&#50640; &#49828;&#47112;&#46300;&#47484; &#51228;&#44277;&#54616;&#47728;, &#45936;&#51060;&#53552; &#49548;&#49828;&#45716; &#51089;&#50629; &#51221;&#48372;&#47484; &#51200;&#51109;&#54633;&#45768;&#45796;. &#51068;&#44292; &#47088;&#53440;&#51076; &#44396;&#49457; &#45936;&#51060;&#53552;&#45716; <code>domain.xml</code>&#51032; <code>config</code> &#50836;&#49548;&#50640; &#51200;&#51109;&#46121;&#45768;&#45796;.</p>
<p>[&#51068;&#44292; &#52376;&#47532; &#47088;&#53440;&#51076; &#44396;&#49457;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#51221;&#48372;&#44032; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#51064;&#49828;&#53556;&#49828; &#51060;&#47492;</dt>
<dt>&#53364;&#47084;&#49828;&#53552; &#51060;&#47492;</dt>
<dd>
<p>&#44396;&#49457;&#51060; &#51201;&#50857;&#46104;&#45716; GlassFish &#53364;&#47084;&#49828;&#53552; &#46608;&#45716; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828; &#51060;&#47492;&#51077;&#45768;&#45796;. &#51069;&#44592; &#51204;&#50857; &#54596;&#46300;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#49892;&#54665;&#44592; &#49436;&#48708;&#49828; &#51312;&#54924; &#51060;&#47492;</dt>
<dd>
<p>&#51068;&#44292; &#52376;&#47532; &#51089;&#50629;&#50640; &#49828;&#47112;&#46300;&#47484; &#51228;&#44277;&#54616;&#45716; &#44288;&#47532; &#45824;&#49345; &#49892;&#54665;&#44592; &#49436;&#48708;&#49828;&#51032; JNDI &#51312;&#54924; &#51060;&#47492;&#51077;&#45768;&#45796;. &#44592;&#48376; &#44288;&#47532; &#45824;&#49345; &#49892;&#54665;&#44592; &#49436;&#48708;&#49828;&#45716; <code>concurrent/__defaultManagedExecutorService</code>&#51077;&#45768;&#45796;.</p>
<p>&#51068;&#44292; &#52376;&#47532; &#51089;&#50629;&#51060; &#51068;&#44292; &#52376;&#47532; &#47088;&#53440;&#51076;&#50640; &#51228;&#52636;&#46108; &#54980; &#51089;&#50629; &#49892;&#54665;&#50640; &#50689;&#54693;&#51012; &#51452;&#51648; &#50506;&#44256; &#44288;&#47532; &#45824;&#49345; &#49892;&#54665;&#44592; &#49436;&#48708;&#49828;&#47484; &#48320;&#44221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#45936;&#51060;&#53552; &#49548;&#49828; &#51312;&#54924; &#51060;&#47492;</dt>
<dd>
<p>&#54788;&#51116; &#48143; &#44284;&#44144; &#51068;&#44292; &#52376;&#47532; &#51089;&#50629;&#50640; &#45824;&#54620; &#51221;&#48372;&#47484; &#51200;&#51109;&#54616;&#45716; &#45936;&#51060;&#53552; &#49548;&#49828;&#51032; JNDI &#51312;&#54924; &#51060;&#47492;&#51077;&#45768;&#45796;. &#44592;&#48376; &#45936;&#51060;&#53552; &#49548;&#49828;&#45716; <code>jdbc/__TimerPool</code>&#51077;&#45768;&#45796;.</p>
<p>&#52395;&#48264;&#51704; &#51068;&#44292; &#52376;&#47532; &#51089;&#50629;&#51060; &#49892;&#54665;&#51012; &#50948;&#54644; &#51068;&#44292; &#52376;&#47532; &#47088;&#53440;&#51076;&#50640; &#51228;&#52636;&#46108; &#54980;&#50640;&#45716; &#45936;&#51060;&#53552; &#49548;&#49828;&#47484; &#48320;&#44221;&#54616;&#51648; &#47560;&#49901;&#49884;&#50724;. &#45936;&#51060;&#53552; &#49548;&#49828;&#47484; &#48320;&#44221;&#54644;&#50556; &#54620;&#45796;&#47732; &#46020;&#47700;&#51064;&#51012; &#51221;&#51648;&#54664;&#45796;&#44032; &#51116;&#49884;&#51089;&#54620; &#54980; &#50612;&#46500; &#51089;&#50629;&#46020; &#49884;&#51089;&#46104;&#44144;&#45208; &#51116;&#49884;&#51089;&#46104;&#44592; &#51204;&#50640; &#48320;&#44221; &#51089;&#50629;&#51012; &#49688;&#54665;&#54616;&#49901;&#49884;&#50724;. &#51068;&#45800; &#45936;&#51060;&#53552; &#49548;&#49828;&#44032; &#48320;&#44221;&#46104;&#47732; &#51060;&#51204; &#45936;&#51060;&#53552; &#49548;&#49828;&#50640; &#51200;&#51109;&#46108; &#51221;&#48372;&#50640; &#50529;&#49464;&#49828;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.</p>
</dd>
</dl>
<a id="sthref31" name="sthref31"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="tasks-topic-group004.html#CEGEEGBB">&#51068;&#44292; &#52376;&#47532; &#47088;&#53440;&#51076;&#51012; &#44396;&#49457;&#54616;&#47140;&#47732;</a></p>
</li>
<li>
<p><a href="tasks-topic-group002.html#CEGEIGCJ">&#51068;&#44292; &#52376;&#47532; &#51089;&#50629; &#49892;&#54665;&#51012; &#48372;&#47140;&#47732;</a></p>
</li>
</ul>
<a id="sthref32" name="sthref32"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM897"><code>set-batch-runtime-configuration</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM863"><code>list-batch-runtime-configuration</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM861"><code>list-batch-jobs</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM884"><code>list-batch-job-executions</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM895"><code>list-batch-job-steps</code>(1)</a></p>
</li>
</ul>




<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
