<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-batchjobslisting" name="ref-batchjobslisting"></a></p>

<h4>&#51068;&#44292; &#52376;&#47532; &#51089;&#50629; &#49892;&#54665;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>GlassFish Server&#50640;&#49436;&#45716; &#51068;&#44292; &#52376;&#47532; &#51089;&#50629;&#51032; &#51068;&#51221; &#51105;&#44592; &#48143; &#49892;&#54665;&#51012; &#50948;&#54644; &#51068;&#44292; &#52376;&#47532; &#47088;&#53440;&#51076;&#51012; &#51228;&#44277;&#54633;&#45768;&#45796;. &#51068;&#44292; &#52376;&#47532; &#51089;&#50629;&#51008; &#45824;&#44060; &#50668;&#47084; &#45800;&#44228;&#44032; &#54252;&#54632;&#46108;, &#50724;&#47019;&#46041;&#50504; &#49892;&#54665;&#46104;&#45716; &#45824;&#47049; &#51089;&#50629;&#51077;&#45768;&#45796;. &#51068;&#44292; &#52376;&#47532; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640;&#49436;&#45716; &#51068;&#44292; &#52376;&#47532; &#47088;&#53440;&#51076;&#50640; &#51089;&#50629;&#51012; &#51228;&#52636;&#54616;&#44256;, &#44033; &#45800;&#44228;&#47484; &#49892;&#54665;&#54616;&#45716; &#48169;&#48277; &#48143; &#49884;&#44592;&#50640; &#45824;&#54620; &#51648;&#52840;&#51012; &#51228;&#44277;&#54633;&#45768;&#45796;. &#51068;&#44292; &#52376;&#47532; &#47088;&#53440;&#51076;&#51008; &#44033; &#45800;&#44228;&#47484; &#52376;&#47532;&#54616;&#44256; &#51089;&#50629;&#50640; &#45824;&#54620; &#51221;&#48372;&#47484; &#51089;&#50629; &#51200;&#51109;&#49548;&#50640; &#51200;&#51109;&#54633;&#45768;&#45796;. GlassFish Server&#50640;&#49436; &#51089;&#50629; &#51200;&#51109;&#49548;&#45716; &#45936;&#51060;&#53552;&#48288;&#51060;&#49828;&#51077;&#45768;&#45796;.</p>
<p>[&#51068;&#44292; &#52376;&#47532; &#51089;&#50629; &#49892;&#54665;] &#54168;&#51060;&#51648;&#47484; &#49324;&#50857;&#54616;&#50668; &#51068;&#44292; &#52376;&#47532; &#51089;&#50629;&#50640; &#45824;&#54644; &#44592;&#47197;&#46108; &#49892;&#54665;&#51032; &#49464;&#48512; &#51221;&#48372;&#47484; &#48380; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
<p>[&#51068;&#44292; &#52376;&#47532; &#51089;&#50629; &#49892;&#54665;] &#54168;&#51060;&#51648;&#50640;&#45716; &#45796;&#51020; &#51221;&#48372;&#44032; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;.</p>
<dl>
<dt>&#51064;&#49828;&#53556;&#49828; &#51060;&#47492;</dt>
<dt>&#53364;&#47084;&#49828;&#53552; &#51060;&#47492;</dt>
<dd>
<p>&#44396;&#49457;&#51060; &#51201;&#50857;&#46104;&#45716; GlassFish &#53364;&#47084;&#49828;&#53552; &#46608;&#45716; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51068;&#44292; &#52376;&#47532; &#51089;&#50629;</dt>
<dd>
<p>&#51064;&#49828;&#53556;&#49828; &#46608;&#45716; &#53364;&#47084;&#49828;&#53552;&#50640; &#45824;&#54644; &#44592;&#47197;&#46108; &#51068;&#44292; &#52376;&#47532; &#51089;&#50629; &#49892;&#54665; &#47785;&#47197;&#51077;&#45768;&#45796;. &#44033; &#49892;&#54665;&#50640; &#45824;&#54644; &#45796;&#51020; &#51221;&#48372;&#44032; &#54364;&#49884;&#46121;&#45768;&#45796;.</p>
<dl>
<dt>&#49892;&#54665; ID</dt>
<dd>
<p>&#51068;&#44292; &#52376;&#47532; &#51089;&#50629; &#49892;&#54665;&#50640; &#51648;&#51221;&#46108; ID&#51077;&#45768;&#45796;. &#49892;&#54665; ID&#47484; &#45572;&#47476;&#47732; &#54644;&#45817; &#49892;&#54665;&#50640; &#45824;&#54620; [&#51068;&#44292; &#52376;&#47532; &#51089;&#50629; &#49892;&#54665; &#49464;&#48512; &#51221;&#48372;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;. &#49352; &#49892;&#54665;&#51008; &#51089;&#50629;&#51060; &#52376;&#51020; &#49884;&#51089;&#46112; &#46412;, &#44536;&#47532;&#44256; &#44592;&#51316; &#49892;&#54665;&#51060; &#51116;&#49884;&#51089;&#46112; &#46412;&#47560;&#45796; &#49373;&#49457;&#46121;&#45768;&#45796;.</p>
</dd>
<dt>&#51089;&#50629; &#51060;&#47492;</dt>
<dd>
<p>&#51089;&#50629;&#51032; &#51060;&#47492;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51068;&#44292; &#52376;&#47532; &#49345;&#53468;</dt>
<dd>
<p>&#51068;&#44292; &#52376;&#47532; &#47088;&#53440;&#51076;&#50640; &#51032;&#54644; &#49444;&#51221;&#46108; &#49892;&#54665; &#49345;&#53468;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51333;&#47308; &#49345;&#53468;</dt>
<dd>
<p>&#54644;&#45817; &#51089;&#50629;&#50640; &#45824;&#54620; &#51089;&#50629; XML &#46608;&#45716; &#51068;&#44292; &#52376;&#47532; &#51025;&#50857; &#54532;&#47196;&#44536;&#47016;&#50640; &#51032;&#54644; &#49444;&#51221;&#46108; &#49892;&#54665; &#49345;&#53468;&#51077;&#45768;&#45796;. &#51333;&#47308; &#49345;&#53468;&#44032; &#47749;&#49884;&#51201;&#51004;&#47196; &#45824;&#52404;&#46104;&#51648; &#50506;&#45716; &#54620; &#44592;&#48376;&#51201;&#51004;&#47196; &#51333;&#47308; &#49345;&#53468;&#50752; &#51068;&#44292; &#52376;&#47532; &#49345;&#53468;&#45716; &#46041;&#51068;&#54633;&#45768;&#45796;.</p>
</dd>
<dt>&#51064;&#49828;&#53556;&#49828; ID</dt>
<dd>
<p>&#51068;&#44292; &#52376;&#47532; &#51089;&#50629;&#51032; &#51064;&#49828;&#53556;&#49828;&#50640; &#51648;&#51221;&#46108; ID&#51077;&#45768;&#45796;. &#51068;&#44292; &#52376;&#47532; &#51089;&#50629;&#51032; &#51064;&#49828;&#53556;&#49828;&#50640;&#45716; &#49892;&#54665;&#51060; &#50668;&#47084; &#44060; &#54252;&#54632;&#46112; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</dd>
<dt>&#49884;&#51089; &#49884;&#44036;</dt>
<dd>
<p>&#49892;&#54665;&#51060; &#49884;&#51089;&#46108; &#49884;&#44036;&#51077;&#45768;&#45796;.</p>
</dd>
<dt>&#51333;&#47308; &#49884;&#44036;</dt>
<dd>
<p>&#51089;&#50629;&#51060; &#51333;&#47308;&#46108; &#49884;&#44036;&#51077;&#45768;&#45796;.</p>
</dd>
</dl>
</dd>
</dl>
<a id="sthref26" name="sthref26"></a>
<h5>&#44288;&#47144; &#51089;&#50629;</h5>
<ul>
<li>
<p><a href="tasks-topic-group002.html#CEGEIGCJ">&#51068;&#44292; &#52376;&#47532; &#51089;&#50629; &#49892;&#54665;&#51012; &#48372;&#47140;&#47732;</a></p>
</li>
<li>
<p><a href="tasks-topic-group004.html#CEGEEGBB">&#51068;&#44292; &#52376;&#47532; &#47088;&#53440;&#51076;&#51012; &#44396;&#49457;&#54616;&#47140;&#47732;</a></p>
</li>
</ul>
<a id="GHJML141" name="GHJML141"></a>
<h5>&#44288;&#47144; asadmin &#47749;&#47161;</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM861"><code>list-batch-jobs</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM884"><code>list-batch-job-executions</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM895"><code>list-batch-job-steps</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM863"><code>list-batch-runtime-configuration</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM897"><code>set-batch-runtime-configuration</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
