<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="CEGEEGBB" name="CEGEEGBB"></a></p>
<!-- infolevel="all" infotype="General" -->
<h4><a id="sthref6" name="sthref6"></a>&#51068;&#44292; &#52376;&#47532; &#47088;&#53440;&#51076;&#51012; &#44396;&#49457;&#54616;&#47140;&#47732;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#53456;&#49353; &#53944;&#47532;&#50640;&#49436; &#51068;&#44292; &#52376;&#47532; &#51089;&#50629; &#49892;&#54665;&#51012; &#48372;&#47140;&#45716; GlassFish Server &#53364;&#47084;&#49828;&#53552; &#46608;&#45716; &#49436;&#48260; &#51064;&#49828;&#53556;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>[&#51068;&#48152; &#51221;&#48372;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51068;&#44292; &#52376;&#47532;] &#53485;&#51012; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>[&#51068;&#44292; &#52376;&#47532; &#51089;&#50629; &#49892;&#54665;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#44396;&#49457;] &#53485;&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
<p>[&#51068;&#44292; &#52376;&#47532; &#47088;&#53440;&#51076; &#44396;&#49457;] &#54168;&#51060;&#51648;&#44032; &#50676;&#47549;&#45768;&#45796;. &#47088;&#53440;&#51076;&#51008; &#44288;&#47532; &#45824;&#49345; &#49892;&#54665;&#44592; &#49436;&#48708;&#49828; &#48143; &#45936;&#51060;&#53552; &#49548;&#49828;&#47484; &#49324;&#50857;&#54616;&#50668; &#51068;&#44292; &#52376;&#47532; &#51089;&#50629;&#51012; &#49892;&#54665;&#54633;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#49892;&#54665;&#44592; &#49436;&#48708;&#49828; &#51312;&#54924; &#51060;&#47492;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#51068;&#44292; &#52376;&#47532; &#51089;&#50629;&#50640; &#49828;&#47112;&#46300;&#47484; &#51228;&#44277;&#54616;&#45716; &#45936; &#49324;&#50857;&#54624; &#44288;&#47532; &#45824;&#49345; &#49892;&#54665;&#44592; &#49436;&#48708;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376; &#44288;&#47532; &#45824;&#49345; &#49892;&#54665;&#44592; &#49436;&#48708;&#49828;&#45716; <code>concurrent/__defaultManagedExecutorService</code>&#51077;&#45768;&#45796;. &#51068;&#44292; &#52376;&#47532; &#51089;&#50629;&#51060; &#51068;&#44292; &#52376;&#47532; &#47088;&#53440;&#51076;&#50640; &#51228;&#52636;&#46108; &#54980; &#51089;&#50629; &#49892;&#54665;&#50640; &#50689;&#54693;&#51012; &#51452;&#51648; &#50506;&#44256; &#44288;&#47532; &#45824;&#49345; &#49892;&#54665;&#44592; &#49436;&#48708;&#49828;&#47484; &#48320;&#44221;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#45936;&#51060;&#53552; &#49548;&#49828; &#51312;&#54924; &#51060;&#47492;] &#46300;&#47213;&#45796;&#50868; &#47785;&#47197;&#50640;&#49436; &#51089;&#50629; &#51221;&#48372;&#47484; &#51200;&#51109;&#54616;&#45716; &#45936; &#49324;&#50857;&#54624; &#45936;&#51060;&#53552; &#49548;&#49828;&#47484; &#49440;&#53469;&#54633;&#45768;&#45796;.</p>
<p>&#44592;&#48376; &#45936;&#51060;&#53552; &#49548;&#49828;&#45716; <code>jdbc/__TimerPool</code>&#51077;&#45768;&#45796;. &#52395;&#48264;&#51704; &#51068;&#44292; &#52376;&#47532; &#51089;&#50629;&#51060; &#49892;&#54665;&#51012; &#50948;&#54644; &#51068;&#44292; &#52376;&#47532; &#47088;&#53440;&#51076;&#50640; &#51228;&#52636;&#46108; &#54980;&#50640;&#45716; &#45936;&#51060;&#53552; &#49548;&#49828;&#47484; &#48320;&#44221;&#54616;&#51648; &#47560;&#49901;&#49884;&#50724;. &#45936;&#51060;&#53552; &#49548;&#49828;&#47484; &#48320;&#44221;&#54644;&#50556; &#54620;&#45796;&#47732; &#46020;&#47700;&#51064;&#51012; &#51221;&#51648;&#54664;&#45796;&#44032; &#51116;&#49884;&#51089;&#54620; &#54980; &#50612;&#46500; &#51089;&#50629;&#46020; &#49884;&#51089;&#46104;&#44144;&#45208; &#51116;&#49884;&#51089;&#46104;&#44592; &#51204;&#50640; &#48320;&#44221; &#51089;&#50629;&#51012; &#49688;&#54665;&#54616;&#49901;&#49884;&#50724;. &#51068;&#45800; &#45936;&#51060;&#53552; &#49548;&#49828;&#44032; &#48320;&#44221;&#46104;&#47732; &#51060;&#51204; &#45936;&#51060;&#53552; &#49548;&#49828;&#50640; &#51200;&#51109;&#46108; &#51221;&#48372;&#50640; &#50529;&#49464;&#49828;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;.</p>
</li>
<li>
<p>[&#51200;&#51109;]&#51012; &#45572;&#47493;&#45768;&#45796;.</p>
</li>
</ol>
<a id="sthref7" name="sthref7"></a>
<h5>&#44288;&#47144; &#54637;&#47785;</h5>
<p><a href="tasks-topic-group002.html#CEGEIGCJ">&#51068;&#44292; &#52376;&#47532; &#51089;&#50629; &#49892;&#54665;&#51012; &#48372;&#47140;&#47732;</a></p>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
