<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmxconnectoredit" name="task-jmxconnectoredit"></a></p>

<h4><a id="sthref110" name="sthref110"></a>Per modificare il connettore JMX</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilizzare il servizio di amministrazione per configurare il connettore JMX remoto conforme allo standard JSR 160.</p>
<p>Il connettore JMX remoto conforme allo standard JSR 160 gestisce le comunicazioni tra i client JMX, quale JConsole, e il servizio JMX per la gestione dei domini.</p>
<ol>
<li>
<p>Espandere il nodo Configurazione nell'albero di navigazione.</p>
</li>
<li>
<p>Nel nodo Configurazione selezionare il nodo Servizio di amministrazione.</p>
<p>Viene visualizzata la pagina Modifica connettore JMX.</p>
</li>
<li>
<p>Selezionare la casella di controllo Abilitato dell'opzione Sicurezza per impostare la cifratura della comunicazione JMX.</p>
<p>Questa opzione &egrave; disabilitata per impostazione predefinita.</p>
</li>
<li>
<p>Nel campo Indirizzo digitare l'indirizzo IP del servizio di denominazione in cui &egrave; registrato lo stub del server del connettore JMX.</p>
<p>Non si tratta della porta del socket server che esegue la comunicazione JMX effettiva, bens&igrave; dell'indirizzo dell'interfaccia di rete in cui viene avviato il registro RMI. Se il sistema dispone di pi&ugrave; interfacce di rete, modificare questo valore in modo che venga selezionata solo un'interfaccia specifica. Il valore predefinito &egrave; <code>0.0.0.0</code>.</p>
</li>
<li>
<p>Nel campo Porta digitare il numero della porta su cui il servizio di denominazione (registro RMI) ascolta le connessioni al client RMI.</p>
<p>Questo servizio di denominazione viene utilizzato esclusivamente per il download degli stub RMI. Se la porta predefinita &egrave; occupata, viene utilizzata una porta libera. I valori validi sono compresi tra 1 e 65535. Sui sistemi UNIX, la creazione di socket che restano in ascolto sulle porte comprese tra 1 e 1024 richiede privilegi di utente privilegiato. Il valore predefinito &egrave; 8686.</p>
</li>
<li>
<p>Nel campo Nome realm digitare il nome che rappresenta il realm amministrativo speciale.</p>
<p>Tutte le operazioni di autenticazione vengono gestite da questo realm. Il valore predefinito &egrave; <code>admin-realm</code>.</p>
</li>
<li>
<p>Nella sezione Propriet&agrave; aggiuntive, specificare le propriet&agrave; aggiuntive.</p>
<p>In GlassFish Server varie propriet&agrave; vengono specificate per impostazione predefinita.</p>
<ul>
<li>
<p>Per aggiungere una propriet&agrave;, fare clic sul pulsante Aggiungi propriet&agrave;. Nella riga vuota visualizzata, digitare il nome della propriet&agrave; nel campo Nome e il valore della propriet&agrave; nel campo Valore.</p>
</li>
<li>
<p>Per modificare una propriet&agrave;, &egrave; necessario modificare il valore del campo Valore della propriet&agrave;.</p>
</li>
<li>
<p>Per eliminare una propriet&agrave;, selezionare la casella di controllo a sinistra del campo Nome corrispondente alla propriet&agrave; da eliminare, quindi fare clic sul pulsante Elimina propriet&agrave;.</p>
</li>
</ul>
</li>
<li>
<p>Fare clic su Salva.</p>
</li>
<li>
<p>Se &egrave; stata selezionata la casella di controllo Abilitato dell'opzione Sicurezza, attenersi alla procedura descritta in <a href="task-jmxconnectorssledit.html">Per modificare le impostazioni SSL per il connettore JMX</a>.</p>
</li>
</ol>
<a id="GHCOM320" name="GHCOM320"></a>
<h5>Vedere anche</h5>
<p><a href="task-jmxconnectorssledit.html">Per modificare le impostazioni SSL per il connettore JMX</a></p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
