<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsavailability" name="ref-jmsavailability"></a><a id="GHJMS00009" name="GHJMS00009"></a></p>

<h4><a id="sthref71" name="sthref71"></a><a id="sthref72" name="sthref72"></a>JMS &#21487;&#29992;&#24615;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20351;&#29992;&ldquo;JMS &#21487;&#29992;&#24615;&rdquo;&#39029;&#21487;&#20197;&#23558; &#28040;&#24687;&#38431;&#21015; &#20013;&#20171;&#38598;&#32676;&#37197;&#32622;&#20026;&#22788;&#29702; GlassFish Server &#38598;&#32676;&#12290;</p>

<hr>
<p><b>&#27880;&#24847;:</b></p>
&#22312;&#20351;&#29992;&ldquo;JMS &#21487;&#29992;&#24615;&rdquo;&#39029;&#37325;&#26032;&#37197;&#32622;&#29616;&#26377;&#38598;&#32676;&#21069;&#65292;&#24517;&#39035;&#25353;&#29031;&#31227;&#26893;&#21040;&#20854;&#20182;&#31867;&#22411;&#20013;&#20171;&#38598;&#32676;&#30340;&#29305;&#27530;&#36807;&#31243;&#36827;&#34892;&#25805;&#20316;&#65292;&#22914; <i>Oracle GlassFish Server High Availability Administration Guide</i> &#30340; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSHAG00158">To Migrate Between Types of Embedded or Local Conventional Broker Clusters</a> &#20013;&#25152;&#36848;&#12290;&#22914;&#26524;&#25191;&#34892;&#36825;&#20123;&#29305;&#27530;&#36807;&#31243;&#26102;&#22833;&#36133;&#65292;&#21017;&#20250;&#23548;&#33268;&#25968;&#25454;&#25439;&#22833;&#25110;&#25439;&#22351;&#65292;&#29978;&#33267;&#20250;&#23548;&#33268;&#23433;&#35013;&#19981;&#21487;&#29992;&#65292;&#20855;&#20307;&#21462;&#20915;&#20110;&#23545;&#29616;&#26377;&#38598;&#32676;&#25191;&#34892;&#30340; JMS &#25805;&#20316;&#12290;
<hr>

<p>&ldquo;JMS &#21487;&#29992;&#24615;&rdquo;&#39029;&#21253;&#21547;&#20197;&#19979;&#36873;&#39033;&#12290;</p>

<hr>
<p><b>&#27880;:</b></p>
&#22914;&#26524;&#27491;&#22312;&#36816;&#34892;&#20351;&#29992;&#35813;&#37197;&#32622;&#30340;&#20219;&#20309;&#23454;&#20363;&#65292;&#21017;&ldquo;JMS &#21487;&#29992;&#24615;&rdquo;&#39029;&#20250;&#26174;&#31034;&#19968;&#20010;&#35686;&#21578;&#65292;&#23558;&#25152;&#26377;&#36873;&#39033;&#35774;&#32622;&#20026;&#21482;&#35835;&#65292;&#24182;&#19988;&#31105;&#29992;&ldquo;&#20445;&#23384;&rdquo;&#25353;&#38062;&#12290;
<hr>

<dl>
<dt>JMS &#26381;&#21153;&#31867;&#22411;</dt>
<dd>
<p>&#35201;&#22312;&#20013;&#20171;&#38598;&#32676;&#20013;&#20351;&#29992;&#30340;&#20013;&#20171; (&#22312; GlassFish Server &#20013;&#31216;&#20026; JMS &#20027;&#26426;) &#30340;&#31867;&#22411;&#12290;&#36873;&#23450;&#30340;&#31867;&#22411;&#20915;&#23450;&#20102;&#25152;&#25552;&#20379;&#30340;&#20013;&#20171;&#38598;&#32676;&#31867;&#22411;&#12290;&#20013;&#20171;&#31867;&#22411;&#22914;&#19979;&#25152;&#31034;&#12290;</p>
<dl>
<dt>&#23884;&#20837;&#24335;</dt>
<dd>
<p>&#20013;&#20171;&#37197;&#32622;&#21644;&#29983;&#21629;&#21608;&#26399;&#30001; GlassFish Server &#31649;&#29702;&#12290;&#27599;&#20010; GlassFish &#38598;&#32676;&#23454;&#20363;&#37117;&#30001;&#19982;&#23454;&#20363;&#30456;&#21516;&#30340; JVM &#20013;&#36816;&#34892;&#30340;&#20013;&#20171;&#36827;&#34892;&#22788;&#29702;&#12290;</p>
<p>&#22914;&#26524;&ldquo;JMS &#26381;&#21153;&#31867;&#22411;&rdquo;&#36873;&#39033;&#35774;&#32622;&#20026;&ldquo;&#23884;&#20837;&#24335;&rdquo;&#65292;&#21017;&#21482;&#25903;&#25345;&#24120;&#35268; &#28040;&#24687;&#38431;&#21015; &#20013;&#20171;&#38598;&#32676;&#12290;&#27492;&#26102;&#23558;&#26174;&#31034;&#29992;&#20110;&#37197;&#32622;&#24120;&#35268;&#38598;&#32676;&#30340;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#26412;&#22320;</dt>
<dd>
<p>&#20013;&#20171;&#37197;&#32622;&#21644;&#29983;&#21629;&#21608;&#26399;&#30001; GlassFish Server &#31649;&#29702;&#12290;&#27599;&#20010; GlassFish &#38598;&#32676;&#23454;&#20363;&#30001;&#19968;&#20010;&#20013;&#20171;&#22788;&#29702;&#65292;&#35813;&#20013;&#20171;&#36816;&#34892;&#22312;&#19982;&#23454;&#20363;&#30456;&#21516;&#30340;&#20027;&#26426;&#19978;&#30340;&#21333;&#29420; JVM &#20013;&#12290;</p>
<p>&#22914;&#26524;&ldquo;JMS &#26381;&#21153;&#31867;&#22411;&rdquo;&#36873;&#39033;&#35774;&#32622;&#20026;&ldquo;&#26412;&#22320;&rdquo;&#65292;&#21017;&#25903;&#25345;&#24120;&#35268;&#21644;&#22686;&#24378; (&#39640;&#21487;&#29992;&#24615;) &#28040;&#24687;&#38431;&#21015; &#20013;&#20171;&#38598;&#32676;&#12290;&#27492;&#26102;&#23558;&#26174;&#31034;&#29992;&#20110;&#36873;&#25321;&#38598;&#32676;&#31867;&#22411;&#21644;&#37197;&#32622;&#38598;&#32676;&#30340;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#36828;&#31243;</dt>
<dd>
<p>&#20013;&#20171;&#21644;&#20013;&#20171;&#38598;&#32676;&#37197;&#32622;&#21644;&#29983;&#21629;&#21608;&#26399;&#26159;&#20351;&#29992; &#28040;&#24687;&#38431;&#21015; &#31649;&#29702;&#24037;&#20855;&#31649;&#29702;&#30340;&#12290;</p>
<p>&#22914;&#26524;&ldquo;JMS &#26381;&#21153;&#31867;&#22411;&rdquo;&#36873;&#39033;&#35774;&#32622;&#20026;&ldquo;&#36828;&#31243;&rdquo;&#65292;&#21017;&#19981;&#26174;&#31034;&#20219;&#20309;&#20854;&#20182;&#36873;&#39033;&#12290;</p>
</dd>
</dl>
</dd>
<dt>JMS &#38598;&#32676;&#31867;&#22411;</dt>
<dd>
<p>&#29992;&#20110; GlassFish Server &#38598;&#32676;&#30340; &#28040;&#24687;&#38431;&#21015; &#20013;&#20171;&#38598;&#32676;&#30340;&#31867;&#22411;&#12290;</p>
<p>&#22914;&#26524;&ldquo;JMS &#38598;&#32676;&#31867;&#22411;&rdquo;&#36873;&#39033;&#35774;&#32622;&#20026;&ldquo;&#24120;&#35268;&rdquo;&#65292;&#21017;&#26174;&#31034;&#20197;&#19979;&#36873;&#39033;&#12290;</p>
<dl>
<dt>JMS &#37197;&#32622;&#23384;&#20648;&#31867;&#22411;</dt>
<dd>
<p>&#29992;&#20110;&#24120;&#35268;&#38598;&#32676;&#37197;&#32622;&#25968;&#25454;&#30340;&#25968;&#25454;&#23384;&#20648;&#30340;&#31867;&#22411;&#12290;&#22914;&#26524;&#27492;&#36873;&#39033;&#35774;&#32622;&#20026;&ldquo;&#20027;&#20013;&#20171;&rdquo;&#65292;&#21017;&#23558;&#38598;&#32676;&#20013;&#30340;&#19968;&#20010;&#20013;&#20171;&#25351;&#23450;&#20026;&#20027;&#20013;&#20171;&#24182;&#19988;&#30001;&#35813;&#20013;&#20171;&#23384;&#20648;&#37197;&#32622;&#25968;&#25454;&#12290;&#22914;&#26524;&#27492;&#36873;&#39033;&#35774;&#32622;&#20026;&ldquo;&#20849;&#20139;&#25968;&#25454;&#24211;&rdquo;&#65292;&#21017;&#37197;&#32622;&#25968;&#25454;&#23384;&#20648;&#22312;&#21487;&#20379;&#25152;&#26377;&#20013;&#20171;&#35775;&#38382;&#30340; JDBC &#25968;&#25454;&#23384;&#20648;&#20013;&#12290;&#22312;&#27492;&#31034;&#20363;&#20013;&#65292;&#23558;&#26174;&#31034;&#25968;&#25454;&#24211;&#30456;&#20851;&#36873;&#39033;&#12290;</p>
</dd>
<dt>JMS &#28040;&#24687;&#23384;&#20648;&#31867;&#22411;</dt>
<dd>
<p>&#27599;&#20010;&#20013;&#20171;&#22312;&#23384;&#20648;&#28040;&#24687;&#25968;&#25454;&#26102;&#20351;&#29992;&#30340;&#25968;&#25454;&#23384;&#20648;&#31867;&#22411;&#12290;&#22914;&#26524;&#27492;&#36873;&#39033;&#35774;&#32622;&#20026;&ldquo;&#25991;&#20214;&rdquo;&#65292;&#21017;&#27599;&#20010;&#20013;&#20171;&#23558;&#22312;&#22522;&#20110;&#25991;&#20214;&#30340;&#25968;&#25454;&#23384;&#20648;&#20013;&#23384;&#20648;&#28040;&#24687;&#25968;&#25454;&#12290;&#22914;&#26524;&#27492;&#36873;&#39033;&#35774;&#32622;&#20026;&ldquo;JDBC&rdquo;&#65292;&#21017;&#27599;&#20010;&#20013;&#20171;&#23558;&#22312; JDBC &#25968;&#25454;&#23384;&#20648;&#20013;&#23384;&#20648;&#28040;&#24687;&#25968;&#25454;&#12290;</p>
</dd>
</dl>
<p>&#22914;&#26524;&ldquo;JMS &#38598;&#32676;&#31867;&#22411;&rdquo;&#36873;&#39033;&#35774;&#32622;&#20026;&ldquo;&#22686;&#24378; (HA)&rdquo;&#65292;&#21017;&#23558;&#26174;&#31034;&#25968;&#25454;&#24211;&#30456;&#20851;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#25968;&#25454;&#24211;&#20379;&#24212;&#21830;</dt>
<dt>&#25968;&#25454;&#24211; URL</dt>
<dt>&#25968;&#25454;&#24211;&#29992;&#25143;</dt>
<dd>
<p>&#35201;&#22312;&#20197;&#19979;&#20219;&#19968;&#24773;&#20917;&#19979;&#20351;&#29992;&#30340; JDBC &#25968;&#25454;&#24211;&#30340;&#25968;&#25454;&#24211;&#20379;&#24212;&#21830;&#12289;&#35775;&#38382; URL &#21644;&#29992;&#25143;&#65306;</p>
<ul>
<li>
<p>&#24403;&#24120;&#35268;&#38598;&#32676;&#30340;&#37197;&#32622;&#23384;&#20648;&#31867;&#22411;&#35774;&#32622;&#20026;&ldquo;&#20849;&#20139;&#25968;&#25454;&#24211;&rdquo;&#26102;</p>
</li>
<li>
<p>&#24403;&#24120;&#35268;&#38598;&#32676;&#30340;&#28040;&#24687;&#23384;&#20648;&#31867;&#22411;&#35774;&#32622;&#20026;&ldquo;JDBC&rdquo;&#26102;</p>
</li>
<li>
<p>&#24403;&#38598;&#32676;&#31867;&#22411;&#35774;&#32622;&#20026;&ldquo;&#22686;&#24378; (HA)&rdquo;&#26102;</p>
</li>
</ul>
<p>&#26377;&#20851;&#21463;&#25903;&#25345;&#20379;&#24212;&#21830;&#20197;&#21450;&#27599;&#20010;&#20379;&#24212;&#21830;&#30340;&#35775;&#38382; URL &#26684;&#24335;&#30340;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405; <i>Oracle GlassFish Server Message Queue Administration Guide</i> &#20013;&#30340; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GMADG00244">JDBC-Based Persistence</a>&#12290;</p>
</dd>
<dt>&#25968;&#25454;&#24211;&#39564;&#35777;</dt>
<dt>&#25968;&#25454;&#24211;&#21475;&#20196;</dt>
<dt>&#21475;&#20196;&#21035;&#21517;</dt>
<dd>
<p>&#22312;&ldquo;&#25968;&#25454;&#24211;&#29992;&#25143;&rdquo;&#20013;&#25351;&#23450;&#30340; JDBC &#25968;&#25454;&#24211;&#29992;&#25143;&#30340;&#21475;&#20196;&#20449;&#24687;&#12290;</p>
<p>&#22914;&#26524;&ldquo;&#25968;&#25454;&#24211;&#39564;&#35777;&rdquo;&#35774;&#32622;&#20026;&ldquo;&#21475;&#20196;&rdquo;&#65292;&#21017;&#23558;&#26174;&#31034;&ldquo;&#25968;&#25454;&#24211;&#21475;&#20196;&rdquo;&#36873;&#39033;&#12290;&#22914;&#26524;&ldquo;&#25968;&#25454;&#24211;&#39564;&#35777;&rdquo;&#35774;&#32622;&#20026;&ldquo;&#21475;&#20196;&#21035;&#21517;&rdquo;&#65292;&#21017;&#23558;&#26174;&#31034;&ldquo;&#21475;&#20196;&#21035;&#21517;&rdquo;&#36873;&#39033;&#12290;</p>
</dd>
<dt>&#20854;&#20182;&#23646;&#24615;</dt>
<dd>
<p>JMS &#21487;&#29992;&#24615;&#30340;&#20854;&#20182;&#23646;&#24615;&#12290;</p>
<p>GlassFish Server &#26410;&#39044;&#23450;&#20041;&#20219;&#20309;&#20854;&#20182; JMS &#21487;&#29992;&#24615;&#23646;&#24615;&#12290;</p>
</dd>
</dl>
<a id="sthref73" name="sthref73"></a>
<h5>&#30456;&#20851;&#20219;&#21153;</h5>
<p><a href="task-jmsservice.html">&#37197;&#32622; JMS &#26381;&#21153;</a></p>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
