<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsphysicaldestnew" name="task-jmsphysicaldestnew"></a></p>

<h4><a id="sthref30" name="sthref30"></a><a id="sthref31" name="sthref31"></a>&#21019;&#24314; JMS &#29289;&#29702;&#30446;&#26631;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#36890;&#24120;&#26080;&#38656;&#21019;&#24314;&#29289;&#29702;&#30446;&#26631;&#65292;&#22240;&#20026;&#22312;&#21019;&#24314; JMS &#30446;&#26631;&#36164;&#28304;&#26102;&#65292;&#24744;&#20250;&#25351;&#23450;&#19968;&#20010;&#29289;&#29702;&#30446;&#26631;&#21517;&#31216;&#65292;&#32780; GlassFish Server &#20250;&#22312;&#38656;&#35201;&#26102;&#33258;&#21160;&#21019;&#24314;&#29289;&#29702;&#30446;&#26631;&#12290;</p>
<ol>
<li>
<p>&#22312;&#23548;&#33322;&#26641;&#20013;&#65292;&#23637;&#24320;&ldquo;&#37197;&#32622;&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#36873;&#25321;&#35201;&#37197;&#32622;&#30340;&#23454;&#20363;&#65306;</p>
<ul>
<li>
<p>&#35201;&#37197;&#32622;&#29305;&#23450;&#30340;&#23454;&#20363;&#65292;&#35831;&#36873;&#25321;&#35813;&#23454;&#20363;&#30340;&#37197;&#32622;&#33410;&#28857;&#12290;&#20363;&#22914;&#65292;&#23545;&#20110;&#40664;&#35748;&#23454;&#20363; <code>server</code>&#65292;&#35831;&#36873;&#25321; <code>server-config</code> &#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#35201;&#20026;&#20197;&#21518;&#20351;&#29992; <code>default-config</code> &#21103;&#26412;&#30340;&#23454;&#20363;&#37197;&#32622;&#40664;&#35748;&#35774;&#32622;&#65292;&#35831;&#36873;&#25321; <code>default-config</code> &#33410;&#28857;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#22312;&ldquo;&#37197;&#32622;&rdquo;&#33410;&#28857;&#19979;&#65292;&#23637;&#24320;&ldquo;Java &#28040;&#24687;&#26381;&#21153;&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;Java &#28040;&#24687;&#26381;&#21153;&rdquo;&#33410;&#28857;&#19979;&#65292;&#36873;&#25321;&ldquo;&#29289;&#29702;&#30446;&#26631;&rdquo;&#33410;&#28857;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#29289;&#29702;&#30446;&#26631;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#29289;&#29702;&#30446;&#26631;&rdquo;&#39029;&#20013;&#65292;&#21333;&#20987;&ldquo;&#26032;&#24314;&rdquo;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#26032;&#24314;&#29289;&#29702;&#30446;&#26631;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#21517;&#31216;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#29289;&#29702;&#30446;&#26631;&#30340;&#21517;&#31216;&#12290;</p>
</li>
<li>
<p>&#20174;&ldquo;&#31867;&#22411;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321; <code>javax.jms.Topic</code> &#25110; <code>javax.jms.Queue</code>&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26410;&#20351;&#29992;&#28040;&#24687;&#30340;&#26368;&#22823;&#25968;&#37327;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#30446;&#26631;&#20801;&#35768;&#30340;&#26410;&#20351;&#29992;&#28040;&#24687;&#30340;&#26368;&#22823;&#25968;&#37327;&#12290;</p>
<p>&#22914;&#26524;&#20540;&#20026; -1&#65292;&#21017;&#34920;&#31034;&#26410;&#20351;&#29992;&#28040;&#24687;&#30340;&#25968;&#37327;&#19981;&#21463;&#38480;&#21046;&#12290;&#40664;&#35748;&#20540;&#20026; -1&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26368;&#22823;&#28040;&#24687;&#38271;&#24230;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#20219;&#19968;&#28040;&#24687;&#30340;&#26368;&#22823;&#38271;&#24230; (&#23383;&#33410;)&#12290;</p>
<p>&#22914;&#26524;&#20540;&#20026; -1&#65292;&#21017;&#34920;&#31034;&#19981;&#38480;&#21046;&#28040;&#24687;&#38271;&#24230;&#12290;&#40664;&#35748;&#20540;&#20026; -1&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26368;&#22823;&#20869;&#23384;&#24635;&#37327;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#26410;&#20351;&#29992;&#28040;&#24687;&#30340;&#26368;&#22823;&#20869;&#23384;&#24635;&#37327; (&#23383;&#33410;)&#12290;</p>
<p>&#22914;&#26524;&#20540;&#20026; -1&#65292;&#21017;&#34920;&#31034;&#26410;&#20351;&#29992;&#28040;&#24687;&#30340;&#20869;&#23384;&#22823;&#23567;&#19981;&#21463;&#38480;&#21046;&#12290;&#40664;&#35748;&#20540;&#20026; -1&#12290;</p>
</li>
<li>
<p>&#20174;&ldquo;&#38408;&#20540;&#38480;&#21046;&#34892;&#20026;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&#36798;&#21040;&#20869;&#23384;&#38480;&#21046;&#38408;&#20540;&#26102;&#65292;&#20013;&#20171;&#23558;&#35201;&#36981;&#24490;&#30340;&#34892;&#20026;&#12290;</p>
<ul>
<li>
<p><code>&#25298;&#32477;&#26368;&#26032;&#30340;&#28040;&#24687;</code>&#21578;&#35785;&#20013;&#20171;&#25298;&#32477;&#26368;&#26032;&#28040;&#24687;&#65292;&#24182;&#36890;&#30693;&#29983;&#25104;&#28040;&#24687;&#30340;&#23458;&#25143;&#26426; (&#28040;&#24687;&#20026;&#25345;&#20037;&#24615;&#28040;&#24687;&#30340;&#24773;&#20917;&#38500;&#22806;)&#12290;</p>
<p><code>&#25298;&#32477;&#26368;&#26032;&#30340;&#28040;&#24687;</code>&#20026;&#40664;&#35748;&#20540;&#12290;</p>
</li>
<li>
<p><code>&#20943;&#24930;&#29983;&#25104;&#22120;&#36895;&#24230;</code>&#21578;&#35785;&#20013;&#20171;&#38477;&#20302;&#28040;&#24687;&#29983;&#25104;&#22120;&#21457;&#36865;&#28040;&#24687;&#30340;&#36895;&#29575;&#12290;</p>
</li>
<li>
<p><code>&#20002;&#24323;&#26368;&#26089;&#30340;&#28040;&#24687;</code>&#21578;&#35785;&#20013;&#20171;&#20002;&#24323;&#26368;&#26089;&#30340;&#28040;&#24687;&#12290;</p>
</li>
<li>
<p><code>&#20002;&#24323;&#20248;&#20808;&#32423;&#26368;&#20302;&#30340;&#28040;&#24687;</code>&#21578;&#35785;&#20013;&#20171;&#20002;&#24323;&#20248;&#20808;&#32423;&#26368;&#20302;&#30340;&#28040;&#24687;&#12290;</p>
</li>
</ul>
<p>&#22914;&#26524;&#35813;&#20540;&#20026;<code>&#20002;&#24323;&#26368;&#26089;&#30340;&#28040;&#24687;</code>&#25110;<code>&#20002;&#24323;&#20248;&#20808;&#32423;&#26368;&#20302;&#30340;&#28040;&#24687;</code>&#65292;&#19988;&ldquo;&#20351;&#29992;&#20572;&#29992;&#28040;&#24687;&#38431;&#21015;&rdquo;&#35774;&#32622;&#20026;&ldquo;&#30495;&rdquo;&#65292;&#21017;&#23558;&#36807;&#37327;&#30340;&#28040;&#24687;&#31227;&#21040;&#20572;&#29992;&#28040;&#24687;&#38431;&#21015;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26368;&#22823;&#29983;&#25104;&#22120;&#25968;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#21487;&#20197;&#19982;&#27492;&#29289;&#29702;&#30446;&#26631;&#20851;&#32852;&#30340;&#28040;&#24687;&#29983;&#25104;&#22120;&#30340;&#26368;&#22823;&#25968;&#37327;&#12290;</p>
<p>&#36798;&#21040;&#27492;&#38480;&#21046;&#21518;&#65292;&#23558;&#26080;&#27861;&#21019;&#24314;&#26032;&#30340;&#29983;&#25104;&#22120;&#12290;&#22914;&#26524;&#20540;&#20026; -1&#65292;&#21017;&#34920;&#31034;&#19981;&#38480;&#21046;&#29983;&#25104;&#22120;&#30340;&#25968;&#37327;&#12290;&#40664;&#35748;&#20540;&#20026; 100&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#25209;&#37327;&#20256;&#36865;&#26368;&#22823;&#28040;&#24687;&#25968;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#21487;&#20197;&#21521;&#20351;&#29992;&#32773;&#19968;&#27425;&#24615;&#20256;&#36865;&#30340;&#26368;&#22823;&#28040;&#24687;&#25968;&#37327;&#12290;</p>
<p>&#22914;&#26524;&#20540;&#20026; -1&#65292;&#21017;&#34920;&#31034;&#19981;&#38480;&#21046;&#28040;&#24687;&#30340;&#25968;&#37327;&#12290;&#40664;&#35748;&#20540;&#26159; 1000&#12290;</p>
</li>
<li>
<p>&#20174;&ldquo;&#20351;&#29992;&#20572;&#29992;&#28040;&#24687;&#38431;&#21015;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&ldquo;&#30495;&rdquo;&#20197;&#23558;&#20572;&#29992;&#28040;&#24687;&#25918;&#20837;&#20572;&#29992;&#28040;&#24687;&#38431;&#21015;&#12290;</p>
<p>&#22914;&#26524;&#35813;&#20540;&#35774;&#32622;&#20026;&ldquo;&#20551;&rdquo;&#65292;&#21017;&#20002;&#24323;&#20572;&#29992;&#28040;&#24687;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#27492;&#36873;&#39033;&#35774;&#32622;&#20026;&ldquo;&#30495;&rdquo;&#12290;</p>
</li>
<li>
<p>&#20174;&ldquo;&#21551;&#29992;&#39564;&#35777; XML &#26041;&#26696;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&ldquo;&#30495;&rdquo;&#65292;&#20026;&#30446;&#26631;&#21551;&#29992; XML &#26041;&#26696;&#39564;&#35777;&#12290;</p>
<p>&#22914;&#26524;&#35813;&#20540;&#35774;&#32622;&#20026;&ldquo;&#30495;&rdquo;&#65292;&#21017;&#28040;&#24687;&#38431;&#21015;&#23458;&#25143;&#26426;&#36816;&#34892;&#26102;&#22312;&#23558; XML &#28040;&#24687;&#21457;&#36865;&#32473;&#20013;&#20171;&#21069;&#65292;&#20250;&#23581;&#35797;&#26681;&#25454;&#25351;&#23450;&#30340; XML &#26041;&#26696;&#23450;&#20041; (&#22914;&#26524;&#26410;&#25351;&#23450; XSD&#65292;&#21017;&#26681;&#25454; DTD) &#39564;&#35777; XML &#28040;&#24687;&#12290;&#22914;&#26524;&#26080;&#27861;&#25214;&#21040;&#25351;&#23450;&#30340;&#26041;&#26696;&#25110;&#26080;&#27861;&#39564;&#35777;&#28040;&#24687;&#65292;&#21017;&#19981;&#21457;&#36865;&#28040;&#24687;&#24182;&#25243;&#20986;&#24322;&#24120;&#38169;&#35823;&#12290;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#27492;&#36873;&#39033;&#35774;&#32622;&#20026;&ldquo;&#20551;&rdquo;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;XML &#26041;&#26696; URI &#21015;&#34920;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#19968;&#20010;&#20197;&#31354;&#26684;&#20998;&#38548;&#30340; XML &#26041;&#26696;&#23450;&#20041; (XSD) URI &#23383;&#31526;&#20018;&#21015;&#34920;&#12290;</p>
<p>&#22914;&#26524;&#21551;&#29992; XML &#26041;&#26696;&#39564;&#35777;&#65292;&#21017; URI &#23558;&#25351;&#21521;&#35201;&#29992;&#20110; XML &#26041;&#26696;&#39564;&#35777;&#30340;&#19968;&#20010;&#25110;&#22810;&#20010; XSD &#30340;&#20301;&#32622;&#12290;</p>
</li>
</ol>
<a id="sthref32" name="sthref32"></a>
<h5>&#21478;&#35831;&#21442;&#38405;</h5>
<ul>
<li>
<p><a href="task-jmsservice.html">&#37197;&#32622; JMS &#26381;&#21153;</a></p>
</li>
<li>
<p><a href="task-jmshostnew.html">&#21019;&#24314; JMS &#20027;&#26426;</a></p>
</li>
<li>
<p><a href="task-jmshostedit.html">&#32534;&#36753; JMS &#20027;&#26426;</a></p>
</li>
<li>
<p><a href="task-jmshostdelete.html">&#21024;&#38500; JMS &#20027;&#26426;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestedit.html">&#32534;&#36753; JMS &#29289;&#29702;&#30446;&#26631;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestdelete.html">&#21024;&#38500; JMS &#29289;&#29702;&#30446;&#26631;</a></p>
</li>
<li>
<p><a href="task-jmsflushmessages.html">&#20174; JMS &#29289;&#29702;&#30446;&#26631;&#21024;&#38500;&#28040;&#24687;</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldeststats.html">&#26597;&#30475; JMS &#29289;&#29702;&#30446;&#26631;&#30340;&#32479;&#35745;&#20449;&#24687;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
