<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsdestinationedit" name="task-jmsdestinationedit"></a></p>

<h4><a id="sthref14" name="sthref14"></a><a id="sthref15" name="sthref15"></a>&#32534;&#36753; JMS &#30446;&#26631;&#36164;&#28304;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#23548;&#33322;&#26641;&#20013;&#65292;&#23637;&#24320;&ldquo;&#36164;&#28304;&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#36164;&#28304;&rdquo;&#33410;&#28857;&#19979;&#65292;&#23637;&#24320;&ldquo;JMS &#36164;&#28304;&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;JMS &#36164;&#28304;&rdquo;&#33410;&#28857;&#19979;&#65292;&#36873;&#25321;&ldquo;JMS &#30446;&#26631;&#36164;&#28304;&rdquo;&#33410;&#28857;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;JMS &#30446;&#26631;&#36164;&#28304;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;JMS &#30446;&#26631;&#36164;&#28304;&rdquo;&#39029;&#19978;&#65292;&#21333;&#20987;&#24744;&#35201;&#32534;&#36753;&#30340;&#30446;&#26631;&#36164;&#28304;&#30340;&#21517;&#31216;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#32534;&#36753; JMS &#30446;&#26631;&#36164;&#28304;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#29289;&#29702;&#30446;&#26631;&#21517;&#31216;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#35201;&#19982;&#27492;&#36164;&#28304;&#20851;&#32852;&#30340;&#29289;&#29702;&#30446;&#26631;&#30340;&#21517;&#31216;&#12290;</p>
<p>GlassFish Server &#22312;&#38656;&#35201;&#26102;&#33258;&#21160;&#21019;&#24314;&#29289;&#29702;&#30446;&#26631;&#65292;&#24182;&#22312;&#24744;&#21024;&#38500;&#30446;&#26631;&#36164;&#28304;&#26102;&#21024;&#38500;&#29289;&#29702;&#30446;&#26631;&#12290;</p>
</li>
<li>
<p>&#20174;&ldquo;&#36164;&#28304;&#31867;&#22411;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321; <code>javax.jms.Topic</code> &#25110; <code>javax.jms.Queue</code>&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#35828;&#26126;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#30446;&#26631;&#36164;&#28304;&#30340;&#35828;&#26126;&#12290;</p>
</li>
<li>
<p>&#36873;&#25321;&ldquo;&#21551;&#29992;&#29366;&#24577;&rdquo;&#22797;&#36873;&#26694;&#20197;&#22312;&#36816;&#34892;&#26102;&#21551;&#29992;&#35813;&#36164;&#28304;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#21551;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#20854;&#20182;&#23646;&#24615;&rdquo;&#21306;&#22495;&#20013;&#65292;&#25351;&#23450;&#30446;&#26631;&#36164;&#28304;&#30340;&#20854;&#20182;&#23646;&#24615;&#12290;</p>
<p>GlassFish Server &#19981;&#23450;&#20041; JMS &#30446;&#26631;&#36164;&#28304;&#30340;&#20219;&#20309;&#20854;&#20182;&#23646;&#24615;&#12290;</p>
<ul>
<li>
<p>&#35201;&#28155;&#21152;&#23646;&#24615;&#65292;&#35831;&#21333;&#20987;&ldquo;&#28155;&#21152;&#23646;&#24615;&rdquo;&#25353;&#38062;&#12290;&#22312;&#26174;&#31034;&#30340;&#31354;&#30333;&#34892;&#20013;&#65292;&#22312;&ldquo;&#21517;&#31216;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#23646;&#24615;&#21517;&#31216;&#65292;&#22312;&ldquo;&#20540;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#23646;&#24615;&#20540;&#12290;</p>
</li>
<li>
<p>&#35201;&#20462;&#25913;&#23646;&#24615;&#65292;&#35831;&#32534;&#36753;&#35813;&#23646;&#24615;&#30340;&ldquo;&#20540;&rdquo;&#23383;&#27573;&#12290;</p>
</li>
<li>
<p>&#35201;&#21024;&#38500;&#23646;&#24615;&#65292;&#35831;&#36873;&#20013;&#20301;&#20110;&#24744;&#35201;&#21024;&#38500;&#23646;&#24615;&#30340;&ldquo;&#21517;&#31216;&rdquo;&#23383;&#27573;&#24038;&#36793;&#30340;&#22797;&#36873;&#26694;&#65292;&#28982;&#21518;&#21333;&#20987;&ldquo;&#21024;&#38500;&#23646;&#24615;&rdquo;&#25353;&#38062;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#21333;&#20987;&ldquo;&#20445;&#23384;&rdquo;&#12290;</p>

<hr>
<p><b>&#25552;&#31034;:</b></p>
&#35201;&#36820;&#22238;&#21040;&#40664;&#35748;&#35774;&#32622;&#65292;&#35831;&#21333;&#20987;&ldquo;&#21152;&#36733;&#40664;&#35748;&#20540;&rdquo;&#25353;&#38062;&#65292;&#28982;&#21518;&#21333;&#20987;&ldquo;&#20445;&#23384;&rdquo;&#12290;<br />
<hr>

</li>
<li>
<p>&#21487;&#20197;&#36873;&#25321;&#24615;&#22320;&#21333;&#20987;&ldquo;&#30446;&#26631;&rdquo;&#36873;&#39033;&#21345;&#26469;&#36716;&#21040;&ldquo;JMS &#30446;&#26631;&#36164;&#28304;&#30446;&#26631;&rdquo;&#39029;&#12290;&#22312;&#27492;&#39029;&#19978;&#65292;&#25191;&#34892;&#20197;&#19979;&#25805;&#20316;&#65306;</p>
<ol type="a">
<li>
<p>&#21333;&#20987;&ldquo;&#31649;&#29702;&#30446;&#26631;&rdquo;&#20197;&#25171;&#24320;&ldquo;&#31649;&#29702;&#36164;&#28304;&#30446;&#26631;&rdquo;&#39029;&#12290;</p>
<p>&#22312;&#27492;&#39029;&#19978;&#30340;&ldquo;&#21487;&#29992;&rdquo;&#21015;&#21644;&ldquo;&#25152;&#36873;&rdquo;&#21015;&#20043;&#38388;&#31227;&#21160;&#30446;&#26631;&#12290;&#23545;&#20110;&#35201;&#23558;&#20351;&#29992;&#36164;&#28304;&#30340;&#24212;&#29992;&#31243;&#24207;&#37096;&#32626;&#21040;&#30340;&#30446;&#26631;&#65292;&#30830;&#20445;&#23558;&#36825;&#20123;&#30446;&#26631;&#25918;&#32622;&#22312;&ldquo;&#25152;&#36873;&rdquo;&#21015;&#20013;&#12290;&#21487;&#29992;&#30446;&#26631;&#21253;&#25324;&#21487;&#29992;&#38598;&#32676;&#21644;&#26381;&#21153;&#22120;&#23454;&#20363;&#65292;&#36824;&#26377;&#40664;&#35748;&#30340;&#26381;&#21153;&#22120;&#23454;&#20363; <code>server</code>&#12290;&#21333;&#20987;&ldquo;&#30830;&#23450;&rdquo;&#20445;&#23384;&#26356;&#25913;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&#30446;&#26631;&#23545;&#24212;&#30340;&#22797;&#36873;&#26694;&#65292;&#28982;&#21518;&#21333;&#20987;&ldquo;&#21551;&#29992;&rdquo;&#25110;&ldquo;&#31105;&#29992;&rdquo;&#65292;&#21551;&#29992;&#25110;&#31105;&#29992;&#35813;&#30446;&#26631;&#30340;&#36164;&#28304;&#12290;</p>
</li>
</ol>
</li>
</ol>
<a id="sthref16" name="sthref16"></a>
<h5>&#21478;&#35831;&#21442;&#38405;</h5>
<ul>
<li>
<p><a href="task-jmsconnectionnew.html">&#21019;&#24314; JMS &#36830;&#25509;&#24037;&#21378;&#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-jmsconnectionedit.html">&#32534;&#36753; JMS &#36830;&#25509;&#24037;&#21378;&#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">&#21024;&#38500; JMS &#36830;&#25509;&#24037;&#21378;&#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-jmsdestinationnew.html">&#21019;&#24314; JMS &#30446;&#26631;&#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-jmsdestinationdelete.html">&#21024;&#38500; JMS &#30446;&#26631;&#36164;&#28304;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
