<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsconnectionedit" name="task-jmsconnectionedit"></a><a id="GHJMS00021" name="GHJMS00021"></a></p>

<h4><a id="sthref5" name="sthref5"></a><a id="sthref6" name="sthref6"></a>&#32534;&#36753; JMS &#36830;&#25509;&#24037;&#21378;&#36164;&#28304;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#23548;&#33322;&#26641;&#20013;&#65292;&#23637;&#24320;&ldquo;&#36164;&#28304;&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#36164;&#28304;&rdquo;&#33410;&#28857;&#19979;&#65292;&#23637;&#24320;&ldquo;JMS &#36164;&#28304;&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;JMS &#36164;&#28304;&rdquo;&#33410;&#28857;&#19979;&#65292;&#36873;&#25321;&ldquo;JMS &#36830;&#25509;&#24037;&#21378;&rdquo;&#33410;&#28857;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;JMS &#36830;&#25509;&#24037;&#21378;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;JMS &#36830;&#25509;&#24037;&#21378;&rdquo;&#39029;&#19978;&#65292;&#21333;&#20987;&#24744;&#35201;&#32534;&#36753;&#30340;&#36830;&#25509;&#24037;&#21378;&#30340;&#21517;&#31216;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#32534;&#36753; JMS &#36830;&#25509;&#24037;&#21378;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#35828;&#26126;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#36830;&#25509;&#24037;&#21378;&#30340;&#35828;&#26126;&#12290;</p>
</li>
<li>
<p>&#36873;&#25321;&ldquo;&#21551;&#29992;&#29366;&#24577;&rdquo;&#22797;&#36873;&#26694;&#20197;&#22312;&#36816;&#34892;&#26102;&#21551;&#29992;&#35813;&#36164;&#28304;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#21551;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#21021;&#22987;&#21644;&#26368;&#23567;&#27744;&#22823;&#23567;&rdquo;&#23383;&#27573;&#20013;&#65292;&#25351;&#23450;&#35813;&#27744;&#30340;&#26368;&#23567;&#36830;&#25509;&#25968;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 8&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26368;&#22823;&#27744;&#22823;&#23567;&rdquo;&#23383;&#27573;&#20013;&#65292;&#25351;&#23450;&#35813;&#27744;&#30340;&#26368;&#22823;&#36830;&#25509;&#25968;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 32&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#27744;&#35843;&#25972;&#22823;&#23567;&#25968;&#37327;&rdquo;&#23383;&#27573;&#20013;&#65292;&#25351;&#23450;&#27744;&#31354;&#38386;&#36229;&#26102;&#21040;&#26399;&#26102;&#35201;&#21024;&#38500;&#30340;&#36830;&#25509;&#30340;&#25968;&#37327;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 2&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#31354;&#38386;&#36229;&#26102;&rdquo;&#23383;&#27573;&#20013;&#65292;&#25351;&#23450;&#36830;&#25509;&#21487;&#22312;&#27744;&#20013;&#20445;&#25345;&#31354;&#38386;&#30340;&#26368;&#38271;&#26102;&#38388; (&#31186;)&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 300&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#26368;&#38271;&#31561;&#24453;&#26102;&#38388;&rdquo;&#23383;&#27573;&#20013;&#65292;&#25351;&#23450;&#35831;&#27714;&#36830;&#25509;&#30340;&#24212;&#29992;&#31243;&#24207;&#22312;&#36830;&#25509;&#36229;&#26102;&#20043;&#21069;&#31561;&#24453;&#30340;&#26102;&#38388;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 60000&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#19968;&#26086;&#22833;&#36133;&#21017;&#20851;&#38381;&#25152;&#26377;&#36830;&#25509;&rdquo;&#22797;&#36873;&#26694;&#65292;&#20197;&#20415; GlassFish Server &#22312;&#26576;&#20010;&#36830;&#25509;&#22833;&#36133;&#26102;&#20851;&#38381;&#27744;&#20013;&#30340;&#25152;&#26377;&#36830;&#25509;&#24182;&#37325;&#26032;&#24314;&#31435;&#36825;&#20123;&#36830;&#25509;&#12290;</p>
<p>&#22914;&#26524;&#26410;&#36873;&#20013;&#27492;&#22797;&#36873;&#26694;&#65292;&#21017;&#20165;&#24403;&#35201;&#20351;&#29992;&#21508;&#20010;&#36830;&#25509;&#26102;&#25165;&#20250;&#37325;&#26032;&#24314;&#31435;&#36830;&#25509;&#12290;</p>
</li>
<li>
<p>&#23545;&#20110; JMS &#36830;&#25509;&#24037;&#21378;&#36164;&#28304;&#65292;&#35831;&#26681;&#25454;&#20197;&#19979;&#35828;&#26126;&#25351;&#23450;&ldquo;&#20107;&#21153;&#22788;&#29702;&#25903;&#25345;&rdquo;&#20540;&#65306;</p>
<ul>
<li>
<p>&#23545;&#20110;&#22312;&#20107;&#21153;&#22788;&#29702;&#33539;&#22260;&#20869;&#20351;&#29992;&#22810;&#20010;&#36164;&#28304;&#30340;&#20107;&#21153;&#22788;&#29702;&#65292;&#20026;&#20854;&#25152;&#29992;&#30340;&#36164;&#28304;&#25351;&#23450; <code>XATransaction</code> (&#40664;&#35748;&#20540;)&#12290;</p>
<p>&#20363;&#22914;&#65292;&#27492;&#36164;&#28304;&#21644; JDBC &#36164;&#28304;&#12289;&#36830;&#25509;&#22120;&#36164;&#28304;&#25110;&#20854;&#20182; JMS &#36830;&#25509;&#24037;&#21378;&#36164;&#28304;&#12290;&#27492;&#20540;&#25552;&#20379;&#26368;&#22823;&#30340;&#28789;&#27963;&#24615;&#12290;&#37197;&#32622;&#20026; <code>XATransaction</code> &#30340;&#36164;&#28304;&#23558;&#21442;&#19982;&#20998;&#20026;&#20004;&#20010;&#38454;&#27573;&#30340;&#25552;&#20132;&#25805;&#20316;&#12290;</p>
</li>
<li>
<p>&#23545;&#20110;&#20107;&#21153;&#22788;&#29702; (&#20165;&#20351;&#29992;&#20107;&#21153;&#22788;&#29702;&#33539;&#22260;&#20869;&#30340;&#21807;&#19968;&#19968;&#31181;&#36164;&#28304;) &#21487;&#20197;&#20351;&#29992;&#30340;&#36164;&#28304;&#25110;&#22312;&#20351;&#29992;&#22810;&#20010; XA &#36164;&#28304;&#30340;&#20998;&#24067;&#24335;&#20107;&#21153;&#22788;&#29702;&#20013;&#29992;&#20316;&#26368;&#21518;&#19968;&#20010;&#20195;&#29702;&#30340;&#36164;&#28304;&#65292;&#25351;&#23450; <code>LocalTransaction</code>&#12290;</p>
<p>&#27492;&#20540;&#25552;&#20379;&#26356;&#22909;&#30340;&#24615;&#33021;&#12290;&#37197;&#32622;&#20026; <code>LocalTransaction</code> &#30340;&#36164;&#28304;&#23558;&#19981;&#20250;&#21442;&#19982;&#20998;&#20026;&#20004;&#20010;&#38454;&#27573;&#30340;&#25552;&#20132;&#25805;&#20316;&#12290;</p>
</li>
<li>
<p>&#23545;&#20110;&#27704;&#36828;&#26080;&#27861;&#21442;&#19982;&#20107;&#21153;&#22788;&#29702;&#30340;&#36164;&#28304;&#65292;&#25351;&#23450; <code>NoTransaction</code>&#12290;</p>
<p>JMS &#24212;&#29992;&#31243;&#24207;&#20013;&#38480;&#29992;&#27492;&#35774;&#32622;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#36873;&#20013;&ldquo;&#36830;&#25509;&#39564;&#35777;&rdquo;&#22797;&#36873;&#26694;&#65292;&#20197;&#21551;&#29992;&#36830;&#25509;&#39564;&#35777;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#20854;&#20182;&#23646;&#24615;&rdquo;&#34920;&#20013;&#65292;&#25351;&#23450;&#36830;&#25509;&#24037;&#21378;&#30340;&#20854;&#20182;&#23646;&#24615;&#12290;</p>
<p>&#26377;&#20851;&#21487;&#29992;&#23646;&#24615;&#30340;&#20449;&#24687;&#65292;&#35831;&#21442;&#38405;<a href="ref-jmsconnectionproperties.html">&#29305;&#23450;&#20110; JMS &#36830;&#25509;&#24037;&#21378;&#30340;&#23646;&#24615;</a>&#12290;</p>
<ul>
<li>
<p>&#35201;&#28155;&#21152;&#23646;&#24615;&#65292;&#35831;&#21333;&#20987;&ldquo;&#28155;&#21152;&#23646;&#24615;&rdquo;&#25353;&#38062;&#12290;&#22312;&#26174;&#31034;&#30340;&#31354;&#30333;&#34892;&#20013;&#65292;&#22312;&ldquo;&#21517;&#31216;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#23646;&#24615;&#21517;&#31216;&#65292;&#22312;&ldquo;&#20540;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#23646;&#24615;&#20540;&#12290;</p>
</li>
<li>
<p>&#35201;&#20462;&#25913;&#23646;&#24615;&#65292;&#35831;&#32534;&#36753;&#35813;&#23646;&#24615;&#30340;&ldquo;&#20540;&rdquo;&#23383;&#27573;&#12290;</p>
</li>
<li>
<p>&#35201;&#21024;&#38500;&#23646;&#24615;&#65292;&#35831;&#36873;&#20013;&#20301;&#20110;&#24744;&#35201;&#21024;&#38500;&#23646;&#24615;&#30340;&ldquo;&#21517;&#31216;&rdquo;&#23383;&#27573;&#24038;&#36793;&#30340;&#22797;&#36873;&#26694;&#65292;&#28982;&#21518;&#21333;&#20987;&ldquo;&#21024;&#38500;&#23646;&#24615;&rdquo;&#25353;&#38062;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#21487;&#20197;&#36873;&#25321;&#24615;&#22320;&#21333;&#20987;&ldquo;&#30446;&#26631;&rdquo;&#36873;&#39033;&#21345;&#26469;&#36716;&#21040;&ldquo;JMS &#36830;&#25509;&#24037;&#21378;&#36164;&#28304;&#30446;&#26631;&rdquo;&#39029;&#12290;&#22312;&#27492;&#39029;&#19978;&#65292;&#25191;&#34892;&#20197;&#19979;&#25805;&#20316;&#65306;</p>
<ol type="a">
<li>
<p>&#21333;&#20987;&ldquo;&#31649;&#29702;&#30446;&#26631;&rdquo;&#20197;&#25171;&#24320;&ldquo;&#31649;&#29702;&#36164;&#28304;&#30446;&#26631;&rdquo;&#39029;&#12290;</p>
<p>&#22312;&#27492;&#39029;&#19978;&#30340;&ldquo;&#21487;&#29992;&rdquo;&#21015;&#21644;&ldquo;&#25152;&#36873;&rdquo;&#21015;&#20043;&#38388;&#31227;&#21160;&#30446;&#26631;&#12290;&#23545;&#20110;&#35201;&#23558;&#20351;&#29992;&#36164;&#28304;&#30340;&#24212;&#29992;&#31243;&#24207;&#37096;&#32626;&#21040;&#30340;&#30446;&#26631;&#65292;&#30830;&#20445;&#23558;&#36825;&#20123;&#30446;&#26631;&#25918;&#32622;&#22312;&ldquo;&#25152;&#36873;&rdquo;&#21015;&#20013;&#12290;&#21487;&#29992;&#30446;&#26631;&#21253;&#25324;&#21487;&#29992;&#38598;&#32676;&#21644;&#26381;&#21153;&#22120;&#23454;&#20363;&#65292;&#36824;&#26377;&#40664;&#35748;&#30340;&#26381;&#21153;&#22120;&#23454;&#20363; <code>server</code>&#12290;&#21333;&#20987;&ldquo;&#30830;&#23450;&rdquo;&#20445;&#23384;&#26356;&#25913;&#12290;</p>
</li>
<li>
<p>&#36873;&#20013;&#30446;&#26631;&#23545;&#24212;&#30340;&#22797;&#36873;&#26694;&#65292;&#28982;&#21518;&#21333;&#20987;&ldquo;&#21551;&#29992;&rdquo;&#25110;&ldquo;&#31105;&#29992;&rdquo;&#65292;&#21551;&#29992;&#25110;&#31105;&#29992;&#35813;&#30446;&#26631;&#30340;&#36164;&#28304;&#12290;</p>
</li>
</ol>
</li>
<li>
<p>&#21333;&#20987;&ldquo;&#20445;&#23384;&rdquo;&#12290;</p>

<hr>
<p><b>&#25552;&#31034;:</b></p>
&#35201;&#36820;&#22238;&#21040;&#40664;&#35748;&#35774;&#32622;&#65292;&#35831;&#21333;&#20987;&ldquo;&#21152;&#36733;&#40664;&#35748;&#20540;&rdquo;&#25353;&#38062;&#65292;&#28982;&#21518;&#21333;&#20987;&ldquo;&#20445;&#23384;&rdquo;&#12290;<br />
<hr>

</li>
</ol>
<a id="sthref7" name="sthref7"></a>
<h5>&#21478;&#35831;&#21442;&#38405;</h5>
<ul>
<li>
<p><a href="task-jmsconnectionnew.html">&#21019;&#24314; JMS &#36830;&#25509;&#24037;&#21378;&#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">&#21024;&#38500; JMS &#36830;&#25509;&#24037;&#21378;&#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-jmsdestinationnew.html">&#21019;&#24314; JMS &#30446;&#26631;&#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-jmsdestinationedit.html">&#32534;&#36753; JMS &#30446;&#26631;&#36164;&#28304;</a></p>
</li>
<li>
<p><a href="task-jmsdestinationdelete.html">&#21024;&#38500; JMS &#30446;&#26631;&#36164;&#28304;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
