<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jdbcconnectionpoolnew2" name="ref-jdbcconnectionpoolnew2"></a><a id="GHJDB00025" name="GHJDB00025"></a></p>

<h4><a id="sthref42" name="sthref42"></a>Nuovo connection pool JDBC (passo 2 di 2)</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilizzare la pagina Nuovo connection pool JDBC (passo 2 di 2) per creare un nuovo connection pool JDBC.</p>
<p>La pagina Nuovo connection pool JDBC (passo 2 di 2) contiene le opzioni riportate di seguito.</p>
<dl>
<dt>Nome classe origine dati</dt>
<dd>
<p>Il nome della classe specifica del fornitore che implementa l'interfaccia API <code>DataSource</code> , <code>ConnectionPoolDataSource</code> o <code>XADataSource</code>. Se &egrave; stata abilitata l'opzione Analisi ed &egrave; stato selezionato uno dei tipi di risorsa di origine dati, nel campo viene inserito automaticamente il nome classe associato al tipo di risorsa e al fornitore di database scelti. Se &egrave; stato selezionato il tipo di risorsa <code>java.sql.Driver</code> , il campo &egrave; disabilitato.</p>
</dd>
<dt>Nome classe driver</dt>
<dd>
<p>Il nome della classe del driver JDBC specificato dal fornitore. Se &egrave; stata abilitata l'opzione Analisi ed &egrave; stato selezionato il tipo di risorsa <code>java.sql.Driver</code>, in questo campo viene inserito automaticamente il nome di classe associato al driver e al fornitore di database scelti. Se &egrave; stato selezionato uno dei tipi di risorsa origine dati, il campo &egrave; disabilitato.</p>
</dd>
<dt>Ping</dt>
<dd>
<p>Se questa opzione &egrave; abilitata, viene eseguito in modo automatico il ping del pool durante la creazione o la riconfigurazione in modo da identificare e segnalare eventuali valori errati degli attributi. Questa opzione &egrave; disabilitata per impostazione predefinita.</p>
</dd>
<dt>Descrizione</dt>
<dd>
<p>Una breve descrizione del connection pool.</p>
</dd>
<dt>Dimensione pool iniziale e minima</dt>
<dd>
<p>Il numero minimo di connessioni nel pool. Questo valore determina inoltre il numero di connessioni inserite nel pool al momento della creazione del pool o all'avvio di GlassFish Server. Il valore predefinito &egrave; 8.</p>
</dd>
<dt>Dimensione massima pool</dt>
<dd>
<p>Il numero massimo di connessioni nel pool. Il valore predefinito &egrave; 32.</p>
</dd>
<dt>Quantit&agrave; di ridimensionamento pool</dt>
<dd>
<p>Quando si verificano lo scale up e lo scale down del pool, verso la dimensione massima e minima rispettivamente, il ridimensionamento viene eseguito per batch. Questo valore determina il numero di connessioni presenti nel batch. Se il valore &egrave; troppo grande pu&ograve; generare ritardi nella creazione e nella riattivazione delle connessioni, mentre se &egrave; troppo piccolo pu&ograve; ridurre le prestazioni complessive. Il valore predefinito &egrave; 2.</p>
</dd>
<dt>Timeout inattivit&agrave;</dt>
<dd>
<p>Il periodo di tempo massimo, in secondi, durante il quale una connessione pu&ograve; rimanere inattiva nel pool. Una volta trascorso il periodo di tempo impostato, la connessione viene rimossa dal pool. Il valore predefinito &egrave; 300.</p>
</dd>
<dt>Tempo massimo di attesa</dt>
<dd>
<p>Il periodo di tempo massimo, in millisecondi, durante il quale l'applicazione che richiede una connessione rimarr&agrave; in attesa prima che si verifichi il timeout della connessione. Il valore predefinito &egrave; 60.000.</p>
</dd>
<dt>Connessioni non transazionali</dt>
<dd>
<p>Se questa opzione &egrave; abilitata, le connessioni non transazionali vengono restituite.</p>
</dd>
<dt>Isolamento transazione</dt>
<dd>
<p>Se viene specificato un livello di isolamento transazione, le connessioni in questo pool funzionano al livello specificato. In caso contrario, le connessioni funzionano con i livelli di isolamento predefiniti forniti dal driver JDBC. Per impostazione predefinita, questa opzione non viene specificata.</p>
</dd>
<dt>Livello di isolamento</dt>
<dd>
<p>Se la casella di controllo Garantito &egrave; selezionata, tutte le connessioni del pool presentano lo stesso livello di isolamento. Ad esempio, se il livello di isolamento della connessione viene modificato a livello di programmazione (mediante <code>con.setTransactionIsolation</code>) al momento dell'ultimo utilizzo, questo meccanismo ripristina il livello di isolamento specificato per lo stato. Questa opzione &egrave; abilitata per impostazione predefinita.</p>
<p>Questa impostazione &egrave; applicabile solo se &egrave; stato specificato un livello isolamento transazione.</p>
</dd>
<dt>Propriet&agrave; aggiuntive</dt>
<dd>
<p>Propriet&agrave; aggiuntive per il connection pool JDBC. Queste propriet&agrave; possono includere il nome del database (URL), il nome utente e la password. In genere la tabella contiene le propriet&agrave; utilizzate dal fornitore del database.</p>
<p>Per la descrizione di alcune delle propriet&agrave; disponibili, vedere <a href="ref-jdbc-properties.html">Propriet&agrave; specifiche dei connection pool JDBC</a>.</p>
<p>Se non si specifica un valore per una propriet&agrave;, la propriet&agrave; interessata verr&agrave; rimossa dalla tabella al termine della creazione del connection pool. Se non si desidera impostare il valore di una propriet&agrave; in questa fase, conservando tuttavia la propriet&agrave; nella tabella in modo da impostarne il valore in un secondo momento, digitare un set di parentesi vuote nel campo Valore:</p>
<pre>
()
</pre></dd>
</dl>
<a id="sthref43" name="sthref43"></a>
<h5>Task correlati</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">Per impostare l'accesso al database</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">Per integrare un driver JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">Per creare un connection pool JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">Per modificare le impostazioni generali del connection pool JDBC</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">Per verificare le impostazioni del connection pool</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">Per modificare gli attributi avanzati del connection pool JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolproperty.html">Per modificare le propriet&agrave; del connection pool JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">Per eliminare un connection pool JDBC</a></p>
</li>
</ul>
<a id="sthref44" name="sthref44"></a>
<h5>Comandi asadmin correlati</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00001"><code>add-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00036"><code>create-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00088"><code>delete-jdbc-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00135"><code>flush-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00173"><code>list-jdbc-connection-pools</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00214"><code>ping-connection-pool</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00234"><code>start-database</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00239"><code>stop-database</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
