<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jdbcconnectionpoolproperty" name="task-jdbcconnectionpoolproperty"></a></p>

<h4><a id="sthref24" name="sthref24"></a>Per modificare le propriet&agrave; del connection pool JDBC</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Espandere il nodo Risorse nell'albero di navigazione.</p>
</li>
<li>
<p>Nel nodo Risorse espandere il nodo JDBC.</p>
</li>
<li>
<p>Nel nodo JDBC selezionare il nodo Connection pool.</p>
<p>Viene visualizzata la pagina Connection pool.</p>
</li>
<li>
<p>Fare clic sul nome del connection pool da modificare.</p>
<p>Viene visualizzata la pagina Modifica connection pool.</p>
</li>
<li>
<p>Nella pagina Modifica connection pool fare clic sulla scheda Propriet&agrave; aggiuntive.</p>
<p>Viene visualizzata la pagina Modifica propriet&agrave; connection pool JDBC.</p>
</li>
<li>
<p>Nella sezione Propriet&agrave; aggiuntive, specificare le propriet&agrave; aggiuntive.</p>
<p>Alcuni esempi di propriet&agrave; obbligatorie sono il nome del database (URL), il nome utente e la password. Per informazioni sulle propriet&agrave; disponibili, vedere <a href="ref-jdbc-properties.html">Propriet&agrave; specifiche dei connection pool JDBC</a>.</p>
<p>Se non si specifica un valore per una propriet&agrave;, la propriet&agrave; interessata verr&agrave; rimossa dalla tabella al termine della modifica del connection pool. Se non si desidera impostare il valore di una propriet&agrave; in questa fase, conservando tuttavia la propriet&agrave; nella tabella in modo da impostarne il valore in un secondo momento, digitare un set di parentesi vuote nel campo Valore:</p>
<pre>
()
</pre>
<ul>
<li>
<p>Per aggiungere una propriet&agrave;, fare clic sul pulsante Aggiungi propriet&agrave;. Nella riga vuota visualizzata, digitare il nome della propriet&agrave; nel campo Nome e il valore della propriet&agrave; nel campo Valore.</p>
</li>
<li>
<p>Per modificare una propriet&agrave;, &egrave; necessario modificare il valore del campo Valore della propriet&agrave;.</p>
</li>
<li>
<p>Per eliminare una propriet&agrave;, selezionare la casella di controllo a sinistra del campo Nome corrispondente alla propriet&agrave; da eliminare, quindi fare clic sul pulsante Elimina propriet&agrave;.</p>
</li>
</ul>
</li>
<li>
<p>Fare clic su Salva.</p>
</li>
</ol>
<a id="sthref25" name="sthref25"></a>
<h5>Vedere anche</h5>
<ul>
<li>
<p><a href="task-setdbaccess.html">Per impostare l'accesso al database</a></p>
</li>
<li>
<p><a href="task-integratejdbcdriver.html">Per integrare un driver JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcenew.html">Per creare una risorsa JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesedit.html">Per modificare una risorsa JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcetargets.html">Per modificare le destinazioni di una risorsa JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcresourcesdelete.html">Per eliminare una risorsa JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpoolnew.html">Per creare un connection pool JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooledit.html">Per modificare le impostazioni generali del connection pool JDBC</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooladvance.html">Per modificare gli attributi avanzati del connection pool JDBC</a></p>
</li>
<li>
<p><a href="task-verifyconnpoolsettings.html">Per verificare le impostazioni del connection pool</a></p>
</li>
<li>
<p><a href="task-jdbcconnectionpooldelete.html">Per eliminare un connection pool JDBC</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
