<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-ejbtimerservice" name="ref-ejbtimerservice"></a></p>

<h4><a id="sthref23" name="sthref23"></a><a id="sthref24" name="sthref24"></a><a id="sthref25" name="sthref25"></a>Service d'horloge EJB</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>La page Service d'horloge EJB permet de configurer le service d'horloge EJB.</p>
<p>Le service d'horloge est un service de notification persistant et transactionnel fourni par le conteneur d'Enterprise Beans qui sert &agrave; programmer des notifications ou des &eacute;v&eacute;nements utilis&eacute;s par les Enterprise Beans. Tous les Enterprise Beans, &agrave; l'exception des beans Session avec conservation de statut, peuvent recevoir des notifications du service d'horloge. Les horloges persistantes d&eacute;finies par le service ne sont pas d&eacute;truites lors de l'arr&ecirc;t ou du red&eacute;marrage du serveur.</p>
<p>La page Service d'horloge EJB contient les options ci-apr&egrave;s.</p>
<dl>
<dt>Charger les valeurs par d&eacute;faut</dt>
<dd>
<p>Bouton permettant de restaurer les valeurs par d&eacute;faut des param&egrave;tres qui en ont. Les param&egrave;tres qui n'ont pas de valeurs par d&eacute;faut ne sont pas modifi&eacute;s.</p>
</dd>
<dt>Nom de configuration</dt>
<dd>
<p>Nom de la configuration &agrave; laquelle s'appliquent les param&egrave;tres de cette page. Ce champ est en lecture seule.</p>
</dd>
<dt>Intervalle de distribution minimal</dt>
<dd>
<p>D&eacute;lai minimal, en millisecondes, au-del&agrave; duquel l'expiration suivante d'une horloge donn&eacute;e survient. La d&eacute;finition de cet intervalle sur une valeur trop basse peut provoquer une surcharge du serveur. La valeur par d&eacute;faut est 1000.</p>
</dd>
<dt>Nombre maximal de redistributions</dt>
<dd>
<p>Nombre maximal de tentatives effectu&eacute;es par le service d'horloge pour transmettre une expiration d'horloge en raison d'une exception ou d'une annulation (rollback). La valeur par d&eacute;faut est 1.</p>
</dd>
<dt>Intervalle de redistribution</dt>
<dd>
<p>Intervalle, en millisecondes, entre deux tentatives de redistribution. La valeur par d&eacute;faut est 5 000.</p>
</dd>
<dt>Source de donn&eacute;es de l'horloge</dt>
<dd>
<p>Nom JNDI de la ressource JDBC devant &ecirc;tre utilis&eacute;e comme source de donn&eacute;es de l'horloge. Si elle est sp&eacute;cifi&eacute;e, cette valeur remplace la valeur par d&eacute;faut de <code>jdbc/__TimerPool</code> de l'application du syst&egrave;me de service d'horloge.</p>
</dd>
</dl>
<a id="sthref26" name="sthref26"></a>
<h5>T&acirc;ches connexes</h5>
<ul>
<li>
<p><a href="task-ejbtimerservice.html">Configuration du service d'horloge EJB</a></p>
</li>
<li>
<p><a href="../../../ejb-lite/en/help/task-ejbgeneral.html">Configuration des param&egrave;tres EJB</a></p>
</li>
<li>
<p><a href="task-ejbmdbpoolsettings.html">Configuration des param&egrave;tres de pool MDB</a></p>
</li>
</ul>
<a id="sthref27" name="sthref27"></a>
<h5>Commandes asadmin connexes</h5>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00205"><code>list-timers</code>(1)</a></p>





<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
