<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-ejbcontaineravailability" name="task-ejbcontaineravailability"></a></p>

<h4><a id="sthref10" name="sthref10"></a><a id="sthref11" name="sthref11"></a><a id="sthref12" name="sthref12"></a><a id="sthref13" name="sthref13"></a>Configuration des param&egrave;tres de disponibilit&eacute; du conteneur EJB</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Configuration.</p>
</li>
<li>
<p>S&eacute;lectionnez la configuration &agrave; modifier.</p>
</li>
<li>
<p>Sous le noeud Configuration, s&eacute;lectionnez le noeud Service de disponibilit&eacute;.</p>
<p>La page Service de disponibilit&eacute; appara&icirc;t.</p>
</li>
<li>
<p>Sur la page Service de disponibilit&eacute;, cliquez sur l'onglet Disponibilit&eacute; du conteneur EJB.</p>
<p>La page Disponibilit&eacute; du conteneur EJB appara&icirc;t.</p>
</li>
<li>
<p>Cochez la case Activ&eacute; du champ Service de disponibilit&eacute; pour activer la disponibilit&eacute; du conteneur EJB.</p>
<p>Pour d&eacute;sactiver la disponibilit&eacute;, d&eacute;s&eacute;lectionnez la case Activ&eacute; du champ Service de disponibilit&eacute;.</p>
</li>
<li>
<p>Le type de persistance HA est <code>replicated</code>.</p>
<p>Ce m&eacute;canisme de persistance est utilis&eacute; lorsque le service de disponibilit&eacute; est activ&eacute;. La persistance est bas&eacute;e sur le basculement dans un cluster. Ne modifiez pas cette valeur.</p>
</li>
<li>
<p>Le type de persistance SFSB est <code>file</code>.</p>
<p>Ce m&eacute;canisme de persistance est utilis&eacute; lorsque le service de disponibilit&eacute; n'est <i>pas</i> activ&eacute;. La persistance est bas&eacute;e sur le syst&egrave;me de fichiers. Ne modifiez pas cette valeur.</p>
<p>Le champ Emplacement de stockage des sessions d&eacute;termine l'emplacement de persistance des &eacute;tats de point de reprise SFSB. Pour plus d'informations sur la d&eacute;finition de l'emplacement de stockage des sessions, reportez-vous &agrave; <a href="../../../ejb-lite/en/help/task-ejbgeneral.html">Configuration des param&egrave;tres EJB</a>.</p>
</li>
<li>
<p>Pour restaurer les valeurs par d&eacute;faut, cliquez sur le bouton Charger les valeurs par d&eacute;faut.</p>
</li>
<li>
<p>Dans la section Autres propri&eacute;t&eacute;s, sp&eacute;cifiez les propri&eacute;t&eacute;s suppl&eacute;mentaires.</p>
<p>GlassFish Server ne d&eacute;finit aucune autre propri&eacute;t&eacute; pour la disponibilit&eacute; du conteneur EJB.</p>
<ul>
<li>
<p>Pour ajouter une propri&eacute;t&eacute;, cliquez sur le bouton Ajouter une propri&eacute;t&eacute;. Sur la ligne vide qui appara&icirc;t, saisissez le nom de la propri&eacute;t&eacute; dans le champ Nom et la valeur de la propri&eacute;t&eacute; dans le champ Valeur.</p>
</li>
<li>
<p>Pour modifier une propri&eacute;t&eacute;, modifiez le champ Valeur de cette propri&eacute;t&eacute;.</p>
</li>
<li>
<p>Pour supprimer une propri&eacute;t&eacute;, s&eacute;lectionnez la case situ&eacute;e &agrave; gauche du champ Nom de la propri&eacute;t&eacute; &agrave; supprimer, puis cliquez sur le bouton Supprimer des propri&eacute;t&eacute;s.</p>
</li>
</ul>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>
</li>
</ol>
<a id="sthref14" name="sthref14"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="../../../ejb-lite/en/help/task-ejbgeneral.html">Configuration des param&egrave;tres EJB</a></p>
</li>
<li>
<p><a href="task-ejbmdbpoolsettings.html">Configuration des param&egrave;tres de pool MDB</a></p>
</li>
<li>
<p><a href="task-ejbtimerservice.html">Configuration du service d'horloge EJB</a></p>
</li>
</ul>




<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
