<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-ejbtimerservice" name="task-ejbtimerservice"></a></p>

<h4><a id="sthref6" name="sthref6"></a><a id="sthref7" name="sthref7"></a><a id="sthref8" name="sthref8"></a>Configuration du service d'horloge EJB</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Le service d'horloge est un service de notification persistant et transactionnel fourni par le conteneur d'Enterprise Beans qui sert &agrave; programmer des notifications ou des &eacute;v&eacute;nements utilis&eacute;s par les Enterprise Beans. Tous les Enterprise Beans, &agrave; l'exception des beans Session avec conservation de statut, peuvent recevoir des notifications du service d'horloge. Les horloges persistantes d&eacute;finies par le service ne sont pas d&eacute;truites lors de l'arr&ecirc;t ou du red&eacute;marrage du serveur.</p>
<ol>
<li>
<p>Dans l'arborescence de navigation, d&eacute;veloppez le noeud Configuration.</p>
</li>
<li>
<p>S&eacute;lectionnez le noeud Conteneur EJB.</p>
<p>La page Enterprise Java Beans (EJB) appara&icirc;t.</p>
</li>
<li>
<p>Cliquez sur l'onglet Service d'horloge EJB.</p>
<p>La page Service d'horloge EJB appara&icirc;t.</p>
</li>
<li>
<p>Dans le champ Intervalle de distribution minimal, indiquez le d&eacute;lai minimal, en millisecondes, au-del&agrave; duquel l'expiration suivante d'une horloge donn&eacute;e survient.</p>
<p>La d&eacute;finition de cet intervalle sur une valeur trop basse peut provoquer une surcharge du serveur. La valeur par d&eacute;faut est 1000.</p>
</li>
<li>
<p>Dans le champ Nombre maximal de redistributions, indiquez le nombre maximal de tentatives effectu&eacute;es par le service d'horloge pour transmettre une expiration d'horloge en raison d'une exception ou d'une annulation (rollback).</p>
<p>La valeur par d&eacute;faut est 1.</p>
</li>
<li>
<p>Dans le champ Intervalle de redistribution, indiquez le d&eacute;lai, en millisecondes, entre deux tentatives de redistribution.</p>
<p>La valeur par d&eacute;faut est 5 000.</p>
</li>
<li>
<p>Dans le champ Source de donn&eacute;es de l'horloge, indiquez le nom JNDI de la ressource JDBC &agrave; utiliser comme source de donn&eacute;es de l'horloge.</p>
<p>Si elle est sp&eacute;cifi&eacute;e, cette valeur remplace la valeur par d&eacute;faut de <code>jdbc/__TimerPool</code> de l'application du syst&egrave;me de service d'horloge.</p>
</li>
<li>
<p>Cliquez sur Enregistrer.</p>

<hr>
<p><b>Conseil:</b></p>
Pour revenir aux param&egrave;tres par d&eacute;faut, cliquez sur le bouton Charger les valeurs par d&eacute;faut, puis sur Enregistrer.
<hr>

</li>
<li>
<p>Red&eacute;marrez GlassFish Server.</p>
</li>
</ol>
<a id="sthref9" name="sthref9"></a>
<h5>Voir aussi</h5>
<ul>
<li>
<p><a href="../../../ejb-lite/en/help/task-ejbgeneral.html">Configuration des param&egrave;tres EJB</a></p>
</li>
<li>
<p><a href="task-ejbmdbpoolsettings.html">Configuration des param&egrave;tres de pool MDB</a></p>
</li>
<li>
<p><a href="task-ejbcontaineravailability.html">Configuration des param&egrave;tres de disponibilit&eacute; du conteneur EJB</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
