<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsphysicaldestedit" name="ref-jmsphysicaldestedit"></a></p>

<h4><a id="sthref96" name="sthref96"></a><a id="sthref97" name="sthref97"></a>Physisches JMS-Ziel bearbeiten</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Auf der Seite "Physisches JMS-Ziel bearbeiten" k&ouml;nnen Sie die Einstellungen f&uuml;r ein physisches JMS-Ziel &auml;ndern.</p>
<p>Die Seite "Physisches JMS-Ziel bearbeiten" enth&auml;lt die folgenden Optionen.</p>
<dl>
<dt>Name</dt>
<dd>
<p>Der Name des physischen Ziels. Dies ist ein schreibgesch&uuml;tztes Feld. Sie k&ouml;nnen den Namen nur festlegen, wenn Sie eine JMS-Zielressource oder ein physisches Ziel erstellen.</p>
</dd>
<dt>Typ</dt>
<dd>
<p>Der Typ des physischen Ziels. Dies ist ein schreibgesch&uuml;tztes Feld. Sie k&ouml;nnen den Typ nur festlegen, wenn Sie eine JMS-Zielressource oder ein physisches Ziel erstellen.</p>
</dd>
<dt>H&ouml;chstzahl nicht konsumierter Nachrichten</dt>
<dd>
<p>Die f&uuml;r das Ziel maximal zul&auml;ssige Anzahl nicht konsumierter Nachrichten. Der Wert -1 bedeutet, dass die Anzahl der nicht konsumierten Nachrichten nicht begrenzt ist. Der Standardwert ist -1.</p>
</dd>
<dt>Maximalgr&ouml;&szlig;e von Nachrichten</dt>
<dd>
<p>Die maximal zul&auml;ssige Gr&ouml;&szlig;e einer einzelnen Nachricht in Byte. Der Wert -1 bedeutet, dass die Nachrichtengr&ouml;&szlig;e unbegrenzt ist. Der Standardwert ist -1.</p>
</dd>
<dt>Maximaler Gesamtspeicher</dt>
<dd>
<p>Der maximale Gesamtspeicher f&uuml;r nicht konsumierte Nachrichten in Byte. Der Wert -1 bedeutet, dass die Speichergr&ouml;&szlig;e f&uuml;r nicht konsumierte Nachrichten nicht begrenzt ist. Der Standardwert ist -1.</p>
</dd>
<dt>Schwellenwertbehavior</dt>
<dd>
<p>Das Behavior, das der Broker bei Erreichen des Speicherschwellenwerts anwenden soll. Zur Auswahl stehen:</p>
<dl>
<dt>Neueste Nachrichten ablehnen</dt>
<dd>
<p>Die neuesten Nachrichten werden zur&uuml;ckgewiesen, und der produzierende Client wird nur dann mit einer Ausnahme benachrichtigt, wenn die Nachricht persistent ist. Dies ist der Standardwert.</p>
</dd>
<dt>Producer verlangsamen</dt>
<dd>
<p>Die Geschwindigkeit, mit der Nachrichten-Producer Nachrichten senden, wird verringert.</p>
</dd>
<dt>Throw out oldest</dt>
<dd>
<p>Die &auml;ltesten Nachrichten werden verworfen.</p>
</dd>
<dt>Throw out lowest-priority messages</dt>
<dd>
<p>Die Nachrichten mit der niedrigsten Priorit&auml;t werden verworfen.</p>
</dd>
</dl>
<p>Wenn der Wert "Throw out oldest" oder "Throw out lowest-priority messages" gew&auml;hlt und "Queue f&uuml;r nicht zugestellte Nachrichten verwenden" auf "True" gesetzt ist, werden &uuml;bersch&uuml;ssige Nachrichten in die Queue f&uuml;r nicht zugestellte Nachrichten verschoben.</p>
</dd>
<dt>H&ouml;chstzahl von Producern</dt>
<dd>
<p>Die maximale Anzahl an Nachrichten-Producern, die mit diesem physischen Ziel verkn&uuml;pft werden k&ouml;nnen. Bei Erreichen dieses Grenzwerts k&ouml;nnen keine neuen Producer mehr erstellt werden. Der Wert -1 bedeutet, dass die Anzahl der Producer unbegrenzt ist. Der Standardwert ist 100.</p>
</dd>
<dt>H&ouml;chstzahl der Nachrichten bei Batchzustellung</dt>
<dd>
<p>Die maximale Anzahl an Nachrichten, die Konsumenten in einem einzigen Batch zugestellt werden k&ouml;nnen. Der Wert -1 bedeutet, dass die Anzahl der Nachrichten unbegrenzt ist. Der Standardwert ist 1000.</p>
</dd>
<dt>Queue f&uuml;r nicht zugestellte Nachrichten verwenden</dt>
<dd>
<p>Bei aktivierter Option werden nicht zugestellte Nachrichten in die Queue f&uuml;r nicht zugestellte Nachrichten gestellt. Bei deaktivierter Option werden nicht zugestellte Nachrichten verworfen. Diese Option ist standardm&auml;&szlig;ig aktiviert.</p>
</dd>
<dt>XML-Schema validieren</dt>
<dd>
<p>Bei aktivierter Option versucht die Message Queue-Clientlaufzeitumgebung, eine XML-Meldung anhand der angegebenen XML-Schemadefinitionen (oder anhand der DTD, falls keine XSD angegeben ist) zu &uuml;berpr&uuml;fen, bevor sie an den Broker gesendet wird. Wenn das angegebene Schema nicht gefunden oder die Nachricht nicht validiert werden kann, wird die Nachricht nicht gesendet, und eine Exception wird ausgel&ouml;st. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>XML-Schema - URI-Liste</dt>
<dd>
<p>Eine mit Leerzeichen getrennte Liste von URI-Zeichenfolgen einer XML-Schemadefinition (XSD). Wenn die XML-Schema&uuml;berpr&uuml;fung aktiviert ist, verweisen die URIs auf den Speicherort einer oder mehrerer XSDs, die f&uuml;r die XML-Schema&uuml;berpr&uuml;fung zu verwenden sind.</p>
</dd>
</dl>
<a id="sthref98" name="sthref98"></a>
<h5>Verwandte Aufgaben</h5>
<ul>
<li>
<p><a href="task-jmsservice.html">So wird der JMS-Service konfiguriert</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestnew.html">So wird ein physisches JMS-Ziel erstellt</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestedit.html">So wird ein physisches JMS-Ziel bearbeitet</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestdelete.html">So wird ein physisches JMS-Ziel gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-jmsflushmessages.html">So werden Nachrichten aus einem physischen JMS-Ziel entfernt</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldeststats.html">So werden Statistiken f&uuml;r ein physisches JMS-Ziel angezeigt</a></p>
</li>
</ul>
<a id="sthref99" name="sthref99"></a>
<h5>Zugeh&ouml;rige asadmin-Befehle</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00038"><code>create-jmsdest</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00175"><code>list-jmsdest</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00090"><code>delete-jmsdest</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00136"><code>flush-jmsdest</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00144"><code>jms-ping</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
