<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsconnectionnew" name="ref-jmsconnectionnew"></a></p>

<h4><a id="sthref49" name="sthref49"></a><a id="sthref50" name="sthref50"></a>New JMS Connection Factory</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Auf der Seite "Neue JMS-Connection Factory" k&ouml;nnen Sie eine neue JMS-Connection Factory erstellen.</p>
<p>Die Seite "Neue JMS-Connection Factory" enth&auml;lt die folgenden Optionen.</p>
<dl>
<dt>JNDI-Name</dt>
<dd>
<p>Ein eindeutiger JNDI-Name, der die Ressource identifiziert. Konventionsgem&auml;&szlig; beginnt der Name mit einem Indikator des Ressourcentyps gefolgt von einem Schr&auml;gstrich. Beispiel: concurrent/, jdbc/ oder jms/.</p>
</dd>
<dt>Ressourcentyp</dt>
<dd>
<p>Der Typ der Connection Factory. Zur Auswahl stehen <code>javax.jms.ConnectionFactory</code>, <code>javax.jms.QueueConnectionFactory</code>und <code>javax.jms.TopicConnectionFactory</code>.</p>
</dd>
<dt>Beschreibung</dt>
<dd>
<p>Eine Beschreibung der Connection Factory.</p>
</dd>
<dt>Status</dt>
<dd>
<p>Der Status der Connection Factory. Die Connection Factory kann aktiviert oder deaktiviert sein. Diese Option ist standardm&auml;&szlig;ig aktiviert.</p>
</dd>
<dt>Urspr&uuml;ngliche und minimale Poolgr&ouml;&szlig;e</dt>
<dd>
<p>Die Mindestanzahl Verbindungen im Pool f&uuml;r die Connection Factory. Der Standardwert ist 8.</p>
</dd>
<dt>Maximale Poolgr&ouml;&szlig;e</dt>
<dd>
<p>Die H&ouml;chstanzahl Verbindungen im Pool f&uuml;r die Connection Factory. Der Standardwert ist 32.</p>
</dd>
<dt>Anzahl der Gr&ouml;&szlig;en&auml;nderungen des Pools</dt>
<dd>
<p>Die Anzahl an Verbindungen, die nach Ablauf der Poolleerlaufzeit entfernt werden sollen. Der Standardwert ist 2.</p>
</dd>
<dt>Leerlauftimeout</dt>
<dd>
<p>Die maximale Zeit in Sekunden, die sich eine Verbindung im Pool im Leerlauf befinden kann. Der Standardwert ist 300.</p>
</dd>
<dt>Max. Wartezeit</dt>
<dd>
<p>Die Zeitspanne, die eine Anwendung nach dem Anfordern einer Verbindung abwartet, bevor ein Verbindungstimeout ausgegeben wird. Der Standardwert ist 60000.</p>
</dd>
<dt>Bei einem beliebigen Fehler</dt>
<dd>
<p>Wenn das Kontrollk&auml;stchen "Alle Verbindungen trennen" aktiviert ist, schlie&szlig;t GlassFish Server bei einem einzigen Verbindungsabbruch alle Verbindungen im Pool und stellt sie wieder her. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>Transaktionsunterst&uuml;tzung</dt>
<dd>
<p>Die gew&auml;hlte Transaktionsunterst&uuml;tzung &uuml;berschreibt das Transaktionsunterst&uuml;tzungsattribut des mit diesem Connection-Pool verkn&uuml;pften Ressourcenadapters in einer Weise, mit der Abw&auml;rtskompatibilit&auml;t gew&auml;hrleistet wird. Anders ausgedr&uuml;ckt: Es kann dieselbe oder eine niedrigere Transaktionsebene unterst&uuml;tzt werden als die im Ressourcenadapter angegebene, jedoch keine h&ouml;here Transaktionsebene.</p>
<p>Folgende Werte sind m&ouml;glich:</p>
<dl>
<dt>XATransaction</dt>
<dd>
<p>Die Ressource kann f&uuml;r Transaktionen eingesetzt werden, f&uuml;r die mehrere Ressourcen innerhalb eines Transaktionsbereichs verwendet werden. Dies ist der Standardwert f&uuml;r eine JMS-Connection Factory.</p>
<p>Beispiel: Transaktionen k&ouml;nnen diese Ressource sowie eine JDBC-Ressource, eine Connector-Ressource oder eine andere JMS-Connection Factory-Ressource verwenden. Dieser Wert bietet die meiste Flexibilit&auml;t. Eine Ressource, die als XATransaction konfiguriert ist, wird f&uuml;r Two-Phase Commit-Vorg&auml;nge verwendet.</p>
</dd>
<dt>LocalTransaction</dt>
<dd>
<p>Die Ressource kann entweder f&uuml;r Transaktionen mit nur einer Ressource innerhalb des Transaktionsbereichs oder als letzter Agent in einer verteilten Transaktion mit mehreren XA-Ressourcen verwendet werden.</p>
<p>Dieser Wert bietet eine wesentlich bessere Performance. Eine als LocalTransaction konfigurierte Ressource wird nicht in Two-Phase Commit-Vorg&auml;ngen verwendet.</p>
</dd>
<dt>NoTransaction</dt>
<dd>
<p>Die Ressource kann nie in Transaktionen verwendet werden. Diese Einstellung wird f&uuml;r JMS-Anwendungen nur eingeschr&auml;nkt verwendet.</p>
</dd>
</dl>
</dd>
<dt>Verbindungsvalidierung</dt>
<dd>
<p>Wenn das Kontrollk&auml;stchen "Erforderlich" aktiviert ist, werden Verbindungen vor der &Uuml;bergabe an die Anwendung validiert. Wenn die Validierung einer Ressource nicht erfolgreich verl&auml;uft, wird die Ressource endg&uuml;ltig gel&ouml;scht, und eine neue Ressource wird erstellt und zur&uuml;ckgegeben. Diese Option ist standardm&auml;&szlig;ig deaktiviert.</p>
</dd>
<dt>Weitere Eigenschaften</dt>
<dd>
<p>Weitere Eigenschaften f&uuml;r die Connection Factory.</p>
<p>Information zu verf&uuml;gbaren Eigenschaften finden Sie unter <a href="ref-jmsconnectionproperties.html">F&uuml;r JMS-Connection Factorys spezifische Eigenschaften</a>.</p>
</dd>
<dt>Ziele</dt>
<dd>
<p>(Diese Option wird angezeigt, wenn in der Domain Cluster oder Standalone-Instanzen erstellt wurden.)</p>
<p>Cluster und Standalone-Instanzen f&uuml;r die Ressource. Mithilfe der Schaltfl&auml;chen "Hinzuf&uuml;gen" und "Alle hinzuf&uuml;gen" verschieben Sie die ben&ouml;tigten Ziele in die Spalte "Ausgew&auml;hlte Ziele". Verschieben Sie die nicht ben&ouml;tigten Ziele in die Spalte "Verf&uuml;gbare Ziele" mithilfe der Schaltfl&auml;chen "Entfernen" und "Alle entfernen".</p>
</dd>
</dl>
<a id="sthref51" name="sthref51"></a>
<h5>Verwandte Aufgaben</h5>
<ul>
<li>
<p><a href="task-jmsconnectionnew.html">So werden JMS-Connection Factory-Ressourcen erstellt</a></p>
</li>
<li>
<p><a href="task-jmsconnectionedit.html">So werden JMS-Connection Factory-Ressourcen bearbeitet</a></p>
</li>
<li>
<p><a href="task-jmsconnectiondelete.html">So werden JMS-Connection Factory-Ressourcen gel&ouml;scht</a></p>
</li>
</ul>
<a id="sthref52" name="sthref52"></a>
<h5>Zugeh&ouml;rige asadmin-Befehle</h5>
<ul>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00040"><code>create-jms-resource</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00177"><code>list-jms-resources</code>(1)</a></p>
</li>
<li>
<p><a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSRFM00092"><code>delete-jms-resource</code>(1)</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
