<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsconnectionproperties" name="ref-jmsconnectionproperties"></a><a id="GHJMS00005" name="GHJMS00005"></a></p>

<h4><a id="sthref57" name="sthref57"></a><a id="sthref58" name="sthref58"></a>F&uuml;r JMS-Connection Factorys spezifische Eigenschaften</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Folgende weitere Eigenschaften stehen f&uuml;r eine JMS-Connection Factory zur Verf&uuml;gung.</p>
<dl>
<dt><code>ClientId</code></dt>
<dd>
<p>Gibt eine Client-ID f&uuml;r eine Connection Factory an, die von einem dauerhaften Abonnenten verwendet wird.</p>
</dd>
<dt><code>AddressList</code></dt>
<dd>
<p>Gibt den Namen (und optional die Portnummer) von mindestens einer Message Broker-Instanz an, mit der Anwendungen kommunizieren. Jede Adresse in der Liste enth&auml;lt den Hostnamen (und optional den Hostport und den Verbindungsservice) f&uuml;r die Verbindung. Beispiel: Der Wert kann <code>earth</code> oder <code>earth:7677</code> lauten. Geben Sie die Portnummer an, wenn der Message Broker nicht auf dem Standardport (7676) ausgef&uuml;hrt wird. Wenn die Eigenschafteneinstellung mehrere Hosts und Ports in einer Clusterumgebung angibt, wird der erste verf&uuml;gbare Host in der Liste verwendet (sofern die Eigenschaft <code>AddressListBehavior</code> nicht auf <code>RANDOM</code> gesetzt ist.</p>
<p>Weitere Einzelheiten finden Sie im <i>Message Queue Developer's Guide for Java Clients</i>.</p>
<p>Der Standardwert besteht aus dem lokalen Host und der Standardportnummer (7676). Der Client versucht, &uuml;ber Port 7676 des lokalen Hosts eine Verbindung zu einem Broker herzustellen.</p>
</dd>
<dt><code>UserName</code></dt>
<dd>
<p>Der Benutzername f&uuml;r die Connection Factory.</p>
<p>Der Standardwert ist <code>guest</code>.</p>
</dd>
<dt><code>Password</code></dt>
<dd>
<p>Das Kennwort f&uuml;r die Connection Factory.</p>
<p>Der Standardwert ist <code>guest</code>.</p>
</dd>
<dt><code>ReconnectEnabled</code></dt>
<dd>
<p>Wenn diese Eigenschaft auf <code>True</code> gesetzt wird, versucht die Clientlaufzeitumgebung, erneut eine Verbindung zu einem Message Server (oder zur Liste der Adressen in <code>AddressList</code>) herzustellen, wenn eine Verbindung unterbrochen wird.</p>
<p>Der Standardwert ist <code>True</code>.</p>
</dd>
<dt><code>ReconnectAttempts</code></dt>
<dd>
<p>Gibt die Anzahl von Versuchen zum (erneuten) Herstellen einer Verbindung f&uuml;r jede Adresse in <code>AddressList</code> an, bevor die Clientlaufzeitumgebung mit der n&auml;chsten Adresse in der Liste fortf&auml;hrt. Der Wert -1 zeigt an, dass die Anzahl von Versuchen zum erneuten Herstellen einer Verbindung unbegrenzt ist (die Clientlaufzeitumgebung versucht, eine Verbindung mit der ersten Adresse herzustellen, bis dieser Vorgang erfolgreich ausgef&uuml;hrt werden kann).</p>
<p>Der Standardwert ist 3.</p>
</dd>
<dt><code>ReconnectInterval</code></dt>
<dd>
<p>Gibt das Intervall zwischen Versuchen zum erneuten Herstellen einer Verbindung in Millisekunden an. Dieser Wert bezieht sich auf jede Adresse in der Eigenschaft <code>AddressList</code> sowie auf nachfolgende Adressen in der Liste. Wenn ein zu kleiner Wert gew&auml;hlt wird, verf&uuml;gt der Broker nicht &uuml;ber ausreichend Zeit f&uuml;r die Wiederherstellung. Wenn das Intervall zu lang ist, erf&auml;hrt die Verbindungsherstellung m&ouml;glicherweise eine nicht akzeptable Verz&ouml;gerung.</p>
<p>Der Standardwert ist 30000.</p>
</dd>
<dt><code>AddressListBehavior</code></dt>
<dd>
<p>Gibt an, ob die Versuche zur Verbindungswiederherstellung in der Reihenfolge der Adressen im Attribut <code>AddressList</code> (<code>PRIORITY</code>) oder in einer zuf&auml;lligen Reihenfolge (<code>RANDOM</code>) durchgef&uuml;hrt werden.</p>
<p><code>RANDOM</code> bedeutet, dass bei der Verbindungswiederherstellung eine zuf&auml;llige Adresse aus <code>AddressList</code> ausgew&auml;hlt wird. Wenn die Wahrscheinlichkeit hoch ist, dass eine Vielzahl von Clients versucht, &uuml;ber dieselbe Connection Factory eine Verbindung herzustellen, verhindert dieser Wert, dass alle Clients mit derselben Adresse verbunden werden.</p>
<p><code>PRIORITY</code> bedeutet, dass der Versuch zur Verbindungswiederherstellung immer &uuml;ber die erste Serveradresse in <code>AddressList</code> erfolgt und eine andere Adresse nur dann verwendet wird, wenn der erste Broker nicht verf&uuml;gbar ist.</p>
<p>Der Standardwert ist <code>RANDOM</code>.</p>
</dd>
<dt><code>AddressListIterations</code></dt>
<dd>
<p>Gibt die Anzahl von <code>AddressList</code>-Durchl&auml;ufen einer Clientlaufzeitumgebung an, um (erneut) eine Verbindung herzustellen. Der Wert -1 gibt an, dass die Anzahl der Versuche unbegrenzt ist.</p>
<p>Der Standardwert ist 3.</p>
</dd>
</dl>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
