<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-jmsavailability" name="ref-jmsavailability"></a></p>

<h4><a id="sthref71" name="sthref71"></a><a id="sthref72" name="sthref72"></a>JMS-Verf&uuml;gbarkeit</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Verwenden Sie die Seite "JMS-Verf&uuml;gbarkeit", um das Message-Queue-Broker-Cluster zur Bearbeitung des GlassFish Server-Clusters zu konfigurieren.</p>

<hr>
<p><b>Achtung:</b></p>
Bevor Sie auf der Seite "JMS-Verf&uuml;gbarkeit" ein vorhandenes Cluster neu konfigurieren, folgen Sie den Spezialverfahren f&uuml;r die Migration in einen anderen Broker-Clustertyp gem&auml;&szlig; der Beschreibung unter <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSHAG00158">To Migrate Between Types of Embedded or Local Conventional Broker Clusters</a> im <i>Oracle GlassFish Server High Availability Administration Guide</i>. Wenn Sie diese Spezialverfahren nicht ausf&uuml;hren, kann dies zu Datenverlust oder -besch&auml;digung f&uuml;hren und das Setup sogar unbrauchbar machen, abh&auml;ngig von den auf dem vorhandenen Cluster ausgef&uuml;hrten JMS-Vorg&auml;ngen.
<hr>

<p>Die Seite "JMS-Verf&uuml;gbarkeit" enth&auml;lt die folgenden Optionen.</p>

<hr>
<p><b>Hinweis:</b></p>
Wenn Instanzen mit dieser Konfiguration ausgef&uuml;hrt werden, wird auf der Seite "JMS-Verf&uuml;gbarkeit" eine Warnung angezeigt, alle Optionen werden auf schreibgesch&uuml;tzt gesetzt und die Schaltfl&auml;che "Speichern" wird deaktiviert.
<hr>

<dl>
<dt>JMS-Servicetyp</dt>
<dd>
<p>Der Typ des Brokers (in GlassFish Server JMS-Host genannt), der im Broker-Cluster verwendet werden soll. Der gew&auml;hlte Typ bestimmt, welche Broker-Clustertypen verf&uuml;gbar sind. Die folgenden Broker-Typen stehen zur Verf&uuml;gung:</p>
<dl>
<dt>Eingebettet</dt>
<dd>
<p>Konfiguration und Lebenszyklus des Brokers werden von GlassFish Server verwaltet. Jede geclusterte GlassFish-Instanz wird von einem Broker bearbeitet, der auf der gleichen JVM ausgef&uuml;hrt wird wie die Instanz.</p>
<p>Wenn die Option "JMS-Servicetyp" auf "Eingebettet" gesetzt ist, werden nur herk&ouml;mmliche Message-Queue-Broker-Cluster unterst&uuml;tzt. Optionen zur Konfiguration des herk&ouml;mmlichen Clusters werden angezeigt.</p>
</dd>
<dt>Lokal</dt>
<dd>
<p>Konfiguration und Lebenszyklus des Brokers werden von GlassFish Server verwaltet. Jede geclusterte GlassFish-Instanz wird von einem Broker bearbeitet, der in einer separaten JVM auf demselben Host wie die Instanz ausgef&uuml;hrt wird.</p>
<p>Wenn die Option "JMS-Servicetyp" auf "Lokal" gesetzt ist, werden sowohl herk&ouml;mmliche als auch erweiterte (hochverf&uuml;gbare) Message-Queue-Broker-Cluster unterst&uuml;tzt. Optionen zur Auswahl des Clustertyps und zur Konfiguration des Clusters werden angezeigt.</p>
</dd>
<dt>Remote</dt>
<dd>
<p>Konfiguration und Lebenszyklus des Brokers und Broker-Clusters werden mit den administrativen Message-Queue-Tools verwaltet.</p>
<p>Wenn die Option "JMS-Servicetyp" auf "Remote" gesetzt ist, werden keine weiteren Optionen angezeigt.</p>
</dd>
</dl>
</dd>
<dt>JMS-Clustertyp</dt>
<dd>
<p>Der Typ des Message-Queue-Broker-Clusters, der f&uuml;r das GlassFish Server-Cluster verwendet werden soll.</p>
<p>Wenn die Option "JMS-Clustertyp" auf "Herk&ouml;mmlich" gesetzt ist, werden die folgenden Optionen angezeigt.</p>
<dl>
<dt>JMS-Konfigurationsspeichertyp</dt>
<dd>
<p>Der Typ des Datenspeichers, der f&uuml;r die Konfigurationsdaten in einem herk&ouml;mmlichen Cluster verwendet wird. Ist f&uuml;r diese Option "Master-Broker" festgelegt, so wird ein Broker im Cluster als Master-Broker bestimmt, der dann die Konfigurationsdaten speichert. Ist f&uuml;r diese Option "Gemeinsam verwendete DB" festgelegt, werden die Konfigurationsdaten in einem JDBC-Datenspeicher gespeichert, der f&uuml;r alle Broker zug&auml;nglich ist. In diesem Fall werden datenbankbezogene Optionen angezeigt.</p>
</dd>
<dt>JMS-Nachrichtenspeichertyp</dt>
<dd>
<p>Der Typ des Datenspeichers, den jeder Broker zur Speicherung seiner Nachrichtendaten verwendet. Ist f&uuml;r diese Option "Datei" festgelegt, speichert jeder Broker seine Nachrichtendaten in einem dateibasierten Datenspeicher. Ist f&uuml;r diese Option "JDBC" festgelegt, speichert jeder Broker seine Nachrichtendaten in einem JDBC-Datenspeicher.</p>
</dd>
</dl>
<p>Wenn die Option "JMS-Clustertyp" auf "Erweitert (HA)" gesetzt ist, werden die datenbankbezogenen Optionen angezeigt.</p>
</dd>
<dt>Datenbankanbieter</dt>
<dt>Datenbank-URL</dt>
<dt>Datenbankbenutzer</dt>
<dd>
<p>Anbieter, Zugriffs-URL und Benutzer der JDBC-Datenbank f&uuml;r die Verwendung in folgenden F&auml;llen:</p>
<ul>
<li>
<p>Wenn der Konfigurationsspeichertyp eines herk&ouml;mmlichen Clusters auf "Gemeinsam verwendete DB" gesetzt ist</p>
</li>
<li>
<p>Wenn der Nachrichtenspeichertyp eines herk&ouml;mmlichen Clusters auf "JDBC" gesetzt ist</p>
</li>
<li>
<p>Wenn der Clustertyp auf "Erweitert (HA)" gesetzt ist</p>
</li>
</ul>
<p>Weitere Informationen &uuml;ber unterst&uuml;tzte Hersteller und die Formate der Zugriffs-URLs f&uuml;r jeden Hersteller finden Sie in <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GMADG00244">JDBC-Based Persistence</a> im <i>Oracle GlassFish Server Message Queue Administration Guide</i>.</p>
</dd>
<dt>Datenbankauthentifizierung</dt>
<dt>Datenbankkennwort</dt>
<dt>Kennwortalias</dt>
<dd>
<p>Die unter "Datenbankbenutzer" angegebenen Kennwortinformationen f&uuml;r den Benutzer der JDBC-Datenbank.</p>
<p>Wenn "Datenbankauthentifizierung" auf "Kennwort" gesetzt ist, wird die Option "Datenbankkennwort" angezeigt. Wenn "Datenbankauthentifizierung" auf "Kennwortalias" gesetzt ist, wird die Option "Kennwortalias" angezeigt.</p>
</dd>
<dt>Weitere Eigenschaften</dt>
<dd>
<p>Weitere Eigenschaften f&uuml;r die JMS-Verf&uuml;gbarkeit.</p>
<p>Bei GlassFish Server sind keine weiteren Eigenschaften f&uuml;r die JMS-Verf&uuml;gbarkeit vordefiniert.</p>
</dd>
</dl>
<a id="sthref73" name="sthref73"></a>
<h5>Verwandte Aufgaben</h5>
<p><a href="task-jmsservice.html">So wird der JMS-Service konfiguriert</a></p>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
