<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsservice" name="task-jmsservice"></a></p>

<h4><a id="sthref20" name="sthref20"></a>So wird der JMS-Service konfiguriert</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Auf der Seite "JMS-Service" k&ouml;nnen Sie Einstellungen konfigurieren, die von allen JMS-Verbindungen verwendet werden sollen.</p>
<p>Weitere Informationen zum Konfigurieren des JMS-Service finden Sie in <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDVG00020">Chapter 19, <i>Using the Java Message Service,</i> im <i>Oracle GlassFish Server Application Development Guide</i></a>.</p>
<ol>
<li>
<p>Blenden Sie in der Navigationsbaumstruktur den Knoten "Konfiguration" ein.</p>
</li>
<li>
<p>W&auml;hlen Sie die zu konfigurierende Instanz:</p>
<ul>
<li>
<p>Um eine bestimmte Instanz zu konfigurieren, w&auml;hlen Sie den Konfigurationsknoten der Instanz. Beispiel: F&uuml;r die Standardinstanz <code>server</code> w&auml;hlen Sie den Knoten <code>server-config</code>.</p>
</li>
<li>
<p>Um die Standardeinstellungen f&uuml;r zuk&uuml;nftige Instanzen zu konfigurieren, die eine Kopie von <code>default-config</code> verwenden, w&auml;hlen Sie den Knoten <code>default-config</code>.</p>
</li>
</ul>
</li>
<li>
<p>W&auml;hlen Sie unter dem Konfigurationsknoten den Knoten "Java Message Service".</p>
<p>Die Seite "JMS-Service" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>In der Dropdown-Liste "Typ":</p>
<ul>
<li>
<p>W&auml;hlen Sie EMBEDDED, um auf den JMS-Service auf dem lokalen Host zuzugreifen.</p>
<p>Der JMS-Service wird in derselben JVM gestartet wie GlassFish Server. Bei verz&ouml;gerter Initialisierung wird der eingebettete Standard-Broker nicht beim Start von GlassFish Server, sondern beim ersten Zugriff auf JMS-Services gestartet. Dies ist der standardm&auml;&szlig;ige JMS-Servicetyp.</p>
</li>
<li>
<p>W&auml;hlen Sie LOCAL, um auf den JMS-Service auf dem lokalen Host zuzugreifen.</p>
<p>Der JMS-Service wird gleichzeitig mit GlassFish Server gestartet.</p>
</li>
<li>
<p>W&auml;hlen Sie REMOTE, um auf den JMS-Service auf einem anderen System oder in einem anderen Cluster zuzugreifen.</p>
<p>Bei Auswahl von REMOTE wird der JMS-Service beim n&auml;chsten Serverstart nicht durch GlassFish Server gestartet. Stattdessen wird der JMS-Service &uuml;ber Message Queue gestartet und verwaltet, sodass der Message Queue-Broker separat gestartet werden muss. Informationen &uuml;ber das Starten des Brokers finden Sie in <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GMADG00227"><i>Starting Brokers</i> im <i>Oracle GlassFish Server Message Queue Administration Guide</i></a>. Wenn Sie diesen Wert w&auml;hlen und einen Remote-Host verwenden, befolgen Sie die Anweisungen unter <a href="task-jmshostedit.html">So wird ein JMS-Host bearbeitet</a>, um den Namen des Remote-Hosts anzugeben.</p>
</li>
</ul>
</li>
<li>
<p>Geben Sie im Feld "Timeout beim Hochfahren" die Anzahl Sekunden ein, die GlassFish Server auf das Starten des JMS-Service wartet, bevor der Startvorgang abgebrochen wird.</p>
<p>Auf einem langsamen oder &uuml;berlasteten System sollten Sie den Standardwert erh&ouml;hen. Der Standardwert ist 60.</p>
</li>
<li>
<p>Geben Sie im Feld "Startargumente" Argumente zum Anpassen des Startvorgangs f&uuml;r den JMS-Service ein.</p>
<p>Verwenden Sie beliebige Argumente, die &uuml;ber den Befehl as-install-parent<code>/mq/bin/imqbrokerd</code> verf&uuml;gbar sind.</p>
</li>
<li>
<p>Aktivieren Sie das Kontrollk&auml;stchen "Neu verbinden", damit der JMS-Service versucht, die Verbindung mit einem Message Server (oder der Liste von Adressen im Attribut "AddressList") wiederherzustellen, wenn eine Verbindung unterbrochen wird.</p>
<p>Diese Option ist standardm&auml;&szlig;ig aktiviert.</p>
</li>
<li>
<p>Geben Sie im Feld "Intervall f&uuml;r erneute Verbindung" das Intervall zwischen Versuchen zur Verbindungswiederherstellung in Sekunden an.</p>
<p>Dieses Intervall gilt f&uuml;r Versuche mit den einzelnen Adressen im Attribut "AddressList" sowie f&uuml;r nachfolgende Adressen in der Liste. Falls dieses Intervall zu kurz ist, verf&uuml;gt ein Broker nicht &uuml;ber gen&uuml;gend Zeit zur Wiederherstellung. Wenn das Intervall zu lang ist, erf&auml;hrt die Verbindungsherstellung m&ouml;glicherweise eine nicht akzeptable Verz&ouml;gerung. Der Standardwert ist 5 Sekunden.</p>
</li>
<li>
<p>Geben Sie im Feld "Versuche f&uuml;r erneute Verbindung" die Anzahl von Versuchen f&uuml;r die (erneute) Verbindungsherstellung f&uuml;r jede Adresse im Attribut "AddressList" an, bevor die Clientlaufzeitumgebung mit der n&auml;chsten Adresse in der Liste fortf&auml;hrt.</p>
<p>Der Wert -1 zeigt an, dass die Anzahl von Versuchen zum erneuten Herstellen einer Verbindung unbegrenzt ist (die Clientlaufzeitumgebung versucht, eine Verbindung mit der ersten Adresse herzustellen, bis dieser Vorgang erfolgreich ausgef&uuml;hrt werden kann). Der Standardwert ist 3.</p>
</li>
<li>
<p>W&auml;hlen Sie in der Dropdown-Liste "Standardm&auml;&szlig;iger JMS-Host" den Namen des standardm&auml;&szlig;igen JMS-Hosts.</p>
<p>Der Standardwert ist <code>default_JMS_host</code>.</p>
</li>
<li>
<p>W&auml;hlen Sie in der Dropdown-Liste "Adresslistenbehavior" die Reihenfolge der Verbindungsversuche.</p>
<ul>
<li>
<p><code>random</code> bedeutet, dass nach dem Zufallsprinzip eine Adresse aus "AddressList" ausgew&auml;hlt wird.</p>
<p>Wenn eine Vielzahl von Clients versuchen, eine Verbindung &uuml;ber dieselbe Connection Factory herzustellen, geben Sie <code>random</code> an, um zu verhindern, dass diese Verbindungen alle &uuml;ber dieselbe Adresse erfolgen. Dies ist die Standardeinstellung.</p>
</li>
<li>
<p><code>priority</code> bedeutet, dass der Versuch zur Verbindungswiederherstellung immer f&uuml;r die erste Serveradresse in "AddressList" durchgef&uuml;hrt wird und eine andere Adresse nur dann verwendet wird, wenn der erste Broker nicht verf&uuml;gbar ist.</p>
</li>
</ul>
</li>
<li>
<p>Geben Sie im Feld "Adresslisteniterationen" f&uuml;r den JMS-Service die Anzahl von Durchl&auml;ufen des Attributs "AddressList" an, um (erneut) eine Verbindung herzustellen.</p>
<p>Der Wert -1 gibt an, dass die Anzahl der Versuche unbegrenzt ist. Der Standardwert ist 3.</p>
</li>
<li>
<p>Geben Sie in den Feldern "MQ-Schema" und "MQ-Service" den Namen des Message Queue-Adressschemas und des Message Queue-Verbindungsservice an, wenn nicht das Standardschema bzw. der Standardservice verwendet werden soll.</p>
<p>Syntaxinformationen finden Sie in <a href="ref-mqschemeservice.html">Syntax von MQ-Schema und MQ-Serviceadresse</a>.</p>
</li>
<li>
<p>Geben Sie im Abschnitt "Weitere Eigenschaften" zus&auml;tzliche Eigenschaften f&uuml;r den JMS-Service an.</p>
<p>Information zu verf&uuml;gbaren Eigenschaften finden Sie unter <a href="ref-jmsservice-additional-props.html">F&uuml;r den JMS-Service spezifische Eigenschaften</a>.</p>
<ul>
<li>
<p>Um eine Eigenschaft hinzuzuf&uuml;gen, klicken Sie auf die Schaltfl&auml;che "Eigenschaft hinzuf&uuml;gen". Geben Sie in die daraufhin angezeigte leere Zeile den Eigenschaftsnamen in das Feld "Name" und den Eigenschaftswert in das Feld "Wert" ein.</p>
</li>
<li>
<p>Um eine Eigenschaft zu &auml;ndern, bearbeiten Sie das Feld "Wert" dieser Eigenschaft.</p>
</li>
<li>
<p>Um eine Eigenschaft zu l&ouml;schen, aktivieren Sie das Kontrollk&auml;stchen links neben dem Feld "Name" der zu l&ouml;schenden Eigenschaft und klicken anschlie&szlig;end auf die Schaltfl&auml;che "Eigenschaften l&ouml;schen".</p>
</li>
</ul>
</li>
<li>
<p>Klicken Sie auf "Ping", um zu &uuml;berpr&uuml;fen, ob der JMS-Service auf dem standardm&auml;&szlig;igen JMS-Host ausgef&uuml;hrt wird.</p>
<p>Wenn der JMS-Service gegenw&auml;rtig ausgef&uuml;hrt wird, wird die Meldung ausgegeben, dass der Ping-Test erfolgreich war.</p>
</li>
<li>
<p>Klicken Sie auf "Speichern".</p>

<hr>
<p><b>Tipp:</b></p>
Um zu den Standardeinstellungen zur&uuml;ckzukehren, klicken Sie auf die Schaltfl&auml;che "Standardwerte laden" und anschlie&szlig;end auf "Speichern".
<hr>

</li>
</ol>
<a id="sthref21" name="sthref21"></a>
<h5>Zugreifen auf Remote-Server</h5>
<p>Wenn Sie Provider und Host in ein Remote-System &auml;ndern, werden alle JMS-Anwendungen auf dem Remote-Server ausgef&uuml;hrt. Um sowohl den lokalen Server als auch mindestens einen Remote-Server zu verwenden, erstellen Sie eine Connection Factory-Ressource mit der Eigenschaft <code>AddressList</code> zum Herstellen von Verbindungen f&uuml;r den Zugriff auf Remote-Server. Siehe <a href="task-jmsconnectionnew.html">So werden JMS-Connection Factory-Ressourcen erstellt</a></p>
<a id="sthref22" name="sthref22"></a>
<h5>&Auml;quivalenter asadmin-Befehl:</h5>
<p><code>jms-ping</code></p>
<a id="sthref23" name="sthref23"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-jmshostnew.html">So wird ein JMS-Host erstellt</a></p>
</li>
<li>
<p><a href="task-jmshostedit.html">So wird ein JMS-Host bearbeitet</a></p>
</li>
<li>
<p><a href="task-jmshostdelete.html">So wird ein JMS-Host gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestnew.html">So wird ein physisches JMS-Ziel erstellt</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestedit.html">So wird ein physisches JMS-Ziel bearbeitet</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestdelete.html">So wird ein physisches JMS-Ziel gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-jmsflushmessages.html">So werden Nachrichten aus einem physischen JMS-Ziel entfernt</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldeststats.html">So werden Statistiken f&uuml;r ein physisches JMS-Ziel angezeigt</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
