<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-jmsphysicaldestnew" name="task-jmsphysicaldestnew"></a><a id="GHJMS00030" name="GHJMS00030"></a></p>

<h4><a id="sthref30" name="sthref30"></a><a id="sthref31" name="sthref31"></a>So wird ein physisches JMS-Ziel erstellt</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Normalerweise ist die Erstellung physischer Ziele nicht erforderlich, da Sie beim Erstellen einer JMS-Zielressource einen Namen f&uuml;r ein physisches Ziel angeben und GlassFish Server das physische Ziel bei Bedarf automatisch erstellt.</p>
<ol>
<li>
<p>Blenden Sie in der Navigationsbaumstruktur den Knoten "Konfiguration" ein.</p>
</li>
<li>
<p>W&auml;hlen Sie die zu konfigurierende Instanz:</p>
<ul>
<li>
<p>Um eine bestimmte Instanz zu konfigurieren, w&auml;hlen Sie den Konfigurationsknoten der Instanz. Beispiel: F&uuml;r die Standardinstanz <code>server</code> w&auml;hlen Sie den Knoten <code>server-config</code>.</p>
</li>
<li>
<p>Um die Standardeinstellungen f&uuml;r zuk&uuml;nftige Instanzen zu konfigurieren, die eine Kopie von <code>default-config</code> verwenden, w&auml;hlen Sie den Knoten <code>default-config</code>.</p>
</li>
</ul>
</li>
<li>
<p>Blenden Sie unter dem Konfigurationsknoten den Knoten "Java Message Service" ein.</p>
</li>
<li>
<p>W&auml;hlen Sie unter dem Knoten "Java Message Service" den Knoten "Physische Ziele".</p>
<p>Die Seite "Physikalische Ziele" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Klicken Sie auf der Seite "Physische Ziele" auf "Neu".</p>
<p>Die Seite "Neue physische JMS-Ziele" wird ge&ouml;ffnet.</p>
</li>
<li>
<p>Geben Sie im Feld "Name" den Namen des physischen Ziels ein.</p>
</li>
<li>
<p>W&auml;hlen Sie in der Dropdown-Liste "Typ" entweder <code>javax.jms.Topic</code> oder <code>javax.jms.Queue</code>.</p>
</li>
<li>
<p>Geben Sie im Feld "H&ouml;chstzahl nicht konsumierter Nachrichten" die f&uuml;r das Ziel maximal zul&auml;ssige Anzahl nicht konsumierter Nachrichten ein.</p>
<p>Der Wert -1 bedeutet, dass die Anzahl der nicht konsumierten Nachrichten nicht begrenzt ist. Der Standardwert ist -1.</p>
</li>
<li>
<p>Geben Sie im Feld "Maximalgr&ouml;&szlig;e von Nachrichten" die maximal zul&auml;ssige Gr&ouml;&szlig;e einer einzelnen Nachricht in Byte ein.</p>
<p>Der Wert -1 bedeutet, dass die Nachrichtengr&ouml;&szlig;e unbegrenzt ist. Der Standardwert ist -1.</p>
</li>
<li>
<p>Geben Sie im Feld "Maximaler Gesamtspeicher" den maximalen Gesamtspeicher f&uuml;r nicht konsumierte Nachrichten in Byte ein.</p>
<p>Der Wert -1 bedeutet, dass die Speichergr&ouml;&szlig;e f&uuml;r nicht konsumierte Nachrichten nicht begrenzt ist. Der Standardwert ist -1.</p>
</li>
<li>
<p>W&auml;hlen Sie in der Dropdown-Liste "Schwellenwertbehavior" das Behavior aus, das der Broker bei Erreichen des Speicherschwellenwerts anwenden soll.</p>
<ul>
<li>
<p><code>Reject newest messages</code> weist den Broker an, die neuesten Nachrichten zur&uuml;ckzuweisen, und den produzierenden Client nur dann mit einer Ausnahme zu benachrichtigen, wenn die Nachricht persistent ist.</p>
<p><code>Reject newest messages</code> ist der Standardwert.</p>
</li>
<li>
<p><code>Slow down producers</code> weist den Broker an, die Geschwindigkeit zu verringern, mit der Meldungsproduzenten Meldungen senden.</p>
</li>
<li>
<p><code>Throw out oldest</code> weist den Broker an, die &auml;ltesten Meldungen zu verwerfen.</p>
</li>
<li>
<p><code>Throw out lowest-priority messages</code> weist den Broker an, die Meldungen mit der niedrigsten Priorit&auml;t zu verwerfen.</p>
</li>
</ul>
<p>Wenn der Wert <code>Throw out oldest</code> oder <code>Throw out lowest-priority messages</code> gew&auml;hlt und "Queue f&uuml;r nicht zugestellte Nachrichten verwenden" auf "True" gesetzt ist, werden &uuml;bersch&uuml;ssige Nachrichten in die Queue f&uuml;r nicht zugestellte Nachrichten verschoben.</p>
</li>
<li>
<p>Geben Sie im Feld "H&ouml;chstzahl von Producern" die maximale Anzahl an Nachrichten-Producer ein, die mit diesem physischen Ziel verkn&uuml;pft werden k&ouml;nnen.</p>
<p>Bei Erreichen dieses Grenzwerts k&ouml;nnen keine neuen Producer mehr erstellt werden. Der Wert -1 bedeutet, dass die Anzahl der Producer unbegrenzt ist. Der Standardwert ist 100.</p>
</li>
<li>
<p>Geben Sie im Feld "H&ouml;chstzahl der Nachrichten bei Batchzustellung" die maximale Anzahl an Nachrichten ein, die Konsumenten in einem einzigen Batch zugestellt werden k&ouml;nnen.</p>
<p>Der Wert -1 bedeutet, dass die Anzahl der Nachrichten unbegrenzt ist. Der Standardwert ist 1000.</p>
</li>
<li>
<p>W&auml;hlen Sie in der Dropdown-Liste "Queue f&uuml;r nicht zugestellte Nachrichten verwenden" den Wert "True", um nicht zugestellte Nachrichten in die Queue f&uuml;r nicht zugestellte Nachrichten zu stellen.</p>
<p>Wenn der Wert auf "False" gesetzt wird, werden nicht zugestellte Nachrichten verworfen. Die Standardeinstellung f&uuml;r diese Option ist "True".</p>
</li>
<li>
<p>W&auml;hlen Sie in der Dropdown-Liste "XML-Schema validieren" den Wert "True", um die XML-Schema&uuml;berpr&uuml;fung f&uuml;r das Ziel zu aktivieren.</p>
<p>Wenn der Wert auf True" gesetzt ist, versucht die Message Queue-Clientlaufzeitumgebung, eine XML-Nachricht anhand der angegebenen XML-Schemadefinitionen (oder anhand der DTD, falls keine XSD angegeben ist) zu &uuml;berpr&uuml;fen, bevor sie an den Broker gesendet wird. Wenn das angegebene Schema nicht gefunden oder die Nachricht nicht validiert werden kann, wird die Nachricht nicht gesendet, und eine Exception wird ausgel&ouml;st. Die Standardeinstellung f&uuml;r diese Option ist "False".</p>
</li>
<li>
<p>Geben Sie im Feld "XML-Schema - URI-Liste" eine mit Leerzeichen getrennte Liste von URI-Zeichenfolgen einer XML-Schemadefinition (XSD) ein.</p>
<p>Wenn die XML-Schema&uuml;berpr&uuml;fung aktiviert ist, verweisen die URIs auf den Speicherort einer oder mehrerer XSDs, die f&uuml;r die XML-Schema&uuml;berpr&uuml;fung zu verwenden sind.</p>
</li>
</ol>
<a id="sthref32" name="sthref32"></a>
<h5>Siehe auch</h5>
<ul>
<li>
<p><a href="task-jmsservice.html">So wird der JMS-Service konfiguriert</a></p>
</li>
<li>
<p><a href="task-jmshostnew.html">So wird ein JMS-Host erstellt</a></p>
</li>
<li>
<p><a href="task-jmshostedit.html">So wird ein JMS-Host bearbeitet</a></p>
</li>
<li>
<p><a href="task-jmshostdelete.html">So wird ein JMS-Host gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestedit.html">So wird ein physisches JMS-Ziel bearbeitet</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldestdelete.html">So wird ein physisches JMS-Ziel gel&ouml;scht</a></p>
</li>
<li>
<p><a href="task-jmsflushmessages.html">So werden Nachrichten aus einem physischen JMS-Ziel entfernt</a></p>
</li>
<li>
<p><a href="task-jmsphysicaldeststats.html">So werden Statistiken f&uuml;r ein physisches JMS-Ziel angezeigt</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
