<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-accesslog" name="ref-accesslog"></a></p>

<h4><a id="sthref104" name="sthref104"></a><a id="sthref105" name="sthref105"></a>Servizio HTTP</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Utilizzare la pagina Servizio HTTP per specificare i criteri generali del log degli accessi per le applicazioni Web.</p>
<p>Il servizio HTTP fornisce le funzioni per la distribuzione delle applicazioni Web e per consentire l'accesso alle applicazioni Web distribuite da parte di client HTTP, server virtuali, pool di thread e funzionalit&agrave; di configurazione di rete.</p>
<p>GlassFish Server usa il log degli accessi del servizio HTTP per abilitare e configurare la rotazione dei log degli accessi per i server virtuali. Questi log si trovano nella directory domain-dir<code>/logs/access</code> e sono denominati come riportato di seguito: <i>virtual_server_name</i><code>_access_log.</code><i>yyyyMMdd</i><code>-</code><i>HH</i><code>h</code><i>mm</i><code>m</code><i>ss</i><code>s.txt</code></p>
<p>La pagina Servizio HTTP contiene le opzioni riportate di seguito.</p>
<dl>
<dt>Carica impostazioni predefinite</dt>
<dd>
<p>Pulsante per ripristinare i valori predefiniti delle impostazioni che dispongono di valori predefiniti. Le impostazioni che non dispongono di valori predefiniti non vengono modificate.</p>
</dd>
<dt>Nome configurazione</dt>
<dd>
<p>Il nome della configurazione a cui si applicano le impostazioni presenti in questa pagina. Questo campo &egrave; di sola lettura.</p>
</dd>
<dt>SSO</dt>
<dd>
<p>Indica se Single Sign-On &egrave; abilitato per impostazione predefinita per tutte le applicazioni Web in tutti i server virtuali di questo server configurate per lo stesso realm. Se questa opzione non &egrave; abilitata, Single Sign-On &egrave; disabilitato per impostazione predefinita per tutti i server virtuali e gli utenti devono eseguire l'autenticazione per ogni applicazione in ciascun server virtuale. &Egrave; possibile ignorare questa impostazione per un singolo server virtuale. Single Sign-On pu&ograve; essere abilitato o disabilitato. Questa opzione &egrave; disabilitata per impostazione predefinita.</p>
</dd>
<dt>Log degli accessi</dt>
<dd>
<p>Se questa opzione &egrave; selezionata, il log degli accessi &egrave; abilitato per tutti gli elementi secondari dei server virtuali in cui non &egrave; specificata questa propriet&agrave;. Se non &egrave; selezionata, questa opzione disabilita il log degli accessi per tutti gli elementi secondari dei server virtuali in cui non &egrave; specificata questa propriet&agrave;. Questa opzione &egrave; disabilitata per impostazione predefinita.</p>
</dd>
<dt>Rotazione</dt>
<dd>
<p>Se questa opzione &egrave; selezionata, la rotazione dei file di log &egrave; abilitata. Questa opzione &egrave; abilitata per impostazione predefinita.</p>
</dd>
<dt>Criteri di rotazione</dt>
<dd>
<p>L'unico criterio di rotazione disponibile &egrave; <code>time</code>.</p>
</dd>
<dt>Intervallo di rotazione</dt>
<dd>
<p>Il numero di minuti che intercorrono tra le rotazioni del log degli accessi. Questo campo &egrave; valido solo se il criterio di rotazione &egrave; <code>time</code>. Il valore predefinito &egrave; 1.440 minuti (24 ore).</p>
</dd>
<dt>Suffisso rotazione</dt>
<dd>
<p>Il valore di stringa da aggiungere alla fine del nome del file di log dopo la rotazione. Il valore predefinito &egrave; <code>yyyy-MM-dd</code>.</p>
<p>Assicurarsi che il suffisso di rotazione contenga valori sufficienti per la creazione di un suffisso univoco per ogni rotazione di log. Ad esempio, se il log di accesso viene ruotato pi&ugrave; di una volta al giorno, includere l'ora del giorno nel suffisso di rotazione.</p>
<p>Il suffisso univoco consente di assicurare che venga eseguita la rotazione del file di log di accesso a ogni scadenza dell'intervallo di rotazione. Se il suffisso di rotazione del nuovo file di log degli accessi &egrave; identico al suffisso di rotazione del file di log degli accessi esistente, la rotazione del file non viene eseguita.</p>
</dd>
<dt>Numero massimo di file</dt>
<dd>
<p>Il numero massimo dei file di log degli accessi ruotati da conservare. Un valore negativo indica che il numero dei file &egrave; illimitato. Il valore predefinito &egrave; -1.</p>
</dd>
<dt>Dimensione buffer</dt>
<dd>
<p>La dimensione, in byte, del buffer del log degli accessi oppure un valore minore o uguale a 0 per i log degli accessi non inseriti in un buffer. Il valore predefinito &egrave; 32768.</p>
</dd>
<dt>Intervallo di scrittura</dt>
<dd>
<p>Il numero di secondi prima della scrittura del log su disco. Il log degli accessi viene scritto quando il buffer &egrave; pieno o allo scadere dell'intervallo di tempo previsto. Se il valore &egrave; minore o uguale a 0, il buffer viene sempre scritto, anche se non &egrave; pieno. Ci&ograve; significa che ogni volta che si accede al server, i messaggi del log vengono memorizzati direttamente nel file. Il valore predefinito &egrave; 300.</p>
</dd>
<dt>Formato</dt>
<dd>
<p>Il valore di stringa che specifica le informazioni da acquisire nel log degli accessi e l'ordine in cui vengono acquisite. Di seguito &egrave; riportato il valore predefinito.</p>
<pre>
%client.name% %auth-user-name% %datetime% %request% %status% %response.length%
</pre>
<p>Nella stringa del formato &egrave; possibile includere i valori riportati di seguito.</p>
<dl>
<dt><code>%attribute.</code><i>name</i><code>%</code></dt>
<dd>
<p>Registra il valore (mediante la chiamata del metodo <code>toString</code> rispettivo) dell'attributo della richiesta con il valore <i>name</i> specificato.</p>
</dd>
<dt><code>%auth-user-name%</code></dt>
<dd>
<p>Nome dell'utente autorizzato</p>
</dd>
<dt><code>%client.name%</code></dt>
<dd>
<p>Nome host client</p>
</dd>
<dt><code>%client.dns%</code></dt>
<dd>
<p>DNS client</p>
</dd>
<dt><code>%cookie.</code><i>name</i><code>%</code></dt>
<dd>
<p>Il valore del cookie di richiesta con il valore <i>name</i> specificato</p>
</dd>
<dt><code>%cookie.value%</code></dt>
<dd>
<p>Il valore del primo cookie trovato nella richiesta</p>
</dd>
<dt><code>%datetime%</code></dt>
<dd>
<p>Data di sistema</p>
</dd>
<dt><code>%request%</code></dt>
<dd>
<p>Riga di richiesta HTTP completa</p>
</dd>
<dt><code>%status%</code></dt>
<dd>
<p>Stato</p>
</dd>
<dt><code>%response.length%</code></dt>
<dd>
<p>Lunghezza contenuto risposta</p>
</dd>
<dt><code>%header.referer%</code></dt>
<dd>
<p>Intestazione Referer</p>
</dd>
<dt><code>%header.user-agent%</code></dt>
<dd>
<p>Intestazione User-Agent</p>
</dd>
<dt><code>%http-method%</code></dt>
<dd>
<p>Metodo HTTP</p>
</dd>
<dt><code>%http-uri%</code></dt>
<dd>
<p>URI HTTP</p>
</dd>
<dt><code>%query-str%</code></dt>
<dd>
<p>Stringa query HTTP</p>
</dd>
<dt><code>%http-version%</code></dt>
<dd>
<p>Versione protocollo HTTP</p>
</dd>
<dt><code>%header.accept%</code></dt>
<dd>
<p>Intestazione Accept</p>
</dd>
<dt><code>%header.date%</code></dt>
<dd>
<p>Intestazione Date</p>
</dd>
<dt><code>%header.if-mod-since%</code></dt>
<dd>
<p>Intestazione If-Modified-Since</p>
</dd>
<dt><code>%header.auth%</code></dt>
<dd>
<p>Intestazione Authorization</p>
</dd>
<dt><code>%header.</code><i>any</i><code>%</code></dt>
<dd>
<p>Qualsiasi valore di intestazione HTTP valido definito nella RFC 2616 (anche <code>any</code> &egrave; un valore di intestazione valido; qui &egrave; specificato come variabile)</p>
</dd>
<dt><code>%session.</code><i>name</i><code>%</code></dt>
<dd>
<p>Il valore dell'attributo di sessione con nome <i>name</i> o <code>NULL-SESSION-ATTRIBUTE-</code><i>name</i> se l'attributo denominato non esiste nella sessione o <code>NULL-SESSION</code> se la sessione non esiste</p>
</dd>
<dt><code>%time-taken%</code></dt>
<dd>
<p>Il tempo necessario per eseguire ogni richiesta in millisecondi</p>
</dd>
<dt><code>%vs.id%</code></dt>
<dd>
<p>ID server virtuale</p>
</dd>
</dl>
</dd>
<dt>Propriet&agrave; aggiuntive</dt>
<dd>
<p>Propriet&agrave; aggiuntive per il servizio HTTP. Per la descrizione delle propriet&agrave; disponibili, vedere <a href="ref-httpserviceprops.html">Propriet&agrave; specifiche del servizio HTTP</a>.</p>
</dd>
</dl>
<a id="sthref106" name="sthref106"></a>
<h5>Task correlati</h5>
<p><a href="task-accesslog.html">Per configurare il servizio HTTP</a></p>
<a id="sthref107" name="sthref107"></a>
<h5>Comandi asadmin correlati</h5>
<p>Nessuno.</p>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
