<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-accesslog" name="task-accesslog"></a></p>

<h4><a id="sthref21" name="sthref21"></a><a id="sthref22" name="sthref22"></a>Per configurare il servizio HTTP</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Espandere il nodo Configurazione nell'albero di navigazione.</p>
</li>
<li>
<p>Selezionare la configurazione da modificare.</p>
</li>
<li>
<p>Nel nodo Configurazione selezionare il nodo Servizio HTTP.</p>
<p>Viene visualizzata la pagina Servizio HTTP.</p>
</li>
<li>
<p>Selezionare la casella di controllo Abilitato dell'opzione SSO per abilitare il sistema SSO per impostazione predefinita per tutte le applicazioni Web in tutti i server virtuali di questo server configurate per lo stesso realm.</p>
<p>&Egrave; possibile ignorare questa impostazione per un singolo server virtuale. Questa opzione &egrave; disabilitata per impostazione predefinita.</p>
</li>
<li>
<p>Selezionare la casella di controllo Abilitato dell'opzione Log degli accessi per abilitare il log degli accessi per tutti i sottoelementi del server virtuale in cui non &egrave; specificata tale propriet&agrave;.</p>
<p>Se la casella di controllo Abilitato dell'opzione Log degli accessi &egrave; deselezionata, il log degli accessi viene disabilitato per tutti i sottoelementi del server virtuale in cui non &egrave; specificata tale propriet&agrave;. Questa opzione &egrave; disabilitata per impostazione predefinita.</p>
</li>
<li>
<p>Selezionare la casella di controllo Abilitato dell'opzione Rotazione per abilitare la rotazione dei file di log.</p>
<p>Questa opzione &egrave; abilitata per impostazione predefinita.</p>
</li>
<li>
<p>Nell'elenco a discesa Criteri di rotazione selezionare un criterio di rotazione.</p>
<p>L'unico criterio di rotazione disponibile &egrave; <code>time</code>.</p>
</li>
<li>
<p>Nel campo Intervallo di rotazione digitare il numero di minuti che intercorrono tra le rotazioni del log degli accessi.</p>
<p>Questo campo &egrave; valido solo se il criterio di rotazione &egrave; <code>time</code>. Il valore predefinito &egrave; 1.440 minuti (24 ore).</p>
</li>
<li>
<p>Nel campo Suffisso rotazione digitare il valore di stringa da aggiungere alla fine del nome file di log in seguito alla rotazione.</p>
<p>Il valore predefinito &egrave; <code>yyyy-MM-dd</code>.</p>
<p>Assicurarsi che il suffisso di rotazione contenga valori sufficienti per la creazione di un suffisso univoco per ogni rotazione di log. Ad esempio, se il log di accesso viene ruotato pi&ugrave; di una volta al giorno, includere l'ora del giorno nel suffisso di rotazione.</p>
<p>Il suffisso univoco consente di assicurare che venga eseguita la rotazione del file di log di accesso a ogni scadenza dell'intervallo di rotazione. Se il suffisso di rotazione del nuovo file di log degli accessi &egrave; identico al suffisso di rotazione del file di log degli accessi esistente, la rotazione del file non viene eseguita.</p>
</li>
<li>
<p>Nel campo Numero massimo di file digitare il numero massimo di file di log degli accessi di cui &egrave; stata eseguita la rotazione da conservare.</p>
<p>Un valore negativo indica che il numero dei file &egrave; illimitato. Il valore predefinito &egrave; -1.</p>
</li>
<li>
<p>Nel campo Dimensione buffer digitare le dimensioni in byte del buffer del log degli accessi.</p>
<p>Un valore minore o uguale a 0 consente di disabilitare l'inserimento in buffer del log degli accessi. Il valore predefinito &egrave; 32768.</p>
</li>
<li>
<p>Nel campo Intervallo di scrittura digitare il numero di secondi al termine dei quali il log viene scritto sul disco.</p>
<p>Il log degli accessi viene scritto quando il buffer &egrave; pieno o allo scadere dell'intervallo di tempo previsto. Se il valore &egrave; minore o uguale a 0, il buffer viene sempre scritto, anche se non &egrave; pieno. Ci&ograve; significa che ogni volta che si accede al server, i messaggi del log vengono memorizzati direttamente nel file. Il valore predefinito &egrave; 300.</p>
</li>
<li>
<p>Nel campo Formato digitare il valore di stringa per specificare le seguenti propriet&agrave; del log degli accessi:</p>
<ul>
<li>
<p>le informazioni da acquisire nel log degli accessi;</p>
</li>
<li>
<p>l'ordine di acquisizione delle informazioni.</p>
</li>
</ul>
<p>Di seguito &egrave; riportato il valore predefinito.</p>
<pre>
%client.name% %auth-user-name% %datetime% %request% %status% %response.length%
</pre>
<p>Nella stringa del formato &egrave; possibile includere i valori riportati di seguito.</p>
<dl>
<dt><code>%attribute.</code><i>name</i><code>%</code></dt>
<dd>
<p>Registra il valore (mediante la chiamata del metodo <code>toString</code> rispettivo) dell'attributo della richiesta con il valore <i>name</i> specificato.</p>
</dd>
<dt><code>%auth-user-name%</code></dt>
<dd>
<p>Nome dell'utente autorizzato</p>
</dd>
<dt><code>%client.name%</code></dt>
<dd>
<p>Nome host client</p>
</dd>
<dt><code>%client.dns%</code></dt>
<dd>
<p>DNS client</p>
</dd>
<dt><code>%cookie.</code><i>name</i><code>%</code></dt>
<dd>
<p>Il valore del cookie di richiesta con il valore <i>name</i> specificato</p>
</dd>
<dt><code>%cookie.value%</code></dt>
<dd>
<p>Il valore del primo cookie trovato nella richiesta</p>
</dd>
<dt><code>%datetime%</code></dt>
<dd>
<p>Data di sistema</p>
</dd>
<dt><code>%request%</code></dt>
<dd>
<p>Riga di richiesta HTTP completa</p>
</dd>
<dt><code>%status%</code></dt>
<dd>
<p>Stato</p>
</dd>
<dt><code>%response.length%</code></dt>
<dd>
<p>Lunghezza contenuto risposta</p>
</dd>
<dt><code>%header.referer%</code></dt>
<dd>
<p>Intestazione Referer</p>
</dd>
<dt><code>%header.user-agent%</code></dt>
<dd>
<p>Intestazione User-Agent</p>
</dd>
<dt><code>%http-method%</code></dt>
<dd>
<p>Metodo HTTP</p>
</dd>
<dt><code>%http-uri%</code></dt>
<dd>
<p>URI HTTP</p>
</dd>
<dt><code>%query-str%</code></dt>
<dd>
<p>Stringa query HTTP</p>
</dd>
<dt><code>%http-version%</code></dt>
<dd>
<p>Versione protocollo HTTP</p>
</dd>
<dt><code>%header.accept%</code></dt>
<dd>
<p>Intestazione Accept</p>
</dd>
<dt><code>%header.date%</code></dt>
<dd>
<p>Intestazione Date</p>
</dd>
<dt><code>%header.if-mod-since%</code></dt>
<dd>
<p>Intestazione If-Modified-Since</p>
</dd>
<dt><code>%header.auth%</code></dt>
<dd>
<p>Intestazione Authorization</p>
</dd>
<dt><code>%header.</code><i>any</i><code>%</code></dt>
<dd>
<p>Qualsiasi valore di intestazione HTTP valido definito nella RFC 2616 (anche <code>any</code> &egrave; un valore di intestazione valido; qui &egrave; specificato come variabile)</p>
</dd>
<dt><code>%session.</code><i>name</i><code>%</code></dt>
<dd>
<p>Il valore dell'attributo di sessione con nome <i>name</i> o <code>NULL-SESSION-ATTRIBUTE-</code><i>name</i> se l'attributo denominato non esiste nella sessione o <code>NULL-SESSION</code> se la sessione non esiste</p>
</dd>
<dt><code>%time-taken%</code></dt>
<dd>
<p>Il tempo necessario per eseguire ogni richiesta in millisecondi</p>
</dd>
<dt><code>%vs.id%</code></dt>
<dd>
<p>ID server virtuale</p>
</dd>
</dl>
</li>
<li>
<p>Nella sezione Propriet&agrave; aggiuntive, specificare le propriet&agrave; aggiuntive.</p>
<p>Per la descrizione delle propriet&agrave; disponibili, vedere <a href="ref-httpserviceprops.html">Propriet&agrave; specifiche del servizio HTTP</a>.</p>
<ul>
<li>
<p>Per aggiungere una propriet&agrave;, fare clic sul pulsante Aggiungi propriet&agrave;. Nella riga vuota visualizzata, digitare il nome della propriet&agrave; nel campo Nome e il valore della propriet&agrave; nel campo Valore.</p>
</li>
<li>
<p>Per modificare una propriet&agrave;, &egrave; necessario modificare il valore del campo Valore della propriet&agrave;.</p>
</li>
<li>
<p>Per eliminare una propriet&agrave;, selezionare la casella di controllo a sinistra del campo Nome corrispondente alla propriet&agrave; da eliminare, quindi fare clic sul pulsante Elimina propriet&agrave;.</p>
</li>
</ul>
</li>
<li>
<p>Fare clic su Salva.</p>

<hr>
<p><b>Suggerimento:</b></p>
Per ripristinare le impostazioni predefinite, fare clic sul pulsante Carica impostazioni predefinite, quindi su Salva.
<hr>

</li>
</ol>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
