<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-webcontainermanagerprops" name="task-webcontainermanagerprops"></a><a id="GHWEB00032" name="GHWEB00032"></a></p>

<h4><a id="sthref7" name="sthref7"></a><a id="sthref8" name="sthref8"></a><a id="sthref9" name="sthref9"></a>Per configurare le propriet&agrave; manager per il contenitore Web</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>Il Session Manager consente di configurare le modalit&agrave; di creazione ed eliminazione delle sessioni, la posizione di memorizzazione della condizione della sessione e il numero massimo di sessioni disponibili.</p>
<ol>
<li>
<p>Espandere il nodo Configurazione nell'albero di navigazione.</p>
</li>
<li>
<p>Selezionare la configurazione da modificare.</p>
</li>
<li>
<p>Nel nodo della configurazione, selezionare il nodo Contenitore Web.</p>
<p>Viene visualizzata la pagina Propriet&agrave; generali.</p>
</li>
<li>
<p>Nella pagina Propriet&agrave; generali, fare clic sulla scheda Propriet&agrave; manager.</p>
<p>Viene visualizzata la pagina Propriet&agrave; manager.</p>
</li>
<li>
<p>Nel campo Intervallo di recupero, digitare il numero di secondi al termine dei quali i dati della sessione inattiva vengono eliminati dall'area di memorizzazione.</p>
<p>Il valore predefinito &egrave; 60.</p>
<p>Impostare questa opzione su un valore minore del valore della frequenza con cui i dati della sessione vengono modificati. Ad esempio, nel caso di un sito Web utilizzato di frequente, si consiglia di specificare il valore pi&ugrave; basso possibile (1 secondo) per un servlet del contatore di accessi, altrimenti potrebbero andare perduti gli ultimi accessi ogni volta che si riavvia il server.</p>
</li>
<li>
<p>Nel campo Numero massimo sessioni digitare il numero massimo di sessioni che possono essere inserite nella cache.</p>
<p>Il valore -1 indica l'assenza di limiti per il numero delle sessioni. Il valore predefinito &egrave; -1.</p>
<p>Una volta raggiunto il limite, il tentativo di creare una nuova sessione comporta la restituzione di un'eccezione <code>IllegalStateException</code>.</p>
</li>
<li>
<p>Nel campo Nome file sessione digitare il percorso assoluto o relativo della directory in cui viene salvato lo stato della sessione a ogni avvio dell'applicazione, se tale conservazione &egrave; consentita.</p>
<p>Se il percorso non &egrave; stato impostato, la condizione della sessione non viene salvata. Per impostazione predefinita, tale percorso non &egrave; impostato.</p>
<p>Il percorso relativo &egrave; relativo rispetto alla directory temporanea di questa applicazione Web.</p>
<p>Questa impostazione &egrave; valida solo se l'opzione Tipo di persistenza &egrave; impostata su <code>memory</code>. Per impostare il tipo di persistenza, vedere <a href="task-webcontaineravailability.html">Per configurare le impostazioni di disponibilit&agrave; per il contenitore Web</a>.</p>
</li>
<li>
<p>Nella sezione Propriet&agrave; aggiuntive, specificare le propriet&agrave; aggiuntive.</p>
<p>GlassFish Server non definisce alcuna propriet&agrave; aggiuntiva per il Session Manager.</p>
<ul>
<li>
<p>Per aggiungere una propriet&agrave;, fare clic sul pulsante Aggiungi propriet&agrave;. Nella riga vuota visualizzata, digitare il nome della propriet&agrave; nel campo Nome e il valore della propriet&agrave; nel campo Valore.</p>
</li>
<li>
<p>Per modificare una propriet&agrave;, &egrave; necessario modificare il valore del campo Valore della propriet&agrave;.</p>
</li>
<li>
<p>Per eliminare una propriet&agrave;, selezionare la casella di controllo a sinistra del campo Nome corrispondente alla propriet&agrave; da eliminare, quindi fare clic sul pulsante Elimina propriet&agrave;.</p>
</li>
</ul>
</li>
<li>
<p>Fare clic su Salva.</p>

<hr>
<p><b>Suggerimento:</b></p>
Per ripristinare le impostazioni predefinite, fare clic sul pulsante Carica impostazioni predefinite, quindi su Salva.
<hr>

</li>
</ol>
<a id="sthref10" name="sthref10"></a>
<h5>Vedere anche</h5>
<ul>
<li>
<p><a href="task-webcontainergeneral.html">Per configurare le propriet&agrave; generali per il contenitore Web</a></p>
</li>
<li>
<p><a href="task-webcontainersessiontimeout.html">Per configurare le propriet&agrave; di sessione per il contenitore Web</a></p>
</li>
<li>
<p><a href="task-webcontainerstoreprops.html">Per configurare le propriet&agrave; area di memorizzazione per il contenitore Web</a></p>
</li>
<li>
<p><a href="task-webcontaineravailability.html">Per configurare le impostazioni di disponibilit&agrave; per il contenitore Web</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
