<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-webcontaineravailability" name="task-webcontaineravailability"></a></p>

<h4><a id="sthref16" name="sthref16"></a><a id="sthref17" name="sthref17"></a><a id="sthref18" name="sthref18"></a><a id="sthref19" name="sthref19"></a>Per configurare le impostazioni di disponibilit&agrave; per il contenitore Web</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>Espandere il nodo Configurazione nell'albero di navigazione.</p>
</li>
<li>
<p>Selezionare la configurazione da modificare.</p>
</li>
<li>
<p>Nel nodo della configurazione, selezionare il nodo Servizio disponibilit&agrave;.</p>
<p>Viene visualizzata la pagina Servizio disponibilit&agrave;.</p>
</li>
<li>
<p>Nella pagina Servizio disponibilit&agrave; fare clic sulla scheda Disponibilit&agrave; contenitore Web.</p>
<p>Viene visualizzata la pagina Disponibilit&agrave; contenitore Web.</p>
</li>
<li>
<p>Nel campo Servizio disponibilit&agrave; selezionare la casella Abilitato per abilitare la disponibilit&agrave; per il contenitore Web.</p>
<p>Per disabilitare la disponibilit&agrave;, rimuovere il segno di spunta dalla casella Servizio disponibilit&agrave; abilitato.</p>
</li>
<li>
<p>Nell'elenco a discesa Tipo di persistenza selezionare il meccanismo di persistenza.</p>
<ul>
<li>
<p>Se l'opzione Servizio disponibilit&agrave; abilitato <i>non</i> &egrave; selezionata, scegliere una delle opzioni riportate di seguito.</p>
<ul>
<li>
<p><code>memory</code> per nessuna persistenza delle sessioni</p>
</li>
<li>
<p><code>file</code> per una persistenza delle sessioni basata sul file system, che non &egrave; ad alta disponibilit&agrave;</p>
</li>
</ul>
</li>
<li>
<p>Se la casella Servizio disponibilit&agrave; abilitato &egrave; selezionata, selezionare <code>replicated</code> per una persistenza delle sessioni basata su failover del cluster, che &egrave; ad alta disponibilit&agrave;.</p>
</li>
</ul>
</li>
<li>
<p>Nell'elenco a discesa Frequenza di persistenza selezionare la frequenza di memorizzazione della sessione HTTP:</p>
<ul>
<li>
<p><code>web-method</code> &mdash; lo stato della sessione viene memorizzato al termine di ogni richiesta Web prima dell'invio di una risposta al client. Questa modalit&agrave; rappresenta la migliore garanzia che lo stato della sessione venga aggiornato completamente in caso di errore. Questa &egrave; l'impostazione predefinita.</p>
</li>
</ul>
<p>L'opzione Frequenza di persistenza &egrave; valida solo se l'opzione Tipo di persistenza &egrave; impostata su <code>replicated</code>.</p>
</li>
<li>
<p>Nell'elenco a discesa Ambito persistenza selezionare l'ambito delle modifiche della sessione HTTP necessarie per consentire la memorizzazione:</p>
<ul>
<li>
<p><code>session</code> &mdash; viene memorizzato ogni volta lo stato dell'intera sessione. Questa modalit&agrave; rappresenta la migliore garanzia che i dati della sessione vengano memorizzati correttamente per ogni applicazione Web distribuibile.</p>
</li>
<li>
<p><code>modified-session</code> &mdash; viene memorizzato lo stato dell'intera sessione nel caso in cui abbia subito modifiche. Una sessione viene considerata modificata se &egrave; stato richiamato un metodo <code>HttpSession.setAttribute()</code> o <code>HttpSession.removeAttribute()</code>. &Egrave; necessario garantire che venga richiamato <code>setAttribute()</code> ogni volta che un attributo viene modificato. Non si tratta di un requisito delle specifiche Java EE, ma &egrave; necessario affinch&eacute; questa modalit&agrave; funzioni in modo corretto.</p>
</li>
<li>
<p><code>modified-attribute</code> &mdash; vengono memorizzati solo gli attributi di sessione modificati. Affinch&eacute; questa modalit&agrave; funzioni correttamente, attenersi alle istruzioni riportate di seguito.</p>
<ul>
<li>
<p>Richiamare <code>setAttribute()</code> ogni volta che lo stato della sessione viene modificato.</p>
</li>
<li>
<p>Assicurarsi che non vi siano riferimenti incrociati tra gli attributi. Il grafico degli oggetti sotto ciascuna chiave di attributo viene serializzato e memorizzato separatamente. Gli eventuali riferimenti incrociati tra gli oggetti sotto ciascuna chiave separata non vengono serializzati e deserializzati in modo corretto.</p>
</li>
<li>
<p>Distribuire lo stato della sessione tra pi&ugrave; attributi o almeno tra un attributo di sola lettura e un attributo modificabile.</p>
</li>
</ul>
</li>
</ul>
<p>L'opzione Ambito persistenza &egrave; valida solo se l'opzione Tipo di persistenza &egrave; impostata su <code>replicated</code>.</p>
</li>
<li>
<p>Nel campo Stato Single Sign-On selezionare la casella Abilitato per rendere lo stato SSO disponibile per il failover.</p>
<p>Per rendere lo stato SSO non disponibile per il failover, rimuovere il segno di spunta dalla casella Abilitato dell'opzione Stato Single Sign-On.</p>
</li>
<li>
<p>Per ripristinare i valori predefiniti di tutte le impostazioni, fare clic sul pulsante Carica impostazioni predefinite.</p>
</li>
<li>
<p>Nella sezione Propriet&agrave; aggiuntive, specificare le propriet&agrave; aggiuntive.</p>
<p>GlassFish Server non definisce alcuna propriet&agrave; aggiuntiva per la disponibilit&agrave; del contenitore Web.</p>
<ul>
<li>
<p>Per aggiungere una propriet&agrave;, fare clic sul pulsante Aggiungi propriet&agrave;. Nella riga vuota visualizzata, digitare il nome della propriet&agrave; nel campo Nome e il valore della propriet&agrave; nel campo Valore.</p>
</li>
<li>
<p>Per modificare una propriet&agrave;, &egrave; necessario modificare il valore del campo Valore della propriet&agrave;.</p>
</li>
<li>
<p>Per eliminare una propriet&agrave;, selezionare la casella di controllo a sinistra del campo Nome corrispondente alla propriet&agrave; da eliminare, quindi fare clic sul pulsante Elimina propriet&agrave;.</p>
</li>
</ul>
</li>
<li>
<p>Fare clic su Salva.</p>
</li>
</ol>
<a id="sthref20" name="sthref20"></a>
<h5>Vedere anche</h5>
<ul>
<li>
<p><a href="task-webcontainergeneral.html">Per configurare le propriet&agrave; generali per il contenitore Web</a></p>
</li>
<li>
<p><a href="task-webcontainersessiontimeout.html">Per configurare le propriet&agrave; di sessione per il contenitore Web</a></p>
</li>
<li>
<p><a href="task-webcontainermanagerprops.html">Per configurare le propriet&agrave; manager per il contenitore Web</a></p>
</li>
<li>
<p><a href="task-webcontainerstoreprops.html">Per configurare le propriet&agrave; area di memorizzazione per il contenitore Web</a></p>
</li>
</ul>



<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
