<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="ref-transactionsvcproperties" name="ref-transactionsvcproperties"></a></p>

<h4><a id="sthref16" name="sthref16"></a><a id="sthref17" name="sthref17"></a>&#20316;&#26989;&#20107;&#20214;&#26381;&#21209;&#29305;&#23450;&#30340;&#29305;&#24615;</h4>
<a name="BEGIN" id="BEGIN"></a>
<p>&#20197;&#19979;&#26159;&#32068;&#24907;&#20316;&#26989;&#20107;&#20214;&#26381;&#21209;&#26178;&#30340;&#21487;&#29992;&#29305;&#24615;&#12290;</p>
<dl>
<dt><code>oracle-xa-recovery-workaround</code></dt>
<dd>
<p>&#33509;&#35373;&#23450;&#28858; <code>true</code>&#65292;&#21063;&#26371;&#20351;&#29992; Oracle XA Resource &#35299;&#27770;&#26041;&#27861;&#36914;&#34892;&#20316;&#26989;&#20107;&#20214;&#24489;&#21407;&#12290;&#38928;&#35373;&#20540;&#28858; <code>true</code>&#12290;</p>
</dd>
<dt><code>disable-distributed-transaction-logging</code></dt>
<dd>
<p>&#33509;&#35373;&#28858; <code>true</code>&#65292;&#21063;&#26371;&#20572;&#29992;&#20316;&#26989;&#20107;&#20214;&#26085;&#35468;&#65292;&#36914;&#32780;&#21487;&#33021;&#25913;&#21892;&#25928;&#33021;&#12290;&#33509;&#36984;&#21462;&#20102;&#12300;&#21855;&#29992;&#22312;&#37325;&#26032;&#21855;&#21205;&#26178;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#21063;&#26371;&#24573;&#30053;&#27492;&#29305;&#24615;&#12290;&#38928;&#35373;&#20540;&#28858; <code>false</code>&#12290;</p>
</dd>
<dt><code>xaresource-txn-timeout</code></dt>
<dd>
<p>&#35722;&#26356; <code>XAResource</code> &#36926;&#26178;&#12290;&#22312;&#37096;&#20998;&#24773;&#27841;&#19979;&#65292;<code>XAResource</code> &#38928;&#35373;&#36926;&#26178;&#21487;&#33021;&#26371;&#23566;&#33268;&#20316;&#26989;&#20107;&#20214;&#20013;&#26039;&#65292;&#22240;&#27492;&#26368;&#22909;&#36914;&#34892;&#35722;&#26356;&#12290;&#38928;&#35373;&#20540;&#20677;&#36969;&#29992;&#26044;&#20351;&#29992;&#30340; <code>XAResource</code>&#12290;</p>
</dd>
<dt><code>pending-txn-cleanup-interval</code></dt>
<dd>
<p>&#25351;&#23450;&#38750;&#21516;&#27493;&#32363;&#32218;&#27298;&#26597;&#26377;&#28961;&#25841;&#32622;&#20316;&#26989;&#20107;&#20214;&#20006;&#21152;&#20197;&#23436;&#25104;&#30340;&#38291;&#38548; (&#20197;&#31186;&#28858;&#21934;&#20301;)&#12290;&#33509;&#26410;&#25351;&#23450;&#27492;&#29305;&#24615;&#65292;&#21063;&#19981;&#26371;&#26377;&#38928;&#35373;&#20540;&#12290;&#33509;&#23384;&#22312;&#27492;&#29305;&#24615;&#20294;&#27794;&#26377;&#20540;&#65292;&#21063;&#38928;&#35373;&#20540;&#26371;&#26159; 60&#12290;</p>
</dd>
<dt><code>use-last-agent-optimization</code></dt>
<dd>
<p>&#33509;&#35373;&#28858; <code>true</code>&#65292;&#21063;&#26371;&#21855;&#29992;&#26368;&#24460;&#30340;&#20195;&#29702;&#31243;&#24335;&#26368;&#20339;&#21270;&#65292;&#20197;&#25913;&#21892;&#20316;&#26989;&#20107;&#20214;&#30340;&#27969;&#37327;&#12290;&#33509;&#22312;&#21516;&#19968;&#20316;&#26989;&#20107;&#20214;&#20013;&#28151;&#29992;&#38750; XA &#36039;&#28304;&#33287; XA &#36039;&#28304;&#65292;&#21063;&#38750; XA &#36039;&#28304;&#26371;&#26159;&#26368;&#24460;&#30340;&#20195;&#29702;&#31243;&#24335;&#12290;&#38928;&#35373;&#20540;&#28858; <code>true</code>&#12290;</p>
</dd>
<dt><code>delegated-recovery</code></dt>
<dd>
<p>&#33509;&#35373;&#28858; <code>true</code>&#65292;&#21063;&#26371;&#21855;&#29992;&#25972;&#20491;&#21474;&#38598;&#20839;&#30340;&#22996;&#20219;&#24489;&#21407;&#12290;&#38928;&#35373;&#20540;&#28858; false&#12290;</p>
</dd>
<dt><code>wait-time-before-recovery-insec</code></dt>
<dd>
<p>&#25351;&#23450;&#31561;&#24453;&#26178;&#38291; (&#21934;&#20301;&#28858;&#31186;)&#65292;&#22312;&#32147;&#36942;&#36889;&#27573;&#26178;&#38291;&#20043;&#24460;&#65292;&#22519;&#34892;&#34389;&#29702;&#26371;&#21855;&#21205;&#20572;&#29992;&#22519;&#34892;&#34389;&#29702;&#30340;&#24489;&#21407;&#20316;&#26989;&#12290;</p>
</dd>
<dt><code>db-logging-resource</code></dt>
<dd>
<p>&#25351;&#23450; JDBC &#36039;&#28304;&#30340; JNDI &#21517;&#31281;&#32102;&#35352;&#37636;&#20316;&#26989;&#20107;&#20214;&#30340;&#36039;&#26009;&#24235;&#12290;&#22914;&#38656;&#26356;&#22810;&#36039;&#35338;&#65292;&#35531;&#21443;&#38321; <a href="http://www.oracle.com/pls/topic/lookup?ctx=E26576_01&id=GSDVG00018"><i>Oracle GlassFish Server Application Development Guide</i> &#20013;&#30340;&#31532; 17 &#31456; <i>Using the Transaction Service</i></a>&#12290;&#27794;&#26377;&#38928;&#35373;&#20540;&#12290;</p>
</dd>
<dt><code>xa-servername</code></dt>
<dd>
<p>&#25351;&#23450;&#20027;&#27231;&#21517;&#31281;&#65292;&#20197;&#20415;&#20316;&#26989;&#20107;&#20214;&#26381;&#21209;&#29992;&#26044;&#35672;&#21029;&#27491;&#30001;&#24050;&#23433;&#35037; GlassFish Server &#31649;&#29702;&#30340;&#20316;&#26989;&#20107;&#20214;&#12290;&#26377;&#26178;&#20505;&#27492;&#21151;&#33021;&#21487;&#24478;&#26085;&#35468;&#27284; (&#24314;&#31435;&#26044;&#22519;&#34892; GlassFish Server &#30340;&#20854;&#20182;&#20027;&#27231;&#19978;) &#24489;&#21407;&#20316;&#26989;&#20107;&#20214;&#12290;</p>
</dd>
</dl>





<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
