<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-configtransservice" name="task-configtransservice"></a></p>

<h4><a id="sthref2" name="sthref2"></a>&#32068;&#24907;&#20316;&#26989;&#20107;&#20214;&#26381;&#21209;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#28687;&#35261;&#27193;&#29376;&#32080;&#27083;&#20013;&#65292;&#23637;&#38283;&#12300;&#32068;&#24907;&#12301;&#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#36984;&#21462;&#35201;&#32068;&#24907;&#30340;&#22519;&#34892;&#34389;&#29702;&#65306;</p>
<ul>
<li>
<p>&#33509;&#35201;&#32068;&#24907;&#29305;&#23450;&#30340;&#22519;&#34892;&#34389;&#29702;&#65292;&#35531;&#36984;&#21462;&#35442;&#22519;&#34892;&#34389;&#29702;&#30340;&#32068;&#24907;&#31680;&#40670;&#12290;&#20363;&#22914;&#65292;&#23565;&#26044;&#38928;&#35373;&#22519;&#34892;&#34389;&#29702; <code>server</code>&#65292;&#35531;&#36984;&#21462;&#12300;<code>server-config</code>&#12301;&#31680;&#40670;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#32068;&#24907;&#25152;&#26377;&#22519;&#34892;&#34389;&#29702;&#30340;&#38928;&#35373;&#35373;&#23450;&#65292;&#35531;&#36984;&#21462;&#12300;<code>default-config</code>&#12301;&#31680;&#40670;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#36984;&#21462;&#12300;&#20316;&#26989;&#20107;&#20214;&#26381;&#21209;&#12301;&#31680;&#40670;&#12290;</p>
<p>&#12300;&#20316;&#26989;&#20107;&#20214;&#26381;&#21209;&#12301;&#38913;&#38754;&#26371;&#38568;&#21363;&#38283;&#21855;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#20316;&#26989;&#20107;&#20214;&#26381;&#21209;&#12301;&#38913;&#38754;&#19978;&#65292;&#36984;&#21462;&#12300;&#21855;&#29992;&#22312;&#37325;&#26032;&#21855;&#21205;&#26178;&#12301;&#26680;&#21462;&#26041;&#22602;&#65292;&#20197;&#22312;&#20282;&#26381;&#22120;&#37325;&#26032;&#21855;&#21205;&#26178;&#65292;&#24489;&#21407;&#26410;&#23436;&#25104;&#30340;&#20316;&#26989;&#20107;&#20214;&#12290;</p>
<p>&#27492;&#36984;&#38917;&#38928;&#35373;&#28858;&#20572;&#29992;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#20316;&#26989;&#20107;&#20214;&#36926;&#26178;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#20282;&#26381;&#22120;&#22312;&#20498;&#22238;&#26410;&#23436;&#25104;&#30340;&#20316;&#26989;&#20107;&#20214;&#21069;&#31561;&#20505;&#30340;&#31186;&#25976;&#12290;</p>
<p>0 &#20540;&#26371;&#20572;&#29992;&#20316;&#26989;&#20107;&#20214;&#36926;&#26178;&#12290;&#38928;&#35373;&#20540;&#28858; 0&#65292;&#34920;&#31034;&#20282;&#26381;&#22120;&#26371;&#19968;&#30452;&#31561;&#24453;&#20316;&#26989;&#20107;&#20214;&#23436;&#25104;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#37325;&#35430;&#36926;&#26178;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837; GlassFish Server &#22039;&#35430;&#36899;&#32218;&#33267;&#28961;&#27861;&#36899;&#32218;&#20043;&#20282;&#26381;&#22120;&#30340;&#31186;&#25976;&#12290;</p>
<p>&#38928;&#35373;&#20540;&#28858; 600 (10 &#20998;&#37912;)&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#20316;&#26989;&#20107;&#20214;&#26085;&#35468;&#20301;&#32622;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#20445;&#23384;&#20282;&#26381;&#22120;&#26085;&#35468;&#30340;&#30446;&#37636;&#12290;</p>
<p>&#20316;&#26989;&#20107;&#20214;&#26085;&#35468;&#26371;&#20445;&#23384;&#22312;&#27492;&#27396;&#20301;&#25351;&#23450;&#20043;&#30446;&#37636;&#30340; <code>tx</code> &#23376;&#30446;&#37636;&#20013;&#12290;&#38928;&#35373;&#20540;&#28858;&#12300;&#32178;&#22495;&#23660;&#24615;&#12301;&#38913;&#38754;&#19978;&#30340;&#12300;&#26085;&#35468;&#26681;&#30446;&#37636;&#12301;&#27396;&#20301;&#25152;&#25351;&#23450;&#30340;&#30446;&#37636;&#65292;&#38913;&#38754;&#20301;&#26044;&#12300;GlassFish Server&#12301;&#31680;&#40670;&#30340;&#12300;&#36914;&#38542;&#12301;&#27161;&#31844;&#20043;&#19979;&#12290;</p>
</li>
<li>
<p>&#24478;&#12300;&#21855;&#30332;&#24335;&#27770;&#31574;&#12301;&#19979;&#25289;&#24335;&#28165;&#21934;&#20013;&#65292;&#36984;&#21462;&#30001;&#26044;&#28961;&#27861;&#36899;&#32218;&#20854;&#20182;&#21443;&#21152;&#32773;&#32780;&#28961;&#27861;&#30906;&#23450;&#20998;&#25955;&#24335;&#20316;&#26989;&#20107;&#20214;&#30340;&#32080;&#26524;&#26178;&#65292;&#25152;&#35201;&#36981;&#24490;&#30340;&#31574;&#30053;&#12290;</p>
<p>&#38500;&#38750;&#26377;&#24456;&#22909;&#30340;&#29702;&#30001;&#36984;&#21462;&#12300;&#30906;&#35469;&#12301;&#65292;&#21542;&#21063;&#35531;&#23559;&#12300;&#21855;&#30332;&#24335;&#27770;&#31574;&#12301;&#20445;&#30041;&#35373;&#23450;&#28858;&#12300;&#20498;&#22238;&#12301;(&#38928;&#35373;&#20540;)&#12290;&#30906;&#35469;&#19981;&#30906;&#35469;&#30340;&#20316;&#26989;&#20107;&#20214;&#26371;&#30772;&#22750;&#25033;&#29992;&#31243;&#24335;&#30340;&#36039;&#26009;&#23436;&#25972;&#24615;&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#38364;&#37749;&#40670;&#38291;&#38548;&#12301;&#27396;&#20301;&#20013;&#65292;&#37749;&#20837;&#38364;&#37749;&#40670;&#20316;&#26989;&#20043;&#38291;&#30340;&#20316;&#26989;&#20107;&#20214;&#25976;&#30446;&#12290;</p>
<p>&#38364;&#37749;&#40670;&#20316;&#26989;&#26371;&#22739;&#32302;&#20316;&#26989;&#20107;&#20214;&#26085;&#35468;&#27284;&#12290;&#38928;&#35373;&#20540;&#28858; 65,536&#12290;</p>
</li>
<li>
<p>&#22312;&#12300;&#20854;&#20182;&#29305;&#24615;&#12301;&#21312;&#27573;&#20013;&#65292;&#25351;&#23450;&#20854;&#20182;&#29305;&#24615;&#12290;</p>
<p>&#22914;&#38656;&#21487;&#29992;&#29305;&#24615;&#30340;&#25551;&#36848;&#65292;&#35531;&#21443;&#38321;<a href="ref-transactionsvcproperties.html">&#20316;&#26989;&#20107;&#20214;&#26381;&#21209;&#29305;&#23450;&#30340;&#29305;&#24615;</a>&#12290;</p>
<ul>
<li>
<p>&#33509;&#35201;&#22686;&#21152;&#29305;&#24615;&#65292;&#35531;&#25353;&#19968;&#19979;&#12300;&#22686;&#21152;&#29305;&#24615;&#12301;&#25353;&#37397;&#12290;&#22312;&#20986;&#29694;&#30340;&#31354;&#30333;&#21015;&#20013;&#65292;&#26044;&#12300;&#21517;&#31281;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#21517;&#31281;&#65292;&#28982;&#24460;&#22312;&#12300;&#20540;&#12301;&#27396;&#20301;&#20013;&#37749;&#20837;&#29305;&#24615;&#20540;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#20462;&#25913;&#29305;&#24615;&#65292;&#35531;&#32232;&#36655;&#29305;&#24615;&#30340;&#12300;&#20540;&#12301;&#27396;&#20301;&#12290;</p>
</li>
<li>
<p>&#33509;&#35201;&#21034;&#38500;&#29305;&#24615;&#65292;&#35531;&#36984;&#21462;&#24744;&#35201;&#21034;&#38500;&#20043;&#29305;&#24615;&#12300;&#21517;&#31281;&#12301;&#27396;&#20301;&#24038;&#20596;&#30340;&#26680;&#21462;&#26041;&#22602;&#65292;&#28982;&#24460;&#25353;&#19968;&#19979;&#12300;&#21034;&#38500;&#29305;&#24615;&#12301;&#25353;&#37397;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#25353;&#19968;&#19979;&#12300;&#20786;&#23384;&#12301;&#12290;</p>

<hr>
<p><b>&#25552;&#31034;:</b></p>
&#33509;&#35201;&#22238;&#21040;&#38928;&#35373;&#35373;&#23450;&#65292;&#35531;&#25353;&#19968;&#19979;&#12300;&#36617;&#20837;&#38928;&#35373;&#20540;&#12301;&#25353;&#37397;&#65292;&#28982;&#24460;&#25353;&#19968;&#19979;&#12300;&#20786;&#23384;&#12301;&#12290;<br />
<hr>

</li>
<li>
<p>&#37325;&#26032;&#21855;&#21205; GlassFish Server&#12290;</p>
</li>
</ol>
<a id="sthref3" name="sthref3"></a>
<h5>&#21478;&#35531;&#21443;&#38321;</h5>
<ul>
<li>
<p><a href="task-configtransrecovery.html">&#32068;&#24907; GlassFish Server &#22914;&#20309;&#24489;&#21407;&#20316;&#26989;&#20107;&#20214;</a></p>
</li>
<li>
<p><a href="task-settranstimeout.html">&#35373;&#23450;&#20316;&#26989;&#20107;&#20214;&#36926;&#26178;&#20540;</a></p>
</li>
<li>
<p><a href="task-settranslog.html">&#35373;&#23450;&#20316;&#26989;&#20107;&#20214;&#26085;&#35468;&#20301;&#32622;</a></p>
</li>
<li>
<p><a href="task-setkeyptinterval.html">&#35373;&#23450;&#38364;&#37749;&#40670;&#38291;&#38548;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
