<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <link rel="stylesheet" href="adminhelp.css" type="text/css">
  <title>저작권</title>
</head>
<body>
<!-- help content --><a name="wp1022127"> </a>
<h2 class="pHeading2">저작권
</h2>
<a name="wp1022131"> </a>
<p class="pParagraph">Sun Microsystems, Inc.<br>
4150 Network Circle<br>
Santa Clara, CA 95054 U.S.A.
</p>
<a name="wp1022132"> </a>
<p class="pParagraph">&nbsp;
</p>
<a name="wp1022134"> </a>
<p class="pParagraph">Copyright &copy; 2006 Sun Microsystems, Inc. All rights reserved.
</p>
<a name="wp1022135"> </a>
<p class="pParagraph">Sun Microsystems, Inc.는 본 설명서에 설명된 제품에 포함된 기술 관련 지적 재산권을 소유합니다. 특히, 이 지적 재산권에는 http://www.sun.com/patents에 기재된 하나 이상의 미국 특허권이 포함될 수 있으며 미국 및 다른 국가에서 하나 이상의 추가 특허권 또는 출원 중인 특허권이 제한 없이 포함될 수 있습니다. </p>
<a name="wp1022136"> </a>
<p class="pParagraph">게시되지 않음 - 미국 저작권법에 따라 모든 권리가 보호됩니다.  </p>
<a name="wp1022137"> </a>
<p class="pParagraph">이 제품에는 SUN MICROSYSTEMS, INC.의 기밀 정보 및 무역 비밀이 포함되어 있습니다. SUN MICROSYSTEMS, INC.의 명시된 사전 서면 승인 없이는 해당 기밀의 사용, 공개 또는 복제가 금지됩니다. </p>
<a name="wp1022138"> </a>
<p class="pParagraph">미국 정부의 권리 - 상용 소프트웨어. 정부 사용자는 Sun Microsystems, Inc. 표준 사용권 계약과 해당 FAR 규정 및 보충 규정을 준수해야 합니다. </p>
<a name="wp1022139"> </a>
<p class="pParagraph">사용자는 사용권 조항을 준수해야 합니다. </p>
<a name="wp1022140"> </a>
<p class="pParagraph">이 배포에는 타사에서 개발한 자료가 포함되어 있을 수 있습니다. </p>
<a name="wp1022141"> </a>
<p class="pParagraph">Sun, Sun Microsystems, Sun 로고, Java, Jini 및 Java Coffee Cup 로고는 미국 및 다른 국가에서 Sun Microsystems, Inc.의 상표 또는 등록 상표입니다. </p>
<a name="wp1022142"> </a>
<p class="pParagraph">UNIX는 미국 및 다른 국가에서 X/Open Company, Ltd.를 통해 독점적으로 사용권이 부여되는 등록 상표입니다.
</p>
<a name="wp1022143"> </a>
<p class="pParagraph">이 제품은 미국 수출 관리법이 적용되며 다른 국가의 수출 또는 수입 관리법의 적용을 받을 수 있습니다. 이 제품과 정보를 직간접적으로 핵무기, 미사일 또는 생화학 무기에 사용하거나 핵과 관련하여 해상에서 사용하는 것은 엄격하게 금지합니다. 미국 수출 금지 국가 또는 금지된 개인과 특별히 지정된 국민 목록을 포함하여 미국 수출 금지 목록에 지정된 대상으로의 수출이나 재수출은 엄격하게 금지됩니다.
</p>
<a name="wp1022144"> </a>
<p class="pParagraph">_____________________________________
</p>
<a name="wp1022145"> </a>
<p class="pParagraph">Copyright &copy; 2006 Sun Microsystems, Inc., 4150 Network Circle, Santa Clara, California 95054, Etats-Unis. Tous droits r&eacute;serv&eacute;s.
</p>
<a name="wp1022146"> </a>
<p class="pParagraph">Sun Microsystems, Inc. d&eacute;tient les droits de propri&eacute;t&eacute; intellectuels relatifs &agrave; la technologie incorpor&eacute;e dans le produit qui est d&eacute;crit dans ce document. En particulier, et ce sans limitation, ces droits de propri&eacute;t&eacute; intellectuelle peuvent inclure un ou plus des brevets am&eacute;ricains list&eacute;s &agrave; l&rsquo;adresse http://www.sun.com/patents et un ou les brevets suppl&eacute;mentaires ou les applications de brevet en attente aux Etats - Unis et dans les autres pays. </p>
<a name="wp1022147"> </a>
<p class="pParagraph">Non publie - droits r&eacute;serv&eacute;s selon la l&eacute;gislation des Etats-Unis sur le droit d&rsquo;auteur.
</p>
<a name="wp1022148"> </a>
<p class="pParagraph">CE PRODUIT CONTIENT DES INFORMATIONS CONFIDENTIELLES ET DES SECRETS COMMERCIAUX DE SUN MICROSYSTEMS, INC. SON UTILISATION, SA DIVULGATION ET SA REPRODUCTION SONT INTERDITES SANS L&rsquo;AUTORISATION EXPRESSE, ECRITE ET PREALABLE DE SUN MICROSYSTEMS, INC. </p>
<a name="wp1022149"> </a>
<p class="pParagraph">L&rsquo;utilisation est soumise aux termes de la Licence. </p>
<a name="wp1022150"> </a>
<p class="pParagraph">Cette distribution peut comprendre des composants d&eacute;velopp&eacute;s par des tierces parties. </p>
<a name="wp1022151"> </a>
<p class="pParagraph">Sun, Sun Microsystems, le logo Sun, Java, Jini et le logo Java Coffee Cup sont des marques de fabrique ou des marques d&eacute;pos&eacute;es de Sun Microsystems, Inc. aux Etats-Unis et dans d&rsquo;autres pays.
</p>
<a name="wp1022152"> </a>
<p class="pParagraph">UNIX est une marque d&eacute;pos&eacute;e aux Etats-Unis et dans d&rsquo;autres pays et licenci&eacute;e exlusivement par X/Open Company, Ltd.
</p>
<a name="wp1022153"> </a>
<p class="pParagraph">Ce produit est soumis &agrave; la l&eacute;gislation am&eacute;ricaine en mati&egrave;re de contr&ocirc;le des exportations et peut &ecirc;tre soumis &agrave; la r&egrave;glementation en vigueur dans d&rsquo;autres pays dans le domaine des exportations et importations. Les utilisations, ou utilisateurs finaux, pour des armes nucl&eacute;aires, des missiles, des armes biologiques et chimiques ou du nucl&eacute;aire maritime, directement ou indirectement, sont strictement interdites. Les exportations ou r&eacute;exportations vers les pays sous embargo am&eacute;ricain, ou vers des entit&eacute;s figurant sur les listes d&rsquo;exclusion d&rsquo;exportation am&eacute;ricaines, y compris, mais de mani&egrave;re non exhaustive, la liste de personnes qui font objet d&rsquo;un ordre de ne pas participer, d&rsquo;une fa&ccedil;on directe ou indirecte, aux exportations des produits ou des services qui sont r&eacute;gis par la l&eacute;gislation am&eacute;ricaine en mati&egrave;re de contr&ocirc;le des exportations et la liste de ressortissants sp&eacute;cifiquement d&eacute;sign&eacute;s, sont rigoureusement interdites.
</p>
<a name="wp1022129"> </a>
<p class="pParagraph"></p>
<a name="wp1022128"> </a>
<p class="pParagraph"></p>
<!-- end help content -->
<hr><a href="copyright.html" target="main">법적 고지 사항</a>
</body>
</html>
