<!--   DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS HEADER.

Copyright 2005, 2013 Oracle and/or its affiliates. All rights reserved.

Use is subject to License Terms  -->
<p><a id="task-configtransservice" name="task-configtransservice"></a></p>

<h4><a id="sthref2" name="sthref2"></a>&#37197;&#32622;&#20107;&#21153;&#22788;&#29702;&#26381;&#21153;</h4>
<a name="BEGIN" id="BEGIN"></a>
<ol>
<li>
<p>&#22312;&#23548;&#33322;&#26641;&#20013;&#65292;&#23637;&#24320;&ldquo;&#37197;&#32622;&rdquo;&#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#36873;&#25321;&#35201;&#37197;&#32622;&#30340;&#23454;&#20363;&#65306;</p>
<ul>
<li>
<p>&#35201;&#37197;&#32622;&#29305;&#23450;&#30340;&#23454;&#20363;&#65292;&#35831;&#36873;&#25321;&#35813;&#23454;&#20363;&#30340;&#37197;&#32622;&#33410;&#28857;&#12290;&#20363;&#22914;&#65292;&#23545;&#20110;&#40664;&#35748;&#23454;&#20363; <code>server</code>&#65292;&#35831;&#36873;&#25321; <code>server-config</code> &#33410;&#28857;&#12290;</p>
</li>
<li>
<p>&#35201;&#37197;&#32622;&#25152;&#26377;&#23454;&#20363;&#30340;&#40664;&#35748;&#35774;&#32622;&#65292;&#35831;&#36873;&#25321; <code>default-config</code> &#33410;&#28857;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#36873;&#25321;&ldquo;&#20107;&#21153;&#22788;&#29702;&#26381;&#21153;&rdquo;&#33410;&#28857;&#12290;</p>
<p>&#27492;&#26102;&#23558;&#25171;&#24320;&ldquo;&#20107;&#21153;&#22788;&#29702;&#26381;&#21153;&rdquo;&#39029;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#20107;&#21153;&#22788;&#29702;&#26381;&#21153;&rdquo;&#39029;&#19978;&#65292;&#36873;&#20013;&ldquo;&#21551;&#29992;&#37325;&#26032;&#21551;&#21160;&#26102;&rdquo;&#22797;&#36873;&#26694;&#65292;&#20197;&#20415;&#22312;&#26381;&#21153;&#22120;&#37325;&#26032;&#21551;&#21160;&#26102;&#24674;&#22797;&#26410;&#23436;&#25104;&#30340;&#20107;&#21153;&#22788;&#29702;&#12290;</p>
<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#31105;&#29992;&#27492;&#36873;&#39033;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#20107;&#21153;&#22788;&#29702;&#36229;&#26102;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#22238;&#36864;&#26410;&#23436;&#25104;&#20107;&#21153;&#22788;&#29702;&#20043;&#21069;&#65292;&#26381;&#21153;&#22120;&#31561;&#24453;&#30340;&#31186;&#25968;&#12290;</p>
<p>&#22914;&#26524;&#20540;&#20026; 0&#65292;&#21017;&#31105;&#29992;&#20107;&#21153;&#22788;&#29702;&#36229;&#26102;&#12290;&#40664;&#35748;&#20540;&#20026; 0&#65292;&#34920;&#31034;&#26381;&#21153;&#22120;&#26080;&#38480;&#26399;&#22320;&#31561;&#24453;&#20107;&#21153;&#22788;&#29702;&#23436;&#25104;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#37325;&#35797;&#36229;&#26102;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837; GlassFish Server &#23581;&#35797;&#36830;&#25509;&#21040;&#19981;&#21487;&#35775;&#38382;&#26381;&#21153;&#22120;&#30340;&#31186;&#25968;&#12290;</p>
<p>&#40664;&#35748;&#20540;&#20026; 600 (10 &#20998;&#38047;)&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#20107;&#21153;&#22788;&#29702;&#26085;&#24535;&#20301;&#32622;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#20445;&#23384;&#26381;&#21153;&#22120;&#26085;&#24535;&#30340;&#30446;&#24405;&#12290;</p>
<p>&#20107;&#21153;&#22788;&#29702;&#26085;&#24535;&#20445;&#23384;&#22312;&#27492;&#23383;&#27573;&#25152;&#25351;&#23450;&#30446;&#24405;&#30340; <code>tx</code> &#23376;&#30446;&#24405;&#20013;&#12290;&#40664;&#35748;&#20540;&#20026;&ldquo;&#22495;&#23646;&#24615;&rdquo;&#39029; (&#20301;&#20110;&ldquo;GlassFish Server&rdquo;&#33410;&#28857;&#30340;&ldquo;&#39640;&#32423;&rdquo;&#36873;&#39033;&#21345;&#19979;) &#30340;&ldquo;&#26085;&#24535;&#26681;&rdquo;&#23383;&#27573;&#25351;&#23450;&#30340;&#30446;&#24405;&#12290;</p>
</li>
<li>
<p>&#20174;&ldquo;&#21551;&#21457;&#24335;&#20915;&#31574;&rdquo;&#19979;&#25289;&#21015;&#34920;&#20013;&#65292;&#36873;&#25321;&#22240;&#20854;&#20182;&#21442;&#19982;&#32773;&#19981;&#21487;&#35775;&#38382;&#32780;&#26080;&#27861;&#30830;&#23450;&#20998;&#24067;&#24335;&#20107;&#21153;&#22788;&#29702;&#30340;&#32467;&#26524;&#26102;&#35201;&#36981;&#24490;&#30340;&#31574;&#30053;&#12290;</p>
<p>&#38500;&#38750;&#26377;&#20805;&#20998;&#29702;&#30001;&#38656;&#35201;&#36873;&#25321;&ldquo;&#25552;&#20132;&rdquo;&#65292;&#21542;&#21017;&#35831;&#23558;&ldquo;&#21551;&#21457;&#24335;&#20915;&#31574;&rdquo;&#35774;&#32622;&#20445;&#30041;&#20026;&ldquo;&#22238;&#36864;&rdquo;(&#40664;&#35748;&#20540;)&#12290;&#25552;&#20132;&#19981;&#30830;&#23450;&#30340;&#20107;&#21153;&#22788;&#29702;&#20250;&#30772;&#22351;&#24212;&#29992;&#31243;&#24207;&#30340;&#25968;&#25454;&#23436;&#25972;&#24615;&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#20851;&#38190;&#28857;&#38388;&#38548;&rdquo;&#23383;&#27573;&#20013;&#65292;&#38190;&#20837;&#20851;&#38190;&#28857;&#25805;&#20316;&#20043;&#38388;&#30340;&#20107;&#21153;&#22788;&#29702;&#25968;&#37327;&#12290;</p>
<p>&#20851;&#38190;&#28857;&#25805;&#20316;&#21487;&#20197;&#21387;&#32553;&#20107;&#21153;&#22788;&#29702;&#26085;&#24535;&#25991;&#20214;&#12290;&#40664;&#35748;&#20540;&#20026; 65,536&#12290;</p>
</li>
<li>
<p>&#22312;&ldquo;&#20854;&#20182;&#23646;&#24615;&rdquo;&#37096;&#20998;&#20013;&#65292;&#25351;&#23450;&#20854;&#20182;&#23646;&#24615;&#12290;</p>
<p>&#26377;&#20851;&#21487;&#29992;&#23646;&#24615;&#30340;&#35828;&#26126;&#65292;&#35831;&#21442;&#38405;<a href="ref-transactionsvcproperties.html">&#29305;&#23450;&#20110;&#20107;&#21153;&#22788;&#29702;&#26381;&#21153;&#30340;&#23646;&#24615;</a>&#12290;</p>
<ul>
<li>
<p>&#35201;&#28155;&#21152;&#23646;&#24615;&#65292;&#35831;&#21333;&#20987;&ldquo;&#28155;&#21152;&#23646;&#24615;&rdquo;&#25353;&#38062;&#12290;&#22312;&#26174;&#31034;&#30340;&#31354;&#30333;&#34892;&#20013;&#65292;&#22312;&ldquo;&#21517;&#31216;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#23646;&#24615;&#21517;&#31216;&#65292;&#22312;&ldquo;&#20540;&rdquo;&#23383;&#27573;&#20013;&#38190;&#20837;&#23646;&#24615;&#20540;&#12290;</p>
</li>
<li>
<p>&#35201;&#20462;&#25913;&#23646;&#24615;&#65292;&#35831;&#32534;&#36753;&#35813;&#23646;&#24615;&#30340;&ldquo;&#20540;&rdquo;&#23383;&#27573;&#12290;</p>
</li>
<li>
<p>&#35201;&#21024;&#38500;&#23646;&#24615;&#65292;&#35831;&#36873;&#20013;&#20301;&#20110;&#24744;&#35201;&#21024;&#38500;&#23646;&#24615;&#30340;&ldquo;&#21517;&#31216;&rdquo;&#23383;&#27573;&#24038;&#36793;&#30340;&#22797;&#36873;&#26694;&#65292;&#28982;&#21518;&#21333;&#20987;&ldquo;&#21024;&#38500;&#23646;&#24615;&rdquo;&#25353;&#38062;&#12290;</p>
</li>
</ul>
</li>
<li>
<p>&#21333;&#20987;&ldquo;&#20445;&#23384;&rdquo;&#12290;</p>

<hr>
<p><b>&#25552;&#31034;:</b></p>
&#35201;&#36820;&#22238;&#21040;&#40664;&#35748;&#35774;&#32622;&#65292;&#35831;&#21333;&#20987;&ldquo;&#21152;&#36733;&#40664;&#35748;&#20540;&rdquo;&#25353;&#38062;&#65292;&#28982;&#21518;&#21333;&#20987;&ldquo;&#20445;&#23384;&rdquo;&#12290;<br />
<hr>

</li>
<li>
<p>&#37325;&#26032;&#21551;&#21160; GlassFish Server&#12290;</p>
</li>
</ol>
<a id="sthref3" name="sthref3"></a>
<h5>&#21478;&#35831;&#21442;&#38405;</h5>
<ul>
<li>
<p><a href="task-configtransrecovery.html">&#37197;&#32622; GlassFish Server &#24674;&#22797;&#20107;&#21153;&#22788;&#29702;&#30340;&#26041;&#24335;</a></p>
</li>
<li>
<p><a href="task-settranstimeout.html">&#35774;&#32622;&#20107;&#21153;&#22788;&#29702;&#36229;&#26102;&#20540;</a></p>
</li>
<li>
<p><a href="task-settranslog.html">&#35774;&#32622;&#20107;&#21153;&#22788;&#29702;&#26085;&#24535;&#30340;&#20301;&#32622;</a></p>
</li>
<li>
<p><a href="task-setkeyptinterval.html">&#35774;&#32622;&#20851;&#38190;&#28857;&#38388;&#38548;</a></p>
</li>
</ul>


<small>Copyright &#169; 2005, 2013, Oracle and/or its affiliates. All rights reserved. <a href="docinfo.html">Legal Notices</a></small>
